{"comment_0": "\nSuch a fantastic song, one of my favorites.  A Brian May composition which is a bit of a departure from the power progressive style of Queen.  It's a science fiction tale which brilliantly employs a part of Einsteins theory of Relativity, time dilation.  Meaning as speed increases time expands; a week becomes a month, a month becomes a year, etc.   It tells a story of a group of space voyagers (the volunteers), who in the year of 39 (could be 2239, 2339, who knows) depart a dying Earth in a space ship to explore a distant world for habitability. Presumably a government project, essentially scouting the planet for colonization.  If they were to travel at speeds approaching the speed of light then the effects of time dilation would dramatically reduce the rate at which they age.  A year back on Earth could mean only a day to them physiologically.  If you follow the words you can piece together it took the volunteers 100 years to complete the mission, returning to Earth exactly one century later (in the year of 39 came a ship in from the blue).  It's the year of 39.... in the next century. \n\r\nUpon their return they discover the world they left no longer exists.  They have been gone a century yet the effects of time dilation has aged them only a year. Their families are long dead, the Earth has deteriorated to a gray planet.  They came back to report the world they explored is vibrant and perfect for humanity.  But their good news is quickly squashed by the realization that they are now refugees in time.  \n\r\nThe song seems to have a dual narrative; a third person perspective telling the tale of the voyage and their return underlying a first person conversation.  \"Can't you hear me calling you, though you're many years away?\" is an imaginary conversation between one of the volunteers and presumably his wife, speaking to her through space and time.  \"write your letters in the sand\", to me, seems to suggest leaving him a message etched in the earth he will see when he returns, perhaps a tree or stone.  \"for the day I take your hand in the land that our grandchildren knew.\" is simply a longing to return to the time and place with his loved ones.  A land he knows his grandchildren will inhabit in his absence.  \n\r\nI think the line \"your mother's eyes from your eyes cry to me.\"  suggest the voyager has met one of his children.  After so long it has to be assumed his child is now a centenarian.  And he is still a young man.  \n\r\n\"For my life's still ahead, pity me.\"  means he is now alone and will live out the rest of his life displaced in time with no one.   \n\r\nLyrically the song does not give you all the information you would need to assemble the events or meaning of those events.  It only gives you enough to put together a long voyage and it's effects physically and psychologically.  What I love is the way it's intentionally framed as a sea voyage to a new land, not as a journey into space. Unless you knew \"though I'm older but a year\" meant a very specific phenomena of intergalactic travel, you would be confused by that.  But that is precisely what it is, and Mays knew enough about astrophysics to use it as the basis for a sad tale of loss.  \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI agree with brian May - its about space travel.\n\r\nhe should know - he wrote it.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWithout doubt the lyrics deal with Special relativity and time dilation.  Curious?  Not given the source.  May has a Phd in Astrophyics and is currently the Chancelor of a 15,000 student University in London.  Clever fellow indeed.\n\r\nF. Prefect\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis is a beautiful awesome song\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nDefinately about time travel\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ni love this song too! i especially love the \"Ne'er looked back, never feared, never cried.\" and \"All my life Still ahead Pity Me.\" just the way brian may sings it is fantastic.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI've heard about the star travel meaning for years;  never thought to look at it from the angle of the Volunteers being soldiers...  very cool interp.   Of course, the \"milky seas\" is very descriptive of the stars in the sky - heading deeper into the Galactic Center.  \n\r\nThe lines about writing letters in the sand, to mean man's impermanence, always gave me chills.  \n\r\n\"Your mother's eyes in your eyes cry to me,\" could mean that's confronting his descendants, or else he's returned to find his wife dead, and he's talking to his daughter.  \n\r\nI also always loved the line, \"Don't you hear my call though you're many years away.\"  As if the space between them is a span of years, not miles.  The location is the technical same, but time has pulled his wife away.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthis is a v good song :) I love the harmonies in the chorus\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nYeah, I agree with Alieno too...but I don't think it's just one '39, I think that it must be two '39s. \"In the year of '39 assembled here the Volunteers\" This is the year when they left, possibly in 2039, probably not 1939 considering they didn't have rockets then. \"In the year of '39 came a ship in from the blue\" Then this is the '39 when they came back, but you don't know how long they were gone for, so they could've been gone for 100 years, then it would be 2139, or maybe 500, or maybe even 1000 so it would be 3039!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nBefore I looked on here I thought is was about 1939 with people being called up as volunteers to fight in WW2, pining for their loved ones and struggling to stay in touch while away fighting. Looks like I wrong though.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis is a GREAT song!  At first you think it's a song about the Pilgrims sailing out for the New World, which the first verse captures the spirit of very nicely.  In the second verse you realize this must have been a Strarship of sorts.  \"For so many years have gone, but I'm older but a year.\"  The Volunteers have returned to Earth after a significant time has passed (whether this is because of cryogenics or Einstein's relativity is beside the point).  Now the singer realizes all he has loved has passed away, and he is still there.\n\r\nI love the line \"In the land that our grandchildren knew.\"\n\n\n\n", "comment_11": "\ni have to say well dun fgor gettin the star ship bit! i was well confuzzled at that point! Yeah wikid song! Wikid Brian- wot a guy!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI definitely feel that this song is about space travel.  He even talks about the volunteers coming back to tell them of a \"World so newly born\" that they can go to because the \"Earth is old and gray\".  The theory of relativity would explain the 100-year trip only aged the volunteers 1 year.  Even in the line \"For many a lonely day sailed across the milky seas\", it sounds like he is about to say \"sailed across the milky way\" because of the day in the line.\n\r\nI didn't know that May was an astronomer, but that even clinches it for me.  An awesome song, nonetheless.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nTo me, \"volunteers\" immediately meant soldiers of some kind. '39 seemed to mean 1939 ie: WW2, but there are so many lyrics that confuse me. \"In the days when lands were few\", and other lines seem to suggest that these events took place hundreds or even thousands of years ago. whatever it means, it is a wonderful song which would be the kind of thing you would sing on your way to battle, in amongts the likes of \"its a long way to tipperary\". Or like a folk song, passing down stories the old fashioned way. Anyhow I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nquote from Brian May:\r\nItâ\u0080\u0099s a science fiction story. Itâ\u0080\u0099s the story about someone who goes away and leaves his family and because of the time dilation effect, when you go away, the people on earth have aged a lot more than he has when he comes home. Heâ\u0080\u0099s aged a year and theyâ\u0080\u0099ve aged 100 years so, instead of coming back to his wife, he comes back to his daughter and he can see his wife in his daughter, a strange story. I think, also, I had in mind a story of Herman Hesse which I think is called â\u0080\u0098The Riverâ\u0080\u0099. A man leaves his hometown and has lots of travels and then comes back and observes his hometown from the other side of the river. He sees it in a different light having been away and experienced all those different things. He sees it in a very illuminating way, cause I felt a little bit like that about My home at the time as well having been away and seen this vastly different world of Rock music. Totally different from the way I was brought up and I had those feelings about Home.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\n39 means the number of the song that Queen have in they CD\n\r\nif you count the songs from Queen 1 to 39 at the night at the opera\r\nyou can count 39 songs!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nOf course that '39 could mean \"1939\", but it could also mean \"2039\", \"2139\" or... well, you get the point, don't you?  ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nYes I agree with Alieno, you don't know what '39 it is.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI love this song, the whole starship theory makes it so much cooler.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\ni hate math. i love brians stories, theyre different!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nPioneers left in a year of 39, out to discover a new world (\"In the days when the lands were few\" and \"And they bring good news of a world so newly born\"). They returned in another year of 39, but because of the theory of relativity, they haven't aged, but everyone else has (\"Oh so many years have gone though I'm older but a year\"). He now sees his love in her daughter's eyes (\"But my love this cannot be...Your mother's eyes from your eyes cry to me\")\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nIt's kind of funny.... a song about space travel set to country music.\n\r\nVery Strange.\n\r\nGreat Song. Not neccesarely my favorite, but fairly good for country.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nOk, i take it back, I LOVE THIS SONG\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nHaha, it hits you the second time eh Scimitar? =) This song is really cool. It seems the whole space thing is a bit too much, but at the same time I somewhat agree that it might be about returning home to see everyone has aged or changed but you remain the same. The songs references to coming to the new world might most likely be referring to the pilgrims when they first left England for the new world (America). The settlers did afterall leave everything behind to start a new life, and most of them were volunteers. So it could easily be referring to that. Within that there is a love story too. Great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song means a lot to me, when i first listened to it, i liked it for the music, didn't pay special attention to the lyrics. Number 39 has went on to become my favorite number, i use it everywhere and in everything i do.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI'm forever reminded of A Series of Unfortunate Events books when I here this for some strange reason. Maybe it's the 'Volunteers' or maybe its just the airs. Anyone else get that? Perhaps I should just go back to my book-filled hovel and keep my strange connections to myself.\n\r\nI'm damn serious though. Lemony Snicket through-and-through.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nIt can be about war or about space travel but if Brian May explains what he wrote it about, I would listen to him above just fans. Also, The Queen Featuring Paul Rodgers concert, if you listen to the Return of the Champions CD, Paul Rodgers says it's about space travel as well. Scimitar said it's weird to have a space song in the style of a folk song but I can imagine it very well. James Taylor sings a folk song about \"Sweet Dreams And Flying Machines\" and it sounds very nice. Also, I can very well imagine space travelers (whether in 2039, 2139...) writing simple folk songs in their lonliness.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nBrian has said in interviews, and in concert, that the song is about a man going into a spaceship to find new worlds, and when he comes back he's only a year older, but the Earth is 100 years older.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nWhen I saw the Queen and Paul Rogers thing (you can see me among the thousands in the DVD... a bazillion points to the one who can guess which one I am), Brian introduced this as \"This is a song about a man who travels in a silver spaceship\".\n\r\nAnd it is 100 years, as opposed to 500 or 1000, not just because Brian says so, but because of the line \"Your mother's eyes in your eyes cry to me\", meaning he meets his daughter instead of his wife, which isn't possible 200 years or more into the future.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nOh yeah, I always sort of overlooked that line. I guess I always thought of it as being a granddaughter or great granddaughter because of the line, \"For the earth is old and gray, little darling we'll away\"...that gave me the impression that it was someone pretty young, maybe in her early twenties. His daughter would have to be at least 99 or 100. So I guess \"little\" was meant in terms of size or something like that rather than age...\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ni believe that whether this song is about interstellar travel, war, or transatlantic exploration, its about journey, and returning from the journey and things being different. and by the way, this totally isnt country music, its folk music.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI dont care what this song is anbout i just rules!\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nWhat I love about this song is that even if it is about space travel (which I had no clue, now it makes a lot more sense) it's done in such a beautiful, poetic way that you would never think to call it corny like many songs with ideas like that are.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nto foreign_hand - \n\r\nin case you ever decide to look at the page, again, i just wanted to let you know I totally associate Lemony Snicket's amazing books with this song. It's the whole dreamy, dreary attidtude, i think.\r\nwell, i guess i just wanted to let you know that you're not the only one, freaky, huh? \r\nkeep on listening to Queen!\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThis song is about space travel and coming home to an older and less healthy planet. I also sense that his family have aged and perished. I love the folk style delivery that is in such contrast to the theme of the song. Another awe inspiring song by Brian May and Queen.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI didn't realise this was about space travel I always thought it was about a young boy going off to war in the year of '39 and after a year of fighting he comes home a lot older inside because of the sights hes seen and things he's done. Don't know that now I know the truth it fits better but it is still an amazing song\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThe Year of '39 is probably the only rock and roll song based on Einstein's Theory of Relativity.  The Volunteers went away and when they came back every one was older but they had only aged a day.  One of the implications of Relativity is that as you approach the speed of light, the actual units of time elongate. What would be a hundred years on earth might only be a few mnutes for someone travelling close to light speed.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nIf you start with Queen's first album and count the songs. The original album's, not the bonus tracks. This is the 39th song.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI think it's cool the way John Deacon played a double bass rather than the electric bass.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nCovered by: Swingin' Utters\r\nAlbum: BYO Split Series Volume II: Swingin' Utters Together With Youth Brigade\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nIt IS about SPACETRAVEL, NOT war.  Brian May explains the meaning/inspiration of the song on the \"Making of Night At The Opera\" DVD\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nSong meanings change over time, and even if the artist tries to explain (and is honest about it! which, Brian May usually worries a lot about what people might think) the song still exists as itself and through the meanings you the listener give to it. However, when Brian is questioned about meanings, he normally replies that it is \"a story about people\". But which story, is the question. A man who travels in a silver starship appears to be the legendary Earendel (whose symbol is that Star Brian used for his solo albums). This is mythically happening way before the Lord of the Rings story, at whose end most of the remaining \"Supernatural People\" depart, because they feel the Earth is old and grey. The person calling out in the song is looking for his true love (for whom he went out in Space in the first place, in order to find her).\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nWhile everybody is entitled to interpret the song however feels best to themselves, I don't understand you people who insist it is not about a man who must suffer the effects of time dilation due to near-light speed travel. The songwriter has explained, that's what it is about. If it means something different to you because of your life experience, fine. But please do not debate the writer's intentions. (Unless you want to add more specific detail to the space travel story, such as the possible connection to Earendel.)\n\r\nFor me, the amazing thing about this song is that, like many stories of science fiction, while there is no possible way we could have experienced anything like what happens in the story, the emotions can resonate very strongly within us. I get melancholy every time I hear this song, just imagining how painful it would be to come home knowing everybody you love has lived and died without you. Even more amazing is that the music inspires those feelings even before you figure out exactly what the song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI think 39 is the year of 1639, when the inmigrants go to America, but i think it has a douvle sense, a metaphoric sense in there, maybe the ones who say its about the space are right too. Whatever, the important is the music, and I love it. Who doesnÂ´t?\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nMercuryCobain:\r\nThe Doppler effect has nothing to do with this.\n\r\n\"many years away\" refers to light years.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nMy Dad's always trying to explain this to me but it's far to complicated. Something about the further you travel from land or earth (one or the other) the slower time passes and so the sailors/ astronauts return and thier relitaves are dead...how positive. It's one of those songs that sends shivers down your spine.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nIt said that the voluteers left and came back in 39...which could mean the same year....Could it possibly refer to when Charles Darwin left for the Galapagos in 1838...\n\r\nSaying \"In the year of 38\" doesn't have that ring....well, that's what it reminds me of!\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nIt's about the war\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nScimitar, I hate you. Die right now please. How the F*ck do you think this is country? You should be shot immediately. Queen never did country. You can shove your copy of A Night at the Opera up yours, because it's not doing you any good.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nLots of mistakes in the lyrics, though.\n\n\r\nLove Bri. He's so cool. His hair is pretty.\r\nhehe :)\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nBrian May was an astrophysicist and this song was written around the Einstienien Theory of Relativity, which I think is about the perception of time being relative to the speed at which you are experiencing it. That's been turned into lost of theories about faster-than-light space travel and how for astronauts or whatever, what they would percieve as only a short peroid of time would actually be a much longer time compared to the normal time eg on earth. Brian like the irony, almost, of putting this into a folk-style song. The premise for this is that through pollution etc humans have been damaging this planet and so \"in the days when lands were few\" \"the volunteers\" set off for a year to find somewhere new they could live. When they return after what has been a year to them, 100 years has passed on earth \"they bring good news of a land so newly born though their hearts so heavily weigh. For the earth is old and grey\". These people then have to live on without all their loved ones \"for my life still ahead pity me\". \n\r\nIt's a clever song, very typical of Brian, and I agree with what he has said that he wished they had released it as a single, then maybe it would have gotten the credit it deserves. then again, mainstream society isn't particularly concerned about lyrics. But yes, that's what this song's about, according to Brian.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nIt's great finding this website. So I'd like to share my \"39\" experiences . Back in the 1970's my friend Scott from  work and I would get stoned and listen to \"records\". One of our favorites was 39. My friend ended up moving to Westwood to go to UCLA and lived right across from the Veterans Cemetary. I'd drive up in my Pinto (yea I Know)  from Orange Countyand we'd get stoned, listen to 39 over and over as well as the rest of Queen.\n\r\nTurning 50 later this year, the song has come back to me...I found the  lyrics here and then pasted and copied and now have the lyrics in the paper carriage of my college \"typewritter\"  sitting next to my computer. And yes when I listen to the song \"Oh so many years have gone though I'm older but a year.....\" means so much more to me now.\n\r\nI wonder  is  Scott \"is many years away \" and if he still hears it calling him?\n\r\nJoe\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nwhoever put the lyrics on here - \n\r\nyou misspelled day in \"And the night followed day\"\n\r\nand this line \"Your mother's eyes in your eyes cry to me\" is actually \"Your mother's eyes FROM your...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI think this song COULD be about space travel, but it seems unlikely to me. \"The ship sailed out to a blue and sunny morn\" and \"sailed across the milky seas\" implies both seas and the fact that they were sailing and not flying. Flied would work in the line.\n\r\nThe only thing else i could think of is that maybe he went into a boat, sailed away, came back, and for some reason or other, he's immortal. I know thats confusing but you guys are the pot callin the kettle black if you give me crap about this; space travel and planetary colonization is about as looney as my idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nIs it just me or are/is the people/person suggesting the theory that this refers to space travel are forgetting the very title of this song? It's titled '39 for a reason! anyways, Freddie Mercury wouldn't want people to be negative over one of their songs, so I'll just suggest that this is a love story between two people who are from different times. I would ellaborate on that, but it's 2:00 am right now, so have fun!\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nhehe, I should learn to listen before I talk back. If I could omit what I just entered, I would.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\ninsanity_defined(p. 2):\n\r\nAre you crazy? (Well, looking at your name...) Do you really think that time passes more slowly for sailors when they're far from land?\n\r\nOr for astronauts when they're far from earth?\n\r\n***Here's the science behind this for all you people*** (and this is some mind blowing crap, if you can really get it):\n\r\nThe speed of any thing in the universe, including people, *through the 4 dimensions, i.e. the three spatial dimensions and the time dimension*, is equal to the speed of light.\n\r\nThus, as one's speed through the three spatial dimensions increases, one's speed through time has to slow -- because one's speed through all 4 dimensions (3 space + 1 time dimension) is always equal to the speed of light.\n\r\nThus, if one was to travel through the 3 spatial dimensions at the speed of light, one's speed through the 1 time dimension is equal to 0. That is, if one is traveling at the speed of light through space, your speed through time is reduced to 0.\n\r\nEven if you do not reach the speed of light, as you accelerate through the 3 spatial dimensions (i.e. MOVE!), your speed through time slows. \n\r\nThus, even if you get up from your computer and walk across the room, your speed through time has slowed down. More time would have passed for a friend who sat still than had passed for you while you walked across the room. The effect is just very tiny for low speeds.\n\r\nIt can, however, be detected by very precise timepieces even for long flights. (I.e., you take two identical, synchronized, very precise timepieces, and you take one on a 24 flight, and the other is left stationary on the ground. The one that is on the ground will show more time has elapsed than the one that you flew with, i.e. while moving time passed more slowly for you!)\n\r\nThis has nothing to do with how far away from earth or from land (were you kidding about that?). Have you ever known a sailor who came back from a boat trip one hundred years older??!?\n\r\nAnyhow, the main point is that your speed through space-time (i.e. the 3 spatial dimensions plus the 1 time dimension) is equal to the speed of light, thus as you increase your speed through the 3 spatial dimensions, your speed through the 1 time dimension must be reduced, because your speed through all 4 dimensions is constant, i.e. it is always equal to the speed of light. (Don't ask me how we know that you speed through time is equal to the speed of light when you're sitting still. This is Einstein stuff, literally, I think.)\n\r\nI do admit that your dad, insanity_defined, may have been onto something with the distance from earth thing -- but not the distance from land. I say this because I have heard that further from earth, where gravity is weaker, time passes slower or faster. (It's got to be slower, right? I think so.) I think this effect (the gravity/distance from earth effect) is too weak to ever cause the kinds of differences in the experience of time that are cited in the song, though, so this clearly isn't the explanation.\n\r\nBut the effect the song is clearly speaking about is the one that occurs when you travel very fast. \n\r\nAnd, on a separate note, **all of you who are pretending that the song isn't about space travel are silly**. If you believe that May said that it's about space travel, how can you say otherwise? (If you don't believe that he said that, that's a different matter. But no one seems to be saying that. You seem to be claiming that the meaning of the song, as stated by the author, is somehow not the meaning of the song.) \n\r\nFor God's sake -- a songmeaning(s.net) is what the author says the song means!!! Sure, you can have your personal meanings. But don't come on here saying \"it seems unlikely this is about space travel.\" It *is* about space travel. That's what the author said! (If you contest that he said that, fine, but otherwise there's nothing to say other than that you're silly!)\n\r\nIf you want to offer your personal meaning, call that \"your *personal* meaning\", and if you want to offer an explanation you've heard from someone other than the songwriter, call it a \"potential meaning\" or \"meaning you've heard\"  -- as separate from \"*the* meaning\", which refers to the \"the meaning intended by the author, as reliably documented\".\n\r\n\"*The* meaning\" is what the author says it is. And the author says it's about space travel.\n\r\nSo, now we've put that to rest, and you've all got a science lesson. ;)\n\r\nAnd this is a very sweet, very atmospheric song which I'd never really given such a listen to. Very cool. Doesn't the background high pitched voices, like the ones it starts with, evoke space travel? It sounds 50's sci-fi-ish to me...\n\r\nVery beautiful, and the only really non-corny, truly sci-fi song I can think of. (Space Oddity isn't really very sci-fi, more like sci.) Really showcases Queen's ability to arrange songs in a variety of idioms, and beautifully produce them.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI know this song for many years, and I love it ... It is about (space) travel, as May says so.\r\nBut Nobody seems to comment on the parallels from the Bible that it is in a sense almost literally taken from the Biblical stories.. like  after Noahs apocalyptic quest to find new (dry) land, 40 years with Abraham, and the promised land. how about that!\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI know this song for many years, and I love it ... It is about (space) travel, as May says so.\r\nBut Nobody seems to comment on the parallels from the Bible that it is in a sense almost literally taken from the Biblical stories.. like  after Noahs apocalyptic quest to find new (dry) land, 40 years with Abraham, and the promised land. how about that!\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis song states to me that a spaceship was sent out to discover new lands but when it came back the volenteers fell one year older but they are acctaully 100 years older.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nThe Milky seas=the Milky way\n\r\nThis song is about going into space really fast and going on a mission for a year but they come back and it's 100 years and everyone he knew is gone.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nThis song is so sad.  Imagine everyone you know now died.  You still have your entire life ahead of you.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nI have a DVD on the making of \"A Night at the Opera\".\r\nBrina said it was about an astronaut who goes to a different planet, and a year passes on that planet, and he's only gotten a year older, while 100 years have passed on earth, and all his loved ones are gone.\r\nI love how Brian sings this, makes me cry. :')\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI think it is about a space travel expedition. The astronaut (and 19 other volnteers) leave in a rocket in the year '39, as in 2039, or 2139. and then come back and everyone he loves is gone, and he has to face the rest of his life alone. Which is kind of wierd considering it's a very upbeat song and has such sad lyrics.\n\r\n\"All your letters in the sand cannot heal me like your hand\r\nFor my life still ahead, pity me\"\n\r\nit is epscially obvious here.. letters in the sand representing how nothing lasts over time and will evntually be blown away. His loved one is long gone, and the astronaut's life is still ahead of him.\n\n\r\n\"For so many years have gone, though I'm older but a year\r\nYour mother's eyes, from your eyes cry to me\"\n\r\nThis is the part that confuses me though. I had heard that it was his daughter he comes back to see after returning, but that makes no sense, since he returns in '39, which would be at least a hundred years later, meaning his daughter would likely not be alive either, which makes me believe he returns to see his granddaughter.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nWhen I first heard this (or at least the first verse), I too thought of soldiers going off to war.  The 'So many years have gone....' line was confusing me though, until I heard Brian's explanation of space travel. It makes perfect sense now.\r\nThis is my most favorite queen song, and I've heard them all (literally).  Roger's high notes, particularly at the beginning, are unparalleled.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nMy physics teacher was talking about this song the other day hahah, according to him it's about time space dilation (when you move so fast time moves slower for you than on earth); basically the volunteers looking for a \"new land\" went away for so many years, but they didn't know it since they were aging so much slower. They come back to find the world completely changed from when they knew it\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nthis is a bloody good song\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\n\"In the year of '39 assembled here the Volunteers\r\nIn the days when lands were few\r\nHere the ship sailed out into the blue and sunny morn\r\nSweetest sight ever seen\"\n\r\nIn the year 1939 a group of people during the war volunteered for a space expadition on the first light speed space ship, this space ship took off into the sky and people were amazed.\n\n\r\n\"And the night followed day\r\nAnd the storytellers day\r\nThat the score brave souls inside\r\nFor many a lonely day sailed across the milky seas\r\nNe'er looked back, never feared, never cried\"\n\r\nThe volunteers got deeper into space travelling at the speed of light and were travelling for a long time but never regretted what they were doing due to them missing the war.\n\r\nDon't you hear my call though you're many years away?\r\nDon't you hear me calling you?\r\nWrite your letters in the sand\r\nFor the day I take your hand\r\nIn the land that our grandchildren knew\n\r\nthe volunteers are still thinking of their loved ones even though they are so many lightyears away from them and cannot wait to get back with their loved ones to see their family grow.\n\n\r\nIn the year of '39 came a ship in from the blue\r\nThe Volunteers came home that day\r\nAnd they bring good news of a world so newly born\r\nOh, their hearts so heavily weigh\n\r\ndue to the volunteers travelling at the speed of light for a year time dialation had ocurred and for what they only thought that were travelling for a year, the earth had grown older by 100 years (this is actually physically possible, but you have to be travelling at the speed of light for a long period of time). so the volunteers had came back in the year 2039 having news of new worlds they had discovered in thier journey only to find that their loved ones are all dead and that the world is 100 years older than it actually was when they left, evnen though only travelling for a year in their time.\n\r\nFor the earth is old and gray, little darling we'll away\r\nBut my love this cannot be\r\nFor so many years have gone, though I'm older but a year\r\nYour mother's eyes, from your eyes cry to me\n\r\nthe earth is 100 years older than it was when they left but they have only aged a year.\n\r\nDon't you hear my call though you're many years away?\r\nDon't you hear me calling you?\r\nAll your letters in the sand cannot heal me like your hand\r\nFor my life still ahead, pity me \n\r\nthey are still thinking of their loved ones even though they know they will never meet again and nothing will stop their mourning but to see them once again. for the rest of their life they will be mourning.\n\n\n\r\nPretty much makes sense Brian writing a song like this due to being a doctor of astronomy\n\n\n", "comment_68": "\nI AGREE WIV QUADRODUCK, A FEW OF U MYSELF INCLUDED HAVE HEARD BRIAN MAY SAY FROM HIS OWN MOUTH THAT ITS ABOUT SPACE VOLUNTEERS ON A VOYAGE FOR NEW WORLDS (LANDS). AND SO THER WE HAVE IT. IM SURE HE KNOWS WHAT HIS OWN SONG IS ABOUT. IF BOFFY B HAS HERD CORRECT THEN I STAND CORRECTED ON THE LINE \"YOUR MOTHERS EYED FROM UR EYES CRY 2 ME\" I ALWAYS TOOK THAT MEANING HIS WIFE HAS GROWN SO MANY YEARS OLDER IN COMPARISON TO HIMSELF (OR AT LEAST IN COMPARISON TO HOW HE FEELS & THE LAST TIME HE SAW HER) THAT SHE REMINDS HIM OF HER MOTHER, SO MUCH SO ITS LIKE LOOKING INTO HER EYES INSTEAD OF HER OWN\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nYes Brian has stated that it was written about space travel and in turn time travel related to the trip.\r\nWhy the year 39'? If you count the songs from Queens first album on, it falls as the 39th song. Very cleaver! that Brian May...\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI always thought this song was about sailors on ships in the Age of Exploration (like when all of those Europeans were discovering new continents and stuff). Perhaps the singer is back home but his fiancÃ\u0083Â© was on the boat or something, and they miss each other. (The reason I wrote \"fiancÃ\u0083Â©\" is because he says \"for the day I take your hand\" as in marriage.) He admires how brave she and the others are on the ships and he's excited to learn that there is \"a world so newly born\", like a new discovery of a different place. However she is changed from her experiences (\"their hearts so heavily weighed\"), and they get married soon after anyway, remembering that they missed each other more than anything, and she decides she does want to marry him.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI, as a kid hearing my brothers Queen songs I grew fond of the story of sailors sailing away to the new world. Its only as I got a little older that it dawned on me that its about space travel at close to the speed of light.\nBut what of the line 'your mothers eyes, from your eyes, cry to me'â\u0080¦.\nis not a woman's pregnancy 39 weeks long?\nor perhaps I am reading too much into it lol\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nAncient musicians return to Earth in the future sadly to find their song still stinks. Has strange relativistic properties though, 3 minutes listening to it seems like an eternity.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nOf COURSE it's about spacetime travel! Brian May is an astrophysicist. Sheesh, I figured that out the very first time I heard it (on vinyl - I'm 57 years old!) \t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nJust watched Nolan's \"Interstellar\" made me think about this song\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nBrian May must have loved the movie Interstellar when it came out this year. Matthew McConoughey's character is \"older but a year\" and when he returns from space travel his daughter is a centennarian. \r\nThen in the movie there is the 5th dimension, where his character manifests as her \"spirit\" from the other side of the bookshelf trying to communicate with his daughter through the watch.\n\r\n\"You've seen that time is represented here as a physical dimension.\"\r\n\"Murph!\"\r\n\"Don't you hear me calling you\r\nWrite your letters in the sand.\"\r\nActually the watch that they communicated through was actually \"in the sand\" (dust) during the snowstorm.\n\r\nAs an artist and as an astronomy aficionado, after watching the movie I believe Brian May must've picked up his 12-string guitar ...\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nPlenty of people have explained that the literal meaning of this is a story of space travel, so I won't repeat that.  However people's other associations are still relevant.  The song is written in the style of an older folksong, and (quite deliberately I think) if you don't listen carefully/don't understand about relativity it sounds like a song about earlier voyages.  While to me the reference has always been to earlier voyages of exploration, the experience of people going to war would also work.  It draws parallels between the experience of space travellers and those earlier voyagers: going into the unknown, leaving behind loved ones, perhaps for many years, being out of contact, coming back to find life has moved on and things have changed, eg the love of your life may have married someone else.  So the song is not just a literal story of space travel, but also about feelings experienced by voyagers past and future.\n\nThe use of a folksy style also underlines the time that passes in the song.  By the time the space travellers return the day they set out is ancient history: a brave tail to be told in an old song.  The rousing tale of their daring voyage is contrasted with the reality of their loss when they return.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI know this is isn't the true meaning of the lyrics, but hum it to myself while doing genealogy research. I can hear my ancestors calling me.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nLeave it to a guy who was studying to get his doctorate in astrophysics (and has since got it) to write a folk song about Einstein's Theory of Special Relativity and space travel. A beautiful song that was a welcome break from the prog rock and ornate (sometime kitchy) music of the rest of A Night at the Opera.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nI think the starship comment is a bit wacky. the song must be in part about going away, perhaps off to war (1939), or anywhere ... doubtful he was referring to a spaceship. May is an astronomer but, I still don't agree with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nThis is one of those songs that can have more than one meaning (like they're rare)... it could be about space travel, or it could be about WWII. I can understand the WWII meaning better though, even though chances are it may be a \"red herring.\"\n\r\nFor instance: For so many years have gone and I'm older but a year is apparently about the Doppler effect, but could be taken as someone saying that a loved one taken to the war has \"aged\" (matured) much quicker than they have.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nI really believe that this song is about going to war, coming back years later, and being exposed to what he has missed.  The world has changed, and it's not the same place he'd left.\n\r\nThe \"volunteers\" are the soldiers.  \n\r\nI've never thought about the Space Travel interpretation..that's pretty interesting actually.  And it's kind of convincing, with the \"earth is old and grey\" line.\n\r\nAll in all, beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nThese are pretty opaque lyrics & have thought about them since I first heard the song in 1976. I don't think its about space travel or relativity; May, IMO, is using that to illustrate his point.\n\r\nThis is about a long journey that returns to its point of origin many years later. I see it as a conversation between a child and an adult (parent?) who wonders why he cannot seem to make the adult understand (don't you hear my call though your many years away?) After taking the arduous journey, the child, now an adult, finds himself in the same conversation, but now on the other side and still unable to bridge the gap of years.\n\r\nThe journey is the jouney of life. I think he uses \"lands\" as a metaphor for knowledge & experience. And while he certainly points out man's impermanence, there are still universal things such as the inadequacy of language to convey experience and true wisdom. And in the end \"all your letters in the sand cannot heal me like your hand\" which says to me that there are more profound ways of sharing oneself with others than mere words.\t\t\t\t\n\t\t\t\t\n\n"}