{"comment_0": "\nI didn't get the feeling of disappointment at all - I did hear the caution in it though.  I feel like it's a song of anticipation... can it really be that the person he has waited for is here?  That all this time he has waited (the ice-age thawing), and now he's beginning to believe that the wait is at end... \"every little thing anticipates you\" and \"all down my veins my heart strings call\" is that great tingly excitement/hope that he is feeling. the stanza where he talks about 'we all know, don't we, that stars will explode in the sky\" sounds sarcastic - like what you've said previously - the false expectation of what love will be like.  but the reality is \"stars have their moments and they die\", much like our own lives - great moments, and a natural conclusion.  I love this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think he never felt out of love with her. this song sounds to me like the fantasy of her return\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nRachel has it right. He loved her and she's gone. He wants her back. But she's not coming. And he won't come to her.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think this song is about a man that's lived a difficult life and has been so terribly hurt in the past that he's afraid to give himself and his heart again... until this girl comes along... and he loves her dearly, falls in love with her, but doesn't give himself readily.... but slowly but surely he will... b/c deep down inside he knows that she is the one.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThe song is a love song. He met someone and fell for them he thinks that she is the one but he doubts it because the current world expects so much from your \"true love\" that unless \"Stars explode in the sky\" how do you know if this person is the one! The last verse explains that you have to put aside expectations and go for what you want. He who seeks finds! Perfect modern love song.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think it is a song of anticipation. That he is still waiting for the one he's been waiting for? And through his search he is waiting for the one with a fantastic romanticism (the stars exploding in the sky), but when he realises there is no real romanticism in lifes loves. That's when the biblical reference comes in.\r\n The biblical reference I think points out that he can find in each lover past or future what he looks for, or what he's been waiting for. And perhaps even, in reflecting his past loves, that he only ever found what he was looking for, and just has to change the focus of his vision. :)\r\n At least that's what it means to me.  . . ;)\n\n\n", "comment_6": "\nIs the man he speaks of Jesus? Or someone who wrote of him in the Bible, maybe?\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nit is the perfect non love song\n\r\nare you the one?\r\nwe would know wouldnt we?\r\nstars would explode... but the don't\r\nyou aren't the one....\n\n\r\nand yes, its a\"jesus\" quote\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThose lines don't necessarily mean it's not a love song. It might be an admission of his ridiculous claims about stars exploding in the sky.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\n\"stars have their moment then they die\"\n\r\nhe loved her, and he fell out of love with her.\r\nand he in \"are you the one that i've been waiting for\"\r\nis asking himself, is this what he waited for... \r\ndid i really wait for something that failed\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nChazAngel -> I think you've got it spot on, which is what I was angling at last year. We watch all these awful films and listen to awful vapid pop music about how fantastic everything is - so finally someone with a bit of intelligence in his lyrics nails something.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ni think it's about... disappointment, maybe? all his life he's waited for the perfect girl, and he loves her, but he's not sure she's the one he waited for. reality never measures up to the expectations we've built up. she might be his true love, but she's flawed and it makes him hesitate.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI think CherryBomB13 has is spot on and chazangel has an excellent point in the world expecting so much...\n\r\nI've had a life that hasn't been easy and I've been hurt but I relate so much to the lyrics as CherryBomb interprets them. That's what it means to me. He's asking, to himself more than anyone else, if this person is the one to fall in love with, who he's going to be with, the person who'll make everything all right. But he's questioning it because he's been hurt and because Holywood etc almost enforces on you it's idea of what love should be.  \n\r\nIn the last verse however he decides, and very rightly, that if he's questioning it it won't be and he has to put his faith (doubling up with the Jesus quote) in it. The last verse is truly beautiful and is almost enough to make me cry in context with the rest of the song in the way I relate to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI've felt you coming, girl, as you drew near\r\nI knew you'd find me, 'cause I longed you here\n\r\nHe's been looking for someone to love and who'll love him in a pure way. Strange when you consider Nick Cave's reputation with women but I think the whole sleeping with so soon part has cheapened the women in his life and he's looking for something different. I don't know how to articulate it properly but I relate to it so much, the entire song.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nFirst, I really love this song (I used to sing it I was in a band at Uni).\n\r\nSecond, I always saw it as someone looking back on the quest for love. The disappointment that he expresses when he sings, \"Oh, we will know, won't we? The stars will explode in the sky, Oh, but they don't, do they? Stars have their moment and then they die\"\r\nIt sounds like the crushing disappointment of finding that love isn't like it is in films and books, but still he's looking and so he's asking, \"Are you the one that I've been waiting for?\"\n\n\n", "comment_15": "\nthats what i mean by it is a \"non love song\"\n\r\nSecond, I always saw it as someone looking back on the quest for love. The disappointment that he expresses when he sings, \"Oh, we will know, won't we? The stars will explode in the sky, Oh, but they don't, do they? Stars have their moment and then they die\"\r\nIt sounds like the crushing disappointment of finding that love isn't like it is in films and books, but still he's looking and so he's asking, \"Are you the one that I've been waiting for?\"\n\r\nThis is love.... we dont have that.... i waited for this?\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThere's a line in a Magnetic Fields (Chicken with it's head cut off - songmeanings.net/songs/view/88594/) song that says:\n\r\n\"We don't have to be stars exploding in the night or electric eels under the covers. We don't have to be anything quite so unreal, let's just be lovers.\"\n\r\nand while I don't think the songs relate much I do think this line expresses something similar. Like everyone is saying about the hyped up concept of love, we expect some sort of miracle to fall on us when we fall in love but actually nothing like that happens, the world just keeps going. What this song really emphasizes to me is that it's not the stars exploding around you, or the fireworks in a movie kiss that make love so incredible, it's just the love, it's that person standing infront of you wrapped in a coat, the way you feel them all down your veins, how the world can go to war outside your window and all you care about is being there for them. \t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI never thought of reading into the situation that the song comes from as much as most of you have. To me this song is about the strongest emotional and sexual desires. There is no conclusion, this is just a moment of longing.\r\nAnd also, this is one of the most touching and moving songs I've ever heard.\n\n\n", "comment_18": "\nI think its interesting so many comments think its about someone he knew and lost.  That's not clear, I mean it could be, even likely (my bet would be his first love, whoever that is), but its not implicit in the lyrics.\n\r\nWhat is clear is that he's expressing hope that he will find this love in the future, soon. \n\r\nBut how will he know for certain when he has found his true love?  Will there be clear signs?  Will stars explode overhead? \n\r\nI think he's also expressing how there are very few certainties in life.   There is an implication of fear or doubt, by saying it would be nice if we knew for certain, if when we knew we met our true love we could be certain because of undeniable indications, if stars exploded overhead when we met, but in reality we know that doesn't happen. \n\r\nIn reality the only certainty in life is that life blooms and then it fades, the inevitable transcience of time.\n\r\nSometimes we don't know that we've met out true love until time has passed.  Maybe why some have interpretted this song as longing for a lost love.  All Nick is expressing is clear longing for true love, and hope he will find true love soon. The implication being that \"true love\" would endure, maybe that is the only indication that it is \"true love\" versus another kind of love that could not be lost, just as other loves have.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think it's a song of reflection. He's been with his partner/lover/what have you for a time and he's realising that the initial romance has faded, but now he wonders whether he's actually in love with her (and moreover, is she his one?).\nHe reasons that usually people talk of an explosion of love but his was more of a river flowing to that conclusion and he's considering whether he's arrived there yet. \nFollowing this, I feel that he is drawing a distinction between the traditional, explosion of love that may fade, \"Stars have their moment, then they die.\" and this new, more subtle love. I think - perhaps hope - that he is saying the latter is 'true' and lasts longer.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\n@_Aww sugar: really - Jesus?!?!?!??!!??  I think that's almost totally improbable.  What is it with people on here assuming every song is about Jesus/God?  Cave is a super-hyper-Atheist.\n\nThis is a pained love song, simple as.  There is a reference to Jesus - \"There's a man who spoke wonders, though I've never met him\", which I think makes it clear...\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThere are no disappointments nor sadness (because of ex-lovers) nor anything like that in this song.\n\nFor me this is one of the most beautiful love songs ever. And it's completely optimistic! It's so beautiful in a mature, realistic way, as opposed to a classic romantic, immaturely passionate way.\n\nThis is a song about the expectation of the one true love, which is coming, but realistically, you always ask yourself \"are you the one that I've been waiting for\"?\n\nThe key lyrics are, of course, these (so beautifully put):\n\n\"Oh, we will know, won't we?\nThe stars will explode in the sky!\nBut they don't, do they?\nStars have their moment and then they die.\"\n\nIt's goodbye to the childish way of thinking about love and accepting the approaching mature love.\n\nNo, even when the true love comes, there won't be any star explosions in the sky! And even if there are explosions, it's not what counts! That kind of stuff passes quickly (that moment od crazy, explosive love quickly dies, as it presumably died in cases of the former lovers), but something else is what you should look for - all down your veins - and recognize and welcome the true love when it comes.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nIt's a song about an immortal waiting for his death to finally arrive.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI think he always loved her, but for whatever reason, they couldnt be together..that's sad. he wants her and she is upset because she obviously feels the same way he does.  They've waited way too long... it seems to be taking forever for them to finally be together. It looks like they will, so I don't think this is a hopeless case. \t\t\t\t\n\t\t\t\t\n\n"}