{"comment_0": "\nProverbs 5\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nWhat a song! Basically about people who are different from what they appear to be on the outside. Seems this one is about being taken in by a girl who turns out to be a lot nastier than the angelic first impression conveys. Moral is people arent always what they seem. Great song tho, I love the way it changes.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nwhy so little comments? I love this song! :) Elvis rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nAnd no marvel; for Satan himself is transformed into an angel of light.\r\n2 CORINTHIANS 11:14\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nabout people who arnt all that they seem.\r\nthis song brings back great memories... my dad used to have all these on repeat and we used to sing along in the living room.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nElvis was both a devil in disguise himself, because his mission was to corrupt and destroy the morals of the young people (the parents and older people mostly were disgusted by the provocation of Elvis. But that didn't stop them, they broke this resistance and the next generation could even be exposed to much more twisted things and so on.). And he signed a deal with the devil in disguise, maybe not even knowing that he was selling his soul. \n\nBut Elvis was a tool anyway, an artificial creation like the Beatles, send to the masses to corrupt their thinking, to plant ideas of sexual immorality and party and worldlyness into their minds, plus he was a false idol that was and still is worshipped by many people. Though he wasn't a good person at all and he died poor and in misery after heavy drug use, though one should think he should have been a happy man, because he could afford everything that many people dream of. I always find it fascinating (but also scary) how obvious and in your face song lyrics get if you read them from a Christian and biblical standpoint. If you don't believe in God, you can always say \"this isn't real, it's a metaphor, he's just kidding, it's sarcasm\".\t\t\t\t\n\t\t\t\t\n\n"}