{"comment_0": "\nI think MuminPL is right on the money, I've never seen an interview with them before, but I noticed in one of their albums, they list Akira Yamaoka as an influence, he did all the soundtracks to silent hill.  \r\nIf you look at the lyrics to this song, everything points to Silent Hill The Room, 302 is the apartment that it's set in,(used to be my 302), and holes appear in the walls (peering through the hole) that the character travels through into Silent Hill,  the character finds that he is locked within his apartment and looks through the spyhole and watches his neighbours knocking on his door, i think the character has weird dreams too (reccuring dreams) and of course there's the darkness that is Silent Hill that manifests itself within the apartment.  \r\nIf you have seen the video aswell, there are visual elements that reference The Room, eg: a revolving door, decaying building, a bathtub (more SH3).\r\nTo summarize, although I am guessing, I think the evidence is clear.\n\n\n", "comment_1": "\nI have heard of Riverside thru Myspace, They're unique and good.\r\nSo is 302 a room number? it's kinda confusing. I guess he was going thru something that turned out fake? :-\\ so metaphorically speakin he was in a room sheltered and all but it was not where he wants to be, not where he belongs?\r\nThe final acoustic part is amazing, it explains itself. \r\n\"I've tried to make self-portraits before\r\nThrough my eyes\r\nJust see myself\r\nNow I know\r\nI'm not in denial\r\nThat I need someone else\r\nTo see me\r\nTo see me \"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI've read an interview with those guys somewhere and the singer said something about a computer game (I'm not sure - perhaps Silent Hill or Alone in the Dark?) in which the room 302 was somehow significant. He was referring to this in the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI just think that 302 was the characters' university dorm room number, either that or apartment number. But I think dorm room because of the lyrics in Artificial Smile, in which he seems to be describing meeting someone in in university (and hating them and wanting them to fail)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis is quite possibly my favourite riverside song, which is interesting because rapid eye movement would have to be their weakest album. This makes me think of dreams, for those that have a strong attachment to their dreams, sleep and dreams can serve as wonderful and effective \"panic rooms\" to escape from reality, forget their problems etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nOk so I am not really sure what this song is about, but I think the dude feels safe when he's asleep but must come to terms with himself while he's awake because he's tired of hiding from himself. Oh and 302 is the number you call when you want to put someone in a psychiatric facility, it's kinda like 911 but for the psych. hospital. \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nJust best prog song ever exept Tool songs..\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthe song is definitely about silent hill. if you've played silent hill 4 you would see how the first part of lyrics explain the antagonist's situation in the game. but the second part of the song stray from the antagonist and , in my opinion, are the song writer's complementary interpretation to the life of one of the less centered, though compelling characters of the game,one of the neighbors.an portrait artist, who lives alone doing nothing but painting portraits of neighbors trying to capture the essence of their lives in each painting. although i love the silent hill music and especially in silent hill 4. i think this song is a very nice change of pace. a brilliant song for a brilliant game.\n\n\n"}