{"comment_0": "\nFirst, people really need to listen to TOOL, APC, and Puscifer and realize that Maynard Keenan, although very spiritual, is not a fan of organized religion.\nThe 10,000 Days album is not about religion, but a variety of topics, such as vicarious being about vicariously living out violence through TV (eye on the TV...cause I need to watch things die from a distance), The Pot being about hypocrisy (every line in the song pretty much being an analogy for hypocrisy), and Rosetta Stoned being an overdose from  X and DMT (10 to 2 AM, X and yogi DMT and a box of krispy kremes).\nThe song Wings for Marie, and 10,000 Days (Wings pt. 2), these very beautiful and powerful songs, are about Maynard Keenan's mother, Judith Marie, who suffered from a stroke that left her paralyzed and wheelchair bound until she died 27 years later, which is about 10,000 days, rounding up. He also makes a specialty wine named after his mother.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nListen to the tales as we all rationalize\r\nOur way into the arms of the savior,\r\nFeigning all the trials and the tribulations;\r\nNone of us have actually been there.\r\nNot like you.\n\r\nMany people spend their life rationalizing, trying to make a logical decision of what to believe in. Maynard respects his mother for going by her true feelings, or intuition, instead. people try to convince themselves to keep faith or believe in this or that. she actually experienced the \"light\" described by so many different schools of thought through her faith in Jesus. Even though maynard doesnt like the stories of jesus he cant help but respect and admire this \"light\". christianity isnt the only way to achieve it, probably the least likely way actually. all the more reason to respect his mother for it.\n\r\nThis is what maynard learned from his mother. to seek that light and live for it. he just chooses to seek it in a different way... \"a gift you passed on to me\"\n\r\nthe feeling most people only \"read about\"\n\r\nshe never lived a lie, she actually felt this spiritual connection to jesus. her set of beliefs says that in doing this she will be saved, go to heaven or whatever. thats why maynard says she can look god in the eye and demand her wings. Its an assurance that she did her part.\n\r\nshe saved maynards life by teaching him to trust his spirituality.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI'm a 16 year old guy, and a huge fan of TOOL.\n\r\nI just want to say that this song has the most powerful lyrics of any song by TOOL. Hell, it has the most powerful lyrics of any song by anyone. In all honesty, after reading the lyrics along with the music, I was crying. Like actually crying. Don't get me wrong, but I've never been religious. But religious or not, this song truly sums up life and death. This is a beautiful tribute to his mother that delves into the unknown deeper than anything ever before. Producing a poetic masterpiece like this is an achievement no one should ignore. The time, the effort, the emotion that goes into creating something like this: it all just adds up to song that is nothing short of monumental.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\n@drds63 - I think you may have taken the lyrics a bit too literally, from lyrics from this song and other it would seem Maynard is probably an agnostic if not an atheist outright (Set in my ways and my arrogance, burden of proof tossed on believers).  What I think hes saying, interpreted from that perspective, is that he hopes his mother is rewarded for her lifetime of hardship, belief, and faith, that if anyone is deserving of a reward it is her.\n\r\nYou're definitely right that he is holding her high on a perch, but come on it's his mom.  In other songs hes seemed to allude to her saving him (Reflection: \"I have come curiously close to the end\" \"Within my darkest moment, feeling weak\" \"As full and bright as I am, this light is not my own, A million light reflections, pass over me\") so she probably was very special to him, and this is his send off to her.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nHaha...all the people that posted back in 06 thought this was a fake. Nope. \r\nAnyways this song is obviously written to Judith Marie, Maynard's mom. She was paralyzed for 27 years, or 10,000 days, but you already know all that.\r\nThis song serves two purposes: 1. As a eulogy to his mother and 2. as a way to call attention to the hypocrisy within the christian church. Judith was heavily religious and dedicated her life to God despite her being paralyzed. Maynard calls her a savior in herself because she is the only one, it seems, in the christian faith to follow the teachings so devotedly. He also says that the rest of the \"ingorant sinners\" are lost without her. The song also includes an account of what it would be like as Judith approaches the gates of ST. Peter.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nTrexor.... you think that there's no way an artist would dedicate a song to his dead mother???? did you not see the APC site after she died? the site was turned into a rather touching memorial to her for almost 2 weeks...\n\r\n(the song) Judith... MOCKING HIS MOM??? dude, you don't honestly believe that do you? the opening line being...\r\n'you're such an inspiration for the ways that i will never ever choose to be'...\n\r\neven if 10,000 Days is a decoy (note: NOT A HOAX, but a decoy) it was made to sound as convincingly like a Tool album as possible...\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n^ theres prolly a \"shortage\" in you pants....and I.Q.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThen again every girl deserves a fairytale... A Cinderella Story... the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nOn 10,000 Days, Keenan wanted to explore issues more personal to him:[95] the album name and title track refer to the twenty-seven years during which his mother suffered from complications of a stroke until her death in 2003.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nWho cares if its a hoax or not, it's still new music from tool. If its a hoax then its even better becuase then theres another album coming out in a month. But this album is really good in my oppinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\noh dear... it seems the word is in from the auzzies and kiwis... the album is selling fast...\n\r\n10,000 DAYS IS THE REAL DEAL... THE LEAK IS NOT FAKE... THE FAKEOUT IS FAKE\n\r\nHey TREXOR ... 'foot in mouth and head up ass, so whatcha talkin' bout'... eh?\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nAs I take it, Tool seems to have meant the song to mean something along the lines of this:\n\r\nJudith has worked hard for her religion, even though Maynard isn't particularly Christian (and yes, I am Christian in a different sort of way, so I'm not bringing my opinion in here). Since she has worked so hard, the universe after death should be malleable to what she expected, and thus she should be able to receive what the bible and her faith promised her in reward for her kindness and faith.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nOh my god! the way this song ends?its unbelievably beatiful! and that part: Give me my, give me my wings! this and wings together is a fuckin masterpiece!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nYes, most people are right, this song is about his mother's death.\n\r\nBut it's NOT about her going to Heaven or getting her wings.  He says that, but it's meant to mock those ideas.  He hopes his mother rests in peace, but doesn't believe in the concept of Heaven.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis is exactly why Maynard doesn't make fucking meaningful and personal songs anymore!\r\nbecause fans like fucking TREXOR....just dont fucking get it, they just dont understand how much this song could mean to Maynard...fans like TREXOR are just a bunch of fucking hicks who stand around at a fucking concert saying \"aww yeh this song is fucking awesome, listen to that fucking solo!, DUH UH!\"\r\nbut if you ask them what the song means then they wont give a fuck.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis is to me Tool's GREATEST SONG.  You haven't experienced this song until you've felt it live. There is no comparison.  If you could ignore some idiots screaming during it.  Simply amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nIt's obvious that it's about his mother, he has strong feelings for her, like in this vid where he talks about her : youtube.com/…\n\r\n--\n\r\n\"You were the light and the way they'll only read about\"\n\r\nThey'll only read about : people who listen to the song, we won't know her, we never will. We'll only get to know her by his words, what we'll read about from this song.\n\r\n\"Ten thousand days in the fire is long enough;\r\nYou're going home.\"\n\r\n This and the fact that name 'Judith Marie' is obvious, she spent 27 days in the fire, now that she's dead, she's going \"home\".\n\r\n--\n\r\n As for what Mr. Keenan believes... He obviously doesn't like organized religion, but he also doesn't take an atheistic hostile approach to the IDEA of there being any kind of god or afterlife. He's open minded.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nthis song is undoubtedly about his mother. but he also talks about religion and how they are not very realistic and very dogmatic about their beleifs. this is an amazing set of songs. maynard and tool are true visionaries.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThe reason TOOL has been my favorite band since Undertow is because the songs have multiple meanings to me...one line can be interpreted 4 or 5 different ways.  It depends on my mood, what state of mind I'm in.  I can always find some new meaning.  Plus the drums just rumble...then form a tidal wave and leave you washed up on the beach...then the guitar slashes like a scythe...\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nTheres also a little song called \"Passive\" that was about her, just saying\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis is \"Wings Pt. 2\" -- DO NOT SUBMIT IT AGAIN\r\n--\r\nSM ADMIN\n\n\r\nJudith Marie was paralyzed for 27 years (ten thousand days).  Therefore Maynard wrote a song about her.Edited by YtseJam on May  6 2006, at 06:00AM\n\n\n", "comment_21": "\nWhat's your fucking problem?  It's true.  MJK's mom, Judith Marie, was paralyzed for 27 years, which is approximately 10,000 days.  She was very religious, (Maynard wrote the APC song \"Judith\" at least partially about her), and this song is about her finding her savior now that she has passed away.\n\r\nSince it's a Tool song, there is probably another meaning behind the song, but you can't deny that this part is true.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nwell the album is released tomorrow so go fuck yourself and tell me its a hoax\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nmy sentiments exatly...\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nthe copy i have is no joke...its a dope album...Trexor is just not ready for it, just keep playing Lateralus dude.  this song is saying that she should be in heaven, and god should not hold any thing that Maynard did against her. she kept her faith even when Maynard went down a diffrent path. even after spending 27 years paralyzed and bascially a miserable life all for her christ and lord. hes saying that she'd better get her wings, shes damn near the posterchild for keeping faith.....\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nlisten to the bass when this song.. sort of explodes.. it sounds inspired..\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis is fantastic shit, who the fuck cares if this is a decoy album? Clearly this is about his mother, it's beautiful. It really is the most brilliant piece of music I have heard in yonks. It's amazingly written. Ohhh. Sorry for the pointless-ish post. \n\r\n-Katie. xoxo.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI agree !!! The part : \"Set as I am in my ways and my arrogance. \r\nBurden of proof tossed upon non-believers. \r\nYou were my witness. \r\nMy eyes, my evidence. \r\nJudith Marie, unconditional one\" gives me shivers as thepart :\"If, when I say I may fade like a sigh if I stay,\r\nYou minimize my movement anyway,\r\nI must persuade you another way\" in Puhit.....it's just..aaaaaaahhhh some emotionnaly loaded....\r\nThe entire album is for Judith Marie I think...and that's why it's not a big change like the other one, I think it reflects the Mood of Maynard after the death of his mother.....\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nWIKIPEDIA\n\r\nSkepticism that 10,000 Days is the actual title has become void since the album has already been released in some European countries.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nGod, it seems the old \"angry Tool fan\" stereotype is alive and well on Songmeanings.net. Chill out dudes, and wait for the new Tool album to come out. When it does,we'll have the truth.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nLol.. I've got the new Album.. the Songs are no \"Decoy\" or \"Fake\" or whatever.. the only \"differences\" between Leak and CD are the higher Sound Quality and the more fluent Changeovers between the Songs (and that's normal).. it has a very nice artwork though.. so learn to love the Songs and wait for your Copy :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nthis is by far one of the most intensly moving songs i have ever heard...\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\n\"Lol.. I've got the new Album.. the Songs are no \"Decoy\" or \"Fake\" or whatever.. the only \"differences\" between Leak and CD are the higher Sound Quality and the more fluent Changeovers between the Songs (and that's normal).. it has a very nice artwork though.. so learn to love the Songs and wait for your Copy :-)\"\n\r\nI got it from a source I'm not naming in the US, and it's just as he ^ says. It's the real deal.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\n0ni I agree with you 100%, and its such a great song\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nOMFG FUCK YOU DICKS THAT THINK ITS A MOCK OR A HOAX.\r\nI BOUGHT!!!! I REPEAT BOUGHT THE ALBUM TODAY.\r\nit was released in australia 29/04/06. i bought it, i know its real, this song is about his mother, your full of shit TREXOR, you try hard piece of shit, i sincerly hope someone hurts you for your awful comments\n\n\n\n", "comment_35": "\nironically, if he hadn't been led around like a child by conspiricy theorists he'd probobly love and accept the album... but now... sigh, it's sad is all...\n\r\nyou are deluding yourself if you think that...\r\n-there's anything recycled about this album (OMG palm muting, just like The Patient... OMG synths just like Third Eye)\r\n-the music is not up to par... this is without a doubt Tool's most musically ambitious album (to date)...\r\n-the lyrics are not up to par... Maynard's reached a new plateau with this one, he seemlessly segways between painful personal experiences, to scathing rants, to tongue in cheek humor, to existentialism... all the grand hallmarks of his lyrical stylings...\n\r\nseriously, everyone who didn't like this album the first time... lock yourself in a dark room with no other stimuli and crank it up... don't compare it to other Tool albums, take it for what it is... as i recall, a lot of Tool fans had problems digesting Lateralus...\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nhere here!!! :D\r\nespecailly the last paragraph exactly what i did :)\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\ni don't see why people are saying this is a hoax, the album is sitting on my desk right now. the music, the lyrics, and the album art is amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\n^now he feels stupid cause he knows it is the album.....dumbass\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nokay, i never ever heard of the hoax until today, adn i bought the album yesterday...when i listened to it i realised that this was different to most of tools music, that it has become more music orientated, and that it seems less tech like lateralis...the album art is the same yet different...in opiate they were sci0fi geeks, in undertow grungy with naked peoples, dirty and raw, in anema more experimental, weird, with the contorsionist adn all, in lateralis they became obsessed with the concept of life and aliens, and now they look like wizards/pirates...not that that's bad. one thing that is really weird is that they all pose for pictures in the album art, adn i think they only did that in undertow before this...is real just different and i like\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nhey TREX, how was Coachella you smug fuck?\n\r\nthat being said, you're a fool if you think this is a step back from Lateralus... it's a massive step forward. none of that verse chorus verse nonsense going on here...\n\r\nprobobly the biggest reason it sounds so very different from Lateralus is because Maynard was much more involved in the song writing process... most of Lateralus' music was written while maynard was on tour with APC... the lyrics were put to the finished music in a 'freudian, free association way' in maynard's words from a Spin interview... there's a certain disconnect between the music and the lyrics in Lateralus that leaves me a bit cold... this album is much more cohesive between the two... \n\r\nthis is Tool the way Tool was meant to be... not lyrics added to great music, but lyrics and music seamlessly intertwined... just my $.02\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nthe album came out in australia on saturday and i could not get the album because it had sold out everywhere, but am getting it orded in. from what i've heard off others, it expands on their other albums and is great. although i have heard a few leaked songs off the album, i am still unsure whether or not they are fake, but believe a couple of them are.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nTREXOR, i just want to know why it is you seem to hold such a solid stance on believing that this album is fake? and why you think the \"fake\" lyrics are so bad? youre entitled to your opinion but i want to know why. and i dont need you to have a rant at me because of whatever reason you might see as an excuse to be-little me. \r\nthis is just a question\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nHmm... TREXOR is an asshole, no doubt.\n\r\nAnd for the record... 27 years are 9,861 days, not 10,000... but whatever.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nno doubt, this song is really about his mother, and to all with this \"tool songs must have a drug background\": ten thousand days in the fire is long enough, youre going home. \r\ni was really like flashed when a friend told me about the 27 years maynards mom had to live. (i was trying to get a relation to maynards time in the army, etc.)\n\r\nstop insulting eachother, just because some have different meanings about toolsongs. respect the interpretations of the other, like maynard does.\n\r\nbtw trexor. you didnt get anything of the REAL meanings of 10000 days. unfortunatly, youre obviously on the wrong side to understand or perhaps  even to accept the real meaning. youre just a monkey, that strikes the brother down.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nbtw trexor: whats your interpretation? i really would like to hear. did you think about the lyrics?\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nright in two, vicarious, 10,000 days i have heard and they are defianatly not fake. however i'm sure the versions of rosetta stoned, jambi, the pot and lipan conjuring are fake but they all feature on the album so i'll have to wait and see.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nhawk_er_8\n\r\nim in germany, and the album is released since 4/28\n\r\nits not fake.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\noriginally, i was trying to say that this song meant maynard in fact went religious in a christian focused kind of way. once it came to my knowledge that it was about his mother's 27 years suffering paralysis and then her death that followed, i totally understand his approach here. i was raised in a catholic environment but at a young age, i turned away from organized religion and tried to figure out what was most important for me to believe. but when my father died when i was 16, i said he was in heaven. i prayed to god that he was in peace. i reverted back to all those organized thoughts because in crisis, that's basically what we have to do. i totally agree 0ni. no one can say what happens after death, but in order to give ourselves peace, it's perhaps easiest to just use that comfortable idea that heaven goes to those who lived remarkable lives. it's a beautiful, beautiful song. and i hope all who were skeptical about the internet leaks and such are enjoying the album they got to purchase today.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\n-.-\n\r\nSuch a shame that the first page is littered with stupid bickering. It's different from their other albums, yes. But how you can lump Aenima, Opiate, Lateralus and Undertow into one group and say this is seperate I'll never know. \n\r\nIf it's not good, then fine. Your opinion. But your incessant pseudo-elitist attitude isn't necessary. It's stupid and whatever Tool-fuelled open-mindedness you're promoting isn't showing. You just seem like a child whose hands are pressed against their ears and they're screaming \"NO NO NO NO NO!\"\n\r\n\"if you did, then you'd certainly be an open-minded tool fan, wouldn't you?\"\n\r\nThis makes me cringe particuarly. Apparently all fans of the same band must adhere to a certain code? You make absolutely no sense. Plus I seem to remember Maynard having a certain dislike for elitist-but-not-quite-cool-enough \"fans\". Track 7 of Aenima, and quickly please.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nHey Hypocrite.. I mean Trexor. I've been browsing your posts, and I'm amused by your 3rd grade antics. Keep it up loser. Everyone just look at his profile and skim through his post history, it's a good laugh. Have fun. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nTrexor, the fact of the matter wasn't based on your opinion, it was based on the fact that you gave a totally biased opinion towards the entire album without giving us a reasonable explanation behind why you thought so. I checked through the lyrics to the songs off 10,000 Days, and in all of them, there was a comment by you that gave absolutely no credibility or intelligence into why you disliked them. Having said that, your opinions can be vented here, and everyone should take them as they are. There's no one who can stop you. But if you don't like the songs, give reasonable examples as to why you don't like it, likewise if you do enjoy it, state why. \n\r\nTo be honest, I find myself listening to \"Right In Two\" more than any track at the moment, even Vicarious, Jambi, The Pot or Rosetta Stoned. The lyrics don't have to be the biggest point of Tool songs, especially if they're from Maynard's viewpoint of things. As a budding songwriter, I find it difficult to come up with the words for certain feelings or situations, and though I may be wrong, I feel Maynard used lyrics that suited the song really well and were intellectual in their own right. As well as this, the music was brilliant (I love the 9/4 time signature), and reminded me a lot of The Patient. It is mellow-ish, sure, but it caught my attention when it got down into the meat and potatoes of things. Maybe this should've gone in the \"Right In Two\" post, but whatever.\n\r\nThe bottom line is that 10,000 Days is a Tool album that if given the chance can be enjoyed immensely. Certains things about it you may hate, certain things about it you may like, just so long as you point out opinions that don't resort to blatant bashing of the songs then your opinions will be valid.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\ntrexor made his decision on this album way before it was released...that should tell you something right there...no way is he gonna go back on his disgustingly oversized ego and say his unjustified pre-judgement was incorrect...thats pretty sad, that you cant enjoy an album because of prejudice...i think next time you should skip buying into the hoax hype and bury your head under a pillow for a good while...\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI was waiting for you to say that.\n\r\nI used something Maynard said as it would actually mean something to you. I couldn't care less whether or not you (or anyone else) share the same views on whatever as Maynard. But you're giving off the air that all \"real\" Tool fans should do the same as well, which is irritating. I would have said that on the post but I'm unbelievably sporadic and fly around everywhere in my posts, and end up forgetting half of what I wanted to say.\n\n\r\nAs for the album...this album is very dubious. Part of me really loves it but this album is a bit patchy, at best. Tracks 1, 3-5, 7 and 8 are good but the rest is a bit...eh. I'm still trying ot make up whether or not tracks such as this one and Rosetta Stoned make up for some of the more \"meh\" tracks.\r\nThis song, however, happens to be my favourite on the album and is probably now one of my favourite Tool Songs. A song like this, written by someone who's not too fond of Christianity, has a meaning of it's own before you even listen to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nsee TREX, the thing of it all is that you were setting yourself for dissapointment from day 1.\n\r\n i did a double take myself when i first saw the track listing, but i didn't doubt the validity, as you chose to, as the reason they gave, artwork being sent to printers, was quite logical. you can't get an anticipated album printed without leaks like that. i can accept that you don't like this album...\n\r\nthings like expectations and assumptions will leave you feeling like you got gyped. which is too bad.\n\r\non my first listen i was, shall we say, underimpressed, with several of the tracks (The Pot, for example)... but since then they've grown on me immensely. it's one of my favorite's on the album now.\n\r\nalso, if you think of the segway songs (Lipan Conjuring, Lost Keys) as songs on their own it's kinda silly. just cause they're seperated by tracks doesn't mean it's a song... this album has 6 real songs on it, Lateralus has 7 real songs, yet if they had made it a 6 track cd god know's there would be an unholy amount of bitching...\n\r\nespecially songs like this seem like such a leap forward to me. coming to terms with his mother's faith, even though it's not in line with his own personal beliefs. it's good to see some emotion other than anger... this song reminds me of Pink Floyd... no verse chorus verse kinda music here...\n\r\nanyway, i think i had a point... yeah, TREX give this album a year to sink in and tell us what you think then. i know it took a LOT of people a while to accept Lateralus... it's about progression, avoiding beings stale, etc... anyway, i hope you come to enjoy this album as much as i do, i think it might be my favorite Tool album...\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\ntrexor is the load that should've leaked down his mothers asscrack.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI hate it when songs get listed twice here.\n\r\nWow, I haven't cried in years. I can only say that I may have, towards the middle of this song. Aside from another (best so far) display of this band to convey emotion with lyrics, cadence, melody, and rythm, it is truly, I believe, true with the esence of what the band and lyric writer stand for.\r\nLove. \r\nThis is not a song of a deeper truth this is more about an experience and a fantasy trip of the mind.\n\r\nThis is all about love. \n\r\nI'm sure that we will see a hundred posts about (once again) Maynard finding religion. Maynard has known religion.\r\n(That reminds me, I hope Zack doesn't find this lyric)\n\r\nThis is a tribute drenched in LOVE to both her and the emotions, and thoughts he has had concerning her and the universe around her.\n\r\nAnd if the anti-this, anti-that, fans that don't see higher meaning think that this album and the \"new\"(bs) direction tool is heading is a dissapointment, all I can say is FINALLY! Get of the fucking bus and return your fucking tickets.\n\n\r\nI try to keep the things I believe in to a minimum, so that I can better experience... that being said, that leaves me the room to consider the possibilities... I personally haven't succomed to organized religion, but I have considered his mother's fundemental envangelicalist way of thinking.\r\n I have to believe I would think the same, given a person I loved and watched go through hell-on-earth. Even if I thought that her faith was too caught up in the details, distractions, and corruptions of some written words.\r\n \"In the beginning there was love, after that you pretty close the book.\"\n\n\r\nLook him in the eye\r\nLook him in the eye and tell him..\r\n\"I never lived a lie, never took a life,\r\nBut surely saved one\r\nHallejullah,\r\nIt's time for you to bring me home\"\r\n-kind of shows him looking through her eyes.\n\n\r\nLove can drive us to view through others eyes. From my humble impression of Maynard (I stress, I don't presume to know and understand him, or anyone) I believe him to be the type that understand this and probably had no reservations about letting out this journey of the mind, its great therapy.\r\nShe beleived so strong, he has criticized her, but he also loves her. I for one feel a little like I know the subject of the song, he describes her so clearly.\n\r\nMaybe he found the light...Maybe he's just patronizing her, but this isn't an angry sarcastic song so I doubt it.\n\r\nWhat an intimate human he is he shows us all again. Would you share your pain with the entire world?\n\r\nI said a lot but I don't think I said anything meaningful, I don't even think I got my point across. Someone will probably show up and say what I'm trying to say, in 4 words.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nWhat gets me the most is not the lyrics. Its this idiotic flame war between Trexor and seemingly the rest of the boards.\n\r\nTool pulled a hoax, the same one they did years ago, and he fell for it. Its over. We have the album, the 'believers' have been vindicated.\n\r\nSo rather than feeding this continuing idiocy, just drop it and focus on the music.\n\r\nAs for the song, I was not disappointed. I almost can't separate this track from Wings For Marie, nor should anyone separate them. Its like calling Parabol and Parabola separate songs. Like Lost Keys and Rosetta Stoned as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nGee, I didn't expect TREXOR to dislike the new album once it actually came out.\n\r\nTREXOR, I respected your thoughts that the album was a hoax and that REAL Tool fans should have thought the same, but wouldn't a REAL Tool fan love the new album no matter if it was three Britney Spears songs with Maynard screaming the word \"fuck\" all throughout them? \n\r\nThink about that, Mr. OGT.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\ngo listen to 'hooker with a penis' TREXOR.\n\r\nanyway. this song, after numerous listening, continues to send shivers down my spine in these parts.\r\n\"You're the only one who can hold your head up high. \n\r\nShake your fist at the gates saying: \r\nI have come home now. \r\nFetch me the spirit. \r\nThe son, and the father. \r\nTell them their pillar of faith has ascended. \r\nIt's time now, my time now. \r\nGive me my, give me my, wings. \"\n\r\nand\n\r\n\"You were my witness. \r\nMy eyes, my evidence. \r\nJudith Marie, unconditional one\"\n\r\nMakes this great. *shivers*.\r\nanyways.\r\nif your here to flame, don't i suggest taking one other guys advice. let it sink in. listen to it at least 6 times, in different enviroments, different moods and you may well change your mind.\r\ndon't go into this record thinking anything, don't think it to be good, or bad. then you will get your true meaning :). personally, this is my favourite tool album.\r\ngood luck and i hope some people see this album the way i do :)\r\nPeace.\n\r\n-Re\\/\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nPosted by Oni:\n\r\n\"As I take it, Tool seems to have meant the song to mean something along the lines of this:\n\r\nJudith has worked hard for her religion, even though Maynard isn't particularly Christian (and yes, I am Christian in a different sort of way, so I'm not bringing my opinion in here). Since she has worked so hard, the universe after death should be malleable to what she expected, and thus she should be able to receive what the bible and her faith promised her in reward for her kindness and faith.\"\n\n\n\r\nExcellent summation of the song, Oni. This is exactly what it is about. 10,000 Days is the best song on the album in my personal opinion. The music is cohesive and heart-felt....spiritually and synergistically transcendant of sum of its parts. The most amazing part of the song is how Maynard finally comes to terms and accepts that it is okay that he doesn't believe HOW his mother believed. It doesn't make her any less worthy of what she deserves than he of what he deserves. And she was a pillar of strength, faith, and inspiration for him and many others it seems. It is very touching because he concedes she must have been must stronger than he in her faith, and it seems he is actually envious of her. In a certain way, he elevates her strength in faith above his own and demands for her what everyone knows she deserves--a place of rest and peace in eternity (what she envisioned as becoming an angel in heaven through her own belief--getting her wings). He let's go of his cynical viewpoint of her faith and realizes it was her source of strength and positive energy that had helped her to fight and hold on for those 10,000 days. And for all that fighting, he voices for her some of the most beautiful, powerful, and moving lyrics I have ever heard:\n\r\n\"It's time now!\r\nMy time now!\r\nGive me my, give me my wings!\"\n\r\nI started crying after I heard that...I realized I've been doing the same thing to my mother for some time now--writing off her beliefs and her advice and thinking that she's being naive for holding on to them. What I thought was being sheepish and simple-minded was really just being human and hopeful. It made me realize I should feel ashamed for how I act and that there is strength with my mother for how she can tolerate mine and everyone else's cynacism and criticism. Bless her and all the other mothers out there.\n\r\nFrom this, I gather it's not what we believe that makes us worthy of eternity--it's how good we are to each other and to this world. It's the positive energy that radiates from our being that should determine our fate. We should be given what we deserve. And at the very least, we should recognize those who deserve what they believe in.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI love this song, it reminds me off the begining of push-it on salival. Amazing stuff,  it gives more then just heavy riffs.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\n\"the copy i have is no joke...its a dope album...Trexor is just not ready for it, just keep playing Lateralus dude. this song is saying that she should be in heaven, and god should not hold any thing that Maynard did against her. she kept her faith even when Maynard went down a diffrent path. even after spending 27 years paralyzed and bascially a miserable life all for her christ and lord. hes saying that she'd better get her wings, shes damn near the posterchild for keeping faith.....\"\n\r\nAgreed. It's easy to smoke a little pot and think you  have some deep thought in saying \"Christians are so close minded\" without realizing some people believe what they do for their own reasons.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nDefinately one of Tool's best songs in my opinion, up there with Aenema, Eulogy, Push It, Sober, Lateralus, Forty Six and 2, and also maybe even Vicarious is up there with tens of other top Tool song. Don't mean to disreguard other Tool songs, but man this will go down as one of my favourite songs of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nlooking at all the above comments on the song's meaning (trying to filter out the flames), i mostly agree.  as others have stated, i think the big emphasis is about how much he loved his mom, and how he wholeheartedly believes that she deserves a place in heaven for her work on earth.\n\r\nhowever, the last couple of lines have something extra.  throughout the song, i was a bit surprised hearing him praise his mom's faith, expecting, but not finding, a hint of animosity towards her religion or God.  to be sure there is some condescension towards the other believers, but none directed at his mom's faith.  furthermore, he says \"we\", not \"they\" when referring to the other believers, lumping himself with the others.  initially, i thought this was just him, out of respect, not bringing up his beef with religion that hes expressed in previous songs, but the second to last lines made me reconsider.\n\r\nwhat does he mean when he says \"But surely saved one, hallelujah.\"  from the preceeding lines we can tell he's speaking from his mom's point of view when he says this. \"saved\", from the point of view of an evangelizer means \"converted to my religion\".  and i'm guessing the \"one\" refers to maynard.  so put together it would imply hes saying \"you saved me mom\".  not that he flipped 180 into a card-carrying sunday church-goer, but perhaps his opinions were significantly changed from what we've seen expressed in previous songs.\n\r\nwhat do you think?  everyone seems to have a huge amount of tool knowledge, which i don't, so i'm interested to hear.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nand how: you took the words out of my mouth.\n\r\nIf you look at Maynards lyrics in a chronological order, it seems that he grows more and more respectful twoards God.\n\r\nThere is also evidence of Maynard at least being remorsefull for the way he acted in the past in Jambi.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\n\\'10,000 days in the fire\\' is fairly self evident, his mother had to live approximately 10,000days, 27years whatever you want to call it, in the fire - hell.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nThe album debuted at number #1 today with platinum status one place ahead of Pearl Jam which was sort of suprising given all the promotion of the Pearl Jam album, compared to Tool\\'s. Just shows that bands can still do it the way Led Zeppelin did it with little promotion. Very innovative album and doesn\\'t fail to impress, (unless your an ignorant like that TREXOR guy) please leave Tool and the album alone!\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\npersonally, when i first heard the song, i didn't know anything about Maynard's mother, and i thought that the song was about satan! haha\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nThis song is clearly an homage to Maynard's mother.  Most of the lyrics are written from her point of view.  MJK is not demanding his own wings, he is saying that if there was ever a person deserving of reward for their faith, his mother is.  A very moving, loving, emotionally revealing song.\n\r\nUpon initial listening, I prefer this album to Lateralus. There was such a dramatic shift from Anema to Lateralus.The transition from Lateralus to 10,000 Days is much easier to digest.  As much or more \"listenable\" than the last album IMHO.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nOne of the first things i thought of when i heard this song (meaning its just an opinion and is probably off heh)\r\nthe lines \"I never lived a lie, never took a life.\r\nBut surely saved one\" seems as if he is saying his mother saved him by sacrificing her for the 27 years and is pleading to god to let her get her wings \"Ten thousand days in the fire is long enough. \"\n\r\njust a thought\n\r\nOn a side note, I find this to be one of their best songs to date because of the raw emotions and how the lyrics go with the music. It definatly brings me to a deep place when i listen to it. I used to be an alter boy (insert priest joke here) and now  that I am able to think and decide on my own I am at a loss to where i stand religiously and my own personal beliefs.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\n(#1 in Australia if anyone was wondering what country I was reffering to.)\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI'm new and I've been reading trexor's disappointment with 10,000 days.  I'm a really big Incubus fan and when \"A Crow Left of the Murder\" came out people felt the same way about it.  I am a singer/songwriter and I know from experience that when artists create new songs the notes become lower and harder to hear.  A person without a really good ear will not get the chills or those good feelings that you experience when you here a song that just hooks you from the get go.  I was sort of disappointed by the rest of the tracks on \"A Crow Left of the Murder\", but the more I listened to them the more I began to get those feelings about all the tracks.  So Trexor just keep listening to the album, I know you'll start to like it.  You built up the last album so much that this one disappointed you.  Oh, you also said something about them going backwards, but at Maynard's level there is only forward.  Artists only get better, different, but better!\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nYeah...I might be wrong on this...but I feel that part of this song is how Marie accepted and loved MJK unconditionally. No shit, but most Christians tend to be judgemental especially when it comes to non-believers. I think she was the only Christian in his life that loved him as Christians should.  It's quite funny, but the basis of Christianity transcends to all people...it's based on love.  Pity though, as high and mighty as Christians like to be percieved (and I'm pointing a finger at myself here), they tend to forget that ALL should be loved. MJK, i think, feels that his mother, just like him...didn't live a lie. Remained true to what she believed...and it was reflected in how she loved him...\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nOh, yeah... Ol' TREX... not really taking you on, so don't cry. I have to applaud you somewhere...you have the uncanny ability to reveal the truth by giving its opposite.  You know exactly what this song is not about. And a noddy badge for being a true Tool fan....I might have missed something, but when did that become a status???...before you react, read carefully what I wrote..\r\n-Peace\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\naside from all the pointless bickering...\n\r\none thing i have to say after reading all of the comments up to this point is that you do not have to be christian to believe in heaven.  now i dont know if maynard wrote it this way and im not going to pretend to know, but i have been a catholic my whole life and i am proud of it, but i am also a tool fan.  i think that maynard might have a certain level of spirituality to him based on some of the lyrics that he wrote for tool and apc.  \n\r\nfor me personally, i think that this song is the best on 10,000 days.  the lyrics match the music so well and the sounds of the storm in the background are truly astounding.  while im not sure yet where it ranks on my list of tool albums, it is by far the best album of 2006 so far, and i dont think anything else will pass it.  if this doesnt win album of the year at the grammys it will be the travesty of the year.  i mean, how can beyonce knowles have 9 grammys for writing the same song 400 times and tool write new and exciting music over and over again, actuallly taking time to sit down and write real lyrics with real music, yet at the end of the year get no recognition at all.\n\r\nthank you for reading and have a nice day.\r\neven you trexor.  i guess your not a bad guy, you just need some time to warm up to new tool, thats all.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nTREXOR, perhaps you would try writing an album that is better than this one?\n\r\nMethinks you would have a hard time.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThis song also gave me shivers.  I listened to it on the way to work one day, and I just started Crying.\n\r\nDammit, give her the wings!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nI cried like a baby as well!  That's when you know it is a good song.  Trexor apparently doesn't have an understanding of music enough to get those feelings.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nHoly shit, I thought I'd be the first one to admit that. Haha. The \"give me my wings\" part just got to me, eventually.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nHey guys, would u please leave Trex alone? IT'S OVER. the album became #1 and you don't want to stop these shits. personally before it's release i had a doubt too. you know! maynard is very strange. he could do anything. R.I.P\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nyeah, this song's pretty heavy... don't wanna sound like a star-struck wuss, but it puts a lump in my throat on a regular basis...\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nthis trexor character is a loser.  he's on all of these threads.  i thought I didn't have a life, but i work nights, so it's kind of acceptable.  man, this guy takes home the loser trophy.  get a life.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nThere is a second layer of meaning to this song...a Jungian level. In Jung's study of Western religion one of the conclusions he came to was that it was incomplete. It lacked the feminine perspective and he presents a lot of evidence for this...I wont delve into it at this point except to say that Christ's mother \"Mary\" (Marie, in French) was taken to heaven,' body and soul'..etc etc. Jung argues that the politicisation of religion denied the fourth element and, in fact, demonised the feminine. One of his examples of evidence of the missing element is the peculiar \"four cornered\" priests' hat that has three \"mickey mouse \"ears not four , as the design of the hat should dictate.\r\nSuffice it to say that the lines \"fetch me the spirit, the son and the father...etc\" could have been lifted straight from Jung's writings. These were the lines that caught my ear upon first listening. Second listening revealed the \"hero\" motif...again Jungian. When taken in context of lyrics in Lateralus and Tool's overt references to Carl Jung at live performances there is much to be said for a universal meaning to this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nI agree...MJK saw his  God in his mother?  \r\n or that she was a more worthy \"Jesus\" figure?\r\nI am not making presumptions,,,just guessing\r\nJudith Marie becomes the archetypal mother...that rises to her rightful place, and summons the father, son, and holy spirit\".  \r\nIt is a very beautiful song...a nice mother's day thank you to his mom.  \r\nThere are so many allusions to angels...and TOOL is in to the Enochian Magic type stuff; I wonder if MJK came to see his mom as an angel over time?\r\nIf you have ever seen someone in a coma or dying, as there body slowly shuts down, you have seen the  angelic air that comes around a person... just a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nHeh. If you're trying to make him pissed or something, I don't think it's working. Just leave him alone, all these damn \"Ahhh, that goddamn Trexor is such a prick!\" comments filling up the pages are getting very irritating.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nif you ignore them they do not exist\r\nif you ignore them they do not exist\r\nif you ignore them they do not exist\r\nif you ignore them they do not exist\r\nif you ignore them they do not exist\r\nif you ignore them they do not exist\r\nif you ignore them they do not exist\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nif you ignore them they do not exist\r\nif you ignore them they do not exist\r\nif you ignore them they do not exist\r\nif you ignore them they do not exist\r\nif you ignore them they do not exist\r\nif you ignore them they do not exist\r\nif you ignore them they do not exist\r\nif you ignore them they do not exist\r\nif you ignore them they do not exist\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nEveryone after 3... 1 2 3 \"AWWW Maynard loves his Mummy\" This song kicks arse, Not at all pro-religion, but pro-Judith-Marie. He admires the way she, through 10,000 days of a living death, did not falter or betray her faith. He disagrees with her beliefs totally, but he respects her with all his heart. Incredible.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nThis song is so emotionally moving. I feel for the lyrics SO much. As many before me, I have cried my eyes out to this song. The reason: I can relate. I have lost a family memeber and I have always butted heads with this person. But damnit, if my family member isn't in heaven now, I would be SO pissed off. They had  to live through hell, like most people do. \n\r\n\"Never lived a lie.\r\n Never had a life.\r\n But surely saved one.\"\n\r\nand\n\r\n\"Shake your fist at the gates saying:\r\nI have come home now.\r\nFetch me the spirit.\r\nThe son, and the father.\r\nTell them their pillar of faith has ascended.\r\nIt's time now, my time now.\r\nGive me my, give me my, wings.\"\n\r\nREALLY describes this person. Always putting burden upon himself so others can succeed, always being true to himself. It's just amasing that Tool can so accuratly, accutely, depict, and express (Not enough adjectives in the world to describe what I want to write here) what many of us here feel in our every day lives.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nawesome song *tear*\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nIf you want a better understanding of Judith-Marie and Maynards feelings towards her religion, you might want to check out his commentary on the \"Judith\" video on the APC DVD \"Amotion.\"\n\r\n10,000 Days is an amazing album.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\n\"Ignorant fibbers in the congregation. \r\nGather around spewing sympathy. \r\nSpare me... \r\nNone of them can even hold a candle up to you, \r\nBlinded by choices hypocrites won't see. \"\n\r\nBest sums up Maynard's feelings for his mother in this song, in my opinion. Though I agree that the \"Give me my wings\" (and preceeding) part is by for the most musically moving part of the album.\n\r\nWhat goes through my head:\n\r\nYou've been through Hell for 10,000 days and your faith hasn't flickered. The pain, the terror.. but you never gave up. There's sympathy for you, but they might be lying- they're nothing like you. In fact some of them didn't like you- but they're blind, they can't see, they're a Judas to you. And now that you'r gone, in fact, they're going to be blind. Let the rain come pouring down, but what will they do when the rivers overrun? Without you there to lead them on. You are the one, the only, the absolute; you're going to go to Heaven and when you get there, you have the right to ask for the Father, for his Son, for the holy Spirit. You can hold your head up high, your voice can be loud, you have the right. You've earned it. You'd better get your fucking wings... you've never lived a lie, you've never taken a life. And you've saved mine. You deserve your wings... you wanted to walk, but now you don't have to any more...\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nIf you add up the lenghs of Viginiti Tres and Wings part1, you come up with the exact length of 10,000 Days (wings part 2).\n\r\nI hear that if you play Viginiti followed by wings part 1, they sync up PERFECTLY with 10,000 Days (wings part 2), creating something which should be (haven't heard it yet, can't find good synching freeware on the net) mindblowing and a damn good toolgasm.\n\r\nThe reason Viginiti Tres is called that is because Viginiti Tres means 23 in Latin, and 23 is the number of synchronicity.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nThis song reminds me of Lateralus alot, and I am begining to like it better, anyway, It is kind of telling about someones ascending, and that they won't be forgotten. I just love how it sounds.\n\r\nGIVE ME MY WINGS!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nThis song is amazing.  The first time I sat down and listened to the album all the way through and actually LISTENED to it, I was literally crying from Jambi until this.  It's so amazing how much maynard respects and loves his mother.  Such beatiful words.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThis got erased so I'm reposting it \n\r\nI believe theres a lot more to this song then just a tribute to his mother. I see this song having a few things goin on all at once. First: He's saying to the believers of christianity, what are you gonna do when the world around you is collapsing, and theres no savior to guide you? example:\n\r\nListen to the tales and romanticize \r\nHow we follow the path of the hero \r\nBoast about the day when the rivers overrun \r\nHow we rised to the height of our halo \r\nListen to the tales as we all rationalize \r\nOur way into the arms of the savior (We all expect Jesus/god to save us when it's all coming to an end, but in face they won't be there)\n\r\nI also see Maynard comparing the hardships that his mother had to experience to the life of Jesus, and placing his mother in a higher light. example:\n\r\nFading all the trials and the tribulations (of Jesus)\r\nNone of us have actually been there \r\nNot like you (his mother has been through the trials and tribulations)\n\r\nIgnorant fibbers in the congregation \r\nGather around spewing sympathy \r\nSpare me \r\nNone of them can even hold a candle up to you \r\nBlinded by choices hypocrites won't seek\n\r\nThis little light of mine \r\nThe gift you passed onto me \r\nI'll let it shine \r\nTo guide you safely on your way \r\nYour way home (thanking his mother for unconditionally loving him, and allowing him to become the great person he is now)\n\r\nWhat are they going to do when the lights go down \r\nWithout you guide them home to zion \r\nWhat are they going to do when the river is overrun \r\nOther than tremble incessantly \n\r\nHigh as a wave but i'll rise on up on the ground \r\n(Again, what are all you believers gonna do when the shit hits the fan, I (maynard) will be the only one in comfort) \n\r\nYou are a light, and a wave, that they will only read about \r\nI only pray, heaven knows when to lift you out \r\nTen thousand days in the fire is long enough \r\nYou're going home (speaking of both his mother and Jesus, the 10,000 days can also be speaking of how long Jesus lived for. Comparing them both, but again I feel maynard is still holding his mother in a higher light then Jesus)\n\r\nThe next part is tough\r\nYou're the only one who can hold your head up high \r\nShake your fist at the gates saying: \n\r\nI have come home now \r\nFetch me the spirit \r\nThe son, and the father \r\nTell them their pillar of faith has ascended \r\nIt's time now, my time now \r\nGive me my, give me my, wings \r\n(I think this part can be interpretted many ways, but what I get is that he's telling his mother to confront her maker (if it exists) and tell them their reign of faith has reached its height, now it is Maynards (or humanities) time to shine.\n\r\nThe final paragraph i feel is Maynard saying to his mother that if there is a god, tell him that my intentions were good, though i failed to believe, and ask him to forgive me.\n\r\nI feel like the death of him mother, and her apparent strong faith in God has caused Maynard to question the things he may have dismissed in the past.\r\nThats my interpretation of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nHere are the lyrics the way i see them\r\nVery different than what you have.\n\r\nwings for marie (part 1)\n\r\nyou believed\r\nyou believed in omens none could see\r\nyou believed in me\r\nthe passionate spirit\r\nuncompromised\r\nboundless and open\r\na light in your eyes, yet\r\nimmobilized\n\r\nvacant, broken\r\nfell at the hands of those omens that i wouldn't see\r\nit was you who prayed for me so\r\nwhat have i done\r\nto be son to an angel\r\nwhat have i done\r\nto be worthy\n\r\ndaylight dims leaving cold florescence\r\ndifficult to see you in this light\r\nplease forgive this selfish question, but\r\nwhat am i to say to all these gouls tonight?\r\nshe never told a lie, well\r\nmight have told a lie, but\r\nnever lived one\n\r\ndidn't have a life, didn't have a life,\r\nbut surely saved one\r\nsee, i'm alright now\r\nit's time for us to let you go\n\r\nwings, part 2\n\r\nlisten to the tales and romanticize\r\nhow we've followed the path of the hero\r\nboast about the day when the rivers overrun\r\nhow we rise to the height of our halo\r\nlisten to the tales of how we all rationalize\r\nour way into the arms of the savior\r\nfating all the trials and the tribulations\r\nnone of us have actually been there...\r\nnot like you...\n\r\nignorant flippants in the congregation\r\ngather around spewing sympathy\r\nspare me\n\r\nnone of them can even hold a candle up to you\r\nblinded by choices hypocrites wont see\r\nbut enough about the collect of jewelers\r\nwho could deny\r\nyou were the one who illuminated\r\nyour little piece of the divine\n\r\nthis little light of mine it gives your past unto me\r\ni'm gonna let it shine to guide you safely on your way\r\nyour way home\n\r\nwhat are they gonna do when the lights go down\r\nwithout you to guide them all to zion\r\nwhat are they gonna do when the rivers overrun\r\nother than tremble incessantly\r\nhigh is the way\r\nbut all eyes are upon the ground\n\r\nyou were the light and the way\r\nthey'll only read about\r\ni only pray heaven knows when to let you out\r\n10000 days in the fire is long enough\r\nyou're going home\n\r\nyou're the only one who can hold your head up high\r\nshake your fist at the gates saying:\n\r\n\"I have come home now!\"\r\n\"Fetch me the spirit the son and the father.\"\r\n\"Tell them their pillar of faith has ascended.\"\r\n\"It's time now...\"\r\n\"My time now...\"\r\n\"Give me my...\"\r\n\"Give me my wings!\"\n\r\nyou were the light and way \r\nthat they will only read about\n\r\nset as I am in my ways and my arrogance\r\nburnen of proof tossed upon the believers\r\nyou were my witness\r\nmy eyes, my evidence\r\nJudith Marie\r\nunconditional one\n\r\ndaylight dims leaving cold florescence\r\ndifficult to see you in this light\r\nplease forgive this bold suggestion\r\nshould you see your maker's face tonight\r\nlook him in the eye, look him in the eye and tell him\r\n\"i never lived a lie\"\r\n\"i never took a life\"\r\n\"but surely saved one\"\r\n\"Hallelujah, it's time for you to bring me home\"\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nsome explanation of my lyrics above...\n\r\nwings for marie (part 1)\n\r\n\"you believed in omens none could see\"\r\nmakes more sense than moments\n\r\n\"a light in your eyes, yet immobilized\"\r\nThis not only makes perfect sense, but the music behind the lyrics takes a downward turn, mirroring the change to dark parts of the topic (immobilized, vacant, broken...)\n\r\n\"fell at the hands of those omens that i wouldn't see\"\r\nagain, makes a ton more sense this way\n\r\nwings, part 2\n\r\n\"fating all the trials and the tribulations\"\r\nreferencing the hard core christians who spout about being ready for God's wrath...\r\n\"none of us have actually been there...\r\nnot like you...\"\n\r\n\"but enough about the collect of jewelers\r\nwho could deny\r\nyou were the one who illuminated\r\nyour little piece of the divine\"\r\nThe collect of jewelers contrasts Judith's congregation with Judith herself.  Her congregation are self-proclaimed jewelers yet Judith is the one who found the shiny divine (jewel).\n\r\n\"set as I am in my ways and my arrogance\r\nburnen of proof tossed upon the believers\r\nyou were my witness\r\nmy eyes, my evidence\"\r\nThis is a powerful passage referring to the way Maynard was before she died...telling the believers in Christ to show some evidence, and he used his own mother's suffering as his evidence.  As in, how could God let this happen?\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nI think Eskimo nailed it.  This song almost made me cry-right where the lyric \"Give me my wings\" is repeated with such intensity.  I don't think MJK is alluding to any new found faith-this song is about his mother's devotion.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nyep eskimo_8 and thirdeyewide have got it absolutely right. Unlike alot of other Tool songs, I can say with 100% assurance that I know what i'm talking about! That this is about Judith's devotion to God, and as eskimo_8 mentioned, Maynard is quite disgusted with her god, but is both respectful and inspired by her. She prayed and kept the faith without fault, and recieved nothing in return. MJK seems truly inspired by her relentless faith in these lyrics. After all this spite towards God though, I think, and I may well be wrong, that MJK is saying that she is going home (to heaven) and that all the faith has finally paid off; that she has done her time, so to speek. That's basically my interpretation of the song, and how he feels about her mother's faith. This is mainly about how his mother feels towards God, but on the song, \"Judith\" by A perfect circle, the lyrics are based around how Maynard feels about his mother's faith in God.\n\r\n- Please take the time to read this if and tell me if i'm right or wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nyes, hawk_er_8, eskimo_8, and thirdeyewide, I feel the same way about this song.\n\r\nI do have a question, though... On the line \r\n\"Fading all the trials and the tribulations\"\r\nCould that actually be\r\n\"Feigning all the trials and the tribulations\"?\r\nThat's what it sounds like to me...  I don't know, I could be deaf.  \r\nBut it would make sense, though.  The fact that the holy rollers boast about the 'end of days' and such and how they 'endure' their trials and tribulations and all that jive christian nonsense, when in actuality they've never been through any of that... Not like Judith Marie.\n\r\n\"None of us have actually been there. \r\nNot like you.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI hate to say it, but I'm actually suspicious about a lot of the lyrics posted, so it's totally possible...I'll have to go listen again.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nWell, well. It's nice to see we're all confused. Wings pt.2 is definately \"eerie\". I think these songs are for two subjects here, Maynard's mother, yes... but also his God. \r\n-Now it's time for us to let you go.\r\n-It's time for you to bring me home.\n\r\nQuestion: Read Revelations XXv3\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nyes it's feigning, not fading.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nI've dreamed of this song... \r\nThis album is REALLY making me think!\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nDo this:\r\nCopy Vinginti Tres and Wings for Marie into your computer and burn a cd with the two songs following each other (in the order mentioned). Then play those tracks on one stereo while simutaneously playing 10,000 Days (the song) on another. Make sure the times are exact. I swear you're gonna fucking come. Or cry, either way is fine.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nOr use 2 different media players on your computer at the same time\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\ni just wish lyrics could be posted AFTER an album is reased for 2 reasons:\n\r\n1. the lyrics are definate and official\r\n2. we wouldnt get people fighting about whether the album was actually real or not rather than what the song was about GOD!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nhawk- 9 times out of 10 you'd be right... but Tool has never included the lyrics in the liner notes... and 10,000 days is no exception...\n\r\nit's up to us to figure it out...\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nThe most touching song I've ever heard.  How can people say this album is a hoax?  It just goes to show you that they're collective IQ can't top a hundred.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\ncould be feigning but I thought (as you could have seen in my post above) that it was fating, as in:\n\r\n\"fating (predicting) all the trials and the tribulations\"\n\r\nfeigning means giving a false appearance of, or faking for example.\n\r\n\"feigning (faking) all the trials and the tribulations\"\n\r\nI guess that could work as well.  Sounds more like a 't' or 'd' (fating or fading) than an 'n' (feigning) to me.  Any comments on omens vs. moments?  It sounds definitely like moments in those 2 lyrics, but it COULD be omens and that would definitely make more sense:\n\r\n\"you believed in omens none could see?\"\r\n...or...\r\n\"you believed in moments none could see?\"\n\r\nand again later in the song...\n\r\n\"fell at the hands of those omens i wouldn't see\"?\r\n...or...\r\n\"fell at the hands of those moments i wouldn't see\"?\n\r\nHow about the collect of jewelers or collective jewelers instead of collective judas?  Jewelers makes more sense when you read the line that follows:\n\r\n\"but enough about the collect of jewelers\r\nwho could deny\r\nyou were the one who illuminated\r\nyour little piece of the divine\"\n\r\nthe illuminating a piece of the divine makes the jewelers comment fit better IMO\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nI don't know, you could be right, those areas are just hard to make out.  If you are right about the jewelers part, then I think that it would probably be 'collective'.  \r\nCollective being a group of people who share or are motivated by at least one common issue or interest, or work together to achieve a common objective.\r\nThat seems to fit the definition of organized religion and the ghouls in this song. They were just a bunch of hypocrites, and Judith was the one who shined above them all (or illuminated her piece of the divine).\n\r\nWonder when ToolBand is going to post the lyrics??\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nthis is just one part of his song to his mother for the other go to vigintri tres and look at the site i posted all will be revealed soon enough.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\ntime to throw out another idea that may have escaped a few people posting here...\n\r\nso Maynard has had a beef with God for some time now... he made no secret of it in the song 'Judith' ('fuck your god')... how he was clearly angry with what had happened to his mother, despite her faith...\n\r\nso now, that his mother suffered for around 10,000 Days.... and she finally dies... now suddenly Maynard's going to accept and love God?\n\r\nno, this song might be the most cynical Tool songs ever in respect to religion... it seems he's demanding (from god no less) satisfaction for all his mother's faith and suffering... basically, that if anyone deserved the eternal reward that she did...\n\r\nanyway, just couldn't wrap my mind around how he would get all soft and mushy on god now that his mom finally died...\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nIâ\u0080\u0099ve read a lot of posts on here, and some of them disappoint me. Iâ\u0080\u0099ve come to the realization there are many Tool fans that are missing so much depth, lyrically and instrumentally. To simply dismiss Maynardâ\u0080\u0099s poetic ingenuity with comments like â\u0080\u009cMaynard has had a beef with God for some time nowâ\u0080¦â\u0080\u009d is quite elementary. When Maynard says, â\u0080\u009cFuck your God,â\u0080\u009d heâ\u0080\u0099s not literally stating to God, â\u0080\u009cFuck You.â\u0080\u009d Instead, heâ\u0080\u0099s using â\u0080\u009cYour Godâ\u0080\u009d to symbolize his motherâ\u0080\u0099s perception of â\u0080\u009cGod,â\u0080\u009d that is, a man-made institution which has much more in common with business than spirituality. To understand this song, one must go back to Opiate. The title of this album is derived from a famous line stated by both Marx and Engel, â\u0080\u009cReligion is the Opiate of the masses.â\u0080\u009d Thatâ\u0080\u0099s self-explanatoryâ\u0080¦at least I hope. So, with that said, one can easily understand how Maynard believes organized religion is a tool used for oneâ\u0080\u0099s own personal gain and to distract and control the masses, that is, you. Now this much should be evident, but from the posts Iâ\u0080\u0099ve read, itâ\u0080\u0099s clearly not. If you donâ\u0080\u0099t believe me, hereâ\u0080\u0099s a quote directly from Maynard: \n\r\n\"My views against Christianity or religion in general are directed towards the 'middle men'-those who are in power and use religion as a market force by which to manipulate human beings for their own personal gain. The middle men taint any purity of spirituality that could result from genuine religious/mystical experiences\". â\u0080\u0093Maynard James Keenan\n\r\nNow, letâ\u0080\u0099s analyze â\u0080\u009c10,000 Days.â\u0080\u009d In this song, Judith Marie embodies a â\u0080\u009cPillar of Faith.â\u0080\u009d This is such a powerful image to take in that I fear its meaning was lost to many. Judithâ\u0080\u0099s faith in this man-made institution was so strong, that it stood in its own right. Amongst these hypocrites, merely claiming religion for its social acceptability, there stood Judith. Physically disabled for â\u0080\u009c10,000 Days,â\u0080\u009d her faith acted as a witness to Maynard of spirituality so pure amidst a charade of an establishment. Let me reinforce Maynardâ\u0080\u0099s quote: â\u0080\u009câ\u0080¦The middle men taint any purity of spirituality that could result from genuine religious/mystical experiences.â\u0080\u009d And thatâ\u0080\u0099s just the surface. I could write pages on this song. Peel the layers and open your third eye people. â\u0080\u0093The Zen Master\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nBy the way, the above comment was in no way directed toward everyone. There are a lot of great ideas being shared here. Keep it up. -The Zen Master\n\r\n\"Overthinking, overanalyzing separates the body from the mind.\" -Tool, \"Lateralus\"\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nWell said.  \n\r\nI think I got lemon juice in mine...Since I'm pretty sure I'm already out of my body...I might as well float around a little...\n\r\nThere seem to be a variety of lyrical hints that point AWAY from the \"born again\" theory.  the one that jumped out at me was \" Fetch me the spirit. \r\nThe son, and the father\"  The Trinity is a big deal to baptists, but MJK makes a point to reverse the order.  I don't think this was by mistake, or for aesthetics. When he refers to his mothers religion, he is singing from a watchers point a view-not someone who has been \"saved\".\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nTREXOR I actually respect how disliking a Tool album must feel if you are a huge fan. God knows I'd be distraught if I didn't like 10,000 Days, but I can't help thinking (and I'm not insulting you here) that maybe you need to be a little more open-minded to change. This song at least is, in my opinion of course, a masterpiece. It genuinely moves me. I fail to understand how it doesn't do the same for you although it's your choice whether or not you like it. \n\r\nI do have one request though. Assess these ongs negatively if you must but please do not commit the mistake of saying they are BAD songs when they clearly are not. Is it not possible that they are just not to your taste? Don't take this as a childish rant as some of these posts have been. I just genuinely believe that you are approaching this album in a way that is making you miss the point.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nHey all! Congrats for keeping such a great site up...\r\nAs for this music, was I the only one who got it as a call to the illuminati and the protocols of Zion? Hence, the name of the album plus the picture of the Mayan? \r\nBut what is the relation between 2012 and 10.000 days?\n\r\nCheers\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nThis is by far the most moving song I've ever heard.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nI donâ\u0080\u0099t want to give my opinion on this or any other Tool song, lest I start a new religion or something (thereâ\u0080\u0099s way too many of them already and a war for almost every one of them).\r\nThen again, there might be a couple of bucks to be madeâ\u0080¦ Hmmmmâ\u0080¦.\r\n(Who the hell am I kidding?)\n\r\nBut seriously, when I heard this song for the first time I got this eerie sense of dÃ©jÃ  vu! My grandfather, a devout Christian, passed away more than a year ago. While I was standing next to the grave, I was thinking the same thing, not the exact same words (or in English either) but extremely similar.\r\nItâ\u0080\u0099s almost as if, at that moment, you are willing to give up what you believe/do not believe, hoping that he was right and that he is where he deserves to be.\n\r\nI dunno if Maynard felt the same way when he wrote this, but I donâ\u0080\u0099t really give a shit. This song will be a reminder of that moment (well, for me) until I go deaf or lose the CD, or the lights go out or whatever, you knowâ\u0080¦\n\r\nOh, and that whole thing of listening to 10000 days and Viginti Tres/Wings pt1 at the same time, quite cool. I used media player and good timingâ\u0080¦ \r\nIf somebody has enough time, please construct a new set of lyrics with all the words in the correct order, so we can finally break this damn code!!!\r\n;o)\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nI love ZEN MASTER's interpretation.  Wonderful quotes, nice incite, this is why I come to this board, is to read and see that others feel the same as I do.\r\nAnd I hope I'm not the only one who is just annoyed that this message board has turned into Trexor's bash page, both on him and on Tool's songs.  Take it somewhere else, please.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nI heard the leak, or at least what i thought was the leak, and now i own the CD (WHICH IS MY NEW FAVORITE) and the songs have only roughly the same words. maybe i got something that someone said was tool but wasn't, but the cd is a 10,000 times better than the songs i heard on the leak.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nThis song is amazing..\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI think people so misinterpreted this album as christian or something.  \n\r\nit is so obvious it's an anti-war album\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nI guess his mother is someone who gives Christians a good name despite all the hypocrites.\n\r\nReading these lyrics almost made me cry. This song is beautiful, and by far my favorite part of the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nVocalist Maynard's lyrics have frequently underscored his anti-religious sentiments.  Surprisingly though, the lyrics for Part 2 read like a prayer hymn, and they also reveal an absolute reverence for a mother he apparently considered angelic.  But this religious language/referencing/allusions is probably just an indicator of how highly he held his mother, not laced with sarcasm and not a contradiction of other lyrics.  Whatever his personal views of religion, he believes his mother was pure and is worthy of being by her maker's side, worthy of demanding her wings.\n\r\nI don't think the lyrics are sung cynically, and anyone who thinks otherwise is one very cynical individual indeed or trying too hard.  Accept the song in isolation for what it is, which should be apparent.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nI love this song.  It sounds like he's saying his mom had more faith in her little finger than anyone he's ever known and she deserves to be in Heaven upon her faith alone, that no one else he knew doesn't compare to her and how much love and conviciton she had for God. \"Set as I am in my ways and my arrogance. Burden of proof tossed upon non-believers. You were my witness. My eyes, my evidence. Judith Marie, unconditional one.\" seems to me that no matter how much he hates the 'middle men' of religion he sees something there because he saw it in his mom.  That maybe she spoke of her faith with such conviciton he knew that she believed it to her core and he couldn't argue with that.  Anyhow, that's what the song means to me, Either way, it's a beautiful song from a genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nSuch an inspiring song. It is 2:48 AM where I am right now. I have gotten no sleep at all tonight my mind is not at ease in this tough time in my life. So I put on this CD because, usually I play this song and it's so mellow it puts me to sleep. Not the case tonight. The meaning of the song seemed to really be reinforced this time around. This song really speaks to me about taking the hardships dealt to us in life and being able to as it states \"hold your own head up high\" and do your best to be the best person you are capable of being and not giving up to the feelings of depression and frustration evoked by a sense of hopelessness. Well now it is 2:51 AM here, my mind is much more at ease. Good night.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nREAD THIS!\r\nsorry if someone has said this, but listen to this:\ntheslackerslounge.com/…\r\nit is wings 1&2  and viginti tres synched\r\nif you have not heard it, LISTEN!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nUUHHHHM that one does not sound as good as this one.....LISTEN TO THIS ONE!\r\nBest I have found...what has anyone else found?\nsensoryaberration.com/test/…\n\n\n", "comment_132": "\nI was about to comment on this but then i saw what zenmaster said. very well done explanation.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\ncri0626, I much appreciate the link, because I have wanted to do this test myself. But I think the mixing could use some work.\n\r\nWings for Marie was mixed too quiet, and Viginiti Tres was mixed a bit too loud. I also think that maybe we may have Viginiti and Wings backwards, so I will be trying Wings->Viginiti stacked on 10,000 for my own test.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\ni agree.  parts should be louder, things could be synched differently...i have no idea how to do it on my own...i can only listen other's scraps :(\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nAlright, I have tried both mixes.... and I can't decide which is the proper way.\n\r\nOn the one hand, we have 23 leading into Wings. This version syncs up the ending verses nearly perfectly, as if the two singers just have their timing off a bit.\n\r\nOn the other hand, we have Wings leading into 23. With this version, as the first 'give me my wings' line is completed, the sounds in 23 that sound like flapping wings start. Also, as he starts the line about cold flourescents, it hits the crackling sounds that are similar to the buzzing of flourescent lights.\n\r\nIf I can find a good file sharing server, I will post links so everyone can try them out.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nI think it should be Wings leading into viginti Tres...I hope I get to hear it that way!\r\nNow I am frustrated b/c I do not know how to do it. \r\nI have just bounced around to the different times in the songs...so it sounds great in my head..........\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nmmmm no i take it back...duhh, just opened my music and itunes and played it  as stated aove and the lyrics run all over each other...  I think it has to be the other way?\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nok, this is a little bit out of contex, but bare with me... from may newletter on toolband.com\n\r\n'Granted, these people (the people who didn't believe the conspiricies) of relative affluence might not 'know' that 10.000 Days is merely a decoy album like you do, or that \"Wings for Marie\", \"10,000 Days\" and \"Viginti Tres\" are meant to be synched (played together) to make a super 'hidden' track, or that a very limited number of copies of the live DVD were released on 6.6.06 but can only be purchased by those giving the correct password (or is it a special handshake?) to sales clerks in certain record stores, but still, let's not conclude that they're not TRUE fans.'\n\r\nWings and Vigniti Tres were never meant to be sychronized...\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nyou could play anal cunt with virginti tres in the background and it'd sound synch'd.. \n\r\nbasically everyone who posts here sucks by the way.. even me.. i suck, and before you post.. nobody likes you.. and i bet that being a tool fan has ruined your life.. well at least your sex-life.\n\r\noh and about 10,000 days.. justin owns.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nI like to quote things... \r\nok, this is a little bit out of contex, but bare with me... from may newletter on toolband.com\n\r\n'Granted, these people (the people who didn't believe the conspiricies) of relative affluence might not 'know' that 10.000 Days is merely a decoy album like you do, or that \"Wings for Marie\", \"10,000 Days\" and \"Viginti Tres\" are meant to be synched (played together) to make a super 'hidden' track, or that a very limited number of copies of the live DVD were released on 6.6.06 but can only be purchased by those giving the correct password (or is it a special handshake?) to sales clerks in certain record stores, but still, let's not conclude that they're not TRUE fans.'\n\r\nWings and Vigniti Tres were never meant to be sychronized...\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nOkay screw it I don't have time to read all your posts so if I cover something that's already been said I apologize. I think that's pretty interesting that the song is partly about his mother, but I don't think that's the most important message here. I think he references that to say, \"okay here's what I learned from her, and now...this is what I make of it in relation to the world\" \n\r\nTo me, this song takes the christian belief that they are to be saved from hell on earth one day while the rest of us remain here to suffer. And the song cleverly shows this view for what is really is... preposterous. When maynard says \"you're the only one who can hold your head up high, wave your fists at the gate sayin, 'I have come home now!'\" he doesn't mean it literally he's just showing that that's what these people actually believe but the truth is non-religious people can be just as-if not MORE enlightened than relligious. (Religion means you have a set system of beliefs with strict rules and guidelines) so don't mistake sprirituality with religion there is a difference. And for all those people who call themselves a religious name like christian or catholic, yet they don't actually follow the guidelines accordingly...Guess what? You're not christian or catholic so stop saying you are. I believe in reincarnation but I don't go around saying I'm a buddhist. Cause many of the details surrounding my beliefs are very different than buddhism. \n\r\nAnyway sorry for goin off on a tangent there, back to the song...\"burden of proof tossed upon non-believers\" I think this refers to how religioun can't prove anything it preeches and nor can non-religious people dis-prove it. Therefor the actual state of world should be left simply to what is more logical, and we should accept and admit the things we don't know and move on. Suggesting theories is all well and fine as long as we acknowledge that they are just that. Theories. And that anything is still possible.\n\r\nWell goodnight\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nThis\r\nSong \r\nRocks\n\r\nAt fist I was a little dissapointed when I heard the album but this song makes it all worth it\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nMoose T- great insight...  I am really glad you chose to post.  I believe we are all a bit more enlightened now that you have graced us with your superior wisdom.  Thank you so much.  I will strive to become more like my new hero: Moose T!\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nwow, how clever... other people posting with handles that look like mine...\n\r\nwow, and i thought i didn't have a life...\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nAtrieu has been posting under my name for the last week or so...only if you look closely you'll notice that it's eQb and not eGb...\n\r\nsend all you hate email to Atrieu please...\n\r\nfor what it's worth... i haven't posted here in weeks prior to today...\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nGotta love all those who put words and thoughts into Maynard's head, or any artist for that matter.  Of all those that are saying this is a song pointing out Christianity as being preposterous might as well say he never listened to his own mom and if this was the case why would he say \"Your going home\" or \"This little light of mine, The gift you passed onto me\".  It could just as easily be argued that of all the people that preach it, he thinks she lived it and after all his criticizing of her beliefs (Read the lyrics to A Perfect Circle's, Judith) he finally recieved the message that faith is what saves you, saved her.  Not the preaching.  \n\r\n\"Please forgive this bold suggestion... \r\nShould you see your maker's face tonight. \r\nLook him in the eye \r\nLook him in the eye, and tell him. \r\nI never lived a lie, never took a life. \r\nBut surely saved one, hallelujah. \r\nIt's time for you to bring me home\"\n\r\nHmmmmmmmmm, did mommy save Maynard??  Just shut up and listen to the damn song until you can sit Maynard down in the same room as you and ask him yourselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nOh crap, I just thought of something else to put into Maynard's head...Judith came out on A Perfect Circle's May 23, 2000  album, Mer De Noms...Judith Marie Garrison died on June 18, 2003 and this song comes out May 2, 2006.  Big difference between the two songs, he certainly isn't saying \"for all your naivete you're going to rot away in the dirt\" when you read this.  Hmmmmm\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nStorm effects = Friggin Brilliant! They even seem to be in synch with the music and not just pasted on. I'm not going to repeat what others have said cuz it seems that the jist of the song is obvious by now. Btw am I the only one who believes the whole album is about death? Anyway, the last line of the song- \"Hallejuiah it's time for you to bring me home\" really stands out to me. In relation to the last line of Wings Pt 1 it seems that MJK may be coming to terms with his own death, making \"The Pot\" his last will and testament... Just a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nSorry for double posting but I was wondering if anyone preferred one part of \"Wings\" than over the other. I know they are the same song but obviously they made it as two parts for a reason. Personally I prefer Pt 1 over Pt2 because of the guitar's transition from the left to right speaker.\t\t\t\t\n\t\t\t\t\n", "comment_150": "\ni wonder how my kitty cat feels?\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nHave anyone tried to reverse the order of pt1 and pt2? The transition is perfect, xcept that part1 speeds up a bit.. It also does makes sense that pat1 ends with \"Alright, now it's time for us to let you go\" I believe that the order should be reversed for these two tracks...\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nUh, clearly all these people who are reading \"Maynard's Conversion\" into the song have an agenda to save the unbeliever. Why are you so determined to make Maynard religious and christian? Maynard clearly has contempt for faith, especially christianity, so I suggest you stop reading your own biases and contempt for non-believers into this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nUh, clearly all these people who are reading \"Maynard's Conversion\" into the song have an agenda to save the unbeliever. Why are you so determined to make Maynard religious and christian? Maynard clearly has contempt for faith, especially christianity, so I suggest you stop reading your own biases and contempt for non-believers into this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nWings pt 1, Viginti Tres & Wings Pt 2 were NEVER MEANT to be put together.  The effect works somewhat, for about 70% of the combined \"song\" but let me tell you as someone who's studied music, NO MUSICIAN WITH ANY INTEGRETY WOULD IN HIS OR HER RIGHT MIND HAVE TWO KEYS IN OPPOSITION PLAYING AGAINST EACHOTHER AT THE SAME TIME.  No matter how you cut it, there is TOO MUCH CLASH for these tracks to work together in any way other than the way they were arranged on the album.\n\r\nDo not heed the words of the sarcastic.  You will only sully the majesty of the album by mashing these together.\n\r\nIncidentally, Darkside of the Moon & Wizard of OZ work WAY BETTER together.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nthese lyrics, to me, are sooo clear:\n\r\nIgnorant fibbers in the congregation.\r\nGather around spewing sympathy.\r\nSpare me...\r\nNone of them can even hold a candle up to you,\r\nBlinded by choices hypocrites won't see.\n\r\nBut enough about the collective Judas\r\nWho could deny you were the one who illuminated.\r\nYour little piece of the divine.\n\r\nThis little light of mine,\r\nThe gift you passed onto me.\r\nI'll let it shine,\r\nTo guide you safely on your way.\r\nYour way home. \n\r\nfirst stanza he is talking about how in any religion there is always a degree of betrayal. they dont really accept you like they say you do. then he is talking about, in the third stanza, he is talking about how he woul give his life for someone he cared so deeply for. but in his mind that isnt good enough.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nI think maynard has run out of inspiration w/ tool, its not a fake album.  I think he is more interested in doing slower more melodic music now. As do most musicians when they age. Hence why he took an inspirational break from tool to do a perfect circle. There are some great songs but this album obviously isn't filled with the hate and anger that say opiate was.  It seems much more spiritual and about maynards dealing with his mom dying.  Seems to me maynard is waiting for the end of the world and preparing.  I've even heard the floor in his room is raised into a dome so when the water comes in LA his bed will be lifted off.  IDK though...could all be bullshit. Tools following is quite filled with drug addict paranoid schizo's.  Its  agood album but far from aenima and lateralus....and me being the metal head I am I still like opiate and undertow the best.  OPiate is what got me into playing and listening to music. It had balls and gumption.  Maynard doesn't have as much volume in his voice as he once had.  It happens when singers get older. He seems to rely more on effects and layering too.  Opiate had three live tracks too that are unbelievable.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nAnyone who says this song is a satire against his mother is obviously trying to pull whatever s/he can to make him out to be anti-christian.  This song is clear that, at the very least, he is starting to become more open to the idea of christianity, albeit not the \"middle-man\" religion itself.  This, Wings part 1, and Jambi all have CLEAR references to this, and anyone who says that he is making fun of his mother is ridiculous.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nI really love how in this song how he is so hateful, then loving, then hateful. I also love it how he pretty much threatens got and tells him, you better give my mother an enterence to heaven or we have a problem. Great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nmmmmm pre-album blog. the sweet sweet smell of ignorance.  sorry for the sarcasm but just couldn't help it. \r\nWith that said, I absolutely love this album.  Maynard seems to have spared us the excrutiating pain of trying to figure out deep hidden meanings this time, as his \"hints\" are pretty strong and salty in Vicarious and Right in Two.  As for Wings of Marie pt1 and 2 I was very impressed initialy with the musical and vocal progression and I enjoyed the spiritual bits while not quite certain what the whole thing meant.  Then I got realy curious and started poking around till I found out the whole story.  \r\nSat down, dug up the lyrics to Judith and Wings pt 1 and 2 and almost cried when I finished listening to it all.  VERY deep and emotional.  I've always enjoyed Judith (APC if you dont know) but always thought it was just strong sarcasm at organized religion.  Today for the first time I realy felt the sting in it.\r\nOnce again Maynard has mesmerized me with his intricate and beautiful lyrics and big props to the rest of the band for their music just keeps getting better and better.\r\nPS: I absolutely love the climax at 5:30\r\nGIVE ME MY WINGS!\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nI haven't had a chance to read all through the other posts, but I think that this song (and the whole album)  very strongly states the need for a female voice to come back to spirituality.\n\r\nTake the lines, \"Fetch me the Spirit, the Son and the Father/Tell them their pillar of faith has ascended.\"  In this line, Maynard's mother, which could be a representation of the female, is ascending into heaven - ending the separation between God and Human, Man and Woman.  i feel like this album is a call to embrace femininity again.  \n\r\nOf course this is only one interpretation...there are many more layers and deeper meanings involved here.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nBack to this song, did anyone think of the Vietnam War aka the 10000 days war as a possible subject for this song, \"ten thousand days in the fire is long enough\", \"follow the path of the hero\", \"who will guide them all to Zion\", \"blinded by choices hipocrites won't see\", there just a lot to me that looks like it could be about the Vietnam War in fact it was my first thought upon hearing the song and the title of the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nThis song is absolutely incredible.I got chills listening to it live in Dallas last month. My favorite band.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nit isn't \"ignorant fibbers\"\r\nit is ignorant FLIPPANTS\n\r\nflip‧pant  Pronunciation[flip-uhnt] \r\nâ\u0080\u0093adjective\r\n1.\tfrivolously disrespectful, shallow, or lacking in seriousness\n\r\nmakes alot more sense given the context of the verse.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nThis song is bad ass. Im pretty sure he says \"feigning all thje trials and tribulations\",since feign is to pretend,and it precedes \"none of us have..been there\"\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nWell done Tool :)\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nIt's not FLIPPANT, foreskin. It is most definitely FIBBERS.\n\r\nProper and complete lyrics below...\r\n_______________________________________________________\n\r\nListen to the tales and romanticize\r\nhow we'd follow the path of the hero.\r\nBoast about the day when the rivers overrun\r\nhow we'd rise to the height of our halo.\n\r\nListen to the tales as we all rationalize\r\nour way into the arms of the savior.\r\nFeigning all the trials and the tribulations,\r\nnone of us have actually been there...\r\nNot like you.\n\r\nIgnorant fibbers in the congregation\r\ngather around spewing sympathy.\r\nSpare me.\r\nNone of them can even hold a candle up to you,\r\nBlinded by choices hypocrites won't see.\n\r\nBut enough about the collective Judas.\r\nWho could deny you were the one who illuminated?\r\nYou'll have a piece of the divine.\n\r\nThis little light of mine,\r\nthe gift you passed onto me.\r\nI'll let it shine\r\nto guide you safely on your way...\r\nYour way home.\n\r\nWhat are they gonna do when the lights go down,\r\nWithout you to guide them all to Zion?\r\nWhat are they gonna do when the rivers overrun,\r\nother than tremble incessantly?\n\r\nHigh is the way but our eyes are upon the ground\r\nYou were the light and the way they'll only read about.\r\nI only pray Heaven knows when to lift you out.\r\nTen thousand days in the fire is long enough...\r\nYou're going home.\n\r\nYou're the only one who can hold your head up high,\r\nshake your fist at the gates saying,\r\nI have come home now!\n\r\nFetch me the spirit,\r\nthe son and the father.\r\nTell them their pillar of faith has ascended.\n\r\nIt's time now, my time now!\r\nGive me my, give me my wings!\n\r\nGive me my (x 5),\r\nGive me my wings.\n\r\nYou are a light, a way\r\nthat they will only read about.\n\r\nSet as I am in my ways and my arrogance,\r\nburden of proof tossed upon non-believers.\r\nYou were my witness,\r\nmy eyes, my evidence...\r\nJudith Marie, unconditional one.\n\r\nDaylight dims leaving cold fluorescence.\r\nDifficult to see you in this light.\r\nPlease forgive this bold suggestion.\r\nShould you see your maker's face tonight,\r\nlook him in the eye,\r\nlook him in the eye and tell him,\r\nI never lived a lie, never took a life,\r\nbut surely saved one. \n\r\nHallelujah.\r\nIt's time for you to bring me home.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nbesides dude, look at the definition you posted...\n\r\nFLIPPANT is an ADJECTIVE.\n\r\nAdjectives aren't nouns and, therefore, don't pluralize.\n\r\nThe only noun form of flippant is flippancy, i.e., the state of being flippant.\n\r\nYou should really apply a little grammatical reasoning before you post such idiocy.\n\r\nHoller, bitch.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nJudith Marie, Beginning and End.\n\r\n3781256910411 + 11(23)\r\n   RPT                    RPT\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nJudith Marie, Beggining and End.\n\r\n37812569103411 RPT\r\n            +\r\n         11(23) RPT\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nHas anyone else realised the whispering in the background of this song?\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nI'm not saying there definitely is but yea i listened to it with my headphones on when i was stoned and yea, fuckin brilliant song whispering or not. 2nd best song, 2nd to Intension\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nGUYS this song along with Wings for Marie, Jimmy and APC's Judith is about Maynards mother....She was wicked religous, Maynard isnt...he used her religion out of respect for her songs, but that doesnt mean he is apologizing for anything, because he shouldnt, for he has nothing to apologize for. And he isnt devoting his life to jesus...I am a christian but I am not ignorant, and I am not going to put words in his mouth, and niether should you. Prison Sex and Sober are not trashy songs, they meaning is ugly yet Maynard says himself \"The uglyness is just as important as the beauty in the world\".\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nTrue. Very true. It is the ugliness in this world that makes you appreciate the beauty all the more.\r\n  Copy Viginti Tres fifteen times and sync with the album in whatever order you choose. Trust me.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nabsolutely sick song, seriously one of the best i have ever heard. anyone else get chills when listening? i love how he glorifies his mother, and tears down everyone that acts like they cared about her.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nHEY\n\r\nI'm not sure if it's been mentioned, but did anyone notice that:\n\r\n\"This little light of mine, I'm gonna let it shine\" \n\r\nwas so cleverly placed because that is actually the lyrics to a children's church hymn...\"this little light of mine\"\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nInteresting tidbit of info there\r\n There is most likely more to come regarding this album in time.\r\n  YAY TOOL!\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nthis song is about his mother judith marie and going to heaven and the shake your fist part is sayin hey you better let me in. she suffered for 27 years and never gave up on her faith. Thats what it is about, this is by far the most straight forward tool album to date i think part of that is because these guys are getting older.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nhi    my first langusge is not english but  ican find the lyrics but  honstly i don't understand the meaning of  the song  or tool's other songs  is it  about  rerligion or something like this   but  ilike   the music  it's great\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nokay, this song is absolutely brillliant. i am wondering though..and you could all be very helpful, i dont know alot about tools backround and manyards life etc, so find it hard to draw to some conclutions. what is manyards veiw on his personal religion? i know his mother was very faithful and the song sounds to be about her and her struggles and manyards conclution that she damn well better get into heaven, but within this is he questioning his belief? i was under the impression than tool was anti- religion, but this song seems to draw undertones that maybe his mother has not only been a light in his life  but that as he needs to beleive that she is going to heaven for his peace of mind, he has found himself on some level believing in the concept of heaven and hell. the song reeks of sadness and confusion, but still is moving and campassionate, and seems to be more 'love' than ' hate' in the confusion of it all. \n\r\nSet as I am in my ways and my arrogance,\r\nburden of proof tossed upon non-believers.\r\nYou were my witness,\r\nmy eyes, my evidence...\r\nJudith Marie, unconditional one.\n\r\ni dont know, im not so good wih my words..sorry if i rambled..\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nFrom reading the lyrics/listening a lot to the song, I've come to the conclusion that the song is about his mother's funeral. and Wing pt.1 is about her dying...? Well I'm pretty sure this one is about her funeral, if you read it, it describes pretty much what happened and what he thought about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nREAD AND LISTEN TO THIS!!!\n\r\n7812569103411/67584131221911310/15\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nYou would not be incorrect in what you have said cruiserfan. However, an interpritaion I had was that this song is describing the Day of Judgement when the dead will rise, including Judith. Being the devout believer that she was and considering the trial she went through, she would undoubtedly receive her inheritence in full. We love you Judith.\n\r\nGO SLEEP DEPRAVATION!  d_b\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nTool: The Cyclic Playlist.\r\n6,7,5,8,4,13,12,2,1,9,11,3,10 / 15 / 7,8,1,2,5,6,9,10,3,4\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nHey Coach slickback i definately have to agree with you on this one. but i did here that his mother died she had a broken back or something of that nature and she suffered for 27 years which is equivalant to 27 years\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nYou mean is equivalant to 10,000 days?\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nTool Synclist (complete)\r\n7,8,1,2,5,6,9,10,3,4 - 6,7,5,8,4,9,13,1,12,2,11,3,10 â\u0080\u0093 15,14 (or 14,15)\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nA Member by the name of Anikitos discovered that the order of Wings Pt1 and Pt2 can be reversed. Slipknot did the same with Vermillion Pt1 and Pt2.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nThis is a great song. It has a pretty slow start and thats probably why i didnt like it when I first heard it, but its just great. I love how most the songs on the 10,000 Days CD has great build-up to the end. I listen to this song when I'm tired (usually before i go to bed because its relaxing) and by the end I always want to get up and do something. I love the part where he says:\n\r\nSet as I am in my ways and my arrogance.\r\nBurden of proof tossed upon non-believers.\r\nYou were my witness.\r\nMy eyes, my evidence.\r\nJudith Marie, unconditional one.\n\r\nThats just good music. If you dont like Tool, then I dont like you. (Trexor)\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nThe beauty of Tool and an album like 10,000 days is, the more you listen to it, the better it gets and the more you grow to love it. unspeakably beautiful and Maynard's voice sounds  This particular song is almost otherworldy. Thank goodness for Maynard, Adam, Justin and Danny.  So much better than the rampant bullshit that's passed off as music these days.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nI hear that duhpeech! I found that the more I listen to this album, the more stuff I notice that I didn't notice before and it blows me away!\r\ne.g, with the line \"Judith Marie: Unconditional one\"\r\nthe \"ooooooooooooooooooooooone\" keeps going all the way to the recurring riff from Pt1. Pretty cool.\r\np.s: This song makes a great finale to the album, a'la 'Holy Gift'\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\ntool used to be such a cool band. undertow is so much better than Fageralus and 10,000 Gays. But for some reason the majority of tool fans believe this is some of their best work, what a bunch of idiots, anyone who thinks either 10,000 days or lateralus is their best album, obviously, has not listened to undertow or aenima, or is just a musical idiot.\n\r\nPS \r\nanyone who wears a TOOL t-shirt is stupid and should stop listening to the band alltogether, because, obviously, you just dont get it.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nYou don't get it either puddintime. You shot yourself in the foot as soon as you started making gay jokes. If you don't like Tool's new stuff then don't buy it. Tool have never been a band to release the same shit every financial year like most commercial bands today. Undertow was a good album for it's time but time moves on and people change, including the boys from Tool. Just because someone likes their new stuff doesn't make them an idiot. People are entitled to their opinions, which is why I'm not paying you out for liking Undertow. Anyway, Keep enjoying the hard shit and maybe when you're older you'll join the rest of us.\n\r\nPS\r\nI don't wear a TOOL T-shirt.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\n\"tool has never been a band to release the same shit every financial year like most commercial bands today...\"\n\r\nTrue, they don't put out stuff that sounds the same. but like most commercial bands they vastly overcharge for tickets, and they never do at least 1 show in all 50 states because theyre too busy playing huge arenas in europe, japan, new york, and LA, so they can make a fucking killing from ticket sales. I guess it's not enough that lateralus debuted at number one, i guess it's not enough they sell a shit load of t-shirts at hot topic, i also assume it wasnt enough that they won 2 grammys. i assume these werent enough because i have to pay 60-100some dollars to see them play some of their gay newshit, with some of their good stuff mixed in. that price is not including gas, because they (of course) didnt play a show anywhere near me. well i guess that's alright because i could always go download some of their shows they've taped, that sounds like a cool idea, maybe i'll get salival. whoops, that box set cost close to 80 dollars. ok then maybe i'll try finding a bootleg, or some mp3 recordings of their live shows, whoops, i can't find any, because it seems that tool probably doesnt allow people to record their shows. If you don't get the point I'm making, then i guess i have to spell it out for you, TOOL IS A COMMERCIAL BAND! You may not see them on mtv (anymore) but trust me, they're as commercial as the red hot chilli peppers, if not more.\n\r\n\"keep enjoying the hard shit and maybe when your'e older you'll join the rest of us.\"\n\r\nso I'm immature, because i don't like Tool's newest piece of ambient/emo/art shit heap they've put out. that's a load of bullshit. So if i'm immature for liking tool back when they weren't artsy, then thats fine with me, at least i have taste. if you can stand to listen to ambient noises and a few dissonant notes played here and there, with some expensive bongos played in the background, while some asshole moans about his dead mother and other stupid shit, then you have bad taste in music. listening to tools new albums doesnt make you smart, it doesnt make you a world renowned music critic, it makes you a know-it-all music dick. like those assholes who work at the indie-record store. stop giving tool money for making shitty albums this instant, and maybe they will make an album with the majority of the songs being under 6:30, or adding in some stupid chanting, and maybe, just maybe they'll make cool music again... wouldnt that be great?\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nNo, you're immature because your bitching about how some people like their new stuff, while some people, yourself included, enjoy Tool's earlier stuff. Just accept the fact that you're not going to change peoples' opinions. I am sure many people agree with you though. \n\r\nAnd about the shirt. Hahahahaha. People buy the shirt because they like the band. And in doing so allows them to have more money to create more music. Tool is commercial, but isn't every band. But they are not commercial to the extent RHCP is and other bands and artists.\n\r\nYou keep your opinion to yourself. And we'll keep our opinions to ourselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\n\"Opinions are like assholes, everybody has one, and they all stink.\"  We've all heard that phrase countless times.  I'm aware that there are many Tool fans who dig Aenima and Lateralus, but don't care too much for Undertow as a whole.  This is understandable as those three albums are decidedly distinct and different from each other.\n\r\nThe fact of the matter is, Undertow, Aenima and Lateralus have come and gone.  They are all ground that has been traversed and navigated, and when those explorations were completed, Tool moved on to new things and never went back.  Can you not at least respect them for constantly moving forward, regardless of how you estimate their work?\n\r\nIt is true that Tool's latest album has polarized and divided their fanbase, but it was bound to happen sometime.  Let's pretend they played it safe and stuck with what they knew, eventually people would start bitching that all their shit sounds the same.  When Tool or any other band releases an album unlike its predecessors, especially something unexpected, based on their style, there ARE going to be those that dislike it and become disillusioned with the band.\n\r\nYes, Tool is a commercial band; they are a product of American society, as are we all(those in America, that is).  They know how to make money and they do it, but on top of that they apply themselves to their work.  Those fucks in the indie scene who are so self-deluded that they eschew all media backing and think they can rely on \"word-of-mouth\" to proliferate, after a while wonder why the fuck they're still starving in obscurity, it's because their shit sucks, but they can't realize it.  But then when these same shitty bands go the way of the major label, they have a clear desire to earn money and we, the public, get the All American Rejects and their talentless ilk. *shudder* Shit sells, as MTV and the billboard charts can attest.\n\r\nBack on topic, Tool is a talented band that desires to make money.  Yet they continue to take risks with their music.  In the end, they know their position is secure enough to take those risks and still rake in assloads of money.  Personally, I enjoy each Tool album objectively.  Everyone has the right to disagree, but to impugn others for their tastes is pointless and stupid.  Like FoE said, you're not going to alter anyone's position.  And about the shirt thing, sure you're wearing an insult on your chest, but so many people are aware of the band nowadays that nobody really cares, and those that do are just elitist asswipes.\r\nPeople who love a band are going to wear the band's shirts, bottom line. Rebuking them for that reason is also pointless and stupid.\n\r\nWhew, I'm done for now\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nGood comeback puddintime. I obviously misjudged  you. This is where I stand:\r\nLateralus was the album that made me a Tool fan. When Tool released Aenema, they reached their creative peak so the question was; Where do they go from here? This is why Lateralus and Ten Thousand Days are so different from the rest of their stuff. They wanted to do something different, something experimental, which obviously alienated alot of OGTs. This doesn't mean their new stuff is 'gay' it's just different. That being said, people aren't idiots for liking their new stuff, they just prefer artsy shit to the convential band structure. It's not fair to expect Tool to play easily digestible music in 4/4 & 3/4 again for the sake of being 'cool'. Tool don't care about being popular. They make the make the music that they want to make, not what people want them to make and I wouldn't have it any other way.\r\nAnyway, I know what you're saying now puddintime, I just don't understand why you're so pissed off about it?\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nI really like you guys.. I like reading these posts and discovering other people geting the same shivers I do when I listen.. its beautiful.  \n\r\nI saw Tool live for the first time on September 2, 06, and it was the most amazing expierience of my life.  I felt so floaty and .. I dunno.. Just great.\n\r\nAnd they played stuff off Aenima too, which was awesome.. \n\r\nMy baby likes Tool too.  My boyfriend puts the headphones on my tummy when I sleep and he always moves around.  :D\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nInteresting. Depending on what songs you play, they will likely be the child's favourites. Congratulations.\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nYou guys are so rediculous. Your fighting for the wrong reasons. I see why tour getting mad. Buying the shirts and all will make them mainstream and all. But that is nothing you can stop. Tool is where they are because they will always be themselves. Change is good but also bad. They don't have just one album that is the ultimate. It all depends on your mood. Opiate is alot heavier, but also like none of the other albums. Aenima and Undertow are the two closest alike. But still they have there differences. Aenima is where the broke away from everything. the most creative album. But who am i to say. Like said before don't listen to it. But if you like the band you will appreciate what they write. Tool is Amazing. They are one and only. No matter what they do with the music or lyrics MJK is still a genius Danny is a great drummer, Adam Jones has the rifts that send chills through our spins and Paul d'Amour is the one that has the mezmerizing rythm in sober. they will Always be Tool. no matter what happens to them. they show and speak what is on there mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\ni guess im so pissed off because i was raised on a COMPLETELY different type of band, than what tool has become. I remember listening to Melvins, Butthole Surfers, Primus, Fugazi, Minor Threat, Black Flag, Helmet, Husker Du, Minutemen, etc, when i was less than 8 fucking years old. Those bands NEVER compromised their sound. Plus they played ANYWHERE THEY COULD, FUCKING ANYWHERE. That's what pisses me off the most about Tool. Back in the early 90's they were just like all those great underground bands, in the sense that they had an uncompromising sound, they wouldn't change for anyone or anything. They would play the same \"small\" venues, and play wherever they could, and then.....they changed, a lot. It just seems that ever since AEnima hit it \"big\" they've given up their connection to that underground, hard rock scene, for something pompous and overly arty. They used to be one of those really original bands, every album was different, but still connected by the overall sound. But now, Lateralus and 10,000 days sound almost exactly alike to me, and I for one just can't wrap my head around it. why did they give up rock for ambient noises. I, for one, can't understand why they gave up on their older fans, and started playing slower and longer, and in bigger venues in like 20 out of the 50 states. I also can't understand why they charge so much for tickets, or why they play so many shows in Europe, Japan, and Australia. If someone can explain that to me, i would be forever greatful, but until then, Tool, has failed me, greatly these past two albums.\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nMusic is an Art so to bag on Tool saying they're too \r\n''artsy'' is to say that you just can't tap your foot to the music and you're mad about it.\n\r\nJust because it's not loud and fast doesn't make it uncreative.\n\r\nIt isn't like they set the prices for concerts or merch ; their job is to play music not set prices.\n\r\n''If someone can explain that to me, i would be forever greatful, but until then, Tool, has failed me, greatly these past two albums'' is an example of a run-on sentence.\n\r\nP.S. I'm not a music critic just a thinker.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nThis song is just amazing. Thats all there is to it the lyrics send shivers down my spine and the music conveys the emotion amazingly well. Thankyou Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nI must say, I admire your conviction puddintime. I'm actually glad you brought this up because it's the same sentiment of many disgruntled OGTs. Anyway...\r\n  \"It just seems that ever since AEnima hit it 'big' they've given up their connection to that underground, hard rock scene, for something pompous and overly arty.\"\r\n  I agree that Lateralus and TTD are a paradigm shift from Aenima howvever seeing as Aenima was as big as it was, there was no way Tool COULD go back to the underground scene. I may be wrong on this, but Tool never considered themselves part of the 90s grunge movement. In other words, they never made a commitment to stay underground. MJK said it himself:\r\n \"I sold out long before you never even heard my name, I sold my soul to make a record ...etc\"\r\n  \"Why did they give up rock for ambient noises?\"\r\nThey may have given up rock in the traditional sense but there new stuff isn't all ambience. Most of it is complex time signatures and polyrythyms. As for the ambience, maybe Tool in their old age got all that anger out of them and mellowed out. Maybe they took too many drugs and couldn't go back to the days of Undertow and Aenima. I agree that LTRS and TTD are unrelated to the sound of Undertow and Aenima, but their music is still their own. Tool wouldn't change for anyone or anything, except themselves.\r\nI can understand your beef now puddintime. I myself was a child of the 90s, but the 90s are over and times have changed, and Tool changed with them. (Besides, if they didn't play in Australia I'd never get a chance to see them) very few 90s bands survived the turn of the millenium. Even if those that did changed their style dramatically, I for one am glad they are still around today. Anyway, the underground scene is still alive today in the... well, underground. There are many indie bands that have been inspired by, and continue the legacy of the 90s scene. Even if these bands make it big someday, let us hope they don't sell out.\r\n  Peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nI wish everyone would just stop arguing about stuff that is so irrelevent to the songs meaning.  I appreciate your opinions, and lust to shoot back at people like puddintime and TREXTOR, but thats not what this site is for, so please, ignore them and share your opinions, nobody and everybody is right on this site, because it's all opinion.\n\r\nBack to what I think the meaning of this song is... As it's been said, I think it's definatly about Judith Marie Garrison.  He realises how beautiful of a person she was, nomatter how much his lyrics or ways/opinions disrespected or insulted her faith, she continued to send him love and encourage him.  \n\r\n\"Set as I am in my ways and my arrogance. \r\nBurden of proof tossed upon non-believers. \r\nYou were my witness. \r\nMy eyes, my evidence. \r\nJudith Marie, unconditional one.\"\n\r\nThis not only sums what I just wrote, but I also think that Maynard feels like his mother was his spiritual guide.  She tried to show him why she believes the things she does, and through her death, achieved this.\n\r\nA post from Wikipedia, \"Yesterday, when I went to the studio to give Maynard a bottle of wine (a 1992 Maya) for winning the bet that I had with him involving his new film â\u0080\u009cSleeping Dogs Lieâ\u0080\u009d (I lost by default, not being able to attend the Sedona screening), not only wasnâ\u0080\u0099t Maynard there, but, in what seems to be a case of enantiodromia (something becoming its opposite) if ever there was one (!), I was told the reason why he wasnâ\u0080\u0099t there. I wish this post was dated April 1, but, unfortunately, it isnâ\u0080\u0099t. Like a doctor giving a patient a straight, honest answer to a medical diagnosis, without sugar-coating the truth, hereâ\u0080\u0099s exactly what I was told: â\u0080\u009cMaynard has found Jesus.â\u0080\u009d This will come as a complete shock to most (but not all) of you, as it did to me. In fact, it just seemed like another MJK prank until I talked to the one person who I believe would know if all this was legit or not. After nearly an hour on the phone with this person, the answer I received was that Maynard has indeed â\u0080\u009cfound Jesusâ\u0080\u009d and that, for this reason, heâ\u0080\u0099s abandoned the project for the time being, if not entirely. I donâ\u0080\u0099t know what the f**k is in the water these days, but hopefully a black jelly belly will turn up in that golden bowlâ\u0080¦\"\n\r\nNow don't all go nuts, cuz I'm sure a bunch of you will post with dissagreements, please don't bother, I'm not saying that this is true, It's my OPINION.\n\r\nGoing along with that he also says in this song \r\n\"I never lived a lie, never took a life. \r\nBut surely saved one, hallelujah.\"\r\nWhich to me would mean, she in a way, \"saved\" his life.  I think Maynard either really did \"find\" Christ, or he felt that he did when he wrote this song.  Please don't assume that I'm some Christian nut, because I'm not, hence my userID.  This is simply what I think of this song and the new album.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nI thnx thz song m33nz TeWL ha$ t00 much tym on thair h4ndz\n\n\r\nhar har harfffff\n\r\n\"I appreciate your opinions, and lust to shoot back at people like puddintime and TREXTOR, but thats not what this site is for, so please, ignore them...\"\n\r\nWait? when did I articulate my opinion in a harmful, or idiotic way?? And wait, when did I start caring about whatever lame comebacks you could come up with, anyways... I made good points based on many personal experiences, so you sir can suck my balls. \n\r\n\"Just because it's not loud and fast doesn't make it uncreative.\"\n\r\nyou're right, it just makes it long and boring. long and boring. boring and long and self-indulgent prog crap as well. I don't know about anyone else, but  Right In Two, The Pot, Vicarious and Jambi sound like the only songs that tool put any musical effort into, everything else sounds boring feedback and noises. usually i like feedback and noises, but not 3 hours of feedback and noises, with some whispered lyrics. by the time they get to the actual song I've already lost interest.. oh well maybe next album. Oh yes there will be another album after this one, at least there better be...\n\r\n\"...is an example of a run-on sentence.\"\n\r\nUH-OH boys looks like the internet grammar police has tracked me down. I guess this means the jig is up and I have to escape to another messege board; and plan another way to insert mass amounts of grammatical errors in my posts without getting busted by some stupid jackass; who likes pointing out bullshit errors in other peoples posts. While ironically they themselves make numerous grammatical innacuracies in their own posts. \r\nDamn.\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nGo Ron Simmons!\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nHey TREXOR you annoy me so much i took the time to sign up to song meanings to tell you you should shut the fuck up. If you don't like tool fine, enjoy hating them we don't need to hear your whining about them. You think your hard core but your just a little cry baby go listen to some nigga beats ya fuck! Tool are not main stream, lateralus and aenima are very different from each other and there for so is 10 000 days. and this album is not fake you dick YOUR JUST SHIT!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nI doubt TREXOR even reads posts on this site anymore, so I guess you signed up for nothing.\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nOk waaaaayyyy tooo much screaming at each other....\n\n\r\nI have to say that while I agree with puddintime when he said that, \"in my opinion\", Undertow was the best album they have put out... but not for his reasons... I am a 16 year old kid and while i may not be an \"original fan\".... (i discovered them with the song Schism), i have come to call them my favorite artist, I am a musicaholic... and will give anything a chance... \n\r\npersonally this song gives me shivers everytime i hear it, particularly the lines\n\r\n\"Ten thousand days in the fire is long enough;\r\nYou're going home.\n\r\nYou're the only one who can hold your head up high,\r\nShake your fists at the gates saying:\r\n\"I've come home now!\r\nFetch me the spirit, the son, and the father.\r\nTell them their pillar of faith has ascended.\r\nIt's time now!\r\nMy time now!\r\nGive me my, give me my wings!\"\n\n\r\nMaynards voice is probably the best i have ever heard and Danny.... well fuck me... I play bass, guitar, and drums... and when i hear him play... well it makes me sad because i know there aint a way in hell i can achieve Danny's level of skill...\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nJudith Marie, unconditional one\r\ngave me the shivers..beatiful\n\r\nThe album, in general, is brilliant.\n\r\nSome people just love to label any band as \"Commercial\" even if this is one of last remaining decent bands. We all should appreciate that they are still bothering themselves to make music.\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nANYON KNow? or seen that guy on here that tells u put certain tool songs in a order and then a different pattern and play them at the same time with 2 different media players?\n\n\n\r\nAND WHAT THE HELL IS THAT FIRST COMMENT what the hell is tool synclist? and all those numbers are u retarded? \n\r\nand u dumb ass tool isnt commercial band ok... no fuckin band is gonna do a show in all 50 states ther not fucking robots they dont giv a shit. and as for the over charge??  i saw them at staples center for 65 bucks and i was very close to the stage.. on the side\r\nSUCK THESE BALLS right here suck them\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nOK WHAT THE HELL IS TOOL SYBCLIST AND ALL THOSE NUMBERS?? are a retard \n\r\nand tool isnt a commercial band. WHy shuld they do all 50 states r u fucking kidding ther not ROBOTS ok ther fucking human no ones gonna do all 50 states SUCK IT as for overcharge?? i saw them at staples center real close to the stage on the side for 65 bucks SO SUCK a fat one  tool is the only real fuckin band left \n\r\n\"PLAY MUSIC FROM UR FUCKING HEART\"\n\r\n-bill hicks\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nHAHAH thought the first comment didnt go threw i re did it.   it takes a while\n\r\no welll\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nFor those get the numbers, I hope you enjoy the synclist just as much as I do. For those who don't, I'm happy to explain if you ask me nicely.\r\nWho are you to wave your finger koproximo?\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nI know this is kind of late, but I have been listening to this song since it came out, and I have been trying to figure out an alternative interpretation to the ones that are going around currently.  It is a coincidence that Maynard's mother's name was Marie, and that the mother of Jesus Christ was also named Mary (even though it is spelt differently). I feel that this was done strategically in the song, and Maynard considers himself to be a messiah (not a pretentious one), but a messiah in the sense that he is putting into words by way of lyrics and songs, emotions and feelings that we have all felt but have not been able to communicate properly for a long time. This song is about Maynard respecting Christianity eventhough he did not totally believe its teachings in the past, but I also feel that it could be a song about the relationship between Jesus Christ and his mother (The Virgin Mary), because it emphasizes on her devotion to the religion of Judaism (Without you to guide them all to Zion), and about how she encouraged her son (Christ or Maynard) to think freely and to form ideas and values that would benefit mankind. I am drunk right now, so this may sound like total rubbish, but I hope I hope passed on the message I intended to when I was sober a few hours ago. Let me know what you guys think, I will probably add to this interpretation once I am not under the influence. Thankyou.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nPersonnally, after listening to this song about 20 times and reading the lyrics and going fucking nuts about it, I had a different interpretation of what Maynard wants to say.\r\nI think (I dont know for sure if hes said it before) that Maynard believes in God, Heaven & Hell. He also doesnt beleive in Christianity as the religion God chose for us. I hope i dont offend anyone by this its just a thought. He says: \r\n\"Fetch me the spirit. \r\nThe son, and the father. \r\nTell them their pillar of faith has ascended.\"\r\nwhich I understood as \"tell those whom u beleive in that their religion is not right and has been lifted\" probably replaced by another. About his mother, I think that any Christian knows that if u do good, beleive in Christianity and in redemption, then u shall be redeamed and find ur place in heaven. But not him, he asks God to forgive his mother, to take her in with his mercy because of how much she has suffered, and how good she was in her life:\r\n\"I only pray Heaven knows when to lift you out.\r\nTen thousand days in the fire is long enough\" (asking God not to make her suffer hell after what shes been through)\r\nand\r\n\"Should you see your maker's face tonight. \r\nLook him in the eye \r\nLook him in the eye, and tell him. \r\nI never lived a lie, never took a life. \r\nBut surely saved one, hallelujah. \r\nIt's time for you to bring me home\"\r\nagain telling his mother to tell God that she lived a good life doing no harm or sin, and that He should take her in to paradise.\r\nOnly MY understanding of this song..\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nI remember reading an article wher Maynard says something about what is going on in this discussion board. It was something about how this album was going to split the tool fans into 2: Those who appreciate the music, lyrics and meaning and Those who are internally angry with the world and want to hear \"The angry Tool\" of aenima. Maynard succeeds in reflecting his emotins in his songs. I guess back then he expressed his angry-self with explosive bass-lines and thundering drums and screams of anger. Now I guess he feels a bit different about it all. He's more relaxed and rational. He pours wisdom with every line in this album. Look at the subjects of his songs, they are very deep. Music is a way to express urself and thats what hes doing, he changed!\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nThis song is beyond beautiful, and Maynard deserves 100% accurate depictions of his lyrics, so here:\n\r\nListen to the tales and romanticize,\r\nHow we'd follow the path of the hero.\r\nBoast about the day when the rivers overrun.\r\nHow we rise to the height of our halo.\n\r\nListen to the tales as we all rationalize\r\nOur way into the arms of the savior,\r\nFeigning all the trials and the tribulations;\r\nNone of us have actually been there.\r\nNot like you.\n\r\nIgnorant siblings in the congregation\r\nGather around spewing sympathy,\r\nSpare me.\r\nNone of them can even hold a candle up to you.\r\nBlinded by choice, these hypocrites won't see.\n\r\nBut, enough about the collective Judas.\r\nWho could deny you were the one who\r\nIlluminated your little piece of the divine?\n\r\nAnd this little light of mine, a gift you passed on to me;\r\nI'm gonna let it shine to guide you safely on your way,\r\nYour way home ...\n\r\nOh, what are they going to do when the lights go down\r\nWithout you to guide them all to Zion?\r\nWhat are they going to do when the rivers overrun\r\nOther than tremble incessantly?\n\r\nHigh is the way, but all eyes are upon the ground.\r\nYou were the light and the way they'll only read about.\r\nI only pray, Heaven knows when to lift you out.\r\nTen thousand days in the fire is long enough;\r\nYou're going home.\n\r\nYou're the only one who can hold your head up high,\r\nShake your fists at the gates saying:\r\n\"I've come home now!\r\nFetch me the spirit, the son, and the father.\r\nTell them their pillar of faith has ascended.\r\nIt's time now!\r\nMy time now!\r\nGive me my, give me my wings!\"\n\r\nYou are the light and way that they will only read about.\r\nSet as I am in my ways and my arrogance,\r\n(With the) burden of proof tossed upon the believers.\r\nYou were my witness, my eyes, my evidence,\r\nJudith Marie, unconditional one.\n\r\nDaylight dims leaving cold fluorescents.\r\nDifficult to see you in this light.\r\nPlease forgive this bold suggestion, but\r\nShould you see your Maker's face tonight,\r\nLook Him in the eye, look Him in the eye, and tell Him:\r\n\"I never lived a lie, never took a life, but surely saved one.\r\nHallelujah, it's time for you to bring me home.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nAbsolutely amazing song. Knocked me off my feet the first time I heard it. I'd heard it before Wings pt. I, and this struck me as much better. I wonder if it would have been different had I heard part I first. \n\r\nIt's been explained countless times, but yes, Maynards' mother as the basis.\n\r\nI think it goes deeper, as would and do most . \n\r\nI think that Maynard is totally sarcastic about Christianity (even though this is a serious song), and isn't as nuts about it as people seem to think. \n\r\nI personally believe the death of his mother made him think more seriously about religion, not necessarily in the way of accepting it, though.\n\r\nSeriously though, can you see a devout Christian shouting at heavens gate \"Fetch me the spirit, the Son, and the Father\" and demanding wings, whether the line be intended for his mothers' or his own?\n\r\nThis is just my opinion based solely on this song, I've not read much further into his true opinions or feelings.\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\n10000 is binary for 16. I've no idea of the significance of that number I but I do know this:\r\nThere are 16 fake albums in the C.D booklet of Aenima. The time signatures in Lateralus (9,8,7) are the 16th step in the Fibonacci spiral. (Danny Carey mentioned this in an interview for some reason.) Regarding the TKD album art, there are 16 3D images if you include the slip the disc is in. As I mentioned earlier, I don't know what the mathematical or numerological significance of 16 is, let alone Tool's interest in the number. That being said, any ideas anyone else has will be greatly appreciated.\r\nP.S: If I'm tripping, tell me I'm tripping. It's the only way I'll know.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nHe is talking in dimensions 1 head, 2 fists, 3 spirits, Time (4th dimension) Dont know if he chose this style or rhetoric through the whole song but at least that one line is in dimensions and by the way when you count how many characters (letters) are in the whole album there are 10,345 but that includes all puntuation\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nHeres another interputation and im not knocking the mother idea, just using it too when I think about this. Im thinking that this could be about Lucifer. Theres two parts in the beginning\n\r\n\"None of us have actually been there.\r\nNot like you.\"\n\r\n&\n\r\n\"But enough about the collective Judas \"\n\r\nAs it said in there that its about a person who has been there, as Lucifer was banished from heaven. And collective Judas could mean that there allready a scapegoat for people who like to think same kinda thoughts that Lucifer. Basicly anything that challenges the image that epople have to be just good etc.\n\r\nAnd I wouldnt think that Maynards mom has been in heaven BEFORE she dies, and the Judas part can be pretty hard to imagine too.\n\r\n\"Who could deny you were the one who illuminated.\" About Lucifer seeing something else than Gods laws.\n\r\nWhen its at the \"This little light of mine\" part, that could be about hes mom. If Maynard isnt a devoted Satanist that is. There could be 2 meanings, or dimensions. \n\r\nThe part about satan=taking a stab to religion. \n\r\nPart about her mother=Maynard is trying to think like her mom did \n\r\nThe fire can mean hell or the hell that Maynard mom propably was in.\n\r\nWhen we get to the \"You're the only one who can hold your head up high. \" That could be about Lucifer not bowing before God and also about her mother not giving up.\n\r\nAnd when its on the \"Shake your fist at the gates saying...\" part, that can be about her mom being angry about the life she was given, or about Lucifer coming back and claiming his wings that were taken from him.\n\r\nSo it can be actually about 3 things. The mom and lucifer, and then about the two combined. That this life has evil in it, and by it is complete (in buddhist ways etc)\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nTo be honest, I thought it may have been about Satan too when I first heard this song. After a lot more listening though, it's definately all about Judith. If there is another party referred to in this song it's probably Christians.\r\n\"Feigning all the trials and the tribulations, none of us (Christians) have actually been there, not like you (Judith)\"\r\nMJK is referring to his mother and where others would feign suffering for the Lord e.g: giving 10% of their earnings, Judith had really 'been there' through 27 years of paralysis.\r\n\"But enough about the collective Judas\"\r\nthe 'collective Judas' refers to the 'ignorant siblings in the congregation' mentioned earlier in the song.\r\n\"Who could deny you were the one who illuminated your little piece of the divine\"\r\nJudith's faith was her 'little piece of the divine' In her suffering, perseverance and possible loving nature she 'illuminated' this.\r\nAs for the \"This little light of mine\" part, I'm not quite sure about it's meaning(s). It could mean Judith converted MJK or it could be something else. I'm pretty sure though that MJK isn't a devoted anything.\r\n\"Ten thousand days in the fire is long enough, you're going home\"\r\nChristian suffering and perseverance is also known as a 'refiner's fire.' this is supposed to test and strengthen one's faith as fire is used to test and strengthen metal. Judith was in this 'fire' for 27 years until she went home(died).\r\n\"You're the only one who can hold your head up high, shake yor fist at the gates saying 'I have come home now'!\"\r\nBecause of Judith's trial on Earth, she would undoubtedly recieve her reward in Heaven. This is why she can hold her head up high and shake her fist etc.\r\nAnyway this song is definately a loving tribute to MJK's mother with Christian undertones and I doubt it is in any way Satanic.\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nWhat I mean by Christian undertones is NOT that MJK has become a Christian and is now singing songs of praise. MJK undoubtedly has respect for his mother and what she stood for, which is conveyed in this song. Nonetheless MJK is still cynical towards the religion of Christianity which is also conveyed in this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nFLY IN PEACE JUDITH MARIE! *tear\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nFLY IN PEACE JUDITH MARIE! *tear\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nanyone thought bout how this really is an\"i m sorry\" or a recant of judith(apc)? a change of heart? amore mature less angry maynard? a maynard with more....HOPE\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nand 4 all u album compairision addicts out there, i got 1 thing to say, u dont have to like w/e album it is u choose to. but i DARE you to put in any tool apc song and b able to say\"uh thats not tool/apc\" u cant n ya kno it. its all tool, or apc. ALL of it. n its all gravy baby. its all good in its own rite. its just not ur fav. u aint  gotta like mik jackson but almost every1 loves thriller or beat it. or ymca 4 that matter. you cant b underground 4 ever, when it/ur the best of/at something eventually ppl take notice,\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nYou heard the man. It's all gravy baby!\r\nSeriously I'm gonna start saying that all the time now. Love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nTools greatest song hand down. Gives me shivers.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nThis song is so amazing.  Very few songs give me chills every time I listen to them, and 10,000 Days is one of the few.\n\r\nAfter listening to previous Tool songs, and really hearing and taking in the lyrics, 10,000 Days is such a change, such a breath of fresh air.  Tool is well-known for lyrical assaults on organized religion, at the occassional expense of Maynard's mother's dedication to her beliefs (see A Perfect Circle's \"Judith\" for a perfect example).  The regret in the words of Wings Pt. 2, and the acceptance of her lifestyle, is nothing short of breathtaking.\n\r\nEasily my favorite song from their latest album.\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nThe purpose of this song was to make the fans suffer like his mother. The lyrics are over-the-top self-indulgent and have bad analogies. The music is also horrid. God Maynard is a horrible lyricist and an overrated vocalist\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nWhy do fanatical christians like OpenMindLeap and others always want to push their religion onto everyone else. \n\r\nGet over it, not everyone wants your god... more importantly, they have every right to reject your god and all you stand for.\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\navclub.com/content/node/…\n\r\nctrl-f: AVC: do you ever jump online to read fansâ\u0080\u0099 interpretation of your songs?\n\r\nA Gift to Renegade ninja (or what ever) and his sync-list.\n\r\nAlthough, I admit that Viginti tres, Wings for Marie and 10,000 days synching is just for me too much of a coincidence, it is simply impossible for all those songs to sync, is just the fanatics who listen what they desire, even when is as ridiculous as that â\u0080\u009cTOOL SYNCH LISTâ\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nDude, I agree that Wings pt1 and 2 don't gel too well. What I was proposing was that Viginti Tres can be synced with Tool's other songs. If you dont believe me sync Viginti Tres up with Lost Keys/Rosetta Stoned, then let me know what you think\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\ncan you tell me how does that sync must be done? wich song first, etc etc?\n\r\nthanks\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nwell i know that this song does have to do with his nother and questioning his faith to her asking her that if she could please question his maker on why is it that someone so religious and full of faith and hope can be put through so much suffering and pain, but yet still continue being strong about her faith when everybody else quickly blames any small misshappening from not winning the lottery to getting in a car wreck as jesus trying to not being ther for them but when it comes down to praying to win the lottery there at his feet(fuken hypos). i also think it talks about ST. Jude on how maybe he did snitch out jesus to were he was hidding but in a reality i think it was a good thing i mean how many more lives should have been slaughterd for him so who really is the hero?   Please correct me if im wrong..\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nKnowing Maynard's pain of losing his mother, this song means alot to me and the lyrics really do reflect losing somebody whom you love and hold in the highest regard. I also agree with the above poster that even while suffering for so long she can still have her faith in God. A truly touching song. Oh yeah Tool rocks the fizzle bing drizzle.\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nthe lyric is actually \"ignorant flippants in the congregation\" not \"fibbers\" and that is not a rent, just a common misconception that was bothering me for a while.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nFLIPPANTS??? lolz I think \"fibbers\" makes more sense seeing that mozzilla isnt trying to auto-correct \"FIBBERS\" and trying to correct FLIPPANTS lolz\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nActually, it makes more sense as \"Ignorant SSIBLINGS in the congregation\" MJK's voice is a bit distorted so 'S' sounds like 'F' or 'TH'\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nBtw, thanks for the link Depeche Mod3. It's interesting MJK brought up the 'whirling dervishes'. Ancient civilizations would gather together in caves and after hours of chanting and drumming they would tap into their unconcious minds, entering these trances and having visions. These visions then became the world's mythologies. All of this from the subconcious and unconcious mind. Perhaps Tool do the same...\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\ndanny's bass drum at 1:23 starts a rhythm of 23 constant background hits on the cymbal between each additional single strike of the bass drum.  this pattern continues for quite awhile.  and also at 3:39 the strike of the bass drum initiates an 11 count interval between adam's deviation in his guitar part (occurring at 3:45).  this is random and possibly unplanned but 11 and 23 are two of the most important numbers in my opinion and its nice to see them woven into the fabric of one of the greatest epics of our time.\r\nmy 2 cents, peace\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nbeautiful eulogy\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nOH MY GOD IM ABOUT TO GO FUCKING CRAZY!!! I KEEP READING ABOUT HOW MUCH YOU ALL LOVE TOOL AND I FINALLY GET TO SEE TOOL LIVE ON SATURDAY AND I CANT FUCKING WAIT!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\n\"but enough about the calling of judas\"...\n\r\nthere, now you guys have something else to ponder...\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nit says JUDITH, not judas!!!1  some idiot screwed up on the lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nalso, has anyone ever thought about 10,000 days (album) as maynards life  during those 27 years.  also i tried to make a page on this so we can talk about the whole album in general, but the dumb website   didnt let me post it up, so how about we start sending request for that and maybe, then theyll pay attention to it. this would help out, especialy  renegade ninja so he wouldnt have to put the sync list up on every single song  (thanx for that, by the way)\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nguys i just paid $110 for Tool concert ticket in Istanbul (sep 7th) ...that's just money well spent. i bought one for my bro as well (im his favorite person in the universe now)..listening to this song live will be marvelleous..cheers\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nTrexor everyone here is trying to show how much they love the band and how deep the lyrics are, and you sit here telling everyone your shitty opinion that DOES NOT matter. SHUT UP. fuckhead...\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nthis is such a beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\n10 000 days, 27 years very fucked up number, that is the age of some of the most famous rock stars death's curt cobain, jim morrrison, janis joplin, jimmi hendrix i cant think of the other ones right now haha but yeah this song kicks ass, 27 FOREVER\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nIVE SEEN TOOL LIVE SO MANY TIMES ITS FUCKING SWEET U JUST TAKE A COUPLE HITS OF ACID AND YOUR FUCKED THE WHOLE TIME AND WHEN U GET OUT U THINK THAT U JUST CAME OUT OF A REALLY FUCKED UP DREAM IVE WENT TO 4 TOOL CONCERTS IVE HEARD ALMOST EVERY SONG THEY HAVE LIVE THE ONLY TIME I WASNT ON ACID FOR TOOL WAS FOR WHEN THEY DID ALL THEIR OLDER SONGS\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nI CANT WAIT TO GET MY ACID ROCK BAND GOING I LOVE THE WAY ADAM JONES PLAYS GUITAR THATS WHAT I LOVE TO PLAY EXEPT ALOT MORE ZONED OUT AND ACID LIKE HAHA\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nHey, 1. This song is actually demonic, you know how they say 10000 days in the fire is long enough (alleged refrence to his mom being in a coma for 20 years?) NO.\r\n7300 days = 20 years. This song is about others from my guess that picked up a leaf from this eternally nighgt time nursery in the fourth dimension. (Hence the  tree in the other video for parabol) \n\r\n\"aylight dims leaving cold fluorescents.\r\nDifficult to see you in this light.\r\nPlease forgive this bold suggestion, but\r\nShould you see your Maker's face tonight,\r\nLook Him in the eye, look Him in the eye, and tell Him:\r\n\"I never lived a lie, never took a life, but surely saved one.\r\nHallelujah, it's time for you to bring me home.\"\n\r\nPart of that is a refrence to the Emerald Tablets by Hermes Trigmestus... Allegedly writtewn by Mat or Thoth depending on who you ask, and a big major improbability, designed to justify their Damning your soul. Remember how in an interview they said it's good to know the kabbalah, it's so you'll have a base they can try and work off. Tool is out there hunting down souls for the bored psychotic ones in the fourth dimension it seems. ( You back masd there music and you'll see what I mean) Don't Back maks to many songs or the surrounding atmosphere gets mildly poisoned. If you seem like trouble, have seen the 'gears' and the one with the black veins, know this song is designed to aid what they send to try and destroy minds. The music like many musicians throughout time is designed to appeal rhythmically to the mind, engraining the brain with the lyrics (or so they hope) Also interesting to note, Amen is egyptian for \"To conceal\", also Amen-Ra, Egyptian deity(Horned sun god, to be explained in it's signifigance shortly). Note gnosticism is written by the 'The great seth'. The apple that gets cut in the one video goes from a 5 point star (Wiccan, horned god...) to a six point star (Hebrew god = Cainanite god El/Yahweh= 'the destroyer' which lineage of religion wise ties into Egypt in many ways (Anat Astarte wivews of El, and Seth... hmmmmm....) The seven point star is known as the 'demonic' star. Now in that faith, the king of the gods sends demons out to enforce his law when he dies, his brother is the one who hacked him to pieces and killed him, they glorify two women for devotion and suffering (no offence to them, but is that the basis you'd want for a religion) Also of note is the Ogdad has an 8 point star, but after Horus come onto the cene one of the dissapears, 8 would be the next logically the way the did it in the video, and without the 8th poinbt, wouldn't that be a seven? Who's eye is on the back of the dollar bill? While goddess worship was around world wide prior to any formalized religion the first two religions that are sited are ancient pre-dynastic Egypt and Hinduism.  \r\nSo my theory is some industrial dead that came up with the concept of an afterlife used some evilness (Egypt's dead looked forward to being slaves in the next life, seriously, wheras Cainanite dead acknowledging their pantheon didn't believe in a soul, giving the select enterprising few quite alot of time to bulk up on knowledge before they introduced the concept to the populace.) Note how the same stories get spread worldwide : Hel/Ershegal Astarte/Innanna/Venus/etc... in a timely manner you can track the way these enterprising one's spread their faith. Yeppers. Before you flame me look iunto it. You'll see. MwAHAHA. You'll see. PS: If ever an appliance that's turned off asks if you'd prefer spiritual or physiucal rape, get away from, the appliance. \n\r\nThe term Anat / Jesus = He's us  and dictionary for anat = anatomy. They pull a 'revelations' time book. As one other side citizen put it \"The bible is a sham as souls of the name tell me\" Prolly wanted to mock me when they put out so much energy to try and convert me.  \r\nSophie = So fee. They don't have much like or respect for women over there.\r\nSeriously in gnosticism what kind of 'loving omnipotent husband' gets his wife (Why fee) raped by 9 of his friends to ensure his wife's submissive? That's uber f-ed. Don't poiut your soul in the hands of Wicca (I think Egypt got it, paganism's correspondences have\r\nsome validity, but Wicca came about in the 70s, as did Gnosticism.), The Jewish faith might be slighlty safer (No mention of an after life, but still they might have gotten a hook in in the whole slaves of Egypt thing), Christianity has some psychoness, look at the Luciferian Doctrines onlie for legitimate bible quotes, Obviously demon worshipping is a bad idea, same side, the enforcers who get their hands dirty for El and his boys. So be cautious when you choose religion. This song wants you to die Jewish. \"Jew Death MArry unconditional one, kinda like Christian Death, cause they like using how many toxins are in our food to try and make 'He-Brews\". I'm not anti-semetic, I got hiyt with an astral parasite that got very strong when this song and the other part played, compared to it's normal strength.\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nHey, 1. This song is actually demonic, you know how they say 10000 days in the fire is long enough (alleged refrence to his mom being in a coma for 20 years?) NO.\r\n7300 days = 20 years. This song is about others from my guess that picked up a leaf from this eternally nighgt time nursery in the fourth dimension. (Hence the  tree in the other video for parabol) \n\r\n\"aylight dims leaving cold fluorescents.\r\nDifficult to see you in this light.\r\nPlease forgive this bold suggestion, but\r\nShould you see your Maker's face tonight,\r\nLook Him in the eye, look Him in the eye, and tell Him:\r\n\"I never lived a lie, never took a life, but surely saved one.\r\nHallelujah, it's time for you to bring me home.\"\n\r\nPart of that is a refrence to the Emerald Tablets by Hermes Trigmestus... Allegedly writtewn by Mat or Thoth depending on who you ask, and a big major improbability, designed to justify their Damning your soul. Remember how in an interview they said it's good to know the kabbalah, it's so you'll have a base they can try and work off. Tool is out there hunting down souls for the bored psychotic ones in the fourth dimension it seems. ( You back masd there music and you'll see what I mean) Don't Back maks to many songs or the surrounding atmosphere gets mildly poisoned. If you seem like trouble, have seen the 'gears' and the one with the black veins, know this song is designed to aid what they send to try and destroy minds. The music like many musicians throughout time is designed to appeal rhythmically to the mind, engraining the brain with the lyrics (or so they hope) Also interesting to note, Amen is egyptian for \"To conceal\", also Amen-Ra, Egyptian deity(Horned sun god, to be explained in it's signifigance shortly). Note gnosticism is written by the 'The great seth'. The apple that gets cut in the one video goes from a 5 point star (Wiccan, horned god...) to a six point star (Hebrew god = Cainanite god El/Yahweh= 'the destroyer' which lineage of religion wise ties into Egypt in many ways (Anat Astarte wivews of El, and Seth... hmmmmm....) The seven point star is known as the 'demonic' star. Now in that faith, the king of the gods sends demons out to enforce his law when he dies, his brother is the one who hacked him to pieces and killed him, they glorify two women for devotion and suffering (no offence to them, but is that the basis you'd want for a religion) Also of note is the Ogdad has an 8 point star, but after Horus come onto the cene one of the dissapears, 8 would be the next logically the way the did it in the video, and without the 8th poinbt, wouldn't that be a seven? Who's eye is on the back of the dollar bill? While goddess worship was around world wide prior to any formalized religion the first two religions that are sited are ancient pre-dynastic Egypt and Hinduism.  \r\nSo my theory is some industrial dead that came up with the concept of an afterlife used some evilness (Egypt's dead looked forward to being slaves in the next life, seriously, wheras Cainanite dead acknowledging their pantheon didn't believe in a soul, giving the select enterprising few quite alot of time to bulk up on knowledge before they introduced the concept to the populace.) Note how the same stories get spread worldwide : Hel/Ershegal Astarte/Innanna/Venus/etc... in a timely manner you can track the way these enterprising one's spread their faith. Yeppers. Before you flame me look iunto it. You'll see. MwAHAHA. You'll see. PS: If ever an appliance that's turned off asks if you'd prefer spiritual or physiucal rape, get away from, the appliance. \n\r\nThe term Anat / Jesus = He's us  and dictionary for anat = anatomy. They pull a 'revelations' time book. As one other side citizen put it \"The bible is a sham as souls of the name tell me\" Prolly wanted to mock me when they put out so much energy to try and convert me.  \r\nSophie = So fee. They don't have much like or respect for women over there.\r\nSeriously in gnosticism what kind of 'loving omnipotent husband' gets his wife (Why fee) raped by 9 of his friends to ensure his wife's submissive? That's uber f-ed. Don't poiut your soul in the hands of Wicca (I think Egypt got it, paganism's correspondences have\r\nsome validity, but Wicca came about in the 70s, as did Gnosticism.), The Jewish faith might be slighlty safer (No mention of an after life, but still they might have gotten a hook in in the whole slaves of Egypt thing), Christianity has some psychoness, look at the Luciferian Doctrines onlie for legitimate bible quotes, Obviously demon worshipping is a bad idea, same side, the enforcers who get their hands dirty for El and his boys. So be cautious when you choose religion. This song wants you to die Jewish. \"Jew Death MArry unconditional one, kinda like Christian Death, cause they like using how many toxins are in our food to try and make 'He-Brews\". I'm not anti-semetic, I got hiyt with an astral parasite that got very strong when this song and the other part played, compared to it's normal strength.\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nwhat about he mountain goats... you guys are so inconsiderate\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\na beautiful song...really ambient...and absolutely stunning.\n\r\nin my opinion, this album doesnt come close to aenima, or lateralus, but its still an amazing album.\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\n\"Jew Death MArry\" Are you joking? You've missed the point. The song is very simple in it's meaning. When you over analize you miss the point. If you were faithful your whole life to a certain religion then when you died you should get your reward. Maynard obviously knows how much faith his mother had,and the song is meant to encourage her soul in the here after. If she was faithful then she better damn well get her wings. \r\nWithout a doubt wings for marie part 1&2 is the best song I have ever heard. Tool is doing what artists are meant to do. Change &  give new direction to their own craft and art. if you think that aniema or lateralus is the best then you have heard nothing from tool at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nHEY ARCOIRIS!!\r\nI duno what youre talkin about, Mr rainbow, but man, i think youre crossing the line of SONG MEANINGS. The meaning is actually simple, and not that difficult to believe. MJKs mom died afte about 27 years of paralysis. Hence the album name \"10,000 Days\". I heard the song at least 11 times before i REALLY understood it. His voice, and the awesome crescendos give me chills to this day. \n\r\n\"You're the only one who can hold your head up high,\r\nShake your fists at the gates saying:\r\n\"I've come home now!\r\nFetch me the spirit, the son, and the father.\r\nTell them their pillar of faith has ascended.\r\nIt's time now!\r\nMy time now!\r\nGive me my, give me my wings!\"\r\nMy eyes got watery when i heard AND read this verse. He's telling his mom to basically demand her WELL DESEREVED spot in heaven with God. He's telling her to \"hold [her] head up high\" and GET her WINGS!!! \n\r\nIts a beauty of a rock song, and in a league of its own. Anyone who hears it (enough) wont be able to deny how emotionally CHARGED the song gets. You, simply , FEEL for the guy. \r\nI mean C'MON, imagine if it was YOUR mother...you should have a little more sympathy more Maynard, and respect for his mother.\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nWhat a beautiful tribute... you can feel his love and admiration for Judith Marie, it is so poignant. I love this album. Nothing like this could ever be \"Fake\"... besides... if something is in your hands, doesn't that make it real. Trexor's an ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nI think the very beginning of the song is a sort of satire in that it shows how believers of any religion are desperately trying to rationalize why they should be saved and escape damnation.\n\r\n\"Listen to the tales as we all rationalize\r\nOur way into the arms of the savior.\"\n\r\nThen Maynard attacks the believers again, this time ridculing their need to be reassured of their righteousness by others. Making fun of their frantic need to have their egos pet and have themselves reassured that they're a good, God-fearing person. Then he states that he wants no part in it.\n\r\n\"Ignorant siblings in the congregation\r\nGather around spewing sympathy,\r\nSpare me.\"\n\r\nThe second part of this song is about his mother and how he misses her, but is at the same time thankful that God has finally taken her home. She's the only person he's ever known that can go up to the Almighty Himself and demand entrance into Bliss without worrying about being repimanded. She deserves it, unlike the sinful sheep you often see in churches today.\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nI really need to learn how to proof-read. Correct ridiculing and reprimanded.\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nhmmmm....I am thinking, and the big brother says, why are u all worked up about this stupid monkey with fatty thumbsy, just listen to the song and ignore him....I mean come on, would u really argue with a cow, trexxor love u, here u have more hay\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nmaynardslyrics.com\n\r\nI think Maynard's words need to be shared with the world, in their most accurate form. He is something of a lyrical genius, and we all know this. The site is very simple, but the main object of my site is not the layout, it's the lyrics. You will not find more accurate tool/apc/puscifer lyrics anywhere. So feel free to browse, peruse, if you will, maynardslyrics.com ...\n\r\nI have all the Tool albums done, minus Opiate, which will be added very soon.\n\r\nAll his APC stuff, minus emotive, which will be added very soon.\n\r\nAnd as soon as his Puscifer stuff comes out, expect it to be added as well.\n\r\nIf you see any lyric or line that you feel is not what you think it should be, please feel free to email me @ magiclessmarker@maynardslyrics.com\n\r\n-magiclessmarker.\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nHaving looked at many of these song meaning forum things on this sight, I had noticed that TREXOR is very unliked, and therefore had to propose this theory.\n\r\nTREXOR is really a member of the band of the band who is pissing all of you off just for shits and giggles.  He already knows what the song means, he wrote it.  \n\r\nI know this because in the future I meet the band, and the drag queen tells me, some time around 2035 (We'll after the war and the shift... fucking mayans) I traveled back in time using Sirian technologies and with the permission of GFL.\n\r\nHave fun in spring (Fall on the other side), and Terrence McKenna Rocks.\n\r\nThis song is actually a about a certain choosen \"Seed\" with an important position in the shifting of conciousness.  Grid Point 18... and almoast 10000 days before the shift.  If you don't believe me, then look up at the stars and ask some one who knows better (Reptile of green and blue scales)\n\r\nPeace, and I hope you pass the test.\n\r\n~Law of 9's~\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nTrexor your a DICK man show some respect to Maynard and his mother if that what thge song about and i believe it is stop Bitching and enjoy 10,000 days it's the real deal\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nabout maynards mother - a believer -  transcending to a heaven unworthy of her! he rally loved his mum!\n\r\nand to be fair...disapointedly this is tool...it is an amazing album...i personally was just disapointed, and also didnt believe at first until finally coming to accept it and face th truth...it'd b outstanding if it was apc, but as it's not, tool hav ket me down :(:(:( still fucking awesome watchin 10,000days live though! donnington 2002 was better tho, more old school :)\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\ntrexor and everyone else are all fags...it's called \"songmeanings.net\" not \"argue-about-things-that-have-nothing-to-do-with-the-song.net\"\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\n^ Hypocrite.\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nJudith Marie = MJK's mom....this is probably the easiest tool song to understand beside the songs on the opiate CD. About her getting to heaven and finding her savior.\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nThis song is so bad. I sounds like something creed or stained would make, not tool\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nTREXOR, do you spend your days trolling these forums for attention, or are you really trying to win people over to your Tool-hating cause?\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nWhat does Maynard mean in the line:\n\r\nJudith Maire 'unconditional one'  ?\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nThis song actually made my eyes well up, not many things have ever impacted me to that extent emotionally throughout my entire life. (Maybe the death of my close grandfather when I was younger...)\n\r\nThis is an amazing track, and Tool will always be the best band. Ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nAtkin, I think what he is saying, is that even though his mother was in such a horrible state (paralyzed and wheelchair bound for 27 years), she stayed with her beliefs. (ie, her condition did not affect her true honor or beliefs)\n\r\nI may be wrong however.\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nagain thank you all 4 your input, judith brought him back to god, her faith.but even so, daylight dims, hard to see in this light, without her his faith flickers, roger waters has a lyric \"the moment of clarity faded like charity does,,,,,,,sometimes.\" my grandma brought me back, once, found out she was FULL of cancer(never drank smoked, lived a wonderful god fearing people loving life) had 1 - 2 months and was at total peace, loved lived was loved and couldnt wait to meet her savior, thats FAITH (burden of proof on the believers, the true believers dont need proof with faith on thier side but others want the faithful to prove ,mabye then theyll jump on  ?\r\nkeep on trudging\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nOkay, my eyes are tired.  I read every single post, simply because I love the song.  For you ppl bashing on TREXOR, he/she hasn't posted for a long time so please quit bitching about their posts.\n\r\nAs for the song, I loved it.  I have to admit I'm not a die hard Tool fan, I didn't really care for Undertow and as for Opiate, I haven't heard it.  I really got into Tool with Aenima and since then I've been hooked.  I was once told that \"Judith\" was some crippled homeless person that told Maynard \"God bless you\", so I didn't know that it was his mother, which sheds an entirely new light on 10,000 Days.  I see it now as a tribute to his mother and the suffering she indured.  I have never been a fan of organized religion, but if someone that I loved, that was that devout, I too, would be demanding of God for that person's entrance into paradise.  \n\r\nAll of Tool's cds are different, which is what I like about the band.  As a poet, I know how hard it is to strive to be different in what you write.  You cant rehash the same things over and over.  No body would buy it.  Props to Tool for trying to keep their music different and not the crappy 2-3 minute sound bites that everybody seems to think is good music.  Let's not forget that Stairway to Heaven is longer than that and still on the top 100.  Anyway, enough of this rant.\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nOkay, my eyes are tired.  I read every single post, simply because I love the song.  For you ppl bashing on TREXOR, he/she hasn't posted for a long time so please quit bitching about their posts.\n\r\nAs for the song, I loved it.  I have to admit I'm not a die hard Tool fan, I didn't really care for Undertow and as for Opiate, I haven't heard it.  I really got into Tool with Aenima and since then I've been hooked.  I was once told that \"Judith\" was some crippled homeless person that told Maynard \"God bless you\", so I didn't know that it was his mother, which sheds an entirely new light on 10,000 Days.  I see it now as a tribute to his mother and the suffering she indured.  I have never been a fan of organized religion, but if someone that I loved, that was that devout, I too, would be demanding of God for that person's entrance into paradise.  \n\r\nAll of Tool's cds are different, which is what I like about the band.  As a poet, I know how hard it is to strive to be different in what you write.  You cant rehash the same things over and over.  No body would buy it.  Props to Tool for trying to keep their music different and not the crappy 2-3 minute sound bites that everybody seems to think is good music.  Let's not forget that Stairway to Heaven is longer than that and still on the top 100.  Anyway, enough of this rant.\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\ner sorry didn't mean to post that twice LOL\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nLot of great comments. I appreciate them\n\r\n. . .a lot of humility out there too. . .good 4 learning in general. I learned a lot from reading.\n\r\nI am not honestly a \"practicing\" Christian but I find the metaphors compelling (my handle is technically Old Testament BTW so more old school bible . . .God I like that story & have struggled with it).\n\r\nI doubt the God concept is foremost in Maynard's mind but that is my opinion. I think it is more immortality of the soul & the afterlife concept that  looks like it came about more in the AE (AD) times vs BE (BC).\n\r\nMaynard paraphrases Milton's Paradise Lost (abashedly I confess Morgan Freeman quoted this in the movie Seven):\n\r\nâ\u0080\u009cLong is the way And hard, that out of Hell leads up to lightâ\u0080\u009d \r\n John Milton  \n\r\n\"High is the way\"\n\r\nMaynard is very well read but I liked you all's comments better. we learn from each other.\n\r\nthirdeyewide:\n\r\nLemon juice indeed. I will drink it.\n\r\nU address the issue incidentally of consubstatiality BTW & I liked that a lot. Thank u.\n\r\nMontheism or the unity of the trinity is more economically spiritual I think (only one god/spririt/entity to pray to which sounds flip but it appears like a historical theme)    \n\r\n\"Consubstantiality\" describes the relationship between the three Divine Persons of the Christian Trinity and conotes that God the Father, God the Son, and God the Holy Spirit are \"of one Being\" in that the Son is \"generated\" (\"born\" or \"begotten\") \"before all ages\" or \"eternally\" of the Father's own Being, from which the Spirit also eternally \"proceeds.\"\n\nen.wikipedia.org/wiki/…\n\r\nBaskethead:\n\r\nU address the sacred femine thing Da Vinci Code mentions. . .\n\r\n. . .sorry I am a pop culture freak in many ways but seek meaning in everything I see. Thank u.\n\r\nRedefine19:\n\r\nthat dimensions thing is very interesting. Thank u.\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nMaynardâ\u0080\u0099s song â\u0080\u009c10,000 Daysâ\u0080\u009d destroys me & resurrects me BTW without any theological/Christian bullshit.\n\r\nVery touching shit. \n\r\nDanteâ\u0080\u0099s afterlife conception in \"The Divine Comedy\" is leaking into everything I see. . .a good thing I guess. . .a key thingee in the movie Seven. . .sorry to link that with this song. .\n\r\n. .but if the shoe fits baby. . .\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nSorry this related to central message from another song I like. . .Arcade Fire's \"The Well & the Lighthouse\". .& yes I think even Maynard is afraid of death esp Judith Marie's. . .esp given the incredible example she was\n\r\n\"Everybody is ready to believe the thing he \r\nfears and the thing he desires.\"\n\r\n. . .I believe in some ways it is necessary to violently take ideas & rip them into tangentialities regardless of other peoples' taste\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nI think that the reference to the movie seven is perfect in this situation especially if it's true.  The reason I say this is because in the \"Divine Comedy\" in Heaven the 7th ring is for those who contemplate.  In the movie seven at the end the the good cop, brad pitt, recieves his wife's head in a box.  If people took the ending more metaphorically perhaps they would simply laugh... why? because the good guy, \"gets a head\".\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\n10,000 days is approx the amount of time that Judith Marie was paralysed.  To me this song represents Maynard's new found spirituality.  It has been suggested that Maynard has found a new meaning in his Christian morals and I think that this reflects that.  It also holds a hint of resentment towards the Christian god for allowing Judith to be paralysed for so long - \"never lived a lie\"I've come home now!\r\nFetch me the spirit, the son, and the father.\r\nTell them their pillar of faith has ascended.\r\nIt's time now!\r\nMy time now!\r\nGive me my, give me my wings!\"\r\nThis shows that resentment as he sees Judith as a \"pillar of faith.\"  It appears that to Maynard there is no one who can compare to his mother in terms of faith.\r\nIt is a beautiful song, and it made me love tool all the more.\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nTool is evolving, its time you all did too if you don't like it.\n\r\n10,000 days is TOOL, TOOL is bigger and better than ever before.\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nI like intelligent and deep music.  Lateralus personally is my fav Tool ablum, but 10,000 days parts 1 and 2, Vicarious, and Jambi are my fav songs on 10,000 Days.  I basically like ALL of Lateralus (especially Parbol/Parabola [I can't listen to Parabola without hearing Parabol first])  At first I thought this song was about Jesus and the Virgin Mary, but after reading the posts it's definetly about Maynard's mother I perceive.\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nBest tool song IMO. It's most probably about his mother. If it is, it makes it even more moving and special. I get chills listening to it. RIP Judith Marie.\n\r\nA++++++ will listen again\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nlovverlllyyyyy.\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nthis has to be one of the best songs i have ever heard...maynard shows such natural emotion in his lyrics and his singing. i agree that it has something to do with his mother dying. maynard probaly the best songwriter ever. TOOL RULE!\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nthis is up there as the best songs.  wonderfully done song,  music and lyrics.  I first heard this song in a thunderstorm walking in the rain.  it intertwined so well and it was an almost spiritual experiance and i could never find a drug to mimick it.  I absolutly love this song.  oh and when i listened to it later and heard that the thunder was on the track i just about dropped dead right there. lol\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nJust sitting and listening to this song is incredibly enchanting.\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nfunny, my mom passed away when this album came out...and she was paralyzed and religious too!...i love this song!....\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nat first i hated 10,00 days because of the pot.\n\r\nbut i finally realized that this is what happens whenever a new album comes out.\r\npeople get pissed because nothing is ever as good as good expect. because your expectations dont exist.\r\nand that is the best any of us can ever do\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nNo song has spoke more from the heart of a person. they block their ears by reason of the thunderclaps....\n\r\nSuch a beautiful tribute! 10,000 days would be a hell of a long time to suffer.\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nlol if that makes any sense\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nI believe this song is about the obviouse. Maynards mother Judith asscending to heaven after a very difficult life on earth. and now maynard is opening his mind to new possobilitys of lifes perpuse or the reason why we are here. its a question for all of us...\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\nOne of the most powerful songs I have ever heard. Maynard truly is a great songwriter. I like it how he leaves us to ponder over the meaning of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nI heard that if you play wings for marie and and wings for marie part 2 simultaniously they syncronise and it sound awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nthis seems to me to be about how his mother was halfway to death for these 10000 days until she actually did die.\n\r\n\"Feigning all the trials and the tribulations;\r\nWhen none of us have actually been there.\r\nNot like you.\"\n\r\nShe faced her own tribulations being paralyzed, but everyones so afraid of these things that people claim are to come.  people have faith because they fear tests without actually facing them, and in that forget that the tests exist for the faith.\n\r\n\"You're the only one who can hold your head up high\"\n\r\nShe had faith for her own reasons, without this blindness that everyone else seems to be struck with.\n\r\ntoo lazy to analyze anything else atm :P\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nTrexor, you are a schmuck. The cd owns.\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\nI'm not sure Maynard has been converted.  That's for him to know and for us to wonder about.  It does appear that he he wrote this song from the perspective of one that has been witnessed to by a mother that walked with Christ instead of just talking of him.  Even if he isn't a convert he is still able to show respect for someone who walked the narrow path in accordance with her beliefs.  \n\r\nIt seems as if this song has pissed off some of the \"haters\" that only want to hear negativity and criticism.  Maynard by no means has let the majority of Christians off the hook.  He is showing how one particular Christian actually lived her life as an example while others merely try to rationalize their place in heaven.  Quit \"haten\" and respect the fact that Maynard can see and present more than one point of view.  \n\n\r\nLastly I think the word \"siblings\" in the lyrics might really be \"flippants\" \t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nThis song really hits deep with me. I can really identify with Maynard on this particular issue. I just lost my grandmother about a year ago, and I totally love this song. I don't know why I pushed this song off for such a long time. Anyway, sitting here listening to the song and reading the lyrics, I almost was brought to tears. It was almost summer break when she died. She didn't suffer for 10,000 days, but it did feel like it. I can remember visiting almost every week, and she kept getting worse every time. I think the line \"time for you to go home\" did it for me. Another song  that does this for me is \"Dust in the wind\". Last song she ever heard me sing. Anyway, great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nIn this song, Maynard seems to both be vehemently anti-Catholic and believe in Catholicism's distinguishing doctrine of purgatory.\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nTREXOR IS A TOOL!!!! \t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\nvino.caduceus.org/JudithsCab/\n\r\nEnough said. \t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nFunny, all that bullshit about the album being a hoax. Dumbshits. This song is infact about MJK's mom, she was paralyzed and in a coma for 27 years which is roughly 10,000 days. I saw them in Arizona When they first performed it in concert, and maynard cried. it was fuckin sad. there is possibly another meaning, but im pretty sure this is it\n\n\n", "comment_308": "\nthis song means alot to me too, since i lost my father around when this cd came out. Fuckin shame.\r\nMakes me cry every time even to this day.\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nFirst thing a person should do with a man like Keenan is forget what you know about how to interpret leave that to the bible thumpers. In my humble opinion Keenan uses, sings, speaks, in dual entendres a lot. Thatâ\u0080\u0099s not all he does, he dose something else that I admire. That is to create lyrics that are multi facetted so they mean not two things but many, many, more things. There are a few lyrics that have so many facets that I myself do not hear all of them. \r\nThat is the fun part of listening closely to a man like Keenan. To reach far down the path way of this man we have to start at the beginning of his career. In the song sweat he sings â\u0080\u009cIâ\u0080\u0099m sweating, and breathing and staring and thinking and sinking deeper.â\u0080\u009d This to me means more than one thing. The first thing is pondering over the words to put into the song. Second and in the bigger picture he is begging his over soul for over all success. As if to say please grow the musician inside me and never let go.\r\nThe over all complexity of not only the way Keenan sings but the tones and second meanings to all his music is very unique. However I feel a lot of people have this Cyclops view of his work. Not all people can comprehend nor hear all of what Keenan is trying to awaken from within him. To who and why is he singing so passionately in to the audience. For god sakes he covers him self with blue paint from head to foot. Then draws the Ajna chakra (third eye) and the Sahasrara or (the crown chakra) on his bald skull. What is the most fascinating and a dead giveaway is the color he uses to draw them. The metaphysical color of this particular chakra (the crown) is violet. \r\nSo what is the driving point to his madness? Keenan is looking for self enlightenment, and the awakening of the Kundalini serpent within all humans. Not to mention he reaches to someone, for something that if listened to with the right angle, you can get. It took me many years to learn why this man sings his heart out. For example, Keenan sings out to his projected best friend Veil of virtue hung to hide your method while I smile and laugh and dance and sing your praise and glory. There is more than one way to take these words. I can think of two ways the first is biblical and the second is as if to sayâ\u0080\u009d here I stand successful, turned blue, and where are you my immortal friend.â\u0080\u009d It is as if there is a hand and one day someone will take it. \n\n\n\n\n\n", "comment_310": "\nYes men come on, the song is obiously about Maynard mom!\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\nNothing. I repeat, nothing. 10,000 Days was an awesome album, case in point, Rosetta Stoned. Track number 8.\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nWhoops, wrong page...\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nif you remember on the previous album some songs were about jungian theory(spelt it wrong sorry) and the idea that saturn takes 27 years to fully orbit the sun and alot of people say it causes great change in your life and awakening, i duno i figured 27 years, 27 days there might be some relation, just thinking\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\ntrexor is an old tool obsessor... hes probably gonna go kill himself cause he cant accept that tool is now different.\r\nso we wont be hearing from him much longer:)\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nI don't know a whole ton about Tool...when I first started really listening and tuning into the lyrics of this song, I thought it might be about Satan, and him wanting to come back up to heaven. I guess I really don't know, and all of your answers sound way more legit haha. If this were the case, the song would have been written in the view of a satanist. \n\r\nNone of us have actually been there,\r\nnot like you  <\n\r\nYou're the only one who can hold your head up high, \r\nShake your fists at the gates saying:  <\n\r\n\"I've come home now!  <\r\nFetch me the spirit, the son, and the father.  <\r\nTell them their pillar of faith has ascended.  <\r\nIt's time now! \r\nMy time now!\r\nGive me my, give me my wings!\"  <\n\r\nionno. maybe not.\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nwho ever says this has to do with god and satan is dumb. maynard and im pretty sure everyone in tool is atheist. this whole album is about his mom dying.from cancer or someshit\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\nMaster Craftmen\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nThis song will only ever have one meaning to me. My stepmother, who at the time is still with us, but not for much longer. She was more of a mother to me than my biological one was. She was diagnosed with triple negative breast cancer in December of 2010, and she doesn't have past October of 2011, and its not even looking like she'll make it through September. This will always be my song for her\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nHe doesn't believe in God, but I think here he's basically saying, \"if God is real, then there's no way you aren't in Heaven by now. You've suffered enough on earth.\"\n\nHe's putting his beliefs aside to make a tribute to his mom, basically.\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nI definitely see the Satan references. Makes me think of Milton's Paradise Lost when I hear this. Especially with all the allusions to light, illumination, etc when Lucifer means 'light bearer' seems a reasonable connection. I think there are other ways to read this song, but I see it primarily as a song about Satan standing up to the tyrant God. Also, I'm pretty sure based on Tool's other songs they are critical of religion and are not religious at all. So this is not some kind of religious song, but once again a critique of religion, our society, and the lies we tell ourselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_321": "\nFirst of all I would like to begin my comment about this song by saying that Maynard and the rest of the band DOES believe in an all omnicient and all powerful all knowing God.  The lyrics to this song are clearly indicative of his knowledge of God, he however, has chosen not to serve God, but rather he serves the devil. This band and every member in this band is knowingly willfully on their way to hell and they are fully aware of this fact. Anyone who reads into their lyrical content can clearly see this, and if you cannot see this you too are a new age fool! My issue with this band is their blatant blasphemy of my Lord and Saviour Jesus Christ. Maynard sings all about think for yourself, do what thou wilt etc etc... these are ideologies he never came up with. It's funny how he tells us to think for ourselves and praises Satan and totally blasphemes Christ in songs like Eulogy. Doesn't sound like he wants any listener to think for themself does it? Use your brain people!!! This band and all the rest has sold their souls to the devil. Isn't it funny how  these people say there is no God but yet EVERY major band throughout history ALL sing about the devil! Is this by some random stochastic chance? Every man is born with a conscience, and God has given everyone that conscience, now it's what we do with it that matters. You either serve God or the Devil people its plain its simple! I think this songs expounds a plea he is making about his mothers faith he knows to be true even though he has chosen not to walk a similar path. He most likely is haunted tortured and tormented and will ultimatley face eternal torment unless he repents, but at this point God has probably turned him over to a reprobate mind! Further, I assert that there is no person alive who is atheist or agnostic. Every man or woman is born with a conscience from a child through their adult life. To say one does not believe in God or the existence thereof requires faith, and seeing as though no one can prove scientifically or otherwise that there is no God is no more or less faith that there is or isn't a God!!! Same with evolution! Unprovable! The devil wants you to be decieved and all of our consciences know right from wrong, and we know God exists, and if you say he doesn't well just wait til you are in a life and death situation the first thing most people say is oh God.....etc etc.... Think people! Use your brain! These men are losers and they work for the devil!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nFirst of all, these two tracks are my favorite Tool songs, and it's not even that close. The climax of  \"give me my, give me my wings!\" might actually be my favorite part of any song ever.\n\nAnyways, I know I am late to the party, but I have read a lot of the comments and I feel like something is missing. Very simply put, this song is about the long suffering death of his mother (obviously.) Clearly she was a devout christian, and he juxtaposes her with others in the church who do not live the religion with every fiber of their being as she does. It is also a tribute, of sorts, to her. But mostly, it is expressing Maynard's anger at the hypocrisy and detriment of christianity. He is conflicted throughout the 10,000 days watching his amazing mother suffer so deeply, while clinging to the notion that she will be going to heaven, and Maynard knowing that she will not be. Why would God allow such a perfect example of faith suffer so long? \n\n\"fetch me the spirit the son and the father\ntell them their pillar of faith is ascending\nit's time now, my time now, give me my, give me my wings!\"\n\nSuch vivid imagery. I find myself actually shaking my fist as I belt this part out. I cannot think of another song with a more emotional and agonizing depiction. This poor woman spent all of those years suffering and clinging to the notion that she would be rewarded. In reality, though, this is about Maynard's suffering. She will die, and that will be it. She won't have to find out that her devotion was entirely wasted. Maynard has to live with the knowledge that the light that she was seeking, and probably deserved/earned, does not exist.\n\nI am astounded to read the opinions that this is somehow a return to faith for Maynard. This is not that at all. HE IS IN AGONY! \n\nAnyways, just my two cents. If anyone stumbles upon this, I would love to see a reply with what you think. \n\n*fingers crossed* and hopefully we'll see the new Tool album at some point in 2014!\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\nBest thing to do with this songs : (Part I and Part II)\n\nAfter a long and hard working day, serve yourself a drink, shut almost all lights (or even better light up some candles), lay on your bed and press play.\n\nEvery troubles, stress and anxiety will vanish, leaving you in such a relaxed state that nothing can bother you anymore. At least for 17m28s.\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\nYou know what i think a plausible theory is? None of their songs mean anything and they are just throwing some well placed words, which cause us all to stumble and look for meaning where their is none.\nfor ex: She wore a black dress\nEnglish Teachers interpretation: This signifies she will betray him, and or possibly kill him, or that she has a really morbid personality.\nWhat the author meant: She wore a black dress\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\nIn the lyrics given above it says 'Fading all the trials and the tribulations...'\r\nIsn't it 'FEIGNING all the...'?\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\nMaynard is spiritual, but definitely not religious. He uses this song as a eulogy to his dead mother while questioning God and faith in general.\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nI like tool considering, pusifer is not for me because is a tragedy of Christ hiding out as another man in my view, always enslaved, fuck it, I'm Jesus Christ,  and I say hide from what? Being open means everything, letting people know I am is the only way to be. I claim no religion, and won't, I've tried them all, my band will surface and you can comment on my material, until then, Jesus Christ \t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nA failure in understanding one's belief of another being faithful to something/someone not proven but theorised,is someone frusterated looking for blame for negativity.  The answer to the question in the song is clearly written in the book of Job. \t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nThe first word in line 7 is Feigning, not Fading.  Feigning as in \"to give a false appearance of : induce as a false impression : to assert as if true\"\t\t\t\t\n\t\t\t\t\n\n", "comment_330": "\nI am 15, and a Huge TOOL fan, and I just want to say this song has made me cry literally almost every time I listen to it, it's just such a powerful song about Maynard's Mother, and I have had many people say Tool is just rock, but you listen to this and wings for marie and realize that they are not just a heavy metal band, and they are different!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\nI am 15, and a Huge TOOL fan, and I just want to say this song has made me cry literally almost every time I listen to it, it's just such a powerful song about Maynard's Mother, and I have had many people say Tool is just rock, but you listen to this and wings for marie and realize that they are not just a heavy metal band, and they are different!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nOkay, this is what you HAVE to do... have a little pot (or, even better, a lot of pot)... put this song in your ears and tune out of reality. I did it on bonfire night, as I watched the fire burn away and it was really hard to work out which booms were in the song, and which were the fireworks.\r\nIt was so amazing. I'd recommend it to anyone!!\t\t\t\t\n\t\t\t\t\n\n", "comment_333": "\ni'm more into older tool albums, undertoe and aenima but this is a good one. simular to a refined version of eulogy if thats how its spelled. different though in the sence theres no obvious signs of anger there are over tones of sarcasim for lack of a better word but at the same time there seems to be some a great deal of admiration directed at the person or enity but climaxes and ends with a let down.\t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nit's time for you to bring me home\n\r\n that line always brings a tear to my eye verry moving song loved the album sure there was 1 or 2 odd moments (lost keys and lipin whatever it was)\t\t\t\t\n\t\t\t\t\n\n", "comment_335": "\ni think this song is about Jesus. his 10000 days here on Earth. {:\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\nWhat if Josie and the Pussycats do a cover of \"10,000 Days\" and Josie suddenly starts getting all upset? I would feel sorry for her and the other bandmates. Of Course I really like this song and it reminds me of the Remembrance Day ceremony. 10,000 Days = 27.3 Years\t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\nWings pt 2 hits home with me b cuz I have a mother who is crippled and she is the sweetest human being u can imagine and she's a Christian but u wouldn't believe how she gets treated the ignorant fucks in her congargation volunteered her to clean the church by her self!!!wtf!I guess they think cuz she can't work she has nothing better to do bt I think mjk is tlkn bout how fckn people take advantage of the week and letting god knw that she deserves her wings it def has two meanings bt he wants his fans to have there  own perception about it this is mine and its a great song that NEVER gets old!\t\t\t\t\n\t\t\t\t\n\n", "comment_338": "\nAnother reason to love Tool: They do religious music better than religious musicians. The only religious bands I like are the ones that aren't Gospel. Gospel sucks.\t\t\t\t\n\t\t\t\t\n\n", "comment_339": "\nThis is all about the stupid jewish STORY about Moses and his contact with their god... LoL, because of one name(Judith Marie) you say that the song is about his mother???\t\t\t\t\n\t\t\t\t\n\n", "comment_340": "\n\r\nWhat I hear is Maynard deifying his dear mother. He has gone way past honoring her, cherishing her. He has elevated her to Deity status where the fellow believers follow her Light (Come now, she is only true believer in the church and Everyone else is a hypocrite? or just Hyperbole?), the Trinity beckons to her command (â\u0080\u0098fetchâ\u0080\u0099-- when I hear that, it's like fingernails on a chalkboard) and the Trinity waits her ascension to see what their pillar of faith is and she demand, â\u0080\u009cGive meâ\u0080¦â\u0080\u009d. Of course, the wings part is some sort of unbiblical fiction; the angels have wings, someone made up a story about people 'getting them.'  All I can say if Judith Marie had true, saving faith in her walk with Christ, she would absolutely shudder at these words/suggestions more than APCâ\u0080\u0099s â\u0080\u0098Judithâ\u0080\u0099 profanities.  And though she apparently loved her son unconditionally, up against the wall, would not agree in spirit with these lyrics, no matter how well-intentioned.  Believers long to see the Savior, and to fall in an everlasting embrace and service, falling at His feet; not a demanding \"GIVE ME...\"\n\r\nSo tragic, Maynardâ\u0080\u0099s gifts: voice of an angel, lyrical genius/ poetic talent being used to glorify himself and his mother, both creatures, instead of the triune God who gifted him.  Thus, the lyrics /vox bemoan the tormented soul of unbelief, vexed at the problem of pain and suffering and hypocrisy. (if evolution is true, then it is all meaningless, and suffering just is neutral, chemical reactions in someoneâ\u0080\u0099s gray matter, nothing more).\n\n\n", "comment_341": "\nMy Fully Functional Name Is Kent R. Nelson. If you are a tool fan, follower, or believer then you should already know that this means more to maynard than you can honestly feel. the band is a portal not an explanation. the meaning to the song has a bigger personal meaning to him than i know we can feel. However, this does not mean we do not have our own personal endeavors which create intense emotion. this work simply gives us a taste of what a single human body can produce with their own power and intensity, so feel his power and express yours in everyday life whether it be heard by 1 or several bodies. This isn't some emo deep b/s that your boy or girl fried serves you it's everyday life in which your true self should be portrayed. If you don't embrace this then your a fuck'in hooker with a penis. \t\t\t\t\n\t\t\t\t\n\n", "comment_342": "\nNice how everyone Copy-Pastes. I still think its \"Collaborate Judas\" instead of Collective Judas...( Whatever the fuck collective judas might mean.....:S)\t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nThis song is a final message to his mother Judith Marie. On the surface it sounds like a final ode to her, but listening a little more closely it seems to me that he's being sarcastic. His mother was very religious and pushed that on him, so now he's saying, 'No one is as perfectly christian as you are, go demand your entrance into heaven'. Every line in the song lines up with this theory. Even him implying that he had received her gift of light and that he would let it shine for her, from his atheist perspective would be like taking that constant indoctrination and throwing it back in her face. It's very clever, kind of mean, and kind of funny. All awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_344": "\nFUCK ur self\t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nBasically he's saying he believes there is a God, he wishes his mother to be absolved from her sins (10,000 days in the fire is long enough). He's saying none of us have been there because we're too busy rationalizing our way into heaven instead of working at it. However he's not saying religion is your answer; he specifically warns against religion:\n\"Ignorant siblings in the congregation\nGather around spewing sympathy,\nSpare me.\"\nBasically saying, they're in complete denial, the rules they're pretending to live by are arbitrary; they must learn the truth themselves, no one can give you the truth.\t\t\t\t\n\t\t\t\t\n\n"}