{"comment_0": "\nem is back and reviving his best sound. i think he made his point about ending his romance with hip hop. when he first came in, hip hop was at a pretty woman at her prime, and now he's divorcing the hip hop that's been poisoned by all the crappers like wayne, gucci mane, and drake.\r\ndon't leave us em, we won't have a cure for the hip hop cancer that wayne's spreading\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nYou're all missing the point.\n\r\nThe reason why this song works so well is the fact that he tells a story, making the song Universal and Personal all at the same time. He lets the listener know he wants to address his personal issues with Hip-Hop but also allows a huge quantity of people to relate to the content of the song, the amount of people who find themselves in relationships which can be summed up be these lyrics can't be underestimated.\n\r\nThat, is why Eminem will always be up there with tupac looking down on the rest, he doesn't have to talk about shooting people and f*cking hookers to sell his music. He makes songs that can actually make a difference.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nAwesome song but I really just want to address this illuminati junk that seems to be popping up on this site a lot.  My opinion is it's capital BS & a completely self-defeating  attitude to buy into the idea that theres a secret society controlling or planning to control the world.  An organization existed at one point but to blame current problems on a faceless idea or set of powerful individuals just allows problems to continue & basically to says you're powerless to do anything because someone or something else has more power than you & they control things.  I'm not one to discount peoples view but this idea is a large steaming pile of horse-shit & frankly is dangerous cuz it can suck people into a pretty paranoid, totally unproductive state of mind.  It's music enjoy it. :) \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis is more than Kim, drugs, addiction, or hip hop.  This song is his way of representing ALL of his past struggles and pains.  This includes Kim and his addiction issues.  It includes the fans who left him and the public's campaign against him and his music.\n\r\nI think the reason he said \"Fuck you hip hop\" is because hip hop is his whole life, not just a music genre.  People like Eminem live their art, so I think this song was not only hip hop, but everything else in his life.\n\r\nBut that's just my two cents :)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ndidn't figure out it was about rap till he said \"fuck you hip hop\" but it makes sense and is brilliant and personal\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nyou people are idiots this song is about the trials and tribulations of being in the rap game not stupid illuminati bullshit you paranoid fucks\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song is about his 'relationship' with hip-hop. \r\nA few verses that point that out:\n\r\n'i gave up my life for you, totally devoted to you' -- We all know how long Eminem has been a rapper. 'Nuff said. \n\r\n'dont think im loyal, all i do is rap' -- Self-explanatory.\n\r\n'but in my sickness an addiction, you're addictive as they get' -- Eminem was a recent drug addict, (Hence the album title, 'Recovery') but, this completely stats that rapping is his ultimate addiction.\n\r\n'go marry someone else and make em famous' -- Kim obviously isn't going to make anyone famous, however being a rap artist will..\n\r\n'fuck you hip-hop' -- Well, yeah.. \n\r\nAnd lastly, the chorus:\n\r\ntoo late for the other side\r\ncaught in a change\r\n25 to life\r\ntoo late for the other side\r\ncaught in a change\r\n25 to life\n\r\nEminem's first album titled, 'Slim Shady LP' released in the year(s) of 1997-1999; When he was 25. Hence the lyrics, '25 To Life'. Ironically, it is also the life sentence of imprisonment. Thus being, his life sentence to rapping.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI have the cd and the lyrics are \"caught in a chase\" not change.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nc'mon people he's definetly referring to this rap game as a woman.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song has to be about hip hop because of the single lines - \n'Fuck you hip-hop\n I'm leaving you, my life sentence is served bitch'\n\nIt's about his relationship with hip - hop.\nNot about Kim, Drugs or the 'illumninati'\n Saying that is pretty stupid.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nits \"evil as they come vindictive as they make em\" \n\r\ncan't figure out the lines before hand...\n\r\nwhat a song though, this album is nuts! one of my favorites on Recovery.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThe last missing lines are \"but in my sickness an addiction, you're addictive as they get.\" \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nMaking it about Hip Hop and Kim at the same time... Marshall is a genius. Guess the rehab worked, cause he's back to his old, brilliant self.\n\n\n\n", "comment_13": "\ni get what the song is about. But i don't get the title though.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\n^25 to Life, it's a jail sentence... Em is associating his relationship with Kim or whoever he is with to being in prison, being trapped. Then at the end he flips it and turns it into a metaphor for his \"life sentence\" in Hip Hop, it's pretty smooth... like;\n\r\n\"I gave up my life for you, totally devoted to you, while I've stayed\r\nfaithful all the way and this is how I fucking get repaid\r\nLook at how I dress fucking baggy sweats, go to work a mess\r\nAlways in a rush to get back to you, I aint heard you yet\r\nnot even once say you apreciate me I deserve respect.\"\n\r\nThis can be about a chick or it can be about Hip Hop,\r\nEm' dressed the dress and he stresses himself out tryna\r\ntop himself each time to keep fans and industry interested\r\nbut he still feels like nobody sees how much rap would suck\r\n\"Without Me.\"\n\n\r\n\"All i do is rap, I can not moonlight on the side\r\nI have no life outside of that, don't I give you enough of my time?\r\nYou dont think, so do you? Jealous when I spend time with the girls\"\n\r\nThis can be interpreted both ways, as being the industry bitchin' at him when he\r\ntries to go spend time with Hailey and Laney instead of bein' in the studio writin'\r\nthe next single or album, or just a bitch gettin' jealous of Em' givin' other girls attention.\n\r\n\"Why I'm married to you still, man I dont know.\r\nBut tonight I'm serving you with papers,\r\nI'm divorcing you, go marry someone else and make 'em famous\r\nand take away there freedom like you did to me.\r\nTreat 'em like you don't need them and they ain't worthy of you.\"\n\r\nTo me it seems like it's like Em' is sneaking in another \"I still love you\"\r\nto Kim, it seems like the whole song is aimed at her til you get to this part\r\nand it's not Kim it's rap that he wants to divorce, so he can spend time with\r\nhis kids and so he can get his life back...\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nhis word is so powerful, how can anyone not love eminem? \t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nthis song has a totally different meaning,think deeper and you will realize the em is talking about \"illuminati\"  and how he wants out.Illuminati is controlling his life and he cant take anymore,the only he can drop out is if stops music and lives a normal life. \n\n\n\n", "comment_17": "\nI interpreted as his fight with drugs, but he's personifing them.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nAMAZING!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think it's suppose to be \"caught in a chase\" not \"caught in a change\"\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI agree with emmaxcool. Like most of the album, I think drug addiction is the real issue. Addiction is often referred to as a life sentence, even if you kick you you will always be fighting it.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nIt's not about the god damn illuminati for christ's sake, it's not particularly in line with general eminem themes, and certainly not this album.\n\r\nA paranoid mind will always find ways to find conspiracies in things, get a grip.\n\r\nIt's about his relationship with Kim and his job, the hip hop game.  Very clearly.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\n\"im divoricing you\r\ngo marry someone else and make em famous\"\n\r\nthis song is not about his relationship with Kim. i doubt her marrying someone else would make that person famous.\n\r\nthis song also isn't about his drug addiction. see:\n\r\n\"but in my sickness an addiction, you're addictive as they get,\"\n\r\nhe's saying that even in his drug addiction (my sickness an addiction), hip hop is addictive as they get. or is he? go back to that first lyric i pasted.\n\r\n\"go marry someone else and make em famous\r\nand take away their freedom like you did to me\r\ntreat em like you dont need them and they aint worthy of you\"\n\r\nand,\n\r\n\"command it, and imma be the boss of you now goddamnit\r\nand what i mean is that i will no longer let you control me\"\n\r\nlast i checked, hip hop artists make their own name. at least thats what they say when they talk about \"the rap game.\" in fact, i dont think the rap game really treated him horribly..minus the angry mom's whose children got their hands on his music, i'm pretty sure everyone touts him as one of the best rappers alive/ever. however, control is the game the illuminati supposedly plays.\n\r\nalso, consider this lyric from cinderella man:\n\r\n\"Who forms pyramids and raps circles around square lyricists,\"\n\r\nthe pyramid and eye in a circle is often associated with the illuminati as their \"logo\" of sorts.\n\r\ni'm by no means a conspiracy theorist, but after reading about lady gaga's telephone song/music video and its clear allusions to the illuminati's mind control tactics parallelling the mass media of America despite its shallow appearance (omg leave me alone im dancing at the club, stupid boiii!), it has me wondering if em's trying to get at something similar by comparing the control his addictions have over him to the control the illuminati. or the \"controller\" could just be the music industry, his label, etc...but that is namely what gaga compares to the illuminati..not just the mass media.\n\r\ni'm not suggesting that either of these musicians believe the illuminati exist..just that gaga for sure alluded to them, and that em could possibly be expressing the theme of this album being controlled by  his addictions: rap, drugs, love) as being similar to the control the illuminati supposedly has over the world. you don't have to be a conspiracy theorist to think of alternate meanings or interpretations of something..just someone who thinks outside of the box every now and then ^^\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nthis song is powerful.. it gives me the chills when i hear it.\n\r\ni recently broke up with a girl, we were together for 2 years and this is exactly how i feel about it.\n\r\ni emailed her the lyrics to this song as closure.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis is more than Kim, drugs, addiction, or hip hop.  This song is his way of representing ALL of his past struggles and pains.  This includes Kim and his addiction issues.  It includes the fans who left him and the public's campaign against him and his music.\n\r\nI think the reason he said \"Fuck you hip hop\" is because hip hop is his whole life, not just a music genre.  People like Eminem live their art, so I think this song was not only hip hop, but everything else in his life.\n\r\nBut that's just my two cents :)\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIt starts off as Marshall explaining that he was in a relationship for a while and he left because he felt under appreciated...\n\r\nThen at the middle or end it changes to him being devoted to rapping for many years and he hasn't gotten much out of it...\n\r\n  Thanks\r\n      R0rschach :P\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nMaybe Kim used to accuse Eminem of caring about his work more than her? Referring to the 'all I do is rap' bit..\n\r\nI don't think it's literally about hating Hip Hop, and Kim.. They're too far apart from eachother, unless it's causing problems for the relationship.\n\r\nI personally think Em's quoting Kim (not in EXACT words) \"Fuck you Hip-Hop\" And Eminem's saying Hip hop is his life, something he'll never be able to stop doing.\n\r\nIt was a nice change to have a song about their relationship that doesn't say Kim's name lol, makes it that little bit more universal.. Excellent song!!! And sooo relatable lol.\n\n\n", "comment_27": "\nyoutube.com/…\n\n\n", "comment_28": "\nthe song is essentially how rap ruined his life. It begins with the line \" i don't think she understand the sacrifices that Ive made, maybe if this bitch had acted right i would have stayed\" this is an obvious blow to kim but its more so about hip hop how he sacrificed  his marriage and life and time as a father for rap. The beginning of the song is about how it ruined his life and his marriage with kim because she started to get upset he wasn't around to be with her or their daughter and she started to get jealous and worried if he was spending time with other girls. And how he did nothing but show her love and give her wat she wanted and it wasnt good enough for her and she just took advantage of him and started treating him like garbage the song then latter goes on to how he has given so much to the game and so much for hip hop that he spent \"half of his life \"for rap and how he feels under appreciated for everything that he has done for music and that he still feels like he hasn't gotten anything back in return. the title and the line 25 to life is a clear metaphor for the jail sentence he feels like he is serving because of hip hop that once u get into it your in it for life\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI love this song!\r\nMy favorite lines are\r\n\"i feel like when i bend over backwards for you all you do is laugh\r\ncause that aint good enough you expect me to fold myself in half\r\ntil i snap,\"\r\nAnd\r\npretty much this whole part.\r\n\"ive done my best to give you nothing less than perfectness\r\nand i know that if i end this ill no longer have nothing left\r\nbut you keep treating me like a staircase its time to fucking step\r\nand i wont be coming back so dont hold your fucking breath\r\nyou know what youve done no need to go in depth\r\ni told you, youd be sorry if i fucking left\r\nid laugh while you wept\r\nhows it feel now, yeah, funny aint it, you neglected me\r\ndid me a favor and my spirit free youve said\r\nbut a special place for you in my heart i have kept\r\nits unfortunate but its,\"\n\n\n", "comment_30": "\nIn my opinion Eminem is talking about Kim & Hip Hop at the same time.\r\nBecause in his other songs he always says that Kim inspires him to write his lyrics & if it wasn't for her, he wouldn't be what he is right now.\r\nSo Hip Hop is related to Kim.\n\r\n& in the song he says \r\n\" look at how I dress, fucking baggy sweats. Go to work a mess.\r\nAlways in a rush to get back to you.\"\n\r\n& when he says \r\n\" Go marry someone else & make'em famous\"\r\nI think he's saying that she should go marry someone else and put them through all the shit that she has put him through so they'll be writing lyrics and songs about all that & it could make them famous.\n\r\nOr\r\nIt could be about hip hop & how he was never appreciate for what he does.\r\n& how he never got what he actually deserves & he's fed up.\n\r\nAnyways, it work both ways.\n\r\nIt's an amazing song by an amazing artist.\r\nRespect\r\nxxx\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThis song is NOT ABOUT KIM. Em is personifying hip-hop as a woman. He's talking about how music and the fame has taken over his life. It's very simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\naiight soo... idonno bout all you people on here but im eminems number one fan...and i can assure you 25tolife is not about kim or drugs or an addiction... he makes it sounds liike that but its not..if u listen to the song and take in what hes saying.its about hip hop and how he feels towards hip hop itself..he makes it clear in alot of parts..but yes i do understand why some think its about kim or drug blahblah but noooo !! butt yeaahh eminem or marshal bruce mathers is my future husband..forever and always baby xoxoxoxoxoxoxox\n\r\ndunnnnnoee : )\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThe song is about hip-hop and how the industry treats him like shit. Not Kim.  I think he wants you to THINK it's about Kim the whole time and he throws in the \"fuck you hip-hop\" line as a twist.  You're supposed to listen to it and be like \"OHHHH\"\n\n\r\n\"But when you spoke of people who mean the most to you, you left me off your list\"\n\r\nDuring his druggie days, Eminem was always purposely left out in â\u0080\u009cHip-hop Top 10â\u0080\u009d lists\n\r\nThis could refer specifically to MTVâ\u0080\u0099s 2007 and 2009 lists of â\u0080\u009cThe 10 Hottest MCs in the Gameâ\u0080\u009d, in which Eminem wasnâ\u0080\u0099t featured (the 2009 one bites particularly hard because thatâ\u0080\u0099s the year Relapse â\u0080\u0093 best-selling album of the year â\u0080\u0093 was released)\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nPlain and simple its about his life in the hip hop world... do research and u will see it cant be about Kim because eminem had always said she was a good mom so then why wouldshe be jealous that he was spending time with the girls like when eminem says \"jealous when i spend time with the girls\"...? also eminem has said on numerous occastions that this his his last album and hes done hmm like in thelast part of the song \"fuck you hip-hopim leaving you, my life sentence is served bitch and its just\"\n\n\n", "comment_35": "\nwhat makes me believe its about Kim is that 25 to life can very much mean that since Eminem is now 38 yrs old and he met Kim when he was very young around 13 that can means 25 years so far to life with kim \t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nokayyy \r\n25 to life\n\r\nhe met Kim when he was 13 and 25 years later hes still caught in the chase, this makes perfect sense\r\nsince hes 38 now, this song is about Kim definetelly\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nThis song is NOT about Kim, although i may seem.\n\r\nYou must remember artists use subliminal messages to reach out to their fans in their music. Some bad some good. They use \"distractions\" so that the music industry can't logically figure it out. Basically a \"cry for help.\"\n\r\nEminem is really talking about the illumintati and that he is choosing to leave it and take control of his own life from here on out. \n\n\n\n", "comment_38": "\neminems gay\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nGood song. This one makes Eminem stand out in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThis song is not about hip-hop. It's about the Illuminati's and the whole fucking industry. \t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nSo is he saying he's done rapping or what?\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI'm pretty sure eminem is the most amazing current artist in world right now. there is noone out there that compares to him and all he's done and been through. I don't really know why we try and figure all his songs out. there far too great for any one to fully decipher i reckon. In my opinion this isn't based on Kim at all... all of recovery is mainly Hiphop and stuff like that. Theres nothing really aimed at Kim. But hey, What do I know. I'm not eminem. and neither are you. (: for people that get confused by rap and want line by line break down rapgenius.com/ is pretty much amazing. Eminem what!!! xD\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nthank you bbc news for this sit\r\nthank you alot!!\r\nkiss!\r\nkiss!\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nEminem used to be an illuminati (a group devoted to devil worshiping) but he quit the group reilizing he wasted his life in the group. then he released recovery (recovering from the group). the song sounds like hes talking about his ex-wife but he is realy talking about the group he was in.                                                                                                                                                                                                                                                                                                                         ( in cinderalla man he talks briefly on how hes happy the devil is in hell.)\n\r\nif you need me to give you more proof message me.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nEminem used to be an illuminati (a group devoted to devil worshiping) but he quit the group reilizing he wasted his life in the group. then he released recovery (recovering from the group). the song sounds like hes talking about his ex-wife but he is realy talking about the group he was in.                                                                                                                                                                                                                                                                                                                         ( in cinderalla man he talks briefly on how hes happy the devil is in hell.)\n\r\nif you need me to give you more proof message me.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThis Song Is So Gooddd...! Andd I Love How You Kindd Of Think It's About Kim But Nah It's Hip Hop His Relationship With Hip Hop\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nMaybe its not a song about Kim, maybe its just about his carear as a rapper? \"Fuck you Hip Hop\" he is using personicfacation to explain it as if hip hop is his wife. he as a rapper hasnt been all rainbows and sunshine and he is angry because things are not going his way even though he has done so much for it, thinking of leaving it all behind his record label etc\n\r\n \"but tonight im serving you with papers\r\nim divoricing you\r\ngo marry someone else and make em famous\r\nand take away there freedom like you did to me\r\ntreat em like you dont need them and they aint worthy of you\"\n\r\nMost of his time has to be devoted to it, and when he doesn't do it for a while, to spend time with his kids it gets \"jealous\"\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI thought it was about Kim at first, and then like everyone else, I thought it was about Hip-hop. However, I heard from some people that it is about the Illuminati, and how the Illuminati made him famous and made him create lyrics with certain types of messages in it before, explaining his homophobic references in past songs. However, in the recovery album, he is \"breaking away\" from the Illuminati, which is expressed in this song a lot and Not Afraid. \r\nFor instance he says \"maybe if this bitch had acted right i wouldve stayed.\" This could mean the Rap industry since he left for a little while, but he is still in the Rap game so I dont think that makes sense. Also, \"Fuck you Hip-Hop, I'm divorcing you...\" He obviously isn't leaving Hip-Hop because he is still making songs, so does he really mean he is leaving the Illuminati? \"evil as they come vindictive as they make em\"\r\nI'm not sure if I believe this; its just interesting. What does everyone think?\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nEM IS TALKING ABOUT THE MUSIC IDUSTRY ITSELF...IF U LISTEN TO THE LYRICS...DONT JUST BOB YA HEAD TO THE MUSIC...THE MUSIC MASKS THE REAL MEANING OF MOST SONGS AND WE FAIL TO REALIZE WHAT ITS REALY DOING...SMMFH...HENCE, EM IS TALKING ABOUT THE ILLUMINATI\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI don't understand why people are saying this song at its base is about Kim or drugs, he may have intended it to be compared to alot of his other songs where he feels this way about those things, but he clearly states at the end that it's about hip hop, \"fuck you hip-hop, im leaving you, my life sentence is served bitch.\" I'm just pointing it out, I also dont like the people who state this in their comments thinking they are telling some big secret that only true Eminem fans can figure out. \r\nAlso, I'd like ask the question does this mean he is done with hip hop and not writeing anymore raps?\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nHe is talking about how he is 'stuck to the game' i.e. he cannot get out of hip-hop which ruined his life (kim, mum, his best friend who got shot (proof)). 'Fuck you hip hop'. It is not about Kim.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nMan refers to the stuff they hold dear to them as \"she\" EG .cars,bikes, and in this case hip hop...every rapper refers to hip hop as \"she\"..so the song is about eminem and his hip hop career ..his sacrifices. And how it took over his life....\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nok, this song is not, i repeat, Not, about kim. it' about him realizing that being a hip-hop artist has taken over his life and pulled him away from everything he truly loves. it's about how even though he's sacrificed pretty much everything, he still hasn't gotten the thanks he deserves from the industry. he's trying to break away from the industry and all the evil inside of it because, now that he's sober, he sees that its taken away everything that he held dear. \t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI don't think it's about hip hop, but about drugs. I think we all agree that it's about something he's bringing to an end, but we know that he's still gonna rap and do hip hop. And if it was hip hop, why would he say: \r\n\"look at how i dress fucking baggy sweats, go to work a mess\r\nalways in a rush to get back to you..\"\r\nhip hop is his work! while he is always in a rush during his work to get back to his drugs and they make him look messy...\r\nthen there's this line: \"I aint heard you yet\r\nnot even once say you apreciate me i deserve respect\"\r\nhip hop doesn't maybe treat him always as he deserves it, but it still said quiet often that it appreciates him. While drugs don't show you any appreciation, even if you devote your whole life to them.\r\n\"go marry someone else and make em famous\" --> His drug addiction made him famous, not hip hop.\r\n\"my friends keep asking why i cant just walk away Im addicted\" Why would his friends ask him to walk away from hip hop? But it's likely that they don't want him to do drugs.\r\n\"...but this time I aint changing my mind\" referring to his former attempts to defeat his drug addiction.\r\nThen the chorus. If he wanted he would stop doing hip hop, and that would be it. But you're affected by drugs your whole life (25 to life) even if you ain't an addict anymore.\n\n\n\n", "comment_55": "\nok i i have been reading quit abit about the connection to the illuminate and the music industry recently and it seem plausible and if what they say is to be believed then the next stage of eminem breaking away from the eliminate will be them destroying his image and then eventually killing him. i agree it seems a little out there but i will be watching closely to see what happens to him. supposedly michael jackson was killed by these people also.\n\r\nany how have a look at this see what ya think.\n\nyoutube.com/…\n\n\n", "comment_56": "\nI just wanna specify: I DO NOT KNOW ANYTHING ABOUT EMINEM AS A PERSON. I don't even listen to his music, for the most part... I just want to express how I interpret this song because it is very close and personal to me. I don't care if anyone disagrees with me or criticizes me, this is how the song makes me feel. \nTo me, this song connects to a past friendship I had. This \"friend\" wasn't much of a friend, and she basically became my worst enemy. Granted, we were in elementary school, so it wasn't terribly bad, but I may not be remembering correctly, either, and maybe it was worse than I remember. I do remember that she was essentially a bully, though, and she was my only friend, so I was scared to leave her because I would be alone. That's something that the line \"And I know that if I end this I'll no longer have nothing left\" particularly connects to. I felt trapped, just like the songwriter did; they were in a relationship with someone that treated them unfairly, but they felt that they had no choice. I know that may not be what it's really about, just remember, that is what it means to me on a personal level. \nThat's the general idea of the song, I think, and to add to it, the songwriter is walking away from the relationship. The same thing happened to me, so I understand how they feel there as well. \nAnd something that really stuck out to me in this song are the following lines: \n\n\"I'm addicted\nTo the pain, the stress, the drama\nI'm drown in so I guess I'm a mess\" \n\nThat is something I thought no one else felt. I have never met someone who has felt that way, who feels like they're addicted to pain, stress, drama, etc., and now here it is in a song... you have no idea how good it feels to know that there's someone else out there, even just one person, who feels that way. \nThat's just my view on this song. I know it's probably inaccurate, since I know nothing about Eminem's personal life, but I just wanted to express this view because it means a lot to me. \nI know I might sound stupid in saying this, but I would appreciate it if I didn't get any criticism on this... you have your view, I have mine. In the end, it's in the eye of the beholder.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nno you guys I honestly it has to do with the Illuminati. think about it, it could totally just be a conver up as if he's talking about kim, but truthfully he's letting it all out. \n\r\nLook at this he seems as if he's done so much for them, but he has no respect back, he's done everything they demanded, he sacrificed himself. And what does he get back nothing.\n\r\nHe's sick and tired of keeping it in, and taking bullshit from them,\n\r\nimma take control of this relationship\r\ncommand it, and imma be the boss of you now goddamnit\r\nand what i mean is that i will no longer let you control me\r\nso you better hear me out, this much you owe me\r\ni gave up my life for you, totally devoted to you, while ive stayed\r\nfaithful all the way this is how i fucking get repaid\n\r\nhe doesn't care for it anymore and there for he's exposing them, to let everyone know, not to be brainwashed from all this bullshit in society. Watch just what happened to tu pac. Eminem seems so sick of it, he feels like he has been there little bitch and that he wont take it anymore. though hes has been addicted to it all, all the build up inside he just cant take it anymore and the only way for him to make everyone are to is to express it the only way he can. \n\n\n\n", "comment_58": "\nyupp he wants outt off the illuminati \r\nbecause if he was taking about kim \r\nhe says im going to be the boss off you goddammit which means il no longer let you control me\r\ndo you really think he was whippped?\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\n\" though hes has been addicted to it all, all the build up inside he just cant take it anymore 'and the only way for him to make everyone are to is to express it the only way he can.' \"\n\r\nQuoting from nellsten.  Read this and you will know why all eminem fans have a combined I.Q. of 45.  Really? Listen to/support good hip hop.  Not this dude.  Go get some good music. \n\r\nSOME SUGGESTIONS: WU TANG, ATMOSPHERE, P.O.S, IMMORTAL TECHNIQUE, EAZY E, 2 PAC, BONE, BROTHER ALI, P.O.S, GUANTE + BIG CAT!\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI think there's a double meaning in this song. Eminem could be talking about his relationship with Kim, the obvious choice when he could be quoted saying \r\n\"I don't think she understands the sacrifices that I've made\r\nMaybe if this bitch had acted right I would've stayed\r\nBut I've already wasted over half of my life I would've laid\r\nDown and died for you I no longer cried for you\"\r\nwhich is basically his relationship with Kim and another relationship.. with the Illuminati. Yup, i said it.\r\nIts really obvious too, but i guess you'd have to believe.. for example;\r\n\"Go marry someone else and make 'em famous\r\nAnd take away there freedom like you did to me\r\nTreat 'em like you don't need them and they ain't worthy of you\r\nFeed 'em the same shit you made me eat\" \r\nBasically here he's describing his relationship with the Illuminati. He's saying to go make someone else famous, which is what they do to artists. \"Take away their freedom\" says it all. You would just have to really pay attention.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI thinks its about how he signed a. Contract with the devil, and how when he did that satan mis treated him, so he is breaking his contract with satan and satan can go make someone else famous.... I kinda know it means this haha #EminemLover and I know a lot about satanism and how satan does this ... \t\t\t\t\n\t\t\t\t\n\n"}