{"comment_0": "\n21P are not always straight-forward with the meaning in their songs, which I think is purposefully done so the audience can form their own understanding of it based on personal experience. What I took from it is that this is a song about a man that is romantically involved with a woman whom lives very far away, and  she feels dangerously unhappy when he is not around (when he's driving away from her house, he want to go back because he knows she will fall apart in the absence of his presence, hence the \"I begin to envy the headlights driving South. I want to crack the door so I can just fall out.\") When he \"understands why God died\" and \"takes the grave, sending her demons his way,\" he is saying he will attempt to mend her, but knows that this will cause conflict and pain upon himself, which is a great sacrifice. John 3:16 says \"For God so loved the world He gave His only begotten son that all who believed on Him should not perish but have everlasting life.\" This is along the same lines of.  I think the lines \"And when my car was far out of sight, he (the demons) crept in her room and stayed there for the night\" mean that every time he leaves her she is hit with a depression and severe sadness, and when he says \"He layed it out, what he had planned,\" he is saying that they both know that she will go into a deep sadness when he leaves. The beginning and end, from \"The air begins to feel a little thin\" to \"I began to understand why God died\" are saying that she gave him her all, but in doing so, it pains her to be without him. He is reassured by her love but is saddened by her sorrow.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nWhen I really listen to this song as I have many a time, and knowing top I really don't think its about a girlfriend at all. Tyler said in one of his recent interviews that Tear In My Heart was the first song he wrote about a girl because they were married and he knew that it was forever. Of course this is my own opinion but I believe this song to be about a mother or a sister, not necessarily his but a mother or sister. Artists a lot of the time draw from their own experiences but sometimes they will write about something that actually has never happened to them. When I imagine it I think of a mother so I'm going to use that. I think the mother is sick and she tells him its okay to leave her so he goes home reluctantly, wishing he could be back there to take care of her. She gave him her heart to take with him. When he says \"the demon stood there waiting on her porch\" the demon is the grim reaper symbolizing death. The song is called a car, a torch, a death. When he drives away for the night death swoops in, starting to take her. He feels chills in his bones. When he sees her and her life is nearing its end (because Tyler is actually religious) he sees God with a torch to guide the way for his mother and Tyler sees what he has planned then he tells God he'll \"take the grave\" as in take her place and die for her as Christians believe Jesus died for us. \"Please just send them all my way\" refers to her demons. He would rather take them then her hsvig to face them all. \"I began to understand why God died\" means he knows what its like to love unconditionally and so deeply for someone you would take all their pain and burdens and put it on yourself even if it means your life. His mother is very very near death and it's almost morning. Before she dies she gives him her heart to keep. \n\r\nAnyways that is my own personal interpretation and the beautiful thing about music is there are endless possibilities to how to interpret music and its unique to every one of us. I just wanted to share why this song is special for me. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI haven't completely figured out the meaning to this song yet, but I have a strong feeling it has absolutely nothing to do with a girl or a romantic relationship.  Knowing that these guys are Christians changes my original interpretation. \n\n\"The air begins to feel a little thin\nAs I start the car and then I begin\nTo add the miles piled up behind me\nI barely feel a smile deep inside me\"\n\nStarting the car is starting his new life as a Christian who is now accountable for his actions.  He's realizing that he is now an adult and is accountable for his actions to God and is adding up all the sins he's accumulated in his past, \"the miles piled behind me\"  and when he thinks about all he's done against God he's not feeling too good about it which is why he \"barely feels s smile deep inside.\"\n\n\"And I begin to envy the headlights driving south\nI want to crack the door so I can just fall out\nBut then I remember when you packed my car\nYou reached in the back and buckled up your heart\"\n\nThe headlights driving south are the majority of people heading \"south\" , south being a metaphor for Hell.  Living a Christian life is difficult, especially if your a rock star, he's finding himself being envious of those around him enjoying the pleasures of sin.   He's almost ready to succumb to sinful desire when he says \"I want to crack the door so I can just fall out.\"    But then he remembers who he is in Christ and that when he made his commitment Jesus came into his heart when he says \"But then I remembered when you packed my car.\"   His transformation to Christianity was true and Jesus has taken over his heart, and thus the line \"You reached in the back and buckled up your heart. For me to drive away with.\"  He now understands why Jesus died for his sins when he says  \"I began to understand why God died.\"\n\n\n\"The demon sat there waiting on her porch\nIt was a little dark so he held a makeshift torch\nAnd when my car was far out of sight\nHe crept in her room and stayed there for the night\"\n\nThis is where it gets a little trickier to interpret but I believe when he says \"The demon sat there waiting on her porch\" he is referring to Satan constantly waiting just outside to creep into our lives at any moment.  Even when deep down what we want to do we know is sinful or \"dark\" Satan has a way of convincing us that it's actually a good thing but convincing us with a false sense of \"goodness\" which is the makeshift torch.  Remember the car, his life, has been packed with the heart of Jesus buckled in back.  He let his guard down when he says \"when my car was far out of sight\" which allowed Satan creep in a stay a while.\n\n\"And then I felt chills in my bones\nThe breath I saw was not my own\"\n\nHe succumbs to sin and realizes that he's been deceived and that what he's doing is not really who he is in Christ, his own breath is not his own but Satan's influence over him.  \n\n\"I knew my skin that wrapped my frame\nWasn't made to play this game\nAnd then I saw Him, torch in hand\"\n\nHe realizes he can't play this sinful game and still be a Christian, he's not made to live in this sin, he sees that Satan deceived him with the makeshift torch of false goodness.\n\n\"He laid it out, what he had planned\nAnd then I said, I'll take the grave\nPlease, just send them all my way\"\n\nSatan reveals what he has planned with the pleasures that he can have in this world continuing to live a life of sin, but he finds his strength in Christ and says he will take death before he chooses a life that denies Christ and basically tells Satan to \"bring it on\" because he's found his faith again.\n\n\"The air begins to feel a little thin\nAs we're waiting for the morning to begin\nBut for now you told me to hold this jar\nAnd when I looked inside, I saw\nIt held your heart,  for me to walk away with\"\n\nEven though the car previously drove away when he let his guard down, Christ continually renews the Christian reminding him that the heart of Christ is still with him and cannot ever be taken away from the truly saved.  \n\n\"I began to understand\nWhy God died\"\n\nHe's understanding more and more the necessity of why Christ had to die on the cross.  \n\nOf course the song was written in a way that will allow the masses to have multiple interpretations but only someone familiar with true Christian theology will get the meaning that the author had in mind for himself when he wrote the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis is clearly religious in a sense, I also think it was one of the very few romantically related songs by Twenty One Pilots.\n\nI think it's about a girlfriend/wife cheating on her boyfriend/husband and the pain it caused for the boyfriend/husband. (I'll try to keep my religious views out of this) Biblical text references that God died because he loved the world. In this situation, the boyfriend/husband understands that because he loves his girlfriend/wife and that's why he wishes for death.\n\nPersonal interpretation, just my opinion. That is all.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n21P are not always straight-forward with the meaning in their songs, which I think is purposefully done so the audience can form their own understanding of it based on personal experience. What I took from it is that this is a song about a man that is romantically involved with a woman whom lives very far away, and  she feels dangerously unhappy when he is not around (when he's driving away from her house, he want to go back because he knows she will fall apart in the absence of his presence, hence the \"I begin to envy the headlights driving South. I want to crack the door so I can just fall out.\") When he \"understands why God died\" and \"takes the grave, sending her demons his way,\" he is saying he will attempt to mend her, but knows that this will cause conflict and pain upon himself, which is a great sacrifice. John 3:16 says \"For God so loved the world He gave His only begotten son that all who believed on Him should not perish but have everlasting life.\" This is along the same lines of.  I think the lines \"And when my car was far out of sight, he (the demons) crept in her room and stayed there for the night\" mean that every time he leaves her she is hit with a depression and severe sadness, and when he says \"He layed it out, what he had planned,\" he is saying that they both know that she will go into a deep sadness when he leaves. The beginning and end, from \"The air begins to feel a little thin\" to \"I began to understand why God died\" are saying that she gave him her all, but in doing so, it pains her to be without him. He is reassured by her love but is saddened by her sorrow.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI see this as him leaving a loved one for the last time as they are in the final stages of dying or just passed. Once on the road he is overcome with grief and considers killing himself, but then sees god. God explains that he has a plan for everyone and the death was part of it. The narrator asks god to take him instead, which is why \"he understands why God died.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nTwenty one pilots songs in theory have no meaning, They do not want them to have on meaning. They want every person to take what they take and what they need from their music. So 1,000,000,000+ people could comment on what this is supposed to mean and technically they would all be correct.\n\r\nas tyler says himself \"because a kitchen sink to you is not a kitchen sink to me, ok friend?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nTo understand this song it takes a little understanding of Christian theology. Tyler says he understands why God died. In Christian theology Jesus, who is also God, died to save us from sin.\n\nIn this song the main character is worried about a woman he cares about. \n\"I begin to envy the headlights driving south\nI want to crack the door so I can just fall out\nBut then I remember when you packed my car\nYou reached in the back and buckled up your heart\"\n\nIt hurts her when he's gone and her personal struggles grow worse.\n\"And when my car was far out of sight\nHe crept in her room and stayed there for the night\"\n\nHe cares for her so much that he would sacrifice himself to heal her hurts. This is why he knows why God died. He understands the pain of watching someone you care about suffer and therefore understands sacrificing for them.\n\"And then I said, I'll take the grave, please, just send them all my way\"\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song is really great. I think you are awesome singer. rickydiabetesdestroyed.com/…\n\n\n", "comment_9": "\ni completely love how Tyler writes his songs which can create different meanings it's just the perspective.People who listen to twenty one pilots for their music would be finding this as a sweet story of a relationship of a mother,sister or a girlfriend.People who might be depressed would interpret this song differently which is very beautiful if you think about it.different minds and different opinions.Also i have been in the clique for two years and a half and i am lucky enough to discover such of an amazing duo. stay alive frens |-/ ,living is beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nMy interpretation of this song is that it's about his mom.\r\nI think it's about when he moves out and he finally feels free from everything. He's struggling with the desire to kill himself but then he remembers that even though he's moved out and away, his mom still loves him. He realizes that if he killed himself then he would take his mom's life as well.\r\nI haven't heard Tyler say it, but based on a lot of their lyrics, it seems to me that he was raised in a Christian family but he's struggled with his faith. In this song he says he finally understands why God died. I think he means that he understands because his mom has to give him up (her son) when she lets him move out but she knows it's for the best. God had to sacrifice His son because he knew it was for the best.\r\nTyler's songs aren't always very straight forward so I could be totally wrong but that's just my interpretation. (: AMAZING song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song is about a guy breaking up with his girlfriend and she killed herself.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nIn the song Tyler represents himself and what Jesus went through. This is basically an metaphor. It's a metaphor of Tyler and a girl he cares about to Jesus and us.\nIn the first verse he implies that he has been on a long journey (by what hes saying about the miles and driving) (Like Jesus went through through preaching and persecution) and then he says: \n\n\"I want to crack the door so I can just fall out\nBut then I remember when you packed my car\nYou reached in the back and buckled up your heart\nFor me to drive away with\nI began to understand\nWhy God died\"\n  He says that he doesnt want to continue his journey. metaphoring to Just like Jesus in Luke 22:42 (Father, if you are willing, take this cup from me...) \nHe says then he remembered when you had given you his heart but it was buckled so in analogy, he got the girls heart but she was still guarding it.  Just like how we sometimes do not fully trust God. Then Tyler says \"I begin to understand why God died.\" He is referring to the death of Jesus.\nThe next verse is this: \n\n\"The demon sat there waiting on her porch\nIt was a little dark so he held a makeshift torch\nAnd when my car was far out of sight\nHe crept in her room and stayed there for the night.\"\n\n-In this verse it implies that because she had not fully trusted Tyler ,he couldn't fully protect her thus the demons came to mess with her head the entire night.\nNext is:\n\"And then I felt chills in my bones\nThe breath I saw was not my own\nI knew my skin that wrapped my frame\nWasn't made to play this game\nAnd then I saw him, torch in hand\nHe laid it out, what he had planned\nAnd then I said, I'll take the grave\nPlease, just send them all my way\"\nWhat this means is that he was scared he didn't feel comfortable and he was about to face the demon.  The demon had plans for the girl and Tyler volunteers himself for the grave and he asks the demon to send all the trouble his way instead.  This is like what Jesus did for us when He died.  He chose the grave for us, He took our sins for us. \nThe ending goes:\n\"The air begins to feel a little thin\nAs we're waiting for the morning to begin\nBut for now you told me to hold this jar\nAnd when I looked inside, I saw\nIt held your heart\"\nThis is the key part of the ending, in this part, after what tyler has done for her and what he went through, she gives him her heart. However, this time she fully gave it to him and put all her heart and trust to Tyler.  \nIn the song, Tyler repeatedly states why he now was starting to understand why God died.  And what he means is that he understands what its like to love somebody so much that he would do anything just to get their entire heart.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nUnderstanding that TOP doesn't have one right answer to the meanings but here is my thought:\n\nSeeing as this song is talking about leaving and driving away I believe it to have been someone close enough to make the leaving difficult. The reference to the demons waiting on the porch means that the protagonist was this persons safety and each time they left, the struggles or triggers slipped back in. I also want to assume that \"buckled up your heart\" refers to a child or inseparable possession which the protagonist is protecting because the other's demons were too great. \n\nThe protagonist makes reference to God dieing as they can no longer handle the pain or the other, also to note they wish to take the burdens and struggles from the other as Jesus died and took the pain and suffering from humanity. The protagonist truly wishes to free the other from their struggles and to do so the protagonist must decide to protect the other's heart or sacrifice themself.\n\nI'd love feedback to shape this more because each TOP song just finds a way to connect\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nOkay, so I feel as if this song is religious. I feel as if he is trying to connect spiritually and is putting himself on Gods shoes. \"She\" symbolically stands for everyone. He loves \"her\" so much that he is willing to take all of \"her\" pain away and put it up on hisself, but whenever he does instead of \"her\" he makes a deal. Whenever \"she\" dies, \"she'll\" be sent to him, to live a happier, no pain life, like God did.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThe air begins to feel a little thin\nAs I start the car and then I begin\nTo add the miles piled up behind me\nI barely feel a smile deep inside me\n\nAnd I begin to envy the headlights driving south\nI want to crack the door so I can just fall out\nBut then I remember when you packed my car\nYou reached in the back and buckled up your heart\n\nFor me to drive away with\nI began to understand\nWhy God died\n\nThe demon sat there waiting on her porch\nIt was a little dark so he held a makeshift torch\nAnd when my car was far out of sight\nHe crept in her room and stayed there for the night\n\n[2x]\nAnd then I felt chills in my bones\nThe breath I saw was not my own\nI knew my skin that wrapped my frame\nWasn't made to play this game\nAnd then I saw him, torch in hand\nHe laid it out, what he had planned\nAnd then I said, I'll take the grave\nPlease, just send them all my way\n\nI began to understand\nWhy God died\n\nThe air begins to feel a little thin\nAs we're waiting for the morning to begin\nBut for now you told me to hold this jar\nAnd when I looked inside, I saw\nIt held your heart\n\nFor me to walk away with\nI began to understand\nWhy God died\n\nI feel like this song is about Tyler, or an ambiguous narrator, moving to college.  I am assuming that just because he said the back is packed.  He truly will miss his family and he wants to go back, but he will also finally being able to live life on the edge.  Thus, \"I barely feel a smile deep inside me.\"  But of course, his mom had given him her wisdom, memories, and sacrifices.  These made him understand the sacrifices that his mom made and how they corresponded to Jesus dying on the cross.  Meanwhile, his mom is weeping about how her son is moving away.  She watches him go happily, but then breaks down when he leaves her forever, or at least for longer than ever, several months.  Now, the ambiguous narrator is driving away and he is confronted with the demon that tortured his mother.  He realized that the relationship with his mother is more important than going to college and getting a degree.  He wants to be closer to the people he loves.  He gives up his life in college to go back with his lonely mother.  He gave up his worldly pleasure to spend time with his mother, a Christ figure, who had given up everything for us.  Matthew 6:24 says, \"Then Jesus told his disciples, 'If anyone would come after me, let him deny himself and take up his cross and follow me.'\"  The narrator is now with his mom, as Tyler is with Jesus.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nthe first time i heard this song i figured that he was moving out of his family home and his mom buckled up her heart in the backseat and i thought that was sweet. as for the demons and stuff i dont know. stay street, stay alive |-/\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThe car, the torch, and the death each simbolise something.\nCar: his mind. \"I start the car and then I begin to add to miles piled up behind me\" this means that he is waking up or thinking and is struggling with something and the more he thinks, the worse he get (more miles piled up) \"I begin to envy the headlights driving south\" he is envyous of the people who dont have these struggles. \"I want to crack the door so I can just fall out, but then I remembered when you packed my car, you reached in the back and buckled up your heart.\" He is considering suicide my falling out of his mind (death) but befrore he does he remembers someone he loves or cares about (someone he thought about) they are always in the back of his mind (reached in the back)\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nMost interpretations of this song assume it tells a single story from start to finish, but I believe it tells three distinct stories, each of which demonstrates the power of love from somewhat different perspectives. And each demonstrates something slightly different about the love God must have had for us to have died for us. I think this notion of separate stories is also reflected in the structure and flow of the music: the second part is clearly set apart from the first and third, which closely parallel each other and even begin with the same lyrical phrase. Even the song's title suggests three distinct parts.\n\nThe first story describes the deep depression the writer feels when he begins a journey by car, perhaps because he can't bear to leave, perhaps because he dreads reaching his destination, or maybe both. When his thoughts turn suicidal, what ultimately sustains him is remembering how deeply someone (I'd guess his mother) loves him. Since this story takes place in a car, I believe it is the \"car\" part of the song's title.  \n\nThe second story describes someone the writer cares deeply about who is tormented by dark thoughts (represented by the demon), perhaps mental illness, and he dreads having to leave her alone, knowing she will suffer without him being there to comfort her. As he imagines her struggles, his anguish is so great that he would be willing to give up his own life to save her. Since the demon in this story holds \"a makeshift torch,\" I believe this is the \"torch\" part of the song's title.\n\nFinally, the third story parallels the first and brings us back to a common theme in many TOP songs, namely suicidal depression that sets in at night and recedes with the morning. Again it is love that helps him through, this time God's love, which he has with him always (symbolically held in a jar), even when he chooses to walk away from Him. As John 15:13 KJV says \"Greater love hath no man than this, that a man lay down his life for his friends.\" The ultimate demonstration of God's love was dying for us. I think it is His death that is the \"death\" part of the song's title.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think Tyler is trying to tell a story that pertains to both religion and a relationship. I almost get the impression that he is telling the story of choosing a relationship with God. The use of a car as a metaphor in Taxi Cab makes me believe that when he says he \"wants to crack the door and just fall out\", he is showing how he wants to return to a life of sin. Also he says \"headlights heading south\", which is interesting because of the wording. The word headlights might be used to differentiate the path south(sin) from the path in the car he is in. \n\nThen the question is who is the \"she\" in this song? I get the image of her being a friend or girlfriend, who his life with God leads him away from. While she \" reached in the back and buckled up your(his) heart\", Tyler appears to making the path of God alone. They still love each other and most likely try to maintain a relationship, but once he had left, the Devil(literal or metaphor for depression, anxiety, ect.) was \"waiting on her porch\". The Devil untimely \"stays there for the night\" which could mean anything from her infidelity, path of sin, or an endless array of possibilities.\n\nAfter Tyler sees how what has happened to this girl he feels terrible only for God to tell him he needs to trust Him. That God has a plan and that the death of Christ was necessary because Tyler was not able to save her, yet despite everything, Christ can.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nIn my opinion, i think the whole song is about his life in a whole. When he says \"the air begins to feel a little thin\" maybe that means he is coming to a crisis of some sort. When he says \"To add the miles, piled up behind me\" this means he is bringing back old memories to himself, before this crisis. Then he says \"I begin to envy the headlights driving south\" he means he wants to turn around and go back in life, and see where he went wrong. \"I want to crack the door so I, can just fall out\"... Maybe suicide. \" but then I remember when you packed my car,You reached in the back and buckled up your heart\" I think this means in his past he had to leave someone or people that he loved, but he/she gave him something to remember them by and he had to leave \t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nMy interpretation of this song was a story almost.\nI believe it's about someone (Tyler) who is driving to a girl's house after receiving a phone call stating she was going to kill herself. I believe the demon is a representation of depression/suicidal thoughts.\n\"And then I said, I'll take the grave. Please, just send them all my way.\" I believe this is Tyler trying to convince the \"demon\" to put all of the sadness away from the girl and onto him instead.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThis song used to confuse me so much but I finally have found my own interpretation so I'm gonn share it.\n\r\nTo me this song isn't about learning how to love during times of hardship, that love being platonic or romantic it doesn't really matter.\n\r\nThe song starts with the narrator feeling depressed, unhappy his life. As he's driving he starts to envy those dying (\"headlights driving south\") and begins to contemplate suicide (\"I wanna crack the door so I can just fall out\"). However, somebody comes into his life that he begins to care about and that's person becomes his anchor to the world. This person allows the narrator to love and understand the love God had for us when Jesus died for our sins, coinciding with Christian belief that TÃ\u0098P constantly subtly references (\"I began to understand why God died\").\r\nNow as the story moves along I'm still slightly unsure about what certain things represent but here are my ideas. So the narrator is with the person he loves now and when he I see dropping her off at her house and leaving he notices \"the demon\" on her porch. I don't quite understand what the demon is but possibly it could be us love's depression. Anyways, when the narrator leaves the demon lays out his plans to take the life of the person he loves. When this happens the narrator takes a stand and doesn't allow the demon to take the only person who kept him alive during his tough times. Instead, he offers himself up instead and in doing so, sacrifices himself as Jesus did, which is once again mentioned in the song. So even though he is allowing himself to die, essentially killing himself, it isn't for himself anymore. It's for the person he loves, giving him peace.\n\r\nThis is my interpretation I hope it makes sense for everyone!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\n@robertgxl I strongly agree with your interpretation but will add this:\n\nI believe when he says in reference to the demon (Satan) that \"he laid it out what he had planned\" he is referring to Satan's plan to kill, steal \t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nWhile 21 pilots does have a lot of songs about their faith a good number of those songs can be interpreted to show their struggles in keeping their faith and I think this is one of those songs and here's why...\n\r\nThe air begins to feel a little thin\r\nAs I start the car and then I begin\r\nTo add the miles piled up behind me\r\nI barely feel a smile deep inside me\n\r\n(He begins to reminisce on where he came from and how much comfort it gave him)\n\r\nAnd I begin to envy the headlights driving south\r\nI want to crack the door so I can just fall out\r\nBut then I remember when you packed my car\r\nYou reached in the back and buckled up your heart\n\r\n(he is tempted to follow a different path but the memories of a loved one who cared a lot about them and their religious security bring him back to grips with his own beliefs)\n\r\nFor me to drive away with\r\nI began to understand\r\nWhy God died\n\r\n(He remembers that even though his thoughts may have been sinful Jesus died for just that reason)\n\r\nThe demon sat there waiting on her porch\r\nIt was a little dark so he held a makeshift torch\r\nAnd when my car was far out of sight\r\nHe crept in her room and stayed there for the night\n\r\n(He's visiting the person he loved possibly when they're sick or on their death bed and he feels an ominous atmosphere but he assumes it's just the grief of losing someone)\n\r\nAnd then I felt chills in my bones\r\nThe breath I saw was not my own\r\nI knew my skin that wrapped my frame\r\nWasn't made to play this game\n\r\n(Later on he is surprised to discover the ominous feeling hasn't left that it's somewhere inside himself \r\nIt tells him that he is not meant to follow the path that he is currently walking)\n\r\nAnd then I saw Him, torch in hand\r\nHe laid it out, what he had planned\r\nAnd then I said, I'll take the grave\r\nPlease, just send them all my way\n\r\n(He confronts his innermost thoughts tries his hardest to make sense of them all and once he has it all laid out in front of him he chooses to give up his religion which initially feels like a condemnation and he is expecting to be ridiculed by the masses)\n\r\nI began to understand\r\nWhy God died\n\r\n(This time he is referring to Nietzsche's saying of God is dead)\n\r\nThe air begins to feel a little thin\r\nAs we're waiting for the morning to begin\r\nBut for now you told me to hold this jar\r\nAnd when I looked inside, I saw\r\nIt held your heart\n\r\n(He feels very numb and lost without his religion to fall back on especially in this moment with his dying loved one where they give him wishes of religious blessings not knowing what is going on inside of him\r\nAnd he feels a sense of guilt knowing how much that person cares about him)\n\r\nFor me to walk away with\r\nI began to understand\r\nWhy God died\n\r\n(But still he can't force himself to come to a different conclusion and this moment solidifies the death of his religion)\n\n\n", "comment_25": "\nSo I was doing a ukulele/vocal cover of this song earlier, and so naturally paying more attention to the chords than usual and it hit me what this song might possibly mean, and it caused me to cry enough that it broke my tough as monsters eyeliner into streaking down my cheeks. (I am a guy btw)\n\r\nI know that Tyler has anxiety issues, as do I. While it's different for everyone and I can only speak for myself, I know that I personally find it difficult to breathe when I have an attack or feel one coming. So I believe that the first line may be a metaphor referring to this difficulty to breathe.\r\nThe second line builds on this, adding reason to why he would be having an attack. He's getting into the car and starting it for some reason. I assume that whatever the reason is (I am still analyzing this part) that that is what's causing the anxiety.\n\r\nIn general I think that the song has to do with suicide. The self titled album heavily discusses this topic so it's entirely within the realm of the possibility to assume that this is one of those. For example, the phrase \"I wanna crack the door so I can just fall out\" seems to be alluding to suicide, although I could be wrong. Even though the next line, it seems as though he might be referring to a reason that he will not kill himself; someone has given him their heart and he doesn't want to hurt that person\n\r\nThe song continues until there is the demon brought into the picture, that sneaks into the girls house after Tyler is gone. This could be symbolic of like me, a depressed person, for example, being alright when I'm with someone but once their gone, it's like the shields have quit working and all defences are down.\n\r\nSo the demon stays there for the night and we can probably assume that he's more or less some form of a mental illness like depression or the like.\n\r\nWhen Tyler begins his interaction with the demon, \"then I felt chills in my bones...Please just send them all my way\" assumably,, he is helping the girl, or trying to, with what it is that she is struggling with. He realises though, once he sees and understands his problems that until he faces his own he's not cut out to help with hers. But he fears for her safety, and begs the demon to let her alone and send the troubles and doubts to him.\n\r\nThe last lines are similar to the first except now they're waiting (plural pronoun, we're) for the morning. Although I know Truce came later this makes me think of \"The sun will rise and we will try again\" and that leads me to believe that they are facing their problems together, to deal with them in the strength of a new day or, to move on because tomorrow is a new day where the sorrows of yesterday are no longer welcome.\n\r\nFinally. The line \"I begin to understand why God died\" is repeated several times. We all know Tyler is a Christian, and I am one as well so I will try to explain this from a Christian standpoint. God is three in one. The Father the Son and the Holy Ghost. So technically speaking when he says God he's referring to Jesus' crucifixion. God sent his son to die because he \"so loved the world\" (John 3:16) and so that would mean that God died for the love of his children. Life and Death are considered equally strong forces by many, and (again I know it comes later) in Ride, additionally, Tyler states \"I'd die for you/that's easy to say//I'd live for you/that's harder to do\" which indicates that he, at least at some point, finds it hard to stay alive. So staying alive for this person could be equally as difficult for him as dying for us was for Christ. (In the Bible, it describes Jesus as being afraid leading up to the crucifixion, and asking God that if there was any other way the same result could be achieved, to spare him.) So that being said, he could be saying here that he understands why God died because he's experiencing a similar set of circumstances in the reverse sense.\n\r\nI feel like all of that made more sense in my head I apologise.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nIt has absolutely nothing to do with \"romance/love\" since a lot of the Twenty One Pilots lyrics are about God/Him. \n\r\nTwenty One Pilots are not always straight-forward with the meaning in their songs.\n\r\n----------------------------------------------------------\r\nBut then I remember when you packed my car\r\nYou reached in the back and buckled up your heart\r\nFor me to drive away with\r\nI began to understand why God died\n\r\nThe demon sat there waiting on her porch\r\nIt was a little dark so he held a makeshift torch\r\nAnd when my car was far out of sight\r\nHe crept in her room and stayed there for the night\n\r\nAnd then I felt chills in my bones\r\nThe breath I saw was not my own\r\nI knew my skin that wrapped my frame\r\nWasn't made to play this game\n\r\nAnd then I saw him, torch in hand\r\nHe laid it out, what he had planned\r\nAnd then I said, I'll take the grave\r\nPlease, just send them all my way\n\r\nI began to understand\r\nWhy God died\n\r\nThe air begins to feel a little thin\r\nAs we're waiting for the morning to begin\r\nBut for now you told me to hold this jar\r\nAnd when I looked inside, I saw\r\nIt held your heart\n\r\nFor me to walk away with\r\nI began to understand\r\nWhy God died\r\n----------------------------------------------------------\n\r\nMeaning (my thoughts) Tyler means God is with him and he wanted to try to commit suicide but he is a Christian and realised God doesn't want him to or God is with him.\n\r\nNow understands why God has died. God died for us. It wasn't for God, we wouldn't be around.\n\r\n(I don't really believe in religion but have studied about it)\n\r\nThe demon have been trying to take a girl(?)\n\r\nI began to understand why God died\n\r\nThe demon sat there waiting on her porch\r\nIt was a little dark so he held a makeshift torch\r\nAnd when my car was far out of sight\r\nHe crept in her room and stayed there for the night\n\r\nAnd then I felt chills in my bones\r\nThe breath I saw was not my own\r\nI knew my skin that wrapped my frame\r\nWasn't made to play this game\n\r\nAnd then I saw him, torch in hand\r\nHe laid it out, what he had planned\r\nAnd then I said, I'll take the grave\r\nPlease, just send them all my way\n\r\nThe demon was on \"her\" porch awaiting for this female (Grim Reaper(?)). It could have more meaning to it but; it depends on your thoughts etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nIn my opinion, the song is about the death of a mother or someone equally important.\n\nThe air begins to feel a little thin\nAs I start the car, and then I begin\nTo add the miles piled up behind me\nI barely feel a smile deep inside me\n\nWhen the air is thin, it means that you don't get as much oxygen as you would normally. It's fair to assume that the singer, struck by grief, struggles to breathe normally, be it because of crying or hyperventilating. He's leaving, moving on, but the grief is so strong that it's difficult to believe that he'll be ever able to experience joy.\n\nAnd I begin to envy the headlights driving south\nI want to crack the door so I can just fall out\nBut then I remember when you packed my car\nYou reached in the back and buckled up your heart\nFor me to drive away with\nI began to understand why God died\n\nSouth is generally warm, and warmth is usually associated with summer / happiness, it's merely an easy concept to put in the listener's head. People are living their lives, have aspirations and are heading into the \"right direction\". He just wants to give up and stop living. It's a stark comparison. The car is packed with things that were \"given\" to him by Her. Say, life lessons, morals, memories, etc. Her heart in this context is her hopes and dreams for him. She wanted him to become something and be happy. Kind of like: \"Let go of me, keep going but cherish the things I've taught you.\" The tragedy is so vile that it makes him understand why even God, the good in the world, the almighty, would rather die than stay. It's so unfair. \n\nThe demons sat there waiting on her porch\nIt was a little dark so we held a makeshift torch\nAnd when my car was far out of sight\nHe crept in her room and stayed there for the night\n\nThe demon; the bad luck, the illness, whatever takes her away. I think the \"makeshift torch\" is that moment when you're sitting by someone's death bed and you make them laugh --- forget about the inevitable. He leaves, the moment of happiness disappears and She is left with dark thoughts and just waits.\n\nAnd then I felt chills in my bones\nThe breath I saw was not my own\nI knew my skin that wrapped my frame\nWasn't made to play this game\nAnd then I saw him, torch in hand\nHe laid it out, what he had planned\nAnd then I said I'll take the grave\nPlease just send them all my way\n\nThe first two lines are about those last moments, perhaps the last moments when she is still delirious. He is saying that he is not ready nor is he made to handle the grief. He isn't strong enough to survive the wicked game his life's become. He doesn't have thick skin. The devil is just the manifestation of sorrow. The devil has stolen the good moments, happiness, She is no longer able to hold onto them, either Her thoughts are just the fear of death or perhaps she isn't able to think anymore. The singer is saying that he'd rather take her pain, her illness, and die than watch her go. \n\nThe air begins to feel a little thin\nAs we're waiting for the morning to begin\nBut for now you told me to hold this jar\nAnd when I looked inside I saw it held your heart\nFor me to walk away with\nI began to understand why God died\n\nThe morning here, can be both symbolic or literal. The next morning after a death is abnormal, it's a very empty feeling you have when you wake up --- that is if you are even able to fall asleep. Or it could be just the singer waiting for good days to come. Once he's done grieving. The jar would be the urn. Her essence and it's his to respect.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis is my interpretation of the song lyrics for what it is worth. I just want to say that that I believe those who think this is a love song or something about a relationship ending or gone wrong are definitely incorrect. In many of the Twenty One Pilots songs there is a clear reference to God taken from the Bible and it is not a coincidence or my attempt to make them seem like a religious band. However, TOP are religious given their continuous mentioning of God and that us a fact. Below I will breakdown the song one verse at a time: \n\nThe air begins to feel a little thin\nAs I start the car, and then I begin\nTo add the miles piled up behind me\nI barely feel a smile deep inside me\nAnd I begin to envy the headlights driving south\nI want to crack the door so I can just fall out\n- The above lines address the life of the character in the song and reflects how many people feel in that they are driving down the road of life (driving being used here to give the impression of life going by quickly and the person driving as not paying much attention to life and perhaps living the easy life without thinking about God as part of life. The person is going in the correct/right direction thus doing what he feels is right. He is down/depressed and wishes he was heading south like everyone else (South here indicating the wrong direction and direction to death). So this verse gives the picture of someone who is trying to do what is right throughout life but life is passing him by and he is not happy in any way. \n\nBut then I remember when you packed my car\nYou reached in the back and buckled up your heart\nFor me to drive away with\nI began to understand why God died\n- These two lines address the reason he does not jump out of the car and head south as God has placed his own heart to ride along with the individual in the song (representing us all). The interesting thing here is that the person refers to God as having packed his car and thus placing what he needs for the journey in the car in addition to God's heart (the most valuable thing to God and us). Another interesting thing is that God \"Buckled up\" his heart and thus placing his own heart in the safety of the car and to some degree in the safety of the driver but overall the car is what protects God's heart and thus the heart being buckled up places no real responsibility on the driver to protect the heart and/or cherish it. Also, I believe that he references God's heart in the backseat as if it is away from his view and more of something he knows in the back of his heart or mind but does not think about it much or care for it as much as he should. Here TOP states for the first time that the individual understands why God died (in reference of Jesus Christ dying for us to save us from hell which is an act of sacrifice on our behalf). So in this verse the individual understands that God sacrificed himself for us and by this have given us his heart to carry. \n\nThe demons sat there waiting on her porch\nIt was a little dark so we held a makeshift torch\nAnd when my car was far out of sight\nHe crept in her room and stayed there for the night\n- This is a reference to the devil or evil creeping into someone's life (not the individual in the song as he is more of an observer as this point). He notes that the \"car is out of sight\" thus placing the individual present to see this without the protection of his car and also it is not a glimpse but something he is standing there and seeing as the car is out of sight. In addition, this evil had a \"makeshift torch\" which the torch signifies light and truth but the torch is not a real one (thus a make shift torch) which looks like it carries light and truth but in reality it has no foundation and is not the truth but more of a mimic of the truth. This is the beginning of the most important verse in the song, perhaps the hallmark of the song/story. \n\nAnd then I felt chills in my bones\nThe breath I saw was not my own\nI knew my skin that wrapped my frame\nWasn't made to play this game\n- these four lines explain what the individual was seeing as he observed the demons creep into the room. He states he felt \"chills\" which is a sign of fear and then goes on to see a \"breath that was not my own\" in other words seeing the demon up close and near by him and he notices that the body he has is not equipped for fight this evil. This is inline in what Christians believe and that is why we rely on God to protect us from evil and the devil as he alone is able to fight evil (what is referenced here as \"play the game\"\n\n\nAnd then I saw him, torch in hand\nHe laid it out, what he had planned\nAnd then I said I'll take the grave\nPlease just send them all my way\n- Here the individual sees God/Christ who has a true torch in his hand which carries true light and truth. God goes on to lay out his plan on how to defeat the evil but the individual in the song asks God to let him fight the evil instead despite knowing his body is not made to fight such a fight and knows that if he has to fight, he will surely die. So the individual asks God to just send the evil his way even though he knows he will die. This verse signifies that even if we want to fight evil alone and are willing to die, we can not as this is only accomplished by God himself as our bodies are not made to fight this type of fight. However, as we know, Christ fought death and evil as a human and died and thus the individual in the song realizes how much of a sacrifice Christ made for us and did it while in a human body which would feel the pain and death like us.  \n\nAnd then I felt chills in my bones\nThe breath I saw was not my own\nI knew my skin that wrapped my frame\nWasn't made to play this game\nAnd then I saw him, torch in hand\nHe laid it out, what he had planned\nAnd then I said I'll take the grave\nPlease just send them all my way\n- This is the only verse in the song which is repeated and I believe this was done to highlight its importance and significance given the comments above \n\nI began to understand why God died\n- Again here, he individual realizes that Christ's fight and defeat of evil was done in a human form and thus was not easy or painless. It was the thing that only Christ could do to be crucified to save us all. \n\nThe air begins to feel a little thin\nAs we're waiting for the morning to begin\n- Here the individual is waiting for a new day to begin and despite Christ defeating evil and death, evil is still present as he notes \"the air feels thin\" which is mentioned previously in the verse when evil was present. This is to highlight that despite Christ's victory over evil, evil still remains in our lives even if we believe in Christ. \n\nBut for now you told me to hold this jar\nAnd when I looked inside I saw it held your heart\nFor me to walk away with\n- here the individual is starting a new day but not alone for Christ has left his heart with him. The individual's journey will now be harder as he does not have a car and has Christ's heart in a glass jar (something that is fragile unlike the being buckled up in the car) so it is up to the individual to protect the heart and thus cherish it as he walks slowly down the road of life where he was traveling before but now more slowly (without a car) and with Christ's heart  not in the backseat but in front of him as he carries it walking forward. \n\nI began to understand why God died\t\t\t\t\n\t\t\t\t\n\n"}