{"comment_0": "\n\"I watched you glide out the door with poise I'd not seen before.\" he is saying that she left simply and it didn't bother her she was calm and had moved on, \"I saw you shine, you shine.\" he is saying that she went on with her life kept living, kept shining. \"I collapsed to the floor. It promised it missed me more\" he is saying that he fell to the floor in dismay that she was gone and that this was not his first time there he is saying that he has better connection with the flor then the girl that he is used to being broken hearted and she/(him being happy) was a rarity \"and said, \"true love is mine. I missed you did you miss me?\"\" the floor is saying that his love belongs to it, that he will never truly love another girl and that he will forever live with heartbreak, and that is something he is realizing as it asked if he \"missed it\" as it had \"missed him\". \"slowly, its consuming me, deliberate and deep.i can't take this deeper panic. Teach me. Teach me not to dream, dream deeply.\" now he is saying he is being consumed by a panic that runs trough him thinking about her and he can't handle it he is asking to be taught \"not to dream\" he want to learn how not to hope probably for fear of being hurt again. \"I haven't left here for days. My panic keeps me awake\" he is saying he has been stuck at home (on the floor) and all he can think about is her, he can't sleep because of his thoughts or do much of anything. \"as he unwinds inside.\" he is saying that another part of him is coming alive or awakening maybe his common sense (or most likely his sorrow) \"he told me I should of known, that he'd hated the way I'd grown to love soft lies\" he is saying to himself that he was foolish and love had blinded him to her lies and he hates himself for that. \"\"she lied. Do you miss her like I missed you?\" he is saying he realizes all her lies and asking himself if he really misses her and how he was happy with her even if it was a lie and how when he was happy if he missed his sorrow and loneliness that was the truth. \"slowly I swallowed your fears for all of those years. How could you let them consume me?\" he is saying that he took care of her and helped her and asking how could she let him fix her and make her promises then leave him with all of her problems that he fixed. \"teach me. Teach me how you dream so sweetly.\" he is asking how she can sleep and still dream after what she did and he is wishing to dream again, to be happy and look for something good in life\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nWhich little scamp edited these lyrics, changing it to \"With poison I'd seen before\"? That is absolutely 100% ludicrous, I'm changing it back.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI'm, first few lines he's obviously complimenting a woman. It literally made him clasps. Nest you can tell it's someone who he knew before, he could be collapsing because it was someone he was over, and now they're back. And he knows he'll give right back into her. And next, you can tell that it's consuming his life all over again. And some part of him knows that she's doing this deliberately. \"Teach me not to dream deeply\" he's saying tell him how to not get his hopes up, because they'll be knocked down. Next he says \"I haven't left here for days. My panic keeps me awake.\" A few AFI songs have to do with is sleeping disorder(s)  So what he's feeling is so bad he can't sleep. \"He told me I should had know\" next another man had been trying to tell him... \"That he'd hated the way I'd grown to love soft lies.\" Here this person wanted Davey to love him, not the lying girl that was hurting him. \"She lied\" he loved lies - he loved her. The man tried to tell Davey that she was no good and that he loved him, but he wouldn't listen. \"Do you miss her, like I missed you?\" He could be asking if there's and love Davey could give him, because he still loves him. Or, it could be that he's asking if she's worth it. And that he doesn't love him anymore so it's being used as a past tense. Then the chorus comes around and now he's panicking because he figured out that he was right. And he can't fix it. \"Slowly I swallowed your fears, for all of those years? How could you let them consume me?\" He's talking to the girl again. Asking her why'd she do this to him when all he'd ever do was help her. \"Teach me how you sleep so sweetly\" could be him asking how she could still sleep at night after what she did. Or, she hurt him so bad, that his insomnia is coming back and he can't sleep, but it's not fair that she can when Davey doesn't deserve to be kept awake with this pain. Of course, this girls, could be a metaphor for something. Possibly cutting himself. I highly doubt it's drugs. And maybe the guy was telling him he needs to stop because he loves him. And in the beginning, he could be having a relapse. Because she/it is coming back into his life. That's how I see it. Thanks for reading, I know it's long. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWhat it means to me is that it is about someone who has caused a person to develop phobias and asking them how they can live with themselves knowing they affected that person in such a negative way.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nSometimes when an older band releases an album, you're incredibly underwhelmed by it. So when said band release another album, you're hesitant to listen because you gave up on them releasing quality new music. However, when I listened to this, I knew that it wasn't quite over for AFI just yet. Burials is a solid record, much better than Crash Love. I'm not entirely sure what happened there...\t\t\t\t\n\t\t\t\t\n\n"}