{"comment_0": "\nthis is a great song. i like the advert with it in. 2 bad England lost, Brazil just play dirty. \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nthe king is back. amen\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nand halleluyah to that!!! \n\r\nthe remix is ace, the original is still god damn kool, and hey if you don't think elvis is good, how dumb are you?? lol j/k but he is the king of koooooool ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nPaloAlto, what?!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nremix is unbelievably awesome! the King lives on forever!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nAWWWWWW ilove this song and i love elvis!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nAWWWWWW i love this song and i love elvis!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nyeah, if anything females should be offended by his attitude towards them, shouldn't they?\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nElvis is THE KING Period. Why so few posts on this artist?\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nWhy would anybody be offended by his attitude? This song is what Elvis was, and his heartbreaker ways and signature hips are what made him what he is. Girls loved it!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nit's all about \"enough talk, we've stalled long enough, it's time to cut the conversation and get to making something happen.\" AND THAT DOESN'T HAVE TO BE SEX!! though a lot of the time it is, haha.\n\r\nanyway, I know that feeling. this song is one of those seize the day anthems, on one of those days when your patience is wearing thin apparently.Edited by delial on May 28 2008, at 06:39AM\n\n\n", "comment_11": "\nmyhotelyear and mikematyus, you two are pretty off... the lyrics aren't sexist at all\n\r\nWhat the song is about is being in an arguement with the one you love, and what Elvis is trying to say is, hey, it's a beautiful night, let's not waste it yelling and screaming at eachother, all that can wait, let's live in the now.\n\r\nAnd paloalto- rape is NOT funny or something to be taken lightly\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nLove this song. I agree there arent enough posts for the king. Great remix as well\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\npeople are mising out.... they think one remix is mad.... listen to the mans orginal stuff.. go elvis... haha\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\n\"Why so few posts on this artist?\"  Becuase all the stupid teenagers ion this site are too use to listening the crap the music industry spoon feeds them that they've never listened to any good music.  All anyone knows if Elvis is Love me tender\" and \"Hound Dog\"  He has so many great songs that are very deep, you need ot listen to the 70's songs, those are great.  He didn't srite a owrd of any of his songs, admitantly, but man could he sing.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nthis song p'owns\r\ni love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nlove this song - oooo puts me in the mood hehe\n\r\nelvis is kings and always will be - though only really the early stuff deserves lots of praise as i'm not a fan of the over weight junkie man whore look - though i dont beleive it was his fault - the others runied him. poor sod.\n\r\nand man he was fit when he was younger!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nthe remix is so totally off the hook! when i dj i like to mix it with a little bravery and it turns out awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI wonder what would happen if Elvis and Prince teamed up.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nAwesome song, his later works were awesome in their own right. His voice just kept getting better till the end, even when the body was failing.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song (the remix version) is played during Ocean's Eleven (the remake version) when they are getting the heist together.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni had never heard this song until i heard the remix on a commercial for a casino or something, and i loved it instantly. it's the cool suaveness of elvis mixed with an edgy techno-ish beat. it's driven and poppy, yet it still has meaning.\n\r\nit is full of sexual innuendo, but geez. if you didn't know the king was about gettin' it on, get out.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nMac Davis wrote this one - ever hear his acoustic version?\n\r\nWork hard all day long to please you\r\nI treat you just like a queen\r\nWhen I come home you just running your mouth\r\nBaby you ainâ\u0080\u0099t sayin a dog-gone thing\n\r\nCome on baby Iâ\u0080\u0099m tired of talking\r\nGet your sleepin clothes on and lets start walkin\n\r\nPretty hot!  Had to tone it down for the King, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nhaha yeah, this song is definetly full of sexual innuendos\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThe theme from Casino! Sucky show but that theme almost makes it WORTH it\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nAWESOME SONG!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nis it me or in the second time he says \"shut your mouth\" instead of \"close your mouth?\" am i right?\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nEep! ephilbrook. Not ALL teenagers on this site are stupid. I mean I'M here.\n\r\nI love this song to little bits and pieces. I do think it is about sex, it could be interpreted otherwise, but let's be real for a minute. XD\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI can't think of anyone in the history of Rock-n-Roll that has been gone 30 years and has a song re-made and it hits #2 in the US and #1 in the UK.Can you?\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nlol.. really nice song for a skate video.. lol\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nMy favorite Elvis track, although I like a remix more. It's such a high-energy, fun track. The song says don't procrastinate. Don't wait. Don't keep running your mouth. Satisfy me. Very basic. Makes a lot of sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI wanna rape Elvis :)\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThis song is just full of sexual innuendos\n\r\nyeah the remix is pretty sweet\t\t\t\t\n\t\t\t\t\n\n"}