{"comment_0": "\nthis song is one of his best. it really displays a lot of truth...\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis is a great song, I believe it was kind of personal for him as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song, I think, talks about looking back and seeing where you went wrong. I feel we all do that...think about something in the past that we could have done that would of made everything better or smoother. I agree with Zacster I think that Kenny put a lot of him personally into this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI just dig this song because he talks in it.  i think it brings the message out more clearly.  anyone who looks back at their life and says they wouldn't change a thing is just not human.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI also regret things I've done in the past, but I'm not sure that if I had made no mistakes I'd be the person I'm today. That's a reason why people say they won't change a thing - because they need to make the mistakes themselves. I do at least, I never get the point when somebody warns me. I've to experience it myself before it makes an impression on me.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nsure theres \"alot things i'd done differnt\" if i had a chance...but everyone makes mistakes...you learn from those mistakes...but yeah alot of folks would change somethin if they could...there isnt one person who doesnt regret  **somethin** in their life...\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI agree with americaneaglechick there isn't one person who doesn't regret and if they say that they don't their lieing through there teeth!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI like this song because I can relate to it and I draw from my own experiences when I hear it. It seems like Kenny isn't just toying with the idea of changing things if he could, he literally wishes he could.  He doesn't explain why that is. That implies he feels he would have enjoyed life more had he done things differently. For myself, I just think it's an interesting concept to reflect the past and wonder how much different lifewould really be if you had second chances. I think that is the best part of the song - it makes you think and touches a special note with those who like to reminisce. I personally wouldn't change a thing. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThere are alot of times I get depressed and think back on my life, and at times wish I could go back to the innocent days, before I went through alot of hardships, made the mistakes I did etc... But all in all I am the Man I am today because of every event that transpired in my life, Good or Bad. I am not where I thought I'd be at 29, But I have to accept myself, Love myself, if i couldnt' , I wouldn't be able to Love anyone else. It all starts within. And as far as regrets, In those moments I was doing exactly what I wanted to do. But anyway as the song says, \"I think we'd all do alot of things different\".....very last line in the song. And I believe it's true. thanks for letting me add my thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThere are alot of times I get depressed and think back on my life, and at times wish I could go back to the innocent days, before I went through alot of hardships, made the mistakes I did etc... But all in all I am the Man I am today because of every event that transpired in my life, Good or Bad. I am not where I thought I'd be at 29, But I have to accept myself, Love myself, if i couldnt' , I wouldn't be able to Love anyone else. It all starts within. And as far as regrets, In those moments I was doing exactly what I wanted to do. But anyway as the song says, \"I think we'd all do alot of things different\".....very last line in the song. And I believe it's true. thanks for letting me add my thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song is a reminder to me that life doesn't have a \"do over\" option. I have to think what I'm doing now is going to affect those around me and My life is best lived by bringing joy to other, not just myself.\t\t\t\t\n\t\t\t\t\n\n"}