{"comment_0": "\nHere is what i found: \"The line \"jai guru deva om\" is a mantra of John's designed to help him concentrate while meditating, something he was into at the time. It means roughly \"Glory to the spiritual master\" and has the focusing sound \"omm\" at the end. (Translation varies according to particular level of Sanskrit used for divination.)\" \n\r\nI found that here recmusicbeatles.com/public/files/faqs/…    i hope that helps. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI really love to listen to this song.  I'm quite sure what he is actually referring to when the song was written, but my interpretation would be the following:  Perhaps there is hope for peace or love through words and thoughts.  Maybe such words of joy, happiness and even sorrow are contagious.  \"Words are flying out like endless rain into a paper cup, \r\nThey slither while they pass, they slip away across the universe.\"  I think these words encourage the belief that such words of meaning and feeling, when spoken, can be passed on from person to the next just by the very sound of them and thoughts of them.  The very idea that love or sorrow exists, allows for love or sorrow to actually be.  Pass it on, those feelings and thoughts. \"Sounds of laughter shades of earth are ringing \r\nThrough my open views inciting and inviting me. \r\nLimitless undying love which shines around me like a million suns, \r\nIt calls me on and on across the universe\" -here it is explained how he is surrounded by words of feeling and hope.  encouraged by words of all people around the world.  not just a certain race or religion....just the kindness of humanity across all of the universe.   \n\n\n", "comment_2": "\nI think this song is, most of all about about achieving a state of mind where you no longer need to think, where your thoughts, your words and your concerns go away. It's about our lack of importance in relation to our world, our universe. It ridiculizes earthly worries, and urges us to open our senses and feel. Just feel everything around us, below us and above us. Become one with the universe and everything around us, lose our individuality and become unviversal. \r\nThe images in the first lines of the song represents this lack of importance of word, talking and worrying in general, â\u0080\u009cWords like endless rain into a paper cupâ\u0080\u009d, paper cups can never keep rain inside of them, they are uncapable of holding them as we are uncapable to hold onto words, so he let's them go, â\u0080\u009cSlip away across the universeâ\u0080\u009d, through meditation, that feeling of your head going â\u0080\u009cblankâ\u0080\u009d.  \r\nThe next verses are about the feelings that fill overwhelm him, when he achieves that state. About letting everything into you, the good and the bad, and at the same time letting nothing affect you. \r\nEmbrace everything but remain unmoved, loving everything and accepting this things as inevitable and almost neccesary. â\u0080\u009cPools of sorrow waves of joy are drifting through my open mind, Possessing and caressing meâ\u0080\u009d, opening your mind is the key element here. Then there's the mantra, it doesn't matter what it means, for me it's related to the way of getting into that state. â\u0080\u009cNothing's gonna change my worldâ\u0080\u009d may sound a little selfish, arrogant and close-minded at first (at least for me) and even more if you look at it as a sentence on its own. \r\nBut if you relate it with the context of the song (buddhist meditation) nothing's gonna change my world is really about accepting the world and the universe as it is, feeling happy and calm about it, wanting nothing more and nothing less of it. For me, it's more about not WANTING to change the world, not needing to do it, than not LETTING anyone change it, as a way of defending it or blinding ourselves. It's the same sense of peace, tranquility, conformity and of communion with the self and the world of the entire song. It really embodies the entire concept. It's almost the inverse of being selfish, it's about abandoning one self and becoming whole with everything that's outside of us, achieving inner peace. \r\nThe verses that follow this chorus, \"Images of broken light which dance before me like a million eyes,\", in my opinion are much more open to interpretation. For me, these images are a metaphor of the stars, of the open universe in it's literall meaning, the one we think about when we hear the word universe. It's about a calling to it's beauty, and later, the star's call for us to join them across the universe, these are just beautifull images that add to the songâ\u0080\u0099s mood of mysticism. It is a literal image of us elevating through meditation and joining the stars, our universe.\r\nThe lines that follows, continues with the idea of the lack of importance of our tribulations here on earth, and the our need to let them go. Once again our attempts of getting ahold of them are ridiculized by the image of the wind inside a letter box, another impossible attempt. The quick passing of our problems here on earth is emphasized, they are put in perspective in relation with that that is more important, finding peace and love. Our need to focus on more important matters.\r\n\"Sounds of laughter shades of earth are ringing Through my open views inciting and inviting me.\" This relates once again with the lines about opening your mind and senses and letting the world in. \"Limitless undying love which shines around me like a million sunsâ\u0080\u009d is another metaphor of the way he feels the love of the world surrounding him. â\u0080\u009cIt calls me on and on across the universe\", the same structure is repeated. This verses are another sublimation of the state of mind achieved through meditation.\r\nMost of all is the call for us to be there, to reach for that eternal love, to becoming one with ourselves, our universe, our gods, with our love, with our joy, with our sorrow, with everything. Embracing not only the good but the bad in order to feel everything and love as we are loved inconditionally by the world. \r\nLove is once again (as its common in the amazing world of the Beatles songs), the main theme of this song, love for everything on earth. This idea is related to the desire of losing individuality, and the frustration this individuality carries (trying to hold on to things, and the immposibilty to do so), and the almost neccesary search for something that is superior to us, in order to be at peace with ourselves and with our universe.\r\nI hope this is useful! Itâ\u0080\u0099s my way of seeing this incredible song.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIf you ever sit and close your eyes and exist in your own head you are just a small piece in everything that exists, like the universe.  When our mind is open its as big as the universe. Everything weâ\u0080\u0099ve ever seen, said, imagined, light, all the people weâ\u0080\u0099ve ever known, mixes of words and letters, our memories, they all exist in our minds, and they float around there undisturbed but in relation to each other, moving in harmony with each other and accepting and being thankful to this giant place they have to exist and be apart of because it is so magnificent.  When we go into our mind everything in that universe is accepting they want to share their happiness with everything else, itâ\u0080\u0099s true happiness and comfort. Something people should be in search of in their lives in the real universe where people have become greedy of the objects that were so friendly and loving to us in our mind, when we treat parts of this universe badly things are not balanced, they are not in harmony. But when we find our own universe in our mind its so powerful itâ\u0080\u0099s so inviting, itâ\u0080\u0099s so attractive, and we love it just like every other piece of the universe does.  And the truth is no one can take the universe we have in our mind, no one.  No one can ruin or change our universe like they can change the world we live in, and nothing could hurt it anyway because there is so much love to a limitless extent that nothing could disturb the peace. The feeling when we are loved and we give love is one we should never forget in order to make the real world more peaceful.  To the people who complain about people who donâ\u0080\u0099t know who wrote the song, remember the meaning of the song first, because in the end the lyrics of the song and the sound that comes from the song are what matters most, because we share these words and sounds with the universe.  We shouldnâ\u0080\u0099t be obsessed with the idea of ownership.  Do you think the lyrics in this song want to be captured by a person? No, they want to be in harmony with the rest of the world.  With any song, with any music there is harmony between the words and the singer, the notes and the player.  When anyone sings this song it is just harmony it is the musician and the song harmonizing together giving each other love, thanks, and giving care for each other. As long as we give love to people in this world we are not wasting the time we have in this world.  It would be nice if one day things can be in harmony as they are when we fall into our minds, I do hope that eventually all people wonâ\u0080\u0099t be so greedy as to take away happiness from others, but to give it. Because I love being apart of my universe as John Lennon loves being apart of his universe, and as a lot of people and words and memories, and songs love being apart of their universe. So maybe someday we can share our minds with others and they share with us, to bring our own universes to the universe we live in.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt's a description of nascent attempts to meditate and become one with the universe.\r\nJai Guru Deva is just some thing to help the process and has no significant meaning.\r\nThis is how most new comers to meditation feel what it would be like.\r\nMind is trying to let go.. and the soul is trying to become.. but the Mind is vicious and it doesn't let go so easily.. But when's it does .. 'Nothing can change your world.' Not the World Not yourself, Your thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n\"Pools of sorrow, waves of joy are drifting through my opened mind\r\nPossessing and caressing me\"\n\r\nthat is the single most important line in this song because it helps us to truly understand what Lennon was thinking, nothing. to have an open mind is to be completely open to the world around him and to experience life as it was meant to be experienced. to receive that \"limitless undying love\" one must be open to it and not be held back by the minds own ramblings. \n\r\n\"Thoughts meander like a restless wind inside a letterbox\r\nThey tumble blindly as they make their way across the universe\"\n\r\nhis thoughts are there and he is aware of them, but he pays them no mind. he locks them away and puts them inside a box. he knows that all negativity is an illusion created by the mind. the only real in his life was what he could actually experience and this song is about how wonderful it is when you stop letting your thoughts rule you.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nAnyone know what \"Jai Guru De Va Om\" means? thanks.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI was always curious about the line in Sanscrit and never knew the words, let alone their meaning :) Now thanks to this site I do :)\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThe literal translation of Jai Guru Deva would be something as follows:- Jai implies Glory; Guru means Master and Deva is God. Om is a sanskrit word which Hindus use liberally at work, at the beginning of any event, festivals and prayers.\r\nBe that as it may, this is a lovely song; I especially love the sound of the sitar at the beginning. Since George was crazy about sitars, perhaps a lot of fans thought that this song was written by him. Moreover, George was completely immersed in Hinduism and the lyrics of this song are more or less in keeping with the teachings of the Geeta - the holy book of the Hindus.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song is really very beautiful. It's a happy song and a sad song at the same time. \r\nAnd I think wasting time being angry or hostile is silly. I know George didn't write this song, but it doesn't matter. It also doesn't matter what inspires people to listen to the beatles, whether it be finding them on your own or hearing their songs on a soundtrack. \r\nI've loved the beatles for years, but if someone comes to find their awsome-ness via \"I am Sam\", all the power to them.\r\nBeauty is beauty, peace is peace and Love is love no matter where you find it.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nCried to this song many, many times. Always been there for me. Easily my all time favorite by the beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nWhen I listen to this song, I really believe that nothing will change my world, I mean- yeah, unfavorable events may occur, but my \"world\" will essentially be the same. There will always be some kind of happiness in me. This song makes me both happy and sad,lol. Bottomline, it's amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis is one of the most beautiful songs ever written.  I think it is about John Lennon's dream of Peace and Love throughout, well, the universe.  The \"nothing's gonna change my world\"  line is saying no matter what the world says about this, it's his dream and it cannot be changed by anyone else but him.  It's an incredible song.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song is OBVIOUSLY about psychedelics.  if you've done them then the song speaks for itself, you should be able to pick it up within the first stanza.  yes some of the lyrics may have deeper meanings, but this is pretty much just harrison trying to describe the psychedelic experience, which can never be fully emphasized in words.  little tip for you guys.  take some shrooms, listen to this song, and you will instantly understand EVERYTHING.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nJohn's use of \"Jai Guru Dev\" is the result of the Beatles' interest in Transcendental Meditation and this phrase basically means \"Glory to Guru Dev\".  Guru Dev was the spiritual teacher of Maharishi Mahesh Yogi, who brought TM to the western world.  \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\n\"Words are flowing out like endless rain into a paper cup,\r\nthey slither while they pass, they slip away across the universe.\"\n\r\nHere, John is simply saying that at this point in his life he had come to realize his words were so enamored and interpreted by some of the greatest of minds of his time, that expressing himself through words was becoming a \"breeze\" for him. He also understood that he had become a spokesperson for the world. His confidence and belief in himself had become completely reassuring.\n\r\n\"Pools of sorrow, waves of joy are drifting through my opened mind\r\nPossessing and caressing me.\"\n\r\nJohn allows us inside his mind, while surrendering his vulnerabilities to us. Although he expresses \"waves of joy which caress him,\" to his delight - he also delivers voluntarily a \"possessing sorrow,\" which most humans rarely admit to because they fear societal ridicule, which in turn, naturally leaves those, who are too afraid to look within, in spiritual darkness.\n\r\n\"Jai guru deva om...\" \n\r\nJai guru deva simply means, Praise to the victorious one, or to the one on high. John praises the natural forces of energy which provides for us our feelings and needs of love and peace. As for \"om\", it is the \"hum\" monks verbalize while in a state of meditative consciousness. While in such a state, monks claim to hear the earth's wobble, thus the reason for their hum (om). They simply attempt to replicate the \"wobble\" they feel so completely in-tune with. I gather John attributed such unworldly vocalizations to his own spiritual consciousness, using music and poetry as his tools to communicate such enlightenment.\n\r\n\"Nothing's going to change my world...\"\n\r\nJohn knew at that point in his life there was no turning back. He had become enlightened through life's lessons, and had achieved a sort of nirvana by simply practicing the principals of love in his every day world.\n\r\n\"Images of broken light which dance before me like a million eyes that call me on and on across the universe.\"\n\r\nIn the sentence above, John asserts that something greater than himself is calling him on to relay his poetry to a greater universal audience.\n\r\n\"Thoughts meander like a restless wind inside a letterbox...\"\n\r\nHere, John's telling us that his thoughts are rambling fluently without even trying. In a way that suggest he is an involuntary poetic messenger for some greater force which dominates him.\n\r\n\"...They tumble blindly as they make their way across the universe.\"\n\r\nJohn recognizes that words, much like life itself, can never be, nor should be, harnessed or controlled. John knew that such controls are to be avoided if one wishes to acheive the height of their awareness.\n\r\n\"Sounds of laughter, shades of earth are ringing through my open mind inciting and inviting me.\"\n\r\nJohn is expressing that he has reached his personal spiritual plateau and is propelled by it's enormous possibilities.\n\r\n\"Limitless undying love which shines around me like a million suns, it calls me on and on across the universe.\"\n\r\nIn the end John realizes that it is a \"limitless undying love\" which \"shines\" and \"calls him on\" to verbalize his poetry \"across the universe\" to all races. \t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nWell, you know what they say about opinions...\n\nBut that's what I like about literature, or anything \"authored\" for entertainment.  It's always left up to the individual's own interpretation.  Because everyone's' not going to agree anyway.  That's what's cool; no one's wrong.  It's the whole opinion thing. \n\nThis is a song written by John Lennon, for John Lennon.  For his thoughts to be taken or left.  'I believe', was his mindset.  And why not?!  He's putting it out there and you don't have to listen, right.\n\nSo, 'I believe' the message to be:  Throughout all of his experiences and travels, whether physically or chemically induced; he's telling us what we may experience, metaphorically.  People, cultures, Guru's, Cult Leaders, or whomever it may be.  Everyone out there trying to influence, for whatever gain He or She is trying to accomplish.  We can experience it.  But we don't have to \"buy into it\".  \n\n'Nothing has to change our worlds'.  Unless we let it.  Live your life according to your own beliefs or ideals.  If you believe this is what's right for you according to whatever set of rules you try to live by.  Hopefully the rules that are going to get us where we want to go, in the end.  Whether you believe that's no where or, everywhere.\n\nConjecture...opinions...choices.  That leaves us plenty to think about throughout or days.  If it's a yammering street corner radical; or just someone that thinks he or she has all the answers, that wants you to \"agree with them\".  Nothing 'has to' change your world.  It's up to you.  :)\n\nI'm close to the end.  And I've been able to re-view all pertinent issues in a different light.  Like the 13 year old girl that beautifully interpreted this song.  She'll have other views as her years advance.  As I did, listening to this song when it was released and I was in high school; and as I do now.  :)\n\nGood luck with it guys.  So much doesn't matter.  :)  KC\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nyeah, thanx, i was very curious to what that meant and now i know.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ni think this song is like a beatles precursor to the songs in john lennon's solo career..like imagine. this song kind of has the same feel as imagine, except it features all the beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nextremely love this song, the fiona apple version is neat-o too.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni think it would be neat if john and fiona could sing this song together. now that would be awesome. but, alas..\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI only grew to like this song after hearing Rufus Wainwright's cover.  Upon reappraisal, it is rapidly becoming a favorite (not quite up there with I'm So Tired, Dear Prudence, or Revolution, but...)\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\n'jai guru de va om', i read somewhere, is something like 'god is my teacher'.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nNope, George didn't write it.  \"Across the Universe\" is vintage John.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ni agree, fiona does sing well, and i like her other songs, but i think this one should have been left alone.  maybe i shouldn't have said her version was \"bleh,\" but blah.  fiona's interpretation is definitely more somber, to the point where it makes her sound as if she's bored with the song.  sometimes it sounds like she's singing it all in one breath.  john sang it in a way that's equally serious but more full of life, more hopeful.  i'm not sure about the guitar-playing, but i don't think it's the technicality of this song that gives it its effect.  john is singing his lyrics in the way he intended, and i personally think his style fits the song better than fiona's version.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIn an interview John complained that hours would be spent on Paul's songs to get the production just right, while a great song such as \"Across the Universe\" would take five minutes, \"The bloddy guitar wasn't even in tune!\" he said.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\njohn wrote this song in the middle of the night. he had the melody stuck in his head he tried using his meditation chant to fall asleep but he ended up adding it to the song... amazing song\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nPerhaphs Lennon's best lyric ever!  I love the imagry (spelling?).  Esp. \"pools of sorrow waves of joy\",  Beautiful!!\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nIt's agony and ecstasy being created by his will to \"meander\" like the erratic wind inside him. He tries to comprehend, yet supress his erraticism, but it just... doesn't work for him. \"Pools Of Sorrow\" are lapped up by his inner soul, yet the \"Waves Of Joy\", always crashing on the shore, are those that he picks up as that that's treasured\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nExcellent song. Emotional experience while using drugs!!! LOL.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nHey Bobo, relax it's pretty simple... Pools are deep, and stagnant/constant, waves are fleeting and intense... get it?\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nYeah, sure, but at different times. I understand your take on it, but I do like to elaborate outside of the song itself to an intrinsic meaning that wasn't even thought about at the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nthis is a beautiful song, and i actually think the cover done by fiona apple wasn't half bad.  i normally don't like covers, but she used interesting background music. it is also cool that she is a female singing.  but of coarse it could never compare to the original. i just like the simple phrase:  'nothing's gonna change my world'\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nGentles, I refer you to the All Music Guide at URL address:\n\nallmusic.com/cg/…\n\n\n", "comment_34": "\nOne should remember that there is an almost nihilist bent to Buddhism.  Part of the philosophy is that our reality is made of of 'skandas', which are attributes or qualities.  Since a quality is only real in the mind, and the mind is not substantial, the world we see is not real.  Very mind-bending (and not very practical unless you want to just hang out and vegetate), especially if you take the right drugs. ;-)\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nMany people have asked what the phrase \"Jai Guru De Va Om\" means? Before The Beatles studied under the Maharishi Mahesh Yogi in India, they met him in England. Traveling with the Maharishi was his guru, \"Guru Dev.\" John Lennon liked the name and decided to use it in this song. It is nothing more than another Guru's name.  Just John Lennon playing with words again.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI believe that a lot of people mistake Across The Universe to be a Gorge Harrison song, simply because it fit his style of writting.  Although it was a John Lennon song it has that George style. I defientely think that this song was one of the best work that the beatles did. \r\nAnother reason that people might think it is a George Harrison son is because around this type Harrison was very spiritual.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\ni love this song its on my top ten all time favorites :)\n\n\n", "comment_38": "\nthis is my favorite beatles song ever. it's...my favorite song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\none of my top 5 favorite beatles song, this is beautiful, and so peaceful to listen to.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nthis song is a great piece of art. i never really had such a love for music before i listened to the beatles. and when i heard this song, it's like my whole outlook on music changed. i'm a huge music fanatic now. this song just seems to bring me to a utopia of my own. i forget all my problems and i just focus on the positive things in life. it's just weird how this song can change my mood on anything. thanks to my father, he was the one that introduced me to this song. it's his favorite song of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\njohn lennon wrote this song one night after he woke up, it was about a dream that he had.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nJai Guru Dev is a phrase Transcendental Meditators use to greet each other, or in other ways the way a Christian might say, \"Praise God.\"  Guru Dev was the teacher of Maharishi Mahesh Yogi, the founder of TM.  If you go to a TM center,  there's always a picture of him in a prominent place.\n\r\nI think this is a song about meditation, about the experience of meditation.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nthe song is about transcendtial meditation...a branch off hinduism...and generally about the hindu concept of all things being one...the universe in a thought.  it was written and sung by george harrison..the most influenced by hinduism.  he also wrote and sang within you and without you...song with same concept.  jai guru deva is a general chant (mantra) used by hindus.  jai is a praising word...like Lord.  guru means teacher and deva means god.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\ni totally agree w/you rageshdc, but john definitely sings it, and im 90% sure he wrote too.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nfuckin great song tho\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\njohn sang it...and he wrote it too (all songs written by either Lennon OR McCartney (or both) are attributed to Lennon McCartney metallicaman)\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nthis is my favorite beatles song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\njust an FYI:\n\r\nthe word \"Om\" is used several times in Herman Hesse's book 'Siddhartha.'  The book is about someone who leads a ascetic lifestyle, then gets caught up in a materialistic lifestyle and finally realizes the error of his ways and reverts back to his ascetic lifestyle.  A great book.  Anyway, the characters in the book used the word \"Om\" while they meditate and the characters explain to the reader that it means \"perfection.\"  Om - perfection.  Herman Hesse writes most of his books based on eastern thought and the books are wonderful. \n\r\nrAIn\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nwhat's i am sam? \r\nanyway, IanoDublin, how does this song make you \"laugh out loud?\" it's one of the most beautiful songs. and it would only sound like george to someone stupid who doesn't really know the beatles really well. at least that's what i think. it doesn't even sound like george, the singing voice i mean. the singing is beautiful too. all beatles covers suck, no matter what. i don't think anyone besides a beatle could tell really what the song was about and the emotions behind it.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI'll tell you an awesome beatles covers. MxPx - I Saw Here Standing There\n\r\nAnyways, I love this song too. I don't know or I'm not sure who sings it. I think (only think John did) but it seems like a bit like \"George\" song. Anyone have a link or evidence as to who sings it?\n\r\nI think the song is just about a bunch of Hindu stuff (for lack of a better term) involving meditation where everything is pure and calm. But that's a rough interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\none of my favorite songs on let it be.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\n\" I'll tell you an awesome beatles covers. MxPx - I Saw Here Standing There\"\n\r\nGood cover if you compare it to all the other crappy punk covers.  At least they got the background vocals right.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\noh god where wud the world be without the beatles.by far my favorout band and im only 16.you should see my room.absoulutly plastered in pics and cut outs of them.anyway whatever this songs 'hidden' meaning is cant people see john is trying to say something about meditation.TRY IT.although transcendental meditation should never be tried by someone who hasnt been trained by someone trained by the maharishi, i stongly reccomend it.there is no other feeling like it and thats exactly what john thought.also look up the maharishi's teachings of natural law.all exremely mind blowing stuff.try this web site: maharishi.org/\n\n\n", "comment_54": "\njohn wrote this song coz he was inspired by the line 'sounds of laughter, shades of love'. he actually wrote the entire song just because he wanted to include those lines in it. he was in india when he wrote this song, at the maharishi's ashram.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\n\"limitless undying love\" is the most beautiful thing ive ever heard.  i base my life around that line\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nHey, this is pretty close to Pink Floyd lyrics. Which one was first?\n\r\nBeatles: \"...inciting and inviting me...\"\n\r\nPink Floyd: Echoes \"...inviting and inciting me...\"\n\r\nHere's the full text (there are even more similarities; it's not exact, but interesting):\n\r\nPink Floyd:\n\r\n\"Cloudless everday you fall upon my waking eyes\r\nInviting and inciting me to rise\r\nAnd through the window in the wall\r\nCome streaming in on sulight wings\r\nA million bright ambassadors of morning\"\n\r\nBeatles:\r\n\"Sounds of laughter shades of earth are ringing \r\nThrough my open views inciting and inviting me. \r\nLimitless undying love which shines around me like a million suns, \r\nIt calls me on and on across the universe \"\n\r\nWow.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI think the song is also talking about the world and the universe and how time passes and the infinity of it all; as well as the pointlessness of our society compared to the continuom of the mind and time.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\ni didn't start liking the beatles BECAUSE of i am sam but.. i know the rufus wainright cover of across the universe used in i am sam is amazing, but ya.. it's definitely sung by john. within you without you sounds more.. indian than across teh universe, plus you can hear john talking and laughing at the beginning of the song across the universe. he also states that it was one of the worst recordings he's ever done, but he loves the lyrics he wrote. thus, john sang and wrote 'across the universe'.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nLesson number one!!!! In discerning who wrote which songs between lennon and mcartney , do this. Figure out who is singing lead vocals then you will know who wrote the song. They didn't write songs for each other. They went away on their pianos/guitars and then came back to each other with the ideas. Simple. They were in fierce competition with each other, thats what made them great. Always trying to outdo each other. - Limitless undying love = infinity.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nyeah john is my favorite beatle he was so hyped up on lsd when he wrote this\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nGuru Deva, actually it is Guru Dev, is incited in the song because he was the Maharishi's teacher.  He is an actual person, and they invoked him in their meditation every day.  The name actually has meaning in itself.  A Guru is a teacher, or spiritual leader of sorts. Dev, according to some other sites I went to, means god or heavenly one.  As stated,  Maharishi's actual teacher's name was Guru Dev.  John Lennon appeared to take the liberty adding the \"a\"on the end. Jai means, and there are several meanings I have for this, \"I give hope, or thanks to\", this I was told, but some sites say it means, \"victory\" or \"salutations\".  Om, is probaby the easiest part to explain. Om is believed to be the natural vibration of the universe.  Hence, when many meditate, they make the \"ooohhhmmmm\" sound.  They are trying to bring in that vibration of the universe. \n\r\nSo all together it means, \"I give thanks (victory) (salutation) to Guru Dev (or heavenly teacher), om\".\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nthis song is just john babbling when he was high and he put it out cuz he knew people would try to figure it out and it sounded cool\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\ncorrection  0cool  george harrison wrote it and john lennon sang it\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\ngeorge defintly didn't write this song...anybody knows that this is Lennon's style of writing....check the song in the album cover of let it be, or look it up it says lennon,Mcartney....so harrison defintly had nothing to do with the writing of this song\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nJohn Lennon is quoted as saying that this is one of the best songs he wrote, which eliminates the George theory. Spike Miligan used it on a charity record, i think for the WWF and animal noices were added, it was later reproduced by George Martin for let it be. The extended OM is the noise the universe makes whilst in meditation and the Jai Guru refers to a spiritual teacher named Daiva (i think) read revolution in the head for more info. Another tip when deciding which of John or Paul wrote a song. Paul will often write in the third person ie Elanor Rigby and john adopts himself as the theme of the song ie I AM the walrus.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nThis song is such an acid trip...its trippier than Lucy...thats all I have to say.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\n[this] is a beautiful song and lyrically it means a lot to me. i think it's about holding onto your innocence in the face of everything; it's such a celebration of life.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nTHIS IS NOT AN ACID TRIP SONG!!!! why do all of the Beatles songs have to be about drugs, people? i love this song..... so calming and just.... well there's really no words to even explain it! :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nOn acid, John thought he was Jesus.  I believe in my heart that this song was inspired by meditation and is a spiritual awakening to God,(limitless undying love) of the univers(om).  John saw God and understood that God shines like a million suns in all of us, not just him and a select few gurus.  It was the death of his Jesus complex.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nyeah, and newsflash to the stuck up metallicaman and all the other beatles lovers who think they're so original, the beatles were THE most popular group in the US for an entire decade, so stop acting like some whiney punk-rock-kid when the rest of the world discovers their favorite garage band.  And if a younger generation discovers the beatles by means of the covers on the I Am Sam soundtrack (which is an excellent album) than good for them!\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nDid anyone notice how a bunch of idiot musical superstarts just fucken *destroyed* this song at the 2005 Grammys? Gah! And to think they did it in order to raise funds for tsunami aid...\n\r\nPersonally, I think \"Sending Our Love Down the Well\" is a much, much better song.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nyes I am sam is an awesome album.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\ni LOVE this song. it's transcendent beauty will live on and spread the beauty of john lennon's words for all to hear. john says he was really depressed when he recorded this, and it sort of shows. he isn't very energetic(not that he normally is).\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI've been near to this since it's release. Simply, and the only meaning, is that knowing and experiencein joy, beauty, and oneness within the inner self... is love. And, when a person is in \"love\" it completes the \"universe,\" thus, when everything is right and whole \"across the universe,\" a person can't help but feel that \"nothings gonna change my world.\" A feeling that a person who is in love and at peace with everyone and everything around them, finds great joy in meditating (praying) about because it's something they never wish to see the end of. Indeed, the Beetles knew this way back when, just like people have aways known... but rarely have it seen it expressed so well and so complete.\r\nI believe George contributed more than John to this song, adding the melody, much of the lyric and guitar, but John (true to the thought) adopted the idea and gave it form. John was best at re-creating himself to adapt to the demands being made.\r\nBeauty and harmony... always.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI can totally understand why someone would think this is a George song, but it's NOT. It's a John song. John wrote it and he most certainly sang it. If this is one of the only Beatles songs you've heard, then you might not realize that, but any Beatles fan knows it's John's voice.\n\r\nAnd here's what John said about \"Across the Universe\" in 1980:\n\r\n\"I was a bit more artsy-fartsy there. I was lying next to my first wife in bed, (song originally written in 1967) you know, and I was irritated. She must have been going on and on about something and she'd gone to sleep-- and I kept hearing these words over and over, flowing like an endless stream. I went downstairs and it turned into a sort of cosmic song rather than an irritated song-- rather than 'Why are you always mouthing off at me?' or whatever, right? ...and I've sat down and looked at it and said, 'Can I write another one with this meter?' It's so interesting. 'Words are flowing out like endless rain into a paper cup/ They slither while the pass, they slip away across the universe.' Such an extraordinary meter and I can never repeat it! It's not a matter of craftsmanship-- it wrote itself. It drove me out of bed. I didn't want to write it... and I couldn't get to sleep until I put it on paper... It's like being possessed-- like a psychic or a medium. The thing has to go down. It won't let you sleep, so you have to get up, make it into something, and then you're allowed to sleep. That's always in the middle of the night when you're half-awake or tired and your critical facilities are switched off.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nYou kids need an old hippie to explain things to you, it seems. Some of you have this right and some of you are just speculating wildly. Those of you who think George wrote or sang this song do not know your Beatle history and cannot even hear the difference in their recorded voices. This is sad.\n\r\nIt's John Lennon, of course, and he's writing about the trenscendental meditation experience. Some of you have translated Jai Guru Dev already, you're right. It's what TM meditators say at the end of their sessions and it's praise for Maharishi's guru (teacher), who has become the guru of all TM meditators due their training by Maharishi. I suppose when Maharishi dies the honor could pass to him. Gurus receive devotion and respect from their students, it's an age-old Indian tradition.\n\r\nThe lyrics are written by John but are taken from the many analagies that Maharishi liked to use to describe the way thoughts float around in one's mind while in a mediatative state. Maharishi was quite talkative and loved explaining concepts through analagies. Hinduism says that there are states of conciousness that exist at a deeper place in our minds and that it is possible to access them through daily meditation, in which we are trained not to dwell on these passing thoughts. \n\r\nSo what John did was to turn his TM training into a poem. He was iintitally very taken with TM but later became disaffected with it and with Maharishi. I suspect that John's own powerful ego could not abide the competition. Go listen to \"Sexy Sadie\" and insert \"Maharishi\" in place of the title.\n\r\nTry to find the versionj of this that was not botched by Phil Spector for the first Let It Be album. The choir and the strings are awful. They recorded the song and then donated it to an environmental organization for a fund-raising album before it was on any Beatle release.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nDUH! haha atcaully thats intresting i iddnt know the last part but i knew about the meditating thing, i love john lennon\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nJOHN WROTE IT! GOSH DAMN PEOPLE\r\nI took down my dads old old old Beatles guitar book and looked it up \"Lyrics and music by Lennon/McCartney\"\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nJai Guru De Va Om\r\nGee and for the past 2 years I thought I was hearing the words: \"I could rue the day...ahh\". I couldn't quite make out the last syllable. Actually my words fit well with the rest of the song. One could rue the day or just accept what has happened because nothing's gonna change it anyway. The singing recognizes he could sit and rue or accept; he chooses to accept what has happened or will happen depending on what prespective your looking from. It is saying that to feel sorrow along with joy is ok, but don't let sorrow turn to regret move on. My words may be less mystical than Lennon's but seem more more logical. At least I think it fits the song. And by the way, it definitely has facets of Pink Floyd in it; from the song Echoes. \"Cloudless everyday you fall upon my waking eyes inviting and inciting me to rise. And though the window in the wall come streaming in on sunlight wings, a million bright ambassadors of morning\". The words \"inviting and inciting\" were interchanged to avoid copywrite infringments. (ha-ha) Really great song. John is right when he said it just came to him as if it \"possessed\" him (ibid, emeraldfate this page). Every artist, song writer and inventor and what they create is to some degree a product of their time and the people who share it with them. So hurray for all the great inspiring songs of the last few decades. Where is all the crap today coming from? Well it's just a sign of the times. We can't change the world, but we can change ourselves by starting with what we focus on. Focus not on things below (negative, evil etc.), but on things above. I think that is what this song says to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI used to think that in the Sanskrit line was him saying 'like a rude daze'. I don't know what I was thinking... o_o\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nI think you are all wrong about the Jai Guru De Va Om. You think it's a special chant? Well,in the Apple Scraps Bootleg when they are practicing the song John and Paul are singing at the same time,and they say it a few times. But they say Jai Guru Deva,not Jai Guru De Va Om. They is absolutely no  Om and De Va sounds like a single word with a emphasize on the a,perhaps Dev A\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nI commented on this song three years ago.  I still think the Fiona Apple version is weak.  \n\r\nfrijolito_ts is right, this song was absolutely butchered at the Grammys... but what else is new.  I don't know where these artists get the idea that \"Oh, we're so awesome individually, so if you combine us, the results will be ten times as good.\"  It just sounds like one big mess.\n\r\nWho cares how kids learn about the Beatles, whether through I Am Sam or the Anthologies or their parents' record collections.  The point is that they learn.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI was wondering about the connection between this song's lyrics and the lyrics of pink floyd's echoes. Since echoes was released a year later I assume the Beatles were the ones getting borrowed from. Does anyone know the story behind this?\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nI don't think any Beatles songs should ever be covered. EVER! They're perfect how they are and when someone else even performs them the songs just lose everything in my eyes.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nFuck, I am not an angry person and this is probably the first time I've ever sworn online, but if I see one more person attributing this song to George then I am going to gouge my eyes out so I'll never see it again. \n\r\nIT. WAS. WRITTEN. BY. JOHN. LENNON. WITH. NO-ONE'S. HELP.\n\r\nDid you all get that? Do you understand it? Because next time you come on the internet pretending to know something about a song that you are, in fact, completely ignorant about, you should remember that you only make yourself look stupid and get decent human beings such as myself caught up in a rage. \n\r\nHere are some rules you should follow in the future:\n\r\n1. If you can't tell which Beatle is even singing the song, don't even bother calling yourself a fan, and certainly don't come on the internet and talk about it.\n\r\n2. If you ever think that George would write a song for John to sing, think about getting a lobotomy to fix that brain damage you're evidently suffering from. \n\r\n3. If you think you're such a big fan that you've figured out the different style of each of the Beatles and then presume to say this one is George's style, go and stick your head in an oven so you can hopefully shrink it down to size, because your judgement is being clouded by your arrogant ignorance. \n\r\nSo, if we all follow these rules like good children, everything should be all right. \n\r\nI'd just like to add that this is one of my favourite songs in the world. Also, if people are getting into the Beatles because of I Am Sam - well, that's cool. Spread the love however you can!\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\ni think this song is really just about meditation, which the beatles were really big into at the time.  Meditiation is a process which involves clearing the mind completely so as to achieve inner peice.  And each verse is about how all his thoughts bounce around inside is head, before he just sends them out across the universe.  Then in the last verse he says \"It calls me out across the universe\" like once he's achieved his inner peice, his mind is free to travel anywhere he wants it to.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nGuru Deva, actually it is Guru Dev, is incited in the song because he was the Maharishi's teacher. He is an actual person, and they invoked him in their meditation every day. The name actually has meaning in itself. A Guru is a teacher, or spiritual leader of sorts. Dev, according to some other sites I went to, means god or heavenly one. As stated, Maharishi's actual teacher's name was Guru Dev. John Lennon appeared to take the liberty adding the \"a\"on the end. Jai means, and there are several meanings I have for this, \"I give hope, or thanks to\", this I was told, but some sites say it means, \"victory\" or \"salutations\". Om, is probaby the easiest part to explain. Om is believed to be the natural vibration of the universe. Hence, when many meditate, they make the \"ooohhhmmmm\" sound. They are trying to bring in that vibration of the universe. \n\r\nSo all together it means, \"I give thanks (victory) (salutation) to Guru Dev (or heavenly teacher), om\".\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\ni love this song so much. it is my favourite beatles song. it was written by john after he had a fight with his wife (at the time), cynthia powell in 1967. the couple had a fight and john walked off to his bedroom where the words came flowing out to him. the next day john turned his lyrics into the song and added his mantra - \"jai gura deva om\" - as the bridge.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nthe liner notes to \"let it be... naked\"  which is the original mix versions of everything on let it be (which are a lot less processed than the version of let it be that was released originally):\n\r\n\"All songs composed by Lennon/McCartney... except for 'For You Blue' and 'I Me Mine' composed by Harrison\"\n\r\n......  i heard somewhere that although EVERYTHING (more or less) composed by either McCarney or Lennon is listed as \"Composed by Lennon/McCarney\", even though there were lots of songs that were really only one or the other.....\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nWhen I first heard my mom had cancer this song was playing in the waiting room of the doctors office. It's kind of bitter sweet for me to hear it. I come close to crying every time.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nI LOVE this song. I haven't read all the comments, but have you ever wondered when it was written?\n\r\nMy fellow Lennon fan said that JOHN LENNON, not George Harrison, wrote this song one night when he can't sleep. So, he got downstairs and wrote it in his kitchen! I mean, that was so COOL! John wrote the best Beatles' song at that night! I think Across The Universe is one of the greatest songs ever written. But you know what? I kind of don't like the music. I love love love the words, but I don't know about the music. Sure, it's beautiful. But I'm not crazy about it. JOHN SANG WONDERFULLY! I mean, I like his vocals more than McCartney's even though most of you loves McCartney's vocals. I just love it because it's so unique! An it's like he's got a pain in his throat! Liam Gallagher copies his voice, right? Oh well, did I mention that I love this song? If not, then let me tell you that THIS SONG ROCKS!\n\r\nJOHN LENNON FOREVER!!!!\n\r\npJ ;p\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nBut did you ever wonder*? I'm sorry! I'm just learning to speak English!\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nAlthough John definitly wrote this song, it reminds me a lot of George's solo album My Sweet Lord. I wonder which one influenced the other. \r\nI love this song's optimism. It says to me, \"there is nothing bad enough to give up for.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nThis song is really cool! I heard the edition on \"Let it Be...Naked\" has JL singing it normally and not into a tin can. Great Song, The beatles ROCK!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nYes, I love the Let it Be... Naked version a LOT... I tend to like just a voice and a guitar, and it sounds more like acoustic and just John on that one... the other version altered his voice because John was very much into that.  He didn't like his voice for some reason (I can't figure that one out!!) but George Martin says somewhere in the anthology he never understood it either!\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThis is one of Lennon's greatest pieces of lyrical art. It's beautiful. Being one who's done acid before, the lyrics fit in with the effects of the drugs very well. Acid is not a bad thing, it's very beautiful. This song is beautiful...\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI label In My Life as The Greatest song ever because it's simple yet extremely brilliant.\n\r\nI label this song as The Most Beautiful Song Ever.\n\r\nI have to say, I like the demo of this song more than the original. And there's also this version when there are chirping of birds and flapping of wings on the first part. My wild guess is that the flapping of wings inspired the video of Free  As A Bird. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nThis is a great Beatles song.  Pink Floyd was influenced by this song, as, if you listen to their song Echoes (off of the album Meddle), it has the line \"inviting and inciting me to rise.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\n'Nothingâ\u0080\u0099s gonna change my world'\n\r\nThis is my mantra.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nI think the correct lyrics are \"Sounds of laughter shades of LIFE (or love, the two sound so similar and I like Love better but I hear an \"I\" sound) are ringing\r\nThrough my open EARS inciting and inviting me\"\n\r\nHa, some of you guys are funny when you admitted what you thought \"Jai Guru Deva Om\" was: \"I would rue the day\", \"like a rude daze\", you people are silly. I knew this wasn't English when I first heard the song as a young teenager.\n\r\nI think it's cool how someone said this was the end of Lennon's \"jesus complex\".\n\r\nI was on a drug trip once (salvia) and I would think of something to say and before I said it, I would see it as a seed in the dirt and when I spoke it it grew into a plant. It was freaky but I liked the idea of harvesting...ideas\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\non my copy of the song at the beggining you hear ringo(i think its ringo)saying 'your right richie' sorry if someones already said this(i cant be botheredto read all the posts). I was just wondering if there was a story to it or something.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI don't understand why everybody spent their time arguing about who wrote it, why they wrote it, and about the single line \"Jai guru deva om.\"  Why not discuss the rest of the meaning?\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nI think this could be my favorite Beatles song ever. It is hard to say that though, very hard.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nMy favourite Beatles song. It was the first song of theirs i'd ever heard. It's such a beautiful song and to me reflects on the wonders, -simple and monumental alike- of the world we live in, which we tend to take for granted day to day.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nThe Fiona Apple version of this song is really good too...\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nA John Lennon song, Not one of is best (But well done whilst his head was f****d up). Lost a great man GO ON PAUL DEFEND HIS CHARACTURE, I'm sure now he'd defend yours !\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nOne of my favourite beatles songs. Fiona does it just as good also. Both completely the same lyrics, just a completely different way.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nI've spended the whole morning reading your posting about a stupid magazine and if this song was written by Goerge or John. Who cares, let's talk  about the meaning of the song instead.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nTo me this song is John expressing the fact that everything he sees in this world is beautiful, and all the beauty possesses and carresses his mind moving him to come up with beautiful lyrics to share with the rest of the world in beautiful song\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nThis is, by far, one of the best songs ever written. It's gorgeous.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nthat was so amazing, nn10000.\n\r\nso . . . . wow.\n\r\nespecially your last paragraph. \n\r\nmore than amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nThis song has a quality that reminds you of life. Even though, it may have these chants on and off. The actual lyric could just as well be a prayer or an offering. Uber Brilliant meditative quality to the lyrics here. \r\n  From Hindu mythology,( They slither while they pass, .....of joy are drifting through......)\r\n You are looking at a snake. Any snake is capable of re-generating. It will often eat it's own skin. (There is a symbolic and ever present bow to CHANGES.) And then morph into something completely new. Renewing and extinguishing itself. Another perhaps interesting and somewhat unknown perspective would be the fact that snakes are often known to be as protectors. In ancient Hindu Kingdoms a snake would often be around a noble king (like a pet). When the king would rest the snake would also look after him/her.  \r\n OK, that might be a bit of a stretch. But if you consider, that the Beatles (even half) would be the Kings of modern popular music then it kinda applies to a certain extent. And I also, think that nn1000 above here did summarize everything else there might have been to this song. This song is a Zen symphony and a spiritual mantra to tune into, all rolled into one. Enjoy. BTW, each artist's interpretation also has these moody shifts. That's my ten cents. Take care and meditate....\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\ni have every reason to believe, nn10000, that the reason the comment after yours was posted 3 days later, is that that is how long it took to read it. how long did it take to write it? i think its really amazing though, that you wrote all that, and i think its really insightful (your comment and Across the Universe)\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nThis song was on the soundtrack to Pleasentville, sung by Fiona Apple. The orignal is really good. I grew up listening to The Beatles in my hometown of Liverpool and all their songs are part of my upbringing, including this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\ni absolutely love this song, and i grew up on the beatles, too, they are a family obsession, to say the least. and this song is a great one, like every other.\r\nnothings gonna change my world\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nMy favourite version of this song comes from the \"Rarities\" album with the birds and acoustic guitar. Simple and perfect.\n\r\nIt is also interesting what John had to say about this song in his final interview with Playboy when he talked about most of the Beatles songs. The interviewer threw out the song titles and John, as was his fashion, said what he thought on that particular song and things going on at that time.\n\r\nPLAYBOY: \"Across the Universe.\"\r\nLENNON: The Beatles didn't make a good record of \"Across the Universe.\" I think subconsciously we -- I thought Paul subconsciously tried to destroy my great songs. We would play experimental games with my great pieces, like \"Strawberry Fields,\" which I always felt was badly recorded. It worked, but it wasn't what it could have been. I allowed it, though. We would spend hours doing little, detailed cleaning up on Paul's songs, but when it came to mine -- especially a great song like \"Strawberry Fields\" or \"Across the Universe\" -- somehow an atmosphere of looseness and experimentation would come up.\r\nPLAYBOY: Sabotage?\r\nLENNON: Subconscious sabotage. I was hurt too . . . Paul will deny it, because he has a bland face and will say this doesn't exist. This is the kind of thing I'm talking about where I was always seeing what was going on and began to think, Well, maybe I'm paranoid. But it is not paranoid. It is the absolute truth. The same thing happened to \"Across the Universe.\" The song was never done properly. The words stand, luckily.\n\n\r\nThe interview still stands the test of time today and is well worth purchasing the book if you can find it.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nI think it's about how drugs won't make you a different person.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nsong on meditation as i understand it. you cannot control anything outside of yourself. all you can control is the self. to change the world outside youself, you must change your inner world first. the difficult part of meditaion is the clearing of your mind. everyday thoughts keep popping in. when you are finally able clear your mind, the universe opens up for you. john may have been tring to express this.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nIt could be about the day John died. A musical premonition of the day you die and the eternal journey your soul embarks upon. The hundreds of thousands of radio and tv transmittions about his death flowing through the airwaves surrounding his soul, out into space and traveling through the galaxy and across the universe, just as Beatle songs are still traveling across the cosmos by radio waves. Pools of sorrow waves of joy could be his life passing before his eyes. The images of broken light beckoned him to cross over to the eternal life. Looking down upon Earth, he saw the vigils, the gatherings, the tributes-the outpouring of limitless undying love. Nothing was going to change his world, so he went on to a new one. \r\nSure it's a stretch, but there are somethings in this world that are beyond comprehension.\r\nAnd to those negative people out there-yes, I know John wrote this in late '67-early '68 and was killed in 1980.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nThis is one of my favorite Beatles songs. John sounds so cosmic....so laid back like he's just laying down imagining things, streaming all his words together. He is at peace with himself and nobody is going to change that. He wrote this while in India where he finally had a chance to slow down and find inner peace with himself.\n\r\nThere's a few versions of this song floating around. It was originally released in a charity LP release with all kinds of animal sounds and was sped up a tad. Its next incarnation was on the Let It Be LP which was probably one of the better arrangements that Phil Spector produced on that album. And an alternate take can be found on Anthology 2...which is the one I personally like best.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nwhen i hear the words \"nothins' gonna change my world, nothins' gonna change my world.\" it makes me feel despair. kind of like the wars and stuff that go on, nothings gonna change that.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nThe popular version has John's recorded vocals slowed down intentionally to get that \"trippy spacy\" feeling.  Just a great great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nanother thing, phrases such as \"images of broken light\" or \"shades of earth\" that are inviting and inciting...those are things that make perfect sense while on drugs, but to people who arent on the same 'plain' as you, they woudlnt make much sense. im guessing that this song made perfect sense to john while he was on his trip, if that were the case, and which is why it doesnt make much sense to anyone else\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\ni find this song really comforting, especially the line \"nothings gonna change my world,\" like all the bad stuff can't get rid of the good stuff. love and light and laughter and the goodness at the core of humanity still exist in the face of all the darkness and fear.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nOk, it's not about drugs. But nn10000 I'm gonna have to disagree with you on a few points. \r\nFor starters, there's no way you can conflate \"pools of sorrow\" and \"waves of joy\" into one lump understanding that both are about emotion overwhelming him. I think that the \"pools of sorrow\" are possessing and the \"waves of joy\" are caressing, and it's a fundamental shift in thinking. The pool is stagnant, its permanent, but it's also weak. The wave is quick, powerful, but fleeting. The wave simply cannot possess, because it isn't around long enough to. Rather, when a wave buffets against the rocks, it caresses and then quickly steps aside.\n\r\nJohn is possessed with sorrow in this movie, and the waves of joy that come against his shore quickly retreat, unable to solve the main problem of futility that runs throughout the song.\n\r\nI don't think 'nothing's gonna change my world' is an arrogant statement of defiance against the world. But I don't think it's a statement of oneness with the universe either. He repeats it too much, he needs convincing - and John knows what the 'refrain' of a song really means. It means it 'refrains' the music and meaning from going any further, it's a restriction and boundary that he's meeting up against.\n\r\n\"Nothing's gonna change my world\" means that despite his best efforts, he can't change his course. He's not in control of the situation. He's trying to catch words in paper cups but they just slip by. He's being called \"on and on across the universe\" because it's so far away.\n\r\nWhat I love the most about this song is the sense of space. The notes on \"rain into a paper cup\" or \"wind inside a letter box\" sound like twinkling stars, just two notes alternating between them create this wonderful vacuum for John to play in. Even the opening glissando - from low to high - it's conveying space. And when we're dragged across this space, across the universe, with no end in sight and unable to control it, it's frustrating as hell.\n\r\n- \"restless wind inside a letter box\" is an anxiety about being trapped\r\n- \"sounds of laughter, shades of earth\" are suggestions of beauty that ring through him, but they *aren't the things themselves.* He can never get laughter, or earth, just mere hints of those wonderful things. They call him on, and he goes on an endless search for them.\n\r\nIn the end, \"nothing's gonna change my world\" is a resignation that no matter what we do in our own world, we can't fix the problem. We can't reconcile.\n\r\nI think this song is darker and more desperate than people have been giving it credit for.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nThis song is written by John Lennon and about the actual process of writing.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nthe Jai guru deva om part is actually meant to mean,\r\ngracious heavenly guru.and the omm is the vibration of the univerese.as we al know and love and are polluting.but,the song was written when they were in Rakikikesh and that's where they got the line Jai guru deva om.but it is very heavenly and melodic song.i strongly recommend listening to it when falling in love.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nObviously about some hallucinogin.  If you've ever done drugs you would know... pools of sorrow, waves of joy are drifting through my opened mind?  That's what happens on shrooms (not sure about LSD but I think it's about the same)...\n\r\nJust look at every lyric definitely points towards how one feels on hallucinogins... amazing how it is so well captured and described... oh and for whoever said the song is like a drug, it only really takes you off if you have seriously experienced the trip because you can't imagin the enormity of these words and the universe until it is experienced.\n\r\nTake shrooms and you will understand this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nJohn wrote this song during his long rounding (series of yoga asanas, pranayama, transcendental meditation) in India. Without this context it makes no sense.\n\r\nIt desribes the process of meditating: \"words are flowing out like endless rain...\" John is at once thinking, and detached from his thoughts. He is evidently deeply into his program, as he describes his experiences of feeling his thoughts and impulses eminating from him, outward, across the universe.\n\r\nThis is a very accurate description of the experience of practicing TM, and hearing sounds coming in through a window, and feeling the inner bliss bubbling up: \"Sounds of laughter, shades of earth, are ringing through my open mind, inciting and inviting me. Limitless undying love which shines around me like a million suns, it calls me on and on across the universe.\"\n\r\nEven with the eyes closed, \"images of broken light\" come in through the eyelids, and the light is also part of his inner light, emanating and reaching everywhere in creation (an important part of Maharishi's vedic teaching, how everything affects everything else in creation, which is one of the important principles of TM and vedic knowledge).\n\r\nJai Guru Deva is the traditional sanscrit reminder of thanks to the guru of the holy tradition. In this case, it refers to Maharishi's master, Swami Brahmananda Saraswati, generally called \"Guru Dev.\" Maharishi ends virtually every talk with \"Jai Guru Dev,\" loosely translated as \"thanks to the master,\" more precisely translated as \"All glory to the master of the gods.\"\n\r\n\"Om\" is a traditional vedic mantra used by recluses and not householders, and therefore was not used or recommended by Maharishi duringthis course, but usually gets asked about it by course participants. My guess is the John thought it fit the end of the sanscrit phrase as a tag on like \"oh.\" Also, he was always a bit of a bad boy even around Maharishi, and probably fancied using it in spite of Maharishi's advice.\n\r\nThe \"nothing's gonna change my world\" line has to do with the Wildlife Foundation, to whom John donated the song, and seems to be a declaration wanting to protect the natural environment. But it may also be a description of the eternal nature of John's inner life. My guess is that after rounding for a few weeks he was identifying with his inner immortal consciousness.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\ni love the richness of the verses and their meanings, but...\n\r\n\"nothing's gonna change my world\".\n\r\nthis, to me, changes the song so much. my experience with transcendental meditation is using it as a tool to, indeed, change your world. to better yourself. to open yourself up to more possibilities.\n\r\ni can't really reconcile the dichotomy...\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nhands down my favorite song of all time. interesting how john lennon wasn't happy with the way ti turned out, i think it's brilliant and perfect as it is. \n\r\nin my opinion (and sorry to all of you with super long posts on the topic) the meaning of this song isn't as deep as some people try to make it. i think john lennon was trying to emphasis the sort of cosmic feel of the song and not some deep philisophical meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nthis song is a moment of clarity. sunshine though the trees, re birth, a wave of happiness, the realisation of nature taking care of you, realisation of God. When Lennon wrote this he was a mess. His sanity was fragile due to excessive LSD use, his marrige was collapsing, the beatles lacked direction as Epstein had just died, and he had just met yoko who turned his world upside down. This song is a moment of peace amid the turmoil. Ultimately Lennon was a peacefull soul. But what has produced this moment of peace? Is it the teachings of eastern religion that Lennon was experimenting with at the time? Is it simply an artificial drug rush. My feelings are that for a song to be this great, Lennon must have had a spiritual realisation, an awareness that all would be ok so long as he dosnt let anything change his world\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nFirstly although the words Guru Diva are the name of Maharishis teacher. Gurus names are often aspects of God almost without exception. This phrase is not so much a homage to Maharishi teacher, its more of praise to God. Remember that Guru also translates as God / Brahma and not just any human teacher. Your thinking of humans, think more broader of the deeper spiritual message. During his immersion in eastern thought his lyrics would have reflected the deeper spiritual sentiment and not just ode to the teachers teacher. \r\nAll said here is a better translation. \n\r\nJai Guru Deva OM \r\nVictory to God Devine OM \n\r\nOm cannot easily be translated as a single English word. It is used as the most sacred word in Indian thought. It represents the birth growth and death of the Cosmos. It is also the Vibration / sound of the Cosmos literaly.If you could step outside the Universe and listen to it that is what you would hear. The Yogis hear this in deep meditation. One way of thinking of OM would be Alpha-Omega. From OM all the English words like Omniscience, Omnipresence are derived from. Deva means Divine , this is where the English word divinity comes from.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nThis is my ultimate happy song. It's that state of euphoria in which pretty much nothing can get you down. Any unfortunate event just \"slip[s] away across the universe.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\ni like this song better than IMAGINE it is more mysterious than \"i love peace and i hate war\" statements and it has a much stronger message of love. you hear it and you just can imagine yourself effected by a kind gesture from someone ACROSS THE UNIVERSE and it had its way all the wat back to you. a feeling of humanity that overwhelms you\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nmaybe the magazine meant george wrote the music for the song...which is possible?\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\ngreat song\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nI'm not sure if anyone has already said this, but I'm pretty certain that this song is about tripping. It's hard to imagine if you haven't done it, but this song captures the feeling to a T. \r\nWaves of emotion, images of broken light, etc. etc. No one can deny the influence of psychedelics on the Beatles (Thank you Bob Dylan), but this actually is a song about tripping, whose subject IS tripping.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\ni luv this song.its from accross the universe,my fav movie.i also luv the beatles\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nThis song is actually about the divorce John Lennon was going through with Cynthia. He began writing it while on the phone with her and she was just babbling on and on...kinda like \"Words are flowing out like endless rain...\"\r\nYea, true story. Its basically about how the divorce wasn't going to affect him because he was so in love with yoko. \n\r\nSuch an amazing song.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nWhether this song was a influenced by LSD or meditation towards spiritual enlightenment, It's incredible.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nThis is pretty obviously about an acid trip. Just thought I'd throw that out there :]\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nF.Y.I : Jai Guru Davi means: praise your spiritual teacher.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nI have alwats seen this as a love song purely.\r\nI think the first part up to the first chorus perfectly describe me when I am in love: Way too much talking, and extremes in emotions. The chorus \"nothing's gonna change my world\" is just that wanting to hold onto that great feeling\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nMy favorite Beatle/Lennon song.  The song itself meanders throughout the soul while listening!  I know that Lennon liked wordplay.  I don't think he had a specific subject in mind other than very nice and beautiful word play.  The song speaks to each listener on his/her own terms allowing us to interpret it as we please to help us through the night.  Crazy huh!\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\ni think that many people blow the meaning of this song way out of proportion. An artist like John Lennon, while I love every song he has written, enjoys creating very complex metaphors to describe very simple idealisms, as shown in Strawberry Fields Forever and Lucy in the Sky With Diamonds. I feel that this song is the embodiment of his feelings for music. The lyrics explain how his lyrics are the only cure for his spectrum of feelings. The metaphor \"Across the Universe\" simply means that his words and expressions are endless and they they can never really be conveyed directly through words or lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\n\"Om\" also refers to the noise of the vibrations that the universe makes. You know, like sound waves, but much, much smaller.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nLennon wrote this one night in bed. He couldn't sleep so he went to the other room to write. He wanted to write a trippy poetic song filled with imagery, so he twisted what he saw around him into interesting lyrics.\n\n\r\nwords flowing out like endless rain- speakers\n\r\npools of sarrow, waves of joy, drifting through his mind- his thoughts\n\r\nJAI GURU DEVA OM- \"thank you god\" he learned this studying with the dali lama.\n\r\nImages of broken light which dance before me- the fan blades cut the light as they spun\n\r\nThe rest is about his love he shares with his wife.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nI love love love this song.  It's just amazing.\r\nI've even started saying jai guru deva om when I'm upset. it's calming.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nThe song is about being one with all of the universe & all of creation... the Creation itself was set in motion by the vibration of Om .. Once John Lennon is in his meditative state of mind with the help of the \"OM\" mantra... he feels this oneness with the whole universe with all it's joys & sorrows... \t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nTHis song calms me when I'm angry or sad. and it helps me think.\r\nI love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nwell i can see the picture he paints with the song's lyrics. i mean, i did my sharings of drugs, and the emotional rollercoaster can make you want to hear some purely fucking bliss and beautiful music on the come down, for all you puppets of inebriation. so look what i tripped on. what i noticed was was how he describes words, thought, emotions, and light in an awakening. sort of like an infinite suffocation to an infinite surge.  \n\r\nWords- endless rain into a paper cup\r\nThought - restless wind inside a letter box\r\nLight - a million provoking eyes \r\nEmotions - pools of sorrow, waves of joy, possessing and carressing\r\nLove\n\r\nwords and thought are infinite and overwhelming, and nothing will change this perception. its like hearing someone blabber about god on alotta drugs like an idiot, and after theyve filled ur mind with this overwhelming speech, you would either agree or not. theres not much more to be done after that. \r\njust an existence of nothing... (which is made up of words and thought). \r\nNow, theres light, and a million eyes calling you on, as if its heavenly existence is infinite. the words and thoughts are enlightening, filling you with emotions, and pools of sorrow and waves of joy are just being observed in your awakening, because your either drowning in this pool of ur f-u-c-k-i-n-g sorrow, or your ridin those fuckin WAVEs of joy. and to me, theres a balance that can be observed, because i would avoid to bring myself down or to think of myself higher than others. \r\nand the way of describing love speaks for itself in the song. and i think he was on alotta drugs when he wrote it. or on the comedown. \t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nThe very first time I remember hearing this song was on the day my sister died. I do love the song, I just think it's odd that it came into my life on that day. I still listen to it, but separate it from that memory. I think the song is mostly about happiness and love.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nThis is one of my all time favorite songs ,freaks the fuck out of you when your (*_*)\r\nJohn Lennon wrote this after his wife was \"going on and on\" about something and he said that her words floated on like an endless stream in his head. Late in the night he turned those words into a song, which is obvious in the first line\n\r\nThe thing I think is really amazing is Lennon's ability to create such an extremely catchy and beautiful song that doesn't rhyme at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nPersonally, I think this song is one of the most lyrically great songs in history. John Lennon himself did say in an interview once that it was without a doubt the deepest song he wrote.\n\r\nHere's what i think it means\n\r\n\"Words are flowing out like endless rain into a paper cup\r\nThey slither while they pass, they slip away across the universe\"\n\r\nThink about it. a paper cup can only hold so much, and once it becomes full, it overflows. I think explains an experience John Lennon had where someone was talking to him about religion and then most, if not all of what he/she was talking about just \"slipped away\"...like he either had no use for it or there was simply too much to comprehend.\n\r\n\"Pools of sorrow, waves of joy, are drifting through my opened mind\r\nPossessing and caressing me\"\n\r\nTo me, this talks about a situation where something bad must happen or resonate (the \"pools of sorrow\") in order for something good (\"the waves of joy\") to come. It seems like a really bittersweet kind of moment that could occur, and i think thats supported by the whole \"possessing and caressing\" part. The thing i think of when it comes to possessing is the lack of freedom, or when something takes over...just an overall negative connotation. And the word caress or caressing reminds me of like love, sex, tenderness, etc.\n\r\n\"Jai guru deva om\r\nNothing's gonna change my world\" \n\r\nI believe \"Jai guru deva om\" is Sanskrit for \"Hail To The Divine Guru\" (if my wikipedia searching skills are good lol). I think this is a religious thing for John Lennon, as if he's saying \"These are my beliefs, this is my world as i know it. And I don't intend on changing it whatsoever.\"\n\r\nOverall the song to me is about how people have tried to change Lennon in his ways of thinking, and he has stood strong in what he believes. It also says about how hes been tempted a few times (The part about \"Sounds of laughter, shades of earth, are ringing through my open mind Inciting and inviting me\" stands out for me) but in the end the chorus is his main message- Nothing is going to change his world. Its pretty much a deep and meaningful song about something so simple, and thats what i think works for it.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nGood song.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nDivisionistic, that was excellent!\r\nI sang this song in 2 talent shows (1 in school and 1 in camp)and its been one of my favorite songs ever since. And all the music teachers thought mine was the best too because\r\nA. I'm an excelent singer.(Sorry for bragging!)\r\nB. All the other girls were dancing to songs like \"Single Ladies\" and \"Circus\" Those are the popular ciques! Anyway, with my 2 good friends backing me up on flute and my flute teacher backing us up on guitar it sounded beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nGreatest song ever written by the Greatest artists, The Beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nThis song is about a beautiful, wonderful, glowing, sparkling, one with yourself in the wide open universe, blissfully happy about your place in the moving spehere and the beautiful connection with everyone around you and just life is goregous, LSD acid trip. Oh, I've been there lots and lots of times and John Lennon being able to capture that experience and explain it so flowingly prefect with all that description and colorful creativity is amazing! \t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\ni say this a lot, but this song really is the most beautiful song i've ever heard.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nOne of the best Beatles songs, This song is timeless, Thank you John Lennon, I love listening to your music; I know your in heaver just sitting there watching the wheels go round and round. We lost you just when you got your second wind, I know what we lost, it would have been amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\n\"Sounds of laughter, shades of earth are ringing through my open mind\"\r\nThat's wrong..\r\nIt's \r\n\"Sounds of laughter, shades of life are ringing through my opened ears\"\r\nJust trying to help out\n\n\n", "comment_163": "\ni don`t remember the source from where i got this info and don`t know if it completely correct but i heard \r\nthe john and yoko had either a fight or were just talking and she said something and he couldn`t get it out of \r\nhis head so he wrote it down.\n\r\ni think im wrong  :(\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nThis song is about meditation for me.  The 'Jai guru deva om' is a mantra used by John for meditation, and then once in the meditative state 'nothing can change his world' - he's safe from it all.  All the images that may be bad (pools of sorrow) or good (waves of joy) are irrelevant as he's in his own world where he's happy.\n\r\nAmazing song\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nOh! I also love the way he plays the words against e/o like pools of sorrow waves of joy \n\n\r\nThis song i could listen to over and over again ~sexy~\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\ni love john lennons mind. its like technicolour. streaming with so many thoughts, he just has to get them out, and they come out so beautifully.\r\nlike introverted but doesnt even care. nothings gunna change my world - rejecting the real wworld\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\ni love john lennons mind. its like technicolour. streaming with so many thoughts, he just has to get them out, and they come out so beautifully.\r\nlike introverted but doesnt even care. nothings gunna change my world - rejecting the real wworld\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nThe Beatles wrote songs when they were high,\r\nmost of the time their songs don't mean anything.\r\nSo don't get all pissed when people say they don't \r\nthink it means anything because what if it doesn't?\r\nThen you will look like an idiot, and you might feel\r\na little stupid, so think about what you decide to \r\ncomment on a Beatles song.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nthis song was written by john after a heated fight with his wife. the line \"Words are flowing out like endless rain into a paper cup\" attests to this. the line popped into his head in the night and he immediately ran downstairs and began to compose this song. john later commented that he had not intended for it to be such a spiritual song.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nI believe John wrote this song after he met Yoko Ono while he was still married to Cynthia. The lyrics \"words are pouring out like endless rain into a paper cup...\" could have referred to he and Cynthia, and how their love no longer had effect on him after meeting Yoko. \"Limitless undying love...calls me on and on\" would refer to the love that John felt he could have if he left Cynthia for Yoko. \"Jai Guru Deva Om\" is a mantra, which John would have chanted while meditating. This lyric is followed by \"nothing's gonna change my world.\" Perhaps John used meditation in an attempt to clear his mind of the confusion of his love for Yoko and for Cynthia. However, he is always reminded that no matter how much he meditates, it won't change the fact that he is still stuck. The song tells the story of John's inner conflict about his dying love for Cynthia and his new found love for Yoko Ono, and his feelings of being stuck in his life and relationship. Or so I think :)\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nlsd\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nI can always learn more useful words through these comments of beatles.Thank you guys.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nLennon: I was lying next to my first wife in bed and I was thinking. It started off as a negative song and she must have been going on and on about something. Sheâ\u0080\u0099d gone to sleep and I kept hearing, â\u0080\u0098Words are flowing out like endless streamsâ\u0080¦â\u0080\u0099 I was a bit irritated and I went downstairs and it turned into a sort of cosmic song rather than, â\u0080\u0098Why are you always mouthing off at me?â\u0080\u0099â\u0080¦ The words are purely inspirational and were given to me - except for maybe one or two where I had to resolve a line or something like that. I donâ\u0080\u0099t own it; it came through like that.\n\r\nLennon: Itâ\u0080\u0099s one of the best lyrics Iâ\u0080\u0099ve written. In fact, it could be the best. Itâ\u0080\u0099s good poetry, or whatever you call it, without chewing it. See, the ones I like are the ones that stand as words, without melody. They donâ\u0080\u0099t have to have any melody, like a poem, you can read them.\n\r\nLennon: This was one of my favorite songs, but itâ\u0080\u0099s been issued in so many forms that itâ\u0080\u0099s missed it as a record. I gave it at first to the World Wildlife Fund, but they didnâ\u0080\u0099t do much with it, and then we put it on the Let It Be album.\n\r\nEmerick: â\u0080\u009cAcross the Universeâ\u0080\u009d was probably the gentlest, sweetest John Lennon song Iâ\u0080\u0099d heard to date, and it took me very much by surprise.\n\r\nEmerick: We recorded that vocal over and over again because John was unhappy with the job he was doing, despite the fact that we, and the entire group, were effusive in our praise.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nI think were on LSD when writing this song. No?\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nBefore reading this, try to listen the song once.. \nI wish my mood was bad, because when people are happy the creat and wonder less. Oh well.\n\nWords are flowing out like \nEndless rain into a paper cup\nThey slither wildly as they slip away across the universe.\nPools of sorrow waves of joy\nAre drifting through my opened mind\nPossessing and caressing me.\n\n\nSo I think it's maybe about things we all say that flow out like endless rain into a paper cup - we never stop talking about meanless things . I mean, we all say so many things with no meanings as an endless rain into a paper cup - into people's mind. \n\"Pools of sorrow waves of joy\nAre drifting through my opened mind\"\nObviously, it's a metaphor. The \"pools of sorrow\" and the \"waves of joy\" are \"drifting through my opened mind\"- So many thoughts of good and bad are in the singer, teller, writer 's mind that are \"possessing and caressing\" him, makes him stronger, with a thoughtfull life which he's managing, he becomes powerful by the power of his opened mind.\n\nJai Guru Deva. Om\nNothing's gonna change my world\nNothing's gonna change my world\nNothing's gonna change my world\nNothing's gonna change my world\n\nSo the \"Jai Guru Deva. Om\" is a mantra intended to lull the mind into a higher consciousness. The words are in Sanskrit, and they mean \"I give thanks to Guru Dev,\" who was the teacher of The Maharishi. The \"Um\" at the end is the drawn out \"oooohm\" used in meditation to relate to the natural vibration of the universe.\nBut what can possibly change his world?\nI think it refers the meanless words which people say all the time.\n(It reminds me a bit of bullying). Nothing can change MY world-\ndoes that mean he has the 'perfect' world? maybe. But the fact it is being so perfect, no one can change it, because he is in his world, fantasy maybe, and he is strong enough to struggle the thoughts and words.\n\n\nImages of broken light, which \nDance before me like a million eyes,\nThey call me on and on across the universe.\nThoughts meander like a \nRestless wind inside a letter box\nThey tumble blindly as they make their way across the universe.\n\nSo this one is a little bit more complicated because the images of broken lights which dance before the writer like a million eyes... I'm not sure what does that mean. Maybe the milion eyes are the audience who admired The Beatles, and those broken lights... Maybe he was just taking drugs... I don't know, again, if I were sadder, I would probably know what he refers to...\n\n\n\n\nJai Guru Deva. Om\nNothing's gonna change my world\nNothing's gonna change my world\nNothing's gonna change my world\nNothing's gonna change my world\n\nThis time I believe (except it is the chorus)it is being an emphasis.\n\nSounds of laughter, shades of life\nAre ringing through my opened ears \nInciting and inviting me.\nLimitless undying love, which\nShines around me like a million suns,\nIt calls me on and on across the universe\n\nLaugher? Drugs?\nso the \"shades of life\nAre ringing through my opened ears\" sentence must be a metaphor.\nThe shades of life... Hm.. Maybe the shades of life are the memories that went behind the writer from all of his living life's experiences...\nIn this song there are lots of contrasts - like something which is described as hearing but you can only see it.\nSo when something is incinting and inviting the writer..\nI think he tried to tell us how the world is confusing, bad is mixed with good, up is down and down is up, everything is messed up, but when you REALLY realize that, nothing can change your world because it is being too predictable as you try to make it more colorful, interesting, so when something is so easy to guess, no news can change it, but you. \n\n\nJai Guru Deva.\nJai Guru Deva.\nJai Guru Deva.\nNothing's gonna change my world\nNothing's gonna change my world\nNothing's gonna change my world\nNothing's gonna change my world\n\nEnd. :) \nAnd come on people, this is not THAT hard. Everyone can change his own world, but no one can really change yours. \nAnd it is so easy to be guessed, that even a thirteen year-old girl with no experience can figure it out ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\n'nothing's gonna change my world.'  i feel like that's what it sounds like to completely give up on any hope or positivity.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nIs just about a trip... John has tried to make it seemed most mistic song.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nCan somebody tell me what means \"Jai Guru Deva Om\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nJai Guru Deva Om means Praise the Heavenly Teacher and Om is the sound of the universal vibration often used commonly in transcendental meditation\n\nthis song is genius, he is comparing his mind and soul to the universe and basically telling us that they are the same thing. We are the Universe, we are One with everything, nothings gonna change my world because everything is set in its right place, and that is what God is, every aspect of life and creation, we are God, we are the Universe\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nHeard this song last night for the umpteenth time and now believe that what he means by \"Nothing's gonna change my word\" is that \"nothing\" represents the quiet calm of meditation and having experienced that, his whole world has changed.  The song makes more sense to me this way.  It's not saying my world is staying the same because there's nothing that can change it, but instead \"nothing\" as a state of being (consciousness is empty) has been felt and that is life changing.  Either way, a brilliant lyric.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nA rare out-take of John Lennon, that is recorded in his hotel's bathroom on a portable cassette, and over- dubbed, clean off by technicians, and put on the album. No, it is pure studio,and it always made my think of the girl I knew on the night I had her in some guys sofa, or I just kissed, I\"m sure it was good.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nA rare out-take of John Lennon, that is recorded in his hotel's bathroom on a portable cassette, and over- dubbed, clean off by technicians, and put on the album. No, it is pure studio,and it always made my think of the girl I knew on the night I had her in some guys sofa, or I just kissed, I\"m sure it was good.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nMusic is art.  If one looks at, hears, or otherwise senses a piece of art done by someone else, then the artist no longer owns it.  Thus, the 'meaning' of a piece of art depends upon WHO views (or creates it) and WHEN that person views it or creates it.  Even the creator may have DIFFERENT ideas about what the art feels like to him or her at different times.  I have seen artists, when asked what a piece of art \"means\", answer, \"I don't remember\" or \"I don't know\".  So as you read these thoughts about \"Across the Universe\" and its 'meaning', I'd encourage you to hear the song, including whatever you like (the vocal, the lyrics, the musicians, the arrangement) and decide FOR YOU at the time you hear it what it FEELS like.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nI know! I saw that too!! how evil is that..and it claims to be a beatles fan mag. this song owns me...*sigh* the way john sings it is so beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nThis song is one of the best I've ever heard since I was born. The experience in hearing this, only can be compared to the \"inner-uterin\" season or something higher than that. It's even higher than to do drugs and it doesn't destroy you (as drugs do). ps.: I've never done drugs, but I can imagine how it is to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nUmmm..I believe George WROTE the song..but yes JOHN sang it..\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nmost beatles covers (covers OF beatles songs, not the songs they cover) are just horrific.  fiona apple's version of \"across the universe\" was bleh.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nHow can you say that, glamorous*sunrise? Fiona Apple sings gorgeousely and the song fits her so well. It fits in among her songs as if it was her own. She adapted a song which held great meaning, and glorified it. The song is so alike her own, I would think she and its author work on parallel lines of thought. She sung it masterfully and, I think, her version is smoother than the origional. She slowed it down, which, I think, is more fitting. She sings it somberly, which fits the lyrics better. The guitar playing is better, too, I think. It's played more... flowy, as if the notes are slurred. In the origional, the notes are sometimes plucked, it seems. I don't feel that effect matches the lyrics. I also like Fiona's ending better. They are both good songs, and I don't see how you could feel Fiona's version was simply bleh.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\n\"jai gura deva om\"=\"Jah is good either, oooh\"\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\ni really do think this song may be about a drug experience, more than likely an acid trip. im not sure who all out there has tried acid, but those who have probably can understand what i mean by saying this song is definitely written in a trip-influenced manner, meaning, at least in my oppinion, and having experiences with psychedelics, that this is the type of song someone could write very easily, and could flow out of someone if they were under the influence. It seems weird that someone would jsut write these words out of knowwhere. maybe it is just meditation, but the point of meditation is that your supposed to supress your feelings and not focus on them, because while meditating the aim is to be completely relaxed and carefree, which is hard if your worried about all kinds of things, which in this song it seems that john is feeling all kinds of different emotions at once, which is remarkably similar to how you feel while on lsd. you feel surges of strong emotions,incredibly happy for no reason, or incredibly sad, to me it seems as if john is feeling so many emotions and that all these emotions are confusing to him, and are in a way taking him on a spiritual journey, hence across the universe. i think the line 'nothing's gonna change my wolrd' means that even though he feels all these emotions strongly, they aren't making any sense, or that nothing is getting resolved. often while tripping you think very hard about problems or ideas you have, but more often then not you don't actually work them out or they dont make sense. it ssems like john is saying that he feels all of these things intensely, but that he still hasnt figured anything out in terms of what all these feelings mean\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\ni love this song\r\nits amazing :]\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nI'm not gonna lie this song reminds me of a trip I had, hahaha great times! Hey you never know what was going on when this was written!\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nThe words to this song are so beautiful. I wish he wasn't invoking some Guru with a mantra in it - but that won't stop me from loving this song. (in 3rd grade my fellow Beatles-fan friends and I used to wonder: \"what does Jackaroo Dayva mean?\" \r\nI thought it was a woman's name - kinda like Jackie Onassis crossed with Doris Day... we loved the song - but were not too well-versed in Hinduistic mantras at the time.\r\nWe won't know until later down the road whether Lennon made it into heaven.\r\nI actually met a Presbyterian Pastor from Liverpool who grew up with John Lennon until 6th grade who confirmed much of what is written here in this web article: \n\nblackchristiannews.com/news/2009/09/… \n\r\nPeace out - Jesus is Lord forever. Let it be known across the universe.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nThis is the time of the Alignment in the Galaxy: the Dark Rift and Humanity and  then I thought of this song... this song is not about \"2012\" but the fact that John Lennon the angry young man could write such lyrics got my attention...\nWords were coming through to John, thoughts not of his own mind were coming from the Universe....even Lennon described something like \"channelling\"\nwas going on for him. \n\n-------\n Not to compare, just a kick at the can here, to the tune of Across the Universe:\n\nSomething brought me back to John, today when all my time was gone;\nIt writes itself he said ot this, as I wondered how it is.... that John was such an angry one and yet he wrote such peace-filled stuff?\n\nChannelled through the Universe - this explains his awesome verse.\nand now we are about to cross into the Age of  Aquarius.\n\nSomethings going to change our world\nSomethings got to change our world\nLennon may yet help us all, \n a dark soul bathed in light.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nI agree weez, this song is awesome.  I was given a \"The Beatles\" magazine for Christmas and was upset because this song was listed as a George Harrison song, but I clearly knew it wasn't.  Stupid magazine.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nhaha i have no fuckin clue what he's talking about, but it's a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nI'd like to know too. Somehow, I don't think it means anything.\t\t\t\t\n\t\t\t\t\n\n"}