{"comment_0": "\nI'm quite surprised on how little some people know about Tool. The CD this song comes from was entirely dedicated to the late great Bill Hicks (R.I.P.), and some of the lyrics, this song specifically, are actually plays off rants that Bill Hicks had. Maynard (and Tool) and Bill Hicks were close friends. Bill Hicks had mentioned numerous times about how much he hates L.A. and just wants to flush the whole thing down, so people better start learning to swim or they will drowned in their own filth. And the \"see you down in Arizona Bay\" part, Bill Hicks had also said that too. So all in all, this song is pretty straight forward if you know of the legendary Bill Hicks.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think this song follows a similar theme to that of many Tool songs - enlightenment. It seems it can be taken at face value and that the 'narrator' is just sick of everything that is wrong with L.A. Taken to a deeper level of meaning, however, and I think the song is about hope for better rather than worse. Here is what the song translates to, in my opinion of course;\n\r\nMost of the song is written from a negative perspective and in such a way that it really resonates with the disillusionment in many people. I think many people would derive a sick pleasure from watching the world collapse and to feel that their own misery is near an end, but i think the narrator sums it up perfectly when he says 'Don't just call me pessimist, try and read between the lines. I can't imagine why you wouldn't welcome any change, my friend.' To me this part implies that, although the narrator is speaking from a negative point of view, the desire is a positive one. \n\r\nAs with many of Tool's songs, Keenan suggests that by simply living in the here and now and by accepting each moment as the only thing that truly exists, one can be freed from the bonds of human existence and from a position in time (Parabola, perhaps?)in order to feel truly connected with the 'oneness' of consciousness. For most people, enlightenment is an esoteric concept rather than a freedom achievable with anyone who so strongly desires it. For those who do become enlightened, a large proportion had to suffer greatly in order for the transmutation to commence. Some became enlightened due to the death of a loved one, or through severe illness. In my case, I experienced a sudden flash of enlightened awareness after years of suffering from severe depression and anxiety. I am still practicing in order to get to that peaceful place again.\n\r\nTo me, the song seems to imply that the narrator hopes for a cataclysmic event to wake up those whose eyes are closed to the true and beautiful nature of existence.\n\r\nCheers.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThe 'learn to swim' part is a message for all Californians because maynards praying for it to sink into the ocean...if you notice in the in-lay of Tool's cd the 3-d picture, if you move it...only California dissappears.\n\r\n\"fret for your pilot\" hes talking about a television pilot..etc\n\r\nthis song is just one big fuck you to Los Angeles, the entertainment industry, and to all the narcissistic people in california.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nHey everyone!\r\nI just gotta say, by lookin past the surface of this song, or at least by tryin too, I get a lot more out of it. It goes past bein angry at how fake and superficial people and LA are. The word AEenma is a mixture of the word Enema, which is clearing of the bowels with fluid, and the word Anima, which is, in Jungian theory, the true inner subconscious self. It seems to me that this song is about clearing away those attachments to stupid useless shit that we don't need, and getting back to nature. He makes multiple references to mom, which is probably Mother Nature. Its about getting back to our true inner selves, uncovering what's hidden in our subconcious, and clearing away all of the shit, and learning how to swim. LEARN TO SWIM,\r\nThe Full Effect\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song took maynard 6 whole mounths to write the song. Every second was well spent. Incredible meaning and sound. Genius's, all of em....\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\neveryone has their own opinion meredith, and ours is that we like tool.  we recognize the talant and identify with a lot of what their songs say.  don't diss on that.  and if tool and us are so fucking lame, what are you doing even posting that?  why waste your precious time?  this song and this band rock, and that's about all i have to say about that.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nBy the way, isn't it \"i'm praying for rain, i'm praying for tidal waves\", not \"praying for mayhem\"?  last i knew it was \"praying for rain\", which makes more sense than using the word mayhem.  rain is cleansing, rain washes things away.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nAgain fellow Tool Fans, just KISS (Keep It Simple Silly)! This song is on the '96 album AEnima, a tribute to Bill Hicks, another dead hero, who passed in '94 (no doubt the song writing began soon after the 32 y/o died). The album title requires you ignore the \"E\" (so Anima translates \"life force\" or \"soul\"). \n\r\nThen with the album's title track, spelled AEnema, you are to ignore the \"A,\" you know, to start the detoxing process. Brilliant word smithing by MJK and the band! Bill Hicks in the afterlife is loving it!The song is simply about the famous phrase \"sink or swim.\" Or, to be more L.A. like, \"detox or die!\" \n\r\nIf you... Read Between The Lines (by the lines I mean \"Learn To Swim\"), you'll see the \"sink\" parts (things we fret for, things that make us followers) and the \"swim\" parts (things to say f-you to, ways to go left when everyone else is going right). \n\r\nIf this song were written today, I'm sure Tool would have mentioned another item to fret: The Mother-F-ing Cell Phone!!! I'm a math professor at a California college who recently went to open a classroom door at which my students were waiting. As I was walking toward the door, I noticed at least 80% of them with their heads down playing with their cell phones (themselves... metaphorically... if you consider F-Book). Sadly, behind them was one of the most spectacular sunsets I'd ever seen. I'm not sure any of my 40 students even noticed \"MOM's\" work. That says a lot if you think about it. \n\r\nAnd speaking of saying a lot, a certain magazine's person of the year is \"The PROTESTOR.\" If you really want to protest something worthwhile, \"Protest The Cell.\" If for no other reason, do it for the sake of humanity. \n\r\nWe're going to reap what we sow in 20-30 years when we start realizing the long term effects of carrying cell phones with their ever-increasing (4G, 8G, 16G, ...) electropollution (EMFs) being emitted 24-7 so near our collective reproductive organs. \n\r\n\"Learn To Swim\" well enough to make it to the \"Arizona Bay.\" \n\r\nTranslations? \n\r\nGet the cells away from the bells! This goes for us ladies too.\n\r\nGot EMF-ed? Ignore the EMF, and what do you get? \n\r\nIf you limp, you a wimp! \n\r\nIf you sink, we can't link! \n\r\nDon't treat your \"TOOL\" that way and you'll make it to the Arizona Bay! \n\r\nLearn to swim!\n\r\nOh, and don't forget about the little swimmers. I'm imagining headlines in 2030: All the franks are shooting blanks! No more eggs between the legs! \n\r\nFor the sake of humanity, to hell with the cell. Learn to swim!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThe incredible urge to be rid of unpleasant old L.A. California.  Love this song as it can be applied to the majority of america in a way.  I want to watch it all go down.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nHe didn't just use LA as an example... he truly wants that city to be wiped off the face of the world... \n\r\nand MHR i dont think that you should be ashamed of Tool for taking that look... because if you would do your research ... they are From LA ... i think they have a pretty good idea of what it is like.\n\n\r\nInterpretation is a Gateway into the soul, when you hear anothers interpretation it gives you just a little glimpse at who they truly are.... \n\n\r\n- unScathed\n\n\n\n", "comment_10": "\nThis song applies to the whole f****** world!\r\nnot just LA, not just California, the whole world is this way!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\none time i walked to the store and these guys started giving me shit about being white and i lived in oakland, and they didnt touch me or anything i just went into the 7-11 and got some gummi worms. then when they came out they tried to sell me some illegal drugs and i said, \"nu uh, no way that stuff makes you stupid\" and they looked at me and said \"you callin me stupid\" and i said \"maybe\" and they said \"so we're stupid just cuz we're black huh cracker\" and i said \"..................yeah\" but im not racist, they were just stupid and they beat me up.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nAND THIS FUCKING SITE BETTER NOT ERASE MY MESSAGES LIKE THEY DO WITH EVERY OTHER ONE I POST. I HATE THE DAMN CIA, ALWAYS MESSING WITH ME CUZ THEY KNOW IM RIGHT\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI agree,but no Tool song is \"simple\" for everyone one meaning,there's 5 more that go with it,Maynard is a genius and I love him to death...\n\r\nP.S. FUCK ALL YOU GUN-TOATING HIP GANGSTER WANNABES!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nAlright,if I hear anymore of you bitch at eachother on a Tool message board,I'll kill you.Tool is about beauty and creativity,not calling eachother gay or racists\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song is a musical version of a Bill Hicks comedy routine about California being destroyed because it sucks.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nwhy are your comments so big the lyrics are so god damn obvious.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nhear it in relation to Bill Hicks' Arizona Bay.. makes sense (note: Hicks and Maynard were friends and - I think, thought I'm not sure - at one point, roommates)\n\r\nand to the dude from California getting upset over how 'tool generalized against us! not everybody's superficial', people make worse generalizations that \"you're superficial\" about others all the time, don't worry about it and learn to appreciate something even if you believe it should be insulting to you (no grammatical errors there, I said what I meant).\n\r\nand nobody argue over the internet please, it's a bit sad to watch \n\r\npeace to all\n\r\nps: Tool = fucking awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nLet me just clarify something a few people have asked so far: the song derives some of its inspiration from a comedy bit by the late Bill Hicks, a fairly obscure stand-up comedian and a major friend and fan of the band, who was actually paid tribute to in one of Aenima's alternate covers. The chorus, is general, directly references the bit, where Hicks commented on Los Angeles' intense heat and shallow way of life, and jokingly mentioned how great it would be if southern California would break off from the rest of the United States and sink to the bottom of the ocean. The bit is off Hicks' Arizona Bay CD, in case anyone is interested in finding it.\n\r\n\"Oh, it's gone. All the shitty TV shows are gone, all the idiots screaming in the fucking wind are dead, I love it. Leaving nothing but a cool, beautiful serenity called Arizona Bay. Haha, that's right... when LA falls in the fuckin' ocean and is flushed away, all that it will leave is Arizona Bay.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nIt's \"praying for rain\" not \"mayhem\"\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nIiiiiiii Fuckinggggggg Looooooveeeeeeeee this song!!!!! I wish this site wasn't so inactive\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI think the song is meant to make fun of all those conspiracy theorists and other nuts that say the world is gonna end. Because they keep saying it every four years and they really are full of crap (hence the lyrics i certainly hope the world will end I could sure use a break from this same old shit).\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nWell,I think this song is about being fed up with our world (in this case LA has been used) full of materialistic,self obsessed people, the shit they prioritise and how hopeless everything seems, therefore, wishing for a \"flushing\" referring to the end of all this shit by mother nature therefore warning to learn to swim when they get \"flushed\"\n\"Mom's going to fix it all soon\nMom's coming around to put it back the way it ought to be\"\nand also a wish for a genuine armageddon instead of people going on about conspiracy theories that don't make sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI think that in this song LA represents the epitome of superficial, materialistic, individualistic, greedy, self-centred, etc. Western society. So what the narrator wants to see drown is all that bad shit most of us seem to strive for.\n\nAlso, to say \"fuck L. Ron Hubbard and fuck all his clones\" in 1996, living in LA, takes alot of guts. Today most people know Scientology is BS, and alot of people also know its an evil cult that does awful things to its members, but back then it was just as popular - if not more popular - with Hollywood (LA) celebrities but without the widespread awareness of how bad it is. In other words, if the English speaking world was a high school then Hollywood (LA) celebrities would be the Mean Girls type \"cool\" kids that you're supposed to suck up to, emulate, and fear. For some no-name metal band to call them out for being fake probably ruffled a few feathers. So every time I hear that line I think: if they had the guts to say that back then, in LA, then why should I be afraid to say \"fuck [current stupid fad]\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nAnima - As defined by Jung conciousness is the femine qualities in a man that make him relate with females. It is the gateway to the unconcious mind. In dreams it is represented by a female archetype figure.\n\nEnema - A procedure to flush out ones colon/rectum. Liquid is inserted in through an individuals anus producing a laxative effect - Flushing out their system.\n\nPut the two words together and you get a metaphor a cleaning of one's mind - one's conciousness. \n\nFree your mind from all the shit that the word fills it up with... focus on what is really important!\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nGreat song...\r\nAbout the apocalypse? Yes, but more specifically about California(more specifically LA) sinking into the ocean.  I think it really shows how much maynard hates a lot of that city...\r\n'fret for all the things you spend time and money on, cuz in the end they're gone'\r\n\"The only way to fix it is to flush it all away,\" and that about sums up how screwed up things are in LA, or any huge metropolis really.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThe song is just to point out that the people in LA are trivial and in need of change.  The allusions to the armageddon and flooding is to show how desperately needed it is, plus the speaker's a little pissed off.  The song is filled with verbal irony but all you need to work with is \"Don't just call me pessimist/ Try and read between the lines/ I can't imagine why you wouldn't/ Welcome any change my friend.\"\n\r\nAnd the allusion to mom is just that our moms fix everything and make it all better.  I love you mom.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nTo me:\n\r\nA dream of life, and how it should be. People ponder and worry their minds about when the world is going to end. Will it be tommorow or today? Who cares? We have lost focus of what life is. It isn't about what we own or who we are friends with. Life is about this moment, who we are inside and out, what we share with each other. I feel that Maynard paints a clear picture of how society has become a monster. We lost the whole meaning of life. We have become obssesed with money, sex, and power. Not about love for each other, the ability to understand someone else, to share the pain someone feels, to care about what we do. The morality has been lost and it's time we brought it back. I believe Maynard just used L.A. as an example. The whole U.S. is like it. The world is like it. To me the sweetest taste is the one of revival. A new and fresh start. It's like when you wash you face when you wake up. Cool and soothing. It hurts to see the insainty, to hear people hate so much. To know what people feel. And personally, seeing all this hate and lack of compassion make some want to have faith in something more powerful than us. Because that is what it would take to make things right again. Put aside our petty wants, and feel for a change. Money, drugs, meaningless sex, it is all false realities. Something to hold you in one place. Think outside the box. Think outside of your body and trust in your spirit. Allow your soul to join with others and celebrate life. But many don't see it, they just want to be laid, intoxicated, famous, and rich. Money is a object, not a person. Why love it. Why put aside you awareness to feel helpless? Why share yourself with someone you don't care about? Why waste your life worring about what people think of you, and not focus on what you think about you. Be who you are, your better that way. Seems like it does need to be washed away. He said it best, \"Don't just call me pessimist \r\nTry and read between the lines!\" \t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nCan someone tell me why Maynard is talking about meeting someone down at Arizona bay?\r\nAnd who in the hell is L. Ron Hubbard?\r\nNot like I'm complaning, just what do these things have to do with the song?\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nabout L. Ron Hubbard\r\nthat fat old fucker who is dead for a while, but his religion (\"Scientology\") is still stealing money and killing people\r\nthe headquarters of the scientology religion are based in Los Angeles, and i think that many people who believe in Scientology, live in L.A\n\r\nthat also explains a part of Maynards hate to L.A\n\r\na anti-scientology site  (tool-based) --> fuckhubbard.cjb.net/\r\n(if you think that's too much text for you to read, just scroll down and you will see lots of anti-scientology links)\n\r\nso ---> FUCK THAT HUBBARD BITCH AND HIS GREEDY PSYCHOPATIC LYING FUCKIN CLONES !!!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI personally think it's MJK's Anti-Tribute to the fakeness in the world which L.A. seems to spawn.  Most of the things he mentions are things that no one really needs, ya know?  \"Stupid shit, silly shit\".  It's hard to give a full opinion on something MJK writes anyway.  I mean, maybe he just wrote it as some sort of joke that's meant to sound like it means something deep but isn't.  Listen to Die Eier von Satan FFS!  You hear it and you're like \"Wow he must be totally ripping someone/something apart in this song!  It sounds so dark and scary!\" then you read the translation and it's a recipe for hash cookies!  I mean, I'm the first to say we all need to 'open the third eye' but sometimes it's not needed.  Anywho, I'm way off subject now and half that's probably wrong...  I'm sure he just hates the fakeness of L.A. as we all do.  If you hate L.A.'s fakeness, gimme a \"hell yeah!\"!!!!  lol, peace\n\r\n-The Prynce\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ndoes anyone know if maynard has an email address?\n\n\n", "comment_32": "\nThis song absolutely drew me into Tool's magnetic personality, so to speak. This song is brilliant, even though I spent hours pondering over it, I still find new meanings in it every day.\n\r\nTo me, this song means that Maynard, or whomever is the narrator in Aenima, is fed up with life, fed up with things in life. To me, I always think about suicide. When I hear this song, I sort of conclude that Maynard sort of implies that he wants the world to kill itself, not him kill himself. He wants the world to end, for all the disgusting narcisistic people and \"idols\" such as television, media, and many other things people, and he hates. \"Learn to swim\" caught my attention, and it always helps me out. Learn to swim. I think his referance to water was that of a purifying sort, as the water would flush all of the evil out of this world.\n\r\nMaynard, to me, almost seems to laugh at all the rediculous actions and things that go on in the world. \"Silly shit/Stupid shit\". I can totally relate. Everything in this song. Please, if anyone has insight, e-mail me... I love this song. plopabductiondoo@go.com\n\r\nLearn to swim :)\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThanks unScaythed, saved me some time; MHR, how can you be ashamed of someone for expressing their opinions?  If you want to attack capitalism, don't waste time and space on a song meanings site.  That out of the way, yeah, this is an excelent song, Tool rocks.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nTHE BEST.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nTool kicks ass!!!!  And if you don't like them, who gives a fuck, you don't got to let everyone know your shitty opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis is one of the best LA-hating songs there is. Another is 'Headless' by Dog Fashion Disco. am I the only DFD fan cos everyone I ask seems oblivious as to who they are.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nYou people are over analyzing this song so much. My theory is that the band is tired of LA and all the trivial/superficial bullshit in that city and they want to see it go down to stop. I feel the band is talking about the big earthquake that people predict will one day hit California (LA). The lines Moms gonna fix it all soon...The only way to fix it is to flush it all away....and Learn to swim/ See you down in Arizona Bay....clearly back up that thats what they are talking about. Moms (mother nature)gonna fix it all soon meaning there will be a big quake to flush all the bullshit away. Learn to swim...(because Cali will fall away into the ocean)/See you down in Arizona Bay...after the big one hits, Arizona will be the western most state with nice new beach front property.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nTOOL FUCKIN ROCK. Its great to see a band that actually is talented, isnt over amrketed and actually puts effort into everyone of there songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nAENEMA IS THE BEST ALBUM EVER.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThe world has become a rat race.  Maynard's saying that Mother Nature needs to and will restore it all to normal.  Given time, anything in nature can reheal itself, look at Yellowstone.  LA is a really seedy area now.....he's saying its going to be cleaned....in a natural way, by an earthquake. It does not have to be a quake, any change will do....just something needs to fix this problem.\n\r\nAnd the lyrics are wrong, its fret for your lawsuit then hairpiece...i'm surprised all you TOOL fanatics didn't catch that :P\n\n\n", "comment_41": "\nmeridith, you fucking suck, go play in the traffic and do us all a favour. Obviously you don't know what real music is, and i bet britney spears is your idea of a good time. Oh, i love this song..and i camped out for 6 hours to get my tickets for tool on the 22nd of april...YAY!!\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nLol Meredith... just what I'd expect from an 11 year old.  You're not even old enough to purchase the cds, let alone comment on the music.  Even if it was true, what's wrong with Tool hating the world?  If you knew anything about Tool, you'd know it's not a one-person band.  Obviously you have no clue, since you refer to Tool as \"he.\"  \n\r\nI laugh at your opinion in music, Meredith, and disregard it with the same attitude as I would disregard the opinion of any idiot that listens to the music you do.  Thanks for making me laugh, even if but for a brief moment.    \t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nYou guys pretty much summed up what this song is about.  I was wondering if anyone read the article in the newpaper about a piece of one the Hawiian island may fall off in the near future.  If this happened it is a big enough chunk that it would cause a tsunami.  This stunami would reach from Australia to North and South America.  L.A. would be in its path and the wave would be almost at full height when it hit.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nooooooh man i wish that would happen. i hate this planet\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nMHR and Meredith seem like a good couple, they both have no brains whatsoever.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\ni think this is about , well obviously california eventaully falling into the ocean. but its also about how all the people in LA are too materialistic and worry about too many senseless things and are completely oblivious to any of the real problems. manyard wants to see it go away because he's just sick of the bullshit thats there. \t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nthis was the most interesting song I'd heard in a long while. Still is. He's talking about how much bullshit there is in LA (and presumably the rest of the world). He concentrates on the theory of California detaching itself from america cause it sucks shit and hed like to see it slip away, by tidal wave and by the people themselves (watch you flush it all away). on the inside cover behind the cd there is shown a hologram of california. When he speaks of Arizona bay, there really is no arizona bay obviously, but there would be if california he sings learn to swim hes sayin you californians better be ready cause if california sinks away you'll all be floating. which kinda sucks cause I was plannin to move to CA. lol. ah well, great song\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nthemosquitogod and josh (Which is a gay name by the way) thack im not even black and im offended by those racist comments.\n\r\nPLUS HOW THE HELL DOES THIS HAVE ANY RELATION TO THIS SONG GO BITCH SOMEWHERE ELSE!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nholy shit, bojangles, you are saying you are offended by the racist comments but then you go off and offend gays.  that is not cool.  it is all offensive.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nYou stop ur bitchin to angelgarbage \t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nFor everyone who thinks TOOL is just flaming on LA or California, I believe you are wrong.  The ocean is predicted to go over the united states very soon (10 to 20 years)  and it is believed to start in california.  California will be consumed by water. So on and so forth.  Moving over the United States.  Im sure someone can find something online about this prediction.  Go look for yourself and find out.  That of course is the best way.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nArgh! I'm so damn tired of all these people complaining about their lives. \"I wish this would happen to the whole damn world,\" they say. Or they criticize capitalism, or our government/economic system. The fact of the matter is, the government is paying your welfare, and our capitalist free market system lets your daddy own his run-down gun shop. Because it's always the ones who get screwed over by our system that complain about it. You don't see Bill Gates complaning, do you? And before you say that he had luck or something, that may be true, but he didn't have much else. He was a college dropout, remember? Would you rather try your luck in France, where they're about to elect a president who is nearly fascist?\n\r\nAs for you wishing the world was over, we aren't missing much if you leave anyways then. \n\r\nAs for the song, it is a nice tongue-in-cheek look at Los Angeles, even if it is a  little bit over the top. Southern California is not that bad, and I love the weather.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nOh yeah, and I think it's closer to 10 thousand or 10 million years than 10 or 20 years. We are not in any great danger of being swallowed by the sea, my friend.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nSorry for the 3 posts in a row, but the line \"learn to swim\" means a lot more if you interpret it as, \"Learn how to live a more complete life,\" rather than learn how to maintain a floating position in the water. \t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI did not mean my last comment as a racist remark, but as a huge problem in the black community.  Many of them smoke weed and a little too much of it.  I am not racist in any way.  A lot of other people smoke too much weed too, like my brother (I am white by the way) and his friends and a lot of the kids in my neighborhood.  I don't have a problem with black people, I have a problem with people using too many drugs, and yes weed is a drug.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nyo life hazard\r\nhe means this by arizona bay.  Right now there is the whole Bay Area in Cali.  But if Cali got flooded then this bay would extend to Arizona ...... Hence Arizona Bay\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI forgot to mention that they get the reference to Arizona bay from comedian Bill Hicks.  Maynard's really into this guy....And Hicks has an album called Arizona Bay.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThis song is just talking about how everybody frets over the small shit in life and that people are way too fake\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nTherymz is right. The inspiration for this song comes from the comedian Bill Hicks who, on his \"Arizona Bay\" CD, described how he wished California would sink into the ocean. After all the \"fevered egos\" were drowned and eaten by sharks, all that would be left would be Arizona Bay. Whatever other meanings you want to extract from the song, you can. I don't think Tool are about literal interpretations so much as opening your mind to new possibilities and thinking for yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nYou're right about the Bill Hicks reference, Hicks spent a year or so in LA writing what were supposed to be a TV show, but everywhere he was met by people who A. did not understand him or B. were offended by him. \n\r\nFed up with the empty and shallow mass-culture, he was trying to make an alternative to the mainstream entertainment and itâ\u0080\u0099s lack of any deeper meaning. And I guess the fact that spineless whores like Bob Saget are given airtime, while Hicks were labeled too controversial at the time, angered him. It's pretty much the same thing in music; spineless manufactured assholes like N'sync and Britney get attention and airtime, whereas music that requires something from the listener or doesn't mention \"baby\" or \"love\" twenty times per song gets less attention. If weâ\u0080\u0099re too afraid to speak our opinion or offend and alienate possible customers, then what is the purpose of creating art? TOOL, like Hicks; is something for those of us who want something more than just empty clichÃ©s and streamlined art. Iâ\u0080\u0099d like to see Nâ\u0080\u0099sync address their own emotional problems inherited from paternal abuse (H). Guess not, more songs about cheesy teenage-love then. \n\r\nMaynard is among many artists who enjoy Hicksâ\u0080\u0099 material, others include Kyuss and Radiohead. I once read that Maynard cited a Hicks album as one of his five tourbus choices. Hicks is pictured inside the Ã\u0086nema cover and provides the â\u0080\u009creal fuckinâ\u0080\u0099 high on drugsâ\u0080\u009d. On some versions of Ã\u0086nema, California is missing from the US map. \n\r\nAnd finally; I might be wrong, the distance from Norway to California is rather big both in ways of thinking and in space. Oh, and stay away from drugs, theyâ\u0080\u0099re bad for you. \n\n\n", "comment_61": "\nIF ANYONE GETS OFFENDED BY WHAT I SAID OR BY WHAT ANYONE SAYS THEN THIS SONG IS FOR YOU. YOU SIT AND GET UPSET OVER SOME STUPID LITTLE COMMENT THAT ISNT GOING TO AFFECT YOU IN ANY WAY, YOU FRET FOR YOUR PEACE AND HARMONY WHEN CHAOS IS THE ONLY THING THATS GOING TO MAKE ALL THE VIOLENCE AND IGNORANCE IN THE WORLD STOP. BESIDES I SAID IM NOT RACIST, BUT YOU TRY GROWING UP THE ONLY WHITE PERSON IN AN ALL BLACK NEIGHBORHOOD, YOU DONT THINK I GET OFFENDED WHEN BLACK PEOPLE CALL ME HONKEY OR WHITE BOY? NO I DONT CUZ ITS JUST THEIR IGNORANCE. YOU SURE DIDNT GET OFFENDED WHEN I SAID THEY WERE GIVING ME SHIT ABOUT BEING WHITE DID YOU? THE WORD RACISM SHOULDNT EVEN EXIST ANYMORE BECAUSE THE TRUE ORIGINAL DEFINITION OF RACISM MEANS HATING EVERY RACE, NOT JUST ONE RACE OR ANY RACE THATS NOT YOURS, DISCRIMINATION IS MORE THE WORD HERE. YOU PEOPLE ALL NEED TO GO STUDY THE MOVIE FIGHT CLUB OVER AND OVER SO THAT WAY YOULL SEE HOW PATHETIC YOUR LITTLE ANGER FITS OVER HATE IS. LET GO\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nUGH\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nThis song is brilliant, it has exactly my opinion. LA sucks, it is a zoo filled with roaches. all filled with hate and anger. You need to realize that this bald man grew up there. He had to deal with the shit that goes down there. In the song when he says fret for your tv ..... ect. He is saying go ahead and worry about the stupid little shit. your all dead anyway, you cant help it. But he is also saying that you need to stop worrying and live life up cause you only got so much time. But mostly it is about how the people in LA and mostly everyone in american are so caught up in there stupid shit that there not thinking about the future and what can happen. So they should learn to swim, because when LA sinks into the sea, thats all there gonna need. thats my opinion anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nMerkaBa you are not smart . There is a fault line that runs through LA and around that area that is going to break away. If you look at the back of the jewel box in the cd you will see a holograph on it. Thats what is going to happen. not the world covering with water. although that is supposed to happen in like 2 million years. and all the racist shit that popped up on this, stop fucking crying. If someone offers you illegal drugs then just say no dont call them stupid. You brought that on yourself my friend.... an oh yea I SMOKE WEED! SO IM A FUCKING RETARD!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nSure weed's okay when your just a kid, it's fun for awhile.  Hell I was a full blown pot-head for a year, not to mention the other shit I did.  But someday you're gonna' have to grow up and realize that you can't live your life to its full potential if your on drugs(yes weed is a drug and it is addictive, my brother is proof).  Just look at our parents generation.  The hippies used a lot of drugs and just look at America now.  Hopefully someday this world won't be so messed up that kids need to use drugs to deal with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nblah, its a great song. i like it live. tool's live stuff is incredible. i love the live stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nTouching on a couple things. First of all I really wish people would stop mentioning Capitalism and so on in their meanings of Tool songs. Tool is not a political band in the least, if you are looking for politics, Rage Against The Machine is a good bet to find some, or System Of A Down.\n\r\nAnyway, I do agree, this is not about Los Angeles, but more about the entire United States, I dont think the water is meant in a sense that the USA is going to be overtaken by water, since I and everyone is sure if there ever was a threat, there would be some device put in place to stop it.\n\r\nRemember the name of the song is Aenima, which looks alot like 'enema'. Enema of course being the process of cleaning the insides of a person.\n\r\nI beleive this song is basically a look at the world, and how people, everyone not just LA, are always caught up in superficial things like looks(hairpeice, figure), posessions(car), and obviously fame and fortune(pilot, contract).\n\r\nI think the song in the most basic sense simply deals with the world needing an enema(or a cleaning out).\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nif you've got a Bill Hicks CD called \"arizona bay\" you'll understand this song more\r\nbasically bill was making a joke about how much he hates L.A and how there should be gobbled up by the ocean, ... Ahhhhh! Arizona Bay\r\nMaynard agrees\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\ngo to a chat room you silly fucks.  or write your own songs so you can stop being so fucking dependant on the words of others.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nHey ab0ve, I hate to burst your bubble, but you can't stop nature, dude.  As I wrote in an earlier post, a piece of a Hawiian Island is breaking off and may fall into the sea and create a huge tidal wave that would reach a lot of coast lines.  The only thing that the government or scientist can do is watch and hope that, if it happens, they will see it in time to evacuate as many people out of the coast as possible.\n\r\nYo mosquito, a little paranoid aren't you.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\n{MoFo} knew the truth too, see and they got him, now im the only one left to defend you brainless sheep. \n\n\n", "comment_72": "\nThis song is obviously talking about the phonies and sellouts and Hollywood. I also happens to talk about the end of the world. Maynard is fed up with the phonies and hopes the end of the world comes. Simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\none of my fav. tool songs..how can you not like it?  or them for that matter...they rawk :)\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nYeah.. there's always a deeper meaning somewhere... the main point it's trying to come across is easy to decode.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI whole heartedly agree, Maynard is a genius.  My interpretation of this song is obviously the end of the world.  It's all about how civilization of the world is completely fucking up the world spiritually, and physically.  Clearly, most of these lyrics and quips are taken directly from Revelation in the bible. Some are also by a man named Hal Lyndsey who is a doomsayer and has many books which originated in the early 70's (The Late Great Planet Earth).  Most of the revlations of doomsayers are that a piece of California will split around the San Andreas fault and eventually drift off into the Pacific Ocean and possibly sink.  Sending all of the people of the work into disbelief.  When Manyard talks about Mom's Going to fix it all soon, he means Mother Earth, or mother nature.  Mother Nature always wins in the end. When He says \"Fuck........\" when all of this shit like Armageddon comes around, actress, material possessions and mainly money doesn't mean shit when your running from the end of the world, because there is onle one judge in the very end.  Mother nature.  This is quite possibly one of the greatest songs lyrically in the world, and I really mean that.  \t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nmy personal favorite tool song has a lot of energy \r\nmaynard is a musical jesus\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nEverytime i read someone writing that I can't help myself from saying SCREW YOU!  Of course I don't really mean it ,I've even posted messages like that myself, but I feel that it has to be said.  People are entitled to their own opinions and statements, you can choose to ignore it or react to it.  Maybe the world would be a better place without hate(I hesitate to use that word because it's so strong), or maybe without hate we would all be a bunch of mindless slaves.  I myself choose to be a pacifist and I don't really ever get angry or annoyed, life is just too hard to have room for those feelings.  But the real question is, what would the world be like without it?\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nfantastic brilliant song about everything u guys have said\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nÃ\u0086Ã\u0086Ã\u0086Ã\u0086Ã\u0086Ã\u0086 you people must learn to make that symbol....instead of putting AE...its Ã\u0086nima! you loser-heads!\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nBut how do you do it?! :confused:\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nThis song is based on a comedy bit by bill hicks, \"die you lizards scum\". Bill rants on how shitty it is to be in L.A and how it would be better for everyone if it just drowned, and all that would be left would be the nice and quiet Arizona bay\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\ni've always liked the song and i just now read and understood the lyrics .  he makes a good point...great song\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI'd agree with all of that, about everything being messed up, too many posers etc, So he wishes for the end of the world.\n\r\nBut another part I noticed was all the \"Fret for your ...\" Bits. I think that shows that people have just missed the bigger picture, and care about little petty details that aren't nessacary. And don't care about how the world is going.\n\r\nOne other thing it may be about, is the fact he highlights the end of the world and the armageddon so frequently, it might just be a piss-take.\n\r\nWhen I went to New York last October, there were people with billboards on their chests everywhere Preaching how the world will end. Obvisouly demons and fire won't just suddenly rise up any time soon and swallow us all. But these people are dedicated to bitching and moaning about how bad things are in the world, and how it'll die.\n\r\nMaynard could be laughing at these people, saying \"well I hope the ground does open up and take you. That'll shut you up.\"\n\r\nI got that mainly from\r\n\"Some say the end is near. \r\nSome say we'll see armageddon soon. \r\nI certainly hope we will cuz \r\nI sure could use a vacation from this \n\r\nSilly shit, stupid shit...\"\n\r\nJust my opinion ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nSomeone asked for Maynard's email - it's maynard@toolband.com. There's also justin, danny, adam@toolband.com\n\r\nHarry, you make it by holding ALT and then typing it 0198. Ã\u0086Ã\u0086Ã\u0086Ã\u0086. At least on my computer anyway. Now, onto my interpretation!\n\r\nIn my opinion, it's about LA. He refers to it as \" A Bullshit three ring circus sideshow of Freaks\". He tells the people to pack grab their perfect figures, lattes, hairpieces, lawsuits, prozac, pilot, contracts, and cars, which the elite (entertainment industry) of California seem to always have, learn to swim and fall into the ocean with the city. He lived in LA for sometime so he was sure to encounter these barbie and kens.\n\r\nHe wants California to fall into the ocean thus making a bay in Arizona. Maynard lives in Arizona and he'll see them there. I'm not sure about how that relates with Bill Hicks though. The references to Mom are saying that she's the one who will fix it all, things will even itself out and the city of fakeness will be destroyed. \n\r\nHe goes on to tell the Scientologists, fake actresses, fake gangsters, junkies, retro people to fuck themselves and fall into the ocean, these are the peope that made him hate LA. \n\r\nThe best line to this song is\r\n\"Time to bring it down again \r\nDon't just call me pessimist \r\nTry and read between the lines\"\n\r\nThis could be saying that you'll never fully get rid of those people he cursed out, because they'll remerge in some other city.\n\r\nAll in all a very great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nDamn it, I messed something up. I said \"He tells the people to grab their perfect figures, lattes, hairpieces, lawsuits, prozac, pilot, contracts, and cars\". He's saying that they'll worry about those in a catastrophe rather than what's more important in life (family, etc). Sorry about that.\n\r\nHe also refers to LA as a \"festering neon distraction\" which has obvious meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nevery LA/California band has to have the obligitory \"California\" or \"Hollywood\" song, usually on the sophomore album...i've lived in cali all my life...i totally understand everything he is trying to say in this song...\n\r\nfavorite line \"fuck all you gun toting hip gangster wannabes\"   \t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nthis is my FAVORITE tool song.  by far one of the best.\r\nsara\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nMaynard is by far the most clever song writer I have ever came upon.  \n\r\n\"Here in this hopeless fucking hole we call LA \r\nThe only way to fix it is to flush it all away. \r\nAny fucking time. Any fucking day. \r\nLearn to swim, I'll see you down in Arizona bay.\"\n\r\nTake this for what it actually says and you'll see what I mean.  California is slowly pulling away from the US of A and is supposedly going to either fall away into the ocean.  \"The only way to fix it is so flush it all away.\"  Each day it inches farther away.  \"Any fucking time.  Any fucking day.\"  People will need to get away from Cali, \"Learn to swim\".  And what will be the shores of the West coast?  \"Arizona Bay\".  I just find it interesting the way he thought that out.  I don't think many people have.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nOkay, awesome song. The song is maybe also about the end of the world, how we have no power against that. SO instead of fearing it, accepting it, accept that someday the world will end and this acceptation is potrayed by the \"learn to swim\". We should ne worry about the end of the world, but about the present, about living.\n\r\nGreat metaphor!\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nNot many people know that Maynard has a house in Arizona.    when he speaks of Arizona bay, he truely believes it will be, someday, beach front property.   that is what is mean't by Arizona Bay.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nThis song is about the distant future of California when it supposibly is supposed to break off of the US.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nI saw this advert at my local swimming pool and it said \"Learn to swim\" and I smiled and thought of this song. I'm thinking of half-inching it! ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\ntool rules !!! i wana see them play this song live! :D im going to there concert in houston texas. yay\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nfirst I would like to start by saying tool is the best band today.well this song is good because after a day of putting up with alot of dickheads and hip gangster wannabes I can come home and here maynard paying those sort of out.  P.S rap sucks\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nawsum aong. tool is a truly talented band\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nAwesome song..\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nThere have been several speculations that california will be the first to go under if there is a major tidal wave.  The song is talking about how great it would be if this really hapened and there was no more hollywood and all those fake bastards that live there!!!  Maynard is mentioning the benefits of armageddon and how it may actually be a good thing......Maybe if everything were started all over again there wouldn't be things that suck like fake douche-bags in hollywood.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nTool will burn...they are illuminati scum and hopefully will all die in the War between satan and the saints...along with all the rest of you bastards that believe in Maynards horseshit\n\r\nNCCM\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nhey what's the art on the actual cd for aenima about? what's it meant to say or represent??\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nIt's a tribute to the late, great Bill Hicks(check out his material), with whomI happen to agree on the subject of L.A. sinking... Wouldn't that be great?\n\r\nNCCMLOA: ...There is no Satan, there are no Saints, you cannot puncuate, and I doubt any true Tool fans follow Maynard as religiously as you imply, as one of their main messages seems to be that people should think for themselves more often. Also, we should keep in mind that they probably at least partially just fucking with us the majority of the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nAlot of these interpratations are correct but Maynard said himself the lines \"Learn to swim\" are telling us to all get back in the gene pool. Learning to swim is a way of saying to evolve past the things that the normal way of humanity is. If you havent realised that Maynard dwells on evolution you dont listen to enough Tool (listen to 46&2 its about evolution)\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nhey shokkur what i mean was the art or symbols on the cd as in the star and the letters that go around the circle around the star; A-S-T-A-R-O-T-H. i was wondering what that was about.\r\nthx anyways dude, does anyone else out there have an answer?\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nsince maynard has already said that its based on bill hicks' idea of california going to hell, and since its pretty obvious what the song is about if you just read the lyrics, i dont quite understand why there are people here saying that its not about that, that its about the rest of the world and the apocalypse. and everyone, i have serious doubts that in any of our lifetimes, we're gonna see a flood across the united states that will kill us all, let alone in the next 10-20 years. thats just me though. anyway, this is a really awesome song, and if any of you havnt seen this band in concert, then you should definetly check em out sometime.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\ni agree wholeheartedly with th ewhle thing that maynard is saying about hollywood, he hates fakes and people in the entertainment industry.  But isnt he in the industry too_l? oh well!\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nI simply just want to state that i think aenema is by far the best album ive ever had the pleasure to hear.When i listen to it i am amazed at the musical genious of maynard and tool itself.\r\nI can honestly say i will never stop being a wholehearted tool fan.Best of luck to the band and please keep releasing more of your great music for all of us to hear.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nThis song is about the fakeness of Hollywood and LA, and it is about just getting rid of all the social deadwood with the \"BIG ONE\" that will supposedly split the San Andreas fault, but I think you guys missed the part at the almost end of the song -- \"Don't just call me a pessimist/ Try and read between the lines\" I think this means that because (obviously) all the fake people and people concerned with shit that is really meaningless don't all live in California (Like the RHCP song Californication says, \"everyone has been there and I don't mean on vacation\") but rather it's a state of mind that we all must get away from. Learn To Swim.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nNCCMLOA, rofl - I doubt you've ever actually listened to any Tool music.\n\r\nThe most Satanist they get is when they sing about how to make cupcakes in German.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nI think AEnima is really about the choice of abortion. If you watch the video, you'll see a big fat guy in a suit with little hands. This seems to me that it's about a grown person  who makes child like descisions. Then you can aslo see some sort of fetus thing that metal box which symbolizes to me the womb. Then at the end of the video he throws around the \"womb\". Also when he says the only way to fix it is to flush it all away, i think that is a reference to an abortion. I think this song is really about the society today and the way people act, about the insewcure actresses and all the stupid fucks who compose our society, the only way out is before you are born to be aborted. I think the song is the point of view of the fetus saying he wants to die before he sees this shit, also when Maynard say mom's gonna fix it all soon. That's waht I think\n\n\n", "comment_109": "\ni think that alot of people like most of you stupid fucks look to damn deap for the meaning its right on the surface you dumb mutherfuckers maynard is a fucking genius i admit but fuck  it cant be deap in every song fuck anybody who thinks otherwise ohh yahl that shit about california IS THE DUMBIST SHIT I HAVE EVER HEARD OF\n\n\n", "comment_110": "\ni personally do not think this song has to do with the sinking of california into the ocean but the washing away of all the coroption in california, cleansing the earth of its dissease\n\n\n", "comment_111": "\nI do believe this song is about the world ending. Focising on LA first. I feel that because that is where he feels most of the bullshit is... He knows we need a change and start from the beginning, \"Moms gonna fix it all soon\" Mother nature will bring it all back to the way it should be.. When you watch the video you see Mother nature throwing the box, and destroying the world! I dont blame him for this song, this is a fucked up world we live in!!\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nWe all should know that the song is based off of Bill Hick's rant. Getting rid of LA, there's really no deep meaning to this son, other than getting rid of LA through an armageddon based action. Mom does refer to Mother Nature, it's obvious, Earth Quake or Tital Wave coming and getting rid of LA. It's also apparent that Maynard seems to hold some kind of resentment toward LA.Ã\u0086nima can also be Ã\u0086nema or Enema, also known for flushing crap out of you ASS! He's comparing LA to shit that needs to be wash out of an ass. I guess we can call California the ass. The End\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nNot only does the title allude to enema, but also to anima which is the inner self (your soul) Jungian philosiphy.  So we are talking of flushing the soul of the worldly infestations.  It is also importatn to note that this track is placed towards the end of the album because it is the finality of moving forward and leaving the shit that consumes us.  The next lyrical track is Third Eye which refers to a state of higher enlightenment.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nYo corey, you have to stop being so ignorant.  This song is about every one of these posts, because the meaning of Tool's songs only go as far as the listener is willing, or able, to listen.  In other words this song can mean 10 different things to 10 different people.  So why don't you open up your eyes and mind and take it for what it's worth\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nTool is deep people...a deep art...this song is proof. AMAZING.\r\nNOTE**\r\nNot \"deap\"...deep.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nI'm not sure if anyone has mentioned this yet [i didnt take the time to read them all] but the reason Maynard hates LA so much is because Proposition 187 was held in LA and was passed which Maynard did not approve of at all. In the Salival Master cd there is a skit where supposedly Maynard calls the LAMT(?) i think and is filling out a touch tone survey about proposition 187 which [i think] prevents immigrants who come into California from having the same rights as regular citizens of the U.S. Well anyways I found this out by searching for lyrics to songs on the Salival Master. In parentheses at the bottom for the lyrics to this \"skit\" it explains the whole thing about Prop. 187 and what it's all about. BTW I may have found these lyrics at toolshed.com but I am not sure. \t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\ncome to think about it, u can get the lyrics to the \"LAMC\" (my mistake in my last submission) on this site... DUH... i have never heard the song myself. I think ill download it. it sounds very interesting. Enjoi!\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nThis song is simply about Maynard's disgust for LA and its fake-ass, shallow lifestyle (some of which is attributed to it being an American city and some because it is a media wonderland).  I've been to LA several times now, so I can definitely say I agree with Maynard wholeheartedly.  Maynard actually wrote this song after a concert in LA at L. Ron Hubbards scientology convention center in 1995.  He was so disgusted by the philosophy that came from these dispicable excuses for human beings' mouths that it sparked him to write a tribute to them and their lovely city.  If you refer to my comment in the 46 & 2 section, you can see how Aenima is the most appropriate name for this song.  The flushing away of this arrogant populous and their incredulously stated ideologies is a wish on Maynard's part...not a foreshadowing of events such as the apocalypse, etc.  And quite an appropriate wish it is.  The root of the song is getting at the evolution of thought once again.  He refers to \"mom\", short for mother-nature, several times in the song, metaphorically sweeping away the ignorance and arrogance situated in LA.  The reference to swimming (\"Learn to Swim\") is drilled into the listeners head.  It is a chant saying, you better learn to swim (learn to think and live on your own) or you will drown in a pool of sheepish conformity which will swallow you and the rest of the adultared masses festering in the neon distraction which we call American Capitalism.  He cleverly calls this body of water Arizona Bay, because when Southern Califoria is covered in water, that is exactly what it will have become. And if any of you noticed, the first thing Maynard lists to \"Fuck\" is L. Ron Hubbard and all of his clones...coincidence, I think not.  I love his reference to \"Fuck smiley glad-hands with hidden agendas\" because I believe this to be the biggest problem with American culture and human nature--the deceptive nature of man with his alterior motives.  Maynard knows that nature and all of nature's creatures, except for humans, are honest in their endevours, mainly because they have no other choice except to be that way.  We humans have the conscious choice to be faithful, pure, and true to our fellow man, yet we choose greed and betrayal to satisfy our own tawdry, selfish needs.  I believe Maynard's evolution of thought includes the selfless recognition of all men and trust that must be harnessed between them.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nguys, Maynard fits alot of different meanings into his songs so that everyone can enjoy it in their own way, it is true genius the amount of meanings you can get out of his songs, But i saw a quote from him, saying that the song is about the human race learning to swim in the pool of collective unconciousness, where we are all one, as you might see he talks about this in other songs, Eg Reflection, where he says \"And you will come to find that we are all one mind\r\nCapable of all thats imagined and conceivable\r\n\" as well as this he is also saying what all of you are saying about holiwood, where he thinks that the physical, mental and environmental polution there is pulling us further and further away from this goal to realise that we are all of one collective conciousness, and like someone else said, it is also about evolving, past the phsycal, like in forty six and 2. well thats my 2 cents\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nTo comment on adamizer's comment (up a bit).  It's not that people are dependant on the \"words of others\" in this case Maynard it's that it has come to influence us and inspire us.  Now I'm sure most of these peolpe are intelligent enough (as they listen to tool) to take everything from anywhere with a grain of salt and apply it to themselves in their terms.  Tool has helped me incredibly in writing music and in thinking. \t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nyou people make me laugh. haha, california is gonna be udner water, haha. this song is a tribute to the comedian bill hicks. this is bill hicks style of comedy, yelling shit like \"fuck you, you should all die, hitler had the right idea, kill em all, blacks whites jews, everyone\". because he is sick of everybody's  ignorance and superficial bullshit. Arizona will be the new shoreline of the u.s.? haha, Arizona Bay was the title of bill hicks' last album.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nbill hicks' best album was called arizona bay\n\n\n", "comment_123": "\nThis song is so amazing. Best song on the album. Best title track Tool made. Best Tool song. Pure greatness.\n\r\nI actually re-wrote the song a few days after 9.11.01. I got good feedback on it.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nif you look at the art on the inside of the CD case its obvious what this song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\ni know it's already been said more then once, but...\r\ni really don't think mayanrd is trying to preach...i think he's telling you what HE things, and suggesting that you then think about what he's saying...to me, this song is saying we need to forget all the dumb bulshit that's in the world...hollywood for example. what if california DOES fall into the ocean? well i wouldn't care that much. sure, i'd miss movies, but i'd live. infact, i'd be GLAD it happend. people would start to think instead of watching TV all day (myself included). also, the title, AEnema is a combination of two words really... anima, meaning the soul basicly, and emima...a type of cleansing. i think maynard is trying to say that we all need to give our minds and souls an enema...at least that's what it means to me. i'm NOT saying this is what maynard was trying to say, i'm saying that 's what it means to me, and it may infact be the oposite of what maynard meant, but i've done what tool has allways tought...i thought for myself.\r\nmaynard is not god, jesus, etc., he's just a human like us. however, he has used his mind WAY more then most people, and he's trying to get others to do the same throught music. i owuld have to say he's the best songwriter out there. and DAMN does he have a good voice. also tool's music is some of the best i've ever had the pleasure of hearing. put these 3 things together and you get, IMHO, the best band EVER. \t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\none of the best tool songs it really get rid of chemleonsismes with in one self its the crazyness\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nThis song is about the cleansing of the soul. \r\nEnema = Washing away all the shit inside you, by sticking a hose into your ass and flushing it out with water.\r\nAnima = The belief in the soul\r\nAenima = Cleansing away all the shit in your soul. \n\r\nThis is strongly connected to \"dirty\" people in for instance California. California falls into the ocean, and only those with a clean soul, will survive. When he sings \"Learn to swim.\" He's really saying \"Cleanse your soul.\" Whole song is kinda complicated. \n\r\nThat's my two cents. \t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nFor those of you who had some problems understanding what I wrote; Enema and Anima are the words that make out Aenima. \t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\n\"It's a basic philosiphy of maybe the end of the world or the end of what's going on in our world and evolving because of that, stepping up. Like we're not evolving, I think alot of people have just slowed down. Technology has gotten to the point of \"yeah, we're moving on, but we're moving on very slowly, because people are becoming very comfortable\", and the thing that I found out, most people don't like to think. And I'm one, I like to be stimulated, like to think, and like to get my mind open, and whatever can do that I'll do.\"\n\r\n-Adam Jones\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nall you jerk offs who think it's about celebrities and bullshitters. You guys are trying to hard. It simply about the fault in L.A, which is gonna fall in someday, and there will now be a bay. \"learn to swim\", simply, a sarcastic was of saying your all gonna drown, unless you can swim really well. jokinly obviously. The dude up there who said it's a comedy thing, you could be right, but i dont think it's all about that, possibly just inspired by it. And the end of the world thing. When he said Armageddon, he is just using it as a medaphor. He says ARIZONA, the last time i checked, this planet was called earth.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nArizona Bay was the title of Bill Hicks' last CD.  And Tool is one of the biggest Bill Hicks fans ever.  If you listen to his stuff on this CD, you will hear him talking about how much he hates LA (i agree).  He says he wanted to take a bunch of boyscouts to the San Andreas fault line, give them all crowbars, and have them help him pry on the fault until all of California sinks in.  Why?  Because Bill Hicks was from Houston, and anybody in Houston will tell you that LA sucks ass.  I'm not from Houston, but I still agree.  \t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nthis song probly means that maynard really hates alot of people in that city (LA) and that he could use a vacation from all the shit he takes from people but this song probly goes way deeper then that but thats my theory\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\ni agree with most things said, but i've also heard a different story. apparently the so-called \"planet x\" really does exist in the form of a brown dwarf star (star that never ignited). this star has a very strange orbit with our sun, every 3600 years, it passes very close. this time is drawing near and if it does pass us, it will completely mess up our gravitational system and kill about 90% of the people on earth. i guess tool came across this information along the line and made a song about it. they all have bunkers with food stored up and everything in case this does happen. i don't know if they really think it's going to happen, but i've heard about this from more than one place. personally i think it's all a bunch of bullshit, but i just wanted to share another view.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nIN A NUTSHELL, instead of reading all that, this song once again, ties into the AEnema factor, (to Enema your Anima, or to shed your old self and become superiour to the rest. This song is showing Maynard doing just that, to the city everyone loves, and telling its future, that California will be completely under water someday soon, starting with LA. than the destruction or our race will begin, and humans will be forced to evolve, and AEnema.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nThis song is about nothing more than Armageddon.  Many people appear to be looking way too far into a \"hidden meaning\" to this song.  Most Tool songs have several meanings (46 & 2, schism, stinkfist, etc.), but, not to burst anyone's bubble, this song is simply not as deep.  The only form of a double-meaning existing through the lyrics of this song is the fact that mjk talks about an Armegeddon via the San Andreas fault giving way (creating an Arizona Bay) as well as a comet falling from the sky (creating massive tidal waves--\"learn to swim\").  Aside from these two points of view, the intentions of this song are pretty much on the surface.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nI just figured out that when he says \"cuz I'm prayin for rain\" he's not actually talking about water but instead the whole LA drowning thing is one big metaphore in which maynord states that nothings going his way so the \"rain\" he's askin for would be the first thing that he ever really wanted\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\njust heard this song for the first time about an hour ago! what can i say?! this song is amazing!!!! if i get time ill try to analyze the whole thing for what i think its worth. untill then, may tool embrace our spirits and minds! peace, love, empathy- erik\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nultimate LA haters song......\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nI think it's about Maynards disgust for the LA scene.\n\r\nAll these drugged up cliches who couldn't survive on their own, who couldn't survive without their lattes or contracts or hairpieces or pilots... Maynard tells them to \"learn to swim\".\n\r\nThe Apocolyptic side of this song to me refers to the Hollywood perception of it. The way that instead of being the supposed God's almighty wrath of terror, the hollywood perception is that it's all special FX, and everythings big and blown up, you know: tidal waves and fault lines, etc... So Maynard's saying, if that's the case, I want to see it all crumble then, just like a movie.\n\r\nThis Apocolyptic side of the song may be linked the views of L. Ron Hubbard who is mentioned aswell... he was the founder of scientology which is basically a religion purely based on money. Go and see the movie \"Battlefield Earth\", that was based on an L. Ron Hubbard book. It just so happens that many big name actors are scientologists, it seems to be trendy. E.g: John Travolta and Tom Cruise, etc.\n\r\nAlso the title Aenema: an aenema is the flushing out of waste fluids from congested bowels. Therefore, La is the bowels or sack of shit if you like, and Maynard wishes to see the entire area flushed out... so he tells the inhabitants to \"learn to swim\". He wants the shit flooded out of the place... the shit is listed in his \"fuck such & such\" section.\n\r\nAlso, you'll notice that Arizona is below California, so \"learn to swim, I'll see you down in Arizona bay\". \t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nIts a great fuckin song but by the time he says \"learn to swim\" like the 50th time i feel like i wanna shoot myself\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\ni think the lyrics from this song symbolize maynard's irritation concerning the materialist aspects he names in this song\r\n\"Some say the end is near \r\nSome say we'll see armageddon soon \r\nI certainly hope we will cuz \r\nI sure could use a vacation from this\"\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nLONG LIVE MAYNARD JAMES kEENAN!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nWhat happens after Califonia breaks off?\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nI totally agree with ProstheticS. Actually Myanard himself said in more than one show that the song explores the psycho therapy method proposed by carl jung. U can download the live version of the song and hear it ur self. And if u read more on carl jung's work u will see the connection of the unconsious that ProstheticS talks about.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nyou ppl so gota heard this song live, i was in the Auckland concert last year and the crowd went abso-fucken-lutely wild when this song comes up...\r\nthen all you hear is 15 thousands people chanting \"fuck this fuck that....\"\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nI think this song is about catharsis--purgation, cleansing altogether, and that Maynard is using the imagery, etc. of California breaking way and getting flushed away as something of a metaphor.  Look at the title: \"Aenima.\"  It's a combination of the two homophones \"anima\"--which is a Jungian term for the soul; and \"enima,\" which is a cleansing of wastes by via pushing up the rectum.  So I guess it could be interpreted as being about the cleansing of the soul.  When he says \"fuck...\" everything, he is indeed expressing his annoyance and frustration with society's (particularly the artificiality, showbusiness society of Los Angeles) focus on the material and all of the fakeness--like The Church of Scientology (\"fuck L. Ron Hubbard and fuck all his clones\"), which ought to be called the Cult of Celebrity; the degrading of hip-hop culture (\"fuck all you gun-toting hip gangster wannabes\"), fads (\"fuck retro anything, fuck your tattoos\"), excess in drugs, etc. that often goes on in Hollywood lifestyles, as well as the fickleness (\"fuck all you junkies and fuck your short memory), the corruption and deception of folks in the business (\"fuck smiley glad-hands with hidden agendas\"), and the emotional pretentiousness of materialistic showbiz people who have all these screwed-up problems and run around crying about it (\"fuck these dysfucntional, insecure actresses\").  I don't think this song is necessarily about the end of the world--though it might be, and to many as this post shows, it very well is.  But I personally interpret it as being about the cleansing of all the bullshit in society, and in ourselves, and the \"world ending\" analogies, along with the animosity towards the \"millions of dipshits\" and \"bullshit three-ring circus sideshow of freaks\", are Maynard's clever way of using metaphor\n\r\nBut that's just my two cents.  I could be wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nAMEN... maynard is god.. he knows exactly whats up.. and i agree.. we should flush LA away and they should all learn to swim or DIE!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nI am very pissed off right now, and I know exactly what Maynard's saying simply here. He's so sick of how cheap the world's been made by humanity that he hopes the world is swept with a huge flood, re-making Earth, the way \"Mama\" (Mother Nature) knows it ought to be. And if you don't want to die, you'd better change your attitude, \"learn to swim\", so you won't be swept away into cheap obscurity.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nThe first time I heard Californication by Chili Peppers this song came to mind. I wonder if Anthony Kiedis snuck into MJK's house and stole some lyrics? HMMM...\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nanybody seen Taxi Driver lately?\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nThis song is about how fucked and material the world is, and maynard is just sick of all the materialistic crap people go on with.\r\n\"Fret for your figure and, Fret for your latte and Fret for your lawsuit and Fret for your hairpiece and Fret for your prozac and Fret for your pilot and Fret for your contract and Fret for your car \"\r\nThis shows how people are scared of losing these material things such as jobs, cars, and just plain having their hair messed up. It shows that people think they need all these things to be happy.\r\nFuck L Ron Hubbard and \r\nFuck all his clones \r\nFuck all those gun-toting \r\nHip gangster wannabes \r\nLearn to swim\r\nthese verses show that maynard thinks everyone should just get over these materialistic ideals and actually live their lives. By learn to swim i think maynard is trying to convey the message of individuality, break away from the crowds, dont be a sheep.\n\n\r\nCuz I'm praying for rain \r\nAnd I'm praying for tidal waves \r\nI wanna see the ground give way \r\nI wanna watch it all go down \r\nMom please flush it all away \r\nI wanna watch it go right in and down \r\nI wanna watch it go right in \r\nWatch you flush it all away \n\r\nThis verse i think means he wishes everything would just disappear and start afresh so as these ideals of material posessions are eliminated and people learn how to be happy without them.\n\r\nThese are just my views on the meaning of this song, if u dont agree with them and u've read through all this im sorry, but yeah.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI always saw this song as a way to protest how much things in the music world, and in the real world have slipped away from the point of exsistance. It makes a lot of sense if you REALLY listen to it. People could practically study Enema for years trying to figure out what every part of the song means...either way, it's deep.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nThis song is about the movement of the tectonic plates. In theory, some time in the future there will be a time when california, which sits on a huge fault line, will be completely submerged in water (momma's gonna fix it all soon{mother nature}). Maynard is saying he can't wait for this to happen because the scum of the universe lives in LA anyways.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nIf you listen to the Ã\u0083â\u0080 nema on The String Tribute To Tool Album it sounds like some sort of life process, creation - destruction. (Earth being created and destroyed)\n\r\nIf you have the string album, you will notice that this is very evident. Eg. at 5:15 there is a very noticeable change in tempo and tone signifying the end is about to start. And then at the end is almost like the violins make a weeping/flailing/helpless sound showing a very tortured death.\n\r\nThe \"Hey hey hey hey etc.\" chant is almost like a greeting like \"Hello/Hi/Hey\". This could be a greeting to the newly created earth. And the second chant (At 2:19 on Ã\u0083â\u0080 nima) could be the greeting of man (Who will eventually destroy earth).\n\r\nThe opening riff isnt a very melodic one, more of pain and confusion, which might also be a reference to how a child experiences pain and confusion at birth  (Carried on in Cesaro Summability[Go to the posts in the opinion section for this song on toolshed.down.net to get what i mean]) (Earth must have also felt pain and confusion during its own creation).\n\r\nSo this song could be about how humans fucked earth over, which will lead to the end of earth, but it could also be about how after a human is born they have to deal with a whole load of stressful stuff which will then end in their death.\n\r\nAnd the final \"Hey hey hey\" chant at the end shows that this process will start over again with the creation of a new earth or the birth of a new child. (Hence \"mom\" could be mother nature or an actual mother)\n\r\nSorry, i only wanted to comment on the creation-destruction feel of Aenima on the string album, i got a bit carried away. Sorry if anyone mentioned this stuff before, but i figured it out for myself which is cool, and even cooler if no one realised this could also be about life :)\n\r\nAnyway, later.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nGreat song. I love the last few sentences. \n\r\nDon't just call me pessimist\r\ntry and read between the lines\r\nI can't imagine why you wouln't\r\nwelcome any change, my friend\n\r\nIt's fucking amazing:D\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nThis is a lot like Do The Evolution, but coming from a different angle. Eddie says we're going to inevitably reach apocolypse; Maynard says he hopes that all this stuff will just go away because it's (the media in general) is messing up people's minds and it's like they're almost being brainwashed. What's the best solution? Total destruction, of course!\n\r\nI agree with him, and he couldn't have made the lyrics any better.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nIf anyone wants to know what this song is about all you have to do is open your Aenema cd case and tilt it back and forth\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nIf anyone wants to know what this song is about open your Aenema case take the cd out and tilt the case back and forth. A picture is worth a thousand words. Especially an animated picture.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\ni dotn think maynard is wishing or saying destruction is the solution, i think hes saying its whats gonna happen if we all dotn stop being so petty and fret over insignificant materialistic things\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nIt takes deep thinking to write this music & this is Tool's best song & best album ever. Maynard doesn't need a God to make himself feel better, he just feeds his hunger for knowledge. Maynard is a freethinker & a genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nMom in this song is most definetly mother nature, when I figured that out the song made 100% perfect since.  Fuckin genius song, if only more people could write like this....\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nit's of my opinion that maynard has created a term: aenema, a take on of anima and enema. \r\nenema: bodily wastes, ie: shit\r\nanima: the true self [or soul, even.].\r\nthe song makes me think of what may happen upon the idea of an apocalyptic comedown. all of the impure, or 'shit' souls are flushed away, and maynard believes that the majority of the population is located in L.A., part of california, which is believed to slowly be drifting away from the united states. (thus, arizona bay.) after they're flushed off, the remaining souls that had not been disposed of can be considered 'freaks', like the old dime shows at circuses. \r\na brilliant song from brilliant men.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\ni have to say this and pushit live are both extremly good songs. but i couldnt really say either of them are my favorite. in my opinion Tool is infalable. ive never heard a tool song i didnt like. Maynard writes the best lyrics, its very emotion, which is why i was drawn to tool in the first place.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nnever someone who can write songs like this. they are new age shekespear\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nI heard this live version of the song where maynard changes the lyrics to \"...this hopless fucking hole we call New York... learn to swim see you down in pennsylvania bay\" I thought it was funny\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nthe only thing about this song that gets me is that maynard is this guy talking about how we should believe in ourselves and not be so narrowminded, when in fact this song is a huge generalization. not saying that this song doesent fucking rock cause it does, but it seems to contradict what he says...\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nI don't see it as narrowminded to want L.A. wiped off the map. L.A. is the epicenter of plastic american pop culture. Greater L.A. probobly houses more bloatedly rich people than any other city in the world, while at the same time housing millions of people living in poverty. L.A. is a fucking shithole. I could do without it.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\ni dont think that mom necessarily refers to mother nature, but the fact that we run to our mothers when things get bad, and that mom will fix it,.. maynard is being sarcastic because you cant stop armageddon.  thats my opinion.  i agree with the basic california is going away thing, and never realized the anima-enema title thing... thats sweet.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nactually, u know, i think it could be both the human mom and mother nature because \"Mom's gonna fix it all soon , Mom's comin' round to put it back the way it ought to be\"  the first part can play on what people think mom will do, and the second is mother nature taking action.\r\nok i think im done now.\r\ntool rocks my socks, this is one of my fave songs by them and maynards voice is orgasmic.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nwhat is up with all these emo fans replying to tool's song!?! EMO SUCKS!!! gO AwAY! gO LIstEn tO BLInk 182!\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\noioichick, contract cancer.\n\r\notherwise, i agree totally with DarkSaint halfway up the page..good song, the mom metaphor is nice. and whoever said \"learn to swim\" meant get back in the gene pool was at worst, funny, and at best, insightful. everyone must now learn how to spell.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nJust an interesting tidbit. I don'r know if this has been discussed as of yet but I find Maynard's hate of L Ron Hubbard interesting. For those of you who do not know who Hubbard is, he is one of the main supporters of Scientology, a sort of quasi-religion that has gained support over the years. The main belief of Scientology is that man can shift the way that he feels, thinks, and looks at life, simply by opening and using the mind to see the true picture. Over time this belief has picked up and many famous people such as Tom Cruise and John Travolta have become dedicated \"Scientologists.\" In many ways, it could be said that this belief has indeed created many followers and \"clones\" if you will, and that those who follow the beliefs are blinded and controlled from the normal and beneficial aspects of life. I have just started reading a book by Hubbard on Scientology out of interest, and have found that Hubbard is really nothing more than a tele-evangelist in print. Despite the fact that many ideas of Scientology do seem pretty well-rounded and idealistic, much of it still in my beliefs, seems to not allow the individual to think for himself, and is more of a way to let only the brain do the feeling, thinking, learning, and seeing for you. I think that what Maynard is saying in the context of the song is that when the end of the world does come, none of this trying to see the light in life bullshit is going to matter. In the end, no matter how optimistic, or how controlled and open-minded the individual is, his end will come just like everyone else's. Therefore, Hubbard and his army of Scientologist brain thinkers, will meet their end, even though their \"religion\" tells them to not believe so. Maynard is expressing his own beliefs that the worlds and divinities and auditing that the people of the world create is nothing more than a way of blinding one's self from the truth, and creating a fake screen from what one may call inevitability. So in the end, L Ron Hubbard and all of his clones mean nothing, because even though they will refuse to see so, they truly will be f*****d just like everything else that really isn't important.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nSTOP! collecting material possesions...they do you no good when \"a comet will fall from the sky, Followed by meteor showers and tidal waves, Followed by faultlines that cannot sit still.\" and \"Fuck L. Ron Hubbard\" what a moron....he has no idea what religion is and will never know. go by some swimming lessons...ur'll need'em when the end comes, when its all flushed away.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nyou can try to intrepret it as best as you can ^.^ but youll never know the truth (even though you aint far off) but you can try but maynards probably just to smart for you all..deffinatly to smart for you all*hes a musical artist/genious and his point of view is beyond everyones. Ã\u0086nima is the ass of the hat and will live forever in my heart >.<\r\n-OGT\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nlol, Ar3s their hash cookies and their called satans balls....i made em..the devils fruit can taste pretty good if you give it a chance btw mayb a hint too ;)\r\n-OGT!\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nI don't really think this is necessarily \"the end of the world\" song, but rather how we are ignoring our basic natual instincts and basic common sence in favor of higher education (we can explain how a pond's ecosystem works but we can't catch a fish).  That is why he keeps saying learn to swim.  Swimming was one of those things that every kid learned with their parents really early.  But now everyone's pushing for these high-tech jobs, those important little things keep getting forgoten.  We care more about our contracts...cars...ext.  And this is going to cause the world to end... we are going to forget how to live and the world will end\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nOh...My...Maynard! Dude, Its spelled Ã\u0086nima, retards\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nThe reference to flushing it all away also shows up in Kyuss - Demon Cleaner (\"I've got to flush them all away\"), which Tool has covered live.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nThe song is about mom or mother nature sinking california into the pacific..  When he says learn to swim and see you all in arizona bay he is talking about california being detached and sunk leaving arizona as one of the states on the west coast of the U.S.A.  There for giving it a bay.  As for the armegeddon thing i think its only for people in california\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nYes, we all know it has a nice special letter in that, but no one can be bothered. It's just that simple.\r\nI thought the inside of the CD case made the meaning pretty clear. It's one of those holographs that change when you move it, to show most of California disappearing into the ocean. This song /isn't/ especially deep - its just a song about the hated city of Los Angeles sinking into the ocean by route of a Bill Hicks tribute. Nothing more to it, I'm afraid.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nthis song is not about the end of the world really. the Apocalypse is just a bullshit fear device; religous propaganda. Maynard is laughing at those bastard doomsayers and joking saying , \"i hope the end of the world does come so you fucks will disappear.\" One more thing... Maynard is not God or a prophet. Maynard is a fucking person.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nLEARN TO SWIM\r\nI havenâ\u0080\u0099t read all of the articles but I have got an idea of possibly another meaning for LEARN TO SWIM.  I am trying not to add shit that is already on here so here goes.  \n\r\nLEARN TO SWIM in relation to religion seems to be more scientific.  Christians are always concerned about \"Blind Faith\" and walking on water. (Walking on water is a sign of purity to Christians if you donâ\u0080\u0099t already know)  Why worry about doing something that I have never seen someone do when I know I can learn to swim?  Swimming is possible to keep the head afloat, Christians wont get to far if they never learned how to swim and there is another flood.  But I guess God says in the bible that he will never have a flood again.  So if you believe that you donâ\u0080\u0099t need to know how to swim I guess. \n\r\nAnother metaphorical idea can be applied to what I just wrote above.  Learning to swim, to me, is dealing with problems on earth.  Dealing with problems here, now, and in front of us.  The sin of masturbation or the sin of gluttony in the world does not concern me; I am more concerned about the macrocosmic picture.  Now that I am dealing with real life problems in front of me I know how to swim.  \n\r\nAnother thing I see in the LEARN TO SWIM quote is its solid character.  When someone gets me with his or her whitâ\u0080\u0099s I may be resilient and jump back with my own whit.  Most Christians that I know crumble at simple whit (cry/insecure over me calling them a stupid head ..lol.. for example) and fall against great whit.  Who is there to break their fall?  Ahh yes church, their dependence.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nside7.fullburner.com/ross/images/fullsize/art/…\n\n\n", "comment_184": "\nIt's the song that comes into my head whenever some asshole with a California license plate cuts me off. Dippin' my feet into Arizona Bay, ahh...\n\r\nIt's also a touching tribute to the work of Bill Hicks, as Third Eye is one to Bill himself. That's how I feel when I listen to it, anyhow. Another dead hero...\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nThis is pretty much Maynard expressing some pretty hateful emotions towards the materialistic world, he hates all the fucking media, and the image that everyone feels they must carry. THE FUCKING END!!!(......jeez kids chill out... No one will TRULEY ever know what the hell Maynard means in every song he ever writes...so stop bitchin at eachother..)\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nI didn't read ALL of your posts about the meaning of this song, but I didn't see anyone who thinks that \"Mom\" is God in this song, \"Mom's gonna fix it all soon, Mom's comin' round to put it back the way it oughta be\". That's what I thought when I first heard it, I mean the song talks about the end of the world a lot, and the \"Mom\" character is the one who will \"flush it all away\" or end the earth. If you know anything about religion (no I'm not religious), God is the one who will come and flush it all away, put it back the way it oughta be. Mom will come soon, there isn't much worth keeping and you can't change it without destroying it all. Maynard says that the people, and the way things are in the world, or LA, cannot be changed, the only way to fix it is to flush it all away. And the way things are NEEDS to be changed, it couldn't really be any worse: \"I don't know why you wouldn't welcome any change\". \n\r\nThe \"fret for your \" shows how people focus on the small, worthless things that only affect them. Things that comfort them but aren't important.\n\r\nThe \"Fuck L. Ron Hubbard and Fuck all his clones Fuck all those gun-toting Hip gangster wannabes Fuck retro anything Fuck your tattoos Fuck all you junkies and Fuck your short memory Fuck smiley glad-hands With hidden agendas Fuck these dysfunctional, Insecure actresses\" pretty much goes along the same line as the fretting part in that people are too concerned with little unimportant things about themselves, in this part he focuses more on the stupid shit we do to make ourselves \"popular\" and worrying about how we look in other people's eyes. Narcissists.\n\r\nGreat song, important meaning. Maynard is a genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nI don't know if you all noticed, but the album title is Ã\u0086nima while the title of the song is Ã\u0086nema.  Therefore, I ddo not think the Jungian definition applies.  The Bill Hicks reference is entirely correct, however.  Hicks and the band were good friends, with Hicks even opening for the band on one of their tours.  His last album was entitled Arizona Bay, and was hilarious, by the way.  Many of you failed to notice the definition of the word enema and the meaning which goes along with that, which im sure you can establish yourselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nWell.\r\nThink about it.\r\nAenima  or \"Anima\" is from the Jungian theory. As we all know, the Jungian theory is about the Evolution of Humans, and Anima is the shadow around you representing things you hate. \r\nIn the song Aenima he talks about LA and how it should be flushed away. Think about it, LA is one big city full of millions of people who do absolutely nothing to help us advance to the third grid of the Jungian theory. These people are like parasites to him and have no use in life. If they arent helping us move forward, they're pulling us back. Maynard thinks they should fall into the Pacific from some freak earthquake. Maynard tells us how people fret for little things in life when he starts the \"Fret for your\" part. He's simply saying how all this stuff is not important in our lives and it only makes us feel better. He is stating all the \"dumbasses\" like smiley glad hands who act like they are your friend, but have hidden agendas to steal your life. Why should LA exist if it's so bad and does nothing for us to move on to the 3rd grid? LA is basically a waste in Maynards eyes. And I completely agree. Also, California should be flushed away to destroy it all. If you destroy it all, you can start over. Arizona bay is what will come once California again. Look on a US map. If you took California away there would be a bay right by Arizona. Hence Arizona bay. \r\nWell I'm really tired right now.\r\nBut that's just what I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nits about 2012 \r\nand getting rid of your ego \r\n2012 is predicted to be the pole shift on the earth around every\r\n13,0000 years this happens. \r\nand this will be our ascension for some of us into the next dimension\r\nwhere we will gain christ conciousness. \r\nanalysis:\r\n\"fret for your...\" \r\nthe fret for your lines obviously talk about ego\r\nespecially fret for your car. lots of people feel better\r\nif they drive better things own more expensive things.\r\nwe need to learn we are all one and are made with what we need\r\nwe dont need materials and they definatly do not determine who we are.\r\n\"cuz im praying for raining and im praying for tidal waves\"\r\nthis is obviously talking about 2012 and the predictions of massive storms that are ctastrophic to the land masses and animal survival on earth. it is said that california is supposed to totally sink.\r\nwell thats all im going to say for now let you guys intepret the rest.\r\nthis is one of my favorite songs by tool even though i dont really listen to them. and the video rocks. the video will help you understand what im saying alot better.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nYeah, it's a Bill Hicks tribute, nothing more, nothing less. Bill Hicks and Tool, a match made in heaven.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nuhm...im an avid believer of the whole twenty-twelve theory and all that, but i dont think thats what they were saying here...the live version of the song Maynard starts the song by saying \"this songs about LA\" or something to that effect...i do see the twenty-twelve correlation (praying for tidal waves--i want to see it all go down) but i just think hes saying that he sees the end times being in La...iunno..\r\nbill hicks...hell yeah..\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nProps to TheFullEffect82\n\r\nMy favorite lines:\n\r\n>>Don't just call me pessimist \r\nTry and read between the lines <<\n\r\n>>One great big festering neon distraction,<<\n\r\nAnd the lines that bring the whole thing together:\n\r\n>>I can't imagine why you wouldn't \r\nWelcome any change, my friend <<\n\r\nI recall a friend playing this song for a highschool assignment, to the class (to interpret) ... all anyone heard was the swearing, it made me sad.  They all said \"this music is aggressive!! It's depressing!!\" ... If I was not the silent fuck that I am, I would have given them a piece of my mind.  Still...would it have mattered?  Would they have comprehended the meaning at all?  Not bloody likely.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nThis song is not about the WORLD ending, it is about  Los Angeles being destroyed.  If the world were to end, there would be no Arizona Bay, to which Maynard could swim.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nWell I think that this song means all of what you guys said, and more, but here's an idea. Have any of you guys read the \"Two spirals\" post? The famous thebigbakedbean post? Well if you did, you would know that there's an alternate arrangement of tool songs that fits well. I would suggest reading this post ( angelfire.com/ma4/question/… ) But this said, the spiral hint was made by the drummer in one of the songs, using an algebraic number using the drum beats that made a spiral, known as a Fibonacci sequence. I was thinking that the line 'read between the lines' was a hint that instead of looking at the lyrics of a song, there would be something in the actual tabs that related to something, or in another song (e.g. Lateralus, where the fibonacci sequence takes place) buut of course it could justbe saying read between the lines... only mjk would know... anyway this is an awesome site :D\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nOh, and i think that learn to swim, is just stating that in the event of a natural disaster, humans will eventually adapt and evolve to coordinate with the problem. That no matter what happens, humans will survive. Or of course the rest of the song could contradict that idea, saying that the ultimate cleansing would be the removal of mankind from the earth, so that mother nature could fix itself and go back to normal, such as displayed in the movie the day after tomorrow. Just a suggestion.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nBy the way, I've never heard this song. :D... but I shall get tool cds soon...\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nprobably i will get ripped up and down for this and also just crucified but i'm going to say it anyway-- I really don't think this song is too different than \"californication\".  There, I've said it.  Laugh if you must, but I'm sticking with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nFor what I remember in an interview of Maynard on SPIN was that he sees LA as a breeding ground for anything corporate and fake in media and showbiz. And the song is about getting rid of the part of california that is threatned to break off in the wake of a major earthquake. This is so that music and television can go back to it's purest form.\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nIt's about stupid people in california and plastic surgery and crap like that. And movie stars and bananas and kiwifruit and monkeys and safety pins (which really aren't very safe at all) and lunar eclipses.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nOne of the best Tool songs. It's about how stupid people really are. Fretting for this and that, when we're all going to die anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nThis song won a GRAMMY Award for best metal performance, and I can see why. Kickass Tool song.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nI love this song, it is one of my top favorites ever. I hate fakes, those who care for superficial crap more than other people. They are just slowing down everyone from discovering the big questions in life.\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nIt's about how materialism is worthless because owning all that crap won't matter when the world ends.\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nHe's all like fuck everything, cuz when it all comes down you don't need all your shit, all you need is a way to survive.  I think Maynard can't wait for the shit to hit the fan cuz he just wants to see what people are going to do, they'll all be like NO! my car is gonna get destroyed, they'll fret for their possesions instead of themselves.  And in the process everyone's gonna die, cuz you're not looking out for #1.  This song fuckin rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nI personally think the reference to Mom is hinting at how parents are just people, just the same as you or me, passing on propaganda that they've inherited to their children, who in turn pass it on. Part of this propaganda is that parents are almost sacred and godly.\n\r\nWhile the parents fret for their 'prozac' and other possessions because of impending doom (more on exactly what I mean in a minute), their kids are blind to the fact that nothing can stop the end, and they're turning to the ones who propaganda has glorified.\n\r\nThe song on the surface level seems to be quite plainly about the fact that propaganda and lies have virtually destroyed our world. We began with no language, as things thinking for themselves, but as we 'evolved,' we only got stupider. Our organized religions are pretty much communist ideals, saying if you're not the same as us then you're screwed over and condemned. A majority of humans lack the ability to think for themselves, blindly following others. And, just like the excellent song \"Dust in the Wind\" by Kansas, I think that Maynard is trying to say that no matter what, if the world continues forever, eventually it's bound to crumble and everything everyone strives for now will have been useless and in vain. So no matter how hard we try to go back to our origins without language and thinking for ourselves in our own means, the world has been so decimated already that it's not going to happen. But still, eventually ('the bomb's gonna fix it all soon' and related lines) we're all going to die.\n\r\nAnd, if you don't 'learn to swim' (go back to the roots of humanity, before people were \"civilized\"), it only comes quicker and more painfully.\n\r\nAgain, just my opinion, but it seems correct to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nto me this song has no metaphorical meaning except \"mom flush it all away\" he's just saying how he wants a superior to wash it all away.\n\r\nThe song is pretty obvious by the lyrics, he's just tired of all the dumb unneccesary bullshit that occurs and wants to watch it all come down.\n\r\nI like how in the back of the CD case it shows a big portion of California missing, connections with the song.  ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nYou can pretty much read into any song by Maynard... Pyro, you're only looking at it on surface level.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nbtw, the name for the song is Ã\u0086nema ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nI noticed there was another listing by that name, but I don't feel like pasting my message there right now...\n\r\nAnd you are right, ThoR294\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nit's just easier to spell it 'Aenema\"\r\ncause I forgot how to make that damn symbol...\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nThere's always the character map 0o\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\ni hate the state of california...\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nJesus christ are you guys morons. Have any of you even bothered looking at the Tool website? Toolband.com . Tool isnt some ordinary pussy punk rock band like all of you like to think. It doesnt matter what song it is, all of their songs have a deeper meaning than what you think. What you guys are saying is like saying H. is about a snake that drowns. \n\r\nThe theme of the CD is evolution. The most significant song expressing this theme is Forty Six & 2, about the Jungian theory. Jungian theory states there are 3 stages of evolution, and that we are aparantley in the 2nd stage, with 44 chromosomes, and 2 sex chromosomes. Our next stage would be 46 and 2, the 3rd stage. But in order to reach this 3rd we have to clean our conciousness. We have to get rid of everything that we dont like or hate. This is called Anima.\n\r\nThe title of the song and cd is Aenema, a combination of Enema and Anima. Enema being a clensing, anima being our conciousness. This song is describing what their clensing, or what their Aenema would be. In order for them to step through the whole state of California would have to disapear. The meaning of the song, I will admit, is very vauge, and is more than likely based off of the Bill Hicks bit, but the actual point of the song is deeper than what you guys have been saying. \n\r\nNo it is not just about drowning california, no it is not just about the Bill Hicks bit, and no it is not just about a spiritual clensing. Its probably the most personal song that Tool has ever made, and for that reason it threw most people off. It has to do with all of these things that you guys said, they all fit together, but you guys would rather conflict with each other to think that your the only right ones. I highly agree with Squirlleofdoom and World Ofrobots on this one.\n\r\nSo, there we go, are we clear.\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nThe album and the song are spelled differently.\r\nThe ablum is spelled Ã\u0086nima and the song is spelled Ã\u0086nema so... hmmm.\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nTOOL!!!       \\../.   .\\../                  I'm tryin to decide which song is better, this or sober.I'd say they're equal, any1 esle have an opinion on that?\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nWell i'd say lateralus is Tool's best song, but when a band  is able to put out so many great songs its hard to decide. To me there is alot of truth in this song.  Spiritually the world is goin down the shiter with porn,violence, and all this bullshit we call entertainment.  I mean where is the line drawn?  Oh well.  At least there are some that understand how screwed up the world is.  The world where people are looked down upon for beliveing in God and the world where spirituality is laughed at.  I'm really tired of it.  To me some adults are just to scared to see the truth.  Life is fine when you're happy with your plastic girlfriends and expensive cell phones.  \n\r\n\"Stupid shit, Silly shit, Stupid shit\"\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nI know I'm a cunt, but I listened to this song many times and I really like it but I've never actually listened to much more songs. Except Push it and Stinkfist.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nBrabbrabus, I always tried to disect the CD like that, and you helped me complete my thought =) Thanks!\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nsomeone may have mentioned this before but i think the phrase \"arizona bay\" is directly taken from bill hick's cd entitled the same..  meaning when CA \"falls into the ocean\" what will once have been would become arizona bay...  Unless this is a common term used, which i am not sure..\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nMy read is not so literal on the California and Armageddon themes.  I see it more as a meditation on how the author thinks the world has gone wrong (3 ring circus, hopeless LA, fret for your...), and the way to fix it is to get rid of all the \"dumbfounded dipshits\" (\"I sure could use a vacation\" ... from their ignorance).\n\r\nSpecifically how the world is wrong is how brainwashed people are into spending all their time fretting over physical beauty, money, popularity, medicated happiness, etc.  More specifically, what is wrong is dependency.  People are spending so much time caring about all that crap that they can't take care of themselves (i.e. they don't know how \"to swim\").  Think about it.  If your grocery store suddenly had no food on the shelves, your plumbing stopped delivering freshwater on demand, or the local utility stopped providing heat & gas at the flip of a switch, how many of us know what we need to survive?  Very few of us have \"learned to swim\"... we need the lifeboat.  We are \"dumbfounded dipshits\" who don't remember (\"Fuck your short memory\") how unstable the world really is, because we'd rather hear about Brad & Jen than actually pick up a history book.\n\r\nI'm not saying everyone should go be farmers, but our laziness has so progressed that instead of learning how to take care of ourselves, then going to learn a profession, we now skip over the take care of ourselves part and plug right into whatever position in the societal machine that will give us the most money, sex, quick-fix happiness, whatever.  And the free time we do have we waste on \"One great big festering neon distraction\" (television, media in general, and I'd throw wars in here).\n\r\nIndependence (ability to provide for oneself) is a positive value to the author, but one that doesn't get respect.  He can't wait for the worldwide storm to get rid of all the dependent \"freaks\" who don't know \"how to swim\", leaving behind only those who have been good stewards of their lives.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nthis song is was inspired by the comedian bill hicks. it is about a tidal wave going over southern california flushing away all the dumbfounded dipshits. the only ones to survive will be the ones who learn to swim. the pacific ocean will boarder arizona creating arizona bay.(if u look inside the case you will see it)                                                                                                                                                    what the deeper meaning is we need to get rid of all the superficial people in this world. when he says learn to swim he is talking about the only people to survive will be the people who have evolved 2 more chromosones ( listen to fourty six & 2) to form a collective counsiousness. when he says Don't just call me pessimist \r\nTry and read between the lines \r\nhe means hes not just thinking negatively and wants to kill everybody. he want us as a specis to move towards a greater existence by cleansing out the filth\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nI always assumed that it was about getting rid of LA, because Maynard was a fan of late comedian Bill Hicks, and apparently Bill Hicks used to say how L.A should be flushed away.\r\nAll that said, I could be wrong\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nas well, Ã\u0086nema was BEFORE californication, so if anything, californication is not too different from Ã\u0086nema.\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nMaynard is very talented, and it is so nice to know there is somebody who feels the way I do about the world. I think Maynard is trying to make everyone take a good hard look at what we have all become. When you think about the things we strive and work so hard for, its kinda funny. Every word in this song makes perfect sense. I think Maynard uses L.A. as an example because there are a lot of dumbasses there, but I think he is also referring to the rest of the world as well. Really, the only way to stop the non-sense is to kill it all.\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nI think there is a misprint in the lyrics written here where it says;\r\nDon't just call me pessamist.\r\ni think he says;\r\nDon't just call it apathy.\r\nIt seems to make more scense.\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nok its obvious that this song talks about the end of the world but it is also more than that..maynard is just basically mocking everyone who is all paranoid and worrying about the end of time and basically saying you need to be smart about it not just walking around pretending to be who you arent. he doesnt see the end of the world as a bad thing and is saying it is stupid to worry about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nIts about abbortions...\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nBrabbarus has the right idea. Granted he needn't have called everyone morons but he has the right idea about the song. It is a truely hate filled song, Maynard believes that the only way for the world to pull itself out of the craphole it has been put into by the human race it has to flush away the materialistic, self-centred fools that are killing the planet and ruining the evolution of the people who realise the faults of the situation.\n\r\nThe anima/enema/Ã\u0086nima thing is also correct with any of those things. A disgusting image there but that is what Maynard sees most of society as, the shit blocking up the way things are meant to work.\n\r\nAm I the only one who can imagine maynard walking down an LA street seeing all the people he dispises and singing this song. It is because of his connection to this song and they strength he feels for this cause that makes it so powerful.\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nthis song reminds me of the RHCP Californication.  The meaning seems really obvious for a tool song. The sad state of modern society and how we need a change!\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nthis song was influened by gandi who saw apocalyptic images while having a hycolonic!!\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nMaynard is expressing his, to put it lightly, dislike of the people of Hollywood and others.  The line \"see you down in Arizona Bay\" and the constant repetition of \"learn to swim\" and the name of the song itself \"aenema\" which is a combination of the album's name \"aenima\" and the act of rinsing clean one's colon, an \"enema,\" suggests that he wants an earthquake or some other cataclysmic event to take California and submerge it in the Pacific Ocean, thus washing away all the filth in California.\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nThis song is amazing as are most of Tools songs. In Aenema Maynard talks about how he's so sick of everybody bitching in life about things taken for granted= Fret for your figure and \r\nFret for your latte and \r\nFret for your lawsuit and \r\nFret for your hairpiece and \r\nFret for your prozac and \r\nFret for your pilot and \r\nFret for your contract and \r\nFret for your car \n\r\nAlso he hears talk of armagedon and he wishes it would just come and wipe us all out so there would be no more pathetic bullshit anymore=Some say the end is near \r\nSome say we'll see armageddon soon \r\nI certainly hope we will \r\nI sure could use a vacation from this\n\r\nwhat he means by \"learn to swim\" is life is a bitch but you have to deal with it.\n\r\nMom's gonna fix it all soon \r\nMom's comin' round to put it back the way it ought to be= this basicly stands for the act of everyone being scared of harsh reality and having people to make them feel better again instead of sucking it up and dealing with it.\n\r\nAnyway this is a great song by a great band.\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nThis song is amazing as are most of Tools songs. In Aenema Maynard talks about how he's so sick of everybody bitching in life about things taken for granted= Fret for your figure and \r\nFret for your latte and \r\nFret for your lawsuit and \r\nFret for your hairpiece and \r\nFret for your prozac and \r\nFret for your pilot and \r\nFret for your contract and \r\nFret for your car \n\r\nAlso he hears talk of armagedon and he wishes it would just come and wipe us all out so there would be no more pathetic bullshit anymore=Some say the end is near \r\nSome say we'll see armageddon soon \r\nI certainly hope we will \r\nI sure could use a vacation from this\n\r\nwhat he means by \"learn to swim\" is life is a bitch but you have to deal with it.\n\r\nMom's gonna fix it all soon \r\nMom's comin' round to put it back the way it ought to be= this basicly stands for the act of everyone being scared of harsh reality and having people to make them feel better again instead of sucking it up and dealing with it.\n\r\nAnyway this is a great song by a great band.\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nI think this song is very linear, and clear. At least compared to other Tool songs. Tool is by far one of my favorite bands. I think the song generally is about cleansing the world. The constant references to \"mom\" (mother earth, for sure) and rain (the great floods of many religions) and such definitely lend the song a sure meaning of cleansing. He just wants to see things go back the way they were, and for people to stop fretting over stupid shit. Not just LA, of course. But LA is definitely the posterchild for silly shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nI believe Maynard was using a cataclysmic armegeddon to paint a picture about the cleansing of the inner man. Many of the songs on this album deals with spiritual endeavours and conflicts within oneself. Maynard isn't a revolutionist, he never really took to promoting purification on a world scale. Most of his work speaks of battles with oneself.\n\r\nCarl Jung explored most deeply into the realm of the anima, which is a symbolic archetype of the inner soul. I don't think this song is named what is it is for no reason. I agree with those who say that it's a form of wordplay, formed from both anima(soul) and enema(cleansing). The cleansing of the soul in other words. And I don't think it's coincidence either that the album was named Aenema. If it were so, that idea is most central, it has to epitomize the whole theme of the album.\n\r\nCarl Jung also studied the link between psychology and mythology extensively. He identified certain similarities in forms of mythology, of which come forth the Hero, who represents the conscious mind, and the Earth Mother, the unconscious. He wrote about the cycle of life, whereby the Hero frees himself from his Mother, and towards the later stage of his life, is returned to her. And owing to the Mother's persistent ability to identify and test the Hero's weaknesses, it highlights the magnitude of power the human unconscious has, something that obviously intrigues and facinates both Jung and Maynard.\n\r\nThere's a reason why the band identifies its fans as 'The Collective Consciousness'. It's a term coined by Carl Jung, which leads me to believe that Jung and his existential theories on the human mind are one of the biggest influences on Maynard's writing, and also reason to believe that this song is not just about catastrophe and the purging of the evil of the world. Besides, we're talking about Tool here man...\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nThere is something that is called Convergent boundaries. Convergent boundaries is when one plate within the earths crust slides underneath another plate.  It is a common miscunception to say that California is breaking away from the United states. It is acctually converging under another plate.  Inchs of coastline disapear each year.\r\nI beleive this is truly what the song is about. \r\n\\\"Here in this hopeless fucking hole we call LA\r\nThe only way to fix it is to flush it all away\r\nAny fucking time, Any fucking day\r\nLearn to swim, See you down in Arizona bay \\\"\r\nThe line \\\"Learn to swim, See you down in Arizona bay\\\" is  reference to the fact that in a couple decades Arizona will be the coast line because California is slowly disapearing.\r\n\\\"\r\nCuz I\\'m praying for rain\r\nAnd I\\'m praying for tidal waves\r\nI wanna see the ground give way\r\nI wanna watch it all go down\r\nMom please flush it all away\r\nI wanna watch it go right in and down\r\nI wanna watch it go right in\r\nWatch you flush it all away\\\"\n\r\nThe above passage would be another reference to the plate slipping under the pacifc plate; watching it go right in and down.\n\r\nBut among that There are also references to othe things and versions of the \\\"apocolypse\\\" leaving me completely unsure of my idea....\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nthe 100th comment yess\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\ninspired by GHANDI having a HYCOLONIC\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\n^^ This song cheers me up when I'm down. Been listening to it for years.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nwow, this song is enlightening.  it seems if you remove the humor from a bill hicks routine, bill just sounds like an angsty teenager ranting inanely and predictably about a bunch of bullshit.  \n\r\nand if the \"learn to swim\" line is about \"going back to the gene pool\" then its retarded.  the contrary context that surrounds it seems to suggest the double meaning was just jammed in to satisfy tool's moronic fans who feel special when they work out the meaning of a needlessly coded lyric.\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nAs most of you have touched on, the song is about all the phony parts of Hollywood.  Its about taking all the things you have for granted.  The \"learn to swim\" part means that you have to deal with life, even though it may seem hard at times.  An amazing and creative song, just like all Tool/APC songs are.\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nIf you are a real TOOL fan you will know that each song doesnt have just one meaning, more-so it's a matter of personal interpretation. Maynard has always wanted open-mindness, (if that is even a word i dont know) and so its based on what you think.          ...:Learn To Swim!!:...\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nI listen to this whenever I just totally pissed off. It's my favorite \"Fuck Everything\" song. It dosen't just have to be LA you're pissed at.\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nIf you are a fan of any band or music even you will understand that songs dont have to have one meaning. If you can so evidence and reason to your opinion and its validated its correct. Again in saying that you cant have a \"wrong opinion\" so please I post again dont tell anyone they are wrong. Now onto the song (eheh that rhymed...)\n\r\nOk this is very enlighting and most of what I felt about this song had been expressed in everyones elses posts and Im pretty sure everyones got the same connection or common idea. Im not going into my beliefes and opinion on this song because everything I had to say has been said. Excelent song from a grand band. And apart from the few morons few and far between I support everyones post Good work guys.\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nOh and I'd like to comment on this \n\r\n\" by Brabbrabus on 01-10-2005 @ 12:35:12 AM\r\nJesus christ are you guys morons. Have any of you even bothered looking at the Tool website? Toolband.com . Tool isnt some ordinary pussy punk rock band like all of you like to think. It doesnt matter what song it is, all of their songs have a deeper meaning than what you think. What you guys are saying is like saying H. is about a snake that drowns.\n\r\nThe theme of the CD is evolution. The most significant song expressing this theme is Forty Six & 2, about the Jungian theory. Jungian theory states there are 3 stages of evolution, and that we are aparantley in the 2nd stage, with 44 chromosomes, and 2 sex chromosomes. Our next stage would be 46 and 2, the 3rd stage. But in order to reach this 3rd we have to clean our conciousness. We have to get rid of everything that we dont like or hate. This is called Anima.\n\r\nThe title of the song and cd is Aenema, a combination of Enema and Anima. Enema being a clensing, anima being our conciousness. This song is describing what their clensing, or what their Aenema would be. In order for them to step through the whole state of California would have to disapear. The meaning of the song, I will admit, is very vauge, and is more than likely based off of the Bill Hicks bit, but the actual point of the song is deeper than what you guys have been saying.\n\r\nNo it is not just about drowning california, no it is not just about the Bill Hicks bit, and no it is not just about a spiritual clensing. Its probably the most personal song that Tool has ever made, and for that reason it threw most people off. It has to do with all of these things that you guys said, they all fit together, but you guys would rather conflict with each other to think that your the only right ones. I highly agree with Squirlleofdoom and World Ofrobots on this one.\n\r\nSo, there we go, are we clear. \n\r\nWhat Brabbrabus said is one example of the big picture. most you guys are right but it has more then one meaning and Brabbrabus just showed us this. I'd like to thank him because this is an angle I didnt see nor know about.\r\n-lethil-\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nShutup.  Fuck Philadelphia.  Andy Reid is fat.\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nTool isn't pretty good asshole, they are damn good.  Infact, they are gods of music.  I will agree that they aren't better than Metallica, Led Zeppelin, Rush, and Maiden.  Ozzy with Black Sabbath was much better, but solo, he wasn't.  Tool is one of the more unique bands around if you listen to their music OldskoolrockerJTS, but i'm guessing that you haven't listened to much.  This is Tool's best song, and don't even bother debating me.\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nTool put so much thought into their music and maynard puts so much thought behind the lyrics that no other lyricist can even come close to.\r\nMaynard is a freakin genius.\r\n\"more legendary and talented\"?\r\nmetallica is good, but some lyrics are hackneyed\r\nVan halen has a good drummer and great guitarist, but the multiple vocalists detracts from their overall score\r\nJourney had good love songs, but they were overtly cheesy\r\nRush was a good progressive band, and were good for their era, but became lacking in later years\r\nLed Zeppelin is overplayed out the anus, and we've heard every song a million times and it is no longer groundbreaking\r\nIron Maiden were talented, props for them. serious lyrics and such, and also a history lesson or two.\r\nDream Theater are decent enough\r\nOzzy was better with sabbath, and he's had some lacking moments in his career (mid/late 80s, i.e. \"breaking all the rules\" =corny)\r\nAerosmith put too much sex into their music and it lost credibility\n\r\ni hereby rest my case for Tool being one of the greatest bands of all freakin time.\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nthis song is kick ass and this is  the song that turned me on to tool. fuck yeah i'm welcoming the change ...bring it. and Fuck all those gun toting   hip  gangster wannabe's fuck em!!!! TOOL RULES\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nMaynard said on a live unreleased track \r\n\"Are any of you familiar with the work of Carl Jung, Psychologist?  This song explores a more contemporary version of that psychotherapy method, involving high colonics.\"  Right before AEnema.  \n\nship.edu/~cgboeree/…\n\n\n", "comment_251": "\nfirst of all oldskoolrocker Tool's singer's name is Maynard James Keenan. secondly the only thing that seperates amazing modern bands from superstar, will-be-remembered-forever, type groups like Zeppelin and fucking washed up losers who are famous by selling out like Metallica and Aerosmith is A. Time B. The untimely death of a band mate. C. Selling out in a big way. Tool will be remembered as one of the important rock acts of this decade and the last. Their integrity and elusiveness is compareable only to Led Zeppelin.\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nTool doesnt just rock and they are more than the classical bands. Don't get me wrong I love the classics but Tool are the fucking gods of music. By the way, his name is Maynard James Keenan. Get it right he is your god. Hmmmm....I completely agree egb\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nTOOL JUST ROCKS!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nChrist I love the idea of this song. Could you imagine sitting there watching the world end? Sure you'd sit there a bit upset about the world ending, but if you were cynical enough you could look on the bright side and revel in the fact that even though you were fucked, all the things that you hated were fucked too.\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nThis song is about LA breaking off from the continent and drowning because it's an evil city. But Maynard \"can swim.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nIf you drop the A in Aenema you have the answer.  ENEMA, it's another metaphorical song about flushing away all the scum in L.A., and better yet the whole city of L.A., even more so, the whole state of california.  I forget what the previous symbolism of the A at the beginning was, but I'm sure there's another meaning to this song.  Notice the difference in spelling between the album (Aenima) and this song (Aenema).  Hopefully everybody knows what an enema is.  That's probably what's he's speaking of.\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nTool = much better than anyone oldschoolrocker named except MAYBE Led Zeppelin. This album is Tool's best. This song is Tool's best. That is saying A LOT. I believe that this song is about spritual evolution like some where saying. We won't be able to evolve spirtually until the Hollywood know-it-alls who want to run our lives are gone. \r\n\"Fuck L Ron Hubbard\" is my favorite line just because he started \"Scientology\" what a dumb religion.\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nTool = much better than anyone oldschoolrocker named except MAYBE Led Zeppelin. This album is Tool's best. This song is Tool's best. That is saying A LOT. I believe that this song is about spritual evolution like some where saying. We won't be able to evolve spirtually until the Hollywood know-it-alls who want to run our lives are gone. \r\n\"Fuck L Ron Hubbard\" is my favorite line just because he started \"Scientology\" what a dumb religion.\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nPersonally, while the surface of the song does make you assume it's only about L.A. and the end of the world, I think there is more to it.  L.A. is in a sense, the hub of American society.  Hollywood, movies, the entertainment business, everything that has come to mold us, music, television, movies, those industries are founded in L.A. for the most part.  What has this done for society?  Nothing except make American society a sea of social bullshit, (that we swim in on a daily basis).  Everything in entertainment has clouded so many people's views of what life should be.  \"The American Dream\" has become not only having a decent home, a good job, and a great family, now it includes having fake physical features loaded with collagen, botox, silicon, and saline, a nice \"ride,\" being \"hip\" and into newage things like Scientology.\n\r\nEverything is \"one big festering neon distraction\" from the REAL issues we should worry about, the REAL goals we should be working towards.  It's like we are all deer caught in the headlights or infants that \"ooh\" and \"ahh\" over the pretty fireworks.\n\r\nMetaphorically, the \"only way to fix it\" would be to \"flush it all away.\"  Not exactly the state of California or society, but the \"circus sideshow\" mentality that society has adopted.\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nI think its not quite the end (END!) of the world but just a whipe out made by nature (with alot of water so we all gotta learn to swim :P:P) \r\n Oh and all about the VIP's losing all their shit hehe\r\nLive wit wat u got!\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nI actually wrote an analysis essay on this song, I find this song one of the deepest most meaningful songs, if not the most. It's available here if anyone is interested: modenadude.com/docs/… (we had a two page max)\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\n\"Arizona Bay\" is a Bill Hicks album. Bill Hicks is a comedian that the band highly respected. It was actually Hicks that wanted to see LA fall into the ocean. The song, as well as the album, Ã\u0086nima are dedicated to Bill Hicks and his philosiphies.\r\nCheck out his albums \"Arizona Bay\" and \"Relentless\"\r\nyou'll se where TOOL gets most of there inspiration from.\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\noh..and when I say \"inspiration\"...I mean sarcastic criticism...:-)\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nwe, as a society will all be equally as fucked\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nall the freting-so to speak, simply talks about how easily and willingly distracted mankind has become with the little nonsenses created by modern civilization while we miss out on the bigger picture that nature has had about enough and if things continue in the same exponentially growing decadent lifestyles of humanity the end will arrive fore long\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nThis song is a perfect example of what Tool is as a band.  There is the kick-ass music that draws in alot of people, the aggressive lyrics that depict a very specific idea, and the deeper meaning that can be pulled out.  To really do justice to this song, it would take pages upon pages.  A few of the posters did a very good job summing it up.  Here is what I think of it:\n\r\nIn a live version of the song, MJK says, \"any of you familiar with the work of Carl Jung?\"  Obviouslly this song has alot to do with his studies, the term Anima standing out.\n\r\n\"Mom's gonna fix it all soon\" refers to mother nature, and ties in with the comets and tidal waves.  You can take that for what it is, or explore it deeper.  I take it as meaning that something catastrophic has to happen before people will realize how messed up things are and make a change.\n\r\nMy favorite line is \"Fuck all those gun-toting Hip gangster wannabes.\"  That whole verse, to me, is Tool just giving the middle finger to all the bullshit fake people.\n\r\nI don't really have time to keep going, so I'll cut it off there.  I do want to say that MJK is an amazing writer/poet to be able to put all of that into a single song.  Again, this is what I love about Tool; you can look at them for their face value, or take it to another level and bewilder yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nBill Hicks.\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nPay no mind to NCCm, he is just a 13 year old wannabe death goth...\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nWow. Musically, this band is amazing. Don't quite agree with everything they say, but... it sounds so GOOD! You just can't help loving this band.\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nmaynard obviously wrote this song about how much he hates the vain-litered circus that is his living ground, L.A. Although i've never been to L.A. before, I can understand where he's coming from. If there's one thing I hate, it's the three-week marriages, the plastic people that only want the whole frigging world to look at them, but most of all, it's the way everyone is so jeleous. I think there are more important things in the world. And fuck all those gun-toting hip gangster wannabees!\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nno. i can not spell.\n\r\ni have been reserching tool's song \"faaip de oiad\" all weekend and someone els's comment on that song reminded me of this song heer it is \n\r\n\"The burnt out dwarf will come through our solar system and really mess with our planet. All the tectonic plates will give, (\"Followed by faultlines that cannot sit still\")the earth will rotate in reverse, the meteors that it pulls withit will pound the earth causing sunamis (\"Followed by meteor showers and tidal waves\"), the sun will be blocked out for a while causing huge climate changes, the list really goes on. Everyone will run to the mountains(\"Followed by millions of dumbfounded dipshits\"')\"\n\r\ni think this song is just letting out a warning because its has direct links to a chaotic apocolips theory\n\r\nin short every solar sytem is binary so it has 2 suns, the one in the center of our solar system and another that has burnt down to a brown dwarf wich orbits extreamly radicly outside of our solar system, yet ever 3600 years the extra sun pass thru and cuases extream damage to the suronding planets (earth included)\n\r\nif u would like to read more on that theory look up the song \"faaip de oiad\" on this site on the 3rd comments page ther is a comment by \"shindo66\" (the last comment) and thas wer i got my idea from\r\nwhata yall think?\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nAs I have read through these comments I have come across a similarity that several of them share; namely, that this song has a \"deeper meaning\". I'm sorry, I just don't see any hint of a \"deeper meaning\"; usually songs with hidden message have clues in them that have been left by the songwriter. There's no hint of it; its a pretty straight forward song: the guy hates the world, especially LA. \n\r\nIf someone could explain to me, in detail, the \"deeper meaning\" that this \"genius\" is trying to get at then I'd be delighted.\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nFirst off tool is one of the best bands of our generation period \r\nmusically almost no one compares to them \r\nbut this song is about how LA is just a horrible place to be and exist and all maynard wants it is to fall away in2 nothing\r\nhe says its not entirely impossible either all we have to do is read between the lines and we will see wats going to happen\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\n\"I just gotta say, by lookin past the surface of this song, or at least by tryin too, I get a lot more out of it. It goes past bein angry at how fake and superficial people and LA are. The word AEenma is a mixture of the word Enema, which is clearing of the bowels with fluid, and the word Anima, which is, in Jungian theory, the true inner subconscious self. It seems to me that this song is about clearing away those attachments to stupid useless shit that we don't need, and getting back to nature. He makes multiple references to mom, which is probably Mother Nature. Its about getting back to our true inner selves, uncovering what's hidden in our subconcious, and clearing away all of the shit, and learning how to swim. LEARN TO SWIM,\"\n\r\nSummed up very well. I consider it to be the correct interpretation of the song. I, however, do not agree with the philosophy of \"finding your inner selves\" because it follows the \"truth is outward\" maxim, except it has been inverted. The problem I have with this philosophy is that it presupposes a whole slew of things that I do not agree with for find plausible (namely, the notion that every person has a \"true self\"). The reason I do not believe this is because I believe if a person wants to know themselves they have to do so by taking a genealogical approach,i.e. taking the historicity of their 'self' into consideration. This is essential to understand who you are and what forces have shaped you as a person. When I say \"forces\" I mean environmental forces which I use in a very loose sense for they entail a diverse array of forces that wholistically form an incredibly dynamic environmental force. In other words, a framework with numerous variables contained within it. What are these variables? Societal forces, psychological, genetical, etc... What is important is to remember that these are all inextricably intertwined. \n\r\nSo following this train of thought, how can there actually be a \"true self\"? There is not such thing (in my opinion). It's pure mythology. There is only the biological self, what you have experienced and how you have (and are going to) interpret those experiences. What I am really trying to get at is, you are whoever the fuck you want to be.The forces which have shaped you as a person are there within yourself. The task, I believe, now is to identify those \"forces that have shaped you\", proceed to trace their historical path as best as possible  (obviously, memories aren't perfect) and then recognize them (for what they are, whatever they may be). This process, however, must not be mistaken with the \"true self buried within\" notion. throughout \n\r\nSo you are who you are right now, but that does not mean that you will be this person 20 years from now. \n\r\nThe reason for this long post is an attempt to spark discussion amongst, what seems to me, an intelligent community of Tool fans.  I believe in people educating each other. It's healthy, it's fun, it's democratic.\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\n\"I, however, do not agree with the philosophy of \"finding your inner selves\" because it follows the \"truth is outward\" maxim, except it has been inverted.\"\n\r\nCorrection: not \"truth is outward\" but \"truth is out there\"\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nrealitymark is the only person to have relaised that Tool are massive fans of the late Bill Hicks. The comic genius is referred to in many of their songs, and even and extract of one of his shows is used as an intro (where he talks about how drugs shouldn't be banned, and those who say that hate all drug related things should throw away all their music, cos the artists were really f*cking high on drugs, and judging from the Tool videos, these guys aren't too unfamiliar with drugs either!) Bill Hicks lived in LA (or Hell-A), and hated it. He wanted it to fall into the ocean to leave something he calls Arizona Bay, hence the whole basis for this song. There may be hidden meanings behind this song, but the obvious one is the formentioned.\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\ni love this song..its so complex..like all tool songs\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nTool are a completely amazing band both lyric and and musicwise.Their music constantly continues to inspire and provoke new thoughts and ideas in both thier old and new fans [ and i also hear they're releasing a new album later this year woohoo!].  i find aenima really interesting [ it also happens to be a completely awesome song ]  No one can dispute the fact that the song centres around Maynard's loathing of L.A and how fake the place and it's celebrities are and him wishing the whole place and all the superficial 'stupid shit' that goes with it, would just dissapear. however i think thier is more to this song than just simply that. \r\nthe whole 'fret for' verse talks about all the things these celebreties are consumed by,  and if your honest you'll probably find something in that list that consumes you too, the fact is it's almost become human nature, a whole generation of materialistic and superficial worriers, because its what we're plasted with 24/7 from the media. this leads on to the lyrics 'learn to swim' which i interperate as -learn to get back to what really matters get back to the gene pool and our real human nature, learn to make it on your own with out all this stupid materialistic unnecessary shit are lives seem to be filled with. \r\n The 'Mom's gonna fix it all soon' part of the song is great the whole song seems to change like songs do when they point out a slight double meaning or irony i think maynard's main meaning is probably that whatever you believe to be a divine force whether it be a god or mother nature is 'gonna fix it all soon' on some sort of day of judgement it's a kind of ' you'll see' or ' i told you so moment' almost like a kid; [which i think this has a connection with my next point] but however far away from maynard's orginal idea as it probably is i like to stick to my original thought that the irony and second part to the double meaning is that he is pointing out his, [maybe] own childlike  weakness; he's as stuck as the rest and is at a loss as to how to fix the world and deep down longs for his'mom' god or whatever to save him and sort it all out becuase he finds it all too much to cope with. i find this part quite funny in a way cos i think it shows that he has the ability to luagh at himself and as he does this, he also has one up on all these dysnfunctional celebrities, despite his weaknesses.  and as he says at the end of the song don't just call me pessimist try and read between the lines , he urges everyone else to stop being so intense and be able to realise where they're going wrong and stop being so quick to call tool's songs dire and pessimistic understand that he wants to change society for the better. i think the mom thing and him admitting to his weaknesses is shown further in the 'i can't imagine why you wouldn't welcome any change..My friend' here he's saying i'm not judging you i'm relating with you, the difference is i see the way society is and know it isn't right , i won't be complacent becuase i know this needs to change, and surely you see it too so for god's sake lets stop judging and placing blame and admit our problems get back to what really matters. i also think the 3 ring circus sideshow of freaks could be a metaphor for the vicious circle we adesperately need to escape from and  get are buts down to arizona bay lol or find peace of mind - and what,  in the real scheme of things matter. he want's us all to think about this, he doesn't belive we can change L.A and and what modern society has become alone, but he does think we should be able to recognise are problems and admit we need to change, only then will we see the fake  hate breeding and bullshit society we have made disapear and i completely agree, we need to flush away the unimportant 'shit' [enema imagery ] that consumes us and the society  that makes us so unhappy. i really can't ellaborate on this anymore one cos it's too long allready two cos im real tired and  3 becuase i've run dry of ideas. i'm probably wong and reading into things to much lol but i'd like to know what others think about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nshit it's long lol. god once i start i just don't know when to shut it do?! if anyone does attempt to read it i'd really appreciate some feed back. thanks if u do read it . sorry its long. oops\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nOkay, I don't think anyone has said this yet, but \"anima\" is the Jungian term for the female side of a man's psychology; it is considered to be the depths of a man's true wisdom, just as the \"animus\" is to a woman. Therefore, an aspect of this song is wishing for the release of the anima wisdom--for \"mom\" to fix this world. Also, as many others have said, there is much anger towards the world in this song, no matter how you want to word it. The line \"learn to swim\" could also be interpreted to mean that one should learn to navigate the depths of their psyche, which is where the anima comes from...I believe \"anima\" is used here because this is a very patriarchal society. Any extreme needs to understand its opposite...\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\ni hate bands like tool who seems to always have complains about everything... i mean.. who gives a fuck... we all got problems.. live with it.. its not like your the only one suffering... fuck tool!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nThis is one of the easier to understand songs by Tool. It explains how fucked up today's society is, from politicians to religion to Hollywood, he points out all the things wrong with our world. This song details the apocalypse, and how Maynard is looking forward to watching all this shit crumble.\n\r\nLearn to swim.\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nHey blameless, he's not pointing out in dividual things that he has problems with. He's come to the decision that everything is so fucked up we should start over. Read the fucking lyrics you retard.\n\r\nAnd Jewcifer...you're correct, he was named after a condiment...\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nfuck all you gun-toting hip ganster wannabes. genius. \r\nsimply put the cleansing of LA. moms gonna make it all better soon. mother nature tends to make things work out in the end. like with all the other natural disasters happening in the world today. it's only a matter of time before LA gets wiped out. Cleaning the filth of the world. all the fakes and posers. and all the gun-toting hip gangster wannabes. it's comin soon. and maybe not just for LA. Learn To Swim\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nHey Jewcifer, i hate to rebute but god damnit stop being a  fucking ass hole. This site is for your interpratation of selected songs, not a page dedicated to bashing others. Jesus, just because someone has puts a little more effort into thinking, and actually going outside the realm, doesnt mean you have to bash him. Damnit, its people like you that Manyard depicts in this song, the people who have nothing to cling to but putting others down. I hope you step outside yourself one day and realize what the hell your doing, because its just childless. To add my input to the song: dont worry about the little things in life because your just going to die (condensed interpretation).\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nhey jewcifer, what are bitchin about.. mad that i insulted your favorite band? what? you somekind of groupie? bitch! and spatterartist, just because you can read doesnt mean your less of retard than me.. the worlds fuck up because of people who think it is.. filling our minds with bullshit just because theyre own lives are so fuck up... and if your life's like that... then im happy for you... retard!\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nThis is awesome. Not sure on the meaning, but I swear, the first time I heard this, all I could hear in that first part was Maynerd sayin \"Fuck\" over and over again. I found that funny. Awesome but funny\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nSometimes when I look around me, to all the idiots in the world (including me :p ); the many shallow and egocentric people at my school, people making money out of the suffering of others, people killing eachother for stupid ideals,... At times like those I just can't wait to see a giant meteor fall from the sky and whipe out mankind...\n\r\nSo when I firs heard this song I thought it was pretty cool...\n\r\nNow please don't think I'm one of those people who is constantly awaiting the end of the world, I'd piss my pants if I heard a giant meteor was about to collide whit earth :p\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nDouble post!\r\nHow do I type that weir A/E letter?\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nI think Savana or however you spell it (take note that im browsing from a cell phone!) lol so yea, i dont always remember the names..Anyway, i think Savana nailed the meaning. It's been said like 523549 times but i'll say it again..Maynard= a lyrical genious.\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nHahaha, some of you people's interpretations are halariously stupid.\n\r\nThis song is based on Bill Hicks rant about L.A., about how horrible L.A. is\r\nand how everyone there is a dipshit.\n\r\nIn the song, when he says L.A. he doesn't just mean L.A. he means all\r\ndipshits and fools that do nothing to help society, he's speaking\r\nmetaphorically.\n\r\nThis is not about the end of the world, he just talks about the end of the\r\nworld in the song and states that he hopes it is soon because he wants a\r\nvacation from all this stupid shit.\n\r\nThe \"fret for your\" section is pretty obvious, it's about how people fret\r\nover silly unimportant things when there are bigger things to worry about.\n\r\nHe calls L.A. \"one great big festering neon distraction\" and tells the\r\npeople that live there to \"learn to swim\".   He doesn't accually want\r\neveryone to learn to swim of course, by that he means people should learn to\r\nopen their eyes and start thinking for themselves.  Stop being one of the\r\nparasites that frequent L.A.\n\r\nAs for the \"mom's gonna fix it all soon\" part, i'm not sure what that means.  I think the guy a few posts above me is onto something, maybe it's about how Maynard feels helpless, like a child perhaps, because he sees no way to fix the problem.  That seems the best explanation for that.\n\r\n\"Don't just call me pessimist\r\nTry and read between the lines \"\n\r\nThose lines could mean not to call him a pessimist because he thinks everyone in L.A. is a dipshit, and to read between the lines and realize that when he says L.A. he was being metaphorical.  But i don't think so, it seems to simple an explanation.  I'm not really sure what these lines mean.\n\r\nAs for the \"i cannot imagine why you would not welcome any change\", maybe that means Maynard cannot imagine why the residents of L.A. would not welcome any change, because of how bad it is right now.  He cannot imagine why they do not \"learn to swim\", or support flushing it all away.  Something like that.\n\r\nSo, basically this song is about all the stupid human parasites that clog up our society, and how Maynard wants to flush them all away.\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nThis song has to do with how the sinners in LA are bringing forth the same thing that happened to Atlantis. California is going to sink in a terrible earthquake, this being \"gods\" wrath because of the stupid things people there do. 'Arizona Bay' did no one catch on, look at the picture inside of the album, behind the cd, there's a picture of california dissappearing and flooding. When california sinks and the people there get whats coming, it'll be forgotten and simply named Arizona Bay, because Arizona borders California. Another aspect is people think that 'mommy' is going to fix everything for you, he's telling you that if you don't want to die, do something about it. Flushing them all away, the ocean will do that when the state sinks below the waterline. He then tells you that if you were smart you'd be learning how to swim so atleast then you'll have a better chance at surviving. This is a message to Californians explaining to them why their world is going to end in a most horrid, auful, bloody fashion. Thank you.\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nLooking at the moms gonna fix it all soon, I was wrong, mom is Mother Nature, and shes going to fix the worlds problem by putting all back the way it ought to be (underwater) \n\r\nand about the whole part where he's like fuck L. Ron Hubbard and fuck all his clones and all of that, i think that those are the people he personally blames for fucking up a beautiful place, and bringing down their judgement day which is going to come \"any fucking time, any fucking day\" so theres some more to think about\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nhey this song isnt about the end of the world, its from a stand up(cant quite put my finger on the name) but its from one of his bits about L.A being one of the shittyest crummy places hes seen and in the joke he was talking about blowing it out of existance hence the phrase \"Arizona Bay\", Maynard agreed with the bit and made a song about it\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nMy interpretation I made and posted on my \"MySpace\" page and the Group that I moderate \"MUSeTalk  QuanteSUM\"\r\nLINK:  \"   groups.myspace.com/…   \"\n\r\nMy understanding of this is thus:\n\r\nSOME SAY THE END IS NEAR.\r\nSOME SAY WE'LL SEE ARMAGEDDON SOON.\r\nI CERTAINLY HOPE WE WILL.\r\nI SURE COULD USE A VACATION FROM THIS\n\r\nThe fact that people think the end is near, says that it is in the air, so to speak, which is like the scientific experiment that is thus: Scientists took two groups of people, one that did a cross word before anyone else has seen it, and the other group had a crossword that had been out for like a week or so... the group that had the crossword that had been out for some time, did markedly better... something around 20 or so percent better if my memory serves me. Anyway the correlation between the two is that since people are thinking about the end, it means that they are getting ready for it, and if people are ready for it then theirs a much better result for the outcome, and since there are people in the world that are ready, they can share their readiness through the unconscious as well as the conscious when the time comes. And having that god loves us it goes right along that he'd want us to do well.\r\n\"I certainly hope we will\", the way I see it is that he hopes that the outcome of armageddon is that we \"will\" ourselves, or in other words our future is based on our collective will.\r\n\"I sure could use a vacation from this\", I believe means that our end of the world will be in our \"will\" for what types of vacations (dreams) we wish to go on together and then come back to this \"base\" world to commune further in our heaven... this is my ideal for heaven; a world of Love, Peace and prosperity where we enjoy each others company and communion as well as, as a sort of collective, go on dreams with friends that spark our passion or some such and then come back to this base world of heaven and share our memories and our selves in a serene atmosphere.\n\r\nBULLSHIT THREE RING CIRCUS SIDESHOW OF\r\nFREAKS\n\r\nI think he's just saying that he thinks that the people before the end of the world are all freaks because there is nothing to hold any one group of heresayers together from another group, so theirfore they're all freaks to each other. Or at least it can be seen this way to some people. An further perhaps \"three ring\" has some innate symbology from god that refers to the God Head, or the Trinity. And perhaps he thinks its bullshit because it is like a mixed up circus instead of a serene unity.\n\r\nHERE IN THIS HOPELESS FUCKING HOLE WE CALL LA\r\nTHE ONLY WAY TO FIX IT IS TO FLUSH IT ALL AWAY.\r\nANY FUCKING TIME. ANY FUCKING DAY.\r\nLEARN TO SWIM, I'LL SEE YOU DOWN IN ARIZONA BAY.\n\r\nIn my eyes this says the following; first of all \"LA\" stands for \"Loving Ascension\", and then from the start... \"Here in this hopeless fucking hole we call LA\" means to me that the people of \"Loving Ascension\" have no hope, or hardly any hope (ie. hope*less*), because they have such adamant spiritual feelings or the such. \"fucking hole\" I believe refers to those that are in the \"unknown\", compared with other people, (the hole, or black hole if you will) and having the adamant spiritual feelings of Love that they have they are in bliss and are also in LA, \"Loving Ascension\", without any feelings of unneeded hope, or with the mindsets of not using hope as part of their being.\r\nFurther one of the meanings of \"flush\" is thus; \"The period of greatest prosperity or productivity\" (as can be seen if you search for \"prosperity\" with your find tool on the \"dictionary.com search result for flush\".\r\nArizona Bay = [Ar]=Air (The Openness), [i]=Self, [zon]=Zone, [a]=A, [B]=Being, [ay]=Ascension (and further from my understanding of the propensities of the alphabet, the 'y' means \"what self?\" ---- so \"Arizona Bay\" means in my eyes: \"The openness of the self zone, of ascension for the Being of Ascending What Self?\" -- and to \"Learn to Swim\" makes it so your breathing air and seeing the possibilities instead of below the water where you'll be stuck in the cycle of birth and death and re-birth and in a sense unconscious, much like an animal.\n\r\nFRET FOR YOUR FIGURE AND\r\nFRET FOR YOUR LATTE AND\r\nFRET FOR YOUR HAIRPIECE AND\r\nFRET FOR YOUR LAWSUIT AND\r\nFRET FOR YOUR PROZAC AND\r\nFRET FOR YOUR PILOT AND\r\nFRET FOR YOUR CONTRACT AND\r\nFRET FOR YOUR CAR.\n\r\nWhy to fret for the following (first lets look at fret, the most powerful understanding I can gather is that of what's on stringed instruments such as guitars, that of the small metal bars across the fingerboard and when the string is stopped by a finger at the metal bar it will produce a note of the desired pitch... so all this fretting that \"Maynard - The vocals to the band tool that made this song\" is reffering to here is just asking you to make the desired pitch of tone for all the following; [figure] your body and how you want to look, [latte] your taste and what you'd like to do in your spare time (is what I think it's referring to, because eating is much of what we do in our spare time in the current reality... and also the tastes that we have for fun and the like), [hairpiece] don't forget the finer details!, [lawsuit] what sort of makeup do we want of the new world?-what universal laws?, [prozac] How do we want to show our sympathy?, [pilot] what do we want our heart(s} to made up of-our sort of innerpilot?, [contract] What sort of stories do we wish to !dive! into?, [car] and from former \"!dive!\", how do we want to transition into the stories?\n\r\nIT'S A\r\nBULLSHIT THREE RING CIRCUS SIDESHOW OF\r\nFREAKS\n\r\nI think he's saying it again, to let us think about the people that didn't make it, and what sort of levels of differences and similarities we want in each of our \"heavens'\"\n\r\nHERE IN THIS HOPELESS FUCKING HOLE WE CALL LA\r\nTHE ONLY WAY TO FIX IT IS TO FLUSH IT ALL AWAY.\r\nANY FUCKING TIME. ANY FUCKING DAY.\r\nLEARN TO SWIM, I'LL SEE YOU DOWN IN ARIZONA BAY.\n\r\n\"Here in heaven, their is no hope, we're in bliss in our Loving Ascending Spiral - hope is unwanted\"\r\n...\n\r\nSOME SAY A COMET WILL FALL FROM THE SKY.\r\nFOLLOWED BY METEOR SHOWERS AND TIDAL WAVES.\r\nFOLLOWED BY FAULTLINES THAT CANNOT SIT STILL.\r\nFOLLOWED BY MILLIONS OF DUMBFOUNDED DIPSHITS.\n\r\nI hear this in my reality as \"Sum say a comic book !fall from the sky!\" (as in sum or someone wants a comic book, a beautiful story to live, to fall from the sky\" - Then \"Followed by meteor showers and tidal waves\" I see as [Followed by meet eyour showers (as in meet the essence of your) as in \"see who you are... what your made of and such\" and tidal waves [and Tie'd all waves (as in we all reached here in a tie and we see waves of this.. the beings that made it to your now)] - Then \"Followed by faultlines that cannot sit still\" I see as [Followed by people realizing who's at fault, me you everybody and how... and the fault should go down in lines, as in I'm here because my parents loved me the way they did, and they gave birth to me, and their parent gave birth to them and so they have fault in my being as well, as well as the people around me had something to do with the way I am... or whatever and etc...] - Then \"Followed by millions of dumbfounded dipshits\" I see as [The tons of people that do not have any sort of spiritual path, will be dumbfounded because they were oblivious to enlightenment.. and yes they will be dipshits in varying degrees... but that doesn't mean they can't be helped, it just means they were oblivious before (or dumb or foolish as dipshits suggests)\n\r\nSOME SAY THE END IS NEAR.\r\nSOME SAY WE'LL SEE ARMAGEDDON SOON.\r\nI CERTAINLY HOPE WE WILL CUZ\r\nI SURE COULD USE A VACATION FROM THIS\n\r\nMaybe because of all the poeple that aren't in the same level of reality, that he is, makes him say this again for the song.\r\n...\n\r\nSTUPID SHIT, SILLY SHIT...\n\r\nI believe he says this because seeing the people that aren't where he's at, past the mundane I guess, makes him think of how stupid it used to be and how silly it was some times, and again this is in varying degree's.\r\n...\n\r\nONE GREAT BIG FESTERING NEON DISTRACTION,\r\nI'VE A SUGGESTION TO KEEP YOU ALL OCCUPIED.\n\r\nand further he thinks that the, old, \"neon distraction\" is festering and people are getting tired of it.. so he has a suggestion...\r\n...\n\r\nLEARN TO SWIM.\n\r\nLearn to keep you head above the water of the cycle of unconscious animal like consciousness to be in the *open* air of possibility\n\r\nMOM'S GONNA FIX IT ALL SOON.\r\nMOM'S COMIN' ROUND TO PUT IT BACK THE WAY IT OUGHT TO BE.\n\r\nMom's are more of nurturer's compared to the teachetive aspect of the dad, and I know I feel like a nurturing reality in place of this, more of a teachative reality we have at this moment\n\r\nLEARN TO SWIM.\n\r\nYou still need to do stuff for yourself... Love and be open.\n\r\nFUCK L RON HUBBARD AND\r\nFUCK ALL HIS CLONES.\r\nFUCK ALL THOSE GUN-TOTING\r\nHIP GANGSTER WANNABES.\n\r\nL Ron Hubbard is the founder of \"The Church of Scientology\" (i don't know about Scientology except that it looks like it has science in the name and theirfore I might know something of it from science) - but anyway I feel Maynard is saying here that he wants them to be healed\n\r\nLEARN TO SWIM.\n\r\n...\n\r\nFUCK RETRO ANYTHING.\r\nFUCK YOUR TATTOOS.\r\nFUCK ALL YOU JUNKIES AND\r\nFUCK YOUR SHORT MEMORY.\n\r\nKeep in mind the stuff you like and open your mind to liking other stuff as well... such as retro and tattoos. - and further heal the junkies and short memories\n\r\nLEARN TO SWIM.\n\r\n...\n\r\nFUCK SMILEY GLAD-HANDS\r\nWITH HIDDEN AGENDAS.\r\nFUCK THESE DYSFUNCTIONAL,\r\nINSECURE ACTRESSES.\n\r\nHeal. Heal.\n\r\nLEARN TO SWIM.\n\r\n...\n\r\nCUZ I'M PRAYING FOR RAIN\r\nAND I'M PRAYING FOR TIDAL WAVES\r\nI WANNA SEE THE GROUND GIVE WAY.\r\nI WANNA WATCH IT ALL GO DOWN.\r\nMOM PLEASE FLUSH IT ALL AWAY.\r\nI WANNA WATCH IT GO RIGHT IN AND DOWN.\r\nI WANNA WATCH IT GO RIGHT IN.\r\nWATCH YOU FLUSH IT ALL AWAY.\n\r\nHe wants rain.. which I believe symbolizes the process... the process of the end of the world, or in other words armageddon. - Praying for tie'd all waves... waves of people that reached where your at (heaven, dewachen, utopia, etc...) - \"Wants the ground to give way\"... I see it as he wants the world to \"nurture\" and \"magically\" help us. \"wanna watch it all go down\"... wants to see it all go down (down is symbolic of form for humans I believe) so I want to see it all go into form. - \"Mom please flush it all a way\".. Mom please take us to the *period of greatest prosperity or productivity*, in a way. - ...\n\r\nTIME TO BRING IT DOWN AGAIN.\r\nDON'T JUST CALL ME PESSIMIST.\r\nTRY AND READ BETWEEN THE LINES.\n\r\nTime to = \"(t)ruthful (o)bjectivity !bring it down again! - \"bring it down again\" = god bring down the spirit! :) Amen \r\nread between the lines (Conclude by reasoning; in logic)\n\r\nI CAN'T IMAGINE WHY YOU WOULDN'T\r\nWELCOME ANY CHANGE, MY FRIEND.\n\r\nChange is a miracle its imaginative... and so is the remembrence -- my friend\n\r\nI WANNA SEE IT ALL COME DOWN.\r\nSUCK IT DOWN.\r\nFLUSH IT DOWN.\r\nI believe we'll see it form, -- bring it into your form -- period of greatest prosperity-productivity [it]= \"self\" \"truth\" form\r\n(open yourself to your meaning, your perfection, your fantasies, your wishes of beautiful communion - be enlightened -> follow the path of yours)\n\n\n\r\nwith Love,\n\r\nGijera (Evan)\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nMy interpretation I made and posted on my \"MySpace\" page and the Group that I moderate \"MUSeTalk  QuanteSUM\"\r\nLINK:  \"   groups.myspace.com/…   \"\n\r\nMy understanding of this is thus:\n\r\nSOME SAY THE END IS NEAR.\r\nSOME SAY WE'LL SEE ARMAGEDDON SOON.\r\nI CERTAINLY HOPE WE WILL.\r\nI SURE COULD USE A VACATION FROM THIS\n\r\nThe fact that people think the end is near, says that it is in the air, so to speak, which is like the scientific experiment that is thus: Scientists took two groups of people, one that did a cross word before anyone else has seen it, and the other group had a crossword that had been out for like a week or so... the group that had the crossword that had been out for some time, did markedly better... something around 20 or so percent better if my memory serves me. Anyway the correlation between the two is that since people are thinking about the end, it means that they are getting ready for it, and if people are ready for it then theirs a much better result for the outcome, and since there are people in the world that are ready, they can share their readiness through the unconscious as well as the conscious when the time comes. And having that god loves us it goes right along that he'd want us to do well.\r\n\"I certainly hope we will\", the way I see it is that he hopes that the outcome of armageddon is that we \"will\" ourselves, or in other words our future is based on our collective will.\r\n\"I sure could use a vacation from this\", I believe means that our end of the world will be in our \"will\" for what types of vacations (dreams) we wish to go on together and then come back to this \"base\" world to commune further in our heaven... this is my ideal for heaven; a world of Love, Peace and prosperity where we enjoy each others company and communion as well as, as a sort of collective, go on dreams with friends that spark our passion or some such and then come back to this base world of heaven and share our memories and our selves in a serene atmosphere.\n\r\nBULLSHIT THREE RING CIRCUS SIDESHOW OF\r\nFREAKS\n\r\nI think he's just saying that he thinks that the people before the end of the world are all freaks because there is nothing to hold any one group of heresayers together from another group, so theirfore they're all freaks to each other. Or at least it can be seen this way to some people. An further perhaps \"three ring\" has some innate symbology from god that refers to the God Head, or the Trinity. And perhaps he thinks its bullshit because it is like a mixed up circus instead of a serene unity.\n\r\nHERE IN THIS HOPELESS FUCKING HOLE WE CALL LA\r\nTHE ONLY WAY TO FIX IT IS TO FLUSH IT ALL AWAY.\r\nANY FUCKING TIME. ANY FUCKING DAY.\r\nLEARN TO SWIM, I'LL SEE YOU DOWN IN ARIZONA BAY.\n\r\nIn my eyes this says the following; first of all \"LA\" stands for \"Loving Ascension\", and then from the start... \"Here in this hopeless fucking hole we call LA\" means to me that the people of \"Loving Ascension\" have no hope, or hardly any hope (ie. hope*less*), because they have such adamant spiritual feelings or the such. \"fucking hole\" I believe refers to those that are in the \"unknown\", compared with other people, (the hole, or black hole if you will) and having the adamant spiritual feelings of Love that they have they are in bliss and are also in LA, \"Loving Ascension\", without any feelings of unneeded hope, or with the mindsets of not using hope as part of their being.\r\nFurther one of the meanings of \"flush\" is thus; \"The period of greatest prosperity or productivity\" (as can be seen if you search for \"prosperity\" with your find tool on the \"dictionary.com search result for flush\".\r\nArizona Bay = [Ar]=Air (The Openness), [i]=Self, [zon]=Zone, [a]=A, [B]=Being, [ay]=Ascension (and further from my understanding of the propensities of the alphabet, the 'y' means \"what self?\" ---- so \"Arizona Bay\" means in my eyes: \"The openness of the self zone, of ascension for the Being of Ascending What Self?\" -- and to \"Learn to Swim\" makes it so your breathing air and seeing the possibilities instead of below the water where you'll be stuck in the cycle of birth and death and re-birth and in a sense unconscious, much like an animal.\n\r\nFRET FOR YOUR FIGURE AND\r\nFRET FOR YOUR LATTE AND\r\nFRET FOR YOUR HAIRPIECE AND\r\nFRET FOR YOUR LAWSUIT AND\r\nFRET FOR YOUR PROZAC AND\r\nFRET FOR YOUR PILOT AND\r\nFRET FOR YOUR CONTRACT AND\r\nFRET FOR YOUR CAR.\n\r\nWhy to fret for the following (first lets look at fret, the most powerful understanding I can gather is that of what's on stringed instruments such as guitars, that of the small metal bars across the fingerboard and when the string is stopped by a finger at the metal bar it will produce a note of the desired pitch... so all this fretting that \"Maynard - The vocals to the band tool that made this song\" is reffering to here is just asking you to make the desired pitch of tone for all the following; [figure] your body and how you want to look, [latte] your taste and what you'd like to do in your spare time (is what I think it's referring to, because eating is much of what we do in our spare time in the current reality... and also the tastes that we have for fun and the like), [hairpiece] don't forget the finer details!, [lawsuit] what sort of makeup do we want of the new world?-what universal laws?, [prozac] How do we want to show our sympathy?, [pilot] what do we want our heart(s} to made up of-our sort of innerpilot?, [contract] What sort of stories do we wish to !dive! into?, [car] and from former \"!dive!\", how do we want to transition into the stories?\n\r\nIT'S A\r\nBULLSHIT THREE RING CIRCUS SIDESHOW OF\r\nFREAKS\n\r\nI think he's saying it again, to let us think about the people that didn't make it, and what sort of levels of differences and similarities we want in each of our \"heavens'\"\n\r\nHERE IN THIS HOPELESS FUCKING HOLE WE CALL LA\r\nTHE ONLY WAY TO FIX IT IS TO FLUSH IT ALL AWAY.\r\nANY FUCKING TIME. ANY FUCKING DAY.\r\nLEARN TO SWIM, I'LL SEE YOU DOWN IN ARIZONA BAY.\n\r\n\"Here in heaven, their is no hope, we're in bliss in our Loving Ascending Spiral - hope is unwanted\"\r\n...\n\r\nSOME SAY A COMET WILL FALL FROM THE SKY.\r\nFOLLOWED BY METEOR SHOWERS AND TIDAL WAVES.\r\nFOLLOWED BY FAULTLINES THAT CANNOT SIT STILL.\r\nFOLLOWED BY MILLIONS OF DUMBFOUNDED DIPSHITS.\n\r\nI hear this in my reality as \"Sum say a comic book !fall from the sky!\" (as in sum or someone wants a comic book, a beautiful story to live, to fall from the sky\" - Then \"Followed by meteor showers and tidal waves\" I see as [Followed by meet eyour showers (as in meet the essence of your) as in \"see who you are... what your made of and such\" and tidal waves [and Tie'd all waves (as in we all reached here in a tie and we see waves of this.. the beings that made it to your now)] - Then \"Followed by faultlines that cannot sit still\" I see as [Followed by people realizing who's at fault, me you everybody and how... and the fault should go down in lines, as in I'm here because my parents loved me the way they did, and they gave birth to me, and their parent gave birth to them and so they have fault in my being as well, as well as the people around me had something to do with the way I am... or whatever and etc...] - Then \"Followed by millions of dumbfounded dipshits\" I see as [The tons of people that do not have any sort of spiritual path, will be dumbfounded because they were oblivious to enlightenment.. and yes they will be dipshits in varying degrees... but that doesn't mean they can't be helped, it just means they were oblivious before (or dumb or foolish as dipshits suggests)\n\r\nSOME SAY THE END IS NEAR.\r\nSOME SAY WE'LL SEE ARMAGEDDON SOON.\r\nI CERTAINLY HOPE WE WILL CUZ\r\nI SURE COULD USE A VACATION FROM THIS\n\r\nMaybe because of all the poeple that aren't in the same level of reality, that he is, makes him say this again for the song.\r\n...\n\r\nSTUPID SHIT, SILLY SHIT...\n\r\nI believe he says this because seeing the people that aren't where he's at, past the mundane I guess, makes him think of how stupid it used to be and how silly it was some times, and again this is in varying degree's.\r\n...\n\r\nONE GREAT BIG FESTERING NEON DISTRACTION,\r\nI'VE A SUGGESTION TO KEEP YOU ALL OCCUPIED.\n\r\nand further he thinks that the, old, \"neon distraction\" is festering and people are getting tired of it.. so he has a suggestion...\r\n...\n\r\nLEARN TO SWIM.\n\r\nLearn to keep you head above the water of the cycle of unconscious animal like consciousness to be in the *open* air of possibility\n\r\nMOM'S GONNA FIX IT ALL SOON.\r\nMOM'S COMIN' ROUND TO PUT IT BACK THE WAY IT OUGHT TO BE.\n\r\nMom's are more of nurturer's compared to the teachetive aspect of the dad, and I know I feel like a nurturing reality in place of this, more of a teachative reality we have at this moment\n\r\nLEARN TO SWIM.\n\r\nYou still need to do stuff for yourself... Love and be open.\n\r\nFUCK L RON HUBBARD AND\r\nFUCK ALL HIS CLONES.\r\nFUCK ALL THOSE GUN-TOTING\r\nHIP GANGSTER WANNABES.\n\r\nL Ron Hubbard is the founder of \"The Church of Scientology\" (i don't know about Scientology except that it looks like it has science in the name and theirfore I might know something of it from science) - but anyway I feel Maynard is saying here that he wants them to be healed\n\r\nLEARN TO SWIM.\n\r\n...\n\r\nFUCK RETRO ANYTHING.\r\nFUCK YOUR TATTOOS.\r\nFUCK ALL YOU JUNKIES AND\r\nFUCK YOUR SHORT MEMORY.\n\r\nKeep in mind the stuff you like and open your mind to liking other stuff as well... such as retro and tattoos. - and further heal the junkies and short memories\n\r\nLEARN TO SWIM.\n\r\n...\n\r\nFUCK SMILEY GLAD-HANDS\r\nWITH HIDDEN AGENDAS.\r\nFUCK THESE DYSFUNCTIONAL,\r\nINSECURE ACTRESSES.\n\r\nHeal. Heal.\n\r\nLEARN TO SWIM.\n\r\n...\n\r\nCUZ I'M PRAYING FOR RAIN\r\nAND I'M PRAYING FOR TIDAL WAVES\r\nI WANNA SEE THE GROUND GIVE WAY.\r\nI WANNA WATCH IT ALL GO DOWN.\r\nMOM PLEASE FLUSH IT ALL AWAY.\r\nI WANNA WATCH IT GO RIGHT IN AND DOWN.\r\nI WANNA WATCH IT GO RIGHT IN.\r\nWATCH YOU FLUSH IT ALL AWAY.\n\r\nHe wants rain.. which I believe symbolizes the process... the process of the end of the world, or in other words armageddon. - Praying for tie'd all waves... waves of people that reached where your at (heaven, dewachen, utopia, etc...) - \"Wants the ground to give way\"... I see it as he wants the world to \"nurture\" and \"magically\" help us. \"wanna watch it all go down\"... wants to see it all go down (down is symbolic of form for humans I believe) so I want to see it all go into form. - \"Mom please flush it all a way\".. Mom please take us to the *period of greatest prosperity or productivity*, in a way. - ...\n\r\nTIME TO BRING IT DOWN AGAIN.\r\nDON'T JUST CALL ME PESSIMIST.\r\nTRY AND READ BETWEEN THE LINES.\n\r\nTime to = \"(t)ruthful (o)bjectivity !bring it down again! - \"bring it down again\" = god bring down the spirit! :) Amen \r\nread between the lines (Conclude by reasoning; in logic)\n\r\nI CAN'T IMAGINE WHY YOU WOULDN'T\r\nWELCOME ANY CHANGE, MY FRIEND.\n\r\nChange is a miracle its imaginative... and so is the remembrence -- my friend\n\r\nI WANNA SEE IT ALL COME DOWN.\r\nSUCK IT DOWN.\r\nFLUSH IT DOWN.\r\nI believe we'll see it form, -- bring it into your form -- period of greatest prosperity-productivity [it]= \"self\" \"truth\" form\r\n(open yourself to your meaning, your perfection, your fantasies, your wishes of beautiful communion - be enlightened -> follow the path of yours)\n\n\n\r\nwith Love,\n\r\nGijera (Evan)\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nwhy are your comments so f***ing long?  ok hes pissed at the world and the direction it is going in and is expressing it\r\nFUCK all those gun-toting hip gangster wannabes!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\ni love this song and i agree with maynard TO FUCK WITH LA\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\n'learn to swim' is to learn to be free; learn to navigate the sea. Free from what? Free from everything L.A. and 'Sunny' California represents; all the things that society define as being 'fun' and 'hip' - 'the gangsta wannabes' and 'hairpins' etc. \r\nIts interesting that he 'prays' at the end though; Maynard guy isn't very religious yea? Coupled with the fact that he starts appealing a 'mom' for help... conveys a real sense of weakness. Also, he's pleading the audience to not regard him as a pessimist and to read between the lines. Simply said, he's aware of the fact that his argument is futile. \r\nEveryone yearns for the machine; you can try raging at it all you want, but you're just gna end up putting a dent on it, den repairing it all over again. \r\nUnless of course, armageddon comes! Den we can all just chill and watch all the shit that is ourselves wash away.\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nI LOVE THIS SHIT\r\nsaying this is an amazing song straight up doesnt do it justice\r\nan easy way to tell is this is the only song where people arent argueing over every part of it\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nOne minor point about this tune. Couldn't see it mentioned exactly elsewhere, but then I've not read all 7 pages!\n\r\nThe Song obviously has a major Bill Hicks feel to it, as people have said. What I've not seen mentioned is the explicit link mentioning Arizona Bay creates with Hicks. Arizona Bay, of course, being one of Hick's live performance albums amazon.com/gp/product/B0000009QH/sr=8-1/qid=1146248162/ref=pd_bbs_1/…\n\n\n", "comment_302": "\nif I had to chose a Fav Tool song... this one would have to be it!\r\nsuch a good song...\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nYep definately about Bill Hicks' disliking for L.A. Maynard was good friends with Bill before he died of pancreatic cancer in 1994.\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nFor those of you who ever paid attention in history class, no civilization can live on forever. Every single civilization in all of the worlds known history has died off to make room for the next.\r\nThis song isn't just about the end of the world. It's about Maynard wishing the end of this civilization would come sooner because there's too many stupid people.\r\nPlain and simple.\r\nAnd yes, I love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\n\\\"i don\\'t know about Scientology except that it looks like it has science in the name and theirfore I might know something of it from science\\\"\n\r\nEh, Gijera, dude...no offense, because it looks like you put a lot of thought into your post, but...it really doesn\\'t say much for your explanation of the song when you explain something you admittedly don\\'t know with a random assumption (and an extremely wrong one at that).  In any case, as for the rest of your post....let\\'s just say I like a lot of the other explanations posted here better.\n\r\nIn any case, I used to think Tool was just for stoners who enjoyed wearing black all the time.  Then I decided to give \\'em a serious listen and open my mind, and was blown away.  Tool is amazing.  This song\\'s undoubtedly my favorite of \\'em all.\t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\ni agree with maynard\n\r\nthose people (rappers, goths, skaters, punks, potheads, scientologists, preps, racists, arrogant celebrities, people that are superficial, etc.) suck\t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nThis is nearly eclusively based upon Bill Hicks. Many of these lyrics are directly lifted from thinks that he has said - \"learn to swim\" was a comment Bill Hicks made, as was the whole \"wiping LA off the face of the planet\" idea. I honestly don't think there's a hidden meaning to this song - this is one of the rare songs that is easy to understand\t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\nAlso, Maynard did some stand-up comedy, opening for Bill Hicks and there's a big pic of him in the inlay cover saying \"another dead hero\". Apparently, according to reports, Maynard was VERY talented at comedy. Just another string to his bow!!\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nThis song is about the decadence of society and the inevitable decline that comes from it.\n\r\nMom *is* mother nature.  She is coming round to put it back the way it oughta be, with a comet that falls from the sky, followed by meteor-showers and tidal waves, followed by faultlines that cannot sit still, followed by millions of dumbfounded dipshits.\n\r\nMaynard is saying that all the extravagences of modern society have made us forgetful of that which is really important.\n\r\nSurvival.\r\nCommunity.\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\nhmm i didnt think about that, when it says learn to swim, i always just thought it meant to learn to live without depending on the vainities of life, but it also tells about this prophetic weather changing in 2012 that will put LA under water (learn to swim).\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\nI haven't gone through all of the comments, so I apologize if this has been said before~  \n\r\nAs with several songs by Maynard, this one uses Biblical references to point out current problems and trends.  In the beginning of these comments, it was said that this was apocalyptic.  Yes, in ways, but it is paralleling Genesis with the Great Flood.  God saw how awful the humans had become, so he decided to \"wash it all away,\" only in this song it is \"mother,\" which I think is refering to Mother earth.  Because of humanity's raping of nature, she is going to heal herself, but the only way to do that is to get rid of the problem.\n\r\nThe reason I absolutely love this song is the irreverant mantra \"learn to swim\"- as though that would help any- Maynard has quite the knack for combining bitter irony with angst.\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nThis song is about how absolutely everything we do is complete bullshit. It's expressing exostentialism and questioning society itself.\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nFuck L. Ron Hubbard and fuck all his clones\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nI particullary like the last 20 sec of the song in native american style, as they are performing the rain dance... Freakin funny,,,\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\n???WHAT???\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\n\" Maynard said on a live unreleased track\r\n\"Are any of you familiar with the work of Carl Jung, Psychologist? This song explores a more contemporary version of that psychotherapy method, involving high colonics.\" Right before AEnema.\"\n\r\nThat's indirectly what the entire album is about. Just break apart the title...Anima Enema. Anima is the soul according to Jungian Thoery, and Enema means cleansing or flushing. \n\r\n-------------\n\r\nNow - on the actual song, its pretty obvious its pure Bill Hicks inspired.\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\nawsome song, fuck it all. mother fucking posers. all u need to do is be your self man. tool rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nMaynard.....This songs meaning is pretty obvious....??? the rest is like a bibile, we could probably start several religions from this masterpiece of a CD. Anyway do not show up in a couple years and say its just a bunch of lyrics thrown together like abstract art, it may ruin religion as we know it at that time.\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nI'm surprised that scientologists didn't sue Maynard for telling off L. Ron Hubbard.\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nDon't give them any ideas.\t\t\t\t\n\t\t\t\t\n\n", "comment_321": "\nMankind does not have the superpower that he think he has to force the earth to do his bidding. Mother earth will reclaim what belongs to her by cleansing her dis-ease...mankind.\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nthe dont call me a pessimist part means dont think im just mean spirited, you did this to yourselves\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\nI happenes to agree with ____.  with her whole outlook on this song. I think you did a great job of explaing it all. I especiall like this part in what you were saying... \"i find this part quite funny in a way cos i think it shows that he has the ability to luagh at himself and as he does this, he also has one up on all these dysnfunctional celebrities, despite his weaknesses\"... I think this is great because it can also Pull in \"Hooker With a Penis\" also from the Aenima album. In \"Hooker With a Penis\" he says  ...\"All you know about me is what I've sold you, Dumb fuck\r\nI sold out long before you ever heard my name\"... and I believe that is him admitting the fact that yes he has sold out but in this next lyric he says...\"Well now I've got some Advice for you, little buddy Before you point the finger You should know that I'm the man\"... he's saying that he is still better than him because he can admitt it and that he only know what he has sold him. I just really feel that this shows how this whole album is all intertwined and how it all fits in together. Other than that I agree with what ____. said about Aenima.\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\nTool has a lot of in your face lyrics, but it also has some that takes some understanding or communication with others and that means listening to what others ideas are... granted at first glance (reading a book by its cover) the idea may be absurd or too religious or not fit the mold you wish to see.  yet it is still an opinion, if someone lists that jungian theory is relative, then perhaps instead of not acknowledging the opinion seek the truth yourself.  I believe when he says learn to swim he means exactly learn to swim, you sink or swim people learn by doing not watching others.  he is pointing out that LA presents something that all of us watch, he is calling us all fools for learning from watching and not doing.  he is also saying we dont need all the stupid shit everyone \"needs\" because others have one.  I had a thought last night, that you know i think memories are like posessions.  like you have an old screwdriver in your garage and it does the job, but for some reason you feel the need to get a new one, how often does the old one get used... yet we hang onto it.\r\nHe seems to want the world to end like me, how many of those stupid possessions are going to save you, at that moment its going to be survival time, you learn to swim for the first time... learning to deal without all your airconditioners and microwaves or fast food.  when the world is in such calamity people will have to hunt and rely on instinct, your fancy shirts and pants wont help then... so learn to swim, you dont have to jump in the deep end it will come to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\nI don't know if anyone's pointed this out yet cus i don't want to read 400 opinions but I'd be amazed if noone has pointed out the obvious connection to Bill Hicks. It mentions him in the album cover, and he often spoke of the shitness of (hell)A and how it would slide into the ocean like the turd city it is and be washed away 'leaving a cool beautiful serantiy, called, Arizona Bay'\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\nanti-materialism\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nBill Hicks. The inspiration behind the song, and the creator of Arizona Bay.\t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nThis song must have some reference to the messages the hopi tribe is trying to give. when maynard says mom he may be referring to what the hopi's call \"mother\"... like a god. when he sings about arizona bay it could be related to the fact that the hopi are from arizona.\n\r\nthis is a message from the hopi elders:\n\r\nTO MY FELLOW SWIMMERS:\n\r\nThere is a river flowing now very fast. It is so great and swift that there are those who will be afraid. They will try to hold on to the shore. They will feel they are being torn apart and will suffer greatly. Know the river has its destination. We must let go of the shore, push off into the middle of the river, keep our eyes open, and our heads above the water. And I say, see who is in there with you and celebrate. At this time in history, we are to take nothing personal, least of all ourselves. For the moment that we do, our spiritual growth and journey comes to a halt. The time of the lone wolf is over. Gather yourselves!\n\r\nBanish the word 'struggle' from your attitude and your vocabulary. All that we do now must be done in a sacred manner and in celebration.\n\r\nthis song has a lot of reference.\t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nsorry, stupid me. i should have said just mother as in mother earth. im really tired... also id like to add that the hopi prophecies were that like what maynard sang.\t\t\t\t\n\t\t\t\t\n\n", "comment_330": "\n\"Fuck L. Ron Hubbard\" FTW.\t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\nyeah 13 pages and someone finally pointed out that its based on bill hicks..as from what i read...most of this cd is ...granted its tool so theres normally dual meanings..but yeah..its based on a bill hicks skit\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nEven if this song was meant to show Maynard's hate for L.A., I think L.A. can be symbolic of any society with centralized Capitalism. Everybody from where I am from is so fixed on them and the shit they own that they dont realize that this is just one big \"Bullshit three ring circus sideshow.\" And i agree with maynard, the only way to fix is to flush it all away. The emptyness I feel whenever i heard this song reminds me of the same feeling I get whenever i watch Akira.\t\t\t\t\n\t\t\t\t\n\n", "comment_333": "\nI think the use of Ã\u0086 is cool... It's a scandinavian letter and I'm from Denmark. Well, to me, this song is about the apocalypse and how some people read the bible literally. They look for signs of the apocalypsein the bible  and draw parallels to events happening now.\t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nI think its funny how back when they toured after the Ã\u0086NEMA CD, sometimes, instead of saying \"freaks are in this hopeless fucking hole we call--LA--\" He would say the state they were in, EX: New York and he would say see you down in Pennsylvania Bay.\r\nVery Clevor\t\t\t\t\n\t\t\t\t\n\n", "comment_335": "\nI'm not sure if anyones put this yet but today when I was watching Julius Ceaser in my english class, I noticed that he wrote his name Julius CÃ\u0086SER, which is probably where TOOL got the whole Ã\u0086 thing, especially since one of their songs on the CD it Cesaro Summability.\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\ngood call charkie4tool i wud agree wit you how ever the line next to the e i ceasers name is alot mor avanced howerver the slash might just be a way that a printer could handle\t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\nI pretty much agree with what everyone else said about stupid LA and whatever. And even though I think this is their best song, and I love Tool with all my heart, i think they're being kinda hypocritical. Before you throw shit at me, i just bet that there's someone in the band who has one of those stupid fetishes like .. they can only eat the red M&ms or something like that. Maybe not. I hope not. But I wouldn't doubt it.\n\r\nAnyway, it's a kick ass song. Awesome music, awesome voice, awesome words.\t\t\t\t\n\t\t\t\t\n\n", "comment_338": "\n^WTF IS THIS DUDE TALKING ABOUT!!? he thinks there being hypocritical cuz he got a wild hair up his ass and  ASSUMED something...ahahahah and even if he assumed right......how is that being hypocritical?\t\t\t\t\n\t\t\t\t\n\n", "comment_339": "\nThis song is about a Bill Hicks peice saying Aenima means to \"flush the shit away\", I am acutally being a fool to tell you this...since as of this moment I have not seen the number myself.\t\t\t\t\n\t\t\t\t\n\n", "comment_340": "\nBecause of these lyrics I finaly found out why it has california dissapearing under the ocean inside the case.\r\nI think this song is about how mutch maynard hates how the world is manily ran by the media and he wants it to end by sinking LA.\t\t\t\t\n\t\t\t\t\n\n", "comment_341": "\nCharkie4Tool, the term Ã\u0086nema is actually more of a combination of 2 terms. The first being Enema (bowel cleansing using liquid) and anima, which essentially means soul. Hense the term Ã\u0086nema meaning soul or spiritual cleansing. The meaning was probably more directed towards the album title (Ã\u0086nima). The \"Ã\u0086\" doesnt really have anything to do with romans or Julius Caesar, it's just a way of combining the words. Good theory though.\t\t\t\t\n\t\t\t\t\n\n", "comment_342": "\n\"Don't just call me pessimist\r\nTry and read between the lines\"\n\r\nI think the vast majority of people are underestimating Maynard on this one. Right in the lyrics he's saying not to think of him as hating Los Angeles, but to think of what the true meaning of this song is.\n\r\nJust think for a second, would a song with the meaning so surfaced have taken Maynard, a genius, six months to write? Tool isn't even one of my top five favorite bands and I can say that Maynard is the best songwriter I've heard to date.\n\r\nI have no idea what the true meaning of this song is, but I refuse to believe it's as visible as Maynard's hate for Los Angeles.\t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nStay with me on this one and read up on Jungian psychology.\n\r\nI think L.A. is just symbollic for all the shit that people take it upon themselves to worry about and care about, when in reality it doesn't mean shit at all. New cars, sports, television, gambling, whatever your hobbies are, they're all fucking worthless. The time we spend doing that could be used to question societies uncontested \"rules\", better our own lives, and bettering the lives around us. If we all stopped getting distracted by stuff we deem important and focus ourselves on shit that really is important, the world could be beyond explanation.\n\r\nFlushing it all away is getting rid of all the distractions.\n\r\nJust my crazy ass interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_344": "\nWell there is a theory that california and shit will drift away from the us and blah blah people are gonna die, It's a theory tool and some of my close friends believe, and why the fuck should everyone waste there life away fretting over stupid shit like a latte.  This world is a bullshit circus of freaks really; bullshiting corporates and junkie freaks- i guess, even though most junkies aren't really freaks- obsessing over shit and making the world so dramatic...who wouldn't be excited for it all to wash away when california falls off?  I would welcome the change.\t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nI'm a huge failure fan, and I've been gettin' more into tool recently. For those unaware, Maynard \t\t\t\t\n\t\t\t\t\n\n", "comment_346": "\nI'm a huge failure fan, and I've been gettin' more into tool recently. For those unaware, Maynard \t\t\t\t\n\t\t\t\t\n\n", "comment_347": "\nI'm a huge failure fan, and I've been gettin' more into tool recently. For those unaware, Maynard loves failure lots. He is largely responsible for whatever success they had. APC covered the nurse who loved me. Etc.\n\r\nAnyway. This song musically and lyrically really reminds me of \"pro-catastrophe\" by failure... so much I am entirely certain it was the original source of inspiration to write aenima. I find that pretty amazing considering how this is arguably their most popular song ever. \n\r\nThis just goes to show how f'ed up it was that failure was as comercially unremarkable as they were.\n\r\nThe song meaning is more or less evident; it's about how backward things are, how out of synch humankind has become with nature and meaningful things... and how, we are all ultimately part of life, \"one\", no matter how we branch off, twist ourselves up and alienate ourselves. It will be righted by life sooner or later (e.g. all references to mom, to the prophecy that cali will shift underwater and stuff).\n\r\nI've always found it a little ironic that maynard passionately & obsessively hates anything religious (organized religion) and the concept of people who give up autonomy to have faith in a person or thing.... yet his whole personality is one of judgment, intolerance, arrogant confidence that he knows the truth of how things are \"supposed\" to be. If only he had the desire he would be a GREAT cult leader. ... which is probably why tool has been as successful (i.e. attracted crazy ass fans) as it has.\n\r\nYea... the profane and cynics are mirror images, created from the same logic... \r\nSo everything he is trying to accomplish with tool is ultimately unproductive (except perhaps personal catharsis).\t\t\t\t\n\t\t\t\t\n\n", "comment_348": "\nI agree with arethemad, Maynard is the best songwriter these days (ever in my opinion). But the other band members deserve credit as well. And I also agree that LA is proabaly just the major focus on all the shit these days, and when its flushed away we will have one less shit hole to worry about. By the way luckycharms19, its awesome that you were able to get those definitions. Very creative title for the album and track.\t\t\t\t\n\t\t\t\t\n\n", "comment_349": "\nim going to go see these guys in a few days, this song stands out to me as being one of thier best, lyrically and musically,,,hope they play it. or jambi\t\t\t\t\n\t\t\t\t\n\n", "comment_350": "\n/If/ the day after tomorrow /was/ a masterpeice, this song would feature.\t\t\t\t\n\t\t\t\t\n\n", "comment_351": "\nThis song alone got me into Tool. I shit you not.\t\t\t\t\n\t\t\t\t\n\n", "comment_352": "\nI read on wikipedia that Bill Hicks was an inspiration for this song...His Arizona Bay stand-up piece...In my opinion I think Maynards singing about how humans themselves will bring the end of their own existence upon themselves...and he points out how stupid certain cliques of people are....(the part that starts \"Fuck L.Ron Hubbard and fuck all his clones.....\") There's more to it but I can't exactly put them into words yet\t\t\t\t\n\t\t\t\t\n\n", "comment_353": "\nmom= mother nature , not our own mothers.  ie: \"I'm praying for rain, and I'm praying for title waves\"\t\t\t\t\n\t\t\t\t\n\n", "comment_354": "\nNow I've never been to L.A., but the image that comes to my mind when I think of it is tall buildings, traffic everywhere, and people constantly talking on their cell phones trying to make more money. L.A. was probably a beautiful town before they cut down trees to make the tall buildings, before cars poluted the air, and before it became crowded with freaks and became a shithole. And its all going to backfire on us one day whether an earthquake cracks california and if floats away, or global warming finally gets to us, and hurricanes form and tidal waves and everything that happened in the The Day After Tomorrow. Basically everything that Maynard is praying for.\t\t\t\t\n\t\t\t\t\n\n", "comment_355": "\ncmayo, maynards mom died when he was 11. but, that doesnt mean you are not right. \n\r\nmaynard hates mankind which makes him an ok guy in my book.\t\t\t\t\n\t\t\t\t\n\n", "comment_356": "\nHating Man kind? Why so cynical< Everyone has a problem with the human race. it all comes down to religion. Everthing down to a latte is a way for aome people to feel secure just like religion itself. hte song i see is mainly about how LA is full of sins. How we all worry about money and how we watch celebrities and wich we were them. How we all care about the stupid stuff. LA is full of junkies. Yes junkies are bad. They are part of the reason why LA is such a shit hole. The Othere Half is the Rich. Stop trying to be cynical. You should also listen to APC's Emotive. Maybe then you'll learn something. Maynard is right. La is one of thousands of problem cities. So chill out and stop fretting about what's going on. Fi you have a problem with mankind make a name for yourself like Tool did.\t\t\t\t\n\t\t\t\t\n\n", "comment_357": "\nIt doesn't ALL come down to religion. If aything it all comes down to individualism versus unity.\r\np.s: Necronic lay off the chronic. Maynards mother died in 2003. (Ten thousand Days?)\t\t\t\t\n\t\t\t\t\n\n", "comment_358": "\nl think its when the san andreas fault line breaks instead of people worrying about their lives their worried about the things like the piloit, whos gonna make their latte? and stupid shit like that\t\t\t\t\n\t\t\t\t\n\n", "comment_359": "\nIt's actually both toolfan. All these people are worried about such petty and insignificant things, oblivious that all this and them along with it is gonna sink to the bottom of arizona bay. Now THAT'S something to fret for.\t\t\t\t\n\t\t\t\t\n\n", "comment_360": "\nThis is based on the bit Bill Hicks used to do about wiping California off the map and just being left with Arizona Bay. Bill Hicks was a favorite of Maynard.\t\t\t\t\n\t\t\t\t\n\n", "comment_361": "\nwhen I was young and stupid, I was a member of the tool army and it was pretty common knowledge that in addition to all of the talk about california and arizona bay, Keenan actually was a firm believer in the planet x or niberu theory--that 10th psuedo planet/asteroid that has fallen almost into orbit with our solar system will have an adverse path when making complete orbital attraction and be slingshotted to the earth.  It was supposed to happen in 2000, tool took a hiatus (perhaps believing we were all going to die) then came out with lit in 2001, and now there music's gone really soft.  I think niberu had more to do with a disruption in their music than it did CA.\n\r\nOn another note...I stopped buying their music when I went to the aenima tour.  Keenan stopped in verse to shout \"Repeat after me! I'm a free thinker! I can think for myself!\"  And everybody did...and it was really a lame way to say 'fuck you' to your fans.  All in all, Maynard is an asshole.  It's cool if you like them, just don't glorify them.\t\t\t\t\n\t\t\t\t\n\n", "comment_362": "\ninteresting, at a lateralus show i went to maynard said this song was about girls with hairy legs....lmao@maynard\t\t\t\t\n\t\t\t\t\n\n", "comment_363": "\nANYON KNow? or seen that guy on here that tells u put certain tool songs in a order and then a different pattern and play them at the same time with 2 different media players?\t\t\t\t\n\t\t\t\t\n\n", "comment_364": "\nIf you want to know what the numbers mean koproximo, I'd be happy to tell you. All you need to do is ask.\t\t\t\t\n\t\t\t\t\n\n", "comment_365": "\nhey ninja, can you tell me?i think that the california thing is really just a metaphore for all the stupid shit in the worldoh yeah, and emry13  your stupid, learn to swim.\t\t\t\t\n\t\t\t\t\n\n", "comment_366": "\nHmm...\r\nSeeing as this isn't really the place for it SY5TEM I'll post a full explanation in Viginti Tres\t\t\t\t\n\t\t\t\t\n\n", "comment_367": "\n...soon.\t\t\t\t\n\t\t\t\t\n\n", "comment_368": "\nok. hey and also, i dont really know why, but i always thought it said    'cause im praying for rain',it makes sense,doesnt it?\t\t\t\t\n\t\t\t\t\n\n", "comment_369": "\nLearn to swim because when all the shit is flushed from the human subconcious, there will be nothing left to attach yourself to.  No more materialistic bullshit people revolve their lives around, just the mind, its vessel, and Mom (Mother Earth).\t\t\t\t\n\t\t\t\t\n\n", "comment_370": "\nLearn to swim because when all the shit is flushed from the human subconcious, there will be nothing left to attach yourself to.  No more materialistic bullshit people revolve their lives around, just the mind, its vessel, and Mom (Mother Earth).\t\t\t\t\n\t\t\t\t\n\n", "comment_371": "\nyes, he is sick of materialistic people, yes it's about the apocaylpse, no, WE don't need a vacation He, does, he wants it to wash away because he hates a lot of stupid worthless people, (gun toting hip gangsta wanna be's, fags, junkies,) no one can think for them selves anymore and do what they want to do, (hidden agendas), maynard is sick of fucking useless people and could care less if they die, and most likely he doesn't like people like you!\t\t\t\t\n\t\t\t\t\n\n", "comment_372": "\nCalm down numb. Just take some valium and have a good lie down. I'll see you down in Arizona Bay.\t\t\t\t\n\t\t\t\t\n\n", "comment_373": "\nAenima is by far one of the best songs by Tool.  From what I have read, it is also took the longest to create.  \n\r\nThough everyone on here already stated it, the song is basically about California breaking off and sinking into the ocean.  If only, if only.  The L Ron Hubbard part eludes to when Tool's performance was canceled because of Hubbard's science 'meeting' and the words exchanged.  \n\r\nI have also heard that Bill Hicks's idea was the basis for this song, but Maynard did one hell of a job fitting it all together.  \n\r\nAnd, on another note, I love playing this song on my guitar.  I hate dumb celebrities and rich bastards, and seeing them all sink away would make me very happy.  Playing the song on my guitars is as close to that reality as I can get!\t\t\t\t\n\t\t\t\t\n\n", "comment_374": "\n\"mama refers to mother nature and how a flood is created by her is how she will \"fix it all soon.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_375": "\nhey Dawrr, when did that happen, the thing with l Ron hubbard, TELL ME MORE!\t\t\t\t\n\t\t\t\t\n\n", "comment_376": "\nI believe this is talking about mom as mother nature and LA as the constipated shit hole of the world that is need of cleansing through the use of an enema (basically a rectal douche) so the earth will use a giant tidal wave to cleanse the earth of LA just like the water from an enema cleans out shit from the rectum.\t\t\t\t\n\t\t\t\t\n\n", "comment_377": "\nOpiate (1992)\r\n  50 â\u0080\u0093 1. Sweat â\u0080\u0093 3:46\r\n  44 â\u0080\u0093 2. Hush â\u0080\u0093 2:48\r\n  34 â\u0080\u0093 3. Part of Me â\u0080\u0093 3:17\r\n  35 â\u0080\u0093 4. Cold and Ugly (Live) â\u0080\u0093 4:09\r\n  36 â\u0080\u0093 5. Jerk-Off (Live) â\u0080\u0093 4:23\r\n124 â\u0080\u0093 6. Opiate â\u0080\u0093 3:07\r\n  55 â\u0080\u0093 7. The Gaping Lotus Experience â\u0080\u0093 2:19\n\r\nTotal Comments: 378\r\nAvg Comments/Song: 54.00\n\r\nUndertow (1993)\r\n  35 â\u0080\u0093 1. Intolerance â\u0080\u0093 4:53\r\n123 â\u0080\u0093 2. Prison Sex â\u0080\u0093 4:56\r\n201 â\u0080\u0093 3. Sober â\u0080\u0093 5:05\r\n  32 â\u0080\u0093 4. Bottom â\u0080\u0093 7:13 (Tool/Henry Rollins)\r\n  21 â\u0080\u0093 5. Crawl Away â\u0080\u0093 5:29\r\n  44 â\u0080\u0093 6. Swamp Song â\u0080\u0093 5:31\r\n  51 â\u0080\u0093 7. Undertow â\u0080\u0093 5:21\r\n  67 â\u0080\u0093 8. 4Â° â\u0080\u0093 6:02\r\n  38 â\u0080\u0093 9. Flood â\u0080\u0093 7:45\r\n  94 â\u0080\u0093 10. Disgustipated â\u0080\u0093 15:47\n\r\nTotal Comments: 706\r\nAvg Comments/Song: 70.60\n\r\nÃ\u0086nima (1996)\r\n225 â\u0080\u0093 1. Stinkfist â\u0080\u0093 5:09\r\n293 â\u0080\u0093 2. Eulogy â\u0080\u0093 8:25\r\n177 â\u0080\u0093 3. H. â\u0080\u0093 6:07\r\n  34 â\u0080\u0093 4. Useful Idiot â\u0080\u0093 0:38\r\n181 â\u0080\u0093 5. Forty Six & 2 â\u0080\u0093 6:02\r\n  41 â\u0080\u0093 6. Message to Harry Manback â\u0080\u0093 1:53\r\n171 â\u0080\u0093 7. Hooker with a Penis â\u0080\u0093 4:31\r\n  50 â\u0080\u0093 8. Intermission â\u0080\u0093 0:56\r\n  92 â\u0080\u0093 9. Jimmy â\u0080\u0093 5:22\r\n331 â\u0080\u0093 10. Die Eier von Satan* â\u0080\u0093 2:16\r\n180 â\u0080\u0093 11. Pushit** â\u0080\u0093 9:55\r\n  34 â\u0080\u0093 12. Cesaro Summability â\u0080\u0093 1:26\r\n373 â\u0080\u0093 13. Ã\u0086nema â\u0080\u0093 6:37\r\n  70 â\u0080\u0093 14. (−) Ions â\u0080\u0093 3:58\r\n180 â\u0080\u0093 15. Third Eye â\u0080\u0093 13:47\n\r\nTotal Comments: 2432\r\nAvg Comments/Song: 162.13\n\r\nSalival (2000)\r\n    0 â\u0080\u0093 1. Third Eye (Live) â\u0080\u0093 14:05\r\n  34 â\u0080\u0093 2. Part of Me (Live) â\u0080\u0093 3:32\r\n  67 â\u0080\u0093 3. Pushit (Live) â\u0080\u0093 13:56\r\n  20 â\u0080\u0093 4. Message to Harry Manback II â\u0080\u0093 1:14\r\n  29 â\u0080\u0093 5. You Lied â\u0080\u0093 9:17\r\n  34 â\u0080\u0093 6. Merkaba â\u0080\u0093 9:48\r\n  88 â\u0080\u0093 7. No Quarter â\u0080\u0093 11:12\r\n  22 â\u0080\u0093 8. L.A.M.C. â\u0080\u0093 8:15\r\n  91 â\u0080\u0093 9. Maynard's Dick â\u0080\u0093 3:40\n\r\nTotal Comments: 385\r\nAvg Comments/Song: 42.77\n\r\nLateralus (2001)\r\n106 â\u0080\u0093 1. The Grudge â\u0080\u0093 8:36\r\n  41 â\u0080\u0093 2. Eon Blue Apocalypse â\u0080\u0093 1:04\r\n106 â\u0080\u0093 3. The Patient â\u0080\u0093 7:13\r\n  68 â\u0080\u0093 4. Mantra â\u0080\u0093 1:12\r\n283 â\u0080\u0093 5. Schism â\u0080\u0093 6:47\r\n  65 â\u0080\u0093 6. Parabol â\u0080\u0093 3:04\r\n236 â\u0080\u0093 7. Parabola â\u0080\u0093 6:03\r\n  80 â\u0080\u0093 8. Ticks & Leeches â\u0080\u0093 8:10\r\n356 â\u0080\u0093 9. Lateralus â\u0080\u0093 9:24\r\n106 â\u0080\u0093 10. Disposition â\u0080\u0093 4:46\r\n129 â\u0080\u0093 11. Reflection â\u0080\u0093 11:07\r\n  38 â\u0080\u0093 12. Triad â\u0080\u0093 8:46\r\n123 â\u0080\u0093 13. Faaip De Oiad â\u0080\u0093 2:39\n\r\nTotal Comments: 1737\r\nAvg Comments/Song: 133.61\n\r\n10,000 Days (2006)\r\n333 â\u0080\u0093 1. Vicarious â\u0080\u0093 7:06\r\n222 â\u0080\u0093 2. Jambi â\u0080\u0093 7:28\r\n  98 â\u0080\u0093 3. Wings for Marie (Pt 1) â\u0080\u0093 6:11\r\n228 â\u0080\u0093 4. 10,000 Days (Wings Pt 2) â\u0080\u0093 11:13\r\n256 â\u0080\u0093 5. The Pot â\u0080\u0093 6:21\r\n  76 â\u0080\u0093 6. Lipan Conjuring â\u0080\u0093 1:11\r\n102 â\u0080\u0093 7. Lost Keys (Blame Hofmann) â\u0080\u0093 3:46\r\n320 â\u0080\u0093 8. Rosetta Stoned â\u0080\u0093 11:11\r\n  62 â\u0080\u0093 9. Intension â\u0080\u0093 7:21\r\n192 â\u0080\u0093 10. Right in Two â\u0080\u0093 8:55\r\n237 â\u0080\u0093 11. Viginiti Tres*** â\u0080\u0093 5:02\n\r\nTotal Comments: 2126\r\nAvg Comments/Song: 193.27\n\n\r\nRankings:\n\r\nTotal Comments:\r\n1. Ã\u0086nima â\u0080\u0093 2432\r\n2. 10,000 Days â\u0080\u0093 2126\r\n3. Lateralus â\u0080\u0093 1737\r\n4. Undertow â\u0080\u0093 706\r\n5. Salival â\u0080\u0093 385\r\n6. Opiate â\u0080\u0093 378\n\r\nAvg Comments/Song:\r\n1. 10,000 Days â\u0080\u0093 193.27\r\n2. Ã\u0086nima â\u0080\u0093 162.13\r\n3. Lateralus â\u0080\u0093 133.61\r\n4. Undertow â\u0080\u0093 70.60\r\n5. Opiate â\u0080\u0093 54.00\r\n6. Salival â\u0080\u0093 42.77\n\r\n* Includes \"The Eggs of Satan\" thread (50 comments)\r\n** Includes \"Pushit (Live)\" (67 comments)\r\n*** Includes \"Vignti Tres\" (60 comments)\t\t\t\t\n\t\t\t\t\n\n", "comment_378": "\n^^^And............\t\t\t\t\n\t\t\t\t\n\n", "comment_379": "\nYet another song that talks about Maynard's personal hypocrisy. He condemns people for buying lattes and yet later in his life he buys a bottle of wine for $10,000. Looks like someone became the thing he hates the most\t\t\t\t\n\t\t\t\t\n\n", "comment_380": "\nIt has already been said, but i do have a couple of additions. It's all about a title wave, yes, but i see it in a biblicle reference. You know? with Noah and the ark. All the sinners will be washed away, and if you wanna survive you must learn to swim(perhaps meaning giving up the LA life)...\t\t\t\t\n\t\t\t\t\n\n", "comment_381": "\nMJK Isn't condemming people for buying lattes. The actual line is \"Fret for your latte\" (Being a caffeine addict I can relate to that) Anyway what he meant by that line, as well as the others that follow, was that the LA lifestyle (lattes, pilots, lawsuits etc) will be pretty hard to live when floating around in Arizona Bay. He is saying \"Fret for your ...\" because soon it will all be gone.\t\t\t\t\n\t\t\t\t\n\n", "comment_382": "\nwhen maynard says \"learn to swim\" that means to me learn how to save yourself threw sprituality...reflect on who you are and dont become a p.o.s that deserves to be flushed away....be yourself and learn to love one another.....and stop talking shit. pepole this is a song meanings website, try to be openminded everyone has there own oppinion and talking shit dosnt help to change ones oppinion....if you talk shit you are shit...but fortuntently mom will soon flush you away.......but ppeole can change so try not to be so ignorant kids.....love you all\t\t\t\t\n\t\t\t\t\n\n", "comment_383": "\nFuck you, fuck everything, fuck your religion...Maynard has some pretty deep views, huh? I can see he is an accomplished and distinguished lyricist. Being a former-Tool fan, I always thought they were pretty thoughtful, but reading them now...tihs band is teh_suX0rz. And don't tell me I don't know what good music is. I do, and it's called METAL, not progressive grunge.\t\t\t\t\n\t\t\t\t\n\n", "comment_384": "\nWell let me start with telling you that I'm a long time reader but first time writer on the web (as clichÃ© as that sounds) - I have read quite a few of the postings on this site & agree with a lot of the aspects of the reviews that I have read, however I believe that the song (as are many Tool songs) 's meaning is more general than many reviews have suggested. I believe that the central just is that a \"thinking\" or a higher/more-educated member of society has the unfortunate burden of interacting with lower or \"hick\" level people, that in our ideal would be \"washed away\" by the \"Armageddon\" or cleansing through extinguishment of the \"lower-thinker/class\", whilst I agree that the idea of wiping the \"dumbfounded dip shits\" from the globe sounds attractive, I feel that Maynard as is the case with my self is just expressing his frustration NOT hatred or direct ill wishes towards the lower populus. I think that the song is a vent for negative feelings towards those people that \"fret for\" worry about things not ultimately important or things that they have no/little control over; these people are the ones that should be cleansed from the world according to many people's beliefs. The lines: \"Some say the end is near\" & \"Fuck L. Ron Hubbard\" are in my opinion references to \"cult\" type religions such as Jehovahâ\u0080\u0099s witnesses and Scientologists that seam to use fear and absolutes to instruct/control there followers, I believe that Maynard has a lot of experience and commonsense that leads his way of thinking towards more reflective and open minded philosophy. I would agree also that lines referring to: \"Mom's gonna fix it all soon\" refer to \"Mother Earth/Nature\" through global-warming/clement-change, earth-quake/Flood-Tsunami &/or Pandemic-Viruses(or if cosmic forces are able/inclined: astroid collision) likely to try to rebalance the population to past levels. - The line: \"three ring circus sideshow of\r\nfreaks\" and other more specific lines I feel refer to the general loss of focus on local/individual needs, instead of the selfish and self-centred priorities that modern life and economics have forces on us - and how we should take more time in reflecting on who/what we are not what we can get. \r\nThank you to anyone that has lasted the distance to read what I have written and any feedback is welcome: millin-\"at\"-bestdeal4u.com.au\t\t\t\t\n\t\t\t\t\n\n", "comment_385": "\nI haven't read all the posts so sorry if this has already been said but- arizona doesn't have a bay, the only way it would have a bay is if california sunk and then you'd have to swim to the nearest land which would be 'arizona bay'\t\t\t\t\n\t\t\t\t\n\n", "comment_386": "\nthis song is also how people worry too much about\r\nthe littlest things in life. nobody cares about anything better, or to better themselves. like even thinking for yourself for starters or thinking in general haha! thats why he says\n\r\n\"Fret for your figure and\r\nFret for your latte and\r\nFret for your hairpiece and\r\nFret for your lawsuit and\r\nFret for your prozac and\r\nFret for your pilot and\r\nFret for your contract and\r\nFret for your car\"\t\t\t\t\n\t\t\t\t\n\n", "comment_387": "\nPretty much the apocalypse and how he would like it to happen cause he tired of the bullshit...\t\t\t\t\n\t\t\t\t\n\n", "comment_388": "\nI  looked up what (i cant type it) Aenema means.  It is a combination of the words 'anima' (Latin for soul associated with deep emotionality and the force of life itself) and of course enema which...yeah, means anal cleansing.  This is Tool's new version of the word catharsis-or cleansing of the soul.  This song appropriately illustrates this need.  To Maynard, LA is the prime example of humanity's frivilousness and inane ambitions.  This hopeless hole of humanity that ironically is one of the most popular cities in America.  California can in essence, be used to represent the thoughts of america's citizens as a whole.  Maynard is just tired of the shit, the circus of worthless people with worthless ambitions.  It seems he is suggesting the solution to the problem to be a cleansing by flood, or wash into the ocean.  His advice for those dregs of society?  If you want to survive this needed armageddon, learn to swim.  Maynard'd tone is pitiless and full of contempt.  Flush the problems away.  Wash away the sins of humans.  Noah's ark come to mind?  Aenima-cleansing of humanity.  Cleansing of the human's spirit of sin.  Cleansing of America's asshole (L.A.) of sin.\t\t\t\t\n\t\t\t\t\n\n", "comment_389": "\nwhat most people fail to realize about tool its all symbolisms. the song is about the end of the facade we live in. and how people in hollywood are fake\t\t\t\t\n\t\t\t\t\n\n", "comment_390": "\nfuck all you people who are like \"OMG MAYNARD MAYNARD MAYNARD\", for fucks sake hes not the only person in the band. he doesnt write the songs, theyre not an example of HIS brilliance, they're an example of justins, dannys, adams and his brilliance.\r\ngive credit where its due\t\t\t\t\n\t\t\t\t\n\n", "comment_391": "\ni'll let your mom do that ben.\t\t\t\t\n\t\t\t\t\n\n", "comment_392": "\nI' mean...I do not even listen to this music....but it is not nice to tell people to f*** off\t\t\t\t\n\t\t\t\t\n\n", "comment_393": "\nIT actually does say \"im prayin for RAIN, NOT mayhem. check out the tool site for real lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_394": "\nI know a bit about religion, and tool actually performed at the church of scientology in cali. The reason he wrote this is because he is anti religion. Listen to opiate, it is completely anti religion. He also says fuck all you gun toting hip gangster wannabees... But there isnt a whole bunch of stuff on how tool are now racist? they seem to be anti christian in some songs, eg sober, but then again he seems pretty religious in wings for marie i and ii. But then remember his april fools joke? he found jesus? but do you think that i true christian would joke like that? the whole hubbard thing is just about anti religion. They are pretty psychiatric influenced, and it is well know scientologists are anti psych... Witness tom cruise... So maybe there is a connection there?\t\t\t\t\n\t\t\t\t\n\n", "comment_395": "\nREAD READ READ READ READ READ READ READ READ READ\n\r\nARIZONA BAY is refering to the title of an album by a comedian named Bill Hicks (deceased 1994) in which he hopes for a massive earthquake to seperate Califonia from the rest of the U.S., resulting in the Arizona Bay. \n\r\nThis song is obvisouly an extention of this ideal.\t\t\t\t\n\t\t\t\t\n\n", "comment_396": "\nREAD READ READ READ READ READ READ READ READ READ\n\r\nARIZONA BAY is refering to the title of an album by a comedian named Bill Hicks (deceased 1994) in which he hopes for a massive earthquake to seperate Califonia from the rest of the U.S., resulting in the Arizona Bay. \n\r\nThis song is obvisouly an extention of this ideal.\t\t\t\t\n\t\t\t\t\n\n", "comment_397": "\ngood, its about time someone wrote a REAL song about california drowning. \"blah blah blah, california's where its at, blah blah blah!\" ha i hope they drown, then burn in hell. and i'll laugh hard when it falls off the map... cleansing from the scum of the earth...\t\t\t\t\n\t\t\t\t\n\n", "comment_398": "\nibelive i agree with u :)\r\nÃ¦nima should liberate all of our minds in this fucked world :D\t\t\t\t\n\t\t\t\t\n\n", "comment_399": "\nAEnemia is a blood disorder, and so that makes me think that per'aps Maynard sees California as a disease or summat? To be honest, I don't care. It's such a fucking amazing song that it doesn't need a meaning. It just needs to be played. LOUD.\t\t\t\t\n\t\t\t\t\n\n", "comment_400": "\nYour all idiots, if you were real TOOL fans you would know that it means nothing Maynard had an interview and said it was Danny Carey's vision while getting a hi colonic\t\t\t\t\n\t\t\t\t\n\n", "comment_401": "\nYour a fuckwit for believing everything they say in interviews! dont you know Tool have a huge fucking nack for lying in every interview when theyre questioned about their songs.\n\r\nThats why they are the greatest musicians in the universe.\t\t\t\t\n\t\t\t\t\n\n", "comment_402": "\ntool\t\t\t\t\n\t\t\t\t\n\n", "comment_403": "\nYEAH, 400TH POSTING!!! GOING TO SEE TOOL IN OKC THIS SATURDAY!!!!!!1\t\t\t\t\n\t\t\t\t\n\n", "comment_404": "\nThe eMOTIVe album is LA in somewhat of a apoclyptic state.\n\r\n=) Later inspiration?\t\t\t\t\n\t\t\t\t\n\n", "comment_405": "\n\"Being a former-Tool fan, I always thought they were pretty thoughtful, but reading them now...tihs band is teh_suX0rz. And don't tell me I don't know what good music is. I do, and it's called METAL, not progressive grunge.\" - BAHAHAHAHAHAHAHAHAHAHAhaha ohhhhh man *wipes tears of laughter away* i think the meaning of this song has been thoroughly covered here but i really just needed to get that out of my system.  either this Arkyopterix fellow is a master satirist or he's just a douche bag.  man, that was a good laugh.  hah metal.\t\t\t\t\n\t\t\t\t\n\n", "comment_406": "\nI feel so sorry for you....... hope your head  hurts from head bangin to pointless loud music!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_407": "\ncurrently this is my favorite song ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! TOOL!\t\t\t\t\n\t\t\t\t\n\n", "comment_408": "\nA MESSAGE TO \"tehmusicman\".\n\r\nI HOPE YOU FUCKIN CHOKE ON YOUR BOYFRIENDS COCK YOU ONE NOTE COCK SUCKING FAGGOT. AND ENUF LAUGHING AT YOUR OWN JOKES LITTLE BITCH. Fuckin homosexual.\t\t\t\t\n\t\t\t\t\n\n", "comment_409": "\nFirst of all, its important to know that Tool is heavily influenced by the work of comedian Bill Hicks.  You can hear him actually on Third Eye.  Hicks often spoke of how better the world would be LA (\"Satan's Shithole\" as he called it) was destroyed by a major earthquake, \"flushed away like the turd it is\".  The removal of fecal waste via water or fluid is known as an enema, (what the \"Ã\u0086\" is for i don't know).  That's basically where the name and alot of the lyrics come from.  The rest as some of you have pointed out, come from the experiences of the current members of the band (minus Justin Chancellor as he is English-born).  And I see that the \"fret for your lawsuit/hairpiece mistake hasn't been fixed since 2002.\t\t\t\t\n\t\t\t\t\n\n", "comment_410": "\nahh only thing i dislike bout this song is the fact that, if i ever go newhere with my band, i was planning on writing a song bout my dislike of los angelous, tool beat me too it did a very very good job here too\t\t\t\t\n\t\t\t\t\n\n", "comment_411": "\nThe song facts have already been presented, so here\\'s the perfect summary.\r\n-The song is Maynard\\'s/Tool\\'s disdain for Los Angeles\\' vanity and troubles, praying for the apocalypse or California specifically to fall into the ocean, hence \\\"Learn to Swim\\\".\r\n-The term \\\"Arizona Bay\\\" is coined from comedian Bill Hicks as Arizona would become a bay in the event Los Angeles/California separated from North America.\n\r\n-If you haven\\'t gotten it already, Tool got fucking fed up with Los Angeles. That\\'s the only point to this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_412": "\n/\\that's a good summay, but i'd like to add that it's not just l.a., it's what l.a. stands for.  all of the things he lists represent the b.s. that l.a. stands for.  it's all about truly getting back to what really matters in life.  so if the rain and the tidal waves come, those people would  have to do so.  \n\r\ni'd also like to add that 'learn to swim' is one of the coldest/funniest reactions to an idea like this.  makes me laugh in a morbid way.\t\t\t\t\n\t\t\t\t\n\n", "comment_413": "\nits just reference to armagedon or imagery of what the world should be without such as all the things he says people fret for and to bitterness of the world but there are different theories such as learn to swim refering to california going under from the plates causing earthquakes although i have heard the theory of the world ending in 2012 but to me its just what the world should do without and i agree because humanity and civilization today is turning into a materialistic place people being more concerned with rediculous things such as the hip coffee shops la clubs gangsters instead of stopping and taking a look at things as a whole and honestly i dont believe that anything can fix these problems maybe band-aid them but where there is good there is always evil so everything has a downfall but i do believe things could be a lot better just does not look like it is going to be anytime in the near future i mean come on paris hilton is the talk in the news instead of issues that really need to be touched such as crime rate ware and how it can be fixed.\t\t\t\t\n\t\t\t\t\n\n", "comment_414": "\nlmao this song cud have many possible meanings, i like the idea of it be in enima \n\r\n\"I wanna watch it all go down\r\nMom please flush it all away\r\nI wanna see it go right in and down\r\nI wanna watch it go right in\r\nWatch you flush it all away\" \n\r\ni thnk Aenima consists of dual meanings One the jungian theory (anima), and two i thnk its about cleansing ourselves (like in an enima they clear away all the disgusting shit :P) so we can be better being or as they saw at the third being, or 46 and 2 lol Ã\u0086nima is from what i can see Anima + enima well its just my own theory(i doubt i came up with it) im sure multiple people cud apprecriate and agree with me\t\t\t\t\n\t\t\t\t\n\n", "comment_415": "\nI find it funny that Tool fans are EXACTLY like the sciencetologist they so hate. They are ignorant, stupid, and sheep-like. This song lacks any meaning in the end because of Maynards hypocrisy. How dare he insult people in Los Angales and then live the EXACT lifestyle he so hates. The guy \"frets\" for his wine, but says it is not okay for a latte. Because spending $10,000 on a bottle of wine is never superficial\t\t\t\t\n\t\t\t\t\n\n", "comment_416": "\nOK dude 'snake doctor',(pretty gay name by the way hahaha)  this song as many over analyze is actually about comedian Bill Hicks comedy. you look it up and stop playing with so many 'snakes' .hahahahahaahahahaha.  or it is about girls with hairy legs.....but since you like snakes so much you probably dont care about girls....\t\t\t\t\n\t\t\t\t\n\n", "comment_417": "\nI'm fucking comment number 414\r\nbecause that FUCK KIN song Lateralus isn't going to fackin' win --!!Damn it all to Fargin' Oblivion!!\r\nFuckin' Funkin' Monster Truckin' Fackin'\r\nI'm going to kill society and this blog with my nihilistic  Fock Wind!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_418": "\nHey System, I can't help it if I am right. Maynard is a hypocrite and this song proves it more and more. He condemns LA for the exact same things he is guilty of. How can you condemn people for buying Lattes and then own your personal winery, buy a $10,000 bottle of wine, and even use capitalism (which he condemns), to make profits off of the luxury good he produces! A fuckin' Politburo Communist to me.\n\r\nAnd by the way, the name is a reference to the tv show \"The Unit\". Since it involves violence, war, guns, and even pro-American messages I highly doubt a Tool fan would want it. The leader of the Unit uses the code name \"Snake Doctor\". Check it out when you get your head out of Maynard's ass\t\t\t\t\n\t\t\t\t\n\n", "comment_419": "\nSnake Doctor, you're not right. A) You insult Scientology when I doubt you really know ANYTHING about it. B.) Do you even realize that the entire album was more of a tribute to Bill Hicks? This song so obviously is a part of that due to the end of the chorus \"See ya down in Arizona Bay.\" Can we guess what one of Bill Hicks performances was titled!? \"Umm, Arizona Bay?\" DING DING DING!!! WE HAVE A WINNER.  While it may seem hypocritical, and fuck sure theres a chance it very well may be, HYPOCRISY IS A TRADITIONAL TRAIT IN HUMANITY. Human beings are hypocrites. This reminds me of a fun little bible quote for ya\n\r\n\"Let he who hath not sinned; cast the first stone.\"\n\r\nShut up, you fucking hypocrite.\t\t\t\t\n\t\t\t\t\n\n", "comment_420": "\nmaynardslyrics.com\n\r\nI think Maynard's words need to be shared with the world, in their most accurate form. He is something of a lyrical genius, and we all know this. The site is very simple, but the main object of my site is not the layout, it's the lyrics. You will not find more accurate tool/apc/puscifer lyrics anywhere. So feel free to browse, peruse, if you will, maynardslyrics.com ...\n\r\nI have all the Tool albums done, minus Opiate, which will be added very soon.\n\r\nAll his APC stuff, minus emotive, which will be added very soon.\n\r\nAnd as soon as his Puscifer stuff comes out, expect it to be added as well.\n\r\nIf you see any lyric or line that you feel is not what you think it should be, please feel free to email me @ magiclessmarker@maynardslyrics.com\n\r\n-magiclessmarker.\t\t\t\t\n\t\t\t\t\n\n", "comment_421": "\nthis is a great song. i think the name was chosen because of 2 words...enima and anima/animus. we all know what an enima is so ill skip that . your anima is that part of ur unconscious that refers to ur feminine side (anima) as a male. or masculine side (animus) as a female. anima is also used to refer to a part of your unconscious that is very different or even totally opposite from the conscious you.\t\t\t\t\n\t\t\t\t\n\n", "comment_422": "\noops..i hit enter to fast,,,im bout to continue it\t\t\t\t\n\t\t\t\t\n\n", "comment_423": "\ni think society has hit a decaying or stagnant point. people hate and fear and judge constantly. and are obsessed with trivialities. i believe the song is about more than california. its about society needing a drastic change(and i think its kind of funny to view that change as an enema) and this change would be their...\t\t\t\t\n\t\t\t\t\n\n", "comment_424": "\ninner self that seeks enlightenment and acts like a true human....their anima considering the state of things\t\t\t\t\n\t\t\t\t\n\n", "comment_425": "\nScientology...Why are you picking on them? If they want to believe what they want, then let them. I don't hate them, I hate their religion and their money stealing asshole creator! And Maynard is finding a fun little thing to do; winery. People and their every day latte and shit like that are...sickening. Oh, and anyone who lives in Colorado can see what the fags in Cali are like, since they seemed to realise their gonna sink and are invading. Colorado has been tainted!! And Maynard is God!!!!!!!!.....Along with Robert Jordan, the Light shine on his soul...\t\t\t\t\n\t\t\t\t\n\n", "comment_426": "\nTheFullEffect82 has an awesome fucking view of the song. No matter what you think its about, this is one awesome song!\t\t\t\t\n\t\t\t\t\n\n", "comment_427": "\nMy friends, Aenima from my research brings light to a future flood that is scheduled to happen. NASA and also the USGS have confirmed that on December, 21, 2012, the poles are set to change. This event will cause massive flooding and everyone should by then \"Learn to swim.\" The mention of L.A. I think is the point that the world views the U.S. according to what is happening in California. Where most of the artists, movie stars, directors, porn stars, etc, live. The movers and shakers of the United States. Everyone will be fretting and worrying about their own bullshit and this catastrophic event will happen. See you down in Arizona Bay.\r\nWhether I'm right or not, this song is by far one of the best ever written and I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_428": "\nThis is why I live in Maine ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_429": "\nY'all pretty much summed it up. great song, first tool song I ever heard, so it holds a special place in my heart\t\t\t\t\n\t\t\t\t\n\n", "comment_430": "\nI like the fact that if and when it does happen like so many of the prognosticators say then I already have my place staked out up here in the far reaches of the Rocky Mountains. I oughta have a great veiw from here-------- But what an intense tune. Tool  ceases to amaze me always...\t\t\t\t\n\t\t\t\t\n\n", "comment_431": "\nMaynard hates L.A. Which is what I'm guessing the whole song is about. Even though the idea of an apocalypse could work too. But if it were, why only L.A.? It's more like it being bombed or something. and the only way to survive is to swim to arizona bay.\t\t\t\t\n\t\t\t\t\n\n", "comment_432": "\nThe bad thing about this song \r\nmy mom lives in Cali.\t\t\t\t\n\t\t\t\t\n\n", "comment_433": "\nPeople get thier inspiration from wierd things.\n\r\n  I think it's about the movie Escape from L.A.\t\t\t\t\n\t\t\t\t\n\n", "comment_434": "\ni'd just like to point out that he bashes scientology \"Fuck L. Ron Hubbard and fuck all his clones\" pretty much he is saying fuck everyone who follows this idiot...people like tom cruise...'nuff said :p\t\t\t\t\n\t\t\t\t\n\n", "comment_435": "\nHe wants the state of California to fall into the ocean because they're a bunch of plastic superficial bastards.\t\t\t\t\n\t\t\t\t\n\n", "comment_436": "\nmeredith your wasting your time posting bullshit meaningless comments with no backup when you could actually listen to Tool and see that Maynard tells it how it is as well as being incredibly talented and intelligent. If you can't see the genius in his songs then i agree with iblelieve- GPIT! coz your not worth taking up space on this earth with your half brain and feeding the superficial \"music\" (as if) industry by supporting whatever shit you listen to (which must be shit if you don't appreciate Tool) I'm thinking rhiana or pusycatdolls or whatever... go hide under your see-through plastic fantastic Umbrella!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_437": "\nThis song is about getting rid of certain aspects of our decaying society, and the anger they cause. The song specifically mentions California as the root cause of many of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_438": "\nThis song is about getting rid of certain aspects of our decaying society, and the anger they cause. The song specifically mentions California as the root cause of many of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_439": "\nMan, im just scrollreading thru sum of u pplz comments and im just reminded of michael moore's 'bowling for columbine' for sum reason.\n\r\nI've just seen the vidclip of this song and i think its the best one out of all of tools clips. The scene i can't stop thinkin about was particularly the hectic ending. Where that weird man throws that steel box wid that creature inside it whilst it flashes scenes of an human unborn baby. Could it be representing perhaps human manipulation is causing stuff-ups of our inner being as well as the world itself?\n\r\nAlthough im a devout catholic i appreciate tool's songs, most especially their trippy videoclips. And with their artistic ways of expressing themselves i truly respect that... except when they mock certain allusions of my faith (if they had). Some of yall may diss me for this but hey....i am only expressing myself in sticking up for the ultimate truth thats out there, especially for all mankind. With that i hope all u ppls future comments (even with no interpretation) can try and respect other ppls opinions and beliefs; wateva they may be.\t\t\t\t\n\t\t\t\t\n\n", "comment_440": "\nI feel Its saying that modern society is materialistic, Destructive, and all around sucks, and it would be an improvement if the human race was destroyed, i feel i must agree. It reminds me of Henry David Thoreau.\t\t\t\t\n\t\t\t\t\n\n", "comment_441": "\npenislick\t\t\t\t\n\t\t\t\t\n\n", "comment_442": "\nThis song is awesome! \r\nWe always talk about maynard, he's awesome , but listen to the music, just insane! TOOL they are really one of the best.\r\nLearn to Swim!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_443": "\nI have a whole different perspective that I haven't heard anyone really mention... I personally think this song is about suicide.\t\t\t\t\n\t\t\t\t\n\n", "comment_444": "\nduh.... FUCK AMERICA! (USA..not the rest of america.... CANADA RULES!!!)\t\t\t\t\n\t\t\t\t\n\n", "comment_445": "\nThe song is not about suicide.  How do you figure?\r\nThe song is meant to be taken LITERALLY.  \n\r\nThe \"silly shit/stupid shit\" that we as a society have decided to make priorty - flashy cars, shiny rims, big fake boobs, huge houses w/ 17 cars in the garage, name brand clothes, making sure we look \"perfect & fit in w/ all the 'cool' ppl etc..., aren't *really* important. - \"Fuck retro anything, fuck your tattoos... Fuck insecure actresses.. Fret for your figure, fret for your latte....\" \t\t\t\t\n\t\t\t\t\n\n", "comment_446": "\nThe song is not about suicide.  How do you figure?\r\nThe song is meant to be taken LITERALLY.  \n\r\nThe \"silly shit/stupid shit\" that we as a society have decided to make priorty - flashy cars, shiny rims, big fake boobs, huge houses w/ 17 cars in the garage, name brand clothes, making sure we look \"perfect & fit in w/ all the 'cool' ppl etc..., aren't *really* important. - \"Fuck retro anything, fuck your tattoos... Fuck insecure actresses.. Fret for your figure, fret for your latte....\" \t\t\t\t\n\t\t\t\t\n\n", "comment_447": "\nWhat the heck.  I wrote a few paragraphs worth & apparently the site jammed & only posted part of what I wrote...  Damn it.\t\t\t\t\n\t\t\t\t\n\n", "comment_448": "\nNobody seems to have touched on Bill Hicks, I haven't read many of the comments, just page one then page eighteen, both Ã\u0086nema and Eulogy were angled toward Bills work.\n\r\nBill Hicks hated LA, he directly quotes \r\n\"Living out in LA or as I call it Hell-A, I just like getting out of there at any point just to go anywhere just for the weather, hot and sunny every day, isn't it great, every day hot and sunny, and they love it. What are you a fucking lizard? Only reptiles feel that way about that kind of weather, I'm a mammal I can afford scarfs,coats, cappachino and rosy cheeked woman and all are for sale, on the streets of New York, now. For I will soon be returning because LA is a nightmare city and the sooner it falls into the ocean due to a major earthquake and is flushed away like the turd city it is into the pacific bowl the better this world will be........oh won't we party hard when LA goes keeersplash........LA is a nightmare place man...... thats right, when LA falls into the fucking ocean all it will leave is Arizona bay\"\n\r\nNow if you can't see the link, your fucked in the head. Bill Hicks is featured on the special edition Ã\u0086nima album as a tribute to is death, if you like tool you'll love him. (hes the guy at the beginning of Third Eye)\n\r\nBut the song itself, apart from being a tribute to everything Bill and Maynard hate, is about hate... Stupid, superficial human beings... Argh i'd go on but you can all listen to it and figure it out for yourselves. Bill Hicks everyone, Bill Hicks.\t\t\t\t\n\t\t\t\t\n\n", "comment_449": "\nA question i cant seem to answer- take away all the trivial shite in life, the small things that we frett over, and what is left? What are 'the correct things' we should be doing with our time? Dont say it applies personally to each of us, because that is a lazy answer. I think humans need stuff like that, i dont think we could live without it. If we did go back to nature, would stuff like that be gone? I think it would be there in a different form. This is a good song, but requires a bit of post listening thinking, which is quite refreshing. I wouldnt like to see this place die, life is good, its fun, and most of all, which goes against all that thinking stands for, its no mistery, as opposed to the after life...or what ever comes next. I like.\t\t\t\t\n\t\t\t\t\n\n", "comment_450": "\nAre the intentions of our actions what make em trivial? Come to think of it, i hate this song, it requires lots of though, which i agree, is not a popular thing. It stirs up a feeling for that type of lifestyle that you really want to believe in but doesnt give a hint as to what goes in place of what should be discarded. Much the same is fight club. This whole issue here is the result of a world that requires no thought. Call me stoopid and uneducated, but you need to start somewhere.\t\t\t\t\n\t\t\t\t\n\n", "comment_451": "\nThank you you-lied. After 18 pages I was going to say exactly the same thing. It is a tribute to Bill Hicks.\t\t\t\t\n\t\t\t\t\n\n", "comment_452": "\nthe part about Arizona Bay is referring to an old Bill Hicks comedy cd called arizona bay, maynard and bill hicks were great friends and he often opened shows for tool, and bill( who hates LA too) came up with the theory for Arizona about LA falling into the ocean, and maynard wrote a song about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_453": "\ndoes anyone see \"mom\" and \"mother\" referenced throughout the song. he is talking about mother nature, and how in most religions there is a great flood story where the earth had to start over. it's is very apocalyptic. and yes, i've lived in LA and i hated it, and can see why he has so much hatred.\t\t\t\t\n\t\t\t\t\n\n", "comment_454": "\ndoes anyone see \"mom\" and \"mother\" referenced throughout the song. he is talking about mother nature, and how in most religions there is a great flood story where the earth had to start over. it's is very apocalyptic. and yes, i've lived in LA and i hated it, and can see why he has so much hatred.\t\t\t\t\n\t\t\t\t\n\n", "comment_455": "\nWell, to me, this song is an overall rant at the current state of culture in the U.S. of A.  Ã\u0086nema is a combination of the two words \"enema\" (the medical procedure involving the flushing of one's bowels) and \"Anima.\" (an egyptian word referring to life force.) These two words put together can form a nasty little phrase that means \"the flushing of life.\"\n\r\n\"Learn to swim\" refers to a flood. All of this refers to noah's famous story to an extent.\n\r\nWhat he's saying is \"SOMEBODY'S GOTTA DO SOMETHING!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_456": "\nVery straightforward song to me. It's about society and how superficial it is. If we can delve any deeper at all, it's here; the song is about LA specifically, but I like to think it's commenting on cultural decay as a whole and not just one city. The apocalyptic lines about comets, etc. support this. The world would be hit by a comet, not LA. \"Learn to swim.\" could have more meaning than the most obvious, swimming from a sunken LA to \"I'll see you down in Arizona Bay.\" It could also be about thinking for oneself, and seeing past the superficial society described in the song. Mom is obviously Mother Nature, etc. etc. Pretty straightforward. Love the song, love the lyrics, and love the meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_457": "\nYou are all fucking retards. \r\nThis song is directed at you and me.\r\nYou are a fool if you can't see that the lyrics are blatantly anarchistic and nihilistic.\r\nYou are all ants and fucking drones to the media and government and you would be better off drowning in the ocean\t\t\t\t\n\t\t\t\t\n\n", "comment_458": "\nI suppose no one has every heard of the late, great, Bill Hicks.  Do yourselves the favor and engross yourselves in one of the band's most outstanding influences.  He even has an album titled, aptly, Arizona Bay.\t\t\t\t\n\t\t\t\t\n\n", "comment_459": "\nwell lets start with the frist line which the site has posted lyricly wrong\n\r\nSome say the end is near\r\nSome say we'll see the Beatitudes I certainly hope we will\n\r\nobviously he is saying that people are generally talking about the apocalypse and the Beatitudes(The Beatitudes of Jesus Christ Matthew 5:3)KJV  is when god comes back and heals the weak and the long suffering its a very important feature of the holy bible it is related back in almost all protestant religion and catholic\n\r\nsecond of all i think maynard is expressing his overall hate and disgust with the world specificlly LA we all know this \n\r\nand he is saying the only logical solution to fix the problem that LA has caused the (WORLD) with all its bullshit is for the theory of continental drift to simply play out like scientist have been hypothesizing on for years that it will fall of into the ocean\n\r\nand it is suspected that most natives of califronia will migrate to arizonia hence see you down in arizonia bay \n\r\nthen maynard goes into the fretting for everything spill of course which again the site has wrong and out of order but he is saying that while everyone are so busy fretting over this stupid bullshit noone has taken time to look a little deeper and find that these superficial things are meaningless\n\r\nafter all this ,maynard starts talking about the distraction and his suggestion to keep us all occupied which is learn to swim\n\r\nall he is simply saying is that while were all occupied and distracted by LA and the drama of hollywood he suggets we learn to swim because were going to need to and we need to get our minds out of the bullshit and the distractions yes and of course maynard tells pretty much that our moms fix everything they fix opur insecurities when somehitng goes wrong we all run to mom so you see why he says this \n\r\nand the ne just goes into this spill of fuck this and that and how he is preying for mayhem and etc. which is pretty self evident in my opinion you know L RON HUBBARD with dianetics and all the gangsters and the bullshit of the world nad i feel maynard isnt really dierecting this toward people in only CALI but that we should all quit focusing on the bullshit we are fed by the media and enertain,ment industries and models and actresses and i find this to be true i dont think you can ever really over analyze this song by the way  and i dont think maynard was looking at Cali in a superficial way i believe he wanted to convey the message that we focus we to much attention on this part of the world and the superficial bullshit that comes from it  (OH YEAH! by the way MHR go back and review your tool specificly the song Hooke With a Penis I think you may find some enlightenemnt)\t\t\t\t\n\t\t\t\t\n\n", "comment_460": "\nThe little silly things which together are enough to cause the end, again, again and again.\t\t\t\t\n\t\t\t\t\n\n", "comment_461": "\nThis song goes with the theme of the album as a tribute to the amazing social satirist/comedian Bill Hicks and based on his last album \"Arizona Bay\".((\"Ahhh, it's gone, it's gone, it's gone...All the shitty shows are gone, all the idiots screaming in the fucking wind are dead, I love it...leaving nothing but a cool, beautiful serenity called Arizona Bay. That's right, when L.A. falls in the fucking ocean and is flushed away, all it will leave is Arizona Bay.\"))\r\nNow stop with your own little theories, this is the only right song meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_462": "\nIt's taken from a Bill Hicks monologue about Arizona Bay and LA. Basically it's talking about hoping LA drops into the sea. Mom making it all better is Mother Nature\t\t\t\t\n\t\t\t\t\n\n", "comment_463": "\nGreat song, and one of my first Tool songs.  I love the fact that this song is driven by pure fury, hatred, and contempt.  A song that is driven by emotion  that powerfully is a good song in my opinion.  Also, this song describes my opinion of big cities in a nutshell.  I was born in Northeast Philadelphia in the Mayfair section, and I hated it there, and I hate it now more than ever.  I remember that I was 13 when we finally moved out, and I was so glad to get away.  \n\r\nAnyhow, my personal qualms aside, this song is simply about what a shithole Los Angelos is, which it is in my humble opinion, and how Maynard wishes Mother Nature would just unleash her wrath upon it, and wipe it out for good.\t\t\t\t\n\t\t\t\t\n\n", "comment_464": "\nWatch the video clip and it could be about unwanted pregnancies. Could be in reference to \"mom\". \n\r\n\"The only way to fix it is to flush it all away\" - abortion?\n\r\nCalifornia has one of the highest abortion rates.\t\t\t\t\n\t\t\t\t\n\n", "comment_465": "\nTo me this is about someone who is \"chasing fame in all its decadence,\" LA can represent any major city anywhere. It will corrupt you, you'll do anything to gain fame and usually you set aside realities and true emotions for silly little fads and accessories. \n\r\nI also think being told from the perspective of someone(lets just call him \"Bob\") who loved someone else(lets call her \"Kara\") until the other person was caught up in achieving fame, the three ring circus being One person and another, the third being the mainstream media which promotes these ideas of fads and publicity. Now \"Bob\" is tired of dealing with watching \"Kara\" turn into something completely fake and forget the feelings they had and would rather see her fail and have a normal life back.\n\r\nHowever... im a bit messed up in the head right now from a relationship, so don't judge me too hard.\t\t\t\t\n\t\t\t\t\n\n", "comment_466": "\nSome say the end is near\r\nSome say we'll see armageddon soon\r\nI certainly hope we will\r\nI sure could use a vacation from this\r\nBullshit three ring circus sideshow of\r\nFreaks\n\r\n*Here he is saying, people are retards and he hopes he will live to see the end of the world, so he can see everyone he hates die.*\n\r\nHere in this hopeless fucking hole we call LA\r\nThe only way to fix it is to flush it all away\r\nAny fucking time, any fucking day\r\nLearn to swim, I'll see you down in Arizona bay\n\r\n*Apperently, he sees L.A. as a \"problem\" wich can only be cured by destroying it.*\n\r\nFret for your figure and\r\nFret for your latte and\r\nFret for your hairpiece and\r\nFret for your lawsuit and\r\nFret for your prozac and\r\nFret for your pilot and\r\nFret for your contract and\r\nFret for your car\n\r\n*Here he's saying, people wont even care about thier friends dieing when the world ends, and will be more regretful of thier material possetions.*\n\r\nIt's a\r\nBullshit three ring circus sideshow of\r\nFreaks\n\r\nHere in this hopeless fucking hole we call LA\r\nThe only way to fix it is to flush it all away\r\nAny fucking time, any fucking day\r\nLearn to swim, I'll see you down in Arizona bay\n\r\nSome say a comet will fall from the sky\r\nFollowed by meteor showers and tidal waves\r\nFollowed by faultlines that cannot sit still\r\nFollowed by millions of dumbfounded dipshits\n\r\nSome say the end is near\r\nSome say we'll see armageddon soon\r\nI certainly hope we will 'cause\r\nI sure could use a vacation from this\n\r\nSilly shit, stupid shit...\n\r\nOne great big festering neon distraction,\r\nI've a suggestion to keep you all occupied\n\r\nLearn to swim\n\r\nMom's gonna fix it all soon\r\nMom's comin' round to put it back the way it ought to be\n\r\nLearn to swim\n\r\nFuck L. Ron Hubbard and\r\nFuck all his clones\r\nFuck all those gun-toting\r\nHip gangster wannabes\n\r\n*Here he's saying he hates scientologests, gang members...*\n\r\nLearn to swim\n\r\nFuck retro anything\r\nFuck your tattoos\r\nFuck all you junkies and\r\nFuck your short memory\n\r\n*Tatooed people, narcotics users...*\n\r\nLearn to swim\n\r\nFuck smiley glad-hands\r\nWith hidden agendas\r\nFuck these dysfunctional,\r\nInsecure actresses\n\r\nLearn to swim\n\r\n'cause I'm praying for mayhem\r\nAnd I'm praying for tidal waves\r\nI wanna see the ground give way\r\nI wanna watch it all go down\r\nMom please flush it all away\r\nI wanna see it go right in and down\r\nI wanna watch it go right in\r\nWatch you flush it all away\n\r\n*He wants god to end the world, once again.*\n\r\nTime to bring it down again\r\nDon't just call me pessimist\r\nTry and read between the lines\n\r\nI can't imagine why you wouldn't\r\nWelcome any change, my friend\n\r\nI wanna see it all come down\r\nSuck it down\r\nFlush it down\t\t\t\t\n\t\t\t\t\n\n", "comment_467": "\ni think the song is talking about the apocolypse[[if i spelled that right]] and how everyones scared of it. but they won't know it happens until it does and theyre just gonna stand there like idiots amazed. but i cant figure out about the ''mom'' part..maybe mother nature or do they think the devils their mom? well im dumb so sorry.:)\t\t\t\t\n\t\t\t\t\n\n", "comment_468": "\nits obvious maynard is referring to mother nature correcting the balance that is that true higher power of the universe.  there are three powers in the universe: good, bad and neutral. mother nature is one of these powers that works to correct itself when the balance tips.  \n\r\nWhat tipped the balance, you ask?\n\r\nWe are.  All the materials we create in the world every day.  The technology we come develop.  We hold the power of higher knowledge that is both our blessing and our curse.  It gives also the ability to deceive.  Lie.  Cheat. And the concious to make that decision based on calculation.  The more advanced we get the more corrupt we are susceptible to becoming as is happening now with the vast majority of the world.  Therefore mommas comin to wash it all away.  ^^\t\t\t\t\n\t\t\t\t\n\n", "comment_469": "\noh and btw :\n\r\nFret for your figure and\r\nFret for your latte and\r\nFret for your hairpiece and\r\nFret for your lawsuit and\r\nFret for your prozac and\r\nFret for your pilot and\r\nFret for your contract and\r\nFret for your car\n\r\nhairpiece and lawsuit should be switched around.\t\t\t\t\n\t\t\t\t\n\n", "comment_470": "\ni mostly managed to discern most of the lyrics after about of having the album for a year, i never really start to tune into the meanign untill LONGGGG after i retrieve it.  the words and the feeling started to  come to me when i was listening while driving up to Detroit to see my brother.  i didnt even realize he was talkign about LA un till i rea this just now, and considering the name of the song i jsut kinda figured it was a general \"redeem yourself somewhat or gtfo/die \" to everyone that can hear sounds or read words.  basically, the songs title means \"spiritual cleansing\" maybe...\"spirtual cleasning out the butthole\".  the entire idea od the album and the linking of Ã\u0086nema and Lateralus kinda is like a chronoligical progressive order>>> Find your inner spirit/peace  and then...die.\n\r\nLordjezz, that was an itneresting comment about the beach front :P\n\r\npersonally, i think the effort of the instrumentals in the song was rather wasted on an idea that Tool hates California.  so i choose to believe something alot more meaningful, however Tool did make alot of music to make peopel think it has some meaning, when REALLY, it was just a load of bullshit or something that the guys wanted to watch be murdered by the people.  and thats still cool.  lol\n\r\nbut all in all, i think this song is like the funeral hym being sung for the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_471": "\ndid you know not as many people in california can swim as you think they would?\n\r\nprecisely maynard's thought ^.^\t\t\t\t\n\t\t\t\t\n\n", "comment_472": "\nrural america ftw\t\t\t\t\n\t\t\t\t\n\n", "comment_473": "\ndirected to hano0k:\r\nyou say that we are disrupting the 'balance' of \"mom\".  alot of people think that the world is in a good balance right now. but of course, they havent lived NEARLY long enough to know what change really is.  there are some people like yourself, that believe that we are disruptin the chemistry of the planet.  then there are people like myself that ask/say \"if we are disrupting the planet, why are we on it? if we are disrupting it, why are we STILL on it?\" you dont see previous communties of millions and millions of years ago saying shit like that right?  i think in a kind of awkward way that when \"mom\" gave us a place on earth, she made room for us and our mistakes.   technically i dont think that we are hurting the planet, jsut kinda giving it a push :P\r\nwe are the sole survivors of our own planet, and our own doings.  the planet is NOTHING without at least 1 (one) single human being to see it, recognize it, feel it, bind with it, control it, worship it, and FALL under it.  that goes for animals as well, they do not care that they dont control everything.  they only control that of which they need to survive.  never taking more they can handle.  they do NOT worry about the end of the world, the end of their spiecies, their own death.  they can only take the minor precautions to get away with survival etc.\n\r\nback to the topic, in my own personal opinion and belief,  if we are destroying the world with our fuel emissions, smoking cigarrettes, cutting down trees, killing off species, because of our technology, then we would not have been given the ability of free will or any kind of progressive thought process like designing the computer or whatnot.  God or Allah or any Higher Power more or less probably doesnt give a shit or two about the planet.  not a single fucking caring hair.  NONE.  i think it was actually the Prophet Mohammad that sed the only thing that matters is what we do before we die.  and i think this whole concept of Armageddon is metaphorical, and thus you should probably get your shit together.  the planet has certainly become too trashy, alot less pure, and alot less optimisitc and spiritual.\r\nthis is OUR time to redeem ourselves.  we're about to be judged one way or another.\n\n\r\ni love to think that our body is a temple.  its a conduit.\r\nour bodies is the fabrication tool used to find spiritual peace.  why do u think the good die young?\t\t\t\t\n\t\t\t\t\n\n", "comment_474": "\nwhile im here, i might as well take a moment to adress something.  \n\r\nwe as Human Beings, in fact have the ability of reason.  its a rather imperfect concept, more or less rational, but nonetheless its a feat that is not optional.  we CAN NOT help that fact that we were born into terms of hatred and madness.  it is what perfects us in means on imperfection.  precisely my current subject.  we are completely IMPERFECT to the point of perfection.  we are perfectly imperfect/irrational.  \r\na mildly disturbing example is like back in the old days of heirarchical trees.  a kind and wife would breed to make a prince and princess, who would in turn mate to make 2 children that would breed.  much liek dogs.  they are inbred in madness and imperfected body and blood in hopes that one day they would become the most pure blood that may start the chain again.\n\r\nall of our faults, our mistakes are what in fact make us more mature, grown up, realistic, rational, perfect.  no i dont mean perfect as in hairstyle, body shape, sense of humor, intelligence - that all comes in some form of a balance, but what i mean is in means on spirit.  the body we were given is precisely a temple as they claim.  funny thing about that is our crown chakra is sitting on the 'throne' in the 'temple'  LOL\r\n-.-\r\nmorale of the story:  dont take anything to seriously that your bubble will burst.  there is ALWAYS room for mistakes and fuckups.  if your boss or authority doesnt think so, 'fuck em'\r\nthere has GOT to be infinite space for what seems to be the infinate amount of people.  bottom line here is basically to find your moral center, find happiness, maybe even find some love, and you are all set for whatever might happen > meteor armaggeddon, flooding, metaphorical havoc of the world, aliens, bible, world war, or even....nothing.\n\r\nyou are prepared ^.^\t\t\t\t\n\t\t\t\t\n\n", "comment_475": "\nPlease be open minded enough to at least accept opinions here.\r\nAlso, I gravely want to apologize for all of the grammatical errors I posted above previously, I simply wanted the information out as it was coming out of my head.\n\r\nThanks for reading,\r\n                               -Armithel\t\t\t\t\n\t\t\t\t\n\n", "comment_476": "\nWho is L. Ron Hubbard and what did he do to maynard to make him hate him so much?\t\t\t\t\n\t\t\t\t\n\n", "comment_477": "\nLady   eXo,  L. Ron Hubbard is the creator of Scientology. Wiki claims that Maynard hates anything that would potentially constrict the progression development of a human being.\t\t\t\t\n\t\t\t\t\n\n", "comment_478": "\nSo everybody for the most parts got the same ideas of this song. I live in Chicago and I know its nothing to L.A. but everybody here is superficial and I always want the end of the world to happen now, just to watch these fuckers try and survive based on human instinct and human progression...only a handful could be successful in surviving any events whether mother nature \"cleaning house\" or anything man has to destroy himself by. I feel the pain in the song...watching what Man has become, i pray for the end of the world because it makes me so sick, fucking Starbucks drinking suits or stupid ass bitches with dogs in their purses...its called a leash make your fucking dog walk.\t\t\t\t\n\t\t\t\t\n\n", "comment_479": "\nA lot of this song is talking about how people could not live without stupid material possesions, and they are always worrying for them. 'Learn to Swim' refers to people needing to stop being so shallow and superficial. He wants it to all leave and be done. Flushed away.\t\t\t\t\n\t\t\t\t\n\n", "comment_480": "\nI don't even think that Maynard is referring directly to LA. This song seems to be saying that with the way our culture is today, we basically need a social enima. We need to clean ourselves from the way we are heading towards and strive for a better tomorrow. He seems to be saying that when that time has come for this cleansing of the souls, you best be prepared. \"Learn to swim\" I feel is basically saying, survival of the fittest (or smartest). If you're able to withstand the cleansing of the human race, then obviously you are either stronger, smarter, or luckier than the rest of the population. \"F\" everything and anything that our culture is heading towards and has become because it's useless. The only meaningful thing to life, is life itself. \t\t\t\t\n\t\t\t\t\n\n", "comment_481": "\nCalifornia is primarily where our 'Trendy' media is based.  This song is a statement about how the trends aren't going to stop, they're not going to become less rediculous, and how none of them make a difference.  There are things much more important in life and the trends just distract you from what's real.  California is a great place to base this song, because california is on a faultline, and scientists have theorized that one day it will sink away from america because of the fault line.  An enema is cleaning Crap out of your colon, so what better to compare a flood drownding Cali than to an enema washing the shit out of your colon.\t\t\t\t\n\t\t\t\t\n\n", "comment_482": "\nDo any of you wonder if the \"borderline\" in Stinkfist and the line he refers to in Eulogy (\"Don't you step out of line!\") and Pushit (\"bang your head upon the fault line\") as well as AEnema's \"try and read between the lines\" have a sort of connection? I mean, they're all in the same album.\n\r\nIt could be just nothing (since they're widely used in everyday language), but I'm curious if anyone picked up more than what I did.\t\t\t\t\n\t\t\t\t\n\n", "comment_483": "\nhim and his wife also own a vineyard just off arixona bay\t\t\t\t\n\t\t\t\t\n\n", "comment_484": "\nLast summer I read a series of articles at anthropik.com/thirty/ that may shed some light on this song (be influenced by the same sources and have the same ultimate message).\n\r\nThe articles say civilization is unsustainable and an unfortunate accident and will inevitably collapse, but quality of life will then improve for those who survive and it's a good idea to gain some basic survival skills (\"learn to swim\"?) in order to live through the collapse. It sounds like the song is saying more or less the same thing.\n\r\nSorry if this duplicates what someone else has said; I haven't had time to read all 20 pages of comments.\t\t\t\t\n\t\t\t\t\n\n", "comment_485": "\nThis song is also a play on one of bill hicks, comedian, good friend of tool, stand up performances.  Not just LA, but the entire us...u focus on the media, and follow these jackfuck actors and actresses tryin to fill ur life with all that garbage on tv, news, govt, etc.  Learn to swim\t\t\t\t\n\t\t\t\t\n\n", "comment_486": "\nThese people who are so self involved with living in this world of shit, and we are constantly subjected to these \"famous\" people that life in essence loses all meaning.  I try to think way outside the lines and understand that my time in this wasteland is short.  I'm just passin through.  And until I reach my own divinity, I will never be satisfied with any earthly object!\t\t\t\t\n\t\t\t\t\n\n", "comment_487": "\nits not about the apocalypse, its about California breaking off at the san adreas fault or whatever fault is like splitting the state up and all the people that would die and how happy that'd make maynard\t\t\t\t\n\t\t\t\t\n\n", "comment_488": "\nIm sure he's talking about how people complain about the pettiest shit but someday, mother nature is gonna fix it by the eartquake thats supposed take out California seperating it from the US, stupid egotistical hollywood dramatic people (no offense not all, his words not mine) see you in \"Arizona bay\" so LEARN TO SWIM! Imo\t\t\t\t\n\t\t\t\t\n\n", "comment_489": "\nI believe the song is about his views on what humanity has become, and his belief that we need a purging.\n\r\n\"Here in this hopeless fucking hole we call LA\r\nThe only way to fix it is to flush it all away.\"\n\r\nThe preceding is an obvious example of this. The references to scientific, Biblical, and other means by which the earth could come to an end are very simply stated.  The biblical flood, a meteor that took out the dinosaurs, and earthquakes.  \n\r\nGreat song, great meaning.\t\t\t\t\n\t\t\t\t\n\n"}