{"comment_0": "\nits good stuff... great great song\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nwhy dont more people talk about this band?? they are damn great, my freind from the woodlands is obsessed with them, more ppl should listen to them. BLOODY FOOLS!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ndude panic is the shit!..i am from augusta ga and they are from athens ga (about 1.30 hrs)...they have been playing forever..everyone needs some WP\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis song got me into panic. panic fans are everywhere, take a trip across the country and you will find this out.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nfuckin amazin\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nPanic is quickly becoming one of the more popular bands around.  Also, they are unreal live....great show they put on.  I cant wait to see them this summer tour...it will be a good time.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI never thought I could like a neo-hippie band. Until now. This song is so amazing, word of this band must be spread! I love the country/folk feeling it captures, and the singing is spot-on. It's a constantly changing song; Panic knows how to carry a song from beginning to end. I would give up Rammstein for this song, which is saying a LOT.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis is a great song. A classic spread song\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nAbout lifes sucky nature of lfe. I believe the word \"Grand\" was chosin, by JB the English major, from \"The Catcher in the Rye\". If you've read the book, you know the main character thinks \"Grand\" is a phony word.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI think Houser wrote the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI have been told that Michael wrote this song downtown Savannah. \n\nI've also heard Michael had a place on Tybee. \n\nI've slowed down but can't wait to see the boys again I may have a couple shows left in me.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nWhat makes this song so grand?\nWell, apart from the tight, upbeat, danceable yet ethereal, piano heavy, almost bluegrassy music, that seems to pull you effortlessly into itâ\u0080\u0099s magical, feel good rhythm, it tells the universal story of negativity turned positive by an act of love. Here is this guy, heâ\u0080\u0099s lost, maybe bitter, judgemental, looking at others saying â\u0080\u009cWhat you knowin?â\u0080\u009d As he spends his money at the liqour store, sarcastically thinking â\u0080\u009cAinâ\u0080\u0099t life grand.â\u0080\u009d Even â\u0080\u009cMy wifeâ\u0080\u0099s got the bluesâ\u0080\u009d and â\u0080\u009cNow Iâ\u0080\u0099ve got themâ\u0080\u009d too. Indeed, negativity spreads like cancer amongst us if we let it. But what happens in the song that changes everything and makes the â\u0080\u009csun come outâ\u0080\u009d? He did something positive in the face of it all and brought his wife a kiss, which magically made â\u0080\u009cthose blues runâ\u0080\u009d away. Then his mind cleared from the dusty clouds(of alcohol?) and he felt rejuvenated, with a fresh mind like a child. â\u0080\u009cAnd it felt GOOD!â\u0080\u009d One simple kiss of love changed everything, even the music gets livelier and happier. Itâ\u0080\u0099s no wonder then, that the song makes you want to dance. Ainâ\u0080\u0099t life grand?\t\t\t\t\n\t\t\t\t\n\n"}