{"comment_0": "\nTyler wrote this song about a person (a girl most likely) that had the ability to knock the wind out of him or steal his air. He created the term 'air catcher' to describe one who steals the air out of his lungs because he finds that person to be engaging, shocking, and awe-inspiring. Obviously, this person (let's pretend this person is a girl Tyler is in love with) has a certain paralyzing effect on our beloved lyricist, Mr. Joseph. However, he is wary of love and its tempting ways. The chorus \"I won't fall in love with following\" makes use of the gerund \"falling\". In this case \"falling\" refers to 'falling in love'. Tyler declares he won't fall in love with falling in love, meaning he won't fall in love with someone just because he wants to be with someone or because he seeks a soulmate, but he desires a real connection in which a girl really amazes him and is worthy of his love besides the fact that she loves him back; she amazes on her own. Furthermore, the opening lines \"I don't fall slow like I used to; I fall straight down\" imply that Tyler used to take things slow, but his injured soul quickly attaches to the first person that shows him kindness and love. Lastly, the lines \"I'm here to give you words as tools that can destroy my heart\" mean he will tell this girl that he loves her, making him vulnerable, because everyone knows love hurts and attachment promises some degree of suffering.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nit's 'i won't fall in love with falling' and 'and i just don't say what you want to hear' :)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni think of the air catcher as his way to save himself from the darkness. its a good thing. and he needs it to get better. but the person who stole his air catcher has come into his life. this might not even be romantic. maybe just a toxic friend. but this person has been influencing tyler and taking his air catcher and his safety. but as his air catcher keeps disappearing he becomes very conflicted whether he should fight this or not. he shouldnt fall in love with being sad but hes rethinking protecting himself. this song just gives me something to relate to when i feel i have a person in my life who is stealing my air catcher\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIt seems that he is trying to decide if he should give up his right to defend himself when God brings hard times into his life and in the end he chooses to surrender.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think it's a song about falling in love with someone. The term \"take your breath away\" kind of strikes me as something an \"air catcher\" would prevent. Thus, the narrator is in love, whoever they think of took their breath away, as well as the air catcher that they can't use to bring it back.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nAir Catcher was the first song from this album to really catch my attention and I listened to it nonstop for a few months. I absolutely love this song and this is what it means to me.\n\nI fall straight down\nYou've stolen my air catcher\nThat kept me safe and sound\nMy parachutes will get me\nSafely to ground\nBut now the cord's not working\nAnd I see you staring me down>\nI've always thought of \"you\" as being someone or something that's negatively affecting his life. Such as a toxic friend, illness, or just bad situations. I like to think of \"you\" as depression or anxiety, but it's totally open to whatever you're personally dealing with. The parachute is something that's been helping him in his life, and \"you\" breaks the parachute, and suddenly he's free falling.\n\nThe moon in a pretty contest\nAnd the moon just happened to be\nThe very first thing that I missed\nI was doing fine on my own\nAnd there wasn't much I lacked\nBut you've stolen my air catcher\nAnd I don't know if I want it back>\nThe problem is beautiful, like how depression and things like it can be really poetic and make life more interesting. He was doing alright before the problem showed up. When it did come, it messed up his life, but made it more interesting and he's not sure he wants to be free of this problem.\n\nLove with falling\nI will try to avoid\nThose eyes>\nThe chorus is about how he's not going to let \"you\" control his life. People tend to own their problems in a way, and they don't want to let them go. In other words, there's a part of them that's \"in love with falling.\" It's the same with friends whom you like but are bad for you. He's trying not to become attached to this problem. He doesn't want to give it/them the information or control that will destroy him. \n\nWhat you want to hear\nSo I'll write my fears\nAnd I don't believe\nIn talking just to breathe\nAnd falling selfishly>\nThe bridge is a little less straightforward. The first part seems to be talking more about his resistance to give the problem authority, and the second about how keeping this problem around (especially long enough for it to become bad enough that he dies or something) is selfish. \n\nLove with falling\nI will try to avoid\nThose eyes\nBut now I'm here\nTo give you words\nAs tools that can destroy\nMy heart>\nThe last chorus is my favorite part because it's not a victory. It starts out the same as before, he's trying to resist, but despite that, he still gives up and gives the problem what it needs to destroy him.\nAnyway, that's just how I see it. Thanks for reading my really long comment; I hope you got something out of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nAn air catcher is just another term for the parachute he mentions.  He's used to being in control of his feelings when he is in a relationship, which means that he allows his love to evolve on his own terms and controls it with the \"cord\" he mentions.  He \"parachutes\" into love at his own pace.  But he has lost control of his air catcher with this woman; he is falling in love with her.  However, he is uncomfortable with giving her the tools to destroy his heart (saying that he loves her which opens him up to this pain).  By the end he decides to say he loves her and give in to his love for her even though he knows it will open him up to being hurt by her.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think he's using a parachute as a metaphor. Parachutes catch air underneath them, that's how they keep people in the air (where they want to be) and safe. \"My parachute will get me safely to ground. But now my cord's not working and I see you staring me down\" almost sounds like he's referring to Blurryface, like someone wants him dead. \"Who is Blurryface and why does he want me dead\" seems like it could fit the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nHe is talking to God, acknowledging that he wants the world and struggles against the call but at the end of the song, accepts the call. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI think this one is about the fear of \"falling\", or falling in love. The air catcher basically is just a parachute and that's metaphorically how he always caught himself before he could fall too hard for someone. However, this person has now completely knocked him out and although he's afraid of falling in love, he doesn't want it to stop (\"you've stolen my air catcher, and I don't know if I want it back\"). He knows that if he loves this person he opens himself up to vunerability and is allowing the possibility of getting hurt (\"tools to destroy my heart\").\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI think the lyric \"I won't fall in love with falling\", means for me (my interpretation relating to my life) is saying that \"I'm not going to fall in love with the idea or the routine of constantly giving up, or in other words 'falling'\". This is my opinion or interpretation of where I think this lyric stands in my heart.  |-/\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nTyler is talking about god. I donâ\u0080\u0099t think itâ\u0080\u0099s about falling in love since he says â\u0080\u009cI dont fall slow like I used to, I fall straight downâ\u0080\u009d, which I interpret as him being vulnerable to falling into pits of depression very easily. The air catcher is a way to get away from depression/bad thoughts, and in a way he blames god for not being able to escape these thoughts. When he says he wonâ\u0080\u0099t fall in love with falling, heâ\u0080\u0099s saying heâ\u0080\u0099s trying not to fall into depression. He wonâ\u0080\u0099t fall in love with the idea of being depressed and in a broken down state. He wants god to understand that heâ\u0080\u0099s trying his best to be a good person, but his depression is oppressive and something that he canâ\u0080\u0099t control. He isnâ\u0080\u0099t falling selfishly because he has no control of it. He says words will destroy his heart, which I think could apply to a person who judges him and makes him feel more depressed, and not god. \t\t\t\t\n\t\t\t\t\n\n"}