{"comment_0": "\nThe line \"There's nowhere you can be that isn't where you meant to be\" gives me peace of mind in times of trouble...because it tells me that not everything is just left up to chance...we have a higher purpose.  Nothing is a coincidence.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nin a time when the bands like the Rolling Stones were writing songs like Street Fighting Man and Paint it Black which were anti-vietnam songs (dont get me wrong, i think those songs are great), those songs merely stated the problem.  The Beatles wrote this song which states the solution, all you need is love.  This is just one reason why they are the greatest band ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\n\"Thereâ\u0080\u0099s nothing you can do that canâ\u0080\u0099t be done.\" \r\n\"Thereâ\u0080\u0099s nothing you can make that canâ\u0080\u0099t be made.\"\r\n\"Nothing you can see that isnâ\u0080\u0099t shown.\"\n\r\npeople think they're powerful but they have limits. you cant do anything special. you cant do anything impossible. You are limited by reality. whats special about winning a gold medal? its not like you did the impossible you just did what was possible. figure out a science formula its know great achevment. if it wasnt possible to figure it out you never would have.\n\r\nachevments are nothing all you need is to enjoy life and love. being happy is all that matters.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIn case you didn't know, this song is about love, and how its all you need. \r\n:)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI really love the ending , when paul sings \" she loves you ,yeah, yeah yeah.\" Thats so cool. This song also makes me think of a guy that that got away from me. This is his favorite beatles song.  Hey Jason , where ever you are.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nMy favorite part is \"No one you can save that canâ\u0080\u0099t be saved. \" this is so true. This song is very relaxing and comforting.  In times of stress I like listening to it\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nAnyone notice the sarcastically used governmental tune in the beginning. To me the song ahd always been saying all you need is love. The governmental tune in the beggining though mocks government and how it demotes anddestroys love.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe verses are done in a 7/4 time signature, which I find to be an interesting and odd choice.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI love this song... but it still sounds very weird to me to hear the French National Anthem at the beginning... because itâ\u0080\u0099s not about love at all! Itâ\u0080\u0099s about bloody flags, people being slaughtered... about going to war, or rather to fight for the Revolution so itâ\u0080\u0099s rather inappropriate when you really think about it. \r\nBut still, great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nWhen I was a young hippy living in Tenby, I remember seeing \"All You Need Is Love Is All You Need\" painted on a wall.  I thought that was kinda cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nAnd the wealthy howled with laughter..\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthe whole song is great, and was perfectly chosen as the athmen of the new millenium here in the UK.  also love the effective use of the beginning of the French national anthem as the intro to the song and also the end where u hear Paul getting a little too happy shall we say and start to sing another great song of theirs 'She loves you yeah, yeah, yeah!'\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthis song is just staying the obvious love is everything,its the purpose of life its self.\r\n i believe when Paul starts singing \"she loves yeah,yeah,yeah\",he stumpled into the recording session a wee bit to drunk-j/k,that would be impossible considering they recorded it on live television.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI agree mostly with what everyone here is saying.  It is basically conveying the whole beatles message.  Reminds me a lot of The Word- the word is love.  It's all that matters in the end.  Speaking of in the end, the love you take is equal to the love that you make.  That's what I get from all of this.  Same with the everybody and all together now parts.\r\nAnd when paul comes in with she loves you, it's perfect.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI think that this song really represents a lot about what The Beatles believed in and went about saying through most of their career. And I agree with poetgirl, the lyrics \"There's no where you can be that isn't where you're meant to be\" are my favorite in the song. It just makes me feel good when I'm upset about something. This is just a great song because really all you need is love!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nadding to the 'she loves you' comments, they also fueled the 'paul is dead' controversy. toward the end of the song, john says 'yesterday,' but it sounds like 'yes, he's dead' and the first time he says 'she loves you, yeah yeah yeah' it sounds like 'we loved you, yeah yeah yeah...'\r\nand i agree, the song is brilliant\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThe nothing you're meant to do is wrong (that whole bit of the song) is indeed the most powerful to me and states that nothing you do is wrong as long as there is love, and yes...it does give us somewhat of a higher purpouse if you think like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\ni agree with taking comfort in the line \r\n\"There's nowhere you can be that isn't where you meant to be, (its easy...all you need is love...)\" \r\nas i like to think that we are all just following our destiny and that the only other thing we need to help us along the way is love. \r\nIf everyone followed this song the world would be a better place.\r\nAll you need IS love\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nExactly, everything has been said and done. Everything. So there's no reason to make the world any more worse.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI was born on June 25, 1967.\n\r\nThe same day that this song was performed live\r\nand transmitted all over the world to TVs everywhere,\r\nin the first international simulcast in history.\n\r\nThe Beatles, The Rolling Stones and everyone was there.\r\nThat's what this song means to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nwhoa maharishi thats prettay cool! yeh this is an awsome song :D\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni hope no noe is to critical when interpreting this song, because honestly its such a great message.\n\r\nimagine all of the evil people in the world were given nothing but love? i dont think they'd turn out to be so evil.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni listened to this song earlier today, and it literally SENT SHIVERS DOWN MY SPINE, these are changing times i feel it, i'm more hopeful than ever before, THERE'S NOTHING WE CAN'T DO, i believe this wave will bear our weight SO LET IF FLOW, if you like this also see sit down by james.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nSIT DOWN\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis is the last song I listened to before I signed on, so I thought I might aswell add my 2 cents.\n\r\nEveryone always quotes 'Imagine' by John Lennon as being the ultimate peace anthem, but I think that this song does a better job of expressing the idea that there is nothing that is impossible to us, if we just have love for one another.\n\r\nA brilliant song.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nGood job spreading love, folks.\r\nDo me a favor...do The Beatles a favor...do John Lennon a favor...do everyone a favor...do yourself a favor:\r\nLOVE...just love...everybody...including yourself...please.\n\r\n\"Nothing you can sing that can't be sung\"\r\nYou aren't new.  Stop holding your pride in your identity and differences.  Enjoy all of the differences of all people.  Stop fighting because someone is either better than you or completely opposite in some way or another because everyone is.  Embrace and love the differences in others and share your interests that are similar.\n\r\nLooks mean shit.  Cars mean shit.  War is shit.  Religion means shit.  Everything means shit, but LOVE.  All you need is love...and not that lame, pathetic dream-love...REAL LOVE, unconditional, friendly, helpful, true, pure love.  Forgive, never forget, learn, understand, and turn that knowledge into compassion: a love that CAN NEVER DIE.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI may be a little paranoid, but i swear that someone say's \"check it to me\" before the song\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nAll You Need Is Love... i believe everything that needs to be said is right there in the title... imagine if this was the anthem for the world... maybe it should be\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\ni like this. song. good. lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI get speechless when I hear this song. It's SO...amazing!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nthat's good. \"Love's you yeah, yeah, yeah\" that's the best part.\" Also I love the fact that Mick Jagger (I think) was there when they recorded this song live on TV. Yeah, he was digging it, so I think that showed that they were all friends and everything.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ni'm surprised there isnt more controversy about hte \"yesterday\"/\"yes he's dead\" thing. \n\r\nat the end of the song it sounds like john is randonly saying \"yes he's dead\", referring to the whole \"paul is dead\" rumor. i dont believe paul is dead, but it really does sound like john's saying that! \n\r\nany opinions??\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\niwuzlykyea, i definitely hear that too, but i dont think he's dead. That would kinda suck. lol\r\nThis song... Well, for me, if I listen to it too much it kinda gets on my nerves, but it's pretty dang awesome in small doses. I like the ending where it gets all crazy.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nBasically, summing up the whole Beatles philosophy, a beautiful song about unity and brotherhood.\n\r\nYay for Beatles!\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\ni'm sorry prilla, but i'm not sure i'm with you 100% on what you said.\r\n'religion is for shit'?\r\nreligion brings people together in ways. but sadly, apart as well. religion gives us hope.\r\ni do agree with the rest you are saying though, it's just that that part, was not comprehensible to me.\n\r\non the other hand. i love this song. and, the first time i heard this song, i never heard that whole paul hoax hidden message thing. i clearly heard \"she loves you yeah yeah yeah\" it comes from the song \"she loves you\".  when i heard that line to be interpreted as a paul hoax thing, i thought it was weird that some people would think that. \n\r\nlove really is all this world needs. and now, more than ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI just realized that what I thought is pretty much exactly what alliwantisu2 said:\n\r\nIt seems to me like it's saying that everything in life will work itself out. \"Nowhere you can be that isn't where you're meant to be.\" so that, wherever you go, whatever you do, you don't need to worry about it because it doesnt matter how you think it should turn out. What's going to happen will happen, and what isn't meant to be, won't happen. So therefore, the only thing you need to worry about is loving. It's all you need to work on, all you need to hope for, the only thing in your power.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\n\"Invention in F Major\" written by Johann Sebastian Bach is played towards the end, with brass and somewhat transposed. They also juxtaposed the round that Bach had intended, causing the instruments to clash a bit more, and sound a little harsher. After the Invention was referenced (briefly) another type of music was referenced... \"Big Band\" I suppose. \n\r\nNot that these excerpts mean anything significant, but perhaps Bach provided the Beatles with at least one piece of inspiration.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI hate to burst your bubble folks - this song is not really about \"love and peace\" like you all think and like the hippy movement seemed to want it to be.  Read Hunter Thompson's Authorized Biography of The Beatles (aptly called, The Beatles) and the boys from Liverpool tell you themselves the inspiration for this song (first heard during the first ever World Wide Live Broadcast from Hawaii using the first ever Communications Satelite - an invention of Arthur C. Clarkes who was among the many famous you will see if you watch the video).\n\r\nHere it is:  Every phrase is a statement (paraphrased most likely) made to the band by the at the time deceased Brian Epstein, their manager who took the band to fame by molding their image.  There's nothing you can't do, there's no one you can't be, there's no point in getting all political, keep the image and sing love songs.  That was Brian's message to the band - this song was their message to themselves and the world that they were now a new band.  Read the book.  The line at the end, from \"She Loves You\" (an early Beatle hit) was sarcastically added to point out the type of music that the band was no longer interested in creating.\n\r\nAs a side note, Paul McCartney's \"Silly Little Love Song\" was in reference to this - suggesting it was all Lenon's idea to vere from the formula.  The old Lennon vs McCartney thing I s'pose.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThe last line should have been:\n\r\n\"No-one you can love, that doesn't want your love\".\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nBaccus93 - I can believe that. It's a feal good song definately but life is a bit more complicated than that.\n\r\nBesides love is a selfish emotion, you really only love those that make YOU feel good about yourself. We love beutiful successful desirable people because if feeds our own ego. We say we love them because it makes them more maliable to manipulation.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI hate when they use this in some commercials, especially for something like diapers or whatever, but the message is positive... so, I guess, why not? It was written during the Vietnam War.... Meh, hopefully the War in Iraq and the genocides... and just violence in general, will stop... one day soon. Logically, of course, that probably won't  happen.  Ah, if only love could be the answer. xsigh.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nAll you need is Love...the world should be using this as its anthem. This song and Imagine really sum up what John Lennon was and will always be.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\ni belive that its just about how we dont need war or violent ways to get somewhere or to prove a point maybe in this period of time and now all we want is peace and love not war\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nMeaning is pretty simple-all you need is love.  Very true.\r\nBut why I'm posting here is because I wanted to know if anyone else hears someone whisper \"Check this\" at 00:25 ?\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nthis song means that genuine love will compel everything else to work well.  because when you are love then you will be inspire to succeed in you work, marriage, family and leisure. so love in very fundamental to success.  this is my secon favorite song after don't let me down.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nBaccus93, i would definately believe what your saying, it makes a lot of sense.\n\r\nand Johnny0225, yeah i hear it ! it took me a few times but then i put it on really loud and i heard it. how strange.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nTrue \"Gang\" All we EVER need is LOVE. If we all realize that, maybe the world would be better.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThis song is one of my favourites by the Beatles.\r\nIt is so simple but so true. \r\n\"All you/we need is love\".\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nOne of the most beautiful songs of all time.  You have to love the chorus.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI Love This Song\n\r\nAll You Need Is Love\n\r\nTitle Says It All\n\r\nI Love The Fact That With The Beatles, You Can Look Into It As Much As You Like, But The Meanings Are Already There.\n\r\nLike\n\r\n\"Let It Be\"\r\n\"All You Need Is Love\"\r\n\"I get By With a Little Help From My Friends\"\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nLove.\n\n\n", "comment_51": "\nThis song is simply THE song, the message is clear here, there's alot of people who don't get the message of love, but this song explains how simple love really is.\n\r\nI absolutely LOVE the beginning, btw.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\ni love this song except for these two lines\r\nThereâ\u0080\u0099s nothing you can know that isnâ\u0080\u0099t known.\r\nNothing you can see that isnâ\u0080\u0099t shown.\r\nYou can know something no one else knows at the time and you can see something that isn't shown like maybe in a song you might thing the meaning is a certain thing even though thats not what the artists are showing\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nphilomousike, Even if your the first to know somthing, then it is known, by you mate! Likewise if you or anybodyelse can see a thing, then it has been shown. Cheers\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nLove stands for american foreign policy and the beatles were created by the government lol jk jk its a good song\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI think this song is just saying that there is nothing you can do that no one else can do. The only thing that ONLY you can do is love the way you do. Love is unique to the individual and therefore defines you in a way, so we should hold that fact very close to our hearts.\n\r\nThat came out a little strange. =P Hopefully that made sense?\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis song is so fantastic. The Beatles are definitely the best band who ever lived. Even though it's a fairly happy song, it makes me cry because we live in a world full of war and hatred and greed, but if everyone could just realise that 'all you need is love', the world would be a much better and happier place. My friend said it the best - the meaning of life is love, because without it, we'd all kill ourselves.\r\nAll you need is love.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nWhen this song comes on during  Imagine: John Lenonn (documentary) it showed a bunch of people all gathered around the streets singing this song and Imagine (LOVE THAT SONG TOO) but when it shows that I always cry it is so sad.  \n\r\nALL JOHN WANTED WAS LOVE!!!\n\r\n~the spaceman lives~\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nJohn was an idealist and a dreamer.  It showed in his work and I respect him for it. I really do wish LOVE was all you needed.  Not yet.  Maybe someday.  \t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nPeople don't write songs like this anymore. It's got so much meaning. \t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nthere was a big fanfrae at the being of the song\n\r\nGOOD SONG IT MAKES ME HAPPY\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nSong speaks for its self. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nThere's a reason this song is so memorable after all these years...it's simple, yet full of meaning.  A great way to look at life.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\n'All you need is love'\n\r\nAll I need is your love.\r\nI already know I want this song to be played at my wedding..\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nWere Lennon and McCartney spending too much time hanging around the Redundancy Department of Redundancy when they wrote this?\n\r\nThere's nothing you can make that can't be made.\n\r\nReally? Never knew that.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI've always felt that the lyrics in the verses suggest that being ambitious and achieving things iis overrated and not as important as finding real love.\r\nI think that there are three key words missing in the lyrics but implied in the sentiment: Those words are \"By someone else...\"\n\r\nSo in my mind what John Lennon is trying to say is:\n\r\nThere's nothing you can do that can't be done...by someone else.\r\nNothing you can sing that can't be sung...by someone else.\r\nThere's nothing you can make that can't be made...by someone else.\r\nNo one you can save that can't be saved...by someone else.\r\nThere's nothing you can know that isn't known...by someone else.\r\nNothing you can show that can't be shown...by someone else. \n\r\nBut what you can put your efforts into is:\r\nLearning how \"to be you in time\"...accept where \"you're meant to be...and embrace the notion that \"all you need is love.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nMy all time fave Beatles song! \r\nMy birthday is 6/15/67....this song was recorded the day before I was born.\r\nThe day after I was born, the Monterey Pop Festival began!\r\nI'm proud to say that I was born in the Summer of Love!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nSomeone pointed out before that this song was perfect because anti-vietnam songs were the main hits at the time, so The Beatles released this. While I don't think that's why the song was made, this song couldn't have came at a better time.\n\nAnyways, I feel what this song is trying to say is that most people don't realize what love is. We can't feel love. We can't see it, we can't hear it, how do we know it's there? Because it's easy. Love comes from within.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\ntrue but that don't mean you're gonna get it\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nThe chorus is of course easily understood but I see no connection to the verses.  What does... \n\"Nothing you can make that can't be made,\nNo one you can save that can't be saved\"\nhave to do with the subject Love?\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nit would be so easy AND obvious to slag this song of as idealistically pretentious rubbish from drug addled hippies  ... so I'll state just that very allusion\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI like the video for this song where they are wearing the Sgt. Pepper Uniforms.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nThey weren't wearing Sgt. Pepper uniforms in the All You Need Is Love video...\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nLove is all you need.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI like the shot of big Mick Jagger in the video singing.  All you need is love....\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\n1st ever world wide satalite broadcast,  pretty cool uh.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nThis song is not only great,it is fucking excellant! and it is \r\npretty much self enplainitory,be cause you know what dude\"all you need is love\"!\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThe reason that they don't wear the Sgt. Pepper's uniforms in the All You Need is Love video is because All You Need is Love is on The Magical Mystery Tour album.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nI love this song so so so much.\r\nIt's absolutely perfect.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThis is such a great 'pick-me-up' song that you can listen to anytime and just love it. All of the lyrics are great and so true.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nthe begining of this song is the french national anthem\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\ni agree with them!\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nToday, 24 years ago, lennon has been killed.\r\nmay he rest in peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\ndo you find yourself ridiculous?\r\nsit down next to me\r\ndo you find you're touched by madness?\r\nsit down next to me\n\r\nin love and fear and hate and tears\n\r\nwe will win by peaceful means, NOT BY LISTENING TO VFACTORS CRAP POSTS\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\ni like this song\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nthis song is just amazing, i just makes u think, \"man....all you need is love\" the beatles....their music......had so much meaning...\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nfirst of all , prilla you are so right. i cant agree with you more. just try to love people. everything is trivial in this world except love\n\r\nand merry holdwine, i think the french revolution song is there sarcastically, reminding people that bloodshed is so unnecessary and we just end up hurting ourselves.\n\r\ni love this song. it's so simple and to the point.\r\nand oh yeah, is every one here British or something, because I see a generous use of words like \"bloody\", \"cheers\" and stuff that confuses  americans. aka me. so yeah, it'll be cool if someone explained these words to me....\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nGreat song, great lyrics\r\nthe meaning of this song is just awesome!\n\r\nALL you need is love...\n\r\nso perfect!\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nIf you had as much money as the Beatles, all you'd need would be love.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nGreat Song ,Great Group,the best thing that ever happened to music!!!Beatles # 1\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nhonestly, this song is the best song ever written\r\nand its simple, yet completely true\r\nand sierp, you are so wrong \r\n\"2 down 2 more to go\"\r\nim pretty sure you are the ONLY person who feels that way\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nMick sang backup vocals! *sigh*\r\nMakes me love this song all the more...:D\n\r\nBut anyways....it's a beautiful song. Very true..\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\ntoo true:\r\nlove is all you need.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nI refuse to believe that nothing is important other than love, and I also refuse to believe that John Lennon thinks so little of Science and Art.\n\r\nActually, maybe he's just thinking of Science and Art as a means; they are just things we can use to show our love for each other :)\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nEvidence that Lennons creative flow was drying up and Mccartneys work was more focussed and inspired.This is pretty cheesy and if it was any other group but the Beatles it would have been slaughtered.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nEverything is possible with love. With Love, anything is possible!\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nthis song is soooo wrong i love it but its soo wrong not wont always be there for you\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nPretty much all the Beatles' songs became really clear as far as meaning after reading \"The Present\" at truthcontest.com. There's a reason why it sounds like they're talking *to* you ;)\t\t\t\t\n\t\t\t\t\n\n"}