{"comment_0": "\nThat's illegal. She wants a human being for Christmas. Slavery is already illegal for about 2 centuries :P.\r\nCool song to sing along with :P (exaggeratedly ofcourse). I know what I want for Christmas: you! :D\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI, too, think that this is a great song, the best Christmas-themed pop song since \"Christmas (Baby, Please Come Home)\" by Darlene Love. This song expresses ideas that are universal no matter the time of year. The things that make us happiest in life are things we can't buy. Also, the things we want the most are often things we don't (or can't) have. Things that are seemingly out of our reach have an ability to enthrall our imagination and tug at our innermost emotions. I could go on, but I think Carey's song puts it so much better than I ever could.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song is great if you like Mariah Carey.\n\r\nLyrically, it's so much like every other Christmas 'love' song. All they want is the one they love. It never stops there, though. When people get what they want, they always want more.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nTHE GUY SHE WANTS FOR 00CHRISTMAS!!!! So obvious!! I love this song!!            \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n:D\n\n\n", "comment_5": "\nThis song is like cigarette smoke to me. I don't actually like it, but whenever I smell cigarette smoke it reminds me of holidays in Europe and puts me in a good mood. And although I despise this song, it reminds me of Christmas and makes me happy.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nShe did an interview with Smash Hits! UK once, and said that this song is about sceptacaemia.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nAriane, I definitely agree -- minus the whole Europe thing... but you get the idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthey play this song at my work since its christmas time now and everyone knows its MY song bc i love it sooo much. yea it gets annoying eventually, but its a christmas song.. ya gotta love it ;)Edited by mike on December 15 2004, at 06:46PM\n\n\n", "comment_9": "\ni think she wants a baby!!! hahaha oooo mayb she does oooo nevr put that line across b4 hahaha ok re-read possibly not\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nMCR version is muchos better\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthis is my gf and Is christmas song. great xmas song out there today compared to all the stupid lame Nsync  britney crap\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nwe had this as our end song 4 our pantomime this year. i mite add tho tht i was 1 of the MANY ppl hu protested against it. it wuldve been so much better if we had sung jingle bells or sumthin tht every1 knew the wrds 2 bcoz this girl rambles on soooo much. WE GET THT U WANT HIM 4 XMAS. we rnt so thick 2 realise tht afta her sayin it about 10 times.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThere's a My Chemical Romance version? AWESOME!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ni agree with der bulle.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song basically means: IT'S CHRISTMAS!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nChristmas!!!\r\nOi, i want a guy for christmas, too.. \r\nerm, nvm I have one. o_O\r\ngreat song! hehehe *goes hunt for her guy to get home for christmas*\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\n=)) well i agree with ya that it is talking about that she want a guy for ximas..well i like these song cause its ximas songs and it is beautiful..and it reminds me on love actually (movie)..its great movie..=))\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nJUSTIN!!!!!!!! lol If I had a buck for every time I played this on the piano thinking about or listened to it looking at pics of him i'd be rich, but really being with him is all I want for Christmas, but I think it's going to take longer than that for it to happen :'(\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nooo shhh . \n\r\nThis song is very festivus friendly .I've always loved this song ..\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nlol this song would be ok if somebody else sang it\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ntheres only so many times you can hear this while shopping at the mall, amongst a mob of ppl and not want to kill urself.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI can relate. I want someone for Christmas.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ni like My Chemical Romance's version of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nthere are many others who sing this song besides mariah carey - if i want to hear this song, i prefer to hear someone else sing this song other than carey.. =P  i like this song, because it's not the materialistic things that make the singer happy...it's the person he/she loves.. =]\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nhey MiKE yd u edit my post???\n\r\nadmin edit:\r\nbecause you keep using bold within your comments.Edited by mike on December 22 2004, at 01:44PM\n\n\n", "comment_26": "\nI love this song!It is (next to Crosby's White Christmas) my favorite Christmas song of all time.\r\nIt brings out the joy of Christmastime.\r\nI do not personally like Meriah Carey...but I dont go around insulting her with foul language.\r\nEveryone has their own opinions,and thats fine.But there just isn't any reason why every song I look up the comments on has distgusting,perverted and inmature language somewhere by someone just because they don't like the song.If they dont like it then why waste their time writing comments like that?\r\nI think that they should have rules against it.\n\n*We do..comments cleanedEdited by oofus on December 23 2004, at 04:14PM\n\n\n", "comment_27": "\nI have always hated Mariah Carey, I'm not fond of Christmas songs either, so this one really sucks. Almost as bad to that song she did with Boyz II Men. Mariah Carey Sucks Ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\n'Mariah Carey is a fat ugly bitch who is a joke to everyone that matters !!'\r\nU jealous bitch, i'd love to see u fill Madison Square Garden and try to have @ least one octav in ur jealous voice.\r\nShe's gr8 even if this song is a lil bit cheesy LOL\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nwow\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ni like the version in 'love actually'  it is done very well.  happy xxx-mas everyone\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nlove the song, hate her\r\nlol\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI like da MCR version better.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nbec tims.  don't be an ass.  you just want to start something. someone dissed mariah.  someone told her off.  it happens don't make a big deal out of nothing.  \r\nAnd Mariah, although she may not appeal to everyone's tastes, has awesome talent.  Whistle tones?  I wish I could sing like that.  She amazes me.  \r\nSo if you don't like her or this song and have nothing intelligent to say...why say anything?\r\n(and that isn't directed to comments like prefering mcr, or not liking her but still enjoying the song.  I'd say those are intelligent things to say and go for it!)\r\nAnd yay, i'm going to get bitched at for this comment because there are still little children on this site who just want a little drama.  go right ahead i can handle some drama. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\n^ im going with her...\n\r\nand i dont like the song or mariah\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nshe's got the guts and talent to make it big.  maybe she's sold her soul to the music/media corporations o_O... but hell, that's what SHE wants.  it doesn't make her amazing vocal talents any worse.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nNo offence to u people but i don\"t like it. What ever happened to Jingle Bells ,Frosty The Snowman, and Rudolf The Red Nose Reindeer.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nwonder if she did get him 4 xmas....?\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nShe can't sing O.o.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI hope she got something contagious for Xmas.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThis song is amazing. What a great upbeat christmas song!! Her voice, oh. Dear. Lord. Its just fantabulous!!! My chemical romance version sucks quite badly actually!\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nhahahahhahaha viro......\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThis song is okay. Not the best Christmas song evr...\n\r\nI dont no why i'm lukin dis up in midsummer \r\nn-e-way. \n\r\nLuvAwalktoRemember, i think ur a stupid bitch\n\r\nyeh suck on that 4 sum foul language, bitch\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\n^just kiddin\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThis my holiday anthem! I miss my baby so much!\n\r\nWith all the pieces,\r\n&hearts Julie\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nOK, so I'm listening to this song right now, and it's almost the end of summer. It just expresses that feeling of longing better than lots of year-round songs. It's really quite brave. I wish I could sing it to the person I want.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\ni love it- a happy xmas song :P\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\none of the best christmas songs, of recent times anyway. in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nCool song.. Im not a christmas person.. But she rocks.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nMerry Christmas, everyone!\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nNEWSFLASH!!! \n\r\nMariah wrote this song! Without her, you won't even hear MCR version.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\n\"I don't want christmas goodies, I just want you stay with me, cuz I love you...\"\n\r\nSuch a great song \t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nMariah Carey is a fat ugly bitch who is a joke to everyone that matters !!\t\t\t\t\n\t\t\t\t\n\n"}