{"comment_0": "\n\" My friends think I'm moving on\r\nBut the truth is I'm not that strong and nobody knows it but me\r\nAnd I've kept all the words you said\r\nIn a box underneath my bed\r\nAnd nobody knows it but me \"\n\r\ni truly do have a box underneath my bed. it holds everything he gave me , every love note, every movie ticket,even every thought i've ever written down about him..\r\nthe thing is..its been three years and ive dated many guys after him, my friends all think im over him but the truth is im really not. \r\nthe pain never goes away\r\nno matter how many people you end of in a relationship\r\nno matter how much time passes\r\nthe pain never goes away\r\nit justs gets easier to deal with.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI believe that this song is about two people who broke up awhile ago for reasons they now find ridiculous or can't remember.  Since they broke up, they've been trying to find something or someone new in their life to make them happy but nothing works.  They still have the same feelings for each other and they try to suppress the fact that they still love the other person but they can't... they can only hide it from other people, but in all honesty they constantly think of each other and want them back because they keep thinking about the love they shared (and didn't yet extinguish).\n\r\nI'm going through this right now.  I thought that I was insane for still liking my ex.  But last night he told me that he still crazy about me and has strong intense feelings for me that he can't hold in anymore.  I was so relieved, because we broke up three months ago and I haven't gone a day without thinking about him, I check his facebook page, relate every song to him and I, save all of our conversations online... and reread them over and over, and reminisce our past.  We're both relieved now that we know we still love each other \"after all this time\".\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni absolutely love this song\r\nits about this couple who broke up and after all this time they still think about what they had and they regret ever breaking up. \r\nim going through that right now\r\nme and my ex boyfriend broke up two months ago and i wish we were together now. :( but we can't because he likes someone else now.. hopefully someday in the future we can be together again, because we truely loved each other.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song makes me think of regret.  It's when two people look back at a relationship (or what could have been a relationship) and realize what they had, but they let it go and now they keep thinking back at what they could have had.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthis song is so beautiful and so are their voices.. i'm so happy i found this band :)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nthis song breaks my heart.\r\nit's exactly how i feel :/\n\r\nescpecially \"but if you're happy i'll get through somehow, but the truth is i've been screaming out\"\n\r\nGod that line hits me so hard.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\"but if you're happy i'll get through somehow, but the truth is i've been screaming out\"\n\r\nBest line in the song. You just want him to be happy because you care so much, that you push aside your feelings. \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nYou think about all the 'what ifs' and 'only ifs' and torment yourself with thoughts. Only if you had shown more love, only if you had done this differently, etc etc. You keep your thoughts and feelings to yourself because you need to seem strong to everyone, but deep down inside you are dieing more and more each day.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song really captures the tragedy of the \"would be love\" that I'm sure we've all experienced. They both loved each other but never said the words when it would have mattered. Perhaps they had a fight, drifted apart, or were too afraid of rejection to make something spark in the first place. Life will always be haunted with those \"what ifs\" if you don't tell that someone how you feel.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni have so much love for this song, though it is super sad. i believe it's about two people who miss each other and keep looking back on their failed relationship and wishing that they had tried harder to stay together, but neither knows that the other is thinking about them too so they never get back together. it's so tragic, but romantic as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nLove this song! Going to there concert soon. I hope they perform this song! Going through a recent break-up and came accross this song! Our song used to be \"Need You Now.\" I love their other song on the CD \"Ready to Love Again\" which I'm not.. This songs relates to so much of what I'm going through. This part - My friends think I'm moving on\r\nBut the truth is I'm not that strong and nobody knows it but me\r\nAnd I've kept all the words you said\r\nIn a box underneath my bed\r\nAnd nobody knows it but me\n\r\nBut if you're happy I'll get through somehow\r\nBut the truth is that I've been screaming out\n\r\nI should have been chasing you\r\nI should have been trying to prove\r\nThat you were all that mattered to me\r\nI should have said all the things\r\nThat I kept inside of me and maybe\r\nI could have made you believe\r\nThat what we had was all we'd ever need\n\n\r\nI'm just wondering if she is singing the first part of the song. I'm wondering if I should be chasing. They say to let them go and give them space. It was her decision for the break-up... Love her so much.. I hope there is a happy ending for me and Laurie!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song is incredible.  Sometimes no matter how much time has passed, you still feel this way about another person.\t\t\t\t\n\t\t\t\t\n\n"}