{"comment_0": "\nits about a guy who will always be apart of her \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nFirstly,\r\nMY GOD butterflyprince$$, learn to type!!!!\n\r\nAnyhoo, this is my favourite song of all time. I love Mariah, and I first listened to this song whilst listening to her Greatest Hits on holiday with my friends and my school to the south of France for like, two weeks.  I fell in love with it. I listened to it non-stop and every night before I went to sleep. Its so beautiful and catchy and carries a lot of memories.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIts a really pretty song! Her voice is amazing in it, as her early stuff is definitely her best, and this song is a classic! Its about being in love with someone and your love being so deep, that you feel, a part of both of yourselves will always be together.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIts a really pretty song! Her voice is amazing in it, as her early stuff is definitely her best, and this song is a classic! Its about being in love with someone and your love being so deep, that you feel, a part of both of yourselves will always be together.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nomg..this is really a good song ive been hooked on it for a week now..lol..but its helped me..bc i know that special someone will always be with me..\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ni was 14 when i first heard  this song and i was starting to learn english, and this song immediatly stucked in my head, it's just perfect : the voice, the music, the lyrics the video..it's simply about true love. \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nwell actually I totally know what she sings about i this brilliant song... the guy loves her, but he can't really cope with it and says he wants his freedom, and she just lets him go cuz she KNOWS he'll always come back... she doesn't worry cuz they belong together.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni was about 7 when i heard it for the first time and as soon as i heard it i started running around the house jumping on my bed singing it... ( i was a funny child )\r\nLast year I won a talent show for singing this song along with My All...  both of them are what makes Mariah so famous.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis happens to be my fave song by Mariah. I've always liked her music.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song sounds a little stalker-ish.   She's all like \"Boy, don't you know you can't escape me\"  \"No way you're never gonna shake me\"   It's very Enrique Iglesias...  \"You can run you can hide, but you can't escape my love.\"     Very scary actually.     Mariah..   find a guy that loves you back!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nshe basically knows this guy will always be her first love and that their love will never end even if their still apart.. i love this song, i love mariah. It reminds me of my first love and its all true.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nmariah carey by far is my favorite singer and this song is hands down my favorite...it's amazing. it reminds me so much of my boyfriend who lives in England and I live in America...when we first met i listened to this song and made me realize that no matter what he's always my baby!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nawww...this is my favorite r&b song....i get all bitter-sweet when i hear it...its a really good song. its pretty much speaking about a relationship thats over, but even though they arent together now, they learned so many things from each other and gained so much that they will always be a part of each other. Mariah is great...someday im gonna name my daughter after her...\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song is wonderful.  i am at a time in my life right now where it's one of the only things that can make me feel better, because i know exactly what mariah is saying.  her boyfriend is confused and not sure of what he wants, so he's pushing her away. however, she doesn't let it get to her because she knows eventually he'll come to his senses and come back.  if only it was that easy!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI think everyone else has covered the song's meaning pretty well. It's about the confidence of knowing that you and another person are destined for each other, despite being apart from them at present time.\n\r\nI'd like to say that I typically detest the r&b poppy stuff that makes up most of Mariah's catalog--and yet, this song is really well written...and RIDICULOUSLY catchy. Can't help it, I gotta like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nwow.....i wish i could feel that confident in someone\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\naww this song is so cute its so happy and she obvisosly is really into this guy mariah carey is a true legend\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nwell.. this is a good song. I like it and all but some of the lyrics are a little stalkeresque (i don't care if stalkeresque isn't a word, i'm using it anyway) \n\r\n\"Now you want to be free \r\nSo I'll let you fly \r\n'Cause I know in my heart, babe \r\nOur love will never die \r\nNo \n\r\nYou'll always be a part of me \r\nI'm part of you indefinitely \r\nBoy, don't you know you can't escape me \"\n\r\nscary. the rest of the song is good though\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nYou have to love this song, not only for the rhythm itself but the meaning behind it. You know the relationship is over and you can't do nothing about it, and the only thing you can keep is yourself thinking that \"he'll always be a part of you\", and that you were the best thing that he had. I can't help thinking of this guy, also my first love, and thinking that, that particular line means that he will always be my first man, and that won't ever change.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI have noticed that \"Always be my baby\" and \"Don't Forget about us\" have similar meanings.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI have noticed that \"Always be my baby\" and \"Don't Forget about us\" have similar meanings.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\n..best\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nLoL! when I first saw the video for this song I thought she was white. I was 7 yrs old and I used to sing \"you'll always be a part of me ohbopabee u better believe it oh boy you know you can't exscape me oo dolly cause you'll always be my baby\" LOL\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\npersonally, this song is the best mariah carey song.\r\nit's about her and someone breaking up i guess, but to her he will will always be her baby...it's about first love and how you won't forget them no matter what.\r\na lovely song, amazing in fact :)\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nhaha this is a stalk..ish song.. \"and we will linger on\" sounds like she wont ever get over him.. haha but i did like her old songs better.. but now she is the biggest slu...t lol.. and she cant sing anymore! shes got a horrible voice! what happen to the old mariah carey.. even britney spear sings better even though shes terrible as well.. hehe mariah please stopping singing and do retire.. you are getting old..\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\ni first heard this song in 1st grade..it reminded me of my first grade crush and everytime it would come on id run to go hear it..\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nmariah carey is not a slut & anyone dt says dt must b totally fuckd in the head.... mariah haz a great & amazing voice & i love most of her song, this happens 2 b one of them.... i think this song  waz decidated 2 a guy dt she loved very deep but he left & in this song she is sayin dt she will alwayz love him no matta wat.... also she syd dt if he really does love her dt he will b bak 4 her.... So no matta wat happens she will alwayz love him, he'll always b a part of her & he will always b her baby....\n\r\nPAT I DECIDATE THIS SONG 2 U, COZ EVEN THOUGH WE AINT 2GETHA ANYMORE, THERE IS NOT A DAY DT MY LOVE 4 U FADED OR GETS LESS, IT JUST KEEPS GETTING STRONGER. PAT U WILL ALWAYZ B MY BABY & I WILL ALWAYZ LOVE U TILL THE DAY I DIE...\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nah... good memories.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\noh man, you have to love this song.\r\ni was 5 when it was released, but a few years later i remember being totally obsessed with her and that video - which is cute, and she looks really pretty in it.\r\noh man, definitely a classic!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nOkay, David Cook did amazing cover of this on American Idol last night, and I was moved to tears by it. This is my favorite Mariah song, and I used to sing it all the time when I was 10.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nstory of my life\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nits like, when a boy wants to leave and your gunna let him go.....\r\neven though you know your not over him. <3\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThis song is pretty. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nits saying that a guy who will always be a part of the girl \t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nits about a guy who will always be apart of her \t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nPersonally I think that this Mariah Carey thing and also other pop music artists like Katy Perry, Jonas Brothers, Pussycat Dolls and other \"talents\" have a decent voice, marketable features, like decent sized boobs, and fairly quiet personalities, just crank out money for the corporations (major fucking record labels). and all these songs are shallow, yet somehow many people can somehow relate to them, and many people are unfortunately unable to see through the corporate greed behind these cookie-cutter artists. And I do not think that these songs are bad, or that these people have poor singing talent, but I absolutely hate, with every fiber of my being the greed and money there is to be made through these artists, and the shallow people who buy these records and cannot seem to understand anything aside from their own feelings and buying something that sounds good, but in essence, has no meaning. \t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI like this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nthis song makes me cry..i was a kid when it first came out,it was catchy,used to sing along whenever it was played..but today,i listened it again and it relate me so much..we always break up and makeup again..but this time im not sure if we'll ever patch up again..but deep in my heart i know he'll always be my baby..:(\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nMAN I DNT KNW Y NE1 WULD THINK THT THIS SNG IS STALKERESQUE OR WOT EVER WEN ITS JST A LUV SNG DEDICATED TO SME1 THT U HVE SHARD A SIGNIFICANT PART OF YOUR LIFE WITH & ITS CME TO A POINT IN THEIR RELATIONSHP WEN 1S NOT HAPPY AT THE MOMENT AND THEY WANA GO OUT AND SEE WOT OTHER SPECIES OF FISH ARE OUT THERE IN THE BIG WIDE OCEAN!!! IF YOU LOVE SMETHING SET IT FREE.............................\n\r\nALWAYS BE MY BABY IS A CLASSIC ........ ITS ABOUT SME1 THT U TRULY LUV..... ITS ABOUT THAT PERSON THAT U WULD DROP NETHING 4 ....... ITS ABOUT SHARING THE MOST INTIMATE PART OF YOURSELF WITH THIS PERSON AND TELLING TM THT NO MATTER HW HRD THEY TRY TO DENY IT YOU ARE ALWAYS GANA BE A PART OF THEIR LIVES AND THAT YOU ARE UNFORGETTABLE YOUR LOVE WAS UNFORGETTABLE... BUT NW YOU WANA BE FREE SO IM LETTING YOU FLY...... COZ U KNW IN YOUR HEART BABE OUR LOVE WILL NEVER DIE....... \r\nITS ABOUT HAVING THAT SPECIAL PLACE WE SECRETLY HIDE AWY FOR THOSE THT WE HVE LOVED AND NT FORGOTTEN!!!!!\t\t\t\t\n\t\t\t\t\n\n"}