{"comment_0": "\nThis song obviously is about the hardships of the modern American farmer.\n\r\n\"The diesels worth the price of gold \r\nIt's the cheapest grain he's ever sold \r\nBut he's still holdin' on\"\n\r\n It is becoming very hard to make a living with the high cost of equipment and low price of crops but still they sweat and toil because its their way of life and they know no different. These people really are owed a debt by everyone. Without them, we wouldn't have our market fresh food at the grocery, the canned corn or even soybean oil. we would be a culture without food. And even though it is one of the toughest jobs in the world they stick with it. God bless....\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis is my absolute favorite song on this album.  Way to go Jason\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nlove the song... keep holdin on... someone always appreciates what you are doing... this song gave me the goosebumps at the concert =]\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI agree with aardls. Nobody takes the time to think about how we have the luxuries that we have. Little do they know, people work their tails off just to put food on their table and everyone else's. This song does a great job of explaining the hardships of farming, and more people should appreciate what they have.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ni dont understand why there is only four comments on this song. from my hometown country is not the most  popular chooice of music but the meaning of this song is still wonderful and im sure somewhere in everyones life they hope thier dreams never run dry. regardless of this country song its great to listen to and full of the hope that everyone needs\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nSimple man who works every day of his life. Doesn't ask for much, but for good fortune for his family. Great overall!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nâ\u0080\u009cHe just takes the tractor another round, And pulls the plow across the groundâ\u0080\u009d this line describes a small town farmer who does back breaking work day in and day out to put bread on the table. He continues this hard work because he knows itâ\u0080\u0099s all worth it in the end. Iâ\u0080\u0099m the kind of person that will work as hard as I need to in order to achieve a goal. So I can completely understand why he is doing this. \n\nâ\u0080\u009cAnd sends up another prayer, He says Lord I never complain, I never ask why, please donâ\u0080\u0099t let my dreams run dry, underneath, underneath this Amarillo Sky.â\u0080\u009d Personally I can relate the most to this line. All he wants is to support his family and he finds the greatest joy when he is able to do that. He loves his family more than anything so when he is able to bring food to the table, thatâ\u0080\u0099s enough for him. Back to how I can relate. I ride horses, which probably makes you all think â\u0080\u009cmoneyâ\u0080\u009d. Iâ\u0080\u0099m not going to lie my parents have to work really hard in order for me to be able to ride and have a horse. When I get older, then I will have to work extremely hard to be able to ride and have a horse. But, like the farmer just wanting to support his family, I just want to be able to ride. I donâ\u0080\u0099t care about a flashy life, instead, Iâ\u0080\u0099m the happiest person in the world when Iâ\u0080\u0099m on a horse, or even near one.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthis song is my world i am growing up on a family farm this piece of land has been in my family for a really really long time and this farm is all i know. i dont know what i would do if i lost it for any reason. we are barely holding onto it with our finger tips but we are fighting to keep it forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nJason is talking about a farmer, but I think this is about the small business owner out there trying to make his own way, who doesn't ask for any handouts, doesn't complain, tries to play by the rules, but is going through difficult times and is asking God to take care of him and his family. Great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nlove this song\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song really allows me to stay true to who I am. I love the lyrics \"I never complain I never ask why\" because he is telling God he trusts in his plan\t\t\t\t\n\t\t\t\t\n\n"}