{"comment_0": "\nThe song was dedicated to those who serve/served.  1776 is the year of independence.  It's simply based on the sacrifice of a soldier and their relationship with a personification of a country they defend and sacrifice for.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\n\"Twenty years in debt\nTwenty years in the government\nTwenty years can never get me by\"\n\nA Soldier must serve for twnety years to get retirment.  Its twenty years in debt to the government, officialy Soldiers are u.s property, and its a hard twenty.\n\n\"From farmers in the fields\"\n\nThe National Guard is recognized as the oldest branch of the military which was made up of farmers.\n\n\"To the tallest of the towers that fall and rise\"\n\nA reference to the 9-11 attacks.\n\n\"1-7-7-6\nThe names upon the list\"\n\n1776 is the year we declared independence, and the names upon the list is in reference to all the men who signed the document. \n\n\"For all the ones that gave until they died\"\n\nAll the Soldiers who fought for the country.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nTo the tallest of the towers that fall and rise\n1-7-7-6\n\n~The tower that replaced the twin towers in New York City was capped at 1776ft\n     It is now the tallest building on the North American Continent.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI know what this song means, but in my opinion, its different. To be honest, I've been reading \"The Capture\" by Kathryn Lasky, and this song reminds me a bit of one of the characters.\nKeep in mind this is my interpretation, not the real meaning.\n\nIs this just an illusion\nThat I made inside my head to get me by?\n\nTo me, this means someone is living in such horrible conditions that they're slowly going mad, or becoming emotionless or something. \n\nTwenty years in debt\nTwenty years in the government\nTwenty years can never get me by\n\nOnce again, I believe this means that someone is imprisoned. They gave into working for horrible people so they could protect their family. The person knew that it was for the best despite how hard it would be to work, and escaping was unrealistic.\n\nThen I feel you close\nFeel you close like you wanted me to\nFeel you close like you wanted me to\nBelieve in you\n\nNo matter how much time passes, they still believe that they are doing the right thing. Despite the protests of their loved ones, the person didn't wish for them to be hurt.\n\nRise to the top of the world, America\nAmerica, don't you cry\nLift me up\nGive me strength to press on\nRise to the top of the world, America\nAmerica, don't you cry\nLift me up\nGive me strength to press on\n\nEvery single day is hell, and the person is slowly losing their head. They have to watch people, emotionless with defects, slaving away at unnecessary work. Yet every single day, the person seems to grow a bit stronger.\n\nFrom farmers in the fields\nTo the tallest of the towers that fall and rise\n\nWhere the person works, they see many people doing different jobs, such as caring for babies, and a type of mining for a diamond-like thing. No matter how different they are, they're all the same slaves.\n\n1-7-7-6\nThe names upon the list\n\nIn the book, the enslaved characters are always renamed with numbers, so this is very meaningful.\n\nFor all the ones that gave until they died\nDon't you hold back\nI can see in your mind, and your mind will set you free\n\nEventually, the person finds two children that resisted the hypnotism. He tells them that he can teach them to escape by flying. When they are flying away, he's dying, proud that he helped them.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n\"Is this just an illusion\nThat I made inside my head to get me by?\"\n\nReferring to how traumatizing this experience was.\n\n\"Twenty years in debt\nTwenty years in the government\nTwenty years can never get me by\"\n\nIt takes 20 years of serving in the army to earn retirement. Therefore, they were in 20 tears of debt in the government. \n\n\"Then I feel you close\nFeel you close like you wanted me to\nFeel you close like you wanted me to\nBelieve in you\"\n\nFeelings of missing a loved one while serving. You're feeling them next to you even when they're not.\n\n\"Rise to the top of the world, America\nAmerica, don't you cry\nLift me up\nGive me strength to press on\nRise to the top of the world, America\nAmerica, don't you cry\nLift me up\nGive me strength to press on\"\n\nFamily, loved ones, ect. are encouragement to push though and tough it out.\n\n\"From farmers in the fields\"\n\nI think ID is referring to early army soldiers because the following statements are about previous milestones for the US:\n\n\"To the tallest of the towers that fall and rise\"\n\nThe twin towers on 9- 11 ;~;\n\n\"1-7-7-6, The names upon the list\"\n\n1776 was the year we declared independence and the names upon the list are all the men who signed the document. \n\n\"For all the ones that gave until they died\"\n\nThe list was not in vain, for all the ones who fought for our independence had died, but gave for our country. \n\nI don't fully understand the :\n\n\"Don't you hold back\nI can see in your mind, and your mind will set you free\"\n\nBut I think it means that you can't give half effort for something you committed to (?) I dunno..\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n\"Is this just an illusion\nThat I made inside my head to get me by?\"\n\nReferring to how traumatizing this experience was.\n\n\"Twenty years in debt\nTwenty years in the government\nTwenty years can never get me by\"\n\nIt takes 20 years of serving in the army to earn retirement. Therefore, they were in 20 tears of debt in the government. \n\n\"Then I feel you close\nFeel you close like you wanted me to\nFeel you close like you wanted me to\nBelieve in you\"\n\nFeelings of missing a loved one while serving. You're feeling them next to you even when they're not.\n\n\"Rise to the top of the world, America\nAmerica, don't you cry\nLift me up\nGive me strength to press on\nRise to the top of the world, America\nAmerica, don't you cry\nLift me up\nGive me strength to press on\"\n\nFamily, loved ones, ect. are encouragement to push though and tough it out.\n\n\"From farmers in the fields\"\n\nI think ID is referring to early army soldiers because the following statements are about previous milestones for the US:\n\n\"To the tallest of the towers that fall and rise\"\n\nThe twin towers on 9- 11 ;~;\n\n\"1-7-7-6, The names upon the list\"\n\n1776 was the year we declared independence and the names upon the list are all the men who signed the document. \n\n\"For all the ones that gave until they died\"\n\nThe list was not in vain, for all the ones who fought for our independence had died, but gave for our country.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThe american country\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\n\"From farmers in the fields\" could be talking about the early military, how it was mainly made out of farmers. If you think about it that way, \"To the tallest towers that fall and rise\" is saying how far the country's come, in not only industralizing, but also in the military's reaction to things that happen. However you think about it, this song is without a doubt about the military, especially if you see the soundcloud cover (it's Wounded Warrior Project supporter).\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nSongs have a liberal back drop. From liberal point of view he could be ranting of all the things we've done since we got our independence. He asks for America to lift him up but bringing up debt and wars it seems he's saying America lifted itself up leaving him behind. From farmers in the field to soldiers they felt left behind as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nMy favorite song. Thank you for the song lyrics.\ndomyhomeworkonline.net/\">do my homework  - cheap essays online.\t\t\t\t\n\t\t\t\t\n\n"}