{"comment_0": "\nThis is a song is about a girl who grew up in a small town, moved away and realized how stressful her new life is. She wishes she could go back to the slow paced life she had always known.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nit's \"there's a wild wild whisper BLOWIN in the wind.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song is soo beautiful. Makes you feel warm inside just like an American summer day. Every time I hear this song I can't help but sing along and think back to my early childhood. I'm proud to be a true American Honey! \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nah, sweet memories...\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt's about growing up and wanting to go back to those days, back to american honey, as the song puts it. When youu've grown up you're ready to get going, but at the same time, not quite ready to leave.    \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nsong about somebody longing for their own youthful innocence plain and simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni love this song. its really good and i like the meaning.\r\nits also cracks me up when people say they don't like country but yet sing this song...ok? ha\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI love this song. and I comPLETELY agree with bammab90!!! \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song sounds to me like it's about a young lady who was raised out in the country with good character qualities.  I love the line that says \"So innocent, pure, and sweet/American Honey.\"  It's so beautiful and poetic.  One of my all-time favorite country songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nDon't wanna stay,don't wanna go...just be.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI like the \"childhood innocence\" interpretation and that's all good, but listening to it I always felt like she was singing about a PERSON she was referring to as missing her first love/crush, \"American Honey\".\n\n\"Gotta get back to her somehow...\"\n\nIt's heartbreaking and bittersweet interpreted like this, but I'm probably overthinking it and adding too much meaning to, as what someone said here, a \"fluff filler song\" for grocery stores to play.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nGreat, just what we need. More mediocre filler for country radio. Of course, Lady Antebellum could sing the alphabet or something then it would suddenly become a billboard hit. Disappointing.\t\t\t\t\n\t\t\t\t\n\n"}