{"comment_0": "\nI interpret this song a little differently than most (I would think). It's about a man that really tried to love a woman - who loved him - but he just didn't feel that \"spark\"/connection that he was holding out for. \n\n In the first two verses, he is apologizing to the those closest to him in his life - who worry about him and are trying to \"ground\" him. In the first, his mother. He tells her everything is fine, but in reality it's not. And filled with these struggling emotions, he begins to let his mind wander. Whether he literally goes to Amsterdam is unknown - however one could interrupt that he is referring to drug use (a concept often associated with Amsterdam). \n\n In the second verse, his brother confronts him. It's almost inferred that either 1) his brother has been through the same situation; or 2) his brother is troubled by the fact that he can't help the narrator; or 3) it dawns upon his brother, that he is in the same situation. I believe it is the third; which leads to the third verse. \n\n He's telling his brother: that a time will come, when he's loved by someone, who loves him equally - and that they both make each other happy. \n\n In the fourth verse, he finally addresses the reason behind all this depression and madness: his lover. He addresses her as \"lover\", so we can infer that she does love him, and this is not a situation where he loves a woman that can't reciprocate. I interpret the beautiful poetry in these lines to reflect the notion that he's always felt distant to her. He says that he's tried, but instantly says that he also lies. \n\n\"Kinda thought I was a mystery and then I thought I wasn't meant to be\" to me means, \"I thought I was too complicated for someone, and then I thought that maybe I was never meant to fall in love.\" His \"lovers\" response to this, was to say \"Congratulations, you were all alone\" I infer this line to mean that her reply wasn't what he sought. She was too logical to love, she told him that the only reason he felt that way, was because he was alone before. \"Congratulations\" is almost said in a sarcastic tone. What he wanted, was for her to show him that he was wrong, to make him happy - but she couldn't. \n\n\"Your time will come if you wait for it, if you wait for it\nIt's hard, believe me... I've tried\nYour time will come if you wait for it, if you wait for it\nIt's hard, believe me... I've tried\"\n\nHe's telling her: \"I'm sorry, but the time for you to love someone, that will make you happy, will come - but it's not me. It's a hard thing to do - wait for love - and I know, because I've been trying this whole time.\" \n\n\n\"But the rain won't fall for the both of us\nThe sun won't shine on the both of us\nBelieve me when I say, that I wouldn't have it any other way\"\n\nHe's attempting to rid her mind of any false hope. He rather find a true sense of happiness and love, than pretend that there is such between them. \n\n\n\"Your time will come if you wait for it, if you wait for it\nIt's hard, believe me... I've tried\nBut I won't wait much longer 'cause these walls they're crashing down\nAnd I won't wait much longer 'cause these walls they're crashing down\nAnd I keep coming up short\"\n\nTo me, these last lines aren't to his lover. But to himself. He's tried waiting for love - more than once - and he's waiting to feel that sense of \"being in love\"/that magical feeling that's comforting, weird, warm and cold at the same time. He's tried of waiting, and mentally it's begun to take a toll on him. His \"inner walls\"/his mind, is getting to a dangerous point of no return - where it will finally collapse on him. \n\nIt could also mean that he hasn't ended the relationship with his \"lover\" yet. And that he's still trying to give her a chance, but he doesn't know if he can do it for much longer. \n\n That's my uneducated two sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think the meaning in this song ultimately lies in the chorus:\r\n\"Your time will come if you wait for it, if you wait for it\r\nIt's hard, believe me I've tried\r\nBut I keep coming up short\"\r\nWhatever time that may be I think depends on each individual person's life, but eventually, everyone has their time!\r\nIt is hard to believe, and the artist connects with us in the second line of the chorus by saying he has tried, and this makes me think of all the times I have had to be patient for something, and how hard it has been, and a few of those occasions I too came up short. I think the key message here though, is if we can stay patient, our time will come :)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think he sings \"Congratulations, you're all alone\" instead of \"You were all alone\"...but maybe that's just what I'm hearin...\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis song seems to be about someone letting someone else down.\n\"i'm sorry mother, i'm sorry i let you down''\nits about when you let someone down, you wish you had done something different, you wish you treated them different. and they go on to a different place but you stay in the same place.\n\n\"i take the west train, just by the side of Amsterdam.\"\ntheir taking different roads to each other.\n\n\"your time will come, if you wait for it.\"\nyour time will come when you see what you've done; what you should have done instead. the mistake you've made.\n\nno hate please ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThe \"I'm sorry I let/bring you down\" lyrics seem to imply that the narrator feels inadequate or worthless. Perhaps I'm overanalyzing here, the mentions of \"my left brain\" (considered the more logical brain half) and \"the tin man\" (who, in the wizard of Oz, didn't have a heart) seem to reference a logical, emotionless outlook - perhaps the narrator thought he would be better off remaining logical rather than focusing on his feelings of low-self esteem. In the chorus - \"your time will come if you wait for it... it's hard, believe me, I've tried\" - he reveals that even someone with a low sense of self-worth like him will eventually have a time when their life gets better, even if it's hard to wait for that time.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI'm a person who have a dream and is pursuing it, and this song really struck a cord on me. I can relate to a lot of it, so it was very understandable to me. (just how I understood it)\n\nI really think that this song is about someone who is following his heart.\nSomeone who have to sacrifice people he loves, leaving them for his dreams but keeps failing and feeling like he is disappointing everyone he loves. \nHe is having trouble with self worth and feeling like a failure.\n\n\"I'm sorry, mother I'm sorry, I let you down\"\n-He thinks he is disappointing people who he cares about and people who knows he is out there to follow his dreams.\n\n\"Well, these days I'm fine - No these days I tend to lie\"\n-He is staying strong for them, he wants to let them know he is doing just fine on his pursuit, but he is not.\n\n\"I'll take the West train, just by the side of Amsterdam\nJust by my left brain, just by the side of the Tin man\"\n\n-He is on a journey. Tin man is a fictional character searching for where his heart is. \"Just by the side of the Tin man\" means he is going on the same journey as Tin man did and go where his heart is.\n\n\"I'm sorry, brother I'm sorry, I let cha down\nWell, these days you're fine, no these days you tend to lie\nYou'll take the West train, just by the side of Amsterdam\nJust by your left brain, just by the side of the Tin man\"\n\n-\"Brother\" might be literal or referring to people who are going through the same. His brother might've also gone on the same journey, leaving they're \"mother\" or people they care about to follow his dreams.\n\n\"Your time will come if you wait for it, if you wait for it\nIt's hard, believe me I've tried\nBut I keep coming up short\"\n\n-He is referring to himself and to the others who tried. (before the chorus he mentioned his brother) He have gone through the same and keeps on failing.\n\n\"I'm sorry, lover you're sorry; I bring you down\" \n-His lover is someone who he had to sacrifice for his dreams.\n\n\"Well, these days I try and these days I tend to lie\nKinda thought I was a mystery and then I thought I wasn't meant to be\nYou said yourself fantastically, \"Congratulations you were all alone\"\n\n-It seems that his heart was truly for his dreams, he wasn't really able to do her his best because he is focused on something else.\nHe thought it might be something special but he realized that what he really is meant for is not her. \nApparently, the lover FANTASTICALLY said \"Congratulations you are all alone\" saying to him that he can finally go for his true passion and she would not be a burden anymore because he thought that he was hurting her. \nHe knows she is not his true love.\n\n\"But the rain won't fall for the both of us\nThe sun won't shine on the both of us\nBelieve me when I say, that I wouldn't have it any other way\"\n\n-There is just now way they can be together. It's painful but he does not regret that he would have to be far away from them, probably just to fail. He just can't give up on his dreams. He is willing to give it all up.\n\n\"But I won't wait much longer 'cause these walls they're crashing down\nAnd I won't wait much longer 'cause these walls they're crashing down\nAnd I keep coming up short\"\n\n-He really tried his best but this line just shows that the meaning is really about someone who keeps on trying, pursuing their dreams but keeps on failing. \nEven though they have to sacrifice so much, people they care about and love.\n\nIf you have a dream and full on pursuing it too, you can probably relate to this. \nIt gets you on your knees, make you be willing to give up everything for it.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI'm sorry, mother I'm sorry, I let you down- i let down the people close to me\nWell, these days I'm fine - No these days I tend to lie-i am lying right now because guess what in reality I'm not fine\nI'll take the West train, just by the side of Amsterdam-im trying to escape from the mess i have made\nJust by my left brain, just by the side of the Tin man-i already gave my heart away to the tin man no he can have my brain too its not like i was using either of them\n\nI'm sorry, brother I'm sorry, I let cha down- again i let down the people close to me\nWell, these days you're fine, no these days you tend to lie-i am lying right now because guess what in reality I'm not fine\nYou'll take the West train, just by the side of Amsterdam-im trying to escape from the mess i have made\nJust by your left brain, just by the side of the Tin man-i already gave my heart away to the tin man no he can have my brain too its not like i was using either of them\n\nYour time will come if you wait for it, if you wait for it- love will come soon just be patient\nIt's hard, believe me I've tried-being patient is hard i would know because I had to go through this too\nBut I keep coming up short-I never was patient i could never wait \n\nI'm sorry, lover you're sorry; I bring you down-Im sorry i wasn't patient enough to let our relationship slowly grow; so you pulled away because I brought you down\nWell, these days I try and these days I tend to lie- I say i tried hard to keep you from going but thats a lie; i just let you go without a hard fight\nKinda thought I was a mystery and then I thought I wasn't meant to be-i thought no one could figure me out and no one would ever figure me out\nYou said yourself fantastically, \"Congratulations you were all alone\"-his lover said yea you were all alone because it was just him pulling her through the realtionship \n\nYour time will come if you wait for it, if you wait for it\nIt's hard, believe me I've tried\nYour time will come if you wait for it, if you wait for it\nIt's hard, believe me I've tried\n\nBut the rain won't fall for the both of us\nThe sun won't shine on the both of us\nBelieve me when I say, that I wouldn't have it any other way\n--nothing can come from this anymore;he has pushed her away too much and he's letting her go so she can be better\n\nYour time will come if you wait for it, if you wait for it\nIt's hard, believe me I've tried\nBut I won't wait much longer 'cause these walls they're crashing down\nAnd I won't wait much longer 'cause these walls they're crashing down\nAnd I keep coming up short\n--im trying to let you go and be patient so i can find someone new but i can't wait much longer because the barriers he put up to keep her out are coming down and he knows he won't get he back because he's not good enough for her patient, wondrous love\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think of the Holocaust. Let me break it down for you:\n\nI'll take the West train, just by the side of Amsterdam\nJust by my left brain, just by the side of the Tin man \n-and-\nYou'll take the West train, just by the side of Amsterdam\nJust by your left brain, just by the side of the Tin man\n\nAmsterdam was the capitol of the Netherlands, and the Netherlands were (obviously) invaded by Hitler and the Nazis. People were sent off on trains (relations to 'West train') to concentration camps.\n\nNEXT\n\nYou said yourself fantastically, \"Congratulations you were all alone\"\n\nPeople were sent of to camps and they were left completely alone, separated from families and friends. This was common during those times.\n\nYour time will come if you wait for it, if you wait for it\nIt's hard, believe me I've tried\nBut I won't wait much longer 'cause these walls they're crashing down\nAnd I won't wait much longer 'cause these walls they're crashing down\nAnd I keep coming up short\n\nJews and other people were held in the camps, dying and waiting to be rescued by the other countries. 'These walls they're crashing down' could be people on the brink of insanity, death, or it could possibly be the burning of camps.\n\nReally, if you think about it, it kind of fits. Also, I believe \"Radioactive\" follows along this theme (really it's a bit obvious there).\n\nSongs have hidden meanings, and really when it sounds like something happy it can be something completely different. This is just my take on it and I'd really like some feedback, and I'm also confident that I am correct.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nTo be blunt, I think its a song about depression and suicide. \n\nDEPRESSION\nHe's repeatedly apologizing to the people he mentions\n\nSaying he's 'let them down' and when he mentions his lover he says he 'brings them down'\n\n'But rain won't fall for the both of us, the sun won't shine on the both of us' he's basically saying that only one will make it through the depression and that it wouldn't be him, but that he 'wouldn't have it any other way'\n\n'These days I'm fine, well these days I tend to lie' he's not fine, he's putting on a brave face, although in the brother verse the brother has noticed that he isn't OK\n\nnow, this is all fine and good for the depression aspect, but depression doesn't make a suicide.\n\nSUICIDE\n'Your time will come if you wait for it, if you wait for it\nIt's hard, believe me I've tried\nBut I keep coming up short'\n\nyour time is referring to death... death will come if you wait for it, but it's hard to wit for it, he's tried, but he came out short. and he keeps coming out short, referring to the fact that he's failed in some way to wait for his time, to wait for death.\n\nI thought I wasn't meant to be, he thought he wasn't meant to be alive, if he was talking about a relationship he would have said WE weren't meant to be, but he said I wasn't meant to be.\n\nOnce again, apologizing and letting people down\n\n'But I won't wait much longer cause these walls they're crashing down', the depression has become to much\n\nI think he might have finally succeeded in his suicide, because the last words are that he came up short, the song is like his suicide note.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nMost Imagine Dragon songs have multiple meanings and this is one of them.\nthis could either be a song about moving on with your life, leaving your past behind and becoming a better person\nOR\ni've been listening to this song for a while now and just recently came up with a different interpretation, a more serious one, dealing with suicide. \n\"I'm sorry Mother\nI'm sorry I let you down\"\nis the persons note\n\"These days I'm fine\nNo these days I tend to lie\"\nis the person pretending to be ok while secretly being depressed, etc\n\"I'll take the west train\njust by the side of Amsterdam\"\nis the person saying they're going to kill themselves\n\"Just by my left brain\njust by the side of the tin man\"\n?? not sure, possibly talking about a gun being used in the suicide\n\nthe same ideas are repeated in the second verse, and first half the third\n\n\"Kinda thought it was a mystery\nthen i thought it was a meant to be\"\ndescribing the relationship with their partner\n\"you say yourself fantastically\n'congratulations you were all alone'\"\npossibly the partner was going through the same things as them, or they recently broke up\n\n\"But the rain wont fall for the both of us\nthe sun wont shine for the both of us\nbelieve me when i say\nthat i wouldn't have it any other way\"\nthey are/have sacrificed their happiness for this person and would rather die than see that person be sad\n\n\"your time will come \nif you wait for it\"\ntalking about being their time to die, they're probably happy for it\n\n\"it's hard believe me i've tried\"\nthey tried living life but it was just too hard\n\n\"and i keep coming up short\"\n?? not quite sure, possibly they've attempted before and it never worked\n\nthis whole song is kind of a note to probably a lover who's struggling with the same demons before that person kills them self. Really sad, i know, but just my opinion. \nit's an amazing song and i absolutely love it\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI believe that I interpret the song as a young person has been diagnosed with brain cancer, and he goes to Amsterdam to try and live his life to the fullest before he has no life left. He's offered an opportunity of a lifetime and takes it, but he \"comes up short\" and while he's working within the opportunity, his brain cancer gets in the way and \"falls short\" once more, which ends the song\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI personaly think its about suicide,\nif you dont take the words literal and analize the emotional context it gives out.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nNot sure what I hate more: the people who butcher song lyrics and post them as if they're correct, or the fact that I can't fix them because of bullshit licensing.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI dont know if this is right but this is what i have got from the song. I think its about a man who ended up killing himself and he is telling everyone that- yeah he is gone and he is sorry, but they will see him again in another life.\n\n\"I'm sorry, mother I'm sorry, I let you down\"\nHe is saying sorry for letting his mom down and for not being strong enough.\n\"Well, these days I'm fine - No these days I tend to lie\"\nHe acts like he is fine but is lying. (i tend to lie)\n\"I'll take the West train, just by the side of Amsterdam\"\nHe is leaving and going away from his home. Maybe this means he is going to die, leaving the world.\n\"Just by your left brain, just by the side of the Tin man\"\nThis shows that he thinks he is a bad person. That he thinks he is brainless (\"left brain\") and heartless (the tinman had no heart).\n\n\"I'm sorry, brother I'm sorry, I let cha down. Well, these days you're fine, no these days you tend to lie\"\nThis line is interesting. I believe that his brother is going through the same thing he is going through but is scared to admit it. the singer is realizing how he feels.\n\"You'll take the West train, just by the side of Amsterdam. Just by your left brain, just by the side of the Tin man.\" \nMaybe he knows that his brother is about to kill himself\n\n\"Your time will come if you wait for it, if you wait for it\"\nThis means that things will get better eventually but you have to stay strong and be patient.\n\"It's hard, believe me I've tried\"\nHe TRIED, which points to the fact that he tried to be patient and tried to wait for things to get better but ended up failing.\n\"But I keep coming up short\"\nHe kept waiting for things to get good but nothing happened and his life was still bad. This could also be him explaining why he killed himself.\n\n\"I'm sorry, lover you're sorry; I bring you down\"\nThis is him telling his lover that he is sorry for being sad and burdening her with his depression. Sorry for \"bringing them down\" and making them sad, too.\n\"Well, these days I try and these days I tend to lie\"\nHe says he is okay but is lying.\n\"Kinda thought I was a mystery and then I thought I wasn't meant to be\"\nThis is when he first starts thinking about killing himself. He says that he was a \"mystery\" which could mean that he was \"unsolvable\". And \"I thought I wasnt meant to be\" means that maybe itd be better if he was gone and this is his fate.\n\"You said yourself fantastically, 'Congratulations you were all alone'\"\nMaybe he scared off everyone he cared about by being this way.\n\n\"But the rain won't fall for the both of us. The sun won't shine on the both of us\"\nThis line shows that him and his friends cant always be happy. They wont both be perfect. He will not be okay even though his friends will.\n\"Believe me when I say, that I wouldn't have it any other way\"\nhes saying that he wishes that they would both be okay.\n\nSo yeah this is my interpretation. I hope you understand a little bit better~\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nit's sort of like a suicide note. he's telling everyone he's sorry, and how he's trying to get better. but he's so close to suicide and is about to give up. he knows everyone else can get through it, but he can't. \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nIt's about suicide. Left brain means he feels like he has no emotions or is a hulk because the left brain is strictly logical. Like the \"tin man\". \"Catching a westbound train\" is hobo slang for death. He is depressed that he can't seem to make anyone happy and wants to end his life.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nIt sounds as if he's talking to his younger brother and trying to let him know that he's been through a lot and still experiencing some things. He's trying to relay to his brother that he has no clue what he's been through but his time will come to experience it. His younger brother isn't no better than him. He's just inexperienced and hasn't made any mistakes yet. He's also apologizing to his mother because of these very mistakes he's made. He let's her know that whatever she tried to teach him she was right all along. \t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nIt's simple it's about being addicted to heroin and how he struggles with it. He knows he has disappointed his family.  He doesn't want them to worry about him. He wants to either die or get better I think you could see it either way however you want to interpret it. \t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nA beautiful, straightforward song for when your life seems to be coming up short and crashing down.\t\t\t\t\n\t\t\t\t\n\n"}