{"comment_0": "\ni always thought it was pretty obvious.\n\nSteve just broke up with his girlfriend, (well she dumped him).  Extremely depressed and angry, (perhaps drunk or high) he's on a killing rampage shooting bullets of out his gun to anyone around him on his way to his ex-girlfriend to shoot her.\n\nis there really another way to explain it?\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ni found this on faqs.org/lyrics/…\n\n\r\nAnother One Bites The Dust by Queen was released in 1980 and reached number 1 in the US charts and number 7 in the UK charts.\n\r\nThe lyrics to this song were inspired after the writer saw a documentary on the St. Valentines day Massacre.\n\r\nIf you don't know that it is quite hard to understand what the lyrics are about.\n\r\nThey describe a man walking silently down a street with his hat covering his face carrying a machine gun.\n\r\nThe words of the song are building up an atmosphere describing what is about to happen, is there going to be some kind if fight and if so who with, who will he start shooting?\n\r\nThe song then takes a twist when he starts singing about someone who has wronged him, a lover perhaps, who left him with nothing and with nowhere to live.\n\r\nThe song ends with bullets being fired and another one biting the dust so you can only imagine that he has gone looking for an ex lover and he has killed them for the way they treated him.\n\r\nThere is some controversy over this song because it is claimed that if it is played backwards you can hear the words 'Decide to smoke marijuana' several times quite clearly.\n\n\n\n\n\n", "comment_2": "\nlol i tested the backwards marihuana myth.\n\r\nI let 5 people hear it,  NONE could make out any meaning.  Then I let 7 more people hear it who I told before to look for fun to smoke marihuana..   6 out 7 said they heared it.   IT'S ALL bullshit, and psychological crap.\n\r\nMYTH BUSTED!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nat this time there have been 180 comments put about this song. more than half of them say something about a secret message in the words. GO AWAY!!! this is awsome song, and your messin it up because of a conspiracy theory about marijuana! Why dont you all blog on a conspiracies website or somethin'?\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI actually thought that the comments in here could be interesting... oh how wrong I was....\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nCut the shit with the drugs and the aids and the homosexuality.  It's a tale of revenge.  It's not that hard people.  It's a rebelious rock n roll song because that's what rock n roll is ... rebelious.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nYou're all wrong I'm afraid; the lyrics are inspired by the original Space Invaders arcade game - simple as that.\n\r\n\"Out of the doorway the bullets rip...\" - moving out from behind the shield\n\r\n\"... to the sound of the beat\" - remember how the game had that beat that got faster and faster in time with the missiles\n\r\n\"How do you think I'm going to get along\r\nWithout you when you're gone\" - what will you do when you've finished the game ? \n\r\n\"You took me for everything that I had\r\nAnd kicked me out on my own\" - You've spent all your money on it & had to leave the arcade\n\r\n\"Another one bites the dust, and another one gone and another one gone etc ...\" - well there were an awful lot of invaders on the screen\n\n\n\n\n\n", "comment_7": "\nDid all you losers know that if you recite Hamlet's \"To be or not to be\" soliloquiy backwards that it says \"Frank Sinatra is God!\" please get a life! No, Hamlet does not work that way, but please take MY evil hidden message, not everything is planned. How many times have you said something that some one else took as a sex innuendo that wasn't meant as such? Plus, John Deacon (the author, no it was not Freddie) wrote simple songs, he admits to it, plus just look at the content.  if you want to look for hidden meanings why don't you try maybe one of Freddie's songs, or Brian's especially, but John? plus if there's arguement over what it says? come now. Let's get passed the obsession with Drug innuendo and try to discuss music like mature law abiding people.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nAll of the ideas that it's about marijuana are ridiculous...even if it does sound like that when played backwards, it was probably coincidential. Plus the power of suggestion may have something to do with it. People say, \"It sounds like, 'It's fun to smoke marijuana' when played backwards\" so when you play it backwards, you're looking for that phrase...if you hadn't been told otherwise, it might not sound so much like it. I dunno, I haven't actually heard it played backwards, I might be wrong, but I don't think it's about marijuana. And besides, I've heard that song lots of times, and I don't think any more of marijuana than I did before!\n\r\nSorry, I like to rant...so anyway, the meaning...not too deep, it just sounds like it's about violence on the streets is some places and how so many people are dying and how awful it is. Since John Deacon doesn't write terrible complex songs, I don't think it's about marriage, but I wouldn't be surprised if it was: \"There are plenty of ways that you can hurt a man \r\nAnd bring him to the ground \r\nYou can beat him \r\nYou can cheat him \r\nYou can treat him bad and leave him \r\nWhen he's down\"\n\r\nJust one question though...why do people think that so many Queen songs are a reference to Freddie's AIDS? A lot of these songs they think have to do with AIDS were a) written before Freddie new he had AIDS, b) written by another band member, or c) all of the above.\n\r\nOk, I'm done! :D\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nIn the Eighth grade my music teacher told us that there was a subliminal message in the song the said \"you should smoke marijauna.\" None of use believed it to be possible but the next day my teacher brought an original copy of this song put the needle of the record player on the record and spun it backwards and when turned at the correct speed the whole class clearly heard \"you should smoke marijauna\". I am not lying and I am not saying tha Queen was trying to start some drug revolution. They could simply have done it as a joke but the fact is that the encoded message myth is true.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis reminds me of the war at some level.  Mostly the people who authorized it.  \n\r\n(Are you [they] happy? Are [they] you satisfied? How long can you [they] stand the heat?)\n\r\nMakes you wonder if they are satisfied with every thing that's going on and the civilians that have died.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nanother bites the bloody dust\n\nlove the song\nits about a broken relationship and hes angry and uncontrol. \nso hes like, ANOTHER ON BITES THE DUST\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis has to be one of the best rock songs off all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nWhat are u guys on?  It is about not being able to walk down the street without guns in your face or people wanting to kick your ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nAre we sure SATAN put the message? And should we believe someone when they say the hidden message is there, if they spend their time revesing the Freind's theme song? Oo;\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nTyler250's is the only intelligent response so far.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nwho cares if its about maruana its just a great song\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nOk. I'd like to share some sort of physicians point of view. Spech in general is a wave of a specific amplitude and frequency, moving air and thus creating a, for human standards, sound. Vowels generally spoken are a constant wave of a specific frequency, amplitude and phase, while consonants are waves of different type woven together. No a vowel will sound the same backward masked, but in combination with consonants it may sound somehow like a different word spoken. So, except for some sarcastic comments about backward masking by iron maiden and such, most songs, reversed, will sound like _some_ strangely pronouncated words, not necessarly making any sense. Now give us a break.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI have heard the song backwards and you know what I think it sound like-someone singing backwards.  God, you people need to get a life.  This song is, of course, great and when I listen to it I get the feeling of anger or revenge, like some woman has really hurt him and he is pissed off.  But I have no real basis for that, just the feeling Iget from the song, so you can think whatever you want.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nDo you know the chances of a clear sentence played backwards coming out as another clear sentence? Unless the sentence is a string of random vowels, I'd say about 1,000,000 to 1. Backwards speech sounds like Satanic messages because backwards speech is mostly gibberish, so it sounds like \"speaking in tongues\". For it to be that clear, it would need to be double-tracked somehow, and the nature of sounds tells us that then we would hear in the backround a weird phrase backwards, and when played backwards we would hear a clear sentence and ANOTHER weird phrase backwards. The power of suggestion is strong. Placebos, anyone?\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ncan somebody talk about what it ACTUALLY means, not what it means when its played backwards?....\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nIf you reverse Tarzan it says Nazrat! Try it it's disturing but true!\n\r\nno seriously, round half of you say it does say druggie types of things. half of you say it doesnt. and the point is??? \n\r\nwhy are we fighting about this? why can't we just live in harmony with our opinions and in love!? why does there have to be so many wars?! \n\r\nWHAT ARE WE HERE FOR?? \t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI did an interesting experiment involving this song the other day.  I played the chorus backwards for people, and asked them to identify anything they understood.  NO ONE out of forty people heard anything understandable, only a few people recognized it as singing without being told it was a song played backwards.  After this, I played it again tell them it was a rock and roll song, and there is a hidden message in the backwards play.  Four people heard \"marijuana,\" though a greater number (ten) heard \"carolina.\"  After I told them \"It says 'it's fun to smoke marijuana',\" nearly everyone heard it.\n\r\nInteresting, right?\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nGetting off of the idea of a hidden message (Which is pretty inane; You can burp randomly into a mic and hear alteast some sort of message when it's reversed) I've always kinda thought this song was about a guy getting back at every person who has ever done him wrong (Just from the way the song sounds, it's almost like he's angry and getting revenge). Either that, or the women who have done him wrong. Mainly from ths line:\n\r\nHow do you think I'm going to get along\r\nWithout you when you're gone\r\nYou took me for everything that I had\r\nAnd kicked me out on my own\n\r\nLike he's been divorced and she took everything. Kind of an odd premise to write a song about, but then again... It's Queen.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nWhen this song came out, religious radicals were on a big 'finding hidden messages' trip.  I remember hearing that and then playing my '45 backwards, it was neat, probably made me like the song even more, heh.\r\n anyways, it's not 'I'm adopted', he's actually is singing:\r\n\"bite the dust, bite the DUCT TAPE\"\r\nIt's a good filler line for any song, really\r\n;)\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIn the early 1990's I watched a televangelist on TV do a program on backmasking.  I was hoping to find out what the Beatles were really saying in Strawberry Fields Forever.  The show was disappointing on that issue, but the host ranted on and on about satanic messages decoded by playing pop music backwards.  To buy into his argument, you needed to accept the theory that the human mind can, on a sub-conscious level, process words played backwards  (my opinion on the subject is pretty firm, but beyond the scope of this forum).   To support his position he played segments of a few tunes--The Beatles, The Stones, and quite a bit of Led Zeppelin--most of which left me saying to myself, \"well, yeah, if you really use your imagination you could say it sounds like that.\"  His last example was Another One Bites the Dust which to me sounded unmistakeably like \"start to smoke marijuana.\"  I feel that the recording wasn't altered.  The show's producers could have remixed some of the other music to make a better case for satanic messages, and clearly they didn't.  I can't at this time put much stock in the theory that Another One Bites the Dust contains a message from satan.  My theory is as follows:\r\n    A writer in the recording industry wants to get the religous right upset about something.  He spends a night, maybe several, speaking various short messages into a recorder and playing them backwards.  I can just see him saying \"Impeach Reagan...that sounds awful...Buy Pornography...that doesn't sound like anything...Kill the Pope...nothing!\"  then finally \"Start to smoke marijuana...another one..bites...the dust...HEY!  If we say another one bites the dust at the right tempo, it'll sound just like start to smoke marijuana!  The Moral Majority will wet itself!  So the guy wrote a song around the phrase \"another one bites the dust.\"\r\n    Just my theory.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nwhen i heard this song for the first time the meaning popped right out to me. FOR THE LOVE OF ALL THAT IS GOOD! it is about a guy 'steve' walking down the street about to shoot up a bus \r\n'Are you hanging on the edge of your seat?'\r\n it must have taken off without him or something \r\n'How do you think I'm going to get along\r\nWithout you when you're gone\r\nYou took me for everything that I had\r\nAnd kicked me out on my own'\r\n'There are plenty of ways that you can hurt a man\r\nAnd bring him to the ground\r\nYou can beat him\r\nYou can cheat him\r\nYou can treat him bad and leave him\r\nWhen he's down'\n\r\nclearly (at least to me) a guy that is really really mad and is going to shoot up a bus \n\r\ni dont think it is about a gang shooting because they usualy happens outside and \r\n'Out of the doorway the bullets rip\r\nTo the sound of the beat yeah'\n\r\nand it aint about a divorce gone bad because of the line \r\n'Shoot out'  there at the end\n\r\nso i think it is a bus shoot out\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nheartbeats_xxx, shut up.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\ni think it's a good song... not my most favorite Queen song but definitely one of their best... \r\nand i love it. :D\n\r\nalthough when anybody mentions Queen, the first song that comes to mind is Bohemian Rapsody, but another one bites the dust is \"queen's best selling and biggest hit to date...\" at least according to several articles that i've read.\r\nalso initially roger and brian weren't too keen on this song but freddie believed in it. john got freddie's support so it happened.\r\ni also read in an interview of john that he said michael jackson was their fan.. michael voted for this song so they released it as a single...\r\nqueen's amazing.. it's rare to find a song that has beat so recognizeable, that anybody can guess the title. we will rock u, under pressure, another one bites the dust... these songs rock!!\n\r\ni guess the phenomenal success of this single prompted others to search for hidden meaning... if it's not this popular, i don't think anybody will bother playing it backwards or if they did, i don't think anybody will pay attention to it enough to find a message when it's played reversely.\r\ni also think the video enhanced everyone's imagination and convinced more people that it has hidden meaning... freddie looks possitivelly menacing with his cap w/ horns...\n\r\ni'm a God-fearing person and i love queen.. i certainly hope that whatever backward message it has was not placed deliberately and won't do any lasting damage to anybody who listened.\n\r\nQUEEN rules!! GOD SAVE THE QUEEN!!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nHaha This is the song My Dad used to sing whenever we would go to an American Wedding \t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song I believe is about a man who is depressed ( Steve walks warily down the street his brim pulled way down low ) his brim is his countenance , there's no sound but him walking but there's an ambush ahead,  ( machine guns ready to go ) a spiritual ambush that lies in the unseen world , then the writer of the song asks you the listener two questions ( hey are you ready for this ? are you standing on the edge of your seat ? ) and then he tells you what he plans to do because he knows that you won't understand the meaning behind his words   ( out of the doorway the bullets rip .... to the sound of the beat ) there is a spiritual doorway and the bullets ( intoxicating blindness) rip  to the sound of the beat (or the music)  , then the writer says another one bites the dust (has been blinded) and then another and then another ..... untill he says hey I'm gonna get you too ( he's going to shoot you with the bullets of intoxicating blindness) so that you won't understand that through the music there's a spiritual war going on to keep you sedated , blind and apathetic to his purpose which is to keep you from the truth, next he turns to the author of truth himself and in a rage... asks him some questions (how am I going to get along without you when you're gone, you took me for everything that I had and kicked me out on my own) this is the spirit of a fallen angel asking a question and stating a fact ( that he was kicked out of heaven) and then he asks how long can he (God),  stand the heat of watching the ones he loves being blinded by the bullets of intoxicating blindness , then the song goes into a breakdown where the music except for the drums and some special effects and then the writer speaking directly to you the listener because he knows you've been blinded and won't be able to see the truth in his words and arrogantly and laughing at the listener says\" aw take it, YOU'RE NOT ADOPTED\" which means you haven't been adopted into the family of God, or born again of the spirit of God . Lucifer was from what I understand the #1 Ark Angel  in heaven and appears to have been made to sing and lead the Angles in praise and worship of God untill he became proud and wanted to use his talents for his own glory and to exalt himself , he got a third of the angels to rebel and there was a war in heaven and then Lucifer who is also called the Devil or Satan because of the sin found in him was cast out of heaven with one third of the angels that rebeled and they were cast down to the EARTH where Lucifer has set up his kingdom as the god of this world , he rules by deception and by giving men the things that God has forbidded keeps them in slavery to SIN, he is called the prince of the power of the air and music is vibrations traveling through AIR , there are thousands of songs similar to this that tell the intensions of the Spirit writing the songs but unless you're born again and ADOPTED , your eyes will remain blinded by the powers of darkness, get saved... this minute... before it's too late .\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nHave you ever thought of listening to this while smoking? \"the bullets rip to the sound of the beat\" B)\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI think the hidden message  would do less damage than the song itself since the song talks about killing people and the hidden message says to smoke weed. Gotta love it! \t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nAnother one bites the dust. A lot of comments are taking it literally like the guy is going on a killing spree with guns and whatever... I think it's just metaphorical like what do you do after you've had your heart broken by someone. You just basically tell yourself 'another one bites the dust' like ....they're dead to you. You don't lose confidence cause you know youre the shit . And the bullets is your coolness. In this case you know he's a musician so his bullets is his vocals and the beat well it's the actual beat. haha just my interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\n\"start to smoke marjuana\"??!? Don't believe it...do you really think in rock songs there's always a dangerous hidden meaning?\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nYeah, mgrca is obsessed with hidden meanings.\n\n\n", "comment_36": "\nWait a second... smoke marijuana is a DANGEROUS hidden meaning?\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nBased on the conversation thus far, I'd guess they're on weed.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nbut then again who isn't?\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nUm...'bout 85% of America?\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThe Friends Theme song...  for the sit-com...\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nA message from satan?!?! What is the message?\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nLet's be sensible about this. Here's a little experiment. Plug a mic into your PC. Record yourself saying, at normal speed, in your normal speaking voice, the phrase \"Another one bites the dust\".\n\r\nNow take your recording and play it backwards. You will hear yourself, (with something resembling a Russian accent) saying something which SOUNDS a bit like \"Start to smoke marijuana\". No tricks, no extra overdubs, no studio wizardry, just YOUR voice. YOU said it!\n\r\nSo, either it's a coincidence, or they found out that it worked and wrote the song around that phrase.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\ni must be the only one in this entire goddamn forum that thinks the theme from \"Knight Rider\" was the shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nSong rocks. Great opening beat. Love his voice\n\n\n", "comment_45": "\namazing song\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nDude, it does say \"starts to smoke marijuana in reverse\"\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nbut i do not hear a message from satan in the friends theme\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nStart to smoke marijuana?! Friend's theme a message from Satan?!? What type of oddball spends their time reversing songs looking for an evil hidden message?!? Honestly! All you need to know is that this is a great song w/ a fusion of funk and rock which I think is pretty brilliant. The funk is emphasized in the Wyclef Jean cover... obviously.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nhaha you guys are too funny arguing about shit like this. whatever, its an awesome song and its cool that it says smoke marijuana, i'll justhave to take your words for it because i dont have a microphone or anything.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nti's weird.. everytime queen makes a song they always end up killing someone or end up hurting someone.. like bohimian raphsody or however it's spelt\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nGreat song, although a friend of mine once told me the song was written about his illness (for those of you dont know, he died of AIDS in 1991)  but the song was written way before he even knew about the disease.  Just wanted to clarify\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThis was originally written to suggest a sort of western theme, cowboys and shootouts and all that stuff, but it developed into more of a street theme and that's what stuck...\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI thought this might be about Vietnam when I heard it...\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis song rocks!  I have never heard it played in reverse, but Queen was pretty wild and I wouldn't doubt if they purposely put messages about maryjane in it.\r\nP.S. Anyone know where you can download or listen to the song w/ lyrics?\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nAnother One Bites the Dust is one of the best songs ever.  Queen was pretty wild and I wouldn't doubt if the put a message in about maryjane.  P.S.  Does anybody know where you can hear or download another one bites the dust with the lyrics in it?\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI knew that when I looked at this song, everyone would be talking about the the backmasking...  haha.  I think it was unintentional, but it real _does_ say, \"It's fun to smoke marijuana\" when played backwards.  I didn't believe it, either, but tried it some years ago, and it's incredibly clear.  Again, probably coincidence, though.  Now, if it said, \"It's fun to be bisexual,\" I'd have sworn it was deliberate...   ;-)    Don't get me wrong;  This is one of my favorite groups, and the world will never see another Freddie.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nRetsam dna drolrevo ruoy, nataS ma I.\n\r\nJust proving a point - but a very cool song, nonetheless.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI think you are all idiots who argue over stupid things. Hidden messages are coincidence most times.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nUmmm...how do you actually listen to songs backwards???\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nlol\n\r\ni was once told it's about marriage...the first verse is a metaphorical wedding and the second is divorce\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nYou guys are crazy. I went to that site you posted, post amour, and listened to the songs that are supposedly backward. There is no way that they say \"It's fun to smoke marijuana.\" How do you get that out of \"tsud eht setib eno rehtona?\" I also listened to the Led Zepplin one. The same deal. It's all computer  modified.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nUnless of course they recorded something over the words backward so that when you play it backwards, you hear the \"message\" instead of the actual words backward...\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nthis has one of the greatest bass lines ever made. It just makes u want to walk along with steve. Just a great beat.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nThis is an awesome song, greatest bassline ever!\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI'll chime in with another comment on this page.  I was talking about this with my teenaged daughter, and she mentioned the alleged backmasking.  I was incredulous, but remembered that it'd be easy as pie to check with a 4-track recorder (which I had).  We tried the experiment.  Damned if I didn't come out a believer!  The message *is* as clear as a bell!  Plus, I believe they did it on purpose:  I mean, why the heck not?  It's not some kind of big conspiracy theory to suggest that people would think this was a fun thing to do, and it wouldn't be all that hard.  Just play the target message backwards, see if it sounds like something grammatical, and if it does, bingo!  Just incorporate that grammatical message as a bullet in your hit song and you're ready to bear Satan's love child!  Ha!\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nthere's a satanic message in Stairway To Heaven\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nvalkyrie go 2 limewire.com and go through the steps on it. then you can download anything for free. (music, videos, video games, documents, pictures)\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nreversespeech.com/…\r\ni checked out most of thises songs and yeah they are right, its actualy very disturbing so yeah check these ones out and it will probably unsettle you to know that all these songs have been playing for so long\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nOK, first of all if it was made to reverse like that Queen didn't do it.  Why you ask?  THEY DIDN\"T WRITE THE SONG!  John Deacon did, so you are all just completely fucking retarted.  I said it.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nwell i never said that it was them who put it in there, and it was never said that it was written into the song like that because it could have been put in there during the editing phase of making the song, or it could have been completely accedental and people are just making a big deal out of it but whatever...\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nit doesnt say 'start to smoke marijuana' is says 'its fun to smoke marijuana'.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nAnd yes it sounds dead on 'its fun to smoke marijuana\" but it doesnt mean the song is about marijuana.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nLook, anyone who has ever done backmasking knows it's bullshit, you can make your ears our to hear anything. The \"it's fun to smoke marijuana\" stuff was not put in on purpose.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nWe all have our different beliefs about backmasking but sometimes bands do use it because Aerosmith on Sweet Emotion says: Thank you Frank or F*** you Frank because there producer was dying and they wrote that backwards in it but as far as the lyrics our on they are nothing about Frank they are about Joe Perry's girlfriend- nothing to do with the secret message......\n\r\n Anyway This songs ROCKS!!\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThis song and its baseline is heavily copied from Chic's \"Goodtimes\" which was a big hit a few years earlier.\n\r\nThe original lyrics by JOHN DEACON were about cowboys, biting the dust is a wild-west term. John said himself he was too embarrased to show the original demo to the band members, so he re-wrote it and this is what they got. Everyone liked it immediately.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nFun to smoke marjuana ay? I heard it, it freaked me out\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nCan anyone tell me what the Led Zeplin one backward thing says? I can't make it out :(\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThis song is the first Queen song I ever heard and it's what got me liking th band....that was nearly 10 years ago and I haven't looked back since. Queen really were the greatest band ever. Long Live Queen.....\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nthis song is pretty much about gang violence or violence in the streets.  from muggings to gun gangs to steel pipe toting freaks, this song sez it all.  Queen rocks!\n\r\ni usually play this song while playing River City Ransom or Double Dragon on my Nintendo. good games.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nwow you all over anylized this so much ITS ABOUT THE MOVIES AND TV, GLORIFYING VIOLENCE, there the end not so hard was it?\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nThe \"bites the dust,bites the dust\" part sounds like\r\n\"Bites the dust,I'm adopted!\".\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\narcadian, you are the walrus!\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\n\"it's fun to smoke marijuana.\" Yes, when it's played backwards it says that. But when it's played forward, like when NORMAL PEOPLE listen to it, it's an awesome song about the hard-knock life. Quit wondering and philosohpising about hidden messages and just accept it at face value! CHRIST!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\ngoomba i'm the walrus!!! and the eggman!\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nGoomba,thanks.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nThanks for the science lesson, Professor Rex ludeorum. But couldn't it be just a funny coincidence that the way he sings the words comes out sounding like something else backwards? Just a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nI think this song is about a divorce gone wrong as such \"How do you think Im going to get along \r\nWithout you when you're gone \r\nYou took me for everything that I had \r\nAnd kicked me out on my own\" and also \"You can beat him \r\nYou can CHEAT him \r\nYou can treat him bad and LEAVE HIM\" so those clues lead me to believe that its about her husband going to kill her and kids.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nha I hav proof that they put \"its fun to smoke marijuana\" in on purpose. lisin to Headlong. at the end u cant figure out wut they r sayin. lisin to it backwards and it say headlong clear as day. this proves they knew how to do it and did it in their songs. to do this put the song on ur computer and turn it into a WAV file. to do this go to prferances or options and go to song type. make sure u change it to WAV. then covert ur song. go to sound recorder under acceseries and entertainment. then go to reverse. it works. try this wit Stairway to Heavon also\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\ni use iTunes to do it...i couldnt figure out how to do it with windows media player. go to apple.com and download i Tunes for free. u dont need an ipod. preferances is under Edit.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\ni do this wit iTunes. if u dont hav iTunes go to apple.com and download it. its free. no ipod needed. preferances is under Edit. and if u still need help AIM me\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\ni use iTunes for this. if u dont hav it download  from apple.com its free and u dont need an ipod. preferances is under Edit. AIM me if u need more help\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nJohnny Blitzkreig is the only dude here in the last couple years to corroborate my claim this song is about marriage? once a guy says \"i do\" he \"bites the dust\" ...maybe then he goes and smokes marijuana to cope w/ the dissolving of his marriage\n\r\nand yea, arcadian, you are the walrus\n\r\nalso, i noticed the similarity, but i didn't think this song intentionally sampled the bassline from \"good times\" ...i just figured it was a coincidence the song had a similar chord progression and rhythm...cus the melody and atmosphere are totally different, and the bassline is much more spare ...all i'm wondering is, does someone know where john deacon actually said he sampled it intentionally, or if he just wrote it himself and then it hit him that he didn't reeeaaly write it\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nthis song is cool except for the hidden message in the chorus when you play \"another one bites the dust\" backwards it says,\"It's fun to smoke marijuana \" i agree with HubCap1438\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\ni concur with arcadian. if he doesnt yell \"im adopted\" then what the heck IS that line!!? the pot argument back there is the most hilarious thing ive heard since that monty python skit about \"how to avoid being seen\", so keep it up, yall!\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nI always loved Queen and every element of this song is perfect.  I have an old audio tape by Pastor Gary Greenwald called Rock-A-Bye Baby.  It came out around the time of the PMRC attempted to censor and put the warning labels on albums.  He is formerly from the rock music industry turned evangelist.  Another One Bites the Dust and several other rock songs are played backwards.  There are some possible messages (subject to interpretation) on the tape but the Pastor always tells the listeners what they'll hear beforehand.  I think rock lyrics played forward are controverseal enough.  There would not be any need to ever put backwards masking on recordings other than to spite holy rollers.  I love the music so much Iâ\u0080\u0099d hate to see evangelists get there way.  Long but informative site:  religioustolerance.org/…\n\n\n", "comment_96": "\nplease, please, PLEASE get off this backtrack thing. this song is about violence.\r\nit kicks ass.\r\nthe end.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nya its \"its fun to smoke marijuana\"\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nwell it's an awesome somg and that is all that really matters...no offense or anything but can't you do something else besides play songs backwards on your computer? it doesn't seem that thrilling ot me...anyway my opinion is that this song is about how hurting people in anyway is wrong and it seems like everyone is out to get everyone...haha it kinda strange to think about how everyone hates someone and wants to hurt someone..no one can really say they don't..it human nature\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\napparently if you play it backwardshe sings 'its fun to smoke marijuana'\n\nalbinoblacksheep.com/flash/…\n\r\n^^link to show it\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nIt's fun to smoke marijuana... if you cant hear that then youre seriously Naive!\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nsome bastard baller started rocking out to this song because he though it was an R & B Song... what a dumbass!!! \n\r\nHIP HOP, RAP, AND R&B SUCKS BALLS!!! \n\r\nand ballers suck what they are named after (thats right... balls)\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nit's a disco styled song. It is actually popular with the 'ghetto' folks in the cities. Before the single was released in the USA, disco and funk DJ's in the black neighborhoods, would play this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nCool song. This can also be about love and not just war and guns:p\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nwow, you guys have awesome opinions and all, but i think it means someones dieing.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nIf you reverse Simon it's Nomias. If you reverse Cats on Sticks it's Skits no Stac. Bet you didn't know that.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\n*runs away into the mountains*\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nsome dude had this little motor scooter, with a huge sub tied on with bungee chord, and a couple speakers....he was bumping this song so loud at a stoplight...i couldnt help rock out with him ahaha\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\ngod! will every1 stop wib that it sounds like hes saying 'its fun to smoke marajuiana' backwards. do u really think freddie is gona tink of every sentance in the world and see if it says that? like how would he know it would of said that when he write it?? its just a strange coincidence. \r\nAnyway freddie didnt write it, it was written by john deacon and 2 my knowledge was not involved in any drug realted incidences.\r\nso you can all be amzed with ur 'OMG!!''s but it was not done purposley\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nmy god i cant spell 2day!\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nI'm gonna agree with whoever it was who said it was about a marriage and divorce.  But also the song reminds me of the Spaghetti Westerns that Clint Eastwood was in.  ...So I'm gonna say:  Divorce in the Ol' West...or something.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nOoh, just noticed:  100th comment!\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nwoot, its fun to smoke marijuana!  (haha i just said that to piss off alll the people who wanna drop the backwards thing) \n\r\n;) one luv, keep fighting!  yeah, rock!\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nA couple people remarked that when he says \"Oh take it - Bite the dust bite the dust,\" it sounds like he says \"I'm adopted!\" at the end.  I always wondered about that.  I actually thought he was saying something about a doctor, but I couldn't make it out.  It's weird, anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nThere's some site that plays this song back wards and you can here the smoke marijauna...\n\r\nbut i think that guy is just some bored techy who wants to create conflict between generations.\n\r\nnone the less, it's an awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nWhen I heard the \"fun to smoke marijuana\" LMAO. But they didnt do intentonally I guess. Coincidense (spelling?)\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\ntheyre crack heads......lol\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nyeah ive definently always thought he said \"im adopted\" at the end. i have no idea what he really says\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nI'm just wondering. Why does everybody have to try and find a hidden messege. Cant we just listen to the song as is instead of going thru the trouble of trying to reverse the song. And i'm pretty sure that most songs were'nt meant to be listened to backwards. If they were they probably would have made it that way. And the messages wouldnt be hidden if everybody knew it was there. \n\r\nBy the way i think this is a great song no matter the 'hidden message'\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nI think it is about a guy who got dumped HARD by a girl that he was obsessively in love with, and when she left him he snapped and decided to walk down the street killing everyone he passes, eventualy arriving at her house. He bashes down her door and blows her away. The End.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nAs much as this song looks like its about another one biting the dust. Its not. Its about Having sex with women. In the water. Usually in the ocean. But in a big bath is still good. But not in a public pool! No no no no! thats wayyyy to public\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nJust curious, why is the guy's name \"Steve?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nleik ogfm ist abot mariwana! wft!11!\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nto f00d: it has a mythical meaning representing the roman god of dust, Stephanus who took the time to put hidden messages in every somg that exests\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\ni doesn't say start to smoke marijuana in reverse it says: it's fun to smoke marijuana.\n\nalbinoblacksheep.com/flash/…\n\r\nwatch it if you don't believe me\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nThis song is probably one of the top ten rock songs of ALL time, and you're arguing about secret messages. Stop listening to the messages and enjoy the music. It's a good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nI LOVE this song!!!!  Rock it OUT!\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nThere is this one website that has tons of conspiracies on reversing things. The beatles had a few songs in which the \"brabbling\" really was a reversed message, but another one bites the dust in reverse really doesn't sound like \"start to smoke marijuana\". That site also says \"it's fun to smoke marijuana\", well if you READ it while hearing it, you MIGHT find it, but it's far fetched;\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nWith all-due respect, Richie, fuck you.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nI've never heard this song backwards. I have heard other songs played backwards and they don't really sound like what people have interpreted the words as. I think that maybe people just want to hear it like that for some reason. \n\r\nCan't we just all agree that Queen rocks and all their hits are classics?\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nalbinoblacksheep.com/flash/…\r\nu can find backmasking here... its \"fun to smoke marijuana\" but still I like this song..\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nqueen does not fucking suck.  man, anybody who likes rock must at least have some respect for queen.  this song is obviously one of the best rock songs ever\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nQueen is the best rock band ever, and I truly agree with Crimson_heartfoil cause people underestimate Queen, just because Freddie was a bi-sexual.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nOH,Man some people believe everything, message in songs while you play them backwords, you gotta be kidding me,first of all, if you start to listen to any music backwards ,rock,pop,rap,damn even jazz or classical, YOUR OUT OF YOUR F$^$%*%$* HEAD!!!!!!!!\r\nit's the same as with the people saying that some songs put to comit suicide,man \r\nI've been listening to \"Anotherone Bites The Dust\" since i was 10 years ,i'm now 35 and never had any Marriuana or any other drug.....\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\ni have to admit, this has never ben one of my fave songs...\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nsorry, *been*\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nif u listen 2 one of the britany spears songs backwards it says sleep with me im not 2 young\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nwhich one?\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nHit me baby one more time.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nStop talking nonsenses about mary the iguana.. this song doesn't have a hidden mesagge it's just about the revenge of a gangsta'\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nwen u hear this song bakwards it does have a hidden message. ppl rnt jus making it up. ITS TRUE\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nAmazing song.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nviolence is bad \r\nbut this song FREKIN AWESOME \r\ni recomend it for long trips and when you are angry or feeling violent let steve express your anger \r\nand dont hurt no one :)\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nAnyway, I love the song so much! I can't help but dance! Just like on the song \"Crazy Little Thing Called Love\"!\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nHmm, I used my PS2 Eyetoy to play the phrase \"another one bites the dust\" backwards, and it sounds like:\n\r\nSud Et Setieb now rethona\n\r\nI don't know people are getting messages about Satan with that, but oh well.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nI really don't see Deacon writing a song with a marijuana message, but then some people belive that killer queen is about AIDS!\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nThe first verse seems to be a literal death, then i think the bit:\r\n'How do you think I'm going to get along\r\nWithout you when you're gone\r\nYou took me for everything that I had\r\nAnd kicked me out on my own'\r\nmeans that love is just like a wartorn country and we're never safe in it.\n\r\nAnd YES, it does play something that sounds like 'start to/it's fun to smoke marijuana'. And apart of 'Hit me baby one more time' can be reversed to make 'sleep with me i'm not too young'. And 'Stairway to heaven' has a whole verse which can be reversed to create a satanic message. Maybe these were put there deliberately (which takes a lot of effort, i've tried) or perhaps they are coincidence. They're interesting but theres not much point arguing about whether they're there or not!\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nokay when I first found out that this song backwards was that weird message I was think like oh whatever it just happens to sound like thats mumbled somewhere, but now everytime I hear this song I keep thinking about it and the beat freaks me out... grrr damned druged people. \n\r\nps. I still love the song :P\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nThis song is about Chocolate and Juggling. Mario: Queen of Circus told me.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\ngood song to rollor skate to! haha\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nawesome song and why r ppl getting mad and denying that it says \"its fun to smoke marijuana\" it does in fact say that and so what they're right\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nit really does say start to smoke marajuana! really it's amazing but are you sure it's not about freddie being bi? every other song is\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nIt says, \"I started to smoke marijuana\" backwards.  Someone asked how to listen to it backwards:\r\nJust unplug the power cord of your turntable and turn the record backward with your finger on the label, with your receiver set to phono.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nthis song is way overated\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\ni think this is about teh World War Two Battle Of Normandy. idk i think its the doorway of an american boat that carried abotu 20 men each to the Normandy Beach and the machineguns through the doorway are german machineguns. so many people died in that battle  (thus, another one bites the dust\". and fi you've seen saving private ryan the movie shows all the yojung boys crying for there mothers on the beach as they all get shot at. thus \"There are plenty of ways that you can hurt a man\r\nAnd bring him to the ground\r\nYou can beat him\r\nYou can cheat him\r\nYou can treat him bad and leave him\r\nWhen he's down\r\nBut I'm ready yes I'm ready for you\r\nI'm standing on my own two feet\r\nOut of the doorway the bullets rip\r\nRepeating to the sound of the beat\"\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nit doesn't say anything about marijuana, listen to it yourselves reversespeech.com/rev/… it doesn't say anything. In this site there are much more understandable phrases, although all that backward stuff is bull shit. If you want to find a message, you'll find it, no matter if it's there. Freaks.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\neven if it says 'smoke marijuana' or something like, it's even better! i'd love to think that it is there but it really isn't. no one has time to make things 'backwards'... who gives a shit... smoke weed and listen to queen!\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nBackmasked messages arent supposed to be 100 percent clear and would be mere impossible to do.\n\r\nTo mackmask, first you'd have to record yourself saying \"Its fun to smoke marijuana\", then play it backwards, slow it down alot ot hear its correctly, then say words that sounds like the message in backwards, so when played forwards and reversed you get the message. And you cant really just record it, reverse and get the message, because everyones voice and pronounciation is different.\n\r\nEither way, this doesnt mean it was put in the song purposly, and has just as much chance as being a coincidence then not being one\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nTo me, this song has always been about a relationship. About the defiance needed to get involved romantically/sexually with someone.\n\r\n\"There are plenty of ways you can hurt a man: you can beat him, you can cheat him, you can treat him bad and leave him when he's down.\"\n\r\nHow is that not love related? Plus, if we look at the rest of Queen's songs, they're about love/sex, aren't they?\n\r\nPlus, the line I quoted has seemed to me to sum up quite perfectly how it feels to get dumped.\n\r\nYes I'm drunk. But I can still spell. And you know I'm right.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nCripes, so far 7 pages of comments. This has probably been mentioned before, but here I goes:\n\r\nQ: What do the following songs have in common?\n\r\nAnother One Bites the Dust\r\nRapper's Delight (Sugar Hill Gang)\r\nGood Times (Chic)\r\nRapture (Blondie)\n\r\nA: The bass line.\n\r\nExtra Credit: which was first??? (don't cheat and google it)\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nLucinda001, if you think that all Queen songs are about Freddie's bisexuality (he was actually prob gay, btw), then you REALLY don't understand those songs. :s\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nI think this song is about freddy mercury not anted to be persecuted by the anti gay community, and marijuana is good\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nI think this song is about freddy mercury not anted to be persecuted by the anti gay community, and marijuana is good\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nWhen you play this backwards, it says \"John Denver, don't fly that experimental plane.  You won't be biting dust!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nOne of the greatest rock songs ever. I love it when he's singing \"heyeyeyeyeyeyey!\" my favorite part ^^\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nwe danced to this on a monday in Vienna. It was one of the most orgasmic dance-offs EVER in which all were dancing, but not with anyone. Then a boy got handsy and glass shattered. \n\r\n\"grungy chic. everyone was sexy and free. except the weird guy, but I guess you can't go to a club without a weird guy.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nDuh. Jeez, maybe the whole \"starts to smoke marijuana\" thing could be WHY ANOTHER ONE BITES THE DUST! The guns and everything could be a whole metaphor for drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nOh take it - Bite the dust bite the dust \n\r\nor \n\r\nOh take it - Bite the dust, I'm adopted \n\r\nhehe :p\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\ntrust me when u listen 2 this song backwards it doesn't say \"it's fun to smoke marijuana\"it says \"dust the bites one another\".i born and is raised around classic rock music.so i have heard this song a thousand times.some of you need 2 no that people can go no the internet and change the lyrics of a song,even though it is illegal.they don't get caught for it.k?\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nMabye its a message from the future like, in his day you couldnt walk around without guns in your face, and in the future you cant walk around without pot in your face. All self opionion though.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nAnd cdhrox, when they say backwards they mean \"backwards\" as \"sdrawkcab\"\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nthis is the only song by queen that i like.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nOkay guys, its not about war and its not about weed. If you really think about it its about a girl breaking up w/ a guy. \n\r\nat the line \"how long can you stand the heat\" that means the awkwardness b/t the couple.\r\nat the line \"Out of the doorway the bullets rip\" that means the words: we need to talk or i wanna break up or something like that.\r\nat \"another one bites the dust\" it pretty much means another guy is dumped. \n\r\nI mean really? look at the lyrics: \n\r\nThere are plenty of ways that you can hurt a man\r\nAnd bring him to the ground\r\nYou can beat him\r\nYou can cheat him\r\nYou can treat him bad and leave him\r\nWhen he's down\r\nBut I'm ready yes I'm ready for you\r\nI'm standing on my own two feet\r\nOut of the doorway the bullets rip\r\nRepeating to the sound of the beat\n\n\n\n", "comment_173": "\nthis song is not about weed, a video game, nor war...it's simply about \"love\" viewed as a battle field between lovers. Expressing how someone can beat you to the ground and take you for everything that you have and get out and leave you there hopeless. Yet Freddie looks at it optimistically by saying \"another one bit's the dust.\" another failed relationship but he's standing on his own two feet not ready to give up but fight more....so I think. \n\r\nIn all this song ROCKS!!\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nwhen you play the \"another one bites the dust\" part backwards, it really does sound like \"its fun to smoke marijana\". but i dont think that they planned it to sound that way. its just the wayy it sounds when it is reversed. \t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nExcellent song!!!!! Hidden message or not. It reminds me of the second part of the last level of Driv3er.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nYou people are stupid and just think every song is about drugs. How about listening to the song (sober) for once and maybe you will understand the lyrics. \n\r\nThe song is about a soldier named Steve who encounters a fierce shootout. Steve kills lots of the opposing side. Hense another one bites the dust, and another one gone. In between he talks about the way he gets along with his fellow soldiers\n\r\n\"Stupidity is learned not taught\" - someone smarter than you\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nSince everyone is speculating on the meaning of this song, I, too will jump on the \"band wagon\", no pun intended. First I have too say that this song is clearly one of the \"grooviest\" songs of all time. It has a \"way groovy\" 70's sound to it, and from my research this was no accident. As with a lot of songs (poetry + music= song), there is not simply one meaning, and it is for each to interpret. Based on the lyrics themselves and the man who wrote them, knowing his sexual preference as heterosexual even though the man who actually sings the song is homosexual (look these facts up for yourself-you have to do your own homework) I believe this has a partially, as with a lot of songs, a \"love/heart broken/bitterness\" underlying theme in this song, but that is not all that is there. I believe that the writer has successfully drawn exquisite analogies and painted such a vivid picture with these lyrics, he has to have witnessed firsthand some sort of dangerous situation involving perhaps the death of someone, whether it was by drug use, or perhaps even literally by a gun. He's (Steve) is walking \"warily down the street\" with his hat \"brim pulled way down low\" (clearly he is in a bad part of town somewhere), again either literally, or figuratively. The only sound anyone can hear is \"the sound of his own feet\" and be prepared with \"machine guns ready to go\". \"Are you ready, are you ready for this. Are you hanging on the edge of your seat. Out of the doorway the bullets rip to the sound of the beat. Another one bites the dust (did he just see someone get shot?) And another one gone (he's seen this before)...Hey, I'm gonna get you, too (Who are you? Drug abuse?) Another one bites the dust.\" That's how you break down a poem. Great poem, set to great music= FABULOUS SONG. No wonder this one did so well for QUEEN. It's been fun.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nTo be honest, given the big controversy of playing things backwards to find hidden meanings at the time the song was written, I wouldn't be at all surprised if John didn't do that on purpose... just for a laugh (and possibly good marketing).\nThe song itself isn't about smoking weed.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nMy 2 cents: This song is about a man who goes on a killing spree after being scorned by his lover.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\namplification\nfind amethyst machinery\nuzi harassment\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nI always thought this song was about gang violence.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nIts about a man who have a lot of sex, he have sex constantly, the use of the deah and the guns its just metaphoric, also I think the protagonist have recently split of a relationship and he finds relief in casual sex\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nI thought he said \"I'm Adopted\", Mondegreen or not?\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nI thought he said \"I'm Adopted\", Mondegreen or not?\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\n in St. Valentines day Massacre 7 men were killed and He shows that by this lines:\n\r\n\"Another one bites the dust (1)\r\nAnother one bites the dust (2)\r\nAnd another one gone (3), and another one gone (4)\r\nAnother one bites the dust (5)\r\nHey, I'm gonna get you too (6)\r\nAnother one bites the dust (7)\"\n\r\n:) \n\n\n", "comment_186": "\nâ\u0080\u009cAnother bites the dustâ\u0080\u009d, can also be â\u0080\u009cAnother one buys the dustâ\u0080\u009d, a reference to drug use, â\u0080\u009care you happy, are you satisfiedâ\u0080\u009d can be a reference to drug addiction, once heâ\u0080\u0099s never satisfied and going out the door to buy some more.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nAn interesting fact about this song - it is Queens biggest selling single. Which is kind of funny to think that John Deacon wrote Queens biggest seller all by himself...\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nIf Steve had just \"learned to smoke marijuana\" then maybe he would've just let karma catch up with his ex girlfriend and all of those people wouldn't have become machine gun fodder. \nI'm just sayin'.\n\nLOL.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nWhat? There's a subliminal message telling kids to smoke the devil's lettuce?\n\nOh noes! Now this wholesome, family friendly song about mass murder is ruined!\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nI think this song is about the magic of Westerns and the response of the audience enjoying the shoot outs \t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nThe song is about a gunfight. Deacon said he was thinking about \"cowboys\" when he wrote it.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nThis song is about gay sex because Freddie Mercury was gay, and about gay men dying of AIDS in the 1980s because the AIDS epidemic was big in the 80s and Freddie Mercury himself died of AIDS. \nThe song describes a man who's being penetrated sexually by another man (or maybe woman...) The person who is penetrating and the person who's penetrated are in a weird relationship with each other based on a strange cocktail of emotions, including anticipation and emotional dependency (\"cheat him and leave him when he's down\")\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nI read it as a song about the competitive society we live in.  We're constantly at war with one another (figuratively) - sometimes we win, sometimes we lose, but in the end, we all lose our humanity.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nI read somewhere it was in reference to the IRA fighting the English in the 70â\u0080\u0099s....Everywhere u went there were bullets flying and people dying.....\n\r\nI had a whole new respect for Mercury when Iâ\u0080\u0099d heard this....very political and very angry....\n\r\nI had the 45 record when I was 5yrs old and played the hell out of it!!! Love the rhythm section in this tune....\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nI used Cool Edit 2000 pro to reverse the song...  He was right...\n\r\nThere is a hidden message...\n\r\nAlso, if you play the friends song backwards, there is a message from satan...\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nLOL\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nactually, when i play it backwards, it sounds more like \"it's fun to smoke marijuana\"\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nit doesnt say start to smoke marijuana it says decide to smoke marijuana and it also says hay look im on acid\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nHubCap is right.\n\n.memlane.com/jmilner/…\n\n\n", "comment_200": "\nqueen sucks\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nworst song ever, i hate when people categorize queen with led zeppelin, the who, and neil young as the best rock bands ever\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nPretty sure this song is about taking it up the butt.\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nWHAT??  how does hamlet's soliloquy say \"Frank Sinatra is God\"?  are you kidding me?  Shakespeare wrote Hamlet hundreds of years ago!!  Frank Sinatra is old, but not THAT old!!!\n\r\nI think this song is either about Vietnam, or a large city with heavy gang activity.\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nI disagree. I \"think\" ( y'know? whateva) ha ha that it is It's nice to smoke mary wanna (marijuana). I'm Steve , and my brim is wayyyyyyyy down low\t\t\t\t\n\t\t\t\t\n\n"}