{"comment_0": "\nok these comments about fucking her before he leaves just ruined this whole song for me. I think hes saying he doesn't want to forget this girl and he can't see any other man having her but him. This is a really sweet song that some of these people have just ruined.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIt's not just about him wanting to bang before he leaves, he's talking about a summer romance. He met a girl over summer vacation, and he doesn't want to forget her after the vacation is done. \"So tonight I hope that I will do just fine\" is him saying how he knows this could be the last time he ever sees this girl, a girl he had true feelings for but has to leave to get back to his life elsewhere. \"I don't see how you could ever be anything but mine\" - He will always have feelings for this girl, knowing that she may be \"the one who got away\".\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis is one of those self delusional songs or one that has potential for a court order.  Great song.  I've never been to Cleveland.   Miracle Miles aren't strictly adherent to Myrtle Beach urban zoning.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWhen he says that he loves her and they laugh b/c they know it isnt true, i think its referring to summer love, because they prob just met, so they both its not really love, they just want to think it is.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think that this song is about a summer romance (even though it could apply to any situation), and the boy is going to Cleveland either for school, job, etc.  Regardless of why he's going, he's leaving this girl behind.  He obviously has feelings for her and doesn't want to leave, which is why he can't see her as \"anything but mine.\"  While they are listening to the local band, everything feels right, and he tells her he loves her.  Then he laughs, but I imagine it to be an awkward/forced laugh that he uses to cover up his true feelings for her.  The video is beautiful, and seeing Kenny play this last night in Chicago was amazing.  The video shows that the boy writes this song as a goodbye for the girl, which she receives the next morning after he has left.  Just a beautiful song that so many can relate to.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ngosh, you guys all make it sound like he's just a crazy teenage guy looking for a girl to bang. he's really in love with her, and the reason they 'both laugh, cuz we know it isnt true' is that theyre trying not to make things worse when he has to leave. its really sweet, and i love the video. it reminds me of this guy from florida...perfect summer romance song!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nMy favorite Kenny Chesney song.  I love the way the lyrics and the melody blend together.  Like they were meant for each other and are inseparable.  And so descriptive.  Anyway here is the meaning according to Clint Eastwood.\n\r\nThe key to this is that Mary's got a boyfriend already and it's not him.  How are all you people missing this?  So he and Mary have become really close friends (and maybe lovers but I think not) and would be a real couple except for her boyfriend (fiancÃ\u0083Â©e?).  He and Mary are probably the same age and the boyfriend is older (sound familiar?) and she can't leave the boyfriend because he probably has a job and real prospects or whatever.  \n\r\nWhen he says \"So tonight I hope that I will do just fine\" he is hoping that he can be the same friend they have been in the short time they have been together.\n\r\nBut it sucks because he really, really wants her and he can't see her being with the real boyfriend.\n\r\nGreat song!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI remember when I just started loving music, it was country. Now, I can barely listen to the stuff, it's mostly corny, unoriginal bullshit.\n\r\nBut the nostalgia is just SO intoxicating and it kind of makes me cry when I hear songs like these. Cause I was young and didn't think about anything but music and my friends. And now I think about too much. I didn't care about money, worry about my mom, I didn't come home from school every day miserable. I remember listening to this song in the car with my mom. \n\r\nI used to love Gretchen Wilson :) (still kind of do but don't tell anyone)\n\r\nNow, I love Radiohead, Nirvana, Lady Gaga, Madonna, and the Smashing Pumpkins. Just like my life, my music tastes have completely changed. \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nLove this song.  It reminds me of how when my relationship started it was a long distance one.  I lived in Southern California and he lived eight hours away in my hometown in Northern California.  Granted, that's not the longest distance ever, and saw each other about once a month, and eventually were able to move closer together and stay together, but it was hard spending time together and then having to watch him leave or having to be the one to leave, especially in the beginning of the relationship because we weren't sure where it was going at first due to the distance.\n\r\nYou can interpret so much about this song, which is kinda the point of good songs, it makes you think and there are probably no \"right\" answers (I don't know, ask Kenny, or whoever it was who wrote the actual song!).  But this is what I think:\n\r\nI think he's spent the summer (or maybe even less than that) with a girl and he has to return home and this is his last night with her.  He does want to have sex with her before he leaves (\"there's so much I want to do to you\" and \"Tonight I hope I will do just fine\" are quotes that seriously indicate that), but it is clear he really cares about her so while he wants to have sex with her, I believe one of the reasons is that he really wants to leave her with a good impression with her, which is why he hopes he will do just fine.  \n\r\nIt does bother me when it says \"In the midst of the music I tell her I love her but we both laugh cause we know it isn't true.\" But what I think it means is that they haven't spent enough time together to know if it is really \"love,\" and they know they can't be together at the moment due to him having to go back to Cleveland, so \"love\" really isn't even a possibility at that point in time.  I also think that telling her he loves her would create a heavy mood, and it seems like they are just trying to enjoy their last night together and have fun and not allow things to feel too serious or sad, although it seems he is very sad and trying to hide it.  I think the music brought out an honest feeling out of him, so he says he loves her, but then they laugh because it was unexpected and with him leaving the next day, there's no point in saying it.  He doesn't really know where things are going right now, so there is a lot of confusion.  With him saying \"I don't see how you could ever be anything but mine,\" alludes to the fact that there is a possibility he will see her again, or that they've made some sort of future plans, but he isn't 100 percent sure there will be a follow through.  \n\r\nOr maybe he was doing the typical guy-thing and telling he loves her so he can get laid, but cares about her too much to lie to her, so he laughs after... either way, he is being really honest with her which shows that he does have deep feelings.\n\r\nI think the line \"I hope I will do just fine,\" simply means he wants to leave a good impression on her or perhaps he is losing his virginity.  It seems like a young romance.  \n\r\nSomeone suggested that Mary has a boyfriend and that he's just her friend, so that's why he says \"I don't see how you could ever be anything but mine.\"  There's no mention of another guy in the picture, but who knows.  I think he just can't picture her with anybody else or himself with anybody else.  \n\r\nI think \"I don't see how you could ever be anything but mine\" means that he can't picture her with anyone else, so he thinks that fate will somehow bring them back together again.  It's like he has faith that they have found such a great connection that he trusts they will be able to connect again and I think him wanting to take their relationship to the physical level is part of that faith that they will somehow see each other again.  \n\r\nHe believes what they have found is not easily replaceable and he can't picture anyone else entering the picture, so he is hopeful he will really get to see her again.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song takes me back to the summer when i went to Washington D.C. for a band trip. I basically fell in love with one of the boys on the trip with me. We did everything together, hung out the whole time, held hands, the whole bit. It was so cute one time when we got off the bus i ran to him and jumped in his arms and we hugged for so long it was like a scene from one of those romantic movies. His friend recently told me that he said we were \"meant to be\" and let me tell you, that melted my heart. i hope he still feels the same because i would gladly be with him in a heart beat. He is still to this day the sweetest guy ive ever met. he will always have a special place in my heart no matter what the future brings.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis is about a summer romance of two young people who met at the beach. It's such a coincidence to me because I had a summer romance with a guy that I met at the beach and he was from Cleveland. I think when he says \"I don't see how you could ever be anything but mine\", he is expressing how perfect they are together and how he feels like they are destined to meet again one day.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI've always believed that this song is talking about like true love. I mean I guess I just get this feeling fromt eh chorus but it sounds like it's true love and they're paths can't lead together and stay as one so he's saying that in his mind shes the one that makes perfect sence to him. THe perfect fit. And he can't see her with anyone else or him with anyone else.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI don't get why I keep hearing that this song is 'controversial' and 'haunting'.. someone wanna help with that?\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nAt some points, I really don't understand this song.  It does sound like a summer romance and very important and intimate.  The (supposed) guy singing says that he hopes he does \"just fine\", whether that's sex or just saying good-bye, but if that's true, why does he tell her he loves her and they both \"just laugh because it isn't true?\"  Apparently, it must really have been a sex/animal thing.  I do love the song, though; it has a soothing effect on me, like even though they're saying good-bye, they know everything will still be okay.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthe reason i don't think it's about love is because it says \"in the midst of the music, i tell her i love, and we both laugh, cause we know it isn't true...\" and he's leaving, and what else could he mean by \"anything but mine\" im thinking what he means by that is \"mine\" as in im gonna fuck ur brains out\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\n...also, \"theres a summer drawin to an end tonight, and there's so much that i long to do to you...\" what could he mean by that?\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI regularly don't like country.  This song makes me think of those times you said things you didn't really mean, but in the heat of the moment..it felt right.  It's funny how summer relationships take the course of all relationships in just a few short weeks.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nwell said, jvenrick\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI dont think this song is at all about sex. Most people have experienced summer relationships, and even though they shouldn't happen, you end up doing it needing comfort.. Its all like that, But its rather naive to think its about sex. You dont have to be in love to care and cherish someone.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI guess i'd have to agree with Malicious\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI love this song - although i agree that i don't understand it. When he says \"anything but mine\" - does he mean that she's not his AT ALL - or that he'll always think of her as his?\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI really like this song, and even though its a summer fling, I still like the chorus. I put it on a scrapbook page for my ex saying \"I dont see how you could ever be anyhting but mine.\" its so cute! The video is cool too...\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nnot about sex at all people,  Anything but mine - its what u want it to mean to me it means that my gurl will always be mine, whetere its for a summer or a year but for that time she was mine, and he just hopes that he will do just fine and he understand that after the summer how he will deal with out her or how she could ever be  anything but mine.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI really like this song. It's about him leaving, and how much he'll miss this girl he's fallen for over the summer.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nWhile parts of this song may have to do with sex in some way shape or form, \"...and there's so much that I long to do to you,\" that could also refer to simply spending more time together, or what not. The line \"...I tell her I love her, and we both laugh, cause we no it isn't true,\" is basically saying he has very strong feelings for her, and believes he could love her, or really does and just covers it up because he doesn't want her to feel his pain. He is going through what msot guys do when they loose a special girl, withdraw, doubt and jealousy.\n\r\nGreat song BTW.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI think this song is about one of those picture perfect summer nights.  They are together and everything seems ideal.  The wind is warm, theyre at the beach, they think that nothing could ever be better than this moment in time. He knows that he'll be leaving soon, but he is just living in the moment, and in this moment he cant imagine being anywhere else with anyone else, or imagine her being with anyone else either.  They go to hear the local band and it just makes the night more perfect, and he tells her he loves her, because in that second everything is beautiful and fabulous and they do laugh, cause they know that there is no love between them, but in that second, it just feels right.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ndude, just read the liner notes:\r\n When I was a sophmore in college, I went to Daytona Beach for spring break. I met a girl from Georgia -- And I was in love for a week. We walked the beach, listened to local bands play really bad versions of popular 80's rock songs, rented a Jeep and drove down A1A for her birthday -- and drank way too much with all our friends by the pool. It was perfect. Everything love in a moment is supposed to be. This song takes me back there -- to all my friends and that one really cute Kappa Delta I'll never forget who I lost touch with later that summer. (kennykrazy.com/…)\n\r\nthe wonderful/tragic thing about popular country music is that 99% of the time its so straight forward and direct, and it has a story telling aspect to it. theres not always a lot of hidden meaning and sometimes things are put in there because they fit the rhyme and meter.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI wonder why he says \"Mary\" like 3rd person or whatever, then says \"you\". I thought it was about a summer fling with Mary and the \"you\" is someone back in Cleveland that he really loves. Does anyone else get that? The summer draw and \"two in it\" might mean the temptation, and \"do just fine\" might mean he hopes to resist\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nWhy can't it be about a guy wanting to bang a chick before she leaves?  he doesn't love her he wants that tang.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nWhy can't it be about a guy wanting to bang a chick before she leaves?  he doesn't love her he wants that tang.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nFirst off....Corrections:\n\r\nWalkin ALONG beneath the lights of that miracle MILE\n\r\nThere's a warm wind comin in\r\nFROM OFF of the ocean makin its way past the hotel walls to FILL the street\n\r\nIn the MIDST of the music\r\nI tell her I love her\r\nAnd we both laugh\r\nCause we know it isn't true\r\nOh, Mary there's a summer DRAWIN' TO AN END tonight\r\nAnd there's so much that I long to do to you\n\n\r\nOk. Probably one of the best songs ever. Kenny met a girl once a long time ago in Myrtle Beach, SC.  The pavillion he talks about is the myrtle beach pavillion, which sadly just had its farewell season. Its their version of the \"boardwalk\" \n\r\njust thought id throw that fun fact out there\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nDoes anybody know what he means with: \"Walkin alone beneath the lights of that miracle mind\" - both the 'miracle mind' and the 'alone' (while in the next line it is him and Mary) confuse me.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nit's \"Walking along beneath the lights of that miracle mile...\" \n\r\nProbably one of the best songs ever recorded.   \n\r\nwhat is a or the \"Miracle  Mile\"?  i couldn't really figure that out.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThe Miracle Mile he is referring to is the most popular street in MB that is also called \"the grand strand\" by some. It runs parallel w/ the beach and after the sun sets the cars are bumper to bumper riding up and down the strip. The sidewalks are lined with people and there is always lots of flirting going on. It's also lined w/ stores, hotels, etc and where the Pavillion use to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nBest Kenny Chesney song there is.  Anybody who doesn't agree has just never experienced what this song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI do not understand this song, but I really love it.  It's the end of the summer, so it could be a summer romance, but he seems to uneasy around Mary (he hopes he does fine).  I wonder if Mary is a call girl he's \"dating\" - he hopes he does just fine (b/c she is very experienced) and he does not how she can be anything but his - she's convincing as a \"date\" - that's why they would both laugh when he says he loves her, clearly it is not true.  He has to fly home to his family the next day.  It does, however, seem more likely that it's a guy away for the summer between high school and college and meets Mary at the beach and this is just before he leaves.  He would be uneasy about being inexperienced.  Why would they laugh when he says he loves her?  See - I just do not understand this song!  I still love it, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI'm not a big fan of country music but Kenny Chesney is really talented. I love this song. It takes you away and puts you right where the story is set. \n\r\nSimply put, this song is about first loves. Summer flings. Feeling close to someone you have only known for a short period of time. The inevitability that you will be torn apart. Despite being separated, always having that feeling of being together at heart.\n\r\nFor some reason, this song makes me sad. It makes me think of someone losing a friend or loved one at a young age. As a Pittsburgher, Cleveland is about the farthest thing I can corelate with 'heaven' (no offense) but that is the way I like to see this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\np.s. amen to drummer girl!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nOK, I joined just to answer this song:\n\r\nAnything But Mine- He's saying he can't imagine her with in other person. \"mine\"... like, his wife/girlfriend whatever. Go to another song, Never Wanted Nothing More, and he said \"And she's mine all mine till the day I die and I never wanted nothing more...\" diff. girl but same concept.\n\r\nI hope I do just fine- Well, I think he means that he won't get upset... like he'll do fine mentally. If ur love and you were leaving eachother forever the next day wouldn't you be afraid of being a mess? I would pretty sad and hoping that I wouldn't make a fool of myself.\n\n\r\n\"I tell her I love her and we both laugh cause we know it isn't true\"- I think this is complicated. I think she views him more like a good friend. I think he views her as a girlfriend. So when he says that... she just laughs at him and then he laughs at HIMself for thinking that she would ever feel the same. \n\r\nJust my thoughts.\n\n\n", "comment_39": "\nI think this song describes a summer romance between two fairly young people. Think back to your summers after high school and between college. He is away from home, possibly surfing for the summer or working a job along the coast. She may be doing the same.\n\r\n1. Tonight I hope I will just fine - I think he is referring to his hope that he does not lose his composure (i.e. cry) because he knows he is leaving tomorrow. Think back to a time when you knew something awesome was going to be ending. That feeling.\n\r\n2. I tell her I love her, And we both laugh, 'Cause we know it isn't true - They do having feelings for each other, but they know it is not true love. True love is an action, not a feeling. They love spending time together, but know it is not meant to be (or can't be). Imagine a summer romance before heading off to a major commitment (joining military, school, etc ..). Something that you cannot delay or get out of.\n\r\n3. Anything but mine - He is describing how he feels. They fit together \"like peas and carrots\" (sorry Forrest). Think back to a young romance where feelings were so much of who you were (typical in young adults) and what you did. \n\r\n  On a side note, this is why sex before marriage is a mistake no matter how you look at it. People (especially young people) are not prepared for the emotions and feelings that come with such a personal act. It was designed to be shared between a man and woman who are committed to each other for life. A bond that is never broken. A marriage. True love is staying committed and putting that your spouse above and before yourself. Making their needs the priority and the focus. That is why love is an action and not a feeling.\n\r\n Mr. Chesney surely has a gift in his singing. Does anyone know if he wrote this song?\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThe words are  \"Oh, but Mary, there's a summer DRAWING TO AN END TONIGHT.\" Not \"Two in it tonight\". Lol, the lyrics on here don't make any sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI think this song is most likely about a summer romance, but it could also be about a guy and a girl who are breaking up but on the eve of his departure start falling for each other agian... or maybe realize that they really do belong together. \"in the midst of the music, i tell her i love her and we both laugh 'cause we know it isn't true\"- why would you laugh when someone tells you they love you unless they've said it so many times before that you don't believe them?\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI also noticed that these lyrics are wrong: \"there's a summer draw\r\nWith two in it tonight\" is actually \"there's a summer drawing to an end tonight.\"\n\n\n", "comment_43": "\nthis song reminds me of \"cool thing\" by rascal flatts.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nthis song is just absolutely beautiful. =]\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nWell, I have to say I am a bit heart broken.  The words \"Miracle Mile\" should be capitalized as it refers to a place.  I, however, thought Seaside should also be capitalized, but learning that the song is NOT centered around Panama City Beach in FL, I guess it doesn't need to be.  I always called this the Panama City song.  But apparently it was centered around Myrtle Beach.  In Panama City, the area along the beach was (is) called the Miracle Mile.  There was an amusement park there called the Miracle Strip that had carnival rides and an arcade.  Spring Breakers go there each year and tie up the traffic, get drunk and have their little romances. There is also a Pavillion just down the road at Seaside FL where they have bands play in the summer and its not far from PCB.  Seaside is also where the Truman Show was filmed.  Oh, well! So much for that!  But I love the song of a summer romance anyway! Double heartache!  I'm from Ohio, and Cleveland in this song is not about that Cleveland either!\r\n\"There's a warm wind comin' in, from off of the ocean.\" is correct and PrincessSara is also right on the wording of the summer drawing to an end.\r\nWriter is:  Scooter Carusoe\n\n\n", "comment_46": "\nThis song is about a gay homosexual hanging out with a girl friend after shopping at the beach. \t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\ni think he means they need to have sex before he leaves. maybe he's loosing his virginity cause he says... \"i hope, that i will do just fine\"\r\nso i think he's basically saying \"hey baby, im leavin, and im horny, so lets fuck before i go...\"\t\t\t\t\n\t\t\t\t\n\n"}