{"comment_0": "\ntor maa re kutta dia chudai shala bain chod kuttar bachha! tor maa ekta shooar ar tor baap ekta kutta! oi kutta oi shooar chudar karone tor jonmo hoise! ei karonei tui eishob dhon marka kutta chuda gaan gaas! jara tor gaan shune oi shob o kutta! tui mor shala! love it <3\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nSeriously? No comments? And no bio? I didn't even realize this was JB's song until someone told me today. GREAT song...just a good combination of lyrics, vocals, intrumentals, rhythm, beat (is that the same as rhythm? Oh well), etc. Luv Luv Luv this line: \"As you love me we could be starving, we could be homeless, we could be broke.\" Now if that ain't true love, than what is ;-) Just a REALLY good song from a surprising source.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI'm not a fan of Justin Bieber, but this song has a lot of meaning behind the lyrics and that's why I like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI assume (due to the music video) that a boy is in love with a girl, but her father will not let her see him. They make a plan to runaway together. When the girls father discovers that she is missing, he goes to find her. When he does find her, he beats up the boy and leaves him laying in the street, all bloody and beaten. He takes his daughter and the girl is screaming telling the boy to get up and go. \nI love this song and it is so catchy. I can rap Big Sean's whole part! It is my favorite song off the Believe album (next to Beauty and a Beat ft. Nicki Minaj).\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think what Justin means is that he's very unpredictable, but love is an interesting thing, it can hurt+help.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nfrom the music video, i think its about justin fell in love with this girl but her father doesnt trust him. so they run away together. her father notices that sheis missing and beats up Jb\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIt's about love being the most important thing above everything. Also that its worth fighting for and working it out.\n\nThe lyrics are so true ... life is short, and love is FOREVER! That one person is everything.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nMy fiance' and I are convinced that at the telephone he is carrying a sea bag and therefore the MV being military. He also quotes \"Ill be your soldier...\" even if it has a double meaning it still has military influences. :) Hooyah!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nIn this song, the singer sings about love being more important than money, a theme that is completely original and no one else in the history of the universe has touched upon. The fact that Justin is a celebrity wealthy beyond the imaginations of most people in the world makes this song completely genuine, as does his comparison of himself to a soldier despite no military service. The verse by Big Sean makes perfect sense and is integral to the song and in fact should be made into a separate single.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nJustin testifies how true love can overcome all circumstances on this Believe electro jam. He sings, \"As long as you love me. We could be starving. We could be broke,\" which is a predicament the Canadian star is unlikely to encounter over the next few years. However, having experienced a childhood being raised by a single mother in low-income housing, Justin has experienced financial hardship.\n\n\nThe song features a rapped verse from \"My Last\" rapper Big Sean, who is signed to Kanye West's G.O.O.D. label.\n\n\nThis shares a title with a 1997 international hit by the Backstreet Boys. The pop band took to Twitter to remind Beliebers that they were first. \"I don't care who you are, where you're from, what you did #AsLongAsYouLoveMe,\" they wrote.\n\n\nJustin persuaded producer Rodney Jerkins to add the dubstep-heavy sonics after a trip to London. The Canadian singer got hooked on dubstep during a trip to the UK, where the bass-driven type of electronic music is all over the radio.\n\n\nBig Sean revealed to MTV News that on the same day he was recruited to work with Justin, the rapper got a call from an artist whose cussing content is the polar opposite to the Canadian pop star's PG lyrics. \"It's crazy! I got a call from Gucci Mane the same day I got a call from Bieber and his people to do two different projects,\" he recalled. \"It's tight that I can be a person that's so diverse that I can do both of those and it's not reaching. I'm still me... and I didn't compromise anything for Bieber. You know, I just didn't curse, which is easy. I don't have to curse every day.\"\n\n\nThe song's music video was directed by Anthony Mandler, who has worked with everyone from Rihanna to Usher. Actor Michael Madsen, who has also had notable roles in movies like Reservoir Dogs, Kill Bill and Sin City, stars in the clip alongside Justin and Big Sean.\n\n\nMichael Madsen plays the disapproving father of Justin's love interest in the visual and ends up beating up the star after he ignores his request to stay away from his daughter. The actor told MTV News that Bieber was more concerned about having it look real than scared to take the hit. \"He was very respectful, very respectful and decent to me,\" said Madsen. \"I think he wanted it to be well-done. I don't think he was blowing it off. I think that I've been around enough to know I can tell if somebody isn't really doing their job or taking what they do seriously. And I could tell from early on in the morning that he was. He wanted it to be right.\"\t\t\t\t\n\t\t\t\t\n\n"}