{"comment_0": "\ni think she went to Austin..he just called her Austin..like i know somebody from Ohio and i call him Ohio..just my opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nDumb as a bag of hammers. Get over it and move on...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthis song means a lot to me and my fiancee. he left me and we didnt talk for like 2 or 3 months and i called his cell and his voice mail was him saying he was sorry and he loved me so when he called back i let my machine pick up and he left a message with this song on it and i cried. we're back together and getting married soon...i cant wait!!! i love you john!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI agree with dork alert, she went to Austin and he knew that, so he just said \"If this is Austin\" because she'd know what he meant if she called and also probably because no one else would know he was talking about her if they got his answering machine. Kind of like a privacy thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt's a lovely song and a very original idea. The only niggle I have with it is the last verse. How does she know it's him calling? It would have been a nasty twist if there'd been another verse on the end \"I'm flattered Mam but please you know I'm married with kids, Do you always come on to the gas men like this?\" hehe\n\r\nBut that's just me being cheeky. It's a great song by Blake :)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nYeah his girlfriend is from Austin and he just calls her Austin to avoid saying her real name.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nno comments?? i LOVE this song, its so goood.  i dont usually like lovey songs but this one is so good.  anyone heard his other songs? are they any good?\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThat is the sweetest thing I have ever heard, you are sooo lucky :)\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthis song is soo sweet you guys!!  it's about how both people still love each other but neither one knows the other feels the same way! aw i would give for a guy like that hehe!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis is such an awesome song... just like belle said its about 2 people who find out they are still in love after so much time apart. This song makes me teary when I hear it. \t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI love this song, but I have a question about it...was the girl's name Austin or was Austin where she went?  Because he says \"P.S if this is Austin...\" but it says in the beginning \"He figured she'd gone back to Austin\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nGreat tune. This is a powerful love song. I love the story behind it and it makes me cry sometimes when I hear it. \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ndaria, i think that her name and the place where she went are both Austin.  anyway, i don't usually like county-ish music but this one caught my attention.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song is just amazing, i heard it for the first time and thoguht wow what a great song. kinda reminds me of this girl i know from a very long time ago. :) \r\n-Alan.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ni love this song but it makes me feel bad cause i have noone now\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nGood song. It's even better live.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nMaybe the girl has caller display on her phone, so she can see the number of the person calling here, and would therefore know it's him?\n\r\nI have it, and it's great for avoiding people I don't want to talk to, lol.\n\r\nGreat song\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis song almost amde me cry, it's so so sweet. I loved it the second I heard it, its pretty obvious what its about.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI looove this song. I used to sing to it on the radio as a child. It's so cute.\r\nI think it's meaning's pretty obvious, just perfectly simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI looove this song. I used to sing to it on the radio as a child. It's so cute.\r\nI think it's meaning's pretty obvious, just perfectly simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI looove this song. I used to sing to it on the radio as a child. It's so cute.\r\nI think it's meaning's pretty obvious, just perfectly simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThis song is very clever. Two who think they are failing in a relationship keep the relationship alive through the telephone answering machine. It's always good for it to work out.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nHey honestyormystery, I like \"Don't Make Me\" and \"Home\" by Blake Shelton. They are really good. Just a suggestion though. Mostly \"Don't Make Me\" though. (:\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\n\"home\" is OK but I like Michael Buble's version a million times better.........it makes me mad when people think the girl's name is Austin....that would make the song cheap and why would he name her Austin and talk about her moving to Austin ...thats just stupid...give him some credit\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI like the Michael Buble version of \"Home\", but the Westlife version is really awesome!  If you get a chance, find their version and listen to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIs the girls name Austin? \r\nDoes she move to Austin? \r\nI mean what is going on here!?\r\nIt confuses me...\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nok for everyone who dont know or asked she whent to austin ok it dont make eny sence if her name was astin so ya dont mean to be rude i love this song it reamindas me of me and my bf btw if you get the chance you guys should here mileys new song he could be the one its awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\ni ws with a guy named austin and this song always reminds me of him but oh well his loss\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI really like this song but was not sure if it was her name of just were she was and what she was called.  It reminded me of Zombieland and how they called each other by the city they were from.  I really like how the comments from 2002 are in complete sentences and the grammar gets worse and worse year by year.  We live in a day of spell check and text but it really only makes us sound dumber than before.  Just saying.  I am guilty as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\n:)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\n\"What kind of man would hang on that long, what kind of love that must be!\" That line gives me chills because I could always feel his presence, just had no idea.\t\t\t\t\n\t\t\t\t\n\n"}