{"comment_0": "\npeople always make fun of justin bieber. y? shes no different then the other pop star girls. just leave her alone.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIt's a sad world we live in when this is considered music.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis so called artist represents the downfall of a art and the exploitaition of it music these days is nothing but a money maker and you are all buying into it if music is art then it should be for making what ever you want it to be not have it sound exactly like the last person who came before you this shit is so fucking generic i cant stand to watch music die like this you are fucking with what i hold most dear n soon i will have nothing left so fuck you record companys fuck you radio and fuck all you people that willingly buy into this shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI don't get it. How can this song exist, and then there are thousands of great songs throughout history that have been nearly, if not completely, forgotten? What about all the great artists in history that actually played instruments?\n\r\nWhat happened to songwriters like John Lennon? What happened to clever rhymes and clever lyrics and lyrics filled with fun innuendos? Are we really doomed to \"Baby (x9) Thought you'd always be mine\" as every song's chorus? What has the songwriting (and music world, in general) gone to?\n\r\nMy last questions: Do you really think people are going to remember Justin Bieber in 25 years time? Will he make Rolling Stone's 100 Best Artists list, like The Beatles and The Rolling Stones and The Beach Boys and all the other great groups before \"he\" came along? Because we've remembered The Beatles for almost 50 years... Just making that a little point......\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nSimple-This song has no meaning. It's just a teenager who hasn't yet hit puberty, sings like a laughing kookaboora (Spelling, sorry,), and has no talent whatsoever. This kid is fucking 15, hitting 16, maybe even 16 already. How the holy hearts does he know what love means? What a fucking loser.\n\r\nI'm also sick of all these fangirls bitching and saying \"This song was wrote for me!!!!!11111\". Dears, he doesn't even KNOW YOU. He's just another talentless lowlife/loser who plays his 'music' only for gaining money, not for putting time and effort into his so-called 'music'. This little poser doesn't give two shits about you, so fuck off and stop complaining. Sorry for my cussing, I just needed to get all this loserome out of my brain.\n\r\nDamn the music industry. DAMN IT ALL TO HELL!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nEveryone is being so shallow about this song! Don't you know Justin Bieber only keeps his \"hot teen that all the 12 year-old girls want to sleep with\" image so that he can hide the darker side of his lyrics, because he can not go without saying the things that hurt him deep inside, but he also does not want anyone to know about what he feels because they would never understand anyway?\n\r\nBut I understand Justin. I understand it all.\n\r\nThis song is about the internal struggle of a boy with the meaning and purpose of the \"self\", after coming to the conclusion that nothing but Nihilism explains all of the questions and concerns he has about life and the universe. \n\r\nThe song takes an especially strong view on the idea of \"ignorance is bliss\" and Justin's constant references to his childhood are about how he wish he could go back to a time when he did not understand or know anything, and did not have to suffer from the realisation that all life is without purpose. \n\r\nThe \"baby, baby\" is referring not to a girl, but actually to himself as a baby, and the \"ahhs and oooohs\" are pathetic attempts to replicate the sounds he used to make at that time, because out of his desperation he is willing to try anything to go back to when he did not understand anything. The \"thought you'd always be mine\" is of course about his innocence and how he thought he could stay ignorant and blissful forever.\n\r\nThe verses are about how he slowly lost his ignorance over the years, as he learned that the things society teaches us can make us happy (possessions, money, love) made him happy at first \"I'll buy you any ring\", but slowly he finds they are meaningless \"When I was 13, I had my first love, There was nobody that compared to my baby (once again referring to how there was nothing like the ignorant bliss he had as a child)\", and as he keeps living his life he finds that materials and emotions have no value, and Justin struggles to hold onto things but he can not stop a nihilistic view from taking hold of him, \"And I wanna play it cool/But I'm losin' you\".\n\r\nFinally the last verse is a bit ambiguous. The \"I'm gone\" could be referring to the \"self\", i.e. with Nihilsm completely taking over him he now has no conception of himself, and so he is now an empty shell without anyone inside (therefore he in essence is gone, even if his body is still there), OR it could also mean that in his struggle with Nihilism the only way out he could think of was suicide, so the \"I'm gone\" could refer to his falling into the pit of despair and killing himself, but I don't know for sure. You'd have to ask Justin in person to find out...\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIt is about the 'war on terror' and the reactionary nature of western democratic\r\ngovernments. The 'wake me' bit is about the people killed by the guns that are caught\r\nin the middle of the war they never wanted held in their country. After the 'first love\r\nstill around' bit it switches perspectives to the western government where they claim\r\nthe real reason to start all this is to get oil.\n\r\nHAHA. As if.\r\nIn 20 years who will know Justin Beiber?\r\nAbsolutely No-one.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nLoveeeeeeeee Itttttttttttttt\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nOBVIOUSLY about the Israeli-Palestinian conflict.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ncatchy song\n\n\n", "comment_10": "\nlyrics are all WRONG!!! \n\r\nNo escape from your fate\r\n Destined to be mine\r\n Every night I wait to see\r\n In the night, watching\r\n Stalking your every move\r\n I know when you're alone\r\n All alone\n\r\n Tied tight to the bed\r\n Legs spread open\r\n Bruised flesh, lacerations\r\n Skin stained with blood\r\n I'm the only one you love\r\n I feel her heart beating\r\n My knife deep inside\r\n Her crotch is bleeding\n\r\n She liked the way it felt inside her\r\n Fucking her, harder, harder\n\r\n She liked the way it felt inside her\r\n Fucking her, harder, harder\n\r\n Stick it in\r\n Rip the skin\r\n Carve and twist\r\n Torn flesh\r\n From behind\r\n I cut her crotch\r\n In her ass\r\n I stuck my cock\r\n Killing as I cum\n\r\n:D\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nIm not a Justin Bieber fan, but I will say that if anyone who claims to be a metalhead goes around bashing him or any pop star, they're a poser\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThose lyrics are wrong, dammit:\n\r\nI bind unto myself\r\ntoday the strong name of the trinity\n\r\nCrypt of despair\r\nthe old man is there\r\nforming a circle of magic and prayers\n\r\nGuarding the well\r\nthe black hole to hell\r\nits evil must never arise I can tell\r\nHoly mission\r\nforever he's sworn\r\nto protect our world from hatred and scorn\r\nHe will not fear\r\nthough the Sabbath is near\r\ntwelve strokes for Candlemass darkness descends\n\r\n[Chorus]\n\r\n\"Break the circle and all hell comes loose\r\nthe well of souls must stay sealed\r\nAncient force of light against the dark\r\nthe well of souls must stay sealed\"\r\nBlack wind turns out the candles\r\nthe air grows cold and threatening\r\nDark shadows wicked laughter\r\nbrings darkness to your heart\r\nBehold the goat of Mendes\r\nred burning evil eyes\r\nLord's prayer holy water\r\nonly faith can save you now\n\r\nDisharmony, satanic serenade\r\nBlack symphony, a tribute to the plague\r\nThe twisted souls awakened by the chanting\r\nUnchained at last, rise, they will now rise\n\r\nA new day's dawn, holy light\r\nSunlight redeems\r\nslays the dark, warms and heals, makes you\r\nsee nightmares' terror is back in your dreams\r\nSleep well my friend 'cause\r\nthis tale's now to end, don't\r\nbelieve our world is as safe's we pretend\n\r\n[Chorus]\n\r\n\"Break the circle and all hell comes loose\r\nthe well of souls must stay sealed\r\nAncient force of light against the dark\r\nthe well of souls must stay sealed\" \t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nbaby! baby baby ooohhhhhh lmfao\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthe b's cray. but love him anyway. such a great song. ill b his baby!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song is absolute bullshit. Justin Bieber sucks. He's like 15, he can't be singing songs about broken hearts and shit like that, he's just reached puberty. Ludacris sounds so incredibly stupid singing those stupid lines in this song, it is all so terribly laughably bad. The video clip is set in a bowling alley... I mean come on? Seriously?\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nso  this song would relate to the situation i was in. this girl broke up with her 1st love for me\r\nwe figured out we didnt wanna be together for reasons im not gonna explainn\r\nbut now they are back together & its going good. i think\r\nthis song makes me sad cuz this situation i was in :/\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nFUCK THE NIGGERS!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI hate Justin Bieber.\r\nHowever,\r\nI like the song. :D\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nHe's still a young boy, and doesn't know what to do with himself when he's in love.  In time he will come to realise that he's only at the beginning of understanding love.  And no-one can completely understand love because love removes the thinking part of the brain, and when you think about it you stop experiencing love.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nHAHAHA! MetalMartyr, Fuck yes! XDXDXD\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\n*Loserdome\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI REALLY don't like Justin Bieber. My friends sing this song as a joke all the time and when they do I can't stop laughing. Yeah the song is annoying and (omg brace yourself bieb fans) so is he. Hope I don't offend anyone. Stop giving me evils. The bieb (yes that's what I call him) just doesn't do it for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ni think every girl can relate to this song. It's about your first love breaking your heart. Tragic3\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis is the better version:\n\r\n(Ya da da da da da da da \r\nYa da da da da da da da \r\nDo da duv va de da da da \r\nDo da duv va de da da da \r\nKa-boom! Ka-boom!)\n\r\nYou cannot beat me \r\nYou're luck runs out\r\nI love this doctor \r\nGet on the point \r\nYou are so small \r\nDo not push bomb \r\nYou are not never never never touch my gun! \n\r\nRun home to momma \r\nWe must stop little cart \r\nWho send all these babies to fight? \r\nHow could this happen \r\nOh it is sad day \r\nDo I smell soiled diaper? \n\r\nentire team is \r\nbaby baby baby oh! \r\nIs baby baby baby no! \r\nIs baby baby baby oh! \r\nPick on someone your own tiny baby size! \n\r\nBaby baby baby oh \r\nIs baby baby baby no! \r\nIs baby baby baby oh! \r\nI am amused by entire itty bitty team \n\r\nUh-oh! I think someone soiled diaper \r\nYou! stupid! come stand on point!\r\nAh! No! Cart is not movin! \r\nFear me cowards! \r\nMore rubble less trouble \r\nEveryone, look at me! \r\nVery good! (da!)\r\nVery good! Very, VERY good! (Yes!)\r\nI am credit to team \n\r\nI am bullet proof! \n\r\nBaby baby baby oh! \r\nIs baby baby baby no!\r\nIs baby baby baby oh! \r\nWhat sick man sends babies to fight? \n\r\nBaby baby baby oh! \r\nIs baby baby baby no! \r\nIs baby baby baby oh! \r\nI am going to kill you and kill you and kill you \n\r\n(Boom!)'\r\nHey, get on the cap guys! \r\nThat ain't the right way guys! \r\nHow's the weather over there dumbass \r\nGet on the freaking point \r\n(Push!) \r\nWhat is your major malfunction? \r\nDiagnoses, you suck! \r\nI cannot believe this! \r\nPlay ball! Major league!\r\n(Woo!) \r\nI dare ya rage quit \r\nCome on make us both happy \r\n(Wicked!)\r\nThis is a real freaking embarrassment \r\n(Freakin' unbelievable!) \r\nWhat the hell is your guys' problem? \r\nWhat the hell was that crap \r\n(Boo!) \r\nYou just got freaking dominated knucklehead, alright let's do this\n\r\nBaby baby baby oh! \r\nIs baby baby baby no! \r\nIs baby baby baby oh! \r\nGo go go!\r\nPush!\r\nCome on! \n\r\nBaby baby baby oh! \r\nIs baby baby baby no! \r\nIs baby baby baby oh! \r\nWe lose, but they do not win?\r\nOhh \n\r\n(Da da dooh, da da dooh) \r\nWhich one of you is crying? \r\nToo many little men on this team \r\nKeep crying baby! (baby, baby!)\r\nCry some more!\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nso much hate for this kid and i really just don't get it. justin bieber is laughing all the way to the bank, retards\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI think this song means-\n\r\nI am a 16 year old kid with no real talent that has a voice higher than all men's and higher than most girls' too that only got into the industry through looks. (even thought he's lacking them)\n\r\nSad to think with such great, strong songs out there this is the one that's been noticed.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\n@ilubbillkaulitz\n\r\nI see, another fangirl who can't accept opinions.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nWill you people stop hating on Justin? If you don't like him, don't look up his stuff. Everyone is entitled to their own opinion, that doesn't mean you have to rub it in our faces. I like Justin Bieber. And just cause you don't like his music doesn't mean its not REAL music, Whatever that means.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nWhy do all of you idiots think this is a sad song? There are lot's of songs which make this song seem happy in comparison. It's just a regular break up song sung by a fifteen-year old pop star idiot. Break-ups can be deppressing but when your fifteen it's only to be expected. This song is terrible and i wish someone who is popular (like justin bieber) would write songs that make people more aware about the issuses of the world not just about popular culture.      \t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThe song is so blurish, but if I see the clip in muted, all I can really see is Bieber harassing a girl in a Bowling Alley. When she pushes him away, he keeps on trying. And it's totally ironic how after ludacris's verse, she finally falls in love with him. \n\r\nBut warning to you all: This Clip is FAKE!!! It shows you just like in the song, that if you keep on attempting a girl and she rejects you, you should keep trying cuz there is still hope, wich is not the fact in the real life!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ni really dont have anything against the guy, i just hate his songs being stuck in my head all day. namely this one oof :/ \"baby baby baby ohhhhh\" :S\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nthis reminds me of a moa. mrinalkantipal.blogspot.com/2011/01/…\n\n\n", "comment_33": "\nYou all seem to think this song is about teenage love, but I think you have to look deeper.  When I look at these lyrics, I see a profound, reflective, melancholy drug story.  From that lens, let's look at the chorus:  To me, the chorus is about JB talking to his dealer.  The line \"Baby, Baby, Baby ohhh\" is expressing excitement for his weed (because I can't see him using anything heavier than that).  The line \"Baby, Baby, Baby nooo\" is JB haggling over prices.  The repeated line of \"Baby, Baby, Baby ohhh\" is driving home the point that Justin has a dilemna: does he need his weed enough to deal with the awful prices.  The line \"thought you'd always be mine\" translates to \"I'd better find a dealer with better prices.\"  This line drives home the message of how sad it is for the two to part ways.  The song ends with a cliffhanger: did he get the weed before parting with the dealer?  Or does he need someone else for his next hit?  I tremble in anticipation for the sequel!\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nthis song is about him cat fighting in his head about the girl that threw the water bottle at him. \n\r\ni have a similar song about gouging out Justin beibers eyes and then stabbing him to death while laughing hysterically .\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nIt's a lame piece of shit-\n\r\nWait...\n\r\nWhy am I wasting my time on this inconsiderable trash when I could be listening to SOAD?\n\r\nSee ya\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nHey I was not being that serious. I do have a sense of humor! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI love this song :-********* no0o0o0o i can't copy this lyrics,why?!?!?!?\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThis seriously took 5 writers?\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThis took several writers. Bohemian rhapsody? Only one.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nFake cries during performances, during award show presentation. Unforgivable.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\noo woo woo? i mean what the heck even is this song?\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThis song is about a baby that Bieber is in love with.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nWhere's ludicrous' part? :(\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThis song is so sad. i remeber getting my heart brokein for the first time it sucked. and i always wanted to be more then just friends. in this song he is begging for his love to be with him not to leave him because he cant go on with out her its truly a beautiful song.!\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nshamefully, i admit that this is a catchy song.\r\nbut ludacris' part where he says\n\r\n\"oh i was starstruck\r\nshe woke up daily,\r\ndon't need no starbucks\"\n\r\nseems too similar to flo-rida's part in starstruck with lady gaga... hmmmm!\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThe Ludacris part is\n\r\n\" When I was 13, I had my first love\r\nThere was nobody compared to my baby\r\nAnd nobody came between us, no one could ever come above\r\nShe had me going crazy, oh I was star-struck, \r\nShe woke me up daily, don't need no Starbucks\r\nShe made my heart pound, I skip a beat when I see her in the street\r\nAnd at school on the playground but I really wanna see her on the weekend\r\nShe knows she got me dazing cuz she was so amazing\r\nAnd now my heart is breaking but I just keep on saying\"\n\n\r\nI Think :) \t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThe Ludacris part is\n\r\n\" When I was 13, I had my first love\r\nThere was nobody compared to my baby\r\nAnd nobody came between us, no one could ever come above\r\nShe had me going crazy, oh I was star-struck, \r\nShe woke me up daily, don't need no Starbucks\r\nShe made my heart pound, I skip a beat when I see her in the street\r\nAnd at school on the playground but I really wanna see her on the weekend\r\nShe knows she got me dazing cuz she was so amazing\r\nAnd now my heart is breaking but I just keep on saying\"\n\n\r\nI Think :) \t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nthis reminds me so much how i feel. my (ex) boyfriend just broke up with me for a stupid reason. i thought he was my first love but now all i have left is a broken heart :(\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nOk, I have to admit, I absolutley hated Jstin Bieber when h was first discovered. One Time still totally sucks, but this song is pretty good. I think it's about him having a best friend that he loves when he's thirteen, and then she says she going out with someone else, and it totally breaks his heart. I think he has a right to write songs about heart break, I mean, what kind of teenager hasn't ever had a crush on someone and found out they like someone else? It seriously does break your heart, despite what anyone else thinks. I am not a Justin Bieber fan, and this is his only song I've heard that is exceptable. Hat One Time and One Less Lonely Girl!! I'm kind of hoping he'll come out with something along the lines of Kate Voegele's Only Fooling Myself (only Pop-ier) about liking someone but knowing they'll never like you back. That's the jest of then teenage years. He'll be able to write it better than anyone else. \t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nO.M.G. Sorry Justin Bieber fans, but I absolutely DESPISE Justin Bieber. His name makes me shudder. I one time thought he was a girl when I was listening to eenie meenie. He sounds like a girl and his head is big! All of his songs are about girls, i mean what is the deal with that what are girls his life?!? Is he desperate for a girlfriend?! only God knows!\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nledzepfloyd1101, I love you. I'm so relieved that somebody has common sense here.\n\r\nThis whole infatuation is simply preposterous, it's absolutely just bizarre. He's not talented, and he doesn't make good music (not that he makes it). We're favouring this over the classics? Aside from the classics, there's so many brilliant and worthy bands out there being overlooked and ignored because they're not cute like a twelve-year-old.\n\r\nIt's almost like Twilight whenever anyone with half a wit about them chips in to give their comment they get attacked by ravenous, deranged, mislead tweens. Just absurd. Much the same demographic here, I would imagine.\n\r\nIf this is the bleak future of music, I want no part of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nawesome song. to all the haters just GET A LIFE. if you don't like justin bieber , just listen to other song that you might like.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nwoow!! so cool \r\nwit ur age 13teen can fallin in love..\r\nim strted when im was 17teen..\r\nbt im feel not freedom when couple!!\r\nmy byfren so suck..everydy doesnt give me fren wit any guy..jus want friendly..\r\nbt he jelously..so now we clash..huh..so hepy..\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nHello I am Master Chief lolololololololololol!!!!1!!one!!!eleven!!! (Arby n The Chief references soon to follow) This song r soooooooo gay. Justin Bieber r a faggot. He wore lip gloss and eye shado in 1 less lonely girl. He has no talent. The only reason fangirls follow him is because they think they have a shot at him, and then they say were haters because we don't like his music. They say we either are jelous (major sp) of him because of his looks or money. Justin has an emo haircut and he has to deal with all the stupid fangirl mail, so his life isn't much better than mine. Think thru arguements, ppl. My ROFLCopter goes soi soi soi soi soi soi soi soi soi.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nthis is not one of the best songs but its still good\r\noh and jay cooper totally loves he lives in teesside find him in the yellow pages or the biggest diitch\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nGuys....as weird as this sounds....please. stop messin with justin beiber. i know its fun, i do it myself. but if you look at this page, theres just as many if not more people here makin fun of him(dont get me wrong, HATE this little fag) but were just fueling the flame for this little queer, giving him more comments. every SINGLE metal video i try to watch on youtube, is overrun with people makin beiber jokes. as much as i hate, him and everything that he and this genre stand for, i think that if we stop messin with him, thats half of his popularity rite there. we need to do whatever it tkaes to end this little homo, even if it means not makin fun of him anymore.  =( \n\r\ndo what must be done.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\njustin bieber has no talent. this song is crap. people should start listening to real music and stop making people like this little kid popular\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nuntil when you guys listening to this crap?\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\njustin bieber should go kiss jesse mccartney's ass and apologize for being such a jm-wannabe. he sounds like such a GIRL, i swear....at least jesse can sing without making anyone's ears bleed\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nalso...how can a guy who thinks \"girls are trouble at this age\" write a stupid effing love song? it makes no sense in the first place, and i didn't even have to read the lyrics to find that out\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nThis song is about seducing millions of stupid teenage girls into buying horrible music: courtesy some writer, a kid with no balls, a washed up rapper and lots of studio technicians.   \t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\ni don't like this song and second thought on what it ments is wrong. their is no \"she\" its only a \"he\"\r\nall in all hes gay\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nLord Bieber... I salute you... You were not at the last Nazi convention... Yes... Justin Bieber is the next Fuhrer of the Third Reich...\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\n@MegadethMaiden23- Obvious Troll is Obvious\n\n\n", "comment_65": "\ni hate that people that j.b. not seriously ,i think his songs can be a little cheezy but at the same time\r\nvery cute and romantic if you actually listen\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nThe Ludacris part is\n\r\n\" When I was 13, I had my first love\r\nThere was nobody compared to my baby\r\nAnd nobody came between us, no one could ever come above\r\nShe had me going crazy, oh I was star-struck, \r\nShe woke me up daily, don't need no Starbucks\r\nShe made my heart pound, I skip a beat when I see her in the street\r\nAnd at school on the playground but I really wanna see her on the weekend\r\nShe knows she got me dazing cuz she was so amazing\r\nAnd now my heart is breaking but I just keep on saying\"\n\n\r\nI Think :) \t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nHe wrote this for me ;-)\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nit's awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nLove this song, in spite of myself. It's about being dumped for another guy by his first love, and how much it hurts him. Baby, baby, baby, no! Catchy little bastard.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nThe song is obviously about having your heart broken by your first love. How that person will always be a special part of your life. && ludacris' part is great. \n\r\nGood song :)\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI don't like Justin Bieber, but this is a catchy song!  It's about how he feels after a breakup....\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nim done crying now(: and can finally enjoy the song((:\t\t\t\t\n\t\t\t\t\n\n"}