{"comment_0": "\nOne of the most powerful songs I've ever heard. The song actually begins at \"time, standing all alone\" and everything before that is just part of the story written by Jon Oliva of TSO. The full story can be read on their website. It's beautiful, extremely touching and magical, and this is coming from an atheist.\n\nMeaning:\n\nThis particular song deals with the father's feelings of guilt and hopelessness after taking the time to think about how he abandoned his child, and how much time he has wasted on a meaningless life with no love or friends. With these thoughts, he decides to go to his son, telling himself his son is the only reason he has left to live.\n\n\"Time - Still they fall on and on and on\"\nThese lines refer to his past relationship and dead wife. They were a happy couple with everything, but lost it all so suddenly. The bleeding refers to the wound in the man's soul, which bleeds eternally ever since the wound his wife's death had on him. The \"falling in vain\" may also refer to his drops of blood, continually falling, or it may refer to the ghost of his wife's tears, mentioned in the beginning of the story, which eventually froze into snowflakes.\n\n\"Got to get back to a reason - Fade from view\"\nHe's trying to remember the way he felt about life when he lived for his wife, and regain that meaning in his life. \"This late in the seasons\" refers to how during Christmas, what's important seems to become clearer to us, and the things that lead us astray from such things are not present at this time.\n\n\"Drifting through the dark - On and on\"\nLiterally refers to his late excursion on this Christmas night. The \"Is you life the same?\" verses may be him referring to his dead wife, again asking if she cries tears, and feels the years of time passing (Which, in the story, she does).\n\n\"I'm looking for you - End\"\nThis is him finally facing his past, present, and future. Realizing he has wasted so much of his life, and doesn't have much time left to make anything of it. It examines his fear of \"waking up,\" meaning, facing his miserable life for what it really is, and ceasing to live in the cold cage he has built around himself. With the remainder of his time, in these moments he is finding the strength to make right what he still can, and face his problems on this night of Christmas. He finally decides that he will do whatever he still can to get to his son.\n\nOn a deeper note:\nAlthough this song has a very specific meaning as part of a story, I believe it can loosely be applied to nearly anyone who feels as though they are living only to live, perhaps suffering or in pain, and feeling the weight of time and the past. The fear of seeing life for what it really is is indeed dreadfully scary, and living in a dream is what many seem to do to avoid it. Of course, it can just as well be a song of hope, to those who have finally found something or someone in their life to live for.\t\t\t\t\n\t\t\t\t\n\n"}