{"comment_0": "\nAnyone who has truly experienced rage knows that there is hardly anything more potent and pure than that rush, and they are reminded of that when they hear this song. The song structure itself is a microcosm of the event, with the clean guitar piece in the beginning, escalating to that frenzied riff. Hmmmph, think I'll go out and smash something now...........\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\neveryone is missing the simple meaning of this song. battery is about metallica being the best. battery is literally what drives them. hetfield is saying metallica is here to stay. metallica is in him crushing all that cower\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIt's gotta be about a mosh pit, or just the general crowd at a concert. There is tremendous energy like a battery and \"pounding out aggression, turns into obsession\" sums up a metal concert for me. It's also like a big family, and is in all of us.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nMetalickah : I was wanking and listening to this song, the solo came on and as kirk got higher up the fret board, so did the climax, when the solo hit climax, so did my wang. no shit, this happened, i then sms'd my pals telling them i got off on kirks playing =P\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song reminds me what i have to do every time i step onto a field.\r\nI'm not the best player, but when i play like this i go psycho and hit anyone and everyone\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nGod damn this song kicks ass!!!!! song is so fucking powerful, thought i'd snap my neck bangin my head so fast to this song. metallica is a group of gods!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI've always interpreted this song as being the thoughts of someone who's beating up their spouse/boyfried/girlfriend (and pretty fuckin bad at that). \"Pounding out aggression, turns into obsession\", it just fits in my mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nJust keep it simple, it's about energy you get from listening to this kind of music, as from the first seconds of the riffing you suddenly feel indestructible and hyper. When I'm tired or out of energy, this always gets me pumped up. Favourite Metallica song..\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nTwo kinds of battery. The first is the act of beating someone up, assault etc.\n\r\nThe other Battery means both a positive and a negative side to everything. I also hear this song is about the \"Old Waldorf Club\" or something.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThe Waldorf Club on Battery St. is where Metallica always used to go I think it's also where they would soon tell Jason that he made the band.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nAs Jules4099 says, is correct. The battery is the energy that give you the adreneline rush you get when you are raging.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ninteresting info about the waldorf club :)...i always thought that this song was just about beating people up ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ni think this about rage. When you're in rage, you forget about everything, only beat, destroy etc. Everything exept the chorus is about this (\"smashing non-believers\"-beat everybody who  isn't your oppinion)\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThe song is about a battery in the sense of beating each other up. \n\r\nJames once said: \"There's a good and a bad side of a battery. We were very good at the negative.\" \n\n\n", "comment_14": "\nThis is a great song of power and energy and i love the intro with the 3 guitars, the way they make those little riffs blend together into one awesome intro astounds me.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nAm I the only one who has this song as my favorig Metallica song? I really like the riffs and all in this song - They sure are worth a listen :P\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nBattery helped define the Master of Puppets album, and is still a Tallica fan fav. I love the raging guitar riffs and the solo on this. Whoever thought beating people up could be so much fun? \t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI loved the S&M version of this song, the melodic, almost hispanic, introduction and then into the powerful super-fast guitar rhythms.\r\nJames Hetfield will kill me if he reads this, but Battery reminds me of Slayer. lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nAww man, this song makes me wanna randomly punch the fuck outta ppl and teabag nuns in the face. Nothin but pure, unedited, ferocious animosity channeled through a song. Its awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nFuckin hell, I'll be the first to admit that it's an overwhelming source of energy when one is in a rage, as i have been there, but it ain't all fun and games. I spent 1 1/2 years in a Malaysian Prison for that shit... and i got off lightly!!!!! Spend all your time lookin over ya shoulder makin sure no one's gonna turn ya into a bitch. There are DIRE consequences to these actions. Hence the NEGATIVE terminal of a battery.... some people need to grow up\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI fucking hear ya GodOfWar.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nthe truth is, metallica rarely uses metaphors in their pre-black albums days (the first 4 cds being the only ones worth listening to). when people were analyzing \"One\", saying that it was about his mother's struggle with cancer, James replied, \"Fuck, I just wanted to write a song about a guy that stepped on a land mine.\" most of their stuff is pretty straight forward, which leads me to believe that this song is about androids, cyborgs, robots, whatever you want to call them, sort of Terminator-esq. type thing. but what do i know im just a stupid punk rock kid.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThis song IS the Can of Whoop Ass that didnt need to be opened because it just exploded into the Universe and fucked it All up, again, one of the Greatest songs ever written. ASS OUT AGGRO!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nAh this song is one of the coolest live songs I've ever had the fortune of experiencing, and its only 6 days until I experience it again. Fuck yeah!\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song is the perfect song to listen to when you want to beat the living shit out of someone.  Fucking awesome, and also one of the best first tracks on an album.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIt fucking kicks ass!!!!!! hey rubberband, that's a pretty interesting idea. haha androids and cyborgs hahah. i never thought about it that way. i thought it meant battery as in the military term, like an assault. or sumpthin like that. ye and also i wanna say that this song fuckin kicks ass!!!!!!!!  Metallicaaaaaaaaaaaaaaaaa\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis song is the shhhhhhhhhhhhiiiiiiiitttttt!!!!\r\nu can kick someones ass by just blasting this song in their ears!\r\nI CANT BELIVE IT!!! IM GONNA SEE THEM IN CONCERT!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nmost amazing intro ever, its too bad they couldnt have followed it up with more meaningful lyrics. awsome song nonetheless\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nFor some reason i thought religous fananiscm and physicaly imposing your beliefs onto the weaker until it becomes an obsession...but thats kinda hard to justify.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthis song makes me moist in my pants.enough said.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nmetallica is the best!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\na battery is a old world war II weapon, quite like a german howitzer. it was pushed across the battlefield and through towns destroying everything in its path, it is a metaphor what someone can be like; being really fucking angry and going on a rampage, punching/shooting/kicking etc. anything and everyone. now thats what i call battery\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI'm with wildy, James writes alot about war and the injuctice of it and when it was tabbed in Total Guitar they confirmed this thats what the lines like \"Smashing through the boundaries\" are about, i'm not sure putting batteries in something is the basis of good lyrics!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nActually, an Artillery battery is the name for a unit (company) of several cannons, about 150 men in strength, The term is still used today like \"A battery of M109A6 Paladin self-proppelled howitzers pounded Baghdad City for 5 consecutive days\" or something like that.\n\r\nThe \"Battery\" James is referring to is the kind where you beat the shit out of someone and it being a crime. If you beat the crap out of some poor old guy and stole his money and got cought, you would be charged with \"Battery and armed robbery\" This song is basically referring to beating the everliving shit out of someone and the emotions that come with that.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI think this is just one of those songs to get the crowd going, they usually play it first at gigs, the whole album MOP is kinda themed on control or overwhelming power, and i think this song is about the power of the crowd at a gig like in the mosh pit, look at the lyrics closely its basically about a mosh pit.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThey saved this song for last at S&M\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThe whole album is about power being in war military and about abuse suffering and drugs in one song. I love it great album to listen to all the way through.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\ni think this song is about a powerful government ie soviet russia or the U.S. taking out the countries who didn't follow them \"mashing non-believers\" could mean that, and all of the war songs they had on \"Master Of Puppets\" means that it was about the military most likely\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThis song is about the Energizer bunny!!!!!!!\n\n\r\ncannot kill the batery!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nTHIS SONG KICKS ASS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI think that you are all WRONG!!!!!!  This is not a song about kicking everyones ass...entirely.  Its simple if you read the actual lyrics. Lashing out the action-the action being the metal music they are playing.  Returning the reaction- when people react negatively they play even more agressively leading to \"weak are ripped and torn away\" meaning that the ones that cannot handle the intensity of the music are sorted out.  Hypnotizing power, crushing all that cover - hypnotizing power of the music that is wailing, crushing all the critics that are doubting them.  BATTERY IS HERE TO STAY!  simple enough in that line.  \"Smashing through the boundries\"  boundries set by society as to what they think music should be.  \"Lunacy has found me\"  Lunacy is part of the inspiration for the hard hitting shit that comes out of them.  \"Pounding out agression\"  The drum beats, solos in the songs \"turns into obsession\"  simple one there.  \"Cannot Kill the Family\"  The family being the metal family that they helped create, cannot be backed down or \"killed\" by the man because \"Battery is found in me\"  which implies that the force behind metal is found in everyone that feels it.  \"Crushing all decievers\"  at the time there were alot of Hair metal bands that were frilly and only in it for the tits and ass.  This brand of real metal that Metallica was presenting was hard hitting real shit that had meaning and real power \"Mashing non-believers\"  Ties into the same thing I just said.  \"Never ending potency\"  Meaning they knew even back then the metal will continue to reach people forever.  \"Hungry violence seeker, feeding off the weaker\"  The violence the weak are what feed the emotions that go into making the music which will continue to be \"Breeding off insanity\"  \r\n  \"Smashing through the boundries\"  They did too,  they never gave up on thier pure ideals about the music and they went through every barrier put up before them.\r\n   \"Circle of destruction, Hammer comes crushing.  Powerhouse of energy\"  The cirle represents the feeling of empowerment that the crushing hammer of the music with all its energy that many people feel from it.  \"Whipping up a fury, Dominating flurry \r\nWe create the Battery\"  The fury is all the screaming headbanging feel it in your soul dominance that is the battery that we ourselves created.\r\n   In conclusion I know it sounds really repetitive what I've been saying but in those days they were very straight forward with thier lyrics..don't read more into it than what it is.  Back then just the pure love of performing and the reactions from the fans was enough to write about.  Fuck you if you think I'm wrong.  CANNOT KILL THE BATTERY!!\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nIm not sure what this song is excatly about.  It almost sounds like he is talking about mosh pitting.  But I think that it is more universal than that.  He might be talking about how violence always ends up being everyones answer for everything.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\ni like un 4 gvn 1's interpretation. that is a very in depth analysis. wow. but it does make me want to beat the living fuck out of someone.\r\nMetallicA is God\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nIs it possible that they were talking about the frenzy of a live show?  The violence of a moshpit perhaps.  The unbelievers would be those who don't like their music or the roughness of the moshpit?  Just throwing in my two cents.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nFirst off, I wanna say that this song is bad-ass.\n\r\nNow as for the meaning....I think that throughout the song, all the possible meanings of the word 'Battery' is implemented in some way   i.e.....\n\r\n\"Lashing out the action, returning the reaction \r\nWeak are ripped and torn away \r\nHypnotizing power, crushing all that cower \r\nBattery is here to stay\"\r\n~This refers to I think the 'assault and battery' definition...\n\r\n\"Smashing through the boundaries \r\nlunacy has found me \r\ncannot stop the Battery\"\r\n~I am sorta certain that this refers to the usage of Sieging batteries used in warfare(smashing through a fortification perhaps). Furthurmore it is noted that people wo have experianced warfare do come out of it with a certain degree of lunacy due to a traumatic experiance.\n\r\n\"Circle of Destruction, Hammer comes crushing \r\nPowerhouse of energy \r\nWhipping up a fury, Dominating flurry \r\nWe create the Battery\"\r\n~A Battery is a form of sustained electrical potential, a powerhouse of energy, this verse can also be interpreted as teh siege batteries used in warfare....wihpping up a fury, dominting flurry...\n\r\nabout the guitar intro....the intro to be sounds European...perhaps spanish or Italian.....umm I may be way off...but perhaps the inspiration for the sound may be because of the fact that the battery was pioneered in Italy by Luigi Galvani and Alessandro Volta.....just a thought..\n\r\noh, and I agree also with un 4 gvn 1's  deeper interpretation..\n\r\nagain.....bad-ass song.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nim obbsessed with the intor...i think its amazing...does any1 no how to get tabs for it on the guitar\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nun 4 gvn 1, spot on. meanings of battery as an act and battery in terms of violent energy still has some weight tho. great meaning for a first song on the album. similar to other first songs on their albums in that respect.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThis song is about fighting, destruction something like that.. I mean come on you don't get some Battery St. shit from this.. Just look at the first verse\r\nLashing out the action, returning the reaction\r\nWeak are ripped and torn away\r\nHypnotizing power, crushing all that cower\r\nBattery is here to stay.\r\nTell me that lashing out the action doesnt mean starting a fight.. weak ripped and torn away? weaker usually looses in a fight.. hypnotizing power crushing all that cower means that he is intimidating... just think about that\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nits about the old waldorf club on battery street, san francisco, the fact that there is some sought of veterans place on battery street, and basically just banging heads. \n\r\nthats from an interview i read about this song.\n\r\ntheres nothing deep about this song..\r\ncircle of destruction.. ever been in a metallica moshpit? obviously not if your trying to find some deep meaning in this, ITS PART OF A FUCKING MOSHPIT - THE CIRCLE OF DEATH AKA DESTRUCTION!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nHOLY SHIT!  That's about all.  It's about massive amounts of energy and agression.  I would know, seeing how my band played this live at my first gig.  Imagine how scared I was to be playing bass.  Finger bass, too.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nIts a play on words.\n\r\nBattery - An act of violence, or assault.\r\nBattery - A source of energy. In this case, the battery is anger. Anger fuels and drives someone to commit battery. Simply put, you get so pissed that your rage causes you and you beat the shit out of someone.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nTo elaborate more... \n\r\n\"Smashing through the boundaries\r\nlunacy has found me\r\ncannot stop the Battery\"\n\r\nThis could either mean that you can't stop the rage, or you can't stop the actual act of battery. However...\n\r\n\" Pounding out aggression\r\nturns into obsession\r\ncannot kill the Battery\"\n\r\nTHIS references the anger fueling the act, or the battery that drives the violence. Thats about as deep as you can get for this song, considering its about kicking the shit out of people.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nHas anyone seen how fast Lars hits the drums on the S&M version of this song? Fucking hell!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nSorry guys There is nothing to talk about here... Hint: dont listen to Metallica for its lyrics...\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nsong is about the nature of evolution and the fact that you cannot stop or change it.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI think it means a supply of anger and energy, IMO the best Metallica song. Definately hardcore!\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nOK THEN!! you think anyone needs to know that? anyways, now that's out...\r\nthis song , and ' fight fire with fire' are the 2 heaviest opening songs on a metallica album so far, hit the lights, fuel and frantic follow. the other 4 are softer by comparison.\r\nBattery was also the perfect closer to the S & M concert. that rendition is an awesome adrenalin rush\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nIf I recall, this song is a tribute to their old stompin' grounds, Battery St, as said by Mr Kirk Hammett.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThe battery is what follows adrenaline ;P and of course, this song appears to adrenalinistic (not a word). Fast words, poetic scheme.. build up to a rush of a song which is a great starter for the Master Of Puppets album.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis song is about the uncontrollable rage and energy you get from an act of Battery i.e. beating the shit out of someone. Think about the violent lyrics:\r\nPounding out aggression\r\nturns into obsession\r\ncannot kill the Battery\r\n---------------------------\r\nCrushing all deceivers, mashing non-believers\r\nnever ending potency\r\nHungry violence seeker, feeding off the weaker\r\nBreeding on insanity\n\r\nJust think about it. Most of this song is about the act of Battery.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nBATTERY! \r\nBAT-ER-RY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\r\nSIC TUNE\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nBATTTTTTTTTTERAAAAAAAAAAAAAAAA!!!!! S&M VERSOIN FUCKIN ROCKS!!!!!!!!!!\n\n\r\nHELL YEA METALLICA!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nThis song is AWESOME, it's the reason for my name on here. According to Guitar World, it's about the Waldorf club on SF's Battery St, where they used to play. \"Cannot kill the battery\" (incidentally, the line I got my name from) could mean that they'll never forget how they got started, and \"cannot kill the family, battery is found in me\" could mean that the band (family) has an unbreakable bond because of the Waldorf club.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nbattery.... pure fucking energy, rage, adrenaline, and that rush you get from all of it... excellent song\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nIt's about having a battery inside of you giving you insanity and power.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nAWESOME SONG!!!  It seems to be about being in a fight, and the pounding, reckless, insane, and almost demonic rage that courses through your body, making you desrie to do nothing but beat the shit out of your enemy until he's dead or damn near it.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nThis song is about uncontrollable rage, the desire to hurt someone.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nThe positive and negative side thing is interesting. I was trying to figure out how the word 'battery' related properly to the song until I figured out that it's 'battery' as in 'to batter someone's head in'.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI thought by battery, they meant assault.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nBattery could be refered to a blood line of murderers.\r\nCannot kill the family\r\nBattery is found in me\r\nand how the weaker members of the gang are kicked out because they can not keep up with the rest of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nBasically, the song is about so enraged that you absolutely need to unleash it, but then when you do, you only become more enraged and it becomes impossible to stop.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nDefinetly one of thier best. A kick ass song with a fantastic intro. A great opening track for an unforgetable album!\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nAs jules4099 rightly said, the song is about rage, and beating the crap out of everyone and everything.\n\r\nI'm even using this track for my college animatics.\n\r\nThe whole story is based on 4 guys, with an infinite rage power, and they're called The Battery.\n\r\nThe whole story is based on the track.\n\r\nMetallica fucking rule!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nThis song kicks serious ass!\n\r\nI'm using this track for ma college animatics!\n\r\nMetallica is ma favorite band!\n\r\nKICK ASS!\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nSum1 put the studio version of this song on MP3 Realm!\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI always thought of this song as just being a metalhead and the energy you get from listing to metal, or better yet, jamming to it. Metallica is good at taking a simple idea and making it sound really epic.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\ni like this song... its so mean and crazy. metallica you drunk bastards you did it again!\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nWhen your mad sometimes you cannot control yourself. Adrenaline pumping rush that you get when you beat someone down. Great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nGod, this song is awesome!\r\nThis song is great to listen to if your mad, this song really puts you in a rockin' mood.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\ngotta love the acoustic intro.. and then BAM the metal kicks in\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nreally aggresive song though, probably their hardest\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\ncall me weird, but i've always believed that this song is describing what it feels like to be in a die-hard thrash band (showing my age) playing a kick-ass gig. the death of hair bands and the dawn of a fresher era of metal. read the words again.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nI have always thought of the \"Battery\" as an amazing force which has so much power it could never be stopped, and it destroys everything without mercy.\n\r\n\"Lashing out the action, returning the reaction\r\nWeak are ripped and torn away\r\nHypnotizing power, crushing all that cower\"\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nThis is a awesome song to head bang too! Makes me want to kick the shit out of people that pissed me off.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nSome great interpretations here!  I liked the thoughts of un_4_given_1.  Given the time frame in which this song was written, un's comments would certainly apply to the culture Metallica was at odds with and the support they created in their own (counter)culture.  I think the location of one of their earlier venues(Battery St., San Fran) may play a part in the title and tie in to un's description.\n\r\nI think this song is a artistic masterpiece.  To have so many meanings to different people and still bring everyone together is part of what defines great art.  Like any artistic creation, the artist is inspired by certain things in it's creation.  The rest is up to us.\n\r\nKick ass song, great start to a great album.\r\nLong Live Metallica!\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nholy fucking shit! This song kicks ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI have this weird idea.\n\r\nOk, so this scientist creates a drug/chemical called \"Battery.\"  A man is offered to test it, and he is at first feeling great with all the power he gets, but then realizes it's a problem, but before he can stop injecting it he loses control over it.  Driven insane, he tries to kill the man and family who created this, but he virtually can not.  Finally, just as he is about to be free, he commits suicide, not wanting to live after becoming that monster.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nobviously, this song is about someone beating the living shit out of someone else! this song is kickass! my fav!\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nThis song is one of my favourites, it has that rhythm that makes you want to hear it again and again.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nmetallica= pwnege at all things kirk hammet= idol :)\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nIt's about physical abuse.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\ncreating a country, you get the rush of power, controlling all those people,their lives in your hands,creating an unstoppable force\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\ncreating a country, you get the rush of power, controlling all those people,their lives in your hands,creating an unstoppable force\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nThink Battery instead of battery... Like... F**king hitting somone?! It's simple really\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nThis of course is the first track of the album and notice how this song sets off the tone for the album \"master of puppets\" . The whole meaning of the album is about something or someone else having control over you.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nAnyone else here STILL TRYING to COMPREHEND Chris WATTS  RIP Beautiful Angels.... SHANANN, BELLA and Celeste\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nA battery if its full it gives power or a powerful light.\nThe opposite of a battery is perhaps â\u0080\u009eemptyâ\u0080\u009c\n\nThe song is about the power being inside the young men of metallica.\n\nSearching easier faster you will find the answer!\nWith Love stefan\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nThis song is about celibrating child abuse.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nIts about beating your kids. I love it !!!\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nOkay everyone, go ahead and crucify me because I FUCKING HATE METALLICA!!! they are way to overrated. How could they be the best thrash band? I dont even consider them metal. They're to mellow to be metal and they sold out.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\ntry replacing all \"Battery\" with relligion, it makes sence when you hear it\n\n\r\nLashing out the action, returning the reaction\r\nWeak are ripped and torn away\r\nHypnotizing power, crushing all that cower\r\nReligion is here to stay\n\r\nchorus :\r\nSmashing through the boundaries\r\nlunacy has found me\r\ncannot stop the Religion\r\nPounding out aggression\r\nturns into obsession\r\ncannot kill the Religion\r\nCannot kill the family\r\nReligion is found in me\r\nReligion\n\r\nCrushing all deceivers, mashing non-believers\r\nnever ending potency\r\nHungry violence seeker, feeding off the weaker\r\nBreeding on insanity\n\r\nchorus :\r\nSmashing through the boundaries\r\nlunacy has found me\r\ncannot stop the Religion\r\nPounding out aggression\r\nturns into obsession\r\ncannot kill the Religion\r\nCannot kill the family\r\nReligion is found in me\r\nReligion\n\r\nCircle of Destruction,\r\nHammer comes crushing\r\nPowerhouse of energy\r\nWhipping up a fury, Dominating flurry\r\nWe create the Religion\n\r\nchorus :\r\nSmashing through the boundaries\r\nlunacy has found me\r\ncannot stop the Religion\r\nPounding out aggression\r\nturns into obsession\r\ncannot kill the Religion\r\nCannot kill the family\r\nReligion is found in me\r\nReligion\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\n\"Batterie\" is french for drums. Idk if Ulrich had a hand in these lyrics, but perhaps the song is about letting out your anger with drumming. The lyrics seem to fit.\t\t\t\t\n\t\t\t\t\n\n"}