{"comment_0": "\nthis is a song that means a lot to eminem and people who listen to it. serious and personal, sad and inspirational. i was on the verge of tears the first time i heard this\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nthis song is so fuckin real and beautiful...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis is probably my fav. song off the album\n\r\n\"The melancholy song samples Rock Therapy's \"Reaching Out\" and features Em revisiting his decisions over the past few years and how his life spiraled out of control.\"\nyoutube.com/…\n\n\n", "comment_3": "\nI'm a big fan and he's done some pretty amazing songs, and this one is definitely way up there. Maybe even his best. This song just has so much emotion in it. I love it. The first few times listening to it I was on the verge of tears. amazingly done<3\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nEminem said this was a track he wrote in Rehab, right before he got sober. He wrote the first half in rehab and finished it when he got out. For me this song has very special meaning because it describes the times I am going through with my struggles in my addiction recovery. So below I have written my interpretation as if he were writing this about entering recovery, and using the mic and rap as references to drugs, here is how I saw it before I knew what was behind it:\n\r\n1) In the first few lines when he speaks of being depressed and needing to get out of a slump, I took that as his feeling before he hit rock bottom, that he needed to find another way besides drugs to get him feeling better again, written right before he got clean.\n\r\n2) In the second lines he is saying he took his hits (im not referencing hits of drugs and neither was he) and got back up, but even though he was getting through things he wasn't getting through them sober, so where he references he needed a spark, maybe he is saying he needs a spark to get him to pick his life back up again, and get clean.\n\r\n3) When he says he doesnt know how he ended up in the situation he is in, that he was feeling distant again, I could see that being he is feeling distant from himself, not knowing the real him because he had been hiding behind substance for so long. So he picked up the pen, started to do step work from the 12 steps.\n\r\n4) He up and tried to vent, speaking up in meetings and talking about his addiction, and seeing that he needs to come to grips with his addiction and accept he is done with drugs, and find a new way of life and living. \n\r\n5) By saying he is a tough act to follow he is saying he had a horrible and trifling addiction, that many havent been through, and walking in his shoes is saying it is hard to feel that you fit in with those around you in recovery, and by switching places he could feel what they feel clean, because he wants what they have.\n\r\nAs addicts we have a very low self confidence and low self respect, so he is saying that dont let anyone put you down because of your struggles, dont let them tell you that you arent good enough, but that your strong and beautiful inside. The man servant could be referring to his sponsor, the telling people his tale could be him sharing his struggles with the room. Him not going into these rooms for attention but to get clean and begin a new way of life. By referring to his dad not showing up, this could be an admittance of where his addiction began was the constant abandonment and lack of love. Or referring to fitting in and he did stupid things such as drugs to fit in with the cool kids. \n\r\nThe most touching part of this song is when he is referencing the cards we are dealt, I have felt that because of my addiction and the things I have done, I feel like I have always been dealt the shitty hand, but he is saying that take what you have and deal with it, sober, because god gave us a place in this world for a reason, so flip em and figure it out, and do it sober, it will mean more.\n\r\nI am seeing this song from an addicts perspective, I am 3 weeks clean and can relate to this song as if I wrote it, with the mic and rap representing life and drugs, he has proven himself once again with this song, it is one of his best he has ever produced.\n\r\nSorry if I babbled, or offended anyone, but this song is deep, and for any other addicts in recovery out there,  I think this really hits close to home.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis is the best song I've ever heard of in the whole rap genre. I seriously have to listen to this song everyday at least three times. To me, only Em can get a point across in such powerful words. The beat, rap structure, and feeling of the song play in so well. Em, i give all the props to you. You the only one who knows the right words to get the whole world to stop and listen to the truth.\n\r\nI love ya, em\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni can relate to this song so much.\n\r\none of my favs\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nprobably my favorite song off Relapse...can't stop listening to it...and glad cause the rest of the cd just hasn't really caught my attention or grown on me like most of his stuff does\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nAmazed....that hasnt happened in a while with Hiphop lately...this might shift me from listening to Brand new( great band)....welcome back to hip hop em..missed ya\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthis is the eminem everyone loves.  a great song, probably the best hes come out with in quite a while\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nDamn! This is Eminem prob at his finest!\r\nThe way each verse ends, it flows and fits in with the begining of the eash chours. Its crazy!\r\nThis song is so real!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nyo, this song is so amazing. for real. the rap structure is incredible. and Eminem proves he can still give you chills even after so long.\n\r\n\"they can all get FUCKED just stay true to you\"\n\r\nand the meaning's so simple but so perfect. and that sample at the beginning and the end is just crazy fitting for this track.\n\r\nas for this track in comparison to the rest of the cd.. its basically saying you want the grammy winning em. here he is. Hip hop isn't always ment to be taken seriously but when it is. it can sound so amazing like this.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthe beat and use of sampling of 'Reaching Out' couldn't be better\r\nand his flow to the track is sick. the lyrics and his storytelling ability is as great as it's ever been. \n\r\neasily my favorite track off the album\n\r\nthe meaning culdn't be more straight forward. you are who you are and that's beautiful. be yourself and screw everyone else if they say you're anything else other than beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis is a great song, its hard to find a rap song that actually has meaning to it, thats what separates him from the rest of them, he's not afraid to rap about some real issues \t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nman I never thought I like a rap song but damn, this is amazing!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song is just really deep. And I can relate to the dad part. And it sounds like just believes in this what he's saying...\n\r\nIt's partially depressing that some other people don't understand this.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis song is 100% real and it's 100% raw.\n\r\nI think Eminem has truly shown the Hip-Hop and Rap community what the real deal is with just this song, the Genre(s) was going to a slump of horrendous pretension and 'fake', if you will.\n\r\nRather than joining the others in the world of fake, such as Kanye West, Beyonce, Soulja Boy, Chris Brown and most of the others who are in the Hip-Hop/Rap community, Eminem sort of cut down an old pathway where Hip-Hop and Rap used to be rather than on the pathway to be just like everyone else.\n\r\nIn short, I'm glad to see some originality and reality and rawness thrown back into the Genre(s), there for a while, Hip-Hop and Rap was starting to look like a lost cause.\n\r\nAs for the meaning of the song, if you don't know the meaning then you're either blind or deaf.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nGreat song from one of the greatest rappers of all-time(no doubt) also one of the deepest songs i've ever heard.  One of the best \"meanings\" in any song i've ever heard.  Props Shady. Deuces\r\n-AT\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\n\"I was never the type of kid to wait by the door and pack his bags\r\nOr sat on the porch and hoped and pray for a dad to show up who never did\r\nI just wanted to fit in, in every single place, every school I went\r\nI dreamed of being that cool kid, even if it meant actin stupid\"\n\r\nmy favorite part of the song. i can relate to this song in so many ways, its ridiculous. love you eminem, cant wait for relapse 2\n\n\n", "comment_19": "\nGah I LOVE EMINEM! this song is so true.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThe Private World is his own Head, his mind, where he's alone, everything is right and no one can come in and tell him anything. A PRIVATE WORLD is the perfect definition of Human Mind, but if you stay too much time in there, You may never get back and become more and more distant, because of the Fear to the Real out world! That's how I feel relating myself to the lyrics to the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nyeah , i m not interest in eminem s songs but this one i adore ! \t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI was raised with Eminem. And I know a lot of his songs by heart. But through the years I became a metal and rock fan. This song hit me hard 'cause it reminded me a lot of my own life. I'm definately remembering why I fell in love with Marshal Mathers to begin with, 'cause I'm in love with him again. This song has to be his best. \t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nfavorite line:\n\r\n\"But I already told you my whole life story, not just based on my description\r\nCause where you see it, from where you're sittin, it's probably 110 percent different\r\nI guess we would have to walk a mile in each others shoes at least\r\nWhat size you wear? I wear 10's, let's see if you could fit your feet...\"\n\r\nSo true\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nOh how I love Eminem when hes depressed and introspective! (Poor guy.) Such great samples and he always sounds like hes talking right to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nthis is my favourite Eminem song so far. this song has 3 meanings. 1)it's about Michigan (home state man) and how we're all in a slump in this state. Eminem's just sayin don't let anyone tell you you're not beautiful, anyone who says that they can just go f*** themselves. 2)it's about Eminem's own issues with drug use. he's just saying (quite clearly) i'm in a bad spot and i'm clawing my way out. 3)what he's trying to say to anyone listening. he's saying be who you are, don't let a d*** soul say their's something wrong with being you.\r\nthis song has some personal stake for me. at various points in my life i would've leveled with Marshal. i've been in some slumps; my dad's car accident, when i busted my arm, and right now since my folks split up. (i'm 16) also my folks just plain don't like the who i'm deciding to be at times. wether it's my choices for a career, higher education, and just plain my views on social and political stuff. i'm just thinking don't say i'm not good.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nBest eminem song ever. Love the chorus.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI believe that this song starts with Eminem's personal story. He notes his absence from the world of hip-hop and says that no matter how hard he tries to communicate with his fans, they have to be trying to reach out for him as well. He also intimates that the song can be used for anyone who has ever felt down or has felt like an outsider.\n\r\nThroughout the song, he tells of his own life, how it was hard for him to really believe in himself and that he had the ability to keep going with his songs. Even though he had people criticizing him for his songs, he kept getting back up and writing new ones. Over time, he started writing them in the style of other rappers just to try to fit in but he realized that no one took him seriously unless he was himself, so he wrote \"Beautiful\".\n\r\nHe distanced himself off from the rest of the world by keeping his thoughts to himself and doing drugs just to ease the pressure of everything else going on in his life. He finally accepted that he needed to reach out to someone and went through recovery, and it helped him go back to the true Eminem.\n\r\nThis song is meant for people who don't believe that they are worth anything. Eminem says that it doesn't matter how much you try to fit in with the \"cool kids, even if it [means] acting stupid\" because in the end, they will not be there for you. The only people who can call themselves your friend are the people who respect and like you for who you are. It shouldn't matter or affect you in any way when people start putting you down as long as you believe in yourself. Every person is beautiful and should neither judge nor be judged by other people until they have switched shoes with you, or you have changed places with them, to see qhat they have been through. Everyone has had different experiences and each perspective is different depending on what has happened to each person that makes them view the world, other people, songs, etc. in the way that they do. All you can do is be yourself and take control of your own life because you are the only one living it, and no one can take away your experiences or your future away from you.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nfirst time I heard this one---  I remembered why I loved Eminem.  I could hear this one everyday for decades and that is ok\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthis has to be my favorite song from Relapse...........keep on listening to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song really touched me. love it. love you eminem<3\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nto me, it means that no matter what everyone else says, you are truly beautiful. ignore the haters and just be true to yourself.\n\r\n\"But don't let them say you ain't beautiful\r\nThey can all get FUCKED, just stay true to you\"\n\r\nlove this song, out of all the eminem songs.\r\nit really means something deep.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nto me, it means that no matter what everyone else says, you are truly beautiful. ignore the haters and just be true to yourself.\n\r\n\"But don't let them say you ain't beautiful\r\nThey can all get FUCKED, just stay true to you\"\n\r\nlove this song, out of all the eminem songs.\r\nit really means something deep.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nthe greatest i have heard in years from him porlly since cleanin out my closet i can relate to this song because i say the same stuff just stay true and fuck the rest\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nMy favorite song off relapse. Deep, good lyrics, overall really catchy. One of his best songs ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThis is by far the best song on Relapse. It really feels like Eminem put a lot of feeling into the song. In most of the other songs on the album he sounds like an Indian rapper.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis is an awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nwell damn shady.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nDefinitely one of my favorites. I love Em!\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThis song is so true i love it.\n\n\n", "comment_40": "\nlike a lot of you, on initial listen, this was my favorite song off the album.  after listening to it more and more, it's become one of my least favorites.  don't get me wrong.  the serious content that you wish was in the rest of the album is there.  but the lyrical structure dips compared to the rest of the songs.  his flow is hardly consistent here and his multisyllables and wordplay aren't very impressive.  but i swear, the worst part about it is his singing.  some of you may like it but i think his singing is more annoying than his accents (which have actually grown on me).  i guess that's the price you have to pay:  lyrical structure vs. lyrical content.  lol.  man, i hope Relapse 2 gives us the best of both worlds.       \t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nGoodness, I love this song it's true \r\nand very beautiful, eminem welcome back dog.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI believe that this song has a lot to do with the dehumanization of the human race cuz he says \r\n\"they can all get fucked,\r\njust stay true to you\"\r\nand thats like everyone else is fucking themselves over, but you just need to stay true to you\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThis song speaks about two topics. 1 being the city of Detroit and the 2nd being dealing with your self and what people think about you and what you think about yourself. \t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nHonestly the real meaning of the song and the messenge is like if you Rly lisen to this song and the lyrics hes saying don't try to be like anyone ells be yourself , and your beautiful the way you are always  , so don't think other wise and don't act like nayone ells bc you wanna  fit in\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nHonesly if you really lisen to the song and the lyrics its really obvious what the messege is , \r\n  hes saying . be yourself , don't act like anyone ells your perfect the way you are and don't let anyone tell you your not beautiful because your beautiful no matter what\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI absolutely L-O-V-E this song!! FORREAL! Lol. It's the best off the Relapse album..seriously. =) Love it! \t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\npowerful song from a great artist\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\npowerful song from a great artist\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nbeautiful song. i can relate to it entirely. great lyrics, imo best song on relapse.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nbeautiful was a very meaningful song to eminem no doubt there was any hard feelings and its true what he's saying and what he's trying to tell everyone who listens to his music. \r\nyes you are beautiful in the insde  dont go by from what people judge or base upon you. your better than that. i can honestly say that he's in inspiration on me and all of his fans. finally no more slim shady... the real eminem.... :) \t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\ndoes this :\r\n\"Ahh, Marshall you're so funny man you should be a comedian, god damn\"\r\nUnfortunately I am, I just hide behind the tears of a clown\n\r\nhave anything to do with Insane Clown Posse? It's a great song, but this right here got me pretty well confused.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI think this song refers to a man who-through lonliness or loss of love-has become distant and slightly lost.\n\r\n'Lately I've been hard to reach\r\nI've been too long on my own'\n\r\nIf you've ever been distant, it's very hard for people to approach you. I think people may have given up on him because he's become so distant.\n\r\n'Everybody has a private world\r\nWhere they can be alone'\n\r\nHe is constantly in his own world, he is constantly alone.\n\r\n'Are you calling me?\r\nAre you trying to get through?\r\nAre you reaching out for me?\r\nI'm reaching out for you....'\n\r\ni think there is someone very close to his heart that he wants and needs to help him get through the tough times. Except he does'nt realize how hard he's making it for that person to help although it ay feel like he's crying out for help in everyway.\n\n\r\n'In my shoes, just to see, what it's like to be me, I'll be you, let's trade shoes\r\nJust to see what it'd be like to feel your pain, you feel mine, go inside each others minds\r\nJust to see what we'd find, look at shit through each others eyes'\n\r\nThis is about seeing things through a different perspective.\n\r\nOverall, i believe this song is about a guy who is finding it difficult to fit in or who doesnt want to fit in. And although he seems like he doesnt give a shit, it's killing him inside.\n\n\n", "comment_53": "\nI fucking love this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nFirst of all I want to say I can't stop listening to this song like federov1fan said. I can really relate to it but in a slightly different aspect.\r\nBut in verse three I think the lyrics are \"Aunt Edna always told me,\" instead of \"And Aunt Edna was told me,\"\r\nEither way I love this song and I feel like he is expressing his feelings about not knowing if he can come back to rap after his break and how he dislikes the publicity he gets from being who he is. I think I would feel the exact same way if I was in his position. But the way I see it from where I'm sittin is probably 110% different....\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI think his private world he talks about is his home, Detroit city\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis one is so straight forward, it doesn't need a close reading analysis. Just one line is enough to give you the meaning. \"Don't let them say you ain't beautiful, They can all get fucked, just stay true to you\".\n\r\nStay true to yourself, without having to lie to make yourself popular. The people who are worth being your friends will understand and praise you for being yourself, not some cool guy who doesn't believe a thing he says. The ones who don't understand you're being yourself, who need the lies, the pretense... You shouldn't care what they think, cause if they need to pretend they're someone else for others to like them, they're worthless.\n\r\nThe return of the great Marshall Bruce Mathers the 3rd. One of my favourite Eminem songs. I mean... I like Shady and his \"fooling around with lyrics and sound\" (as one of my friends once called it), but when a serious Marshall song comes out... It's bound to become a hit.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nthis is honestly eminem best song ever. like eminem has been my favorite artist for 8 years now\r\nthis song came out and just like up lifted me. i was going through shit so i just would listen to this\r\nmy personal favorites\r\n1. beautiful\r\n2. lose yourself\r\n3. not afraid\r\n4. the way i am\r\n5. sing for the moment\r\n6. rock bottom \r\n7. space bound\r\n8. like toy soliders\r\n9. still dont give a fuck\r\n10. my darling \t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nits pretty obvious that people like this song. but now onto what this site is for. this song is obviously about depression, you don't need to listen to it more than once to figure that out. but look deeper into Eminems life and these lyrics and you can see its about how he went through a rough period when the price of fame and the Illuminati started to kick in. that whole first verse is about how he's become so depressed because the higher-ups took control of his life. \"i feel down and got right back up\" is sayng that he is starting to take back control of his life. and when he says \"i know one fact i'll be one tough act to follow, one tough act to follow, I'll be one tough act to follow, here today, gone tomorrow,\" he's acknowledging the fact that he is probably gonna get taken down by the higher-ups for rapping like this. i know not a lot of people know about/believe in the Illuminati stuff, but that's what this is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\none of my favs. he's so genuine.  every word rings true even if he changes his mind later on, he's in the moment.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nBasically fuck haters, dont judge someone because you need to know what they've been through, \t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI come to this song every time I hit my lowest. It helps pick me right back up. Obviously, it's about being stuck in depression and not being able to shake it. I love how this song also has some hope in it. Beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nmy new favorite song. im been feelin depressed lately. i love eminem. this song made me cry.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nLately, my beloved woman has strayed away and she's kept me away from her. I felt very hurt, but now listening to this song and reflecting upon the verses, I believe I can understand what she is going through. \t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nUhh... This song for me is the Best its inspirational and true i can really relate\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nWhen this song came out I was in eighth grade, and I used this song to keep going.  Rejection from girls and dealing with bullying was the main issue in life back then so I would listen to Creep by radiohead and then follow it up with this song and feel a little better.  Pretty depressing and sad but hey Eminem always made songs that would keep me strong growing up\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nFinally, eminem stopped his slim shady songs and went back to eminem or marshal mathers songs. His new album isnt that great yet.\t\t\t\t\n\t\t\t\t\n\n"}