{"comment_0": "\nthis is a song about how someone has gone through a lot of pain in his life, and sees good things through it, and how it made him who he is. it's a really powerful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIt's about how pain has created the writer and how the pain in their life has made them who they are. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\n\"My life, my love, my drive\"\nNot \"my luck, my live, my God\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nAs far as I agree with the meaning people give to this song. I want to add that, This song is about the journey of dan Reynolds trying to make a change inside the church. (At least from what he has said on some interviews)\n\nHe's been, for a long time, trying to make Mormon's accept the LGTB community.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nFirst things first: I'm pissed off and I'm going to tell you all about it.\nSecond thing second: Don't be trying to restrain me with dogma or anything else.\nThird things third: I'm tired of LGBTQ people killing themselves.  And I'm tired of the people who can't accept them causing it.\nLast things last: You who have suffered this are fueling my purpose in life now.\n\nIf you think I'm way off, try coming to the LoveLoud Festival with me next year.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think it has to go with God in the way in the second verse he says \"send a prayer to the ones up above.\" Apparently, the pain has shaped him and made him who he is right now. It has also made him a believer in God.\n\nIt seems as if the whole song is just a prayer to God.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis is my interpretation \r\nFirst verse: Iâ\u0080\u0099m gonna say everything Iâ\u0080\u0099m thinking because Iâ\u0080\u0099ve kept it bottled up for so long donâ\u0080\u0099t tell me what i should be peoples stereotypes and expectations donâ\u0080\u0099t define me\r\nPre chorus : I had a lot of problems when I was younger and I would take my problems to people. I would write for the few people that looked at me and cared about me Singing about my heart ache Iâ\u0080\u0099m taking my message from inside/my heart talking about whatâ\u0080\u0099ve learned and seeing the best things from the worse\r\nChorus:pain made me see the good things even in the worst of times somethings that break me down such as pain still build me up my love my life and my drive all came from pain\r\nVerse 2: send a pray to the people in heaven that are no longer with us and thank them for the impact the have had in your life and try to avoid all the hate you have heard and be peaceful like a dove (states  in the about doves being the sign of peace\r\nPre chorus:I was a regular person dreaming about a different life and I started falling down I was hoping my feeling would go away but the didnâ\u0080\u0099t and then it caused me pain because I kept them bottled up\r\nBridge: last thing the grace of the Holy Spirit (in the church they consider fire and flames a sign of the Holy Spirit) is the future and the thing that keeps me alive  and my feelings being bottled up finally effected me\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nAn aimless man meets, falls for and finds out about the facts life from a strong woman who's philosophy and criticisms are grounded in reality. He objects to her harshness but life prooves her right about everything.  He's improving and he wants her but it's a backwards relationship and her interest in him fades with his inability to take charge.\r\n Love desire and pain are sometimes partners. \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI interpret this song as from the view point of a mass shooter or school shooter. Especially the bullets flying in the chorus. And the first two verses imply heavily towards this premise.\n\r\nI just don't understand what making him a believer has to do with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nIt's about someone who is let all the pain in their life get to them basically they were abused as a kid and the only people that he could share it with were people that were also abused i.e his brothers and when he grows up he meets someone who was so pure and tried to save him but he doesn't feel like she can\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\npain you made me a believer .its so simple and so true\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI am addicted to this song, it's my favourite!!\t\t\t\t\n\t\t\t\t\n\n"}