{"comment_0": "\nI love the mixed music styles.  This is an awesome song all about just wanting life to be simple and forgetting about the problems of the world with a magical ride on your bicycle.  \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIt's just about the tour de france and how Freddy loves riding his bike.  You guys are obsessed with finding gay connection in every queen song its insane.  I mean, there was even a post in We Will Rock You saying it was a gay pride anthem.  It wasn't even written by Freddy for god's sake, it was Brain May's song.  Just because he was gay doesn't mean every song is about that.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIt's talking about politics, the media, entertainment, religion, and everything else that is or was controversial of the time. He's stating he doesn't want to be apart of it, he just wants to go out and do stuff for his own and not worry about all that nonsense.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWell at least someone stood up for their convictions at a time when the world was Star Wars mad.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song just signifies one concept of ourselfs and that is independent thought.  You dont have to follow everyone and like what they admire.  All of us sees reality differently and that what makes us significant.  The message is be independent is what makes us divine.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nits not about freddie's sexuality, its just about, Jesus man, the world sucks, i want to go ride my bike!....yknow just not being so stressed all the time and LIVING!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI know it certainly makes me want to ride my bicycle.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nits a queen song theres millions of ways you can take it, you could take it as leaving your worries behing to have fun, you could take it as sex, you could take it a rebelling against everyone..... anyways it kicks ass so its kool\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI just think it's simply about being free from the influence of others.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nlaragiesbrecht summed it up. i also think that it's about not being judges as a child by doing immature things, such as riding a bicycle. also being free from society and doing the things that you want to do. although freddie mercury was bi, it doesnt mean that all of his songs are about being gay or bi\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nFreddie Mercury was gay\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ni can fully say that Queen is probably my favorite band of all time. i'll take classic rock anyday, especially the bands i was raised on. :) good song, great guitar, and the lyrics are fun to sing too.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI think Freddy is making an analogy between life and a bicycle race...\n\r\nAnd when he says \"I want to ride my bike\" he means \"I want to live and not be constrained politics, legislation, racism, religion, popular culture,\"....\n\r\nI guess it is about freedom then....\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI haven't heard any actual interviews or any other background information about this song, but just through listening to it, I think you're all right. I was listening to it a few months ago when the Innuendo hit me.\n\r\n\"I want to ride my Bi - cycle\r\nI want to ride my Bi\r\nI want to ride my Bi - cycle\r\nI want to right it where I like\"\n\r\nThat, also,\n\r\n\"Bi (cycle race)\r\nBI (cycle race)\r\nBI (cycle race)\r\nBI (cycle race)\"\n\r\nstood out too. I had to laugh.\n\r\nI don't think I'd like it if it was explicitly \"I want to ride my Bisexual\", I think the implied innuendo is what makes the song great.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI was waiting till someone would point out albert hoffman and his bike... im not sure what all freddy was into, but i do know what the song says.  Like hoffman, i think freddy just wants to ride the bike because hes tripped out by reality \"Bicycle races are coming your way\r\nSo forget all your duties Oh yeah\", freddy just wants to escape, like into an acid trip on a bike. whether or not the song is about acid, it is still about freeing your mind in some sense, which alot of people would also associate with acid so i think the correlation is blatent.  anyways, i think the whole bisexual thing might have some small thing to do with it but for the most part its about living happy, free, and without worries, however you achieve it...\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni want to be bisexual\r\ni want to ride a guy\r\ni want to be bisexual\r\ni want to sleep with who i like\n\n\n\n", "comment_16": "\nI think the \"God...Superman\" verse is a reaction to people who tell Freddie and other free spirits they can't do what they please, especially sexually, because the Lord God disapproves.  Freddie replies:  I have as much right to choose my beliefs as you do.  Whether God is depicted as good (Superman), Bad (Frankenstein), or neutral (Peter Pan), I'm not threatened by his invocation, as it's all just make-believe.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThe song refers to LSD, hence the weird references. Albert Hoffman (inventor of LSD) discovered LSD intoxication and found himself hallucinating on his bike ride home, the day is known as bicycle day to experienced psychedelic users. Queens want to ride their bicycle refers to a desire to trip.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI'm pretty sure I saw/heard in some documentary about Queen that the song was inspired by the Tour de France, which was going by the band's hotel, or something like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis song is great. I heard it on AFI and immediately went to download it. \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nIt seems that the initial video for this song was banned coz it featured over 50 female models having a their own little \"Bicycle Race\" in the nude in a stadium that Queen hired for a day.\n\r\nReady Freddie!\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nInnuendo - they talked about that on a recent documentry.\n\r\nit was hilarious. love the song tho xxx\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nFreddie Mercury wrote it when he was watching tour de France, but I think its about bisexuals. I'm not sure if he was gay or bi in the end, but I know he was a bisexual for a while. People were probably opposed to that, \"I want to ride it where I like\" might be in reference to being open about his sexuality.\r\nAs for peter pan, frankenstein, and super man, I have NO CLUE!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nYes, lots of satire about the popular culture and politics of the day, I'm not sure that Bisexual was apart of this but it could be, But I'm also not going to spring to this conclusion because this was not the only facet of Freddies life, and while i do bring religion up alot as being integral in thier music, that is not dominating either.\r\nIt seems just to be wanting to escape the din of society.\n\r\nNote: this music video did not orginally include the nude bicycle race footage, because the band was unhappy with the cut and the released video was just another strait performance video (which dominates their early years), but David mallet unearthed and finally did justice to the band's original intent\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ni think the songs about when freddie mercury won a bicycle race when he was a kid\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nif i hear this song played during the 'people falling off bikes' part of you've been framed style tv shows once more, i seriously think i might kill someone.\r\noh, the other day i was trying to get away from how much the world sucks by riding my bike - in the middle of the night mind - and in the middle of the countryside with no lights or reflective (or protective for that matter) gear - and on a main road. the bloody chain came off and i went flying like superman stoned out of his head and KER-ACK\r\nman that hurt - just remeber kids - always wear a crash helmet... when you're smacking the crap out of the person who 'fixed' your bike. anyway, riding bicycles isn't as relaxing as it might be.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ngimpy, I believe they meant We Are The Champions. But either way, neither of them are gay pride anthems, though We Are The Champions was used in a Viagra commercial once.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\ni totally agree with gimpyx2k,just because freddie was gay or bi or whatever it was, not every queen song has something in it about that!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI always thought it was about Drugs don't knwo why i think it was cause i got high for the 3 time and this was the song that came ona nd it triped me the fuck out specially the bells fuckin hell\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI hate this song hate it hate it hate it its so annoying and catchy and dont get me started with the bike bells.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song is great! Not their best song though. But it's still really good.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nthis song is about being an individual, not worrying about whats on the news or whats the fads, you dress in your own style, do your own thingy and follow no one.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nSo he didn't like Star Wars, huh? and what about Jaws? Well...this is a good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nIt's definitely tied in with Fat Bottomed Girls. I guess that kinda a no brainer.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\n[\"That is the craziest thing I have ever heard. This song is simply about bicycle races. There is no special meaning behind it. \"] is the craziest thing i ever heard\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI'll say it again, and I'll explain myself more this time. I may only be 16, but my dad is the biggest Queen fan I ever met and also believes that \"Bicycle Race\" being about gay anal sex is the craziest thing ever, next to Bohemian Rhapsody being about AIDS, which someone also put. There were a bunch of women who were racing bikes, and they were all completely naked, but they had to paint bottoms on. This song is just about them racing their bikes, hence the line \"fat bottom girls, they'll be riding today.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI love this song...I mean it's pretty stupid, thematically, but the music is great.  I love all the little different things going on in it.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\none of my friends swears this song is about communist china. i have no idea what the logic behind this is, but i find it pretty amusing.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI heard about this song is dedicated to a person who created a kind of drug (i don't remember which is it)... he used to ride a bicycle to go from his home to job... i know it's sounds silly,\r\nonly it's a comment... if anyone can tell something about this... please... post a message.. best regards\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nME likely the bell part!!!!\r\nhehehe\r\nsounds a bit like the wizard of oz when u 1st see the wicked witch.\r\nthat was random.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThis track was on the first ever recordings QUEEN made a lifetime ago.\r\nMost of you will never remember the good old 8 TRACK system.\r\nBulky by todays players, I still have it now! but on my IRIVER MP3 player\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nit's just about the little mental escape you get by doing something like going fishing or mowing the lawn- you don't really think of the rest of the world when you're mowing the lawn, now do you?\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nit's just about the little mental escape you get by doing something like going fishing or mowing the lawn- you don't really think of the rest of the world when you're mowing the lawn, now do you?\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nyou can take it as a political attack.\n\r\nyou can easily say that queen created pop-punk after hearing this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThe lyric \"I don't wanna be a candidate for Vietnam or Watergate\" is pretty obvious. Since they didn't allow homosexuals in the military, Freddy didn't want to be in the military.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nI just think it's simply about being free from the influence of others.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nWell, darlings, just like one of you guys just mentioned, I really don't like to think that all the songs that Queen (or Freddie) made are about gay people.. It's like I'd stigmatized them or categorized them without even trying to get the lyrics in the right way. \r\nBut even so, I found very interesting the point that the song is about bisexuality. Referring to the line \"I want to ride it where I like\" for example it kinda makes some sense. It's like a more decent metaphor for a statement like \"I fuck anyone and anytime I want no matter you say\".\r\nSounds like Freddie wanted to snap some narrow-minded moralist. =)\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nWell beleive it or not, but the idea of this song came after the band went on a drinking night,and someone  (i don't know who) said :\"Wouldn't it be fun,to have a Bicycle Race with naked women\".\r\nSo they did,and they used special effects to hide the nudity,in the video.\r\nThe company that suplied the bicycles complained after words they had to changes all the seats\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\n@alfiebaby: yes. freddy mercury was gay. thank you for that tidbit of knowledge that was presented in no relation to the song.\n\r\n@esais64: the \"person who created a kind of drug\" would probably be albert hoffman, judging from your description. he was known for discovering LSD by accidently spilling the chemical on his hand; the experience happened while he was riding his bike.\n\r\nthe fact that freddy plainly states \"i dont believe in peter pan\" (peter pan, of course, being an androgynous character with youthful charms) seems to imply that it isnt about homosexuality or bisexuality.\n\r\ngiven the diversity of things freddy rejected in this song, and the insistant emphasis on wanting to ride a bicycle, i would say this is about nothing more then escapism.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nin the brigde: the lryics are done in 3/4 timing and the music is done in 4/4 timing. pretty cool ^_^\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nhow high were these guys when they wrote this song\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI think this song is about individuality and how some of us don't follow the popular trends. I am a lifelong Queen fan and many years ago tolerated my \"straight\" friends comments such as, \"Isn't he gay\"? It was as if they couldn't understand the genius of Freddie Mercury because of his sexuality. He was probably more creative because he was gay. By the way, I was never crazy about \"Star Wars\" either.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI think that this song has no special meaning. It is said that Freddie was inspired by tour de France and wrote the song.  It's very complex song and Its possible that Freddie just made up some ambiguous lyrics with tongue in his cheek.\n\r\nFreddie wasn't very politically so the song isn't about china, communism etc. Neither the song is ode for anal sex. Eventhough Freddie was gay I think that he keept his orientation way from lyrics and wrote love in generally.  \n\n\r\nFreddie wasn't very intrested in politics so\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nluv the song!\r\nlol\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nits about being you as proven in the lines \"jaws was never my scene and i dont like star wars\" and \"i dont  believe in super man frankenstein or peter pan\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI really just a song about wanting to do what you want. Not wanting to do stuff and just wanting, ride your bicycle.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI dont thing its about being bi. I think its about Politics and Racism. \" I want to ride it where I like\" They just want to go and have fun. Everyone equal and the same. When he talks about how he says \"you say rolls I say Royce\" It's kinda saying how we are all different but we are still the same so lets be equal and RIDE.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\ni think the song either has no meaning or has to do with the singers childhood. (i dont remember his name)\n\r\nP.S. Ziggy*dust, thats gay\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThis song is NOT about Freddie's sexual orientation. Just because he was gay and/or bisexual does not mean all of Queen's songs were about being gay and/or bisexual. His sexual orientation wasn't his only trait. \n\r\nAnway, this song is about being an individual in a world where everyone is the same.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nWhy is it a problem that this song has relation to Freddie's sexual identity/behaviour?\n\nI find it pretty natural to Freddie's sexual habits be present in his songs. Someone's sexual persona is one with their social persona. And those among others together make up a composer's pesona.\n\nSex is always a big deal to a homosexual, but not only sex. Effeminate behaviour overall. He doesn't want to disappoint pappa (and everyone else) with his girly ways. That has a consequence in his behaviour.  It all comes down to an urge to break free from that \"behaviour police\" and just do what he wants. He isn't even up to bothering anyone with it, so what's the matter?\n\nEven if his primal intention was making a song about doing what he wants with no sexual focus, the need of making such song comes from the identity he built up in his life, which involves being judged to do many things. Bi/Gay sex is only one of those.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI've read a few pages of the comments and was surprised not to hear anyone mention the Freudian technique of free association, which I imagine was more popular in the 70s than now.\n\nA young guy is obsessed with bicycles and all he wants to do is ride them. He gets sent to the psychiatrist (by his worried parents?) a couple of times, where he has a couple of sessions of free association, at which he asserts that his one desire is to ride his bike.  And that's about it.  It's not about sex - the fat-bottomed girls were put in there just for a bit of self-referential fun, in the same way that 'Get on your bikes and ride!' was put in at the end of Fat Bottomed Girls.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nMost of Queen's songs are parodies to life in general. So, this one is no different. It just pokes fun at everything in life, from politics to black & white. How our minds jump from one topic to another without any relevance. \nAnd the bicycle riding part is probably inspired by the Tour de France, where for a rider, nothing else matters but the moment of riding (being in that moment). \nGreat song - love the fat bottomed girl part!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\ni spaek just some words in english, but i must explain...\n\nthis is a lsd trip\nwhere i like (gay)\nand all the song is a Dialog in a Bar, LOOK:\n\nGuy: you rolls (on a bike)\nFreddie: i take the rolls royce \nGuy: bark, but FM: bite  (rival each other)\nGuy: Shark (loudmouth) FM: hey man, \njaws= (chat, to much speak about something), an the STAR WARS= to make out with somebody (kissing ec)\nhe do not want to speak to much (not his scene) and he do not want to long make out either\ncoke= lsd, Caine= \"great\"\nJohn =gut in sex, Wayne= with big coxx, much better (rival)\nHot Dog= Cool! \nbut FM do not want to be greatest,, because it has it price (vietnam, watergate)\njust a lsd-sex trip\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nWhen he sings \"I don't believe in Peter Pan\", I thought he said 'pizza fan' - I never realized he was admitting to not believing in Michael Jackson ...\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI agree with number6. My mom just got the CD with this song on it and she was playing it, and now I've got it stuck in my head. But I love it when he sings, \"I want to ride my bicycle!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nthia song was actually written about bisexuals not bicycles but it had to be changed for marketing purposes.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nThe song is possibly satirical, given the mentions of Watergate, Vietnam, etc. Also they say BI alot. :P\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nlol when Queen returned the bikes and told the store what they were used for the bike store refused to take em back heh heh.\n\r\nto be honest i woulda taken those bikes but yea hygene\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nIts about anal sex. when he says bicycle he means a big juicey hunk o ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nthis song actually really annoys me, i always skip it\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nZiggy*dust is right.\r\n\"Riding a bicycle\" is slang for gay anal sex.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nThat is the craziest thing I have ever heard. This song is simply about bicycle races. There is no special meaning behind it.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI love this song...I mean it's pretty stupid, thematically, but the music is great.  I love all the little different things going on in it.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nheck yes! this is actually about when freddy mercury looked out the window of his hotel room in paris and saw the tour de france ride by\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nWho ever says that this song is about being gay or anal sex or drugs is completely off there track! Freddie wrote it in his hotel room watching the tour de france ride by (as the above mentions), and I highly doubt he had in his head \"Wow, look at all the bikes, i'm going to write a song about it, but it's secretly going to be about me having anal sex with Mick Jagger\" (sorry, that was bowie) I know Freddie wasn't usually superficial, but this song just says one thing: RIDE THE DAMN BIKE!\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI think the song isn't about a bicyle race, that seems a bit to trivial.. it makes sense if you listen to the lyrics, about the media, religion etc, everyone who would have made a huge deal if they knew (Freddie) was bisexual/gay (whatever he was).\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nIf you want to know what I think, It could just be about a guy. The whole call-response thing could be him just describing what associates things with and  what he likes/dislikes. But above all, of course, he loves to ride his bicycle.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\ni heard between the buried and me's version.. its was tight\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThis song is about smoking weed. By \"Bicycle\" he means the bicycle rolling papers and hes saying he dont wanna do anything but relax and smoke some weed\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nI can't believe that even THIS song is interpreted as something really sick/perverted like Anal Sex. When, clearly, it's just about having a good time. Freddie wrote this song as he watched the Tour De France pass his hotel. And so, for fun, he decided to write a song about bike riding. It's not supposed to have some deep metaphor or meaning. It's just supposed to be an all-around fun and goofy song.\n\r\nAgain, topics like Anal Sex and Drug Use were still very risky back in 1978. It's amazing how a lot of young people seem to think we've always had things like South Park and Grand Theft Auto. WE DIDN'T!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI think it's about masturbation.\r\nEveryone of my friends says it is and now I looked at the lryics and noticed that he says he doesn't want care about anything else except\r\nMASTURBBBAATTTIIINGNGGG :D\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nThe meaning's pretty simple, it's self explanatory.  He doesn't really care about anything else, just wants to ride his bicycle.  Some Queen songs are about being bisexual, but definitely not this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nAnyone else notice the reference to their song \"Fat Bottomed GIrls\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI think it's just a fun and goofy song. :) \"Bicycle! Bicycle!\" ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nThis song was written by Freddie- not surprisingly. He was inspired by the tour de France which was outside of his hotel room in France-  they recorded Jazz in France. The funny quirky lines of the verses are just meant to show that he is going against everything they say- he is not listening- he doesn't care. He doesn't want to do anything but ride his bicycle. Many say how, \"Oh, Freddie Mercury didn't like Star Wars\". That's not true- it's all meant to be a joke. It's like if a little kid, let's say, wanted to play video games. Their parents say \"No, but we are going to the carnival!\" It's not that the kid doesn't love the carnival, but because he's not getting what he wants, he is going to say, \"No, I hate the carnival\"- because he wants what he wants. And in Freddie's case, it was apparently his bicycle.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nI think it is about a guy that just wants to ride his bicycle, especially since the \"fat bottomed girls\" will be riding their bikes as well. The parts where he does word association, is basically his way of saying that he is sharp with his quick comebacks and he has earned his right to ride his bike and hang out with said fat bottomed girls.\t\t\t\t\n\t\t\t\t\n\n"}