{"comment_0": "\nSuch a beautiful song, and such great comments.  One person stated that Sir Paul himself recently said the song was written about troubled girls in South America in the 60's.  I'm going to look more on the internet, but if Sir Paul did say that, well, he would be the one to know.\n\r\nTo me, part of the beauty of art, including poetry and song, is to explore what it means to you, in your own mind. As a physician with a busy schedule I still long for a day when I can take classes and explore art ddeply.   It opens my mind, creating new ways of thinking, new ideas, news ways to express old ideas, realizations and better understanding of myself, and connection and openness to everyone and everything around me.\n\r\nI first heard this song this week, on an episode of Glee.  I actually thought it was about death, and the release from human limitation and suffering into an afterlife of peace and freedom. I'm so glad I looked for the lyrics and found this website!  I appreciate all your comments and points of view.  Isn't it interesting how our different lives and experiences have created so many different interpretations of the same song?  I wish that, in our national discourse, we could all appreciate and respect the differences that make each of us unique and special.  That's much more interesting and beautiful to me than everyone thinking and acting and being the same.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI always heard this song was about the plight of African Americans and the yearn to break free and have equal rights. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI've seen Paul live twice, and both times, he played Blackbird, and both times, he said that it was about the civil rights movement. This would be backed up with \"You were only waiting for this moment, to be free\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nA sweet anthemic gem. \n\r\nA bird with broken wings, black feathers against the bleak backdrop of a coal black night, yearning to break free. And that funny little paradoxical refrain - \"...into the light of a dark black night.\" The mental image is a sliver of moon or winking stars, but really I take it to mean that no matter how metaphorically dark your surroundings, there is always a dim glimmer to be found. We all have our blackbird moments, and broken wings or not, it's up to us to hobble our way towards the light.\n\n\n\n", "comment_4": "\nI love this song.  Its always just been an example for to keep pushing on, all my life.  the song itself is so simple; yet it captures me. Brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI just heard/saw my 12 year old daughter sing this in front of 100 people solo with a microphone.  She's a quiet kid who gets nervous in front of a crowd -and she nailed it! I'm still crying thinking about how beautiful and strong she sounded :)\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI thought that this song was about the difficulty of the civil rights movement and just the discrimination and hardships in general of the African-American community.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni dunno if u guys heard that tappin in the song but i read somewhere that was john's foot tappin to the beat\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI played and sang this as a lullaby for my daughter for years.  She looked forward to hearing it every night.  She once said that she would like for me to play and sing it at her wedding.  But that was long ago.  I will always think of this song as the background music for any depiction, description or memory of the bond between her and me.  So maybe it'll play when Dad and newlywed daughter do their post-wedding dance...\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI understand Paul wrote Blackbird in regard to the civil rights movement however I find it interesting that the Blackbird is a symbol of a Celtic goddess Rhiannon. She stands for feminism and he is singing about a black bird. I think too much.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song is possibly my favorite Beatles song, or one of them.  It's so inspirational.  Even though I'm not black, I'm a woman, and this song lifts me up whenever I'm feeling down.  I read that Paul had three microphones: One for his voice, one for his guitar, and one for his tapping foot.  I love that.  I also love the blackbird singing at the end.  It's a perfect touch.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nits a great song and has helped me through alot of problems im facing ......basically when you hear the song you get the picture of the blackbird and trying to overcome and keep on going . yet it also in depth revovles around the 60`s civil rights movment . i am deeply touched with this ......The Beatles are smart like that to get  that much listeners and fans = )\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nEven though I always heard this song was about the civil rights movement, it always had a much more special meaning to me personally.  \n\r\nI have had a lot of troubles in my life, family problems, personal troubles, and just hard times ever since I was little really.  There was a lot of drug addiction and emotional abuse in my family (father mostly) when I was younger (and still some today) and my mom was a huge beatles fan.  Whenever I heard this song though, it made me feel a lot better somehow.  I did not hear it for a long time, and then a few years back, times were getting harder, and a friend of mine played it on the guitar when I was over at his house with some friends.  I was pretty much in tears when I heard it, because it just brought back all the memories i used to have and the emotions along with it.  \n\r\nIt always makes me feel like no matter what has happened to you, you can learn to fly again and get through all that has happened to you.  It also made me feel like I could just escape from everything I was feeling.  It is a very emotional and personal song to me, and I hope to get a tattoo to always remind me of this fact.  I want to get just the words \"take these broken wings and learn to fly\" and some musical bars with the notes from the song.  Any other suggestions for me?\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nTo me,  song is about someone who has gone through a long illness (or even old age)whose time to die has come.  They are asked to \"fly\" to a place where there is no pain.  Even though the person might be afraid to die, the song says do not be afraid to go to the place where you will be free and where you will be born again or \"arise\".  Just my thoughts.  To me, this song has a lot of spirit or soul.  I also like the idea of it being for Rosa Parks during the Civil Rights movement, that is also an interesting concept....\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\njust wanna say, this song is perfect. \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nWhen the White Double Beatle album came out my group of friends with one charismatic guru type who \"suggested\" we all take names from the song titles on  the album to use as our spiritual names when we ran away to Stinson Beach Ca, to start a commune.   Our guru named me first as Blackbird and for me the lyrics encourages me to use what I have to see more, do more, pay it forward and say the words that need to be said and play the music that celebrate our lives all the way thru...all my life I have been waiting to do this...this is my year.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nalthough this song is really about civil rights and the struggle for African american freedom i believe it can be thought of as a song of hope. of being oppressed for so long and finally breaking free and being happy\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI had been doing poetry readings. I had been doing some in the last year or so because I've got a poetry book out called Blackbird Singing, and when I would read \"Blackbird\", I would always try and think of some explanation to tell the people, 'cause there's not a lot you can do except just read the poem, you know, you read 10 poems that takes about 10 minutes, almost. It's like, you've got to, just, do a bit more than that. So, I was doing explanations, and I actually just remembered why I'd written \"Blackbird\", you know, that I'd been, I was in Scotland playing on my guitar, and I remembered this whole idea of \"you were only waiting for this moment to arise\" was about, you know, the black people's struggle in the southern states, and I was using the symbolism of a blackbird. It's not really about a blackbird whose wings are broken, you know, it's a bit more symbolic.\nâ\u0080\u0094 Paul McCartney, Interview with KCRW's Chris Douridas, May 25, 2002 episode of New Ground (17:50â\u0080\u009319:00)\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI think this song is about escaping slavery. When he says, \"Blackbird fly, into the light of the dark black night\" it is talking about escaping slavery in the dead of the night, which could be a possible reference to Harriet Tubman. When he says \"take these sunken eyes and learn to see/take these broken wings and learn to fly\", it means that slaves are escaping to freedom and overcoming their physical abuse. \"Blackbird singing in the dead of night\" could be referencing slave songs that slaves used when escaping.\n\nI might be reading too much into it, but that's my opinion :)\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nOn the link I first posted it wasn't for troubled girls in south America look that link up Paul states was for the racial tensions going on in the USA at the times in the 60s\n\n\n", "comment_20": "\nSomehow this song reminds me of Edgar Allen Poe. It is a nice song but hard to play on guitar.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThis song is so simple but yet so effective!\r\nFantastic!\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nyeah, that's what i heard too *agrees with 1Cancer*\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nActually, I just saw Sir Paul in concert and he said this song was written about troubled young girls in South America in the late 60s. \t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis is a great song. I think The White Album was their best album even though it wasn't much of a commercial album.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI think this is one of those songs that is just vague enough to allow the listener(or int his case reader) to make their own decision of the meaning.  Personally, I have always assumed it to be about anyone who was in a difficult postion and needed out.  It also is just more proof of how great the Beatles were!!\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis is a great song. to me it a song that i listen to when i need support after break-ups ect. i dunno it always makes me feel better.Edited by oofus on January 28 2005, at 10:46PM\n\n\n", "comment_27": "\nthis song is perfect....it was my lullaby when i was a kid, and it's always meant something to me\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nSarah McLachlan covers this song on the I Am Sam soundtrack...\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni think the song is about a girl who has been held down or hurt all her life but shes going 2 fly away from the bad and be free. \"blackbird, fly, into THE LIGHT FO A DARK BLACK NIGHT!!!!\" and yeah its hard but fun 2 play on guitar.Edited by oofus on January 28 2005, at 10:50PM\n\n\n", "comment_30": "\nThis song is indeed excellant,thank you 4-saying what everyone wanted to nikkileemn and Bite me! good job chief!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\noh my god, my dad can play this PERFECTly on the guitar and whenever he sings it it gives me goosebumps and he's been singing it since i was like 6. its great. i love it. when he used to play it i never knwew it was the beatles, i thought he wrote it. lol. oh well, its great. i'm out\r\nlater - justin >:o\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nMy guitar teacher tought me this song and I hated it before but since he taught it to me it just grew on me and I love it now.\n\n\n", "comment_33": "\nI love this song! It brings some sort of possitive karma! When I feel depress or simply just bumbed out after a hard day at work, or a family problem it just lifts your spirit just like it says, \"you were only waiting for this moment to arise.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\ni absolutely love this song, my dad was a huge beatles fan and this is one of the first songs i remember hearing. he used to sing it to me in the morning to wake me up. so it holds a special place for me. it just has such an easy sound to it. very mellowed. whenever i hear it, it's in my head for the rest of the day\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nYeah, my dad was also a HUGE beatles fan and still is, and  thats why i know and like the songs as well..... \r\nbut i guess it's like that for all of under 25..... \n\r\nTIP: nice to play on guitar!\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThe first time I heard this song was after years of suffering from depression, it made me feel so much better - like maybe someday everything would be okay. \r\nNow I listen to it whenever I'm having a bad day or things aren't going right. It never fails to help me find some joy.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nIt gets so old when people us posts and posts to get mad at other people for trying to learn something about the Beatles. I have seen very few people argue an incorrect point after another person on this site has said something different and validated it. Be happy young people can appreciate (or try to at least) the greatest band that ever was.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\n*use\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nblackbird was the first song i ever learned how to play on the guitar, and it continues to be the only one i can play consistantly well.  the first person that i ever fell in love with taught me how to play it...\n\r\nwhen i think about this song, i usually envision an actual blackbird kind of nestled into a tree.  the sky is a very deep dark blue, and dark gray clouds are kind of passing overhead, bright white stars peeking through sporatically.  the bird starts singing, even though its kind of stuck in its tree.  it's singing anyway, because it's stronger than its broken body, stronger than its physical self.  the blackbird is trying to get up enough courage to leave the tree and fly into the night, the uncertainty. perhaps the blackbird has spent many other nights like this, but never has it felt so strong. \n\r\ntonight will be its night.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nGreat song, Its simplicity makes it great. I'm using it as a poem in a declamation contest in my school.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nenglish people used to call black women \"blackbirds\" and during the 60s there was a lot of racial strife here in america, so Paul wrote a song to try to help out the african americans.  I think its awesome, a good song too.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nthis song is amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThis song is one of the best ever written, and I was ecstatic to hear Sir Paul perform it at his Back in the U.S. tour.  Before the song, he explained that in the 60â\u0080\u0099s, the Civil Rights Movement in America was getting a lot of press in Britain and generating international sympathy for the African Americans.  Paul wrote this for Rosa Parks, a black â\u0080\u009cbirdâ\u0080\u009d making her voice heard and trying to be free.  The images behind the band at the concert showed Dr. Martin Luther Kind Jr., Ms. Parks, and several images of protesters clashing with police.  It was truly moving.\n\r\nP.S. I really doubt that this song has anything to do with South America.  Sorry, gingersling.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nGreat song... and dont mean to put you down or anything song4julia, but it's not that hard on guitar, you just gotta get used to the travis picking and time changes (the time changes are easy though cause it flows really good)\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nokay this song is about the civil rights back in the 60's and paul had this in mind, and he also said that in england that we call girls birds and h e said i had this in mind don't you get it...african american lady....black bird ...\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nWritten by Paul on his farm in Scotland, the original inspiration was from a well-known piece by Bach, that he never knew the title of, that he and George used to play as kids. Originally Paul had in mind a black women, rather than a bird. These were the days of the civil-rights movement, something that Paul and the other Beatles cared passionately about. Consequently, Paul is really writing this song to a black woman, who was experiencing the many associated problems concerning civil-rights in the United States. Paul is saying to his woman (or any black woman) to keep trying, to keep the faith, and that there is hope. Rather than using specifics, Paul used a blackbird, that became symbolic so that it could be applied to any situation or problem.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\ni loved the beatles, they make me think of my childhood because my parents used to play there records when i was little and they still do and this was always my favorite song...wow...i never knew that this song was symbolic of civil rights...you learn something new everyday\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nthis is a really lovely song that just kinda makes u reflective about life. when i listen to it tho its usually when im in kind of a melancholy mood, its just kinda sad..The beatles are awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nOn Paul's 'Back in the USA' I specifically remember him saying that in England, they called girls 'birds'.  So in my opinion it is about a black girl trying to be free.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI always thought that this song was about growing up in a way...about how you wait and wait \"all your life\" for you to become old enough, and then you go into the uncertainty of it all, the \"dark black night\". And the light, well, I always thought it was whatever you wanted to do with your life...\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nwesley's right. i just watched that on dvd a couple of days ago. it's about the civil rights movement (brown vs. board of education) in the late 60's. great song\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\ni like the csn&y version beter\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nbeautiful song............nothing more, and the edgar allen poe thing, are you referring to the raven?\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nthis song is about black women getting rights.... bird is used instead of girl in England.. kinda like \"chick\" lol but Blackbird sounds alot sweeter than blackchick lol\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nThis is one of my favorite Beatles songs. I listen to it when I'm depressed(which is quite often) and it always seems to cheer me up. I think it's about being in a shitty situation and finding a way to \"fly\".\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nPaul McCartney said he wrote it about John Lennon after he died.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nBeautiful song... though I can't say I have an opinion on what it means. \r\nTo me the melody is just so happy and inspiring. I listen to it when I'm feeling down and I want a pick me up, the song makes me want to keep going. So innocent.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nthis song is about black people, wherwe now it isnt so bad, but in the 60s it was hard for a black person to get some freedom so the beatles made a song called BLACKbird ya idiots. you were only waiting for this moment to arrive? cmon ya dumbasses stop trying to conceal your racism and admitt that the beatles werent\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis song is about african american women in the 60s as  1Cancer said..i saw Paul in concert and he explained this to the audience.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\ni think this song means finding sense in a place were it wouldnt be considered, or finding a way in an unconventional direction.  meh, i find interesting meanings in songs...\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nthis song has got me thru some hard times....i love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nThis songs a great song to show off to other people on the guitar. It's pretty easy if you know how to fingerpick.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\ni am a blackbird!! i love this song its sooooo nice\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\ngorgeous song! enough said\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nit definatley is a gorgeous song and one of my favorites on guitar [when i first learned how 2 play it i had tropuble becuase i read the tab upside down ha ha] i never realy thought much of the meaing tho becuase i just focused so much on the guitar to get it right\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nthis song is one of my favourite beatles songs. when i heard it i decided to learn how to play the guitar just to be able to play this song, at that time to it seemed to be extremley difficult to play. so i made this song my goal, but (sadly) i learnt to play it two weeks later, so i never really got into playing the guitar after that. i guess i was a bit dissappointed by learning that what i thought would be the most complex song ever written, really was quite simple and unexciting. i still love listening to it, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nThis is one of my favorite of the many Beatles songs, and they've had so many great ones.  \n\r\nI'm sorry but I don't really think that the South America idea makes all that much sense.  \n\r\nThe lyrics, I've heard, are supposed to be about the problems that many African Americans have had to deal with in America as far as slavery and racism.  \n\r\nHowever, the lyrics are just vague enough so that anybody could draw personal inspiration from them, not just African Americans.\n\r\nOnce again: great song, great lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nIt is about the plight of African American women. In the 60's blacks were fighting for equality and women's lib was non-existent. So black women had NO voice.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\ni think this song kind of ties in with that other song \"she's leaving home\".  it's kind of like how she's free after escaping her lonliness.  they probably have nothing to do with eachother and are on two separate albums but it just makes sense to me that way.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nTHE GREATEST SONG EVER!!!! well, almost. It is so touching. So positive. It makes my heart melt every time i listen to it. i am a TOTALL beatles fan, and will be for the rest of my life\n\r\noh, gosh. my dad can play this song on the guitar. he does it so perfectly, im not kidding. i remember wen i would next to him and listen to him play it. every sweet, savory note. one by one flooding into my ears, and filling my tastebuds with the warmth and good feelings of the goodness in the songs heart. i absolutley love this song\n\r\np.s. i know that the song was written for the movement of rosa parks and stuff, but i think that its more than that. it can make anybody that is feeling sad or mad or upset, and turn them happy.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nThis song is amazing. I think I want it played at my funeral. I've also eard it was about the civil rights movement for African Americans.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nprobably the best Beatles song. great poetry...\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\ni wake to this album, and when this song comes on, i smile for a long long time. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nThe first time I heard this song, I listened to it for hours. The music is so beautiful, and the lyrics are so incredibly moving. I think it's about taking what you have, and making the best of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nPicking a favorite beatles song is really hard.\r\nBut this one I can say is my favorite.\r\nIt's just amazing.\r\nI can't even explain it.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\ngreat song and i can play it\r\nthumbs up\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThe song is about the Civil Rights movement in the US. \"Learn to fly\" - gain your freedom.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\ni like this song you can hear paul tapping his feet while he's playing.\r\nblack bird      fly\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nWhere I live in London a blackbird does, indeed, sing outside my bedroom window in the dead of night.  From about 3am to sunrise from March to June.  For me it's a sign of extraordinary beauty and hope.  I think the song means that a flash of unexpected beauty in a dark place can bring a person to life.  Sort of like sleeping beauty.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nthis song is really hard to play on the guitar, though i think that's been said already.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\ni think this is there best song...i can never hear this song to manny times\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nthis song is about moving on, growing up. Its very easy to play on the guitar\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nThis song is about a women of african american rationality. Its about Rosa trying to be heard and be free of racism agasint african americans.  I love this song, its beautiful, and is my all time favourite song.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nWhoa, I really like this song. The lyrics, the guitar, all of them! Oaul's voice is so good in this song. But I'd really prefer John with the vocals. But really, this is Paul's song and style and I like it. Haha. I hope there won't be racism anymore. It makes me sad. I don't like anybody stopping anyone because of their skin color. Totally useless.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nFor what it's worth, AbramGragh, this song was included on the White Album (1968).  John Lennon died in 1980, 12 years later.  And TigerArmyNeverDie... God help you.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nthis song makes me cry everytime.. it's more than a song to me.. *siggggh..\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nThis is my favorite beatles song.\n\r\nI just always thought of it as when hard times come be strong and everything will be ok.\n\r\nBut I dont know thats just what I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI'm 100% positive this song is about how the African Americans fighted to get their rights they deserve.\n\r\n\"All your life you were only waiting for this moment to be free.\"\n\r\nIn 8th grade, my writing teacher told my class the meaning of this song. He said that the blackbird was a metaphor and that it was written in the same time the civil rights movement took place. \n\r\nIt's too bad that all the people that wanted change and were just trying to make this world a better place were murdered. Such as King,Malcom X,Kennedy, etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nBlackbird is a great song. But I can't help but notice someone clapping or thumping... I don't know.. I could not place it. I wonder who is doing that? I'll be haunted forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI think this song is about someone who has nothing. John Lennon (i think it's him) is saying that he's giving them something broken. it's broken so if you or i had it, it would seem a bit rubbish because we're used to better things but to the person that has nothing it is amazing, what they've always wanted and means they can do what they've always wanted to do. Love the Beatles and wish they were still together - for most of them still alive even! XxX\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\n@ handsdown4dbeatles\r\nthat sound i thnk is paul tapping his foot, paul was the only person on the song(i think) so he's just filling in for a drum beat with his foot\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\ngreat song. im 13 and i can play this song perfectly on guitar. i love this\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nmy favorite one\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nthis song is gorgeous.my dad is a big beatles fan and i remember hearing this song when i was little and i still love it today. its simple, quite, soothing melody are brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nPaul was not tapping the beat with his foot.  That sound is a metronome.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nYes, it does seem to be about escaping some horrible situation. But the song isn't about a happily ever after- the place you're escaping to is just as dark. It's also about overcoming your past. \"Fly into the light of the dark black night.\" The dark black night doesn't sound full of hope and promise- but if even pitch black is lighter than where you are now, it's something you have to escape. It's also about learning to overcome your past- taking the broken parts of you and learning to still use them. It's all about salvage and change, and I love it because it echoes real life. Just because you break free doesn't mean you are free. it's a cold world out there.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nIt kind of remids me of the Civil rights movement. \n\r\nBut it was really sweat because I was feeling really sad and crying and my friend Jack played this for me on the guitar, and the whole time, everything I was feeling down about just kind of went away. It was really amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nPaul's mom was dying. I think this is about death. Paul is the only one who can sing about death and make it seem beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nwell in most literature both *birds* and *black* are signs of death, and telling the blackbird to fly away  (to me) is a metaphor saying 'don't let yourself die, instead rise above the pain (fly)'\n\r\n...maybe im reading into it too much though.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nI heard paul sing this at glastonbury a few years ago. First thing he said that was quite interesting was that back in the sixities the term 'bird' was another word used to mean 'man' or 'guy'. The song's meaning becomes self evident once you know that.  So, he was singing about the emancipation of the black man back in the sixites. Beautiful simple genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nthis is the most inspirational song \r\nit reminds me of walk on by u2 in a way\r\njust be strong and keep going even when you are down\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI agree with those who've said this song was written about the black civil rights movement, but I think part of what makes it such a wonderful song is the fact that anybody can draw their own meaning from the lyrics while still retaining the essential message of being strong when times are tough.\n\r\nThat said, I was reading Langston Hughes poetry for an English project when I came across this stanza (taken from \"Dreams\"):\r\n\"Hold fast to dreams\r\nFor if dreams die\r\nLife is a broken-winged bird\r\nThat cannot fly.\"\r\nDoes anybody else think this may have been part of the inspiration for Blackbird?\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nOne of my favoritest songs...this really hott guy played it for me on his guitar...the beatles really are amazing. I'm incredibly glad the Brittish invasion happened\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nTigerArmyetc.is right about Charles Mansons warped interpretation of this song(see also\"Piggies\" &\"Helter\r\nSkelter\")but otherwise he/she is totally fucked.Why is Manson still in prison?...maybe its something to do with him & his \"family\" being responsible for at least a dozen murders,including 8 months pregnant Sharon Tate,who they stabbed in the stomach! Oh,& just one small inaccuracy...he was trying to START a race war! I'm sorryTiger Army,but Charlie is the DEVIL & you need to grow up!\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nafter reeding the comment above me i went back to reed the comment that TigerArmyetc wrote i have no clue how he/she got all that evel stuf from such a good song but i defently agree with the person abuve me in saying ...TigerArmyetc what the fuck is wrong with u man\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nI heard a story, perhaps apocryphal, that late the night after Paul's wedding, he opened a window and serenaded the fans outside with this song.  Besides the already stated connection to the American Equal Rights movement, the song has always seemed to me to represent the ability in all living things to recover from previous pain and injury and take ourselves into a new  phase of our lives.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nTo me this song helps me through the darkest nights of uncertainty and depression. It helps me remember, I may a broken wing, but it WILL heal, and I WILL learn how to fly.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nSo. I don't really care what it's actually about.\n\r\nWhen I hear this song I see a father or other guardian bestowing his own wings on to a son, thereby sacrificing his own freedom, his own life to enable the next generation to live.\n\r\nthe singer is passing the baton to the next runner, if you catch my drift.\n\r\nand he's sad about the sacrifice but he rationalizes it by saying (A) death is inevitable and (B) the kid deserves it, has earned his freedom.\n\r\nthe dark black night in my scenario symbolizes the world. and the light of the dark black night is the positive, the freedom, the good qualities of a frightening, dangerous world.\n\r\n\"all your life you were only waiting...\"\r\nthis part means that the subject, the child, his life up to that point has been preparation for taking the elder's wings and learning to fly for himself.\n\r\nbut I couldn't tell you why he's a blackbird.\n\r\nexcept that perhaps the singer realizes that even his offspring will die and is doomed to make the same passage that the singer himself is going through.\n\r\nso yeah. passage into adulthood, passage into death, and filial love are the themes in this song for me.\n\r\nso yeah. that's what it is.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nisn't \"bird\" britslang for girl or woman, not man?  oh well, I suppose that it easily could've been forty years ago.\n\r\nthis song is so beautiful in that you can delve into deeper meanings, but you don't have to in order to appreciate the lyrical and emotional aspects of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nWhen you don't know how to play it, it's rather irritating. In my opinon.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nI love this song, and I agree that though its been said that it was written concerning the civil rights movement, I think it can really mean a lot to many people in different ways. It's also a really easy song to learn (first song I learned on guitar) which makes it a lot of fun to play and sing.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nI actually hear that its not his foot but a simple metronome tapping? My guitar teacher told me that though so it could be hogwash for all I know =]\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nI hope I get a response...\n\r\nIs this song inappropriate to use at a wedding for a father-daughter dance? My father and I have a disconnected relationship. I can't see using one of the mushy songs that talk about love, heros, daddy's little girl, etc... because my father moved out when I was a teen, and prior to that he \"worked\" a lot, so didn't get home until very late and we didn't get to do much together. However, one of my fondest memories of him when I was a child was sitting in the living room and listening to him play this song on the guitar.\n\r\nDo you think guests will be thrown off, because of the songs ties to the civil rights movement?\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nTo me...this song is really inspiring. I feel like its just saying to keep on going, keep fighting through the problems or shitty stuff in your life.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nThis song is inspired by Rosa Parks.\n\r\nAfter almost 32 years I learned to play it but I use the DADGAD tuning. \r\nR.D. (Holland)\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nAmazing song!\n\r\nAnd to Nov07, definitly a good song for your dance if it hasn't happened already. It's not amazingly obvious that it's based on ideals from civil rights movements. I really think anyone can enjoy this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nMy dad use to play this to me when i was little , then he passed away shortly. But when i listen to it this song it just reminds me of him. But sometimes i can hear him singing it to me in my head.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nI'm planning on maybe singing this to a friend one day...on the last day of year ten.\r\nHmmm...anyway, beautiful song. One of my favourites.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nwell the situation i am in this means take a bad \r\ntime and learn to make it better, i am almost homeless\r\nand when i heard this song it helped me alot\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nSoooo describes my life!!!! Love it!!! :D\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\ni heard this song in the movie \"I am Sam\" and it was beautiful!the movie and the song are amazing.buy the soundtrack for the movie. its incredible!!\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nit is about taking something and making it into something more.basically building something out of nothing.you wait and wait but nothing is going to happen unless you make it happen.and blackbird singing in the dead of night means a calling.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\ni have no doubt this song was for a certain someone or group of people. i know it was meant to give hope, and tht something to look forward to, \n\r\n\"blackbird singing in the dead of night\" -\r\nheard by only those people who were listening/waiting for it.\n\r\nor thats wut i think...\n\r\nits just beautiful how the birds chirping is incorperated into the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nes sobre el pajarito que tengo al lado\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI heard that this was one of the songs that Manson interpreted to mean that the black race was going to rise up against whites. I don't think that's what the Beatles intended for the message to be. I think that they just meant that people who are oppressed need to find hope in something and strive to be free. I think they used the term blackbird to symbolize a dark or grim situation, or it could be directed toward a specific group with just enough ambiguity so it can be generally interpreted by anyone.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nI think this song is about how you can still \"fly\" or go on in life if you just learn from your mistakes and everything will be okay. The Beatles are so amazing. No one compares to them(:\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nThis is one of those songs that makes you sad when you listen to it, but makes you feel at peace afterwards\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nmaybe you already know this:\r\nwhen black people from Africa were brought to work as slaves to other countries, they used to call them as 'Blackbirds'. That's what this song is about..\n\r\n\"All your life\r\nYou were only waiting for this moment to be free.\"\n\r\nI think it obvious when you know what blackbird means.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nhmmm..not really sure wht this means ?\r\nbut i do love this song\r\nit makes me so peacful when i hear it.\r\ni like the cover version to by sarah mcglaclan ?\r\n:]♥\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nTo me this song is about being someone different that everybody else and using what your disadvantages and making them your advantages \"Take these broken wings and learn to fly\". It's about someone who's waited they're whole life to shine but in order to do that they have to go into the unknown. To me its about that one great moment we all wait for, when all the other stuff dont matter anymore. When were free.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nI love where the song fades out and you think it's over and then the guitar comes back into it and even when it ends I still want more!\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nI'm learning this song on the guitar right now. :]\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nMy dad used to play this song on his old record player for me EVERY night before i went to bed. I love it so much! :-) I always will love this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nHey I have a question, what is that tapping sound in this song along with the guitar? Or am I just imagining it?\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nthis song says to me one thing: \"GET UP AND GO, YOU CAN DO IT!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nIt's about oppression (for whatever reason) meeting opportunity and having the courage to take the path to hopefulness.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nthis song makes me cry sometimes. I think its about someone trying to get away from something bad and they sleep at night wishing they could just break away.Then they finally fly away or get away from what ever it is oppressing them.Good song\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nOn one of his DVD's I can't remember which one, possibly 'Back in the U.S.' Paul was saying that when he wrote this song there was the trouble in the U.S. regarding civil rights.  He said that sometimes women were referred to as 'birds', so basically he was saying blackbird = black woman.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nthe first time i heard this i thought it was the brokeback mountain song because of those small intro chords at the beginning.\n\r\nsame notes crazy eh? lol\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nI guess i'm just weird but this song doesnt make me happy...it kind of makes me sad. i dont know why, considering the fact that the lyrics are so inspiring. but its kind of melancholt to me.\n\r\nps i was reading te posts from circa 2005--a word of advice: don't start your post with the words YOU ARE ALL WRONG I KNOW ABOUT THE BEATLES BECAUSE [insert argument here]. This doesn't help.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nThis song is really simplistic and wonderful. I love the constant beat in the background. It is a perfect mellow song.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nwhen i read this was written about civil rights i was surprised. i always thought it was about death. the song just reminds me of some beautiful song you might hear at a funeral. maybe that mixed with my literal-taking of the \"ALL your life\" bit. anyway, beautiful song. <3 the beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nActually, according to the person who penned the song, John Lennon, it is about a black woman living in Liverpool who everyone used to ridicule and abuse. Like most songs that John Lennon wrote they are about his childhood.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nActually, Paul McCartney wrote this song, and it's credited as usual to Lennon/McCartney. I saw Paul McCartney in concert a few years ago and he performed \"Blackbird.\" He introduced it by saying he wrote it in response to the civil rights movement in the US, and it's specifically addressed to women -- \"bird\" is British slang for a girl or woman.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nI always thought about it as someone who is having troubles using the things he has been given. And he just want to be someone else or be in a completely different life situation.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nI always thought about it as someone who is having troubles using the things he has been given. And he just want to be someone else or be in a completely different life situation.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nThis song puts me in a strange mood.\r\nI love this song, I have had it stuck in my head for a few days.\n\r\nI think of it as someone hurting, someone alone. Taking their pain and making it who they are.\r\nIt's my lullaby, and it always has been.\r\nIt's what I live by. \n\r\nI must sound crazy, but this song is a huge part of my life.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nwhat a beautiful song this is! \t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\n *AWESOME!!!* The \"Blackbird\" in the song parallels our Human struggle/triumph of Life \r\nwith a Bird learning how to Fly! \"Take these broken wings and learn to fly. All your life, \r\nYou were only waiting for this moment to arise\" \"Blackbird fly, blackbird fly.\"\n\r\nThe song's complexity lies in the simplcity of the words. I.E. Conceptually, there's alot \r\nsaid in a little amount of words. I Always loved Paul McCartney & Wings as well as The Beatles.\r\nTheir music really moves me. I can personally relate to this song. It's a mantra for all\r\nhumankind.\n\n\n", "comment_150": "\nThis is...the only song my father knows how to play on his guitar. xD\n\r\nAnywho, I think this song is about seizing a chance you've been waiting for, instead of simply waiting for it to happen.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nI always thought this song was about Martin Luther King Jr. struggling to bring peace between races\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nMost of the descriptions of this song are thoughtful and beautiful and insightful. As for me, I envision it as I did as a kid. A song about a lone blackbird perched in a tree at night. Getting strength to fly into the night. \n\r\nSo beautiful, this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nPersonally, I think songs take on new meaning with every generation that embraces them. Originally, they intended this song to be about equal rights for African Americans when it was written. But as this issue was supposedly resolved, this song takes on a new face. The face of dreamers. The face of kids that have been bullied to tears. The face of spouses in struggling marriages. The list goes on and on.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nI just love this song. I heard it before the Glee episode but I never really thought about it (sad I know) but I really lovelovelove it now :) <3\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nI saw Paul Sunday in Detroit and he said he wrote Blackbird about the civil rights struggle in the Little Rock, Arkansas school district.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nSgt. Popgrass has a hip version of this one Banjo and all...\nsoundcloud.com/sgtpopgrass/…\n\n\n", "comment_157": "\nPaul likes to play words, I don't think he's doing that up front but it is in him to play, I'd say the plight of Blacks and all peoples are expressed. The acoustic guitar riffs he play's are as good as it gets, just astounding. added with lyrics this is Paul at his creative best, When it came out I couldn't believe it such a haunting song. When I begin to play that song  everybody stops and turns to see and listen, its been that way since the sixties\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nJohn Lennon wrote this, and it is characteristically metaphorical, enigmatic, deep and speaks to social justice. \n\nFirst, some questions:\n\nQ01. Why is it a blackbird and not a hawk, falcon or eagle that are superior birds of flight?\n\nQ02. Why is it a blackbird and not a bluebird or redbird?\n\nQ03. How can a bird with broken wings fly?\n\nQ04. Since birds are born with the ability to fly, why does the bird need to learn to fly?\n\nQ05. Why does the bird learn to fly all its life and not just once?\n\nQ06. Why was the bird waiting for this moment to arise?\n\nQ07. What do sunken eyes represent?\n\nQ08. How can sunken eyes learn to see?\n\nQ09. Since birds are born with the ability to see, why does the bird need to learn to see?\n\nQ10. Again, why all your life and not just once?\n\nQ11. Given the parrallelism, what is the connection between flying and seeing?\n\nQ12. Why was the bird waiting for this moment to be free?\n\nQ13. What is the light of the dark black night?\n\nAnd then, some answers: \n\nA01. The blackbird is a commonplace bird that represents ordinary human beings with ordinary abilities. \n\nA02. The bird is black because it is esoteric. \n\nA03. The broken-winged bird does not fly physically in body but psychically in spirit. \n\nA04. The bird must learn to fly because it is not external physical flight, but internal spirit flight, contrary to societal indoctrination.\n\nA05. The bird must learn to fly all its life because it is the real life of non-physical spirit and not the illusory life of physical matter. \n\nA06. The bird was waiting for this moment to arise because it had to overcome social conditioning and its repressive values, attitudes, beliefs and unexamined assumptions and presumptions. \n\nA07. Sunken eyes represent tunnel vision, blinkered vision, restricted vision, distorted vision, limited vision. \n\nA08. Sunken eyes can learn to see non-physically, internally, within, psychically. \n\nA09. The bird must learn to see because it is not external physical sight, but internal non-physical sight, contrary to societal indoctrination which is a heavy burden and constant distraction. \n\nA10. The bird must learn to see all its life because it is the real life of spirit in the ever-present now and not the illusory life of matter.\n\nA11. Flying and seeing (flight and sight) are both metaphors for the meditative state of consciousness, a/k/a cosmic consciousness. \n\nA12. The bird was waiting for this moment to be free in the sense of the inner freedom that results from inner vision and the flight to higher consciousness.\n\nA13. The light of the dark black night is the sourceless light, illumination and enlightenment that can result from personal, first-hand, immediate, unmediated, existential experience of the innermost center of being, whereas only darkness and blackness appear on the external surface. \n\nIn summary, every human lifetime on Earth begins with a veil of amnesia that can be penetrated with the practice of meditation to reach the state of meditative consciousness. Everyone is always illuminated in spirit, just they don't remember it. \n\nThe Blackbird song is a celebration of freedom and joy, no less than Beethoven's Ninth Symphony, Final Movement, Ode to Joy a/k/a Ode to Freedom. \n\nwww. youtube. com/watch?v=kbJcQYVtZMo [remove spaces] \nFlashmob Flash Mob - Ode an die Freude ( Ode to Joy ) Beethoven Symphony No.9 classical music\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nThe love of song goes on and on and on...\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nsongfacts.com/…\n\n\n", "comment_161": "\nen.m.wikipedia.org/wiki/…\n\r\nThis was the link I meant to post look under meanings\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nI like this song as an insomniac :) especially with the morning break of birds singing.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nEvery Time I go to England I hear blackbirds singing and it reminds me of this incredible song. I read a book called Blackbird by Paul McCartney and he said the song was about the Civil Rights movement in America.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nAt my graduation ceremony, this guy (who goes to my school) played this song on the guitar on the stage.. Ahh.. I was like \"YES! I love you. *sigh*\"\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nEVERYONE IS WRONG!!! im the only one thats right i did extensive research on the beatles when i was a sophmore in Highschool what this song is saying is it was telling Charlie Manson that there was gonna be a race war and to be come prepared that the blacks were gonna RISE UP and OVERCOME thats basically what this means that the blacks will try to take the planet earth for them selfs they will kill all whites and everyone else i dont know why Charlie Manson is still in prison he was trying to stop the race war and the government is punishing him for it and they are wasting our tax money on him he was trying to stop the blacks \r\nThe family was the best thing to happen Charlie is GOD\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nI have a game for you. Read \"The Present\" at truthcontest.com, then listen to this song again, and see what you think. ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nONE OF THE MOST BEAUTIFUL COVERS OF IT IS THE ONE DONE BY CORINNE BAILEY RAE AND HERBIE HANDCOCK. I THINK THE MESSAGE IS FINDING A WAY TO OVERCCOME THE  DIFFICULTIES OF LIFE  AND FINDING THE STRENTGH IN YOURSELF TO FLY ABOVE THEM.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nI love this song.  I always thought it was trying to say that even when you're weak you need to keep trying.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nThe song is extremely simple and can be interpreted as anyone wishes to see, however the true nature pertains to the Rock n\" Roll movement.\n\r\nRock n' Roll was cocked & loaded as the invention of the radio ripened to a substantial potential, reaching a mass numbers of listeners worldwide.\n\r\nAt this moment, it was fired upon the world, attracting millions to the new sound, and in its wake, engulfing open minds with it's message. In the beginning the message was \"good times, dancing, and fun\", but we all know Rock n' Roll (and other spawns of the movement like Hip Hop and Pop) snowballed into a barrage of \"sex, drugs, and immorality\" which, along with technology to empower the spread, has led society into it's Godless nature. \n\r\nThere's always been Evil, but by this, it was fueled to run rampant to a point where we wonder \"what is going on in this world?!?!\".\n\r\nThe Blackbird, symbolizes the dark side buried within us. It is being encouraged to \"arise\" \"at this moment\" (when Darkness has overcome it's boundaries) and see a new way of life, \"free\" from the limitations of following God's Law: \"flying to the light of the dark, black night\".\n\r\nShould I remind you, Lucifer is known as the \"Prince of Light\", and in some perspectives the giver of free will. \n\r\nIn Audio Only this can translate \"into the light of the dark, Black Knight.\t\t\t\t\n\t\t\t\t\n\n"}