{"comment_0": "\nI get the impression that the singer is trying to \"repair\" the burned bridges between himself and someone he cares deeply about. He is willing to sacrifice everything to make things right again. \"So I bare my skin and I count my sins\" give me the image of someone removing their shirt to receive lashes, and each lash represents one crime against the other person. He is showing repentance for his sins. \"So I close my eyes and I take it in\" represents trying to forgive himself so that they can move on. Of course, I connect with that interpretation so that could be why I chose that approach.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nTo me, this song is him singing to someone he loves who is going through pain.\r\nI don't think he literally means bleed when he says \"bleeding out\". \n\r\nHe loves this person so much, he is saying, I will take your pain. I will give everything (bare my skin), and I'll own up to everything I've done (count my sins) and I'll feel your pain for you, so you don't have to feel it anymore.\n\r\nI don't think this song is about self-harm, mostly because of the line \"I will be your scarecrow\". He's saying there that he will chase away all of the darkness that's coming into that person's life.\n\r\nJust how I hear it!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI love this song!\nMost people feel that it's coming from depression and a will to harm others by your personal pain. I however feel that this is something much more encouraging and uplifting!\nHe's singing of self sacrifice for someone or others he cares about.  He knows that if he's going to bring someone down even to the last breath, he'd rather die.  He is putting his life out there, willing to live, to the last drop of blood, for the life of the other.\nWhen he says \"Innocence is gone and what was right is wrong\", he realises that his wrongdoings and misunderstandings of what is right in life have been shown for the falsehood in which they live. How can he live with his nature if his nature is so twisted?  Another thought is that he sees himself as the \"one who knows\" and the \"right thing\" (looking the other way, or \"just living\" regardless of the internal destruction to others) is now the \"wrong thing\".\n\nI have so much more I could pick out of this song, but I'd need a lot more space... ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThe line is \"So I bear my skin,\" not \"So I peel my skin\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nAmazing music and great band!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think the song is talking about self-harm and suicide. I think he wants to commit suicide because he feels like he is ruining someones life. He thinks he is the reason everything is going wrong in their life. \"If the last thing that I do is bring you down I'll bleed out for you\" sounds like its saying \"if I ruin anything else for you, I will just get rid of myself because I ruin everything\" Its a very good song...but it does seem like a very depressing one. \n\nThats just what I think! =}\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI'm obsessed with this song after hearing it the first time yesterday. Maybe I'm weird, but I find the lyrics both to be beautiful and tragic. The lyrics \"But innocence is gone and what was right is wrong,\" seems like you do something you realize is bad but it's too late too turn back. I just feel like this song is a transformation from innocence to 'corruptness,' whether it's cheating, your first drug or something small. \n\nEither way you interpret it, it's an amazing song.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI love this song for a lot of reasons. And one is that- to me anyways- this song has some anger to it and I love how that mixes with all the other aspects of this song \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think this song is basically about someone going through self harm who has a person close to them that is trying to help them but they fail constantly (they self harm). Or just about someone who is going through self harm because of certain pain someone has given to them.\n\nThis is how I see it:\nI'm bleeding out\nSaid if the last thing that I do\nIs to bring you down\nI'll bleed out for you\nSo I bare my skin\nAnd I count my sins\nAnd I close my eyes\nAnd I take it in\nAnd I'm bleeding out\nI'm bleeding out for you (for you) --> may also be a ritual for someone who self harms. \"So I take the blade, remember everything I've ever done wrong, close my eyes and take the blade into my skin (cut), and I bleed\" and then \"I bleed because you caused me so much pain\" (maybe)\n\nWhen the day has come\nBut I've lost my way around\nAnd the seasons stop and hide beneath the ground\nWhen the sky turns gray\nAnd everything is screaming\nI will reach inside\nJust to find my heart is beating ---> Everything is going downhill in his life and he feels numb (reach inside just to find my heart it beating). Self harm is also an escape for numbness, just to feel something.\n\nYou tell me to hold on\nOh you tell me to hold on\nBut innocence is gone\nAnd what was right is wrong ---> He holds on to someones words, but he can't stop.\n\n'Cause I'm bleeding out\nSaid if the last thing that I do\nIs to bring you down\nI'll bleed out for you\nSo I peel my skin\nAnd I count my sins\nAnd I close my eyes\nAnd I take it in\nAnd I'm bleeding out\nI'm bleeding out for you (for you)\n\nWhen the hour is nigh\nAnd hopelessness is sinking in\nAnd the wolves all cry\nTo feel they're not worth hollering\nWhen your eyes are red\nAnd emptiness is all you know\nWith the darkness fed\nI will be your scarecrow --> It happens mostly at night. And this is a nice explanation for anyone who wants to understand what goes through a depressed person's mind. \"When your eyes are red\" - Crying \"And emptiness is all you know\" - You're empty, numb, unable to feel or be happy \"With the darkness fed\" - Depression makes you do \"sick stuff\"\n\n\nJust my personal opinion, as someone who used to self harm and went through depression i find this song relatable, anyways, beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis is one of my favorite songs! IT makes me feel so happy!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI think the person reflected on this lyrics is at a very low point, depressive frame of mind and letting the other person see him at his worst (\"bleeding out\", figuratively speaking, people. Not everything has to be literal. He said, \"If the last thing that I do is bring you down, I'll bleed out for you.\"). I feel his intentions are to affect the other person enough so they can be equally miserable (for lack of a better word) and, therefore, bond through that misery given to this newfound understanding of each other. (He said, \"When your eyes are red and emptiness is all you know, with the darkness fed, I will be your scarecrow.)\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song is about Depression, Cutting, and Suicide. Its not encouraging any of them, just telling a sad story about giving up. Its a Suicide note. \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nFollowing the \"saving someone else\" theme, The line \"If the last thing that I do/Is bring you down/I'll bleed out for you\" could be taken as getting someone down off a ledge, or window, and if he does, he'll help them through their pain.\n\nJust a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nIn this song I believe he is talking about pretty much giving everything he has, including his body, to the one he loves in order to keep them alive and well. Protecting and driving away any and all darkness from the person he loves most and taking there pain for them. That person, despite being depressed is loved by this person enough for him to want to protect them from anything and everything.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nFirst of all who writes what they \"think\" are the actual lyrics? So many mistakes. Anyway, like many songs it can have different meanings to different people. For me it's about bipolar disorder. I do my best to keep the darkness in me from hurting the one I love. Most of the time I just want to end the pain through suicide. I keep bleeding out or just suffer through it for the sake of being there for my loved one. I'm her scarecrow that protects her from my pain and darkness inside. \" if the last thing I do(suicide) brings her down, I'll bleed out (suffer through the pain) and take it in. \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI think it's about being in love with someone who's abused the love and has left you - but you'll still bleed out for them, provided that before you do you - bring them down, and let them know what they've done, in the hope that they'll tell you to hold on, but at the end of the day, you're the one that's there for them, not the other way around\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis song reminds me of that moment in the movies or books when the hero is appealing the good side of a villain, and it actually works (think darth vader and luke skywalker in star wars). The villain \"reaches inside\" to \"find his heart beating\", and realizes that at this point the only way to help the hero is to sacrifice themself. \"you tell me to hold on\" might refer to the hero trying to save the reformed villain's life, but the reformed villain knows that their actions have saved them, and find some peace in doing good before they die. Sounds strange, but just what I think of when I listen to this.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI love his voice!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nFOREWARNING THIS IS THE FIRST TIME I HAVE DONE SOMETHING LIKE THIS\nMy interpretation : I don't know why but this seriously reminds me of a bad relationship. (in parts) mainly where it says so bring me down I bleed out for you.\n\nthere is also the references to self harm, which you can really notice in the lyrics So I bear my skin \nCount my sins (thinks about everything, which generally follows into the mood of self harm) \nClose my eyes and take it all in (your arm (etc) is hurting like mad and you immediately feel slightly better, having that slight distraction from your thoughts which is the main problem) \n. \n\nThis is taken from what it means to me, and though this is probably not very accurate, but well it is My Interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think it's about a relationship where both sides give everything and it's still not enough. They still fight, bleed and end up losing everything to the other person. It's still love.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI'm a christan so in a way I feel like this is Jesus on the cross making up for the sins (can't think of how I should say it right now) so he just closes his eyes and lets the pain come to him to let everybody know they'll be okay (I know I'm weird)\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nSo, real quick addition that might not be as interesting to ya'll as it was to me. Something I've noticed is that, in the official lyrics (far as I can find), the portion of the song that has 'So I bear my skin,' uses that exact spelling of the word 'bear'.  Bear, as in- to take up, to heft, not as in, Bare- to expose, etc. To me, that small difference means a lot. Idk though.\n     ( (then again I struggle with disassociation, and it hits a rather personal note with the meaning of 'bear my skin' in mind. To me, the song is about the self-sacrifice of struggling with mental health for other's sakes. It reminds me of someone being willing to keep feeling the pain, and to keep living for their loved ones if that makes any sense??. Anyhoo, rather abstract comparison, (don't judge me plz!!))\n I personally find a lot of enjoyment in the song Because it Can be interpreted so many ways. The meaning in the lyrics is very interwoven and layered, and I don't think there is a 'definite' or 'right' interpretation at all hah\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThe first lyrics he sings is the second paragraph in the lyrics written. (at least in the version I have)\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI think this song is about self harm and depression, especially when he sings \"So I bare my skin, and I count my sins, and I close my eyes, and I let it in\" I think he means realizing all the mistakes you've made and letting in physical pain to get rid of the emotional pain. Also when he sings about the 'skies turning gray' and all that stuff, it just screams depression to me, feeling lost and feeling like the only way out is to bleed it all out.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nIt sounds to me like he's passionate about repenting.  You'd have to have been to your own personal Gethsemane to understand.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI think the lyrics mean he loves somebody and he will bleed out and do anything just to be with them.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI believe this song is about all the pain, sins, and bad choices you make you can bleed them out for someone you really love.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nAs with any song, i think this one can have multiple interpretations. Personally, i think its about someone who has maybe had enough of something (maybe being bullied, or drama, or-- most likely--a specific person) and either cuts themself for it, for attempts suicide. But i dont think the speaker is really sad, so much as angry and tired of things going wrong. \"If its the last thing that i do, I'll bleed out for you\". I take this line to hold some conviction. They want the person (if a person is the problem) to know that they're done with life and that they are to blame. Ive tried closing my eyes and listening to this song, and it always kind of strikes me as the speaker trying to, with their last effort, make whoever is causing them distress feel guilty.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI think this song is about Jesus dying for our sins - it's also about His saving grace.  \"I will be your scarecrow\"...\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI think this song is about how he's giving all he can to the person he loves, but the person is telling him it's not enough. He's trying to do everything for that person, and even though she is telling him it's not enough, he's just going to keep on giving her whatever is left of himself until he has nothing left to give.\n\nI believe it's all about being so devoted to someone that he stops thinking about himself and his entire world becomes that person he's devoting himself to, no matter what she does or says to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song speaks to me in a religious way. The song reminds me of my inner struggle to do what is right and not give into temptation.\r\n\"Is to bring you down\" The last thing I want to do is fail God. \r\n\"I'll bleed out for you.\" I'm willing to \"bleed out\" and be washed anew by His forgiveness.\r\n \"You tell me to hold on.\" When I'm tempted to stray from my faith I think of His promise to provide for those who follow His word.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI know this has been said before, but for me this song is about depression. 'I'm bleeding out' is literally blood. And the bit after that, the last thing part, that's kind of like he wants to get revenge on someone. 'Count my sins'? That's how many times he cuts. At least that's sort of how it works for me. One of the people I used to know before I moved knew about what I did, and they would tell me to hold on and not kill myself, because there were people who cared for me. After I moved away, we lost touch. And now I'm stuck with some of the worst people in my life. One person who I used to call my best friend betrayed me completely. This song really strikes home for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nthere is not a right interpretation, its about how you ,your feelings , your life experiences, and where you are when you read the lyrics.\nI loved all of the interpretations I  have read, and can identify with all of them!!!!!!!!!!!!!! Anyhow I just love this band and their music because they sing about real struggles of every day life that  some of us have gone/going  through\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI think that this song is about missing someone that you love, but the person is dealing with depression and doesn't want to bring them down. \"Bare my skin\" line I think is about self harm.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nDon't know if I'm looking into it too much, but I personally think that this song is about Christ, specifically His Atonement and death on the cross.  The song is sung from Christ's point of view.  It talks about bleeding out for someone else, taking in sins, being told to hold on despite the pain, the world reacting to this event in several ways, there's even the line that says, \"I will be your scarecrow.\"  Scarecrows are used to ward off birds like crows and ravens, both birds symbolizing evil.  Also, you always see scarecrows with their arms completely stretched out, and their legs together, just like Christ's arms and legs when he was hanging on the cross.  Some of the members of Imagine Dragons are Mormons, who are Christians, so it makes sense that this is what they could have meant when they made the song.  It really adds a beautiful meaning to the event of the Atonement, while also capturing the agony and pain that Christ must have went through when it happened, based on the heavy elements and strong beat of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI personally believe this song is about Christ's death on the cross from Christ's point of view. It's just my interpretation, but here is why I think this.\n\n*Chorus*\nI'm bleeding out\nSaid if the last thing that I do \n- before Christ dies\nIs to bring you down\nI'll bleed out for you (sinners)\nSo I bare my skin \n- he was stripped of his clothes\nAnd I count my sins\nAnd I close my eyes\nAnd I take it in \nAnd I'm bleeding out\nI'm bleeding out for you \n- Even though he was sinless, he knows he was put on this earth to save the human race and must die on the cross (\"bleed out\") to achieve this. The line \"I'm bleeding out for you\" is meant to reference that he died to save each and every one of us (even you).\n\nWhen the day has come \n- The day he was betrayed by Judas\nBut I've lost my way around\nAnd the seasons stop and hide beneath the ground\nWhen the sky turns gray\nAnd everything is screaming\nI will reach inside\nJust to find my heart is beating \n- He is nervous and scared about going through with sacrificing himself\n\nYou tell me to hold on\nOh you tell me to hold on \n- God is reminding Jesus that he must go through with it\nBut innocence is gone\nAnd what was right is wrong \n- Even though he has done no wrong as he is sinless, he was arrested and tried as a criminal and sentenced to death on the cross (which was a common method the ancient Romans executed their criminals)\n\n*Chorus*\n\nWhen the hour is nigh\nAnd hopelessness is sinking in\n- He is getting ready to die\nAnd the wolves all cry\n- The chief priests and the elders calling for his execution\n\nTo feel they're not worth hollering\nWhen your eyes are red\nAnd emptiness is all you know\nWith the darkness fed\nI will be your scarecrow\n- His death is meant to be your saving grace. Even in darkness he will be your light. The line \"I will be your scarecrow\" is a metaphor. Similar to how a scarecrow protects a farmer's crops from crows, the death of Christ is meant to protect you from all the evil in the world. In addition, the way Christ was positioned on the cross (arms stretched out) is similar to the pose of a typical scarecrow.\n\nI'm bleeding out for you (for you)\nI'm bleeding out for you (for you)\nI'm bleeding out for you (for you)\nI'm bleeding out for you\n- Christ sacrificed himself for all sinners, even you.\n\n*Chorus*\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI'm not sure. I mean, I think the cutting interpretation is correct, but the first time I thought about the song I thought it was about someone willing to sacrfice himself, and his last act is to bring the other down. Make him suffer with him.\nI'm may be wrong, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI agree with the self-harm theroy, as a self harmer who is trying to recover it certianly speaks that way to me, but I dont think that is the only way to interpert it. Like the line, \"But innocence is gone and what was right is wrong\", that applys to me a lot. My parents were spliting up, and my mom hated my dad, and wanted me to hate him too, while I wanted to forgive him, and she yelled at me so much for that that forgivness, which I knew to be right, seemed to become wrong, because I was being punished for it. Thats just me, but I think as with most songs, everyone will interpert this song a little bit differently based on where they are coming from.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nSome people are saying this song is about suicide and cutting, but I disagree. I think this song is the battle cry of sorts for friends or partners to rise up and protect the ones they loveâ\u0080¦and I think it uses a Biblical allusion to convey that message.\n\nI have to preface this by saying that this song is ambiguous. It could mean completely different things to different people, and thatâ\u0080\u0099s part of what makes it so personal.\n\nI think the song alludes to the Crucifiction to call friends out to sacrifice for one another. In a way, itâ\u0080\u0099s a cry to be more like Jesus in his willingness to sacrifice despite the pain. (A couple of the band members are Mormon, so this meaning is certainly possible.)\n\nItâ\u0080\u0099s not going to make much sense unless we look right at the lyrics, so letâ\u0080\u0099s dive right in.\n\n1) â\u0080\u009cIâ\u0080\u0099m bleeding out / So if the last thing that I do / Is bring you down / Iâ\u0080\u0099ll bleed out for you / So I bare my skin / And I count my sins / And I close my eyes / And I take it in / Iâ\u0080\u0099m bleeding out / Iâ\u0080\u0099m bleeding out for you, for you.â\u0080\u009d\n\nThis is the cry of Jesus â\u0080\u009cbleeding outâ\u0080\u009d on the cross as the â\u0080\u009clast thingâ\u0080\u009d he does (while in the flesh, of course). He â\u0080\u009cbare[s]â\u0080\u009d his skin to the lashings and â\u0080\u009ccounts his sinsâ\u0080\u009d (which are exactly none).  This could also apply to an individual whoâ\u0080\u0099s â\u0080\u009cbleeding out,â\u0080\u009d or sacrificing something, â\u0080\u009cfor you,â\u0080\u009d his friend. He exposes himself when he â\u0080\u009cbare[s]â\u0080\u009d his skin and â\u0080\u009ccounts his sins,â\u0080\u009d ready to â\u0080\u009ctake it inâ\u0080\u009d to save his friend.\n\n2) â\u0080\u009cWhen the day has come / That Iâ\u0080\u0099ve lost my way around / And the seasons stop and hide beneath the ground / When the sky turns gray / And everything is screaming / I will reach inside / Just to find my heart is beating.â\u0080\u009d\n\nYet another Imagine Dragons song with a post-apocalyptic feel. This also feels like how a depressed individual might view the world, so I can see why people may misinterpret the song as one related to depression and self-injury. This could also be how Jesus felt on the cross (with everyone laughing or â\u0080\u009cscreamingâ\u0080\u009d at him and the seasons and sky fading, like they know what it means that his end is near). Itâ\u0080\u0099s a little extreme of an interpretation, but it could fit. What would fit better yet is a more human explanation. When the individual feels â\u0080\u009clostâ\u0080\u009d and feels like all is coming to an end, he will remember what he holds dear to him, in his â\u0080\u009cheart,â\u0080\u009d and keep up the struggle.\n\n3) â\u0080\u009cOh, you tell me to hold on / Oh, you tell me to hold on / But innocence is gone / And what was right is wrong.â\u0080\u009d\n\nThis feels like Jesus crying out on the cross, as well, doing what is â\u0080\u009crightâ\u0080\u009d in saving us by doing what is â\u0080\u009cwrongâ\u0080\u009d in being crucified despite lacking sin.\n\n4) â\u0080\u009cWhen the hour is nigh / And hopelessness is sinking in / And the wolves all cry / To fill the night with hollering / When your eyes are red / And emptiness is all you know / With the darkness fed / I will be your scarecrowâ\u0080\u009d\n\nYouâ\u0080\u0099ve found my favorite part! Iâ\u0080\u0099m a sucker for the word â\u0080\u009cnigh.â\u0080\u009d Anyway, I think this is the strongest part of the song. In continuation with the crucifiction allusion, this seems like the part where Jesus is about to die (â\u0080\u009cthe hour is nighâ\u0080\u009d) and the â\u0080\u009cwolves,â\u0080\u009d or people who condemned him, â\u0080\u009cfill the night with holleringâ\u0080\u009d and someone in the crowd, possibly Mary, has â\u0080\u009credâ\u0080\u009d eyes from crying. Still, Jesus hangs on the cross, similar to a â\u0080\u009cscarecrowâ\u0080\u009d in both his physical position and in keeping the darkness from the crops, keeping Satan from his followers. Isnâ\u0080\u0099t that a gorgeous comparison? I get really geeked out when unusual metaphors fit so perfectly. The lines would also fit for an individual who sacrifices for his friend, who feels â\u0080\u009chopelessâ\u0080\u009d and â\u0080\u009cempty.â\u0080\u009d He intends to sacrifice himself to keep the â\u0080\u009cdarknessâ\u0080\u009d from taking hold of his friend.\n\nWhat should we take away from this, then? I think we should be better friends. I hope youâ\u0080\u0099re never in a desperate situation where you must chose whether to save your friend or yourself, though the song seems to feel clearly about which is more important. The lyrics should be applied to the smaller things. Perhaps if your friend needs to discuss the pains in his/her life, you should sacrifice your time. If your friend needs a hug, you should sacrifice your personal space. If your friend needs a tub of ice cream and a couple distracting flicks to get over a tough breakup, you should sacrifice your money. Most importantly, this song seems adamant that if your friend suffers from depression, you should sacrifice all you can (in good conscience, of course) to help.\n\nFor interpretations of other songs, check out my blog, toriphelps.wordpress.com\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\ni think its religious.Jesus is dying on the cross for us.he is bleeding out for us.some tell him to hold on but innocents is gone and what was right is wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nGuys this song is about Jesus and the Atonement. They're Mormon. \r\nIm bleeding out for you, Ill bare my skin ill count my sins, ill be your scarecrow, when the day has come, when the hour is nigh, when the say is Grey and everything is screaming, there is so much more. Everything in this song represents the atonement and how Christ bled for all of us and our sins. The world shook when Christ died. For 3 days, there were storms and the hills turned to valleys and visa versa. This song is about sacrifice, but specifically the Great Sacrifice.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nFear of hurting someone, rejection, and depression all sorta combined.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nSome people consider this to be more of a positive song than others... I'm not one of them.\n\nI think this song is about someone who feels like he's ruined somebody's life, specifically, someone very close to him. His loved one denies it(As the song says \"Oh, you tell me to hold on.\") and seems to try to cheer him up. But the one singing the song doesn't listen and believes that \"innocence is gone\"(Meaning he's no longer innocent) and \"what was right is wrong\"(Meaning that he has made everything wrong) This makes him heavily depressed, and so he resorts to considering suicide(I'm bleeding out, so if the last thing that I do is bring you down, I'll bleed out for you) and self-harming(So I bear my skin, and I count my sins, and I close my eyes, and I take it in and I'm bleeding out. I'm bleeding out for you)\n\nImagine Dragons have made many sad songs, but yikes, I feel this is quite darker than most. Very sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI get the feeling that this song is about a person who is utterly in love with another... but that person uses them endlessly. Their lover simply takes and never gives. And whenever the person contemplates leaving the unhealthy relationship, their boy/girlfriend convinces them to stay.\n\n\"I'm bleeding out\nSaid if the last thing that I do\"\n\nBleeding out - reminds me of taking a bullet for someone. Essentially the main person/character that this song is about (the MC) is in a relationship where he'd do anything for his significant other. Even bleed out - to death even. Because that would be the last thing he would do.\n\n\"Is to bring you down\nI'll bleed out for you\"\n\nAgain, he mentions that he would suffer, and practically die for his significant other. He also states that he would never make the other person suffer and always take the brunt of the consequences. The man has a slightly skewed view on what a proper relationship is.\n\n\"So I bear my skin\nAnd I count my sins\nAnd I close my eyes\nAnd I take it in\"\n\nI almost picture someone getting whipped to represent a metaphor. By baring his skin (or back) to get punished. This person gets himself ready to take the pain and suffering. Baring his skin to voluntarily get beat up. By counting his sins, he tries to remember all the things he did to deserve this, justifying his pain. Maybe he thinks he isn't good enough, wasn't nice enough, didn't do enough for his significant other. He closes his eyes to make the pain not seem as bad as it actually is, and takes the pain as best he could. \n\n\"And I'm bleeding out\nI'm bleeding out for you (for you)\"\n\nThe man takes the pain for his lover because everything he does is for them. Rather than in a relationship, he's like a faithful servant that is oblivious to his own unhealthy relationship.\n\n\"When the day has come\nBut I've lost my way around\"\n\nOne day he comes to the realization that his relationship isn't what it once was. His love is different, foreign, and he's lost as to what happened to their relationship. He's utterly dependent on his lover although he is constantly being used. \n\n\"And the seasons stop and hide beneath the ground\nWhen the sky turns gray\nAnd everything is screaming\nI will reach inside\nJust to find my heart is beating\"\n\nBasically, he beings to stop noticing his surroundings and time passes, the seasons pass but he doesn't notice. He is too caught up in his unhealthy relationship. The sky is gray, and it's almost like he is depressed, but he doesn't realize it. His entire being is screaming because he is suffering but he continues to ignore it. He continues to believe that he is in a healthy relationship and that he would do anything for his lover. That's why he reaches deep inside of himself to remind himself why he loves his lover.\n\n\"You tell me to hold on\nOh you tell me to hold on\"\n\nAfter his bouts of negative contemplation (gray skies and screaming), there are moments of clarity. Where he considers ending his relationship. But whenever he brings up the topic, his lover convinces him to stay in the relationship. To 'hold on' to what they have.\n\n\"But innocence is gone\nAnd what was right is wrong\"\n\nHis argument is that their innocent relationship has been long gone. That they once had a healthy relationship that was right... Until she took advantage of it and made it poisonous. \n\n\"'Cause I'm bleeding out\nSaid if the last thing that I do\nIs to bring you down\"\n\nHe manages to be convinced that he should stay in the relationship. He states that he's hurting really bad but he did promise that he would never hurt his lover- so he agrees to stay in the relationship. His lover manages to guilt trip him to stay.\n\n\"I'll bleed out for you\nSo I bear my skin\nAnd I count my sins\nAnd I close my eyes\nAnd I take it in\nAnd I'm bleeding out\nI'm bleeding out for you (for you)\"\n\nAnd the cycle continues. He sacrifices his well being and practically living as a servant to his lover.\n\n\"When the hour is nigh\nAnd hopelessness is sinking in\"\n\nSometimes at night he stays up and realizes the endless cycle of his suffering and stupidity for staying in the relationship.\n\n\"And the wolves all cry\nTo feel they're not worth hollering\"\n\nThis reminds me of Call of the Wild. The freedom from imprisonment. But he has a fear of loneliness, and he isn't sure if freedom is worth it. OR- wolves could reference to the fact that he may leave the relationship, but who is to know that he won't enter another abusive relationship?\n\n\"When your eyes are red\nAnd emptiness is all you know\"\n\nHis eyes are red, from crying or from his suffering. He is used to the emptiness of loving but never being loved in return.\n\n\"With the darkness fed\nI will be your scarecrow\"\n\nHe's empty, without a heart. And he is willing to work. A scarecrow scares away crows and birds from the crops all day and night. Essentially, it serves as a metaphor to explain although he's is empty on the inside and full of darkness, he will continue to do things for the sake of his lover.\n\n\"You tell me to hold on\nOh you tell me to hold on\"\n\nOnce again, his lover's argument for convincing him to stay.\n\n\"But innocence is gone\nAnd what was right is wrong\"\n\nOnce again his argument for leaving.\n\n\"'Cause I'm bleeding out\nSaid if the last thing that I do\nIs to bring you down\nI'll bleed out for you\"\n\nBut then he remembers his promise to never hurt his lover and he gives up on his argument to leave and decides to stay.\n\n\"So I bear my skin\nAnd I count my sins\nAnd I close my eyes\nAnd I take it in\nAnd I'm bleeding out\nI'm bleeding out for you (for you)\"\n\nThe suffering continues.\n\n\"I'm bleeding out for you (for you)\nI'm bleeding out for you (for you)\nI'm bleeding out for you (for you)\nI'm bleeding out for you\"\n\nThe cycle never ends. He always bleeds out - he endures the pain. And not for anyone but his lover.\n\n\"'Cause I'm bleeding out\nSaid if the last thing that I do\nIs to bring you down\nI'll bleed out for you\nSo I bear my skin\nAnd I count my sins\nAnd I close my eyes\nAnd I take it in\nAnd I'm bleeding out\nI'm bleeding out for you (for you)\"\n\n\nLike a broken record he continues to endure his relationship. He is enslaved to it and he can never leave, no matter how much he tries because it is his own promise to never leave, to never hurt, and to always stay.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nComing to the realization that you have wronged someone and making amends . I think innocence is gone meaning in his pursuit of whatever he became heartless . \r\nHeâ\u0080\u0099s brought someone down with him so he will basically atone for his sins. \n\n\n", "comment_45": "\nI think this song is about someone accepting that they hurt the one they love or at least think they did \n\nSo I bear my skin (( He is ready for the hurt or punishment))\nAnd I count my sins  ((He is remembering all he as done))\nAnd I close my eyes and I take it in ((He accepts what is going to happen))\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThis almost sounds religious. Jesus bleeding out for humanity?\t\t\t\t\n\t\t\t\t\n\n"}