{"comment_0": "\nthis is by far my favorite wsp song.  this is my take on it:  he's on the road, traveling, touring whatever and is homesick.  he thinks of these memories (pappy, sally), trying to get through the day (waiting for morning) and uses drugs to escape (medicine).\r\nsmelling the cornbread bake = he's starting to get high\r\nthen in goes \"still right here, brave friend\": that's his conscience or whatever telling him \"you're still not at home, even though you feel good, brave little friend: him, for taking these chances with drugs for nothing\r\nso then he's all fucked up and partying and is happy with all these other people who are \"self-medicating\" for loneliness or unhappiness...or whatever\r\nthen morning comes, and everyone always feels better in the morning cause it's a fresh start, new day, etc., but he's \"still right here\"\n\r\ni don't know, maybe i'm crazy.  i guess that's just what it means for me\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song was inspired by Todd Nance regarding a painting of he saw of an old indian with no expression on his face.\n\r\nIt is laced with meaning, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI feel the beauty of songs, and art in general, is that despite the intended meaning of the artist the song can take new meanig through others interpretations\n\r\nIt seems to me that this song is about a old, or sick dying man on his death bed. The morning being his impending death.\n\r\n\"Oh, Sally buffalo in the apartment just below\r\na bein' without a care\r\nOh, children from my brood they come and bring me food\r\nMaybe open up a window for air\"\n\r\nI think this is talking about his children visiting him caring for him, but not providing much else for him.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nHere's what I see. Someone lying in bed waiting to die. \n\r\nHis children come cook for him and bring him food.\n\r\n\"Oh, children from my brood they come and bring me food\r\nMaybe open up a window for air\"\n\r\nThe morphine pump.\n\r\n\"Oh, just now I smell the cornbread bake\r\nOh, now, now, now I feel the medicine take\"\n\r\nHe's being fed through an IV bottle\n\r\n\"Half a bottle 'neath the bed keep our spirits fed\r\nMy hat's off to you, to you and you\"\n\r\nThe spirits are here wanting to take him away\n\n\r\n\"And now our brave friends, too, dancing circles through the room\r\nAnd a broom and a radio and a twistin out a dos-e-do\"\n\r\nHe's ready to go\n\n\r\n\"Oh, just like, just like home\r\nWhere the stray dogs go\r\nOh, oh, rest my bones\r\nLike a fresh skipped stone to it all\"\n\r\nBut his time did not come yet...he is still there\n\n\r\n\"Still right here, still just here,\r\nStill just here, brave, brave friend\" \n\n\n\n\n\n\n\n\n", "comment_4": "\nI Always think he's waiting for his trip to kick in, the party is the show, then u peak and get a little scared then JB sooths u and lets us know he'll always b there\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nEver notice they always wait until RIGHT when the \"medicine is about to take\" (peak) to sing this?  Gets us Spread Heads moving.\t\t\t\t\n\t\t\t\t\n\n"}