{"comment_0": "\nThis is acutally a Carl Perkins song.  Perkins did it good but I think Elvis did it better.  Like a lot of songs Elvis covered he sped them up and added a degree of wildness to them.  That's what I like about his version of Blue Suede Shoes.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nPuportedly inspired by a guy Carl Perkins was in the army with who, when they were getting ready for a night out would say \"don't step on my blue suede shoes\" even though he was going out in standard issue boots like everyone else.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis is 1 of the first rock n roll songs ever recorded. First done by Carl Perkins, then Elvis, then the Beatles, Johnny Cash, and followed by 6 others.\n\r\nThe first 2 lines are based on a classic children's rhyme. Elvis recorded his version of this song in 1956, waiting until his friend Perkins' version had left the charts.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\none of my fave songs. it gives me crazy legs! uh-uh hunny lay off my shoes! *jiggle jiggle* so glad I decided to pay attention to elvis.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nReportedly, the writer of this song was astonished to see a man reaction when his beautiful girlfriend stepped on his blue sued shoes on dancing floor. He was puzzled how can a man let his girl down before others just because she stepped on his shows.\n\r\nLove this song- Elvis Version !\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nNever really liked this Elvis song (and I like many). First off, what woman would be seen with a man wearing blue shoes who values his shoes more than all else? Such a silly song and unfortunately it reminds me of those powder blue leizure suits and the guys who used to ask me to dance just before running their paws down over my big butt. Ick. \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI thought he already had blue suede shoes on\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI thought when they were going out on the night that he already had blue suede shoes on\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI like your all post. You have done really good work. I appreciate your working style at the end just my request is please share with us some more great post... \ngmailsignlogin.com\">gmail sign login\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI think your post is very interesting and mostly i keep looking for like this type of websites where i learn or get new concept. I am happy to visit on your site. Thanks to share it.\ngmailsignlogin.com\n\n\n", "comment_10": "\ndidn't he steal this song from a nigger?\r\noh silly white man, always stealing shit and calling it there own.\t\t\t\t\n\t\t\t\t\n\n"}