{"comment_0": "\nWant my overanalyzed take?  It's pretentious, silly and yes, overanalyzed, and completely destroys the entire song!  It turns a cool song into another piece of dirt and manages to be glaringly wrong in the way!\n\r\nOkay, let's make it the classic stages of acceptance after a shock.  He just killed someone.  Duh.  It's in the lyrics.\n\r\nFirst comes shock.  Note the 'is this the real life / is this just fantasy' it opens with and the dreamlike tune it's in.\n\r\n(from this point on, it's all within his head.  All of it.)\n\r\nNote also the 'I need no sympathy' melodramatic nobleness he takes on in a play to get sympathy.  \n\r\nHe comes back to the world, and immediately tries to turn to the childhood source of sympathy, his mother.  He tries again to act like a hero, telling her 'nothing really matters' (in his mind, of course.  it's all in his mind.)\n\r\nThe chill of what he has just done rips across him, and at the first glimpse of pain he immediately goes into the classic 'I wish I was never born!'-type complete theatrical show, hoping once again for sympathy.\n\r\nNow comes the weird (albeit exceedingly cool) part. \n\r\nThe trial.\n\r\nFirst his 'judges' (representing the severity and harsh reality of the consequences) come forth, half-threatening him with taunts of \"scaramouche / scaramouche / will you do the Fandango\" (it's defined above)\n\r\nHe crumples, first expressing shock.  Then, he twists his earlier defeated hero's claims to say \"I'm just a poor boy, nobody loves me\" in a direct appeal to reality.\n\r\nHis other side, however, rushes in to try to save him from himself, begging the judges to release him.\n\r\nHe appeals, and is rejected.\n\r\nHis consul appeals several times in turn to allow him to stay in his own dreamlike state of deconnectedness.\n\r\nThe judges continue to strike down his pleas, growing more and more forceful, until he finally realizes that he has lost.  First is a generic \"well, I lost.  I'm going to hell, and I've got a demon with my name on it\" first realization.\n\r\nThen comes the anger phase.  He strikes back at the world and himself with guitars in the background (note the playing of a much stronger version of the theme from the opening \"mama\" part) .  He then tries to escape outright, claiming he's \"just gotta get out / just gotta get right out of here\".\n\r\nHowever, after a crecendo, he realizes that he's not about to win anything or survive anything, so he simply resigns.  It's very similar to the opening sequence--although instead of a dream, he seems much more lucid in this state.  He repeats much of what he's said earlier, only now he either believes it or has no choice but to accept it.\n\r\nThere.  I think it's an interpretation of the process gone through after a shock.  It's quite obviously wrong, but I can't help but thinking it.  \n\r\nBesides, it's my favorite song.  Let me warp it however I want ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\n\"Bismillah\" is the opening word in the Qu'ran (Koran) and literally means \"In the name of Allah.\"\r\n\"Scaramouch\" according to the dictionary means \"a stock character who appears as a boastful coward.\"\r\n\"Beelzebub\" is one of the many names given to the Devil (yes, it is spelled this way-not as above).\r\n\"Fandango\" is a Spanish dance done in triple time.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI finally got it! My father told me it was based on Albert Camus' novel, The Stranger and suddenly it all made sense! (Great song AND book).\r\nThe book is an existentialist novel. This relates to the first lines and can especially be seen in the line \"Nothing really matters to me\"\r\nIn the first part of the novel, the main character, Meursault, isn't fully conscious of the life around him.  He doesn't even cry at his mother's funeral.  He just goes through life living day by day. Until he murders a man.  Just as he truly began to live,  he was imprisoned. \n\r\n\"Mama, just killed a man\r\nPut a gun against his head\r\nPulled my trigger now he's dead\r\nMama, life had just begun                              (This line especially emphasizes this)\r\nBut now I've gone and thrown it all away\"\n\r\nThe second part of the novel covers Mersault's time in prison and in court. Which is the second part of the song, \n\r\n\", we will not let you go\r\n(Let him go!)\r\nBismillah! \r\nWe will not let you go\r\n(Let hime go!)\r\nBismillah! \r\nWe will not let you go\r\n(Let me go!)\r\nWill not let you go\r\n(Let me go!)\r\nNo, no, no, no, no, no, no\"\n\r\nAt the end of the novel, he is sentenced to death. And again, he goes back to his old way of thinking. NOTHING MATTERS.\n\r\nIt has NOTHING to do with Freddy's battle with AIDS. They didn't know what AIDS was until the 1980s.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIt's difficult to analyze a song who's writer refused to analyze it himself. The band doesn't even know the true meaning, to this day. It is claimed to be just a tongue in cheek mock opera- just for fun. There are countless theories but that is one I just can't allow myself to believe. Freddie went through too much, he was too complex, too mysterious, too talented, to just write a song this amazing about nothing. \n\r\nI'm all for having an open mind, but the AIDS interpretation is also impossible. Freddie didn't even really know what AIDS was until shortly before he was diagnosed. This song was written in 1975- and it may have been started even earlier. I'm sorry- but AIDS became a thing in the 80's- at least the late 70's- in New York- not 1975 in England. \n\r\nSuicide can definitely have an involvement in the song, as well as his struggle with his sexuality, his rocky relationship with Mary at the time, his relationship with his parents, with himself even. I believe that a number of events and emotions and struggles were all stuffed down the throat of this song. There were some intense feelings going on in that young, confused 29 year old's mind- that's for sure. \n\r\nI think that, just because this was during the exact time Freddie had an affair and was feeling guilty and was extremely confused with his sexuality- the gay thing could absolutely play a major role- if not the entire role- in the song. I'll explain with a few examples...\n\r\n\"Caught in a landslide, no escape from reality\". Freddie was stuck in a scary, awkward, confusing spot. He was in a 6 year long relationship with his best friend Mary Austin- yet he was having an affair with this man. He hated himself but he couldn't help himself at the same time. He didn't understand his feeling and he couldn't escape the situation. The guilt.\n\r\n\"I'm just a poor boy, I need no sympathy\". When looking back on the end of their relationship, Mary said that Freddie seemed extremely upset with himself. He felt this overwhelming feeling of guilt. This plays into the whole song. He feels like such a low form of humanity that he constantly puts himself down throughout the song. Going against himself. Telling himself that he has not been a good man and therefore deserves no sympathy or love.\n\r\n\"Anyway the wind blows doesn't really matter to me\". This could actually be playing onto the bisexual thing. Whether he is loving a man or a woman- it doesn't matter. He doesn't care. \n\r\n\"Mama just killed a man...\". Okay so these \"Mama\" verses may actually be Freddie speaking- not to his mother- but to Mary. He used \"Mama\" throughout the years in plenty of songs- so you can't take it literally- as if he is talking to his actual parent. The \"man\" in the story could be seen as himself. Yes, you can take the suicide route here and look into that more- but I prefer the idea that the man is not just him- but it is the him that everyone knew at that time. The straight Freddie Mercury who had a girlfriend. The guilty, bisexual Freddie is one speaking. So if you understand these roles you can understand it all from that point of view. The guilty Freddie killed the innocent Freddie by sleeping with a man and questioning his sexuality. The innocent Freddie had just begun his life- everything was going great. Freddie and Mary could have gotten married. But the gay Freddie threw it all away. Now, the \"Mama oooh's\" are sung by the straight Freddie. You can tell because there is more emotion there. You can hear the cry for help. The straight Freddie doesn't want to die- he doesn't mean to make his mother cry by going against their beliefs and being gay. I could go on forever.\n\r\nJust by reading the lines as these roles- you can understand. You can see the struggle between two sides. This plays a major role in the opera section. I don't want to type a novel, but it is quite simple to go deep into the song and untie every knot and see what's underneath. Again, there's no proof that any of what any of us are saying is even remotely true- because unfortunately Freddie is not here to unleash the secret of Bohemian Rhapsody.\n\r\nAll we know is that it was a groundbreaking song with a groundbreaking video and a groundbreaking meaning- somewhere deep down. RIP Freddie Mercury- the most amazing, talented song writer, pianist, singer, and person to ever walk the earth. I love you so much and I really do hope that my analysis of your masterpiece was at least a small step toward the true meaning. Thank you for this song and for all of your songs. Because without them I'd be in the same place as you right now. LOVE YOU\n\r\nPS thanks to whoever read this bible of a comment ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nTo the guy who links this song to AIDS...End of story? You couldn't possibly be more ignorant! First, and really the most important FACT, Bohemian Rhapsody was written by Freddie Mercury in 1975, a full 7 years BEFORE the virus that causes AIDS was discovered. If you can't figure out that the lyrics couldn't possibly have anything to do with AIDS then......\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think it's doubtful that it's to do with his battle with aids considering he wrote it ten years before he found out he had aids :)\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nthis song starts as a kind of vague question, as the singer has found himself caught in an unescapable series of events and can't believe it's actually happening.\nhe tries to kid himself that he doesn't really care\nnext we move to his prison cell where he's explaining to his distraught mother that he has killed someone and as a result, thrown his own young life away, as he is going to be executed within 24 hours.\nhe then explains that it's too late for any kind of reprieve, and that he feels physically sick at the thought of what is about to happen. he cries that he doesnt want to die and wishes he'd never even been born\nthen the interesting bit:\nhe goes into a kind of daydream, reverie, whatever where a kind of operatic drama is taking place in his head between him, the poor boy who has got himself into a terrible situation in a moment of madness, the chorus who are pleading for clemency, and the authorities who are legally bound to execute him. there's lots of cod-italian images, which i think is Freddie having a really good time writing.  \nat the end of this bit he pleads to be released as he feels that the devil, beelzebub is going to punish him enough.\nwe then move into the hard rock bit where his mood changes and he starts to feel angry that anyone has the right to do this to him and is despeately looking around for a way to get out, no matter what. \nthis doesn't last long, however, and he soon runs out of energy and lapses into acceptance of the unchangeable situation.\n\n i believe this is the greatest song ever written. it's like the mount everest of popular music, as beethoven 5 is the everest of the classics. mercury was known as a great showman, but people forget that he was a great musician and composer. up there with lennon mcartney, buddy, dylan, hendrix, sting etc etc.\n the role of the rest of the band is undeniable, notably brian may's amazing guitar. second only to hendrix and the equal or better of knoplfler, clapton, gilmour, beck etc IMHO.\n there is just so much attention to detail it feels like it must have taken years to compose and execute\n some songs just cannot be topped, good vibrations, whiter shade of pale, i'm not in love, i will survive, numerous beatles come close but this is is perfection!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nAIDS. I bow my head in respect for the memory of Freddy Mercury and others who died from AIDS, especially within the first 10 years after it was recognized in 1981-1982.\n\r\nHaving lived through the 1980s (and earlier), I remember clearly how puzzled we all were by news reports about something killing homosexual men in North America in the early 1980s. AIDS was not even named until September 24, 1982. Yes, please note that Bohemian Rhapsody was written well before that, in 1975.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\na controversially great song.. from my perspective anyway. among the best alongside led zeppelin's immortal \"stairway to heaven\". \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nStupid \"publishing block.\" I was about to do a long analysis. Oh well, here's the lyrics in case the block isn't lifted anytime soon.\n\r\nIs this the real life?\r\nIs this just fantasy?\r\nCaught in a landslide,\r\nNo escape from reality.\r\nOpen your eyes, Look up to the skies and see,\r\nI'm just a poor boy, I need no sympathy,\r\nBecause I'm easy come, easy go, Little high, little low,\r\nAny way the wind blows doesn't really matter to me, to me.\n\r\nMama just killed a man,\r\nPut a gun against his head, pulled my trigger, now he's dead.\r\nMama, life had just begun,\r\nBut now I've gone and thrown it all away.\r\nMama, ooh, Didn't mean to make you cry,\r\nIf I'm not back again this time tomorrow,\r\nCarry on, carry on as if nothing really matters.\n\r\nToo late, my time has come,\r\nSends shivers down my spine, body's aching all the time.\r\nGoodbye, ev'rybody, I've got to go,\r\nGotta leave you all behind and face the truth.\r\nMama, ooh, I don't want to die,\r\nI sometimes wish I'd never been born at all.\n\r\nI see a little silhouetto of a man,\r\nScaramouche, Scaramouche, will you do the Fandango.\r\nThunderbolt and lightning, very, very fright'ning me.\r\n(Galileo.) Galileo. (Galileo.) Galileo, Galileo figaro\r\nMagnifico. I'm just a poor boy and nobody loves me.\r\nHe's just a poor boy from a poor family,\r\nSpare him his life from this monstrosity.\r\nEasy come, easy go, will you let me go.\r\nBismillah! No, we will not let you go.\r\n(Let him go!) Bismillah! We will not let you go.\r\n(Let him go!) Bismillah! We will not let you go.\r\n(Let me go.) Will not let you go.\r\n(Let me go.) Will not let you go. (Let me go.) Ah.\r\nNo, no, no, no, no, no, no.\r\n(Oh mama mia, mama mia.) Mama mia, let me go.\r\nBeelzebub has a devil put aside for me, for me, for me.\n\r\nSo you think you can stone me and spit in my eye.\r\nSo you think you can love me and leave me to die.\r\nOh, baby, can't do this to me, baby,\r\nJust gotta get out, just gotta get right outta here.\n\r\nNothing really matters, Anyone can see,\r\nNothing really matters,\r\nNothing really matters to me.\n\r\nAny way the wind blows.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nAs a gay atheist, this song makes all kinds of sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI really don't think Freddie was talking about the AIDS epidemic: it was 1975, they didn't even know what AIDS was. Once he said the song was auto-biographical, but I really don't know what that meant.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI haven't read through all of the prior entries so I am unaware of anyone expressing the same ideas as I have about this song. I believe it had to do with Freddy coming out of the closet and the stress it put on the relationship he had with his family.\n\r\nThe first verse apppears to be him questioning himself and then finally accepting what he is and must do (open your eyes look up to the sky). \n\r\nIn the second verse he acknowledges that he will effectively be alienated from his family and faith if he reveals his sexual orientation, and so uses the metaphor of death and killing his straight self (mama just killed a man). He clearly doesn't want to leave him family ( I don't wanna die) and wishes he could change his sexual preference but resigns himself to it (sometimes wish I hadn't been born at all, carry on). \n\r\nThe 3rd part appears to be the confrontation with his family which he views as akin to being on trial. He describes himself as being only the silhouette of a man, somewhat defenseless and considered a fool (scaramouche) for his choice. The family then demands (thunderbolts and lightning very very frightening) that he shun his desires and rather act straight (do the fandango). But he refuses to play along and requests to be free (mama mia  let me go) as he knows nothing will ever be the same again (stone me and spit in my eye, love me and leave me to die).\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think this song is definitely not about aids, most likely not about his sexuality, and probably just loosely based on a fake story about a guy who murdered someone. This is queen here people. It was probably written to showcase how awesome Freddy and the rest of the band are  and is just nonsense words with awesome guitars, piano, etc. Kinda like an Italian opera to non-italians: you can't understand the words so just enjoy the noise they make\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\n     KK, this ones complicated- so it'll be long. Freddie's the only one who truly knows exactly what he had in mind while writing this song, so all we can do is guess what he had in mind from all we know about Freddie and his life in 1975. First of all, to get it out there- Freddie has said in an interview I've seen on Youtube, that the song was indeed originally 3 different songs. He said at the last minute, he ran out of time or whatever, and he just said \"what the hell, I'll just throw them all together\". (One of the smartest decisions made in rock n' roll history) Anyway- ya, so this song, even to Freddie- might not make sense. Each portion might make sense- but not when its put all together- because they really don't have to do with eachother. Unless all 3 songs were written with the same topic in mind.\r\n     Anyway- in order to infer what it's about- you have to know where Freddie was at this point in his life. He was 29 years old when he wrote the song in 1975. (He may have begun writing it in 1974 because it is very complicated)During that time he was very confused. He had been dating his girlfriend of 6 years- Mary Austin, and he was living with her. But Freddie always still looked at guys. He started staying out later- and Mary actually thought he was cheating on her with another woman. What she didn't know was that he was cheating- but with a man.Freddie loved Mary, but was very confused and always still thought about being gay, or bisexual. So he admitted to mary about seeing the other man and he said \"I think i'm bisexual\". Mary replied with, \"No I think your gay. And I understand, and I hope we can stay friends\". And with that, they did until 16 years later when Freddie passed away.\r\n     Saying that- I'm assuming the song was written, or he at least he begun to write it- before the breakup with Mary. That's when he was the most scared and confused. After the breakup he was relieved and free- they were still friends, and he got to have gay sex. So I dont think he would write so dramatically and sadly and confusing if everyhting had already been resolved.\r\n     K- now that you know how he felt, I don't think it's too hard. The very beginning- \"Is this the real life..\" just shows how confused he was. How did this happen? \"No escape\". \"I need no sympathy\" (probably for cheating)Then he goes onto the \"mama\" section. I think of \"Mama\" as Mary. And I think of the \"man\" as Freddie's old happy straight self. Think about it- \"Mary, I just killed my nice, loving, never cheats, straight, self.\"(By cheating on the other man) \"Mary, my life had just begun (he was only in his 20's- he was with girls for less than a decade)But now I've gone and thrown it all away\". Then he goes onto say that its \"too late\", his old self is already gone. He has to just \"face the truth\". ANd that he doesnt want his old self to be gone- he wants to be straight and he wants to be with Mary. (\"I dont want to die\") And that sometimes he wishes that he was never even born in the first place.\r\n     Next is the opera section- which I think is meant to just show how confused he was. It literally makes no sense- besides the \"let me go\". Obviously, let me go from this situation, let me go back to who I was.\r\n     After this comes the Hard rock section. This is where he gets the anger out. He may have wrote this song (remember they were all seperate) after the breakup. I dont know why he'd be angry with Mary, he always loved her. Maybe e is acting as Mary speaking to himself. That is what mary would say right? \"You think you can love me and leave me to die?\" \"Can't do this to me!\" \"Just gotta get outta here!\"\r\n     Finally, the mock opera ballad descends to where it started. \"Anyway the wind blows\" Meaning I dont care, it doesnt matter to me.\r\n     K- so this was just my opinion- i think it makes sense, right? Like it! :):)\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThe commonly accepted interpretation for this song is that the singer/narrator has committed a murder, was trialed and sentenced to execution. This makes sense and is supported by the ballad at the beginning of the song.\n\nI thought that, perhaps the man he has killed is, in fact himself. He has made a bad decision, but then regrets that choice immediately and wondered if what had happened was real. This choice completely ruined his life. Throughout the whole song he repeated 'Nothing matters\" and \"Any way the wind blows\". The second phrase isn't literal, of course (At least in my interpretation). But maybe he is trying to convince himself...\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI just came across this quote, by none less than Oscar Wilde himself which perfectly describes the songs of queen.\n\nIf a work of art is rich and vital and complete, those who have artistic instincts will see its beauty, and those to whom ethics appeal more strongly than aesthetics will see its moral lesson. It will fill the cowardly with terror, and the unclean will see in it their own shame. \n\nBrian may also attests to what freddie said of his own compositions, that it was always open/subject to interpretation by the listener.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nPaulotheman and Gummitch, are correct. Its not about Freddie's struggle with AIDS, it acutally about nothing. When asked in an interview, Freddie said \"People still ask me today what Bohemian Rhapsody is about and I tell them, I don't know\"\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nBohemian Rhapsody is a song that not even the writer knows what it means. I think that isn't a mistake but rather the most unique quality of this masterpiece. The audience defines what the music means because there is no one way to take it. I think the general idea is that it's about killing something in some way and going through denial and shock.\n\r\nThis song relates to me because when you hurt something you feel lost and dreamlike and you can't believe what you've done. you can't escape from reality and it will follow you for the rest of your life. There are many things you can do to cope like turning to family (mama, i just killed man) or listening to music (fandango) or looking up at the stars to think (gallileo, an astronomer i believe). but no matter what you do you will be haunted and most likely suffer for your wrong doing. when i hurt someone i loved i felt lost in my own twist of fate and i couldn't get out for a while, i struggled ( i need to get right out of here). i went to prison for two weeks (it's the law, no we will not let you go) and i felt like i was going to go to hell (beezlebub has a devil put aside for me)\n\r\ni feel that bohemian rhapsody describes each of our own lives, which doesn't matter to anyone of you because we don't live the same lives. thanks for listening and lettin me share though\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\ni have heard that this song is partially based on, or at least received inspiration from, a story told within the novel \"My Antonia.\" In the novel, a poor mother and daughter who own a hotel are in desperate need of money. when a wealthy man stays in their hotel, they kill him and take his money. after they do this, they realize that the man was actually the mother's long-lost son, and the sister's brother, who made a fortune for himself. they end up killing themselves because they are too distraught to carry on. not positive this is correct, but it makes sense given the themes in the song, and the fact that it is called \"bohemian rhapsody.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI am pretty certain that this is about his struggle with coming to terms about his homosexuality. \n\r\nFirst of all, \"Bohemian\" means people with unconventional ways of life.. which could be homosexuality... and \"Rhapsody\" means \"A disconnected series of sentences or statements composed under excitement, and without dependence or natural connection; rambling composition.\" Bohemian Rhapsody is noted for it's unique composition. \n\r\nDuring this time in Freddie's life, he had cheated on his longtime girlfriend Mary with a guy and he admitted to her that he is gay. I bet he felt an enormous amount of guilt... similar to the guilt that is expressed in Bohemian Rhapsody. The song provides an insight into Mercury's emotional state at the time, \"living with Mary ('Mamma', as in Mother Mary) and wanting to break away ('Mamma Mia let me go').\n\r\nFreddie has said that if he revealed what Bohemian Rhapsody really meant, he would be spoiling it. He wanted people to interpret it the way they liked... apply it to their lives. He felt that every great poet always has some level of mystique to their work.\n\n\r\n   \"I have a perfectly clear idea of what was in Freddie's mind ... but it was unwritten law among us in those days that the real core of a song lyric was a private matter for the composer, whoever that might be. So I still respect that.\"\n\r\n   \"Freddie was a very complex person: flippant and funny on the surface, but he concealed insecurities and problems in squaring up his life with his childhood. He never explained the lyrics, but I think he put a lot of himself into that song.\"\n\r\n-Brian May, Guitarist.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThis song is about a convicted man aressted for murder, covering for his mom(mama). Then he pleads to be let free, and begs hid mom for help, and is told there is a place in hell for him. He is then sent free, and leaves \"were ever the wind blows him.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nBohemian Rhapsody is definitely not about AIDS. Dr Robert Gallo announce the discovery of AIDS to the public 1984, Bohemian Rhapsody charted in 1975. The song is clearly about someone imprisoned for murder, facing the death penalty, reflecting on mortality, but it did not start out that way. The origin of the song goes back to Freddy's student days in the 1960s.      \nTim Staffell was a member of the group Smile with Brain May and Roger Taylor, the precursor of Queen. Tim Staffell was also a college friend of Freddy Mercury in the late sixties, he says, there was an early version of the song then that was just a collection of bits and pieces, that Freddy and Tim referred to as, \"That cowboy song.\" \nIf you have ever seen early black and white silent movies, where they used to play music on the piano to go along with the film, you will recognise the steccato piano part from silent movies of westerns.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nFor the most part, I think this song is about a boy who commits a murder, and is sentenced to execution for it, but I also see the possiblity of it being about a boy who commits suicide.\n\nThe beginning line \"is this the real life, is this just fantasy?\" could be after he has committed suicide, and is experiencing the after life. This also shows with \"look up to the skies and see,\" which could be talking about heaven.\n\nWhen he says he killed a man, he could be talking about himself in third person. It's obvious he wasn't thinking before he pulled the trigger, and feels guilty for leaving his mother behind.\n\nThen he talks about leaving everyone behind, and facing the truth could mean his judgment. He also says he doesn't want to die, which could mean that he hasn't faced the fact that he is dead yet. He also wishes that he'd never been born at all, which I'm sure most suicidal people feel. This would also explain his words, \"nothing really matters\"\n\nIn the next scene, It could be God(s) judging him, and sentancing him to hell (which would explain the thunderbolts and lightening, and devil, Bismillah (in the name of God), and what not).\n\nBut that is all a really abstract interpretation.\n\nI think this song was supposed to be pictured like a play, because that's kind of how I picture it in my head. If you take the more obvious interpretation, the main part of the song is the boy pleading to the jury, and the jury not feeling any sympathy for him. This is shown through the many different voices, and the one tiny voice supporting him is probably his lawer (who isn't doing much, if you ask me.) \n\nScaramouch means cowardly buffoon (or rascal/scamp).\nFandango means to do a foolish or useless thing\nBeelzebub is another word for the Devil\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI haven't read all (nearly 1,000) of the comments on the meaning of this song, so 1 or more people may have already mentioned what I have to say.  FM would never discuss the song's meaning himself or offer an interpretation.  And since the other members of the band seemed to feel that the lyrics related to FM's personal experiences, they never really offered interpretations either.  But of all the possible ways to view the lyrics that I've seen, my favorite two are pasted below, for what they're worth.\n\r\nThis was from a BBC piece on the band: \"When the band released a Greatest Hits cassette in Iran, a leaflet in Persian was included with translation and explanations. In the explanation, Queen states that \"Bohemian Rhapsody\" is about a young man who has accidentally killed someone and, like Faust, sold his soul to the devil. On the night before his execution, he calls for God in Arabic, \"Bismillah,\" and with the help of angels, regains his soul from Shaitan.\"\n\r\nAnd here's the only direct comment I've ever seen that Freddie personally offered about the lyrics:  â\u0080\u009cItâ\u0080\u0099s one of those songs which has such a fantasy feel about it.  I think people should just listen to it, think about it, and then make up their own minds as to what it says to them â\u0080¦ Bohemian Rhapsody didnâ\u0080\u0099t just come out of thin air.  I did a bit of research although it was tongue-in-cheek and mock opera.  Why not?â\u0080\u009d â\u0080\u0094 Freddie Mercury  [Davis, Andy (1993). \"Queen's Bohemian Rhapsody\". Record Collector (167): 20]\n\r\nFYI.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI heard somewhere that, when asked what this song was about, Freddy Mercury said he didn't know what it was about, which I think means that they were kind of fantastical lyrics that represent a surreal kind of life. It doesn't necessarily mean it's about how he had AIDS. It could be just me, but FM should be remembered by being in one of the best bands ever (in my opinion), instead of dying of AIDS.\n\nNo matter what it means though I like the melody and the singing. Good song!\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nWell I actually have a different interpretation. Relating to who he was as a person, rather than the protagonist of the song. Not saying he actually killed a man, but maybe he killed off a part of him by a sin he committed. This sin somehow sent devils to haunt him (\"Beelzebub has a devil put aside for me - for me - for me\"), with beelzebub being one of the more powerful devils, also called \"The lord of the flies\".\n\nWhat is surprising though is the word \"Bismillah\", which literally translates \"In the Name Of Allah\" (In the name of God). So the line\n\n\"Easy come easy go will you let me go\n(Bismillah no we will not let you go) let him go\"\n\nMeans, he is asking \"In he name of Allah\", to let him go, or remove these devils from me. But the response was \"No\". Probably because of his sin earlier in the song. \n\nThis song is deep simply because it touches on hollywood's association with devils and selling your soul to achieve fame. It touches mortal sins, devils, God and the consequences of siding with either.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nIn short terms what Bohemian Rhapsody is really about: \n\nIts truly about Freddie himself struggeling with his religion and his mum, who is deeply faithfull in their religion (Zoroastrianism). It's about losing his religion and maybe his beloved mum, because he can't go on with all their principles anymore. Maybe his mum would shun him when being disfellowshipped like common in many other cults. \"Mama, I just killed a man. Put a gun against his head\" is definitly about killing his old religous personality. Now \"life has just begun\" and he can go on living on his own! \n\nA few days ago i recognized this myself when i heard the song. Beeing myself raised in a cult and also having a lovely mum, who deeply follows the cult i can fully understand freddie. \n\nSo i found this thread also to have the best description of this myth song:\nqueenzone.com/forums/1279006/…\n\n\n", "comment_28": "\nto maexx: (i speak just a few words in english)\n\nthis is obviously! i am 100% agreed with you!\n\nand there is some remark from me for the text: \n\n\"i see a little silhouetto of a man...fandango\"\n\nits mean:  i do not know if this is in english so or not, but in our languages (i speak some languages a little...) if somebody 'let you make the dance with s.' it s means you will get beaten. and you can see the movements in a fandango...\n\n\"bismillah\"= ca. in the name of god!\n\n\"frightening me (like) gallileo,figaro\"\n\nGallileo  is knowned to live in fear  because of the church.\nFigaro: in the sceene the actor get in the end always beaten.\n\nanyone can see, nothing really matters= it is obviously, not? he does not care it anymore, everything is in the song\nbut\nanyway the wind blows= he will not make a clean breast of it, because of his career....\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThis song is totally about suicide!\nHe realices many things during the song.... at the begining he opens his eyes and realizes how bad the world is, it can not be thaat bad, or can it? that is the \"is this the real life/just fantasy\" part and he asks several times for people not to feel sad for him even though he is sad himself \ndidnt mean to make you cry ....\nnow, the man who he kills is actually him\nthats why he asks for his mother not to dry or wait for him\n\"some times i wish ive never been born at all...\nnothing really matters is very obvious and with carry on he is trying to say that people should carry on with their lifes after it happens\nhe is tormented by the devils of his own mind \"beelzebub\" that keeps him away.. he feels anxiety and depression!\nbasically all the lyrics make sence with this interpretation, hope you enjoied it\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nNot as good as of Montreal or the Unicorns imo.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nlike the band, like the song.\n\nIt's kinda all over the place. in the beginning its about how hard life is and how he wishes he wasn't born at all.\n\nthen its picked up and then its about a relationship. I thing she did something bad so hes like \"So you think you can stop me and spit in my eye\"\n                       \"So you think you can love me and leave me to die\"\n\nand in the end nothing really matters\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI remember walking down the road with my phone and my pocket, just blasting this sweet song into my big ears. I would get banged left and right. Any female who was driving to her home just parked her car and slide on my dick. I'm telling you, this song is a chick magnet. If you're gay though, enjoy nothing you dumb cuck.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nIsn't it \"stone me\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nSounds like a young man killed a guy and with a life sentence or about to get executwd. Said Mom move on with your life. \t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI think it's about his life because he is gay and his mother didn't accept him to be gay rough life\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nWhen the band released a Greatest Hits cassette in Iran, a leaflet in Persian was included with translation and explanations (refers to a book published in Iran called \"The March of the Black Queen\" by Sarah Sefati and Farhad Arkani, which included the whole biography of the band and complete lyrics with Persian translation (2000)). In the explanation, Queen states that \"Bohemian Rhapsody\" is about a young man who has accidentally killed someone and, like Faust, sold his soul to the devil. On the night before his execution, he calls for God in Arabic, \"Bismillah\", and with the help of angels, regains his soul from Shaitan.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nThis is the story of a murderer who is being arrested in his mother's home. Along the way we see the story unfold, his tortured thoughts and the mother's grief.\n\nIt begins with his realization and awakening to what he has done. He can't believe what has just happened, everything feels surreal. But slowly and surely he comes to accept his fate and chooses that whatever may come, he will go with it.\n\nIn the next set of events, he is presumably at his mother's home, telling her what has come. Having run away from the crime scene, he has sought shelter from the authorities, at least briefly to tell his mother what may happen to him. From this alone we can assume that his mother must mean a lot to him, and him to her, if he felt she was the first person he should tell. And so he bids his mother farewell and that she should not worry about him.\n\nThe authorities arrive and he makes his last bidding farewell to any loved ones who are present. And in the moments leading up to his full arrest, he cries out to his mother. It is not known whether this is a mental or physical event. I'd like to think physical, for dramatic effect.\n\n\"I see a little silhouetto of a man\nScaramouch, scaramouch will you do the fandango\nThunderbolt and lightning very very frightening me\nGallileo, Gallileo,\nGallileo, Gallileo,\nGallileo Figaro - magnifico\"\n\nThis entire paragraph is his tortured thoughts between feeling small, and the different voices in his head and it is loud and thunderous and confused and just very frustrated. On one side you have his cowardice urging itself to dance tonight, so to speak. Whilst on the other hand you have his philosophical side fighting for precedence by trying to keep him nihilistic and calm: that \"nothing really matters.\" And judging by the \"magnifico!\" we can assume that his philosopher's side is winning or that he's fighting for this side to win.\n\nThe authorities have put him in chains and are leading him away. But the beauty about this piece of poetry is, it's not only his mother's plea to the authorities begging for her son (\"Let him go!\"), it is also his tortured existence between light and darkness at the same time! So we see that the authorities represent the evil inside him, but we also see the light trying to spark the good in him. \"Bismillah!\" meaning \"In the name of God, the Most Gracious, the Most Merciful\" is shouted to try and keep him from falling to the depths of the void â\u0080\u0094 which can also be seen as the authorities sort of saying \"Oh for God's sake, woman, we won't let him go\". And \"We will not let you go\" is not only the authorities saying they must take him in, it is the darkness dragging him down to the depths of hell. This is why you get the \"Beezlebub has a devil put aside for me\" which makes no sense on the authorities behalf, but paints the picture of his thoughts.\n\nAs they lead him away, his mother expresses her heartfelt distress. She cries out heavily, and once again it is unknown whether it is mental or physical. I like to think it's mental thoughts, but she is just breaking down and other loved ones are supporting her as she collapses. You know...for dramatic effect.\n\nAnd as he walks away, we see who has won the battle in his mind. It is the philosopher who won, and there is no more time to be a coward, he has to walk his fate now. You hear it in the music tune too. That all the thunder and lightning has gone, and he has completely succumbed, this is why it sounds calm.\n\nSo we see it's three songs at once. One about a man being arrested on charge of murder. One about a man's thoughts after killing another man. One about a son and mother's connection.\n\nThis is one godly sad song...\n\n\n\n\n...Alexa play Despacito!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI think it is fairly obvious that this song is about Freddie's struggle with his sexuality.  The beginning verse is about accepting reality.  The second and third verses are about him shedding the lie of being straight and him coping with the consequences/stigma of being gay.  The operatic section is about him facing judgement for who he is.  The heavy metal section is about him defying his judges.  The last section is almost a melancholy acceptance of who he is.  He doesn't necessarily like it, but it is his fate.  Any way the wind blows....\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI think it is most likely about Freddie discovering his gay feelings. The 'killed a man' bit is probably metaphorical because he could not say what he really meant at the time (and perhaps would never have wanted to). The verses about death are symbolic of the end of the sexual act.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nHere is a video on it: youtube.com/…\n\nI agree with them. The song is about Freddy Mercury's life. Basically, Freddy Mercury sold his soul to Satan, and is writing a personal Faustian type song. He is basically saying that he killed his old self so that he could gain what Satan had to offer, and he is doomed.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nSo I didn't read all the comments because there's way to many. The beauty of music and NOT video is you get the privilege of taking from what you hear and need.\nYou take away; silholouetto,scaramouch,gallileo and bismillah! and what you have is a country song(leave in the Devil part) Throw in a fiddle a banjo and a squeeze box.....\"country song\". Reminds me \"Knockin' on heaven's door\".\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThis song is the best song ever...\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\ni love this song, it just makes me want to cry :')\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\n... I guess I was wrong... it still works though...\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nI have no idea of the this songs meaning BUT I love it.  I think I love it so much because it's so complex.  At first I just found it to be a very sad song.  Then, like damioniqnis, I also thought the song was about Freddie's battle with AIDS.  BUT when I was introduced to this song I had no idea of its original date of recording and Freddie Mercury dies shortly after.  Paulo points out that this song was written ten years before Freddie was aware of his HIV status but it could be possible that he was speaking of the epidemic in general or a friend.  And it is not known when Freddie was actually diagnosed.  Hell, I have no idea...lol!  This song is so complex!  From the changes in tempo to their use of sarcasm.  Hey, I guess that makes it a Queen hit, right?  This, without a doubt is one of my favorite songs ever.  Although it would be nice to comprehend the lyrics. ;)\n\r\n*Just found this site tonight (by accident) and it's GREAT!\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThey had something on Queen on VH1 - on that they said that this song was some kind of mockery or spoof of the English upper class... \t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\ni luv this song, its so awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\ni think i spk 4 everyone here wen i say this is mega\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nthank you metaluna for helping me understand.  It's nice to met someone with all the answers, I believe I prefaced my comments, and I know when it was written relative to the DIAGNOSED cases of AIDS.  If you think AIDS wasn't around before 1985 you're dumber than you look.  I said it can work, like other songs can be made to work AFTER an event if you try.  So if you are offended stick it. IF you recall Freddie denied he had AIDS until about the day he died, so It's just possible he may heve been( brace yourself and your sensibilities) lying.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nnote to PKJUN, I like your interpretation\r\nGor\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThanks :)\n\r\nNow see, I do find a couple of problems with the AIDS interpretation, though.  First, not all the lines fit.  I mean, what the hell is the Bismillah and Scaramouche for?  I think mine clicks a bit nicer, but that's just me...many people like the AIDS interpretation...\n\r\n...so who am I to doubt it ; )\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nOh I sincerely doubt the AIDS interpretation.  It is interesting, but like you say it really doesn't fit.  That whole Bismillah stuff really kills it.  I just thought it could kind of fit in those first few verses.  I think you are right on Pkjun.  \r\nThank you for the rational discussion.  (take note Metaluna)\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\ni iz nowt wntin 2 spk inglish cos i si nowt nedin 2, im from manchester and we dont speak english up here anywayz, it dosent really bother everyone does it??\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI think this song is about how Friedie's struggle. how it says \"put a gun against his head, pulled the trigger now he's dead\" is like how he told his dad that he had aids and how it \"killed\" his dad inside. also like in the beginning how it says \"is this real life or is this just fantasy\" is like him not in denial and feeling sorry\"about himself. then as the song goes on he gets over it and tells everyone off who thinks of him as an outkast for. how he just wantsto live his life normally. that's what i think. \t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nOMG!!! It's like... it's like... a parade of feebs!\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nummm, wots a feeb\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nOh, come on, Punker.  Please.  The AIDS fits okay for the beginning...but please explain Scaramouche, Bismillah, and the trial.Edited by oofus on February 12 2005, at 12:18PM\n\n\n", "comment_58": "\nFeeb(le). How's that?\n\r\nAIDS doesn't fit, period. It was released in 1975 - a good TEN YEARS before AIDS came into the public spotlight, and SIXTEEN YEARS before he died.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nYeah, sure.  The Beatles also claimed they had nothing to do with Paul is Dead, and that Lucy in the Sky with Diamonds has nothing to do with LSD.  If Bohemian Rhapsody was written on the spot as a crap song, then Freddie is the greatest improvisationalist since Bach.  \n\r\nThe themes (in music and lyrics), the imagery, the word choice...it's overall very impressively done.  It might have just been done to sound cool (lord knows I've written far too much like that) and in doing so it lends itself to interpretation...but I like to think that somebody put a bit of work into it ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\npkjun...you're a genius.  i've never thought of the song like that before...it's awesome...and i'm going to have to agree with your last message...very well done.  good man.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nWell freddie's no feeb, lol\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nYou know what...i had never actually interperated(spelling?) these lyrics like pkjun had, wow..that really changed the way i looked at that song. all i saw it as was a chezzy lip syncing wayne and garth off of Waynes World...wow...i'm beside my self now.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI THINK THIS SONG ROCKZ\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI was talking to my brother and I was just as puzzled as you guys on what this song could mean. I found out it was actually about the lead singer killing another man (although he never did that in real life!) and then confessing it to his mother >Mama just killed a man \r\nPut a gun against his head Pulled my trigger now he's dead Mama, life had just begun But now I've gone and thrown it all away MamaIs this the real life? Is this just fantasy?< The second is confessing his sin to his mother, and the last (and probably most crazy!) is where he is harassed by the consequences of his actions. the names Scar-a-mouche, Bielzebub, and Bismillah are actually names of the 7 (or is it 9...i forget?) rumored devils there are. the word Fan-dan-go means dancing, which one of the devils does while the man is trapped in his sin. Bizmillah will not let him live not being in denial >Bismillah! No we will not let you go \r\n(Let him go!) Bismillah! We will not let you go (Let hime go!)<  ......I dunno, thats how i translated it. tell me if that makes much sense to you guys\n\n\n\n", "comment_65": "\nNo idea what this song means... But it's funny, I've always envisioned this song as like part of a musical. Haha. Even though you don't know what the story is... this song just seems to tell a story. It's like a wonderfully put together orchestral piece w/ all of these different movements. You can't tell me this song doesn't have movements! The constant change in mood (serious to ridiculously silly, for instance) is simply genius! I also think that this song is the one that compliments Freddie's voice the best. His voice is godlike... ever notice how he just floats up to those high notes and makes it seem so easy? His talent really \"sends shivers down my spine.\" What an amazing band. What an amazing song! Definitely one of the best ever written!\n\n\n\n", "comment_66": "\nI just had to say that the Beatles did not, in fact, do anything to instigate the entire Paul is Dead hoax - that perpetrated itself quite well on its own with the help of radio stations and rabid fans. Paul himself said \"If I were dead, I'm sure I'd be the last to know.\"\n\r\nAs for Lucy in the Sky with Diamonds, John Lennon did, in fact, gather the title from a drawing that his son, Julian, made of his friend Lucy. This is backed up by interviews with both parties, as well as the actual drawing, which depicts - surprise - his friend Lucy, in the sky, with diamonds. The lyrics are pure Through The Looking Glass imagery.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nOh Jesus!!!   I cant belive this ppl are so attached to the aids and Bo Rap idea... This could only happen with ppl who are not real Queen fans, and have no clue at all about the band and its history.... and are so blinded with morbid ideas and their narrow minds...\r\nSo plz, talk about what you know better, and it shows it isnt Queen related matters, obviously...\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\ni just think this is a great song, and what it means doesn't really matter to me, it just king of has to do with problems i think...im not sure, but what ever it means it turned out pretty damn good :)\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI think this song is completely incredible. I ant believe someone could have this all in their head. IT's such a tragedy that this beautiful mind and wonderfully awesome voice is no longer on this earth!\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nThis is to pkjun, bo, gorgood, & metaluna. Get a life! It seems this is all you do is argue about a song. Now I know you hav lives out side of the computer, MAYBE. BUT THEY MUST REALLY SUCK!!\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nHate to burst MetaLune but ur wrong all over first cases of aids were documented in Africa in 1948 and it was well knwon in american by 1950 and the song was written and released in 1975\r\nhe has PLENTy of time to get aids and write about it.. + to add to this all the internet was started in late 30's as a secret government project\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\noh and it was released in England in 73 ...\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nK, is it just me or is Bwoodmeyer retarded...  if this song was released in 73 then wouldn't mike meyers be like 7 years old?!?!  \n\r\neither way i think this is a great song, and that it could be about aids, and i could not be,  they both have strong cases,  but instead couldn't we just enjoy the song, and be glad such a great songwriter was ever born? hm?\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nit isn't about freddies aids. it was an auot bio song.  with some falshood, freddies guilty conscious, he made a song about a dude who killed another dude and is going to die 3 times, 1) from jail, 2) from his conscious, 3) in hell,  freddie didn't kill anyone, but he has some guilt and he just changed it around a bit. just what the song said.. there is no hidden messages or anything\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nthe song could have multiple meanings, it could be just a story that freddie told , or it could be about freddies aids. i know aids weren't around at the time, but he had to of known he had something, so consider this song a crap song, with multiple meanings, because like many songs thats all this song is gonna have until freddie rises from his grave and tells the world what the song means, even though he said he dont know, which deep down inside, i think he knew what he was getting at when he wrote it.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nk Bwoodmeyer,  i am saying that freddie didn't write the song for wayne's world like you said... \"When Mike Myers approached Freddie to write a song for Wayne's World, he begged the comedian to write this song about his struggles with the disease.\"  he wrote it a long time ago, not for the movie,  is anyone  else listening to me,  and im not trying to be rude, but it seemed pretty stupid      \n\r\nand from what i've heard on here the song originally came out in the 70's \t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nyeah i knew this song wasnt written for waynes world but everytime i hear it i think of the part in the movie when the guys in the car rock out to it\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nthe song was not written in 92,  more like 72... or close to it,  freddy mervury was dead in '92,  it was re-released in 92 probably, but otherwise it is from the queen's prime, will someone comment on this for me?    and bwoodmeyer i just wannna give ya some quotes k?  \n\r\nGummitch-\"I really don't think Freddie was talking about the AIDS epidemic: it was 1975\"\n\r\nMetaluna-\"It was released in 1975\"\n\r\nWoahNightFall- \"and the song was written and released in 1975\"\n\r\nk?  someone else comment on this for me....  p.s.  guy, not gal.. and im not trying to be rude, but the song is from the 70's ok?  sorry if i sound rude, its not intentional \n\n\n", "comment_79": "\nno, it was created in 74' released in 75' waynes world came out in 93' they used a 10 second segment from the song, it has not connection with the movie. mike meyers was in his teens when this song came out, mike meyers was not in the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nNo1 song ever...what else is there to say?\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nquote john deacon = \"this song was a laugh\" \n\r\nand it has been voted the greatest song of all time\n\n\n\n\r\nRIGHTFULY SO \r\nMOAN THE QUEEN!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\numn, i hate to start the argument again, but i am aggreeing with canada and co........the song was in the 70s (there was a 'queen night' on TV last nite, and this was a feature), the song was used in Wayne's World, but it was NOT written for it, neither was it about his AIDS, since he didn't have the diease, or rather didn't know about him having it, at the time of the song.  neway wasn't freddie dead when waye's world came out?\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nGreatest queen song by far.......\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nI can't believe that some people think that this song has to do with AIDS!!!  It's was released in 1975 on the album \"A Night At The Opera\"!  And according to some book I have, he made it up for fun!!!  Man, some people!!  Read a book or something and LEARN!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThis is a very good song.  Considering over 2500 people have viewed the lyrics to it, the only song that has over that that I know of is Stairway to Heaven by Led Zepplin.  Both these songs are legendary.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nUnfortunately Spike, there are alot of terrible songs by miserable artists that people have viewed more. For example : Creed- My Sacrifice.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nGrr.  I will now go and kill off several members of Creed.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nDr. Qwiz.  Arguing about a song shows that we care, and have interests.  Now as for having nothing to say but get  a life is qwite interesting indeed.  Maybe the Doctor needs to heal thyself.  \t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nThis is one of the greatest songs of all time. And in case none of you knew, this song has never been radio edited, everytime the song has been played they play the full 6 minutes. Just a fact. And also, this song has to mean something to Freddie. And I read that some of you stated that nobody knew he had AIDS, and that's because he didn't want to tell anyone. Because if he did, his fans would feel sorry for him and would always feel that way. That's why he waited so long to tell us. And if you guys didn't know this already, Freddie announced he had AIDS the day before he passed away. Fredde didn't want to be remembered as to having AIDS, but as the greatest performer of all time and I think he is. He knew he was sick, but went out every time and gave 110% to his fans. Freddie may you rest in peace. You are truly the greatest friend, performer, song writer that the world has ever gave us. We are blessed to have known you and the band that all of us have grown to love. GOD SAVE THE QUEEN.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI agree completely and totally agree with emo12punk12metal!!! I actually envisioned the same \"musical\" kind of theme to this song. It's amazing that someone created this song. it's so different form everything else ever!! it's incredible!!!! this man whas a genious not to mention had the voice of an angel. I could listen to this beautiful voice forever. he's amazing!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nthis music is great!crazy but great!=)\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nIt definetly takes a lot of patience to read all these explanations, so sorry if I'm repeating stuff. It sounds to me like an opperetta about a guy who just killed a guy, and then the big wayne's world part is the trial, then the rock part is him lashing out and being angry and stuff. \t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nI know everyone already said this *shite*, but I am just letting out what I think of it again, reinterating, or not. \r\nNo, the song doesn't really mean anything in particular, just a bit of a stupid, pointless tale of a trial, and no, it wasn't \"Just pulled out of their ass\". Golly gee wiz. Where did you hear that? MTV news, or Rolling Stone magazine? I agree with you all (Or, at least.  the majority of you) that this was one of the best songs of all time. Faye Wong did a very cute cover of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nfirst of all...freddie was diagnosed with aids in 1986...maybe he wrote it and sent it 10 years into the past? it ain't about aids...think of it as a mini rock opera...what pete townshend would say if he had only 6 minutes to say it\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nBohemian Rhapsody was released in 1975.  Freddie Mercury was diagnosed with AIDS in 1987, but held it from the public until the early 1990's.  I am going to have to agree with ericfarsad on this.  Bohemian Rhapsody is just a great song and nothing more, nothing less.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThis song is awsaome. Me and my friend dance to this all the time when we are drinking this is our party song ROck On Queen.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\ni agree with SkagasmiCarly and what she said the song was about\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nThis is a great song.. no matter what its meaning. :)\n\r\nOh, and by the way. Weird Al's version is named Bohemian Polka, not Bohemian Rap City. :)\n\r\nI'm also a big Weird Al fan.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nI read that in an interview, Freddy Mercury simply said that this song was a mock-opera, and they just wanted to write an \"epic\" kind-of-opera song, so they just threw in some obscure references and mythology etc. He also said the song was just supposed to be fun.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nThis song is what makes Waynes World, Waynes World. Perfect...\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nIf i could meet one person dead or alive i think it might have to be freddy. I would love to spend a day with such a brilliant mind!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI love the bit where the choir fades up, and then (cleverly) down.   The keychanges are sooo cool too.\r\n  If only people could accept the innocence of the guy's, then we could all (notwithstanding) run along too, as in;  \" Help, I've lost a trumpet!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nThis song is crazyness. Its like going to your own little world where you control everyting... thats what i think \t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nbeelzebub means lord of the flies\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nOK, I have a theory here....\n\r\nThere is a famous novel by Albert Camus called The Stranger.  It is one of the first pieces of existential literature and because of that we had to read it in English class.  Personally, I never cared for it that much, but it is certainly a major peice of literature.  I think this song is based on this book.\n\r\nThe book is basically about a man who no longer finds anything meaningful in life.  It starts off with the death of his mother, and his relationship with her is a major motif throughout the book.  Half way through the book, he shoots and kills a man for no really good reason.  Since he has no meaning in his life, he doesn't seem to have that much remorse for what he did.  The remainder of the book is him getting caught (doesn't try to avoid it), waiting for his trial and the emotions he goes through.  In the end, he still cannont find any meaning in life, so he doesn't really care what happens to him.  (Mr. Camus, pardon me for butchering your novel with such a brief interpreation of it).\n\r\nAnyway, as you can see, there are a LOT of similarities and common motiffs between the song and the novel.  The first part of the song is about him killing the man (notice Freddy never says why, and the character in the book also shot his victim).  Although Freddy makes it sound like the mother is alive, I think this still may work because I don't believe the character in the book ever really accepted his mother's death.  He never really grieved about it.\n\r\nThe second portion of the song represents the trial. Freddy increases the tempo here, representing the fuss and fury society makes regarding the murder.  Notice the murderer in the song doesn't say much in his own defense (\"I'm just a poor boy, no body loves me\" and then \"Easy come easy go.  Will you let me go?\").\n\r\nThe next part of the song represents the anger the murderer feels at being judged.  Notice he never feels sorry for what he did, just angry that others are judging him for it and that they don't see things from his point of view, that it doesn't really matter what he did because life has no meaning.\n\r\nAnd then the song ends with The same line he uses throughout the song \"Nothing really matters\" which is at the core of Existentialism.\n\r\nI'm sure not everyone on this message board has read The Stranger, but because it was such an important work, I think it highly likelly that Freddy did, and I wonder if it is the basis for this song.  I would love to hear from others who have read (or had to read) The Stranger and hear what they think.\n\r\n-Dhaval\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\noh, and \"Bismilah\" works because The Stranger takes place in Algeria.\n\r\n(Bismilah = In the name of Allah)\n\r\n-Dhaval\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI've been a major Queen fan since i was a kid and this song obviously shook the foundations of rock upon its release. Many ppl (including those here) have tried to make some sense of it. \n\r\nI remember reading Freddie's auto-biography where someone once asked him what Bo Rap really meant. He said \"It's just a bunch of rhyming nonsense.\" :-)\n\r\nWhen the single was first ready for release, it seems that his producers told Freddie that Bo Rhap was too long coz most songs in the late 70's were like 2-3 mins tops and told him no radio station would play a song 6 mins long in its entirety. Freddie was asked to edit it and make it shorter.\n\r\nFreddie then secretly passed the single to a DJ fren of his and told him that this was his new single and wanted to knoe what his fren thought abt it. The DJ dude played it 48 times in 2 days. All 5min 54 sec of it. The rest, as they say, is history.\n\n\n\n\n", "comment_108": "\nI think this song iss basically about war and what it can force a man to do to defend himself and the consequences he knows he will face because of these actions.  At least thats what I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\ni have no clue what this song is about but my friends and i love it. why i dont know but we do.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\ni dont think theres a meanin, the guys were fuckin stoned wen they wrote it!  also, maybe they wrote it just so mike myers and dana carvey could headbang to it.  that is by far the best scene in any movie.  im convinced that they knew it would b in the movie so they wrote it.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nburp 15... fuck off. these guys were talented musicians and knew how to write music. Their songs, including Bohemian Rhapsody, weren't just songs about nothing for stoners. they knew how to play their insturments and could wirte good lyrics. these lyrics obviously seem too advanced for you so you just say its a stupid stoner song for wayne's world. next time, don't say something so damn stupid!\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nif you want to know what it is realy about look at pkjun's entry on 04-23-2002!\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nthat song is so crazy!! it's almost sad and tired sounding. (i'm not sure if that's right it's all i can think of right now) he jsut sounds so regretful and pained when he says \"life had just begun, and now i've gone and thrown it all away\" and then that musical sounding part. holy god, if that is not the coolest bit of music out there. who out there would have thought up something like that. and to make it sound cool is just pure genius. i don't really know what it means either, but i think the theory about it being about that book is pretty cool. oh one more thing, burp 15? they probably didn't write it based on the fact that it would be in wayne's world considering that it was written in 1974! just thought you should know\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nthis is one of my favorite songs. ever. EVER. who knows what it means, or anything...but its just fabulous. although the interpretation of the song-and that book was pretty interesting. maybe? i don't know. but i'll just keep rockin out with it. \t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nWasn't this song writen about the last person in America that was given the death sentence of the electric chair? \n\r\n All the words no matter how bizzare seem to fit to this story:  \r\n         He can't belive whats happening (is this the reel life), he is telling his Mum that he is sorry, telling her to carry on without him, he did the crime so now has to face his punishment, the monstrosity is the elecric chair, He dosn't care in the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nthis is on behalf of aviad, one of the greatest queen fans of all time! :)\r\nOK to begin with, Mercury also said in an interview that it was a song about relationships, and he has revealed the true meaning to all 3 living Queen members, although they are somewhat reluctant to share it with the world at this time.  My take on this is almost a religious one:\r\nThe intro is born out of classical music.  As far as lyrics go, they lay out the setting and hero for this story.  This is somewhere between heaven and earth and its all happening to this one poor boy.\r\nNow we get the story.  This man has killed a person, and now he has regret for it.  He's dying on earth and needs forgiveness from life before he goes.  Unfortunately, his mom doesn't give him his satisfaction and he ends up killing himself.\r\nAn amazing guitar solo brings us to purgery.  Here all the angels fight over this poor boy and where he should be sent.\r\nAs stated before - Bismillah is In the Name of Allah...so basically it means - In the name of God no! we will not let you go...get the drift?\r\nOk finally we come to beelzebub...uh oh the devil! Now we know where this boy spends eternity.\r\nHeavy metal guitar can only mean brimstone...haha.  Now this guy tells us what he thinks of hell, purgery, life...everything!   Obviously he doesn't like it - so you think you can spit in my eye? love me and leave me to die? He hasn't had quite the best experiences nor been dealt the best cards.\r\nSo what does he do?  He's getting out of here!\r\nSuddenly we hear some of the most regal sounding guitar in the interlude between.  This is almost a call from heaven...the might face of god descending upon this poor soul.  God judges him...and he's right back in hell.\r\nSeeing that the big man even rejects him, he looses all hope and faith in everything.  Nothing matters.  Any way the wind blows....\r\n This is the basic story of a criminal going from life to death and all the stages after that.\r\nOf course I could be wrong...it could really have no meaning at all.\n\r\nOne final interpretation is like Mercury said...it's a song about relationships. I'm not really sure what kind of relationships he meant, but I'm gonna go with romantic ones just for the hell of it. Suddenly in love - is this the real life? is this just fantasy? Once again laying out the setting, this time it can be looked at much more lightheartedly. As for the killed a man part...you got me there?!? But when he goes all suicidal...the relationships failing. In the opera section its the angel on one shoulder and the devil on the other...what on earth does this guy do? Love me and leave me to die? - I think hes kinda pissed. \r\n But then again...love is kind of a trap and he realizes he's stuck there. Life is only a second out of eternity...and so suddenly nothing really matters.\n\r\ni'm sorry on behalf of him for his rambling \n\n\n\n\n", "comment_117": "\noh yea... and he meant \"purgatory\" not \"pergury\" which isn't even a word\n\n\n", "comment_118": "\nhear a great version of this song by one awesome band (listen to the rest of their stuff too- it rocks!) - The B-sides!!\r\n     they rock my world!\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nno one deserves to cover this song\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nfreddy told me it was about him being homosexual and that his mother was a devout catholic and he thought if she found out, she would think he would be condemed to hell. so it is about him being gay and how that made him dead in his mothers eyes, and condemned by religion.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nburp15 u r retarded freddy was dead before wayne's world was even thought of???????\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nLove this song......always have and always will...and anyone who doesnt is crazy\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nHey guys,\n\r\ni think that this song is about the struggle of nazi germany. seeing as i thought germany should have won WW2 my interpretation of the lyrics are better that the rest. SEIG HEIL HEIL! MEIN FUHRER! HEIL HITLER!\n\r\nRudolph Hess is a sick cunt, or was, is he dead yet??\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI love this song, i have only recently fully appreciated it. I think it is about a boy who shot someone (as it says) and has to die for it and the let him go bit is probably from his mother or someone similar begging for his mercy but the judges or upper class are saying no\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nSHUT UP! i swear. you are all ruining the song. you are looking for reasons to put eachother down. WHO CARES what the song is about. stop whining about the AIDS thing, and stop analyzing it.\r\nwatch, to prove my point about you all merely making fun of eachother, someone will probably post a message making fun of me. WHO CARES.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nI agree with \"my mom\" - who cares? The text in the \"::add your comments::\" box sais \"What does this song mean to YOU?\" - every song meaning is subjective, it means exactly what you think it does; it's there for YOU, and if somebody tries to question your opinion on it, it is THAT person who is wrong!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nI meant \"your_mom\", sorry for that.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\ntrue piece of art. it keeps me sane\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nDamn.  We're actually being good boys and girls now.  Somebody flame.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nThere's a time when an opnion turns into a false statement.  Impossible for this song to be about AIDS, AIDS became known in the 1980's, long after this song was written.\n\r\nSorry I just don't see that as an opinion, if it is a known fact that it is wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nROCKS. thats all:)\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nBest song ever. Thanks Freddie. I can even play it on the piano!\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nthis song makes me cry, but i love it nonetheless.\n\r\npkjun, thanks for your interpretation, i'd never really thought about it that way before.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nThis songs main meaning is against the death penalty. Because in the first it says that he kills a man. He then says how he has to leave his mother forever. that thir or fourth verse that most people think is a bunch of gibberish is really what are the last thoughts going through this mans head before he is to be executed. That last verse is showing how he doesn't believe how mankind can purposely and deliberately use death as a form of punishment.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\ni personally have always thought this was a great song. fun to listen to and sing along. but...i cant help but be drawn form it. it annoys me when this is th only song that anyone knows by queen. many of them dont even know who queen is. just this song. the sam goes for we will rock you/ we are the champions and (another one bites the dust to a point). everyone just knows those songs. it pisses me off...if oyu want proof...look at the amount of comments on each of queens songs,,,this one has 117 (before me) and the others i mentioned have 12-14-30 something i think, and brighton rock...way better than any of thses, and noone has commented on this one yet. why? because mosty peopel dont even know queen. and liek i said...these 3 songs are still well known. it pisses me off when people sing this song. i ask them if they know any other songs by queen...and take a wild stab which ones they name. they dont even know any of theother on the same album. stupid sheep. does this bother anyone else?...or am i just a cynical bastard?\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nWell, it's to be expected.  Those are the songs playing on the radio:  one would figure that those would be the songs a person would know.  I do not have the money to get a CD right now, and I have a 28 K modem, so I can not download entire albums in a sitting.  Therefore, all my experience with Queen is through my radio experiences.  I am not about to call myself a hardcore fan, but I like Queen.  What I have heard of Queen, that is.  That does not make me a sheep, it just makes me somewhat uneducated in the subject.  Either way, it makes little difference.\n\r\nAlso, in response to WoahNightfall (all the way up there, bear with me, I did read every post), the AIDS epidemic was diagnosed, and research began, in 1980, as an indirect result of the ebola outbreak in Africa in 1979.  The disease was first known as GRID, or Gay-Related Immuno Disease, but protests changed the name.  For that matter, the first diagnosed case was not in America.  It was in France, in 1980, as I said.  Unlike most others, I will divulge the source of my information:  \"And the Band Plays On.\"  An HBO documentary-movie.  Quite educational.  Either way, if the first diagnosed case was in 1980, and the song \"Bohemian Rhapsody\" was written in 1975, then it is feasibly impossible that Mercury could have written it about AIDS.\n\r\nI personally just enjoy the song.  That is all.  It is a great song, and I do not try to dive into it.  I take it at face-value.  It's an entertainment song, a story song, like \"Hotel California.\"  Do not be so concerned.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nThis is one of 'THE' songs, one of the best songs ever written, and a true rock anthem! Progressive rock is the best :D\n\r\npkjun's analogy was the best i've read here too, so even if the song was written purely as a musical piece with no real meaning, i'll attatch that idea to it in future and the story will be even more vivid.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nhey hayate kusanagi. i didnt intend to insult people like you with my last post. i understand that many people do not have the means to get their other song...such as youreself apperantly...the people that bother me are the blink 182/britney spears/linkin park musucal morons who wouldnt know good music if it bit them in the face and only know this song because of waynes world (however it is an excelent movie) and can sing the whole song but can even name one other one and claim to \"love queen\" i do not consider myself a hardcore fam either. i eman...i like queen a lot...but ive only heard maybe 3 full albums. but hey...at least it isnt only 3 songs. sorry again man\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nhey hayate kusanagi. i didnt intend to insult people like you with my last post. i understand that many people do not have the means to get their other song...such as youreself apperantly...the people that bother me are the blink 182/britney spears/linkin park musucal morons who wouldnt know good music if it bit them in the face and only know this song because of waynes world (however it is an excelent movie) and can sing the whole song but can even name one other one and claim to \"love queen\" i do not consider myself a hardcore fam either. i eman...i like queen a lot...but ive only heard maybe 3 full albums. but hey...at least it isnt only 3 songs. sorry again man\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nHey, don't worry about it.  I'm not angry.  But I do agree.  You can not call yourself a real Queen fan if your only experience with it is fifteen seconds of Mike Meyers headbanging in a car.  That is just disrespectful to real Queen fans, to the memory of Freddie Mercury, and to music in general.  Sure, Bohemian Rhapsody is an awesome song, and it makes for a good song to freak people out with on the road.  However, I am not so arrogant as to blindly say that this is, without a doubt, the best Queen song ever, when I have not even heard 1/20th of their music.   So I am a causal fan.  Nothing wrong with that.  And you are right, music has degraded somewhat, but everybody has their moments.  In fact, I like Linkin Park because I can relate, and unlike most of the preppy idiots who put them on repeat for so long it drives me insane, I heard their music long before many others.  Therefore, I have a right to enjoy them.  But in general, yes, today's music is crap.  There's hope, though.  The metal revolution will florish.\n\r\nOne day...\n\r\nI hope...\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nI guess the meaning of this song is that his mom killed him for bringing him in the world. As soon as you are born you start to die.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nHey guys, \n\r\ni think that this song is about the struggle of nazi germany. seeing as i thought germany should have won WW2 my interpretation of the lyrics are better that the rest. SEIG HEIL HEIL! MEIN FUHRER! HEIL HITLER! \n\r\nRudolph Hess is a sick cunt, or was, is he dead yet?? \n\n\n\r\nwtf? that is the worst interpritation(sp) i've ever heard..for any song.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nMy favorite song. It's so intense and beautifully written. I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\n...Just so you know, lipgloss, yelling out like that and trying to make yourself look more high and mighty than any other human on the planet only solidifies your place as a complete and total buffoon.  If you are still angry about something that happened over 50 years ago, then you, my friend, need a life.  Hopefully whatever God you worship will show you mercy at your gates; however, when you seem so solidified with an evil dictatorship as you are, then I doubt any mercy shall be given.\n\r\nFare thee well.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nits like an opera\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nI know Freddy said that this song doesnt mean anything but I dont believe that.  I do think pkjun's idea is a definite possibility but I have a different idea that I really believe is what its about.\n\r\nFirst of all, has anyone ever actually looked up Bohemian in the dictionary?\n\r\nBohemian= a person with artistic or literary interests who disregards conventional standards of behavior\n\r\nBasically i think this song is all about nonconformity of artists, thus it is the 'rhapsody' of a Bohemian...\r\ni think maybe its irony that hes basically apologizing for going against society to follow his heart with his original but unconventional music or other work\n\r\nThe part  \"Mama just killed a man\" \r\nI interpreted as a metaphor for how 'sinful' his nonconformist actions are seen as by society\r\nAnd \"Mama, life had just begun \r\nBut now I've gone and thrown it all away\"\r\nThis is i think society saying that he threw his life away, wasting it on his unconventional hobby/job of writing music instead of entering the business world or something like that like society would say he should...because in this world most people just do what will make them the most money\n\r\n\"Scar-a-mouche, Scar-a-mouche, \r\nWill you do the Fan-dan-go.\"--as shown in the definition above, a scaramouch is a \"boastful coward\"\r\nI think this represents the government or other authority, who boast their power and act tough by following society's path, but they are cowards because they just follow footsteps of other people because they don't have the courage to make their own path\n\r\n\"Spare him his life from this monstrosity.\"\r\n--While the usual meaning of monstrosity is something very large, it can also mean \"something deviating from the normal\" (aka something unconventional...), and they are saying forgive this poor boy for speaking/acting his mind\n\r\n\"Bielzebub has a devil put aside for me\"\r\nbasically again saying how sinful the society sees his unconventionality as\n\r\nThen \"So you think you can stone me and spit in my eye. \r\nSo you think you can love me and leave me to die. \r\nOh, baby, Can't do this to me, baby\"...i think this represents the actions of society, even his close friends and/or family, turning their backs on him because they care more about their reputations than they do about him, and they don't want to be looked down on for being on his side\n\r\nThat's basically it...\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nDhaval - \r\ni read 'The Stranger' 5 years ago and thought the exact same thing.  I gave a copy of the song to a friend who just finished reading the novel in a lit. class and she also was amazed at the parallel of this song and 'The Stranger.' It would be intersting to know if the two are intentionally related.  Maybe i'll ask my friend to bring the song into her class and a little curiculum change will be inspired to include this topic in other lit classes.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nThis is what i've found from my informal and laid back research the past couple years: Freddie died in 1991, Wanyne's World came out in '93. Hmm.\n\r\n Next, AIDS? do come now! Innuendo, Mr. Bad Guy (Freddie's solo effort), and Miracle are more likely to be about aids considering they were written and released very close to his death. \r\nNext, Queen music is greatly about religion, mostly Freddie's and Brian's, just look at the Album's Queen, and Queen II. Freddie was Zoroastrian, which is a persian faith based on balance (paralells to Star Wars as well) The first two albums are almost entirely about it, i won't into details now, but if any one has questions bring them up, maybe i'll have more time later. So for now i'll give you the crash course on Boh Rhap. now for all of you zealous people on here that will get upset because you don't agree just listen, and this isn't what the whole song means either, or any of the songs, just plenty of parallels. \r\nIn Zoroastrianism there are two main dieties, Ahura and Angra (the exact spellings are subject to translation) or in a different approach \"Phoenix\" and \"Lilly\", Phoenix was the god of good, and Lilly the opposing force. Freddie saw all of this in himself, and considered himself the Phoenix, in his life's \"fairy tale\" (not the phoenix of the universe, mind you) this song appears (through my research) to be apart of the \"cosmic battles\" of the Zoroastrian faith. The opposing forces are seen in Bohemian Rhapsody, as well as the redemption in the narrators mind, the faith  also believes that after downward spiral the universe will be redeemed by Ahura or Phoenix. \r\nMany of the other interetations seem to be rather close, to the over lying story esp. the one with the shock process, becuase there was an actual event documented in the early 70's that Boh Rhap is supposedly based off of.\n\r\nThis may also be Freddie's auto bio. His religion fits all the better if it is autobiographical.\n\r\nYes, Freddie said he doesn't know what it means, but it was probably just away to get the press and public away from him on this song, it was the same tactic Don McLean Used for American Pie (nothing to do with the movies) to deal with the press.\n\r\nThere, i've suceeded in completely confusing you, I'm sorry, but if I've made any mistake in the religious aspects please tell me, and any question i'll try to answer.\n\r\n-Italian Phaethon\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nAlso, why does it sound like an opera? because it is. An opera is a storyline set entirely to music, yes there are different movements, why? yes, you guessed it becuase it's a mock opera. And the storyline? the guilt pattern factor discusses by several people earlier. Also, with the  actual event i told of.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nit reminds me of my prom :(.... class of 2003\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nrock!\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI was always taught that this song was about the Vietnam War, and it makes sense when going simply by the words as they're written. In the first few stanzas, the boy is a recluctant participator, assuming he was drafted like most kids were. In the second half (\"let me go\" etc.), he's obviously trying to get out of serving in the war, while in the last stanza (\"do you think you can stone me and spit in my eye\"), the boy has returned home and, like most Vietnam veterans, welcomed by absolute hatred for the atrocities they commited, though they didn't have much of a choice in the matter. After the initial anger at such a nice homecoming, the boy just doesn't care anymore (\"nothing really matters\"). As for why there's so many spiritual references in it, it's my assumption that in times of life and death and utter desperation, you'll pretty much beg for help from anyone or anything, from Allah to the devil, or even a Spanish folk dance. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nWow, this is a very interesting take on it. And also very convincing. However, the only reservation is why a British Rock group that stayed way from their own gov't's affairs would write something about America's. But thankyou for that thought, it is very interesting, brings me closer to a final answer for my research paper\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nI suppose Vietnam was just one of those things that affected you, no matter how apathetic you tried to be or whatever country you were from.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nthis song still sends goosebumps through my whole body greatest song ever\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nI feel this song has to do with suicide.\r\nMama just killed a man - Just killed himself\r\nLife had just began and now I'v gone and thrown it all away\n\r\nI don't want to die I sometimes wish I'd never been born at all\n\r\nThen the bit in the middle is the termoil between heaven and hell or Life and Death.\r\nMama Mia let me go - Let me die\r\nBelezabub has a devil set aside for me - I'm ready to die\r\nThe next bit is just his anger at life and mabey justifying why he is angry\r\nNothing really matters anyone can see nothing really matters to me- does he die or is he still alive ?\n\r\nAnyway the wind blows- Life or death doesn't matter\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nI think alot of your are kinda msesing up the meaning of this song...you might think hes the one who killed the man but the first line says-\r\nMama just killed a man \r\nPut a gun against his head \r\nPulled my trigger now he's dead\r\nMama, life had just begun \r\nBut now I've gone and thrown it all away-hes going to take the blame for his mothers killing the man.\r\nMama Didn't mean to make you cry.-his mother dosnt want him 2 take the blame but he insists\r\nIf I'm not back again this time tomorrow \r\nCarry on, carry on As if nothing really matters. -he wants her 2 forget about him\r\nToo late, my time has come, \r\nSends shivers down my spine, \r\nbody's aching all the time. \r\nGoodbye, ev'rybody I've got to go -hes getting the death penalty\r\nGotta leave you all behind and face the truth -his mother knows she killed the man not her son\r\nMama, I don't wanna die, - hes scared\r\nI sometimes wish I'd never been born at all \r\nI see a little silhouetto of a man -hes seeing the man his mother killed\r\nScar-a-mouche, Scar-a-mouche, \r\nWill you do the Fan-dan-go. \r\nThunderbolt and lightning, \r\nvery, very frightening me. \r\n(Galileo) Galileo \r\n(Galileo) Galileo \r\nGalileo figaro Magnifico \r\nI'm just a poor boy and nobody loves me. \r\nHe's just a poor boy from a poor family. \r\nSpare him his life from this monstrosity. -they want to spare him\r\nEasy come, easy go, will you let me go, \r\nBismillah! No we will not let you go \r\n(Let him go!) \r\nBismillah! We will not let you go -this whole section there debating whether to kill him or not\r\n(Let hime go!) Bismillah! We will not let you go \r\n(Let me go!) \r\nWill not let you go \r\n(Let me go!) \r\nNo, no, no, no, no, no, no \r\nOh mama mia mama mia \r\nMama mia let me go. \r\nBielzebub has a devil put aside for me, -he thinks hes going to hell\r\nFor me, For me. \r\nSo you think you can stone me and spit in my eye. \r\nSo you think you can love me and leave me to die. \r\nOh, baby, Can't do this to me, baby, \r\nJust gotta get out, just gotta get right outta here. \r\nNothing really matters, Anyone can see, \r\nNothing really matters, Nothing really matters to me. \r\nAnyway the wind blows.-he wants her to forget him and just go on with life\r\nI personally love this song because its got so much truth\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nItalian Phaethon knocked onto a point many of you are forgetting. Do any of you know what a \"rhapsody\" is? it is a short opera-like story set to music. Yes this is a short mock-opera. Most rhapsodies have 3 movemtens, sometimes more. There is the opening movment realizing he's killed a man then next is him talking to his mother, the secondis the trial, the third is his anger at those who judged him. all in all this is just a mock-opera, a story set to music. I have never met any of the remaining members of Queen so i can't say if freddy told them a true meaning, but as so far, this is the meaning i see.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nI'm not sure what this song means, but I know that I absolutly love it ^_^\r\nIt must be bursting with symbolism that no one can understand but the great Freddie Mercury himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nWow, this was the first Queen song I've heard, and I didn't like it much at first, but it grows on you once you really listen to what it means.  I used to think classic rock was all dry and unoriginal, but man, they really hit something that music today is missing.  And now I realize it's far from dry, even though bands like Aerosmith are emulated (read: copied mindlessly) all the time.\n\r\nDiety03, I thought his \"mamma just killed a man\" at first, too, although if you place a comma in there: \"Mamma, [I] just killed a man.\"  It really changes the meaning of the song either way.  Maybe it was meant to be like that.\n\r\nIn the 'trial' part where he says \"Thunderbolt and lightning, very, very frightening me,\" it could be a reference to the electric chair, reinforcing the trial/execution theme.\n\r\nTowards the end where he says \"So you think you can stone me and spit in my eye? So you think you can love me and leave me to die?  Oh, baby, Can't do this to me, baby, just gotta get out, just gotta get right outta here,\"  he's talking to his girlfriend, trying to convince her to help him escape, but she seems to have reservations on abetting a criminal.  Don't know if that was the real meaning, but it's what seems to come to my mind.\n\r\nAnd basically, all that Pkjun said.  He covered all the good psycological ties you can relate it to.  And like TheAntiPoser said, we're not going to know exactly what it means, but the fact that it means something so powerfully personal makes it work, even if we can't understand the meaning.\n\r\nIf you want to relate it to AIDs and homosexuality you can, although it seems irrevelent.  Maybe we can get drugs in here, too.  He's on dope, so nothing really matters, while under the influence he accidentally kills someone, he's on dope at the trial so he gives such a lame defense, and at the end he's mad at the drugs for loving him (giving him that warm fuzzy feeling drugs do) and then leaving him to die (be executed for his stoned actions).\n\r\n*Note: the last paragraph is dripping for sarcasm for all of you who missed that.  I was trying to show that you can relate it to anything controversial if you try hard enough to pull it out of your ass.  But go ahead and discuss whether it was dope or LSD; it dosen't really matter... to me. *singing*\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nI know that this really doesn't have too much to do with the lyrics, but this is my take on it...\n\r\nThere is a kid who wants to committ suicide, and the whole song is about his struggle.  When it gets to the strange part in the middle (I see a little sillouette of a man...), it is like something is keeping him from not doing it.  Eventually, he doesn't do it.  Although the person is still frustrated, he didn't kill himself.\n\r\nThat is what the song means to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nI really DO think it's about homosexuality. The biggest example is the \"Galileo\" part, since Galileo was forced to give up his views. \"Spare him his life from this monstrosity.\" could mean stop the pain he feels because of his homosexuality. The \"Bismilah\" is how religion condemns homosexuality, thus he needs to let go of it \"in the name of God.\" The \"Beelzebub has a demon put aside for me.\" is his coming in acceptance that if these religions are true, he's going to Hell.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nI don't think it's about freddy's battle with aids. He's telling his mom he just killed a man, shot him I expect, and now he's gotta face the music. Hence \"If I'm not back this time tomorrow, carry on\". When it goes into the opera-like part, \"Scaramouch scaramouch will you do the fandago,\" I've always pictured him cornering a little fat man and making him dance, like with bullets, you know that phrase... \r\n         When they do that whole \"will you let me go\" thing, it's the little fat man pleading for his life, but he's not gonna let him go. \"Beelzebub has a devil put aside,\"- he's saying I've commited a crime and now there's a place for me in hell.\r\nThat's about it for me, although I have to say I do agree with the vietnam war thing. that makes a lot of sense as well. I bet that even if you asked queen themselves, they would have more than one meaning for this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nWell, this is what I think.  When he says he just killed a man, he's referring to the killing of himself.  I think it is the death he has inflicted upon himself through his lifestyle (ie, acquiring AIDS, drug abuse, etc).  He's also afraid of how he has lived, when he begs \"i dont wanna die\" in dialogue with his mother.  He adds, \"if i'm not back this time tomorrow, carry on\" trying to give strength to his mom.  The interlude with \"bismillah\" speaks to the religious aspects and reprucussions he may face.  The final segment, the rocking guitars signify his defiance towards the partner who gave him AIDS:  \"So you think you can love me and leave me to die.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nEveryone on here is going to criticize my view, but since Freddie has been quoted to have said the song \"was written\" about nothing, this doesn't mean its \"about\" nothing\".  Everyone has their own interpretation. Personally, since it seems like it sort of just came to Freddie out of nowhere, I think that it came to him as a sort of foresight, since even thought it wasn't written about AIDS (yes, i know this - so don't post how it was written before AIDS was an epidemic), it can still be applied to his situation with AIDS and make sense.  Bismillah makes sense (well about as much sense as it makes in any situation), as crying out to God in asking for another chance to live (after all, weren't Freddie's parents muslim or something?).  As for the whole \"Beelzebub has a devil set aside for me\" this could apply to Freddie's party-boy lifestyle and how it was sinful.  I just think it's weird how this can be APPLIED to his situation later in life with AIDS - even though I KNOW it wasn't written about AIDS (obviously)....and I still think its kind of eerie how it came to him apparently out of nowhere and almost predicted his future.\n\r\nI also happen to like pkjun's interpretation - it fits very well.\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nbohemian rhapsody is one of favorite songs, queen being my favorite band of all time.  i love freddie,and people say all that no its not about aids he did this before he had HIV.  well apparently he had it earlier then, adn didn't want anyone to know. its completely obvious it is about aids.  \"just killed a man put a gun against his head pulled my trigger now hes dead\", thast easy enough to figure out.  you cant blame him for not wanting to tell people what it was about.  he hadn't come out then yet i dont think, he might have still been in a relationship with mary austin (that who he is talking to in the song \"momma\" is her, they went out and after they broke up because of his sexuality, they were best friends for the rest of is life he gave his entire estate and fortune to her)  the song is a work of art, while singing the song to a friend of his after the emotional piano part he said \"no heres the opera part dears!\".  the song is 5:55 and played on the radio to no end, completely unchanged in its orginal length.  i hope this song never is forgotten, its appreciated by so many people too, people who like the opposite type of music like, still liek this song, which is rather extraordinary.  the song is so emotional and beautiful, he truly pours his heart out, then it goes into a fantastic opera part, and rock part, and finally fades back into the begining, it is just ONE brilliant example of queen and freddies genius. anyone who likes this song, i suggest you get more into queen, you'll never regret it, they're amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nOne of the greatest songs ever made. It's THE Queen trademark song although I like all their songs. Freddie Mercury was indeed a musical genius and he had such a great voice. What exactly this song means is difficult to answer because Freddie never revealed it. I know for sure that it has nothing to do with AIDS because when Freddie wrote this song in 1975, the disease wasn't known yet. He got infected with the HIV-virus in the eighties so that can't be the reason he wrote the song. We will never know what the song is really about but actually it doesn't matter... it's a piece of Freddie Mercury and it will always be a classic.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nthis song is both glrified and ruined by wayne's world.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nIt's about nothing. The more I listen to it, the more I am convinced of that. It's just a bunch of operatic nonsense. Genius nonsense, but nonsense all the same.\n\r\nIf that's not enough proof, witness this section from the musical We Will Rock You.\n\r\nPop puts the tape into the player. The opening harmonies of Bohemian Rhapsody start playing.\r\nTAPE: IS THIS THE REAL LIFE? \r\nIS THIS JUST FANTASY? \r\nCAUGHT IN A LANDSLIDE, \r\nNO ESCAPE FROM REALITY? \r\nOPEN YOUR EYES, LOOK UP TO THE SKIES AND SEE... POP: That's all there is. The rest, unfortunately, is an episode of something called \"The Flying Doctors\"\r\nGALILEO: Wow. What we heard was so beautiful! But what does it mean? \r\nPOP: Isn't it obvious? Is this the real life, is this just fantasy-y-y-y-y? \r\nSCARAMOUCHE and GALILEO look lost.\r\nPOP: Cyberspace! The scroll speaks of a soulless, virtual world where the kids will be caught in a landslide of computer recorded anodyne pop. C, R, A, P- \r\nGALILEO: Crap! \r\nPOP: Exactly! The text predicts a time when crap would dominate the charts. It begs the kids to open their eyes- \r\nGALILEO: Look up to the skies- \r\nBOTH: (singing, out of tune) And see! SCARAMOUCHE: Wow. So you really think that's what it meant? Ha. And there's me thinking it was just a load of pretentious old bollocks!\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nThis song has no meaning, just a fun and great song\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nMe and my friends have come to the conclusion that this song isnt as complex as ppl think. The character, we will call him Fred, kills a man, and tells his mother. Of course he has to go, he hears sirens, but nobody knows he has done it. So, he finds a hideout. He does heroine, or some drug that lets you see things. He of course sees the Devil, and Angels fighting over him. He begs for mercy at the devils and the angels take his side, but they fight way too much, and he cant take it anymore. He runs out of the hideout and just keeps running. When the tempo slows down from the fast paced guitar solo, thats when he is caught. With his mother looking down on him, cause she knew. And the whole time, he is telling this story in his cell at jail. And all of a sudden, two wardens pick him up and put him in an electric chair, and the last note is them pullin the switch.   I doubt this might be the real meaning, but it would make for a kick ass music video.   QUEEN ROCKS!\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\n......*and continue after my fag frei\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nsee I h8 fags, especially those who click add before i finish my typing..........argh\r\n wish tahtey would die of \r\nAIDS\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nsee I h8 fags, especially those who click add before i finish my typing..........argh\r\n wish tahtey would die of \r\nAIDS\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nsee I h8 fags, especially those who click add before i finish my typing..........argh\r\n wish tahtey would die of \r\nAIDS\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nsee I h8 fags, especially those who click add before i finish my typing..........argh\r\n wish tahtey would die of \r\nAIDS\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nsee I h8 fags, especially those who click add before i finish my typing..........argh\r\n wish tahtey would die of \r\nAIDS\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nsee I h8 fags, especially those who click add before i finish my typing..........argh\r\n wish tahtey would die of \r\nAIDS\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nsee I h8 fags, especially those who click add before i finish my typing..........argh\r\n wish tahtey would die of \r\nAIDS\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nARGH>>>>>>>>>>>\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nOOOPS\r\n Well now athat that idiot is tied up and i can finsh my\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nOOOPS\r\n Well now athat that idiot is tied up and i can finsh my\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nOOOPS\r\n Well now athat that idiot is tied up and i can finsh my\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\ni guess ill never finish my comment, so....\n\r\n*OneWingAngel - PWNs you all*\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\ni guess ill never finish my comment, so....\n\r\n*OneWingAngel - PWNs you all*\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\ni guess ill never finish my comment, so....\n\r\n*OneWingAngel - PWNs you all*\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\ni guess ill never finish my comment, so....\n\r\n*OneWingAngel - PWNs you all*\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\ni guess ill never finish my comment, so....\n\r\n*OneWingAngel - PWNs you all*\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\ni guess ill never finish my comment, so....\n\r\n*OneWingAngel - PWNs you all*\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\ni guess ill never finish my comment, so....\n\r\n*OneWingAngel - PWNs you all*\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\ni guess ill never finish my comment, so....\n\r\n*OneWingAngel - PWNs you all*\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\ni guess ill never finish my comment, so....\n\r\n*OneWingAngel - PWNs you all*\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\ni guess ill never finish my comment, so....\n\r\n*OneWingAngel - PWNs you all*\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\ni guess ill never finish my comment, so....\n\r\n*OneWingAngel - PWNs you all*\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\ni am not an abuser just a guy with asses for friends......who are abusers\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nThis song, at least the music, is in a style from the 18th century, not used very much anymore...it goes from very low in the beginning, reaches the climax in the middle, and then tapers off to about the same speed/intensity as the beginning...how i like to look at this mini story is a \"bohemian\" would sing this on a sidewalk, you know and have the whole hat thing and be collecting change lol....really dumb, but i think its funny\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nTHIS SONG IS FUCKING CLASSIC!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nAn example of that it really does not matter what you say but how you say it ... or sing it.\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nA quote from Roy Thomas Bake about how the piece was writtenr: \"Freddie was sitting in his apartment and he said \"I've got this idea for a song\" and he sort of sat down and he sort of started playing the song and it was all going along good, you know, and he had some words missing and some bits of melody that he hadn't quite worked out, but it was just the basic framework of the song. The he was playing away and he stopped and he said \"Now dears, this is where the opera section comes in\" and I went oh, my god! So we said, \"Oh OK, this is the opera section\" and it was just gonna be at the time a little brief interlude of a little bit of you know a few little things like Galileos. So we said OK, fine , stick a few little Galileos and then we can get on to like the rock part of the song. It started off as a ballad and then there's the opera section and then it went on and on. As we got into the studio we started formatting the song which we had to record it in sections because it was actually designed in sections, so we recorded it in sections and everything was fine. We did the ballad section and then we did the rock section going back to the ballad section - if you hear the song you understand what I mean. And we left a blank piece of tape to do the opera section. When we started doing the opera section properly, erm, it just got longer and longer and we just kept adding blank tape to this thing and it got bigger and bigger and bigger. Every day we just sort of thought \"Oh, this is it, we've done now\" and Freddie would come in with another lot of lyrics and say \"I've added a few more Galileos here dear\" and so we would put on a few more Galileos and it just got bigger and bigger and bigger and in the end it became the epic we all know.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\npkjun I think your interpretation is the most logical :)\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\n200th post for this song\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\ndude :D make it 201\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nyrs ago pkjun made a great comment. truth is it couldnt be about AIDS as it was originallly written. However, i feel that if someoone wants to interpret this as a song about Mercury's greatest battle then let em [provided we point out it wasnt originally about the AIDS and so forth bla bla bla]. Also thanx to Wyrm for that final enlightenment there-if its true well then mystery solved after all. I can definitely see how it couldve been written in sections. i sing with an a cappella gp and we just did this song. when we were learning it we had to do it in sections. though the result was kickass[ in that in flowed and blended well]- it was still a matter of cut and paste, cut and paste.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nOk, My few cents to this.\r\nI have bought all Queen albums, I read a queen biography and stuff so I'm a bit into things..\r\nMy interpretation is that it is about someone in the life of Freddy or someone of Queen. They fired their manager, \"death on two legs\" was dedicated to him so this could be him.\n\r\nStarting the song, a guy thinks, he doesn't need noone and says, that life has got no consequences, \"I need no sympathy\" \"liitle high, little low\", \"nothing really matters\".\r\nThen he kills a guy and realizes that this will have consequences. He fears death, he gets into the court (heavenly or not..), he turns the truth for his good \"nobody loves me\". Before it was \"I need no sympathy\". So this guy said he doesn't need anyone and then he told the court he got noone to help him..\r\nThen this court thing was over (perhaps it was just a dream like opened in \"open your eyes, look up to the skyes and see\".\n\r\nThen the real thing is told (the music now gets really emotional.. this means now they really want to say something): Freddy has someone who is stoning him, spitting at him and loving him and leaving him to dye. \"Can't do this to me baby\": Isn't this clear that this is about a woman or a man he loved (he was bisexual)? I mean \"baby\" is apparently means a romantic relationship. So he hopes that she takes responsibilty for her actions. But as she doesn't he sais \"just gotta get out of here\". \r\nBut the girl/guy just says \"nothing really matters\", I don't have to take the consequences.. and this song is just ironic about this person.\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\npkjun is right, and it has NOTHING to do with AIDS! This was written is the mid-70's, and AIDS wasn't DISCOVERED (this doesn't mean it didn't exist!!!!) until mid-80's! The next person that says that is gonna have to deal with their TOTAL LACK OF BRAIN. Or they're all closeminded, and refuse to accept that anyone else is right.\n\r\nGreat song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nthis song means awesomosity to me :D\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\njust a little addon:\r\nListen to the song closely (for instance with headphones) to the different characters that appear in the song. Since the whole thing is a sort of opera piece, they put in some characters.\r\nThe guy that is telling the story is a mono voice that is in the center.\r\nThe part \"So you think you can stone me and spit in my eye.\" is NOT mono so this is not the main character singing then.. just kindof supports my interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nah yes.. if you are interested, go there (not my site..). Has some parts of his interepretation about the song and also an interpretation like the AIDS one this guy later has taken back..\ngeocities.com/SunsetStrip/Arena/5518/…\n\n\n", "comment_224": "\nno idea what it means but i love it queen i like all the funky words to TOTALLY AWSOME\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nI LOVE THIS SONG... and its not \"so you think you can 'STONE' me and leave me to die\" phred\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nis it so you think you can stop me?\r\nthat might change a few things...\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nno, it is \"so you think you can stone me and spit in my eyes\". As in the original booklet. And I don't hear anything different in the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nby the way, even though aids may not have been discovered, freddie may still have known he had a deadly disease, im just making a point\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nMaybe it's about coming out of the closet to the singer's family?\n\r\n\"Is this the real life? \r\nIs this just fantasy? \r\nCaught in a landslide, \r\nNo escape from reality\"\n\r\n- There's no escape from the truth that he is infact a bi/homosexual and that it's something that may be frowned upon.\n\r\n\"Open your eyes, \r\nLook up to the skies \r\nand see,  \r\nI'm just a poor boy \r\nI need no sympathy\"\n\r\n- Wake up to the fact that being a bi/homosexual is a life choice, it's not a disease of whatever sort. Nobody has to feel sympathetic about the fact he is a bi/homosexual.\n\r\n\"Because I'm easy come, easy go \r\nLittle high, little low \r\nAny way the wind blows doesn't really matter to me \r\nto me \"\n\r\n- It really doesn't matter what anybody else thinks because he is what he is and it's not going to change.\n\r\n\"Mama just killed a man \r\nPut a gun against his head \r\nPulled my trigger now he's dead\"\n\r\n- Breaking the news to his parents, coming out of the closet and the torment it may have put his mother and father through. Maybe even the fact that his mother knew before his father and had broken the news to the father herself. Instead of pulling \"the\" trigger she pulled \"my\" trigger, meaning saying it for him.\n\r\n\"Mama, life had just begun \r\nBut now I've gone and thrown it all away\"\n\r\n- Thrown away a home life by being the way he is.\n\r\n\"Mama \r\nDidn't mean to make you cry. \r\nIf I'm not back again this time tomorrow \r\nCarry on, carry on \r\nAs if nothing really matters.\"\n\r\n- I feel that's pretty straight forward. Running away from home or leaving to think about what has happened.\n\r\nI'll post some more of what I think if anybody shows any interest in it. If you've read thanks for lending an ear.\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nHoly shit this is THE best song ever made. Its got so many different styles going on in it, its great. I love the line \"Mama just killed a man, put a gun against his head, pulled my trigger now he's dead\". tis cool. Its prolly about his bad luck and how the person in the story feels trapped with no way out cuz he has to take the blame or brunt for something someone did.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nthis song is the greatest song ever. i wish i was born when it came out. freddie mercury was the greatest singer ever. queen were the greatest band ever. i think when freddie mercury wrote this song it was when he had only just come out of the closet. The darkness are good too but are not as good as queen. bohemian rhapsody is like four or five songs in one it is brilliant\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nholy shit i dont think there is ne one on the planet who has studdy this song more then me i could tell you what every word means and why freddie murcury said it in and out i swear this is like my song i would tell yall right here but like yeah thats alot to post ya know but if you actually dont believe me and you wanna test my skills with this song or if you actually just wanna talk about it hit me up cuz i always have time when it comes to this song  QUEEN FUCKING ROXS MY SOCKS OFF!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nBest Scene in Waynes World is in the car with this song. <3\n\r\nI don't care what it's about. The song is fucking excellent, hands down. Queen was/still IS one of the best bands ever in history.\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nA month ago I managed to convince myself I was infected with HIV... Don't know what the answer is yet (can't get conclusive test til August) but I'll say that the day after, I listened to this song and it jumped out at me as reflecting ALL my feelings about life at that moment.  I find it hard to believe it's not about hiv.  I think it's the lament of someone who's just discovered they're positive.  And I know AIDS was not linked to hiv until the 80s, but then maybe it was folklore or something... i.e. maybe everone in the relevant communities new the deal or something.  Anyhow, here's my breakdown...\n\r\nIs this the real life? \r\nIs this just fantasy? \r\nCaught in a landslide, \r\nNo escape from reality \n\r\n**He can't believe what's happenning- it seems like a bad dream**\n\r\nOpen your eyes, \r\nLook up to the skies \r\nand see, \r\nI'm just a poor boy \r\nI need no sympathy\n\r\n**blames himself for what's happenned**\n\r\nBecause I'm easy come, easy go \r\nLittle high, little low \r\nAny way the win blows doesn't really matter to me \r\nto me \n\r\n**nothing seems important because he's soon going to die a horrible painful death**\n\n\r\nMama just killed a man \r\nPut a gun against his head \r\nPulled my trigger now he's dead\n\r\n**yes, he infected someone before he knew he had the disease**\n\n\r\nMama, life had just begun \r\nBut now I've gone and thrown it all away\n\r\n**self-explanatory**\n\r\nMama \r\nDidn't mean to make you cry.\n\r\n**when he told her about his infection**\n\r\nIf I'm not back again this time tomorrow \r\nCarry on, carry on \r\nAs if nothing really matters. \n\r\n**he's considering suicide**\n\n\r\nToo late, my time has come,\n\r\n**the disease is incurable**\n\r\nSends shivers down my spine, \r\nbody's aching all the time. \n\r\n**these are symptoms of hiv infection**\n\r\nGoodbye, ev'rybody \r\nI've got to go \r\nGotta leave you all behind and face the truth\n\r\n**needs some time to think??  not quite sure about this one**\n\r\nMama, \r\nI don't wanna die, \r\nI sometimes wish I'd never been born at all \n\r\n**self-explanatory again**\n\r\nI see a little silhouetto of a man \r\nScar-a-mouche, Scar-a-mouche, \r\nWill you do the Fan-dan-go.\n\r\n**flirting with a man?**\n\r\nThunderbolt and lightning, \r\nvery, very frightening to me. \n\r\n**sexual fireworks**\n\r\n(Galileo) Galileo \r\n(Galileo) Galileo \r\nGalileo figaro Magnifico \r\nI'm just a poor boy and nobody loves me. \n\r\n**outcast due to hiv**\n\r\nHe's just a poor boy from a poor family. \r\nSpare him his life from this monstrosity.\n\r\n**a plea to god?  ok, it gets a bit tenuous here i admit**\n\r\nEasy come, easy go, will you let me go, \r\nBismillah! No we will not let you go \r\n(Let him go!) \r\nBismillah! We will not let you go \r\n(Let hime go!) \r\nBismillah! We will not let you go \r\n(Let me go!) \r\nWill not let you go \r\n(Let me go!) \n\r\n**again, this is emphasising there's not escape from his predicament**\n\r\nNo, no, no, no, no, no, no \r\nOh mama mia mama mia \r\nMama mia let me go. \r\nBielzebub has a devil put aside for me, \r\nFor me, \r\nFor me. \n\r\n**it's a personal thing because you can't really talk about it, and no-one would understand anyway**\n\n\r\nSo you think you can stone me and spit in my eye. \r\nSo you think you can love me and leave me to die. \r\nOh, baby, Can't do this to me, baby, \r\nJust gotta get out, just gotta get right outta here. \n\r\n**he's defiant and wants to make the best of his life despite everything**\n\r\nNothing really matters, Anyone can see, \r\nNothing really matters, Nothing really matters to me. \r\nAnyway the wind blows.\n\r\n**he still feels everything is really futile**\n\n\r\nok, that's what i thought.  I know its a bit buggered chronologically, but what does everyone think?\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nWhy shouldn't he have been? Why does it bother you so much?\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\ni love it! it was the best performance at my spring chorus concert1the choral ensemble did a great job!i would of loved to be part of it! i used to know this song when i was like three. my dads got videos of me singing it.\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nI am not sure what the first half is about, but the 2nd half is definitely some kind of trial, whether actual and legal, or in his head. If it's real, it's because he's killed a man. thunderbolts and lightning are the chair. If it's mental, (and this is unlikely due to the whole written in 75 thing) it is because he has AIDS and feels condemned by society. This is a trial  in \"the wall\" type sense. Maybe it was scarily prophetic. Perhaps Freddy knew he had something, it just wasn't called AIDS yet.\n\n\r\neither way great song\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\ndudes, everyone talking about the song regarding aids is a top-notch ass-hat - and no one said aids didn't exist prior to 1985, just that no one knew what it was and it would therefore be something of a disadvantage when writing a song about it.  Anyway, my dad and a load of my 'friends' actually thought that it was the mother who'd killed someone, based, presumably, on the line 'mama just killed a man'. sweet zombie jesus\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nAlthough no one will ever know if Freddy Mercury was aware of his HIV status at the time of writing this song, it should be noted that the gay community was very aware of this \"disease\" that was permeating thier community. His references do have eerie references to feelings generated when someone is diagnosed with a chronic or terminal disease. In addition, he also referances his bisexual life style \"anyway the wind blows\". No matter what this song is about, clearly Freddy was a musical genius and his death has left a large void in our world.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nthis song is has a big impact on me. I don't know what or why, but it does. He was not Bisexual. He was one of the gayest people. My mom went to one of his concerts when she was young. He is gay, not bi or strait\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nI think this is one of the finest songs ever.  I know most Queen songs, too, and this is one of their best.  \n\r\nI'm very sorry to see people ridiculing each other's interpretations.  It is one thing to correct someone's facts, or discuss what they said politely, but remember that a song can mean something different to every individual.  That doesn't make the song any better or worse.\n\r\nIt's been interesting to read people's interpretations.  The thing is, there isn't one \"right\" interpretation.  Sure, the group or writer may have had one meaning, so that's obviously interesting, but as I'm learning in my English classes, any work can have infinite interpretations, and that is how it is supposed to be.  Of course, some are incorrect when they say \"Freddy meant it to be this...\"  But anyway, it's fascinating to see what some people have suggested.\n\r\nthe Vietnam War\r\ndeath penalty\r\nsuicide\r\n\"The Stranger\"\r\ntrial\r\nbisexuality\r\nsheer silliness\r\nMary Austin\n\r\nThese are probably the most interesting elements to me.  The AIDS explanation is interesting.  It is indeed true that it wasn't researched until 1980 and all that, and it is indeed true that in the late 70s, gay communities were realizing a terrible disease was spreading amongst them.  The odds are very low that in 1974 or 75 Freddy Mercury knew about all this and was so affected by it that he wrote a song.  Still, it isn't 100% impossible.\n\r\nIt's always fascinating to know what an artist meant by a song, but look at what the question is right above the comment box.  It says it all.\n\r\n\"What does this song mean to you?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nOH I totally forgot the BEST PART about this song for me.\n\r\nTwo years ago, when I was a junior in high school, my concert choir sang this.  And we \"did it proud.\"  There was no way we were gonna mess up a song this awesome.  We did it in a fun way.  Usually we wore long purple robes and stood still, but right from the beginning, we did funny \"interpretive\" choreography.  We interpreted it as having a trial in the middle.  One guy played the \"poor boy\" and others dragged him off during the trial scene.  Later he returned, at the end.  The best part was during the guitar solo (one guy played electric guitar really well) when we all tore off our robes!  We all had on black pants and different-colored T-shirts.  At the very end, one guy hit a gong.  We were the hit of the show.  It truly was my best memory of high school choir.\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nFuck, how sad and fuckin slack are all you cunts, all you have to say is that the song is good, don't have a fuckin bitch fest about what the song is about.  Free will says that you can have your own opinion.\r\nTo me, this song is about butterflies and candy.\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nActually, I'm pretty sure that the song is about killing a man and regretting it and wanting mercy because he's just a poor boy.\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nThis is without a doubt the best Queen song ever written. It's so powerful, but you also get some whimsy in the second \"movement\", as it were. \"Galeleio\", \"Bismillah\" and \"Fandango\" are now popular words in my vocabulary.\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nSorry...one last thing. I think that this song is a metaphor for death. Seriously: \"Too late, my time has come. Sent shivers down my spine, body's achin'all the time, goodbye everybody. I've got to go. Gotta leave you all behind and face the truth.\" Read that over a few times and I think you'll see what I mean. It sounds like Freddie's final goodbye to me...although, I don't think it is...but anyway....\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nI LOVE THIS SONG!!!!!!!!  it is a song that never gets old!\n\r\n\\\\// Peace\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nI haven't got a clue what this is all about. I do know it's marvellously eccentric and absolutely mad. It's just all over the place and i'm all for variety...i love it. I love Queen. Great song, a total classic and it'll never be forgotten. Everyone loves this one!\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nBear with me here, I've got a pretty good take on it.\n\r\nIt starts like most people have said, with him killing a guy (no reason stated) and getting insanely guilt stricken over it.  Very sad stuff.  But then there's the scadamoosh.  I no one's really had a good take on that.  It's a trial, yeah, beyond that I think that it's a parody of the court system.  I mean, it's a trial with people telling him to dance the Fan-dan-go.  Think the last court room scene in Chicago, just an all out mockery of courts.  Then, like everyone says, the verdict is in: guilty.  This pisses him off and sends him nuts, i.e. the kick ass guitar solo.  Eventually he accepts his fate.  Thats my take anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nOne more thing, I've always thought the \"sends shivers down my spine, body's aching all the time\" part was deeper than just his guilt.  It definatly seems like death to me.  Anyway, I'm hoping someone agrees with me about the court parody theory.\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nhe was actually batttling AIDS. it is a very good song.......bye\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nHere's my whole run through.\n\r\nIs this the real life? \r\nIs this just fantasy? \r\nCaught in a landslide, \r\nNo escape from reality \r\nOpen your eyes, \r\nLook up to the skies \r\nand see, \r\nI'm just a poor boy \r\nI need no sympathy \r\nBecause I'm easy come, easy go \r\nLittle high, little low \r\nAny way the wind blows doesn't really matter to me \r\nto me \n\r\nPersonally, I think the song starts at the end, he is in jail telling his story.  The mood of this part just doesn't fit any other way.  That's how i picture it anyway.  So whatever happened to him, he doesn't care anymore and has given up.\n\r\nMama just killed a man \r\nPut a gun against his head \r\nPulled my trigger now he's dead \r\nMama, life had just begun \r\nBut now I've gone and thrown it all away \r\nMama \r\nDidn't mean to make you cry. \r\nIf I'm not back again this time tomorrow \r\nCarry on, carry on \r\nAs if nothing really matters. \n\r\nHe killed someone and is feeling extreme guilt about it.  He realized that he just basically ended his own life as well (... and now I've gone and thrown it all away) and thinks he will be caught very shortly (if I'm not back again this time tomorrow) and is telling his mom to go on living.\n\r\nToo late, my time has come, \r\nSends shivers down my spine, \r\nbody's aching all the time. \r\nGoodbye, ev'rybody \r\nI've got to go \r\nGotta leave you all behind and face the truth \r\nMama, \r\nI don't wanna die, \r\nI sometimes wish I'd never been born at all \n\r\nHe is fearing death, since he knows if he is caught it will come.  This part is rather self explanatory (and my favorite part of the song).\n\r\nOK, let's take this next part line by line since it is the most complicated.  He gets caught, and the \"opera\" section is the trial.\n\r\nI see a little silhouetto of a man \r\n(The executioner)\r\nScar-a-mouche, Scar-a-mouche, \r\nWill you do the Fan-dan-go?\r\n(The court is taunting him, calling him a buffoon [scaramouche] and telling him to dance.\r\nThunderbolt and lightning, \r\nvery, very frightening me. \r\n(They are threatening him with the electric chair.)\r\n(Galileo) Galileo \r\n(Galileo) Galileo \r\nGalileo figaro Magnifico \r\n(OK, this part I think was just random filler, maybe mocking the court system, which this whole scene seems to do with it's rediculousness and petty bickering.)\r\nI'm just a poor boy and nobody loves me. \r\nHe's just a poor boy from a poor family. \r\nSpare him his life from this monstrosity. \r\nEasy come, easy go, will you let me go, \r\n(He is pleading to the court, even saying easy come easy go in that there are plenty more living people out there.  This isn't exactly the best argument, but oh well.)\r\nBismillah! No we will not let you go \r\n(Let him go!) \r\nBismillah! We will not let you go \r\n(Let hime go!) \r\nBismillah! We will not let you go \r\n(Let me go!) \r\nWill not let you go \r\n(Let me go!) \r\nNo, no, no, no, no, no, no \r\nOh mama mia mama mia \r\nMama mia let me go. \r\n(The big fight, back and forth.)\r\nBielzebub has a devil put aside for me, For me, For me!\r\n(He is found guilty, he knows when he dies he will go to hell.)\n\r\nSo you think you can stone me and spit in my eye. \r\nSo you think you can love me and leave me to die. \r\nOh, baby, Can't do this to me, baby, \r\nJust gotta get out, just gotta get right outta here. \r\nHe just gets insanely pissed off that he is guilty and goes berserk.\n\r\nNothing really matters, Anyone can see, \r\nNothing really matters, Nothing really matters to me. \r\nAnyway the wind blows.\r\nA reprise of the beginning, back to where he started.  He just doesn't care even though he knows he is going to be killed.\n\n\r\nSorry for how long winded that sucker was, but thats my interpretation from the beginning and I think it's a damn good one.  I know most of it has been posted here before, but what I basically did was put all the best people's together and added a little of my own spin.  Anyway, that's my final opinion of the song.  Enjoy my brilliance.\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nI have no idea what this song is about, but i love it anyways. i mean, come on, who wouldnt love Queen???\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nI love this song! You should see when me and my friends are driving and this song comes on the radio, it completely turns into that scene from Wayne's World!\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nTHIS SONG IS P~I~M~P\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nGo to hell Ledskynyrd,  you fucking redneck.  So what if Mercury is gay, he is the best frontman in rock history and if you don't like it go screw yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\ni agree with roger daltrey, the microphone swinging is brilliant, but come on, plant?  I have the led zep dvd and frankly he didnt offer that much as a front man.  The show was all in Jimmy, not him.  He just kinda stood there.  Not to see his singing isnt great, but as far as a showman he didnt have that much to offer.  And if you read over your comment it definatly sounds rather rednecky.  \"thank you\"\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\ni think the song is about a boy about to become a man and is haveing some toubles at home.  one night he has a nightmere about killing someone and wakes up confused.  the nightmere reminds him about all the shit that has happened in his life and it is sort of jumbled togeter.  i am probably way off but it could be.\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nThis is without a doubt, the greatest song ever written. Brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nThis is like the funnest song in the world  specialy when u and ur friends are really hyper and ur dancin and singin to it \r\n.......great times great times\r\nMuch love\r\n~Stacy Jo~\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nthis song rocks!! queen rocks...did and always will....this isn't the best song by queen but its pretty damn good\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nu should listen to a little more queen...al of them are great...another one bites the dust for instance.....bohemian rhapsody kicks ass but idk i just think there are better ones\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nidk i think it can i think they are all equally amazingly awesome...all of them are...\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nyeah...ok\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nGuys! Stop freakin arguing! This is a great song, you don't need to argue over it! How old are you? 3? Show some respect!\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nhuh...we are allowed to freakin argue all we want..I mean we are still on topic an dits a freakin public chat...duh how old are 70? just shut up and let us say what we want...you got room to say what u want...we love this song we are just debating it's meanings and importance...\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nI'm actually with rhcp on this one. Wll, the parts of her comments i could understand. We're allowed to disagree (c'mon, that's not an argument) and i personally don't know if this is their best work. It's up there though.\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nPlus, at least this one's a complex enough song so that Brian May can't pimp it out to Kids United.\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nIts about there battle with aids\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nhas anyone ever played guilty gear? cuz thats got to be one of the best fighting games ive ever played. even better than street fighter.\r\nthe game's creator likes Queen. no, not like, love. thats his inspiration suposedly\r\nplay the game, it rocks\r\nliterally\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nand speaking of Guilty Gear, one character, Sol Badguy is named after one of Freddie Mercury's solo career songs. \"Mr. Badguy.\"  Frederick Badguy is the characters real name. Frederick for Freddie obviously\r\nGuilty Gear has tons of rock references\r\nunfortunately most consisting of black metal, or metal in general, not classic rock\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nAlthough \"Bismillah\" is literally something like \"in the name of Allah\", in arabic it is often used as if asking for luck, a bit like \"god willing\". It is often said before starting a journey. Maybe a similar meaning to someone crossing themselves for luck.\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nThis is the worlds most random song ever....and I love it!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nthis is a great sont and i think itsabout freddy talking about how hes dying of AIDS.  if you think about it, it really makes sense, the whole verse ...too late my time has come, sends shivers down my spine bodys aching all the time, goodbye everybody ive got to go.....it all makes sense, plus after he died this song was used for some sort of AIDS benefit\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nI was curious if anyone knew any other songs or poems with the same meaning as Bohemian Rhapsody??\n\r\n...I need it for a project...\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\ni don't really agree with ledskynyrd when he/she said that if queen had still been around, they would havemade so much more brilliant music.. of course, i'm NOT saying i'm glad freddie died.. not entirely stupid yet... =) but some of the best queen music was inspired by this.. (can only think of the how must go on, but that's a GREAT song!!!!!) anyway, bohemian rhapsody is PURE GENIOUS!!!!! every time i hear it, it kinda fills my head and i can't imagine how anyone can write such a fucking great song!!!!!!! sad and hilarious at the same time, it's one of the best queen songs ever.....\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nAs cold as this will sound, I think it is probably a good thing (in terms of status) that Freddy died.\r\nBy dying in his prime, he will forever be remembered as probably the best frontmn in history.\r\nSad as it is, most of the time, that kind of talent is fleeting and while it is possible that he would have forever, maintained the same level of brilliance, it seems equally likely to me, that he would have become just another washed up hack, which would have been a tragedy.  Going out the way he did left people asking \"what if?\".\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\ni agree with guiffporn\n\r\nsince he died at the peak of his talent, freddie mercury became a legend.  and what happened with metallica?  they decided to rock out till the end until their old and wrinkly. metallica nowadays sux so bad. 80's Metallica is better. but nowhere near as good as Queen\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nyea Queen is pretty much the best band in the world, also the most overlooked. but if they lived on, they could have gotten tired of them faster.\n\r\nwhy do you think people rave about kurt cobain?  its not because of his lyrics, it was because the little bitch felt sorry for himself and died\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nok actually that was stupid of me to even compare Freddie Mercury to that loser kurt cobain.\n\r\nFreddie Mercury IS the greastest front man in all of hard rock. better than robert plant. better than paul mcCartney. and even better than bon scott and brian johnson. COMBINED\n\r\nthe only one who can match Mercury would have to be David Bowie\n\r\ntheir song, under pressure, kicks ass\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nummm, hmmm, ok mr badguy ur an idiot, kurt cobain is no loser, he is the great. how could u even try to diss nirvana, i mean come on, its nirvana!!\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nummm, hmmm, ok mr badguy ur an idiot, kurt cobain is no loser, he is the great. how could u even try to diss nirvana, i mean come on, its nirvana!!\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nby ledskynyrd on 10-30-2004 @ 12:40:26 PM  \r\nIf this ain't the best song by Queen then tell me what their best song is. \r\n  i just had to reply to this, obviously, this is a great song, and i too believe it is their best, but different people like different songs more or less, and as for what their best song could be?  we wil rock you perhaps? or we are the champions, killer queen, you're my best friend, crazy little thing called love, somebody to love, i want to break free, another one bites the dust, i want it all, under pressure... i cannot be bothered to go on, but all of their songs are brilliant and all of those are amazing, so i can understand someone liking a different song more.\n\r\nthe other thing i wanted to say... has noone here seen the musical \"we will rock you\" it is truly amazing, and the characters discuss the meaning of this song. one of the characters even calls it \"a load of bollocks thrown together by the most spectacular musicians of all time\". and before anyone mentions this, yes the play is partially written by queen, so the meaning are pretty trustworthy. i reccomend anyone who hasnt seen it sees it as soon as possible, that is if you live in australia or uk, cos i don't think its been released anywhere else.\r\nand apart from that, i would like to clear up a few things. someone above said that freddie mercury didnt even write the song, whoever that was, your an idiot. he did write it. and it was released in october 1975, so i have no idea what you people were on about with the whole it being written for waynes world thing, although it was rereleased in 1992 in america because of waynes world, and 1991 in the UK, in aid of the terrence higgins trust.\r\nby the way, it had nothing to do with aids, deal with it.\r\nsorry for rambling, but it was necessary \r\n<3\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nyou know what, scrap everything i just said, its a simple song, written about nothing, so that others can relate it to whatever they want.\r\nand why are you people talking about kurt cobain and other musicians, this is about queen and bohemian rhapsody, not that stupid guy or anyone else.\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nqueen is awesome and so is kurt...Rock today sux, velvet revolver is pretty much the only really good band today, i miss the good ol days of really good rock. Rap sux\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nKurt & Nirvana were pretty great, but not great enough to justify all the hero worship.\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nI think this song is about a soldier who has gotten home from Vietnam on leave. He's facing the grim fact that he's killed someone, and he believes that this means he will be killed when he has to go back to Vietnam. He is sitting in his mother's house, probably in the fall (this seems like a fall song to me) and imagining his life in wartime as an opera.\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nMe and a boy from my class were discussing Bohimian Rhapsody and we started to sing it ......Th teacher got kinda annoyed. They have no ROCK sense I LOVE THIS SONG!!\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nI think I like the PJkun interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nthis song is definitely one of the greatest classic rock songs ever. its so cool because so many different people i know listen to this song. not only my parents but my friends. it appeals to a large media and is so powerful and wonderful. rip freddy mercury\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nI agree with nessa. Its one of the greatest songs ever, if not THE greatest song ever. The people who dont like this are generally the people who decide anything more than a week after release is old\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\ni like the guitar solo and when it says \" no no no no no no ...\" its never never never never not nonono duh\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nbeautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nPkjun's interpretation near the top, although quite possibly wrong, is awesome. =D\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nthis is probably my favorite song ever its lyrics r a little creepy though with the whole \"mama just killed a man. put a gun against his head pulled my trigger now he's dead\" that freaks me out.\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nthis is probably my favorite song ever its lyrics r a little creepy though with the whole \"mama just killed a man. put a gun against his head pulled my trigger now he's dead\" that freaks me out.\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nsrry that i printed that last thing twice my computer glitched.\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\nthis is not my favorite song...but i think that it might be the best song ever written. its more like a story than a song. its like a rock epic. one for the history books.\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nalso, pkjun (way up by the top) thinks that his interpretation is totally wrong but i think it is flawless. it breaks down the song into parts and it makes perfect sense of all of it. my hat is off.\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nwhat makes this song so great is that the lyrics were made so anyone can relate to it.  \n\r\nhowever this mostly pertains to the loners or weirdo's of society. the definition of bohemian is usually:\r\n \"unconventional in either appearance or behaivior\"\n\r\nso the narrator is either a madman or wacko. or society shuns him and curses him because he is different, unique; which is why this song means so much to me.\n\r\nim a bit of a loner and a bit of a weirdo. i am different. i dare not fit in, and am judged by it\n\r\nthis song ultimately kicks ass\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nOk, after reading the comments here I listened the song once more, specifically for this.\n\r\nThe line --> \"Mama just killed a man\" definitely has a coma there, so it should be -->\n\r\n\"Mama, just killed a man\"\n\r\nThe way Mercury sings it and what emphasises make it clear that it is not Mama who killed the man.\n\r\nSecondly, the idea presented here saying that this song has a lot similar to Camus' \"Stranger\" was very interesting and intriguing for me. However, I'd take it even one step further! Dhaval (the one who proposed the Camus' theory, way up there, two years ago already, you're comments are welcome here. What I think is that while the connections to Stranger seem obvious there's also Kafka and his \"Trial\" and I think this song also - especcially the opera part - has a lot to do with Kafka's \"Trial\".\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\nPost #300=LAST WORD - this song is NOT about AIDS.\r\nAIDS came into the public in 1980/81.  Sure, you can twist it around all you want, but it's still not about AIDS.  If you look at the rest of the comments on other Queen songs, in almost every song people suggest hidden homosexual and AIDS meanings.  Sure it's fun to do, but you can jam a square into a circle if you try hard enough (no sexual metaphor intended).  We probably do this because it's such a famous song now, but when they wrote it, it wasn't.\n\r\nThis song is called \"Bohemian Rhapsody\" from and album called \"A Night at the Opera\".  A bohemian is a free spirit, so this character has an easy come, easy go lifestyle.  He lives Any way the win blows.  It's just like an opera song: telling a gruesome, tragic story that allows the singer to go nuts on certain notes.  That's where all that \"Galileo..figaro\" shit comes in.  More than likely, that stuff means nothing, at least not in the context of said story.  I'm sure there are nuances, inside jokes and autobiographical stuff in there, but it doesn't really add to the story about the kid.\n\r\nIn the end, it's just a very simple story of a kid who fucked up his life by killing someone and bemoans his fate.\n\r\nEND OF THREAD.\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nI only have one thing to say; Wayne's World.\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nI only have one thing to say: masterpiece.\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nDammit!\r\nWhat part of \"Last Word\" and \"End of Thread\" didn't you understand?\r\nEveryone's hanging out at \"Another One Bites the Dust\" anyway.  See you there. \n\nEND OF THREAD...\n\n\n", "comment_306": "\nI'm going with dhaval and the theory about the novel book called The Stranger. It fits so much and I really think that it could possibly be an answer. \n\r\nAnd shut up Chinup, no one cares what the fuckyou think if you tell people what to do.\n\r\nANywhom, I'm done =D\t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nWow, Queen REALLY DO ROCK!\t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\nR.I.P Freddie Murcury\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nRelax QueenRock and take the joke, retard.\r\nBTW, I'm down with dhaval's explanation - i don't think what i added takes away from what he/she said.\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\nHey don't call me a retard :'(\r\nHey I was stressed anyway. Sorreh\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\nAnd peaceblossom, Waynes World may be good, but it really doesn't relate to Queen in any real way. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nit was meant in the best possible way, QueenRock, sorta like a noogie.  \r\nI love retards, btw - hey, my Dad is retarded, but okay - sorry.  I just quit smoking myself.  Shit, this is  really off topic now.  \n\r\nSorry all.\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nrocks\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nThis song is the first Queen song I ever heard and i don't like to hear it being dissed. It's a goddamned unreal song but I wish we could all get over the fact that Freddie was gay (and stop getting angry and telling people that , no, he wasn't gay, he was bisexual!). Not every song he wrote was about AIDS. If you wqant to talk about his battle with aids, rock over to Who Wants To Live Forever, where nobody can deny his gayness/bisexuality and battl with AIDS.\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nThis song is the first Queen song I ever heard and i don't like to hear it being dissed. It's a goddamned unreal song but I wish we could all get over the fact that Freddie was gay (and stop getting angry and telling people that , no, he wasn't gay, he was bisexual!). Not every song he wrote was about AIDS. If you wqant to talk about his battle with aids, rock over to Who Wants To Live Forever, where nobody can deny his gayness/bisexuality and battl with AIDS.\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nThis song does sound like a \"Faustist\" type story.\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\nwhats faustist?\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nWow.\n\r\nThis site went down a few years back shorty after I first posted for this song.  I just now found out it was back up and running.\n\r\nThanks for all the comments about my \"The Stranger\" theory.  It was interesting reading some of the other theories as well.  I still think mine fits the best, but I am biased :)\n\r\nAnyway, the song is always going to mean different things to different people, and that is good.\n\r\nAnyone out there who hasn't read \"The Stranger\" by Albert Camus, I encourage you to do so.  Even if it doesn't give you insight into Bohemian Rhapsody, the song may give you insight to the book.\n\r\n-Dhaval\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nDoctor Johann Faustus\r\nAbstracted from the Faust Chapbook of 1587\r\nJohann Faustus was born in Roda in the province of Weimar, of God-fearing parents.\n\r\nAlthough he often lacked common sense and understanding, at an early age he proved himself a scholar, mastering not only the Holy Scriptures, but also the sciences of medicine, mathematics, astrology, sorcery, prophesy, and necromancy.\n\r\nThese pursuits aroused in him a desire to commune with the Devil, so--having made the necessary evil preparations--he repaired one night to a crossroads in the Spesser Forest near Wittenberg. Between nine and ten o'clock he described certain circles with his staff and thus conjured up the Devil.\n\r\nFeigning anger at having been summoned against his will, the Devil arrived in the midst of a great storm. After the winds and lightning had subsided the Devil asked Dr. Faustus to reveal his will, to which the scholar replied that he was willing to enter into a pact. The Devil, for his part, would agree: \n\r\nto serve Dr. Faustus for as long as he should live, \r\nto provide Dr. Faustus with whatever information he might request, and \r\nnever to utter an untruth to Dr. Faustus. \r\nThe Devil agreed to these particulars, on the condition that Dr. Faustus would promise: \n\r\nat the expiration of twenty-four years to surrender his body and soul to the Devil, \r\nto confirm the pact with a signature written in his own blood, and \r\nto renounce his Christian faith. \r\nHaving reached an agreement, the pact was drawn up, and Dr. Faustus formalized it with his own blood.\n\r\nHenceforth Dr. Faustus' life was filled with comfort and luxury, but marked by excess and perversion. Everything was within his grasp: elegant clothing, fine wines, sumptuous food, beautiful women--even Helen of Troy and the concubines from the Turkish sultan's harem. He became the most famous astrologer in the land, for his horoscopes never failed. No longer limited by earthly constraints, he traveled from the depths of hell to the most distant stars. He amazed his students and fellow scholars with his knowledge of heaven and earth.\n\r\nHowever, for all his fame and fortune, Dr. Faustus could not revoke the twenty-four year limit to the Devil's indenture. Finally recognizing the folly of his ways, he grew ever more melancholy. He bequeathed his worldly goods to his young apprentice, a student named Christoph Wagner from the University of Wittenberg .\n\r\nShortly after midnight on the last day of the twenty-fourth year, the students who had assembled at the home of the ailing Dr. Faustus heard a great commotion. First came the sound of a ferocious storm and then the shouts--first terrifyingly loud then ever weaker--from their mentor.\n\r\nAt daybreak they ventured into his room. Bloodstains were everywhere. Bits of brain clung to the walls. Here they discovered an eye, and there a few teeth. Outside they found the corpse, its members still twitching, lying on a manure pile.\n\r\nHis horrible death thus taught them the lesson that had escaped their master during his lifetime: to hold fast to the ways of God, and to reject the Devil and all his temptations.\n\r\n--------------------------------------------------------\n\r\nThis is pretty much of what it means, but this charater was not limited to just one writer: Goethe, Berlioz and Marlowe had different dipictions of the man and his demise!\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nWhat? I don't understand that\t\t\t\t\n\t\t\t\t\n\n", "comment_321": "\nSorry, I don't really understand anything\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nthe song is about his nuts on another man's chin!\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\ni love this song...anyone seen the father ted episode when graham norton does a rendition? so hilarious...\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\nozonefiller, you forgot to mention T. Mann and his book \"Doctor Faustus\" which is also about that. ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\ndid u all forget that queen is a gay reference, that said the song is eazy to get,\r\nmama just killed a man probably the kids first boyfriend or something gay like that\r\nhe says didnt mean to make you cry, as in sorry im gay,\r\nhe is probably taken away then to a place for different people which is how the church dealt with people\r\nbut its a misribble life their and he wants to go\r\nthe stoning part and spit in my eye part adds to my point\n\r\nno not that kind of spit in my eye u sicko!\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\nNo-one knows what it's about.. Freddie has never told anyone and we never get to know that..\n\r\nAND IT'S NOT ABOUT AIDS!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nI don't understand why it is because Freddie was a bisexaul it makes it that each and every song that Queen ever wrote to everybody's mind, is about being gay or doing gay things?! You think that some songs might have some sort of deeper meaning to them!\n\r\nPeople make it that they're songs are like exploiting they're sexuality! \n\r\nBoth May and Deacon were and are married men and Taylor was a drunken, smokaholic, womaniser!\n\r\nIs that too being gay?! :(\t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nyeah but queen is a gay refrence, and this is song and we are the champions and maybe 1 more are the only gay refrence songs.  i dont think its so gay refrence as it is about exceptance. you dont have to be gay to want acceptance and understand the song, i mean if u agree with my analysis that its about acceptance.\n\r\np.s dont ask me how we are the champions is a gay refrence song its what ive been told\t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nThis song seems to me to be about a woman who has an affair with another man and her husband kills the other man and is awaiting death for killing him.\t\t\t\t\n\t\t\t\t\n\n", "comment_330": "\nwell i'm just gona go by de words:\r\n\"Mama just killed a man \r\nPut a gun against his head \r\nPulled my trigger now he's dead \" \r\nhe killed someone and\n\r\n\"Is this the real life? \r\nIs this just fantasy? \r\nCaught in a landslide, \r\nNo escape from reality \r\nOpen your eyes, \r\nLook up to the skies \r\nand see, \r\nI'm just a poor boy \r\nI need no sympathy \r\nBecause I'm easy come, easy go \r\nLittle high, little low \r\nAny way the win blows doesn't really matter to me \r\nto me \"\r\nhe saying he cnt believe what he just did and that he must be dreaming and cos he poor no one is going to care about him, no one gona feel sorry 4 him.\n\r\n\"Mama, life had just begun \r\nBut now I've gone and thrown it all away \r\nMama \r\nDidn't mean to make you cry. \r\nIf I'm not back again this time tomorrow \r\nCarry on, carry on \r\nAs if nothing really matters.\"\r\nhe saying he was very young and had all his life but cos he killed sum1 he going to be excuted and he not going to live anymore so he thrown his life away, he mum crying cos her son going 2 b excuted and he telling her he not worth it and 2 carry on life and not think about him.\n\r\n\"Too late, my time has come, \r\nSends shivers down my spine, \r\nbody's aching all the time. \r\nGoodbye, ev'rybody \r\nI've got to go \r\nGotta leave you all behind and face the truth \r\nMama, \r\nI don't wanna die, \r\nI sometimes wish I'd never been born at all\" \r\nhe now going to be excuted and he really scared but he cant run away now cos it 2 late, he says goodbye 2 every1, he cnt 2 face up the consequence wta he done and he wish he was never born so he dont have 2 go thru dis.\n\r\n\"I see a little silhouetto of a man \r\nScar-a-mouche, Scar-a-mouche, \r\nWill you do the Fan-dan-go. \r\nThunderbolt and lightning, \r\nvery, very frightening me. \r\n(Galileo) Galileo \r\n(Galileo) Galileo \r\nGalileo figaro Magnifico \r\nI'm just a poor boy and nobody loves me. \r\nHe's just a poor boy from a poor family. \r\nSpare him his life from this monstrosity. \r\nEasy come, easy go, will you let me go,....\"\r\nthis big papragragh is bout his time in hell and how the devil is being nasty 2 him\t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\nwell some of the words u changed to make it make sense, like the mother killed a man, not him, and she threw life away not him,   other then that your guess is as good as mine about the song.  no wait mines better : )\n\r\nthis is a good page alot of good anylizing the song instead of other bullshit. id like someone to give a good anylisis about this song\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nI wouldnt take my word for it cuz i am only 13 but Im with goomba bcuz i asked my dad and he said that it was Freddy Mercury's way of telling every one that he was gay.  I really dont know that much but I do know that this is a really awesome song!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_333": "\nIf it was his mum who killed his mum, then y does he say \"pulled MY trigger...\" god fed up of every1 over anaylsing this song, it seys in de words wat de song bout\t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nsorry i ment 2 say *if it was his mum who killed sum1\t\t\t\t\n\t\t\t\t\n\n", "comment_335": "\nThis song is about a trial... there's a pretty good description by someone here snout it.\n\r\nAnd Freddie Mercury wanted to make an opera in a song. Think about it -- Bohemian Rhapsody's premiere WAS on an album called \"A Night at the Opera\"!\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\nOlliebabe, the answer to your question is that the person who sent in the lyrics got them wrong.  I know the song, and just listen again to make sure.  Its Pulled *the* trigger, now he's dead.  That should make it more clear\t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\nAND OPERA? cmon whats more gay then opera. the guy was giving all the hints, no offence opera lovers\t\t\t\t\n\t\t\t\t\n\n", "comment_338": "\ni herd it n it still says \"my tirgger\" and it sed \"life has just begun and i've gone n thrown it all away\"\t\t\t\t\n\t\t\t\t\n\n", "comment_339": "\nGoomba, stop making yourself look stupid.\n\r\nThe lyrics are quite obviously...\n\r\n\"....pulled MY trigger...\"\n\r\nIf you can't make that out then get down to your doctors, there's something wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_340": "\nhuh, i heard it wrong. me bad.\t\t\t\t\n\t\t\t\t\n\n", "comment_341": "\nThe amount of utter crap people are talking about this song being about AIDS, it's pretty much like saying Stairway To Heaven was written about Bonham choking on his own vomit.\t\t\t\t\n\t\t\t\t\n\n", "comment_342": "\nI think this song is definately about his death (when it comes) of course the about AIDS thing is wrong for obvious reasons....\r\nGreat song split into different genres.\t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nokay guys. i asked my dad what this meant (hes who got me into queen) and heres what he thinks: that its about his mom getting pregnant w/him. i dont know every detail of freddies life, but its like when his mom had him, then his dad left them. like, he \"killed\" his dad by being the reason his dad left. im not sure, hell, i dont even know if his dad left him. but theres my wild stab.\t\t\t\t\n\t\t\t\t\n\n", "comment_344": "\no..k..MY TURN.\r\nthis song seems to be a tribute of sorts to opera. especially the 'scaramouche' etc. part...which ive bee told is made up of different bits from operas and such. the song makes no sense...but then again, neither do most operas (to me & friends anyway). im probably way off, but oh well. queen rules. rock on.\t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nHis dad never left them... Although he did recently die (but that was just last year or maybe a couple years ago, long after Freddie died).\t\t\t\t\n\t\t\t\t\n\n", "comment_346": "\nI have no clue what Freddie was thinking when he wrote it, but he sure was thinking like a genius!\t\t\t\t\n\t\t\t\t\n\n", "comment_347": "\nfreddy wrote it about a boy fighting in war...thus the \"killed a man' type of thing... but being a rock opera it changes of course...but the first bit is about dealing with the thoughts on ur consicence of ending someone elses life\t\t\t\t\n\t\t\t\t\n\n", "comment_348": "\nBohemian Rhapsody is about a young man who has accidentally killed someone and, like Faust, sold his soul to the devil. \n\r\nOn the night before his execution he calls God in Arabic, \"Bismillah\", and so regains his soul from Satan\t\t\t\t\n\t\t\t\t\n\n", "comment_349": "\nTHIS IS FROM THE BBC NEWS WEBSITE:\n\r\nBohemian Rhapsody is about a young man who has accidentally killed someone and, like Faust, sold his soul to the devil. \n\r\nOn the night before his execution he calls God in Arabic, \"Bismillah\", and so regains his soul from Satan\t\t\t\t\n\t\t\t\t\n\n", "comment_350": "\n\"Scar-a-mouche, Scar-a-mouche,\r\nWill you do the Fan-dan-go!\"\n\r\nhehe i love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_351": "\nAnyone knows how these lyrics tie into the song's meaning?: \n\r\n\"So you think you can stone me and spit in my eye. \r\nSo you think you can love me and leave me to die. \r\nOh, baby, Can't do this to me, baby, \r\nJust gotta get out, just gotta get right outta here.\"\n\r\nThis part is the best freaken part of the song, the guitar accelerates and climaxes with the song's redemption theme. This is what makes heavy metal. Freaken Awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_352": "\ni like the song\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n.\t\t\t\t\n\t\t\t\t\n\n", "comment_353": "\nWell, what is there to say when 350 people have posted before you?\t\t\t\t\n\t\t\t\t\n\n", "comment_354": "\nWell, what is there to say when 350 people have posted before you?\t\t\t\t\n\t\t\t\t\n\n", "comment_355": "\nThis song is awsome. I wonder what song has the most posting on this site?\t\t\t\t\n\t\t\t\t\n\n", "comment_356": "\nnot good enough songs. not songs like this. this song fucking saved my life during middle school. not literally, but it got me through some rough times.\n\r\ni read some posts up at the top, it says how it speaks about the upper class. i get what the person meant. the song starts out with questions about life. look up to the sky, perhaps if there is something greater, or how come he lucked out to be poor. then, it says about how he's poor, and so no one cares about him. he kills someone, who knows why, and now he's scared and has to run away. he gets caught, and then it talks about how they captured him, and how he has no chance.  he's easy come, easy go, because he's poor. he wants to escape, but they wont let him. the devil is out for him, because he's done something wrong. he fights, saying \"so u think u can stone me and spit in my eye.....\", but ultimatly loses, and in the end, talks about how he doesn't matter, or perhaps how when u meet ur doom, u realize u have to face reality and that ur entire life doesn't matter to the outcome of the world. i dunno. i was just trying it out, cuz i love this song so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_357": "\nWell, enough people have posted enough about this song, so what will one more comment hurt? :)  Brian May said that no one really knows what this song is about and that is one of the qualities that makes it so great.  People can take the lyrics and adapt them to themselves.  \r\nPersonally, my favorite line is:\n\r\nMama, I don't wanna die,\r\nI sometimes wish I'd never been born at all!!!\r\n-MAS\t\t\t\t\n\t\t\t\t\n\n", "comment_358": "\nI LUV DIS SONG i agree wit sumone above sorry i cant remember hu but yeah it is legendry along with 'stairway to heaven' did anyone see ' the story of bohemian rhapsody' on BBC 3 a few wks ago? it said that the drummer of queen was the only one hu truly new the meaning of the song and would take it to his death bed. but he also sed it was pretty self explanatory. oh yeah. they had a load of oxford university prof. to anyalise the lyrics too. \r\nBut to me its just about what Freddie was thinking. what that is i have no idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_359": "\nmkay, cool interpretations of this song are fun (except for the AIDS one which is just blatantly wrong and ignorant considering Freddie didn't even know he had AIDS yet) but in reality the song is just a fun, mini-rock opera, as stated by the band themselves as others have noted - i just wanted to reiterate that b/c if you look at it as a fun, entertaining little rock-opera you can enjoy it as such, instead of a sad, melodramatic song. I also just wanted to answer somebody's crazy post up there about this song being an improv, spurr of the moment thing - it took 3 weeks for them to write bohemian rhapsody. All i have to say is Magnifico!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_360": "\nI know that because of the time the song was released, it cannot possibly be about Freddy's battle with AIDS, but ever since I was old enough to understand what AIDS was, this song has held that connotation for me. \r\nIt's got such a desperation to it. I definitely think it has a lot to do with the stigmas associated with being gay. The man he's killed is himself. He's sort of killed the perfect image he's been. He's let down his family. \r\nThe \"Trial\" part I think is moreso just a take on all the judgements our society might make. \r\nBeing gay can be a very lonely place, and I think a lot of the parts of this song really capture that. I suppose they also capture the lonliness of AIDS, with the inability to be physically intimate, and the way people stereotype and shun you. So even if the AIDS explanation isn't right, I still like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_361": "\nSome of these comments are hilarious.  I guess if you're good enough you can make a great song even if  it's about  nothing at all.\n\r\nAnd on the other hand, if you're about nothing you can make something out of nothing.\t\t\t\t\n\t\t\t\t\n\n", "comment_362": "\nSome of these comments are hilarious.  I guess if you're good enough you can make a great song even if  it's about  nothing at all.\n\r\nAnd on the other hand, if you're about nothing you can make something out of nothing.\t\t\t\t\n\t\t\t\t\n\n", "comment_363": "\nAbout Fandango: Interestingly enough, fandango has become the name of a mildly successful company through which you can buy movie tickets. It's commercials feature paper-bag-people who say things like \"Yeah, I Fandango. It saves me alot of time so on Saturdays me and my wife can go clubbing\"\t\t\t\t\n\t\t\t\t\n\n", "comment_364": "\nI remember this song in Wayne's World, and they start banging their heads at the fast part.  What a great song!! Every time i hear this song, I find myself banging my head just like Wayne and Garth!! PARTY ON!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_365": "\nArr... that's exactly why I hate Wayne's World. The new generation came and relates the great song to a lame crap-movie. *sigh*\t\t\t\t\n\t\t\t\t\n\n", "comment_366": "\ni love the waynes world movies it really got me into queen and i still havent got an album after 3 years now. but i think my dad has some i could steal them for a while.\t\t\t\t\n\t\t\t\t\n\n", "comment_367": "\nthe song is about nothing. freddy mercury decided to right a song about absolutely nothing but tried to make it sound like the most emotional song ever. its a kind of joke, but a good song!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_368": "\nHello all.  I've stumbled back after a few years of not being here.  I can't believe I remembered my password.\n\r\nAnyway, thanks so much for all the kind words regarding my theory.  I do appreciate them.\n\r\nI've always thought this song is the essence of SongMeanings.  Everyone posts what they think it means, they post critiques of the theories of others, and they appreciate great music.\t\t\t\t\n\t\t\t\t\n\n", "comment_369": "\nOne of the great songs of our or any generation. If your not a Queen fan after hearing this, then I just say it's your loss.\t\t\t\t\n\t\t\t\t\n\n", "comment_370": "\num.......great song. not to sure what it means but Queen is by far one of the coolest bands\t\t\t\t\n\t\t\t\t\n\n", "comment_371": "\ntear* i love this song. this is a \"break out the lighter then headbang at the rock out part\" song. it makes me smile so much *hugs self* i think its just a story. freddie adored opera and probably wanted to write a song that fit opera. regardless of a true story, it worked didnt it?\t\t\t\t\n\t\t\t\t\n\n", "comment_372": "\nits about him killing someone and his stages of denial and any one who says its about aids has to be retared because everyone is saying it cant be because he doesnt even know he has it yet and he cant tell the future so how could you write a song with real meaning if the meaning isnt true \n\n\r\nu guys are friggin retarted add two and two or is that too hard for you guys seriosly\t\t\t\t\n\t\t\t\t\n\n", "comment_373": "\ni always thought the song was about abortion.  Like it's an unborn baby singing to his mother.  That's just what I heard, and what I've always though.\t\t\t\t\n\t\t\t\t\n\n", "comment_374": "\nIt's about a poor boy who killed a guy and is sentanced to death.\t\t\t\t\n\t\t\t\t\n\n", "comment_375": "\ni have heard there is only one person in the world that knows what it means- but i dont think it means anything. did he realse it when he knew he had aids? if so it could be about that especialy the end  'nothing reallly matters to me'-\t\t\t\t\n\t\t\t\t\n\n", "comment_376": "\nWell, he may have known he had HIV, because that takes years to turn into AIDS. Also, it may not be his guilt of contracting the disease, it might be the guilt of being gay that killed his dad on the inside, but I dont know.\t\t\t\t\n\t\t\t\t\n\n", "comment_377": "\nIts about him coming out.\t\t\t\t\n\t\t\t\t\n\n", "comment_378": "\nno idea but they have great voices and greate music\t\t\t\t\n\t\t\t\t\n\n", "comment_379": "\nThis song is INCREDIBLE. I blast it and dance around my house like a lunatic. \n\r\nQueen is AMAZING. I *love* them.\t\t\t\t\n\t\t\t\t\n\n", "comment_380": "\nOK this is how i understand it. I heard that Freddy Mercury wrote this song about a child he visited in hospital. The child was in hospital because he walked in on his mother who was a prostitute doing it with a client. The mother was so ashamed she shot the client (Momma just killed a man...) shot herself and then shot the boy ( Too late my time has come sent shivers down my spine body's achin all the time). The boy was rushed to hospital where he was told it was unlikely he'd survive for long. They asked him if he had any last wishes and he said he'd like to meet Freddy Mercury. Freddy came to visit and shortly after that the boy died saying the words \"nothing really matters to me\". Freddy then wrote the song.... This may not be correct but read the lyrics.. they do fit in....... *bursts into tears*\t\t\t\t\n\t\t\t\t\n\n", "comment_381": "\nI know we all have our own opinions about this song, and we've already created about 4 hours worth of argument, but can't we just listen to the song? Isn't the point of any song to leave you thinking about it? Personally, I agree with  jahd_petrick, but we all have different ideas. Let's leave it at that\t\t\t\t\n\t\t\t\t\n\n", "comment_382": "\nThis song is not about aids in any way. Its about a kid who obviously shot some dude in the head. he sings about how hes scared of being executed and how hes sorry to his mom and he regrets throwing his life away.\r\nThe ass kicking rock out that follows is the scene in heaven, certain individual imploring god to allow him into heaven, others saying damn him to hell, thats my take thanks peace\t\t\t\t\n\t\t\t\t\n\n", "comment_383": "\nI read about this, it was in an interview with Freddie...Someone asked him what the song was about as their was so many different takes on it and he said that it didnt really mean anything in particular....\"if you see it darling, then its their\"\n\r\nThats what i read anyways, but my own opinion, I reckon it was about him finding out about HIV but it cant be cos that only happened late 80's. PASS! I dont know!\t\t\t\t\n\t\t\t\t\n\n", "comment_384": "\nLike what most people have been saying it ISN'T written about Freddie's battle with AIDS. He was diagnosed with the disease in the early 80's. Brian May said on \"Queen's Greatest Video Hits\" vol 1 that there wasn't much of a discussion about the song's story. But I reckon that pkjun's analysis sounds like it could be it\t\t\t\t\n\t\t\t\t\n\n", "comment_385": "\nWow, \n\r\nI did a posting 197 some time ago and I thought that there were quite a lot of them already...\t\t\t\t\n\t\t\t\t\n\n", "comment_386": "\nx. phunk.freak is right we should leave it and let our minds command the meaning of this great piece of lyrical art. We should marvel at the beauty of the song and let our imaginations run wild as we hear it\t\t\t\t\n\t\t\t\t\n\n", "comment_387": "\ni too have reason to believe this is about aids\n\r\nKEEP IN MIND THAT ALTHOUGH THE DISEASE WAS NOT KNOWN UNTILL THE 80'S THE DISEASE STILL EXISTED.\n\r\nin the prolouge, quite simply he cant believe hes done something wrong.  and that something becomes introduced in the piano segment.\n\r\nin the first stanza of the piano segment, the narrator talks about how he killed a man.  freddie may have had sex with someone (possibly a man) and he's saying that practically killed his lover, thanks to the sickness that would later be known as aids.  throughout the entire song, the narrator is trying to see if the world can forgive him, but the world and his mother, both homophobic and intolerant of murderers, shun him and hate him.\n\r\nthe second stanza in the piano segment talks about how something Sending shivers down his spine,\r\nbody's aching all the time. it could be his guilt, or it could be symptoms of this sickness that has sealed the fate of both him and his lover.  now because of this, he not only wants to keep himself alive, he also regrets it so much he wishes he was never alive in the first place. mixed emotions.  the first guitar solo is describing his emotions through guitar. \n\r\nthe opera segment, as we all know, is some sort of trial. the trial can be looked at in two ways. either 1: the entire Judicial system is mocking him, including his mother, then the narrator simply lashes out against everyone before his demise (heavy metal guitar solo) or:\r\n2: the narrator is simply questioning himself and his existance, like \"The Trial\" in Pink Floyd's The Wall.\n\r\nthe phrase \"anyway the wind blows\" is a bit of a mixed bag. he doesnt matter what happens to him or how his adversaries treat him, and yet, he fears for his life. the man simply went mad.\t\t\t\t\n\t\t\t\t\n\n", "comment_388": "\nto me this song seams like its about this guy who's mom killed someone to protect him. he lives in a bad town. then he gets into a fight and gets shot, and all his mom's efforts go to waste. i dont get the last part. i think its that his family is begging he doesn't go to hell (I'm just a poor boy and nobody loves me. He's just a poor boy from a poor family. Spare him his life from this monstrosity. Easy come, easy go, will you let me go.) But the demons of hell are pulling him in. (Bismillah! No we will not let you go ) That last parts a total guess.\t\t\t\t\n\t\t\t\t\n\n", "comment_389": "\nIf you play this song backwards there is a satanic message.  Try it.\t\t\t\t\n\t\t\t\t\n\n", "comment_390": "\nThis song is cool!\t\t\t\t\n\t\t\t\t\n\n", "comment_391": "\nI'm sure this song is not based around this, but I relate the lyrics to the Albert Camus book The Stranger.\t\t\t\t\n\t\t\t\t\n\n", "comment_392": "\nI think that this song is about Freddys struggle of killing his old way of living (i.e. living in Zanzibar and being streight) and introducing a way of life that was always there, 'No escape from reality'. The mood and tempo of the song obviously mirror the purpose and meaning of the lyrics. The 'rocky' part of the song,'so you think you can stone me....' marks the turning point of Freddy's situation, he is no longer afraid to show and tell people who and what he is... but perhaps thats just me.\t\t\t\t\n\t\t\t\t\n\n", "comment_393": "\nJek21, you're an idiot. There is no satanic message. Just because Freddie was gay ...\t\t\t\t\n\t\t\t\t\n\n", "comment_394": "\nAnd uh ... to me it's a metaphor, the boy the song's about doesn't KILL anyone, but always does something wrong and while everyone think's he's bad and should be shunned and punished, he's suffering inside, because he never wanted to hurt anyone, least of all his mother, and he also believes that he's in the wrong and he's been lead astray. In the end, he lashes out at the world and then walks off, saying that he just doesn't care anymore. \r\nAnyway, that's pretty much my view. No one has to agree.\t\t\t\t\n\t\t\t\t\n\n", "comment_395": "\nWow. This song blows me away. It is one of the most amazing songs. Ever.\n\r\nI remember when I first heard this song, when I was around 8. My older brother had it blaring in his room, and I was listening intently. The song caught my ear immediately. It evoked so much emotion. At first I'd want to cry and then I'd want to headbang. It's just such a crazy song... but don't get me wrong- crazy in a good way. \n\r\nAnyway, to all the people who think this song is about AIDS, and the leader singer of Queen, Freddie Mercury's, battle with the immune defiency disease- this is quite frankly- out of the picture. See, Mercury was diagnosed in the late 80's of AIDS (though he kept it as a secret for a while), and this song was written in the mid 70's (I think '76). So clearly, he couldn't have written about his struggle with the disease, if he didn't even know he had it. \n\r\nAnyways, this is a magnificent song. Period. End. Of. Story.\t\t\t\t\n\t\t\t\t\n\n", "comment_396": "\nI've loved this song all my life. But I just found out now what it's about. It's so obvious! IMO it's one of the most beautiful songs EVER written!\t\t\t\t\n\t\t\t\t\n\n", "comment_397": "\nIt's mostly about coming out, killing his old public (heterosexual) self, and coming to terms with it, and the reactions of friends and family. Some theatrical stereotypes interplay with sideline judgemental and mocking voices. Think of it in this light and it really hangs together.\t\t\t\t\n\t\t\t\t\n\n", "comment_398": "\nYeah i totally agree mr fixit, thats exactly what i was thinking, i'm glad to see someone else shares my immediate thoughts because most people seemed to be talking about aids. Also i think that there is a huge astrological/galileo emphasis throughout this song. Notice the first line is 'open your eyes look up to the skies and see', he's comparing his discovery that he is gay to galileo realising that the earth isn't the physical centre of the universe. They were both left with the choice of whether they hid what they knew to be true or reveal it and both of them went public with it and risked being crucified for saying the truth.\r\nAlso galileo is linked in by a big italian theme in the song not just in the middle section but earlier, notice he says 'mama' which is italian and links to the opera theme which is also italian.\n\r\nHowever i was actually most interested in this rather interesting relevation about the first line. There are three voices singing and the two loudest appear to be saying:\r\n\"Is this the real life/is this just fantasy\"\r\nbut the third very clearly says\r\n\"Is this the real life/is this just Battersea\"\r\nI'm not joking, listen for it and you'll hear it.\n\r\nBattersea of course adds a new meaning because in the early 1900s it was home to the most radical liberal politics in all of britain, and considering britains position at that time the whole world. The famous Brown Dog affair occured when a scientist decided to sue another researcher for vivisection (killing animals in experiments) he lost the case, but raised so much publicity that a national paper raised what would now amount to over a million pounds, part of this was spent on repaying the damages the scientist had to pay, the rest was spent on constructing a massive bronze statue/fountain of a dog. \r\nNow who looks like a dog? Freddy Mercury does a bit, and in a way he's worried about being dissected and killed by  the media, however the fact is that he would of course be interested in radical liberalism because he was a homosexual in a time when not much was known about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_399": "\nthe 'devil set aside for me' is probably a reference to how the catholics think that gay people need to be exorcised of their 'gayness'\n\r\n\"Anyone can see, \r\nNothing really matters, Nothing really matters to me\"\r\nclearly ironic after the whole fuss of the song, maybe he's saying that since he's gay people may think he's sub-human, but he's saying that things matter to him as much as they do to anyone.\t\t\t\t\n\t\t\t\t\n\n", "comment_400": "\nbattersea dogs home rox\t\t\t\t\n\t\t\t\t\n\n", "comment_401": "\nI have to write an interp of a song for my ap english class, and the whole breaking it into 3 phases thing was really insightful.. good job yall! O and everyone needs to go back and read emo12punk12metal's 9/14/02 entry. I would've never thought about the song kinda being about love, but that totally does fit if you look at it. He even pointed out that Freddy had said in an interview that the song was about realationships. Except 1 change to that interp, I think death has 2 connontations in this sense. I took it that it was death to his current mental state/ his innocence. I think it means that hes kinda turned into like a bitter cynic through the course of the heartbreak. Other than that, your interp was the most insightful yet!! and adding Freddy's comment was a nice touch.. GOOD JOB! \n\r\nPS: the whole aids thing was way too far-fetched. It  was a nice idea, but he unless he was like a prophet or somethin (whch, to my knowledge he WASN'T), he wouldn't have known about aids and he certainly wouldnt have been writing about them.  -THANX AGN\r\n emo12punk12metal\t\t\t\t\n\t\t\t\t\n\n", "comment_402": "\nAmazing song\t\t\t\t\n\t\t\t\t\n\n", "comment_403": "\ni'd like to get some feeback on the battersea theory, i think it could be going somewhere\t\t\t\t\n\t\t\t\t\n\n", "comment_404": "\ni'll tell you where it's going, straight down the fucking toilet with everything else you think you fucking dick\t\t\t\t\n\t\t\t\t\n\n", "comment_405": "\noh, such a sombre tone for one of the most important songs ever written...\n\r\nI'm performing this on saturday with the mixed choir i'm in, we've pretty much got it down and it sounds absolutely amazing. The way the song changes so drastically is such a test for us all - but it's really worth it. Couldn't have thought of a better or more fun song to perform - it 100% kicks arse. when you bring in all the parts - in a choir situation with nothing but the piano to accompany; you tend to rely on the voice to hold up the tune except all the amazing piano solos in there. so when all the sopranos carry the tune, along with the altos and then the tenner and bass kick in - it's fucking classic! I can't wait to sing it. it leaves you feeling so refreshed and then really chilled out as you get to the end - one word: WOW.\t\t\t\t\n\t\t\t\t\n\n", "comment_406": "\nmeursaultsrevolver most of your points are utter shit, he does say 'battersea' you just can't give a fuck about anything. If you hate life so much, ask yourself why are you alive. You're alive because you're happy but you can't admit that because you think that you are the hardest most tough unemotional pile of shit ever to exist you fucking twat.\t\t\t\t\n\t\t\t\t\n\n", "comment_407": "\nyes, you're right, you know far more about me than i do. how about, i don't want to put my family through that shit, even though i have every fucking right to do so. my points are 'utter shit' to you because you can't understand them because you have no fucking idea what life is\t\t\t\t\n\t\t\t\t\n\n", "comment_408": "\ni'm sorry if you're suicidal, maybe you shouldn't take it out on me though\t\t\t\t\n\t\t\t\t\n\n", "comment_409": "\ni'm not taking it out on you, although i should, since you're a fairly large part of why living is such a load of crap. also, can you get to the most recent posts on the pod board?\t\t\t\t\n\t\t\t\t\n\n", "comment_410": "\nno i can't, can you?\t\t\t\t\n\t\t\t\t\n\n", "comment_411": "\nno, i think the site is fucked\t\t\t\t\n\t\t\t\t\n\n", "comment_412": "\ni think that your accusations of me just then were slightly exaggerated, i'm not exactly ruining anyones life, i mean i'm sitting here feeling very ill\t\t\t\t\n\t\t\t\t\n\n", "comment_413": "\nyeah, that's what your kind always says. you think if you don't do anything directly it means you haven't done anything at all. bullshit.\t\t\t\t\n\t\t\t\t\n\n", "comment_414": "\ni don't take any of the commands in the bible literally except love your neighbour. I'm for sex before marriage, gay marriage, abortion to an extent. I've done nothing particularly wrong and more good than harm.\t\t\t\t\n\t\t\t\t\n\n", "comment_415": "\n'abortion to an extent' what the fuck is that supposed to mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_416": "\nas in i'm not against it in all cases, but i would set quite a low limit on it. Its blatantly obvious what i mean since i've said it in the abortion is murder forum. I'm doing you no harm so stop abusing me.\t\t\t\t\n\t\t\t\t\n\n", "comment_417": "\ni'm abusing you? ok, let's just analyse for a moment one of your previous posts where you commented 'you think that you are the hardest most tough unemotional pile of shit ever to exist you fucking twat. ' yeah. i think that's cleared up. you'll never understand anything. you're too brainwashed and you've had too cushy a life.\t\t\t\t\n\t\t\t\t\n\n", "comment_418": "\ni've nearly fucking been killed, i've had a far less 'cushy' life than you. You couldn't have spent 4 months literally 100% bed bound and unable to move for at least 23 and a half hours a day, being unable to do anything but rest and having to not even think, or move my head whilst resting for these huge periods, for risk of relapsing and vomiting uncontrollably. You know nothing about how tough my life is you idiot. That was probably the most misjudged comment you've said yet. Whilst incarcerated in there with no reasonable hope of ever recovering (and over a year later i still feel totally shit and am very disabled and am in huge pain from it (i've been ill for 11 years by the way)) i lost 6 stone of weight and went from 12 stone to 6 stone.\t\t\t\t\n\t\t\t\t\n\n", "comment_419": "\nand that fact that you still think your life is worth living shows me that it must by definition be more cushy than mine. you're an idiot if you think that only physical pain matters. i am going to kill myself. i doubt you could understand why.\t\t\t\t\n\t\t\t\t\n\n", "comment_420": "\ni've been put through physical, mental, psychological, social pain. I've been through every pain there is. This is a very misunderstood illness. I've been constantly insulted by people for things I can't control, and separated from my peers for a long time. If i didn't believe in god i'd probably have killed myself a few years back, but i'm living in hope. I don't know if this is one of your arguing  techniques, but if you're really suicidal please don't kill yourself because jesus loves even a lunatic like you. If you're not suicidal then don't joke about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_421": "\nmy interpretation is kinda simple but here goes\r\ni think its about 'growing up'...and having to face all this drama and responsability...and when he says 'im just a poor boy nobody loves me' hes pouting...because he doesnt want to grow up........\"to late my time has come\" is him saying he has to grow up now- hes reached that point in his life and then the whole  \"Sends shivers down my spine, body's aching all the time \" is talking about what his body is going through in acociation to puberty....and then the whole...\"So you think you can stone me and spit in my eye \r\nSo you think you can love me and leave me to die..\" is him talking about his first heart ache \r\nand then when he goes into the whole \"I see a little silhouetto of a man \" hes talking about how he see's himself grown up.  Hes going through the thrusts of puberty and describing how much hes fighting it and then in the end he lets go and goes through the natural process of life, which is to grow up.\t\t\t\t\n\t\t\t\t\n\n", "comment_422": "\nwow zzzz this has brought inspiration to me. its so strange because i share this song with a very very good friend of mine, and we were almost sure it was about sadness. you've brought a whole new light to this song, thank you.:D\t\t\t\t\n\t\t\t\t\n\n", "comment_423": "\nmrfixits explanation is the best.\t\t\t\t\n\t\t\t\t\n\n", "comment_424": "\njesus loves me. what is that supposed to mean? i'm getting out of this fucking piece of shit world so i won't have to put up with any more crap\t\t\t\t\n\t\t\t\t\n\n", "comment_425": "\nwhat is up with killing yourself? do you think it makes people want to be nice..and not heap loads of shit on you? maybe if you didnt repeat that you were going to kill yourself and if you were actually nice and shit like that you wouldnt have to try and kill yourself for attention:D\t\t\t\t\n\t\t\t\t\n\n", "comment_426": "\ni agree- i say if your going to kill yourself just go it already- my god man- JUST DO ITTT!\t\t\t\t\n\t\t\t\t\n\n", "comment_427": "\nif you were going  to kill yourself, why are you still here arguing with me? What i mean is that jesus has  a plan for your life which could benefit other people if you stay alive, but its your choice.\t\t\t\t\n\t\t\t\t\n\n", "comment_428": "\nholy shit battle of the emo kids. one says they've had \"extrodinary pain\" and one is just a dork who keeps saying he's going to kill himself. if you would stop being a cock smoker for a second, you would relize how retarded you sound. you are not making people feel sorry for you by saying you're going to kill yourself and you don't get people to like you by telling them your disabled. if anything people are just going to stop talking to you because you want them to think you have the worst possiable life imaginable. people don't want to hear you cry over that kind of shit. yeah i'm sure i could show some sympathy for you but if you keep saying that you shouldn't be made fun of because of your \"condition\" (this is towards both you) then why the fuck are you arguing with eachother saying that the other one is stupid and couldn't understand what \"pain\" you are going through. you are just being hypocrites by doing so. so my advice is either stop whining about it and try to find something better to do or if you really think you need to be like that then fucking kill yourself already and stop telling people you are going to just because you want them to feel sorry for you. and stop saying shit about the bible. you shouldn't preach that shit on a public website. go to a fucking christian message board if you want to do that kind of crap. i'm sure they could show you more sympathy on there than anyone would on here.\t\t\t\t\n\t\t\t\t\n\n", "comment_429": "\nhow about the fact that i'm not doing it for attention, since this dickhead brought it up in the first place, insinuating that my life must be fucking fantastic otherwise i'd have done it already. and if you must know the reason i haven't gotten round to it yet is because i don't want to be near my familky when i do and i'm leaving the country next year.\r\noh and man on tv. shut the fuck up.\t\t\t\t\n\t\t\t\t\n\n", "comment_430": "\nman on tv you selfish idiot.\r\ndon't encourage people to commit suicide.\r\ni only told revolver about my illness because he was saying that i'd been through no pain in my life, i hate bringing it up and i always feel emotional when i do it. you seem to have no concept about how offensive your post is.\r\ni only mentioned jesus because its the only way i know to stop him killing myself, thats hardly preaching is it\t\t\t\t\n\t\t\t\t\n\n", "comment_431": "\nyeah and although i think it's a bit overly optimistic to think jesus will stop someone who doesn't believe in him from commiting suicide, both chocolate and i were both only brought those things up in response to something else and not for attention, so why don't you just fuck off?\t\t\t\t\n\t\t\t\t\n\n", "comment_432": "\ni agree with revolver, it was a long shot but what else could i do\t\t\t\t\n\t\t\t\t\n\n", "comment_433": "\nerr, maybe let me get on with it? or admit that your opinion of my life as being great was utter shite\t\t\t\t\n\t\t\t\t\n\n", "comment_434": "\ni was only saying your life is generally good if you're not suicidal, if you are then my argument is no longer applicable - happy?\t\t\t\t\n\t\t\t\t\n\n", "comment_435": "\nnot really. but i'm not going to harrass you about that anymore\t\t\t\t\n\t\t\t\t\n\n", "comment_436": "\nu guys seriously just both of u stfu chocolate stop critizicing his life he can say wat he wants to say its a free country that goes for both of u btw i think queen's songs r cool but im anti-gay i mean my family has a friend who is gay but we are catholic so ya.....\t\t\t\t\n\t\t\t\t\n\n", "comment_437": "\nthat's bullshit. why are you really anti-gay? and you can't just say my family is catholic. unless you want to tell me what anti-gay part of the bible you believe and why\t\t\t\t\n\t\t\t\t\n\n", "comment_438": "\nchillout stop criticising my life, if you had any mind you'd realise we'd clearly just stopped arguing, he also blatantly started this by slagging off practically everyone he came across with a different opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_439": "\nwell im anti gay because im tellin u im a catholic and god says in the bible and i learned this in Family Life a long time ago which is a catholic version of Sex Ed that god doesn't believe in same sex marriage and partnership and that if a woman and a man get married that they should have a baby because god wants more people to be in the world not just to have sex and then have an abortion\t\t\t\t\n\t\t\t\t\n\n", "comment_440": "\nso ur point is?\t\t\t\t\n\t\t\t\t\n\n", "comment_441": "\ni dont want to argue let me just end this off wit this last comment he criticized the way u thought NOT UR LIFE so if u had any mind u would know the difference...\t\t\t\t\n\t\t\t\t\n\n", "comment_442": "\nchillout i never criticised anyones life according to your logic. so you don't seem to know the difference. i was just trying to make him a) less abrasive and b) less sucicidal. don't criticise people if you don't know the whole story\t\t\t\t\n\t\t\t\t\n\n", "comment_443": "\nPlease. Just stop. Thanks.\t\t\t\t\n\t\t\t\t\n\n", "comment_444": "\nwell i am going to argue cracka. life is suffering, if you can't admit that then you'r ean ignorant idiot. so if god wants more people to live, that means he wants more people to suffer. you follow a god who wants you to suffer? why? and you and all the other fuckface christians seem to be labouring under the misconception that gay people choose to be gay. they don't. so if god wanted people to have kids, why didn't he make it so everyone is attracted to the opposite sex? otherwise he's just taking the piss. and if you say it's because that would eliminate free will than doesn't that make it unfair that god puts this extra thing to overcome in some people, but not in others?\t\t\t\t\n\t\t\t\t\n\n", "comment_445": "\nsuperted i'm a huge fan of yours but again you shouldn't criticise if you don't know the whole story, this argument hardly affects you, and all i was saying was that i'd stopped it.\n\r\nrevolver, life isn't suffering for most people or else most people would be suicidal END OF STORY\n\r\nalso as i explained suffering helps us grow\t\t\t\t\n\t\t\t\t\n\n", "comment_446": "\ni wish i was blind i wish i was blind i wish i wish i could think i wish i was plain\t\t\t\t\n\t\t\t\t\n\n", "comment_447": "\nhow do you figure most people would kill themselves if life was suffering? they're scared to do it. and you stuck a very rigid defenition on 'suffering'. to me everyone is suffering from the condition of life. it is suffering to only be able to be happy by ignoring the people who are suffering as you would imagine it, e.g. homeless people, diseased and tortured people etc.  and what is the point of suffering allowing us to grow if we all die anyway? what is the point of this endless repetetive and thankless struggle of growing or not growing? why? i didn't ask for life so why am i a pawn in god's game? why am i god's fucking jester? surely if god loves everyone, including me, he'd give me what i fucking want. if there is a god this is all a fucking joke to him. he's laughing at us. he's laughing at me.\t\t\t\t\n\t\t\t\t\n\n", "comment_448": "\nyou'd better not call me a moron because i'm pro gay marriage\n\r\nrevolver if you kill yourself you'll go to heaven\n\r\nmust people enjoy their lives and thats a fact\t\t\t\t\n\t\t\t\t\n\n", "comment_449": "\nare you anti-gay vf?\t\t\t\t\n\t\t\t\t\n\n", "comment_450": "\nok. i'm passed caring what you fuckers think and i don't care if i can or can't change your twisted views. nothing will ever change. you sick fucks will always run this piece of shit. i'm getting out. i can't lose. there's no fucking way i'll go to hell and if i do, then i'll be going there when i die naturally anyway so it doesn't matter. so long\t\t\t\t\n\t\t\t\t\n\n", "comment_451": "\noh dear to vf\r\nand oh dear to revolver\t\t\t\t\n\t\t\t\t\n\n", "comment_452": "\nexplain to the good people who are fans of queen why you think that gays should have equal rights then\t\t\t\t\n\t\t\t\t\n\n", "comment_453": "\n*shouldn't\t\t\t\t\n\t\t\t\t\n\n", "comment_454": "\nwhy?\t\t\t\t\n\t\t\t\t\n\n", "comment_455": "\nits better than not being adopted at all\t\t\t\t\n\t\t\t\t\n\n", "comment_456": "\nthe reason they won't feel normal is because of prejudice. I wish people would just accept people as they are. Lifes not perfect, its about making the most of situations.\t\t\t\t\n\t\t\t\t\n\n", "comment_457": "\nthe bible doesnt say anything about gay marriage    it may talk about gay people but not bout gay marriage\n\r\nthe bible (in my mind) is flawed  it was created by humans who are imperfect.  christians claim it was the writers were inspired by god to write it.  there are some gospel accounts that arent in the bible but were written.     there were also parts of chapters that are in the bible that were takin out.  those parts support beating women and things like that.  \n\r\nand if 2 gay people decide to raise a child by adoption    only one of them can adopt that child.  so if that one dies then the child is put back up for adoption  not given to the partner.  \n\r\nand why should children feel normal.  children are taught to embrace thier cultural heritage and their differences and uniqueness but being gay or having gay parents is apparently wrong?\t\t\t\t\n\t\t\t\t\n\n", "comment_458": "\nthe bible doesnt say anything about gay marriage    it may talk about gay people but not bout gay marriage\n\r\nthe bible (in my mind) is flawed  it was created by humans who are imperfect.  christians claim it was the writers were inspired by god to write it.  there are some gospel accounts that arent in the bible but were written.     there were also parts of chapters that are in the bible that were takin out.  those parts support beating women and things like that.  \n\r\nand if 2 gay people decide to raise a child by adoption    only one of them can adopt that child.  so if that one dies then the child is put back up for adoption  not given to the partner.  \n\r\nand why should children feel normal.  children are taught to embrace thier cultural heritage and their differences and uniqueness but being gay or having gay parents is apparently wrong?\t\t\t\t\n\t\t\t\t\n\n", "comment_459": "\nare you referring to apocryphal gospels\r\nthe apocryphal gospels actually provide support for christianity because they are quite clearly faked and the author doesn't understand the logic behind jesus' actions, often they include stories about how he can do pointless magical tricks for his own amusement\t\t\t\t\n\t\t\t\t\n\n", "comment_460": "\nwow wtf! gay people are just anoter part of society...lets just get on with it and absorbed them into the culture like so many other supposidly \"wrong\"ideas. now they are all part of sociaty as if they existed all along and no one had a problem with them. i just dont know why people are so up tight and retarded that they have to judge everything from skin color to age, to sexual intercourse. just my ideas. bye:D\t\t\t\t\n\t\t\t\t\n\n", "comment_461": "\nwtf- you all are so ignorant...you lay all your life at the hands of some \"god\" thats in controle of EVERYTHING- you know what? thats centeries of BRAINWASHING- do you know how many people died through the rise of the church?  10 and a half million people- the church killed in the name of god- so i say fuck that god!- as for the bible- i guess it comes down to interpretations...i know its there to control people, to make them slaves to a non-existant 'ultimate power'- you all just dont want to take responsability for your mistakes- you so blame it on EVERYONE but yourselfs- its always your fault- you controle your life- no one else does- not god- not the devil...the church created god to make you unhappy and the devil to allow you to be happy- thats a warpped, sycodic, group- as for gay marriage- or gay realations- it isnt natural- but that is those peoples choices- who the fuck are any of you to judge anyone elses life- you really dont have a right\n\r\nget over yourselfs- grow up- and talk about the music- that is why this site was created- fucking A\t\t\t\t\n\t\t\t\t\n\n", "comment_462": "\nwow i've never heard the argument put like that before\t\t\t\t\n\t\t\t\t\n\n", "comment_463": "\nhow are gay relations 'unnatural'\t\t\t\t\n\t\t\t\t\n\n", "comment_464": "\nzzzzzzzzz you smartass see my two posts on jesus freak by dc talk\t\t\t\t\n\t\t\t\t\n\n", "comment_465": "\nThe basic instinct in life is to procreate...obviously you cant do that when your screwing some guys ass...but like i said who the fuck are any of us to judge that? as for Jesus...stop obsessing over some guys life that happend centeries ago at the 'begining' of time- im sure thats NOT what he wanted- just let it go\t\t\t\t\n\t\t\t\t\n\n", "comment_466": "\ngood on you zzzzz!\t\t\t\t\n\t\t\t\t\n\n", "comment_467": "\n:D\t\t\t\t\n\t\t\t\t\n\n", "comment_468": "\ngenius zzzzzz refuse to listen to any arguments against your point of view, you must be proud of yourself\t\t\t\t\n\t\t\t\t\n\n", "comment_469": "\nJesus is totally different from all other religion founders. The gospels have been proven from secular historians from that time to have been written less than 50 years after his death. All other religions were founded long after the leader died, which allowed a myth to spring up. \n\r\nAlso, Jesus is the only 'God' who has ever died for his people. All other religions work on a principle of legality, i.e. gaining a place in heaven through merit. Christianity is the only religion that dares to tell people that they have failed in what God wanted them to do (so how come it was so readily accepted?) \n\r\nJesus is also the first religious leader to be foretold by several hundred seperate prophecies. The book of Daniel predicts the birth of Jesus to the exact year. Secular historians decided it must have been written after he died, but the Dead Sea scrolls prove it was written about 500 years before he was born.\t\t\t\t\n\t\t\t\t\n\n", "comment_470": "\nI may have posted this already, but this song helped me with some English homework...we were meant to be writing a \"spell\" for the witches in Macbeth or something. 'cause I heard the word \"Beelzebub\" off this song, I used it and got an extra mark, just for that word...hello chocolate *wave*\t\t\t\t\n\t\t\t\t\n\n", "comment_471": "\nJews believe that the guards fell asleep, the disciples rolled the stone away, without waking the guards, stole the body, then boldly proclaimed a gospel, which insulted themselves, that jesus was alive, despite having only the witness of 2 women, who had no legal witness rights in that time, the guards weren't killed (as was roman custom) but instead went around telling people about this public embarassment. Jesus had loads of revolutionary views about women, and race which it took over 1900 years for the world to accept, but he made them all up. Mohammed had none and his religion came about 500 years after he died.\t\t\t\t\n\t\t\t\t\n\n", "comment_472": "\nWelcome! Have you noticed that reading the news lately is a lot like reading the Bible? It's amazing how many things the Bible foretold are now coming to pass right before our eyes. You don't need a prophet of God to tell you \"the end is near.\" Jesus said you would know for yourself simply by observing the signs of the times. \r\nThe headlines below are linked to original articles. All scriptures are linked to the Bible Gateway so you can easily research context and choose different Bible versions.\n\r\n\"When these things begin to come to pass,\r\nthen look up, and lift up your heads;\r\nfor your redemption draweth nigh.\"\r\nLuke 21:28\t\t\t\t\n\t\t\t\t\n\n", "comment_473": "\ndon't be apocalyptic vf\t\t\t\t\n\t\t\t\t\n\n", "comment_474": "\ni like the way it goes 'welcome! the world is about to be destoyed'\t\t\t\t\n\t\t\t\t\n\n", "comment_475": "\nyou don't believe it, so why do you mock it by posting everywhere shortass\t\t\t\t\n\t\t\t\t\n\n", "comment_476": "\nyou said you aren't christian, you need height\t\t\t\t\n\t\t\t\t\n\n", "comment_477": "\non that song about DIE CHRISTIAN BASTARDS DIE\t\t\t\t\n\t\t\t\t\n\n", "comment_478": "\nrelgious wars...how come they're always between ethnic groups, oh well must be a coincidence zzzzz\t\t\t\t\n\t\t\t\t\n\n", "comment_479": "\neveryone needs to account for themselves because the end is near\t\t\t\t\n\t\t\t\t\n\n", "comment_480": "\nthe sign of the talking fish\nobserver.guardian.co.uk/international/story/…\n\n\n", "comment_481": "\npost somewhere else this one don't work (zzzzzzzzz sends me to sleep but not in a bad way)\t\t\t\t\n\t\t\t\t\n\n", "comment_482": "\nphiladelphia eagles craves man-love\t\t\t\t\n\t\t\t\t\n\n", "comment_483": "\nu guys r fucked up the end of the world isnt near so just stfu and listen to music\t\t\t\t\n\t\t\t\t\n\n", "comment_484": "\njust calm down alright\t\t\t\t\n\t\t\t\t\n\n", "comment_485": "\nfuck you chillout, fuck you\t\t\t\t\n\t\t\t\t\n\n", "comment_486": "\nHAHAHHAHA why is everyone so wrapped in religion..sometimes i think it makes them blind to the world. :D\t\t\t\t\n\t\t\t\t\n\n", "comment_487": "\ni find your mockery of my beliefs hilarious, you are shaping up to be a great comedian you piece of shit, oh well i'm off to help at the old folks home\t\t\t\t\n\t\t\t\t\n\n", "comment_488": "\nThis song is soooooooooooo good i could cry everytime i hear it. I mean, it's legend. Waynes World is pretty funny when it's sung, and explains the song completely for me. You have to see and listen to the song and WW. It should be law.\t\t\t\t\n\t\t\t\t\n\n", "comment_489": "\noh my god chocolate- i cant help but be annoyed by your ignorance- all your argumants in support of christianity are so immature- what does any of it have to do with this song by the way? you know what i hate about 'organized religions', like christianity? they always try and convert everyone- ahahaha- mabye your gonna die soon (refer to 'the end is near') but im not- your such a fucking victum- why do so many ppl accept chrisianity? cause their brainwashed into thinking their always wrong! its about control! duh!\t\t\t\t\n\t\t\t\t\n\n"}