{"comment_0": "\nI believe that this song is about someone that she is romantically interested in that she knows isn't right or knows that things aren't going to work with, and she knows an end is inevitable (born to die) but she ignores that because she wants to live and be happy with him while she can.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think this song has multiple themes. \n\r\nThe obvious meaning is that the end result of life is always going to be death, so we need to enjoy the ride  We need to love, live, get high (boo ya), and live each day like it is your last. \n\r\nThe other meaning I am seeing is questioning the possibility of heaven and a creator.  Is it by mistake or design?  Is talking about the possibility of a god or are we a mistake.  And, in the end she comes to terms with not knowing the answer to this question. \n\r\nBased on the religious theme (church, cross in the car and around her neck etc.)  I think she is rebelling against religion.  She now can see clearly that she was seeking god because of her confusion and being scared she couldn't find all the answers.  But, now she has come to terms with not knowing all the answers in life so she is just going to enjoy life.  \n\r\n\"I can see but once I was blind\r\nI was so confused as a little child\r\nTryin' to take what I could get,\r\nScared that I couldn't find\r\nAll the answers\" \n\r\nIn the end, weather you are religious or not, no one knows all the answers and we need to live this life to the fullest because it is the only one we KNOW we have. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI've just stumbled across this song and it's blown me away.  It's almost haunting; its that youthful love that for most us fell between the cracks, of which you now only catch nostalgic glimpses when songs like this come about.\n\nAnyway, I'm surprised AlikaReine had a -1; her explanation was very good, although perhaps you need to watch the music video to appreciate it.  I think AlikaReine's done a fantastic analysis so I want to expand on that - based on the music video's representation.\n\nThe song in my opinion is about wild romance and true love, heartache, loss, and growing up, underpinned by the opening line that set's the scene as her having already lost; journeying the road to recovery and reminiscing on the journey they travelled together (and that she desperately wants to turn back to).\n\n-- this will definitely be long, so if you don't want to read a detailed analysis recommend stopping here.  if you do read please share your thoughts --\n\nI've studied film and music video's for over a decade and I have to say this music video is one of the best I've seen in years.  The video is so well put together I must conclude the director worked very closely with the artist to replicate meaning of this song through moving image.\n\nAbout the video:  The video is strongly metaphorical and the connotations are pleasantly obvious.  There is a basic narrative theory called Todorov's Theory that runs through this video, the basic outline of this is:  Equilibrium, Disruption, Recognition of the disorder, attempt to repair, leading to Equilibrium once more (5 stages).  Watch most films and you'll see it, it's the fabric of films that determines whether you leave the experience feeling closure and happiness, or discomfort and lack of closure.  Interestingly, the video places \"the lovers' [American] dream\" before and after the Equilibrium which emphasises its perpetual presence, as well as possibly highlighting it as a memory/vision.\n\nAs I already noted the song opens with her pushing ahead with life but experiencing pain and loss over the decision she's had to make.  When you've truly loved and lost, that person keeps returning to your thoughts and I know I've also repeatedly felt as though I hope we end up together again one day; \"But Iâ\u0080\u0099m hoping at the gates, Theyâ\u0080\u0099ll tell me that youâ\u0080\u0099re mine\" i.e. in the end we'll be together forever - \"the gates\" a reference to heaven.\n\nThe symbolism in the Catholic church is open to interpretation, in my view it relates to the stereotyping of a 'good, moral girl' i.e. a good upbringing and a traditional foundation.  Being a representation of her moral foundation also serves as a representation of her home which based on the stereotype was likely stable.  This is contrasted by his stereotypically \"rebellious\" image, which suggests his was likely dysfunctional.  It's also important to note she's much more 'dressed' in this shot, the relevance of this is the next scene and second verse.\n\nThe second verse and the chorus is about her adolescence to love and relationship.  Everything she was she gave up for this man, she changed her image, her style, her moral standpoint, and even left home to pursue this journey with him - a metaphor to emphasise sacrificing everything.  She believes it'll be home if she gives herself to him \"Can you make it feel like home, if I tell you youâ\u0080\u0099re mine\" - remember, this is her reminiscing on how she was, not how she is.  It's interesting she says \"if I tell you you're mine\" as one would usually say \"I'm yours.\"  She may have written it this way to show her naivety, as well as the possibility she had to tell herself he was hers because he never did.\n\nIn the hook she sings the same as the verses and it's clear she's singing from her point of view.  However, there is a distinct separation in her singing style in the chorus to everything else, which connotes she is reflecting on what \"he\" was like; 'walking on the wild side, kissing hard in the pouring rain (i.e. passionate) and insane - the way he also wanted his partner to be, like him, which is why she changed.\n\nVerse three she reminisces from a mature perspective about how naive she had been in the way she thought and felt; trying to take what she could get by changing who she was, because she was scared if she didn't he wouldn't want her and it'd just be her, alone.\n\nThe song and video go together so well and tell the complete story.  Driving the car being the metaphorical journey they travelled together.  You see him making the first sexual and drug oriented moves which suggests he was the dominant influence on her.\n\nThe crash is a powerful image and represents the end to their relationship; it killed her to leave, she was the one left bleeding, broken and bruised.  You see he's injured too but his is mild in comparison, his suffering begins at the point of her metaphorical death; when he must carry the knowledge it was him that ripped her to pieces and destroyed her, and all he is left with is darkness and flames.  There is also a much milder, unintentional undertone of realisation that he must know it's her that's moving on and getting better having 'gone on to the next life'.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song is so heartwrenching. I think it's just about spending your time, especially your last days, with the one you love. It's about living while being alive.\n\r\nIn the music video, her facial expressions when she first sings \"sometimes love is not enough and the road gets tough, I don't know why,\" are so sad and genuine it makes me want to cry. \n\r\nI am absolutely in love with Lana and I can't wait to see/hear more! \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI'm gutted that she changed \"fuck\" to \"kiss\" in the official version.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nâ\u0080\u009cBorn To Dieâ\u0080\u009d is an amazing song. The first time I heard the song I was convinced that it would become one my favorites and it did!\n\r\nI think the song has more than only one meaning. For me the song is about a relationship that was never meant to last. Lana sings â\u0080\u009cYou and I, we were born to dieâ\u0080\u009d which I think refers to the relationship and not to Jesus and religion.\n\r\nI once had a sexual-based relationship to a guy. But I fell in love with him, and our relationship would never last. When I heard the song I just felt like the song was wrote to describe him and me. Especially when Lana sings, â\u0080\u009cSometimes love is not enough, and the road gets tough, I don't know whyâ\u0080\u009d it all makes sense to me. And when she asks, â\u0080\u009cIs it by mistake or designâ\u0080\u009d I think the meaning behind is that she is wondering if thereâ\u0080\u0099s a concrete meaning behind why she should end up in that situation. Was it planed or was it a mistake?\n\r\nItâ\u0080\u0099s hard to describe my thoughts about the song in English when Iâ\u0080\u0099m from Denmark, but I hope you can see what I mean.\n\r\nAnd one last thing: I love when she changes â\u0080\u009cLet me kiss you hard in the pouring rainâ\u0080\u009d to â\u0080\u009cLet me fuck you hard in the pouring rainâ\u0080\u009d.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI don't really agree, either, with the idea of this song being more about the meaning of life in general, so here's my take on the whole thing, which goes along with the doomed relationship angle...\n\r\nI do think there is something to the religious references in the song, but I think they are meant to be a product of her turning to her faith when contemplating this doomed relationship. I think, like others, that \"born to die,\" is meant to mean that their relationship was doomed from the beginning. I think she has realized what she wanted from a relationship, and it's not this guy (hence the \"lost but now I am found\" verse). But it is hard for her to accept it, perhaps because of all the fun times they've had, and so the whole song is coming from a very contemplative standpoint.\n\r\nIn the chorus, I think she's asking him not to talk seriously with her about their relationship because it's too depressing (don't make me sad, don't make me cry). She wants it to stay simple, she doesn't want to think about the fact that it probably won't work out (keep making me laugh, let's go get high). I think the \"love is not enough\" line suggests what she's realized, that no matter how strongly they feel about each other it just won't work out.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think this song is about her being in a relationship and knowing that it's about to end. She's not ready to let him go and doesn't want to accept that it's going to end and they're gonna break up so she wants to spend some last fun moments with him before he leaves her\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI agree with the majority of the people here who say it's about a doomed relationship. They knew from the beginning that it couldn't last forever (You and I - we were born to die ... Sometimes love is not enough). They're very attracted to and/or in love with each other, but are not suited for each other in the long run. \n\r\nI think the first stanza, it shows that she's wavering and wants to go back to him (Feet don't fail me now), and she hopes to God that she's made the right decision. And at the end of her life, she hopes to get him back, where perhaps other life concerns are not a priority, e.g. drug use, money, fidelity (But I'm hoping at the gates, they'll tell me you're mine).\n\r\nIn the second stanza, it seems she's talking about what life is like after she's left him. She's lonely and wondering if she's made a mistake, and possibly she wants him back, because everything is so unfamiliar without him (Can you make it feel like home if I tell you you're mine?).\n\r\nThen in the video, there are multiple images that reference strangulation and/or death, signifying that the relationship is very unhealthy, and culminating in the final image, where she dies in a fiery car crash with them deliberating losing control while kissing in the car. Maybe a projection of what would happen if they stayed together? Consumed in their dangerous lust? The male is not unscathed. You can see he's also bleeding, but still alive. I don't know what that means. Maybe he's less invested in the relationship. It may also reference the couple's sexual chemistry (\"Le petit mort\") as well as death.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThe song also has a darker meaning, clarified by the video.  The narrator hopes to maintain her courage to commit suicide, or murder/suicide with her lover.   As several comments have noted, this is a doomed love, a relatively innocent girl with a dark lover. (This trope is also in the song Video Games, and here is underscored by the references to \"insane girls,\"  \"wild side,\" and in the video, the clean-cut girl with the heavily-tattooed smoking guy with a street-rod type of car (it looks like a vintage Mustang or a Trans-Am).   in the video, she is clearly meant to be in an after-life type of setting, as suggested by the Renaissance church, her white dress (like an angel or a virgin sacrifice), the funereal flowers in her head covering, the supernatural restful tigers by her side (as in a 'peaceable kingdon').   She has hoped that the doomed love might be redeemed at the \"gates\", (the Pearly Gates), where she hoped to find out that upon death her lover is hers; however, she is in a relatively passive state (not as passionate as in life), alone (Talking Heads: \"heaven is a place where nothing ever happens.\")  She also felt her love redeemed her in a religous sense, using terms that are familiar to certain religions (I was lost but not I'm found, I can see but once I was blind).   The American flag at the beginning (and the car) perhaps such this is a particularly American kind of story.  Her act of attempted murder/suicide is shown in the video, but it both succeeds and fails, she dies, but he lives, so the reunion in death is also frustrated (and her revenge on her lover is also fulfilled by her death by not by his).   Amazing song, amazing artist!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nwhen I heard this song, the lyrics and flow of the music and Lana's voice portrayed my feelings for my ex perfectly. I am so in love with him, but we have both moved on in our own ways. \n\r\nLove wasnt enough for us, constant arguing, so much stubborness... we were so young. But no matter what, I still maintain that he is my true love and this applies to this world and the next. I hope that God tells me at the gates of heaven that he can still be mine.\n\r\nI am happy in life now, but I miss him and each time I think of him, I go back in the past and live with him in my memories for a few moments. Right now, I just want to enjoy life, make the most of it, get on and live, because at the gates, he will be mine again.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis is probably one of my favorite song lyrics. I think that it can be applied to couples who meet randomly and automatically have a very strong chemistry that then becomes love. However, life forces them to go separate ways and although there is love, she wonders if she will ever be with him again, which is probably unlikely. It's like she was not looking for a relationship and did not expect to find someone at that certain period of her life, but she ended up finding a guy that is perfect for her, making her suffer because she knows that they are not meant to be. When she's no longer alone on friday nights and feels that she has someone to call hers, circumstances in their lives force them to create a deadline for their relationship, and even though they are just enjoying the moment and trying to have fun, they know that they cannot be together and probably will never see each other again.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI interpret this song metaphorically... like, rather than 'you and I' being their actual mortal lives, it's their love/relationship, so 'you and I' in that sense. And the relationship isn't going to last, it's going to 'die'.\n\r\nMaybe I only see it like this because of my own experiences, and I haven't been in a 'dark' relationship but I've certainly been in a failed one that kept being revived and not working, and he wasn't good for me, and you do all this stuff, some of it crazy or against your normal nature, and you're clinging on and not getting to the conclusive ending, but both of you know it's over... and when you finally do end it, it's 'the last time' and you say your 'last words' and a whole bunch of other things I could pull from the lyrics... so I'm probably completely off the real meaning, but that's just how I like to see it. The mortality of their relationship, not themselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nits about love and breakup....she thought love can conquer anything and love is the only thing needed, so falling trully in love with someone, she though she was living her dreams (the american flag representing the american dream/perfect life she envisioned with him)...but its not. she was a naive, somewhat of a desperate girl who fell for the wrong guy\r\nI believe she's talking as a second person (as the lover) in this part\r\n\"Come and take a walk on the wild side\r\nLet me kiss you hard in the pouring rain\r\nand she states\r\n\"You like your girls insane\r\nChoose your last words\r\nThis is the last time\"\r\nshe's realized it couldnt last\n\r\ntheres obviously 2 \"worlds\" used as a metaphor for the breakup\r\ni believe the religious context in the video was her conscious/emotional journey whereas the ride with the lover was more of a physical explanation...in the latter both loved eachother, had fun...but the ride/car got out of control and they crashed..with her dead, and him still standing there,she left him...In the religious scenerio it seems like she's analyzing/fighting with her sub/conscious decision...she knows deep down what needs to be done, but now she HAS to accept it...she's struggling because she still loves him (i.e when he shows up randomly in the bedroom but clearly she's looking the other way)she avoiding temptation to go back to him..but finally she takes the decision to move on\r\n\"Feet don't fail me now\r\nTake me to the finish line\r\nAll my heart, it breaks every step that I take\"\r\nregardless of her decision she still wants him and can not be with him.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI don't know why, but I got a completely different meaning from the song and video than about a bad relationship.\n\nI kind of see them as in love and she's saying please keep making me happy and lets not focus on the bad because we were born to die.\n\nAnd you never know when your time will come so just make the best of everything while you can.\n\nThat is just what I got from the song. What do you guys think of what I'm saying?\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song always made me think of Alaska Young, from \"Looking for Alaska.\"\n(I can even picture her singing it ^^)\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nbeautiful and sad. perfect song.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\ni think she's talking about herself and her love guy. \"born to die\" means that their relationship had an expire date, that they wouldnt last forever and that he wasnt the \"one\" :P\r\nso this song is about the break up.\r\nand now she wants to live the last moments of their relationship and hopes that maybe, they can defeat fate and be together :)\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI haven't been able to listen to the song or watch the video the whole way through without crying. It's speaking volumes to me at the moment\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\ni think its about someones love obsession with drugs and their fate.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI have the digital booklet and I know this is so nitpicky but the \"me\" in \"can you make me feel like home\" is actually \"it\"...okay I am officially anal-retentive X(\n\r\nAlso, listening to the song, the first lines are \"Why? Who, me? Why?\"\n\r\nThat is all :x\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nWhat?\r\nWho me?\r\nWhat?\n\r\nFeet donâ\u0080\u0099t fail me now\r\nTake me to the finish line\r\nOh my heart it breaks every step that I take\r\nBut Iâ\u0080\u0099m hoping at the gates,\r\nTheyâ\u0080\u0099ll tell me that youâ\u0080\u0099re mine\n\r\nWalking through the city streets\r\nIs it by mistake or design\r\nI feel so alone on the Friday nights\r\nCan you make it feel like home, if I tell you youâ\u0080\u0099re mine\r\nIt's like I told you honey\n\r\nDonâ\u0080\u0099t make me sad, donâ\u0080\u0099t make me cry\r\nSometimes love is not enough and the road gets tough\r\nI donâ\u0080\u0099t know why\r\nKeep making me laugh\r\nLetâ\u0080\u0099s go get high\r\nThe road is long, we carry on\r\nTry to have fun in the meantime\n\r\nCome on take a walk on the wild side\r\nLet me kiss you hard in the pouring rain\r\nYou like your girls insane\r\nChoose your last words, this is the last time\r\nCause you and I, we were born to die\n\r\nLost but now I am found\r\nI can see but once I was blind\r\nI was so confused as a little child\r\nTrying to take what I could get\r\nScared that I couldn't find\r\nAll the answers honey\n\r\nDonâ\u0080\u0099t make me sad, donâ\u0080\u0099t make me cry\r\nSometimes love is not enough and the road gets tough\r\nI donâ\u0080\u0099t know why\r\nKeep making me laugh\r\nLet's go get high\r\nThe road is long, we carry on\r\nTry to have fun in the meantime\n\r\nCome on take a walk on the wild side\r\nLet me kiss you hard in the pouring rain\r\nYou like your girls insane\r\nChoose your last words,\r\nThis is the last time\r\nCause you and I\r\nWe were born to die [x3]\n\r\nCome on and take a walk on the wild side\r\nLet me kiss you hard in the pouring rain\r\nYou like your girls insane\n\r\nDonâ\u0080\u0099t make me sad, donâ\u0080\u0099t make me cry\r\nSometimes love is not enough and the road gets tough\r\nI donâ\u0080\u0099t know why\r\nKeep making me laugh\r\nLet's go get high\r\nThe road is long, we carry on\r\nTry to have fun in the meantime\n\r\nCome on take a walk on the wild side\r\nLet me kiss you hard in the pouring rain\r\nYou like your girls insane...\r\nChoose your last words,\r\nThis is the last time\r\nCause you and I\r\nWe were born to die\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nthey know they are going to die so they want to live life to the fullest and die together\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nBeautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI believe this song is about a bad relationship.\nFirst verse \"feet don't fail me now ......\n\nIt something that you don't really want to do but has to be done and going forward  it is hard and heart breaking \"Oh my heart it breaks every step that i take\" Still hoping that she doesn't have to and they were meant to be together.\n\nSecond verse \" Is it a by mistake or design\"\n She question if they were meant to be. And without him she feels alone she wants him to keep her busy .\n\nBridge \"Donâ\u0080\u0099t make me sad, donâ\u0080\u0099t make me cry\"\nSometimes love is not enough and the road gets tough\n\nShe want just want to have fun and don't want anything serious from him\n And I'm not sure what happen during their relationship but things went bad and He loves her, she loves him but love just isn't enough. So she just wants to keep things simple and have fun between them.\n\"you like your girls insane\" he likes that she's free spirit\n\n\"Choose your last words, this is the last time\nTime to say how you really feel because she not returning back to him \n\nCause you and I, we were born to die\"\nIt is the end of their relationship they are not meant to be together.\n\nThird verse \"Lost but now I am found\"\nShe was young, confused and naive but now she has matured and isn't that person any more and now understand the relationship isn't good. And has to leave it behind\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI think this song is about two very damaged/depressed people in love. They are both in the relationship only because they are so broken and they know that they are only using it to push away their real problems, so their relationship was \"born to die\". The phrase \"born to die\" could also be about how they both are depressed/damaged, and so it represents the dark place they both are in mentally.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI believe the song is about a couple who the girl knows that they are not going to last, but the guys is committed, because if you watch the video Lana is sad most of the song but the guy purposely crashes the car. its almost like \" if i cant have you know one can\"\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI think it's to do with the way Jesus was \"born to die\", and this is shown as well by her cross in the video and other religious references. I feel that she was maybe trying to say that Jesus goal in life was to die on earth for the people, and thus we were born to die as well, to walk in his footsteps, having to die to be resurrected to be with Him. And therefore her song reflects how despite us having other interests such as love for another human, inevitably we have to put these aside to focus on our true goal of being with the Lord.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI love this song and can't wait for her album.\r\nI think it's about a doomed relationship.\r\nThey can't be in a healthy relationship with each other but they're\r\nin love so are going to make the best of a bad situation.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nJust thinking about this and using the video as the model for the song, I noticed that the beginning of the song is where she seems to be at rock bottom. She sings about how she's struggling to get by, and that she is waiting for someone at the \"Gate.\" Death has no age, so she's this more grown woman waiting for something. As the verses progress in the lyrics, she seems to get younger and younger. The beginning she is struggling, whereas in the end she's singing about what she thought as a child. To sum it up, at the end, she recaps what she sang about. In the video, it started off as a good thing and rather young and premature; however, as the night progressed, life got more violent and a car crash followed. The man was still standing, holding the young lady; however, this is also the point where the song and the video merge to have the same feel. The beginning of the song was tragic and bloody, and the beginning of the video was happy and immature.\n\r\nIt's kind of like those reverse movies? That's how I see it.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI think it's about life & she is in love with this guy & she hopes in the after life they are still together\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nwhats the car in the vid?\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI thought it was about the way you feel in love and how much different it is to the feeling you have when you aren't in love. I suppose there are many meanings though.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\n\"Lost but now I am found,\r\nI can see but once I was blind\"\n\r\nIs a reference to the Cat Power song \"Metal Heart\" with the lyrics reversed.\n\r\n\"I once was lost but now I'm found\r\nWas blind but now I see you\"\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nFor me this song holds a kind of nihilistic, Nietzche stance on life. The whole kinda', \"life has no meaning, but let's just keep living and do what we want and live, and then when we die we die.\" If that makes any sense. Also, the quote at the beginning, \"is this by mistake or design\" alludes to, I think, a kind of philosophical/religious question.\n\r\n\"Life's short and there's nothing after this, so just live\" but with a pessimistic twist.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThis song just screams Cathy and Heathcliff from wuthering heights to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nAlbum version doesn't have the \"original\" lyrics, folks. Too bad. \"Fuck\" is harsher and gives the song much more bite. \n\r\nLana said this song, along with Video Games and Blue Jeans, is part of a sort of \"trilogy\", all about the same guy.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI just had a feeling it was dedicated to same person as \"Video Games\" - it kind of has that adventurous yet sad vibe around it. And she did say in one of the interviews she usually sings about the same person and that she'll probably love him forever. So I just might be right. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI think the song is about a relationship that was never destined to be, they are enjoying it while they can. \n\r\nI also in some parts of the song get the impression she could be talking about a late partner and her wish to commit suicide.\r\n\"take me to the finish line, my heart breaks every step that I take, but I'm hoping that the gates, they'll tell me that your mine' - Every day without him breaks her heart she just wants to end it all and join him in heaven - reference to the pearl gates. \n\r\nThe second verse could be that she sees now what she has to do. \n\r\nThe whole song and video has a Romeo and Juliet theme.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI think this is about loving someone and giving your heart to someone even though you know that you wont last but you love them anyway because you can't help yourself but you know the relationship is \"born to die\"\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nthis song describes perfectly how i feel sometimes, i am scared of death simply because i wont get to be with who i love anymore.\r\nbut when she says :\n\r\n'Oh my heart it breaks every step that take\r\nbut i'm hoping at the gates, they'll tell me that you're mine'\n\r\nHer heart is breaking because of the fact she knows the older she gets the closer she is to dying, but hoping when she gets the gates of heaven (or hell i dunno) that she will still be with him when his time comes too.\n\r\nthats my interpretation anyways, and those lines touched me :') lol\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nthis song describes perfectly how i feel sometimes, i am scared of death simply because i wont get to be with who i love anymore.\r\nbut when she says :\n\r\n'Oh my heart it breaks every step that take\r\nbut i'm hoping at the gates, they'll tell me that you're mine'\n\r\nHer heart is breaking because of the fact she knows the older she gets the closer she is to dying, but hoping when she gets the gates of heaven (or hell i dunno) that she will still be with him when his time comes too.\n\r\nthats my interpretation anyways, and those lines touched me :') lol\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThis song is simply about life...\n\r\nYou live it. And sometimes it's hard and sometimes you feel sad, alone and not in place.\r\nAnd you're all going to that end.. where maybe some big surprise is waiting.\n\r\n\"Lost but now I am found\r\nI can see but once I was blind\r\nI was so confused as a little child\"\n\r\nIt's about being aware of the fact that you live now, and that it will all end some day.\r\nBeing aware of that is being awake.\r\nand being 'awake' means being aare that you live, now. And don't get caught in a ratrace.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nBeautiful song, beautiful singer!\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nBeautiful song, beautiful singer!\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nBeautiful song, beautiful singer!\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nBeautiful song, beautiful singer!\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nOolala my computer has gone crazy!\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nWell, for me it means You find someone who has as much destructive force on life as You do at the time when You want to experience everything as much as You can and then one of them dies, the other one lives on and grows up in experience and knows exactly how it feels, but know how to deal with it\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThe religious correlations some of you have made is very interesting to me. I'm not a very religious person, so any religious allusions went right by by head. To me I got the feeling of \"star-crossed\" lovers. \n\nIt also makes me think of an abusive relationship - she describes herself at a very low point in the beginning, almost nearing death.  Yet, though he makes her \"sad\" and \"cry\", she stays with him, even though the road is \"tough\" and \"long.\"   Or rather, she enjoys the time she does have with him because she knows their relationship is doomed either way.\n\nAnother thing that makes me think she is in a damaging relationship is when she says \"You like your girls insane.\" To me, this makes it seem as if she was cheated on and/or her relationship with the person isn't very serious.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nHuh. I had not considered what most of you are saying before. I've always thought that the song was about a suicide pact between two lovers. They're both unhappy about life, so they want to end it together. However, I will admit that the video doesn't support my theory at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\ni heard a different meaning of this song on the youtube video, and it made perfect sense to me. lana del rey said that this song was supposed to be about her alcohol addiction, because alcohol was her first love. once you watch the music video it just makes more and more sense as it goes on. like at the beginning when she says \"so alone on a friday night\". and at the part when shes lying in bed, then the shadow crosses her and then the man is next to her. after the next shadow hes gripping her neck. stuff like that, its just so thought out.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI have these feelings similar to lyrics as well as the beats :) when I think of a guy I very much like and would love to own if  possible,but definitely not yet  \"love\".\r\nHe's the kind who makes me happy easily by his cheering temporament,and I guess I feel free to do crazy things with him because he's also  bit of \"all-okay\".\r\nBut I still fear life's toughness and  meaningless sorrow again haunts when later we're apart.He is good and strong.. but won't serve as my natural source of strength.\r\nIf I fall in love I may skip thinking of death,I guess.\n\n\r\nWonder if i'm alone by this opinion?\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI feel like this song follows two lovers, whose lives do not benefit from their being together. They are both at a bad spot and know that their relationship doesn't help things, but would rather be together, in pain, than apart and all alone. \n--\"I feel so alone on a Friday night\"...expresses how they feel when they aren't together\n--\"Don't make me sad, don't make me cry\"...hints at their problems \n--\"Keep making me laugh, let's go get high\"...they can get over their relationship troubles with drugs and 'artificial love'\n--\"You and I, we were born to die\"...tells that they both acknowledge the fact that their relationship could never work, but they continue seeing each other anyways\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis song is about the alcoholic dependence once she had:  \nsome symptoms are clear: \"Feet don't fail me now... I feel so alone on a Friday night... Don't make me sad... keep making me laugh...Let's go get high...have fun in the meantime\"\nThe Cd is conceptual, all the songs match one another, she said she went trough some experiences as any other young guy, but she doesn't feel ashamed for that part of her life. I love \"Born to die\" Cuz is not fair, life in not fair. Then we can appreciate Love, this song is also about passion and a relationship, love her/him 'cuz you and I were born to die...\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nThis woman has a gorgeous face and beautiful voice!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nFunny, \n\nI just read so many thoughts and meanings, passing by God to real love ... And so much more.. \n\nU see it?\nWe can understand the music but it's according to our mood and our way to see things, that we can take the meaning we want.\n\nWhen I first ear it, i do believe it's like a crush, a desire she just succumbed to.\n\n\"Feet dont fail me now..\" - Please, give me the corage to continue, since i've come this way so far.. \n\nthe chorus is obvious: the knowledge that they cant be together so \"Try to have fun in the meantime\". \n\nI do, I do believe it's a song that i can relate with an affair. She already told she like's her man older... =) So, why not a kinda cheatting song?\nMaybe it's my mood, my dark way to see things, but i do believe i can relate her song to something i'm feeling.. I know it's wrong, but we were meant to be, i used to mix all things up \"I can see, but once I was blind/ I was so confused as a little child\" But now, i can see things like they are. Until it makes us happies we dont need to do nothing.. 'cause we're born to die!\n\nSorry for my mistakes, I'm portuguese*\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI thought of this as a relationship that was falling apart, but she didn't want it to end. Like \"feet don't fall me now, take me to the finish line\" and \"don't make me sad don't make me cry sometimes love is not enough when the road gets tough I don't know why. Keep making me laugh lets go get high\" sound like it's ending against her will, and she just wants it to carry on.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\n\"feet dont fail me now, take me to the finish line, oh my heart it breaks every step that i take, but im hoping that the gates, theyll tell me that youre mine\" i think that shes talking about wanting to end her life, and shes hoping that the gates of heaven will tell her that her lover is hers in the after life (she sang about this several times, begging god to make \"him\" hers) and then the rest of the lyrics show that she want to give their love a second chance\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis woman knows the end of this \"relationship\" is coming to an end and it makes her sad. She's starting to realize that just because you love someone/something doesn't mean it's good for you.\n\r\nDon't make me sad, don't make me cry\r\nSometimes love is not enough when the road gets tough\r\nI dont why\n\r\n All she wants to do it party it up and not think of the future events coming. \n\r\nKeep making me laugh,\r\nLet's go get high\r\nRoad's long, we carry on\r\nTry to have fun in the meantime\n\r\nThis love is spontaneous/wild and very intimate but in the end they were never meant to last.\n\r\nCome and take a walk on the wild side\r\nLet me kiss you hard in the pouring rain\r\nYou like your girls insane\r\nChoose your last words\r\nThis is the last time\r\n'Cause you and I, we were born to die\n\r\nThe object of her love can be a drug or person. I think it is left for the listener's discretion.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nAfter hearing a couple of Lana's songs and reading some of her story, I want to share my interpretation of Lana's song. \"But I'm hoping at the gates, they'll tell me that your mine\" Lana lost a lover or friend to suicide and she hopes that God will allow her to be with them in the afterlife. As for the rest... She fell in love with SOMETHING (a person, alcohol, a drug) and in the end, the thing she loved (She has said alcohol was her first love.) it hurt her in the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\ni think this song is definitely about her alcoholism when she was younger, \"don't make me sad, don't make me cry\" refers to the drop you get you come down off of your high (from drugs or alcohol).\n\r\nI think she is using a actual boy and girl couple to represent how alcohol was her first love (which she said so) and that's what helped her get through things, but she knew it had to come to an end because it was ruining her life and she was making all kinds of bad choices\n\r\njust my thoughts :)\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nIn the end of the music video she dies\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI believe this song is not about literally dying but about a relationship.\nShe's in a relationship that's been really good but it has gotten to a point when she feels like everything is falling apart and that the end of it is going to be pretty soon. \n\nWhen she said \"Let me kiss you hard in the pouring rain\" I think she refers to the last kiss. since she feels the end is comming she wants to kiss him one last time, very pasionate, hoping that kiss will change his mind and he'll stay.\n\n\"Sometimes love is not enough and the road gets tough I don't know why\" means that she just realized that she, as well, doesnt want to be in that relationship anymore, she just realized that in a relationship, there has to be more things, like trust, communication.. things that arent clearly there, so they both start to realize that as much as they love each other, they dont have what it gots to keep the relationship going. And as in \"the road gets tough I dont know why\" is that everything changed so fast, she was feeling absolutely in love but then it feels like nothings working anymore, like theres something wrong but she doesnt know what has changed.\n\nAnd the rest of the song is just about her realizing that maybe her relationship wasnt meant to last forever, that it was pretty and it was really good but it was meant to end, thats why she says \"we were born to die\" but inside, shes really hoping everything works, that he'll change his mind and be like he was in the beginning of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nthe thrown she sits on represents the strength she has discovered through Spirituality. God makes you whole , secure . Found.\n\nLana taught me so much about my own journey. I do pine for the guy of my dreams, covered in tattoos. I miss him so much, but this journey is not over.\n\nI agree that he might come across as loving her less, but the fire in the background shows  how conflicted they both were, and her death is actually a rebirth into a new life. he remained conflicted, in pain.  Her pure face in a white dress shows that she heals whilst he remains bruised at the end of the video.\n\non a deeper level, a soul mate has no words, he couldn't understand the human part of soul mate. his demons drove him to drugs and escapism. he will remain lost until he reaches her, at the same spiritual level. that's why I believe in the end she is at peace, and he is not, he didn't realise how much he truly loved her too, the fire remained in his life without her. the darkness taking him. \n\ni've learnt one lesson from this song, keep God with me, don't give into dark thoughts. when you give into dark thoughts, you will do anything, to not feel alone. in the end, regain your strength, and if you must, use that strength to pull the one you love from the depths of hell. Show him what light is, through your own light. Let him see how much he truly loves you, because he truly does.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI believe this song is about a breakup. Lana del rey sings from the perspective of the girl in the relationship and how she feels about ending her relationship with her first love.\nShe recognises she needs to end the relationship to help her grow and \"find herself\", but despite this, the relationship is hard to walk away from. As she has made this decision, convincing herself that \"love just isn't enough\", she will always remember the good times with her first love. \n\n\nFeet don't fail me now\n Take me to the finish line\n- I need to walk away, so feet keep moving, I need to end this\n\n All my heart, it breaks every step that I take\n- I don't really want to leave, and it hurts\n\n But I'm hoping that the gates,\n They'll tell me that you're mine\n- In this lifetime it has not worked out with him, but I hope that we will meet in the next life.\n\n Walking through the city streets\n Is it by mistake or design?\n I feel so alone on a Friday night\n Can you make it feel like home, if I tell you you're mine\n It's like I told you honey\n- I've made this decision to walk away, but have I made a mistake or was it fate (\"design\")\n- I'm alone on nights I should be surrounded by people, but I imagine telling you I love you and imagine feeling at \"home\"\n\n Don't make me sad, don't make me cry\n Sometimes love's not enough when the road gets tough\n I don't know why\n- Sometimes relationships don't work out just like ours, love just isn't enough and there is no explanation.\n\n Keep making me laugh,\n Let's go get high\n Road's long, we carry on\n Try to have fun in the meantime\n- Let's move on with our lives, life is too short; despite this I still have memories of you (\"making me laugh\"; getting high)\n\n\n Come and take a walk on the wild side\n Let me kiss you hard in the pouring rain\n You like your girls insane\n-I will remember the times we were crazy in love.\n\n\n Choose your last words\n This is the last time\n 'Cause you and I, we were born to die\n- Despite this, we have to break up, so we need to say our last words and let this relationship end (\"die\")\n\n Lost but now I am found\n I can see but once I was blind\n I was so confused as a little child\n Tried to take what I could get\n Scared that I couldn't find\n All the answers, honey\n- I am trying to explain why I am the way I am, and why the relationship probably didn't work from my perspective.. I was lost in life and we are in different phases of our lives and I need to find myself without you.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nI think this song means that their love is very deep, but doomed. They both know it won't last but, they are going to enjoy it while they can, instead of being sad. \n\n\"Feet don't fail me now\nTake me to the finish line\nAll my heart, it breaks every step that I take\nBut I'm hoping that the gates,\nThey'll tell me that you're mine\" This is her saying that she hopes in the end they will stay together, but she knows it's not likely. \n\n\"Don't make me sad, don't make me cry\nSometimes love's not enough when the road gets tough\nI don't know why\nKeep making me laugh,\nLet's go get high\nRoad's long, we carry on\nTry to have fun in the meantime\" This is her saying, they're not gonna be sad, instead be happy for the times they've shared.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI think this song is 100% every lyric about Kurt Cobain's. She's a big Nirvana fan, so why wouldn't it be.\n\nI LOVE YOU, I LOVE YOU!\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nThis is my first interpretation, wow :D\n\nI have known Lana and her songs while i was living abroad in England (I'm italian) and I met an English guy that became my boyfriend. \nThis songs to me is about a girl who is into that kind of \"wrong\" relationship, she knows that but she still go on cause she' s living the moment and doesn't want to give up as her feelings are so strong but she knows already it can't last much longer.\n\nthe part \n\"Keep making me laugh,\nLet's go get high\nRoad's long, we carry on\nTry to have fun in the meantime\"\n\nand \n\n\"Come and take a walk on the wild side\nLet me kiss you hard in the pouring rain\nYou like your girls insane\nChoose your last words\nThis is the last time\n'Cause you and I, we were born to die\"\nmakes me think that she knows clearly what's about to happen on that relationship so she's expecting from it fun, craziness, tresgression and all you can get as quick as possible cause she knows everything will end.\n\nThe beauty of feelings, anyway, is that you can't really handle and plan it 100%, so it' quite hard sometimes to get over your heart and do the right thing for yourself.\n\n\n\nWhen I heard this song on the radio and I found the video later, I have been totally raptured by the purity and the honesty of this lyric, and I felt that it fits me so perfectly. \n\nWhen she says \n\"Don't make me sad, don't make me cry\nSometimes love's not enough when the road gets tough\nI don't know why\"\nwhat i feel is she's asking him to not be involved in his life so much, to keep the relationship as it comes without any expectations, cause she knows it won't last even if she obviously have strong feeling to him.\n\nTo be honest, I did the same, I got together with him to have some fun, an advernture, but he got attached pretty quickly and I did too, even if I always had the feeling that, sooner or later, we would get to an end. And it's eventually happened, I know it's 100% the right decision but obviously I miss him so much, I felt so alive with him.\n\n\"Sometimes love's not enough when the road gets tough\nI don't know why\"\nyeah, you can love the guy/girl, you can think he/she is the best on the universe and fits you perfectly, but sometimes circumstances (personality, money, distance or whatever) makes everything really hard and love itself is not enough to fix all of it.\n\n\nAlso, as somebody else wrote already, when she first sings on the video \"sometimes love is not enough and the road gets tough, I don't know why,\" her face is so genuine and expressive that makes me cry all the time!\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nThe meaning of the song is about  living each day like its your last day, letting go of sadness and resentment in your relationship, that's why she tells him \"Don't make me sad don't make my cry, sometimes love is not enough and the road gets tough I don't know why,\" keep making me laugh lets go get high\", this means lets forgive and forget there's no time to be sad and miserable, let's live everyday like its our last day, and make each other happy and have fun.\nThere's also the 2nd meaning to the song where she is probably taking a walk on her own meditating on her life and her relationship,  while at same time observing creation and questioning If there's a god out there, she finally realizes there will never be an answer to her questions. Regardless If there's life after death, she just wants to live to the fullest and let go of things that bring sadness in her life.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nWell she said that the song was about \" homage to true love and a tribute to living life on the wild side \"\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI think this song is about being in a relationship and at the same time knowing that it won't last for long.\n\r\nI personally can relate with that meaning, I've been with a guy for 2 years but in the end i was allways like \"choose your last words, this is the last time\".\n\r\nIt's like you know that this is going to end but you can't do anything except from waiting. Obviously this is a sad song as you can see from Lana's face in the video. It's not easy to let someone go even if you know that you were born to die\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\n[The song states that just like Jesus was born to die for our sins, we are all born to die for him and for someone else we love. Lana says, \"Is it by mistake or design?\", meaning she is questioning whether or not she is a mistake or if she was intellectually designed by a genius mind, God. She later then says, \"Lost but now I am found. I can see but once I was blind.\" This is no doubt, a religious line, saying she used to be lost, not knowing if she was a mistake or if God was real. But now she has accepted the Lord as saviour and, like it says in The Bible, she is no longer blind and can now see. It is clear to her now, just what the meaning of life is.\n\r\nThe song holds a very Christian/Religious meaning. It also goes into spending time with the ones you love, like it's your last moment. The music video proves this song is dedicated to God. She is decked in crosses and is gaurded in her \"heavenly palace\" by 2 tigers. Like it says in The Bible]\n\r\nThere is no denying, Lana has a semi-strong but at times shakey relationship with The Lord...\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\n\"Do you not know that your body is a temple of the Holy Spirit, who is in you, whom you have received from God?\"\r\n- 1 Corinthians 6:19\n\r\nVideo - 4:10\r\nSoul leaves body.\n\r\nPhysical death or spiritual death.\t\t\t\t\n\t\t\t\t\n\n"}