{"comment_0": "\nTHIS SONG IS BOMADACIOUS!!!!! FoeSHEEZY! I think Bone thugs realy helped the song out! It's a tight Ass collabo!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nadmit it.. people do this 'disguise' thing to make 'em feel alryt.. sad but true :(\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\neverything i've ever felt.........lately\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis is and can't live without you are my two favorite songs out right now because i'm in a long distance relationship, my boyfriend lives in england and i live in maryland and i only get to see him 3 times a year and phone him once every 3 weeks. we met down in the bahamas and really hit it off, like we had so much in common and so did our parents. we went to the movies twice and our families went out to dinner together twice. we had a BLAST. well now that it's over i'm really having a hard time moving on and knowing that i can't see him once a week and i cry myself to sleep every night just thinking about our memories together. so my friends that really don't understand this whole lond distance thing ask me how i'm feeling and if i miss him and that stuff just to make conversation and i say \"yea i miss him but no big deal\" because if i told them how i really felt then they'd be like your too young to feel that way. so when i'm with my friends i hold in the tears and i'm slowly losing my mind and dying of depression and not one of them have any idea. i love you ben!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI love this song, i think that everyone can relate to it, and the collaboration is awesome! I understand the fact she wants to express her feelings but she cant make herself do it after her relationship because she doesnt want him to know how weak she is.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ni LOVE this song! its great.. Well I guess I'm trying to be nonchalant about it .. she puts it perfectly!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nOne of my favourites, and I do like Mariah a lot. Reminds me of the time I started to listen to it, after making love with the dearest friend of mine, and realising that it was more for me than just a one night stand, but not for him...so I kept on acting like it meant nothing, but I never quite got to be the same towards him, since I'm still broken about it, but nobody knows it.\r\nI hear this song and tears flow from my eyes instantly. \"And I'm going the extremes to prove I'm fine without you, but in reality I'm slowly loosing my my mind, underneath the guise of a smile gradually I'm dying inside, friends ask me how I feel and I lie convincingly, 'cause I don't want to reveal that fact that I'm suffering...\"\r\nNobody knows I feel this way...but I'm slowly starting to show it so I can let go...\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis definitely is one of my favorite Mariah songs, it has an awesome beat and great lyrics. Bone Thugs and Harmony just make it better.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthey should add the BNTH rap lyrics, because they add a huge part to the song. this song got me through everything, and it's funny because after everything, i've gone back to this song to help me get throught this next break-up. the follow up to this song (where they \"get back together\") is Still Beleive with Krayzie Bone and Mariah. it's okay.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nfavourite song of mariah omg this song say so much\r\nWell I guess I'm trying to be nonchalant about it\r\nAnd I'm going the extremes to prove I'm fine without you\r\nBut in reality I'm slowly loosing my my mind\r\nUnderneath the guise of a smile gradually I'm dying inside\r\nFriends ask me how I feel and I lie convincingly\r\n'Cause I don't want to reveal that fact that I'm suffering\r\nSo I wear my disguise 'til I go home at night\r\nAnd turn down all the lights and then break down and cry\n\r\nVerse\n\r\nSo what do you do when somebody you're devoted to\r\nSuddenly just stops loving you and it seems they haven't got a clue\r\nOf the pain that rejection is putting you through\r\nDo you cling to your pride and sing \"I will survive\"\r\nDo you lash out and say: \"How dare you leave this way\"\r\nDo you hold on in vain as they just slip away\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ni love this song. mariah carey at her best\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nWhen i first heard this song i was like wow this is exactly what im feeling.  Especialy verse 2 and the chours. I dont need to explain the situation but this was all i listend to untill i got over this one person who cheated and up and left.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n*sigh* Again, overrated tosh.\r\nI've listened to Butterfly a ton and I STILL don't get what's so great about it. I understand if you're in middle school, but when you're 20-40 years old and still find it deep/meaningful, what the hell, people, what the hell?\r\nI still don't get the hype behind this album, it's probably Mariah's silliest album of all and yet every frickin' Lamb on the planet thinks that it's the greatest. Maybe if I had the brain of a 10-year-old I'd like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ngreat lyrics. Mariah is bad.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nIMO Butterfly is Mariah's greatest cd. \"Breakdown\" and \"The Roof\" are so deep. I really hope Mariah will someday go back to how she used to write and compose.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nVerse 1: Talks about a break up done over the phone. It's an honest and kind break up, so she's unsure of how she should react. She decides to go with the flow and be understanding of what her ex wants.\n\r\nChorus: She's trying to be strong for herself by not showing anyone the pain felt after a split. She goes through her day with a smile, but when she gets home she can't help but to breakdown and cry.\n\r\nVerse 2: She sings to the audience and asks them how they would feel if they went through what she described in verse 1. A clever way to write a song because the audience is allowed to reflect on their love life making it easy to connect to the song.\n\r\nRap: This section has a lot of depth. Each member of BTNH put a quick flow about accepting the break up and moving on or waiting for the future and stuff like that. My fave line is \"Don't let this world get the best of you\".\n\r\nThe song is easy to relate to and very meaningful if a person has ever been left by someone they wanted to stay with. \t\t\t\t\n\t\t\t\t\n\n"}