{"comment_0": "\nthis song is about letting your loved one be free, and seeing if they come back to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nYeh, its like u keep the people u love so close to u, and they need space, so u let them go, but u know they will come back to u, hence the And truly feel your heart will \r\nLead you back to me when you're \r\nReady to land \r\nSuch a beautiful song!\n\n\n", "comment_2": "\nthis song is very beautiful. I like it a lot.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nLyrically and musically, this is one of Mariah's best-written songs.  It is probably inspired by her divorce, which left her both sad because she really loved her husband, and relieved that she was finally doing the right thing by breaking away from a time in her life that she described as \"the height of her unhappiness\".\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nYou know that saying..if you truely love someone, you will do what's best for them, even if it's letting them go....that's exactly what this song's about. I guess sometimes if you can't do anything to make the one you love happy, then all you can do is let them go, \"if you should return to me, we truely were meant to be\", is a hope to wait on, because that's all you can do is wait if your love is looking everywhere except at you.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ni love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song has 2 meanings..the first one is pretty self explainitory about if u lose a love and if it returns its meant to be..but theres another meaning not many people know...its about her finally free from tommy matolla her ex husband. he was very controlling of her when they were married. the divorce to her was a blessing.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nand mariah loves her independence :D\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI love this song, what she is saying is so true- sometimes the thing you love the most you must 'set free' in order for it to be truly yours if/when it comes back to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni love mariah's music. one of the prettiest thing about her lyrics is that they are easy to understand. very direct. she says exactly what she wants to get across without using all sorts of metaphors and allegories and things like that. BUT it still took me like 4 years to REALLY understand what she's singing about. probably because i was going through this painful time when i had to \"let someone go\". i was just sitting in the car listening to the song and at that point i totally appreciated what she was saying. but you know what... my butterfly came back to me. I really love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI liked your comments, it's such a nice touching song that as you said before, is about letting someone be free, hoping that he will come back...\r\nAnd in her career, I think she took a step into more sincere and in a way raw songs...I loved what came after that, and the whole \"Butterfly\" album is full of honest songs, like \"Rainbow\", some of \"Glitter\" songs and \"Charmbracelet\", and the AWESOME \"The Emancipation of Mimi\". I like her more everytime.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song makes me feel like writing a story! hahaha... anyway, I like how it's about letting someone bring out the best in himself, even if it would mean letting him go, because...\r\n\"If you should return to me\r\nWe truly were meant to be\"\n\r\n:D\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI love this song ... reminds me of my ex boyfriend... this song used to make me ball my eyes out but now it makes me stronger!! I love all mariah's music... I love her to death!!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis is a very sad, yet such a beautiful song. There is a sense of freedom in it.. even though she is torn, she also seems uplifted and strong. It takes so much inner strength and courage to make a decision to let somebody go, to set them free. I think it's one of the hardest things to do in life. This song is just so beautiful, I think it's a bit underrated actually. Should have been a number 1 hit. I know the 'chart' doesn't really matter at the end of the day, but yeah. I love the whole build up in this song. The first half of the song she sings with a soft, gentle voice. Then the last half of the song she fully belts out the words/melody. Her voice is so powerful, it sends shivers down my spine and brings tears to my eyes. Mariah is a very vulnerable woman, she's so beautiful in every way. I love her songs so much.. especially powerful and impacting ballads like this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nTo me, this is the best song Mariah Carey's ever written. It is also my favorite song ever. It's just so beautifully written but what I think stands out the most is the melody and that incredible build. The song starts are very mellow but ends with such an impactful finish. I agree with daydreamer1 when they wrote that this song is underrated. This should have been such a bigger hit than what it was.\n\r\nThe song is very simple yet powerful: when you love someone, you should give them enough space to find themselves when needed; it may hurt, but you have to do it. \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nGenerally, the song is about letting a loved one go to see if they return. That has many interpretations depending on who is listening. In my opinion, the song isn't really about a break up. It's about letting the person you love go because you want what's best for them. Maybe it's because they have a career or a dream they've always wanted to pursue and you care so much you want them to reach it. In other words, you let them fly... and hope that one day, somehow they will find their way back into your life.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nMariah has said that she wrote this song about her relationship with Tommy Mottola.  She said that when she wrote \"Butterfly,\" the lyrics are what she wished he would say to her.  Mariah is the \"unbridled horse\" in the song.   The music video is also based on the Tennessee Williams play \"Baby Doll.\"\t\t\t\t\n\t\t\t\t\n\n"}