{"comment_0": "\nI posted too soon, i thought i'd already included this, so just to add, it reminds me of my great nan,\r\n~she was very important to me and this song just hits a nerve when i think about her & hear it\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song is so truthful to everybody. Recently I experienced my first death I've ever gone through and it was somebody I was very close to. My grandfather was very sick and kept so strong just to be able to spend a few more months with us. He was an amazing person and this song puts me into tears because it's so true. I love Mariah Carey and even though most of her songs touch heart, everybody who's ever lost a loved one will absorb this song greatly. I heard this song on the radio and have been looking for it since. It's absolutely phenominal. It's not like an uplifting death song but it shows the true emotions to loosing a loved one. All you want to do is just have one more moment with them, but in the end you have to say good bye... and it's the hardest thing ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI love this song.Although I have not going through the death of someone close to me,I have lost people in my life like my best friend.We haven't talked in months but no one knows how sad I am because I keep it inside.I guess the song could also be about losing someone just in your life.Like someone moving away or something.\n\r\nTHOUGHTS GOING OUT TO THOSE WHO HAVE LOST SOMEONE!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni'm not sure about anyone else, but the first time i heard this song, i cried. its such an emotional song and mariah carey was right on the button with this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthe song says it all. it's about losing someone you love and how painful it is...\r\nsad and depressing yet very wonderful song.\r\nthe essence of this song is just so real.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ni think someone told her exactly what is going on in my life right now, this song is eerily similar to what's happening to me.  my grandma died this christmas day and my favorite uncle 2 wks later.  \"you never got the chance to see how good Iâ\u0080\u0099ve done... you never got to see me back at number one\" i've done horribly my past 3 yrs of college and she always told me she knew i could do it even till the end this semester i got a 4.0 and she never got to see it.  every single line in this song pertains to me, it's so weird and it came along at the perfect time.  i didn't really care for mariah carey that much until this song and the timing is perfect.  i'm sure everone can relate to this song or will at some point in their life.\r\n\"I wish that you were here to celebrate together\r\nI wish that we could spend the holidays together\".  i can't even talk about this song without tearing up.  it is AMAZING.  and her voice is so pretty it makes it so much better.  \"I thought you were so strong\r\nThat you can make it through whatever\r\nItâ\u0080\u0099s so hard to accept the fact youâ\u0080\u0099re gone forever\" ugh. every single line in this song even by itself is so meaningful.  this is my new favorite song.  I play it to everyone I know that hasn't heard it.  *sigh*\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nAbout losing someone in anyway. Death, moving, breaking up. Anyway. It's still sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni think this song is about you don't have to say bye to the people you love who've died or broken up with you. they are only a phone call or a prayer away. its about trying to stay strong through tough times and about excepting the fact that they are gone.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ni experienced my first death also. when i heard this i thought of it as a break up. my grandma died last week -- i cry everytime i hear this song.\n\r\nthese are my favorite lines:\n\r\nI never knew I could hurt like this\r\nAnd everyday life goes on like\r\nI wish I could talk to you for awhile\r\nI wish I could find a way try not to cry\n\n\n\r\nit really is tough.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthis song tells my life. I lost my father at 7 years old i am 12 now and still miss him. I can relate to this song and all the rest of the comments the other people put. I LOVE THIS SONG\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ni love this song\r\nrecently i have had three deaths in my life and after i heard this song i just cried my eyes out i miss them so much but when i listen to this song i remember the good times we had together  \r\ni miss them so much i wish i could just see them for a mintue just to say goodbye\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nyeah it got me. i miss my babiesss\r\n=[\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI'm Not, by any stretch of the imagination, a Mariah Fan, but this is one of the most beautiful songs I've ever heard\r\nits so sad but at the same time kinda hopeful\r\n\"we will never say bye bye\" Kinda like a \"they're always with you\" Sorta thing. i've always seen mariah's music as shallow, and her as a barbie, but this song's so true to everyone, it shows a different, more emotional side to mariah.\r\nIts So Bittersweet, and it kinda reaches out to everyone\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni have never lost anyone close to me before. and im dreading the day i do. this song is beautiful, it makes me wanna cry, but im so cynical and out of touch with my emotions that i cant... :'''(\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis reminds me of my nan.\r\nI love the lyrics.\r\nThey bring tears to my eyes.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni'm also the one who cried after hearing this song for nothing in particlar. Its way thatn m/c had rendered the lyrics of this song which makes us emotional. in the video, when a boy cries while taking autograph from m/c is also quite emotional\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI can really relate to this song. Every time I think of this song or hear it, I think of my mom. my mom is gone and she never be back but i'm glad that i got to spend the time with her that i did. it's better to have known then to not have known her at all. We will never say good-bye because i assume that she has reached a better place and that I will too. There we'll meet again. So until we meet again. I love you always,mom. R.I.P.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis song means so much to me, it is on the playlist at work n always plays around 11pm when i am all alone and it gives me goose bumps everytime, i lost my sister 7 years ago and today would have been her 16th birthday. if only.... miss you angel... love you xxx\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI love this song <3 \nI lost my Uncle to cancer .. Everytime i listen to this song i cry cause i can  relate to it xo\nThanks MC\t\t\t\t\n\t\t\t\t\n\n"}