{"comment_0": "\nJB said once in an interview if there was any sort of theme behind their music. all the members of the band replied no...JB said 'well there is one...love your dawg.'\n\r\ntrue.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIt's about Charlie Brown, duh ?!?\n\r\nJohn Bell's family, from the Cleveland area, are/were close personal friends of Charles Schultz's family.\n\r\nan ode to Peanuts & Life :)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI love this song!  This song I can never get sick of.  The meaning I can relate to so well:\r\n\"Charlie really likes his friends\r\nBut in his heart he knows that sometimes a dog is as good as any man\r\nTrying to do as we should\r\nThat doesn't always rhyme with doing what feels good\"\r\nI love it, your friends aren't always what they seem, and sometime you just need someone/something to listen or to be alone.  This song does that for me.  I crank this song in my dorm when Im alone and close my eyes, just zone out of life and into the amazing music and lyrics.\r\nMy favorite part, besides the guitar/piano solo in here is:\r\n\"But you can sit in the grass it feels good\r\nYou don't even need to think a word\r\nYou don't have to worry, don't worry\"\n\r\nMan, that is exactly how I try to live, and how I think summer should be.  Kickin it with friends, some beer and some good tunes.  WSP is one of the best bands to enter my CD player.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\njeff riley, an old dorm buddy of mikey came up with the idea with some late night influences.  mikey and jeff played around w/ it and here you go....  a song about life about a kid that didn't fit the normal mold.  Charlie, loves his friends....  friends watch him fall and laugh (football kick).  he finds that he can find his happiness with his good old puppy....  and sometimes just sit in the green, green and enjoy himself....  whatever feels good.  \n\r\nnow the sketching lucy on the run gets a bit complex.  2 theories.  \n\r\n1.  charlie schultz, created and can erase lucy with a simple strike of an eraser.  and in a cloud of dust from the eraser on the old black board lucy is out of the picture.\r\n2.  charlie (brown) sketches her in a different way...\"charlie draws a gun, and sketches out lucy on the run....and bang, cloud of dust old lucys gone.?\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nTo me, this song is about child bullying.  Charlie is a \"naive\" child and is picked on by all the other kids that he believes are his friends.  The only person that really listens to him is his dog.  Fed up with the bullying, he shoots Lucy.  Sounds like the outcome of a lot of bullying in schools these days.....\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nLike someone said Mike's roommate in his dorm wrote these lyrics.\n\nThis song predated Columbine and I think with those individuals it might hold true.\n\nSuch a great song but as I hear it, having stayed up late, all these school shootings. I don't know what is wrong with most of those people.\n\nRed Rocks '11 on youtube and school work. Undergrad is OK.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis is a deep song. I completely agree that it is through the eyes of Snoopy. It also talks about bullying and how people reach their breaking point. Ironically, it's very relevant today with the school shootings. One of my top favorite widespread songs ever. â\u009c\u008cï¸\u008f\n\n\n"}