{"comment_0": "\nthe ultimate love song: about how love can't be conquered; it'll come for you, it'll take over you, it will never let you go\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nMy mom used to sing this song to me when I was younger, so I agree with LMB228 about how it can be a universal song of affection rather than just for lovers. Its such a sweet song in the sense that its stated so simply, but so perfectly...the meaning is so clear, yet so profound: you don't find love, love finds you, and you have basically no choice but to accept it, whether it will end up being your death or or your life. Such a glorious song, I'm no huge Elvis fan, this is the only song I like by him, but still, its one of the best songs ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis was me and my last boyfriend's song. We were in his room, and I told him we needed a song. He said that the next song that came on the radio would be \"our song,\" and this is what came next. Too perfect. It was ironic, too, because he told me he had feelings for me about six months before we got together. He had just broken up with a friend of mine and I just kept telling him he was rushing into something he wasn't ready for. But we ended up together. He was the best boyfriend I ever had, and everytime I hear this song, I think of how much we used to love each other. It is the perfect love song.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nhe's afraid he's falling in love too fast, but he cant help it... which is about the most romantic thing ever and I love tis song\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt's a great song... but it's called Fools Rush In.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nElvis is dead.  This song is about the conservation of the planet.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nthats a fun song and its really sweet i think but hey what do i know !!!!!!!! herah for elvis \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni love this song! but what do you mean by conversation of the planet? i think it means that theres this person who he isn't supposed to love, but  he does anyway, and this is like his 'confession'. I have no clue, just listen to the song!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI love Elvis, so fine (in his day) his voice is good, and this song is great.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThe ultimate love song.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ntake my hand, take my whole life too \n\r\n-perfect.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nGreat song. Lots of meaning. Me right now!!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nshe have had a boy friend ...in 3 years ! but i can't help falling in love with her ...who some day i will walking hand in hand with.... would it be a sin ? yes ...but i can't help falling in love with her\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is one of the greatest love songs of all time. People have fallen in love and made love and walked down the aisle to this song for decades and now I just made it the first Elvis song on this site to have comments in the double digits when Alkaline Trio and shit like that have comments in the hundreds.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nre-aranged elvis presley (not the presly bit and it says prsly lives all tho i serousli doubt it but i onli came on here to say that\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song was Elvis's last song he would sing in his seventies concerts. He used it as a closer to his shows.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\ni love this song, as with many of elvis's songs. \"Like a river flows, surely to the sea, darling so it goes, somthings are ment to be\" i love this line, because to me it represents sadness and maybe letting go?.. i dont know, i just like it \"take my hand, take my whole life too!\" how sweet.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nGreat lyrics and melody!  Finding my feelings written out in a song makes me smile, even though I am sad about letting go. But, its not really letting go - its more moving on - that's what a river does - it moves on toward the sea.  This love I feel is a vast as an ocean and the wisest thing I ever did was abandon myself to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI agree with jcr - the wise people who say 'only fools rush in' are the ones who have not permitted themselves the freedom to abandon themselves to love.  For me it is also about moving forward - 'staying' would be a 'sin' because it has no movement.  Dynamic people live a life that continues to change and grow.  If relationships can't do that - they end.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nisnt it someone falling in love with another's wife? so to stay would be a sin, like a river goes surely to the sea and somethings are meant to be... but i cant help cos i falling in love with u. not letting go, to me, the opposite. i love the words: how love can't be conquered; it'll come for you, it'll take over you, it will never let you go... thanks.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nthe song speaks for itself. there doesnt need to be a meaning from us.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nthe only song that has ever made me cry. it reminds me of my best friend, who has been dating this girl for over a year. i'm in love with him, and i can't let him know. i know that i shouldn't because he has a girlfriend, but i couldn't stop it from happening.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nthis is the only song my dad and i have ever danced to.  so i can see it being played at my wedding for the father/bride dance.  \n\r\nit is a love song but father's have a love for their daughters that nobody else can touch.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nMy favorite song of all time and Elvis sings it to perfection!\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThe meaning of the song is pretty obvious, but I read somewhere that elvis always sings this song to show how much he appreciate his fans\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\ngreat song, one of my favourites\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nYes.. one of the best love songs of all time.\r\nThis is just such a beautiful and breath-taking song. Makes me quite teary actually. This song is filled with passion, desire, longing, beauty, magic, romance etc. One of Elvis' best songs. Long live the KING!! Lovvvve Elvis sooo much. Even though he really went down hill in the last years of his life.\r\nI guess most celebrities do!! makes you wonder if its really worth being a celebrity. Hmm.. Anyway.. I just love this song soooo sooo much!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\ngreat song about a guy to a girl who he really loves the girl may be his freind we the listeners dont know, micheal buble does a amazing cover of this song also not better then the orginal but still damm amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nthis song is my parents wedding song\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthis is my parents wedding song.  its so beautiful\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI fall asleep to this song. It's so peaceful and cute.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nHis deep voice is nothing but magical in this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nbest song ever.\r\nit means to me, that he loves this girl, but its bad thing he loves her, like a 'sin' but he cant help falling in love with her anyway cause 'some things are just meant to be'\r\nso he doesnt care if they 'take my whole life too' for he cant help falling in love with her.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nSuperr\t\t\t\t\n\t\t\t\t\n\n"}