{"comment_0": "\nI read through the comments, and I really don't think this song is about him getting his car radio stolen. I think it's about him running out of distractions and having to actually deal with his problems and emotions. I think it's about him learning how to be alive. But that's just me.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nkroq.cbslocal.com/twenty-one-pilots-discuss-their-rising-popularity-and-grassroots-approach-to-music/\n\r\n\"Joseph said that while he was going to college to major in Communications (or in his words, a fancy way of saying undecided), he pulled his â\u0080\u009chorribly beat up car to the placeâ\u0080\u009d where heâ\u0080\u0099s â\u0080\u009csupposed to learn for thousands of dollarsâ\u0080\u009d and because he was late, didnâ\u0080\u0099t lock the door. As one might suspect, when Joseph left class his car was gutted with his CD Player, GPS, and car radio stolen.\r\nâ\u0080\u009cAnd because Iâ\u0080\u0099m super emo and all about looking for inspiration, I wrote a song about that moment.â\u0080\u009d\r\nJoseph said that sans car radio, he had more time to be introspective. â\u0080\u009cThat song kind of just documents where you let your mind go when you donâ\u0080\u0099t have a distraction to keep it in its box.â\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni like this song because its easy for me to relate -\n\r\n\"I ponder of something great\r\nMy lungs will fill and then deflate\r\nThey fill with fire\r\nExhale desire\r\nI know it's dire\r\nMy time today\"\n\r\nbasically explains how i feel, i feel like i have limited time on this planet which equates to a finite time inwhich i have to conquer all of what i want to accomplsh with my life. \"i ponder of something great\" i have all these great ideas and the ambition to conquer them, but i have to keep in mind that time waits for no man, no matter how great he. or his ideas are\n\r\n\"I have these thoughts\r\nSo often I ought\r\nTo replace that slot\r\nWith what I once bought\r\n'Cause somebody stole\r\nMy car radio\r\nAnd now I just sit in silence\"\n\r\nbasically explains how he suffers from \"racing thoughts\", he can't turn his brain off because he's constantly thinking about anything and everything in every scenario possible. he can escape this feeling by sleeping, but when he's not sleeping the only way to preoccupy his mind is with music. with no radio he has no way to block out his thoughts\n\r\n\"Sometimes quiet is violent\r\nI find it hard to hide it\r\nMy pride is no longer inside\r\nIt's on my sleeve\r\nMy skin will scream\r\nReminding me of\r\nWho I killed inside my dream\r\nI hate this car that I'm driving\r\nThere's no hiding for me\r\nI'm forced to deal with what I feel\r\nThere is no distraction to mask what is real\r\nI could pull the steering wheel\"\n\r\nnow he hints that even though some of his thoughts are pleasant and hopeful, he also has negative feelings in the same, quiet, thoughtful manner. this verse is further explaining the point that without music, he is forced to deal with his thoughts. serving as a constant reminder for everything. he feels so lost and helpless that he even goes as far as saying \"i could pull the steering wheel\" hinting that he could run himself off the road (suicide) and end this constant feeling of not being able to escape the monsters in your head\n\r\n\"I ponder of something terrifying\r\n'Cause this time there's no sound to hide behind\r\nI find over the course of our human existence\r\nOne thing consists of consistence\r\nAnd it's that we're all battling fear\r\nOh dear, I don't know if we know why we're here\r\nOh my,\r\nToo deep\r\nPlease stop thinking\r\nI liked it better when my car had sound\"\n\r\nfurther explaining the negative side of his constantly racing thoughts\n\r\ni think this song is basically about how when someone stole his car radio, his thoughts drove him to have suicidal ideation, because he has an overactive imagination\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI feel like this song is pretty self-explanatory. When you are just alone in silence, your thoughts can consume you. Especially, when you have dark thoughts, it can be easy to get overwhelmed by them. Tyler (the singer and writer) can't find anymore distractions, and he is left alone with his thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nMy pride is no longer inside\nIt's on my sleeve\nMy skin will scream\nReminding me of\nWho I killed inside my dream\nI hate this car that I'm driving\n\nI feel like this is one of the most significant parts that all the comments I've read are missing. Basically what I think is that he's using the word pride as more negative as in depression and his sleeve is his wrists where (sorry I couldn't think of a nicer way to say this) he cuts himself which is why his skin is screaming and in this case, his \"car\" is his body.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI ponder of something great\nMy lungs will fill and then deflate\nThey fill with fire\nExhale desire\nI know it's dire\n      My time today\n\nThink about something better than reality. Breathe and breathe while taking misery and still hoping to end up with something incredible. Everyday is important.\n\nI have these thoughts\nSo often I ought\nTo replace that slot\nWith what I once bought\n'Cause somebody stole\nMy car radio\nAnd now I just sit in silence\n\nHe keeps thinking and thinking about the bad things but knows he should be thinking about happy memories he holds. His distractions have left him, which causes silence, which causes overthinking and depression.\nSometimes quiet is violent\nI find it hard to hide it\nMy pride is no longer inside\nIt's on my sleeve\nMy skin will scream\nReminding me of\nWho I killed inside my dream\nI hate this car that I'm driving\nThere's no hiding for me\nI'm forced to deal with what I feel\nThere is no distraction to mask what is real\nI could pull the steering wheel\n\nQuiet leads to thinking which leads to bad thoughts which can inflict emotion. His pride can be destroyed by other people, rather than before when he could stay proud no matter who tried to bring him down. His looks remind him of something not beautiful, screaming at him that he isnâ\u0080\u0099t perfect. His appearance reminds him of people who insult him, which is who he wishes to die. He hates his life and the road he is taking with it. There is nothing to stop his train of terrible thoughts. He realizes he can take a sharp turn with his life and change.\n\nI ponder of something terrifying\n'Cause this time there's no sound to hide behind\nI find over the course of our human existence\nOne thing consists of consistence\nAnd it's that we're all battling fear\nOh dear, I don't know if we know why we're here\nOh my, \nToo deep\nPlease stop thinking\nI liked it better when my car had sound\n\nHe thinks of terrible things because there are no distractions. He finds that the one thing that connects to everyone is that everyone battles with the idea that they donâ\u0080\u0099t control their fate. His thoughts are becoming deeper and deeper, as he struggles with the thought of why he was ever born. He realizes that his thoughts are inducing a kind of sadness, which is why he wishes for his train to be cut off.\n\nThere are things we can do\nBut from the things that work there are only two\nAnd from the two that we choose to do\nPeace will win\nAnd fear will lose\nThere's faith and there's sleep\nWe need to pick one please because\nFaith is to be awake\nAnd to be awake is for us to think\nAnd for us to think is to be alive\nAnd I will try with every rhyme\nTo come across like I am dying\nTo let you know you need to try to think\n\nThere are only two basic things in life, peace and fear. In the end, death is peace, so peace conquers. Peace is made up of faith that life will get better. Fear is made of sleep because sleeping is more like hiding from life. You must choose one or the other, because to have faith you must be awake to believe. Once awake, a human thinks. Once thinking, you are alive in the simplest terms. He speaks as though he is dying for people to really believe him.\n\nJust what I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nAs someone who has gone through and overcome depression, this song is incredibly powerful to me. \n\nMusic was always my escape. My thoughts were terrifying when left to their own path, so I needed something to funnel or focus them. Music was that focus. This was when I was in middle school, 2003-2006, so most of what I listened to was Relient K, Switchfoot, and Thousand Foot Krutch. I cannot explain how vital those bands were to me overcoming that struggle. \n\nBut there were days were I couldn't listen to music. Say I forgot to charge my ipod, or I forgot my headphones. I would get my ipod taken away from me by teachers constantly for listening in class. Those days when I didn't have that distraction were brutal. My parents could literally tell what days I didn't have music based on what mood I was in after school.\n\nThis is how I relate to this song. I obviously couldn't drive back then, but sitting in a car alone with my thoughts during that time would have been terrible. That's what I feel like this song is conveying. Yeah it sucks to get your radio stolen but this is way deeper than that. It's the void that is left when you are alone in silence.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think it's about him losing the radio and music (a distraction) from his suicidal thoughts, and how he gets worse without it, \"I hate this car that I'm driving\" shows that driving is a pain without music.\n\n\"I hate this car that I'm driving\nThere's no hiding for me (distraction)\nI'm forced to deal with what I feel (suicidal thoughts)\nThere is no distraction to mask what is real\nI could pull the steering wheel (could kill myself)\"\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nTrust me, this song is literally about someone stealing his car radio. If you've ever lived through this, you know the unbearable silence that comes when you lose the distraction of the radio. There's nothing that will let you escape the screaming silence other than pulling the steering wheel (killing yourself) and you debate it for the entire time you're driving. It feels like hours driving, even if it's only 10 minutes. I know the 15-20 minute drives home every night used to scare my boyfriend to death because he didn't know if I would make it home or not. He gave me his iPod every night if mine was dead so I would have a distraction. The music saved my life. That's why he's going insane, someone stole his car radio and he's just sitting in silence. Silence is violent.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni believe that thing song is about how he now has nothing to distract him from his problems. he used to have the car radio, which has songs, to take him to a different place and save him from what is really happening but now that it is stolen, he now has to deal with those problems because without the music to distract him, it makes him think about what is really happening to him. and his thoughts are taken over.\n\n'I'm forced to deal with what I feel\nThere is no distraction to mask what is real\nI could pull the steering wheel'\n\nthis line indicates that because he doesn't have the music to distract him, he feels like his mind is taking over and the only way to make it stop is to just end it; crashing the car (pulling the steering wheel).\n\n'Oh my, too deep, please stop thinking\nI liked it better when my car had sound'\n\nin this part of the song, he begins to think too deeply causing his to panic. he then wants his car radio back to put the distraction back so he doesn't need to think like this.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI think why he is trying to say is someone said something and \"stole\" his confidence or will to live and so he sits there thinking and it makes him realize that he doesn't like his life so he needs to replace those thoughts\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song sounds like he's thinking too much and about the worst things and he wishes it weren't silent so he could stop thinking.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI feel like this is about somebody coping with depression.\n\"I have these thoughts so often I ought to replace with what I once bought, cause someone just stole my car radio and now i just sit in silence\" meaning he has nothing to distract him from his depression, and he has to face it, then he questions living at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think that the meaning of this song is about a girl. She died in a car accident at his fault. She used to talk to him and now there is no one to help him get through life. \"I could pull the steering wheel \" I think means he wants to pull the wheel to get into another crash so he can die too\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI see a lot of 'This is so obvious\" comments, yet they're all different view points. GG Tyler, you've done your job :)\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nTyler's car radio got legitimately stolen and he wrote a song about it (Said in the Vessel bonus track commentary)\nSo that's what the song's about, I guess\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis is my interpretation of this song:\n\n     In short, this is a story about someone who wasted all of their time and never followed their dreams and aspirations. For instance, when he claims that his lungs \"fill with fire, exhale desire,\" it can be assumed that the fire is referring to his hopes and dreams, whereas instead of exhaling progress towards those dreams, he only exhales the thought of those dreams.\n\n     When he claims that his time is dire today, he means that the time in each of his days is just too short and he is in need of more time. The \"car radio\" is actually a representation of everything that kept him from following his dreams. However, he feels that he cannot continue in his endeavors, causing him to \"just sit in silence.\" Silence (and synonyms of it) refer to time.\n\n     Past the first chorus, we get a glimpse of how he feels that he cannot hide from his failures. Claiming that his failure to do something with his life keep haunting him, they remind him of who he killed in his dream. He didn't kill someone, instead he killed something, his aspirations died after he wasted all of his life. Instead of him killing his aspirations while he is asleep and dreaming, perhaps it happened because of his daydreaming.\n\n     He goes on to state that he hates the car he's driving, that he hates the life he's living. Deeper into the verse, he reveals that he has to deal with everything that distracted him. Angered by how much he is thinking about this, he contemplates committing suicide, or as he calls it \"pull the steering wheel.\"\n\n     Afterwards, he contemplates life itself. Going really deep into the thought.\n\n    Finally, he contemplates suicide again. Comparing suicide with the number two, he ponders into if suicide would be worth it. Peace versus fear, life versus death. Later saying that his faith is keeping him awake. Trying  to get someone to realize that he is dying, that he needs someone to know that he needs to think.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI think that the car radio is his faith and hope, and the car he's driving is life.\n\"Somebody stole my car radio\" - Someone broke his heart or hurt him and now he has no faith left.\n\"And now I just sit in silence\" - There is no meaning to life left to Tyler.\n\"I can pull the staring wheel\" - It doesn't really matter if he kills himself because of his lack of motivation.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI ponder of something great= \" I go to seek a Great Perhaps.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nwith this song I believe, you have to read between the line. for example, \"somebody stole my car radio,\" he isn't talking about a car or even a radio. the car is his life, and don't you think a radio would make a car \"come to life?\" Some one took his will to keep going, one could say they took his soul.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nHey friends :) Thank you all  sharing your thoughts and, ultimately, bearing your souls to one another. That is beautiful, incredible strength, and you never know whose life you're impacting. \n\r\nPlease don't ignore the this verse: \n\r\n\"There are things we can do\r\nBut from the things that work there are only two\r\nAnd from the two that we choose to do\r\nPeace will win and fear will lose\r\nIt is faith and there's sleep\r\nWe need to pick one please because\r\nFaith is to be awake\r\nAnd to be awake is for us to think\r\nAnd for us to think is to be alive\r\nAnd I will try with every rhyme\r\nTo come across like I am dying\r\nTo let you know you need to try to think\"\n\r\nThis is my favorite part of the whole song. \r\n- There are things we can do to fill our \"silence.\" (Drugs, alcohol, self harm, etc. VS. productive things like art, serving people or animals, sports, practicing faith, etc.)\r\n-But ultimately, it all comes down to 2 options: fear vs. faith/peace, and the actions we choose demonstrate our choice between the 2.\r\n- Faith is to live and death is to sleep; many people choose death out of fear and despair.\r\n-(here's my favorite part) Fear loses when we have faith. (For me, that's faith in Christ, the ultimate hero over fear.)\r\n- Faith=to be awake\r\n  To be awake=to think\r\n  To think=to be alive \r\n- THE ARTIST'S MAIN POINT IS TO USE ALL HE HAS (every song, every word, every breath; to the point it feels like he's dying from pouring himself out so hard) TO REMIND YOU, YES YOU, FRIEND, TO KEEP ON LIVING. To not give in to fear, because it cannot win. You can be victorious. Please, for Twenty One Pilots and for me, NEVER GIVE UP. \t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nTyler actually got his car radio stolen!\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI think that this song is about depression. For example the song states \"But from the things that work there are only two And from the two that we choose to do Peace will win and fear will lose It is faith and there's sleep We need to pick one please because Faith is to be awake And to be awake is for us to think And for us to think is to be alive And I will try with every rhyme To come across like I am dying To let you know you need to try to think\" which means that choosing faith, is choosing to not die, and sleep is to sleep, forever. And he is so angry about his Car radio because some people that suffer from depression, try to \"drown out their thoughts will very loud music. Sounds like a stretch, right?  Well, in their song \"Migraine\" it flat out says \"Let it be said what the headache represents, it's me defending in suspense, it's me suspended in a defenseless test, being tested by a ruthless examiner, that's represented by my depressing thoughts.\" You may be saying that is a different song. Yeah, I know it is, but if you really think about it, maybe all their songs is about depression.  \n\nUPDATE: Tyler Joseph is the singer of 21 pilots. He said that he went through a time where he was depressed and had anxiety. Also suicidal.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nwell i know for sure that this is actually him just talking about how his car radio was stolen one day. because he opened why he wrote this song at the first concert i saw them play... By experience of my car radio being stolen all you do is just sit there driving with your thought. but he could also be talking about when he was in depression all these things get stuck in his head and without music you are just stuck there thinking about them.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nFaith is to be awake\nAnd to be awake is for us to think\nAnd for us to think is to be alive a\nAnd I will try with every rhyme\nTo come across like I am dying\nTo let you know you need to try to think\n\ni love this part\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nFor me..\n\nCar Radio = Heart \nCar = Life\nSteering wheel = Brain\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nIt's music like this that keeps me from destroying the planet.  It's existential and, as such, touches a broad group of people.  My radio was never stolen; but, it failed me many times throughout my life and it left me to think.\n'Please stop thinking\nI liked it better when my car had sound'\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nits obvious that overall this song is about not having your radio anymore, but as with most works of art there is a lot more than meets the eye....\n\ni really like the fact that this band is getting popular, back in early 2000's really obscure stuff like this was still considered \"weird\" so it just stayed underground. songs directly relating suicidal thoughts weren't \"cool\" but now it seems that weird and obscure stuff is really taking the stage in current entertainment. makes me hopeful for the future of music, as i was really disappointed up until recently, with the direction of music\n\ni wonder if the line \"fill with fire, exhale desire\" is a drug reference? as most drugs are smoked\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis song is about God. Basically every single one of their songs is. The lyrics are just not very overt. For instance, from \"Ode To Sleep\":\n\r\nI'm not free, I asked forgiveness three times\r\nSame amount that I denied, I three-time MVP'd this crime\r\nI'm afraid to tell you who I adore\r\nWon't tell you who I'm singing towards\r\nMetaphorically, I'm a whore, and that's denial number four\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nAll I know is that I have been here many times before. Have you ever had to ride to the music of the wind? How about when your mind is in overdrive? Its just like at night when you put your head upon that pillow and you actually realize you have a life. Its so easy to ignore your own life, but when you realize that you can't escape yourself, and you are always there...These are the times that can make, or break you.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ni think this song talks about someone who lost something that was really important to him but was 'stolen from him'. for example a child that loose his parents or and child that his childhood was taken away. at the begining of the song his life is completely broken and he lost the thing that made him what he is. someone completely lost. in the end he starts to get over it and believe in himself. he is learning to advance on his own.\ni would like to have feed back on what you guys think!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThis song's pretty simple to interpret in my opinion. It's a good piggyback to Holding On To You in my opinion, because they are so similar. The car radio may actually have been stolen, since he said in his concert that it's a true story. It's about him being depressed and suicidal, and when he can drive with music he has a distraction from the painful thoughts inside of him. Once that distraction's gone, however, all he has is his own thoughts, and on a long car ride that can be horrible. I remember driving 2 hours home from philly after a huge fight with my girlfriend and my radio didn't work, and honestly all I wanted to do was crash my car and get the thoughts out of my mind. For somebody living with depression, silence could be the loudest sound there is.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nTrust me, this song is literally about someone stealing his car radio. If you've ever lived through this, you know the unbearable silence that comes when you lose the distraction of the radio. There's nothing that will let you escape the screaming silence other than pulling the steering wheel (killing yourself) and you debate it for the entire time you're driving. It feels like hours driving, even if it's only 10 minutes. I know the 15-20 minute drives home every night used to scare my boyfriend to death because he didn't know if I would make it home or not. He gave me his iPod every night if mine was dead so I would have a distraction. The music saved my life. That's why he's going insane, someone stole his car radio and he's just sitting in silence. Silence is violent.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI think that the song is about someone who tends to think very deep, or to think the worst. When his car radio is stolen, he cannot stop thinking about, well, everything. This, of course, takes the lyrics very literally.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI think this song has both physical and metaphorical meaning. The physical meaning is that his radio actually isn't working and that causes him to think in the worst ways, in ways that scare him, and he can't stop thinking. The metaphorical meaning is that somebody took away his happiness (radio) and he is left thinking to himself what he could do (pull the steering wheel) and he dreams of killing himself (who I killed inside my dream) and he hates himself and his body (hates this car that I'm driving). And at the end he wants to tell people that there are alternatives to killing themselves and they need to think about what they are doing. (And I will try with every rhyme\nTo come across like I am dying\nTo let you know you need to try to think)\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nMusic helps stop the non stop thinking, with out a car radio there's only silence. Silence is when the worst thinking starts and won't stop.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI think this song can be taken in a lot of different ways, depending on the person listening to it. Personally, the way I think of it is that his biggest fear is silence because then he is forced to be alone with his thoughts. When someone makes that fear a reality, he starts going insane.\n\nI think songs like this where the meaning isn't totally clear are brilliant because people can interpret them in a way that relates to them.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI agree with the people here that he doesn't like to sit in silent because he is all alone with his thoughts.\n\nI also think, in the end, when you hear all the instruments at the same time, that symbolizes his thoughts, which are so \"busy\" and \"disorganized\" and that's why they're so loud and powerful. \nDuring that part, you hear him screaming several times. I think this means he tries to scream through his thoughts, like he doesn't want to hear them.\n\nThis is a beautiful song, I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI think the car symbolizes life, and the radio is the girl he loves. She distracted him from the bad things in life, made it a bit better. But \"somebody stole\" her, so she's gone, and now he can't see the good things anymore, because the nice sound of the radio is gone, and the car is silent, which he hates.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThe song is about the thoughts that we all adopt from society that are lies, and that once you take away the noise of society, it's too much for most of us to handle, because we start to consider things like the presence of a God, or if we're living our lives right, so we would prefer to allow society to preoccupy us and pretend we're living a righteous life. He says faith is to think and to think is to be alive. So we may be devoted Christians seem to have who have life figured out, but if we are still letting the earth brainwash us with lies rather than thinking for ourselves, we're as good as dead anyway. His message to us? \"And I will try with every rhyme/ To come across like I am dying/To let you know you need to try...to...THINK\"\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThis song is really powerful for me. As soon as I heard it on the radio Friday morning on 104.1 the edge I stopped in awe. The world stopped for me. This describes how I feel everyday. For me the Car Radio is the soul/emotional heart of the machine. Ive been through so much shit in my 18 years of life so I've never had the time to have a soul. I've never had a girlfriend I've never loved. My Car Radio was stolen from me when I was 10 and I want to Replace That Slot With What I Once Bought Cause Somebody Stole My Car Radio And Now I just Sit In Silence\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nCar= Life \nCar Radio= Heart\nSteering Wheel= Trigger of a gun\n\nThats how I see it\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\n\"I ponder of something great\nMy lungs will fill and then deflate\nThey fill with fire, exhale desire\nI know it's dire my time today\"\n\nHe is thinking introspectively and getting worked up about what he is thinking, realizing his time today isn't good.\n\n\"I have these thoughts, so often I ought\nTo replace that slot with what I once bought\n'Cause somebody stole my car radio\nAnd now I just sit in silence\"\n\nHe has these deep over thinking thoughts so much he wants to fill the void. His void was the car radio. Now that it is stolen, he has to reflect on his thinking. The sitting in silence line is his distraction from his thoughts being gone. \n\n\"Sometimes quiet is violent\"\n\nThe car radio being the distraction tool, plays noise, so without the noise, it is quiet. It being quiet, leaves him in his rough thoughts. \n\n\"I find it hard to hide it\nMy pride is no longer inside\nIt's on my sleeve\nMy skin will scream reminding me of\nWho I killed inside my dream\"\n\nHis dignity is starting to fade and his flaws are appearing on the surface. His thoughts are of introspection of who he is. He is seeing his flaws come out more  and every little thing he has ever done that is bad, like killing someone is making him grow self loathe, even if the killing was in a dream and not in real life. \n\n\"I hate this car that I'm driving\nThere's no hiding for me\nI'm forced to deal with what I feel\nThere is no distraction to mask what is real\nI could pull the steering wheel\"\n\nHe hates who he is and the life that he is living, representing the car. Without the distraction he has to deal with his emotions. There is nothing to disregard reality. He then says he could crash the car by pulling the wheel, representing killing himself. \n\n\n\"I ponder of something terrifying\n'Cause this time there's no sound to hide behind\"\n\nNow he ponders in a darker trance than before, since his distraction his gone, like the sound of the radio. \n\n\"I find over the course of our human existence\nOne thing consists of consistence\nAnd it's that we're all battling fear\nOh dear, I don't know if we know why we're here\nOh my, too deep, please stop thinking\nI liked it better when my car had sound\"\n\nHe is saying humans battle the fear of the unknown, which causes lots of thinking. He liked it better when he had his distraction. \n\n\"There are things we can do\nBut from the things that work there are only two\nAnd from the two that we choose to do\nPeace will win and fear will lose\"\n\nNow the narrator is saying to overcome this thinking we have to choose between having peace with life because the fear will keep us thinking, and eventually killing ourselves.  \n\n\"It is faith and there's sleep\nWe need to pick one please because\nFaith is to be awake\nAnd to be awake is for us to think\nAnd for us to think is to be alive\"\n\nThe narrator says either we have faith in life or just ignore everything and sleep. He then leads to why faith is important to being alive and thinking.\n\n\"And I will try with every rhyme\nTo come across like I am dying\nTo let you know you need to try to think\"\n\nThe narrator says it is important to think, unlike before when his thoughts were covered by a distraction. \n\n\"And now I just sit in silence\"\nNow he just stays in his thoughts.\n\nSymbols: Car - Himself, His Body\n              Car Radio- Distraction, Possibly Drugs, \n\nTheme: The theme of this song is that we use distractions to avoid our thoughts and clouded mind.\n\nPurpose: The purpose of this song is that we need to choose peace over fear in deep thoughts, but we need to think too. He believes if we choose to have faith in the thoughts of why we are here and life questions, we are choosing to think over sleeping and not caring. \n\nOverall a good song and this is just my interpretation :)\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nIt seems like he is using 'car radio' as a metaphor for his true self. He says someone stole his car radio: he stole his true self, like he became someone different and got rid of the old him. And when he says 'Who I killed inside my dream' kinda seems like he is saying that because he became someone else, his wishes faded away. 'I hate this car I'm driving' is that he hates himself for becoming someone else. When he talks about 'distraction', he is saying that there is no way to hide that he is someone else. But then from 'There are things we can do' to 'To let you know you need to try and think' seems like he is trying to bring the old him back and get help, but then after that, he goes back to the new him that he hates. \"I ponder of something great' to 'I know its dire my time today' kinda says that with every breath he takes in, he wants help, but with every breath he exhales, he can't bring himself to call out for help.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nSo i have listened to this song over and over and over trying to figure out the true meaning behind this song. The way i portrayed it is that this song is not about someone stealing this guy's car radio. Imagine this, the car is his life, the car radio was his girlfriend. Someone came and stole his car radio (his girlfriend) therefor he does not have a distraction of the realism and the fear of the world around him. He doesn't like the car he's driving (the life he is leading) because he can not hide behind his distraction anymore. Because he does not have his distraction he is going crazy because he is thinking and pondering in silence too much. He seems depressed. Part of the chorus is: I have these thoughts, so often I ought\r\nTo replace that slot with what I once bought\r\n'Cause somebody stole my car radio\r\nAnd now I just sit in silence\n\r\nWhat i got from that is he is overthinking everything and thinking too often. He wants to replace his girlfriend (which is the car radio that was in the slot) with something he once bought (maybe he feels that he bought or deserved her by the things he had done to have her as his girlfriend?). But since someone has stole his girlfriend all he can do is sit and silence and over think.\n\r\nThat is my portrayal of these lyrics and maybe because its a fear of mine in my own life. You never know. O.o \r\nI think it makes sense though\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nMaybe this is just me as a huge Jesus-freak but is this song not about God/religion? \nI ponder of something great\nMy lungs will fill and then deflate\nThey fill with fire, exhale desire\nI know it's dire my time today\nI see this part as being a Godly revelation. For anyone who hasn't experienced one these lyrics totally describe it. Of course in thinking about God, your gonna be think about something that is great and over your head and it sometimes seems hard to breathe. Most religions relate the burning love for GOD a fire and as desirable. It becomes apparent you could die at any moment. \n\"Sometimes quiet is violent\nI find it hard to hide it\nMy pride is no longer inside\nIt's on my sleeve\"\nI like this part because in my religion, being Catholic Christian, we are taught that we should not be proud of accomplishments and not speak of them unless absolutely necessary. When we sin, it can usually be based on pride and we bear it on our \"sleeves.\" \n\"My skin will scream reminding me of\nWho I killed inside my dream\nI hate this car that I'm driving\"\nI think this part is kind obvious at least to me and I'm sure others. He is talking about hating that he wants to kill himself and how it is making him live his life. \n\"There's no hiding for me\nI'm forced to deal with what I feel\nThere is no distraction to mask what is real\nI could pull the steering wheel\"\nA lot of times I avoid the quiet with God because I know He is going to ask something big from me and I don't want to do it. So I hide it with distractions, music, TV, homework anything, just to get away from it. But then quiet hits you. You can't find anymore hiding places just quiet. Then right at first for me, I just want to die. Die so that I don't have to do it. Yes this is quite morbid but this is the first time I know and can explain it do to this song(thank you 21 pilots). \n\"And it's that we're all battling fear\"\nWhen I get to this point of finally listening and I hear an answer I do literally think: \n\"Oh my, too deep, please stop thinking\" \nand it's hard not to run away again but it is so tempting because\n\"There are things we can do\nBut from the things that work there are only two\nAnd from the two that we choose to do\nPeace will win and fear will lose\nIt is faith and there's sleep\nWe need to pick one please because\nFaith is to be awake\nAnd to be awake is for us to think\nAnd for us to think is to be alive\nAnd I will try with every rhyme\nTo come across like I am dying\nTo let you know you need to try to think\"\nAnd here we are again...talking about faith and the ever present thought of sleep whether literally(actually sleeping your whole life away so you won't have to deal with the questions and problems of everyday.) or metaphorically sleeping(death-whether natural or killing yourself). Peace(GOD) will win. Fear(Devil or ourselves or maybe the latter) will lose. He says that choosing to be awake is to be alive and to be alive is to think. I think he's trying to say choose to listen, to be aware of what God is telling us and then he even states \"you need to try to think\" not cover it up with music. But that doesn't mean music is bad, just don't let it take the GOD'S Place in your life.\nThen he says he needs to replace the slot...which I think means the slot being either religion and breaking free from it or(because I am religious) replacing what your false God was, being maybe the music from the radio. \n\nAnd this could totally all be false in the writer's opinion or possibly it is true. But what matters is it means something to me. Although he says it is only from the incident of getting his car radio stolen I don't think this is completely true because it has to be deeper than him being emo about the simple things in life:)\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nPersonally, I believe this song is full of symbolism. I view the Car as someone's physical life, driving on and on. The Car Radio could represent happiness or a distraction from what's going on in life. \"Pulling the steering wheel\" could be a suicide reference. I just see this song basically saying \"When the happiness is removed from my life, I still have to keep going and face my fears and problems.\" This song is enriched with brilliant quotes, but the symbolism seems really deep for me. I know interviews with the lead singer explain that the song is totally literal with no symbolism, but I seem to interpret it different.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\n   The meaning of this song isn't about him killing someone and having to live with it (hence the \"in my dream\"). It's about his car radio being stolen, and sitting in silence without the distraction of the music. He notices that without that distraction he's lonely. He describes the quiet as \"violent\" because he's forced to listen to every thought and emotion.\n\n\n", "comment_48": "\nI think that the focus of the song is literally about his car radio being stolen but with a deeper meaning as well, He says \n\n\"There's no hiding for me\nI'm forced to deal with what I feel\nThere is no distraction to mask what is real\"\n\nto me this song means how hes being forced to deal with his reality instead of finding a distraction from facing reality. Basically His car radio being stolen is forcing him to deal with his emotions and problems. since he no longer has his car radio, he struggles to deal with the amount of thoughts he has, both terrifying and great. he was trouble coping with his own mind.\n\n\"Too deep\nPlease stop thinking\nI liked it better when my car had sound\"\n\nhes also struggling with just simply having his car radio stolen and being forced to sit there in silence which actually is horrible. the music in his car keeps him sane and once he lost it he realized how he was left alone with his thoughts and thats why \"silence is violent\"\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI think the lyrics \"I could pull the steering wheel\" is another way of saying \"I could kill myself\". The rest of the song is about not having a distraction for thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nOk honestly I got on here to learn about songs and their meanings but I always find myself answering with what I think. I think that's the actual beauty of this band. They create music that allows everyone to experience it in different and deep ways of their own. Which I believe is the true masterpiece in their work. But anyway here's what it means to me.\n\r\nI believe this song talks about how our human minds are always trying to distract us from God and what's really important in this life. I believe the car radio is a car radio or something to symbolize a distraction in our lives. I also think when he talks about his \"time being dire today\" is a reflection on how life is short and how it's important to spread the gospel to as many as possible while we're all here.\n\r\nI also love the part that talks about faith being awake and how we have to pick between sleep and faith and how being awake is to think and thinking is to be alive and I see that in my life. If I wasn't mentally awake to God and I chose to sleep instead and just listen to my car radio I wouldn't be anywhere and I would be doomed after this life. This song talks about how our faith is challenged and how even Christians doubt that they are truly saved and how these thoughts often invade our minds when we aren't distracted. That's just what it meant to me. I love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI think that he car radio kind of refers to his ability to think a certain way and how someone stole that so he can't think of the things but instead he has to think of new things and he just can't\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThis is how I interpreted this song. This is mainly because I suffer with panic disorder. It's when I have a panic attack when I overthink too much. This song perfectly represents how I feel inside, and maybe, just maybe, it was what the writers thought as well.\n\nI ponder of something great\nMy lungs will fill and then deflate\nThey fill with fire, exhale desire\nI know it's dire my time today\n\nHe ponders of something great. He forgets all his troubles about these crazy thoughts overcoming him and focuses on just that goal, which fills his lungs. But, these thoughts have returned. It makes him sad again. His lungs deflate. They fill with fire because it is overcoming him. But he needs to exhale desire because he knows this is a test from God. He knows that this disorder is making him want to do things that God forbids. Therefore, he does not do them. And he knows that it's time for his bad thoughts to come today again.\n\nI have these thoughts, so often I ought\nTo replace that slot with what I once bought\n'Cause somebody stole my car radio\nAnd now I just sit in silence\n\nThese thoughts come to him often. Therefore he feels the need to distract him from those thoughts with music. However, his car radio was stolen, and now he sits in silence, with nothing to distract him. \n\nSometimes quiet is violent\nI find it hard to hide it\nMy pride is no longer inside\nIt's on my sleeve\nMy skin will scream reminding me of\nWho I killed inside my dream\nI hate this car that I'm driving\nThere's no hiding for me\nI'm forced to deal with what I feel\nThere is no distraction to mask what is real\nI could pull the steering wheel\n\nYou know how people say \"It's always the quiet ones.\" Well that's exactly what this is. People think that violence is always stabbing, murdering, punching, etc, but not in this case. These thoughts are insanely violent, even if they're only a figment of his imagination. And each day, it's getting harder and harder to hide these thoughts. And his pride is escaping. He no longer feels pride in himself because of how he isn't hiding these thoughts, people are thinking he is selfish. He is not doing the things he used to be doing due to this, and whenever he does, he makes everyone stop doing it just for him to go home because his thoughts made him not able to handle going anywhere or doing anything, therefore everyone thinks he is selfish, even though he cannot help it. And on his sleeve, is his pride. He is scratching his sleeve because it helps relieve the pain, or at least he thinks it does. And he cannot hide anymore. His car radio is gone. There is no distraction, he is forced to face this problem. He needs help and he needs to tell someone about it. And now, there is no distraction to mask what is real. This problem in his head is so severe, he is starting to question the existence of anything. And he could just pull the steering wheel, crash the car, and kill himself, and it could be all over. No pain anymore. But he won't. Notice how he says he \"can\" pull the steering wheel. He knows God doesn't want him to kill himself, so he is continuing to live, because he knows it's a test.\n\nI ponder of something terrifying\n'Cause this time there's no sound to hide behind\nI find over the course of our human existence\nOne thing consists of consistence\nAnd it's that we're all battling fear\nOh dear, I don't know if we know why we're here\nOh my, too deep, please stop thinking\nI liked it better when my car had sound\n\nHe ponders of these terrifying thoughts. His head is trying to make his biggest fears a reality. And he knows he cannot distract himself with the sound of his car radio. And he notices that throughout the existence of humans, we all battle fear, but many different then others. For him, the fear he is battling exists only in his head. And he then that thought makes him question why we are hear on earth, soon realizing his overthinking is scaring him, and he was wishing his car radio was on to distract him from these thoughts. \n\nThere are things we can do\nBut from the things that work there are only two\nAnd from the two that we choose to do\nPeace will win and fear will lose\nIt is faith and there's sleep\nWe need to pick one please because\nFaith is to be awake\nAnd to be awake is for us to think\nAnd for us to think is to be alive\nAnd I will try with every rhyme\nTo come across like I am dying\nTo let you know you need to try to think\n\nHe realizes there are two things he can do by himself to solve this, and it will destroy fear and peace will be on top. He can choose faith. He can rely on God for a solution, and be patient. Or he can kill himself. And he knows God, no matter what, will not be happy for you to commit suicide. He knows to have faith you need to stay alive and be patient. And he knows that the only way for you to understand this is serious is to make you feel how he feels inside. As if he is physically dying.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI believe that his \"car\" is a metaphor for his life and \"radio\" is a metaphor for his dreams. And that someone stole his dreams or inspiration. \n\r\nHe says that he \"likes it better when his car had sound\" I thinks he's trying to say that he liked it better when his life has meaning and he had something he could try and accomplish but now he just \"sits in silence\" because someone said he couldn't achieve his dreams. \n\r\n\"I ponder of something great\r\nMy lungs will fill and then deflate\r\nThey fill with fire, exhale desire\r\nI know it's dire my time today\n\r\nI have these thoughts, so often I ought\r\nTo replace that slot with what I once bought\r\n'Cause somebody stole my car radio\r\nAnd now I just sit in silence\"\n\r\nI think he means that he's filled with inspiration and fire but then he doubts himself or others begin to doubt him and bring him down. He thinks that he should find a new dream and replace his old one because someone \"stole\" it. \t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nIn my opinion, I think this song is about some type of mental illness, whether depression, anxiety or something of the like. The car radio, or distraction, is what he is using to avoid his mental illness. Once it is stolen and he has no distraction, he is left to think about it and deal with it.\n\n\"I have these thoughts\nSo often I ought\nTo replace that slot\nWith what I once bought\n'Cause somebody stole\nMy car radio\nAnd now I just sit in silence\"\n\nWhich basically means he really should get a new radio because his thoughts keep coming back to him. He uses the noise to block out his problems but without it, he can't avoid it.\n\n\"Sometimes quiet is violent\nI find it hard to hide it\nMy pride is no longer inside\nIt's on my sleeve\nMy skin will scream\nReminding me of\nWho I killed inside my dream\nI hate this car that I'm driving\"\n\nIn the second first, when he says that \"sometimes silence is violent\" I think heâ\u0080\u0099s having suicidal thoughts, without the music he falls deeper into depression.\n\nâ\u0080\u009cThere's no hiding for me\nI'm forced to deal with what I feel\nThere is no distraction to mask what is real\nI could pull the steering wheelâ\u0080\u009d\nIn this part, he clearly states that there is no distraction to hide his mental illness. â\u0080\u009cI could pull the steering wheelâ\u0080\u009d could mean heâ\u0080\u0099s going to commit suicide.\nâ\u0080\u009cI ponder of something terrifying\n'Cause this time there's no sound to hide behindâ\u0080\u009d\nSomething terrifying = ending his life or just his thoughts of it, he finds it scary. Thereâ\u0080\u0099s no sound to make it seem like itâ\u0080\u0099s okay.\n\nâ\u0080\u009cI find over the course of our human existence\nOne thing consists of consistence\nAnd it's that we're all battling fear\nOh dear, I don't know if we know why we're hereâ\u0080\u009d \nThis is him questioning his life and existence, whether itâ\u0080\u0099s enough to keep living.\nâ\u0080\u009cThere are things we can do\nBut from the things that work there are only two\nAnd from the two that we choose to do\nPeace will win\nAnd fear will loseâ\u0080\u009d\nPeace might be getting help, finding happiness/a purpose.\nFear is fear itself or depression.\n\nâ\u0080\u009cThere's faith and there's sleepâ\u0080\u009d\nHaving faith that things will be okay, living vs. death.\n\nâ\u0080\u009cFaith is to be awake\nAnd to be awake is for us to think\nAnd for us to think is to be aliveâ\u0080\u009d exactly what I just said.\nâ\u0080\u009cAnd I will try with every rhyme\nTo come across like I am dying\nTo let you know you need to try to thinkâ\u0080\u009d \nIt goes from first person and then he breaks the fourth wall by telling us to stay alive: faith is to be awake and awake to be think, therefore thinking is staying alive(?) heâ\u0080\u0099ll try his hardest to tell us in songs to stay alive.\nThis seems to be the theme in most of their songs. An example is Truce where Tyler sings â\u0080\u009cstay alive, stay alive for meâ\u0080\u009d.\n\nâ\u0080\u009cI ponder of something greatâ\u0080\u009d = staying alive\nâ\u0080\u009cMy lungs will fill and then deflateâ\u0080\u009d = living, breathing\n\nSo in summary, this song goes from him being okay to getting is car radio stolen and literally sitting in his depression, to having thoughts of suicide, then the option of staying alive and dealing with it, to telling us to stay alive, and then either getting help and/or overcoming coming depression.\n\nJust my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nto everyone who thinks it is about him getting his car radio stolen: it is a metaphor. its like him having, in my honest and personal opinion, no one to talk to or maybe being depressed for a reason. there's unbearable silence that you have to sit through during that period of time. Or, he could've gone through a breakup or something and by metaphor \"had his heart stolen\" by the one he loved but because of their separation he sat in silence and some of the other lyrics could be suicidal references, etc. But ya thats just me\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis is like when I was sick and had to stay home for 4 days alone on the couch. I didnt have my freind with me to distract me so I listened to music instead. I listened to this song and made the mistake of taking it a little too seriosly when he said 'I will try with every rhyme  to come accross like I am dying to let you know you need to try to think'. So I sat and thought for the next three days and I missed my freind and felt that I couldn't live without him even if it was only four days. Then I thought about all our problems and how our freindship won't last if we don't change. Then I thought what if me or him cant change? What will we do then? Then my thoughts just got worse and worse. These worse thoughts stuck with me and whenever im not listening to music or sleeping this is what I think about. Thinking ruined my life.\t\t\t\t\n\t\t\t\t\n", "comment_57": "\nI personally think it's about this guy who is depressed and hates his life. He is lost in his dark thoughts and is sitting in silence, but usually he would listen to music but today he feels like it's not helping..\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nMy thoughts on this song, is that when you have nothing to distract you (anything from something physical, like music, friends, school, books etc, to the things that can only be felt, like memories and love) from your mind, which in this song is represented by \"A Car Radio\". He has nothing to distract him, and then he's left with his mind. When Tyler sings about peace and fear, or death and sleep, he is referencing that death is peace because you cannot think bad thoughts, while sleep is hiding from reality. Death isn't a nightmare, but when you sleep, there always a chance. When he says quiet is violent, he's talking about his dark thoughts and dark parts of his mind. Some examples would be, which I suffer from some, are: screaming, yelling, or arguing\ncrying\nhurting someone\nkilling\nhow would your death affect others\nstrange noises\ndisfigured images or scary things\nbad memories\nor just sadness\nwhen tyler sings about pulling the steering wheel, it could represent the thought of suicide because of the dark thoughts/reality. Then, when he talks about it being too deep, it means he needs to get rid of these thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nI think this song is about the slience and making you think and needing the car radio because your thoughts are violent\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nIt is actually about his car radio being stolen, there is an interview where Tyler says that someone stole his car radio and that he's emo so he wrote a song about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI ponder of something great\nMy lungs will fill and then deflate\nThey fill with fire, exhale desire\nI know it's dire my time today\n\n>>Life is great, it can be great.  Time is of the essence.  Time is valuable.\n\n\nI have these thoughts, so often I ought\nTo replace that slot with what I once bought\n'Cause somebody stole my car radio\nAnd now I just sit in silence\n\n>>Without distraction, we are forced to think for ourselves.  Critical thinking, of our own self, of life goals, or to overcome adversity. \n\nSometimes quiet is violent\nI find it hard to hide it\nMy pride is no longer inside\nIt's on my sleeve\nMy skin will scream reminding me of\nWho I killed inside my dream\nI hate this car that I'm driving\nThere's no hiding for me\nI'm forced to deal with what I feel\nThere is no distraction to mask what is real\nI could pull the steering wheel\n\n>>Keeping thoughts inside of our own self, can turn into a life where we are putting up a facade.  Leading a \"fake\" life while acting like we are okay, is a sign of depression.  In my personal opinion, the pride being on my sleeve verse, is talking about those who self medicate/ cut.  Those who self injure want to feel alive, because they are numb.  To feel pain, is to force people to deal with reality.  I could pull the steering wheel, talking about being suicidal. \n\nI ponder of something terrifying\n'Cause this time there's no sound to hide behind\nI find over the course of our human existence\nOne thing consists of consistence\nAnd it's that we're all battling fear\nOh dear, I don't know if we know why we're here\nOh my, too deep, please stop thinking\nI liked it better when my car had sound\n\n>> Pondering our mere existence when there is no distractions.  Don't be afraid of death, or the world.  \n\nThere are things we can do\nBut from the things that work there are only two\nAnd from the two that we choose to do\nPeace will win and fear will lose\nIt is faith and there's sleep\nWe need to pick one please because\nFaith is to be awake\nAnd to be awake is for us to think\nAnd for us to think is to be alive\nAnd I will try with every rhyme\nTo come across like I am dying\nTo let you know you need to try to think\n\n>>Choosing to have faith that there will be a better tomorrow, is great.  Faith means we are alive.  We are going to surive these hard times.  We can only overcome our issues, by facing them head on, instead of trying to mask the problem.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nI feel like this song is about a person having manic depression, and trying to cope with all emotions and thoughts coming all at once when it's silent and he's forced to deal with it. I don't think it's actually his car radio that's missing, it's probably just that he's by himself and can't pretend to be all happy in front of other people. Now he's alone, and everything he's been avoiding just comes up to the surface, he panics. I think his \"car radio\" is other people.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI read through the comments and its not about him getting his car radio stolen. it has a much more powerful meaning behind it. He sits in his car and he is left with his own thoughts (which by the lyrics aint the best of thoughts) his thoughts soon over ride his power of destroying them and they start to destroy him. he is in a quite place which always leaves you to start thinking. As is said I can pull the steering wheel\" and this indicates that he is having suicidal thoughts to end all his thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nThis is so obvious. He has lost someone dear to him, and now doesn't know what to do with himself. \"And now I just sit in silence\"\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nSomebody once stole my radio 'voice', and now, I just sit in silence.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nMy thought is the \"Car Radio\" is there heart. The person that stole your car radio is the person that stole your heart could be a Gf or Bf. This relates to me because I had a girlfriend and she threw me away after 4 hours because she just wanted to be \"Friends\" but never talked to me for the next 2 months. So screw her because I got a girl that loves me and I love her.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nNot exactly sure what the authors initial meaning is but the part of the song\r\n\"Sometimes quiet is violent\r\nI find it hard to hide it\r\nMy pride is no longer inside\r\nIt's on my sleeve\r\nMy skin will scream reminding me of\r\nWho I killed inside my dream\r\nI hate this car that I'm driving\r\nThere's no hiding for me\r\nI'm forced to deal with what I feel\r\nThere is no distraction to mask what is real\"\r\nSpeaks to me and how I feel..I'm so alone always surrounded by silence but within that silence I'm forced to listen to the voices in my head telling me is my time I have no purpose here I'm not good enough. I've lost myself the voices have taken over I have nothing to distract me of my emotions\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nthis song. I wanted to hate it. 21 pilots got so popular so fast. my heavy drinking when I'm not working, I really just never pay attention to pop culture it's too much to keep up but this one has played through YouTube a handful of times on playlists so I googled the lyrics to find it. \n\r\nthat was before I even caught the \"somebody stole my car radio now I just sit in silence\" line. after finally catching that line I couldn't ignore this damn song anymore. \n\n\n\n", "comment_69": "\nall is about thinking this guys is like everyone we are all hiding feelings behind things like songs or \"tricks\" but that day somebody stole that \"car radio\" So he's now starting to think by himself and he's terrify about it.\nThe last part resumed what \"Descartes\" is saying \"I think therefore I am\" \"Cogito ergo sum\"\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nThe first time I heard this song I had no idea what it was about and the more I thought about it I felt like it is a metaphor on life. The \"car radio\" is supposed to be considered happiness and everything good and now that his heart has been broken he has to learn how to carry on. But he is always reminded that he \"sits in silence\" which is him learning how to deal with this tragedy that so greatly affected him. \t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nThis song is about overthinking because of anxiety. As someone who overthinks, he describes the panic of it in perfect detail. Those racing thoughts are one I can relate to... and silence is awful. He's talking about how he wishes for a distraction so that he doesn't have to think.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI believe that this song is sung from the perspective of someone who doesn't appear to be in pain or turmoil on the outside but on the inside he is churning and suicidal. I don't believe that he even really did get his radio stolen necessarily he just can't ignore these thoughts and feelings anymore.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nMy interpretation of this song is while he is under a lot of stress people are like \"Oh no, you can't do that coz your not normal.\" He just sits in silence because he is nothing better to do and people are giving him grief about it. He replaces the slot of his stolen car radio with being depressed and there is nothing anybody can do about it because he is isolated from the outside.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nHe is getting way to deep in thought because he has nothing to distract him.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nthat feeling of utter panic. your thoughts spiral out of control. 'I could pull the steering wheel' he could jump out a window, anything to stop these thoughts or this feeling. 'now I just sit in silence' he screams because these thoughts are so bad he he could scream. he'd rather hear himself scream than have silence. \t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nTyler Joseph, like myself, is schizophrenic. A lot of his songs resonate in me for that reason. I feel like his struggle with sitting in silence is taken part by the fact that he's schizophrenic. I know how he feels in that silence is the bane of my existence because it allows certain things to be said, to be heard only by me. I hate silence. I don't want to go into detail on it though, for both personal reasons and for not wanting to sound stereotypically insane by a neurotypical's standards. But yes, for me, this song is his struggle with silence, a struggle I share with him. It may not be right (read: his explanation of his car radio actually being stolen and him being an \"emo needing inspiration\") but that's how I hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nCar Radio is all about life without music and honestly that would be a world without an escape, a world where life as we know it would be boring.  This song explains how music brings you to a safe place. Music is passion. Music is life. Every beat is different yet they share one thing... each has a soul ....!!!  this song is legend , the music and the lyrics are true and pure with emotion screaming out love for music.\r\nNJ x\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nWhen I listen to this song i believe the meaning that the artist ,Josh , was trying to get across is our minds can go to all the corners we normally don't explore and unfold fears we didn't know or feelings when all distractions are taking away. A point in the song where Josh uses style to convey this idea is in the second verse where he writes \"I am forced to deal with what I feel , there is no distractions to mask what is real\" This completely passes over the entire meaning i described. He used style in describing distractions as masks, as if to say we hide behind distractions to cover our own feelings or thoughts from not only others but ourselves. In the fourth verse it says \"i ponder of something terrifying...\" this symbolizes the darkness that can come out when you have all distractions taken from you. Another point he uses symbolism to the thoughts and dark corners and feelings that approach when you are forced to listen only to your brain is when he writes ,\"I find over the course of human existence, one thing consists of consistence, and it's that we are all battling fear\" This also is a reference to his own personal deep in depth thoughts. In that quote he also used alliteration to make the \"thing\" he was talking about stick to the audience.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nI'm a huge 21pilot fan ,and if your also a fan you should know Tyler does write depressing things. I'm pretty sure in this song he is singing about having nothing to distract him from what he has done. I think his \"car radio\" is what usally distracts him but he has to much on his mind to be distracted.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nHas anyone ever listened to (specifically the Regional At Best version of) this song and noticed how much it sounds like \"Silence (DJ TiÃ«sto's In Search Of Sunrise remix)\" by Delerium? Check it out (throughout the song, but particularly around the 8 minute mark of Slience) \n\nI never noticed it until a friend pointed it out. Another clever play. Well done TÃ\u0098P!\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nI have to agree. I listen to my radio while I'm driving and I can get out of my own head. That is what he's doing. It's plain as day\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nOk listen no one stole is car radio it has a deeper meaning so say if i was suicidal i hated myself i had all these problems and thoughts but i kept my self busy i always did something or talked to my friend's all that stuff represents the car radio but one day i cant do all that stuff that represents somebody stole my car radio meaning its not there anymore i cant use it not literally someone stole it when he says quite can be violent it means when theres nothin to do and hes just sittin there thinking about stuff he thinks about problems some good some bad very very bad he gets depressed from thinkin about this stuff when he says pull the steering weel meaning i could just kill myself to stop all this thinking to create a distraction when people kill themselves what do they want something to stop right thats what he wants but honestly this song has many meanings but at the beginning of the video of him cutting his hair thats a sign of depression you didn't see a guy in a car with a missin radio you saw a guy obviously depressed cuttin gis hair a sign of depression\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nHonestly a lot of people are saying that he got his car radio stolen but that is not the case . He has all these thoughts and he used music to block out the thought of to distract him like most of us do . And now he does not have that anymore so he just sits in silence , having to think because he has nothing to block out the thoughts\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nI, personally, can see this song from the perspective of a murderer as well as someone battling with thought. He's in the aftermath of killing his (first?) victim and he's finally thinking about it. I think this theory goes with the music video too: he's attempting to change his identity and face either to change the kind of person he is and to have a completely new start, or to change his identity so nobody finds out it was him and catches him.\nHowever, this is from more of a storytelling side and I do understand that this probably isn't the most believable theory about the song! I'm working to become an author and love to see songs from a darker and more storytelling point of view. c:\n\nHere's a complete analysis:\n\nI ponder of something great ( ::His thoughts before the murder. He's recounting on how he felt, and at the time he thought about it and thought that it was a great idea.:: )\nMy lungs will fill and then deflate\nThey fill with fire, exhale desire ( ::His anger/feelings about the person come in, and with that his desire to kill grows.:: )\nI know it's dire my time today ( ::He knows that he could get caught for this, and possibly imprisoned for a very long time making his situation dire.:: )\n\nI have these thoughts, so often I ought ( ::Now, after the murder, he's thinking about what he did very often.:: )\nTo replace that slot with what I once bought\n'Cause somebody stole my car radio\nAnd now I just sit in silence ( ::From this I guess that he doesn't have a car radio, apparently stolen, and now he sits in silence without the radio to distract him from everything.:: )\n\nSometimes quiet is violent ( ::In silence he contemplates what he did, which was an act of violence.:: )\nI find it hard to hide it ( ::Hiding that he literally committed murder is difficult for him.:: )\nMy pride is no longer inside\nIt's on my sleeve ( ::He's finding it harder to keep to himself.:: )\nMy skin will scream reminding me of\nWho I killed inside my dream ( ::In his dreams he's beginning to see who he killed, a constant reminder of what he did.:: )\nI hate this car that I'm driving\nThere's no hiding for me ( ::He can't hide anymore. I'm guessing that the police are on his trail and he's on the run.:: )\nI'm forced to deal with what I feel\nThere is no distraction to mask what is real ( ::He has nothing to distract himself with and continues to absorb himself in thoughts of what he did, and he know it was real and he can't change that.:: )\nI could pull the steering wheel ( ::He's considering killing himself to stop the thoughts, out of guilt. Or possibly in order to escape from those chasing him for what he did.:: )\n\nI ponder of something terrifying ( ::This opening line is similar to the first verse, except now he's thinking about his act and finds it terrifying. Either that or he's considering killing again, but this time does't see it as something 'great' anymore but rather horrifying to him.:: )\n'Cause this time there's no sound to hide behind ( ::Again, there's nothing he can do to distract himself and he has nothing to cloud his thoughts.:: )\nI find over the course of our human existence\nOne thing consists of consistence\nAnd it's that we're all battling fear ( ::He's afraid. For other reasons than normal people, but he realises that all people are scared of something. He's afraid of being found and of what he did.:: )\nOh dear, I don't know if we know why we're here ( ::He's beginning to sink into deep thought and can't stop.:: )\nOh my, too deep, please stop thinking\nI liked it better when my car had sound ( ::The lack of distraction is causing him to get deep into thought about everything, and it all branches from what he did.:: )\n\nThere are things we can do\nBut from the things that work there are only two\nAnd from the two that we choose to do\nPeace will win and fear will lose ( ::He concludes that if he'd been peaceful, he wouldn't be afraid like this and that people should be peaceful in order to overcome fear and avoid it, unlike him.:: )\nIt is faith and there's sleep\nWe need to pick one please because\nFaith is to be awake\nAnd to be awake is for us to think\nAnd for us to think is to be alive\nAnd I will try with every rhyme\nTo come across like I am dying\nTo let you know you need to try to think ( ::He's making a point about how he betrayed faith and didn't think about what he did, and he's saying that others should think before they commit something like murder because of the effect it has on you in the aftermath.:: )\n\nI ponder of something great ( ::He's now thinking back to what he did afterwards, recalling what he thought of it.:: )\nMy lungs will fill and then deflate\nThey fill with fire, exhale desire\nI know it's dire my time today\n\nI hope you like this interpretation of the song! I love to think of this song as someone who really regrets killing another and is consumed by the act, but I also enjoy the other ideas about someone struggling with thought in silence and also the idea that Tyjo literally had his car radio stolen, as unfortunate as that must have been lmao.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nstraight from the video... and knowing they want their songs to mean something for  each of us in our corner of the world... the car radio is the choice we have away from all the shit school and consumerism ads throws at us.  If you get your car radio stolenj (hair shaven), you become one of the mass, with no identity (white ski masks) and you just ride a car in traffic going nowhere for now reason... keep you identity, choose your tunes, fuck the system that tries to force things on you, and turn left if you want to, but don't kill yourself or somebody else in the process; life is the endgame.\n\nA thousand meanings for a thousand heads.  PInk Floyd.  TOP.  All good stuff for individual lives.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI am...I don't know, I think I'm depressed.\n\nAnyway, I see it as depression.\n\n\"I ponder of something great\nMy lungs will fill and then deflate\nThey fill with fire, exhale desire\nI know it's dire my time today\"\n\nI think too much, yet I'm breathing, I'm breathing I'm breathing, I'm breathing. I only have a short amount of time.\n\n\"I have these thoughts, so often I ought\nTo replace that slot with what I once bought\n'Cause somebody stole my car radio\nAnd now I just sit in silence\"\n\nI have so many thoughts, I need something to drown them out, I need music, but I don't have music, so instead, I sit in silence.\n\n\"Sometimes quiet is violent\nI find it hard to hide it\"\n\nThe quiet brings out the thoughts, the thoughts that scream, I project happy, but it's hard to hide\n\n\"My pride is no longer inside\nIt's on my sleeve\nMy skin will scream reminding me of\nWho I killed inside my dream\"\n\nOh look, on my arm, my skin is screaming it's bleeding. I fantasize about my own death, about killing myself.\n\n\"I hate this car that I'm driving\nThere's no hiding for me\nI'm forced to deal with what I feel\nThere is no distraction to mask what is real\nI could pull the steering wheel\"\n\nI hate my body. I want to hide, but I must deal with it. I can't hide forever, but I could kill myself, I could crash. \n\n\n\"And it's that we're all battling fear\nOh dear, I don't know if we know why we're here\nOh my, too deep, please stop thinking\nI liked it better when my car had sound\"\n\nwe are all battling our fears. Please stop the thoughts, I just want to drown them out\n\n\"There are things we can do\nBut from the things that work there are only two\nAnd from the two that we choose to do\nPeace will win and fear will lose\nIt is faith and there's sleep\nWe need to pick one please because\nFaith is to be awake\nAnd to be awake is for us to think\nAnd for us to think is to be alive\nAnd I will try with every rhyme\nTo come across like I am dying\nTo let you know you need to try to think\"\n\nChoose, do you want to think, or do you want the eternal slumber. He's telling you to choose to think, don't die yet.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nI think it's about a man who lost the joy of life (the car radio) and is just driving a bland life (the car). He tried to use distractions to have the joy back, but in the end he is less happy than before. He ponders why he even cares anymore and about who stole his joy (work, etc...). He continues increasingly thinking more about this (the loud instrumental bit), begins to cool down, and goes back to where he originally started, after presumably arriving at his destination. Death is the destination. He is pondering who stole his joy whilst he dies.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI think this is song is about how Tyler lost something that distracted him in a sense from himself. As he said before in another song â\u0080\u009cNothing kills a man faster than his own headâ\u0080\u009d that sort of hints that he needs something to keep his mind of off his dismal thoughts in order to stay alive. He lost his car radio because he says someone stole it, heâ\u0080\u0099s forced to deal with what he feels. He has no distraction to save himself. The lyric that hits me the hardest is â\u0080\u009cI could pull the steering wheelâ\u0080\u009d which implies that heâ\u0080\u0099s willing to end himself along with his mind. Mental issues are just as serious as physical issues. Please just remember that if you have lost your car radio, you can always get it back some way. Stay Alive Frens ||-//\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nI think the car radio represents his happiness. That empty \"slot\" was left when the radio was stolen by mental health problems, and it needs replaced with what he once bought, the happiness that he once lived in. \"Quiet is violent\" because it's when your thoughts become the loudest, especially when they are \"too deep\" and \"terrifying\". These thoughts are that he \"could pull the steering wheel\"; he could drive off the road and kill himself and all it would take is to pull the wheel. He believes that life is meaningless and we all have no purpose - \"one thing consist of consistence and it's that we're all battling fear, oh dear, I don't know if we know why we're here\". Then he realises that \"there are things we can do\" and that we have to choose between faith (God) and sleep (death). \"Faith is to be awake\" meaning that, to live, we must turn to God. We need to \"try to think\" about what we want to choose: faith or sleep, peace or fear. He hopes that we choose the same path as him, believing in God, because that is what saved him from pulling the steering wheel.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI feel like this general idea is expressed throughout each comment but I feel like this song i about literally him not having his car radio but in addition to that his radio is what he uses to cope with his depression and without it the silence is killing him, because he uses his music to escape his life:\"Sometimes quiet is violent\" \"I ponder of something terrifying\n'Cause this time there's no sound to hide behind\"\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nIts got good beats and all but why do you have to be all emo about a stolen car radio, I mean it's 2013 for God's sake ever heard of a music player? I though those were phased out from the face of the planet. And why does everyone over analyze lyrics here? It's about a stolen car radio, jeeeez stop being pretentious, ostentatious, hipsterish, emo-ish, liberal arty-ish, etc....  :D\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nThis song is about him killing someone in a car accident, and the emotional thoughts that he cannot bear to live with were so strong caused him to commit suicide....listen to the lyrics closer\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nI feel like this song is about anxiety/ depression/ negative thoughts/ any mental illness because music could help distract you from those thoughts and concentrate on the music instead of what's going through your head but since the car radio has been stolen you can't ignore your thoughts and are stuck with them \"I could pull the steering wheel\" that means Like you would want to end it all and get rid of those thoughts your stuck with. \n\nBasically I think it's about how music has helped with mental Heath and it's difficult when you don't have music\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nit's a metaphor. tyler's referring to sometimes when your alone or in silence, your dark thoughts can seem to consume your life. he's saying he used to use music as a way to distract himself from having these dark thoughts, but now that he doesn't have a car radio, he drives in silence. what else is he supposed to do in silence rather than think? and when you're full of dark thoughts it just floods your brain and becomes overwhelming. \"i could pull the sterling wheel\" kinda like, maybe i'd be better off dead than having these controlling thoughts while sitting in silence. \t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nI asked my friend to listen to this (he's awsomely smart) and he interpeted it this way:\nJust as said before this might not be actually about the car radio stolen though I think that because it's ambiguous yet talks about kinda the same feelings that hit you at that moment is cool, and I guess that's how metaphores should be.\nThe thing I love about my friend is that he can explain symptoms of the metphore and not just generally speak about it. He actually points it:\nThe car is a metaphore for life, and the lack of radio is the problem.\nThe radio itself can be a even a girl (replace that slot with what I once bought)\n- meaning find a new girlfriend or trying to avoid the problem or whatever you interpert it as.\nPulling the steering wheel - taking control on his life, I also liked the interpetion of someone here - commiting suicide.\nI just love how he can build and make you know the emotions even without knowing the metaphore and then agreeing about both, and also he uses lots of motives and artistic stuff just very very skilled and beautiful writing, and of course great song!\nOne thing about 21 pilots I think they should improve: the electro riffs should be shorter cause they can sometime give a headache. :)\t\t\t\t\n\t\t\t\t\n\n"}