{"comment_0": "\nDarlin', darlin'\r\nDoesn't have a problem\r\nLyin' to herself\r\nCos her liquor's top shelf\r\nIt's alarming, honestly,\r\nHow charming she can be\r\nFooling everyone\r\nTelling them she's having fun\n\r\nShe says, \"You don't want to be\r\nlike me, don't want to see all\r\nthe things I've seen\"\r\nI'm dyin', I'm dyin'\r\nShe says, \"You don't want to\r\nget this way, famous and dumb\r\nat an early age\"\r\nLyin', I'm lyin'\n\r\nThe boys, the girls,\r\nThey all like Carmen\r\nShe gives them butterflies\r\nBats her cartoon eyes\n\r\nShe laughs like God\r\nHer mind's like a diamond\r\nAudiotune lies\r\nShe's still shinin'\r\nLike lighting\r\nWhite lightning\n\r\nCarmen, Carmen\r\nStaying up till morning\r\nOnly 17 but she walks the\r\nstreets so mean\r\nIt's alarming truly\r\nHow disarming you can be\r\nEatin' soft ice cream\r\nConey Island queen\n\r\nShe says, \"You don't want to\r\nbe like me, lookin' for fun,\r\ngettin' high for free\"\r\nI'm dyin', I'm dyin'\r\nShe says, \"You don't want to\r\nget this way, street walk at\r\nnight and a star by day\"\r\nIt's tirin', tirin'\n\r\nThe boys, the girls,\r\nThey all like Carmen\r\nShe gives them butterflies\r\nBats her cartoon eyes\n\r\nShe laughs like God\r\nHer mind's like a diamond\r\nAudiotune lies\r\nShe's still shinin'\r\nLike lighting\r\nWhite lightning\n\r\nBaby's all dressed up with\r\nnowhere to go\r\nThat's the little story of the\r\ngirl you know\r\nRelying on the kindness of \r\nstrangers\r\nTying cherry knots\r\nSmiling, doing party favours\r\nPut your red dress on, put your\r\nlipstick on\r\nSing your song, song, now the\r\ncamera's on\r\nAnd you're alive again\n\r\nThe boys, the girls,\r\nThey all like Carmen\r\nShe gives them butterflies\r\nBats her cartoon eyes\n\r\nShe laughs like God\r\nHer mind's like a diamond\r\nAudiotune lies\r\nShe's still shinin'\r\nLike lighting\r\nWhite lightning\n\r\nDarlin', Darlin'\r\nDoesn't have a problem\r\nLyin' to herself\r\nCos her liquor's top shelf\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song is about Lana Del Rey before she became famous (Around her young adult years).\nCarmen=Lana.\n\n \"Darling, darling, doesn't have a problem. Lying to herself cause her liquors top shelf.\" She thinks that she's completely fine and that she has no addiction but in reality she's addicted to alcohol and needs help(Which Lana actually talked about before).\n\n\"It's alarming honestly how charming she can be, fooling everyone telling them she's having fun.\" Everyone thinks how she's that girl who's never upset and how shes always having a good time when Lana actually feels depressed and sad about how bad her life has gotten.\n\n\"She says you don't wanna get this way, famous but dumb at an early age.\"\nLana got addicted to alcohol at the age of 14(dumb at an early age), got sent to boarding school to fix her addiction, then she ran away and technically lived on the streets. Everyone knew who she was because she would do whatever she could for money even prostitute herself sometimes (which ill explain later).\n\n\"Buy her tonight, she's still shining like lighting.\"\nI think this is the part when she prostituted herself. She's saying how people should buy her for the night while she's there (can't really explain it, but it's pretty obvious).\n\n\"She says you don't wanna get this way, street walk at night but a star by day.\"\nThis is another part when she talks about how she sold her self as a prostitute at a young age.\n\n\"Babys all dressed up with nowhere to go, that's the little story of the girl you know.\" In this quote I feel like she's always looking for a party to go to and spend her time somewhere or the fact that she's walking on the streets all dressed up waiting for someone to buy her for the night.\n\n\"Relying on the kindness of strangers.\"\nShe hopes that someone would be nice to her and help her get her life back on track or give her some money so she can support herself. It's like a perspective from a homeless person kind of thing. \n\n\n\"Tying cherry knots smiling doing party favors. Put your red dress on, put your lip stick on.\" \nBeing able to tie a cherry stem into a knot is a sign of being a good kisser. Lana is saying how she's doing party favors probably such as hooking up with people and doing sexual acts or drugs for the money. Then she says how she's putting on her red dress and her lipstick, here she is saying how she's ready to go out and sell herself again or do whatever she can to get money.\n\n\"Mon amour, je sais que tu m'aimes aussi\nTu as besion de moi\nTu as besion de moi dans ta vie \nTu ne peux plus vivre sans moi\nEt je mourrais sans toi\nJe tuerais pour toi.\"\nTranslation: â\u0080\u009cMy love, I know that you love me too.\nYou need me, you need me inï»¿ your life.\nYou canâ\u0080\u0099t live without me\nAnd Iâ\u0080\u0099d die without you.\nIâ\u0080\u0099d kill for you.â\u0080\u009d\nHere she is talking about her addiction to alcohol and how much she craves it in her life and how she can't live without it.\n\nSo long story short. This song is about Lana when she lived on the streets.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\n\"The song about Carmen is not about a woman who is a prostitute. \n\n\"Carmen\" is about a woman with an alcohol problem who is constantly attempting to convince herself the she truly has no problem at all and is truly just fine. \"Doesn't have a problem. Lying to herself, cuz her liquor's top shelf\". This line states that Carmen, who, truly, is Lana Del Rey in her teenage years, is crazy and an alcoholic but is convinced that she has no problem. She is lying to herself cuz her liquor is too high to reach or is high class and safe to drink.\n\n\"She's still shining like lightning...\"\nThis line, however, does refer to a sort of prostitutional issue that she once had. Although she has screwed up millions of times, she still has potential to be a good person and is shining... \n\nIt's all about Lana Del Rey as a teenager. Lana, in an interview, said that all the songs on the album reflect off of her troubled past, where she was making crazy decisions and living the life of a runaway drug addict. But it took her awhile to admit to herself that she needed help. But once she admitted to herself she had a problem, she got help and now is LIKE LIGHTNING!\"\n\nfound on lyricinterpretations, not mine\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nFrench part:\n\"Mon amour, je sais que tu m'aimes aussi\nTu as besoin de moi\nTu m'as besoin dans ta vie\nTu ne peux vivre sans moi\nEt je mourrais sans toi\nJe tuerais pour toi\"\n\nTranslation:\n\"My love, I know that you love me also\nYou need me\nYou need me in your life\nYou can't live without me\nAnd I would die without you\nI would kill for you\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nCarmen is a girl who is alcoholic (Lana obviously) but the symbol of Carmen through the song becomes a symbol of crystal meth or methamphetamine. You can see in the chorus, it's really simple. \n1. \"The boys, the girls, they all like Carmen'' - all her friends like and do meth\n2. \"She gives them butterflies\" - meth helps the release of serotonin (a hormone contributor to well being and happiness)\n3. \"Her mind's like a diamond\" - diamond = crystal\n4. \"Like lighting, white lighting\" - obvious\n\nIf you watch the Carmen video closely, you can see that the some parts of the video show for a second how methamphetamine affects the central nervous system and the release of serotonin.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThe French is translated to, \"My love, I know that you love me also.\" :)\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nOkay I thought this song was about a very popular you lady, who everyone wanted to be like, but her life wasn't as great as what everyone thought it was.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nIn my mind, this is without a doubt inspired by Blanche DuBois from \"A Streetcar Named Desire.\" If you love this song and have never read the play, its not very long or time consuming and you will see a lot of connections. \n\r\n\"Darling, darling, doesn't have a problem \r\nLying to herself cause her liquor's top shelf \r\nIt's alarming honestly how charming she can be \r\nFooling everyone, telling how she's having fun\"\n\r\nIn the play, Blanche suffers from some form of mental illness and drinks heavily, presumably to avoid the demons of her past. She charms and fools many people into thinking that she is something other than what she truly is. \n\r\n\"She says you don't want to be like me \r\nDon't wanna see all the things I've seen \r\nI'm dying, I'm dying \r\nShe says you don't want to get this way \r\nFamous, and dumb, and no age \r\nMy, I'm dying\"\n\r\nBlanche reveals the demons of her past at various point throughout the play. Her family dying off in front of her eyes, the loss the family plantation, the suicide of her husband which she is convinced is her fault. She is portrayed as the most notorious person from her home in Laurel because of her sleeping around after the death of her husband, hence the \"famous, and dumb....\" line.  \n\r\n\"Baby's all dressed up, with nowhere to go \r\nThat's the little story of the girl you know \r\nRelying on the kindness of strangers \r\nTime and cherry marks while doing party favours \r\nPut your red dress on, put your lipstick on \r\nSing your song, song, now, the camera's on \r\nAnd you're alive again \"\n\r\nBlanche's clothing and jewelry are often spoken of throughout, as well as her enjoyment of wearing them. She truly does get dressed up with no where to go as she does not work, is seldom mentioned leaving Stella's, and can't leave New Orleans because she was run out of her home town and can't afford to support herself. \"I have always relied on the kindness of strangers\" is her last line in the play... This was what really sold me on the Blanche influence and made me examine the lyrics more closely. \n\r\nThere are other small similarities that may be a stretch... the lines in French might be from Blanche speaking in French and talking of her French heritage. The mention of \"light\" and \"lightning\"... Light, or lack there of, was important symbolism in the play for Blanche, and is mentioned in her most important and telling monologue (the one about her husband.)\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nAs you all know, Lana is a big Marilyn Monroe fan. I think that in this song she's talking about  her.\r\n  \"Darlin', darlin' Doesn't have a problem Lyin' to herself Cos her liquor's top shelf\". ---Marilyn was not like \"the best person in world\", she had a lot of problems, and drinking can be one of them.\r\n   \"It's alarming, honestly, How charming she can be, Fooling everyone, Telling them she's having fun\" --- Marilyn was, like, such a beautiful woman, also a great actress. But, she was in depression, even if she was the definition of perfection, in her time.\r\n   \"She says, \"You don't want to be like me, don't want to see all the things I've seen\", I'm dyin', I' dyin'\" --- We all know that Marylin \"knew too much\", cause she was secretly the girlfriend of president.\r\n   \"She says, \"You don't want to get this way, famous and dumb at an early age\", Lyin', I'm lyin'\" --- She became famous and made a lot of mistakes.\r\n   \"The boys, the girls, They all like Carmen, She gives them butterflies, Bats her cartoon eyes\" --- everybody loved Marilyn,  she was a great actress, a beautiful woman and a sexy model.\r\n   \"She laughs like God, Her mind's like a diamond, Audiotune lies, She's still shinin', Like lighting, White lightning\" --- at the end of her life, so much people was saying that she became a mess, but that was not true.\r\n   \"Baby's all dressed up with nowhere to go, That's the little story of the girl you know, Relying on the kindness of strangers, Tying cherry knots, Smiling, doing party favours, Put your red dress on, put your lipstick on, Sing your song, song, now the camera's on, And you're alive again\" --- I think that this part is the most representative, cause it's about her actress career and being a little sluty. She was acting and singing, and this is way everybody loved her. In the \"And you're alive again\" part, Lana is a little sarcastic, remaining that Marilyn is dead.\r\n   THIS IS JUST MY OPINION, PLEASE DON'T JUDGE :)\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nDoes anybody else think these lyrics are associated this with the song Dolores Haze is listening to when Humbert Humber is observing his nymphet in the beginning of Lolita?\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI'm thinking this is Lana's way of taking Carmen (the opera) and turning it into a 21st century adaptation.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI thought it would be inspired by \"My Carmen\" in Lolita as well, in fact many of Lana's song are allusions to Nabokov's novel. But I can't help but get \"A Streetcar Named Desire\" allusion in this song. \n\r\n\"Lying to herself cos her liqueurs top shelf\"\n\r\nThis reminds me of when Blanche and Stanley are discussing drinking and she says she doesn't drink (even though she already admitted to drinking to release her problems) and Stanley says that some people don't touch the stuff but it touches them. So this line is an exact description of that scene\n\r\n\"Relying on the kindness of strangers\"\n\r\nBlanche's last lines and a large theme in the play\n\r\nTalking about fooling abd being charming with dressing up is an exact depiction of Blanche. I find that Lana alludes to many literature works in her songs!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI think that this song does have allusions to Nabokov's Lolita, but when I listen to it, I see a woman who is literally a star by day and a prostitute by night. Possibly a woman who is famous and adored, but turns to prostitution at night whether it be for the money or the thrill. Possibly this is what Lizzy's life was like when she was younger--basking in the starlight by being her father's daughter, and selling her body at night to keep up with her lifestyle.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThe music video to this song is full of drug images; such as Meth\n\nMaybe it's about her teenage years, getting into drugs and alcohol whilst trying to make it in the music industry?\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI think that is about a prostitute too...when says -Buy her tonight\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nPretty sure the song is about herself. I'm not sure why it's called Carmen, is there a reason for that? Love this song because it reminds me someone. Well Lana herself reminds me a lot of this person...they're very similar \t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI love how when you hear her in interviews she's this smiley, bubbly girl with a cute little voice and a sweet personality. But her songs are so dark and mysterious, it's so interesting to me, trying to figure her out.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nIts \"Early age\" not, \"No age\" No age? that does not make any sense\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI seriously had to make an account just to inform you how incorrect all of you are. Have you guys not watched the film clip for Carmen? It blatantly stops and has a voice sounding like it has been taken from a documentary that says \"what does meth do to our brains?\" It then shows an animated diagram of what happens inside your brain when you consume meth amphetamine and has the word 'meth' written in the corner, through out the song this image of the drug rushing through the brain shows multiple times.\r\n I believe the line ' darling darling doesn't have a problem, lying to herself cos her liquors top shelf' refers to the fact that she stopped her drinking habit when she took up a meth addiction, and uses the fact that she isn't drinking anymore to justify her new addiction. \r\n'Relying on the kindness of strangers' and 'doing party favours' basically means she couldn't afford her meth addictions so she either preyed someone would give it to her cos she 'bats her cartoon eyes' and charms people into giving her drugs or exchanges sexual favours for them. \r\nIn the film clip there is also a snippet of two people talking where one says to the other 'doesn't your heart break when you hear him say that? Take me in?' Which is about giving head for crack. \r\nIt's so frustrating seeing people say this song is about alcohol. It's about meth. \t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThe song is about one of Lana Del Rey's best friends that she had during her alcoholic stage. The female talking in the video saying: \"Talk to me about why i'm your dream girl.... that's so mean!\" Is in fact Carmen herself (a recording.) She is now dead. She also appears in \"This Is What Makes Us Girls\" as the girl with the \"Bambi eyes\" saying \"lana how i hate those guys.\" She was 17 whilst lana was 15 and a mother of sorts. She showed her the streets and what not.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nTo me, this sounds like the story of the character, Carmen,  in the play,\"Fame.\" Has big dreams, and everyone loves her.  She has talent and she shines.  She's only seventeen, but she leaves to make it big and ends up as an addict on the streets and is dying.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nEver heard the expression, never judge a book by its cover? Well in the case of Carmen this is very true.\n\nIf you look at the verses you see an perfect portrait being painted of a very popular girl that everyone likes who parties hard and has fun.\nbut then in the first bridge Carmen herself begins to speak: \n \"you don't want to be\nlike me, don't want to see all\nthe things I've seen\"\nI'm dyin', I'm dyin'\nYou don't want to\nget this way, famous and dumb\nat an early age\"\nLyin', I'm lyin'\"\n\nNow to me this can be summed up as being the price of popularity, doing things that you wouldn't have normality done, but to get everyone to like you, you do it anyway.\n\nThen in the second verse the things she does start to escalate, suddenly she starts \"street walking\" which to me sounds like she is selling herself, maybe not for money but for ever increasing popularity among the boys and girls.\n\nWhen Carmen starts to speak again in the second bridge we see how the downward spiral just continues, where as in the beginning of the song \"her liquor's top shelf\" now she's \"getting high for free\". This show how she does ever increasingly risky things to retain the popularity she has gained.\n\nIn the next part of the song she is so deep in this downward spiral of pleasing people that she doesn't really know what else to do so she ties cherry knots and does party favours to get by, as to what exactly these \"party favours\"are your guess is as good ass mine.\n\nIn conclusion what this song means to me is don't judge the happiness of anyone by their popularity, as looks can be very deceiving.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nDarling, darling, doesn't have a problem \nLying to herself 'cause her liquor's top shelf - Carmen, or maybe even Lana, had drinking problems (and later drug problems) and would often drink liquor that was hard to get, or expensive. She thought she had no problems, and she thought it was fine to drink liquor, yet liquor was actually one of her problems.\n\nIt's alarming honestly how charming she can be \nFooling everyone, telling how she's having fun -\nCarmen often acts charming by telling everyone how shes having fun, but shes really fooling everybody, feeling depressed deep down inside. Its alarming by how O.K she can act.\n\nShe says you don't want to be like me \nDon't wanna see all the things I've seen \nI'm dying, I'm dying \nShe says you don't want to get this way \nFamous, and dumb, and no age \nMy, I'm dying -\nThis is where Carmen is talking about herself. Shes seen many, many horrible things and places, and claims shes \"dying\" because of what shes does. Shes famous and loved by many. She doesnt think that she has problems, or anything shes doing is wrong, and is just ignorant. She often gets plastic surgery to look like she never ages and to stay young and beautiful.\n\nThe boys, the girls, they all like Carmen \nShe gives them butterflies, bats her cartoon eyes\nShe laughs like God, her mind's like a diamond \nBuy her tonight, she's still shining \nLike lightning, light, like lightning -\nEverybody loves Carmen for who she thinks she is. They make them feel all nervous and shy, like the saying \"butterflies in my stomach\". She \"bats her cartoon eyes\" to attract everybody. Her cartoon eyes come from the part where she gets plastic surgery. Her minds like a diamond, which means shes rather creative and imaginative, but never really listens to what her mind says. Buy her tonight means that after starting to drink, she falls into prostitution. She walks the streets and waits for somebody to \"buy her\", as in to have sexual intercourse with the person who \"bought her\" for drugs, money, and liquor. Shes still shining and is seen as perfect, because nobody knows what happens at night. \n\nCarmen, Carmen, staying up 'til morning \nOnly seventeen, but she walks the streets so mean \nIt's alarming truly how disarming you can be \nEating soft ice cream, Coney Island queen \nShe says you don't want to be like me \nLooking for fun, get me high for free \nI'm dying, I'm dying \nShe says you don't want to get this way \nStreet walking at night, and a star by day \nIt's tiring, tiring -\nCarmen stays up late, normally walking the streets. Shes at a young age, which is seventeen, but she still all does these horrible things.She looks for fun, like drug dealers or bars. Getting high for free means that she later starts to meet up with drug dealers and gets drugs for free, falling into a horrible drug habit.\n\nThe boys, the girls, they all like Carmen \nShe gives them butterflies, bats her cartoon eyes\nShe laughs like God, her mind's like a diamond \nBuy her tonight, she's still shining \nLike lightning, light, like lightning -\nSame meaning as the other one.\n\nBaby's all dressed up, with nowhere to go \nThat's the little story of the girl you know \nRelying on the kindness of strangers \nTime and cherry marks while doing party favors \nPut your red dress on, put your lipstick on \nSing your song, song, now, the camera's on \nAnd you're alive again -\nShes dressed up all pretty in a red dress with lipstick, waiting for somebody to find her and help her. Shes relying on strangers to help her go somewhere good with her life, but nobody will really help her, even if shes well known.Instead of \"time and cherry knots\" I think its \"tying cherry knots.\" So, that basically means shes great at kissing, and often kisses people, or even more, for money, drugs, and liquor. She goes to parties often, and does favors for the parties, normally \"sinister\" favors.Finally, she finds a stranger who helps her. Shes in the music business, and that got her life back on track. The camera turns on and she sings a song, and feels so much better. By \"you're alive again\" it means that shes who she really should have been. She got rid of her drug and liquor problems, shes not a prostitute. Shes alive and well, and is so much more better.\n\nMon amour, je sais que tu m'aimes aussi - This translates to \"My love, I know that you love me also\" in french. Shes saying that the person she loves loves her back, but shes convinced so, and not really sure.\n\nThe boys, the girls, they all like Carmen \nShe gives them butterflies, bats her cartoon eyes \nShe laughs like god, her mind's like a diamond \nBuy her tonight, she's still shining \nLike lightning, light, like lightning \n\nLike lightning, light, like lightning\n\nDarling, darling, doesn't have a problem \nLying to herself 'cause her liquor's top shelf - She had failed in the music buisiness, and now shes falling back into her old drug habits and liquor habits.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nOkay, Okay. Most of you are saying that Carmen was a prostitute.\nBut,..\nHow I see this song, is that Carmen is this beautiful, rich, popular girl that everyone looks ups to. They put a ton of pressure on her, telling her to...\n\"Baby's all dressed up, with nowhere to go\" - she cant really rely on anyone, she'll get all dressed up for a boy to come and stand her up.\n\"Relying on the kindness of strangers\" Every one's opion on her decides her entire life. if they decide she's out, she's out. She must rely on their kindness and affection to move on.   \n\"Tying cherry knots\" Kissing boys, falling in love,\n\"Smiling. doing party favours\" She's forced to smile, and please everyone.\nThis represents the fact that everyone puts pressure on her to be this perfect, beautiful popular girl. Imagine a girl with people piling weight on her shoulders, slowly frowning... then in tears.. and then-\n\"Put your red dress on! Put your lipstick on! Sing your song song song..\" This means they're all trying to make her look perfect, like nothings wrong, like no one can tell she's upset.\n\"NOW THE CAMERAS ON.\" Now everyone can see her, now it's back to pleasing people with her fake smile and her tears.\n\"And you're alive again...\" Now she's back to being perfect, like a beautiful girl. Like nothings wrong, now imagine that weight just pour into a smile, her in the red dress while everyone adores her.\n..\nI think this song might be a hidden cry for help from lana. or something telling us that she is upset, or stressed, or maybe this is her teenage years - or worse - her life now!\n\nbig lana fan! -mel\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song is about two versions of a girl. 17 years old and 25 years old. They are both analysing and advising each other. They don't know whether they'd prefer a fast living, faux-glamorous life style. Or to settle down, sober up and live a steady life. They dont dislike each other in fact they secretly at times wish they had the others position and they know that the other feels this way. In reality she decides to clean up, write music and become lana del rey. But she could just as easily have became carmen. And be living (or dying) as a beautifully functioning alcoholic hiding White Lightning on the top shelf from those that enjoy her services. \n\r\nIt is truly alarming how disarming a girl can be eating soft ice cream.\t\t\t\t\n\t\t\t\t\n\n"}