{"comment_0": "\nHalsey isn't alone-- many women (famous or not) can relate to this song. She's headed straight for the castle (the top, the finish line, her goal, success, etc.) and there's an old guy trying to put her down. It's the stigma of a woman being successful and taking the place of/surpassing/dethroning a man. Women are often told to smile, look pretty, keep their mouth shut, etc. It's often not even noticed, as we're so used to it, but when we call them out on it, we're being bitchy. We're being mean. Well, she's had enough. She's headed straight for the castle.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think its about halsey and celebrities in general and how they have to live up to hollywood standards always looking good, and how she wants to live her own life and rule her \"castle\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWow. Arrogant \"Daughter\" of a bitch. Still, good song\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI don't know.  I think maybe she's tired of the paparazi and the cut-throat business she's in (the music industry). She's working her way to the \"top\" of being famous, etc.  but to do so she's had to become a real B***,  to be real mean and cut-throat hersefl, in order to battle the producers and managers and record labels and paparazzi and everyone else around her.  \n\nEver watch \"Once Upon a Time\"? Remember the evil queen's father?  I think the old man telling her not to be so mean is probably either her father or a father-like figure, trying to remind her to not be so mean, to try and be a little more normal or human, to be the good girl they know her to be.  She fought her way to the top and in the process changed and he's trying to tell her to not be so mean.  I think there are a lot of \"Diva's\" out there, who've become real B***'s, maybe because that's who they naturally are or because they've got so much money and power its corrupted them, etc. but either way...\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI found the key to the kingdom, I know that Old Man sitting on the throne, and He's been waiting for me to be king.\t\t\t\t\n\t\t\t\t\n\n"}