{"comment_0": "\nSince the album is a concept album this would be one of the characters talking about their failed dreams. Since 'Paradise' is about the female character's loss of innocence and disillusionment with the world I would venture a guess that the male character's feeling of failure. Its towards the beginning of the album so setting up would seem right since its a story.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nWell, since their album follows a love story, here is what I think. Hurts like Heaven was the beggining, and then it flashes back to Paradise and Charlie Brown. Paradise was about the girl leaving her home to discover herself, but all her dreams were never happening because the world is a cruel place. \n\r\nCharlie Brown is about the guy trying to make it through life before meeting her. IT starts in the beginning with him stealing a car and going downtown to do drugs with the \"lost boys\". The lights going down at the end of the scene are cop cars coming. They show up and he gets busted. It is like his \"scarecrow dreams\", bad dreams of people destroying everything he ever wanted (drugs are the scarecrows that destroyed his life). The rose part is probably either the girl encouraging him to got back up again, or some other form of moral support. Then the moral support goes on to say (no that i listen to it, it probably is the girl) to him that he should be a cartoon heart. Be like Charlie Brown, who is always getting picked on and nothing really works out for him. Always get back up again. Finally, the glow in the dark is for both of them to always be a positive light to all the boys and girls with all their problems. They went through all their troubles and they want to glow, be a light and show them how to get through it.\n\r\nThis is one of my favorite songs on their album.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nSince this is a concept album about love in a dystopia, I think (given the flow of the album), this is where the guy and girl first meet. See my full (over-)analysis of the meaning & storyline here: smrvl.com/blog/\n\n\n", "comment_3": "\nWhat an amazing riff this song has!\n\r\nI think it's a continuation of Paradise- the girl from the previous song escapes her life, \"flies away\" as she desired to, and meets up with a group of guys and hangs out with them. That's just going by the story of the album, though- taken out of context it could be about anyone who's traveling... I get the feeling it's sung from a male perspective, though I wouldn't know.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song is amazing. Even if it's about a stolen scooter for me it's much more. It's about happiness, freedom, a good feeling... that smile that nobody can wipe away from your face; positive vibes. \"We'll be glowing in the dark\": Us being the light (good things) glowing (fighting) in the dark (bad things, evil). For me, it's the perfect song when I'm feeling down. I listen to it to forget about problems, to smile. It's one of my Coldplay's Top 5!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nWould love to know what this song means. I'm guessing (and probably wrong) that someone's dreams are not coming to fruition so he's going to live life in the fast lane without a care in the world. \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nTo me this song is about a dream that can't seem to come true; the music itself is a sense of desire. Think about the song title: Charlie Brown. If you've ever watched the old Charlie Brown shows then you know how Charlie Brown always had to settle for the short end of the stick, whether it was getting a rock for Halloween instead of candy or being tricked into kicking a football only to have it jerked away from him at the last second. To me this song symbolizes just those attributes. But this song is also very hopeful as Chris Martin encourages to \"Be the cartoon heart\". When I hear that line I think of the episode of Charlie Brown when all they had was a tiny Christmas tree and everyone was still happy - Cartoon heart. \"We'll be glowing in the dark\", this again provides the same message of having a hopeful heart. I love this song, when something goes wrong or I feel as though I'm on the short end of the stick in any situation, this is the perfect song. Music, lyrics, everything. \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nawesome song! i love it :)\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n\"stole a key took a car downtown where the lost boys meet...\"\r\nWent downtown to see a concert (\"lost boys\" could  mean Coldplay themselves because of \r\ntheir song \"Lost\")\n\r\n\"took a car downtown to see what they offered me to set me free\"\r\nthe person going to see the concert was so bummed about things and was hoping that\r\nthe  music would set him free.\n\r\n\"I saw the lights go down at the end of the scene saw the lights go down and standing in front of me\"\r\nHe had a front row seat for the concert and the musicicans were standing in front of him\n\r\n\"In my scarecrow dreams when they smashed my heart into smithereens\"\r\nhe's thinking about what bummed him out and how he had nighmares and people hurt him.\n\r\n\"Light a fire light a spark\"\r\npeople at the concert with their lighters lit\n\r\n\"we'll be glowing in the dark\"\r\n at concerts there are things fans wear that glow in the dark\n\r\n\"All the girls all the boys all the madness in the world\"\r\nall the people enjoying the concert\n\r\n\"as the room is spinning\"\r\nthe wildness of the concert the room is spinning.\n\r\n\"We'll run wild, we'll be glowing in the dark\"\r\nwell be wild at the concert and we'll all be glowing in the dark\n\n\r\n\" \n\n\n\n", "comment_9": "\nWooh, ooh ooh ooh\n\r\nStole a key\r\nTook a car downtown where the lost boys meet\r\nTook a car downtown and took what they offered me\r\nTo set me free\r\nI saw the lights go down at the end of the scene\r\nSaw the lights go down and standing in front of me\n\r\nPoh ooh ooh\n\r\nIn my scarecrow dreams\r\nWhen they smash my heart into smithereens                                              \r\nBe a bright red rose come bursting the concrete                                     \r\nBe a cartoon heart                                                                                              \r\nLight a fire a fire a spark\r\nLight a fire a flame in my heart\r\nWe'll run wild\r\nWe'll be glowing in the dark\r\nOooh ooh ooh\r\nWe'll be glowing in the dark\r\nA-woo-a-wooooo\n\r\nAll the boys, all the girls, all that matters in the world\r\nAll the boys, all the girls, all the madness that occurs\r\nAll the highs all the lows, as the room a-spinning goes\r\nWe'll run riot, we'll be glowing in the dark\n\r\nOoooh, ooooh, ooooh\r\nSo we'll soar\r\nLuminous and wired\r\nWe'll be glowing in the dark\n\r\ndirectly from coldplay.com\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nfound the link \nyoutube.com/…\n\r\nat 2:50 they talk about this song. \n\r\ngetting his scooter stolen by kids was what shot off his writing of his song. haha.\n\r\nit's about venturing through the city!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song is just so f***ing good.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThe title Charlie Brown refers to the lyric 'cartoon heart'\r\nmeaning don't take your heart too serious...have a laugh..be happy\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI interpret the end of the first verse as \"...took what they offered me: to set me free\" - they are offering freedom itself.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nIt is about Charlie Brown - winning - getting the candy instead of the rock. Hitting it through the uprights instead of having it yank by Lucy before he can even kick it. Winning\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThe song has a wonderful forward motion.  To me, it seems to be about just quitting following the rules for a day and running free with the rest of your kind.  \t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nTo me this song is about someone who isn't expected to do well beating the odds. Probably someone looked down on society, a delinquent, overcoming the odds and \"glowing in the dark\". Love this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nStop being a MOST stubborn holdout and explain this one, pleeeeeeeaaaaaaaaaase (and with soy chips on top:)\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThe song features frontman Chris Martin gloomily observing, \"I stole a key and took a car downtown where the lost boys meet/ Took a car downtown and took what they offered me.\" Drummer Will Champion told Q magazine, \"At one point there was a lyric that alluded to Charlie Brown, the Peanuts character, but it's just a name really.\"\n\r\nChris Martin penned the song after attending a Bruce Springsteen concert in LA. He told Music Week, \"I was like, 'Okay, let's see if anything came out of that day.'\" He added that he wrote it in a friend's Wendy House, which he had turned into a studio because his daughter didn't like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think it's:\n\r\nLight a fire, oh, find a spark!\r\nLight a fire, flame in my heart!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nin my personal opinion, this song reminds me so much of The Perks of Being A Wallflower. I know that it wasn't written for it, but it explains Charlie's life so well.\n\r\n\"I stole a key\r\nTook a car downtown where the lost boys meet\r\nI took a car downtown and took what they offered me\r\nTo set me free\r\nI saw the lights go down at the end of the scene\r\nI saw the lights go down and they're standing in front of me\"\n\r\nThis is like Bob's first party. At Bob's party the \"lost boys\" meet and get together because no one cares or judges. Charlie took the pot brownie that they gave him, and that was the first time he ever got high. \"I saw the lights go down...\" Kinda resembles how you feelwhen you're high\n\r\n\"My scarecrow dreams\r\nWhen they smashed my heart into smithereens\r\nBe a bright red rose come bursting the concrete\"\n\r\nCharlie got his heart and dreams broken many times throught the book. But by the end, like when he defended Patrick hope and love starting to come back, and all that was bad was made right. \n\r\nThis is just a little tidbit, but whenever I heear this song, I think of this book\n\n\n", "comment_21": "\nI think this song is about getting your hopes up and being in a great situation and then everything goes wrong and your heart gets crushed. As a result you become careless running wild in the dark.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI honestly think this song is about just being young, doing what you want. The beginning seems to be talking about having dreams/wishes that never came to fruition but you just get back up when you get down, in whatever manner you choose. I may be looking at this song only on the surface but \"All the highs, all the lows, as the room is spinning\", maybe drinking the blues away. Possibly not to the point of oblivion but just to feel good again, get your feet back on track. The title \"Charlie Brown\" may just relate to childhood in general. Typically kids want to \"glow in the dark\", run wild. Charlie Brown may just be a creative way to get the listener to think it terms of their youth.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nChris martin said oringally this song was about his scooter that got stolen and he imagened what journey his scooter went on with the other person, thus this song got created.\n\r\n\"Light a fire, light a spark,\r\nLight a fire, a flame in my heart\" \n\r\nThis is probably refering to starting the engine of the bike.\n\r\nHe might not be worried about the thief \"living inocent wild\" that took the scooter and will \"run wild\" \"glowing in the dark\"\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nthe correct lyrics according to coldplays website\r\n\"Light a fire a fire a spark \r\nLight a fire a flame in my heart\" \t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\n\"As the room a-spinning goes\"\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nOnce again, it's about going to a concert to set yourself free\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI watched an interview about the making of this album. They said that even though the lyrics are \"a bit shit\" (lol) they liked the lyrics on this one. Martin said someone stole his scooter, and he wrote a song about the adventure that the boy and the scooter would have together. \n\r\nsorry i don't have the source, i just spent a half hour looking for it, can't remember the website -_-\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI think it's about someone who thought they knew what they were doing- but got shattered- broken. And now they have turned to someone- someone to help them \"Light a flame\" in their heart.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThe title Charlie Brown refers to the lyric 'cartoon heart'\r\nmeaning don't take your heart too serious...have a laugh..be happy\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nAmazing song, just made this account for this song !! love chris martin\n\r\nI think is about a teenager that feels insecure and he is trying to hide his problems or ignore it by having the wild life but even he's a lost boy he still is very inocent and he is expecting to be happy to find a way things can change.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\n\"All the boys, all the girls\nAll that matters in the world\nAll the boys, all the girls\nAll that matters that occurs\nAll the highs, all the lows\nAs the room is spinning, oh\"\nIt feels like he tries to forget the world but ...\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nCorrect Lyrics:\n\n\"Wooh, ooh ooh ooh\n\nStole a key\nTook a car downtown where the lost boys meet\nTook a car downtown and took what they offered me\nTo set me free\nI saw the lights go down at the end of the scene\nSaw the lights go down and standing in front of me\n\nPoh ooh ooh\n\nIn my scarecrow dreams\nWhen they smash my heart into smithereens                                              \nBe a bright red rose come bursting the concrete                                     \nBe a cartoon heart                                                                                              \nLight a fire a fire a spark\nLight a fire a flame in my heart\nWe'll run wild\nWe'll be glowing in the dark\nOooh ooh ooh\nWe'll be glowing in the dark\nA-woo-a-wooooo\n\nAll the boys, all the girls, all that matters in the world\nAll the boys, all the girls, all the madness that occurs\nAll the highs all the lows, as the room a-spinning goes\nWe'll run riot, we'll be glowing in the dark\n\nOoooh, ooooh, ooooh\nSo we'll soar\nLuminous and wired\nWe'll be glowing in the dark\"\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nA good-hearted but troubled youth steals the keys to the car and goes downtown. There he meets the delinquents who lead a life he finds intriguing and exciting. They offer him a hallucinogenic drug (probably Ecstacy). \n\nHe takes it and has a vision that gives him deep insight. The \"lights go down\", as though a play is starting, and sees himself as if on a stage. He sees he has been a passive victim ( a \"scarecrow\") to the bullying and abuse of others (like Charlie Brown, always the object of cruel ridicule). They \"smashed his heart into smithereens\", breaking his spirit and self-respect. \n\nSuddenly he perceives his survival as a triumph, that he has overcome his obstacles like a flower bursting out of concrete. He feels a euphoric rush of hope and joy, his heart a \"cartoon heart\", intense with vibrant color and expression.\n\nWith a new confidence that transcends self-awareness, he exuberantly rushes into the experiences he was too timid to try before, including pursuing the girls he was too shy to approach. The experiences of the night are heightened by the drug-- he senses \"madness\", feels the \"room a-spinning\", feels \"luminous and wired\", while everything is \"glowing in the dark\".\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nIt's about a strong feeling of happiness that nobody can quench. The singer is being manipulated, used, broken and left behind (When they smashed my heart into smithereens) and still being able to rise up because you are you, and that's the greatest thing you can possibly be (Be a bright red rose come bursting the concrete).\n\nAs for the title- Charlie Brown is seriously tough. He has to deal with all kinds of things on his life, and still comes back strong. Charlie was always meant to be someone we can connect with, since we all know failure just as well as success. Just like we can relate to this song, full of both of those things.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nthis album came out when my grandma had just died of cancer so its so HARD to listen to this album. The song that gets me crying is charlie brown when i hear \"took a car downtown and took what they offered me to set me free\" i remember going to the doctors her to get her pills.\"in my scarecrow dreams when they smash my heart into smithereens\" i would have nightmares of her dying in different ways.\"be a bright red rose come busting the concrete be a cartoon heart\" its like she's telling me to be happy she's in a better place where she can walk and talk.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nIs it only me who finds these lines particularly beautiful ... \n\"In my scarecrow dreams\nWhen they smashed my heart into smithereens\nBe a bright red rose come bursting the concrete\"\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\npersonally i believe this track has alot to do with narcotics, first the title 'charlie brown' coke/heroin. i stole a key, took a car down town where the lost boys meet,....and took what they offered me, to set me free' clear and obvious drug connections. key being the drug, car being journey/trip, lost boys do drugs etc. i saw the lights go down at the end of the scene, anyone  whose done mdma knows what thats all about. i agree with the above mentioned that there are also references to the cartoon character. his own feelings are being compared to the charlie brown character, gettin the shorts straw, looking for something brighter.\n\r\nits well known chris is a clean musician but we all know you never write yellow and rush of blood to the head without taking a trip or two xxxx\n\r\nps love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nTo me, the meaning of the song IS Charlie Brown. Doesn't anybody else think that it sounds at least a bit like the theme song? And the piano at the end, doesn't that sound like that one song during the Christmas special they play once a year on ABC Family? I honestly can't stop listening to Mylo Xyloto, and whenever I think I've had enough, I just turn on Charlie Brown or Up w/ the Birds, and then I'm like' \"Just one more playthrough...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI think this song is about childhood. \n\r\n\"Took a car downtown where the lost boys meet\" Well the lost boys are the characters in Neverland from Peter Pan, and they were the kids who wouldn't grow up. \n\r\nWhen he says he saw the lights go down at the end of the scene it could be he saw his childhood end.\n\r\n\"When they smashed my heart into smitharines\". This could be how it killed him knowing his childhood was over.\n\r\nAnd the rest of the lyrics are about having fun and living life.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nPersonally I think the song is about heroin. Thus the name \"Charlie Brown\" brown refering to heroin. \n\r\n\"Took a car downtown where the Lost Boys meet. Took a car downtown and took what they offered me. To set me free\" refering to him actually going to buy some heroin.\n\r\nWhen he is singing about how \"they smashed my heart into smitherines\" he is refering to the times he has gone down to only find out that they dont have heroin to sell him so he will have to suffer through the withdrawl. \n\r\n\"Light a fire, light a spark. Light a fire, flame in my heart\" refers to when he takes the drug and it enters his system. \n\r\nWhen he says \"We'll run wild, oh. We'll be glowing in the dark. We'll be glowing in the dark\" he is talking about how he is high and enjoying the glow. \n\r\nAfter that he goes on to sing \"All the boys, all girls. All the maddness in the world\" I interpret that as his thoughts on how many other people have the same addiction as him.\n\r\n\"All the highs, all the lows\" refers to how he feels in between highs, sometimes he is high and sometime is is suffering from withdrawl and cant find a fix. \n\r\n\"Now the room is spinning, oh\" and \"We'll be glowing in the dark\" is talking about how when he is high and the room is spinning and he feels alright again. \n\n\r\nSo to sum it all up the story of this song is that he went downtown and picked up his fix from the \"Lost boys\". He got high and the room was spinning but he felt okay  because he got his fix.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThe Song is named after the Peanuts character 'Charlie Brown'\n\r\nGood song i love that chorus music bit where it really loud :)\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThe song is about his acid trip\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\n\"Live Innocent Wild\" should be \"Luminous and wired\" :)\r\nThe song sounds like it's about drugs, but that just isn't Coldplay, you know what I mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nAm I the only one that noticed the masonic symbols in...I don't know all their music? The song is about Finding enlightenment through being broken down after masonic ritual. Don't believe me? \n\r\nAll highly successful entertainers seem to go through this \"metamorphosis\" point in their career. After embarrassment. Falling to the deepest low that they can get to then being resurrected like a phoenix. Some rappers go to jail. Some are embarrassed publicly through ceremony (taylor Swift for one, michael jackson for another). \n\r\n\"Took what they offered me\"...Robin thick and numerous other artists say these EXACT same lyrics. \n\r\nI guess no one else Noticed The PYRAMID, like letter \"A\" at the TOP in the BEGINNING of the video...\n\r\nI love Coldplay btw. And i have no problem with masons. Just Pointing out what people refuse to see.\t\t\t\t\n\t\t\t\t\n\n"}