{"comment_0": "\nI think it's about how people who have questionable lifestyles, such as those of drug use or crime, don't see their actions the way everyone else does. While we see them using drugs, we would \"call it a spliff\", but to them, it \"smells like chocolate\". People never perceive their own actions to be as bad as they would perceive them to be if they saw someone else doing it, and I think that might be what this song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIn an interview, Matty says this song is about \"me and my mates knocking around in my hometown. It is a kind of love letter to the kind of relationships we had with authority figures, be it our parents or the police. its kind of a story about small town boredom.\" \n\n\r\nTo me, this song is a serenade or an ode of sorts to when a guy likes a girl and the time they spend together, just doing wild crazy teenager stuff. He believes life is sweet when their together ('chocolate') and he doesn't ever want them to break up or give up their time together ('quit it'). I tend to envision some cool teenagers having fun around town together when I hear this song. They don't want their time together to end ('quit'). They prefer to be youthful and rebellious and have a good time.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIts about his sister, she was a heroin addict and she used to tell him that her syringes were her 'guns which she use to hide (\"guns hidden under our petticoat\"), the 'chocolate' refers to the heroin and he wrote this song in a blur of emotions he must have been experiencing at the time, he never meant for it to be released from his computer but somehow it made its way onto soundcloud \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis screams heroin to me... As a recovering opiate/opiod addict of over 3 years, I felt that way as soon as I heard it.\n\nI've heard tar called chocolate, and needles as guns. Besides the slang terms used, what really caught my ear was when he says \"Hey now you say you're gunna' quit it but you're never gunna' quit it.\" \n\nHeroin is literally the hardest drug habit to kick. I can't tell you how many times I've heard something similar come out of a friends mouth, over and over and over again.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nChocolate is another word for weed or pot. The boys in the blue are the ones that don't want to legalize weed. (Or the police officers) The ones in the black are the ones that want it legalized. They are hiding guns to protect themselves in case they get caught. They are never going to stop smoking it. They need to go somewhere where they won't get caught and everything smells like pot after they smoke it\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIt's about a bunch of friends who've been smoking \"chocolate\" (pot) in their car and are now being pursued by the cops (the boys in blue). I'm pretty sure the line is NOT \"bite your friend like chocolate\" but \"Oh your friends smell like chocolate\". The singer has a pretty strong accent, but I think it's more likely that smoking weed makes you smell like weed rather than bite people.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think its about heroin . Sometimes heroin users buy a bar of chocolate for the tin foil inner wrapper to smoke the heroin .a roll of of tin foil in your car will alert the cops if they stop you. When you smoke ymthe heroin your car your car smells of chocolate . ( don't ask )  some of the band members look like user,s to me thin washy and pale \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nTo me it resonates as being about doing everything you're not supposed to do. Chocolate is most definitely imagery for a drug (Probably pot) and the rest of it seems to narrate the finer points of a more edgy lifestyle.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI always thought it was about \"the chocolate\"..specifically hash. it looks like chunks of chocolate. they're running away from the police because their car smells like hash. ya know?\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nwell its not 'call it a spliff' its 'call it a split'\r\nalso it's not 'said its better than hanging on' its 'said the feds are here you know'\n\r\nits about kids smoking weed in their cars cos and the policeman trying to arrest them because there's no proper crime to deal with\r\nthe chocolate is a reference to the drugs (obviously)\n\r\ni still don't understand the petticoats bit though?\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI think this song is really beautiful. Free songs on iTunes holla!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think this song, at its bare meaning, is just about doing things you know you aren't supposed to, and the youthful thrill of it. There's an obvious connotation to drugs, but even still, I think the choice of using \"chocolate\" as the imagery is masterful. Wasn't chocolate the first thing we all wanted, even enough to steal it when we knew we weren't supposed to have it? Just a metaphor for the excitement of engaging in the things we know we shouldn't, but just can't get enough of.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nits about chocolate.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nIf anyone's ever seen/read the film book On The Road, the song is actually quite similar to it\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nlyrics always mean different things to different people.\nhere's what i think:\n\n\"call it a spliff cause you know that you will\" refers to always smoking weed even when you say you won't, \"guns\" are joints, \"think about how to think\" is what you do when you're high\n\nhis girl is trying to get him to quit, that's why it must say \"if you don't stop smoking it\" instead of start... and either she says \"it's better than hanging on\" or he says \"I'm better hanging on\", but it's definitely not \"the feds are here you know\" (some pages say so)\n\n\"play it cool\" well around police and stuff... and of course everything smells like chocolate ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nOnce I saw an interview with the singer (Matthew Healy) and told he was coke addicted to me I think this song tells about his coke addicted.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nso...this sounds a little whack but before i knew this song was about smoking weed, it always reminded me of a friend in high school. i can understand few words of what he says because i am american haha. but in high school, i was in a bunch of bands at the time and she was a year older than me and i just couldnt snag her. but when we saw each other in school and hugged, her hair always smelled like burnt weed because she smoked a lot. and it always smelled like dark chocolate. when he said his hair smelled like chocolate, its the first thing i thought of.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nChocolate is a slang term for pot and/or opium. It is also a heroin reference in certain contexts. I always thought of the \"guns\" as bowls. To me it just sounds like a group of friends who blaze secretly, with little regard for getting caught.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nTo clear up false opinions and bring light to some clarity. Matty has said in a couple interviews the song was wrote about him and his mates strolling around town and getting into mischief rather than being consumed by boredom. But yes, \"Chocolate\" is referring to weed, which they smoke quite a bit.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nIt's SPLIT not SPLIFF.. \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nHey, now I call it a spliff 'cause I know that you will. Uh, oh, you bite your friends like chocolate (A spliff is another word for a joint, so he's saying just go ahead and call it a joint, because even though it's heroin, you'll lie and say it's weed. I think her biting her friend is just showing she's high.)\n\r\nYou say, we'll go where nobody knows, with guns hidden under our petticoats\r\nNo we're never gunna' quit it, no we're never gunna' quit it no.(They go to a secluded area with \"Guns under their petticoats\" AKA needles of heroin under their coats, and their saying they'll never quit it.) \n\r\nNow we run run away from the boys in the blue, and my car smells like chocolate. Hey now think about what you do, think about what they say, think about how to think. Pause it play it, pause it play it, pause it. (The boys in the blue are cops, and his car smells like heroin, but he calls it chocolate. I'm not entirely sure about the next line, but I think he's saying they're high, so they have to really concentrate to understand what's going on around them.)\n\r\nYeah we're dressed in black from head to toe (Just dressed dark to hide better)\n\r\nNow you're never gunna' quit it, now you're never gunna' quit it, now you're never gunna' quit it. If you don't start smoking it, that's what she said (Once again, i'm not 100% sure, but I think she's saying he'll never have to quit it if he starts smoking it)\n\r\nHey now we're building up speed as we're approaching the hill. Oh my hair smells like chocolate. Hey now you say you're gunna' quit it but you're never gunna' quit it. Gotta get it, gotta get it, gotta get it, gotta get it, go!. And play it cool. (They're driving fast and possibly recklessly since they're high, and his hair smells like heroin. His friend/sister is saying she's gonna quit, but he knows she won't. The next line could either mean they have to get the heroin and hide it and play it cool since the cops are coming, or she is addicted and has to get heroin all the time, but play it cool and say it's just for fun and she's not really addicted.)\n\r\nWell I think we better go, seriously better go. Said it's better than hanging on. Seriously better go, oh oh, well I think we better go. Said it's better than hanging on. Said rebecca better know. Seriously better go (Him saying they need to leave and get home either because they're sobering up/need to sober up, or he's saying it's wrong and they need to stop. I have no idea what the Rebecca line means, either wrong lyrics or i'm just clueless.)\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nSo the chocolate here is some sort of illegal drug; probably pot.\nIt's about a group of friends smoking and running from the cops, or some other authority figure, but I think the point is that they're defying authority figures.  He talks about the effects of the \"chocolate\": \"my car smells like chocolate\" \"my hair smells like chocolate\" \nThe \"guns hidden under out petticoats\" part seems like they are trying to seem innocent to authority.  The type of woman who wears a petticoat isn't who you'd expect to be hiding a gun, and they are trying to deceive the cops by seeming like the type of boys you wouldn't expect to be hiding drugs.\nGreat song, great lyrics, great band.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI think, like most people, its about a heroin addict. Especially when it says 'your never gonna quit it' and, I may be looking too closely into this, but when it says 'yeah were dressed in black from head to toe', it could be a funeral for the drug addict.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis song is about getting really high and going around town.  Saw them live and Matt said so.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ni would say that this song is about a teenager doing drugs/smoking weed with his friends, and trying to hide it from his parents/the authorities \n\"the boys in the blue\" is clearly the police\n\"guns hidden under our petticoats\" would be the things they try to hide (not guns)\n\"chocolate\" is the drugs/weed. Maybe they see drugs as a harmless (like chocolate) thing because they are young. also \"my car/hair smells like chocolate\", might be a reference to smoke. \nAlso \"she said you're never gonna quit it if you don't stop smoking it\" would make sense, if the lyrics is about drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nwhat they mean with chocolate is weed or pot. they're running away from the boys in the blue : cops. and their hair smells like chocolate (weed) because they smoked it so much and they want to keep smoking it. but his girlfriend doesn't like him smoking so she says he has to stop but he'll never quit smoking. so it also has some kind of love story in it but also friendship because he's talking about numerous people in this case so every adventure he's had, had been with these people. like running away from the cops which seems like fun apparently \t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nMatt (the singer from The 1975) has already said multiple times this song \"chocolate\" is about heroin. I assume chocolate is slang for tar heroin since its the color of chocolate. Guns is slang for syringes.The line \"guns hidden under our petticoats\" is referring to people hiding syringes on their person. All the times in the lyrics they say \"never gonna quit\" is definitely referring to how difficult it is for a heroin addict to quit the drug. Anyone saying its about love ,teenage-angst, or marijuana is just wrong and or misinformed. Ill go with the meaning given by the songs creator. Thanks\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nWell, it's about marijuana, and about running from the police. I also believe that 'Chocolate' by The 1975 contains loose references to the 'Rebecca Riots' that took place in South and Mid Wales between 1839 and 1843 as an uprising against the poverty and oppressive taxation imposed on Welsh rural folk at that time. The male rioters dressed in their womenfolk's clothes, and quoted the bible; Genesis 24:60, which concerns the biblical figure Rebecca and her children. The lines, \"With guns hidden under our petticoats...\" and \"Said Rebecca ought to know..\" seem to indicate a connection. I would be interested if any of the band members would like to confirm or deny the link. More about the Rebecca Riots can be found on Wikipedia.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nChocolate = hash. \nGuns = spliffs. (See also M.I.A.'s 'Paper Planes').\nPeople without much cash usually share, often biting it, making it difficult to divide equally. Its been bitten in half & songwriter is receiving the smaller piece, this doesn't seem to surprise him. Hence, \"Call it a split, because I know that you will, ooh you bite your friends like chocolate\".\nGiven this info, the rest should explain itself! :-)\t\t\t\t\n\t\t\t\t\n\n"}