{"comment_0": "\nwow. thats powerful.  these lines:\n\r\n \"Remember when Ronnie died and you said you wished it was me? \r\nBut guess what? I am dead \r\nDead of you as can be!\"\n\r\nalmost makes you think you shouldn't be listening to it.  very good song, although i feel kinda ashamed to be entertained by it\n\n\n", "comment_1": "\nAnd Hailie's getting so big now, you should see her, she's beautiful \r\nBut you'll never see her, she wont even be at your funeral\r\nman, if that doesn't make his mother cry i don't know what will. that's some of the most intensely personal stuff ever written, and it's wonderful, this song is kind of a masterpiece\n\n\n", "comment_2": "\nWhat i like about Eminem was he rapped from the heart - and wasn't afraid of writing songs about completing menial household chores.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nReally good song. He really dissed his mom on this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n\"Im sorry momma \r\nI never meant to hurt you \r\nI never meant to make you cry \r\nBut tonight, Im cleaning out my closet \"\n\r\nWhere is this a chorus from?\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n:|   This song is like Kim in a sense that it's so disturbing it's amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nA powerful song. Powerful lyrics.\r\n\"I maybe made some mistakes but I'm only human.\r\nBut I'm man enough to face them today.\r\nWhat I did was stupid, no doubt it was dumb,\r\nbut the smartest shit I did was take them bullets out of that gun.\"\n\r\nthen farther down\n\r\n\"But how dare you try to take what you didn't help me to get.\r\nYou selfish bitch, I hope you fuckin' burn in hell for this shit.\r\nRemember when Ronnie died and you said you wished it was me?\r\nWell, guess what, I am dead. Dead to you as can be.\"\n\n\n", "comment_7": "\n*witnessing your momma popping prescription pills in the kitchen*\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nlol woops someone corrected that already thats what i get for logging on at 3:15in the morning :-p  \n\r\npeace\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthis song fully showes Eminems' true talents as a song writer/rapper...i agree with grapekiwi in feeling somewhat ashamed to be entertained by a song like this because it deals with the downs of Marshall's life...\r\nmost powerful line in the song is by far, \r\n\"Remember when Ronnie died and you said you wished it was me?/ But guess what?/ I am dead/ Dead of you as can be!\"\n\n\n", "comment_10": "\nhey Mike\r\n  You probally heard those lyrics \r\n   \"Im sorry momma \r\nI never meant to hurt you \r\nI never meant to make you cry \r\nBut tonight, Im cleaning out my closet \"\n\r\nis from the trailor to  8Mile\r\n the movie that stars eminem\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nalso he says victim of munchaouesens sydrome, which is the disease his mom had, making her think him and his 1/2 brother nathan were always sick.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nhow old is nathan?\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nnathans fifteen, he plays the kid eminem in the video without eminem, and damn hes hot\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nnathans fifteen, he plays the kid eminem in the talk show in the video without eminem, and damn hes hot\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\n*agrees with uncgirl*\r\nwheheh\r\ni think im gonna sing this song to my mother haha\r\nhell......i been raise by eminem \r\nim addicted :D\r\nbut,over the song.. i love it !! :)\n\n\n", "comment_16": "\ngreat song, love the rythm and the melody, nice sh%t =]\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\n1.THING,ITS,JUST,FUCKIN.WIKERD:P:P:P:P\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nGreat song.  What i really like is the chorus.  He's saying I'm sorry, but i just have to tell it like it is.  How will his mom react to that?  She can't!  And that's the worse diss of his momma yet.  When she can't retaliate, she's done for...\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nnathens his brother\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nCorrect me if i'm wrong...but isnt munchaouesens sydrome when women harm their own kids to get sympathy or sumthin?\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni heard that this song was written because his mom had a disease where she told people that he was sick for attention / sympathy.. which is kind of sick in itself. hence the line, \"my whole life i was made to believe i was sick when i wasn't...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\n\"Remember when Ronnie died and you said you wished it was me, well guess what? I am dead, dead to you as can be!\"\n\r\nThat line almost made me cry the first time I ever heard it. I was like in awe when I first heard this song. It's intensly personal and disturbing. Makes you understand Eminem a little more.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ni really like this song and yea it may be a diss to eminems mom but hey they were doin the same shit as us and look at them his mom seemed like a bitch anyway she sounds like a stuck up bitch i mean c'mon tellin yr kid that when his uncle died u wished it was him... HE has alot of talkent and expressses everyday life\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nya know its kinda funny. if his mother wants to sue him for slander again, she has to listen to the song. So either way he's on top.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nda real deal....i got the cd yesterday...bad it's great\r\nthis is my fav...dude, i just think Eminem is beaing truthfull even if he is able to get into \"trouble\" again.....\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis song fuckin' rules...but, dude, did you even fuckin' listen to the song.  Cuz' you got like most of it wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nhmm so Ronnie is his uncle? I always wondered that. Neway- the other day i was having this conversation about music etc. and i told some1 that I didn't like ne other rapper but eminem. They said yah that's probably only because he's white. I was offended and said no that's not it at all. Eminem isn't like any other rapper, apart from being white. He doesn't talk about $$, hoes etc. persistently like others. I like his songs like this that demistrate the proof of my point. He is different b/c of his music not color, don't you agree?\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\n this song is powerful  i don't feel ashamed to be entertained by his stuff cuz hes speakin from his heart this shits cool to just chill i love all his songs  and i don't listen to much rappers but i will alawyz listen to him\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nIt's really sad that he had to go through all of this shit. People should just leave him alone. There are ppl who critisize his lyrics and blame him for some of the crazy shit that ppl are doing lately, but he is just letting off some steam. I think that he is a freakin genious. His music is the best. \r\nKYRIE~~ U r so right!! he doesn't talk about all of that gross shit that other male rappers talk about. What he is trying to express is stuff that he has had to experience. \r\nPPL If you don't like what he's saying then just don't listen!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nthis song is about how he was washing hs hands clean from everything and saying sorry to his mom, in other words, cleaning out his closet..or at least he said so in some interview on mtv..\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nEminem is undoubtedly the best rapper around.  His lyrics are powerful and deep, unlike most rappers.  On his new CD he stays with the beat more than he used to.  And his flow is \"almost flawless\".  By the way I believe this chorous was supposed to be a take off from Outkast's 'Ms. Jackson'\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nIncuboy's right, if you don't know the song, don't post the lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nEMINEM IS SOOOOOOOO SEXY!!! I don't like his music, I wouldn't listen to it if my life depended on it, but I'd rape him!! I stalk him every day waiting for the right moment to do it!! I LOVE YOU BABY!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\noh yeah, my lovely friend wants to kill Eminem. Hit him w/a truck & beat the crap out of him w/a baseball bat!!! FUNNESS! I have sweet-ass friends!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI have to clean out my closet too....I ADMIT IT I FARTED IN THE CAR AND BLAMED IT ON MY DOG\n\r\nIm sorry Bojoe\r\nI never meant to hurt you\r\nI never meant to make you whine\r\nBut tonight Im taking the blame for my gas\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nthis song is awesome..its so amazing how this guy with such painful memories can go out there and just tell the world his story..the one line \"remember when ronnie died and u said u wished it was me? well, guess wat, Iam dead. DEAD to YOU as can be!\"\r\nhis mom put him through shit and im lovin the attidue he has toward her..hes got balls..\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nHmmm, this was earlier on in the posts but the chorus\n\r\n\"\"Im sorry momma \r\nI never meant to hurt you \r\nI never meant to make you cry \r\nBut tonight, Im cleaning out my closet \"\n\r\n...it's close to \"Ms. Jackson\" by Outkast \t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\ni guess i kinda grew up like eminem... im not going to go the full extent but i think the phrase \"cleaning out my closet\" he means just gettin all the shit off his chest, Making her realize what she did to him and how much it hurt him... there have been times i have wanted to just yell at my mom and tell her all the shit that she put me through cuz she doesnt realize it... with this song it kinda lets me realize im not the only one...   well im out, Later\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nOkay...if you're going to post lyrics...get them right...\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nwell I'm not really a big fan of eminem but this song was so sad and i felt sorry for him, it kinda moves you. He has a few songs that tend to do that \t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\n\"Remember when Ronnie died and you said you wished it was me?\"\n\r\nSimilar thing happened in my family, when my uncle died, my grandma started hitted my mom and saying \"why couldn't be you?\"  I have hated her ever since.\n\n\n", "comment_42": "\nthis song is bad ass. i love how he puts his life experiences in his songs. it lets you know how shit was for him when he grew up. eminem is a great rapper. i don't understand how people can't like him but whatever that's their opinions. this song is great!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nhe says \"Wasn't it the reason you made that CD for me, Ma? So you could try to justify the way you treated me, Ma? \" what cd might he be refering to, like what was on it\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nthis is a cool song\r\nit make alot of sence since his other four albums\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nI never realized what it would be like to live like this until i met my ex boyfriend and his brother, their mother is exactly like that, shes a crazy psycho, and i wish that they had someone better for them\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nBLUE BLACK ABOVE:  Eminem's Mom made a whoLe CD abOut Eminem and stuFf and thatS what he iS taLking abOut...She taLked abOut hOw She thinkS Eminem iS making stuFf up abOut her and hOw She wiSheS they cOuLd have a gOod reLatiOnship....\n\n\n\n", "comment_47": "\nhOw can u guyS get hiS LyricS wrOng when itS in hiS aLbum cOver?\r\ndOn't underStand...\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nJust a small correction:  \"Going through public housing SYSTEM, victim of Munchausen's syndrome.  \n\n\n", "comment_49": "\nthis song definetly explains and makes u understand Eminem alot more...... i just about cried when i heard the line\n\r\n*Remember when Ronnie died and you said you wished it was me, well guess what? I am dead, dead to you as can be!* \n\r\nthat's intense.....this is a great song i love it\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\ncool song.  has a strange sound to it though.  i guess that's what got me hooked.  has very powerful lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\ny does everyne always call him eminem, hes got a name you know. its marshal!\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThis is the most personal song I've heard anyone put out there in a long time. Not only that, but everyone who hears it just loves it (everyone I know of, anyway...)\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nthis man is the best stop f*** song ever all dem emine=m haters stop hating yall jus jealous cuz u cant be as out spoken as dis min here\r\n oreo \t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\niiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiii loooooooooooooooooooooooooooooooooooooooovvvvvvvvvvvvvvvvvvveeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee ttttttttttthhhhhhhhhhhhhhhhhhiiiiiiiiiiiiiiiiiiiissssssssssssssss ssssssssssssssssssooooooooooooooooooooooooooonnnnngggggggggg\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI just love this song!  \"The Eminem Show\" is his best cd to date, in my opinion.  I like how he sings about his life and not just about women and money, like most rappers do.  He shows he's human through his songs.  And I really like when he mentions Hailie on his music.  He really loves her.  \t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI like the song cause it makes me love my parents even more every time I hear it. It doesn't really matter to me if Eminem is embelishing his past a bit or not, I'm sure he is to a certain extent, cause every kid does... but I'm also sure that there has to be truth to it too... Either way, I like the song and I think it's the best on his newest CD, but I still like songs like \"Rock Bottom\" from the first CD...\n\r\nI wouldn't really consider myself a huge Eminem fan, but I really like the song, and I gotta say something to the kids out there... if you think your life sucks cause your parents won't drop 20 bucks on the newest toy, just listen to this song and realize how lucky you really are... I think that's a message that youth really need to get out of this song as well. Oh well, that's it for me :)\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nthiS iS hiS neXt singLe...caNt wait tO seE the videO!!!!\r\n=)\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThe video is fuckin' awesome, i saw it earlier today! I think that the way he expresses himself in this song really does show his true feelings for his mom. It really does make me appreciate him even more!\r\nI am a huge fan of him and I love this song \r\nPeace and Love ya'll\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nTHE VIDEO WAS GREAT!!!   OoOps he did it again.....\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nNever in my life have I liked Eminem.   But when I saw this video...I cried.  I cried once it was over...not because I could relate...but because I had a new respect for this man and because it was a haunting video.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nhaunting is deffinately the right word if u dont have his new album deffinately go out and buy it its a lot better than his last two, ive always been a fan but i have a new respect for him after listening to his new album and was he burying his mother in the video??i was j/w caz it seemed like he was and if he was then he'll prolly get in a lotta ish for it but awesome song awesome video\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nI've only heard this song, and before I didn't like Eminem that much, but after hearing him kinda humble himself I can see him in a new light, and I can also see why his mom was so wrong to do whatever the hell it is that she did.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nIt's interesting that over and over I see so many people, after listening to this song.... remember the lines... \"Remember when Ronnie died and you said you wished it was me, well guess what? I am dead, dead to you as can be!\"... the first time I heard this song I was in the car and drving home to my newborn son and these words stuck with me.... I know it's because I had an awful childhood growing up with a crazy mother and it makes me wonder how many other people out there feel like Eminem... more children are growing up in situations that are so sad and so hurtful\n\r\nI just want more for my son and hope and pray he never feels this way\n\r\nI too feel somewhat ashamed to be intertained by this song... I feel bad... but in a strange way it reminds me that my mother doens't deserve me, my son or to be a part of my life. Just because she gave birth to me, doesn't make me in debt to her emotionally.\n\r\nfunny side note: I've always listened to Eminem, now that I am a mother... I don't want my son listening with me\n\n\n", "comment_64": "\n'going through public housing SYSTEM'. And no one is gay if they don't like Eminem; you're a fag if that's what you think. Hey, NEWSFLASH!: PEOPLE CAN HAVE THEIR OWN OPINION, YOU F*CK!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nanyone see his video for this song on MTV yesterday noon..that was a tight video i think the best one he ever made that shows his more nice & friendly side of Em..\r\ndancinchick209\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\n Electric Pnk panther since you think hes such an asshole why dont you take a lookk at hailies song.  it shows that he knows ppl hate him but he sings anyway.  And i think hes really good at it too.  and belive it or not, one of my GAY friends like him too.  he actully sings about life and not that shit the others sing about.  its one of my favorite songs .\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nthis song friggin kicks ass.  the music video is amazing. and everything about marshall rocks. cause comin from this life style, and makin millions..u gotta give this guy alota credit. i love him, and all his work...\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nelectic pnk panther, he sings about real shit, thats why we love it. so stop tryin to anyalize us. we like this shit, so buzz off and listen to ur Pedro shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nAuriana....\n\r\nEminem TRIES to make people hate him and cause controversy, because he knows you yuppie drones will eat it right up, because its \"real shit\". I personally, i listen to shit that is \"real life problems\", not some made up stuff to further their badass image, to sell more records.\n\r\nSo his dreams of killing his wife, and others is \"real shit\"? Seems like diabolical shit.\n\r\nJustakid\r\n\"cause comin from this life style, and makin millions\" PFFFFFFFFT thats nothing... theres like 500 rappers out there that have done the same... seriously doubt his childhood was THAT bad, or even close to some other rappers, so lets hear another reason...\r\nWhy do we got to give eminem credit? his image/personality was probaly made by a record label, so give the record label credit.  and yes... i will go back listening to my pedro shit, hypocrit.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI hate Eminem, but I love this song.\r\nIt's great, it inflicts powerful emotions in the listener.\r\nIt's most likely offset by the silliness and humor of most of his other songs.\r\nI think the silliness and humor is there, I mean... I don't listen to Eminem... of course not...\r\n>>\n\n\n", "comment_71": "\nI hate Eminem, but I love this song.\r\nIt's great, it inflicts powerful emotions in the listener.\r\nIt's most likely offset by the silliness and humor of most of his other songs.\r\nI think the silliness and humor is there, I mean... I don't listen to Eminem... of course not...\r\n>>\n\n\n", "comment_72": "\npink panther, please don't act like us hip-hop lovers don't have anything intelligent to say. we do. we think this song has meaning and if you don't that's cool, but please don't attack us. no one attacked pedro what's-his-name, and do you honestly think that the artists you like don't make up the things they sing/rap/write about? just because you don't like eminem doesn't mean he makes everything up, just some of it. due to his previous \"genre\" of writing (the murderous songs) doesn't mean everything is fiction. it's eminem's way to vent.\n\r\n yes, alot of people have had harsh childhoods, but how many people you know keep it inside? especially someone as sensitive as eminem? yes he is sensitive. listen to \"hallie's song,\" then you'll understand. anyways, everyone vents but not everyone has the same resorces as eminem does, he's a famous rapper for god's sakes. \n\r\n so what if he says things are gay? so do i, so do most people. it doens't mean homosexual when i use it (i know homosexual people, excuse me.). it is simply an insult. yes it came from homophobic origins but it's changed. like how black people use the n-word. \n\r\n he's obviously not homophobic. he hugged elton john, who is openly gay.  i don't think eminem, who's pretty dang insecure about his manhood, would do that \"just for show.\" \n\r\neven if this song is fiction, alot of us can relate to it. like people relate to books or stories. that's what eminem's songs are, stories. \n\r\nalso, please don't write back to this post with stupid comments like F@#$ you, thanks. \t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\ni never used to like Eminem  i used to think he was messed up but like his songs are so meaning full and like now you kind of no why hes messed up but i feel sorry for his mum she has all this shit like him sayen all this stuff how do we no its true whatever  thought i love this song and keep up the good work Eminem \t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\ni think eminem sucks, i can't stand this non sence\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\ni love the song, and a couple other eminem ones, but in my opinion, ppl shouldn't feel sorry for him. i mean, sure, he had a tough life and that sucks, but everyone's life is hard. i mean, he lived through it to write/sing about it and now he's famous and rich... think about it.\n\r\nand for everyone who's saying bad stuff about each other, and everyone who's gonna say rude stuff about me cuz of what i posted -- people are entitled to their own opinions!\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\neminem does the most powerful lyrics and this is a perfect example.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nhow long is this song? i wanna download it but im not sure which one is the right one?\r\nyou cant help but listen to the lyrics now.. Eminem is def. getting better\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nBTW: for all the peeps waaaaaaay up the top, munchausens syndrome means only his MUM made herself sick (to get sympathy), if she made the kids sick, it would have been Munchausens syndrome by proxy\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nHey... I usually dont like Eminem, but I have to give him all respect for his songs...WHY?? Because he doesnt care... We dont have to many artists out there like that  and especially this song... His mom obviously put him through a lot of shyt... and thats the truth, but like he says in this song... she thinks she was a mom, but to him she was nothing... Eminem is tight we just have a lot of haters out there!!\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nmunchausens syndrome means the victim intentionaly caused themself to be ill, munchausens syndrom by proxy means that you caused another person to be sick, so maybe when he says he was a victim of munchausens syndrome he is actually saying that he was being forced sick, and the proxy party just doesnt sound right in the song cuz it says he was made to believe he was sick....\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\ngood song\n\n\n", "comment_82": "\nMunchausen syndrome, also known as factitious is a psychological disorder in which the patient fabricates the symptoms of disease or injury in order to undergo medical tests, hospitalization, or even medical or surgical treatment. \n\r\nto answer all yalls questions bout Munchausen's syndrome.\r\nand to the girl that was dissin ppl bout what kinda music they listen to...nobody cares what you think.  nobody knows you and you're not making an impression on anybody.  it's pointless.  you're not gonna change anything.\n\r\npax to everyone else\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nthis song makin me so... eminem just told his mother what he thought when he was a kid \t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nI like this song but since when eminem make excuses to somedy? Is this song honnest or just a lyric like an other? :S\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nin the video clip, why there are more than 1 holes ? i'm not thinking bout he chop his mom into pieces.... but.... ah hell !!!, maybe i'm just overthinking \t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nSELIKA I TOTALLY AGREE WITH YOU.. U CANT TELL IF THIS SONG IS REALLY FOR HIS MOMMA OR IS IT ANOTHER ONE OF HIS GREAT LYRICS.... I LOVE EMINEM! HE IS SO0O0O CUTE AND IS A GOOD *WHITE* RAPPER! :-D\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nThis song kicks alot of ass, and i can't believe some people still want to diss marshall over it *grrrrr* hes just telling it like it is and its a hell of alot better than rapping about ho's and sex and how hott u are......woohoo nobody cares.....this song is by far my favorite song by em, hes so talented *and hott* :D\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nDA SONG IS ON RITE NOW\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nmoment of truth by gangstarr best song ever sorta similiar in mood to this song i recomend downloading it or buying the cd \r\n            matt\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI agree with SleepyGurl13!  Does any1 watch much music...?  Well 1 day Rainbow was gunna play this song and was like \"this is a good rap song compared to all the others because eminem says how it is and raps about real life and a lot of the other rappers just rap about what they have around they're neck!\" it's true!\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\ntorrente if ur gonna correct every1 spell his name right...damn...it's MARSHALL!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nI dont no why so many people in the media judge Eminem, sure hes a little rough around the edges, but they should stop trying to figure out why he sings about the things he does. He has his reasons and thats all the public needs to know. he even says it himself \"See, they can trigger me but they never figure me out.\"  people should take the freakin time to read his lyrics and they would see what he has been through...like in this song,\n\n\n", "comment_93": "\nHeya!\r\nHmm...\r\nI think Eminem got lotsa problems and need therepy (And I don't care if you guys disagree, he does!), but \r\nhe still manages to create good lyrics.\r\nWell, most songs are writting from bad expierences i gues...\n\r\nAnd by the way, I think this is his best single yet!\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nEminem should buy one of those shirts that say \"I have issues\".\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\ni think the fame and all that really doesnt mean a lot to eminem, i mean, people can have a lot and still be upset by things that happened to them, money and fame really isnt everything. this is a really good song, and the video's really sad. it's really powerful. i like how eminem sorta has his funny side, and his more serious side. it's sorta like slim shady's the funny guy character he plays, marshall's the serious one. yeah, he does need some therapy, but i've been to therapy and it doesnt help much. i think his rap's sort of self-expression for him, and i really like it. awesome song, but i'm surprised it was a single, it seems a little too serious and personal to be one.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nFame dosnt mean that much to Eminem?? Fame is all Eminem is. He is a fool.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\ni just want to say that if you dont like eminem, what are you doing in here reading his lyrics and talking to all of us who DO like him? i realize he makes some things up, but its possible that most of this happened to him. i admire him for being able to say everything he feels. and doesnt every artist do things to make up \"eat it up\" to make money? eminem gets all the greif because society is afraid that someone finally stepped out of line, and speak all the things that society thinks is inappropriate to say. how is rapping about fucking hoes and bitches appropriate? society puts up with that. and last, if you dont like eminem. dont listen to him. dont come in here and bitch at those of us that do. its our style of music, and if you dont like it, we arent gonna care. as long as you dont come in here and put down the things that we like and mean something to us. \t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nEver heard of publicity stunts? Or Corporate backing?\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nall i got to say is this shit is tight but yall need to get the lyrics right fo real aight im out..ONE\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nThis song reminds me of my life. Makes me wish I had the power to say and speak up when things are getting real bad. He's not dissing his mom. He's letting her know, all his skeleton's. He's letting her see what it is, that she showed and did to him, when he was younger. He's probably trying to get her to realize what it is she did, that caused him to retaliate(sp?) the way he is. \t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nMunchausen is a mental disorder where a parent will  literally harm thie child to get attention, I have seen cases where the mother will put  poison (usually just enough to  make them sick) in their food, or  they concoct wild stories about of  strangers attacking and inflict  injury on them (I personally saw this in someone we once knew, a man dressed like a ninja supposedly opend a  door in a hallway of this persons mobile home and  grabbed her daughter trying to yank her thru  the opening   left where the chain was on, hence sneding her husband from work and family all running to  her aid.)\r\nIn the video, you see  the mother pouring pine cleaner in the kids cereal. This is a very good example. I have little doubt Mathers suffered  some kind  of abuse/neglect as a child, he is far too in touch with anger and  other emotional issues in his lyrics not to have been. There are some things you just can not fake, and thisis one. A for his mothers cd, lawsuits, etc, she should be ashamed, you know if you were a bad mother at least own up to it, instead of abuseing your child even more thru the legal system and music industry. Thats exactly what she is doing,  he has cut her out of his life, so she is using whatever she can  as a weapon. I have heard the dear marshall song (downloaded of the internet, haha), and  masicly she is  playing the concerned mother roll and  not understanding why he feels like he does, as if to convince the world her son is  the one mentally off. Mathers  appears to be, at least in my opinion, a very intellegent man, and  wounded in ways that may never heal for him.   Especially when family  seem bent on picking the scabs.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nYeah, sure. M means whathe says, \r\nbut that doesn't change the fact that he has unsolved problems, and need help...\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nhe really neads help i think, I feel sorry for him but...I JUST SAY \"FORGIVNESS \"\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nthis is a very powerful song it is much better than without me, i think he is trying to say he didnt want to hurt her etc. but he needed to get it off his chest in a way or get his revenge and let her know how he felt\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nit is in deed a MASTERPIECE, i  think if his mom sues him on this one i will shoot her or somethin i think he is sincere on this one, i think he is really bringin the shit from his heart and i think every song that eminem write is like a story we go deep and deep into his life and i think this is one of the best songs ever, i think EMINEM really proved he is not just a stupid white boy who writes shit just to make people mad, when you read or listen to this one i think you feel what he feels, i think eminem just....ROX....man, i think he is the best of the best....he feels it and has the talent to put it all on paper...like i said a true MASTERPIECE\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nok i love this song right. well the thing is, in the music video, it shows him, well filling in a grave, but yeah i think maybe its symbolic because wouldnt make sense because he wants to wash his hands of her and not let her bother him anymore, right, i mean if he was trying to say that he killed her thats all good, she is a stupid bitch, but i just dont think it goes with the messege he wants to get through about cleaning out his closet, washing his hands clean. i dont know maybe its just me. someone clarify for me please.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\ni think the grave means he is burrying all the past shit on it and leaving it behind so he can rest his mind and his mom stop with all this nonsense, i think EMINEM doesn't mean by filling the grave that he had killed his mom i think it means that he is leaving everything behind his back IF SHE LEAVES IT BEHIND TOO, i mean, i think the grave is like \"hey mom i will try to forget all the bad shit and bad feelings ya gave me if ya stop sueing me and trying to take from me what you never helped me to get, is like i only want to give Hailie a better childhood than i had and if you take my stuff from me only coz you don't want to see what's in front of ya, it is selfish\" i think he talks about Hailie on the song coz he want to make clear for his mom and for everyone that everything he does is just to make sure that his daugther will have a much better life than him...\r\nWhat do you think of my opinion??\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nthis song is deep.  people are out there hatin on eminem but they dont even have an idea what its like growin up in the hood.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nThis song is the best song by Eminem so far, apart from The Way I am. I can relate to both of these songs, especially this one. I mean, when I was younger, my baby sister died, and my dad started hitting me, and saying \"Why wasn't it you who died? I've never loved you\" and shit like that. I was too young to understand what was going on, but what I do know is that I know how Eminem feels. I've gone through the same shit as him\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nI dont really like Eminem but this song is pretty good!\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nthough i'm not a big eminem fan, this song is really good. it's great to listen to it whenever i'm angry or just feel like releasing some anger. as people have noted before, his lyrics are very, very deep.\n\r\n\"You selfish bitch, I hope you fuckin' burn in hell for this shit. \r\nRemember when Ronnie died and you said you wished it was me? \r\nWell, guess what, I am dead. Dead to you as can be.\"\n\r\nvery powerful. it's horrible to think that some kids have to go through things like this.\n\r\n~katie \t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nCan't say I like this song.  It more disturbs me than anything, and it doesn't really sound good, IMO.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nthis song is so great, he speaks his feelings, not many rappers can do that. so many ppl hate eminem for his gay hating stuff, but if u listen to what hes tryin to say ull know shit bout him\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nomgsh eminem is the best artist out there he will be around forever n remembered forever!! he has made a new kind of music hes amazing and pure genius...no1 else can write lyrics like him hes sucha talented artist i luv him!!!! his concerts r sooo rad ive been to so many...hes different from other rappers tho other rappers talk about like sex, n money n stuff, which i dont really care but eminem talks about his experiences in life...which is really a bummer he had to go thru that shit he deserves everything good!! hes worked so hard to get where he has been n its amazing how he turned his life around n proved to his mom hes not a fucking loser like her!! (not that i kno tho)..but yah..hes the best out there n his vma performance was rad n moby should fucking die n go to hell!!!!! hahaha SUCKER....\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nomgsh eminem is the best artist out there he will be around forever n remembered forever!! he has made a new kind of music hes amazing and pure genius...no1 else can write lyrics like him hes sucha talented artist i luv him!!!! his concerts r sooo rad ive been to so many...hes different from other rappers tho other rappers talk about like sex, n money n stuff, which i dont really care but eminem talks about his experiences in life...which is really a bummer he had to go thru that shit he deserves everything good!! hes worked so hard to get where he has been n its amazing how he turned his life around n proved to his mom hes not a fucking loser like her!! (not that i kno tho)..but yah..hes the best out there n his vma performance was rad n moby should fucking die n go to hell!!!!! hahaha SUCKER....\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\noh yah im gonna c his movie 8 mile like a million times w/my friend lizzy its gonna be the best movie.....n its the sweetest thing how much he cares for hailie!!\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nholy shit!! eminem is the besttt!!! i swear .. his music is the best !!!! he is dead sexyy!! and kitty192 ur right moby should die and goto hell hahaha ... that thing on the vmas was funny .. moby waws soooooo scared hahahaha!!!! eminem works really hard to get where he is!! hes the best ever!!!!!! and im gunna see his movie 8 mile run with my friend catherine\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nd***! i luv this song toooo much. singin it all the time! eminem rawks. ima be 1st in line to see 8mile. em is soooo fine.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nMy parents didnt let me listning to Eminem so the only way to here his songs was on TV or download em. So when i heard this song i thought it was one of his best! ^_^  i love the lyrics very powerful\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nSilverdragon, your parents are geniouses\n\n\n", "comment_121": "\nKitty192, My dog's shit can write better lyrics than eminem\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nrofl, i'm with everything you've said so far XConsiderateKillX and to the rest of you, wanna hear some decent music? Listen to System of a down, awww yeah, theres some decent lyrics/music for ya'  X-)\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\ni hate rap. always have. always will. i'm a total hippie in every sense of the word, but i just wanted to say that eminem has so much lyrical talent. when i hear his lyrics it amazes me the way he can just keep all of the emotion in those words flowing the way he does. he's a rapping virtuoso and just because i don't like his music doesn't mean i can be blind to the talent he has.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nHere's my question..... Doesn't he realize that his daughter is going to grow up one day and listen to all his songs, and the mentions of killing her or her mom? Wouldn't that fuck her up to hear! And also... there are a lot of people who grow up in bad situations.... but most people get over it and live thier lives..... i just don't see why Eminem has to bitch all the time....\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nHere are my answers.... His daughter is already screwed up. I mean, how couldnt she be? Since Eminem has money he can say whatever he wants, whenever he wants, and there will always be that group of people that do everything because MTV says its cool. So as long as MTV likes Eminem, all of the feble minded youth of america will too.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\n\"My parents didnt let me listning to Eminem\" Silverdragon you really know how to write sentences..and besides he sucks and yes his parents are very smart for not letting you listen to such shitty music..Rock On'\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\ni don't even bother listening to this one coz i'm lazy. \r\ni'd hate it anyway, Em is exaggerating too much lately. But it's gotta be better than Dashboard Conf. and his holiness Mr Chris Carrabba, who we all thank for his musical genius. *argh* \t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\noh and i like Moby. *grin*\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\n:D :D :D eminem rules!\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nHave you ever been hated or discriminated against? \r\nI have, I've been protested and demonstrated against. \n\r\nOH REALLY?! have you? Lemme ask you a question then Eminem.\n\r\nHave you ever hated or discriminated people who's race, religion, age, sex, or dieitary habits is different from your's to make money? Yes. \n\r\nWhy is he wanting pity? When he chose to life his life discriminating everyone. He is just like Hitler, the Perfect being. And it's working too, soo many kids conforming to his styles and way of life. \n\n\n", "comment_131": "\nloves punk..what the fuck you like punk but yet you love eminem your a loser..and sk8masta is so amazingly true...Eminem sucks and he is excatlly like Hitler...\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\ni dun like eminem kuz he aint doin ne thang dat haznt bin dun in rap or in ne other kinda muzik........bak in tha dai public enemy was jus as contrivercial an nwa was bein monitered by tha fbi fo der songs.......2pac was mo controversial still......eminem gets his spotlite kuz hes wite an iz loud not bekuz ov his ability to rap......like alot ov other rappers he xagerates his past an bullshits around by sayin hes gonna kill sumbody or watever its jus dat sum ppl bought into dat shyt kuz dey think hes hot or kuz hes wite......he kud b a great lyricist if he wud change tha fukkin topiks ov his songs an spoke normally like wen he went wit jayz on renegade......he kud b one ov tha best rappers ever but hes to buzy komplainin dat ppl hate him or out to get him or dat hes mom was a ho 25 years ago.....until he kuts dat bullshyt he'll b fergoten as soon as each an ervy single frum his lp iz realsed an overplayd........wens hes not kompletely controversial his shyt jus duznt sound gud.....remember d12? em's gimmick iz hes a wite boi bad ass but its as fake as his moms tits\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nSpeak english muddafucka.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\npunknemo shut up. please. You are being a mall bred emo fuck who labels music TOO hard. if you are like 99% of the people who would give something similar to your response, you probably don't even know what emo is.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\ndude, can that guy even read? lmao...the things in world ya didn't even know about :)\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nhey emo, I wasn't bashing you, and emo is great..but people like different things. It doesn't mean they suck because YOU don't like it. im me sometime at \"starsfallforus\" if you want. we can trade some bands if you want.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nHim is this about his mom? Or himself?\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nPunknEmo12 and sk8masta- he is NOTHING like hitler. that's sickening, you're comparing a *popstar*(scuse that term) to a sick twisted freak who spurred thousands of OTHER sick twisted freaks and had the thought that hey, it was cool to kill and torture thousands of innocent people just coz they were a little bit different?it doesn't compare. if you were GOING to compare him to anything like that, it's \"nazi sympathiser\", which he isn't, he's never been as freakishly disturbed as hitler.also, he *has black friends*.he's not going to be a neo nazi.i'm not flaming you, it's just that's a pretty horrible accusation and i don't think you thought it through.\r\nthe disease that he's talking about,Munchausen's, it CAN lead to death in severe cases, so it is serious to all those who seem to be dismissing it- overdose on prescription etc. kill the victims.and they do it- by proxy-usually because they don't feel like they're a good parent if they're not taking care of someone who's sick, so they make them sick....it's twisted, yeah. \r\nand he's talking about how he won't let her see hallie, at all, he won't even let her go to her funeral etc.- i think it's intelligent that he doesn't want to expose Hallie to her. and i think his mum's probably more insane than him by far, he's just got issues, more than some , but not the kind his mum's got...she might not even think she WAS a bad mother because of Munchausen's, it might be hurting him that she's still got that state of mind.He might be thinking that now she's just being a hypochondriac when she's blaming the disease, it would be pretty hard to believe abuse wasn't actually the person who inflicted it's own doing and fault.\r\n\"See what hurts me the most is you won't admit you was wrong, \r\nBitch, do ya song. Keep tellin' yourself that you was a mom. \"\r\neven though i'm pretty indifferent to eminem/marshall, or most hiphop, this song's really good and unlike alot of songs, not just rap-pop, rock, everything- it has some great, moving lyrics and a great beat.it actually sounds like he's emotional throughout the singing of this song.i think it's his best yet.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nsorry i didn't mean to make that post ^^ so long,it's practically an essay.also i wanna say i totally agree with Rayray49 from waaaaaaay up on the posts.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nyep, me again, i realise that the fact that he discriminates could be the only thing that resembles anything like hitler, but everyone discriminates, just not in the public and international arena.or on as many topics.\r\nand again, please excuse any ignorance in my longest post ever, i wrote it in like 5 mins, and being hypocritical didn't really think that some of the sentences made sense....i'd retract it if i could, actually....\n\n\n", "comment_141": "\nthis song is so damn tight! esspecially that he dissed his mom! i do the sam thing sometimes! I love Eminem!!!!!!!!\n\n\n", "comment_142": "\nfirst off let me say that his moms first mistake was giving birth to a worthless whiny-ass nontalented piece of shit, number 2 you would be taking pills too if your kid was a fuckin loser\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nwtf are you talking about, hardcore...?\r\nfirst off: there is no excuse for someone to be how debbie was to marshall..and second: loser? oh please..earn how much does and then get back to me!\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nwhat couldnt quite understand that, but i guess if i was a fucking sellout i could make some money too, fuck rap punk rock runs this world, have you ever seen eminem live, and if so what the fuck do u do there um smoke the reef, stand around, nod your head like a gansta, doesnt sound to fun to me id rather be in a pit\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nokae. dont people know how to freaking type words anymore? dru_g , take some english lessons please..\n\r\nim mostly into rock, punk, and all that.. i HATE rap. its all about \"niggas and hoes\" and its just stupid.. but i like Eminem's new stuff. im open minded when it comes to music.. i like music that means something. and stuff you can relate to. i cant personally relate to everything eminem raps about, but its real. hes not talking about all his money, and \"bling bling\". what in the hell IS bling bling, anyways?  anyway, theres people on here that only like punk and emo or whatever, but come on. have an open mind. give this very song to someone else, in the punk/rock genre and i guarentee you, they could pull it off.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nyeah i agree some of eminems songs r decent but rap in general sucks dick\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\n*Going through public housing system, victim of Munchausen's syndrome*\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nsk8masta is more on target then the rest of you combined.  While I'm not in Eminem's head (thank God), I have a feeling much of this is embellished.  I think he made this song partially because of the terrible relationship he has with his mother, but, more importantly, because he knew what lyrics he had to write to have an effect on people, and he knew he wanted to make a song to show how supposedly bad his childhood was.  The majority of you here reacted to the song exactly the way he wanted you to when he wrote the song.  Perhaps that's ok; perhaps I'm completely wrong and it really was this bad.  But I don't think he has close to the depth and integrity that this song seems to reveal.  While many people are much more obscene than Eminem (Slipknot anyone?), no one else exploits a disgusting amount of misogynism, racism, homophobia, the list goes on, to make money.  He has some good songs, but some just flat-out disgust me.  \t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nIs everyone on this site 12 years old?  I mean fine post what you want to say about the song, but theres really no need to attack the artist personally.  I do a lot of writing and i respect him as a lyricist though i wish he'd chosen another genre of music to put his talent into.  But anyway, I just wanted to say that i find it utterly amazing that people post comments three or four times just to argue with each other, my advice to you people is to get a job or discover the world outside of your homes.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nhitler ;) , wierd .. i posted and started a war last time .. they deleted my stuff , but anywayz i guess the only way for my post to stay is i say eminem rules!! ... but honestly , yeh , i like this song for its meaning ...it talks about how screwed up his mom is etc. but all the songs mean almost the same things , they should post ''eminem'' then have everyone put the meanings ....\r\ni hate eminem !!\r\nim just playing i luv u eminem .... hahahha Edited by random_monkey on January 28 2006, at 12:56PM\n\n\n", "comment_151": "\nI can't believe how childish some people are, there's no point in searching for artist's you don't like and just slag them off. If you're gonna look for an artist then at least say you don't really like them but the song you're posting on just touches you or something. I don't like Eminem but I think this is a great song and he is expressing his feelings to the public. And if this stuff hasn't really happened to him then maybe he's just trying to help the people that it does actually happen to.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI searched for this song cos I heard a bit on the radio and thought that maybe Eminem was actually apologusing to his mom for treating her like crap. But no, he's obviously just writing this song out of spite. How can people not see how wrong this song is? She's his MOM. She raised him. If he's so proud of who he is today, he only has her to thank. And if he's not proud of who he is today, he can't push the blame on her, he needs to make some changes. I think that Eminem is a sick man, not just for writing this song, but for all the others as well, and it makes me sad that people can sing his praises after reading this tripe.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nrap sucks and eminem can kiss my ass\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nman this song is so great, i normally dont like rap, but i like eminem, i like that he says whatever he wants..this song is really sad if u read the lyrics. one of the liens that gets me is - \"Remember when Ronnie died and you said you wished it was me? \r\nWell, guess what, I am dead. Dead to you as can be\"\n\n\n\n", "comment_155": "\nI think that this song is another good example of why white people shouldn't rap.  Especially if they can't write decent lyrics to begin with.  Get this crap off the radio please.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\ndarkiris take those X's off your name, you may be sXe, but the music applies with the action.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nThis song is so powerful, exspecially the video. But is eminem suppose to be burying his mother????\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nAm I the only one who thinks this song is hilarious?\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nthis song is about the willow tree that once frew behind slim's house, back home in maryland.  as a young child, he would swing from the branches of this large tree as a way to get away from his parents who would touch him.  as time went on, the tree got cut down, and so did slim's pride, which made him start writing music like this.  some say it is also about his regular heroine use, along with how he used to molest small children during times of depression in his life.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\n : what makes you think that this song is hilarious?\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nLol! Another piece of commercial trash. What's this world coming to? By the way, I'm only here to read all the funny comments about how shit Eminem are, which they are.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nThis song is wicked as. The lyrics are one of the best I've heard by Eminem. This, Hailie's Song and 'Til I Collapse are the best songs off the album\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nElectricPinkPanther is right , he tells poeple off then says cry for me...this song doesnt have ground breaking lyrics and it isnt really powerfull at all . Eminem knows poeple hate him and the whole i stick my finger up at the world is something my 6 year old niece would think is kool . Come on , cant you people  see how eminem isnt such a big deal .just manufactured pop hits that prolly have been stolen from older songs he grew up on . i was born in 82 and i have heard rap songs with more talent and creative lyrics than this  stuff , also dont you notice all of em's songs sound the same or have the same meaning behind them . Now we have 50 cent who sounds like hes about too fall asleep when he says '' go shorty ittttssss yuuuur birthday''' ***yawn*** . Rap/Hip Hop is in dier need of some ''real'' artists . Im also noticing this ''bling bling'' bullshit , the ''look at my money and me standing in a club with girls''  , where did the soul of hip hop go or rap's stories that made you actually think . Rap/Hip hop is getting waterd down and commercialized . These new artists are whoring the music for money and you all are allowing it by keeping them around and giving money (cd's ,clothes etc.)  there are so many underground artists who deserve too be known since their music is from the soul .\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nEminem best raper? he uses the same words again and again to rhyme!\r\nalso he has been caught cheating in freestyle battles, if he was so great he wouldnt have to cheat!\n\r\nNIKKIE, real artists are out there, you just gota know where to look\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\ni absolutely love this song. it's great. i really think eminem puts himself on the line in his songs and this is a perfect example. it probably hurts to put painful memories in the public eye. eminem is super-talented and he's not afraid to be different than the rest, with all that \"blingbling, me and my hos\" shit that seems to have become the focus of so much rap nowadays. besides, have you ever seen another rapper who would actually dress up as richard simmons or a cactus for a video? this song is really from the heart and i respect eminem for this.\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\ni absolutely hate this song. it's pathetic. i really think eminem puts himself on the toilet in his songs and this is a perfect place to shit. it probably satisfie to put painful memories in the public eye. eminem is a jointress ,  and he's afraid to be different than the rest, with all that \"blingbling, me and my horse\" shit that seems to have become the main subject of much rap nowadays. besides, have you ever seen another necrophiliac who would actually dress up as richard simmons or a cactus for a video? this song is really from the grave and i respect eminem for fucking my dead grandma.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nEMINEM'S FUCKIN' GAY!!!!!!!!!!!!!!!!!!!!!!!!!\n\r\njust jokin'\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nyou guys are all ignorant if you guys can't see the lyrical genius he has..ok i don't even listen to or like rap AT ALL...but i think his 'flows' are like modern poetry..he's really brash and direct and probably has anger management problems but that doesn't make him a bad person! ok yeah he calls girls \"bitches\" and \"whores\" or whatever but that's because he's angry and you guys sure as all heck know there's ALOT of girls who definetely deserve to be called those names. i like him just because he doesn't care what people think..he sure as all hell knows his lyrics offend people but he's not going to conform to make people happy. he's expressing his emotions and his opinions through his music. so for all you guys who think he's a \"bad person\" for thinking this stuff you guys are probably stuck up ignorant vain naive and selfish children who never experienced life outside the white picket fence and brady bunch issues.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\noh yeah and as for the race issue..read the lyrics to \"white america\"! race issues and other discrimination isnt only against blacks or gays or whatnot..it's just whatever is the minority..obviously if you're a white person living in oakland or harlem or whatnot you're not going to have the best experience since i'm sure the \"majority\" over there will discriminate against you for being different.. same thing with eminem trying to break into the rap music industry but always getting shot down because he is a different skin color. besides you can NOT  \"act\" a race..that is just the most sterotypical thing i've ever heard. so if all black people are \"supposed\" to speak ebonics and dress in fubu, why dont you explain the black people in england or france? just because you're a certain skin color doesnt mean you have to act a certain way! THANK YOU!\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\noh yeah and another thing for all you \"PuNk RaWkErs\" you guys piss me off...some punk has the same lyrical content as eminem..take glassjaw for example..one of my alltime favorite bands! daryl is so talented and writes really anger ridden lyrics against his ex-gf and calls her a \"fucking whore\" much like eminem..it's all about expressing your feelings! yeah you guys probably don't even know glassjaw since you guys are too busy listening to good charlotte and simple plan or some other of those teenybopper pop music they try to play off as punk.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nI really like this song...it had to have taken a lot for Eminem to reveal such persnal stuff like that to all of America and I respect him for that. This song is very intense and powerful, kind of makes you think.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nUmmm.........u guys....this is songmeanings.net not bitchaboutartists.net!\r\nI just read through 167 comments but no one actually seems to know what the damn song means!\r\nAnyway, I'm really intrested....what does cleaning out my closet mean. I guess it is a metaphor but for what?\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nCleaning out my closet means that he is letting his past out...getting rid of old memories and moving on. He's letting old memories surface so he can get rid of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nI can totally relate to how Eminem feels about his mother. Ive had some major issues with my mother, causeing me grave pain and mental abuse. I hope she dies!\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nheres my rap: \r\ni wish i could make money\r\nby writing stupid lyrics \r\nits funny\r\nand wear baggy clothes \r\nand call my women hoes woot\r\nim sorry momma\r\ni never ment to take a poo\r\nthe smells gonna make you die\r\nso tonight, im cleaning out your toilet!\r\nwoot woot nigga woot woot woot woot woot oooh ooh! woot huh? what? woot? uh?\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nrock on Blind rockstar & hybridpunk271 Peace\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nWhat i cant understand about eminem is he lived with his mother till he was in his mid-twenties.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nWhat i cant understand about eminem is he lived with his mother till he was in his mid-twenties.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\neminem is all talk. he's a pussy who whines about his mommy all the time. awwwwwww poor eminem. he needs everyones sympathy. awwwwwwwwww\n\r\nlets all show some sympathy for eminem. hes gone through so much....\n\r\nyeah ok, whatever. this guy is a disgrace. he seriously suffers from a mental disorder. he is fred durst times two. how can anyone respect this guy?\n\r\nif you want to listen to some real music, listen to some of the punk bands out there right now. they actually play their own instruments!!! oh god, i cant believe they actually play their own instruments!! that is unheard of.\n\r\nif you are insistent on listening to your rap crap, then at least listen to some rappers with a positive message. not some mentally handicap rapper who whines about his \"poor\" life and threatens to kill and rape his mom. that is sooooooooooo mature. GROW UP EMINEM. OPEN YOUR EYES.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nhes a fagget thats what this songs about! fuckin white boy tryin to be black dumb ass\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nthank you omegusprimer, you just proved my point. eminem does suck and has a horrible influence on people. look at ur post! do you know how to speak english? if you cant present your opinion in a way that people can understand what you are trying to say, then dont even bother.\n\r\nand by the way, ALL punk bands (and rock bands) for that matter play their own instruments. and they actually write the music too. do you think eminem came up with the instrumental parts behind his songs? of course not! someone else did it for him. he just slabbed a bunch of hate-filled ignorant lyrics together and rapped to a beat.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\neminem is a faggot\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\ni used to like eminem but now i think he is just annoying. the thing that irks me is he's a hypocrit and you know, just because a lot of people discrimminate or say discrimminating things that doesn't make it right, which is what ignorant people seem to think and that is why it's accepted as ok in society. and that is so stupid how people say something is 'gay.' but don't get me wrong, eminem has talent. Is the best m.c? well, that's debatable. but he says all this shit about people and then whines about people being mad at him. i mean, what does he expect? and why is he still complaining anyway? he's just another whiny celebrity. but it sells him records so you know, good for him. and if you like him then, whatever floats your boat.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nthis song is about eminem coming out of the closet because hes truly gay but he does not want to say it directly.  He also has a small penis, trust me.  Poop.  Brett Concilio pooped on a rug and stepped in it.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nall of eminem's song's are really really deep, but this is one of the deepest. (the way i am is deeper, thou) but em's startin to annoy me. i mean, if his mom is ALL he has to complain about, then he is really kinda a..i dunno. hes a great rapper, though\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nthis song is obvisuly about marshal coming out of the closet. he sees his mother havin sex with other woman in the closet and now he wants to come out and have sex with other men. god eminem you used to be good now your a friggin sellout homosexual go back to amittyville like songs you flamin homo sexual\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nthis song is obvisuly about marshal coming out of the closet. he sees his mother havin sex with other woman in the closet and now he wants to come out and have sex with other men. god eminem you used to be good now your a friggin sellout homosexual go back to amittyville like songs you flamin homo sexual\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nthis song is amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\numm..................its ok but he kinda sings more than raps in this one ill give it an 8 outta 10\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\ni love poop\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nReally good song, showing enimen's deepest emotions\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nRap sucks it doesn't even have good instruments if you want real music listen to real music like led zeppelin you jerks.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nRap sucks it doesn't even have good instruments if you want real music listen to real music like led zeppelin you jerks.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nYEA, Zeppelin Rocks, oh yea this song to me means he's coming out of the closet.  He's a flamer.  It's not that hard he comes right out and says it in the title. eminem is gay,yea yea yea, he likes to eat hay, yea yea yea, and he like to play, yea, with dick.  Damn, I could be a rapper.  Where's my Bitches at?  Gimme some of dat Gin & Juice, I'm bout to bust a cap\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nEMINEM JUST SUCK SOOOOOOOO HARD!!!!!!!!!!\n\r\nDAMN ASSHOLE\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nWas juz browsin thru the site, checkin' out discussions bout song meanings. When I came to the end of this post, I was like WTF??!! Doesn't the website give you a clue, you sad losers?! We're here to discuss songs meanings, the music and the artists or whatever. At least people who diss this song are still on the right track. But the postings of those lame ass bastards above juz goes to show how many pathetic wankers there are out there. What? Do you get off by posting anti-Eminem messages randomly? Man, you guys are so sick I wouldn't be surprised if that's REALLY the case. Pathetic sad ass wimps.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nwhat the hell is cleaning out my closet?\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nHey, I want to not take responsibility and blame my MOM for everything like ol em here.  I can't be a man so I'm gonna blame my mom.  Grow up em, just grow up some.  Hey, here is an idea.  Why not write some real lyrics\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nYou mean to tell me that an eminem song actually has a meaning? BS! I'm surprised most of you people have enough intelligence to interpret it in some retarded sort of way.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nHey Ongyujian,  I must apologize for be a pathetic sad ass wimp but I will not apologize for being sick and a wanker.  It just so happens that being a sick wanker is only the true way to go through life.  I'm surprised you haven't figured that out yet.  May God take mercy on your soul.\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nyou guys are fuckin retarded...i agree with Ongyujian.  We're not here to bitch and complain, we're hear to discuss the song.  Which, by the way is a great song.  I love how em says how he feels and doesnt give two shits about you immature fuckers that sit here and diss him for  no other reason, than this just isnt the music you like.  grow up.  em kicks ass, as does cleaning out my closet...FUCK JA AND ALL THE JA FANS:::HES A MFIN GANGSTA WANNABE AND THATS ALL HE'LL EVER BE!\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nOkay, for one, you guys do know that there is a \"g\" at the end of the word \"fucking\" right?  Ablyss16,  does your mother know you use that kind of language?  By the way, I do take offense to being called a fucking\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tirish_deftone6on November 29, 2004   Link ", "comment_203": "\nOMG u guys are such losers DUH u guys come here to talk about eachother losersi dont like irish ppl but anywayz the point is that Eminem is sexy + hot and this song talkes about him that what his mom did to him..Luv ya em burn in hell irish because god doesn't like you.I do agree with ablyss16 ;).\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nI'd just like to say that all those sad \"punk\" and rock comformists up there who think it's cool to be anti-rap should just shut the fuck up and keep crying about how much the world hates them or how much they hate the world.\n\r\nNothing will ever top rock for me, whether it be Rise Against or Guns N' Roses or Good Charlotte or whatever, but I have to say it's quite pathetic if you don't give other music a chance.  Trust me, I use to be all \"ooh rap sucks\" but I gave it a chance, and I have officially bridged the gap between rock and rap as far as my music taste goes.  Now, I understand that some people are less open-minded than I am, but please.....I love Eminem, but what really made me see the light in rap is artists such as Talib Kweli and Immortal Technique.  It is possible to like rap and rock at once!\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\ni really like this song because i know so many people who can relate to what Slim is saying, like my brother for instance he jsut came out and told my parents and his friends that he was gay, and it was really hard for him.. but he decided to tell everyone because this song came out, i still LUV this song\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nHow can you call this fucking shit music? And ALL tha fucking (c)rap?\r\nThis is just jeking off . This ain't music you idiots.\r\nIt is just fucking jungle noise.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nMY GREATEST RESPECTS GO OUT TO MARSHALL MY MAN, COS NOT MANY PEOPLE CAN BE SOOO OPEN BOUT WHAT THEIR CHILDHOOD WAS LIKE!\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nVivadisco: \"How can you call this fucking shit music?\"\n\r\nEasy, it's called being \"open-minded\", bitch.\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nwhat the fuck? who fucking cares if 'ja' dies? this isn't fucking music. music has instruments and talent. this fucking shit is just some ass hole talking. he doesn't even make his own beat. oh yeah, that sure takes some real talent, to be able to ..you know..talk and all. and while 'open-minded' is a decent argument for why this crap might be considered music...music is supposed to have instruments! you know, like..a guitar? or a fucking flute. but not this violent, stupid shit. you fucking ass holes. and parents wonder why their kids are all wearing bandanas and stabbing kids in school. fuck you. i hope your kids get raped.\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nhey dude. i think u better ease off those E's. or whatever shit ur smokin. coz its really messin ur senses up. you sound like some 80 year-old mormon preacher. parents whose kids wear bandanas n stab other kids in school are the ones you should be directing ur 'fuck yous' at. true, em's music is violent. true, you may not like it. but so what. he has his fans. and as long as he sells, you're juz gonna be a pathetic sad ass wimp ranting your mouth off ... ironically, on a website on song meanings in the Eminem section. look who's having the last laugh now. and dun throw me your bullshit freedom of speech right coz that's like the loser's motto. btw, great definition of music. im sure you are a man of immaculate taste and high morals judging by your preference for the fuck word. u know what. im not even gonna go there as to insult you. coz frankly, dear, u already did that for me wif ur great anti-em speech. im sure many of his fans who are matured enuff to understand that its JUZ a song will be brainwashed into not buying his CD coz you juz said its 'not music'. wow, great masterplan dude. finally, i'd juz like to see how your kids turn out.\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nHey kzazy baby chick, Speak only when spoken to.  When you hear grown up's talking, shut up.  Pay attention in school and maybe, one day, you'll say something that actually makes sense.  Call me when you grow some tits.\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nFalldownmarigold, you make your last statements as if I'm anything like one of those bandana-wearing kids.\n\r\nI am open-minded, and therefore I listen to almost everything.  Sure, Eminem isn't the greatest talent in rap.  Immortal Technique is amazing.\n\r\nRock is still the best thing in this world.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nall the good coments have sudenly gone down. his mum is uh.............that eminems realy got somethink 2 say. by the way i love like toy soldiers it made me cry first time i heard it.\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\neminem IS TOO the greatest rapper alive right now, and the greatest rapper that was EVER alive. he is the greatest rapper of all time. \n\r\nbtw jos*aleX - i also cried when i heard toy soldiers and when i watched the video\n\r\neminem is an amazing artist\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nbtw- does anyone know what eminem is talking about when he says\r\n\"wasn't that the reason you made that CD for me ma\r\nso you could try to justify the way you treated me ma\"\n\r\nwhat CD does he mean ? that's the part i dont understand...\r\nalso \"my whole life i was made to believe i was sick when i wasn't, til i grew up i blew up it makes you sick to your stomach doesn't it\"\n\r\ndid em's mom lie to him and tell him he was sick? i dont  get that part. does ne 1 know?\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nTorrente he called himself eminem as thats how he wanted to be known as oriiiiiiiiii\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nbtw- does anyone know what eminem is talking about when he says \r\n\"wasn't that the reason you made that CD for me ma \r\nso you could try to justify the way you treated me ma\" \n\r\nyeah good question. im guessing that his mother made a CD for him as a gift so she could justify that she was nice to him.\n\r\nalso \"my whole life i was made to believe i was sick when i wasn't, til i grew up i blew up it makes you sick to your stomach doesn't it\"\n\r\nyeah i really dont know, that one i think his mom told him he was sick when he wasn't (howd i get that?!) and now that he's grown up he's realized that he's not sick, and his mother is paying for it now. sry man can't help ya wit dat\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nIf any of you so called eminem fans didn't realise was this song was brought out after his mother tried to sue him for slannder and she was told that it isn't slannder if it is the truth so eminem brought out cleaning out my closet as a way to say HAHAHA i won and that he could tell the world anything he wanted as long as it was true hence the lines Cleaning out the closet he is getting everything out in the open for the simple reason that he can\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\njust to add to that any one who didn't realise it is there in the lyrics how dare you try to take what you didn't help me to get\" in other words he got to where he is on his own and she was trying to take it from him by sueing him\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\noh my gosh does this song rok SO hard!!!  I got htis song as a blues remix, sounds even better!!! Ill ax 1 o' my frends 2 c wat she thinks abowt it.  EMINEM IS SOOOO KOOL!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nWhos Kim? Is that Eminems ex-gf?\r\nI know who hailie is, shes pretty!! \r\nI thought he actually killed his mom.  But this song is pretty good but not the best eminen song.\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\ni think de line Remember when Ronnie died and you said you wished it was me? \r\nWell, guess what, I am dead. Dead to you as can be\r\nis really sad but guess wot? when me dad was younger his older bro died of menigatas and his dad went up 2 me dad and went y cudnt it ave been u instead? dat is sad\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nThis is a really strong piece of music, to those who write that it isnâ\u0080\u0099t, you only show how blind you are. Period. \n\r\nI am not into the genre at all, grow up in the 70â\u0080\u0099s and 80â\u0080\u0099s, so I know what punk is and it is not what Americanâ\u0080\u0099s style punk you have never known punk and never will. Eminem is the closest to punk that you got and this piece is brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nMike:\r\nI first heard this song on TV. (This was way before my Eminem obsession started, though.) It was about his mother trying to take some of his hard-earned money by su(e)ing(...?) him because she was a embarassed by his lyrics(government conspiracies, cuss words, etc...), or offended, or something... He made this song to counter her offense. It was all over the news, and stuff. They played a clip of the music video where he was covering a grave with dirt in the pouring rain.\n\r\nA little disturbing, but a pretty nice song. I feel a little bad about enjoying the song. This has nothing to do with my mom- I just like the beat. The end.\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nWonderful, another classic from truly the greatest rapper since Milli Vanilli. \n\r\nMarshall Mathers often â\u0080\u0098stealsâ\u0080\u0099 his ideas from 19th century goth poetry. Eminemâ\u0080\u0099s whining about his horrible, lonely, rich, lost soul is brought into even more view in this classic song from the famous goth-rapper. Roger Alan Painter, famous goth writer, wrote the poem â\u0080\u0098Cleaning out my Closetâ\u0080\u0099 with verses nearly identical. When Roger Alan Painter wrote the poem, it was about the woe and depression of realising there is no god and no point in living and he is â\u0080\u0098clearing outâ\u0080\u0099 the false memories in his life. Eminem reinterperated this to be thw woe and depression of realising there is no god and no point in living and also, his mother is a bit of a bitch. â\u0080\u0098Mamaâ\u0080\u0099 being a methophor for god who created this earth. He is apologising for believing in him and asking for forgiveness about removing her from his life. It is ironic that the chours is â\u0080\u0098Iâ\u0080\u0099m sorry mamaâ\u0080\u0099 and the verses are like â\u0080\u0098And Hailie's gettin' so big now, you should see her, she's beautiful. But you'll never see her, she won't even be at your funeral.â\u0080\u0099 In the video he is both digging a grave in a cemertary and praying in a satanic church (Look at the pentagrams in the background) the two favourite hang outs for goths.\n\r\nEminem even had the gothest goth, Marilyn Manson, appear in his video â\u0080\u0098The Way I Amâ\u0080\u0099 and has dressed up like him in â\u0080\u0098My Name Isâ\u0080\u0099 to show the world his untimely gothness. Eminemâ\u0080\u0099s fifth studio album â\u0080\u009cDead to the Worldâ\u0080\u009d is already in the works and two demos â\u0080\u0098The Angels love my painâ\u0080\u009d and â\u0080\u0098My God of Hate Fills my Black Soul with his Poisonâ\u0080\u0099 have already leaked onto the internet. Eminem has changed his appearance greatly, put on some mascara, paled up his face even more and is now constantly dressing up like a vampire. Many of my acquaintances foolishly believe that Eminem isnâ\u0080\u0099t a goth and is just a rap. This is nonsense, have you heard how much Eminem whines and complains even though he is rich? He must therefore, be a goth.\n\r\nIf you like Eminem and you are interested in other forms of goth music such as Bauhaus, The Cure, Christian Death, and Hanson. If you want good music though, try Classical and appreciate the cultured side of life. Cannibal Corpseâ\u0080\u0099s 11th Symphony truly is the greatest musical work of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\ni think this song is about being afraid to tell his mother that he is gay so he would rather kill her than to tell her..........\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nEMINEM FUKEN SUKX I HATE THE WIGGA\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\ni like all eminems songs... they all have feeling\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nsome people hate him and think hes a very scary violent person.. which he can be but hes taken shit all his life mostly from his mom and now hes finally standing up for himself and giving some of it back.\r\nhe has a very \"go fuck yourself\" attitude and i love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nIt'd be funner if eminem had a more \"I'm gonna go kill myself\" attitude though.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nthe rhyhm to this music is great and the beat is tense just like all of the other eminem songs. Eminem  has also written great lyrics for this song though the lyrics are about grieving over his mother's deception about him. (which i may find disturbing)\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nOk. Let's get one thing straight, Rap, Hip-Hop, R&B, Dippity Dop whatever you want to call it sucks. Eminem is just a crazy tart who thinks he's black. He wears a crucifix...but hang on does he actually believe in Jesus/God/Kirby? Erm. No. All of his songs are based around how he hates his mother although he lives with her and she still tucks him in his bed at night. Is she aware of all these songs that he's making behind her back? Guys who actually like Marshall Maithers who changed his name to sound like a chocolate snack get a life. Listen to real music.\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\ni don't usually like rap, but i like some of eminem's stuff.\n\r\n\"And Hailie's gettin' so big now, you should see her, she's beautiful.\r\nBut you'll never see her, she won't even be at your funeral.\r\nSee what hurts me the most is you won't admit you was wrong,\r\nBitch, do ya song. Keep tellin' yourself that you was a mom.\r\nBut how dare you try to take what you didn't help me to get.\r\nYou selfish bitch, I hope you fuckin' burn in hell for this shit.\"\n\r\nis some of the most powerful lyrics i've heard\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nthis is so personal and heartfelt form eminem. its not the kind of song you can relate yo, but it gives an insight into his personal battles. stunning song with so much power behind certain bits that i wont bother finding cause other people have already put them!\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\n@ enimen haters..:\r\ni don't know why you hate eminem so much, but guess what, i'm not interested in it. so why do you post your ideas nobody wants to hear?? Well i, myself don't really like most of hip_hop as well. But i don't bother anyone. I thing eminem really is a great artist, and if you think it's so easy then get ahead. Never heard of any of you... Maybe it's not that easy. don't condemn things you can't relate to. Nobody is interestet in your opinion and noone has asked you. YOu just state that all rap is shit and thats just not fair. You say it's mainstream to listen to eminem. Well it's mainstream to state that all rap is bad. So many people say things like that just to feel better... i hate those fake people. I also hate hip_hop'ers who think they are so cool if they call different music shit. I think i can feel if anyone is fake or real. And eminem is real.\r\nA friend of mine also only likes tool and perfect circle. well some more but doesn't matter. He doesn't even understand the lyrics but calls, like you, rap shit. It's just so stupid. Once i gave him a deftones cd and he listent to passenger. He said, \"well the frontman of perfect cricle (can't remember the name...) is good and deftones skillz are poor.\" He doesn't even notice that there is also chino singing. Yeah, but he can criticise music.... DON'T BE SO INTOLERANT!!!!\n\r\n@ eminem fans:\r\nI didn't want to read through all that \"i hate eminem\", \"i love eminem\" shit... i stop on page 4... so can we please start now a real interpretation and explanation of this GOOD song?\n\r\nBy the way, I agree, the song \"hailies song\" really is great. I always liked eminem's music and i also like his personality. It's not the music i listen to normally. \n\r\nI'm looking forward to reading wonderful interpretations without any comments nobody want's to read.\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nI must confess that I've never read more that the title of this song, but it sounds like he's gay and not wanting to be so. \n\r\nAnd by rhe way; It will make sense if you're norwegian.\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nyo people really piss me off... get your shit straight...  seriosuly, what the fuck is the deal with this thing called \"EASY MAC\" because its really not that easy i mean i practically burned myslef boiling the water... and the pasta fucking sucks and the cheese looks like skin shavings... \n\r\nBIG L 4 LIFE\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nsee, this what I like about eminem.  me the true blue fuckin metal head, I think that the whooe rap scene got so much better whhen he turned up. why? cos he was talking about real life fucking shit, not shit like \"oh ima gangsta ima killyall now fucking I cant do music to save my life\". thats why I respect eminiem cos his songs actually have some fucking meaning rather than just one big self glorifying babble whch I see most of the  rap, hip hop whatever scene has fucked off into. if I was ever gonna listen to rap I would listen to  him cos he makes some fucking good sense and talks about reality, rather than about how many times someone tried to kill him.\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nAwesome song. Eminem's mother was a druggie and she would hurt him, so this is his apology. It doesn't make much sense to me, because in a lot of his other songs his rhymes are insulting toward her.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nneva let ur dad listen 2 dis song cz if u do da neighbours will gt worried. soz let me xplain. when my dad 1st heard it he went round for weeks singing \"tonight im comeing out the closet\". he still does it 2 b embarresing in public. :(\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nhes white\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nso who cares if he's white\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nim glad he finally cleaning his colset\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nThis song is about how Eminem fucked his mom while Hailie was forced to video tape it while jacking Eminem off. Eminem couldn't wait to have the baby so he ripped out the baby when it was 4 months old. Then he just got really pissed off and threw it in the closet.\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nUmm someone asked on the first page about the chorus. The chorus is very similar to quite a few songs. It is extremely similar to John Lennon's \"Jealous Guy\":\n\r\nI didn't mean to hurt you\r\nI'm sorry that I made you cry\r\nOh no, I didn't want to hurt you\r\nI'm just a jealous guy\n\r\ncompared to Eminem's:\r\nI'm sorry, Mama.\r\nI never meant to hurt you.\r\nI never meant to make you cry,\r\nbut tonight I'm cleanin' out my closet.\n\r\nVery different meanings but very similar choruses. It's also a lot like Queen's \"Bohemian Rhapsody\":\n\r\nMama \r\nDidn't mean to make you cry.\n\r\n\"Cleaning out my closet\" is a great song, but my only issue with it is the chorus, which is so unoriginal up until the last line. I mean, who wants to try and go up against Lennon or Queen?\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nMunchausen's Syndrome by Proxy, That's what he had. Doesn't this song piss you off? He should be grateful, after all if it wasn't for his momma he wouldn't be where he is today. If his life was clean cut he'd be another Vanilla Ice. I wonder if he'll ever do some hardcore gansta rap.\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nSure, Eminem has meaning. Just none here.\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nthis song dont mean anything coz its another shitty rap song, no rap song means anything. fuckin dissing his mum, what a twat! like all rappers! their songs mean nothin, they dont really go around killin people once they r millionaires so why do they rap about it?\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nthis is a good song, im not into rap, floyd and zeppelin all the way, but eminems pretty cool :)\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nIts hard 2 believe that somone could drive there self into thinking of half the shit he comes up with, but thats what makes all geniuses crazy,Just imagine how scary some thoughts can be If your a visionary?...Im just glad he has the motivation 2 be so upfront about everything he says,half of it is hilarious,but i kno when hes bullshiitting.I understand he loves 2 pac and i do 2 ,so i sence he makes his music meaningful  and potent while making it crazy and aimes it towards white people just like how 2 pac aimed his music towards black people,eminems uses alot of tupacs tools and designs it into slim shady music WATCH THE SIGNS..\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nI don't think there's much analysis that can go into these lyrics. It's pretty much the most straightforward dissage i've heard from an artist.\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nThis song does talk alot about not just what he went through, but what alot of other kids and teens went, or are going through today. MOTHERS AND FATHERS IF YOU ARE READING, STOP ABUSING YOUR KIDS!!!!!!!!!!!!!!! Anyway, in the video it shows that he is buring his mother. Did he really kill her? I dont blame him if he did, she looks and sound like a real bi***!!!!  I meen honestly, who wants to abuse their kids?! All it teaches them is to hate and hit other people and some criminals have been abused and are like the way they are cause they were treated the wrong way. I can see hitting once in a while to get a point to your kid, but for little kids? and little problems? hit them if they like get into a serios fight or fail 8th grade or somehting like that! And if you dont like the stuff that he writes ( i didnt untill i turned 13 and acually understood what he was saying, i thought he was bad cause of all of the cussing, but it acually puts his points out kinda bolder in a sense ) why are you listening to it? It is called FREEDOM OF FRICKIN SPEECH! he is only expressing him self! Is that such a crime? i do have to give some props though, being white and rapping like many many black guys, dont see that everyday that is for sure.\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nwow. i know what hes goin threw. it sucks. ass. yeah im not a huge fan of eminem, but this song is like wow. i mean this has to be the best song by eminem.\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nwho cares? this guy was a loser and still is! I dont care how much money he makes. He focuses on his bad times and how everyone messed him up. What is he doin now? confusin all these kids that listen to him. keep it too yourself and tell em what your doin to make your life better!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\ni can't say i like eminem all the time, but i really love this song because it's really simple and candidly honest. i think that it sucks that he had to go through all this stuff. the fact that he can turn his bad times into something passionate is really great.\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\naw man. this song is soooo freaking good!!!! i heard it on the radio and it rung some bells but what really struck me was the anger and all. It was like Lose Yourself with all the anger. \n\r\nBut first he's dissing his mom and soon he's apolgizing. is it like he didn't really want to hurt her, but he's telling her the truth?? \n\r\n\"You selfish bitch, I hope you fuckin' burn in hell for this shit.\r\nRemember when Ronnie died and you said you wished it was me?\r\nWell, guess what, I am dead. Dead to you as can be.\"\r\nThat's my fav part\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nRemember when Ronnie died and you said you wished it was me?\n\r\nWho is Ronnie?\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nRonnie is Em's uncle who killed himself when Em was little. Ronnie was like a role model to him too.\r\nMunchausen Syndrome is what Em has and is when a person is made to believe they are sick all the time when they actually arn't.\r\nWhen he says \"Is that why you made that cd for me, ma?\"\r\nHe is talking about when she appeared on some noname rap group sound track calling out to Em and saying how she really was a good mother.\r\nI hope that cleared up some issues you all may be having..\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nI know every word to this song, I'm proud of myself haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nIf I knew all the words to this song, I wouldn't admit it. Eminem is such a posuer. Man how could you listen to this Garbage?\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nWow Ok.. (I'm actually going to say the meaning of this song because you guys are just areuging) we all have different opionions lets just leave it at that.\n\r\nIf you see the Video to this song, and if you have seen 8 mile this song is more understandable. He has other songs about his mom on his other cds, look it up. She sued him for 10 million dollars, than he made this song, which explains \n\r\n\"But how dare you try to take what you didn't help me to get.\r\nYou selfish bitch, I hope you fuckin' burn in hell for this shit.\"\n\r\nThe Chorus \"I'm sorry, Mama.\r\nI never meant to hurt you.\r\nI never meant to make you cry,\r\nbut tonight I'm cleanin' out my closet.\"\n\r\nThat was what he wrote on a card on Mothers Day, when he gave it to her she just threw it down like it didn't mean shit. \r\nIt could also mean like he says here \"I got some skeletons in my closet, and I don't know if no one knows it.\r\nSo before they thrown me inside my coffin and close it,\r\nI'ma expose it.\"\n\r\nThat he's letting all of his thoughts and feelings out before he dies..\n\r\nJust listen to the song and watch the videos a couple of times, thats how it was and he did have a hard life, he has like ... a jillion cds and they have different stories its like you basically know everything about him.\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nWow.\r\nThis song is incredible.\r\nI will admit\r\nI hate rap.\r\nBut Eminem's music is the only rap that i like.\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nThe lyrics in this song sting. I would cry if I was his mom. \r\nEminem is the best. \r\nI love his songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nNothing much left to say,\r\nyou guys have said a lot.\r\nBut to me this song is wonderful, \r\nI love it. & yall are right, \r\nhe's different then the other rappers,\r\nhe talks straight from the heart, \r\nthat's why I love him.\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nThis song is about Eminem telling his mom he's actually gay when he was younger, and her not accepting it. Its a popular song in the gay community. They know Eminem is really a homo.\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nEminem is probably the only American rapper I enjoy listening to clearly because he is skilled, everyone else raps shit but its just all old news no one needs to hear the same thing over again like why would i want to listen about people constantly shooting guns.Thats just weak.\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\neminem is absolutely AMAZING!\r\ni despise rap music more than anything in the world but i have sooo so much respect for eminem. ive loved him since grade 5. \r\nthis is probably one of my favorite songs by him, i love his deep, personal ones like this one. \r\nmy favorite line has always been \"remember when ronnie died and you said you wished it was me? well guess what, i am dead, dead to you as can be\"\r\ni agree with everyone else, those lines have so much power to them .\r\na lot of people hate eminem because of how much he swears and basically because he doesnt give a fuck what anybody thinks about him... but hes amazing, hes got so much potential..  \r\ni love him \t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nhaha  ElectricPinkPanther im not really too sure why you care all that much to actually spend time writing all that.. wow. entertaining. we're not trying to convince anyone to like him. and also, do you really think he puts all that stuff out there JUST to make money? yeah.. i dont think so. that would be real immature and its definatly obvious that he's been through it all. haha wow.\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nThere are three levels to music maturity. When you believe that you are right no matter what. Then, when you tell everyone that you should keep an open mind. The last, hard-to-get stage, is when you like music for music, not for the singers, not for the stereotypes, not for anything but you're own amusement. When you tell other people to keep an open mind: and keep an open mind yourself.\n\r\nI used to hate Eminem. Then I went through a stage where I started to listening to all music to seem more \"mature\" then other people, including Eminem. Slowly, I realized it's *no use*. I love Eminem's rhymes, and even 50 Cent can bring me up on those weird days.\n\r\nNow everyone *shut up*. Song meanings is about dissecting lyrics and feelings, *not* your opinions. (: Nobody cares if you hate \"the niggas and hoes\" of rap.\n\r\nFlame me? Sure: cannibalistic.star@gmail.com\n\r\npeace.\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nthis is the cd version, but for a while when he would tour in the midwest like Chi and Detroit he played a different version.  digitalfuntown.com used to host it.\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nthis shows how much eminem is devoted to his music, his rymes are real\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nThe bit about Hailie always gets me, it's like he's bringing her into his own problems, but given all that shit about munchausen syndrome he probably knows better than to do that shit outside of a song.\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nwow. i remember being in middle school hearing this song. jees, i used to love this song when ever it would be on the radio. i had no clue wat it was really about. lol. if only mom new wat i was listenin to\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nfuck, i identify too much with eminem.\n\r\nyeah, my life hasn't been as shitty as his.\r\nbut it has been quite shitty. alot of shit has happened to me that has happened to him.\n\r\nsee what i like the most about this place is that i can talk about myself and nobody knows who i am.\r\nalso, stuff like..\n\r\nEminem - when my mom used to send me to the drugstore to buy cigarettes, i used to steal them and keep the money, so that i could buy the food in school instead of having to wait for free food in the free food line list because of the girls.. - or something like that.\n\r\nyeah.. alot like many people..\n\r\nlivin with the high society and shit and not being able to keep up, since they have more money and you simply, just, don't.\n\r\nand try to keep up with them by doing retarded stuff, like stealing, or trying to keep up getting a job or something. like em did, you know, he did not get into the rapping shit magically, he had to save money and get friends..\n\r\nsorry  for making you read this if you read all of it o.O\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nK so clearly no one hasn't commented on this in a while. \r\nBut I want to say that this song has to be one of Eminems best - I recently had to do an english project and that was to choose a song and write about its meaning. Instantly this song came to my mind (I first heard this song when I was 7 - and it got to me; YE`7 years old. 7 years later.. it still gets to me). It's just really intense, personal and REAL. Which is why it's so great I guess, considering rap songs today aren't so intensified anymore.\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nsuch a good song......\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nthis is  a prime ex. of why he is the bets rapper to this day even better than 2puc\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nYea thats what you do you diss your mom on a rap song making it seem as if she ruined your life. If any thing he should thank her for making him a stronger person come on E i love you dude but your a millionaire stop stooping down on low levels like that -_-\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nhe makes it sound like he killed her........\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nI don't get this song because someone told me that he was not even talking about his ma! They said he was talkin about his ex! does someone want to help me out?\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nWow, this song is why I love Eminem.  He has absolutely no qualms about telling the world about his life and his experiences.  He doesn't mince his words, he just \"spits it better than 90% of rappers out there\" (to quote another Eminem song) and lays his whole life clear for everyone to see.  Now that's courage.\n\r\nIt's especially moving for me, because I feel a lot of the same feelings towards my own mother, although not quote on the same level.  She kind of destroyed my childhood.  Listening to this song makes me cry, sometimes.\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nthis is my song.....hmmm and its about eminems life\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nThis song is wanna of my favorite by eminem....\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\noh yeah. peaceeeeeeeeeeeeeeeeeeeeeeeeeee\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nThis song is about Eminem's life and struggles  like how people protested his lyrics, his father's abandonment, his failed marriage with Kim, and his rocky relationship with his mother.\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nGreat song and straight from the heart, though Eminem now regrets making this record \nIn Headlights from MMLP2 the following lyrics are rapped:\n\"But I'm sorry mama for Cleaning Out My Closet, at the time I was angry\nrightfully maybe so, never meant that far to take it though, 'cause\nNow I know it's not your fault, and I'm not making jokes\nthat song I no longer play at shows and I cringe every time it's on the radio\"\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\ni feel like all true Stans should stop listening to this now tbh. I mean it's a good song, but Eminem has said he regrets making it, he no longer plays it at shows, and he cringes every time it's on the radio (all of these are mentioned in Headlights ft Nate Ruess)\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nEminem simply climbed on the shoulders of dissin' his own mom if you listen to lose yourself he said:\"Sorry Mama I love you but this trailer is got to go\"\nactually it's nothin' to do with the B-Rabbit character cause the latest scene of Kim Basinger (his mom) He smiled in her face and if you notice the \"Headlights\" track from MMLP2 you'll know exactly what I'm talkin' about cause you can't find out that you got all those feelings towards someone you fucked in your career.\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nJust got two corrections for this song...which is my favorite off the new CD its very deep.\n\r\n\"Witnessin your momma poppin (?=perscription) pills in the kitchen\"\n\r\ndown further\r\n\"But guess what? I am dead \r\nDead TO you as can be! \"\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\n\"this man is the best stop f*** song ever all dem emine=m haters stop hating yall jus jealous cuz u cant be as out spoken as dis min here \"\n\r\nACTUALLY... we arent jealous, we are relieved.  I would rather be just like I am than be Eminem, and be homophobic and commerrcialized.  You guys think he puts these lyrics together for HIMSELF or do you think he makes them so YOU guys eat it like dinner, buy his CDs, get hsi T-shirts, goto his concerts?  You guys are saying \"I like how he doesnt rap about hoes and money\" Well what the hell do he rap about? Killing people, and his mom.  GET OVER IT, alot of us have had bad childhoods, but we dont go and make millions of dollars because of it, we see therapists, maybe he should look into one, cause he seems very disturbed.  \n\n\r\nYou guys are saying when i heard \"Remember when Ronnie died and you said you wished it was me, well guess what? I am dead, dead to you as can be!\" i almost cried.  Why the hell do you like it if it makes you sad? hes probaly making it up anyways, dont see how it could make you sad unless its happened to you. \n\r\n\"Have you ever been hated or discriminated against? \r\nI have, I've been protested and demonstrated against. \r\nPicket signs for my wicked rhymes. \"\n\r\nWell, hes hated and discriminated, so why is he trying to get sympathy?  I know a guy that i go to school with that is always like \"I hate queers, queers are gonna die\"... know who we looks up to? Eminem, imagine that. \n\n\r\nIf you want music that DOESNT discriminate, but still has the same emotion as this song, and actually takes a little talent to make, go listen to some Pedro the Lion songs.  \n\r\nPost replies, only if they are gonna be intelligent, none of this \"YOUR GAY CAUSE YOU HATE EMINEM!\" or \"FUCK YOU ELECTRICPINKPANTHER\"\n\n\n", "comment_291": "\nRap sucks...thats all but Eminem can't sing and he thinks he is \"real\" music what the fuck is that...i thought it was Coming Out of My Closet....and he says Clawset..yea sucks..Rock On'\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nThis song is about abortion.\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nI'm sorry mommy, blah blah, that you are a trailer trash drug addict, so I'll write a song about it! Because I am Eminem and I am such an innocent person!\t\t\t\t\n\t\t\t\t\n\n"}