{"comment_0": "\nThis song has great lyrics and is a great cover for Panic.\n\r\nLike in many panic songs, (see Rock, for one) the water is the all-consuming substance that surrounds and subdues you.  Here, it represents drug addiction.  Grabbing each other's collar and rising out of the water-- we need each other to clear get beyond this.  Stick your finger in the dike -- reference to old fable/story, see en.wikipedia.org/wiki/….  \n\r\nAnother theme in Panic songs is addiction--Another thought--Panic apparently changes the lyrics from \"after all that I've been through\" to \"after all that I've been to.\"  Makes me think of people beating their addictions by letting every thing else go, including other people, after all the shows they go to...  Panic never leaves you in the dark (the venue lights always turn back on) or on your own (surrounded by many others) - Of course, this is just the creation of another addiction.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI'd have to agree with everyone this is one of my all-time favorite Panic songs! \n\r\nI really love the train metaphor. A close to derailing train really captures the intensity of fighting addiction, especially one as difficult as heroin. \"Scream at the conductor, he's been deaf for 20 years\" is really the addicted yelling at the intrinsic \"self,\" as if he's having withdrawals and trying to scream to himself \"STOP,\" but as anyone who's fought an addiction knows, mind over matter isn't easy. His mind is no longer listening to him. Half wants heroin, the other wants, and is fighting, to quit the drug. His every gear grinds trying. \n\r\nThe way I mentally picture the song is a man with a needle about to shoot-up but trying so hard to not (\"close to impact\"). I debate with myself, as to whether the line \"your reflective skin is fallin' off your bones\" is commenting on the agony of withdrawal or the transition between addict to cured. \n\r\nAs beowulf44 stated, water is defiantly the personified antagonist of this work. Water represents the addiction and Panic, the group as a whole, are trying to facilitate a way away from the water.  \"We can walk on water, like junkies swore they did\" is an attempt at to easing the nerves, like saying \"you can do it!\" The junkies part confuses me a little, I'm not sure if it's referring to before they were junkies or if they're in denial. The line \"mind his business and roll along as usual\" is really \"i guess this business will roll along as usual,\" which matters because it changes the tone from apathy to repetition, once again showing how long and grueling fighting addiction is and how important dedication is. \n\r\nTHIS SONG IS AMAZING as is WIDESPREAD PANIC!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI totally agree with jamaway, climb to safety is definatly about heroin. This is one of the best meaning panic songs to me. I over came opiate addiction the same way jerry joseph did, cold turkey. \"You scream at the conductor, He's been deaf for 20 years\" is most definatly your conscience saying stop but your body wont listen. Panic is a great band because they have that dark side. Songs like c2s mean a lot to people who have gone through those dark times as well. \r\nDetoxing of Heroin is no shit. Doctors say worst experiene besides Chemotherapy. I know Jamaaway said this but now listen to the lyrics again and picture yourself the way Jerry explains it.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nquestion to fellow spreadheads:  what do you all think about the lines \"stick your fingers in your ears till they explode, mind his business and roll along as usual\"?  I think it is about the woman he loves wanting to leave her husband\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nYea and he is just trying to ignore the bitch..haha..GREAT ONE DUDE\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nthats an Excellent point! my sister has always thought this song is about tripping, but mayhaps i shall put this new angle to her.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nafter all that i've been through\r\nyour the only one that matters\r\n(climb to safety)\r\nyou never left me in the dark\r\nhere on my own\r\n(climb to safety)\r\ni can hear the water risin'\r\nlet me be your ladder\r\n(climb to saftey)\r\ni promise you'll be dry\r\nand never be alone\n\r\nThese lyrics are too damn good. If more people listened to Widespread, the world would be a much better place...\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI agree.  Even as I've moved on from this kind of music, this song has stuck with me.  I put it on whenever my friends are going through shit times.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis is a song about heroin.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nCTS was one of the first panic songs I liked.  I think it is because of  the same lyrics MJWhite spoke of previously.  In the beginning I think I was thinking of \"never being alone\" as in being with another person.  now I can relate to this as always having my panic (people will come and go, but my music will never leave me alone)\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song is about overcoming heroin addiction.  Written by Jerry Joseph who is a recovering heroin addict, singer/songwriter & panics great friend.\n\r\nHe overcame heroin without the use of REHAB, so to speak.  Cold turkey.  Now read the lyrics again and imagine how he must have been feeling at this point in his life . . .mmmm?\n\n\r\nEdit: Lyric Errors\n\r\nas it grinds to where it began (as he grinds through every gear)\r\nyou find the bed (paint) is peelin'\r\nyour (reflective) skin is fallin' off your bones \n\r\nbaby we can walk on water (can fVck for money) JJ Lyric/Censored by JB\r\nlike some junkies swore they did (the junkies always did)\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nIts about H addiction.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nlyrics to  all music is so subversive and only the artist really knows what they're feeling.  I know when I listen to this and my life is falling apart around me and my husband went to work and never came back and left me with an unfinished house and 5 kids it made me feel like somebody had my back.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nlyrics to  all music is so subversive and only the artist really knows what they're feeling.  I know when I listen to this and my life is falling apart around me and my husband went to work and never came back and left me with an unfinished house and 5 kids it made me feel like somebody had my back.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis song is about sitting around in an airport...watching people go by.\t\t\t\t\n\t\t\t\t\n\n"}