{"comment_0": "\nThis song is about hooking up with your ex. It was written to be feel-good rather than full of regrets like most hook-up-with-your-ex songs are.\n\nAbout the opening line Andrew Taggart says, \"I drink a lot. Most of my relationship issues come from drunk times.\"\n\nThey used the setting of the \"hotel bar\" as a sort of nostalgic memory for that scenario to happen. It paints a vivid image of a girl at the bar and the rush of emotions that cones along with that.\n\nThe line \"we ain't ever getting older\" is meant to show the message of how nothing has changed between them. Andrew Taggart, a Syracuse grad, says that the girl in this song represents all of his exes from his university.\n\nThe Blink-182 song they are referring to is \"I Miss You,\" which Halsey did an impromptu cover of at one of her shows. The buys also covered it in their sets when they were just starting out.\n\nHalsey has a rose tattooed on her shoulder which they refer to biting in the chorus. \n\nThe idea for the duet came about in order to give the song more of a story line with some depth and characters with dialogue, because originally Andrew was just going to sing her verse.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThey meet in hotel bar because this is where the girl hangs out for work with her friends. She was a spoiled daddys girl in Boulder with life coming easy for her, but now she`s faced lives tough reality. The song writer bittersweetly dedicates this songs to \"all the girls in boulder\".\n\nThis easy life girls ends up working girl, and thus the boy doesnt want to see her friends again. These girls hang out and find their prey in the hotel bar drunk. You dont look pretty in hotel bar for nothing. The girl is either nostalgic of meeting him or in desperate need for money and thus starts sweet talking him about old songs etc.\n\nIn her line of work they end up at the back of the car owned by her employer the pimp. She doesnt have money for that type of car, and he notices it or even teases her about it. \n\nSo they are both broken hearted to find her in that situation, and he specially down from her leaving him still.  He may have hidden sadistic pleasure of her having stepped so low as she was the one who broke up. She being the rich girl with easy life, and then ending up like this.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWhy did the make this song?\t\t\t\t\n\t\t\t\t\n\n"}