{"comment_0": "\nShikamaruXXX I agree with you in some ways, but I also have to disagree.\n\r\nIt may be repetitive, but it's catchy and got a nice beat, which makes people money now a days.  It's also the fun thing to thump to in a car with a nice system, I mean, I listen to just about everything, but there's no way I'd listen to rock with subs, it sounds ridiculous, and serious rap/r&b is lacking catchy beats & repetitive lyrics, so it's not fun, while rap/r&b like this, is what sounds perfect with a nice system.\n\r\nI'm sure you either think you're mr. pro listening to either like old rap that's all serious and shit, or you don't listen to hardly any rap and are very narrow minded.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nthis song is so sick and addicting\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nTravie's part is like: \r\n\"brabrabrabrabreak it down like Britney forgive me I said it\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nTravis McCoy's whole part is incorrect.\r\nIt goes;\r\n\"B-b-b-b-break it down like brittney forgive me I said it\r\nWheather u knotty dreaded or you crazy bald head\r\nJump up if you love it no guns in this place\r\nSo what hes my cousin sexy runs in the family\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI believe Trav's part is actually something along the lines of:\n\r\nB-b-b-b-break down like Britney, forgive me, but I said(y)\r\nwhether or not she dreaded her crazy bald head(y)\r\njump up if you love it, no guns in this jam(my)\r\nso what? he's my cousin, sexy runs in the family\n\r\nthere's definitely a 'y' added to the end of everything so it rhymes with family. and a 'jammy' is gun so... yeah. Just my take on it. It's bugged me all summer and that's the closest I can get it to even making sense (at least the Britney stuff)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nlove this song , could totally dance to it!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nHARDLY! this kid is another examplte of a dying genre of music. this lacks everything except repetition. it's the same frickin thing evey 10 seconds.\n\r\nwe get it, \"put the lime in the coconut.\" ok. quiet now.\n\r\nand have you heard his other songs??\r\ngood lord, he has absolutely no shame. he seriously says, \"...gettin every dollah. yeah, i'm on tv. turn it on and watch me.\"\n\r\ni'm sorry, but when in the world did that constitute a song??? that's nothing but a showboat runnin his mouth. no lyrical capacity or talent. just money.\n\r\nagain, a dying genre of music. shining example right here.\t\t\t\t\n\t\t\t\t\n\n"}