{"comment_0": "\nI love this song so very deeply.\n\r\nThe way Halsey manages to describe someone as \"devoid of color\" whilst making them out to be the most beautiful thing she's ever experienced is incredible. She acknowledges his flaws and the sadness that is his emptiness, yet still finds him to be a masterpiece. I don't think she's putting him on a pedestal - I think she truly does see him in a way no one else does, including himself.\n\r\nIt's heartbreaking. I cry each time I hear this song.\n\r\n(Side note: Matty inspired some of her best songs, I swear.)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nthis is honestly such an amazing song! Halsey even admitted herself that she didnt think she was this amazing singer and that she was more into the writing aspect of this project, but as long as she sings with emotion and writes things that are true that thats all the matters\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis is my absolute favorite song of hers. She's describing someone as a color, specifically blue throughout the song, mostly because blue is a cool, deep, passionate color, and then later refers to him as red, probably because red is fiery and deep. She's covered in him, the color he is, and he's made her into someone else and then decides that she isn't the right one for him. \n\n\"You were red, and you liked me cause I was blue. Then you touched me and suddenly I was a lilac sky, and you decided purple just wasn't for you.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nAwesome awesome song!\r\nHalsey rulz!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nYou were red\nAnd you liked me because I was blue\nBut you touched me, and suddenly I was a lilac sky\nThen you decided purple just wasnâ\u0080\u0099t for you\n\ni thought about this as like a thing for the bisexual flag. the top part of the flag is light pink, not exactly red. but the bottom is a blue. the middle where the two meet has a strip of lilac. so maybe when she dated/got to know the person she realized that she may not have been who she thought she was and considered herself bi (which she really is)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n\"His pills, his hands, his jeans\nAnd now I'm covered in the colors\nPull apart at the seams\nAnd it's blue\nAnd it's blue...\"\n\nHalsey explained to Complex: \"It's just my creative color. It's like so many things at once. It's electric, and it's bright, but it's also calm. It's also ethereal. Blue is just an otherworldly color to me. Blue is the sky. Blue is the sea. Blue for me represents the unexplored territory.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think this song can mean many things, when I first listened to it, I thought it was about suicide. Maybe the person she's talking about is depressed and he thinks nobody loves him, everything is blue and sad. But then I listened more and more and it sounds like it's about how she sees how great he is.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song seems to be a lot about a struggling relationship between two people while one of them is fighting an addiction. You can find a lot of drug references, even if unintentional: starting by giving a background of the other person's life (your little brother never tells you but he loves you so, and your mother only smiled on her TV show) maybe to give a reference as to why the person has resorted to drugs. Then stating the obvious : you're only happy when your sorry head is filled with dope. \n\r\nThen it gives a hint to the \"club 27\" or the famous fact that many drug addict famous personalities die at 27 years old (\"I hope you make it to the day you're 28 years old\" meaning she hopes the person passes the mark). \n\r\nThen begins the less obvious references: \"you're dripping like a saturated sunrise\" this could be interpreted as a trip, specifically acid for the saturated sunrise part,  but maybe debatable.. \n\r\nI'm guessing when she says she's tearing through the pages and the ink, that she knows him/her deep down, on his/her darkest moments. \n\r\nThen on to the chorus are the more obvious references, talking about pills, smoke, and being blue and having grey dreams. Depression is a big factor amongst drug users as their serotonin receptors become messed up. It's usually a tipping point or the hardest to fight after the physical addiction has settled during withdrawals. \n\r\nThen what I get from the lillac sky part is that the person was was very passionate in the beginning because she was different from them. But as she became \"contaminated\" by the same mellow state within the drug abuse world, the other person lost interest. Drug users tend to seek very high states of mind to compare to the high the drugs give, otherwise they become \"bored\" and depression kicks in again. \n\n\n\n\n"}