{"comment_0": "\nIt's song about loneliness\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nHe's still in love with his ex...and wants her there either just sleeping next to him or more likely as a booty call. He wants her back, but in the song appears to just be begging to have her there with him for ANY reason whatsoever just so he's not left all alone without her.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI just truly love this song!!!  A Booty call is the last thing that this song is about!.  No matter how much they disagreed or did not connect  in the relationship, he cannot stop thinking of her.  No matter what their problems are at the moment, lets put them to the side and forget about them for now, I just want you to be here with me.  He just wants to hold her in his arms.  No talking, no fighting, no pointing the finger....just be together for that sense of calm. SIMPLE NOT COMPLICATED Thats It !!  They don't have to end world hunger, or stress over the relationship...all that matters is we need to hold each other.  AND how true is the line,\" You can say we are done, the way you always do..it's easier to lie to me than to YOURSELF!  SO TRUE!!  Next best line...Forget about your friends, you know they are gonna say we're bad for each another...BUT we aren't good for anyone else ( HELL lets face it)  I love it\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI just truly love this song!!!  A Booty call is the last thing that this song is about!.  No matter how much they disagreed or did not connect  in the relationship, he cannot stop thinking of her.  No matter what their problems are at the moment, lets put them to the side and forget about them for now, I just want you to be here with me.  He just wants to hold her in his arms.  No talking, no fighting, no pointing the finger....just be together for that sense of calm. SIMPLE NOT COMPLICATED Thats It !!  They don't have to end world hunger, or stress over the relationship...all that matters is we need to hold each other.  AND how true is the line,\" You can say we are done, the way you always do..it's easier to lie to me than to YOURSELF!  SO TRUE!!  Next best line...Forget about your friends, you know they are gonna say we're bad for each another...BUT we aren't good for anyone else ( HELL lets face it)  I love it\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nKenny Cheney said it's about a \"high class booty call.\" It's not some random woman he wants just for sex. He did love her and feelings are still there, but he's just lonely. Having her there is a comforting on a dark night.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ngreat song, great melody.\n\r\nI think this just about a booty call.\t\t\t\t\n\t\t\t\t\n\n"}