{"comment_0": "\nThe song is about the Beatles feeling towards eachother. during a weak time, George brought up the Yogi and the phrase \"Come Together right now over me\" is an excerpt from the script telling them to use this song to build their bonds again and unite as one.\n\r\nEach verse is dedicated to a Beatle:\n\r\nVerse 1: \"Here come old flattop, he come grooving up slowly\r\nHe got joo-joo eyeball, he one holy roller\r\nHe got hair down to his knee\r\nGot to be a joker he just do what he please\"\n\r\nThis verse is obviously Ringo. Ringo's old school drum beats (\"Flat top\" refering to the old hair cut in the mid 1900's) were off at first with the rest of the band, but in time he got better and better (\"Groovin' up slowly\"). \"he got hair down to his knee,\" is a joke about his shaggy look when he first joined the group and since he's sitting down playing the drums his hair wouldnt quite reach his knees but you get the riff. \"Got to be a joker he just do what he please,\" Refers to him being the goof of the quad-squad.\n\r\nVerse 2: \"He wear no shoeshine, he got toe-jam football\r\nHe got monkey finger, he shoot Coca-Cola\r\nHe say, \"I know you, you know me\"\r\nOne thing I can tell you is you got to be free\r\nCome together right now over me\"\n\r\nDid someone say George? \"He wear no shoeshine,\" well lets face it, George wasnt fancy and liked the bare foot thing. \"He got toe-jam foot ball,\" Soccor was a sport usually practiced outside the temples where the Yogi was practiced. \"He got monkey finger,\" George was extreeeeeemly dextrous and learned many stringed instruments with ease. \"He say,' i know you, you know me'etc...\" another refrence to the Yogi.\n\r\nVerse 3: \"He bag production, he got walrus gumboot\r\nHe got Ono sideboard, he one spinal cracker\r\nHe got feet down below his knee\r\nHold you in his armchair, you can feel his disease\r\nCome together right now over me\"\n\r\nThis is the most obvious one... give up? really??! It's John! Duh! \"he bad production,\" refers to john constantly would stopthe recordings and piss off all the rest of the band. \"He got walrus gumboot,\" John wrote 'I am the walrus\" and kept making songs like that and refused to change his style, thus upsetting the rest of the band. \"He got Ono sideboard,\" a side board is a court term refering to pulling to the side or distracting. Yoko Ono would pull John away from the band and Is believed to be the downfall of the band. \"he one spinal cracker,\" a term related to \"braking my back,\" John would constantly argue with the band mates adn \"brake thier backs.\" \"He got feet down below his knee,\" John refused to be openminded or \"get on his knees\"  He wass stubborn and stood up, refusing to kneel to anyone.\r\n\"Hold you in his arm chair you can feel his disease,\" Anyone who really knew John, or even got close to him, you knew something was wrong physically with him, depression, anger, etc. etc..\n\r\nVerse 4:\"He roller-coaster, he got early warning\r\nHe got muddy water, he one mojo filter\r\nHe say, \"One and one and one is three\"\r\nGot to be good-looking because he's so hard to see\r\nCome together right now over me \"\n\r\nLast but not least, Paul! \"He roller-coaster,\" Paul was very emotional and would change all the time on everything whether it be a song or feelings. \"He got early warning,\" Early in, the rest of the guys knew that Paul was going to be a problem so they warned him. \"He got muddy water,\" A referance to Pauls changing facination to the band \"Muddy Waters,\" Bluesy style. \"he one mojo filter,\" Paul was very persuasive and would make the rest of the members bend to his will. \"He say 'one and on and one is three',\" Is a referance to Paul trying to constantly tell the rest of the band that even witout him, the band could survive. \"Got to be good-looking because he's so hard to see,\" Paul was the \"cute\" one of the group and was also very hard to get along with and read as aperson.\n\r\nWEllllll, thats my interpretation, i hopee it was helpful and clear things up.\r\n-elBajista\n\n\n\n\n\r\nP.S. sorry for typos, my comp is acting weird and it's hard to type :)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nRemarkably for such a druggy song, there's nothing SPECIFICALLY drugs-related in the lyrics. \n\r\nIt was originally meant as a campaign song for acid-guru Dr Timothy Leary when he was going to run for US President (no kidding!), but later John re-wrote it in its present form. Alongside references to blues singer Muddy Waters and Yoko's Ono's company \"Bag Productions\" there is an inevitable Walrus. \"Spinal cracker\" reportedly refers to a form of Japanese massage involving a wife (Yoko?) walking on her husband's spine! But guess why the song got banned by the BBC...\n\r\nYes, because the State-owned broadcasting corporation deemed that the mention of Coca-Cola was advertising and therefore could not be played on the BBC! \n\r\nThe same thing happened with \"Lola\" by the Kinks, but they actually changed the lyric to the more evocative \"cherry cola\".\n\r\nSimon Beck\r\nLondon, UK\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nYou're all wrong. It's John saying that the Beatles are his band, not Paul's. Each verse is about one of the members. Ringo, first verse. George, second verse. John, third verse, kinda making fun of himself with Ono side board  and bagging production. And the last one is an attack on Paul saying one and one and one meaning John, ringo and George. And saying the only reason Paul was popular was because he was good looking and couldn't notice him any other way. John saying come together over me, not Paul. And the fact that John did all the backup vocals for this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nLike a lot of John's lyrics (and like Dylan's), there are multiple meanings.  The two didn't have their songs wrapped neatly in a bow for the listener to easily decipher.  Both Dylan and Lennon (who were friends) realized they were truly lyrical geniuses and immensely popular.  They probably took great glee in puzzling, provoking, intriguing and teasing their listeners.  Listen to Desolation Row or Like a Rolling Stone where there are countless meanings.  Same with I want you (she's so heavy)--drugs, sex?  \n\r\nThe song is probably on one level about the four individual Beatles.  It is also about taking drugs.  It is also about sex.  In fact it is eerily similar to Happiness is a Warm Gun which also had multiple meanings---an actual pistol, sex, shooting drugs, etc. (bang bang, shoot shoot).\n\r\nThe first two verses are interesting in that they both could be about George and Ringo.  Lyrrics could be interchanged.  Flat top.  Is that an old stodgy hair style?  A guitar top?  Groovin up slowly.  Is that the groove of the song suggesting the drummer?  Or someone who was square and was slowly becoming more hip?\n\r\nShoot coca cola has a drug reference but it could be about a Coke ad Ringo was asked to be \"shot\" in. \n\r\nThe most interesting verse is the fourth which seems to be about Paul who is emotionally up and down (roller coaster), was getting guff form the other members for being too bossy (early warning), he was a buzz kill (mojo filter--filtered out other musicians creative ideas?).\n\r\nThe \"one and one an one is three\" seems to be John mocking Paul's overly simplistic song writing.  He later sang in \"How Do You Sleep,\" the only thing you did was Yesterday. \n\r\n\"Got to be good lookin'\" refers to the fact that he was the cute Beatle but the only thing he is noticed for is his looks not his intellect...(so hard to see...empty mind, or it could simply mean \"hard to read\" since he was impulsive and bossy.  It seems to be John mocking Paul's overly simplistic mind.\n\r\nThe title Come Together could be John's plea to the band members to continue making great music together and not going solo.  Or it could refer to the 1960's \"let's all get along\" ideal.  Or again it could be about sex (cum together)...it could even be about Paul's death (come together over me in my grave).\n\r\nThere are a lot of religious meanings as well from their time in India and George's stronger religious beliefs.\n\r\nI think it is by far their coolest song.  It has a Stones-like groove with dynamic drumming and and a serious danceable groove.  The song has a drug-like, happy groove with soaring lead guitar lines from George.  The \"shoot\" parts could suggest shooting up (drugs),shooting your load (sex), or even death (shoot me).\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI BELIEVE THIS SONG REFERS TO THE BEATLES AS A WHOLE,THE FIRST LINE IS ABOUT RINGO,THE SECOND ABOUT GEORGE-THE MAN MIGHT I ADD,THE THIRD ABOUT JOHN AND THE FOURTH ABOUT PAUL11 AND MUST I REMIND ALL OF YOU JOHN IS NOT THE ONLY BEATLE!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nactually this song has many many drug refrences.  im not sure what joo-joo eyeballed means, but i assume its something to do with dialated pupils after using acid or smoking pot.  i know the holy roller is a refrence to rolling joints, because stores that use to sell rolling papers usually had bibles and other religous materials in them, thus producing holy roller, i even herd stories that bible pages were used to roll joints. and come on he shoot coca cola? shooting coke.  bag production, weed, baggin weed.  spinal cracker, acid hits go straight to the spin\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nanother one of the examples of john's songwriting randomness. makes you wonder what he was on back then...this is a pretty cool song though, regardless.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nby the way, has anyone seen this really cool flash cartoon/music video of Come Together on albinoblacksheep.com. It's really cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI don't know for sure about this one, but the short phrase that is being mouthed quietly throughout the whole song is \"shoot me\". Maybe Lennon was referring to someone who... \"Shoots Cocaine\" has \"Long Hair\" and \"Smelly Feet\" that he dislikes. I truly don't know, maybe this will inspire someone else.\n\n\n", "comment_9": "\nIn the song John Lennon describes random people in his unique way, bassically saying everyone come together and help me with my cause (\"come together right now over me\"); Lets stop the war and make things right. I urge you to watch the videos \"Money Masters\" and \"Zeitgeist Addendum\" John was very aware of what's going on.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThe lyrics refer to the 4 members of the band. At the time this song was written, the band was facing turmoil and conflict. Come together right now over me  -- this is a plea by john to unite eihter under the dali lama or john lennon himself. \n\r\nHere come old flattop, he come grooving up slowly\r\nHe got joo-joo eyeball, he one holy roller\r\nHe got hair down to his knee\r\nGot to be a joker he just do what he please\n\r\nThis is ringo. the joker in the band, some of this refers to his blues roots, and his groove steadily improving as the band matured.\n\r\nHe wear no shoeshine, he got toe-jam football\r\nHe got monkey finger, he shoot Coca-Cola\r\nHe say, \"I know you, you know me\"\r\nOne thing I can tell you is you got to be free\r\nCome together right now over me\n\r\nThis is harrison. George was the biggest follower of the hare krishna, he often went barefoot as was the practice of this religious movement. Also common for these followers, to play barefoot soccer referred to as toe-jam football. Monkey finger is a reference to his skill on the guitar. He shoots coca-cola was slang at that time for shooting up cocaine. \n\r\nHe say, \"I know you, you know me\"\r\nOne thing I can tell you is you got to be free\n\r\nthe mantra of the hare krishna.\n\n\r\nHe bag production, he got walrus gumboot\r\nHe got Ono sideboard, he one spinal cracker\r\nHe got feet down below his knee\r\nHold you in his armchair, you can feel his disease\r\nCome together right now over me\n\r\nthis is obviously john. bag production could either be the reference to ono's compnay, or \"bad production\", a reference to johns struggles making good music while addicted to drugs. Walrus is referenced. Ono is referenced as a sideboard, or something distracting john attention from the group. spinal cracker is probably the practice of Ono walking on his back. When john holds u close, u can feel his disease. John was self-doubting, self destructive, self-loathing at times.\n\r\nHe roller-coaster, he got early warning\r\nHe got muddy water, he one mojo filter\r\nHe say, \"One and one and one is three\"\r\nGot to be good-looking because he's so hard to see\n\r\nroller coaster. paul was up and down about keeping the group together. He got early warning from hi band mates that his superiority complex and his rding them would drive them apart. \"One and One and One is three\" This was Paul talking about the Beatles going on without him. Got to be good looking he is so hard to see. Paul was considered the good looking one. \n\r\n  ultimately, i think this song was an attempt for the beatles to come together, and be more united. this obviouisly did not succeed.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nChinup, that's the most disgusting thing I've ever heard.  I can almost guarantee it wasn't about that.  I honestly don't think even John Lennon would stoop that low, and he actually said the song was about a political campaign, and the \"flattop\" line was stolen from another song.  You have a very dirty mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nSupossedly, John says \"shoot me\" at the beginning, but the word \"me\" is covered up by the bass' line. It's probly just another one of those \"Beatles myths\".\r\nI also heard somewhere that the line \"Hold you in his armchair you can feel his disease\" refers to Franklin D. Roosevelt, who was in a wheelchai, but I don't think that's true....oh well. \r\nI've heard the Aerosmith version, it's good, but, not as good as the original version. Anywayz, I agree, this is one of the Beatles' greatest songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nand this was probably said before but the come together, etc. part was from a campaign slogan for... i don't remember who. it might have been timothy leary, but i think im wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nSomebody said that this song has no reference to drugs, shooting coca-cola? Yeah, you must've missed that. Anyway, this song is great even though i don't understand it.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nIt's about a man who can't do much, who can't play football, who quit his job, but he knows that everyone is free and needs to come together for peace or for drugs and he is content with that feeling. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI feel the song could be about a new age Jesus, rolling up in his car, looking kind of shabby, and preaching \"Come together over me\". But in the corrupted state of humanity, his water to wine trick is full of mud, and when he tries to heal the sick, he's actually the sick one himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nNot the actual song meaning, of course, but Paul is Dead theorists like to point out the words in verse four:\n\n     \"One and one and one is three\n     Got to be good lookin' cause he's so hard to see\"\n\nAs evidence that John is trying to tell us about Paul's demise cryptically in the lyrics of this song. One and one and one is three Beatles, as Paul is no longer around, and the impostor has got to be good looking because it's so hard to see the difference between him and Paul.\n\nDisclaimer: I think the Paul is Dead Theory is total bullshit, just thought it was worth mentioning.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis song is AWESOME, and I'd like to take this moment to reflect on how pissed off at Micheal Jackson I am.  Jerk.  Was the playing of \"Come Together\" really needed in the McDonald's commercial.  Paul should've beat him up instead of just ending the musical partnership.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think that Aerosmith did a great job covering this song but Steven Tyler is no match for John Winston Lennon.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI totally agree with you Julia, Lennon4ever!\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nIt is full of references to drugs and tripping. Maybe the references were to drugs used in the British Isles. It is still one of my favorites. \t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI heard there were many references to the \"death\" of Paul in this song. 'He say \"One and one and one is three\" ' I heard that meant that only 3 original Beatles remained. But we all know Paul never died...or did he? \n\n\n", "comment_23": "\nDon't forget it is John Winston Ono Lennon\n\n\n", "comment_24": "\nYes, the Dr. Timothy Leary thing is true... however.  Timothy Leary was actually tied to the FBI... he would report people that were selling drugs and the such... thereby eliminating his competition, and so on.  a great politician!\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nWhat a song to sit back and groove out to, really mellow and makes u wanna move...a classic\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nalthough i think ladymadonna123 is right...\r\nwhat i have come up with in my sick mind\r\nis that it's about people forgeting there\r\ndifrences and \"comming together\"\r\nbecause all of the stuff in the song is\r\nso hippacritical.. but hey...  ladymadonna123's\r\nmakes more sense\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI always thought it was more about 2 people, one a druggie and the other a prick, who hated each other becoming friends because they were both friends with the same person...That's happened to me a lot and some of my best friends were met through other friends...I duno, maybe it's just cause i didn't get all the drug references cadaver mentioned...\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\neveryones first intention on a song is drugs, oh this sounds like drugs, this too, well I can vouch for that but this is a mystery for the meaning, but some songs must remain the same.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ncadaver, the bag production = baggin weed is pretty farfetched, considering \"Bag Productions\" was Yoko's thing.  and dodelson, where did you hear that?  I've read firsthand accounts by the Beatles managers and recording engineers saying the definately did. In fact once John was so drugged up during a session that he started to get sick.  the manager of EMI (i think) didn't know he was on drugs and wanted to get him some air.  outside the studio was flooded with groupies as usualy so he brought John up to the roof and left him alone.  When the rest of the Beatles found out where he was that freaked out because they knew he was on drugs and might jump from the roof. Luckily nothing happened.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI always kinda thought this song was about lennon asking people to \"come together\" around hippies and their flower power stuff. All the lyrics kinda describe a unkept hippie with dreds and a few drug addictions. \"...you got to be free\", all that kind stuff seems like a description of a sterotypical hippy. But the underlying idea is peace and harmony.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI have one theory of this song's lyrics.  Each verse is describing one of the four band members.  \n\r\n1:Ringo- the easygoing, level headed one in the group\n\r\n2:George- the spiritual, naturist, searching for universal knowledge, and freeing your mind(and can wail his monkey fingers on a guitar neck)\n\r\n3:John- the walrus, life now centered around his wife \n\r\n4:Paul- the good looking one, having the group's mojo going by keeping them together.  It could also have a reference to him \"dying\", now that it's impossible to see him buried, as he pleads for one, one, and one to \"come together over me.\"\n\r\nof course, i could be wrong...\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThis song is mainly just about coming together. I think toe-jam football is a medical term.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nAre you crazy?! Aerosmith trashed this song! 'Come Together' is the Beatles song, and only they could make it sound good.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThis song is about en.wikipedia.org/wiki/…>bukkake, a Japanese sex act where a bunch of guys come on a womanâ\u0080\u0099s face.  \r\nLike a lot of other things, Yoko â\u0080\u009cexportedâ\u0080\u009d it from Japan and turned John onto it. \n\r\nThis song is about a particular drug-filled orgy they had, where Yoko ordered:\nCome together right now over me\r\nat the moment of highest pleasure.\n\nHere come old flattop he come grooving up slowly\r\nrefers to one of the guys in particular, and his special stroking technique.\n\njoo-joo eyeball is getting a particularly globby wad in your eyeâ\u0080¦\n\nHe wear no shoeshine is another guy who didnâ\u0080\u0099t use lube. \n\r\nâ\u0080¦and so on.  I could go on, but Iâ\u0080\u0099ll let you all figure the rest out for yourselves, plus itâ\u0080\u0099s kinda making me sick dissecting these lyrics.  \r\nI know what you're thinking:  John Winston Ono Lennon was a bit of a sick fucking genius.\n\r\nOh, and this is Paul's best dubbed-out bassline...\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThe lyrics to this song are pretty bizzarre, but after reading all the postings, I think Fotodave and Chinup have the most plausible explanations.  So - this song is a description of each of the four Beatles, coming together over Yoko Ono's face!  Well I don't think John would stand for that and I don't think Yoko Ono would want a song written about that.  But it seems to make some sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nthis is my favorite beatles song and i heard it hundreds of times what makes the most sense to me is that each verse is about one member like someone already said and the last verse about paul and it does hint about him leaving/dieing \"1 and 1 and 1 is 3 got to be good looking cause he's so hard to see\" imples tha there is only 3 beatles left and pauls replacement looks a lot like him and its hard to tell the difference. I'm not sure about the refernce to Muddy Waters Does anyone know what it is? the other line is \"Hold you in his armchair you can feel his disease\" i dont get that one eather \r\nthanks\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI don't know who's right and who's wrong about what this song means, but I like it and I don't think we'll ever know for sure unless we somehow ask The Beatles last member.  I think Chinup's description is just gross and I don't think it's about that.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI hav to admit that this song rox but umm ryanilano11 thats an awsome thing the shoot me thingy i neva would hav noticed that. i think the songs bascially about a homeless dude that they were making fun of while on drugs...lol but wut do i kno.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nSurely he's just on about him and his experiences.  Some drug ref's some not.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nid like to think its about a 3some 'come together, right now, over me' johns fantasy of 2 chicks lol oooeeer\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nwhats with the \"come together right now, over me\" part?? it sounds very sexual to me....hhmmm\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nit's a really great beatles song and i'm going to have to agree with the theory that this song is about the band  it's 4 members. and the one and one and one is 3 part makes sense since john really does says shoot me he kind of whisper's the me part or maybe it's just my ears misleading me.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\n\"He got muddy water he one mojo filter\" i just realized: a reference to Muddy Waters.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI think it's a look at the types of people who promoted hippie culture, yet the irony exists in the fact that though 'come togeather\" is stated numoursly in the songs descriptions, none of the characters ever do that. Come togeather over what? Drugs?\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\ngforce---\r\ni think come together means no bigotry and work together\n\r\nlauraisme and touchmyinfection--\r\nget a grip.  it is SO NOT sexual.  and it is definently not a 3some.  no laughs there, ur not funny.\n\r\npeace and love\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nIn the intro of the song if you listen very closely, \r\nyou can hear John Lennon whispering \"shoot me\"\r\nvery creepy...\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nHey is it possible that this song is about Jesus?\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI think this song is about a weird hippy that just can't take anything seriously (Got to be a joker he just do what he please)\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI'm not gonna try to tackle the whole song, but I've always wondered why \"he\" would say \"one and one and one is three\".  I just realized that maybe \"he\" is questioning religious doctrine, the Christian idea that father, son, and holy ghost are \"one god\".  Just an idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nFACT: Timothy Leary, the most well known and contraversial figure of LSD (acid) asked Lennon to write the song. Leary got busted before he could put it to use, so the Beatles put it to their own use in their own fasion. Basically the song was inspired by a request by Leary but that was as far as it went.\n\r\nI think the song in the end truned out to be more about Timothy Leary in a \"tripped out\" Beatles style. I think the reference to \"he\" through the song is a reference to Leary. Whether they meant \"That guy's a pimp\" or \"Ha, what a loser lost in his mind and now in jail\"... don't know\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nabout the \"shoot me\" thing, I'm pretty sure this is NOT John saying shoot me and is just more of his gibberish, like at the end of \"I'm So Tired\" where he says something like \"blism blism habitsa hoffin tidja tidja pleh.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nwispsoftime, the line is definitely armchair.  You can hear this very clearly in the anthology 3 version of the song.  Also listening to this version again for the first time in many years, I can also hear lennon say \"shoot\" most of the time, but occasionally he does say \"shoot ME\", so I guess I was wrong about the gibberish thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\ni think this songs mean that john liked chocolate ice cream and that he knew he would leave the Beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI heard once that if you took a bunch of LSD, years later when you cracked your back you could somehow release acid buildup and go on a trip. I don't know if thats true or not but thats what I think of when I hear \"he one spinal cracker\" in this song. Great song by the way.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI doubt this song has anything to do with this but it is my opinion. I think the song in some strange way is referencing the devil. I dont know why but its just the vibe I get when I hear the song. I'm not sayin The Beatles were demonic or evil, but I think this song is about the devil.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI have to agree that he says, \"hold you in his arms, yeah, you can feel his disease.\"  This lyric is often reported as one of the most famous mis-heard lyrics!  Besides, why would holding someone in an armchair allow you to feel their disease?  Holding them in your arms, close to you, would allow this, though!\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nas can be heard in take 2 of the song (on the anthology cds) the line ono sideboard was originally 'ono sideburns' and if you listen closely to the \"hold you in his armchair, you can feel his disease\" line it is ABOMINABLY CLEAR that John sings ARMCHAIR cause normally english speaking people don't pronounce 'Yeah' as 'ChÃ©'! However if you are insisting it may be possible that John originally planned to sing arms yeah but changed it because he wanted the line to make no sense at all!\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nand thinking along the lines of the widespread knowledge that the Beatles were especially articulate vocalists you can be sure that it is armchair, also the fact that it's printed like that in the blue album (the first beatles best of) sleevenote, can please (!) be enough to satisfy it. I'm sure john would've told people that it was wrong if it was!\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nfuck some people are dumb,this song was made for timothy learys campain or show opening(can't remember)(don't take my word for it google it).also as far as im aware your hair does not keep growing after you die and would not grow down to your knees,also anyone who thinks the beatles didn't take drugs is as stupid as they get.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI don't know, nor do i care, what this song is about. It is a cool mellow tune where you can just sit back and enjoy the bass and the drum beat. As far as the Aerosmith version goes, i'm trying to get hold of it now. But i'm sure it can't hold a candle to the Musical Genious of the Beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI like the theory of it being about the band members the most, but here's some of what I've heard before.  I've heard that this song was written by Paul about John, and I've also heard that it might be about the Indian guru the band visited.  About that Leary thing, I don't know...but I do agree that each line is about a single band member and the line \"come together\" is saying that the band is one.....\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nIke and Tine Turner do a pretty great cover of this song. Obviously not as good, but Tina Turner's shout & screetch vocals give it an interesting flavour.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI think the \"One and one and one is three\" line is to fuel the theory that Paul died in a car crash in Ontario. Hense Paul facing backwards in a Ontario Provincial Police jacket on the cover of Sgt. Peppers\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI knew what it meant before ever reading the lyrics.\r\nPlease, someone explain, how would one give an imperative order to reach a sexual climax to a partner, with fewer words, than Come Together.\r\nlol, peace out\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI'm glad I'm not the only one who reckons that \"Come together, right now, over me\" is about some blokes jizzing on a womans face >_<\n\r\nMe and a mate were discussing this song and that was our main guess, we also thought each verse could be about a member of the band?\n\r\nMaybe John wrote the song so it had two meanings?? if so he's a genius. But heh, I'm more than likely wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nJust a sidenote that I just thought of.\n\r\nOn some Live album of John Lennons he does this song, and at the beginning he says \"I'm sure you all remember this song a lot better than I do\" and I think it might have been Ringo that replies or maybe george \"All I remember is here come old flattop\"\n\r\nMaybe hinting that they totally were bombed making this album and laughing about it?\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\none of the the most AWESOME songs ever sung by the beatles frm THE FINAL BEATLES ALBUM (abbey road was recorded AFTER let it be). also 1 of the best of all time, btw.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nthis song is all about drugs. But he says \"shoot me\" at the beginning, but it didn't at all lead to his death. Mark Chapman was just a fucking lunatic who deserves to get his fucking black, cold heart ripped the fuck out of his motherfucking torso for what he did to lennon.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nThat's the spirit, liveandletdie! Although I really disagree with your comment on Lucy In The Sky With Diamonds. I'd rather not bring it here. :) Peace, liveandletdie. I love your screenname by the way. Very Paul-ish.\n\r\nI agree with liveandletdie here. Even though I'm not sure about the f words. I don't say those words. hehe.\n\r\nI think it's the only thing about The Beatles that I regret. Along with Geoge's death. But then John was taken away very early. Without warning.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nDidn't Chuck Berry originally write some of the lyrics to this song? and I think John Lennon used them and was later sued. I think it was in that 'Hard days write' CD.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\ndidn't really read the other posts, but I always figured it was just a song full of random goodness and never really cared to analyze it until a bit ago when I thought that maybe it was about some people who are so different, but in order to do something they have to forget thier differences and come together\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nThis song is awesome!, but this song is about how one of the band members died and they will come together in heaven that's why in the background you hear them say shoot me.  Beatles Rock!\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\n\"Come Together\" contained several alleged clues that Paul was dead in the lyrics. \n\r\n\"He got hair down to his knee\" is taken by believers to refer to the claim that hair and nails continue to grow after death. \n\r\n\"He wear no shoeshine\" is taken to refer to Paul being barefoot on the cover. \n\r\n\"He got toe-jam football\" is taken to refer to rugby, a sport Paul liked to play. Called a toe-jam football, because when you used your finger to wipe out the toe-jam, it would roll up into a shape similiar to a rugby ball.\n\r\n\"He got monkey finger\" allegedly refers to the thin frail fingers of a dead body.\n\r\n \"One and one and one is three\" allegedly refers to there being only three \"remaining\" Beatles. \n\r\n\"Got to be good looking\" is believed to refer to McCartney as the \"cute\" Beatle. \n\r\n\"'Cause he's so hard to see\" supposedly refers to the faded memory of someone who is now gone.\n\r\n \"Come together right now over me\" supposedly refers to the scene over McCartney's grave as the mourners come together. \n\r\nAdditionally, the song's chorus when played in reverse is supposed to become \"Heave ho...and now...Oh, thank the smoke\"; interpreted to mean that they were lifting Paul's crashed car but thankfully the smoke obscured their view of Paul's body from the inside.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI always just liked the way it sounded and never really thought much about it. Once I was listening to the Aerosmith version with my dad and he was like \"can you imagine what that guy would look like?\" so i tried and i just shook my head and said \"weird, that's for sure\". but i agree with some of the earlier comments about this song being about each of the Beatles individually. But then again, msrmx350's comment makes a lot of sense too.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nLots of people are going totally nuts over this. \n\r\nYes, it was originally intended to be a campaign song for Timothy Leary---who was going to run for Governor of California.  If that's the case, who is the \"he\"---your opponent---and who is the me? \"Timothy leary\".\n\r\n\"One thing I got to tell you you got to be free\r\ncome together over me\" --- come support me, i.e. Leary, and my party and cause.  \n\r\n\"me\" is Timothy Leary.\n\r\nSo, who is \"he\"? Who is \"ol flattop\"? \r\nThe Republican running for governor, of course:  Ronald Reagan. \n\r\nHe had a flat-top hair style, the type that right wing conservative people had and appealed to in that era.  He was  a good looking but vapid, very right right wing movie star turned governator who severely suppressed the student movements in the California universities. \n\r\nHe say \"I know you, you know me\"\n\r\nIn other words, Ronald Reagan's campaign and appeal was based on tribal politics of white conservative fear of hippies and minorities, as well as being numbingly simplistic.\n\r\nHe say \"One and one and one is three\"\r\nGot to be good-looking 'cause he's so hard to see\n\r\nAgain, RR's simplistic and obviously vapid campaign slogans, relying on his charismatic good looks to hide an intellectual and moral emptiness. \n\r\n\"Hold you in his armchair you can feel his disease\"  What else needs to be said?\n\r\nRemember, Beatles were indirectly political and very symbolic. \n\r\nSome of the other stuff is probably confusing mumbo jumbo (as the song was altered) or pointless, or things I don't understand yet.   But I'm quite convinced most of it's about RR.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nHe actually does same \"shoot me\" at the begining.  There is a  loud hand clap sound over \"me\" and it sounds a bit more like \"shoopity\" to me.   I listened to the Beatles a lot as a kid, so that could just be my mind trying to make sense of it.  \n\n\r\nThis song was inspired by Timothy Leary's campaign, but Leary's arrest got in the way of that.  \r\nWhen John says \"Here come old flattop\" he's refering to Leary looking professional as a doctor and politician, but in the third line, he's basically calling Leary a hippie.  Leary did a lot of experiments and stuff with marijuana and mushrooms, he encouraged people to take acid to hallucinate.  75% of his test subjects had life changing revelations.  He encouraged people to believe in their own god. \"One thing I can tell you is you got to be free...joo-joo eyeball he one holy roller\" ...tripping and seeing God!\r\n\"Hold you in his armchair you can feel his disease\" Leary was a psychologist, and the drugs or lack of drugs is the disease...with these people, I'd think that they were talking about the lack of drugs.  \n\r\nYoko Ono owned Bag Productions.  Bagism is a term which was created by John Lennon and Yoko Ono as part of their extensive peace campaign in the late 1960s. The intent of bagism was to satirize prejudice and stereotyping. Bagism literally involved wearing a bag over one's entire body. According to John and Yoko, by living in a bag, others could not judge you by the color of your skin, the length of your hair, the clothes you wore, your age, or any other such attributes. It was presented as a form of total communication. Instead of focusing on outward appearance, the listener would hear only the bagist's message.\n\r\n\"He say 'One and one and one is three'\" that line just makes me laugh.  I think of a first timer who makes all the sense in the world, but it still sounds stupid.  \n\n\n\r\nI know that it's irrelevent, but when John says \"He say 'I know you, you know me'\" I think of Bill Hicks' comedy bit about getting busted on acid.  Hicks says \"i'm me, he's him, you're you.\"  \r\nWell, it's something like that, this was all well before my time.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nGreat song...I thinks that's more than enough.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nthe he shoot coca cola reference may be in reference to the scene in A Hard Day's Night on the train where he actually sniffs a can of coke.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThis song really caught me off guard. Its usually really easy for me to picture songs..however, not this one..but, after alot of research and thinking, i realized, there may just be no meaning to the song at all, it was the 50-60's...the drug years...we dont know what was going on with these mens minds at the time...lets just leave it at that :)\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\njohn lennon was not on acid at the time he wrote this song. He wrote it for Timothy Leary as his campaign song when he was running for gov. of california. Put that in your pipes and smoke it.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nBe it about leary, drugs, two different people connected through a common friend, tow people climaxing together, or just nonsense, its an awesome song.\n\r\nLove the Bruce Springstein and Axl Rose version.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nI actually think the song is about Lennon himself...with references such as \"Got to be a joker he just do what he please (probably meaning what people thought of him in terms of his other song lyrics) and other references seemingly about yoko ono (He got Ono sideboard ) I also think the line \"Come together right now over me\"..is him referencing the unity people would take on in both loving this song and trying to decipher it as well lol\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nthis song i heard was one lennon wrote to help support Tim Leary the maker of LSD in a slogan to support use of it. he asked lennon to write a song to help support it, and this was johns song, singing that LSD can help ppl come togather :) Amen john good job ameeeeeen :)\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nActually I always thought this song was about god being, or his appearance as, a mortal man â\u0080¦\r\nâ\u0080\u009cGot to be a joker he just do what he pleaseâ\u0080\u009d\r\nâ\u0080\u009cGot to be good-looking 'cause he's so hard to seeâ\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThis Theory has been confirmed my two of my grandfathers friends and him: This song is about each member of the Beatles, each member to a stanza, and how they needed to work out their differences to keep the band together\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI thought the \"shoo--\" was just a neat sound they came up with to accompany the AMAZING percussion in this song. I mean, it the drum rolling up and back down thing...it feels like a you're swinging. But at one point in the song Lennon is taking a breather or something and doesn't do the \"shoo--\" thing and it just sounds lacking (still amazing, but without the sound I can see why they added it). It brings the drums in more and is a sly feeling transition from voice to drum. I't's almost like shh, introducing Ringo. Or like, when you start to swing (on a swing-set) you start off on the ground and swipe your feet up to go into the motion. It seems like that kind of transition to me. And as for the rest, it sounds almost like they're making fun of someone. The campaign thing makes sense, since it definately seems to refer to a drug dealer, but then the things he says to the people in his speeches (that's what I assume the \"he says\" refers to) are so simple and while it would be telling the people that he is a friend and one of them, it also makes him seem slow. \"I know you, you know me...one and one and one is three\" and the \"got to be good looking cause he's so hard to see\" could be Lennon's humor coming into the campaign. People vote based on looks, it's true, on some degree. Nixon, while turning out sorely disappointing, from the perspective of the voters in his first run for presidency, was better suited for the job than his opponent, but wasn't elected on some level because he looked unfriendly. So here, Lennon is saying that, while you can't see much of him (because of his bushy hair covering him as I'm sure would have been the case), he must just be good looking underneath it all.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nOh, and \"One thing I can tell you is you got to be free. Come together right now over me.\" The hippie-guy is telling the country to come together over him, ending the war, agreeing on things, and the one thing he can say for sure is you've got to be free...free from the draft, free to do drugs, free to live on your own terms. idk. i seriously only thought of all this as I wrote it. Before coming here I had no idea what this song was about lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nwhy didn't they include the \"shoot me\" John repeadedly whispers before each verse in the lyrics?\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nI was listening to Chuck Berry's \"You Can't Catch Me\" and there is a line in that that says \"Here come a flat-top, he was movin' up with me\" and it's said exactly in the same manner as Lennon sings in this song. I can't help but think he was influenced by Berry's song in some way.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\ni agree with  ladymadonna123 except i believe the firrst verse is about George, the second about Paul, the third about John and the last about Ringo\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nOne of the Beatle's best songs, John's best written. Har to do a verse/refrain format and of course they pulled it off perfectly.\n\r\n The lyrics are essentially easy to understand. Each verse describes a different form of musician at that time.\r\n The first the 'flat top' is a reference to the brand new 'Southern Rockers' who were appearing at that time.\r\n Verse 2 is a picture of the glam rockers who were also just getting started.\r\n Verse 3 is about Lennon himself, complete with 'Ono sideboard.'\r\n The fourth verse is about the dying image of the fifties rockers, the ones that Lennon idolized. The 'Teddy Boys.'\r\n All four of these characters are said to Come Together. Lennon is recognizing how the music world has changed around him and is continuing to change. He just asks that they all Come Together.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nsome of this song also refers to the \"paul is dead\" mystery i.e. \"one and one and one is three (3 beatles left)\" and also \"come together right now over me\" could be interpreted to standing over a grave (paul's of course) luckly the whole thing was a hoax, paul is amazing and so are the rest of the beatles...\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nin reply to butterfingersbeck, there is drug related themes such as \"he bag production\" is an ovious reference to cocaine, plus heroin \"he shoot coca-cola\"\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nDamn .Were any of you born before the Beatles split up? The song has four Stanzas, of which each one\r\nreresents one of the Beatles. They are, in order:\r\nGeorge, Ringo, John, Paul. The song was written\r\nasthey were breaking up.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nGreat song. N I def think it has to do with drugs. Joo Joo eye balls is like dialated pupils, holy roller is like rollin joints, coca cola is coke.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nIt think Lennon is talking about himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\ni think john is singing about a guy that his girlfriend cheated with..and \"come together over me\"is a sexual reference saying that john is still part of the relationship...butthen again im REALLY high right now..and i think too much when im high\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nOne explanation: Drugs. Randomness. Awesome song though, I don't want to downplay it's awesomeness.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nThis makes no sense. He says to come together and then right away gets hostile and says \"over me\" as in \"over my dead body\". Greatest band of all time, my ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nen.wikipedia.org/wiki/…\n\r\nCan't trust wiki but why not.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nthis song is a sketch of some kind of tramp/wanderer/misfit preacher man. perhaps Lennon if he wasnt famous. this man rejects straight society and spouts wisdom to unintrested Nixon America. Lennons language was wild and original in describing this character. not necersarily drug induced, as Lennon had been writing this sort of stuff since childhood. \"come together right now over me\" is undoubtedly a sexual reference.  possibly a suggestion to make love not war. Lennon was in tune with the most cutting edge youth politics during the late sixties.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nHere comes old 'quilt', he comes grooving up slowly.\r\nHe's one Holy Roller.\r\nHe says I know you, you know me.\r\nHere comes old 'depression', he got early warning.\r\nHe's one mojo filter.\r\nHold you in his armchair, you can feel his disease.\r\nHere comes old 'anxiety', he roller-coaster, he shoot coca-cola.\r\nHe say one and one and one is three.\r\nCome together right now over me.\r\nOne thing I can tell you is you've got to be free.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nIt is flattop. But yea I'm pretty sure this song is eaither about some hippy or it's about John Lennon (hence, \"he got Ono sideboard\") but whatever. Still an awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nis it just me, or does this song give off a sensual vibe?\n\r\nwhen i hear this song, i'm reminded of sex. \n\r\ni'll probably loose my virginity to this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\n^Um, no, I don't think so.\n\r\nI agree, dahwk, it's gotta be about John, but the song being about the four of them makes sense too.\n\r\nWHAT IS UP WITH YOU PEOPLE AND CRACK?! Maybe they were high, maybe they weren't, but that's not the answer to everything.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nCome on everybody, besides John's ability to spin lyrics together a lot like Edward Lear (case in point I Am The Walrus) don't you think he was having us all on. Just picture John in a threesome going, \"Come together, right now, over me.\" Another example of his cynical view of women which he tried to cover up by going all \"feminist\" when he met Yoko!\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\n...anyone ever consider that it's about the four Beatles themselves?\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nOh. 'joo-joo eyeball' = the red eyes you get from smoking pot. Marijuana? Mari-JU-ana in a Liverpool accent?\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\num...no. It's \"juju,\" an African word for spirit or aura.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nThis was written about each of them, like the Beatles themselves. Kinda weird, but I love it.\n\r\nI have the lyrics to this tatted on my arm!\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nAwesome song, although I like the cover by Yellow Matter Custard better.\r\nThe lyrics are about the Beatles themselves:\r\nThe first verse discribes George (Hair to his knees), the second Paul (Toe jam football, no shoeshine), the third John (Ono, walrus) and the last Ringo (so hard to see).\n\r\nJohn does say Shoot me, but the 'me' was drowned by the riff, although if you listen closely, you can hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nI read tons of analysis on the Web about â\u0080\u009cwho was the walrusâ\u0080\u009d, â\u0080\u009cdid Paul really dieâ\u0080\u009d.  â\u0080\u009cwhere are all the hints and cluesâ\u0080\u009d.  Yes, the Beatles put this stuff there for a reason and that reason was to get you to listen to their lyrics in hopes that you would see their real message.  There were hidden messages in their songs and on their album covers, one of which I guess at below, but they were mostly about starting a new world of love and peace.  Iâ\u0080\u0099m trying to get your attention by using some of the lyrics from their songs.  It shows a progression from an attempt to actually bring people together in LA or possibly Haight Ashbury to live in love and peace, to accepting that it just didnâ\u0080\u0099t happen as they thought it would .  \n\r\nSadly, George expressed his prophetic mind as he sang in Blue Jay Way, â\u0080\u009cplease donâ\u0080\u0099t be long or I may be asleep.â\u0080\u009d  His final words before he died were â\u0080\u009clove each otherâ\u0080\u009d. He never gave up his dream.\n\r\nThe Beatles werenâ\u0080\u0099t Gods, just flawed human beings who tried their most to make this a better world.\n\r\nWhat were the Beatles  up to?....what's this about a Walrus? Paul is dead? He looks ok. I don't get it. But wait........ \"Half of what I say is meaningless\", \"but I say it just to reach you\"...who? Julia? That doesn't make sense. Did John really mean he was trying to reach us? \r\nHow about George?. \"There's a fog upon LA and my friends have lost their way\", \"and I told them where to go\".  I remember something about the letters on the Sergeant Pepper's album saying \"BE AT LESo\". People guessed it was Leso island and they wanted all the hippies to meet there. They guessed Paul was buried there. But Paul looks very much alive to me and there's no such island named Leso. It must mean something else. Was he calling all the hippie brothers and sisters to join in LA?\n\r\nThen there's the back of the Abby Road album: .The letters also look to be offset... \"BE AT LES\".  â\u0080\u009cThere's a fog upon LA and my friends have lost their wayâ\u0080\u009d!  \"BE AT LES\"....LOS ANGELES! , \"BE AT los angeLES!\",  How clever of them. Now this could make sense!....\"Come together right now\", \"Please don't be long\", \"all you need is love\", \"we can save the world\". \"one thing I can tell you is you've got to be free\", \"come together, come together\", \"I want you so bad it's driving me mad\". Come together at LA  and join us to create a new world of love and peace. \n\r\nBut, it never really happened. \n\r\nThey lament: \"they've lost themselves instead\", \"I don't know why... nobody told you how to unfold your love\", \"I don't know how... you were diverted\", \"I'm crying,....... i'm crying\". \n\r\nFast forward:\n\r\nBut that was \"soooo long ago\",... \"was it just a dream\", \"seems so real to me\". Maybe we should just \"let it be\". let's just \"Imagine\" this world of love and peace, some day \"there will be an answer \"when all the broken hearted people in the world agree\" , \"you're asking me will my love grow\" \" I don't know\", \"you stick around now it may show\". \n\r\nMy conclusion:\r\nThis may all sound farfetched but not as farfetched as believing Paul is dead.  Thereâ\u0080\u0099s a reason why Blue Jay Way is such a mysterious sounding song and there are many secret messages in the background( if you listen carefully with earphones). This song actually disturbs many people and itâ\u0080\u0099s because they sense its mystical message.\n\r\nAfter forty years people still suspect that the Beatles were up to something.  I hope this post at least gets people thinking in another direction because Paul isn't dead and the Walrus stuff is meaningless. (except the \"everybody's smoking pot\" repeat at the end of the song).\r\nEven if it wasn't an actual call to come to LA certainly all their songs are about  joining them in a new world of universal human love and peace, not a Walrus, or Paul's death or John's mother or yoko Ono.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nim convinced the 3rd stanza is about John and the 4th is about Ringo, but i cant figure out the first two.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\n\"Got to be good looking cause he's so hard to see...\"  Has got to be one of the most hilarious and clever lines written by John.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nBeatleInsight has cool ideas...i like them a lot whether or not it's all completely true.  \n\r\nBut I am the Walrus is NOT meaningless.....actually I think it's meaning fits very well within your theory....it's about well...there are some good posts on the i am the walrus site.  the wikipedia article is also a decent place to start\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nbut probably the best way to get what I am the walrus means is to watch bono sing it in across the universe with as clear a mind as possible....\n\r\nmaybe watching the magical mystery tour will help clear up the meaning too... the i am the walrus video is on youtube, and it makes it's meaning somewhat clear...\n\r\nbut the across the universe movie helps you understand it because it provides much of the historical context...but the meaning is still relevant today\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nalso...i don't think it's \"everybody smoke pot\" although it could be...certainly could be a suggestion to help with the understanding. \n\r\ni think it's \"everybody haha.\"  but both actually fit with the meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nGeorge, Ringo, John, Paul.\n\r\nIn that order.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nok why in every comment i read on a beatles song do people talk about John Lennon...there were three others..is it just that that is the only beatle people know or what...plus Paul McCartney co-wrote this song with John Lennon it wasnt just John's song\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nI know that John wrote this but it sounds like it's about himself, in vague references...\r\nespecially bag production (he was a somewhat leader)\r\nwalrus gumboot (apparently I am the Walrus related to his life)\r\nOno sideboard (he married Yoko Ono in the year the song was released)\r\nhold you in his armchair you can feel his disease (Beatles often said that some of John's depression or anger shown outward).\n\n\n", "comment_121": "\nWhat butterfingersbeck said on 03/18/02 was accurate.  The way it went down was, on the day his conviction was overturned, Timothy Leary announced his candidacy for Governor of California, running against Ronald Reagan. His campaign slogan was \"Come together, join the party.\" On 1 June 1969, Leary joined John Lennon and Yoko Ono at their Montreal Bed-In and Lennon subsequently wrote Leary a campaign song called \"Come Together.\"  Leary was also present when Lennon and his wife Yoko Ono recorded Give Peace A Chance during one of their bed-ins in Montreal and is mentioned in the lyrics of the song.  He's actually a really interesting guy, I recommend his book 'Flashbacks', or check him out on wikipedia or something. He's really interesting to read about...to summarize...he's a shrink who prescribed LSD in studies he performed!\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nThe song is about pot parties where people got together and smoked weed\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nI heard John first wrote it for Timothy Leary, then he re-wrote it for the Beatles. And apparently every verse is for one Beatles (my guess, 1 - George, 2 - Paul, 3 - John, 4 - Ringo)\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nor maybe 2 - Ringo and 4 - Paul. I cannot decide.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI don't believe so much in the drug theory for this specific song not to say that Lennon wasn't on something when he wrote it, but is main focus for this song is NOT drugs.  I have heard theories of the different lines being about each member of the band, examples: \r\nJohn~ \"He bag production, he got walrus gumboot\" John is the walrus \" He got Ono sideboard, he one spinal cracker\" obvious reference to Yoko, \"Hold you in his armchair you can feel his disease\" This refers to when John was sick in the hospital and Yoko held him while she sat in an armchair.  \r\nThe last paragraph obviously focuses on Ringo because he is so hard to see (you know behind that drum set) one and one and one is three because he keeps the beat and so on and so fourth.\r\nI would say the second paragraph refers to George as the monkey fingers being his skilled hands with the base\r\nthat only leads the first paragraph for Paul.\r\nThis theory makes sense because there is only four paragraphs and they all relate, I think that this song being about drugs is complete rubish I see no drug references in this song just a story of four band members coming together as one!\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nyeah i think this song is talking about the different ppl in america and how every1 really needed to come together and bring peace to the nation b/c the nation was really scewed up back then, obviously nobody ever took that advice and look at us now!\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nfor anyone who's heard of the \"Paul Mccartny is dead\" myth(search it on google if you haven't) this song leaves clues that tell the story. the myth is that paul died in a car crash and tehy replaced him with a different person. \r\nexample: \"come together over me\" refers to the funeral and coming together over his grave.\r\nthe \"abbey road\" album cover also show clues such as a car in the backround is headed for paul also a liscence plate on a car says lmw28if. LMW stands for linda mcCartney weeps and 28 if means he'd be 28 If he lived.\r\noverall a Great song a great band and a great myth.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nI thought verse one was George, verse 2 = Paul, 3= John, and 4= Ringo.\r\nThis is why I thought this:\r\nGeorge was the most religious, so calling someone a holy roller was slang back then (still is for that)\r\nGeorge usually had the longest hair and was the first to grow it out longer that the mop top.\r\nGeorge seemed to have one eye a little more droopy than the other.\r\nJoker - I  don't know what that is about.\n\r\nPaul - toe jam from the barefoot picture. Football is a big joint and we know how Paul would like to light it up. Coca-cola- Paul admitted to the media to using drugs other than just weed. Monkey finger might be a reference to his ability to play nearly any instrument. (monkey see monkey do) Quoting him poeticey would mean he speaks out, he has something to say as in lyrics like a song writer does. Paul wrote lyrics or poems that became songs.\n\r\nJohn - the Ono on the side comment (John had been married to someone else). He once said that he told everyone Paul was the Walrus to further confuse them. Does that mean John is really the Walrus? He wrote a song stating \"I am the Walrus\".\r\nPerhaps he had a scruffy armchair they all made fun of that they teased you could get a disease by sitting in it - that is just a guess because he had a funny sense of humor.\n\r\nRingo - he is a roller coaster (mood swings). He got early warning -you can easily tell when his moods are switching. He got muddy water - Muddy Waters was a blues musician.  Maybe he liked that music or maybe it refers back to his moods again (being blue)\r\nHe say 1 + 1 + 1 is 3. Would mean that he is the drummer and he keeps time (or the count) for the\r\nband.  Has to be good looking (which he is) because you can hardly see him way in the back of the band behind everyone else.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nthis is a great song, and who knows when it comes to the beatles it can be pure random-ness or actually mean something to one [or all] of them. \t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nHahaha, I was such a prude when I first visited this site.  I don't have a problem with Chinup's \"bukkake\" explanation anymore, although I find it unlikely--bukkake didn't start showing up in Japanese pornography until the 1980s.  Still, I now agree that John could easily have \"stooped that low.\"\n\r\nThe explanation of each verse referring to one of the Beatles makes sense to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nJohn Lennon wrote this song for Timothy Leary as a theme song for his run for governor of California. Yes, he's one funky dude - he got juju eyeballs! a holy roller! he just does what he please. he got feet down below his knees - cool! Come together, under me (most politicians think they are ruling OVER the people), right now! Come together. \t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nthis song sounds to me like a final attempt to tell each other to come together \n\r\nthere are many phrases used to name each Beatle  \n\r\nJohn:\"He got monkey finger, he shoot Coca-Cola\"(remarking his \"interest\" in cocaine), \"He got Ono sideboard, he one spinal cracker\"(umm we all know that Ono),\"One thing I can tell you is you got to be free\"(Ono seems much like a jail) \n\r\nPaul:\"Got to be good-looking because he's so hard to see\"(noting his most notable quality to women), \"He bag production, he got walrus gumboot\"(his comercial interest, and a phrase in Glass Onion \"the walrus was Paul\") \n\r\nGeorge:\"He got joo-joo eyeball, he one holy roller\"(for his interesting spiritualism),\"He got hair down to his knee\"(thats kind of literal) \n\r\nRingo:\"He say, \"One and one and one is three\"\"(mocking his poor education), \"He roller-coaster, he got early warning\"(noting his first early departing from the band)\n\r\nand so on \t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nI think it's really about the rock'n'roll drug counter-culture.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nOne of my least favourite Beatles song and also one of the most conspicuously Lennoneque (I am a McCartney Partisan).  I think it is piece of Beat poetry put out 10 years late.  Kerouac was already dead by this time.  \t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nFirst of all I want to start by saying to everyone-Please stop putting drugs into all of your explanations. I realy don't think that The Beatles spent most of their days stuck in a drug filled haze. It is pretty hard to fully function when you are perpetually stoned. I grew up in the 60's and became a teen in the early 70's and I went throught that phaze of my own life. If you want the truth watch the movie \"Imagine\". John explained that the song was inspired by Bob Dylan who told John to write nonsence lyrics because people, like you, will almost always interperate it wrong. It was a goof. It doesn't mean anything. It is a bunch of nonsence sentences that were put together. It was meant to mess with your minds and as I can see it worked. Now here is some thing that is totaly true about this song. It was the last number one song recorded by the Beatles as a band. This is a known fact. The whole Abbey Road album was the Beatles allowing Sir George Martin to once again do his studio magic. Before that John had told Martin \"We don't want any of that studio crap any more, we want to just record it straight as we play it\". This is what was said before they did the Let It Be tapes. Martin would not produce them anymore if he couldn't work his studio magic and the band realized that they need him to do his thing. Trust me I am one of the biggest Beatle fans here. If you want drug fueled stuff check out the \"Rubber Soul\" album. They did this right after Bob Dylan turned them on to pot. This and \"Revolver\" And yes it was Dylan who smoked the first joints with them and Dylan that exposed them to weed. Peace. \t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nthe most important thing about this song is that we come together. maybe john was not giving a dam about how we do it, as long as we realize the true meaning of life. to share and grow together. thats why only the chorus has meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nseriously whether trippin or not, john is trying to convey that it does not matter how we come together as LONG as we come together. thats why the chorus is as impacting as it is, and the verse means nothing. It doesn't matter how we do it as long as we are together and come together in harmony and peace.  love each other kids, that's the start. forgive each other, that's the test of true testicular fortitude. haha Love you all out there. Come together. right now. Over Peace. Everyone deserves happiness.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nand def one of the coolest songs they did. Peace to all.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nI dont understand how so many people can dimiss the meaning of these lyrics!!!!! You cant always take everything literally. Read it once through, and try to look at the big picture. Dont be so close minded. \t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nguys it's a straight up love song! listen to it in that context and it makes perfect sense! i'm surprised no one's realized this!\n\r\nlook:\n\r\nHere come old flattop, he come grooving up slowly = he's got a flat top, drivin up real slow\n\r\nHe got joo-joo eyeball, he one holy roller = he's high (red eyes), he's in a gang\n\r\nHe got hair down to his knee = he's a hippie (or he's rebellious) it's contradictory but i think this is more of a personality than physical trait, but a possible physical manifestation of such\n\r\nGot to be a joker he just do what he please = he breaks the rules, he's a bad boy\n\r\nHe wear no shoeshine, he got toe-jam football = he's scruffy, he's got athlete's foot (he probably wears no socks)\n\r\nHe got monkey finger, he shoot Coca-Cola = he black? (i really dunno), he shoots coke\n\r\nHe say, \"I know you, you know me\" = he's cocky (straight pickup line)\n\r\nOne thing I can tell you is you got to be free = break free, come away\n\r\nCome together right now over me = come with me (we'll be free)\n\r\nHe bag production, he got walrus gumboot = he deals, he's got (i can't remember the drug, but it's a drug)\n\r\nHe got Ono sideboard, he one spinal cracker = he's got sideburns that yoko likes, he's an addict\n\r\nHe got feet down below his knee = he's not head over heels, he's more settled\n\r\nHold you in his armchair, you can feel his disease = when he holds you in his arms you can understand him and be with him and share with him, essentially protect and understand him\n\r\nCome together right now over me = now she's helping him get over it and get better\n\r\nHe roller-coaster, he got early warning = he's very unsettled now, he's constantly moving and busy, he's been like this since he was young\n\r\nHe got muddy water, he one mojo filter = possibly that he likes muddy waters?, he smokes and he's cool\n\r\nHe say, \"One and one and one is three\" = he wants to have a baby\n\r\nGot to be good-looking because he's so hard to see = he's a good looking guy, and he took forever to find (kinda like he better have been good looking, since i've been looking all this time)\n\r\nCome together right now over me = come together, let's fuck, let's get married, etc\n\n\n\n\n\n\n", "comment_141": "\n^^ Wrong\n\r\nFirst verse is about Harrison (he's one holy roller)\n\r\nAlso, the 'John Verse' says 'He bag production', referring to Yoko & His idea of 'bagism'\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\n \r\nthis song is about them.\r\nold-flATtop is ringo(the oldest)\r\nmonkeyfinger is george(do melody so unusual)\r\nbag production is john(well, should i explain?)\r\nand so hard to see(problably he's dead) is paul, my SirMcCartney\n\n\n", "comment_143": "\nyoure all wrong every verse is about a member of the beatles the first is ringo he was the last to join \"he come grooving up slowly\" the second is george because he never wore shoes and he was very talented with all instruments with strings \"monkey finger\" the third is john because he was frequently with yoko ono he \"Bagged Production\" and the last is paul because he frequently said he was going to quit the band but always changed his mind \"roller coaster\" and \"1 and 1 and 1 is 3\"\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nEach verse is about a different Beatle, but Verse One and Two have me confused. The Joker part makes me think Ring, but the rest shouts George. Verse two sounds like Ringo, but the \"I know you....\" Par sounds like something George would say...? \t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nI couldn't tell you what this song means, since I STILL haven't a clue, but one thing interests me.\n\r\n\"he shoot Coca-Cola\" reminds me of the moment in the 'A Hard Day's Night' film when John was sniffing his Coca-Cola just to get a reaction from the old man sitting next to him on the train. Hilarious moment. I wonder if that's what he referred to.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nno this is just an awesome song by the beatles. Ringo fuckin Starr, man I tell you that is some of the best drummin ive heard in my life\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nK, heres me with my twisted thinking of the song,\n\r\nThe songs saying we should come together, its just not happening...probably wrong, but hey, what can you expect from someone with severe mental problems?XD XD XD XD XD\n\r\nGeorgia rules\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nI think this song is about drugs. I mean, I don't do drugs but I've seen people on tv that are high and/or drunk and they usually just say really random things that make no sence whatsoever. the lyrics are really random, so I'm guessing it's about drugs, about being high, maybe?\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nI'd always had the feeling that in some way this was another of John's songs dissing the Maharishi, but couldn't quite put my finger on why.\n\r\nThe interpretation that each verse is about a different Beatle is intriguing, though...\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI'd always had the feeling that in some way this was another of John's songs dissing the Maharishi, but couldn't quite put my finger on why.\n\r\nThe interpretation that each verse is about a different Beatle is intriguing, though...\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nJust to show that one can find lots of meanings in lyrics (especially John Lennon's) Below is my \n\r\nanalysis of \"Come Together\" where I show how the song is referring to Jesus Christ and not just \n\r\nthe four Beatles.\n\r\nC O M E   T O G E T H E R  by  The Beatles\n\r\nHere come old flattop,            With a halo He would be a \"Flattop\" or look like a \"square\"\r\nHe come grooving up slowly,       His popularity developed over 30 years \r\nHe got joo-joo eyeball,           Jew-Jew eyeballs - He was a Jew - Luke 2:21\r\nHe one holy roller,               Holy roller - rolled away the stone - Acts 4:27, Mark 16:4\r\nHe got hair down to his knees,    He was a Nazarene who wore long hair - Matt. 2:23\r\nGot to be a joker,                In cards a Joker trumps a King  (King of Kings)- Rev.17:14\r\nhe just do what he please.        He's God. He can do anything - Matt 19:26\n\r\nHe wear no shoeshine,             Wears sandals not shoes - Mark 6:9\r\nHe got toe-jam football           Another reference to bare feet - John 13:10\r\nHe got monkey finger,             Jews ate with their hands (fingers) - Mark 7:3\r\nHe shoot Coca-Cola,               He was popular and drank the popular drink of the day - wine\r\nHe say, \"I know you,              John 5:42\r\nYou know me\",                     John 7:28\r\nOne thing I can tell you is,      Luke 18:22\r\nYou got to be free.               The truth will set you free! - John 8:32\r\nCome together right now over me   Refers to His ascension - Acts 1:6\n\r\nHe bad production,                Or is it \"bag\" production? Rulers thought He was \"bad\"\r\nHe got walrus gumboot,            No meaning in Walrus and gumboot - Anything spiritual here?\r\nHe got Ono sideboard,             This has meaning only if Ono was praying to Jesus (The Judge)\r\nHe one spinal cracker,            Refers to a Chiropracter, \"Hand Healer\" - Mark 6:5\r\nHe got feet down below his knees, A pun. He had 2 feet (24\") below his knees as others kneeled\r\nHold you in his armchair,         When you are close to Him; He was a carpenter - Mark 6:3\r\nYou can feel his disease.         Sarcasm - you can feel His power - Luke 8:46\r\nCome together right now over me   Acts 1:6\n\r\nHe roller-coaster,                Oscillation refers to Jesus is the Light - John 12:35\r\nHe got early warning,             He warned of the coming judgment - Col.1:28\r\nHe got muddy water,               He used spittal and clay (mud) in healing - John 9:11\r\nHe one mojo filter,               He is the only \"filter\" to God the Father - John 14:6\r\nHe say, \r\n\"One and one and one is three\"    Refers to triune God (Father, Son and Holy Ghost) - 1 Jn.5:7\r\nGot to be good-looking            All the pictures seem to paint Him that way - Matt.17:2\r\nBecause he's so hard to see.      Jesus is invisible now as God is invisible - 1 Tim 1:17\r\nCome together right now over me   Acts 1:6\n\r\nIn His Grace,\r\nA Believer\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nthe song is about having a party (hippies were the usual people in those days) some poor dude is coming, some druggy person , a flat top (nickname?) all descriptions of people coming together , including the person that is sick in mind and you get sick by being in his space).\ncome together over me means gather at my place, the message in the song is : let us all be as one (even with the bad people) like we are when we gather (at a party\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nI've always associated this song with Brian, the Beatles manager, and his deterioration which led to his death. Joo-Joo eyeballs? They were always making fun of Brian Epstein being Jewish. Brian's drug use went from taking uppers along with the Beatles, to Cocaine, to Heroin. He went from a well dressed businessman with a flat-top haircut and eyeglasses, to a man with \"hair down to his knees\"\r\nAlthough this could be the 4 Beatles and Brian, there's definitely some stuff about Brian in these lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nTwo things, for those who don't know:\n\r\na.)  Juju = a form of tribal witchcraft.\n\r\nb.)  Sideboards = sideburns/facial whiskers, in Liverpudlian parlance.\n\r\nThus, if the third verse is about John, it means he kept Yoko so close to him that they could not be separated. (Or she was always \"in his face\") ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nThis song is awesome. The way I see it, it's kind of calling out Paul McCartney in a very discrete way for not being one of them anymore. \n\r\nThe song was written right after Timothy Leary was arrested for marijuana, and Lennon was pissed. It would be likely to assume that Paul McCartney, who didn't get try LSD until a couple years after Lennon/Harrison, was much less pissed.\n\r\nAs always discussed, each of the verses seem to be describing one person. But I think the flow of the song is much more important, as well as the contradictions between the verse about Paul McCartney and the rest of the verses. The first two verses, about Harrison and Starr respectively, come back to back with only a short guitar riff in between. There is then a short break before Lennons verse, where he notes that Yoko Ono might be drawing him away from the band (\"he got Ono sideboard,\" \"Hold you in his armchair/you can feel his disease). After this is a long guitar solo, followed by a seemingly accusatory verse about Paul McCartney. \"He Roller Coaster\" could refer to the rocky relationship between Lennon/McCartney, \"He one mojo filter\" seems to say that he takes the magic out of things, \"he say one and one and one is three\" accuses him of excluding John from recordings and leaving three Beatles, and the line \"Got to be good looking cause he's so hard to see\" indicates that McCartney was rarely around anymore, but was producing good music when he was. \n\r\nThe first three verses also have some sort of drug reference, and seem to separate McCartney as the odd man out. Harrison is \"groovin up slowly, he got joo-joo eyeballs\" which could be referring to the slow come-up on acid and the extremely dilated pupils that follow. Starr \"shoots coca-cola\" and \"one thing [he] can tell you is you got to be free.\" Lennon is a \"spinal cracker\" which may refer to the myth that LSD is permanently stored in your spine, and cracking your back may cause flashbacks. \n\r\nThe best part about The Beatles is how you can never quite tell if they were being cryptic or just producing nonsense to mess with their fans. This is one of those songs that could go either way, but I think its relation to Timothy Leary's arrest makes it too good of a political opportunity for Lennon to have passed down with a nonsensical pop-hit. \t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nThe song could easily be a description of John Lennon's encounter with extraordinary Professor Timothy Leary in 1969. At that that time Leary was 49 years old, hairy from head to toe, had bulging eyes, long sideburns, was good looking, and wanted to be  his generation's guru.  At one time President Nixon called him \"the most dangerous man in America.\" I attended a lectue of his in my college days where, sitting in the lotus position, absolutely mesmerized an audience of several thousand students. He preached being free and comming together and the famous \"Turn on, tune in, drop out.\" The following weeks many of us joined in protests against the war and for civil rights.  He was quite active in the black civil rights movement and had lived in Alabama. So I'm sure he was familiar with rocknroll (roller coaster), muddy water, mojo etc.too. John started the song as a campaign song to promote Leary but may have ended up just giving his impression of the man. Peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nIn the seventies the Beatles were number 1 psychedelic band all over the world. Why ? For many reasons. Their music was good and strongly inspired by Buddy Holly. They were good musicians, but not number 1. Their lyrics were truly original and incredible. They could say terrible things, but had the ability to not create any alarm or scandal. Every song by the Beatles can apparently have many meanings. However no metal band is as hard and explicit as they were. They possessed great abilities. Or were they possessed ?\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nIt's nice to know that I'm not the only one who thought it was originally at the four members of the Beatles - four verses each describing a person and it is obvious that the guy in the last verse isn't the same as the ones described in the previous verses - it seems to point to four different people - I've often thought it but it was po pooed but people. My brother pointed to the Q analysis which thought that the lines \"got to be a joker, he just do what he please\" where about the Marharshi and Lennon's disillusion with him. \r\nThe first verse fits with the Marharshi and possibly even the second but the second two certainly don't - thinking about it I think it's a song about the people Lennon was trying to disassociate from - the first verse is the Marharshi and then come the verses about George, himself and Paul - the roller-coasting could be a variant of railroading - and one and one and one is three and got to be good looking are John saying Paul is overly logical and boring - only interesting to anyone who fancies him. \n\r\nThe only thing that jars with this is the negative picture John paints of himself - he doesn't come across as a self-efacing guy in any of the accounts of him I've read.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nThis song is about a guy who starts really straight, not orientation but 'so square he has corners' kind of thing.  (He come up flat-top = buzz cut- really clean, neat).  He begins to be more 'hip', and ends up doing lots and lots of drugs.   Contextually, it fits into the societal frame of Vietnam, and how a lot of soldiers came back on heroin.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nI am recently looking into my own stuff. What with being the adult child of an alcoholic father, I have come to see that this songs lyrics may well be the description of the manifestation of either direct or indirect sustance abuse on each of the members of the beatles. The last 3 line of each verse describe a way of being which could be a result of substance abuse.\r\nIt is a warning to me of the pervasiveness of substance abuse and how it transcends people families and generations. We all want to be happy but substance is not the way to achieve ones greatness. Awareness is the way. The Maharishi was instrumental in showing them the way out through transcendental meditation.\r\nTranscendental Meditation and substance abuse are not compatible.\r\nSubstance abuse leads to an all about me structure in the mind.\r\nIrresponsibility prevails. Not easy to live with that in a partner.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nalways thought this song was about the devil for some reason.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nWell my understanding of the lyrics, based on reading them, the history of Abbey Road the album, the the deception that John created for the death of Paul, is that each verse is on one of the Beatles, as they appear crossing the road.\n\r\nFirst verse is John, the preacher (holy roller)\r\nSecond verse is Ringo the Undertaker ( one thing I can tell you is you got to be free )\r\nThird Verse is Paul, the dead man (feet below his knees.....feel his disease)\r\nLast verse is George the grave digger. ( simple man who says one and one and one is three )\n\r\nNote that Paul is out of step with the others and is bare footed.\n\r\nThis is the original interpretation after the discovery of the list of clues, from Day in the Life through to John ultimate admission of the hoax on the Imagine album.\n\r\nVery complicates Lennonesque lyrics, which is why John was truely the heart and soul  of the Beatles, and Paul the outward pretty image. A brilliant combination that makes the so unique.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nWhenever I listen to this, I get out of it a song about Britain making fun of America, making fun of how simple they think we are.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nDidn't John write this song for Timothy Leary? He was running for Governor and his campaign slogan was Come Together Join The Party.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nThis song is obviously about having a threesome with a cool cat. He's just too awesome :p\n\r\nTruth. The lyrics speaks for itself. There's no deeper meaning to it :D\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nIt's a mixed combo of 3 things:\n\nThis is what hippies look like.\nThis is what hippies do.\nThis is what it feels like when you're getting high.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nBeing a bit pervy, I can't help but to think the double meaning of the title could be \"cum together\" and \"come together.\"  After all, it is well known that \"Hide Your Love Away\" was about John's nascent bisexuality and affair with a man.  And, because \"cuming together\" is all about love, it could be John's feeling that the Beatles should just have group sex to resolve their differences, especially when it comes to the evil Yoko.  And that's not even mentioning the obvious sex/drug double meaning of \"Happiness is a Warm Gun.\"  Aside from this, many people appear to believe each stanza alludes to each Beatle (the insect, the car, or referencing drum beats?), and there is more than enough evidence to see that this is one layer of the song.  I always related to the line \"Got to be good looking cause he's so hard to see,\" as I am shy, withdrawn, uncomfortable with emotions, introverted and in my younger years got much needed attention due to my looks.  Funny how your mood and your person history intersect with the though-stream of the artist in unique and powerful ways.  I still can't believe John was a wife beating, emotional child abusing narcissist.  How can that be?   \n\n\nHere come old flat top\nHe come groovin' up slowly\nHe got joo joo eyeballs\nHe one holy rollers\nHe got hair down to his knee\nGot to be a joker\nHe just do what he please\n\nHe wear no shoeshine\nHe got toe jam football\nHe got monkey finger\nHe shoot Coca Cola\nHe say I know you, you know me\nOne thing I can tell you is\nYou got to be free\nCome together, right now\nOver me\n\nHe bad production\nHe got walrus gumboot\nHe got Ono sideboard\nHe one spinal cracker\nHe got feet down below his knees\nHold you in his armchair\nYou can feel his disease\nCome together, right now\nOver me\n\nHe roller coaster\nHe got early warning\nHe got muddy water\nHe one Mojo filter\nHe say one and one and one is three\nGot to be good looking\nCause he's so hard to see\nCome together right now\nOver me\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nCullen Gilliland \n\nCome together By Beatles \n\n     This famous song by the even more famous band the Beatles, contains four verses in it which depict each of the four Beatles members. The first verse is about Ringo star the drummer of the band. They describe him as â\u0080\u009cGroovin' up slowlyâ\u0080\u009d referring to his inability to play the drums up to par as the Beatles when he joined the group. Also they say â\u0080\u009cHe got to be a joker he just do what he pleaseâ\u0080\u009d which refers to him being the group clown and tension releaser of the Band. The second verse is about George Harrison the main guitarist of the group. They described him as â\u0080\u009cMonkeyed fingeredâ\u0080\u009d which means he was very good with all musical instruments including the unknown sitar which he mastered and used in many Beatles songs. Another thing they said about him was â\u0080\u009cHe shoot coca-colaâ\u0080\u009d which means he shoot up into his blood stream cocaine, all the Beatles did use this drug, but this was Georgeâ\u0080\u0099s favorite. The Third voice is about John Lennon  who was one of the leading singers in the band. They described him as â\u0080\u009cBad productionâ\u0080\u009d because he had been doing so many drugs it was effecting his ability to make amazing music like I am the walrus and how odd the song script was. Also they said â\u0080\u009cHe got feet down below his kneesâ\u0080\u009d Meant he would never yield to authority because he was to stubborned and arrogant about his ideas and views. The fourth and final verse in this song is about Paul McCartney One of the main guitarist and singers of the group. They said he said this to them â\u0080\u009cOne and One and One is threeâ\u0080\u009d which means he wanted to leave the group, but they could still be the Beatles without him. Another thing they described hims was â\u0080\u009cGot to be good looking because he is so hard to seeâ\u0080\u009d Which was referring to how good looking Paul was, but that he was rude selfish person deep inside.  \n\nIn the end you cant help but see the irony in this song. The song title is â\u0080\u009ccome togetherâ\u0080\u009d yet each of them gets ridiculed by the others in there personal verse showing how torn apart the group was and why this was the last album the band every made together. They let drugs and selfishness tear apart arguably the greatest band of all time. There songs will forever live on and are still listen to and loved to this day its just sad they broke apart at the peak of there popularity.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nWhen John says he's \"got feet down below his knees\" I think it means that he's incapable of kneeling to anyone, that with \"he's one spinal cracker\" goes to show it's his way or the highway. which is what inevitably what happened.\n\nfor the longest time I never knew this song was about the beatles themselves. Amazing song.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nthe song is about drugs.\n\"Here come old flattop he come grooving up slowly\"\n- the drug dealer has a pimp hat on that has a flat top\n\"He got juju eyeball he one holy roller\"\n-he has round dark glasses on that look like jujubees candy and a holy roller means someone that is extra cool\n\"He got hair down to his knee\"\n- fur coat\n\"Got to be a joker he just do what he please\"\n- man, the guy is an hour late and he's just taking his time getting here...I want my drugs NOW\n\n\"He wear no shoeshine\"\n -suede shoes  \n\"he got toe-jam football\nHe got monkey finger he shoot coca-cola\"\n-now we are getting the names of the drugs he has and he can also shoot coke into your arm if you want\n\"He say \"I know you, you know me\"\n- I know you are famous but I too am famous to my clients\n\"One thing I can tell you is you got to be free\"\n- in other words turn on, tune in, drop out \n\"Come together right now over me\"\n\n\"He bag production'\n- dealer separates the drugs into baggies\n \"he got walrus gumboot, He got ono sideboard\"\n- again naming the drugs he has available\n \"he one spinal cracker\"\n- yeah, a good hit will whip your spine like a chiropractor\n\"He got feet down below his knee\"\n- John is high and finds it funny that the dealer has feet below his knees (like trying to catch your hands when you are high)\n\"Hold you in his armchair you can feel his disease\"\n- the dealer doesn't look healthy after doing so many drugs\n\"Come together right now over me\"\n\n\"He roller-coaster\"\n- when you take uppers and downers together you roller coaster up and down\n \"he got early warning, He got muddy water\"\n-naming drug names again\n \"he one mojo filter\"\n- yes, drugs will filter your mojo, or personality\n\"He say \"one and one and one is three\"\n- $100 plus $100 plus $100 is $300, counting the money to pay for drugs\n\"Got to be good-looking 'cause he's so hard to see\"\n- John is too high to have a good look at the dealer any more\n\"Come together right now over me\"\n- this one I won't touch with a ten foot pole\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nCan anyone comment on the opening of this song, the words SHOOT ME, over and over, other than a drug reference?   When I first heard it, I thought it was rather prophetic, no offense intended.   I guess he had it both ways - he probably shot himself up and indeed, somebody did shoot him!   Any ideas?   Do those words connect to the rest of the song in any way?\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nI've always believed the line;\n'hold you in his armchair, you can feel his disease'\nJohn is actually singing:\n'hold you in his arms yeah, you can feel his disease\nthe lyrics as written by the Beatles were never officially kept or published and John often used 'yeah' while singing, mostly as a way to provide syncopation in a phrase\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nI agree that the lyrics have multiple meanings. One is that yes they do refer to the members of the band, another interpretation is that each verse refers to a different drug. The first being marijuana, the second being coke, the third being acid, and the fourth being heroin or multiple drugs as almost every line can be interpreted as drug references. It can be interpreted as having an std, being well endowed and having sex. It can also refer to the 4 base ethnicities of caucasian, negroid, asian, and indian. And lastly the lines can go back and forth describing the people on both sides of the Vietnam war. Ultimately, music is an art, and in all art; it however YOU interpret it. \n\n\n", "comment_174": "\nThis is the coolest song of Beatles!\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nbest beatles song and my favorite by far.  the beat totally puts me at ease an the lyrics combined with lennon's voice is truly an experience\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nWhat was he smokin'/ingesting when he wrote this???\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nJohn just liked to write nonsense stuff, it doesn't have any drug meaning or anything else like that.  It is a great song, and people should stop criticising the Beatles just because the did drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nRandomness is the art of tripping. John wrote this song to take the piss. He was probably sick of fans misinterpreting his songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nCome Together started life as a campaign song for the Timothy Leary roadshow when he decided he was going to run as Governor of California against Ronald Reagan Snr.\n\r\nLeary's slogan was \"come together, join the party\", the \"come together\" alluding to I Ching, the Chinese book of changes.\n\r\nTwo of the lines referring to Old Flat Top were taken from \"You Can't Catch Me\" by Chuck Berry, and John was later sued for plagiarism. The matter was settled when John promised to record 3 songs belonging to the publisher of \"You Can't Catch Me\".\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\ndid you guys ever relize the john lennon says \"shoot me\" he whisperes it..and i am thinking but i know this is not true..but i think that this led his path to getting shot on December 8th 1980\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nBeatles are the greatest...many questions left unanswered the way they had intented though....\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nBobo 192 is RIGHT \r\nIts about promoting LSD and John was interested and wrote the song, (something like that) read Bobo 192's comment!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nNo ryanilano its not. I dont think he intended to die on that day! This song's biggest selling point is that awesome bassline paulio came up with!@\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nDid you guys know that the Beatles NEVER ACTUALLY did drugs?\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nthis song is soo fucking money! it's the shmickest beat ever! everyone has to see A Bronx Tale, when Chaz Palminteri is walking the street to this song it's like, damn! this is smoothe!\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\noh i LOVE this song. someday i will be able to sing along and know all the lyrics by heart. lol i <3 these ppl for their randomness.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nThis is for dodelson...What are u talking about the beatles never actually did drugs. They wanted to ban John from the United States for being caught with marijuana.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nthis song is so cool. thats the only way i can describe it. lennon was a genius. no one else can write lyrics like that, no one. my favorite line is \" he say, one and one and one is three, Got to be good lookin' cause he's so hard to see\" great song\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\ni agree with johnnyb. and, all of their songs have meaning, no matter what. it could possibly be about the beatles. that's an interesting thought. i usually just like to sit and sign really loud to it and appreciate it\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nYou guys should listen to the Aerosmith cover of this song. The Beatles did this song good but Aerosmith did it better.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nRingo's drumming during the pre-verse sections is very interesting, and a very cool rhythm.  It's definitely my favorite beat.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nThis is not the best song they did but the second best. the first is maxwell's silver hammer\r\nsigned\r\nthe beatles best fan\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nGreat song. I hate Aerosmith shitting all over it.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nnope\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nSome Ways this Could relate to Paul is Dead:\r\n\"Here come old flat-top\" could be referring to his decapitation (after all, there would only be a flat stub of a neck)\n\r\n\"Hair down to his knees\" Your hair continues to grow after you die.\n\r\n\"Come Together Right Now Over Me\" The beatles coming together around Paul's grave\n\r\nWhatever. That's complete bullshit.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nSimultaneous orgasms?\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nI really like the song but i dont like john lennon i like his voice and his songs          \r\nGREAT SONG THO!! the beatles are my favoritest\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nYeah, this song is obviously about bukkake. Just listen to the noises during the guitar solo. That would explain the \"shoot me\" bit as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nthis song is so fucking awesome! especially when the guitar solo comes, god it's so soothing!!\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nIf the song doesn't make any sense, does that mean there are druggie references? Oh, come on.\n\r\nI'm sick and tired of people saying that! That doesn't mean that if they took drugs the songs with no meanings has a druggie reference.\n\r\nWhat's important? It's the MUSIC! I love the drums!\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nI mean \"hard days write' book. good read\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\njust a great song/ end of story.\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nin Cirque De Soleli, it was Here comes the sun and it was so wonderful and then it transitioned to Come Together . So awesome. i love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nmust say, I don't know why but I love this song. plus, it gave me the idea for my account name so yeah.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nha when i was little my grandpa would come home drunk and play this song over and over\n\r\nIts definatly amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nI just wanna say that dude Chinup is a fucking perverted sicko. Seriously. I mean it's a damn funny interpretation of the song but I don't believe it for a second. It's just damn wrong. And the fact that he seems so sure about himself just lets me know hes the kind of guy who enjoys that kinda porn, and probably tries to associate anything with the word \"come\" in it with a bunch of guys busting on a girls face. Chinup you make me sick.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nI just wanna say that dude Chinup is a fucking perverted sicko. Seriously. I mean it's a damn funny interpretation of the song but I don't believe it for a second. It's just damn wrong. And the fact that he seems so sure about himself just lets me know hes the kind of guy who enjoys that kinda porn, and probably tries to associate anything with the word \"come\" in it with a bunch of guys busting on a girls face. Chinup you make me sick.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nI BELIEVE THIS SONG REFERS TO THE BEATLES AS A WHOLE,THE FIRST LINE IS ABOUT RINGO,THE SECOND ABOUT GEORGE-THE MAN MIGHT I ADD,THE THIRD ABOUT JOHN AND THE FOURTH ABOUT PAUL11 AND MUST I REMIND ALL OF YOU JOHN IS NOT THE ONLY BEATLE!!!\n\n\n\r\nI strongly agree.\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nSomething about this beat just catches you. God I love this record. I could listen to this forever and never get tired of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nHe say, \"One and one and one is three.\"\n\r\nJohn is describing how there are three Beatles left - Paul is dead man, miss him, miss him, miss him.\n\r\n-Cheef\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nI heard this song on the Guitar Hero commercial and it is now the only Beatles song I like.\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nI didn't realise until I got the beatles rock band game that in the chorus Lennon actually says \"kill me\" each time the bass comes back in.  Strange\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nits about bukake. you know, where a bunch of dudes all put there stuff on a girls face. \n\r\n\"cum together\r\nright now\r\nover me\" \t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nClearly, this song is an account of one of the Beatle's experiences in a drug-related threesome. It centers on one participant of this threesome, another male. The Beatle, who is at this moment in time essentially a spectator, observes the actions and physical attributes of this male and watches in fascination as him and the other participant come together right over him - this could mean that the two physically came together in the act of sex, or that their orgasms occurred at precisely the same time, right over him.\n\r\nHere come old flattop, he come grooving up slowly\r\nHe got joo-joo eyeball, he one holy roller\r\nHe got hair down to his knee\r\nGot to be a joker he just do what he please\n\r\nThe song begins, like much of the rest of the song, describing attributes of the male the song is centered on. He is described as grooving up slowly, with red eyes from excessive drug use (which is, no doubt, the only reason this threesome happened in the first place). He has long hair, as was characteristic of many hippies in that era, and was quite a joker in the sex scene, doing whatever he pleased without fear of repercussion. This could imply some kinky habits in his sex life.\n\r\nHe wear no shoeshine, he got toe-jam football\r\nHe got monkey finger, he shoot Coca-Cola\r\nHe say, \"I know you, you know me\"\r\nOne thing I can tell you is you got to be free\n\r\nThe man, now characterized as a hippie, is further personified to this point: he wears no shoes, shoots coke and believes in the ideals of free love. He is someone the Beatle knows, reminding him that they know each other and that therefore whatever happens in that room is all right. His monkey fingers prove him to be adept in the act of manual sex, also.\n\r\nCome together right now over me\n\r\nAt this point in the song, the two being watched come together (for the first time?) over the Beatle, who continues to watch in fascination.\n\r\nHe bag production, he got walrus gumboot\r\nHe got Ono sideboard, he one spinal cracker\r\nHe got feet down below his knee\r\nHold you in his armchair, you can feel his disease\r\nCome together right now over me\n\r\nThe man is suggested to be a drug dealer. 'Walrus gumboot' implies that he can afford to buy expensive things but chooses not to for the sake of keeping up his hippie repertoire; the boots could also involve his love of kinkiness. He has sideburns and practices rough sex, enough to crack the spine of his partner. The man, who is promiscuous, undoubtedly has numerous STD's. \n\r\nHe roller-coaster, he got early warning\r\nHe got muddy water, he one mojo filter\r\nHe say, \"One and one and one is three\"\r\nGot to be good-looking because he's so hard to see\r\nCome together right now over me.\n\r\nThe rough sex continues; it is suggested that the man gives early warning to when he is going to climax. His sweat mixed with his hippie filth produces a sort of muddy water effect, glistening all over his skin. His mojo, or magic spell, illustrates his unbeatable power in sex and seduction. \r\nThe man then points out that there are three participants, though only two have been partaking in most of the action up to this point, and that the Beatle needs to take part in the sex. What happens next is unclear, though some sort of sexual act occurs involving the Beatle in which the Beatle can no longer view the man directly - I won't illustrate this scene; you can imagine it yourself. The participants of the threesome come together, both in the physical and climactic sense. It truly is a poetic scene.\n\r\nSex can be a truly poetic experience; I love how different and laid back its portrayal in this song is. It's one of my personal favorites.\n\r\nDude McGuire\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nAll you cleaver might be right, but I present you a different and couragous meaning:\n\r\nIt's about a frusturated porn actress. At least the chorus is.\n\r\nFo sha (For sure - 'Superbad' all rights reserved)\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nyou wanna know what this song is about? Boo, splim, splam, yellow submarine, the devil's parsley, railroad weed, the old ally babba, side salad \n\r\nP.S. If you do not know what these titles mean, watch monk! (Mr.Monk visits a Farm)\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\npeople here trying to interpret are wasting their time\nJohn was free associating with many thoughts and being silly\nmuch of it is about the Maharishi\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nI agree for the most part with the theory that each line describes a Beatle, I would just like to add that on the fourth line , Paul's, when it says \"got to be good looking because he's so hard to see\" Paul and Lennon were at school together and in school photos  children are usually in height order meaning the tallest children would be put at the back. Paul is the tallest member of the band ,maybe John is saying he had to be good looking because he's so hard to see because he would of been nearer the back at school making him harder to see. on the other hand it could be out of bitterness. despite being the tallest member of the band paul isn't actually that tall , he's average height in the UK, meaning all the other band members were under average height including John . in this context it could mean that he's got to be good looking because he's average height and amount tall men would be hard to see, however I personally think it likely references him being at the back of a school photo. in all honestly I alway felt this line was about George because George was the quiet one but many people were into the fact that he was quiet ,teenage girls at the time, however none of the other lines in the verse really match up with it being him and the second line seems to fit much better and Paul fits better to this line.  hope you enjoyed .\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nthere is no meaning to this song...but it is by far the beatles best song\n\n\n", "comment_220": "\nThis is an easy one to understand.\r\nThe lines ''Come together, Right now, Over me'' speaks for it self.\r\nCome''Cum'' you know...he was gay or something. maaan. i am so deep.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nOkay first things first, hve you guys realized that theres no proof that paul is daed so stfu, second John is singing the song so it makes no sence if he says come together over me means come together over paul...and they tried keeping it a secret by supposedly having a \"new paul\" for a reason...they wouldnt make it that obvious...think ppl\t\t\t\t\n\t\t\t\t\n\n"}