{"comment_0": "\nI think it's about her bipolar, because it reminds me of my own. people find mental illness really hard to understand, especially when it involves risky or out of control behaviours, it scares them. I like this song most because she doesn't paint herself as the pure victim - it's kind of an empowering song, about not being ashamed of it and about not being defined by it. For me, anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis reminds me of The Yellow Wallpaper.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI feel some serious Jessica Jones vibes, especially with the line \"Who is in control?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI, personally, believe this song is about a person with multiple personality disorder. \n\r\nIn the lines \"I can't help this awful energy\" and \"God damn right, you should be scared of me\" it seems as if there are multiple 'people' speaking, with one being meaner, and the other try in counteract the more negative voice. \n\r\nFor the line,\"Who is in control?\" The person singing is questioning which 'person' is actually controlling themself. \n\r\nLastly, in these four lines, \"I'm well acquainted with villains that live in my head, they beg me to write them so they'll never die when I'm dead. And I've grown familiar with villains that live in my head, they beg me to write them so I'll never die when I'm dead.\" The person is (possibly) keeping a sort of journal, or diary, that they write about this other personality. It may be that they are 'Immortalized' by being written down, and telling others about the 'Demons'. This especially rings with the \"So I'll never die when I'm dead\" as the person is talking about themself. \n\r\nWell, that's just a theory. A song theory! \r\n(Game theory reference aside, don't take this as the 'real' interpretation of the song, I'm merely a bored 12 year old, interpreting a song I like.)\n\r\n:)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think sending her away to find riches means 'they' see her as a larborer \r\nMore than just the house is alive, shes trapped in the house with her own monsters\r\nShes alone with her thoughts and her mind is driving her crazy, she cant control it.\r\nShe cant control herself and at the same time she can, its incredibly confusing to describe, but if youre experienced it, it makes perfect sense\n\n\n", "comment_5": "\nI think this song is about an eating disorder. \r\nThe first verse is describing how someone gets hooked with an ED. â\u0080\u009cThey send me away to find them a fortuneâ\u0080\u009d reminds me of the promise from Ana (in my case) that Iâ\u0080\u0099ll be happy once Iâ\u0080\u0099m thin, all my problems will disappear. â\u0080\u009cThe house was awake, the shadows and monsters, the hallways, they echoed and groanedâ\u0080\u009d makes me think of the various triggers around my house that remind me of how â\u0080\u009cimperfectâ\u0080\u009d I am. \r\nâ\u0080\u009cI sat alone, in bed till the morning. Iâ\u0080\u0099m crying, â\u0080\u009ctheyâ\u0080\u0099re coming for meâ\u0080\u009dâ\u0080\u009d for me sleeping is an escape from the constant obsessive thoughts but then when I wake up in the morning they are right there again (theyâ\u0080\u0099re coming for me). \r\nâ\u0080\u009cI tried to hold these secrets inside meâ\u0080\u009d is about the struggle to hide the disorder. \r\nâ\u0080\u009cMy minds like a deadly diseaseâ\u0080\u009d anorexia can be a deadly disease so I think this is pretty on point. \r\nâ\u0080\u009cIâ\u0080\u0099m bigger than my body/ Iâ\u0080\u0099m bigger than these bonesâ\u0080\u009d is all about body image and how it doesnâ\u0080\u0099t matter how small I get Iâ\u0080\u0099ll feel and believe I look bigger than I actually am. \r\nâ\u0080\u009cIâ\u0080\u0099m colder than this home/ Iâ\u0080\u0099m meaner than my demonsâ\u0080\u009d is referring to how my self talk is sometimes worse than what Ana tells me. \r\nâ\u0080\u009cAll the kids cried out. â\u0080\u009cPlease stop, youâ\u0080\u0099re scaring meâ\u0080\u009dâ\u0080\u009d makes me think of how children sometimes stare at people who are extremely thin and sometimes they looked shocked or scared. \r\nâ\u0080\u009cI canâ\u0080\u0099t help this awful energyâ\u0080\u009d expresses how powerless I feel to this disorder. â\u0080\u009cGod damn right, you should be scared of meâ\u0080\u009d I always think people should be afraid of my mind because of how toxic and cruel it is. \r\nâ\u0080\u009cWho is in control?â\u0080\u009d For me my eating disorder is about control and starving makes me feel in control but since I feel often that I canâ\u0080\u0099t actually make the decision to eat without feeling awful about it it makes me question who is really in control? \r\nâ\u0080\u009cI paced around for hours on emptyâ\u0080\u009d is taking about the over exercising aspect. \r\nâ\u0080\u009cI jumped at the slightest of soundsâ\u0080\u009d this might be a bit of a stretch but I think of the word â\u0080\u009csoundsâ\u0080\u009d as gaining weight. And how scary of an idea it is to gain weight.  \r\nâ\u0080\u009cI couldnt stand the person inside me. I turned all the mirrors aroundâ\u0080\u009d both of these lyrics are very literal.\r\nâ\u0080\u009cIâ\u0080\u0099m well acquainted with the villains that live in my headâ\u0080\u009d being with the villain of Ana is typically a comfort and I know her very well. \r\nâ\u0080\u009cthey beg me to write them so theyâ\u0080\u0099ll never die when Iâ\u0080\u0099m deadâ\u0080\u009d reminds me of the desire to take photos to document the weight loss, so even after Iâ\u0080\u0099m dead people will be able to see the â\u0080\u009csuccessâ\u0080\u009d. \t\t\t\t\n\t\t\t\t\n\n"}