{"comment_0": "\nadorable(: \r\nBEST FRIENDS(: \r\n DEFG<333\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI dedicated this to my best friend <3\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni dedicate this to all the friends that have cared for me no matter what :) \r\nto the friends that know who i am but still love me, \r\nthe friends that i occasionally hurt but still are there when i am in pain. \r\nI LOVE YOU GUYS!!! \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\njust about being there for your friend and haveing somplete trust in them to be there for you. one of my favorites(:\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nwow! you guys had real good friends. but i've never had a friend like you did Angel. your very lucky to have a good friend!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nthis song is mine and my cousin/bestfriend song, we heard this song in florida and this song brings SOO much memory, i wouldnt know what to do without her <3 love you girl!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI love this song , this song I think about friends who are ready to help in times of trouble and vice versa , friends who help in hard times . At the time of going to provide a shoulder to cry we cry and the place will never say goodbye we need each other and I love the lyrics \"You can count on me 'cause I can count on you \" .\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nwhen i was junior high, i've ever sang this song to mybestfriend. and i really dedicated this song to her. because almost every activity that including in this song, like when she asked me for help,and i'll be there. when she got ill or headache or when she can't sleep, sometimes she asked me for sing a lullaby for her haha LOL, after that she could fell asleep :D i really miss that time when we were together. i know that she can count me. and she really believe to me, because i always make sure to her that she always have my shoulder when she cry. cause that what friend supposed to do :D\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song is so sweet :) it's about being able to rely on someone and they are always there for you through thick and thin\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\njust like my dearest friend \"SAHAR\"\r\ni hope all the people in the world have such a nice friend\r\nI love the lyric just bcouse of her\r\nlove u my dear:*:*:*:*:*\t\t\t\t\n\t\t\t\t\n\n"}