{"comment_0": "\n\"I'm the one that lost the view\"...........He made a mistake\n\r\n\"Everybody says we're through\".............The world knows she wont go back to him because of what happened.\n\r\n\"We can still touch the sky\"...............Hoping for something to happen \n\r\n\"Lend me one more chance\"..................Self explanatory\n\r\n\"So we'll crawl..Till we can walk around\"..\r\n.....keep everything on a low until maybe one day they can \"walk\" talk again.\n\n\r\n\"Then we'll run...Then we'll fly..Until there is no end\"\r\n.....when they do finally reunite...they run away where noone can get to them\n\r\n\"Back to love.\"............................Self explanatory\n\n\n\n", "comment_1": "\nI feel like this might be like an apology to rihanna maybe? he's asking for another chance\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni love this song it's so beautiful.\n\n\n", "comment_3": "\nthis song can be about any problem your having in the world. you can substitute love with something thatt means the world to you. this song makes you want to get backk on your feet and start over and make it better. have confidence in yourself and take baby steps bc sooner or later you'll be flyin'\r\nwhen i hear this song i think of my love life but most of all basketball;; i think of basketball bc i was so dangg good at it but then i ruined it and got surgery on my knee. so right now im crawling up to the point to be able to walk then soon be able to walk then run and sooner ill be able to jump and fly back on that court. it just takes time for it all to fall into place\r\nJbruinsma\r\ndont forget that name it'll be famous one day you'll see\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThisz song isz truly AMAZING.!!! He seemsz like he wasz REALLY into it. Itsz my personal fave.<3\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nit's just building something up again. beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI mean no one can say for sure, but it is pretty obvious he wrote this about Rihanna and their very public relationship problems. I think people assume because Chris Brown did that to her he's this horrible person, but this song shows that he really deeply cared about her and wanted to try to make things right, he's just a flawed person who messed up big time. The song is basically saying I know our relationship is hanging by a thread and I didn't treat you the way I should...but if you give me another chance we can start over with a clean slate. It's a beautiful song, no one can deny that, regardless of what you think about Chris Brown personally. \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song is really amazing. He realizes that he messed things up. From the first time I heard it, I was hooked. Im addicted to this song. I listen to it everyday. It reminds me of all the times I messed up and couldn't think of the words to say to fix it.... I wish I had this song then!!\r\nlove it.....\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthis song is just amazing. it explains itself. and i love it! i haven't stopped playing it. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nfunny, that's exactly what i thought when I first heard the song. especially hearing the first lines.\n\r\nanyhoo, this is a beautifully written song. i hate CB for what he did to rihanna but i feel bad about what's happening to him now in the music industry. It's so hard for him now to top the charts even with a kick ass song like this. Fans are boycot-ing him i guess. \t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI think this song is about a relationship that has gone sour. The guy obviously made a mistake in their relationship and he's recognized his error a little too late, but at least he has recognized it and now, he wants to make things right again for her-for them, and he wants the girl to give him another chance and he also understands that it's going to take some time to rebuild what they had before it all went amiss, so they are going to have to start from the bottom up, hence the \"So we'll crawl till we can walk again, then we'll run until we're strong enough to jump, then we'll fly until there is no end, so let's crawl....crawl...(crawl) back to love\" so, I guess he hopes that in the end love can conquer all and they can still have what they once had, and everything that they hoped to have.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ni love this song it's so beautiful.\n\n\n"}