{"comment_0": "\nI see others points about him being alive. But I think that the guy may have died, not from suicide though. I think he may have died when they were very much and happily in love. She was devastated, and it may have been months or even years since his passing and she hasnt moved on, when her friends keep pushing her to do so.\n\nSometimes she has the feeling that when she does leave earth to heaven that he wont be waiting on her. Every night she dreams of him and its a dark paradise because even though she loves him so much she knows it just a dream, and when she wakes up, she knows he wont be there.\n\n\"There's no remedy for memories\"  Theres not a cure for remembering something there's no way to get him out of her head, and she doesnt want him out. She can feel him touching her in her dreams, she wants to be with him so much she doesnt want to wake up.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nA song with the not uncommon topic of mourning a lost love, but damn if it isn't beautiful.  Best song on the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI may be a little crazy, but I kind of think its about a guy that doesn't really exist. A dream guy, who wont be in the world when she wakes up. \n\r\nShe wishes there was this guy in the world who will come and save her from her depression, but that guy wont ever be real.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI just logged in to say you guys are GREAT for reading her lyrics and trying to interpreting them, cuz we need artist like her. She is a sparkling light in music world and we need to SUPPORT Lana cuz you do get the fact that she does not get support from VEVO and the industry, in fact she is all we need to listen to and not all this other stuff that is not authetic! <3 peace and love\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nGot the digital booklet.\n\r\n\"That's how you sing it\" is \"That's how you sang it\"\n\r\n\"That's how we play it\" is \"That's how we played it\"\n\r\n\"And there's no remedy for memory of faces like a melody, it won't lift my head\" is \"And there's no remedy for memory, your face is like a melody. It won't leave my head\"\n\r\n\"Hunting\" is \"haunting\"\n\r\nThe \"that\" in \"But that there's no you\" doesn't exist.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThe song is all about someone who is missing their dead partner \"All my friends tell me I should move on\" But their memory always lingers them that they can't find a remedy for the memory hunting her. Everytime she sleeps she dreams and paradise, she is suicidal and wants to die, but she is afraid her partner won't be there for her when she dies\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nmaybe it's just me, but isn't it supposed to be \"your face is like a melody, it won't leave my head\" instead of \"a memory of faces, like a melody it won't lift my head\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI actually thought this was about a love that died, it ties into other themes in the album and just seems like she's singing about someone who died. \"I'm scared that you won't be waiting on the other side\"\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think the song is pretty straight forward for me, the narrator of this song is in love with someone who has just died. Everyone keeps persuading her to move on with her life, but she can't get over him because when you find true love it lives on. She  wishes that she could die so that she could be with him on the other side, but until then she can't forget all of the memories that still run through her head. She is with him in her dreams, but it's a dark pleasure because even though she's with him, she knows he's still gone.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song means something a little more different to me. I suffer from paranoia and mental disorders. Often times I feel like my sanity is not there anymore. I feel lost and in a different world altogether. This song describes exactly what I feel.\nWhen it says \"there is no remedy for melody for remedy your face is like a melody it won't leave my head.\" I feel that in moments of panic and fear all I can think about is how I miss being calm and at rest. When it says \"your soul is haunting me and telling me that everything is fine. But I wish I was dead,\" it's like my mind telling me that everything is fine, but the only way I'll feel fine is if I am dead. \"Every time I close my eyes, it's like a dark paradise, no one compares to you, I'm scared that you won't be waiting on the other side.\" I feel like when I close my eyes, I can block out the world, it's dark, and temporarily calming. But when I open them, I am sucked back into this world, and am afraid of what's outside.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nIf you've ever read The Hunger Games series, this definitely reminds me of Finnick and Annie...\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song is about one of her past boyfriends who she deeply loved and cared for. He commited suicide and now she realizes that she will never be able to forget about him.\n\r\n\"No one compares to you. I'm scared that you won't be waiting on the other side.\" ----- This line is saying that she loved him but is afraid that, since he took his life, that he may have not made it into the gates of heaven. Many people are unsure of whether those who kill themselves will still inherit the Kingdom of God.\n\r\n\"But I wish I was dead. (Dead With You)\"------ This confirms the fact that Lana can NOT live without this guy and that she rather be DEAD with him. Clearly, he is dead and wherever he is, she just wants to be with him.\n\r\n\"And there's no remedy for memory. Your face is like a melody.\" ------This lines are amazing. She's saying that there is no cure for memories. If you hold a memory of a loved one, nothing can make that memory disappear and you will, whether you'd like to or not, will always remember the one you first loved.\n\r\nThe song is, over-all, about not being able to live without a loved-one and accepting the fact that he/ she is gone and not being afraid to still think back to the good times with that person and welcome in memories of the past, even if they are dark...\n\n\n\n\n\r\nHer memories are clearly bitter sweet. They are sweet and special and she loved them like a \"PARADISE\" but every time she looks back, all she can think about is how she no longer can experience that paradise. It holds a \"DARK\" fear to it. DARK MEMORIES.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song has a hidden meaning.  On Wikipedia, it states that Lana has claimed a lot of her songs on _Born 2 Die_ are about the time period when she was suffering from alcohol dependence.  This was at the tender age of 14.  She went to a special school that helped kids with substance abuse problems from the age of 14-18.  If you listen carefully, you might see this is her letting go of her addiction.  After reading her quote, \"alcohol was my first love\" it puts this whole album in a different perspective.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nHonestly, the song is pretty straight forward. Her lover died and she can't let go. The only way for her to be with him is in her dreams, and that's her paradise even though it's dark and depressing.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nreading the comments, i see why people think that it's about death, which is a completely reasonable interpretation. however, my first impression of this song was something supernatural. it kind of reminded me of phantom of the opera, the idea of obsession. the lover is some sort of ghostly figure who talks to her in her sleep and everyone thinks shes going insane but she starts to become obsessed. im probably wrong, but its a way of looking at it.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI love how when you hear her in interviews she's this smiley, bubbly girl with a cute little voice and a sweet personality. But her songs are so dark and mysterious, it's so interesting to me, trying to figure her out.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nAlso, its definitely about mourning a dead lover. If you listen really closely when she says \"I wish i was dead\"...she immediately whispers (\"dead like you\").\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI think this song is about how she's holding on to the memories of her lost loved even though it hurts, while 'Summertime Sadness' is about her actual memories of the relationship\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nher real love, that died, she wish she could be with him... she's scared that wont happen even in the other side...\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nHey guys I have the lyrics exactly as everyone is saying them and yet for some reason Songmeanings has changed them and won't let me put them back... My old lyrics are still in there but for some reason they've been overwritten by SM, this happened with a few other tracks, anyone know why? Sorry I really wish the right lyrics could be up there but here's what I had before they changed them: \n\r\nAll my friends tell me I should move on\r\nI'm lying in the ocean singing your song\r\nThat's how you sang it\n\r\nLoving you forever can't be wrong\r\nEven though you're not here, wont move on\r\nThat's how we played it\n\r\nAnd theres no remedy for memory\r\nYour face is like a melody\r\nIt won't leave my head\r\nYour soul is haunting me and telling that everything is fine\r\nBut I wish i was dead\n\r\nEvery time I close my eyes \r\nIt's like a dark paradise\r\nNo one compares to you\r\nI'm scared that you won't be waiting on the other side\n\r\nAll my friends ask me why I stay strong\r\nTell em when you find true love it lives on\r\nThats why I stay here\n\r\nAnd theres no remedy for memory\r\nYour face is like a melody\r\nIt won't leave my head\r\nYour soul is haunting me and telling that everything is fine\r\nBut I wish i was dead\n\r\nEvery time I close my eyes \r\nIt's like a dark paradise\r\nNo one compares to you\r\nI'm scared that you won't be waiting on the other side\r\nEvery time I close my eyes \r\nIt's like a dark paradise\r\nNo one compares to you \r\nBut there's no you except in my dreams tonight\n\r\nI don't wanna wake up from this tonight\r\nI don't wanna wake up from this tonight\n\r\nThere's no relief, I see you sleep\r\nAnd everybody's rushing but i can feel you touching me\r\nThere's no release, I feel you in my dreams\r\nTelling me I'm fine \n\r\nEvery time I close my eyes \r\nIt's like a dark paradise\r\nNo one compares to you\r\nI'm scared that you won't be waiting on the other side\r\nEvery time I close my eyes \r\nIt's like a dark paradise\r\nNo one compares to you \r\nBut there's no you except in my dreams tonight\n\r\nI don't wanna wake up from this tonight\r\nI don't wanna wake up from this tonight\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nMaybe it's the alternate version of the Born to Die video? He dies instead of Lana.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nAbsolute love again. He's gone forever, most likely dead, and only in dreams can she have him back, a paradise that is dark because it is not real, and she wants to sleep forever, and not live a waking life any more. She wants to die to be with him on the other side, but she lives in terror that after death they won't be together.\n\r\nLana Del Rey is a success because she writes of a love that is deeper, harder and more twisted than anyone else does. Love it! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThe majority of Born to Die, and Lanas music in general is about this specific ex lover. I think on a radio show or in a magazine the interviewer asked where he was or if he was dead, and I feel like she said he wasn't dead, but she had no way of contacting him but was still in contact with his mother. I think she might be referring to prison in regards to the line \"waiting on the other side.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI don't think it has anything to do with her ex dying, I feel like she is just talking about holding on to a relationship she really cared about even though he's moved on and is long gone.\n\nWhen she says \"Everytime I close my eyes. It's like a dark paradise. No one compares to you. I'm afraid you won't be waiting on the other side.\" I feel like she's saying, \"I'm dreaming about a relationship that is long gone, but in my mind that's where it's all still okay. I'm afraid when I wake up it won't be the same.\"\n\nWhen she's saying her friends are all wanting her to hurry up and move on I just feel like it just happened, he may have been her first, and she can't let go to all the memories and things they've shared together.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nDeath of a lover. And she can't get over it, she doesn't want to. She secludes herself in a world where he can be alive- her dreams.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nLana Del Rey's best friend died in a car crash when she was 13 years old. It makes sense to assume it's about a romantic interest that died, but I personally think it's about that friend.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI always thought the booms at the beginning were bombs. If you listen right after the third \"explosion,\" you'll hear a high pitched vocalization that sounds like a scream. That's what I assumed she was singing about\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nAlcoholism.\n\n\"Your soul is haunting me and telling me that EVERYTHING is fine, but I wish I was dead.\" - Alcohol\n\n\"All my friends tell me I should move on.\" (Become sober)\n\"Loving you forever can't be wrong.\" (Denial)\n\n\nI'm willing to bet that since this whole album was written about her struggle with alcoholism, that this song was about that as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nUghhhh, so annoying that the lyrics are wrong here. It wont lift my head? Makes no sense. It's LEAVE. And hunting should be HAUNTING. This website's moderator needs to keep up with this stuff! Someone posted the right lyrics in comments below but they never got fixed. >Â·<\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nOkay, is it just me, or does this song remind you guys of The Little Mermaid too?\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nYes, I get that it is about a dead boy friend/girl friend. But for me it is about being in a relationship with an emotionally distant person.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nEverytime i listen to this song it reminds me about my beloved friend who committed suicide. And i feel like it describes my feelings in a very accurate way.\nP.S. as for \"you won't be waiting on the other side\" - i think she means that she might sink into oblivion for him, because people who die this way forget everything they had.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThis song is quite clearly about losing your significant other. She wants to kill herself but she doesn't because she knows that he doesn't want that. She decides to wait until fate takes hold and she dies. She worries that he won't be waiting for her in heaven/hell. Her friends think she is absolutely insane.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThis song is about how Lana's love interest dies. She says that everyone tells her it's time to move on but she can't stop thinking of their love and what it could've been. She wishes she was dead because it would be easier than dealing with the pain because she wants to be with him. Lana says sleeping is a '\"dark paradise\" because it reminds her of her laying in her casket dead with him. \"I'm scared that you won't be waiting on the other side\" She's saying she's worried he'll go on without her and that he won't wait for her which leads her to anticipating death or sleep so she can see him more often.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nOkay, so this is probably really wrong, but I swear I remember reading somewhere in like some small writing company that this happened: \n\nSo There was a guy who fell in love with a women, and they were in a really deep relationship but then Lizzy Grant (lana del rey) came along, and the man fell in love with her, and subsequently broke up with the women for lizzy. The woman then committed suicide and the man mourned the woman greatly. And you know how after people die everyone always paints them in some brilliant image like they were some goddess or something? Well Lizzy is like \"no one can compare to you.\" because now her bf has this surreal memory of her, and sort of blames Lizzy for her death and stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI actually think this person is well alive. I think this song is more about two alcoholics and she's passed out from it. He's telling her that she's completely fine and just to let loose and is more free-spirited about the sole issue that he has that has rubbed off on to her. However, it's a possibility that he's not there, but he still seems to show up on the whim causing her to drink more.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI belive that the song is about a girl who's boyfriend that she truly loved had died and she morinig well her friends tell her to move on. I feel like dieing but I don't at the same crush but this semeter in my frist year in middle changed his scacule so I don't have any classes with him and now I have lost most of my hope and I want to kill my self but the thought that he still in the same school keeps me going very slowly \t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI personally think this song is about the mysterious \"K\" that she sings about on some of her earlier (and not that popular) albums. If you listen to \"For K Part 1\" she talks about a guy on death row who she loved and I really think she was/is hung up on him. There are other references to her loving a man who went to prison, such as in \"TV in Black and White\" (the whole song is her singing to a man in prison) and \"Gangsta Boy\" (\"I don't care if you're going to prison, I wouldn't say I loved you if I didn't\". I think a lot of her songs are about this \"K\" and he was executed and she is/was hung up on it. I certainly would be in her position.\n\nAnyway, specific references in this song are:\n\"I wish I was dead/dead like you\"\n\"I'm scared you won't be waiting on the other side\" (she's afraid maybe because he was a criminal he won't end up in heaven perhaps?)\n\"Even though you're not here, won't move on\" \"all my friends tell me I should move on\" (you're supposed to \"move on\" from someone's death and she doesn't want to)\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI actually think this song really relates to the Titanic movie, especially the line \"I'm lying in the ocean singing your song.\"  I just picture Rose lying in the middle of the ocean singing while she holds Jack's hand.  Most of the song would be after the whole ordeal, as she's having trouble getting over Jack.  Also the line \"your soul is haunting me and telling me that everything is fine\" could be about her remembering his last words to her about surviving and being \"fine\", going on to live a normal happy life.  \t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI think this song relates to Bella in Twlight: New Moon so much because in the movie when Edward leaves she sits around dong nothing, becoming depressed and she always dreams of him. When she's out somewhere she sees his face in weird places. Same thing with this song. I think the guy Lana is singing about isn't dead but maybe he left her. She says \" Tell em when you find true love, it lives on\". This means she's still holding on to the fact that he might come back and it's killing her. So when she dreams of him, it's a dark paradise because she sees him in her dreams but he isn't with her physically\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI see this as about a death of a loved one. It could also be about going to gaol\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI think its about a a man and a women that lived in a world where they loved each other very much and that melody she hums is the song he sang her . but then something happen and the man told they had to enter this world and that they would meet in the world some day . so she. Comes to realize and remember him and so she is also singing about him \r\n That s honeslty wat i think about all of lana del rey songs\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI think it has something to do with her seasonal affective disorder. \t\t\t\t\n\t\t\t\t\n\n"}