{"comment_0": "\nNo comments?! This song is AMAZING, one of my favorites from Miranda Lambert. The way I interpret the song is like this. She knows the relationship has hit a dead end, and that he doesn't feel the same for her as he once did. \"I feel like the tires on this car, you said they won't go far but we're still rolling\" He is saying their relationship won't last much longer but as of now their still going. \"He ain't feeling anything, my love, my hurt, or the sting of this rain. I'm driving through a hurricane, all he can say is, man ain't it such a nice day?\" He isn't experiencing any pain in the fact that their relationship is slowly dying, while her heart is slowly breaking. Soon the relationship will be dead, like dead flowers, and she is left broken hearted while he goes on feeling no pain. Thats how I like to interpret it because I went through the same thing. Stupid boys ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI love love love love this song! Perfection.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI agree, the relationship is over. The girl is broken hearted and grieving while the boy doesn't feel a thing. Almost like he didn't even know there was anything wrong in the first place. Sounds like a typical guy!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWell i believe my ex-girlfriend can relate to this song every well. It seemed like our relationship wasn't going any further, and it was slowly dying into nothing. One day she posted these lyrics on her facebook page and it was an automatic \"oh shit\" flare going off in my head. She use to sing it to me in her car all the time, I guess I should have gotten the clue and looked up the meaning before it was too late, but it was, our relationship went dead, like dead flowers, now i'm here today, wishing for a better tomorrow, and maybe those flowers will come alive again. If you read this kate, your always my girl :)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthis guy just got her home one day, cuz she's pretty like flowers.\r\nshe's just like this thing to him.\r\nhe doesnt see her love or her hurt or anything, basically.\r\nshe's just a pretty flower to him, that he got home and even though, the whole thing is dead, she's lived his purpous, and she's dead now.\r\nand he doesnt even see it. to him its all good, cuz he's got something pretty in his house to show people. like the christmas lights.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis became one of my favorite Miranda songs now that I can relate to it more.\n\r\nThe beginning of the song is a metaphor for the beginning of their relationship, \"\"Aint they beautiful\" he said\" is referring to how he felt about her in the beginning of the relationship. Everything was exciting and new.  But just as dead flowers do, his feeling became dull and grey.\n\r\nWhen their relationship has faded, he's not affected by it, while she's left with the weight of the relationship on her shoulders. She realizes she has to throw away their relationship, just as she would throw away dead flowers.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\"I feel like the flowers in this vase\"...\t\t\t\t\n\t\t\t\t\n\n"}