{"comment_0": "\nLovely, such a lovely song. Definitely my favorite off the new album.\n\r\nShe's pretty much conversing with her wedding ring throughout the song and musing. It's very much like a Dear Diary song, but the diamond is her personal diary because it holds such significance.\n\r\n\"You wrap around my finger just like he does\" basically says that he's wrapped around her finger (just like a wedding band) because he's so in love with her. Should she or should she not tell him that she cheated on him and she's been lying to his face? Things are pretty and shiny on the outside, but it's too good to be true.\n\r\n\"You cost more than he wanted to lose\" moves into a metaphor that the ring is symbolizing the promise and vows that they made, and that she (or both of them) are going to pay a dear price for breaking the promise. The broken vows/promise would make him lose more than he could ever bear. It'll break him if he knows the truth. She can't face it.\n\r\n\"Dear diamond be my saving grace\" means that she's praying with the ring now and she's made up her mind not to tell him. She's hoping he never finds out. The ring represents the new secret that she's keeping, only her and the ring know it now.\n\r\nI'd like some clarification and input with the entire last verse. I love the phrasing of \"some people you have, some people you hold\" and understand that this means some people you can have a meaningless relationship or a fling with (have) and others you carry with you throughout life (hold). She's choosing to be more faithful and hold him through their marriage from now on because she realizes the intensity of her mistake. But how does this specifically relate to the wedding ring's band of gold? Is there more or have I got it all?\n\n\r\n***Also, I'd like to add a correction. It's \"Lie like the devil, or just face the truth\", not \"Well I like the devil, just face the truth\".\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\n*Lie like the devil, or just face the truth\t\t\t\t\n\t\t\t\t\n\n"}