{"comment_0": "\n\"when the days are cold\" - things are dark and depressing\n\"the cards all fold\" - everyone has given up\n\"the saints we see are all made of gold\" - there isn't anyone truly good left\n\"when your dreams all fail\" - life is getting hard and things aren't happening for people\n\"and the ones we hail are the worst of all\" - the people who have the most influence are the people are are the worst influences (famous musicians, etc.)\n\"the bloods fun stale\" - nobody has passion anymore\n\"I wanna hide the truth, I wanna shelter you\" - he wants to hide the terrible world from someone he loves\n\"but with the beast inside, there's nowhere we can hide\" - the things that make man fallen are inside of him, so he could cut her off completely from bad people and she would still have a beast inside her\n\"no matter what we breed, we still are made of greed\" - same idea...man's fallen traits are engrained in him, and you can't make them go away\n\"this is my kingdom come\" - this is my reality, i realize that now, and this is as good as it's getting\n\n\"when you feel my heat look into my eyes, it's where my demons hide\" - I may seem like a better person on the outside, but in reality I'm just as bad as everyone else on the inside, I've got problems too\n\"don't get too close, it's dark inside\" - you're too innocent for me\n\n\"when the curtain call is the last of all\" - the show's over, now you see who the people really are, but they've still got smiles on their faces\n\"when the lights fade out all the sinners crawl\" - but when your not looking anymore, the people are just humble sinners on their hands and knees just like everyone else\n\"so they dug your grave\" - everyone is just waiting for you to fall too, because they know you will\n\"and the masquerade\" - like I said before, everyone is just a fake\n\"will come calling out at the mess you made\" - even though they're just fakes, they are just looking for their chance to criticize you and pull you down, which s why they've dug your grave\n'don't wanna let you down, but I am hell-bound\" - I really don't want to hurt you, but even though I know you trust in my, I'm gonna have to burst your bubble cuz I'm as bad as everyone else\n\"don't wanna hide the truth, know this is all for you\" - he wanted to hide he truth earlier, but now he knows he can't keep deluding her, she needs to know who he really is, who people all really are, and it may hurt her but it's all for her in the end\n\"they say it's what you make, I say it's up to fate\" - some people say that what you do and how hard you work determines the outcome of life our a relationship, but he thinks it't just gonna happen like it happens and there's nothing he can do to change it: people will always have demons inside them\n\"it's woven in my soul\" - his demons are a part of him, he's never going to shake them\n\"I need to let you go\" - she's innocent, and he doesn't want to ruin that and since he's stuck with his demons forever, he needs to separate himself from her\n\"your eyes they shine so bright, I want to save that light\" - again, he wants to preserve her innocence\n\"I can't escape this now\" - again, he thinks he's stuck with his demons forever\n\"unless you show me how\" - here's the note of hope in this song.  He thinks he's pretty much stuck like he is forever, but whoever he is talking to is so innocent and 'her eyes shine so bright' that he thinks just maybe possibly she might be able to show him the way out\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nhow sweet, it's about his lover being the only bright point in his life and the world. Darkness and evil envelops everything else - the only saints are manmade statues, people are \"made of greed,\" etc. Worst of all, there are demons inside him. He's conflicted; he's pleading to her to save him while acknowledging it's better to push her away for her own good (\"It's woven in my soul / I need to let you go\").\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIt's saying that we as humans tend to set expectations to high for ourselves. We all have \"demons inside\". We all have troubles. We all battle ourselves sometimes. We are all imperfect. We are all human, and that is enough. :) The song sounds sad, but the message is somewhat positive: embrace your qualities and imperfections, because it makes us who we are. We try to shield others from our dark side, which is fine, but we just need to know that we DO have a darker side. It's woven in our soul, because we are imperfect humans.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI have interpreted that the song reveals a true key to living a happy life: everyone has flaws and we have to accept it. \n\r\nIn the beginning, it mentions that \"the saints we see are all made of gold.\" To me, this says that people who we think are perfect (or close to perfect) have a greedy side too (because they are metaphorically made of gold). It is also possible that the song may mean that something is causing the person to be nice that most people may be disappointed in. For example, if a teenager's parents pay them to be nice, are they really nice?\n\r\nLater, it states that our role models are the worst ones to follow: \"When your dreams all fail and the ones we hail are the worst of all.\" This line simply says that idols are dangerous. If you really look up to someone who has flaws (because everyone has flaws), you will eventually, whether you know it or not, take on those flaws in an effort to be like that person. It's sad but true. It has also given me second thoughts about role models.\n\r\nLater on, it says, \"I wanna hide the truth/I wanna shelter you/But with the beast inside/Thereâ\u0080\u0099s nowhere we can hide.\" Basically, the person singing the song wants to help the one they love, but end up confessing that there's nothing they can do to shelter them from the cruel and unforgiving world. The singer knows that, although they try to be as good of a human as they can, there is no way to stop the sin that is waiting to emerge from inside. The singer could try to protect them from the world, but it would be pointless because the flaws would emerge on the person they were trying to protect. This is also sad but true, but reenforces the idea of the song interpreting that no one is perfect. \n\r\nThus, the chorus to the song: \r\n\"When you feel my heat \r\nLook into my eyes\r\nItâ\u0080\u0099s where my demons hide \r\nItâ\u0080\u0099s where my demons hide\r\nDonâ\u0080\u0099t get too close\r\nItâ\u0080\u0099s dark inside\r\nItâ\u0080\u0099s where my demons hide\r\nItâ\u0080\u0099s where my demons hide\"\n\r\nOf course, the author does not actually mean that they have physical demons inside of them, but demons are a reference to the sin and flaws that rest within. The rest is pretty much self explanatory:)\n\r\nThe rest of the song goes on to support the \"thesis\" more if you take the time to read into it.\n\r\nOverall, the singer loves the person they are singing to, the intended audience. He wants to protect the intended audience from the darkness of the world, but it comes out as warning of the lingering dangers because he can not do anything to prevent his inner \"demons\" from hurting them. \n\r\nIf you ask me, this is a pretty depressing song. It is also and eye opener to see that other people actually notice that this world has become crueler over the years. \n\r\nIf you were to take away one thing from reading this (if you actually did read this!), then I would like you to know this: Nobody's Perfect. But, more importantly, the reason Imagine Dragons even decided to write this song in the first place is because Hannah Montana failed to get that point across while people actually liked her. Just kidding! Kind of...\n\r\nWell, anyway, thanks for reading!\n\r\n~Carly\n\r\nPS-This is my first review, so I would really appreciate any feedback given. I'm super new to this, so I have no idea if I'm doing this right. Oh well! Thanks!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think this song is universal to everybody to some extent. we all have our \"demons,\" whether that be depression, anxiety, gambling, drug abuse, jealousy, etc. some of us have been face to face with our demons, some more extreme/often than others. your demons signify things that bring you down physically, mentally, and/or emotionally. at the end of the day we all have our deepest hidden secrets and feelings - do we always choose to share these with our loved ones, let alone others? sometimes, no. the singer is hesitant to open up to his love interest, if thats what you want to call the person. they say \"the eyes are the window to the soul;\" well, the singer's line about looking into his eyes where his demons hide explains that pretty straightforward. feeling confused, tortured, or lost are horrible to experience, but in this world it is inevitable. what differentiates us is our faith/what keeps us going, and how we deal with our demons and whether we choose to feed into them or not. there are always two natures at battle in us - and that is good and evil. \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is about a man who is troubled inside. He wants to protect his lover from not only the evil of the world, but himself\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song is about a person's shadow.\r\nIf you have read about Jungian Psychology (Carl Jung), you'll know about the shadow, anima and persona.\r\nYou can google the others, they all represent the sides of a person, but shadow is the side that we don't want the world to see. It can be our deepest, darkest, desires. Essentially, our \"demons\". The song, Demons, has a line that evokes something that we all share in common in terms of our personal shadow:\r\n\"Donâ\u0080\u0099t get too close\r\nItâ\u0080\u0099s dark inside\"\r\nAnother key element to the shadow is that all psychologically healthy humans want their shadow to be hidden. We all experience the blossoming of a new friendship and how we want to forever preserve a certain image towards that person of ourselves. We do not want to taint it, so, we don't want that person \"to get too close\" because we think that \"it's dark inside\".\r\nSuch a powerful song with a catchy beat.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song is about protecting the ones we love from the demons that surround us. \n\r\nIt's about those of us who try to hide the harsh reality of the world (when our dreams all fail) and our own internal struggles/demons (the ones we hail are the worst of all) from our loved ones thinking we're protecting them or sheltering them from the hurt and pain.\n\r\nThe author then talks about how futile it is to do this because the demons will still be there even if you hide them (But with the beast inside, Thereâ\u0080\u0099s nowhere we can hide) and the only way to truly vanquish them is to let the ones we love in to help us fight them (I can't escape this now, Unless you show me how).\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song makes me think that person A is in love with person B, but person a thinks themself too lowly of person B. B is happy with their life and A wants to protect B's happiness (\"your eyes they shine so bright, I want to save their light\") A knows they have a good thing with B already and doesn't want to hurt what they have by trying to take it further, but is conflicted by their feelings (\"I want to hide the truth, I want to shelter you\") A believes in fate and thought they were supposed to be with B (\"they say it what you make, I say its up to fate\") and A feels like B is a part of them (\"its woven in my soul, I need to let you go\") and A has been in love with B for so long that person a doesn't know how to let go (\"I cant escape this now, unless you show me how\") A tells of how unworthy they are of B and turns self destructive and pleads for B to see his demons (\"look into my eyes, its where my demons hide\") and maybe hopes for B to want to protect them, but A knows that if they went too close to A the darkness and destruction they harbour might extinguish B's light, which is what A wanted to protect in the first place\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song is an appeal to the innocents of the world who are preparing to face their own demons for the first time.\n\r\n\"When the days are cold and the cards all fold ..\" is the setting.  When you're feeling down and out of luck, when the world seems to be an unfair place to live.\n\r\n\".. and the saints we see are all made of gold ..\" more setting, but allusion to the fact that the although it APPEARS as though the good people in this world are part of a life that's unattainable, the author also suggests that the \"saints\" we don't see are very real, very human, and don't call attention to themselves like those made of \"gold\".\n\r\n\"When your dreams all fail ..\" more setting, speaking of the betrayal of innocence by the harsh realities of life.\n\r\n\".. and the one's we hail are the worst of all ..\" direct statement against the people who we place in control of our lives, like parents, politicians, doctors, generals, managers, teachers.  Again, the use of the word \"worst\" implies that there has been a breach of trust recently, of abandonment, of not really having all the answers they claimed to have during the listener's former period of innocence.\n\r\n\".. and the blood's run stale.\"  This is an interesting, ambiguous line that I think implies that at one point, there was a willingness to fight against this reality that has now faded into submission.  The time of fighting has since passed, to be replaced by the above setting of betrayal, loss of trust and defeat.\n\r\n\"I want to hide the truth, I want to shelter you ..\" is the emotion of the song, in response to the setting.  The singer references himself, appealing to his listeners that if he could NOT share this truth with them, then he would, feeling that it might offer them some sort of protection.  However ..\n\r\n\".. but with the beast inside, there's nowhere we can hide ..\" is the truth, plain and simple.  There's no way to keep the truth from someone if they want to find it, and by lumping himself in with the word \"we\" he alludes to the fact that he feels this beast (ie demon) is something that everyone who's lost their innocence possesses, and the truth being sought by the listener is going to bring them face to face with their own beast, eventually, so there's really no point in hiding from it.\n\r\n\"No matter what we breed, we are still made of greed ..\" this begins the explanation as to why the world is this way.  Essentially, what the singer is saying that it doesn't matter what our best intentions are, greed still governs our intentions.  He believes that all people are creatures of want, inherently selfish, and no matter how hard we try to overcome this \"me-centric\" reality, greed is the foundation upon which we were all raised, and that's the demon we need to confront.\n\r\n\"This is my kingdom come ..\" this is his message to his listeners.  It's only his, and others might have a different outlook, but if someone's asking for answers and they come to him, this is the world the singer feels he lives in, and this is why he feels their innocence was taken from them.\n\r\n\"When you feel my heat, look into my eyes ..\" this is the singer's justification for the way he feels.  Heat is in reference to the demon inside him, but it's also in reference to the aforementioned blood he held within him, his passion, the point upon which his own innocence was taken from him that he still hasn't overcome.  When that personal heat comes to the fore, and that guard goes down, he encourages the listener to look into his eyes, because ..\n\r\n\".. it's where my demons hide ..\" implying that there's something he wants to let out, and he comes close, but those personal truths remain inside of him, visible only through his eyes when he lets his guard down.\n\r\n\"Don't get too close, it's dark inside ..\" is a warning, but it's more for self preservation than anything else.  He doesn't want the listener to ask the questions he himself doesn't want to answer, but at the same time, he wants SOMEONE to help him, but he can't bear the idea of destroying that person's own innocence in order to do so.  He doesn't want them to experience his \"darkness\".\n\r\n\"Curtains call is the last of all ..\" this line sets the stage (pardon the pun) for the identity of the world the listener now might accept is made up of bitter secrets kept from them.  The singer suggests that the play is now over, the fantasy, the Act, and now the reality sets in to fill the void.\n\r\n\".. when the lights fade out all the sinners crawl ..\" likening the people of the world to insects and vermin, who when the spotlights are off them go about their day to day business acting in their own self-interest.\n\r\n\"So they dug your grave ..\" \"they\" being the sinners mentioned in the previous verse, and the grave in reference to the listener's own fall from innocence, the tarnishing of the soul, the descent into darkness each of them is a part of.\n\r\n\"And the masquerade ..\" nice line.  The \"masquerade\" is comprised of the same \"sinners\" from above, only this time, the delusion once held by the listener as to all these people being themselves people worthy of respect and admiration is now understood to be a facade.  Thus, now that the truth is out, sinners are seen as they really are.\n\r\n\".. will come calling out at the mess you've made ..\" awesome line!  The singer doesn't just suggest that this will happen ... he confirms it.  That collective group of phonies WILL pounce on the listener's loss of innocence, calling (note the similarity to \"crawling\" mentioned above) out at the way life actually is, as if it's the listener's own fault for losing their own innocence.  The work of having \"dug a grave\" in the expectation that it will be filled by the listener's loss of innocence speaks to the singer's bleak opinion of the rest of the world.  However ..\n\r\n\"Don't want to let you down but I am hell bound ..\" tells the listener that even though he's trying in his own way to \"breed\" something good from all this, he's casting his own lot with those of the other sinners, and doesn't have much hope.\n\r\n\".. though this is all for you, don't want to hide the truth ..\" regardless of where he's headed, he's giving all of this advice and opinion to the listener, without using a mask like others might.\n\r\n\"They say it's what you make, I say it's up to fate ..\" an interesting line.  \"They\" in this is back to the sinners mentioned before, and he's trying to distinguish himself from the others by removing what he \"makes\" from the equation, believing that whatever the outcome of this song, it'll be up to the listener to take from it, and not be \"made\" to do against their will.  The \"what\" the listener makes is in relation to the \"breeding\" mentioned before.  In essence, he's telling the listener not to follow the same path as everyone else, and confront that demon without trying to hide it inside.\n\r\n\"It's woven in my soul, I need to let you go ..\" double-meaning?  Is the earlier truth of the singer's revelation what's woven in his soul, or the fact that he needs to let the listener make their own choice on what path to follow?  Perhaps \"it's\" both.\n\r\n\"Your eyes they shine so bright, I want to save that light ..\" from the darkness inside him, seeing such pure innocence is a bright light, and he wants to keep it around him for as long as he can without extinguishing it.  This is a paradox, considering he feels that the listener will eventually come to face their own truth at some point, based on the \"made of greed\" logic from earlier.  However, in his last line, he turns that paradox on it's ear.\n\r\n\"I can't escape this now, unless you show me how!\" He feels that he's trapped in this reality, and now that he's confronted his own demons through the course of the song, he understands that he needs to place his faith back in someone else again, to shed that selfishness and greed he feels is the problem, and trust in the purity and innocence of the listener to help him escape his own path to hell.\n\r\nI've listened to a lot of music over the years, and yes, I've loved listening to Imagine Dragons these past couple months.  But when this song came on the radio, I was blown away.  I listened, and thought to myself \"this guy knows exactly what he's trying to say in this song, and he's trying to say to everyone\".  There's not many songs like that anymore.  It was enough to compel me to sign up on this forum and add my own interpretation.  Hope you get as much from it as I did.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nMy cousin has a friend who thought of suicide because he got picked on constantly by a bully and it was all because he liked something a little odd. Like what the heck?! Nobody deserves a fate like death. I told my cousin to get some help or advice and he said he would. I was happy to find out that he tried to help the situation by hanging out but honestly; I can't see why some people can't embrace others' inner demons. Like they didn't have enough stress put on them already! Suicide is never the answer for anything. I just want to gather everyone who's considered it and tell them that...\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\n\"No matter what we breed. We still are made of greed\"\n\"When you feel my heat Look into my eyes Itâ\u0080\u0099s where my demons hide\"\n\nBe careful, for everyone have their demons inside, after all, no matter how good our packaging is, we still have that demons inside.\n\n\n\"When the curtainâ\u0080\u0099s call\nIs the last of all\nWhen the lights fade out\nAll the sinners crawl\n\nSo they dug your grave\nAnd the masquerade\nWill come calling out\nAt the mess you made\"\n\nRevelation 20:13 - The sea gave up the dead that were in it, and death and Hades gave up the dead that were in them, and each person was judged according to what he had done.\n\n\n\"Your eyes, they shine so bright\nI want to save their light\nI can't escape this now\nUnless you show me how\"\n\n\nI think this song is all about us, warning us about the worldly acts.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nAt first I thought the song was about a someone who had a personality disorder and the he's talking about how he can't control it and how he wants to save his lover from the \"demon\" inside him. (meaning, the other person to his personality disorder.) Then I kept listening to the song and reading the lyrics and it turns out, it might be a love song. The whole song is about how there in a \"demon\" inside him and how it might come out and hurt his lover. -It's woven in my soul, I need to let you go- is a good example. He's saying that it's going to be inside him forever, like it's stuck inside him and he doesn't want his lover to get hurt so he has to let her go. -Unless you show me how- he's saying that if you can show me how to get this \"demon\" out and show me how to be a better person and then I can be with you again.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nIm sorry, but this is hands down the best song by Imagine Dragons. This band is one of the few that is going to make it to the top, and stay there. When you really read, and listen to the song, the meaning of it is obvious ... When you are the most down, and your day is absolute crap, all you try to do is hide it. Not wanting your love to know. \"When you feel my heat, Look into my eyes, Itâ\u0080\u0099s where my demons hide\" hello ! \n\n\n", "comment_14": "\nI gotta say that I am IN LOVE with this song!! I'm 19yrs old and I lost my mother to cancer when I was 17 :-/ and when I watched the video and the girl in the crowd who lost her parents appeared that's when the waterfalls came in!! In a strange way this song is comforting because I do know that I'm not the only one going through this, but God it's so damn hard!! Anyways this is my new ringtone and it's amazing!! Great job guys!! Ã¢â\u0084¢Â¥Ã¢â\u0084¢Â¥Ã¢â\u0084¢Â¥Ã¢â\u0084¢Â¥Ã¢â\u0084¢Â¥\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nWell for me (right now anyway).....I just finished watching all the Star Wars movies...so every bit of this song reminds me of Anakin Skywalker and his journey to the dark side and back. Just saying. Perhaps the writers of the song are fanboys ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nIn my opinion this song speaks about gods relationship with men, i get this from the lyric \n\"Donâ\u0080\u0099t want to let you down\nBut I am hell bound\nThough this is all for you\"\n and through the song is talks about it being up to fate and being woven in my soul and stuff. thats just my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\neveryone has its dark secrets. its fears, its faults, its past. though someone smiles & laughs & seems perfectly fine, nothing is like it seems inside. I think the singer is asking for help, for someone to show him how to tame the demons that live inside of him, but is also warning them about what they could find, because he himself doesn't know how strong the flames he's hiding are burning.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI think this song is about how someone is in love with someone else, but won't allow themselves to love that other person because they are afraid of getting hurt. I also think that the person is depressed and/or sad because of their past, and they don't want the other person to know, they don't want to be judged on something they can't control.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI've always saw this song as from the point of view of a person who's got darkness inside. They love someone, but they feel like if they actually were in a relationship he'd just hurt them, and he wants to save them from that.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI can really relate to this song the way I interpret it. I really struggle with depression and self harm, and the lyrics \"I want to hide the truth\nI want to shelter you.\" is how I want to shelter my family and the people I care about from the pain I know I'm causing them. And \"When you feel my heat, Look into my eyes Itâ\u0080\u0099s where my demons hide. Donâ\u0080\u0099t get too close Itâ\u0080\u0099s dark inside Itâ\u0080\u0099s where my demons hide...\" Is how, if you look into my eyes, the demons and pain is so easy to see. \n\nIdk I just really love this song and it always makes me cry. I feel like it is about how people's struggles are easy to see if you look within them and they'll always want to shelter the ones they love.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI think that this song is talking about not opening yourself up to someone completly, because your afraid of what there gonna think of you when they have found out all the \"horrible\" things you have done. And about wanting so baddly to escape your 'demons', but also not wanting to take the light out of the persons eyes that you are trying so hard to be good enough for. The whole conflict is, knowing someone that is so pure can help you, but only they could do it, and at the same time wanting to keep them clean, and pure\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThis song can be about someone dealing with depression. When they say, \"When you feel my heat, look into my eyes. It's where my demons hide.\" they could mean that even though they wear a fake smile and seem okay, they're actually not. \"Don't get too close; it's dark inside.\" could mean that they don't want the person they love to be burdened with their sorrows. \"So they dug your grave.\" -maybe they let the person to get too involved and now all of the people that bother the singer are now bothering the person they love. \"And the masquerade will come calling out at the mess you've made.\" - they think that everyone's just the same (cruel and terrible) and that they'll do the same to the other person that they have to them. \"They say it's what you make, I say it's up to fate.\" - everyone says that you are only miserable because of your actions, but the person says that it's just fate that their life isn't so well. \"It's woven in my soul.\" - they believe that their depression is woven in so deep. \"Your eyes they shine so bright, I wanna save that light.\" - the person they love is so happy, and the singer doesn't want to ruin that. \"I can't escape this now, unless you show me how.\" - they think that there is no escaping depression unless the person helps them see the better side of life.\n\nKeep in mind that songs can mean what you want them to mean! (my only pet peeve is when someone automatically thinks a song is about sex)\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nSeems like the person is depressed \r\nEverything going wrong in their life and he/ She is talking to a loved one. \r\nWhen you feel my heat look into my eyes . Do not get too close ( a kind of a warning to a loved one to look into the eyes of a person when they are angry THAT IS when you feel my heat but also telling that person not to dig in too deep ) because the demons that they are hiding maybe too traumatizing for the loved one and that person needs to shielded from that trauma. \r\nAlso  saying \r\nYour eyes they shine so bright .....Unless you show me how \r\nHoping the person is strong enough to deal with it and show them how they themselves can deal with it. \r\nBasically baring your soul in front of a loved one with a slight hope of being less pained . Obviously the person is going through hell\n\n\n", "comment_24": "\nFor anyone who has ever struggled with depression the meaning of these lyrics is obvious. It is why people with depression often don't tell anyone about what they are feeling and may push away friends and family. You need to understand in clinical depression major components are a sense of utter hopelessness as well as feelings of guilt and shame. There is a desire not to \"burden\" others with your problems, and why bother when nothing will help anyway? \nThis song is about such an individual who is struggling with these feelings. They won't talk about their feelings because they don't want to burden others, yet secretly hope someone else will recognize their pain. The singer is talking about his feelings of guilt \"greed\" in hoping that hoping this might occur.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nDemons is one of my favorite songs ever! I think it unlocks the hidden meaning of the hate and darkness that fills our world. He talks about how on the outside people seem good, but in every human being there lies a temptation waiting to be fought.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThere are a lot of ways to look at it, but overall, the singer is saying that he cares about the person but doesn't think he deserves someone as good and pure as her. He has been corrupted by society/depression/heartbreak/etc., and wants to protect her from having to go through that. He just doesn't want her to see how awful he can be on the inside.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis song, like radioactive from imagine dragons are have actually much more depth than they are being accredited. Do not judge the meaning of the song from the story line of the videoclip. They are words being spoken as an entity is revealing itself and knows the human behavior very well. Imagine Dragons song Radioactive also speaks in a smilar tone and has a futuristic antecipation note to it as the entity will be victorious soon. Hope he who reads understands.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI think this song is about a person that has been through a lot in their life. The demons refer to the things from said past that trouble and effect that persons daily life and interactions. I think he is talking to someone he loves, trying to explain what he is about and why they should stay far from him.\n\r\n\"When the days are cold\r\nAnd the cards all fold\r\nAnd the saints we see\r\nAre all made of gold\n\r\nWhen your dreams all fail\r\nAnd the ones we hail\r\nAre the worst of all\r\nAnd the bloodâ\u0080\u0099s run stale\n\r\nI want to hide the truth\r\nI want to shelter you\r\nBut with the beast inside\r\nThereâ\u0080\u0099s nowhere we can hide\"\r\n--- He is talking about when everything seems to be going terrible and failing. He knows it effects him and how he sees the world, behaves, etc perhaps he becomes depressed or angry. He wants to protect the person he cares about, he doesn't want him/her to know what happens to him when these demons surface. However, he knows that he can't hide it from the person he cares about. He knows he cannot control it.\n\r\n\"When you feel my heat\r\nLook into my eyes\r\nItâ\u0080\u0099s where my demons hide\r\nItâ\u0080\u0099s where my demons hide\r\nDonâ\u0080\u0099t get too close\r\nItâ\u0080\u0099s dark inside\r\nItâ\u0080\u0099s where my demons hide\"\r\n--- He is asking the person he cares about to try and understand him when his demons surface. He wants them to look into his eyes and see he has changed, and to know the demons dwell just under the surface, so close it can be seen in his eyes. He is warning the person to stay away and not get close to him. He is telling said person that its dark inside, what he feels is dark.\n\r\n\"Donâ\u0080\u0099t want to let you down\r\nBut I am hell bound\"\r\n--- He doesn't want to disappoint the person he cares about b/c of his demons, but the things he has done are something he deems so terrible that he would be sent to hell (either literally if he is religious, metaphorically if his life is hell, etc). \n\r\n\"Though this is all for you\r\nDonâ\u0080\u0099t want to hide the truth\"\r\n--- He doesn't want to hide the truth from the person he cares about, but he will still put up a facade. He is letting that person know that the facade of nothing being wrong is all for the sake of the person he cares about.\n\r\n\"They say it's what you make\r\nI say it's up to fate\r\nIt's woven in my soul\r\nI need to let you go\"\r\n--- He is absolving himself of any blame in the situation. How he acts is in him, and he cannot change it. Its all destiny/fate, not his doing or choosing. Because of that he needs to let the person he cares about go.\n\r\n\"Your eyes, they shine so bright\r\nI want to save their light\r\nI can't escape this now\r\nUnless you show me how\"\r\n--- I think this can be interpreted two ways. Unlike him there are not demons in the other persons eyes. The other person is his exact opposite.(1) He does not want to influence the person he cares about and take the light out of their eyes b/c of how he acts or feels. OR (2) He wants to save the light in the other persons eyes for him. He wants to know how that person obtains in and keeps it. Either way he knows that there is no way to escape his demons without that persons help.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI believe that this song is about how some people are depressed. No matter how sad you can get, somewhere you'll find hope. \r\nI heard about a girl in my school that committed suicide, and I believe that she just couldn't see that bit of hope telling her that she had friends. But supposedly she had family troubles, so she felt it was the best thing to do.\r\nI, for one, haven't thought of suicide, but I'm anorexic. Its difficult to find the energy to find joy in living when I haven't eaten in weeks. But thanks to this song, I see hope.\r\nBy saying \"I can't escape this now, unless you show me how.\" shows that no matter what, somebody will always care for you.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song really hits home for me. It is one of the most relatable songs I've ever listened to, and I think many others relate to it the same way I do. To most people, I seem quite happy, outgoing, and energetic, but only those that know me well know about my dark past, and things I've had to overcome in my life. I've always been afraid of somebody not accepting the way I am because of these things, but this song has made me realize that it's those things that make me who I am.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nWhen the days are cold \r\n[When there are bad days]\r\nAnd the cards all fold\r\n[and when you feel like giving up]\r\nAnd the saints we see\r\n[The people you idolize]\r\nAre all made of gold\r\n[Are made of greed/something to be desired]\n\r\nWhen your dreams all fail\r\n[When your dreams all fail]\r\nAnd the ones we hail\r\n[The people that you respect/pursue to be]\r\nAre the worst of all\r\n[aren't the best type of people]\r\nAnd the bloodâ\u0080\u0099s run stale\r\n[now your ambition is gone (the desire that filled you with life is seen as undesireable)]\n\r\nSecond Interpretation of the Verse: \r\nWhen your dreams all fail\r\n[When your dreams all fail]\r\nAnd the ones we hail\r\n[Your friends/family]\r\nAre the worst of all\r\n[aren't the best type of people]\r\nAnd the bloodâ\u0080\u0099s run stale\r\n[Relationships break apart]\n\r\nI want to hide the truth\r\nI want to shelter you\r\n[The singer wants to hide someone precious from the corruptness of the world]\r\nBut with the beast inside\r\nThereâ\u0080\u0099s nowhere we can hide\r\n[There is greed in everyone. Even if they hide, there is greed living in their hearts, as it is human nature.]\n\r\nNo matter what we breed\r\n[It could mean no matter how you raise your kids/or what you create in life]\r\nWe still are made of greed\r\n[Greed and \"evil\" are apart of human nature]\r\nThis is my kingdom come(2x)\r\n[No clear description, but I would assume that it can refer to the Bible, where salvation is met at death?]\n\r\nWhen you feel my heat\r\n[This may be when two people embrace]\r\nLook into my eyes\r\nItâ\u0080\u0099s where my demons hide(2x)\r\nDonâ\u0080\u0099t get too close\r\nItâ\u0080\u0099s dark inside\r\nItâ\u0080\u0099s where my demons hide(2x)\r\n[The singer may tell the one that he loves that deep inside, that somewhere, eventually there may be \"evil\"]\n\r\nWhen the curtainâ\u0080\u0099s call\r\nIs the last of all\r\nWhen the lights fade out\r\nAll the sinners crawl\r\n[At death, when darkness comes, the sinners will pay]\n\r\nSo they dug your grave[People will judge]\r\nAnd the masquerade[They're wearing a mask to hide their imperfections]\r\nWill come calling out[They'll call you out on things]\r\nAt the mess you made[At such any mistake]\r\n[People will begin to judge you, despite themselves wearing a mask]\n\r\nDonâ\u0080\u0099t want to let you down\r\nBut I am hell bound\r\nThough this is all for you\r\nDonâ\u0080\u0099t want to hide the truth\r\n[The singer doesn't want to hide the truth, but they think it's best if they hide their darkness so that the other may be happy.]\n\r\nThey say it's what you make\r\nI say it's up to fate\r\nIt's woven in my soul\r\nI need to let you go\r\n[The singer thinks that they're cursed to live a pitiful life, and in order to protect the other, it's better stay away from the one he loves.]\n\r\nYour eyes, they shine so bright\r\nI want to save their light\r\nI can't escape this now\r\nUnless you show me how\r\n[The lover is amazing in the eyes of the singer, and the singer feels that it needs to be protected from the darkness of the world. He wants to escape his own darkness, but he cannot without the help of the other. ]\n\r\n.// I didn't translate the chorus.\n\r\nAlso, this is just my interpretation of the overall meaning of the song:  \n\r\nThe singer wants to protect the one he loves from the corruption of the world. Even the people that they idolize are \"corrupt\". However, deep inside, the singer knows that human nature is naturally greedy, but love may allow an escape from it. This is because love is selflessly loving another.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nit's talking about how when the days are getting worse...a the person can feel that their bad life is balling up inside them...they don't want people to know. They might explode soon... \"don't get to close\" ... \"it's where my demons hide\". Someone broke that barier and made a mess of that person by making them show who they are. The person want to keep their sanity but... it's almost impossible for them because it's where there demons hid for a long time. Imagine Dragons made this song to show that those people aren't alone. We all have demons... or a demon and the band wanted to show that none of us are alone.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThis song definitely hits home with me. Back in August I tried to kill myself, and woke up 4 days later in the hospital with kidney failure, a damaged lung and on dialysis. It was a brutal experience and I'm still struggling with getting myself back together and staying strong for my family, trying to show no weakness or hint that I'm stuck in that spot the day I tried to commit suicide and am in a big ass mess now, physically, emotionally and financially. It shows you what people are capable of doing to themselves and are going through deep down. \nIt is a sad song, especially the video but I'm glad they made it.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI lost a friend 9/11/12. Nobody liked him yet nobody new him. I saw his struggles while everyone took him for a loser. He was there for me when I was lost in alcoholism.  If you look at the video, the boy with the black eye may look like a bully but he gets bullied at home. His abuser is his demon. The guy with glasses looks out of place in the crowd  because of his insecurities but we would never know that. The girl looks ok but she is hurting for a loss of a loved one. We couldn't tell by looking at her. Growing up.. my mother was an alcoholic. A meth head. I became her and wouldnt escape that but I was introduced to God. Thats where \"unless you show me how\" comes in. My mother was my demon. Moral of the song... dont fuck with people . They seriously have enough problems. \t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI actually find this one interesting. And I'll preface this by saying that the song is perhaps one of the best I've heard in the modern era.\n\nI agree with a lot of sentiments here and my thoughts are quite closely aligned to them.\n\nThe song suggests that we as individuals all have some sort of internal demon that we're forced to deal with at some point - whatever that might be - and that although at some point it might appear that we have overcome it, the demon is hiding in there for good, somewhere deep inside. \n\nThat the demon inside of us can be one that individuals hide on purpose and choose not to tell anyone. Only when they seek help or guidance and let others in, do others then understand what they're going through and how they feel. \n\nUltimately, the song is about trying to hide something deep down and not tell anyone - the demon - but knowing that eventually, you will have to do so. \n\nAll in all, a great song and some great views on what it means to different individuals.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis song is (IMHO) about the ennui and meaningless that come from a lack of challenge or conflict in life, which leads the narrator to become (potentially) dangerous to those s/he loves, as s/he has no outlet for her destructive energy.\n\r\n\"When the saints we see are all made of gold\" refers to having no role models to guide one's moral actions (further explored with \"the ones we hail are the worst of all\". Because the narrator has no guiding light, they are open to potentially satisfying their desire for adventure by harming those close to them instead of fighting their enemies. This is represented by the \"demons\" who will attack if the person's lover gets too close and therefore presents an easy target. The common use of \"demons\" in everyday language to refer to past traumas might mean that past experiences of conflict, combat or abuse have acclimatised the narrator to violence (whether physical or not) and she now has a need for it.\n\r\n\"When the blood's gone stale\" refers to the pursuit of a fleeing, wounded enemy; the pursuit could be through investigation, litigation, activism, whatever; maybe there's no meaning. But now it has gone stale and the person is bored. He feels he is no longer alive because there's no buzz- hence the reference to a grave and feeling that people will say he has failed. There are references to others being fakes- \"masquerade\", \"greed\", etc. \"Curtain call\" refers to the end of the pursuit and it could even mean that the narrator has won their case or campaign (\"the cards all fold) but now there are no more thrills.\n\r\n\"It's woven in your soul\", \"I can't escape this\" further emphasise that the beast or demon is part of who he is- unless his/her lover can change this.\n\r\n\"Heat\" seems to mean the fire s/he feels while fighting/pursuing her enemy, contrasted with days being \"cold\" when the joy of the chase ends. He is hell-bound because though he fights for his lover or others (\"this is all for you\") he enjoys the conflict too much and is just using good motives as an excuse to indulge his passion for excitement (\"don't wanna hide the truth\"). He wants to shelter his lover from the ennui of having no thrills and from his own demons.\n\r\nI personally feel that \"This is my kingdom come\" is kind of sinister. It implies things will be this way for the foreseeable future and there is no way either to find a new challenge, re-start the old one or change and become okay with having no conflict. The line about \"no matter what we breed/we are made of greed\" implies that the lover shares at least some of the narrator's need for conflict and tactics of using \"cover\" to satisfy this need; however now that their fight is at an end, the stronger or more sinister appetite of the narrator is a threat to the lover and to protect him or her the narrator must send them away.\n\r\nI've struggled with some of these issues myself.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nAs  i am suffering from great vision impairment ,this one aptly suits me.\nLooks like every line seems to be written only for me. I cried numerous times while listening to this one. One of my favorite.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThis song was first recorded in 2011-2012. Could this song be referenced to Dan Reynolds welcoming his daughter into the world ?   He says he has demons...perhaps he is addressing his openness about his depression and wants to acknowledge his truths ?  I want to shelter you...\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI want to say this is a pure love song, but he's afraid of the demons inside of him.  I can relate - I love someone deeply and the demons inside me are self-doubt and fear.  This song resonates with me so much.  Excellent lyrics, great production.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI think it's about a father or any parent trying to shield their child from the world but its hard when everyone even themselves has demons of their own. Even though the child is innocent the parent realizes that he can't shield her from the world forever and has to let go.  He's saying that that childs innocence is the only thing that can help him through his demons.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis song gives me permanent The Student Prince feels.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nthis song to me is about being in a relationship with someone and not wanting to break up with them and hurt them even though deep down inside it's what you want. you want to shelter them from the pain of it all, but know that you have to do it. having demons inside is having made the mistake of cheating or thinking about cheating and knowing what will ultimately happen if you stay with them and knowing you need to let them go.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThis is about a man that sold his soul to the devil for temporary success and fame on this earth. He is cursed and doomed to an eternity in hell. In the meantime he is here on earth and has fallen in love with a woman but knows that the best thing for her is to tell her the truth rather than shelter her by saying nothing and letting her assume that nothing is wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nTo me, this means that we all have our dark sides, and our problems. Also, that this person has been hiding their true feelings which is all dark and being fake and yeah. But now, reading through the comments, I think @DahkotaParo (she/he said: I got that it is about our \"demons\" in our pasts. It's about every secret that we hide that bothers us. Also in the music video it shows many people's issues that they deal with. Powerful and deep song, a personal favorite) \n\r\nI really agree with him/her. I think what she said is completely true\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThis is  a prayer or conversation with God.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nIt's like anyone that you see passing by, they might have a smile on their face but if you look into their eyes and really look at the details you will see they're in pain because eyes don't lie. \n\r\n\"When you feel my heat, look into my eyes that's where my demons hide...\" shows that they may not show it but the person is struggling with past problems, fears, secrets which in this song he refers to as \"demons\". \n\r\nNow someone is trying to enter in on that person's life but they don't want to let them in because they don't want them to be involved in all their troubles, etc. Hence, \"Don't get to close, it's dark inside.\" He doesn't want the so-called to get to close to the person because of their demons.\n\r\nBut towards the end of the song, it's more of a cry for help. \"They say it's what you make, I say it's up to fate.\" The person is realizing that they can't push that person away because that's how it was meant to be. \"I can't escape this now, unless you show me how.\" The person wants to be released from their troubles and they're asking for help. \n\r\nThis song can relate to anyone who's facing troubled times or who needs to learn to open up. Like me I don't particularly like talking about my problems and emotions even though deep down I know it's important. My walls need to come down, sooner or later.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI think this song is about the influences of our current modern society coming into direct conflict with the more personal feelings of love.   The beginning of the song is referencing the ideas of being cold, down on your luck and that \"saints\" are made of gold.  This seems to reference a world made up of the power of money.  The second stanza continues that idea with the image of failed dreams and the ones we hail (ie: heroes of our society)  \"are the worst of all\".   This continues the idea of a societal picture that is dark and failed.  He also references the idea of greed and then follows it with the biblical reference of \"my kingdom come\".   This all points to the idea of an ideal picture of the world that has been flipped on its head.  Money and false fame are the gods leading the way in this dark picture--and yet they are alluring.   Despite the biblical reference, I don't think the song is smacking of heavy religion and it is not about true demon possession.  It is just figurative language used to drive home his points.\n\nThe song writer feels the presence of this dark society that he is not free of and is both victim and participant in.   \n\nI do see a sense of love in the song and of wanting to protect another from these dark things about the world that he sees so clearly.  However, he knows these parts of the world have hold of him right now and are drawing him toward them.  \n\nHow many young people are not drawn to the ideas of fame and money to some degree?  \n\nLove, however, is an entire different force of nature and it collides with the darker pulls for the songwriter.  He is caught in the the light of his lovers eyes.  The next part could be interpreted two ways.  He writes \"I can't escape this now, unless you show me how.\" This could be a sort of silent plea to his lover to help him overcome the darker and greedier parts of life and to stay in the light of her/his eyes.  It could also be a plea for the lover to release him of these feelings of love and let him go on his path.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI take this song to mean that we all have our own personal demons and secrets. The singer doesn't want his love to know about all of his burdens, and even more so wants to keep her from suffering the same burdens. Everyone has their own dark past, or dirty little secret.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI think this is a very well written song because everyone can relate to this everybody has demons and/or skeletons in their closet. And as most very well written songs do, the singer has his own meaning. But almost anyone can relate.\n\n\n", "comment_50": "\nWow... this song is so touching. I have a friend who no one likes and every one is a jerk to, so he is a jerk back. This is only because he doesn't no how to handle his demons though. If he didn't have me and one other person on his side I am sure he would be dead right now. If you see someone doing crap to someone else, like that boy's father in the video, SAY SOMETHING!!!! You might save a life.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nFor some reason, this makes me think of a single father trying to protect his child from the world. He's done some bad things in the past, and even though his child is old enough to know, they're so bright and innocent that he doesn't want to ruin that innocence. Towards the end, he's starting to decide that he doesn't want to lie to them, and their innocence keeps him grounded.  He's also terrified that his child is going to hate him when they find out about his past, and he doesn't want to lose them.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nthis song is all about how the guy who is singing has a lot of problems. He also has a girlfriend who is happy and innocent, and he doesn't want to show her all of his issues and how messed up he is because he's afraid to hurt her or scare her. He wants her to break up with him because he doesn't trust himself with her, and he doesn't want to drag his girlfriend down with him. near the end of the song, he mentions that he can't escape his demons without her, and you can hear that he is hopeful and though he needs her help, he is willing to escape the metaphorical demons in his mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nJudging from the music video i think this song is about him going through hard times and he is encouraging others to come together to make those hard times less difficult.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis song reminds me of the TV show Dexter, the first four seasons in particular. Since Dexter is a serial killer who kills other killers, he has to find solace in someone, which he finds in Rita who was originally meant to be a shield for him but ends up becoming something more. He doesn't want to show her the real him as he fears that she will leave him so he hopes that she will help him whilst he protects her from the real him and the consequences that he brings about.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nThe first part of the lyrics to me is talking more about consumerism and the modern era we live in, we give in to â\u0080\u009cfalse godsâ\u0080\u009d thatâ\u0080\u0099s mostly what I get from it, â\u0080\u009cwhen your dreams all fail and the ones we hail are the worstâ\u0080\u009d, we want material things or things that are just not in tune with who we are or what we should be doing to â\u0080\u0098helpâ\u0080\u0099 the world so to speak. \nâ\u0080\u009cI wanna hide the truth\nI wanna shelter you\nBut with the beast inside\nThereâ\u0080\u0099s nowhere we can hide\n\nNo matter what we breed\nWe still are made of greed\nThis is my kingdom come\nThis is my kingdom comeâ\u0080\u009d\nThis part pretty much explains itself, wanna hide the truth, you donâ\u0080\u0099t want your children to see the world we have created, we want or try to shelter them in dreams of happiness or a beautiful and harmonious world that doesnâ\u0080\u0099t exist. Take a look at the beast inside part and the â\u0080\u009cwe still are made of greedâ\u0080\u009d, we always want more and more than what we need to survive, to live. \nIâ\u0080\u0099m surprised not many people are talking about the greedy part and the demons hiding inside part :s \n\nâ\u0080\u009cThey say it's what you make\nI say it's up to fate\nIt's woven in my soul\nI need to let you go\n\nYour eyes, they shine so bright\nI wanna save that light\nI can't escape this now\nUnless you show me howâ\u0080\u009d\n\nThis part gives it a more â\u0080\u0098romanticâ\u0080\u0099 feeling to it, like taking about a possible lover/partner, or maybe again about children,son,daughter, hoping that the future of those relationships will get them out of that greed world that we live in or make it a better place to live in. They wanna save that light and not get involved with those persons too much to not make them like they are now, full of those demons inside? \nWell thatâ\u0080\u0099s my take on it :P\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI think this song is wonderful. There's a common thread throughout the lyrics; it's trying to say that we all have our demons/our vices/things that we don't want others to see. I think the video definitely shines a light on what this song might truly be about. It can be about an eating disorder/mental illness, about someone's fears, addiction, instability, etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nMost people hear this song and think these things: he is singing about being crazy, he is depressed, or he is singing about monsters(demons). In a way, all of these are correct. Let me clear it up for you:\nThis song is about a guy that is in love with this girl. He lives in a world of nothing but bad, bad, bad. Except for her. He wants to keep her away from him because she is so innocent and he has done bad things. He has bad memories that will sadden her. He doesn't want to hurt her. He also can't just set her free because there are so many bad people that she won't be safe without him. He wants to escape this world, and believes she is his only way out. Still looking for a deeper, more satisfying and descriptive explanation? Ok, here I go:\n\"When the days are cold\" means it is dark, depressing and bad.\n\"The cards all fold\" means everyone has given up and is now bad.\n\"The saints we see are all made of gold\" means there are no more saints, they are just golden statues now, all gone and dead.\n\n\"When your dreams all fail\" means no one goes out to follow their dreams, there for they are failing. Also, good dreams are an escape from a bad world. Good dreams coming true is even better. When the good dreams no longer have hope or come to you, they can't come true, which means that they have failed.\n\"The one we hail are the worst of all\" means that no one is good, so there is no one to hail that really would be someone good to hail. no more good role models anymore.\n\"The blood's run stale\" means no one is really living or has a reason to live. There is no good left in the world, so everyone is as good as dead.\n\"I wanna hide the truth, I wanna shelter you\" means he wants to hide the truth of all the bad things in the world from the girl he loves to shelter her, or protect her.\n\n\"But with the beast inside, there's no where we can hide\" means he has done bad things, has bad memories that will sadden or hurt her. He can't hide her from himself because he needs to protect her from everything else that's bad.\n\"No matter what we breed, we still are made greed.\" means everyone, good or bad, had greediness inside of them. They all want something, and sometimes want lots of it.\n\"When you feel my heat, look into my eyes\" means when she feels his warmth, his presence, and goodness, look into his eyes and find the truth about him. That's where his demons or bad memories and sins all hide.\nWhenever he says \"This is my kingdom, come\" he means that the darkness and evil is so common, that's all his world can consist of.\nThe first shred of hope in this song is when he says \"I can't escape this now, UNLESS YOU SHOW ME HOW!\" He is saying the girl he loves is the only thing that can lead him out of this mess of darkness and evil. There is one more line I would like to explain.\n\"Your eyes, they shine so bright, I wanna save that light\" means the girl he loves is the only light and goodness in his entire world.\nI want to share some of my memories that I connect with this song. When I go to school, everyone saw me as the happy, fearless girl. The one who was strong, brave and always happy. I showed it that way, and made it seem like that's the way it really was. But deep, deep inside, I also had my own Demons. Bad memories. Bad things I've done. And stupid fears that I know I shouldn't be afraid of. This song helps me know that I'm not the only one with a deep, dark, inside. I do have happy things in my life, which is like the lover in this song.\n(Also, check out Carly12's review, it is also is very true)\nWith lots of hope,\nMusicFreakLove\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThis song is basically how I felt coming out of the closet in my youth. Just the confusion and the wanting to shelter my highly religious family from what they perceived to be evil. I kept it all inside for years, and then finally I let go when I turned twenty and moved out of the house. \" This is my kingdom come, it's where my demons hide.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nMy perspective of this song is that of a person (assuming a male pronoun out of convenience) who has learned to internalize conflicts rather than express them externally. He is struggling to reach a level of close intimacy with someone he loves but is afraid that divulging details of himself would hurt that person. Instead, he chooses to keep his conflicts internal, rather than reaching out for support, until the very end of the song.\n\n\"When the days are cold\n[// depressing days]\n And the cards all fold\n[// emotional state triggers positive feedback loop of negative affect]\n And the saints we see\n Are all made of gold\n[// the ones that society deems as moral authorities are at impossible standards for him to ever reach and quite possibly for anyone to reach. Perhaps the saints' moralities are only superficially golden.]\n\n When your dreams all fail\n[// goals of pure morality fail]\n And the ones we hail\n Are the worst of all\n[// he expresses his frustration by hating the moral authorities because of their impossible to reach ideals]\n And the bloodâ\u0080\u0099s run stale\n[// he finally calms down from his anger]\"\n\nThese last two stanzas construct a context of existential despair that results from an inability to bring his collectivistic-morality-derived ideal self in congruence with his actual self.\n\n\"I wanna hide the truth\n I wanna shelter you\n[// he wants to conceal a part of himself to his loved one out of consideration for him/her]\n But with the beast inside\n Thereâ\u0080\u0099s nowhere we can hide\n[// he fears that he won't be able to conceal the part of himself that he desires to]\n\n No matter what we breed\n We still are made of greed\n[// he again realizes that his problem is that of the human condition and therefore inherent. Furthermore, everyone suffers from the human condition, and nobody is perfect. It cannot escape humanity, not even from attempting to weed it out of children while raising them.]\n This is my kingdom come\n This is my kingdom come\n[// he accepts that he can't change himself]\"\n\nHe starts a relationship with someone that he wants to get closer to, but doesn't want to disclose details of his inner turmoil with him/her out of fear of hurting him/her emotionally. Additionally, he finds a way to accept himself and to somewhat justify his state of being by seeing it as a component of the human condition.\n\n\"When you feel my heat\n Look into my eyes\n Itâ\u0080\u0099s where my demons hide\n Itâ\u0080\u0099s where my demons hide\n Donâ\u0080\u0099t get too close\n Itâ\u0080\u0099s dark inside\n Itâ\u0080\u0099s where my demons hide\n Itâ\u0080\u0099s where my demons hide\"\n\nHe's still trying to conceal his dark traits, but he's at least letting his loved one know that he's having inner turmoil.\n\n\"Curtainâ\u0080\u0099s call\n Is the last of all\n When the lights fade out\n All the sinners crawl\"\n\nAt death all of the sinners crawl in hell, possibly implying he's one of them.\n\n\"So they dug your grave\n And the masquerade\n Will come calling out\n At the mess you've made\"\n\nA masquerade is a party where all of the attendants wear masks concealing their identities. This is a metaphor for hypocritical society attacking him emotionally, wanting him dead, because of their turmoil that results from their inability to accept his deviance from society's norm. Though, the members of society who are attacking him might possibly have equal deviance from society's norm, but do not stand up for him. Therefore, they wear masks. All of this is a potentiality in his mind; it didn't occur yet. It's just an expectation of consequences that might occur if he exposes himself fully.\n\n\"Don't wanna let you down\n But I am hell bound\n[// he wants to be the best for his loved one, but he can't; he is perceived as evil and will go to hell by society's standards]\n Though this is all for you\n Don't wanna hide the truth\n[// he's hiding parts of himself to protect his loved one, but he wishes that he could expose himself and still be accepting for who he is]\"\n\n. . .\n[chorus]\n. . .\n\n\"They say it's what you make\n I say it's up to fate\n It's woven in my soul\n[// his deviance is not his choice but rather an essence that the universe imposed on him]\n I need to let you go\n[// he can't bear exposing himself fully to his loved one, and at the same time, can't bear concealing it from him/her either. Therefore, losing the loved one is the only option.]\"\n\n\"Your eyes, they shine so bright\n I wanna save that light\n[// he wants to preserve his loved one's innocence]\n I can't escape this now\n Unless you show me how\n[// finally deciding upon staying with his loved one, he courageously chooses to seek support from his loved one]\"\n\n. . .\n[chorus]\n. . .\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nIt's about people having a dark side, yeah! But it's also about people being over run by greed\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nyou know!! this song is full of emotions and its a lovely song!!! when i listen to this, it reminds me a very beautiful series! The Vampire Diaries!!! when a person isn't a bad guy, actually he/she is a good guy! but at least in he/she 's bloodline is being a bad guy! just like being a good vampire but at least, you are a vampire and killing people and being a bad guy is in your soul !!! i hope you understand my words meaning! ;-)\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nMusic Industry, fame, etc.\n\r\nThis song may have been DEDICATED to a kid with cancer but that is NOT what the lyrics are explaining. It wouldnt make sense. \n\r\nWhen the singer was coaching on The Voice, he said it was abt he and his wife and how they used to struggle but now have money and everything.\n\r\nFrom there you can understand the lyrics to be abt the music industry. He is basically saying that he is doing all of this for her \"this is all for you, dont wanna hide the truth\"...but he knows it comes at a price. Its like selling your soul. He is doing what he believes he has to do to make her life better.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nwhen your dreams (awful)all fail\r\nand the ones we held(wounds we hailed)\r\nare the worst of all\r\nwhen the bloods run stale\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nThe song is talking about how everyone has their demons in life. (I looooooove the song)\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nBut some of us may have darker sides that may scare off the people we love. Think about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nMy interpretation is that no matter how hard we try not to be, we are all greedy in the end. We work for gold, we idolize those that have the most gold and demean those that don't have any. We base our successes on gold. We horde it, we flaunt it and we hold it too close.In the end, when we die, we cannot take it with us. The only thing we leave behind for those we love is the gold. This in turn, creates an even bigger mess. The mess we left behind... those that really did love us and those that are gold digging will fight over it. As a civilization, we doomed because we have based all of what we do and who we are on material wealth. If we have it, someone wants it. Even in our everyday lives. When was the last barter or trade you did at the supermarket? the fuel pump? Better still, the bank?\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nThis song is about how sometimes he cant control himself so hisself takes over him (demons)\r\nIts basically like having out of body expieriences like involuntary man slaughter\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nDan himself has said he wrote Demons retrospectively, thinking back to a time when he was suffering heavily from anxiety and depression. He doesn't have a cure for it, but he wrote this song when thinking back to the time when he was at his worst.\n\nI believe it is simply him telling someone (could be a partner, friend, family member or anyone) to not \"get too close\" to him because he's scared of how they'll react when they discover he suffers from all these mental issues.\n\nThe line \"this is my kingdom come\" is just fantastic to me. It's him finally declaring it, finally getting it off his chest.\n\nFor me, the best thing about this song is that it's left open to application. I could take this song, and sing it wholeheartedly to someone but with my own personal \"demons\" being the subject. And I think that's beautiful and why I love ID's song writing, never mind the power in his voice when he sings it.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nIn my mind, the only thing I can think of that he is talking about is sin. In the refrain, he says, \"When you feel my heat, look into my eyes. It's where my demons hide, it's where my demons hide.\" I think he is confessing to a priest about his sins. Most priests are meant to be caring and compassionate in times of great distress, and most of the times, when you look into peoples eyes, it tell them that you do care.\nHe also said, \"No matter what we breed we still are made of greed...\". This shows that, no matter how hard we try, sin will still be here. However, to counter that, he says, \"Your eyes, they shine so bright, I wanna save that light. I can't escape this now, unless you show me how\". I think he is saying to the priest that he is so holy, and he is not. He means that he cannot escape it, unless the priest can lead the way to Jesus. \nLastly, he says these two things: \n\"Curtainâ\u0080\u0099s call\nIs the last of all\nWhen the lights fade out\nAll the sinners crawl\"\nand\n\"They say it's what you make\nI say it's up to fate\"\nI think what he is talking about is the Last Judgement, where we will all be called, the light of the universe will fade, and the sinners, or they who did not follow Gods plan for them and sinned against him, will, very unfortunately, be spending eternal tragedy in hell. He, lastly, says that its up to fate, which is true. God has a plan for us. It's not our plan, and we don't make it. I believe he is telling us, through this song, that our plan for ourselves won't bring us to heaven, but God's plan will.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nThis is one of the most candid pop-rock songs I've heard. To me, this song is a vivid portrayal of the unescapable imperfections or \"demons\" the everyone faces. The man is trying to tell the other that he's not what he thought he was and he is desperate to find away out of his personal cage.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI think this song could also be about a person that sees the world differently then other people because he has been through a lot. \t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nMy favorite lines are \"They say it's what you make I say it's up to fate Its woven in my soul I need to let you go. \"\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI think it's about how he loves somebody but he has all these dangerous flaws. He's afraid of getting too close, and that's why it says \" don't get too close, it's dark inside\"\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI think that Imagine Dragons is this really dark band, and, in that same way, they are a little bit like my 2 favorite bands, My Chemical Romance and Panic! AT THe Disco. Anybody else like them?\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThis is a song for realists. No matter how hard we try to believe that people are good, we know they're (at least the majority) not. I personally believe people are born good, but they get influenced by all the hate and bad in the world. This song dives into the meaning of what it is to want to escape the horrors of the world. The person singing has found one good person who he believes can save him, but he's not sure that he wants to have her save him for fear of that person falling too. He loves the person too much to have them save him if it means compromising themself.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\n I think it's a guy tried to face his demons\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI mean......I seem to hurt everyone I love...even my friends. so this is a perfect song for me. I should sing it to my boyfriend.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nImagine Dragons actually dedicated this song to a teenager, named Tyler Robinson, who died of cancer just as they finished recording the song to be put on the album \"Night Visions\". Shortly after Tyler's death, his family and Imagine Dragons started The Tyler Robinson Foundation.\r\nOn the foundation's official website, they share the reason why the foundation was started, along with Tyler's story. It reads as follows:\r\n\"\r\nThe Tyler Robinson Foundation begins with the story of Tyler â\u0080\u0093 one of many heroes who chose not to let his prognosis dictate his outlook on life. At 16-years-old, Tyler was diagnosed with Rhabdomyosarcoma, a rare form of cancer.  In the following year leading up to his passing, he was able to touch countless lives.\n\r\nThose who knew Tyler were inspired by his courage, and his insistence on enjoying life and spreading happiness despite the physical and emotional strain of living with cancer. Determined to continue Tylerâ\u0080\u0099s legacy of creating something positive despite the odds, his family and members of the band Imagine Dragons (who had grown close to Tyler) came together to create the Tyler Robinson Foundation. Below is Tylerâ\u0080\u0099s own story, penned just a few months before his passing. Some people say that Tyler lost his battle with cancer, but we couldnâ\u0080\u0099t disagree more. The real battle is not whether you live or die, but how you respond to the challenge.\n\r\nMY STORY (Tyler wrote it himself)\n\r\nMy name is Tyler Robinson and I would like to tell you my story. When I was 11-years old I got a staph infection in my leg that went septic â\u0080\u0093 the infection spread throughout my body and my organs began to shut down. I spent two weeks in intensive care at Primary Childrenâ\u0080\u0099s Hospital on a respirator and had seven operations on my leg. I was fighting for my life and many people thought that I wouldnâ\u0080\u0099t make it â\u0080\u0093 but I fought hard and after five weeks in the hospital and five months on antibiotics â\u0080\u0093 I was cured.Last year, when I was 16 years old, I noticed I had a lump in my groin. I had been working out so I just thought I pulled my muscle; but it kept getting bigger. I finally told my mom about it and she took me to the doctor. After the biopsy I learned that I had a cancer called Rhabdomyosarcoma. I was told that I had a racquetball-sized tumor near my bladder and that it had spread to my lymph nodes and throughout my body. After a spinal tap they told my parents that my bone marrow was 95% full of cancer. My parents didnâ\u0080\u0099t tell me that it was stage 4 because they didnâ\u0080\u0099t want to discourage me.It seemed surreal at first, but I was OK with it. Then I went to meet with the doctors and they told me what I was facing. I needed to have 20 rounds of chemotherapy and it would take a whole year. I would also need an operation and six weeks of radiation. I would miss my junior year at Brighton High and some of my senior year. I remember going home and feeling so mad and depressed. I told my mom that I didnâ\u0080\u0099t want to go through it â\u0080\u0093 not a whole year of it.\n\r\nMy bishop came over that night and gave me a blessing. He told me that people who go through hard things either become bitter and angry, or they learn from it and become stronger. He told me that I had a choice to make. From that night on I chose to be the bigger man.\r\nIn February I had my first set of scans and tests to check on my progress. My doctor came into the room and told us that everyone was amazed that my tumor was gone and I wouldnâ\u0080\u0099t need an operation. I still needed to go through six weeks of radiation and to continue chemotherapy until the fall. In June the tests showed that my bone marrow was completely clear of cancer. I am now officially cancer free and I will be done with my treatments next month.\n\r\nThis year Iâ\u0080\u0099ve learned to be patient and no matter how bad I felt, I pushed through the pain. I found that there is no use complaining or feeling sorry for myself â\u0080\u0093 it doesnâ\u0080\u0099t help anything. Always try to stay positive and have faith.\n\r\nTylerâ\u0080\u0099s cancer unexpectedly returned just after writing his story and he passed only a few months later. But his optimism and zest for life stayed with him to the end. He taught those who know and love him the power of positivity and its ability to extinguish darkness even in the face of adversity. We hope that this Foundation can honor his example by reaching out to lift up other children with cancer and the families who support them.\r\nTyler loved music, which was the catalyst for his relationship with the band Imagine Dragons. One of his favorite lyrics during the time he was battling cancer comes from the song â\u0080\u009cItâ\u0080\u0099s Time,â\u0080\u009d which says The road to heaven runs through miles of clouded hell. When the band heard about this, they dedicated the song to him at a show â\u0080\u0093 this was the beginning of a long friendship.\"\n\r\nSources:\ntrf.org/about/\nm.youtube.com/… (at 3:10) \n\n\n", "comment_79": "\nI was at an Imagine Dragons gig last night and Dan explained this song is about depression and his own battle with it, overcoming it \t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI think this is about communication between God \"I can't escape this now\nUnless you show me how\" Personal Struggles for ex..secrets, faults, hidden truths, struggles etc etc...He is saying that when you look him in the eye (to anyone) theres a lot that he has seen done experienced that you necessarily don't know about but I want to shelter you from the things that are \"its woven in my soul I need to let you go\"  evil that have constantly enslaved him (like demons do)...for me it would be pornography...it could be anything. \"RATHER TO SUFFER AFFLICTION WITH THE PEOPLE OF GOD THAN TO ENDURE THE TEMPTATION OF SIN FOR A SEASON\"\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nobviously, these were Illuminati-inspired lyrics. if you dumb sheep would actually use your third eye, then you would see that all newcoming artists are part of the new world order. \t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\ni think this is someone that has been left behind in the rapture..\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI think that this song is about a guy who has a very troubled past, a history of self destruction hence the demons within.  He walled himself in to protect himself against the world and how the world can hurt him.  He has a I-will-hurt-you-first personality.\n\r\nHe is in a relationship and warns his partner about his manner of defending himself against pain. He explains to his partner that he will hurt, he cant help it. It is who he is. He pleads for help, and maybe some understanding and forgiveness.\n\r\nIt may also be a apology to his partner, note that he doesn't say he is sorry, be he explains to his partner how he is, who he is, he explains why he reacts in certain ways to hurt. He say that he cant help being a angry person. A sad person.\n\r\nHe pleads to his partner to just bear with him, help him to heal.\n\r\nIn other words, read 50 shades of grey. lol\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nto me this song is about anger and how he cant protect his lover from his anger nor his bad qualities.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nI know this song isn't about this but when i really listened to it, it reminided me of the Jews in the consentraction capms because they had to go through a really hard time and everyone gave up, and had to dell with it. But I know it isn't what it's about but It made me think of it. But one of their best songs ever. They are AMAZING!\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI love the tune, haha. but the lyrics are good to\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nI absolutely LOVE this song. Imagine Dragons are perfection in everything they do. I am going to one of the dates for the Night Visions tour, and I am hella pumped! But Demons... this song. Is beautiful. My interpretation of this song would be about two people who are madly in love. When Dan says, \"when you feel my heat, look into my eyes. It's where my demons hide,\" I think a man having a bad past with friends, family or women. Who have hurt people, and he trying to warn his love interest about his dark past. I don't know why, but I always think about that. It's a gorgeous song, and I can't wait to see it live! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI got that it is about our \"demons\" in our pasts. It's about every secret that we hide that bothers us. Also in the music video it shows many people's issues that they deal with. Powerful and deep song,  a personal favorite\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nIt's about someone with mental problems in their past who wants the person they love to know, but can't bear to tell them because they want to protect them. The only way they feel they can escape is for the other person to realise and sort it out for themselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\ni can relate to the music video and its about how people hide them selfs from otheres and you have 1 person you only tell everything to and being afride of the truth\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\n\"We still are made of greed\" every man has no choice but to be driven by greed because we all live in a capitalist system\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nI think that this song is about someone that has a lot of issues, and some insecurities and he is letting the person he is speaking to, into his mind and soul. He's basically telling them that everyone has a bad side. I think that he feels that there aren't many good things about him and that the other person might be too good for him; kinda like a warning to stay away. \t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nThe New world order is coming\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nI think this song is about someone who has a 'demon' inside of them (psychological disorder) and they need help fighting it but instead they chose to let their loved one go\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nI think this song is amazing and i feel that anyone that loves someone, but believes that person is too good for them can relate to the meaning of this song. Here's my interpretation of its meaning:\n\r\n\"When the days are cold... and the blood's run stale\"\r\n-The singer is talking about a point in his life in which everything seems hopeless. He feels as if he has nothing left to give: his life didn't go as planned, he has lost faith in religion and God, and he has no creativity, energy or courage left in him to start all over again.\n\r\n\"I want to hide the truth... there's no where we can hide\"\r\n-This to me is amazing. He is probably with someone he truly and dearly loves (lets assume it's the love of his life), and he wants to stay strong for her, to keep his demons (the ones we all have within) in check so that he doesn't hurt her. But he knows that he has lost control of them, that at any point they can burst from within and make him do something he will regret, and sadly he can't escape or hide from them.\n\r\n\"No matter what we breed... This is my kingdom come\"\r\n-I think this is an example of him battling against his demons. He knows he should let her go so that she can live a better life without him, but he's human, and humans can be greedy, thus he's battling between being selfish and staying with her, or being selfless and letting her go.\n\r\n\"When you feel my heat... It's where my demons hide\"\r\n-He is finally warning her that he is no good, that she should stay away from him because of his demons. This is him being selfless and choosing to be honest with her so that she can find peace and happiness with someone else.\n\r\n\"When the curtain's call... At the mess you've made\"\r\n-I honestly am having so much trouble interpreting these verses, that I'd rather not comment quite yet. But I do believe he is speaking to a higher power, the one that has been ignoring his prayers (remember he's losing faith)\n\r\n\"Don't want to let you down... Don't want to hide the truth\"\r\n-This it another example of him battling against his demons. Whenever we are having trouble in our lives, it's very difficult to demonstrate vulnerability to another and accept the fact that life is hard and we sometimes need help. He doesn't want to confess to his loved one that he is losing the battle against his demons, but he knows it's true and that she deserves better; he must let her go. It's ironic, though, because by freeing her from his darkness he's ultimately beating his demons in his inner battle. Letting her go is a sacrifice, and by doing so, he's proving himself worthy of her.\n\r\n\"They say it's what you make... Unless you show me how\"\r\n-He doesn't believe he has a choice in the matter, it was his fate to endure the burden of fighting his demons, but not hers, that's why she needs to be free of him. She doesn't have darkness inside, but rather light, and by being with her, he will be robbing her of this. He gives up completely but he does plea for help in the end. The final battle against his demons was won by him, (he warned her about him and let her go), but the war was won by the demons. With his last cry for help, it will be her choice if she wants to be with him despite his inner demons and help him battle against him, or live out her life somewhere and with someone else.\n\r\n\"\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\n\"I want to hide the truth\r\nI want to shelter you\r\nBut with the beast inside\r\nThereâ\u0080\u0099s nowhere we can hide\"\n\r\nHe has a demon inside of him. He wants to keep his significant other away from the demon to shelter her away from it. Since the demon is inside of him, there is nowhere they can hide to get away from it.\n\r\n\"No matter what we breed\r\nWe still are made of greed\r\nThis is my kingdom come\r\nThis is my kingdom come\"\n\r\nNo matter what offspring we have, we are made of greed, so our offspring will be made of greed. \n\r\n\"When you feel my heat\r\nLook into my eyes\r\nItâ\u0080\u0099s where my demons hide\r\nItâ\u0080\u0099s where my demons hide\r\nDonâ\u0080\u0099t get too close\r\nItâ\u0080\u0099s dark inside\r\nItâ\u0080\u0099s where my demons hide\r\nItâ\u0080\u0099s where my demons hide\"\n\r\nHe's calling out for help saying that the demons are inside of him. The demons hide inside of his eyes because that is where I was able to notice my friend who was demon possessed totally change. In his eyes when the demon took over he looked totally different. ( I have dealt with a possessed friend and it is scary ) Don't get too close it's dark inside because if the Holy Spirit is not inside of you it can be filled by anything including demons. He letting the other person know that the demon is inside his eyes, but warning the other person not to get too close because the demon is filled with darkness. (evil). \n\r\n\"When the curtainâ\u0080\u0099s call\r\nIs the last of all\r\nWhen the lights fade out\r\nAll the sinners crawl\"\n\r\nIn The Bible when the curtain was torn in two from top to bottom this signified that we can come to God without a high priest going on our behalf. We can now pray to God without someone sacrificing an animal because Jesus died for our sins.\r\n\"when the lights go out\" when the sun is darkened and the rapture has happened all the sinners will crawl around without light. (this is just what came to mind)\n\r\nSo they dug your grave\r\nAnd the masquerade\r\nWill come calling out\r\nAt the mess you made\n\r\nThe demons dug a grave for the person who has the demons inside of him.\n\r\nDonâ\u0080\u0099t want to let you down\r\nBut I am hell bound\r\nThough this is all for you\r\nDonâ\u0080\u0099t want to hide the truth\n\r\nHe believes he is going to go to hell and he doesn't think there is anything he can do about it.\n\r\nThey say it's what you make\r\nI say it's up to fate\r\nIt's woven in my soul\r\nI need to let you go\n\r\nSome people believe you can pick God some believe God picks you, The person believes its up to fate and that it is already determined inside the person's soul. The person doesn't believe he is going to the same place the other person is and that that person needs to let the other person go.\n\r\nYour eyes, they shine so bright\r\nI want to save their light\r\nI can't escape this now\r\nUnless you show me how\n\r\nThe light of God shines in this person's eyes he doesn't want to stamp it out with the darkness of his demons. He doesn't believe he can escape from his demons. They have gained too much ground in his spirit, the only way he can escape is if someone shows him how. He is telling this to the person he is talking to.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nHe is telling you that they sold there soul they are the demons.....And they are trying to convince you that we are all heading to hell 2.....The end is near and if they can convince you there is no hope than you lose faith in your savior Jesus Christ........the entertainment industry is made up of lucifers angels that were cast out with him.....he says this is his kingdom come cause they traded their souls for Richs and fame in this life......the only way to speak to the father is through the son no mAtter what curtain falls.... Repent for your sins and accept Christ and when the tribulations of this world are wiped clean by Christ we will. Have our kingdom come\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nit think this song is about how someone is depressed or sad and want to let it out but they cant cuze theyll feel judged and they dont want anyone to get close as in dont get to close its dark inside like they arnt that special this song has alot of meaning and can mean many things to different people\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nit think this song is about how someone is depressed or sad and want to let it out but they cant cuze theyll feel judged and they dont want anyone to get close as in dont get to close its dark inside like they arnt that special this song has alot of meaning and can mean many things to different people\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nI think this is told from the perspective of a guy who is in love with a girl. he see's how ugly the world is and wants to protect her from it. He feels he's flawed and tries to keep his distance he says when you feel my heat ( when youre drawn to me)  look into my eyes it's where my demons hide (look into my eyes and see me for who i am)\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nThe line that says, \"Don't get to close, it's dark inside\" Relates to me because I seem like a generally happy person but if you get close to me and we form a strong bond you will see that I'm actually a pretty sad person. So I feel as if it's saying don't get close to me or you will see who I really am.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI think this is about a person who wants to start a relationship with someone, but they have a flaw that reveals a darker nature inside. He/she doesn't want the other to suffer from his flaw in life, when it is indeed his own problem.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nReminds me of when I fell madly in love with a guy and desperately wanted to marry him, but he kept telling me that he had a bad side of him...eventually he revealed that he was HIV positive....it's one of the deepest sorrows of both of our lives.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nI think this song is about your hero. When he says \"When the days are cold\r\nAnd the cards all fold\r\nAnd the saints we see\r\nAre all made of gold\n\r\nWhen your dreams all fail\r\nAnd the ones we hail\r\nAre the worst of all\r\nAnd the bloodâ\u0080\u0099s run stale\"\r\nI think he is referring to your \"dreams\" and the ones we \"hail\" would be our heroes. Also the \"saints\" would be how perfectly we see our heroes.\r\nThat is all.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nMy thoughts on this song is that the guy is warning the girl before she falls in love with him, that he has a dark side to him that could scare her away. She obviously doesn't care... but at the same time, he knows that there's a part of him that tells him she should hate him. Because it's the demons in every soul that turn us tainted.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nThis is my favorite song. it was based off of Tyler Robinson and his battle of cancer,\n\n\"when the days are cold and the cards all fold\"\n\nwhen your hope is almost gone.\n\n\"and the saints we see are all made of gold\"\n\nwhen your hero's seem perfect\n\n\"when your dreams we fail\"\n\n... do i need to interpenetrate that?\n\n\"and the ones we hail are the worst of all and the bloods run stale\"\n\nIm a bit stuck on this,\ni guess when no one can help you and your on your own?\n\n\"I want to hide the truth i want to shelter you but with the beast inside theres no where we can hide\"\n\nHe wants to help but he cant.\n\n\"No matter what we breed we still are made of greed\"\n\nSorry but idk ;-;\n\n\"this is my kindom come, this is my kindom come\"\n\nmaybe he wants to help everyone? //shrugs//\n\n\"When you feel my heat, look into my eyes, its where my demons hide, its where my demons hide\"\n\nEveryone has demons and if you look closely you can see his, there hiding within him and hes trying to fight them\n\n\"Dont get to close it's dark inside,it's dark inside\"\n\nagain with the protecting you i think.\n\n\"curtains call is the last of all, when the lights fade out, all the sinners crawl, so they dug your grave and the masquerade will come calling out at the mess you made\"\n\nAfter you die people will call out your sins?\nnot sure....\n\n\"dont wanna let you down but  i am hell bound\"\n\nHe thinks hes going to hell because of his demons or sins.\n\n\"though this is all for you, don't wanna hide the truth\"\n\nHe wants to confess his sins? //shrugs//\n\n\"they say its what you make i say its up to fate, its woven in my soul, I need to let you go\"\n\nHe needs to say goodbye when you die.\n\n\"your eyes they shine so bright, I want to save that light\"\n\nHe wants you to be happy or he wants to remember you.\n\n\"i cant escape this now, unless you show me how\"\n\nHe wants someones help.\n\nAnd thats all i got.\n\nSorry about my typing im bad at this .-. \ni feel this could easily be applied to a love as well though.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI always thought the song was about fighting your own demons from within because they effect the people you love, like lying, cheating, or even trust issues. I find the song very meaningful for me because I struggled with constant fights with the my family and my boyfriend because of my insecurities. The lines: \"I want to hide the truth, I want to shelter you, but with the beast inside thereâ\u0080\u0099s nowhere we can hide\" says it all. You can't run from your internal issues, they're with you, so it's best you handle them.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nSomeone doesn't want others to get close. They don't want their inner demons to come out on them. Me? Let me take on the demons and get close.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nI think it is about a guy who knows he is going to Hell because he has done wrong things. But he did what he did for someone he loved so they didn't have to suffer the demons that he has to face. Or he could just be insane and think he's surrounded by demons...\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nThis guy has demons and doesn't want them to show.\n\nBut, demons come out in ways that often hurt yourself and  others eventually so...deal with them:)\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nThis song to me reminds me of my best friend, who is also my secret crush and in a relationship that I don't want to jeopardize. I can barely listen to this song without tearing up because of how strongly I feel for this friend. The worst part of this is the lines \"I can't escape this now / unless you show me how\" because I feel this way exactly.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nto me it has a twilight feel to it for those who have read the books.\nI think this he wants to save someone from his inner demons, he has secrets he would never tell and he has a bad past and he doesn't want to share that. to me he wants someone he loves safe protected from him\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nMy opinion is this person they speak of starts loosing everything due to an addiction they can't conquer and there is a secret about this person blood probably type blood they hadn't ever seen before so it's like gold and they selling it to people for their own comfort and there is a secret about this persons chemical makeup that causes them to reach very hi temps at times that a person standing right next to them could feel it hiding truth and shelter this persons breed may something out ordinary like having two souls in one (example) they want to save their light my thought is the person probably belongs to scientist for experimentation and after they not this that then they bury this person. This is based only as a opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nEveryone has problems. You might not see them but they are still there nontheless.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nThis song makes me think of the \"end times\" as well as the idea of hiding your \"demons\" from people you love, as mentioned by other people.\n\nSince there has been a lot said about the person demons aspect, I'll explain why this song (er, the verses at least) makes me think of the end times in a biblical sense. I think the connected sparked when I read that two of the guys in the band are Mormon.\n\n\"When the days are cold\nAnd the cards all fold\nAnd the saints we see\nAre all made of gold\n\nWhen your dreams all fail\nAnd the ones we hail\nAre the worst of all\nAnd the bloodâ\u0080\u0099s run stale\"\n\nThe world is becoming dark, scary, more and more seemingly evil people are doing awful things. People give up hope and give up on value. Materialism rules and the wealthy are admired and celebrated, even if they are awful people and do bad things. People are desensitized to violence and it often goes unacknowledged.\n\n\"I want to hide the truth\nI want to shelter you\nBut with the beast inside\nThereâ\u0080\u0099s nowhere we can hide\"\n\nI feel like this part is from the perspective of a religious figure, wanting to protect people from what they believe is coming but not being able to; people are accustomed to the fallen world and it is a part of them.|\n\n\"When the curtainâ\u0080\u0099s call\nIs the last of all\nWhen the lights fade out\nAll the sinners crawl\n\nSo they dug your grave\nAnd the masquerade\nWill come calling out\nAt the mess you made\"\n\nThis portion is about the end coming and (obviously) the sinners are left scattered on earth. Pretty straightforward there. I think the theatrical references might be a nod to Hollywood and some of the distasteful messages and images that come out of it. The entertainment industry has helped form values (or lack thereof) and thus take some part in sealing people's fates.\n\n\"Your eyes, they shine so bright\nI want to save their light\nI can't escape this now\nUnless you show me how\"\n\nThis sounds like an epiphany or religious experience, seeing an angel or Jesus or something similar. He wants to stay in the light but needs help to escape the dark.\n\nI've left out a few verses just because I can't seem to explain a connection or the connection is minimal. \n\nSo there you have it.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\n\r\nI know that \"kingdom come\" is a reference to heaven, or at least a state of peace and rest.\r\nWhen he says, \"this is my kingdom come\", he's just accepting the world as it is, but since he accepts it and knows that it will turn out okay, he's found a way to survive through all the bad stuff.\r\nhe doesn't need to be miserable, because he has hope and can be strong.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nThis song is about turning your back on God and his only son Jesus and sacrificing fatted children and livestock to the dark one.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nI think it talks to me as it's of my girlfriend. She can't be her best because she has dark forces/ demons of some sort holding her prisoner. \nIt's a clevere song. I enjoy Imagine dragons' music and lyrics. His voice haunts me.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nThis song has a big relationship with 'hurt' of johnny cash. It shows how we can be so frustrated by the innocence of our lovers ...(Imagine dragons-demons), and we can find our selves down or depressed because of who we are (Johnny cash- hurt )\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nIts plural\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nThis song can relate to EVERYONE! you act sweet and caring on the outside but inside your boiling with anger and pain. Which is where your demons hide, I have demons. we ALL have demons, but it's our choice if to hide them and how.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nIt's ok to not know.\n\nincognito-butterfly.blogspot.com/2014/02/…\n\n\n", "comment_123": "\nI know it's not a perfect translation or  the \"correct\" one, but I have found special meaning in this song after hearing it on the way home from the doctor's office after I found out I have lost my baby. To me it speaks of my grief and the darkness inside me and the conflict to keep my pain to myself.\n\nMiscarriage isn't something you really bring up in an everyday conversation; so as I walk through the world pretending everything is ok the lines echo in my mind- \"when you feel my heat, look into my eyes; it's where my demons hide; it's where my demons hide\" \n\nThe parts about wanting to hide the truth, to shelter others from the harsh reality of my world right now. The lines, \"They say it's what you make; I say it's up to fate; it's woven in my soul; I need to let you go\" speak to me about how some believe a miscarriage is the mother's fault; but this isn't my fault. I did nothing wrong, it is just fate. My lost child is woven in my soul now, but I also will need to let go and move on, just as my body \"lets go\" of my baby. \n\n\"When your dreams all fail; and the ones you hail; are the worst of all; and the blood's run stale\" takes on a somewhat different meaning for me. The obvious meaning of my dreams of this child failing and the reality of the situation- the \"dream\", or nightmare really, of losing a baby, is the worst of all but it's the one I'm facing. The blood running stale... the literal blood from my body that has now run sterile and empty in it's failure to keep my child alive. \n\n\"your eyes they shine so bright/I want to save that light/ I can't escape this now/ unless you show me how\" Double reference to me- reference to my living children, the light in their eyes and wanting to save them from my pain right now. Also to my unborn child; picturing how his bright eyes would have shone and wishing I could hold on to that future. And I can't escape it. It is completely out of my control. Those two lines become a plea to God to show me how to come out on the other side of my grief.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nHe's saying that he has his demons, and that he's not good enough for the woman he loves. Everyone good is depicted as saints or role models, and he feels that with the darkness that surrounds him, he can never deserve her. But, he wants to preserve the light that she has, and wants to protect her from his demons.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI think this a love song trying to protect their innocent lover from the demons all have inside them! These demons are every human beings sins they have committed & may commit in the future if things aren't changed! It's preparing your lover from harm by you at the risk of losing them. It's them being honest that they care more about their lover being happy, even it's with someone else! Then this person is also trying to do the right thing & really not wanting to lose them! Then finally admitting that they themselves need help & telling that person that after knowing all this that they want to stay with you & show you how that they want to help u to get the demons out! It's someone barring their soul someone & doesn't want to bring them into that dark world unless they love u enough to want to be with you to make your & their life better together! \t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nI have been trying to figure out what this artist meant in these words and this is what I have come up with as a possibility. Would love to hear the songwriter's explanation.\nI am not religious but I feel he is talking to Jesus.\n\nthe first verse is about the end of humanity, the end of the world when life as we know it ends. The only saints we have worshipped is gold, money and not the true saints.\n\nthe second verse pertains to our leaders who are corrupt and greedy beyond all else. the blood runs stale is all the useless wars and bloodshed they have caused with their greed.\n\nthe third is how he loves Jesus and doesn't want him to know the truth about his world and himself. He's ashamed and doesn't want to hurt Jesus but knows he cannot hide it from him.\n\nthe fourth is that we all have this sin of greed and were born that way. Because of this, this is the world we have created for ourselves. our kingdom come.\n\nWhen you feel my heat...letting Jesus know where his demons are hiding.\n\nCurtains call - again the end, the sinners crawling are all the greedy people trying to hide.\n\n\nSo they dug your grave - digging the grave for God saying that is what caused the mess, not them. They are blaming God for this mess.\n\nDon't wanna let you down - he is saying he's sorry but he knows he's going to hell because of his sins. His sins were given to him at birth and he has no choice but because of them, this is what he must live with...his kingdom come.\n\nThey say it's up to fate - he is saying he didn't choose to be greedy, it's woven in his soul but because of that he must let Jesus go.\n\nYour eyes they shine so bright. Up until this verse he acts as if he is doomed to be hell bound even tho it was not his choice to be sinful but more just the way he was made but here is a glimmer of hope that Jesus will show him a way out. This is the verse that made me think he was talking about Jesus, this and the kingdom come verse because it relates to the bible.\n\nAlot of people think he is talking to a lover and I thought this too at first but then felt this was deeper than that. Then I thought maybe his child (and actually that would be maybe a better guess than the one I chose). Trying to hide your child from the evil and yet needing to let them know the truth for their own benefit. Your child being so young and innocent as to be able to guide you to the right path. The verse about they dug your grave made me change my mind on this interpretation. the mess you made reminds me of people blaming God instead of themselves for our plight. Anyway, I have pondered this alot and this is what I have come up with. Would appreciate anyone's comments on what they think of this interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\ni think that this song is about depression. the person singing is depressed, and doesn't know how to fix it. they believe that, no matter how good their partner is in their life, the depression is \"woven in\" their \"soul\". They want to let their lover go, so that they don't hurt them when they commit suicide. the demons represent the depression that he fights, and plays on the idea that when you become depressed you lose the light in your eyes. This person is breaking inside, and they want there lover to leave before they hurt themselves physically (suicide) and their love emotionally (dealing with the suicide).\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\n1- the singer is describing his back ground and his life :\n\n- When the days are cold  =  in our present world when it is too touph & full of cheating\n\n- And the cards all fold = when all your life crumbles, and when you lose all hope and you fail every thing\n\n- And the saints we see Are all made of gold  =  and all those who pretend to be saints or those whom we thought that they are too good like saints he realized by the end that it was only a deception, and they were just like golden statues made only by our imagination as there is no one is perfect\n\n- When your dreams all fail And the ones we hail Are the worst of all  =  when all your dreams  fail and when the ones you liked most and saw them as your heros he realized that they are the worst of all as they were mean to him\n\n\n2- the singer is talking to the girl that he met and loved, but she is too innocent, pure and good,\nshe is so innocent and pure to the point that he doesn't want to spoil her with his life, the bad person he is, or even to make her see what he saw,\nhe wants to protect her:\n\n- I wanna hide the truth = of what I really became\n\n- I wanna shelter you = I want to protect you and not to harm you because I love you \n\n- But with the beast inside = the person who I became\n\n-  Thereâ\u0080\u0099s nowhere we can hide = we will be lost, and you will be lost\n\n- No matter what we breed We still are made of greed = I became the man who I am because we all make mistakes and are full of greed\n\n- When you feel my heat Look into my eyes  =  if you think I am good for you, when you see me from outside and get admired, just look to in me in the eyes and see me from inside\n\n- Itâ\u0080\u0099s where my demons hide Itâ\u0080\u0099s where my demons hide = the truth and reality of me is there, inside me as you can only see it through my eyes, my eyes will reflect all my mistakes and weaknesses \n\n- Donâ\u0080\u0099t get too close Itâ\u0080\u0099s dark inside =  don't get too close, don't know me so deeply, as it is dark inside and I don't wanna spoil you or make you get shocked from my reality, I want to keep my reality to my self\n\n\n\n3- back to the awful reality of his world:\n\n- Curtainâ\u0080\u0099s call Is the last of all When the lights fade out All the sinners crawl = at the end when the lights fade out and the show ends all the reality inside the people comes out, all the faked masks fall and there are no real saints\n\n- So they dug your grave And the masquerade Will come calling out At the mess you've made\n = so these people with the lovely masks and nice smiles, those whom I considered as saints, the ones I hailed most are the ones who hurted me most, and they have distroyed me using all my mistakes\n\n\n\n4- talking back to his girl:\n- Don't wanna let you down But I am hell bound = don't want you to suffer with me in my miserable life\n\n- Though this is all for you = even though I wanna leave you alone for your safety\n- Don't wanna hide the truth = I have to tell you why I have to go, I want you to know the truth, so you might change me\n\n- They say it's what you make I say it's up to fate = they say we choose the path, we choose to be good or bad but what I can say is that it is a matter of fate because I didn't choose to be what I am today\n\n- It's woven in my soul = it is printed now inside my soul\n- I need to let you go = for your own sake\n\n- Your eyes, they shine so bright I wanna save that light = I see the goodness in you that makes me see the badness in me, the light in you made me see the darkness in me, and I want to save that innocence in you \" that light\"\n\n- I can't escape this now Unless you show me how = I really love you to the point that I want to change my self for you but I feel that I can't do it by my own, unless you show me how to change for your love\n\nso basically he loved a nice girl that made him think that is not good enough for her and he doesn't deserve such goodness because she is so perfect in his eyes, and at the end he wants her to help him change to be a match for her or he will have to leave for her own sake\n\nthanks for reading and I appologize for my language,\nI am an egyption and that's how I felt the song\nthanks for reading\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nI believe this song talks about how all people have two lives: one the public sees, and one only they know about.\n\nIn the first part (\"When the days are cold; and the cards all fold; and the saints we see; are made of gold\"), the singer talks about how when the days get dark and depressing, when everyone seems to have given up, and saints/perfect people are all put on a high pedestal, when people don't really aspire to be like them.\n\nHe also talks about how sin is a part of human nature, and how it's inevitable that you'll commit sin during your life. Everyone is like this. He doesn't want someones innocence to be ruined, but he realizes that it would've happened anyways (\"I wanna shelter you; but with the beast inside; there's nowhere we can hide;\").\n\nIn various parts, the singer seems to be trying to dissuade someone from getting too close (\"Don't come too close; it's dark inside;\"). I think he's trying to warn the person he's talking to from getting too close to people unprepared, or you might not like what you find. Drugs, an abusive family, etc.\n\nThis song does have a positive message (\"I can't escape this now; Unless you show me how;\"). To escape an addiction/deal with problems, you need two people. One person can never break out of something by himself/herself.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nWhen things look bleak and you find have no more hands to play or moves to make. When you look to the \"good people\" and find that they are all fake. When everything you wanted or is working toward falls through and the people leading you is worst than those they are leading.  When there is no more passion or joy for life.\n\r\nI don't want to see the truth of who we (humans) are.  I want to keep from seeing the truth about us but the beast or the bad is inside us and we cant hide from ourselves.\n\r\nIt doesn't matter what kind of men we create or how much good we do, inside of us still lies greed (which is the root of all evil) and this will be the end of me.\n\r\nSo when you feel me glowing, radiant, passionate and beautiful, look into my eyes and you will see who I really am.  My bad lies hidden behind my eyes the windows to my soul.\r\nSo don't get too close to me or you may see me for who I really am.\n\r\nWhen we stop  pretending and all the big productions we put on for the world is over and people stop watching, I go back to being my real self.  An ordinary person who needs to be humbled. Your critics laid a trap for you and all the masked people (people hiding their true nature) will come calling you out and criticizing you throwing your mistakes in your face.\n\r\nI don't want to disappoint you but I'm just like them.  I telling you about our true nature for your own good I don't want to lie to you. It doesn't matter what kind of men we create or how much good we do, inside of us still lies greed and this will be the end of me.\n\r\nSo when you feel me glowing, radiant, passionate and beautiful look into my eyes and you will see who I really am.  My bad lies hidden behind my eyes the windows to my soul\r\nSo don't get too close to me or you may see me for who I really am.\n\r\nPeople say the outcome of your life is up to you, but I believe its up to fate and I have no control over the outcome of my life.  Its based one the things that have been woven into my soul by me and by those around me,  because of this I must let you go.\n\r\nYou are filled with so much hope and I don't want to take it from you.  I cant escape my past unless you were to show me how to overcome it.  Maybe your hope is big enough for the both of us.\n\n\n\n\n", "comment_131": "\nThe first time i heard this song i knew it was my song, i thought it was about someone who has hidden things about them that were horrible, during the first time i listened to it the whole time i was thinking, this is the next song my trash can band will be playing. Our high school trash can band (yes we play on trash cans) then went with the track team and played it half-way during the meet. A person from Juliard then came up to me and 4 years later i am here at Juliard, all because of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nI think it's about someone who has something beneath him which he can barely obtain. He knows he's dangerous so he tells others to keep away.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nThis song is about a young boy the band knew that died from cancer, it's how he feels, not being able to save the child. And also about everyone's personal demons they have inside. I looked it up, it's stated by the band. \"Breakout band Imagine Dragons has released an emotional music video for new single â\u0080\u009cDemons.â\u0080\u009d They dedicate the clip to 17-year-old fan Tyler Robinson, who recently succumbed to cancer.\nThe video depicts images of Imagine Dragons performing the song at a hometown show in Las Vegas. Their stage performance clips are juxtaposed with scenes of audience members thinking about their own personal demons; an American soldier recalls harrowing moments on the battlefield; another person deals with the secrets of domestic violence.\nAt the videoâ\u0080\u0099s conclusion, director Isaac Halasima has added a snippet from a clip created by Tyler Robinsonâ\u0080\u0099s brother Jesse, showing the band dedicating their hit â\u0080\u009cItâ\u0080\u0099s Timeâ\u0080\u009d to Tyler in concert. Frontman Dan Reynolds gives the microphone to the elated fan to sing along with him.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nThe \"demons\" in the song are referring to one's dark side.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nHe's realizing that he has these flaws that may have caused the endings of his previous relationships, so he wants to tell his current girlfriend about this before one of his exes tells her this and she rubs it the wrong way.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nBut once they get to know each other, he will discover that she is just as flawed as he is.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nI think the first two stanzas just give a general dark and hopeless background for the situation.\n\nThen the third stanza says, \"But with the beast inside\", which implies that he's trying to hide something from someone, he also says, \"There's nowhere we can hide\" to whoever he's trying to hide it from. So whatever he's trying to hide is part of him; he can't escape it.\n\nNow to the first chorus. \"When you feel my heat.\" That could literally be his body heat. Or it could be something else. I have a guess, but I'll get back to that later.\n\"Look into my eyes/It's where my demons hide... Don't get too close/ It's dark inside\". I'd infer from this, and other lines in the song, that the person he's talking to is a lady friend of some sort. When she gets close to him his darkness is more apparent. Simple enough.\n\nThe next stanza, \"At the curtain's call...\" Is for the sole purpose of emphasizing the despair of the situation.\n\nBut next we see the \"masquerade\" calling out at the \"mess you made\". Again, I have a guess about the \"mess\", but I'll get back to it later.\n\n\"I am hell bound\". Those are some serious words. But could this be a metaphorical hell? Like the hell he would be in if his G-Friend broke up with him if she found out what he's hiding?\n\nThe last three stanzas are where it comes to the real grit and grind. \"They say it's what you make/I say it's up to fate\". This \"thing\", whatever it is, cannot be helped. It is subject to fate, or luck. Hmm.\n\"It's woven in my soul/I need to let you go\". The whole song is essentially in second person; he's talking to his woman-friend the whole time. But here it changes. He's still talking to someone or something. I'd say something.\nNow, could \"woven in my soul\" be anything other than his literal soul? Could he be referring to the innermost depths of his body instead? I think so.\nWith that context, put this together: \"When you feel my heat... It's woven in my soul.\" Could this heat possibly be woven... in his bowels?\n\nI believe the song is about a man who is trying desperately to hold in a fart, maybe even diarrhea, (call back to mind the \"mess you made\"), because he doesn't want his girlfriend to be subject to the horrible smell.\n\nThis makes even more sense in the next stanza. \"Your eyes, they shine so bright/I wanna save that light\". I think you can assume with plenty of assurance that her eyes won't be shining brightly if he lets out the south wind.\n\nAlthough I'm not sure about the last two lines before the final chorus. \"I can't escape this now/Unless you show me how.\"\nThis implies that his girl can show him how to avoid farting. I have to admit, the song lost me there. But who am I to judge? Maybe she has Beano.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nWhen the days are cold, And the cards all fold, And the saints we see, Are all made of gold\n>> When everything darkens and shuts and all we finally see are the lovers with fake faces that deceive us<<\n\nWhen your dreams all fail, And the ones we hail, Are the worst of all, And the bloodâ\u0080\u0099s run stale\n>> All hopes for finding love crush like ashes and the ones we've been with are the fakers that stab us and they did not seem to bother the pain they cause us as they let us suffer alone in a world of hatred <<\n\nI wanna hide the truth, I wanna shelter you, But with the beast inside, Thereâ\u0080\u0099s nowhere we can hide\n>> I just try to hide my pain and misery, keep it secretly from you who think you have won, but even a naked eye can see the scars that burn inside of me and truly there's just no place for people like us (hurt) to recover <<\n\nNo matter what we breed, We still are made of greed, This is my kingdom come, This is my kingdom come\n>> But no matter how you get your ways into crushing me and pushing me down, I will not hide from you any more and I will face you now <<\n\nWhen you feel my heat, Look into my eyes, Itâ\u0080\u0099s where my demons hide, Itâ\u0080\u0099s where my demons hide, Donâ\u0080\u0099t get too close, Itâ\u0080\u0099s dark inside, Itâ\u0080\u0099s where my demons hide, Itâ\u0080\u0099s where my demons hide\n>> Listen to me, I know you feel this pain you caused me as I know you feel the sorrow every time when I ask you to look into my eyes, but now don't get to close anymore because i'm broken to pieces, this new me you caused me to be will rage in anger and when I unleash it even I, myself can't stop me <<\n\nCurtainâ\u0080\u0099s call, Is the last of all, When the lights fade out, All the sinners crawl\n>> Before I end this relationship, I will say that I did not regret it, I gave you my all and pull you out of your dark and lonely world, when this ends you will begin to crawl to where you come from and I will not be there to pull you out <<\n\nSo they dug your grave, And the masquerade, Will come calling out, At the mess you've made, Don't wanna let you down, But I am hell bound, Though this is all for you, Don't wanna hide the truth\n>> People have begin to discover your true intentions, they can see the scars, pain and misery you made. They ask me questions, I didn't want them to know, I just want it to be between us. But the sorrow within me has shown so much and I just can't control how this scars have effected me. <<\n\nNo matter what we breed, We still are made of greed, This is my kingdom come, This is my kingdom come\n>> Everything that we were, everything that made us together it was (because the lyrics said greed) the force of wanting to drag this relationship towards further. So my rage has come undone, I had shown them <<\n\nWhen you feel my heat, Look into my eyes, Itâ\u0080\u0099s where my demons hide, Itâ\u0080\u0099s where my demons hide, Donâ\u0080\u0099t get too close, Itâ\u0080\u0099s dark inside, Itâ\u0080\u0099s where my demons hide, Itâ\u0080\u0099s where my demons hide\n>> They can feel my pain, they see right thru me, where the scars I hide. I told them to stop because if they push me more, I might reveal something that can be trouble <<\n\nThey say it's what you make, I say it's up to fate, It's woven in my soul, I need to let you go\n>> They try to convince me that it's only you alone who caused the crumble, but I know that I can't blame you alone for this fail relationship (soul). So I will leave it in your hands to decide but you need to know that I might need to let you go <<\n\nYour eyes, they shine so bright, I wanna save that light, I can't escape this now, Unless you show me how\n>> Everything of you brings me the beautiful meaning of life, you made me see how I should see love and how to feel love, I will just leave it at that I will not see you as bad as you are now. But I can't let you go, it's hard. You need to also let me go <<\n\nWhen you feel my heat, Look into my eyes, Itâ\u0080\u0099s where my demons hide, Itâ\u0080\u0099s where my demons hide, Donâ\u0080\u0099t get too close, Itâ\u0080\u0099s dark inside, Itâ\u0080\u0099s where my demons hide, Itâ\u0080\u0099s where my demons hide\n>> When you finally feel everything as you look into my eyes, I hope you see I don't want you close to me, its just to pain to move on, it just scare me to show that you are no longer apart of in me <<\n\nSo yea, this is my take on in and this is my first to ever to try. Leave me some replies, so I would know what you think of it. Thank you in advance.\n\nMuch love.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nope\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nMy interpretation...'cause I live it everyday.\n\nHe wants to shelter someone he loves from a mental illness (the beast inside)\n(No matter what we breed we still are made of greed) Capitalizing on the illness which as an upside probably makes him very creative....profitable for those he loves. (This is my kingdom come)...He accepts the cards he has been dealt and intends on making the best of it...making it work to his advantage....smart\n\n(When you feel my heat, don't look inside, it's where my demons hide)  When his illness is out of his control...don't push him...don't try to figure him out....give him space.  (Don't get too close, its dark inside)\n\n(When the lights fade out all the sinners crawl)...Those he thought were his friends (sinners) left him when he needed them....crawled...slithered away like the snakes they were.\n\n(So they dug your grave in the masquerade will come calling out at the mess you've made)...He showed them (friends, lovers, family) who he really was and that he is not who he presented to them in the beginning which caused a mess of issues.\n\n(Don't wanna let you down but I am hell bound) He doesn't feel he can redeem himself from the choices he has made.\n\n(Though this is all for you, don't wanna hide the truth) His legacy, all he did that was profitable for those he loves but he doesn't want to lie about who he really is anymore.\n\n(They say it's what we make I say it's up to fate Its woven in my soul)  Born this way, genetics, fucked up childhood has ingrained who he is.\n\n(I need to let you go, your eyes they shine so bright, I wanna save that light)  He doesn't want to bring the ones he loves down with him, wants them to remain innocent of what is really going on with him.\n\n(I can't escape this now UNLESS YOU SHOW ME HOW) In the same breath, he wants the ones he loves to help him overcome his issues or at least deal with them better so he can be who he wants to be for them and ho he thinks they need him to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nThis song is about how sometimes he cant control himself so hisself takes over him (demons)\nIts basically like having out of body expieriences like involuntary man slaughter\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nI think that everyone has some deep dark secret that if it were to get out that it would ruin there but i reality it would make it better because he/she has friends that would support her/him in as many ways as possible because true friends have your back and plunge into the depths of pure darkness to bring you back to the light shinning above.\nIdk if this was good but hopefully it opens peoples eyes and see the truth.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nI think this song is about a person who think he is not a better person and he is not perfect at all.He talks to the one who he loves and he say that he have so many problems and he generally breaks people's hearts but when she enters his life he see the light he thinks she unlight his life but he is afraid to break her(i think it could be the first person he cares about and don't want to break).So he want to be with her but at the same time he want to save her and  he don't want to she comes close and see his \"demons\".I think he scares also when she see his \"demons\" she don't want to be with him.This song is really meaningful and i love it so much!\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nThis song is about greed and how it's ingrained in mankind.  He mentions that the saints we see are all made of gold(we even materialize saints to objects of monetary value.) He then alludes to the fact that our dreams/goals are all the worst of all(the plight of man's dream to be rich) and the blood runs stale (death awaits us).  He wants to shelter the innocent young ones and hide the fact that all men live for the quest for more money, but he can't hide the truth because he's the same as all the greedy men and his goals are the same(this is his kingdom come(to make more $)). He sees that the eyes of the innocent shine so bright and he's going to let go because he doesn't want to ruin their innocence with his demons that he can't escape unless he can be shown how(practically an impossibility).\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nI think its with a girl (in my mind) he is a demon.his eyes are black and he thinks he is horrible.but this demon-is capable of love.and he is sad that he seems to evil for her.and the light is in HER eyes. kinda like yin and ying but switch genders\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nOkay so lets say that the \"demons\" are a metaphor for a virus? Mostly everybody in the world has the virus but there are only a few with hearts that are pure and are happy with what they have I believe that when the song says \"I want to hide the truth, I want to shelter you, but with the beast inside there's no where we can hide\" it is trying to say that he has someone he loves so much and that all though he has the virus he would do anything to protect her but because he has the virus his lover will always be around it and will always be \"exposed\" to it. I think he is also trying to say that he will try and keep his virus away from his lover by hiding it and not showing his true colours for he has a fear of his lover leaving..... \"its woven in my soul, I need to let you go\" I believe he is trying to say that after everything he has tried to keep his lover away from his virus he has finally realised that the virus is now a part of him there is no what he will be able to get rid of it now there is no \"cure\" therefore he has to let his lover move on without him because he has another fear of his lover catching the virus he has a fear of hurting his lover and so he decides it would be better if they went there own ways...... \"your eyes they shine so bright, I wanna save that light\" his lover is so pure and innocent he cant let her get the virus. \"unless you show me how\" he is saying that the fact that his lover is so pure and innocent that they might be able to \"cure\" him there is a flicker of hope.                                                                                                                Hi! Thanks for reading this is my first review and I have put what I thought about all of the song we would be here for hours haha! But if you could I would appreciate a comment on how I did? Thanks again for reading     \t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nI think this song is a way of pleading with someone to leave before they see the demons inside of you. The beginning implies that the world is bad and there aren't any good people left and the chorus, to me, says that it's inevitable that people will change because of the warped society we live in.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nThis song is filled with idioms and metaphors. The line that really stands out to me is the line \"We're still made of greed\". The reason I like this line is because it doesn't really mean that we are made of greed. It just means that everyone can be greedy sometimes. It is true, but I just want to get past greed so that I can be a successful person in life.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nThis song is about Luke Castellan; the ones they hail are horrible. he believes that. this song is so about him...\nbut it also reminds me of me...\nwow...\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI was inspired so I wrote this:\n\nnada-gamaleldin.blogspot.com/2015/10/…\n\n\n", "comment_151": "\n\"When the days are cold\" is saying when someone died, \"and the cards all fold\" means that no one wants to believe this happened, \"and the saints we see are all made of gold\" means that no one can help him and what has happened. \"When your dreams all fail\" means that you can't have dreams anymore, because you're dead, \"and the ones we hail are the worst of all\" means, again, no one is able to help, even though we hail them, \"when the bloods run stale\" means that's when someone died. \"I wanna hide the truth, I want to shelter you\" means that he wants to have what happened unhappen, \"but with the beasts inside, there's nowhere we can hide\" means that he can't hide from the truth no matter how hard he tries. \"No matter what we breed, we still are made of greed\" means that he was greedy and not ready for this to happen, \"this is my kingdom come, this is my kingdom come\" means that his sorrow is how he's going to feel for a while. \"When you move my heat, look into my eyes, it's where my demons hide\" means that if you move his anger and see how he really feels, it shows his sorrow. \"Don't get too close, it's dark inside, it's where my demons hide\" means that he doesn't want any help from his grief. \"At the curtains call\" means when someone dies, \"it's the last of all\" means that that's the last time they will see them, \"when the lights fade out, all the sinners crawl\" means that when you die, you will see all the others that are dead. \"So they dug your grave\" means that they dug up her grave for when she died, \"and the masquerade will come calling out at the mess you made\" means that all those who are sad and don't want to show it will show it at her funeral. \"Don't want to let you down, but I am hell bound\" means that he doesn't want her to die, \"but with the beasts inside, there's nowhere we can hide\" means that with the truth, there's nowhere he can hide from it. \"They say it's what you make, I say it's up to fate\" means that while everyone thinks that you do things through your choices, he thinks that fate decides, \"it's woven in my soul, I need to let you go.\" means that he needs to let her death go. \"Your eyes they shine so bright, I want to save that light\" means that he doesn't want her to die, \"I can't escape this now, unless you show me how!\" means that he can't get past her death unless she were to show him how.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI feel like this song is about how you hide who you really are for some people, and you don't want to let them down by showing them who you really are. Because you believe that they'll be disappointed if they see who you are. \nYou grow to care for this person more then you intended to (either as a close friend, or as a girl/boyfriend), so you don't want them to get too close to you, because you don't want to hurt them (physically or mentally).\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nWhen the days are cold\nAnd the cards all fold\nAnd the saints we see\nAre all made of gold\n\n\n(No golden statue of saints can save us when all is going down hill)\n\n\nWhen your dreams all fail\nAnd the ones we hail\nAre the worst of all\nAnd the blood's run stale\n\n\n(When you are feeling down because not even your family helps you, but rather bring you down)\n\n\nI wanna hide the truth\nI wanna shelter you\nBut with the beast inside\nThere's nowhere we can hide\n\n\n(I want to help you, and I want to save you, but I have even worse problems that you shouldn't have to deal with)\n\n\nNo matter what we breed\nWe still are made of greed\nThis is my kingdom come\nThis is my kingdom come\n\n\n(No matter what we do, in the end we are all imperfect humans, we will continue to make mistakes)\n\n\nWhen you feel my heat\nLook into my eyes\nIt's where my demons hide\nIt's where my demons hide\n\n\n(When you wonder why I'm acting a certain way, look in my eyes and you will understand my pain)\n\n\nDon't get too close\nIt's dark inside\nIt's where my demons hide\nIt's where my demons hide\n\n\n(I don't want you to become too close to me, because my life is actually really dark, and it's not fair to you)\n\n\nAt the curtains call\nIt's the last of all\nWhen the lights fade out\nAll the sinners crawl\n\n\n(Everyone's true colors show at the end of the day)\n\n\nSo they dug your grave\nAnd the masquerade\nWill come calling out\nAt the mess you've made\n\n\n(They will come and say it was your fault for a mistake you made, even though they've made mistakes too)\n\n\nDon't wanna let you down\nBut I am, hell bound\nThough this is all for you\nDon't wanna hide the truth\n\n\n(I want to tell you the truth, but I can't because even I suffer terrible problems, that you shouldn't have to suffer with me, I don't tell you so I can spare you the suffering)\n\n\nNo matter what we breed\nWe still are made of greed\nThis is my kingdom come\nThis is my kingdom come\n\n\n(No matter what we do, in the end we are all imperfect humans, we will continue to make mistakes)\n\n\nWhen you feel my heat\nLook into my eyes\nIt's where my demons hide\nIt's where my demons hide\n\n\n(When you wonder why I'm acting a certain way, look in my eyes and you will understand my pain)\n\n\nDon't get too close\nIt's dark inside\nIt's where my demons hide\nIt's where my demons hide\n\n\n(I don't want you to become too close to me, because my life is actually really dark, and it's not fair to you)\n\n\nThey say it's what you make\nI say it's up to fate\nIt's woven in my soul\nI need to let you go\n\n\n(people will say that it's your actions that lead you to the place you are now, I believe it's predestined. I was born terrible... So you I should let you go so you can find someone who wasn't)\n\n\nYour eyes, they shine so bright\nI wanna save that light\nI can't escape this now\nUnless you show me how\n\n\n(You are still filled with hope, innocence and love. I cant escape the beast I've become, unless you help me, because you know how)\n\n\nWhen you feel my heat\nLook into my eyes\nIt's where my demons hide\nIt's where my demons hide\n\n\n(When you wonder why I'm acting a certain way, look in my eyes and you will understand my pain)\n\n\n\n\nDon't get too close\nIt's dark inside\nIt's where my demons hide\nIt's where my demons hide\n\n\n(I don't want you to become too close to me, I'm a person with a dark past, it's not fair for you to live what Iâ\u0080\u0099ve been through. Still in the end of the day, I have a destructive soul)\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nthis is a beautiful song that describes me (as in I see myself as the singer...as in the feelings and lyrics.)  I cried when I saw the video with this. I see myself in this song because I am so imperfect, and I can be such a bitch. I have wet eyes when I hear this. it's great to listen to when you feel sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nThings are not always what they may seem on the outside. You can be involved with a person but can they except you for who you really are. Flaws and past mistakes are what we call our demons. Our past comes back to hunt us no matter how much we try to hide it and start over. When the truth comes out can this person stick around. \t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nI like to view this as being about the condition of humanity with some allusions to the biblical apocalypse.\n\"When the Days are cold, and the cards all fold.\" When it is dreary and cloudy and everyone has no hope.\n\n\"And the saints we see are all made of gold.\" When all good has been lost, so we turn to saints for heartwarming fairytales.\n\n\"When your dreams all fail\nAnd the ones we hail\nAre the worst of all\nAnd the bloodâ\u0080\u0099s run stale\" When all hopes of a better World are deemed ridicoulus from a young age, and we submit to military leaders and dictators that cause so much war that they cannot clean up the bodies.\n\n\"I want to hide the truth\nI want to shelter you\nBut with the beast inside\nThereâ\u0080\u0099s nowhere we can hide\" He wants someone he cares about (His kids?), to be sheltered from the archaic world they live but he can't.\n\n\"No matter what we breed\nWe still are made of greed\nThis is my kingdom come\nThis is my kingdom come\" People are self-conceited, and all they want is to be known forever for wealth and power.\n\n\"When you feel my heat\nLook into my eyes\nItâ\u0080\u0099s where my demons hide\nItâ\u0080\u0099s where my demons hide\nDonâ\u0080\u0099t get too close\nItâ\u0080\u0099s dark inside\nItâ\u0080\u0099s where my demons hide\nItâ\u0080\u0099s where my demons hide\" We tend to see the wrong parts of people and he is admitting that he is terrible and he wants them to know him for his wrongdoing instead of his good.\n\n\"When the curtainâ\u0080\u0099s call\nIs the last of all\nWhen the lights fade out\nAll the sinners crawl\" When the World is done, all of the wrongdoers will be crawling (like the serpent.)\n\n\"So they dug your grave\nAnd the masquerade\nWill come calling out\nAt the mess you made\" The Bible makes several mentions of the wicked digging pits for the righteous to fall in, and people will be dying and it will be your fault (and others') that they are suffering, for your conceitedness.\n\n\"Donâ\u0080\u0099t want to let you down\nBut I am hell bound\nThough this is all for you\nDonâ\u0080\u0099t want to hide the truth\" Let's admit it who isn't hell-bound I've tried hard and i'm not going to heaven.\n\n\"No matter what we breed\nWe still are made of greed\nThis is my kingdom come\nThis is my kingdom come\" We naturally tend to think right now.\n\n\"They say it's what you make\nI say it's up to fate\nIt's woven in my soul\nI need to let you go\" He wants to not believe he is the cause of his suffering, and he knows he shouldn't drag the person down with him.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nsuch a good song reminds me of my life\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nIn my opinion the girl in the song is actually Mother Nature. He knows that Earth is inevitably being broken and that he as one man can't make it stop while in the end he gets hope from looking at the sun keep rising and the beautiful landscape so he asks how to help keep the Earth healthy and have less sin take place. \t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nawesome interpretation, but it's unbiblical. Yes sometimes we have demons inside of us, but if we let Christ inside of us, that demons will fade away. Yes we are humans but we don't rely on that thoughts that we are only human so we have a freedom to do bad things, we need to understand that Christ is our maker, His kingdom come not our own kingdom.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nThis song is lovely :) love the band name too\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nLOVE THIS SONG. \r\nThis should have been the single in my opinion. \r\nI think it's fairly self explanatory.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nI have to say. This song helped me through a difficult year. It has a meaning to me that might not be anyone else's, but I'd just thought I'd share it. \n\r\nFor me, this song is about someone who is afraid of falling for someone. Someone they know they're bound to fall in love with anyway, but they don't want to hurt them, or get hurt themselves. 'Don't get to close, it's dark inside.' \r\nIt seems like this person has had a lot of heartbreak, and has been having a tough time in their life in general. \n\r\nBut later in the song, it turns out they did fall for the person they didn't want to. \r\nThey actually have a chance. They're so close to at least getting a date with the person. \r\nBut then they blow it. They fear rejection anyway. \r\n\"Don't wanna let you down, but I am hell bound.\"\n\r\nSo then their love interest moves on, or so they think. Because the person they had fallen for is now with someone else. \n\r\n\"They say it's what you make\r\nI say it's up to fate\r\nIt's woven in my soul\r\nI need to let you go\n\r\nYour eyes, they shine so bright\r\nI want to save their light\r\nI can't escape this now\r\nUnless you show me how\"\n\r\nHere is the part that means a lot to me. Basically, my meaning to this song is what happened to me a head ago. \n\r\nThe 'love interest' I've been talking about, well he's been forced into relationships he doesn't really want. But I say it's truly up to fate, just like the song says. \n\r\nSo that was what the song meant to me. It's only my opinion. \n\n\n\n", "comment_163": "\n*if the person they love is a decent person they whouldn't judge them & just love them.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nItâ\u0080\u0099s about a person with problems, they had turned so bad that everything seems dark and there is no way out surrounded by people that have disappointed you in many ways, probably because of the greed that actions bring.\n\nThis situations make him think that despite the good intentions the demons inside of us make it harder to be good with himself and with the other and that maybe blood and destiny is stronger than the changes you could accomplish, and for that reason it is not save to be surrounded by other people.\n\nRegardless of his reality, he has a person to trust and to rely on, and he tries to make an advice of being careful because the darkness can be contagious, He doesnâ\u0080\u0099t want to disappoint the only person that has been there for he, but he says that he needs help to get out of the dark place.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nIf you cannot live in peace or accept your  flaw you cannot love someone.\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nthis song tho <3 c'x\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nEveryone is wrong! obviously its about how the girl is too afraid to hurt him and go against her promises and break up with him... so he is breaking up with her even though he loves her so much, but is heartbroken that she is not as interested in him anymore...\r\nsooo he goes on to talk about how life isnt fair.. people are greedy...(they cant just love one person forever)... in this song he has a lot of anger and frustration but he is expressing hurt and sadness.. He loves her so much and her eyes are so \"bright\" (makes him happy). He realizes he has to ket her go because he cant take loving someone more than they love him back. \"the mess you've made\"-- he isnt blaming himself for the breakup he is blaming her.. she has a funeral waiting for her as mentioned in the lyrics because she will be filled with disappointment in her future as she will be dumped by other guys, thus conparing her to the rest of the world.\r\nOK?? \r\nSo why did people think he was blaming himself? he is obviously blaming the girl for not loving him as much as he loves her\r\n\"And the masqgottende\r\nWill come calling out\r\nAt the mess you've made\"\n\r\nok next... so he got hurt by knowing that she doesnt really want to be with him... but they are stuck in the relationship because she still loves him in a way that she cares about him, but not as much as he loves her.. so he is letting her down \"dont want to let you down\" because she believes he is a man of his word and wont leave her, but he is doing this for her -\"though this is all for you\" so she can be free of him and not have to be sad that she is stuck with him(because once again she wont leave him and she doesnt want to hurt him, but inside she doesnt really want to be with him... and he feels this so he is breaking up with her so she won't have to hurt him... because once again she doesnt really want to be in the relationship anymore.....LOL.. CONFUSING? :)\n\r\npeople are interpreting the words but not the emotions behind it... This song sounds like he is hurting because of love, not that he is hurting someone else.\n\r\nthis is about him loving someone else but not getting the love back. he is in a one sided relationship and feels hurt because he loves her so much but he is hurt because the relationship is fading away. He is doing this for her(though this is all for you), meaning he doesnt want to break up with her but he is doing it for her because she will be happier since she is staying with him to be faithful to her promises but he knows she doesnt want to truly be with him anymore... and because she is too afraid to hurt  him as she does still love him in the way that she would never want him to die or be unsafe.. she cares but she has this burden of loving him, and he doesn't want her to be unhappy as she truly has gotten over him already... she will be heartbroken because she loves him and if something happened to him she would want him more than anyone to be with her,but he knows she is burdened because she feels she has to stay with him because she is afraid of loosing him forever(death)...but once again she knows she isnt happy so he has to leave...(as i alreadt mentioned above).... the demons in his eyes will be the hurt he is filled with... when he breaks up with her she will think that they both just faded away.. she will be fine. but it will be hard for him because he still deeply loves her and he knows she will accept moving on and that is exactly why he is hurt, because she will be able to accept it because she has already gotten over it awhile ago...while for him its soul crushing and he wont be able to forget his love or get over it.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nEveryone is wrong! obviously its about how the girl is too afraid to hurt him and go against her promises and break up with him... so he is breaking up with her even though he loves her so much, but is heartbroken that she is not as interested in him anymore...\r\nsooo he goes on to talk about how life isnt fair.. people are greedy...(they cant just love one person forever)... in this song he has a lot of anger and frustration but he is expressing hurt and sadness.. He loves her so much and her eyes are so \"bright\" (makes him happy). He realizes he has to ket her go because he cant take loving someone more than they love him back. \"the mess you've made\"-- he isnt blaming himself for the breakup he is blaming her.. she has a funeral waiting for her as mentioned in the lyrics because she will be filled with disappointment in her future as she will be dumped by other guys, thus conparing her to the rest of the world.\r\nOK?? \r\nSo why did people think he was blaming himself? he is obviously blaming the girl for not loving him as much as he loves her\r\n\"And the masqgottende\r\nWill come calling out\r\nAt the mess you've made\"\n\r\nok next... so he got hurt by knowing that she doesnt really want to be with him... but they are stuck in the relationship because she still loves him in a way that she cares about him, but not as much as he loves her.. so he is letting her down \"dont want to let you down\" because she believes he is a man of his word and wont leave her, but he is doing this for her -\"though this is all for you\" so she can be free of him and not have to be sad that she is stuck with him(because once again she wont leave him and she doesnt want to hurt him, but inside she doesnt really want to be with him... and he feels this so he is breaking up with her so she won't have to hurt him... because once again she doesnt really want to be in the relationship anymore.....LOL.. CONFUSING? :)\n\r\npeople are interpreting the words but not the emotions behind it... This song sounds like he is hurting because of love, not that he is hurting someone else.\n\r\nthis is about him loving someone else but not getting the love back. he is in a one sided relationship and feels hurt because he loves her so much but he is hurt because the relationship is fading away. He is doing this for her(though this is all for you), meaning he doesnt want to break up with her but he is doing it for her because she will be happier since she is staying with him to be faithful to her promises but he knows she doesnt want to truly be with him anymore... and because she is too afraid to hurt  him as she does still love him in the way that she would never want him to die or be unsafe.. she cares but she has this burden of loving him, and he doesn't want her to be unhappy as she truly has gotten over him already... she will be heartbroken because she loves him and if something happened to him she would want him more than anyone to be with her,but he knows she is burdened because she feels she has to stay with him because she is afraid of loosing him forever(death)...but once again she knows she isnt happy so he has to leave...(as i alreadt mentioned above).... the demons in his eyes will be the hurt he is filled with... when he breaks up with her she will think that they both just faded away.. she will be fine. but it will be hard for him because he still deeply loves her and he knows she will accept moving on and that is exactly why he is hurt, because she will be able to accept it because she has already gotten over it awhile ago...while for him its soul crushing and he wont be able to forget his love or get over it.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nits about someone trying to make heaven on earth, its about someone giving up, its about someone crying out for help, when he says \"unless you show me how\" forever is forever just remember that, its not hard, just give up the superficial stuff and care about the things that matter, family and people.  We all want to see are loved ones forever, so lets do the right thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nThe lead singer, Dan Reynolds, has said that he wrote this song and it is about there being more than just face value to someone. So you have to look close and find a person's true emotions and feelings and that is who they are. And their personality is better than how they just look on the inside.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nWe all have our demons to overcome. Mine are my horns, but I go often to the hairdressers to have them cut! ;) \nWe can all find a way to heal/overcome. To some it is to be surrounded by people who love them, and treat them for who they really are. To some is through faith, sports, music.... or through loving someone. \nGreat song!\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nI think the song basically says that we all have our demons- whether it's depression, low self esteem etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nI feel like this song is about his girlfriend dying, not about the world being in apocalypse, but that makes sense, too. I mean, they did make \"Radioactive,\" right?\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nThe lover wanted to protect his innocent wife from the cruel world at the same time save himself thru her.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nNico di Angelo singing this as he ventures through Tartarus alone. *cries forever*\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nSo first of all, I just want to get across one thing, that being that songs are basically poetry put to music. That said, when analyzing poetry, you should start with four things; finding the Speaker, or whose point of view is this in, Occassion, or what's happening or what's happened that inspired this poem in a sorts, Audience, or who is meant to hear this and who is the speaker talking to, and last; Purpose, which is what it sounds like, why is this person saying this? To start, let's find the speaker. The line, \"my kingdom come\" is parallel to \"Thy kingdom come\" from the Lord's Prayer in Christian belief. I don't think Dan Reynolds is claiming to be God or anything, but it's a possibility that the song is written from God's POV. Next, occasion. What's happening in this poem (song)? Well, it seems to be that everything is going wrong for this guy, God or not. As the generations pass (I don't know if this is true or not), I think that less and less people believe in themselves or other people, which again, could go with God, though this person could just be anyone. Third, we have audience, who is he/she talking to? In the line, \"unless you show me how\", he/she seems to be talking to someone in particular, though it's just as likely that he/she is addressing a specific group of people who seem to know the way, but can't or won't help this person out. Lastly, we have purpose. \"It's where my demons hide\" seems to imply that this guy wants others to realize that he/she is not perfect, that this person has flaws just like anyone else, perhaps even more so than anybody else. In conclusion, I think it's about a person who is struggling to get across the fact that they aren't who everybody else believes them to be, and that they have bad times and good times, too. Another interpretation could be that, even though I'm an atheist, God is trying to show his followers that he's trying his hardest to keep them happy and healthy, but his hardest isn't enough for him or anyone else, and that despite him being, well, God, he's not quite as perfect as they want or need him to be, and that he needs their help to make this world a better place. I don't know if this is what it actually meant, and I'm sorry for dragging you through this whole explanation, but this is what I thought maybe it meant, so thanks for reading! Whoever you are, have a great day and love imagine dragons. <3 ;) \t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nIt's about his child, and the legacy he leaves behind, \t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\n\"Demons\" is clearly about Harry Dresden from the Dresden Files series.\n\r\nThe vocal tone is very similar to the faint melancholy of the series - and the lines fit nice; for example, the first lines - \"When the days are cold / and the cards all fold\" match Dresden's fall into becoming the Winter Knight.\n\r\nThe lines, \"And the saints we see / are all made of gold\" \"And the ones we hail / are the worst of all\" is about his mentor's reveal to be the Blackstaff; the shock that the one he trusted the most was one of the most dangerous, and possibly hypocritical, wizards around.\n\r\n\"The beast inside / there's nowhere we can hide\" - everyone who Soulgazes with Dresden are shocked at what they see, but we don't know what it is yet.\n\r\n\"We are still made of greed\" - an overarching theme of the Dresden Files is people are overwhelmingly greedy ... for power, wealth, for a good life. Even Dresden himself, to some extent.\n\r\n\"When you feel my heat / look into my eyes / it's where my demons hide\" - Fire being Dresden's preferred element, and again the act of Soulgazing with Dresden reveals something scary within him.\n\r\n\"When the curtain's called / is the last of all / When the lights fade out / All the sinners crawl\" - Dresden literally was forced to crawl after breaking his back rescuing people from a fire; his curtain call would be his accepting the position of Winter Knight.\n\r\n\"So they dug your grave / and the masquerade / will come calling out / at the mess you made\" - happens in Book 3: The Red Court literally dug his grave and revealed it at a masquerade ball; the Masquerade (the act the Supernatural world does on the Natural world) is called out when he starts a massive war with the Red Court.\n\r\n\"Don't want to let you down / But I am hell bound / Though this is all for you\" - Pretty much his attitude through the book series, made especially clear when he takes on the mantle of the Winter Knight to save his daughter. Could also mention just the amount of torture and torment he goes through in each book to protect his friends and stop the bad guys.\n\r\n\"They say it's what you make / I say it's up to fate / It's woven in my soul / I need to let you go\" - Dresden is somehow fated to be an important player in the upcoming war; every love of his life leaves him, and he believes he is fated to be alone.\n\r\n\"Your eyes, they shine so bright / I want to save their light / I can't escape this now / Unless you show me how\" - Whenever Dresden's misery and situation became overly taxing for him, it was his friends - specifically Murphy - who helped to show him how to escape despair. He spends much of his resources in protecting her, to keep her eyes shining bright.\n\n\r\nSo ya - I think that the song is based on the Dresden Files book series. It works too well.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nthere's a spiritual side to everything. the Saints, the demons pretty self explanatory. the end. When the cards all fold it's all over. The end of life... Judgement Day. I feel that the soul sometimes cry out, before the mind. The song demonstrates though he's been put into a place where he believes there is no salvation,  he has hope. it is someone close to him, that he doesn't want to hurt but he also knows that this someone could help him. If that is not a cry for help I don't know what is. There is only one answer!! Peace and blessings to those who call upon Jesus..\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nI think this song is about bananas\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nThis song is about a kid with cancer, ask them yourself.\t\t\t\t\n\t\t\t\t\n\n"}