{"comment_0": "\nTo me, it is about being in love and in a relationship with someone and being terrified that they are just going through the motions.  It is about looking into their eyes and feeling that something is missing on their part.  A terrible feeling.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ni'm suprised noone has commented this yet.\r\npersonally this is one of my favorite songs on her new cd.\n\r\nand i think it has to do with a broken heart and you're trying to get over them. you're still deperate for that person no matter what even when you know you shouldn't talk to them cuz you're trying to get over them, you'll take whatever they give you even if it's just a \"hey\". and when/if they do talk to you, you just have so much to say to them that you can't get it all out.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\n\"What's the use of holdin' on tight to the phone if nobody might call\"\r\nMan do I know this feeling.  You know that this guy is not going to call you, but yet you need to check your messages all the time, you glance at your phone, knowing that what you want to see isnt going to be there, but yet you look anyway.  \r\n\"I'm still desperate for you\"\r\nThe way I look at this song, from my experience is that even through all of the crap this guy has done to you, after all the time broken up, the lies the guy says, blah blah youre still in love with him and would do anything for him, and to just be happy again with him.  \r\nI agree with mysweetoctober, You know you shouldnt be talking to this guy, because it makes getting over him so much harder, but yet you long for him to just say hi.  \r\nThis song hits home hard..\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI agree with the other people who commented on this song. \r\nThe girl is in love with the guy even though he's no good. \r\nI'm sort of going through this situation myself (aren't we all) and \"I'm still desperate for you\" sticks out....\n\r\n\"Well it's too damn bad you didn't have a chance to make me your best friend\r\nYou were too caught up in giving too much up and not doing what you should have been\"\r\nMy take on this: The guy has a significant other, whether it be a girlfriend, a fiance or a wife - but the girl is still in love with him regardless. They are having an affair but in the end he choses to stay with his wife. That's why she tells him, it's too damn bad you didn'th ave a chance to make me your best friend - she felt like she could have given him more than who he had at home. And the part 'you were too caught up in giving too much up' .. He was scared about losing his security at home for this girl although he knows that he should have left his wife because he was so much happier with the other girl ....\n\r\nThat's just my take on it. Think what you will.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nDefinitely agree with bertecho. Gosh, Miranda sure has a way with words, doesn't she..\n\r\nIn the very first line she's calling herself a bitch. \"Throw a dog a bone, I'll take it if I have to\". Well, if she's a female and she's calling herself a dog... Has anyone else noticed this? - I only recently caught it.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nYa i completely agree mysweetoctober,  considering i'm going through that situation myself..\t\t\t\t\n\t\t\t\t\n\n"}