{"comment_0": "\nobviously this song is about diet mountain dew and how bad it is for lana. don't y'all know diet sodas have aspartame which can cause cancer and shit? lana is just warning all of y'all not to drink anything diet, even if it is delicious, sweet, green, luscious diet mountain dew.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nTo me, this song is about a relationship which the singer (lana) knows is going to be short yet is still in the relationship. This song is also about the girl knowing that the boy is not good for her, \"your no good for me\" but she still wants him (and loves him) \"but baby i want you\" lana says \"maybe i like this roller-coaster\" to show that she likes that the guy is crazy and bad. I think the name of the song is brilliant. The way i think of it, mountain dew is unhealthy. I think that lana is comparing the relationship to the drink and saying diet mountain dew to show that no matter how much a girl tries to change a bad boy, he can never be changed.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThere's so many things this song could mean. It could literally be about Lana riding around with a guy in New York city, wearing heart-shaped sunglasses and drinking Diet Mountain Dew. I serverly doubt it's that literal though. \n\r\nLet's break it down:\n\r\n\"You're no good for me\r\nBaby you're no good for me\r\nYou're no good for me\r\nBut baby I want you, I want you\"\n\r\n-Obviously this guy is no good for her, but she wants him. \n\r\n\"Diet Mountain Dew, baby, New York City\r\nNever was there ever a girl so pretty\r\nDo you think we'll be in love forever?\r\nDo you think we'll be in love\"\n\r\n-She compares this guy to Diet Mountain Dew, because on the surface he looks good for her, but in reality, he's actually terrible for her just like the beverage itself.\r\n-She also says \"Never was there ever a girl so pretty\" She could be talking about New York itself or the Statue of Liberty or it could be talking about herself. \r\n-She also questions their love for one another, doubting it. \n\r\n\"Baby put on heart shaped sunglasses\r\n'Cause we gonna take a ride\r\nI'm not gonna listen to what the past says\r\nI've been waiting up all night\"\n\r\n-By telling him to put on \"heart-shaped sunglasses\" I think she's asking him to at least pretend to be in-love with her, even though they're not. \r\n-She's not going to \"listen to what the past says\" perhaps because he's treated her poorly or he has a bad boy reputation. \n\r\n\"Take another drag turn me to ashes\r\nReady for another lie?\r\nSays he's gonna teach me just what fast is\r\nSay it's gonna be all right\"\n\r\n-She's comparing herself to a cigarette. By turing her to ashes, he's using her and he's lying to her to get what he wants, perhaps, or vice-versa. Either way, she doesn't care. \r\n-The second part might be talking about how she's not that experienced, whether it be sex or something else. Whatever it is, he's going to teach her. \n\r\n\"Let's take Jesus off the dashboard\r\nGot enough on his mind\r\nWe both know just what we're here for\r\nSaved too many times\n\r\n-She's talking about throwing her morals out the window and not caring about what other people think. \r\n-She knows what they're there for, which most likely is sex. \n\r\n\"Maybe I like this rollercoaster\r\nMaybe it keeps me high\r\nMaybe this weed it brings me closer\r\nI could sparkle up your eye\"\n\r\n-She's talking about how this is an unhealthy realtionship, but she likes it. \n\r\nOverall, I think the song is about a sexual realationship thats clearly unhealthy for her because she knows this is going no where, but she doesn't care. It looks good, even though it's terrible for her, just like Diet Mountain Dew. \n\n\n\n\n\n\n\n", "comment_3": "\nThis comes after the first chorus:\n\r\nHit me, my darling, tonight\r\nI don't know why but I like it\r\nGot to get back to the wild\r\nGive it up, give it up\r\nLive it up, live it up\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nFirst of all, people always say that diet sodas are \"healthy\" or better for them, when in reality they are just as bad with added artificial sugars and such. I think this relates with the unhealthy relationship she has with a man--the one in which Lana ignores the bad, maybe even embraces it, because she loves him so much. She knows he is no good for her, but she wants him anyway. \"Turn me to ashes\" also shows she knows he's bad for her. She doesn't care what people think/say of her or \"what the past says\". They will take Jesus off the dashboard, even, so that truly no one can judge them. She loves him because he gives her a rush--the roller coaster, the speed, the high--and he will teach her \"just what fast is,\" which is the feeling we know from her interviews she craves: feeling alive, young, wild, and free. That's why she loves the men that mostof us find terrible! She keeps asking \"Do you think we'll be in love forever?\", which to me is the first time on the album she shares the same doubts we as the listeners may have for their relationship (though, she surely is positive of her feelings/love for him)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think the song is about a rushing relationship of which she knows won't last long.\nSo, firstly New York is a very hectic city, everyone is always in a hurry and is in a rush and Diet Mountain Dew is a beverage from which you will get a sugar rush, getting in high spirits but when the rush is gone you will end up very tired. She asks herself if they would be in love forever, but then she just asks if they actually would be in love, leaving out the 'forever'\n\n\"Baby put on heart shaped sunglasses, cause we're gonna take a ride\nI'm not gonna listen to what the past says, I've been waiting up all night\"\n\n-i don't know if this saying exits in english, but we german say \"durch eine Rosarote Brille sehen\" which means something like \"seeing trough a pink glasses\", so when someome is in love they see trough these glasses and ignore all the problems, which come with love, Lana could mean something like that by saying that she puts on her 'heart shaped sunglasses', which is quite similar. She just sees the good things, trying to ignore the bad because they 'gonna take a right' (starting this superficial relationship)\nShe also says that she's been trough bad times, maybe her boyfriend suddenly ended up the relationship and for a long time she's been waiting for him to come back to her, which never happend\n\nTake another drag turn me to ashes, Ready for another lie?\nSays he's gonna teach me just what fast is, Say it's gonna be all right\n\n-she sees herself as a cigarette, which is used selfishly by men and after he takes a drag (have sex), she is left behind like the ashes of a cigarette;\nAlso the compares love to a 'lie', so love doesn't really exist in this relationship ans she knows that he is just playing with her feelings to get sex with her.\nWith 'fast' she may states again the 'quick' relationship and she has almost no hopes anymore that this relationship would be different to the other loveless relationships she's been through\n\nLet's take Jesus off the dashboard, Got enough on his mind\nWe both know just what we're here for, Saved too many times\n\n-knowing that this kind of relationship isn't really religious, she forgets about jesus  by the reason that they both know what they got: a loveless relationship, only existing for the sex\n\nMaybe I like this rollercoaster, Maybe it keeps me high\nMaybe this weed it brings me closer, I could sparkle up your eye\n\n-here love is compared with a ride on a rollercoaster, which is speedful and shows the up and down of this relationship\n(isn't it 'speed' instead of 'weed'?\") the speed of this exciting ride brings her closer to the feeling that she's actually in love with this guy and forgot about the other, and now she has the hope that he could be in love with her too.\n\nSo, in the end she knows that this would be just another 'meaningless' relationship, which is as fast and as fading as a big city like NY or a sip of Mountain Dew. The both seem like they would bring happiness, but then ending up in a dejection.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThese are severely out of order.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThese are the right lyrics, it's just for the slightly revised album version. The whole song is a bit different.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think that it's about a girl who knows the relationship isn't going to last but doesn't care.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThere seems to be massive confusion on the lyrics. The lyrics here are from the first music video. The problem is that there are several version floating around. Two demos, the album version, and two music videos, most of which have different compositions. \n\nMainly the stanzas here are correct with a few alterations. Sometimes the last word is repeated and often both of the Diet Mountain Dew stanzas are used together. I didn't rewrite the whole stanzas so that this wouldn't be too long. The only one not listed in the current lyrics is number 10.\n\n[1] You're no good for me...\n\n[2] DMD, baby, NYC/ Never was there ever a girl so pretty...\n\n[3] Baby put on heart shaped sunglasses...\n\n[4] Take another drag turn me to ashes...\n\n[5] Hit me my darling tonight...\n\n[6] DMD, baby, NYC/ Can we get it downlow, down and gritty...\n\n[7] Let's take Jesus off the dashboard...\n\n[8] Maybe I like this rollercoaster...\n\n[9] Hit me and tell me you're mine...\n\n[10]\nbaby stopping at seven eleven\nbearing his white Pontiac heaven\ndo you think we'll be in love forever\ndo you think we'll be in love\n**\n\nBorn To Die Album Version = 1.2-6.3.4.2-6.7.8.2-6.1.2.10.2-6.1(x3)\n\nMusic Video#1  = 1.2.3.4.5.2-6.7.8.9.2-6.1(x2).2.10.6.2 \n\nMusic Video#2 (NYC T-Shirt) & Demo#1 = 1.2-6.3.4.2-6.7.8.2-6.1(x2).2-6.2.10.2-6.1\n\nDemo#2 = 1.2(x2).3.4.2(x2).7.8.2(x2).1(x2).2(x6)\n\nHopefully this will help everyone know which version they are listening to.\n\nAlso I think the line is\n\"Maybe the speed it brings me closer\"\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nKnowing Lana's  songs, I was wondering, is it love for a man or about drugs. He can teach me what fast is certainly could be about coke. The love for drugs is usually an unhealthy relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nDiet Mount 'n' do (dew) , baby new york city.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nSugar-free soft drinks are WAY healthier than their empty-calorie versions.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ndiet mt dew is bad for your body and your Health, just like this guy is bad for Lana. this guy Lana is in love with is a bad boy and is no good for her he's like diet mt dew \t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nobviously this song is about a fun but unhealthy relationship that the girl is so fascinated about it and the part she talks about being pretty is because she thinks she is beautiful because of this relationship and pretty enough to deserve this boy and she knows for sure that this love is not gonna last but she just wants to enjoy the moment and she wants to make love quickly and without worrying about anything\t\t\t\t\n\t\t\t\t\n\n"}