{"comment_0": "\nThe \"carrots\" he is talking about can be viewed metaphorically, but he literally is talking about carrots, which is supposed to be kind of ironic. Carrots are technically living, they might even have a soul, but that doesn't matter when it comes to their harvest - they are eaten by species that are higher in the food chain. If life did not feed on life, then all life would die.\r\nThe irony of \"carrots\" is that they obviously do not have a nervous system, and to the best of our scientific knowledge, they do not feel pain or suffering or anything at all.\r\nBut if we do not care about carrots, why should we care about flies and insects either? Flies have a very simple nervous system, and arguably, they do not feel any complex amount of pain.\r\nIf we do not care about the flies, then why care about the birds who eat the flies? Birds have a relatively simple nervous system, and they most likely do not feel any complex amount of pain.\r\nBut if we do not care about the birds, then why care about the cats that eat the birds? And why care about the dogs that eat the cats? The deer that eat the grass? The pigs that eat their own shit? The humans that eat the pigs?\r\nPain is just a sensation - an electric signal sent along a sequence of organic tissue that is all essentially composed of just ordinary matter: single molecules; protons, electrons, neutrons, etc.. \r\nAll of which ultimately feels nothing, and the sensation of pain was hollow and empty..\n\r\nIt would seem that this song (as well as the entire album) presents us the duality that They/He/It (whether it was Maynard, other members of the band, or just Tool in general) has been afflicted with - the paradox of morality. How can we claim to be for good and against evil, and how can we claim to be righteous, if we have to inflict pain on an innumerable amount of other creatures simply in order to survive?\n\r\nWhat if it turned out that we were all unknowingly on a farm as well, and aliens came to Earth one day to harvest us -- and feed not on our flesh, but torture us and feed on the tragedy produced from our cries of agony and torment?\r\nWithout that tragedy to feed on, the aliens would enter a state of unbearable nihilism due to the lack of any purpose - but when they torture us, it reminds of them of the temporary nature of existence, even their own, and the ultimate mortality of all things. It makes them thankful to exist. Without it, they would die.\n\r\nWas there ever a difference between these hypothetical aliens and the species (whatever it may have been, the song suggests rabbits) that ate the carrots?\n\r\nWhere do we draw the line between right and wrong? There is no possible way to draw an absolute line between \"when it is right, and when it is wrong\", since right and wrong are relative to their observer. Morality is a human invention. But subjectivity does not necessarily imply fallibility. The notions of \"right and wrong\" exist, because we make them exist - but that is it.\n\r\nHowever, considering morality in the case of humanity alone and amongst itself, it can be stated as a fact that our survival requires some degree of unconditional cooperation with each other. Mothers have to love their baby and feed their baby, or else their baby dies. Members of society have to cooperate with each other, or else humanity's more complex desires (such as the arts, technology, higher knowledge, science, etc) would be impossible to achieve. You're reading this on a computer right now. Do you know how to make a computer from scratch? I don't mean  buying the parts and putting it together - I mean harvesting the raw resources from bare earth with your bare hands and no tools besides what you can find for yourself, and then assembling those resources into a computer? I highly doubt anyone on this planet is capable of that. Your charade of a lifestyle automatically drafts you as a member of society's morals and ethics.\r\nDo morals and ethics get out-dated from time to time? Yes. Do we need to revise them? Yes. It's far from perfect, and its highly unlikely it will ever reach perfection. All you can do is find out for yourself through experience what YOU think is the best way to improve the world, and then REPRESENT these ideals of yours by integrating them into your individual persona.\r\nIt is NOT possible to predict these changes/fluctuations in morality and ethics by using logical sciences and measurements alone. There are too many variables involved in the fine-tuning of morality, and breaking it down mathematically is impossible, and even if we could do it, the results would be beyond human comprehension.\r\nYou have to use your intuition gained from experience in conjunction with logical sciences and measurements in order to come up with the best representation you can. Many people do not know it, but most people are already finely-synchronized with morality via their intuition, and they do not even have to worry about it - the perceived disruption occurs when individuals try to exploit the rhetoric and structure of morality for their own personal gain that is unrelated to morality.\n\r\nSo to basically sum it all up:\r\nBased on our subjective experiences, we must use our intuition to participate (with as much effort as we care to put into it) in refining society's morality to resolve to see what we perceive to be its current flaws. When we do this, our persistence and humility will eventually bring us to satisfactory results that we can at least be content with. Some people have it easier than others - and from my perspective, yes, it is morally correct to crash these types of people down whenever they are acting cocky to someone who has to deal with more than them. Maybe that isn't the same for you, maybe it is, and that's the beauty of it I guess.\r\nOur experience here will be worthwhile - but that doesn't mean you are automatically guaranteed satisfactory without having to work for it at a level past your comfort zone.\n\r\nWe can improve our lives, to whatever extent we allow ourselves to.\r\nHowever, it is unknown whether or not we can improve the state of all humanity. \r\nThis might be as good as it gets as far as our world goes, but that's only because society can't hold everyone's hand and wipe their asses for them - they know themselves the best, and only they know how to fulfill their needs the best. The sky is the limit for improving our own lives, because whatever you consider the definition of \"improvement\" to be is up to you..\n\r\nWow this is a long ass comment okay I'm done. There's Tool in a nutshell for you ladies and gentlemen\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song, is divisible into 2 parts, each with a seperate yet connected meaning, hence why there are 2 seperate monologues seperated by the middle chant of the tune;\n\r\nFirst, Maynard is very very obviously poking at relgion. He even uses the sound of sheep in order to make sure that the point is put across to the common person. He is simply saying how powerful education, manipulation, and religion are combined when the only common denominator of the human mind is fear. Fear can be used to make the sheep believe that the carrots are real and alive, and things that logic neglects, such as the rabbits needing glasses, would be ignored and taken for fact.\n\r\nFear is all powerful, and fear of damnation and ideas can change reality in our minds, from the peace and coexistance with all things to which we all share. \"This is necissary. Life feeds on life, feeds on life, feeds on life...\" We must consume in order to survive, the curse of consciousness makes this difficult because of our love for things and one another, we must accept it is the way of things.\n\r\nLast but not least, Maynard's landlord points to something that is the opposite of what he accepts as all things being connected. While we are all connected, it is because we do not own everything or anything, and why \"satan is seen as our cousin, and god as our father in this message, by a \"psycho\" who cannot see that not all things belong to him. the concept of ownership, greed; are not unique to our people (dogs and animals even believe this). Strangley we see that true insanity is believing that everything is yours, while we as people view that ourselves. Nothing belongs to anyone; we are one as a mind.\n\r\nThis is what Maynard says.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nok, well, i know this probably won't really explain the song. but, what i got the vibe from it was that humans are basically animals and are natural. religion and society makes us, as humans, into who we are. Every single time i hear this song, I remember the book \"lord of the flies\" especially at the part where maynard yells \"this is necessary...life feeds on life feeds on...\" And LOTF is a DAMNED good example of humans turning into what we naturally are. Beasts. Recently, in my english class ((which i'm failing because i spend time daydreaming trying to figure what we're here for)) we discussed lotf and that just got my attention. Not to say that my english class is boring, but it doesn't really reach to me, if i'm alone with the teacher, i'm able to understand. ANYWAY...kinda got off topic, the first part of the song i believe is showin how religion basically is a flaw, and shows that religion is just a facade. Facade as in we use religion to make ourselves better, or at least feel better. . . i dunno, i think i'll basically post later when i'm not tired\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis is the best explanation i can come up with \n\r\nPart 1:  Televangelist on TV making ludacrous claims, and people follow him, hence the sheep, definitly a religious mockery no doubt. The line life feeds on life feeds on life is saying one organism must survive off another organism to live. \n\r\nPart 2: Crickets- has to do with Part 3, woke up in a ditch, this is the sound of who ever it was sleeping in the ditch. \n\r\nPart 3: has to be about life being connected, i didnt get the idea i had now until i listened to Vicarious and thought about it.  remember Life Feeds on Life, basic survival, one organism must survive off another organism to live, if you are an animal, you kill other animals, take land away from other animals. okay now. human perspective.  He thinks Everything is his, he took the territory, its his, he sees the sky, its blue, its his color, he is covered in goo(blood, possibly killing who ever was on the land, so now he is claiming it as his own. he wipes the goo(blood) off of this hands onto the green grass, and now his color is green b/c he saw the grass and if the grass is green than his color is green. when he says why does everything have to change he is refering to the colors changing and his wants changing. new color new posession. when he says waiting for the rest of your mind to come back to you, i get this vibe now, he thinks all these things are his because he cant rememeber. he sees the car and thinks its his car. the god and satan thing may be in their because his memory is coming back to him, and why doesent anyone else understand these important things?, i think the man is establishing a state of empowerment and he feels like he is better than everyone, he is coming out of his confused and head aching state into a more \"clear\" state of mind.He gets to the car and tries all the doors, locked, meaning its not his car, funny that he doesnt check for keys or anything.mabey he knows its his car(thinks it is anyway) but doesnt understand what it does, hence he wouldnt know he needs keys, he just knows its locked. like when people wake up with brain damage and dont know who they are or what is theirs or who their family is or where they are but they know how to speak and they know what everyhign is like a bed, a chair, a bowl. expensive leather camera case laying in the seat. it belongs to the people who are in the field by the woods,( taking pictures, mabey bird watchers) you begin to walk toward them. the guy is wanting to kill i would suppose. your color is red, this is strange, his color should have been red when he saw the car and it should have turned to the color of the field/ woods/ people when he saw them. mabey his color is red now because he want to kill them but i dont think so. i think its red because he wants the red car and when he sees the people he knows he can get the car by killing them so he sees red, like its his mission to obtain the red, so when he walks toward them, he thinks red becuase he knows if they are dead than its his. and of course those little people out their were your too.  well he is now thinking these are his people, that they belong to him like the car and the grass and the sky, so mabey he doesnt want to kill them. or mabey this means he has killed them and they are now his.....\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nwhat i got out of the song is that when we first start finding out about life and when we are actually old enough to understand some of the things that go on, we realize that life is brutal. we always here about what is wrong and what is right and we are never able to make choices for outselves without getting crap from at least 1/3 of the people you know. everyone is so overwhelmed about trying to be politically correct that we lose ourselves. i think that \"cries of the carrots\" is just an anology for how much we have lost. kind of a metaphor for all the little things we take for granted. and we don't really see how important some things (or people) are until we are put in a desperate situation. when i first heard this song my brother said that it was \"amazingly kickass, who else [but tool] could make a song about carrots!?\" but after i listed to the song more, and heard more of the lyrics i saw so much more. i guess this may be a little far fetched to some, but the main reason i love tool (and maynard james) is that their songs are the ones that can truly make me think. its like a verbal rubix cube. i always have to try to find hidden meaning, and try to find something that is significan to my life.\t\t\t\t\n\t\t\t\t\n", "comment_5": "\nGiven there are many possible meanings to this song, to me it seems like its about how people will follow an idea without question, just because it's accepted among the masses as politically correct, or its what their friends next door are doing. They don't interept things to form their own opinions, they follow ignorantly..like sheep\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIn the Tool FAQ, it is mentioned that Maynard spoke of Disgustipated in an interview.  Remember how the story at the close of the song sounds like a recorded phone message?  Turns out it was a message from the landlord recommending he pay the rent.\n\r\nAs for the song, well, there are three portions.  The first seems to be a humorous giggle mocking the use of religion in the context of a Reverend speaking to cattle, or sheep from the sounds of it.  Once again, this was inspired by the look an audience gave Maynard during one of his earlier shows with the Melvins.  He noted the blank expressions on their faces and began \"bah-\" ing at them, mocking their also subservient expressions.  I would assume he uses this part to illustrate our complacent tendency to serve and observe -- blindly and almost apathetically.\n\r\nThe central portion, well, it's a loop-based phrase.  Life cyclically feeds on life, energy in all organisms comes from the consumption of other organisms, at least multi-celled organisms, anyway, since most are too large to directly harvest and digest an adequate, carbon-based form of ATP and other vitamins and minerals directly.  It's instinctual to consume for every animal, be it herbivore, omnivore, or carnivore.  We consume, and we justify it all -- we feed on the idea that -- this is necessary.  Everything we are doing is right and necessary to survive.  As the mood darkens and gunshots are heard, our sights broaden to remember that we do more than eat genocidal quantities of carrots, we invade, burn, break, kill, and slaughter, too.  In the rush of the moment, we, too, think it is necessary, we tell ourselves it is.\n\r\nThe last part is an eerie calm, something to unsettle you -- put you on edge.  It is ended with the aforementioned story -- a short psychological tale that has no face and little explanation.  A man wakes up in a daze covered in what he calls red goo with a knife, a missing camera, and a locked car.  \"If God is our Father, Satan must be our cousin,\" says the speaker, a simple note to set the closing mood of this song.  This acknowledges that humankind isn't all consumptive destruction, but we are all equally capable of every cruelty Hell theoretically has to offer.  As the speaker follows the two people he sees walking by \"his woods,\" the speaker claims they are, \"his too.\"  It's an eerie way to word it, but an effective one, they are his next victims and they have invaded his space, tread too close.  We don't know what has happened or what will happen, but I'm sure you all have an idea.  And then the phone hangs up.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nanyone know where the story from the end (after all the crickets) comes from?\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThe first part is about the cycle of life. Rabbits eat carrots. Carrots supposedly make your eyes better. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThe second part was a message left on Maynard's answering machine by his psycho landlord\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ni find that hard to believe evilangel, about that psyco landlord\n\r\ndoes any1 got more information about that second part?\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ni just love him speaking at the end, he pronounces everything perfectly, it kinda just makes me think bout how i feel when i'm angry, walking down the street and will stare people down, it just makes me feel more powerful and lesss like i'm on a leash...\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nIt IS his landlord talking on the second half, check the FAQ.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nRight there with you in English, therumbucket. Interesting interpretation as well. I somewhat agree.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nAccording to Toolshed's FAQ, the song is poking fun of political correctness.  He's making the statement that carrots should have the right to live and not harvested, hence the \"holocaust.\"  But Makoe's got a pretty good explanation as well.  As for the end, it's a message his landlord left on his answering machine.  He must have been pretty messed up to think something like that up.  That or he's a genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nare you sure it was by the landlord,I had another theory.\r\nGod...I mean Maynard put it after the crickets because people (or atleast the ones I know) listen to music as they fall asleep,crickets can sooth the person to sleep,and then the talking part could effect how you dream,I've always done that\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nToolshed.down.net\r\n\"F32. Where'd that little story at the end of \"Disgustipated\" come from? \r\nNotice how it sounds like someone leaving a message on an answering machine? Seems Maynard's landlord called and left that message. Hence the liner notes' credit: \"phone message: bill the landlord.\"\n\n\r\nYes, I'm sure it's his landlord.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nthe second part was from his landlord, as credited in the booklet...my interpretation of this song is it's about life and religion...at first when he's talking about the carrots it can be taken as talking about the circle of life, and how that if cows and other livestock should be liberated simply because they're alive, the carrots and other vegetables should be liberated too...and the religion part comes while he's yelling \"can I get a halleluja!?\" and there's the bleating of sheep after the crowd responds, showing how religion can lead people to believe moronic things like the carrots are sentient...for the second part of the song, left by his landlord, I always get the impression of a serial killers point of view for some reason\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI agree love liana like its a killers point of view he gets messed up goes into a rage and kills people hence the knife ang goo and he cant remember well\n\n\n", "comment_19": "\n i have no idea what the second part means, but i think the first part is mocking televangelists and all those types. it's meant to reveal how ridiculous some of the things they say really are, and how psycho all the people who believe them are. when the preacher asks for a hallelujah and the people respond, they sound like sheep. this is meant to show how the followers of these crazy preachers are mindless beasts who simply follow the leader.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI Agree with bassmaggot and what he has to say about how the people just agree with what revernd Maynard is saying,no matter how ridiculous it is. He tells These Sheep that carrots have souls and can essentially feel pain. The thought to you or I that this is true seems indeed ludacris,but the people listening to him have been conditioned to think what there pastor tells them to.\r\n This is Necessary and all that scares the life out of me,because the first time i heard this i was at the peak of a very intense acid trip,and when i closed my eyes,i saw myself running through the woods from some farmer with a shot gun. The crickets gave me the feeling that i had escaped the psycho pathic farmer and was now lying alone in a field.And then i woke up in my DITCH!! I almost pissed myself when this part came on.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThe part in the end where he talks about the two small people walking by the woods reminds me of two small aliens far off in the distance watching him.  Hes trying desperatly to get in the car cause he wants to escape from them because he's scared.  This is obviously not what the part is about, but that's just what it makes me think of.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni agree with kroche and think that this song is making fun of vegetarians and vegans. I have always asked vegetarians if they hear the vegetables scream, as they whine and moan about my double quarter pounder with cheese. As though the trees and plants around them aren't as beautiful as bessie. I love animals. they are tasty.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nthe first part according to an interview is just maynard humourisly showing how much religion can really brian wash you...even something as stupid as never eating carrots because they have feelings....the seconde part IS an answering machine message from his lanlord...it is maynards eviction...thats why he says..\"It was daylight when you woke up in your ditch...\" because now maynard has no place to stay \t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ndo you notice that on the last part he keeps saying your grass, your people, your sky. and then whatever he sees that is his, he becomes a part of it. \"You looked up at your sky then. That made blue be your color.\" I think it has something to don't with we are all connected to our environment or maybe that we can change our own reallity, I'm still trying to figure out a few lines. Whats up with the camera case? one more thing, \"If God is our Father,\" you thought, \"then Satan must be our cousin.\" god does all the good things in life but satan (bad things) is connected to god. \t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nthe end of the song, sounds as though maynard wrote it, not some landlord, i think maybe the landlord might have said he was kicked out, and he made the rest up, coz they are maynards word... An interesting thing i noticed about the end of the song is. he woke up with a knife.. there was no use for the knife. but he has it, And then, he see's this red sports car, which he cant gte into, and 2 people, and now red is his color, and thats after hes seen the sports car.. Does he mean red is his color coz the sports car is his? or red is his color coz hes gonna kill them coz its theirs?? Just a little thing i noticed.. and dont just say im an idiot, what else is the reference to the knife there for?\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nActually the thing about Satan being our cousin is incorrect.  It says somewhere that God created the angels, then created us.  That makes satan our brother.  If he were our cousin, that would mean that god would have to acknowledge that he has a sibling...anyone else realize that?  And as for the leather case, i think the guy was trying to convay a search for somthing.  If he had a case and no camera that would mean that he had the camera out and was using it.  The most probable explanation being that he was taking pictures of a UFO and was abducted, hence the 'Goo' and the little people are aliens doin a little recon :P\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nOne more thing, about the colour.  I think that it means that he is trying, at least in his mind, to blend in, and not be seen.  He seems to be trying to act like a chameleon and go unnoticed so, at least in his mind, he seems to be invisible.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\ngive me a break Maynard is pro-choice and u know it.  There is no way so smart of a man could side with any republican attitude.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni think that hes tryin to get out a message that all life, even the life of a plant is precious, just because it doesnt get up and walk around doesnt make it any less of a specamin. and he uses the form of a preacher because preists have been doin it for a long time and its a form of speach that people actually listen to. the second part i think is is just a way to make you think. the crickets are there to help relax your mind, and even if you go to sleep, if you dream, when it comes to the point of the talking, your mind is boundless in what it imagines. instead of thinking about every word your allowed to set your mind free and let whatever is in your subconsious come out. but if you dont fall asleep, you can be relaxed enough so you dont end up over analyzin his words.    \r\nbut thats just what i think\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nDUDE the second part is all about any alien ubduction and when some aliean called him and told him abuot what happened to him and when he saw the little people they were his children, and it explains when he wakes up. SCARY SHIT MAN!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI would like to share with you all a true story that might bring a smile to your face. I was stoned out of my mind the other night; I was driving home at about 3 in the morning. (I recently started listening to Tool by the way, and had no idea about the second part of Disgustipated.)\r\nAnyways, I let the Undertow CD play through, and I eventually got to Disgustipated.  After the first part of the song came to a close, I thought the song had ended - I had my windows down, and yes, the crickets were chirping outside. So out of nowhere, I hear this guy start talking..I was so suprised, I swerved off the road and hit a cliff...\r\nI woke up in my car, I think about 10 minutes later..in a ditch beside the cliff.\r\nI think the 600$ worth of damage to my car was worth this story, heh.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nWell, no I take that back...\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nWell, no I take that back...\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nAlright, for the second paragraph, how bout this...\r\nJust came up with this now.  The first half finishes on a religious note, with Jesus, and how too much attention is given to TV Evangelists and whatever else..\r\nI think the second half describes Jesus.  Or the messiah, anyway.  He keeps being resurrected into our world without us knowing about it.\r\nHe wakes up, not for the first time.  It's happened before.  Minor headache - resurrection has that effect on ya sometimes...  God is his father, Satan his cousin...  He has a sense of ownership of everything he sees.  Or a sense of responsibility, maybe.  Especially over the people he sees.\r\nThe colours are tied in to the camera and the car, I think.  The speech touches on how people worship whatever they see before them (the sky, grass, colours that catch the eye), or their material possessions.\n\r\nI'm really reaching for anything when it comes to the goo and the knife...  Rebirth?  He cut himself out of his womb with the knife, and now he's all gooey.\n\r\nEven after all that, though, I think Maynard laughs himself to sleep thinking about how stupid f##ks like us think about his combination of random thoughts at 2AM.  The speech could very well mean nothing at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nTo me what the first part means it this. A while back Tool was performing at L. Ron Hubbard memorial arena and They didnt know that was what it was. Well, about halfway into the show Maynard found this out and went out on stage grabbed his microphone and started bleating like a sheep. So that begging is like something so rediculous and everyone is cheering for it and following like sheep. That is a paralell to L Ron Hubbard and his bullshit \"sciontology\" stuff.  The chanting is like the life cycle to me. Its sorta small and nothingness at first but it ends with gunshots and yelling and so forth. The end is still mind-bending for me though....I know it is simply a message left by Maynard's landlord but what does it mean? What is the \"now your color is....\" what does it all signify? its so awesome to listen to though.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\ni think that the end of the song is MAYNARD writting a poem about aviction using his confusing poetry skills but thats just what i think so its prolly wrong but if that part is really a message left on his answering machine he gets a lot of weird messages doesnt he...im mean with harry manback and all\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\ni think that the end of the song is MAYNARD writting a poem about aviction using his confusing poetry skills but thats just what i think so its prolly wrong but if that part is really a message left on his answering machine he gets a lot of weird messages doesnt he...im mean with harry manback and all\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nthe first part of the song is a joke, and i think that he is saying dont take everything so seriously.  As far as the last part, its just fucking freaky\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nwhen you hear the sheep that came from maynard at a live gig when he started bleeting at the crowd to suggest that they just follow the leader (probably L.Ron Hubbard) and the second part of the song is genuinly maynards landlord, just look at the credits of undertow it says bill the landlord.  the best bit about the whole song i think is the music, it was made by smashing a piano with a sledge hammer and put into watlz timing.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\ni don't believe that tool could be more obvious. LIFE FEEDS ON LIFE. to the carrots it is the holocaust because the rabbits are going to eat them. but damnit , let the rabbits wear glasses so they can \"see\" that the carrots have a life and a conscienceness. i think this is an attempt to make fun of vegetarians, not all of them, just the ones who try to say meat eaters are bad. as far as the preacher/sheep idea, that  most likely was thrown into the loop after the initial idea  came up, i really don't feel that this is a direct statement torward religious people, just \"sheep\" all the way around\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nand people remember, he's not ALWAYS talking about religious people when he say \"sheep\". as i read through alot of these TOOL interpretions, i find that everyone say the same thing, or just agrees with everyone else , or their opinion seems as if it was thought up in the same manner that \"religious \" people think. i sense that everyone feels as if they're more rightious than religious people. well remember, we all have our comfort zones, and we all have things that make us feel more important than we really are, even YOU. just because someone is religious, does not mean that they are idiots. and to think that they are, would mean that you're no better than they are for \"judging you\". right? so be careful what you say, wouldn't want to be a hypocrite right? this isn't to bash anyone, just trying to pursuade people to think differently than what they normally do, so they'll possibly make a fair and  non-judgemental view and statement.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\ni believe the 2nd phrase represents the will to be molded in order to be protected from standing out, and being judged, or maybe following blindly. the posseiveness could be a tool this person uses to comfort himself, he has to own what everyone else owns to follow, to be one of them, hes trying to go unnoticed. it flows with the theme in the first half\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\n\"so killing plants is okay?\" is the dumbest fucking retort i've ever heard.\n\r\nthat is, next to \"so do you eat animal crackers?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThe 2nd part is not his landlord. I'm pretty damn sure it isn't. Maynard lies a lot just to get a rise out of people and to get people to think about the meaning of it, who said it, what it's from, etc...etc...sounds like its more from some old horror movie, or just something Maynard wrote himself...\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nokay this song i swear to god is maynard making fun of vegetarians\r\nhes saying \"ha ha losers vegetables have souls too\" \r\nyknow \"this is necessary life feeds on life\" that\"s clearly him saying that vegetables and meat were both put on this earth for humans to eat so theres no point in limiting yourself to one thing\r\nand about the whole last part\r\nthats got to be maynard\r\nhe just wrote something weird and then slowed down the speed a bit to make it not sound like him\r\nand thank god for that\r\nit took me probably about three different drugs to figure out that i could speed up the sound on my computer about two notches and it sounds like maynard\r\nyay for maynard\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nok i dont know what the first part is about but the second part i belive is some guy (could be his landlord) left a message on his answering machine but i thoght it was about him not knowing he murdered his wife and he woke up in the ditch with a pounding headach(hangover) and his hands were sticky there could of been blood on his hands and near the end were it says \"i could see two tiny people and they were mine\" which means hes going after them next well thats my thoughts\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nevilangel is half right about teh psycho landlord. Message to Harry Manback was a message left on Maynards answering machine while a stranger, claiming to be a distant firend of a friend of Maynards, was staying in his house. When they came back one day the guy was gone, so was all the food in the fridge and this message was on the machine.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nIt seems this song is saying a very important thing about vegitarianism: people claim that eating plants is wrong because they feel pain and such, and that they are respecting thier beauty... But what is far more beautiful is the cycle of life. Life feeds on life. Also in regards to the first part, one can see how asinine this argument is quite simply: What of the animals that must eat the carrots, and the animals that must eat those animals? If they \"let the rabbits wear glasses\", then the rest of the foodchain would cry out. \"For them it would be the holocaust...\" And, perhaps a little birdwalk here, but what of all those for whom the spreading of Christian ideas has been the holocaust? This sort of thing that the preacher is... preaching is just the kind of sympathetic drivel that gets people to follow a leader... And those who follow such things are not only a stupid few. That really makes one dissapointed in the human race. Just a ramble....\n\r\nAlso, I agree with what therumbucket said. Lord of the Flies is indeed a great example of how humans are really animals when taken out of the conditioning of society and religion, and this theme fits into the song. I believe it was Marx who said \"Religion is the opiate of the masses\"...\n\r\nI don't know about the second part... It does seem to be an insane (or ingenious- the two are interchangable) ramble, and if the meaning was not thought out by the person who said it, then probing it for meaning will be a very very exhasting affair... Perhaps it should just be left? ^^;\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\n\"If God is our Father,\" you thought, \"then Satan must be our cousin.\"\n\r\nLaff...\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI like to think of the song as a series of juxtapositions, even though, I'll admit, that gives no clean, cookie-cutter meaning to the song.  We start with a flippin sweet sermon that goes right into an opposite chant that sounds to me like the voice of insinct; \"THIS IS NECESSARY\"...one must feed on his neighbor to survive.  The whole transition is traumatic; these are two irreconsilible points of view, and now we have them both.  We spend a long time in shock...and then we hear what we've done, by telephone.\n\r\nThat second part of the song really does not song like an eviction phone message.  It's in second-person, it really drags us totally into the song, solidiying that feeling of actually being somewhere (like  a sermon in a barn).  A lot of people say that this is following an alien abduction, which is totally sweet, but probably is just thrown in there for the same reason the knife, the goo, and the expensive leather camera case are present-- I feel these all give it a redneck flavor.  Think about it. Rednecks are always saying they're getting abducted, they're always talking about how much they love Jesus in spite of their intense hatred for Yankee city folk (red car, expensive leather camera case), it's rural, the speaker of the sermon has a southern Evangelist accent...all of this really adds to that atmosphere.\n\r\nI'm not saying Tool made a song about how stupid rednecks are (but god rednecks are so flippin dumb and shallow, they are going to slowly kill me and eat me); but they are a good example of how misguided religious piety goes awry.\n\r\nBut God are those not the best ambient sounds ever?  The gate clattering, then the rat struggling (twice!), and the sheep and all, and that insane drum that sounds like a fist pounding a rusty door out of Children of the Corn....AGGGGg this song is teh pwn.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI wouldn't read too much into anything by Tool.\n\r\nBut yeah, this song kicks ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nEven though the second part of the song was a message left by Maynard's landlord, it has some meaning to it I guess.I'll just tell you the obvious that stuck out to me. Even though it came from someone quit drunk or high theres somewhat of a biblical backround to it. When the landlord Bill talks about the making colors of your own like the blue/sky, green/grass, and red. It's somewhat like the creation of the Earth, but it sounds like it came from someone after a night of partying and they past out in a ditch. The next morning they came to and still feeling f*ed up they saw the sky and grass and ect. calling it there own maybe from Jesus/ Gods point of view. And the car was probably theres or not, but the red became his next color. The two people out in the field were his, maybe being Adam and Eve and red being his new color might have been the apple or forbidden fruit they had eatin. Yet I'm probably wrong or more towards def., but hey it seemed pretty clever coming from a land lord.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI really am trying to figure out the second part. Man, there has got to be a meaning behind it. I'm reading the posts here, and although some are very good, nothing sticks. I do agree there is something behind the message, rather than just saying it was something the landlord left behind. The FAQs don't help much in this matter anyways because MJK never really tells us the meaning, just clues. Then we get even more confused.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nBTW, this song is some freaky shit to listen to in the dark man, especially the last part. Always gives me the creeps, always. even in the fucking day man. THE DAY.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nwell maybe im not freaked out too much but im not really scared by this song. \r\nwell now to my real comment...\r\nbut at least the first 2 parts seemingly are about vegitarians. the first part to me is mainly just a jab at religious fanatics and psycho vegitarians. the second part is more clear than the other parts. \"life feeds on life\". no matter what, in order for life to survive it has to eat other life, theres no way around it.   and for the last part i really doubt anyone will ever find the meaning to this unless maynard directly says what it means, which is unlikey.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThe second part of the song is a type of personality test created by Carl Jung.  The images you create in your mind to go along with the story are supposed to give you insight into your subconcious.  For example, how large you imagine the ditch to be would correlate with some aspect of your personality.  Read up on Jung for more info.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nPersonally I loved this song with a passion....it kinda reminded me of those true vegans that don't eat anything that was ever alive at one point....yes that means they don't eat plants either...Hmm, for breakfast let's have chemicals meant to give us our vitamins, lunch? same thing...dinner? same thing... :P oh and a random little bit on info, your not a vegetarian if you eat fish....Abouit the second half of the song, wow! I never knew it was his landlord :P.....I've always lvoed the second story I found it sooo great and it's such an amazing story as well :P\n\r\n~Vampy\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI think this song is about a crazed sect leader. The end seems pretty chilling with the previous song (Flood) about someone who sees no other possibility than to die. Only a psychotic sect leader would manipulate people to such a degree.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nOk people, I've read your comments, and you all came close but you didn't quite catch what the meaning of this song is, so I'll clarify(mainly because I believe in spoon-feeding people with enlightenment as opposed to MJK)\n\r\nAlright, the first part of the song opens with someone who is supposedly a preacher who's guiding is followers with his religious dogma. What this is doing is making fun of religion, dogma and ethics in general with the lines: \"This is necessary. Life feeds on life.\" It kind of relates to and suggests how ridiculous religious leaders and thier dogmatic \"dos and don'ts\" can be, but it doesn't really tell us the full picture of what this song is about.\n\r\nThe second part concludes the song perfectly; it offers the point of view from a wondering serial killer.\n\r\nIn the first part of the song, the serial killer was supposedly attending the preacher's sermon, but then after it was over he hit the road and kept thinking \"This is necessary. Life feeds on life. That preacher was such an idiot\". He walks until nightfall and decides to sleep in a ditch off of the road, and this is where the second part begins - with the crickets churping through the night.\n\r\nThe story ends with him going to sleep that night, but we are given an epilogue as to what he is going to the very next day.\n\r\nThe next day he wakes up and decides to declare that all life, from plants to humans are equal and that killing people is no different from killing carrots now. He also wants to declare the world he lives in to be his; he plans on living like a chameleon- invisable to the world and essentually feeding off of other people's apparent stupidity and petty squabbles over religous beliefs. He essentially blames God for creating us one way and then expecting us to be another way, and the song also seems to suggest that he sees God as no better than Satan because he created Satan, and then allowed him to put us in the state we are in today. These being his thoughts, he decides to kill the two sight-seers by \"his woods\", and steal thier car for his new life hence the line- \"Now red was your color, and those little people out there were yours too\"\n\r\nAlso, the way the song is written, the serial killer seems to also be a fugitive from justice who is also on drugs, and the goo that is described is probably sewer discharge that got on him while he was sleeping in the ditch, but these are just theories and these aspects are not really important to the story.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nIf I summed this whole story up in one phrase, then it would be this: \"God made this world, and he wanted it to be just the way it is now, so why should we care? All have sinned anyways... so we should stop trying to be \"righteous\" because we're never going to be. Jesus saves!!! lol\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI also wanted to make a few quick clarifications about the epilogue. I know, it's very confusing; This song may be one whole story, but it's divided into two parts in a way that can greatly confuse the audience into thinking that it's just a bunch of random nonsense when it really isn't... but I guess this is MJK's way of being mysterious. I find it quite annoying.\n\r\n\"You looked up at your sky then. That made blue be your color.\" \n\r\nThis line tells us that he has become like a chameleon and wanting to be invisable to the world.\n\r\n\"You had your knife there with you too.\"\r\n\"You tried all the doors. They were locked. It was a red car and it was new\"\r\n\"You began to walk towards them. Now red was your color, and of course, those little people out there were yours too\"\n\r\nThese lines tell us that he's a serial killer who killed  two people. His color was \"red\" because he wanted to take the new car for himself by killing the two people who owned it so that he could take the keys to thier car and steal it.\n\r\n\"There was an expensive leather camera case laying on the seat. Out across your field you could see two tiny people walking by your woods.\"\n\r\nThis implies that the two people were traveling sight-seers taking pictures into the woods. They had stopped in the middle of the road to do this.\n\r\n\"If God is our Father,\" you thought, \"then Satan must be our cousin.\" Why didn't anyone else understand these important things?\n\r\nThese lines reveal to us his inner madness of comparing God to Satan and placing his own blame on the world from his own selfish point of view. He essentually is saying, \"To hell with religion. At this rate I'll never know the real truth behind anything, and I'll die living exactly the way *I* want to.\" And he does this by considering ALL life to be equal.\n\r\n\"You crawled up out of your ditch onto your gravel road and began to walk, waiting for the rest of your mind to come back to you.\"\n\r\nThis implies that he lost his mind over trying to philosiphize and come to his own conclusions about the world he lives in.\n\r\n\"Oh Lord, why did everything always have to keep changing like this. You were already getting nervous again. Your head hurt and it rang when you stood up. Your head was almost empty. It always hurt you when you woke up like this.\"\n\r\nThis part pretty much tells us that he's either on drugs or chronically drinks alchohol... and he might be running from something(probably cops) and is nervous from that. Or maybe he doesn't like the way the world changes all the time... who knows? It's not important to the main message of the story anyway...\n\r\n\"When you stood up there was goo all over your clothes\"\n\r\nSomething that got on him from the ditch(possibly sewer gunk), although he may have puked all over himself in an alchoholic blackout, but in fact it could be anything and it isn't important to the main message of the story.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nForgive me. \r\nFor I have brougt you pain. I did it before and soon I will give it to you again - because tomorrow is harwest day - and for you it is the halocaust. \r\nThis earth has been given to the human for it to be safe from harm. Then why do the carrots cry I must ask myself? \r\nBecause of the unwillingly death?\r\nIs a killer in me - a killer in you?\n\r\nwill be continued..\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\ni think this song is about how humans think that they are greatest species and think they can take ownership of everthing(thus the message at the end). we believe were so advanced in our own mind that we dont even think about how it would be for animals and plants when we eat millions every year. and at the end i think that its showing that we claim to own everything yet there is so much we dont understand( the fact that he doesnt know what happened to him) and that all these things that we invented and make us feel better such as the knife and camera still dont help in any way to understand what happened to this guy. yet the guy still claims owner ship over everything he sees.  i believe that animals and plants are the undertow and may seem lower to us but we may as well be the undertow and food for another race.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nWatch the film THX1138 about 37 minutes in when Robert Duvall is getting shocked by the robot police with the electric sticks...and tell me if the music in this scene does not sound near identical (in ways)to \"Disgustipated.\" I was watching one night and it just sounded so familiar...\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI will write what this song means to me later on, but right now, I would like to note a few points...\r\n1) Later on, when Maynard begins to yell \"This is necessary!\" After it pauses for the first time. The sound of the drum in the background resembles a gun cocking and going off. It fits in like this: \"This *Gun cocks* is *Gun shoots* neces-*Gun cocks*-sary *Gun shoots*...\r\n2) Also, to add to the above point, after he is done yelling \"This is necessary\" for the second time (After the pause), you hear glass shattering. Listen closely and their is a shotgun cocking and going off...\r\n3) That it is not infact and answering machine message. It is the lead singer of a band (Can't remember the name) that gave Tool the opening spot for them long ago at the concert where Tool first became a widely spoken name/the first time Tool went on stage at a big concert event...\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nSorry for the double post. After some research I found the speaker of the story at the end of the song. As I said in my before post it isn't really an answering machine message. It's the lead singer of Rollins Band, Henry Rollins. Rollins Band gave Tool the opening spot for them at Loolapaloza (SP?) back when Tool wasn't well known. This was Tools first big concert event. The band has been friends with Rollins Band ever since and they called on Henry Rollins to say the little story. I think the part was originally written for Maynard.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI think I heard one explanation somewhere that... here goes..\n\r\nLove is just a facade that we use to accomplish something real (reproduction, continuation of the human race..)\n\r\nAnd that the Bible says that God is Love.\n\r\nTherefore God is a facade developed to accomplish something real (realization of our unity, continuation of our evolution).\n\r\nThis was also related to the book, \"Dune\" and the Bene Gesserit's development of a selective breeding program. (By the way, I believe the relation to Dune is the only relation this explanation has to Disgustipated. Meh)\n\r\nThe Bene Gesserit basically got rid of any idea of love for their breeding program, which was intended to create the Kwisatz Haderach, who is the next step in human evolution. Not sure if this explanation was saying we need to throw away the concept of God for our continued evolution (as the Bene Gesserit did in Dune) or if it was relating the \"middle men\" that Maynard is against to the Bene Gesserit; people who appear to love but are really only pretending so they can achieve their goal of the Kwisatz Haderach, and the middle men pretend to believe in God but are really only pretending so they can achieve their goal of control.\n\r\nNow that I think about it, this might've been an explanation about why Tool included Dune on their reading list. \r\nAnyway, this just kindof came to mind.. so, what do you guys think?\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nThe first section is, quite obviously, what person after person has claimed it to be. A preacher says that carrots should not be harvested because the carrots will scream, which indicates pain of some sort. The people blindly follow what he says (hence the sheep). Then, as if in complete contradiction of that first section (really, it is in complete contradiction) the voice chimes in saying life feeds on life. This is true, of course; the carrots have to be harvested to sustain the life of others. Their organic life is destroyed for the continuation of anothers. This is the cycle of life. hence, this is nessesary.\n\r\nNow, everyone already knows that. Theres no need to explain it really, its extremely simple. The second part, the message left on the answering machine, that is a truly difficult thing to interperet. I always interperted the colors as being a means of showing the persons standpoint that the landlord is refering to in his message. He changes colors from blue to green to red. When he looks to the sky, he is blue. I have always believed that this represents that he is of God, a follower. He then comes to realize his condition: the knife, the goo, he's just crawled up from out of a ditch, these things taint his blue with the red of Satan, and now he is green as he wipes his hands in the grass, as if an admission of some kind of guilt. He wanders off down a road, believing everything he sees to be his. He tries to get into his car but its locked, and he sees his camera bag sitting open on the seat. He searches around, and sees the couple standing in his field near his woods. He storms over to them, and now red is his color, as he is going to kill them and get back from them his car and his camera, and they themselves too. The mention of God being his Father and Satan his cousin (even though, as someone else pointed out, Satan, a fallen angel, would be his brother, their fathers both being the lord) is to clue us in to what the colors represent. Possibly, it also stands to put out that God may be equal to another, hence the fact that Satan would be our cousin. Or maybe the person is wrong, and that would be the reason why no one understood him. Either way, its just my interperetation of it.\n\r\nOr maybe Maynard had a psychotic landlord named Bill who had a pecilur way of evicting people. Who knows, only Maynard, really. So why dont you ask him.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI love reading all these theories...lot's of them are very well thought out, and even if we will never get it from the proverbial horse himself, I think the horse would like the idea that he's promoting thought and questioning.  For lots of artists, they want recognition, popularity, money...to be liked.  Maynard...he wants us all to wake up, himself included.\n\r\nThe first part I believe is poking at any dogma or thought that promotes stupidity and failure to recognize reality.  Whether it be Scientology, Roman Catholicism, Vegetarianism, or even as mundane as simple interpersonal relationships, the way we believe we should treat each other, and ourselves.  So much of is is engineered to make us feel meaning to our existence, when there isn't any.  All throughout Tool's music, you can hear his anger at any stupidity...this subject matter simply frothed his anger into seething rage, and thus into an artful expression for us to enjoy.\n\r\nThis...is...necessary.  Life...feeds on life...feeds on life...feeds on life...feeds on THIS.\n\r\nWhy the dramatic pauses?  Why the repetition?  What is necessary?  That we must eat to live, certainly, and to do that we must kill...whether it be animal, vegetable, or even mineral.  However, I don't think this covers the full scope of what he's saying, or why he is saying it with such conviction, such rage, and such incredibly intent and directed fury.  Everything is necessary, hatred so that love can exist, lies so that truth can exist, and darkness so that light can exist.  Is it necessary because we need to recognize this is the proper way to think so we can set our rules accordingly?  No, it's necessary because the rules are already set.  We simply need to recognize them.  And with the level of adamant grasp on our pomp and importance that we all hold so dearly, someone needs to grab our collective and shake the shit out of it.  Hence the yelling, the repetition.  He doesn't want us to see, he is trying to force it because he's tired of being the only one that gets it.\n\r\nAs for the last part, I don't really find it's origin important at all.  If anything, I think it's an important illustration that who says it doesn't matter, it's the message that is important.  The belief that who says it matters is why a preacher can whip people into a carrot saving frenzy.  What, not who.  From musician, to congressman, to trash man.  Anyway, I think it's about a psychotic.  It's not a raving psychotic, though.  It's a lucid willful psychotic.  A man who believes he's fully recognized the reality of his world and his situation.  His situation being that we all are absolutely nothing.  We have no meaning, we have no purpose, we have no higher dogmatic law, and the things that control our actions are the same things that control gravity, molecular structure, and everything...everything.  As such, he has taken his place as an insignificant atom in our world.  As such, everything he sees is him...is his experience.  Blue is his color, he sees the blue and lets it wash over him so that he is his station in the natural order, a part of the sky.  It gives him a fullness of emotion in the same way that painters see sun rises.  He experiences every instance completely, and he has no hesitation, regret, or moral compass to guide him.  There is no morality when you are only an atom in a sea of blue, there is just blue.  The goo is most likely the ditch, and possibly blood as well.  The goo doesn't matter, what matters is that he doesn't care that it's anything other than goo.  He just wipes it off, sees the grass, and then he experiences everything that is green.  Completely seperate emotions than blue, but still an uncontrollable swirl.  The rest of the song follows the same guidelines.  His powerlessness to alter anything as he's only swirling in the maelstrom (nervous again, why did things always have to change).  Then trying to let his head come back as he couldn't remember things, he was lost in the sea, existing without conscious thought.  He's a willful psychotic, so he wants to feel all this, but he still tries to grasp frantically for any steering that he can. If God is our father, then Satan must be our cousin.  The way he is able to experience all of this so fully and feel no need to have a moral compass is because he has recognized that he is evil as well as good.  Not evil in the way you and I see that we did something bad, but then try to justify why we did what we did.  He doesn't justify at all, because evil is his heart as much as good is, and to him they are the same thing.  The car most certainly wasn't his, but to him, everything belongs to him and he belongs to everything.  The camera case caught his eye because it was abnormal.  It suggested an object that had a specific purpose in a universe which contains no purpose.  The people across the field are little because he experiences life fully in every single second, and at that second, they were little people.  Much like you crush someone's head at a distance.  They were his, and he belonged to them, as well.  He doesn't care which of them dies, him or them, because they exist just like him and none of them matter.  He's simply existing now.\n\r\nScary, eh?  That's how I see it.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nsorry if i am repeating others.\n\r\nthe second part of the song to my mind is probably discovering the world.  as it comes from our own very subtle mind.  ofcourse this would not stand true to all schools of thought.\n\r\n-peace\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nThe second part of the song means more to me than the first part, maybe because I'm not religous.  Anyway, I interpreted it as meaning as not a struggle between good and evil, but a coexistence of them.  I might be completely wrong on this, but the line about God and Satan solidifies my arguement.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI agree that Maynard is making fun of vegetarians.  But only because Maynard is struggling himself, trying to arrogantly defend himself.  Ohhh what about the vegetables, they feel pain is the typical frat boy male response to a vegetarian at dinner.  many vegetarians are that way because of the way factory farms which are corporate man-made evil structures.  Maynard should know better. !!\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI don't think that love has to do anything with this because reproduction and love are two very different things. Is rape love? No. What I DO believe is this:\n\r\nI think it's funny how this song perfectly describes the thought, \"Who are we? Of man, of flesh and blood, to determine what is good  and evil?\" When the preacher says his speech, when the crazy psycho talks, even when, \"This is nessesary!\" appears all describe that point of view. I think it is also important to note the song structure goes from one side of the scale of right and wrong to the other which I will explain later on.\n\r\nObviously the preacher in the beginning is chanting to his followers who respond with sheep calls. (Note: Bible frequently references Jesus's followers as sheep to his shepard, or God) So sometimes it's hard to determine who you are truely worshipping. God? Or some mortal that thinks s/he can damn/praise anything evil or good.\n\r\nThe middle, where the chanting begins, reflects the harsh reality of the world. The dog chases the cat, the cat chases the mouse, etc. The reason for the chant is because it shows the harsh world turns, survival of the fittest. The reason for the gritty sounding clockwork supports this too; as the world turns, like clockwork.\n\r\nWhen the psycho talks, he takes this view to a harsh extreme. To the point where there IS no God because there is no good or evil. Therefore, no reason to have morals. Everything is his because he is simply existing (like previously stated). Now I'm probably going to contradict myself here, but this last part still vexes me like it does to most of you. Who said the person in the story killed anyone? We only assumed it... why? To answer this, I think we need to look at what we associate the color red as. Most consider it a color of rage, fury. But if that's the case, what do the other colors represent in this story? Why is he trying to get the goo off his hands by wiping them on the green grass? What does the green represent? When he looks up into the sky, what does the blue represent? Just some things to bring into light.\n\r\nAs far as song structer... this can go with Part A (Being the fenatic preacher) Part B (Being the chanting) and finally Part C (The \"psycho\") Part A establishes a solid foundation that states, \"We can't claim what is good and evil because we are not God.\" Part B establishes harsh reality that it is a survival of the fittest story of life; hence life is death and death is life. Part C Shows the opposite side of the spectrum. The side that claims that since we can't establish what is good and evil, good and evil can't exist. This further explains that there is no moral value to life because morality is determined by what is good and evil. It is also important to note that this also fortifies what I previously explained. Since we don't have all the answers, we cannot claim that there isn't a good and evil ether. Ultimately, we have to arrive somewhere in the middle; realizing that, since we are mortals, we can't claim what good and evil is moreover, even exists. But we can determine that life and death is harsh but nessesary.\n\r\nOff topic:\r\nAs far as if there is a God, I like to reply with this message, \"There is a definite possiblity of a divine being because we can imagine it, unlike a squared circle. Since we can imagine this divine being to be great, chances are it will be greater.\" -Can't remember who said it, not me.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI like the landlord story. It was eerie and made little to no sence with the whole \"That made {color} be your color\" stuff. The middle part is self explanitory, in the natural world, animals eat other animals, and despite what a lot of people seem to think, we're animals. Its survival. I think it may be more metaphoric We \"kill\" others to get a head (think of a videogame for that expampe). Or do something like lie or steal. But, I'm 15 years old and hopped up on something right now, so don't be mad if I'm wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI dunno about the second half. thats beyond me at this time of night. but the beginning is really cool. a satyrical look at militant vegan hippies!! (told you I was tired). ppl who go vegan or vegitarian because they dont like animals being killed. living things being killed. the song is just drawing a parallel from one or 2 steps down the food chain. plants, carrots are living things too. the carrots are being hunted down slaughtered, mercilessly eaten alive by the rabbits. Its necessary. its a FOOD CHAIN. Life feeds on life, which in turn feeds on life. havent u seen the lion king?. living things eating living things to survive is a natural process. just watch the discovery channel.\r\nif you only eat things that have died naturally, then, naturally, ur gonna die pretty soon too. \t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nI didn\\'t Fight my way to the top of the food chain to not eat meat\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\n\"Disgustipated\" is actually not even a word in the english dictionary... \n\r\nIt's a combination of two words... \"Disgusted\" and \"Dissipated\"\n\r\n\"Disgusted\" means one of two things...  \n\r\n1. Offended by the taste or the moral sense of\r\n2. To excite nausea or loathing in.\n\r\n\"Dissipated\" can mean lots of things... \n\r\n1. Intemperate in the pursuit of pleasure; dissolute. \r\n2. Wasted or squandered. \r\n3. Irreversibly lost. Used of energy.\r\n4. To drive away; disperse. \r\n5. To attenuate to or almost to the point of disappearing. \r\n6. To spend or expend intemperately or wastefully; to squander away. \r\n7. To use up, especially recklessly; to exhaust.\n\r\nSo, I guess \"Disgustipated\" would mean something like this:\n\r\n1. Moraly exausted or sickened to the point of leaving and abandoning one's faith.\n\r\n2. Offended morally to the point of one's faith being exausted and squandered away so that they are driven away from it.\n\r\nBoth of these definitions would fit the song's general theme perfectly...\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\n---\r\n\"Even after all that, though, I think Maynard laughs himself to sleep thinking about how stupid f##ks like us think about his combination of random thoughts at 2AM. The speech could very well mean nothing at all.\"\r\n---\r\nI think that is probably fairly accurate. Whatever it means, if anything at all, it sounds great.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThe quote was from Fruaght, btw. Forgot to include the credit.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI think the second part of the song could be his landlord, like trying to be a smartass, stereotyping Maynard, insinuating that all he does is get drunk and high and pass out in \"the ditch\", which could be outside or just referring to his home or bedroom, but i think it would be outside for the way he speaks, looked up and the sky was blue just like you, because now your out of your house, for good, not sure bout the knife, but the goo makes me think maybe he was fixing a pb&J sandwhich and passed out, then he talks bout his head, more insulting bout being a dumb pothead or drunkard or something like that, \"If god is our father...\" that part i think is where the landlord probably didnt really agree with everything maynard sung about, such as how stupid christians who follow blindly and all those great kind of tool songs, and another insult would be why didn't anyoneelse get it, kind of saying your dumb and dont make sense, then he mentions the new red car to kind of say like watch your money cause the way your living your goin to end up broke, and yeah i could be totally wrong but um... maybe yall could expand or debate this\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nYou're all over anylysing this. The screams and cries that he hears are from the carrots. It's nothing metaphorical. The first paragraph it's pointing out that everything has a right to live, even carrots and other produce which we \"slaughter\" on a mass scale to cater for human needs. Maynard just assumes the role of a religious man claiming to have shown this revelation by god.\r\nAs for \"this is necessary\"; it's just Maynard speaking for himself saying that killing plants and animals for survival is necessary. \"Life feeds on life...\" is just an elaboration on his point.\n\r\nAz Iz actually has donated some fact into this with his definitions of \"disgusted\" and \"dissipated\". However, I think that there is a more likely definition which helps support my theory.\n\r\nDisgustipated - Disgusted in the spuandering, wastefullness or misuse of produce and resources.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nWhy don't I hear the answering machine message part?\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI think the general meaning of the first part is that the masses are too willing to accept ridiculous ideas in the name of religion. Thus the sheeps bleating.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nAnd he brought me into a vast farmlands of our own midwest. And as we descended, cries of impending doom rose from the soil. One thousand, nay a million voices full of fear. And terror possesed me then. And I begged, \"Angel of the Lord, what are these tortured screams?\" And the angel said unto me, \"These are the cries of the carrots, the cries of the carrots! You see, Reverend Maynard, tomorrow is harvest day and to them it is the holocaust.\"\n\r\nIt is clearly about animals being tortured.  It is the holocaust to all of the animals who are going to be killed for human consumption.  and i think the last part of the song is about hunting.  Like a deer or something.  It's their woods and they see people and they kill them.  \n\r\nI would also like to comment on   by kroche14 on 07-10-2002 @ 10:50:25 PM\r\nPeople who claim to be vegetarians will not eat meat because the believe it is wrong to kill animals. \"Why,\" I once asked a friend who was vegetarian.\r\nShe responded by saying that, \"It's wrong to kill animals.\"\r\n\"So killing plants is okay?\" I said.\r\n\"It's different. Plant's don't feel pain.\"\n\r\nMy point in telling you this is that even though things don't feel pain does not justify an action. If you refuse to eat red meat because you think its wrong to kill something, then you shouldn't eat anything at all! Eating fruits and vegitables are the same thing because they are living organisms just like any other living thing. \"Life feeds on life....\"\n\r\nI am a vegan and i disagree with you completely.  Eating an animal and eating a plant is a completely different thing.  It always annoys the hell out of me when people say things like that.  plants do not have a brain nor do they have a central nervous system.  therefore, they lack a consciousness.  Plants are living, yes.  But not they same way animals and human beings and fish.  Plant's cannot feel any pain the way animals do, that is why it is morally wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\npeople should stop dissing vegetarians. im a vege but not cos i think its cruel to hurt animals or any shit like that, its cos i dont consider myself better or above animals. maybe most jack arse gangstas or emos though\r\nhave you ever noticed we have herbiverous teeth? anyway, im not trying to convert anyone, and i also hate vegetarians who do that. let people have thier own mind!!! \n\r\nill finish my ramble by saying sorry about the ramble and great song by the way\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nin the last part of the song he ses\r\n\"Oh Lord, why did everything always have to keep changing like this. You were already getting nervous again.\"\r\nwhat is he getting nervous about?\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nthemadwookiee\r\nu mite have to wait a while for the last part of the song to come on. its after a bit of silence, after the life feeds on life part and some cricket sounds. u could just fast foward the song, but that ruins the whole thing for me\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI thought the crickets where supposed to set the mood for the second part... like the things you would hear were you really in a forset. Then the guy starts talking... like narrating what you see.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nIt seems the first and third part of the song are opposites; 'And the angel of the lord came unto me, snatching me up from my place of slumber.' Compared to 'It was daylight when you woke up in your ditch.'\n\r\nMaybe it has to do with the constant illusion of Human beings, part one could be the illusion, but what is really happening is part three; in which we can interpret as being our animal state, we feed on life, we are essentially beasts.\n\r\nOh, and the 'baaaaaaaaah'ing of the sheep helps bring out the satire. :P\n\r\nGreat song.\n\r\n(Not sure if anyone else posted this, too lazy).\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nLots of accusations of hypocrisy being directed at the practice of vegetarianism on this board. \n\r\nA few things ...\n\r\nCountering a vegetarian's argument that killing animals is wrong (when not necessary for survival) with \"well, vegetables are organisms, too,\" is a non-starter. And anyone who posts it, knows it.\n\r\nWe mammals have the capacity to feel pain and can empathize with a fellow mammal's such feelings. (And it can be authoritatively stated that mammals at giant factory farms suffer incredible pain and misery.) We don't, however, have any conception of how a plant \"feels\" when its life is extinguished.\n\r\nMany vegetarians adopt the way of life because they don't wish to consume what is not necessary for survival, but also because they refuse to impose their will on other salient beings. This last point is key.\n\r\nAnd while Tool is (probably) using the harvesting of carrots as a metaphor for a perceived hypocrisy of vegetarianism, one wonders about the band's credibility on this subject since the narrator in Prison Sex has clearly had his will imposed upon and is the worse for it. In fact, humankind is the worse for it -- which is precisely the vegetarian's viewpoint.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nI'm actually a vegetarian and I still like this song... I don't think it disses vegetarians as much as it disses animal rights activists who actually encourage people to be vegetarians.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nHow is someone talking about abortions? This song is about black and white. You need black for there to be white. You need evil for there to be good. This song satires religion on how it tries to make everything white. You can't take away a piece of a castle and expect it to still stand. \n\r\nAs for the second part, if it is the answering machine thing. I'm guessing the guy was making a poor attempt at acting like he knew something everyone else didn't. Anyone can babble on about nothing and sound intelligent if no one knows what your talking about.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nThe famous landlord is the leader of Green Jelly, with whom Maynard lived at the time. As he's a writer, he must be reading one text he wrote.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nAhem.\n\r\nWell, being a vegetarian I can certainly say I don't find this song offensive.  I think it's less about bashing vegetarians than about bashing the whole self-righteous mind-set, that we are above any other living thing in the universe.  This idea is reiterated in \"Vicarious\" from \"10,000 days\" when he says, \"The universe is hostile, so impersonal: devour to survive. So it is, so it's always been.\"\r\nLet the rabbits wear glasses!\r\nWhat does he mean?  It's pretty ridiculous to think of a rabbit wearing glasses. But it has to wear glasses now because it won't eat the carrots... because it doesn't want to hurt the carrots.  But is that any more ridiculous than say, a monkey or an ape wearing glasses? What about a human? How different are we from monkeys?  A couple of dots in the genetic code, that's about all. How far are monkeys from rabbits?\n\r\nWe all live in a circle of life.  Everything that lives eats something that lives.  It's the nature of life.\n\r\nVegetarians, hmm, yes... There are many self-righteous vegetarians... but there are also many self-righteous meat-eaters.  There are plenty of self-righteous people all over the world, who justify their actions by saying, \"X is ok because Y.\"\n\r\nIt's ok to eat animals.  It's ok to eat plants.  It's not ok to tell others how to live their lives.  The concept of \"right\" as it is defined in modern constitutions all over the world is a new one.  Humans don't have rights any more than the carrots do. The only reason we think humans should have rights is because we are human.  As the focus becomes wider, so too does the generalization.\n\r\nWhat's more important? A carrot's right to live, or a rabbits right to eat?\n\r\nMaynard never gives us answers; no literary geniuses do.  He just raises questions.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\ni'm not sure what the end of it means but it's definitely a good song to listen to when you're stoned. the first time i get REALLY high we were in my friends woods in the middle of the night and then we got back in the car and listened to this song and we thought crickets had got in the car. then when he started talking about the red car we thought he was talking to us because we were sitting in a red ford focus. SOOO... to make a long story short.... get stoned then listen\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nSOOO FUCKIN TRUE ...\r\nALL LIFE HAS A CONSCIOUS!!!\r\nANYTHING THAT DOES NOT LIVE DOES NOT HAVE A CONSCIOUS... \r\nWHY DO YOU THINK FLOWERS HAVE ADAPTED TO BEES COLLECTING POLLEN FROM THE CENTER OF THE FLOWER???\r\nEVERYTHING FEELS PAIN. THEREFORE ALL LIFE ON EARTH IS ONE CONSCIOUS AS BILL HICKS SAID.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI allways thought this was religious.\r\nI thought it was about the way that people that go to church will just belive anything, which is why there was all of the baaing (you know, the whole following like sheep and the lord is my shepard thing). I allways considered it a satire on religion as well as political correctness, but that is just me.\n\r\n(Oh and when they said Reverand Maynard I actually went LOL because I just thought that was funny and i am easily amused.)\n\r\nOh and I never understood why there are 10 minutes of crickets or what ever! I thought my CD had broken actually lol!\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nWhen I was 15 years old I used to cut grass for an elderly woman who lived near me.  I would ride my bike to her house twice a week.  She had a riding lawnmower that I could use.  She had an old farmhouse with an old barn.  It would take me a good two to three hours to cut the lawn using the riding mower and then going around the trees and such with the push mower.  About this time I had been listening to Undertow over and over again.  I figured there was some sort of defect with my CD player because after \"Flood\" the tracks simply started rolling over one after the other with nothing playing.  As I sat in my parents garage one rainy summer day rolling joints with a friend I did not get up to restart the CD after the \"Flood\"...That was when I discovered \"Disgustipated\".\n\r\nIt came on as like in a dream,\"And the angel of the lord came unto me, snatching me up from my place of slumber.\" The entire carrot holocaust was a hilarious concept.  O the horror of the carrots!  How funny!  Then the reality that \"Life feeds on life...\"  Those words spun through my head as I rode around on the mower on those summer days.  Then the daydreams began.  I imagined going into the house and striking the old lady with a frying pan while her bedridden husband sat helplessly watching me destroy his home.  \"This is neccessary..\" chanting in my head.  Of course this gave way to much darker thoughts which eventually manifested into one concrete eduring vision.  The following is the enduring vision I have constructed after continual careful examination of \"Disgustipated\"\n\r\nI am older now.  Through much trials and tribulation I have achieved a level of affluence very few people have ever known.  My possessions are many, my friends are numerous, as are my enemies.  All of the success I have found was brought by my design.  By reading and understanding the behavior of people.  By using the Gifts given me by God.  By playing the games.  I have constructed for myself a Manor of exquisite beauty and amazing architecture.  Every smallest detail has been looked after.  The Spanish marble on the floors, each stone hand-picked for its design and color, the hand carved wood trim made from trees hand-picked from the Amazon jungle, the shape and location of the windows so as to illuminate certain pieces of art on specific days of the year, all of this by my design.  As a celebration of excess I hold a gala.  I invite heads of states, princes, sheiks, CEOs, and eccentric billionaires.  But I know they are all phony.  They smile in my face when it benefits them, they stab me in my back when there is gain to come of it.  Of course, this is all part of the game. It is the game that excites me!  Bringing a man to hand over, willingly and enthusiastically, his time and possessions by my mere words, that is the reward.  My gala is the endgame.  I am so excited because I know what lies in wait.  I have specially constructed my home for this event.  Everything I have done to gain wealth and power leads to this.  The main ballroom of the house has 64 ft ceilings.  It is a rotund room with 6 doorways and two grand stairwells leading to a balcony which overlooks the dance floor.  In the center of the floor is a greenish circle with a green ray leading to each doorway.  The room has been built so that the floor can be lowered and the center circle can rise like a spire.  As my guests come in, with all the etiquette and diplomacy they can muster, they will congregate in the main ballroom as they await the host. Mel Brooks said the difference between comedy and tragedy is that a tragedy is the bad stuff that happens to you, but if it happens to the other guy its comedy.  This was definitely one of those times.  As all the guests stand waiting for the host, the lights go out.  Metal blast doors drop in front of each doorway as the floor begins to slowly sink.  Then it begins, strobes and police lights begin flashing and I rise up from the center as the floor drops below me.  I have a full leather body suit with mask.  \"Life feeds on life..\"  begins playing at deafening levels.  I carry an oversized mace that begins swinging and randomly striking through skull and brains.  Screaming and agony are all that is left for those below.  Then the floor begins to retract into the walls.  Bodies plummet into a pit laden with 4 foot sharpened spikes.  And mingling between the spikes are starving warthogs.  The whole time \"Life feeds on life...This is neccessary...Life feeds on Life feeds on...\"  I stand in the midst vicorious among them all...\n\n\n\r\nThen I wake up in my ditch...\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nBASICALLY THE TRUTH IS EVERYTHING AND ANYTHING THAT GROWS HAS A CONSCIOUSNESS, even plants feel pain. Why do you think Roses grow thorns on their stems??? They too have a subconscious adaptation to struggle just like every other animal on the planet.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nThe part after the crickets = Maynard had a buddy that would leave messages on his machine... Weird creepy messages. This is but one of those messages. Maynard, being a sick twisted man =) used it in his song.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nFUCK I BLEW MY SPEAKERS ON THIS SONG ... \"LIFE FEEDS ON LIFE!!! FEEDS ON LIFE!!! FEEDS ON LLLLLLIIIIIIIIIIIFFFFFFFFFFFFFFFFEEEEEE!!!!!!!!!!!!! *BANG* fuck I love that part.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nLOL\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nAbsolutely horrible. Worst thing the band put out until 10,000 Craps. Not only is his sermon flawed in so many ways, the whole \"life feeds off of life\" is wrong. Life feeds off the sun, which sets into motion a butterfly effect. \n\r\nTo add to the horror show, his lyrics make no sense here going from bad analogies to just randomness. Maynard might be the worst lyricist to exist.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nI think the first part is about how some ideas people preach can be so ridiculously foolish. Donâ\u0080\u0099t eat the carrots! Donâ\u0080\u0099t eat the carrots! They have feelings! I saw it in a dream! And you know that some John Doe dumbass is going to start a religion that bans the eating of carrots or any other vegetable with â\u0080\u009cfeelingsâ\u0080\u009d. And then thousands of mindless followers are going to flock to the Church of the Carrot. Pathetic.\n\r\nThe second part was indeed left by his landlord, but Maynard put it in for a reason. Itâ\u0080\u0099s up for interpretation. I think itâ\u0080\u0099s about how the preacher probably went out and snorted cocaine while he boned a prostitute. He wakes up in a ditch next to the road and refuses to acknowledge the truth of how he got there. It just happened. Remember kids, heâ\u0080\u0099s divine. He does no wrong. And thatâ\u0080\u0099s exactly how he sees himself, the arrogant ass. And because of that divinity, everything he sees is his. The color blue is his, the color green is his, the color red is his, and yes, all the people on the earth belong to him. \n\r\nI think the song is more or less a jab at religion like you find in other Tool songs. It tells the all too familiar story of a person starting a new religion, the millions of sheep getting in on it, and the uncovering of the leaderâ\u0080\u0099s true, immoral behaviors.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nI can appreciate the religious references, but I think its a little  simpler: It's simply about the fact that we eat other animals \"life feeds on life \" and \"this is necessary\" as it is (for now)so in Maynards own way this is a critisism of vegatarians...we eat meat...carrots are a metaphor referencing meat and the sounds are the same as what you would hear on a butchers block as the flesh is choped up. just a thought.  \r\nnot every song should be interpreted as a reflection of Maynards dislike of religion . eh...possible you think? that direct\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nIts wrong\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nwhats wrong?\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nFunny how Maynard acts like a God and yet condemns such a notion\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nTwo words guys, animal liberation.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nSnake Doctor:\n\r\nAbsolutely horrible. Worst thing the band put out until 10,000 Craps. Not only is his sermon flawed in so many ways, the whole \"life feeds off of life\" is wrong. Life feeds off the sun, which sets into motion a butterfly effect. \n\r\nTo add to the horror show, his lyrics make no sense here going from bad analogies to just randomness. Maynard might be the worst lyricist to exist. \n\r\nallright, everyone agrees snake doctor is a dick?\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nNot a dick; Just completely ignorant and lacks knowledge of any kind.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nI think it's about abortion.  Embryos as equivalent (in terms of sentience) to carrots.  Christians see it as a holocaust:\n\r\n\"They have a consciousness, they have a life, they have a soul!\"\n\r\n... and some resort to either extraordinarily ridiculous and failure prone demands (eg: rabbits wearing glasses, teenage abstainance).  When that fails, violence erupts (eg: abortion clinic bombings) and whatever message of good in religion is lost in the fervor (\"this *bang* is *bang necessary\") as great harm is done.\n\r\nAt least in my interpretation, it seems as if the preacher and followers are shooting at the rabbits to protect the carrots, doing harm to a greater sentient being to protect a lesser one (if even sentient at all). Christian dogma (though not all denominations(sects)), for example, holds that under no circumstances, even to save the life of the mother, may an abortion be performed.  They also feel those single-celled embryos on ice are little human beings, and that experimenting with them is genocide (hurting those who are sick).  Sadly, those very same idiots also run our government.   Regardless of what people feel about abortion, banning it (as many pro-life Christians would like to do) would result in back-alley / coat-hanger abortions which could very well be lethal.\n\r\nIt's important, also, to distinguish between most Christians and the real  wack-job fundamentalists (as should be said about any religion).  And this comes from a person who has a LOT of reason to be bitter against Christians.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nSometimes I like to listen to the second half of this song at night. It's really creepy, I thought it was a spoken excerpt from a book or something.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nI think the song is about how everything in this world has life. the carrots, animals, plants, etc. \"life feeds on life\" means that in order to survive, we must feed off of other life. such as vegetables, meat from animals, etc. it shows how beastly we are as humans, but we really have no choice. because we must feed on life to sustain our own life. he is disgustipated by this and that there is no way around it.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nThank you psycho landlord...\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nI always considered the second part from the landlord almost like someone standing there talking to god, coming to terms with him and actually having a human have a conversation back to him, as if god had a well known friend and for the first time the friends telling him how confusing he made things. Everything is referred to as \"you\" or \"yours\" meaning it was as though it was something created and the colors represent the difficulty of taking things in on  some kind of drug binge or stress, a stress that god or creator would have and the people being his in the end..and finding the two people walking outside of the woods..could they be walking outside the woods of 'human nature' where evil naturally unfolds, the core of becoming a \"beast\" \t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nSometime a cigar, is simply a cigar\n\r\none point i heard though, its a gruesome metaphor for canibalism, just think about the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nSometime a cigar, is simply a cigar\n\r\none point i heard though, its a gruesome metaphor for canibalism, just think about the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nThe first part is Maynard basically saying \"fuck you\" to vegetarians. \n\r\nThe second part is indeed a story that was left on Maynard's answering machine by his landlord. I think it even says this in the album liner notes, but Maynard has confirmed this multiple times both live and in interviews.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nThe second part of the song, I believe, is a mumbled reference to Shakespeare's Macbeth when it speaks of \"colours,\" i.e. \"that made your colour blue.\"\r\nIn Macbeth, after he [Macbeth, the character] has just murdered the king; Lady Macbeth speaks to him \"You must wash your hands, you must get the blood off\" (if you were to translate it to modern english;) which she follows with [direct quote] \"or your colour will be red.\"\n\n\r\njust a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nwith and without consciousness\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nJust one thing to say...\n\n\r\nSnake Doctor.\n\r\nYou're a fucktard. Get the hell off this page.\n\r\nGo shove a dick up your ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nBAHAHAHAHAHAHA!!!!!!!!!!! SNAKE DOCTOR,  YOU LOOK LIKE A FUCKING FOOL! HAHAHAHAHA.  I qoute\" not only is his sermon totaly wrong in so many ways.\"  wow are you fucking retarded?  the sermon was a joke,  satire.   snake doctor is sitting at the computer thinking to himself, \"wtf? let the rabbits wear glasses?  this song doesnt make any sense! rabbits can't wear glasses! can they???\"\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI also agree on the satan brother thing.  and this song would be perfect to listen to before an all out battle royale!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nyaaaaa test\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nSounds crazy but i think this song is about aliens. when he says angel of the lord hes really talking about an alien. he than calls the humans carrots and its harvest day. then he says let the rabbits wear glasses, saying dont harvest the 'carrots' use your own technology to get what you need. kinda farfetched but its makes a little sense especialy since tool is interested in aliens.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nI believe this song says \"idiots! we're animals, whether you like it or not!\" \r\nUsing religious satire and talk of vegetarianism, Maynard speaks of how people pretend that they are something they are not, and try everything in their power to deny it. It is about people not accepting reality and using tricks to convince themselves of something untrue.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nI think wilcodude has hit it on the dot. Maynard, I think, tries to push peoples buttons in order to make themselves realize who they are.\n\r\nmy cousin tried to explain this song to me. What he said was that the begining is an interpretation of what we are now. We use to be sheeps but now were carrots. I know it sounds a bit on the whoolulu side but think about it. If God is our sheperd then were the sheep. But when we displace ourselves from religion we ourselves become carrots. Meaning we help each other see the truth that we most of do not see.\n\r\nAs for the ending I believe it ties to the crickets. The long cricket sound is suppose to put you to sleep. Or at least long enough to put you in a sorta trance. So that way when the message comes in you can sorta experience a kinda of eye opener to the fact of an illusion. The illusion that we are alone. But at the same time a Higher Power must be held true in order to become a life feeder and eater. As the song goes:\n\r\nLife feeds on\r\nLife feeds on \r\nLife feeds on Life\r\nThis is necessary \n\r\nIn other words The Cycle Of Life and how it grows beyond our own expectations\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nto me its about the savage nature of this material reality.\r\nthe second part, pay attention to YOUR car YOUR grass YOUR forrest.\r\nto me its about the divinity of humanity and animality and vegetaion. life is consciousness\n\r\nwhere did you guys hear that landlord bullshit?\r\nits probably a lie.\r\nyou know that tool is constantly making shit up in interviews and on their website, because they think its pathetic how people always need a meaning, a biography, something concrete that they can cling to.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nI always took the first part to be a dig at vegetarians in that it is really ridiculous to differentiate one kind of life from another.\n\r\nEverything is alive, including carrots, so why do vegetarians think that destroying one life to sustain your own in one instance is okay (vegetables) but in another instance is wrong (meat).\n\r\nIf the right thing to do is live without destroying other life humans should only eat rocks!\n\r\nIMHO it is a bit of a laugh at how ridiculous and non-nonsensical the vegetarian stance is.\n\r\nThe second part is a continuation of the first part.\r\nThis is necessary, life feeds on life.\n\r\nHumans are nothing but educated animals and we need to consume life to live. It is necessary.\n\r\nIt is a belief of mine that there is only a certain amount of 'life-force' in the universe, and for one thing to have more life force it has to take it from another thing. By eating life we gain the life force contained within.\n\r\nIt is like the thing about energy that is, I think, pretty much proven.\r\nEnergy never goes anywhere, it just changes form.\n\r\nThe energy from the sun comes down to earth and helps a tree grow. If you take a piece of wood from that tree and burn it, the energy from that wood doesn't go anywhere, it changes into light and heat. The light and heat changes into something else ad infinitum.\n\r\nThe crickets I think is hint at the fact that we are all part of nature.\n\r\nThe last part always confused the hell out of me.\n\r\nJust sounds like insane stuff. Like a monologue expressly designed to screw someone's head up while making absolutely no sense.\n\r\nIf god is our father then satan is our cousin makes sense.\r\nIf we are the children of god, then satan is our cousin because satan is another of gods children, a fallen angel. Not like us but still related.\n\r\nLooking at it again I find myself agreeing with other posters. It sounds like the definition of schizophrenia or some other kind of psychiatric condition, probably homicidal.\n\r\nA man who loses control and wakes up in stange places after a blackout, a man who believes everything belongs to him but doesn't know why. A man who gets angry when other people use his things.\n\r\nExamines just how scary a mental problem can be and how the homicidal maniac can be a scared and confused by his actions as the rest of us.\n\r\nOr it could be a load of crap someone made up to get people like us debating over it's meaning for years and years to come.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nAbout the second part I'm not for the alien abduction theory. It just doesn't feel right to me. Here's what I think:\n\r\nHe is someone (or something?) who tries to blend (when he looks at the sky, blue is his colour and so on), to go with the flow, so he doesn't think very clearly (maybe he can't anymore...the headache?). Submerged to somebody else's way of thinking (the preacher) or to his instincts. And his instincts are to kill. (it's necessary, the circle of life).\n\r\nI also thought of The Lord Of The Flies when I first heard this song. Either by blindly following the faith or by letting your nature guide you, you can lose your ability to reason, that's the moment you become an animal.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nI hate when i see something like this on this site,that's not a meaning,but i think that this is an interesting fact about this song... \r\nIf anyone likes playing with sound-forge or any program for music production,give this a shot... Play the song backwards,and have some fun in removing the hums,clean the channel,and so on and on... And you will hear maynard saying something in english(you can clearly hear that it's english),but you wont understand him,except one line... He says:\r\n\"Lord told me that shooting in the vein is rational\"...\r\nKinda creepy...:P \r\nHave fun\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nThere is a philosophy, I can't recall where it comes from, but it says that good and bad are subjective, meaning they are defined in the eye of the beholder.  So in a way those who say this is stab at vegetarianism may be right.  The point being that it is not bad to kill and eat something.  It is how things are.  THIS IS NECESSARY, Life feeds on life, feeds on life, feeds on LIIIIFFEE.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nthe 2nd part\n\r\nI always thought it was about a guy, who ate too much acid, killed a bunch of people, blacked out, woke up in a field covered in blood, saw a car, saw some people the car belonged to, needed a ride so hes going to go kill them and get the keys, and possibly take their camera. \n\r\nallot of the times I was on acid, real acid, I would get emotions tangled up in colors. I would also blackout due to adrenaline overload and wake up outside with a headache...then the nervous waves of adrenaline would start coming back and would start tripping again before I fully understood what happened. \n\r\nthats just my take on it. If that is Maynard's landlord saying those things, which I doubt it is, then I would consider moving. lol\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nApologies to anyone tnat suggested this or something like it- I haven't read through all the comments.\n\r\nIt occurs to me that at face value, the song may be roughly describing how a farmer/pastor kills everyone in his barn/congregation.\r\nThe opening wackjob sermon, then the rising music under it which swells into a pounding drum beat- he's losing control to his inner nature.\r\nI think he does it with a gun, btw; you can hear a gun being cocked right before the big drum hits during the verse after the second pause.\r\nOf course, there's the sheep following religion blindly and accepting everything their 'leader' says as truth.\n\r\nGiven the ambient noises, the music, and the lyrics, that's my basic theory. It's waaaaay too early for me to go into detail. Anyone else agree and wanna flesh this out?\n\r\nAs for the speech at the end, I think it's a second person monologue of the aftermath. The goo may refer to the blood all over him, his head ringing and empty because.. Well, I imagine your head might hurt after a bloody rampage like that. :P\r\nThe 'immediately taking possession of all he sees' aspect does make sense, so I'm starting to think that he's becoming locked in his insanity at the end of the monologue. It mentions a knife though, but the song seemed to me like he used a gun, so I don't know what that's about. Anyone know?\r\nAs for the little people, they're little because they're off in the distance and yes, he's probably going to kill them.\n\r\nIt's a pretty basic explanation and I'd appreciate it if anyone attempts to flesh it out or correct me (Politely correct me if you're going to. I don't need some retard telling me not to take it at face value. I only put my face value interpretation up because I agree with most of the ones that talk about the deeper meaning.)\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nI drink coffee every morning with Bill. He was just drunk and rambling. By the way, he sold the plat record for 10 bucks.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nThe first part can be about how ridiculous dogma is, religious delusion, or just that 'this is the way of the world.' There's a couple things you could pull outta the first verse, it's pretty straightforward.\n\r\nSecond part is major serial killerific. To me, it seems like the person is talking to himself, as if there's separate parts of his conscious. I see a person who does horrible things, but separates the evil he does by way of the 2nd person. A person with one complete mind would have to come to terms with what they did, while this guy is just concerned with waking up groggy and oblivious.\n\r\nHe wakes up, covered in blood and with a knife. A normal person would first think 'holy shitballs, what have i done,' then probably figure themselves to be a werewolf... with a knife. This guy just wakes, looks around, wipes off the goo.\n\r\nI think the colors refer to emotion. He looks at the sky, and sees blue. Blue is the color of calm, and calm is how he acts, which is the complete opposite of what you would expect, another hint of psychosis.\n\r\nHe wipes the goo on the grass, and green is now his color. Green is the color of nature, jealousy, greed and discord. This is reflected in his disorientation, and also in his possessiveness... of everything. He sees the car, and now it's his.\n\r\nHe notices the people in his woods, and now his color is red like the car. The color of rage and anger, and blood. The cliche 'seeing red' comes to mind.\n\r\nI dont think those little people are aliens. You could interpret it in 2 ways. The guy is some psycho who thinks he's god, the universe belongs to him and all the creatures in it are inferior to him. Total narcissist, psychopathic serial killer personality. Or, the first thing that came to mind was just that they were off in the distance and the fact that they are \"little people\" just shows his state of mind. We wouldn't say someone who's far away is little, we'd just say they're far away. But this guy is irrational and the fact that there's a great distance between them doesn't register with him. He sees the world differently, so they aren't far away, they're little.\n\r\nAnother clue about the serial killer is the fact that the 2nd verse isnt negative at all, despite the evil he's done and will do. It's just descriptive, as if the man has no moral compass and can't distinguish between right and wrong.\n\r\nOr he was high on shrooms and woke up covered in cow shit. Then went to rob the car, but saw the people and decided to trip with them. That's probably it.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nok so it seems like the first part of the song addresses the fallacy of religion.  People follow religion like sheep, not stopping to think about how ridiculous said religion's claims might be.  The second part of the song, while I will acknowledge is probably a message left by the landlord, I have another theory about also.  It seems to be a parable of sorts about a person being born into this world as an adult.  He wakes up poor (in a ditch) because when we come into this world we have nothing.... except that we are equipped from birth with weapons and the capability to hurt others (the knife).  He's covered in goo because when we are born we're covered in goo... probably the clearest indication, to me, that this is a metaphor to an adult being birthed.  The first thing he sees in this world is the sky, so he claims it as \"his\", partly because children think of everything they see as theirs, but also because people seem to think they can own everything, even the sky.  ditto the part about the grass.  He climbs out of the ditch and goes along a road to his car.  To me this kind of seems to symbolize the journey of life.  There is a camera in the car to symbolize how most of us are just spectators who go through life watching everyone else do stuff for us.  The people he sees near \"his\" woods (ditto as the sky and grass) are his parents, and he's trying to escape them in the car on his own journey of life, as many of us do.  This story just seems to be trying to pick out every shortcoming of the human race in a few short passages.  IDK, i'm probably wrong, but that's just what it means to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\noh and it just says \"bill the landlord\", not \"bill maynards landlord\"... just thought i would add that in\n\n\n", "comment_140": "\nThis song shows how easily as humans we r to blindly follow the words of a sheppard such as a pastor no matter how rediculous the words are. The angle came in a dream and told him of the carrot harvesting, let the rabbit wear glasses, then the pastor believes he understands this dream and preaches to us how we should save the carrots. Its just another anaolgy of how we r sheep and need to realize that life has a natural course whther its good or bad is irrelvant... What's bad to one person is normal to another. We need to realize that there is no dogmatic law, we need to do whatever we need to do to survive... This song is versatile and means different things to different ppl... But pls, don't just make a conclusion without thoroughly interpretin the song... It is absolutley not about animal liberation... Death and hunting is natural. Try to understand the \"circle of life\". And ppl... Start to question things more... Oh and BTW, I DON'T believe spoonfeeding enlightenment to ppl is the way to do it... Ppl need to contemplate things and discover things on their own... Then they will truly see...\n\n\n", "comment_141": "\nthis song represents one of my strongest daily thoughts.  Golding (author of Lord of the Flies) came off as religious himself though.  We must accept that we are simply animals with highly developed brains.  we all feel the need believe in any higher power. \t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nlets shoot some pianos?\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nThe song is definately about religion, however, I think it's about more than that aswell. for example, Life feeds off life feeds off life, if we take all the carrots away then all the rabbits die (which is the reason for the sound of the dying rabbit). and if we are killing the rabbits, we might as well just shoot them with a shotgun (hence the shotgun sound).\n\r\nOH! and also, if you play the track backwards from the start of the crickets, Maynard sounds exactly like hitler speaking german yelling at troops (IMO). So then the carrots could represent jews (Which also links to the holocaust). The sheep could represent Nazis blindly following hitler. Let the rabbits wear glasses could be saying that the nazis should have just dealed with it.\n\r\nAnd if life feeds off life than we should just deal with the insect in the corner of the room without killing it (Hence the 7 minutes off insects)?\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nWhen you play it backwards \"This is necessary\" sounds like \"We are nazi\" lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\n\"The cries of the carrots!\"\n\r\nFriggin' funny XD\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nIf you notice, the animals you hear at first are sheep, and calling people sheep is calling them people that do what people tell them and don't think for themselves. When the man speaking at the beginning is talking about religion, the sheep are quiet. They are listening. When he says \"Can I get an Amen?\" the people say Amen, or, the sheep baa. When he says \"Can I get a Halelujah?\" The sheep baa again. \n\r\nThe last bit I don't get as much, because it can mean a million different things, but here goes. I think basically it's someone that wants everything to be his. When the song says \"Now this is your color\" it might mean the color that represented him. For example, blue is made to represent Christianity, specifically the virgin Mary, green is the base color of Hinduism, (religious conflict) and red can mean anger, hate, or, on the topic of this song, sin, (maybe these conflicting religions lead to sin?) and when he sees the people he wants them too. He wants them to be confused about religion as well. Or maybe he wants to unleash his anger, hate, or sin on them.\n\r\nThe song is meant to question religion, I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\ncheck this disgustipated video out\n\nyoutube.com/…\n\n\n", "comment_148": "\nI HEARD SHEEP!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nIsn't the beginning Peter Popoff? at least it sounds like him..\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nthe 1st time I heard this was on acid (peaking) in a room with blaCk walls, strobe light, loud as fuck! them gunshots really fucked with me. It was probably a better expieience than alot of the sex I've had!\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nI think it's interesting that it mentions both \"Holocaust\" & vegetarian notes.\r\nHitler was a vegetarian.\n\r\nThe sound effects are interesting, sheep & gunshots. Mutton anyone?\n\r\nI think it is saying something about people who are \"holier than thou\", on a soapbox preaching something that sounds nice, but isn't feasible.\n\r\nRug sweeping until everything appears whitewashed & artificial.\r\nTruth is:\r\nLiving kills. You breathe the air in, you are killing. You walk, you are killing. You eat, you are killing. Even if it isn't \"sentient life\"/that with a complex central nervous system/\"feelings\".\n\r\nLiterally, a serial killer (or figuratively, one who is trying to kill these sheep like attitudes in the world or even within himself) may see the people/ideas like sheep. While they are all about what how save things or what's wrong, what's best, etc. it's fading to sound like bleating sheep to this person & non human.\n\r\nHe says what they condemn is actually necessary to live. \r\nLife is NOT always fair, clean, pretty.\r\nThe shots bring this idea, the sheep down.\n\r\nEven if this is all within their own mental realization. \n\r\nThe awakening/rebirth. \r\nThey awaken from this dream/thought process/experience in a ditch, they don't know what has happened. Goo (coagulated blood maybe from killing this way of thinking/people/idea) covers them. WTF happened here? My eyes are open now, blue. I am growing (grass/green). Why is everything changing? Everything I touch/touch upon becomes a part of me, It is my purpose. Red is my new mission/color. I own everything, even those people & I will inflict my new mission upon them. \n\r\nSeems Murder/Jesus/Alien/Epiphany/Hitler themed.\n\r\nAlso maybe Landlord is figurative? \"people walking by your woods\" You owned the woods. You were the Landlord of it all: the car, the woods, the people? \n\n\n\n\n", "comment_152": "\nI love the first stanza, I think it highlights the absurdity of most religious hearsay, whether thatâ\u0080\u0099s its  intentional purpose I donâ\u0080\u0099t know. I feel like itâ\u0080\u0099s about questioning all things, understanding and thinking for yourself and how following a crowd can lead you astray. I think the sheep noises, gun shots, the instrumentation sounding almost marching-band like and the chanting vocals all combine well and enhance the message behind the song. But what I like most about the song is the imagery that it generates. \t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nI think the first part of of the song is about consciousness. In real life carrots can not know they are being eaten because they have no sense of consciousness. This is what sets man apart from beast with out consciousness we are just mindless plants waiting to be used as resources for the next level of the food chain who is probably just eating because it's instincts tell it to not because it knows it needs food to live. \r\n       The sheep sound is most definitely meant to symbolise absent minded people. absent minded people are people who put no thought into anything that they believe, they don't really think in the normal sense at all they just accept facts as facts just because the \"fact\" giver is credible. Examples of this would be people who go to church because they like the minister, or because there parents do, or people who hate religion as a whole because one of there friends does. The truth is if you think you can find peace and happiness by acting and believing like your neighbour does without serious thought then you are a damned fool. Well that's just my interpretation, Good songs should have many so don't bash other peoples.              \t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nI was Immediately thinking of the theory that he wants to kill those to persons when i was reading. Red was his color, and those little people were his too. Red means blood. Though i still don't know what is meant with that. But I'm convinced that no other person as Maynard said all of this, how can his Landlord talk about what Maynard was thinking? Maybe he inspired him to this story. I think that it shows how simple minded persons can think. If you see blue, its you color, if you see green, green is your color... the religious part has also a role in this simple minded thinking: \"If God is our father, then Satan must be our cousin.\" related to the people following like sheeps in the first part.\n\r\nand with \"live feeds on...it is necessary\" is probably meant its necessary to eat living thinks. live feeds on live. The carrots are an exaggerated displaying of the thinking of vegans.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nHe alludes to both 'Satan' and 'God' as kin. The end could indicate the 'devil' within one that feeds in moments of ignorance, or suffering. The same 'demon' one might blame for the color of the day.  He alludes to both 'Satan' and 'God' as kin.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nI like to think that the 'preacher' rant is actually from the perspective of a crazy hallucinating guy who thinks a bunch of random animals are his followers.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\ndoes anyone think maybe the \"tiny people\" are Adam and eve?\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nI wanted to comment about the middle part of the song where Maynard is singing \"Life feeds on life feeds on..\". The sounds are of an animal, presumably a deer being hunted by a rifle. The drums are the hoofbeats, you can hear a rifle bolt being worked and then shots fired. After the last shot there is a glass shatter of the rifle bullet entering the animal, glass signifying that the act cannot be undone, you cannot put together a pane of glass that has been shattered and you can't take a bullet back. Then the drums continue as the animal runs then they stop as a squeaky guitar sound gets higher and higher. This is blood flowing from the animal as it's mind fades to black on the ground and all that is left are the sound of crickets.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nIn my opinion, the derranged speaker in the latter half of the song see's this red car which he believes to be his (as he seems to possess everything he lays his eye's upon), where in fact it actually belongs to the couple by the woods who have their camra with them to take some pictures. He sees red, red is his new colour, he is angry, he has a knife and is going to kill those people walking and taking pictures by his woods with his expensive camera.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nI believe the face value of this song is obvious.  'life feeds on life, this is necessary'  It is just saying what we all are basically.  We must eat to survive, and to do that we must eat life in one shape or another. So what I get out of it is vegetarianism* is kinda pointless because it is denying nature.\n\r\nFun Fact of the Day:  I read in the Revolver magazine on tool that one of Tool's earlier concerts was sponsered by pro-life vegitarian activists type people and after the show the leader came up to Maynard and said \"wow that song (she was refering to disgustipated) was great!\"  Just goes to show the ignorance of some of the people out there.  \n\r\nI would reccomend any tool fan to pick up a copy of it, there is alot of discussions just like this specifically from the band members in the magazine.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nThis song is about Maynrd's personal feeling towards ridiculous religions that manifest themselves among Americans, and how it makes him disgustipated. This particular lyrics dipicts a religion based on saving carrots, which is moreover just for comedic value, I'm sure. 'Let the rabbits wear glasses!' (carrots improve eyesight). Maynerd continues by explaining that life feeds on life, that's just how it is, and it's necessary. \r\nAs for the ending spoken passage, this was a message left from Maynerd landlord. Proof in the FAQ and in there is a small note inside the the album art saying 'call the landlord.' \n\r\nGotta love subtle Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nwhy are everyone so based around one line. like everyone is taking the carrots line and basing the song around that. what about everything other word. what about the music? \r\ni think this song is making fun of religion and their beliefs to push religion. the preacher preaching is all a whole idea. kinda like a preacher telling the society whats wrong and right.\r\nand then the \" this is necessary\" line is what the religion is saying. such as pushing their religion and trying to convert others into that religion is right.\r\nif you notice, you can hear a new born lamb being sacrificed which shows the religion with do extreme things for the religion. when you hear the, this is necessary line, you can hear shotguns going off, which represents the people in the religion crushing all opposing thoughts to this religion. \r\nso tool is saying religion is stupid. and it shouldnt be pushed. \t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nI think that the first part, from 1:10-2:33, is Maynard mocking how gullibly people (or as I think Maynard would put it, \"sheeple\") are that they could fall for anything if it's exciting. The salesman-like tone of voice that the preacher has is almost believable, but he speaks nonsense. Definitely mocking reverends. The next part is \"this is necessary\" repeated. I think that the power behind it is undeniable and that the point is that an idea can be hammered into people's heads if they hear it enough, and I think the \"this\" in \"this is necessary\" refers to the chanting of the actual lyrics. In other words, Maynard is saying that him saying \"this is necessary\" is necessary! I think that the \"life feeds on life feeds on life...\" means that life will always feed on other life, because it's a cycle.\n\r\nIn all, I think that the song is a statement more than a story, unlike a lot of Tool songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nPeople who claim to be vegetarians will not eat meat because the believe it is wrong to kill animals. \"Why,\" I once asked a friend who was vegetarian.\r\nShe responded by saying that, \"It's wrong to kill animals.\" \r\n\"So killing plants is okay?\" I said.\r\n\"It's different. Plant's don't feel pain.\"\n\r\nMy point in telling you this is that even though things don't feel pain does not justify an action. If you refuse to eat red meat because you think its wrong to kill something, then you shouldn't eat anything at all! Eating fruits and vegitables are the same thing because they are living organisms just like any other living thing. \"Life feeds on life....\"\n\n\n\r\nThis last part I just wanted to toss in because it related to what I was talking about and I feel it is important:\n\r\nNow I don't know if Maynard is Pro-Life or Pro-Abortion, but the same thing is as follows. People claim that abortion is acceptable because a fetus does not feel pain. Oh, that is such of a disgrace! Like I stated earlier, just because it doesn't feel pain does not justify an action.\n\r\nThe last part of the song is hard to interpret, but maybe it has something to do abortion (the knife and goo, the two people off in the woods [maybe they were making love, who knows]). \t\t\t\t\n\t\t\t\t\n\n"}