{"comment_0": "\nthis song is so good! i cant get it out of my head.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nNo comments?? \r\nI loveee this song. My favorite so far from him. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\namazing song.\r\ni can relate.\r\ni love luke bryan!<3 :)\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni loveeeee luke bray<3\r\nsexxxxxy lol\r\nthe song is obvious\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think that this song is about this guy who loves a girl... Typical but they are fighting and he is trying to remind her of all the good times that they have had together. Also, he is asking her if she just wants to forget about all of the good times and just forget about him in general. Its just a long song asking if the good times are worth the bad. LOve this song :)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think it is about trying to figure out if your significant other still wants you. Lately people have lost themselves in other things and its a guy singing to a girl trying to find out if he is still what she wants after all the time that has passed and changed them, broke them, and weighed on them. \n\n\"Baby what are we becoming\nIt feels just like we're always running\nRolling through the motions everyday\nI could lean in to hold you, or act like I don't even know you\nSeems like you could care less either way\nWhat happened to that girl I used to know\nI just want us back to the way we were before\" The first part seems that they are just co-exisiting more than in a relationship \"rolling through the motions everyday\". He wants to know what happened to the girl he fell in love with instead of the stranger he is with now.\n\nThe chorus is \"Do I turn you on at all when I kiss you baby\nDoes the sight of me wanting you drive you crazy\nDo I have your love, am I still enough\nTell me don't I, or tell me do I, baby\nGive you everything that you ever wanted\nWould you rather just turn away and leave me lonely\nDo I just need to give up and get on with my life\nBaby, do I\". It seems like he doesn't feel she wants him anymore, he is trying to figure out if she is the same girl or if there is any trace of her left or what they had. Then he is just merely saying should I stay because there is still something or should I go because there isn't anything left between us.\n\n\"Remember when we didn't have nothing\nBut a perfect simple kind of loving\nBaby those sure were the days\nThere was a time our love ran wild and free\nNow I'm second guessing everything thing I see\". This is about the girl he fell in love with. They were wild and free without a care in the world. Now he is unsure of what she wants because \"I could lean in to hold you, or act like I don't even know you.....Seems like you could care less either way\".\n\n\nI believe the song is merely about how the spark that once lit a fire between two people fades away when you stop noticing all the things good about that person. In the beginning you are looking for the good and bad in people and cherish the intimacy but as the time passes you stop learning things about one another because you believe you know them. You or the other person eventually could care less about the other being there because half the time they aren't acknowledged as being there. The little things they do start to matter a little less and you stop appreciating them.\t\t\t\t\n\t\t\t\t\n\n"}