{"comment_0": "\nHey why hasn't anyone left a note on here? This song rules!! Phantom Planet rules! I'm not really sure what this song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nthis band is great!!!! i love them!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nhey i've loved phantom planet forever, and DO THE PANIC is my new favorite song*    the last time i saw them live i wore a shirt i had made that said, \"DO THE PANIC\" across it and before the band played jaques (one of the guitar players) saw me and HE took MY picture! it was nuts.  oh but then they didnt play the song durring their set and that kinda sucked...... oh well*\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis is an awesome song...but they didnt play it in concert! tear tear!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthis is a great fun song. i like it when alex says \"what the fuck am i doing here?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nare the lyrics right??\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThese lyrics are not right at all! \r\nthe first verse is \r\n\"I guess we're all in trouble, huh?\r\nBlack clouds are upon us\r\nIts doomsday on the other side of town...\"\r\nI can't quite make out the rest but I'm sure these lyrics above are not it.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nGuess weâ\u0080\u0099re all in trouble, huh?\r\nBlack clouds are upon us\r\nAnd itâ\u0080\u0099s doomsday on the other side of town.\r\nThat boy survived a severed head\r\nWhen most would just give up for dead,\r\nSo I said: \"Al B. donâ\u0080\u0099t get so upset.\"\r\nWe all get scared of sticking out our necks\r\nItâ\u0080\u0099s expected!\r\nSo panic.\r\nItâ\u0080\u0099s time to lose control!\r\nTurn off your radio!\r\nYouâ\u0080\u0099re gonna feel alright!\r\nLetâ\u0080\u0099s do the panic tonight!\n\r\nThis place is turning upside down,\r\nAnd shaking all of our change out,\r\nAnd Charlotteâ\u0080\u0099s tossing her hair to the hounds -\r\nBut itâ\u0080\u0099s her head they want on the wall\r\nRight next to the screeching owl,\r\nAnd I donâ\u0080\u0099t like this party\r\nOr the sound\r\nOf people walking across you when youâ\u0080\u0099re down.\r\nAnd thatâ\u0080\u0099s it!\r\nSo panic.\r\nItâ\u0080\u0099s time to lose control!\r\nTurn up your radio!\r\nYeah you can bring your friends!\r\nSo we all do the panic again\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthose are the new lyrics\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthey redid the song. this is the original version.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nHeh, I tend to think of \"Raise the Dead,\" \"Leader,\" and \"Ship Lost at Sea\" as forming a single story. \n\r\nOne of a cult accidentially raising a chaotic god that only wants to be loved. :P\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nSounds like an excellent tune to put on my next halloween mix!\t\t\t\t\n\t\t\t\t\n\n"}