{"comment_0": "\nI believe this is more personal than fictional. I just read an interview where he passingly mentions that this is a personal song, and it makes sense. I don't know that anyone's being killed (perhaps hard to believe from a Nick Cave song) but i just don't see it. \n\r\nI think niahm's close with the mental disorder. Always got the image of hospital bands from \"crazy braclets\" and the sweeping highs and lows of this woman seem to suggest this as well. She is many conflicting things, perhaps at separate times, or simultaneously. Whichever the case, this enigma of a woman is infatuating to him, and he write glorious and terrible things about her.  \n\r\nWhat has always stuck with me most (perhaps in that it's tattooed on me....or maybe thats why i did it...either way) is the line \"all things move toward their end. i knew before i met her that i would lose her\" I know this feeling, and its so remarkably and simply stated here. This intangible sensation you can't place that this great thing is fleeting, and the recognition of that at the outset. Prophetic and sad. She was a demon, and an angel, and in the end, she is a memory and a song. \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI see her as having some sort of emotional problem, like bipolar disorder. Someone with BPD can be the most exciting person to be around (and sometimes hyper-sexual), but also depressed and demanding, as well as having trouble maintaining relationships. \"Crazy bracelets\" could be some sort of reference, like her condition tying her down.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis seems to be the song about a relationship between a man and a woman where the man seems co-dependent (apologising because he can't be perfect, and wondering if she even loves him back) and someone who may possibly be borderline (\"a heart full of love and devotion, a mind full of tyranny and terror\"). People with BPD often view friends and partners in extremes, either finding them to be perfect or entirely flawed and those perceptions can change and flip-flop. His co-dependent tendencies make him want to fix all of her problems and be everything to her and her borderline tendencies cause her to be constantly needy, unstable, controlling and manipulative.\n\r\nI think the imagery used in the song lends itself to rape and violence, but I think that it's more meant to reflect the feelings and loss of restraint and control in this relationship. By the end he feels guilty for resenting her (\"I swear I made every effort to be good to her...\"). It's a stretch but perhaps the \"crazy bracelets\" line could refer to a hospital bracelets. In extreme cases of BPD, the person can use self-harm to control the actions or emotions of his/her partner.\n\r\nNobody is being killed or raped in this song in the literal sense and I wouldn't quite call this a \"love song.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\n\"Blood running down the inside of her legs\r\nThe moon in the sky is battered and mangled\r\nbAnd the bells from the chapel go jingle-jangle\"\r\nNever have a seen lyrics so raw and intense. This is what I love about this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\neverything about this song is monumental. the piano, his voice, the chorus...\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nfantastic writer, such powerful imagery and intense feeling in every word he says in the work. this song, i see it, is told from the eyes of a rapist, a truly dark song.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI don't see it as from a rapist.\n\r\nThe song, to me, is about a man and woman who are in love with each other(To the point of getting married, or at least wanting to), but there are relationship tensions here and there which mostly(In his eyes, anyways) come from her while he tries to be perfect to her in every way he is able to. As the song goes on he becomes more submissive and she takes more liberties with her domination over him and eventually he loses her. He isn't surprised and she isn't remorseful\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nicemouse/zsasz . . \r\nthe crazy bracelets on her wrists and ankles put me in mind of shackles.  Sounds like some pyscho version of love.  In his mind he is expressing the tenderest affections but the reality of that expression is brutal . . I don't think he lost her, I think she was a lost soul and he tortured and killed her. Dark, but Amazing . . .\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n\r\nIts a tragic love song which ends in death.\n\r\nThe chapel is a reference to a funeral. Its the funeral bells which are tolling.\n\r\nVery dark. Cave is at his best when when being dark.\n\n\n\n", "comment_9": "\nDefinitely one of my favorite songs! Gothic love songs are the best!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\n\"Blood running down the inside of her legs\"\n\r\nThis is the line that confuses me totally.\n\r\nUp to this I think the song is about a man who meets a great woman of his dreams but as time goes by he feels more and more intimidated by her and this makes him feel bad about himself and that turns to a demonization of her.\n\r\n\"She had a heart full of love and devotion, a mind full of tyranny and terror\"\n\r\nsuggests he has convinced himself that even though she is wonderful and kind, she is somehow mocking him.\n\r\nalso the reference to chapel bells is likely to be a funeral rather than a wedding as Cave has used the ringing of bells as a sign of a funeral and death on other songs (Let the Bells Ring and of course, Lucy).\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nNot sure how accurate it is, or if it was a joke. But I think it was at the concert in 1998, 17 Septembre at Warfield Theatre he told the audience \"This is a song I wrote for my ex-wife\". Or among these lines.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song is amazing. Up there with my favourite songs. & I can play it on bass, too! *grins*\r\nThis song can't help but remind me of the film (haven't read the graphic novel) V for Vendetta. Told from V's point of view, some of the parts really connect for me.\r\n'I met her on a night of fire and noise, wild bells rang in a wild sky' .. referring to the world, the political situation that England was in when V met Evey. Also reminds me of the fire and explosions that V caused and survived ... if you've seen the film, you'll know what i'm talking about. ;)\r\n'My lady of the various sorrows'/'she has a inful of ..terror' - Evey and her tragic past.\r\n'She was given to me to make things right' .. his plan/revolution couldn't go ahead without her (?).\r\n'Yet I seemed so obselete and small' - V realises that there is more than himself and his plan when he meets her, gets to know her.\r\n and yeah .. that's about as far as it goes. but I adore that song and that film so much, so I thought I'd put that down. :)\t\t\t\t\n\t\t\t\t\n\n"}