{"comment_0": "\nthis song is arguably one of the best songs by Kenny its so true, enjoy every moment of your life and dont waste anytime because life goes by pretty damn fast, so take everything as it comes and enjoy it all\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nand dont blink\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nLol so true.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nvery good song, very good album, not his best, but he's got a couple albums that in my mind are next to impossible to top, anyone else have the album?? fav song on it? comments??\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI absolutely hate songs like this.  They cause me incredible anxiety.  I know that's the point, but damn, I hate these songs.  \n\r\nI'm going to go play with my kids.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nDef one of his best ever, I don't know what more you can say than that. I like how he can get you into the perspective of looking back on your life in a lot of his songs :)\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nomg this song is so amazing. i had heard it a couple times on the radio but never really paid that much attention to it. then i was watching CMT music videos and this came on and i just started to bawl. it is such a powerful song with a great message.\r\ni love you kenny!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI love songs about life.  \"Remember When\" by Jackson is the all-time best.  \"Next 30 Years\" I think it's called by Tim McGraw is also great.  This ons isn't as good as those two, but it's good.  The meaning is obvious.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis was a wonderful song that tells people to slow down and tell there love ones how much they mean to them\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThese kind of songs really make me think, worry, cry, and apperciate. This is by far one of Kenny's better songs and I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nLife goes faster than you think, so don't blink,  \r\nOld age will always  await us, all you have to do is to slow it down and take it easy.\r\nWhat's the hurry about? What are we striving for? Don't blink......... \t\t\t\t\n\t\t\t\t\n\n"}