{"comment_0": "\nJust an overall fun song.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nthis song is about sex\r\nhe is having sex thruout the song\r\nlisten to it again\r\ngay/staight.....who cares.  He's gonna, \"whoah, whoah, EXPLODE!\"\r\nhe's cumming, duh\r\n\"don't stop me, don't stop me\"\r\nHE'S FUCKING!!\"\n\n\n", "comment_2": "\nThis is Queen at their best, gets everyone singing along, and gets everyone happy.  You know this song will always lift your spirits, its just a sheer masterpiece\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song, I believe, is about someone's experience with four drugs: LSD, Speed, Marijuana, and Ecstasy.\n     If we start off with the mood of the song, we notice that the song is fast, happy, and even motivational in some aspects. While this is not enough to properly create the summary that the song is based off of drugs, it contributes to the theme.\n     Now, if we go to the lyrical content, we see that the link between the song and drugs is pretty strong. The stanza that begins with, \"I'm a shooting star leaping through the sky/Like a tiger defying the laws of gravity...\" exemplifies the side effects that are common with the drug LSD in that strange hallucinations are being reported by whoever the song is about. Secondly, the mentioning of the drug speed is taken literally here, for Mercury sings the lines, \"I'm a racing car passing by like Lady Godiva/I'm gonna go go go...\" He then goes into the chorus, which has lines, \"Two hundred degrees/That's why they call me Mister Fahrenheit\" and, \"Don't stop me now I'm having such a good time/I'm having a ball...\" The first part of the chorus constitutes that the song's subject is \"baked\" -- a term suggesting that one under the influence of drugs is experiencing the consequences. The second part of the chorus, where he speaks of having a 'good time,' also contributes to the theme of the response to drugs. After the chorus, Mercury sings, \"Yeah, I'm a rocket ship on my way to Mars/On a collision course...\" which is a nod to marijuana because it make people \"high,\" like a rocket in space. As a mention to the final drug, ecstasy, the song has the lines, \"I am a sex machine ready to reload/Like an atom bomb about to/Oh oh oh oh oh explode...\" the link here is obvious.\nOverall, this song is, quite simply, about the cheerful first-person account of doing drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song makes me feel INVINCIBLE.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nHe's bi, who cares?\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni love this song, i think its just about being young and having your life ahead of u but i dont know.\r\nsue\r\n-x-\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe song doesn't need any real explaining - it just rocks.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nDon't stop me now I'm having such a good time!!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nNow this is my interpretation. The song delivers the message that life should be lived for the moment and to go out and have fun before its to late.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nmy favorite bassline in any queen song, one of my favorites ever (billie jean and rapper's delight are beating it at least)...the bass tells the story...that, yea, he's burning through the sky at 200 degrees...and that he's gonna make a supersonic man out of you...and he doesn't want u to stop him...w/ that bassline, u don't want to (this song goes on repeat)...\n\r\n...so, the song meaning: don't press the stop button on your record player!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nwikced!!!!!!! i want this to play at my funeral.....\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nto lidz: Have this play at your funeral? Don't stop me now... now that's evill! ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is fucking AWSOME! I Love it - makes me want to get up and dance everytime, always brings me out of a bad mood and makes me fell very very very happy :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthis song has so much energy and makes u just wanna run like a maniac, this song is all about having a gud time and partying neva mind all the crap about the grim reaper, u no not all of freddies songs r just about him getting aids and dying, and he didnt no he had it then he even denyed it the day he died from aids, songs can be about anything or anyone. Oh yea this song is a gud driving anthem but it probably wud end u u getting arrested\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI love it in Shaun Of The Dead. One of the best music moments in a movie ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI'm a rocket ship on my way to Mars\r\nOn a collision course\r\nI am a satellite I'm out of control\r\nI am a sex machine ready to reload\r\nLike an atom bomb about to\r\nOh oh oh oh oh explode\r\n^ this ones crack... it does that to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI honestly thing that this is a song that is all about a manic phase in bipolar disorder.  \n\r\nWhen they talking about hypersexuality, feeling like they could jump over everything, do anything. It is a definate manic phase.  Look up manic phase of Bipolar Disorder and you will see it totally relate to this.\n\r\nHowever, I do enjoy the interpretation about living life in the moment.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI'm not a big fan of Mcfly's cover either, Mcfly sucks they sound like pop/punk. They even managed to screw up the guitar solo.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nA song about enjoying every minute of life.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nSomething that I think must be brought up is that some of you are looking at this song from too modern a perspective. Back when it came out in 1978, topics like drugs and sex were still quite risky in rock music. If a musician blatantly sang about such topics, he/she would've garnered immediate controversy. Which Queen never did (outside of Freddie's non-musical life). Of course, today such topics are perfectly common and accepted in rock music. But back about 30 years ago, they weren't so much. So I honestly think all these interpretations about it being about \"drugs\" and \"gay sex\" (did Freddie even realize his homosexuality at the time? - I think around the time that song was written, he was actually in a relationship with some woman, whom he broke up with shortly after) are way off.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nAbout sexual freedom. Most of the lines can be seen as sexual metaphores: \"I'm a rocket ship on my way to Mars\r\nOn a collision course\r\nI am a satellite I'm out of control\r\nI am a sex machine ready to reload\r\nLike an atom bomb about to\r\nOh oh oh oh oh explode/I'm a shooting star leaping through the sky\r\nLike a tiger defying the laws of gravity\r\nI'm a racing car passing by\"\n\r\nThe nonmetaphores also go with this theme: \"Tonight I'm going to have myself a real good time/If you wanna have a good time just give me a call\"\n\r\nAlso notice the talk of wanting to make a man out of one person and a woman out of the next. An obvious reference to bisexuality which further compliments the theme of sexual freedom.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\n\"like a tiger defying the laws of gravity\"\r\nthat is the fucking awesomest lyric i have ever heard in my life. can you imagine that? a fucking TIGER defying the laws of fucking GRAVITY.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis song is so random and fun! It's adorable and I LOVE it.\r\nIt's clever and happy.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song is about rolling on ecstasy. There is no such thing as a bad time while on ecstasy. 200 degrees (body heats up), sex machine (horny, speed of light (fast dancing. \t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIf you've ever seen their documentary Queen: Days of Our Lives, Brian May kind of explains it. Freddie at this time was becoming extremely promiscuous and attending gay bars and participating in orgies. He wrote this song as a response to his band mates who were trying to get him to slow down.\n\r\nSo while not every Queen song is about homosexuality, this one clearly is.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nInteresting. Its about sex, but its sung in such a beautiful, passionate way, the completely opposite way that a lot of the modern songs about sex are played (im referring to the modern crappy pop songs that are built on materialism).\nIts also interesting because Queen's early discography was very progressive rock, and their later discography was more heavy metal (the glam metal/hard rock form of heavy metal in particular)  . But this song seems to be in between as it claims attributes of both discographies (the long guitar solo courtesy of the heavy metal genre and the piano to drum syncronization courtesy of the progressive rock genre) this song could've been the point where Queen's early progressive rock discography began to give way to their later heavy metal discography.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI think its just a fun song to listen to.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nQuite simply the best sing-a-long song ever written. It's almost impossible not to join in whenever you hear it!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThis is such a fun song. Anything by Freddie I love. However Iâ\u0080\u0099ve heard that the rest of the band dis liked this song because it was Freddieâ\u0080\u0099s mindset at the time and resulted in his death because of it. \t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI think it's about childhood and just all the potential you have.  It's sooo fun :)\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nmy party song so if you wanna good time just give me a call\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nYou can't beat this track at School Disco's (schooldisco.com).. it's so cool!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nWhy do people think every Queen song is gay? I think you're reading way too into it- just because Freddie Mercury was gay doesn't mean that's all he (or the rest of Queen, for that matter) ever wrote about.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nQueen is great.\r\nThis song is not about homosexuality.\r\nLet the good times roll!\n\r\nPS this is one of the best songs from Shaun Of The Dead as well (My favorite movie of 2004)\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThis is THE fun song.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis song means a lot to me..a lot of good times and parties! ROCK ON!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nhey i think this is a great song and Queen are great but its a shame because whenever i hear this song it reminds me of a really sad tv programme it was on but overall its a great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\ni believe this song is about friendship, love and the world around us. how nuthin can stop us from bein wat we want, its our own lives.\r\n*QUEEN ROCKS!*\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThis song is awesome!  I love it, it makes me want to dance!\n\r\n\\\\//peace\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nthis song lifts me up whenever i hear it... whenever i have a down day i put it on in my car and just sing along and rock out! (i might be getting some weird looks from people... but who cares! the song is great!). Ive heard people say that this song is about drugs and the feeling of getting high, but i never looked at it what way...  i like to look at it like youre high on life. Youre living in the moment and no time can ever be greater than now... youre \"having a ball\" in life!\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nthis song rocks so much, it's on the soundtrack of Shaun of the Dead, in the bar scene, and i just love the way the music fits with the action.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\ni cant see where the guitar solo comes in play. seems non existent\n\r\nbut this song can start a mosh pit anyday\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThis song was tottaly the song of my 6th year at high school.\n\r\nWooo.\n\r\nBastards.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThis is My Happy Song :-D\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nAlright, let me tell you waht this song is really about. This song is about sex, plain and simple. This was Freddies way of saying he was gay and wanted gay sex in an indirect way. \"... supersonic man out of you\" i mean come on. He says in the song \"Im a sex machine ready to reload, like an atom bomb about to whoa whoa whoa whoa whoa explode\" I love Queen and i especially love Freddy and this is my favorite Queen song (tied with Good Old Fashioned Lover Boy) but its about sex. There is no deeper meaning. But he does a good job at making us think his songs mean more (thanks to Bo Rhap) Love ya Freddie, thanks for keeping us guessing!\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nYeah, this is just an incredibly fun song.  Always breaks me out of a bad mood.  And in regards to Shaun of the Dead, the way they cut the action specifically to fit this song was just fantastic.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nWhen I first heard this song I was about 13, I fucking loved it, riding my bicycle fast sing it at the top of my lungs. At the the time to me it was just Yeahh!! A good good feeling. Then my mother heard it and said in an disturbed manner \" you know what that's about?!! It's about sex!! Guess she was right , but whether your gay or not sex feels great! Don't stop me, don't stop me!!! Thanks for the sex cheer Freddy\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nHoly crap.  My sister, who's seen Shaun of the Dead, was looking for this song and when she played it on the computer, I got hooked.  It's not even that great of a song; the lyrics are ridiculous.  The song, however is hilarious.  I keep thinking it could be either a big flashy dance number in a musical, or a theme song to an 80s sitcom.  It's just that fun.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI agree with  Mercuryqueen thats what I always thought it was just about sex mainly I mean come on maybe it wasn't the gay kind but what ever. It's about sex.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nHowever you interpret it, the meaning will always center around hedonism.  Hedonism was something Freddie Mercury was known for.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis is the ULTIMATE Queen song. I love it...it is the perfect song to just belt out when you're feeling really good. I love this song, and I agree with lidz...I want this song to play at my funeral. I also didn't know this song was in Shaun of the Dead...all the more incentive to see it, I suppose.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nMercuryqueen is the ruler of the universe\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nthis is the song for my life\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis song is THE song my friend Karl and i just sing together all the time, and i love it. Walking around school, one of us will sing the first word on our way to a lesson or something and after that it's in our heads and we sing it for the rest of the day. At one point Karl used to just go \"tonight..\" in my ear in tune and we'd rip our way into it in the middle of maths or something =)\r\nWhen Queen (minus Freddie of course God rest his soul) tours sometime next year me and Karl are gonna go see them if they play near to somewhere we can get a boat to from the Isle of Man =P - when they play this - it will ROCK!\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nFor whoever said this is the most gay song ever, YOU'RE WRONG. Have you ever heard the Village People?\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nAm I the only one that finds this song tragic? Mercury's vocal seems to be on the wrong side of desperate bravado, clinging onto his wild lifestyle, while it's killing him, grinning madly as his still-beating heart is torn out and thrown in his face ... staying a rockstar, staying insane and free-spirited even though his time is almost up.\r\nWhile I know this was written *before* AIDS was discovered, I still think it's about death and him pleading with the Grim Reaper to give him just one more day, so he can die happy.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThis song is incredible; one of the most fun songs to listen to. When I first heard it, I couldn't help playing it over and over again- and it never gets old. \n\r\nI understand the \"sex\" interpretation, but after a few listens I'm getting more of a \"drug abuse\" undertone: the slow, mellow beginning which jumps into the big-time, adrenaline-pumping middle (all while Freddy sings about feeling invincible and not wanting to stop) and then starts winding down again at the end... the song's form seemed to be imitating a drug high. The reference to ecstasy might be out of context, but everything else seems to fit. He says he wants to \"have myself a real good time\" - not \"we're going to have ourselves a real good time\" - which suggests to me that whatever the song's subtext is about is a solo thing. \n\r\nRegardless, an awesome rock-out song from one of the greatest bands ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI discovered this song thru a cover version by one of my favorite bands (The Vandals)  they do a video for it where the guy dresses up like Freddie Mercury & goes down to some famous boulevard in LA where there is alot of other celeb impersonaters  and he dances around like Freddie for the crowds.   Its a funny video you could see on yahoo's  Launch.com for free\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nChild of Music, this song was released on Jazz in 1978. I remember reading somewhere or other that Freddie was diagnosed with AIDS in the mid to late 80s. Maybe I'm wrong, but that's what I thought. And birbeck, Freddie announced that he had AIDS the day before he died (R.I.P.), so he couldn't have denied it the *day* he died, but he did publicly deny it until the day before. That does mean that he knew for at the very least his last 2 days, but probably lots longer. But I do agree with everything else you said. Not all of Freddie's songs are about AIDS, being gay, dying, or whatever else they're stereotyped to be about.\n\r\nAnyway, this is just an awesome song. I think it's about just going out and having fun, living life to the fullest, as lots of other people evidently think. I need to do that some more... ;-)\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nGuaranteed to make everyone go mental on the dancefloor! And quite rightly so..\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nOh my god you people are makin me feel desperate. EVERY time I open a queen song up here you always say it's about drugs, gay stuff and aids. Come on, do you really think that EVERY queen song is about death and so on. This is maybe their most optimistic and funny song, why do you ALWAYS find something connected to bad stuff and sad emotions. It's just a reflection of Mercury's lifestyle and the public opinion about him. I refuse to associate all these great songs with these stupid stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nI think this song is about drugs. \r\n\"I'm a shooting star leaping through the sky\r\nLike a tiger defying the laws of gravity\r\nI'm a racing car passing by like Lady Godiva\r\nI'm gonna go go go\r\nThere's no stopping me\"\r\n^ thats totally about speed\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nhaha, when i read the lyrics, i just think of some guy describing his experiences of masturbation. IT ALL FITS I TELL YOU! what a rad song.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nThis song is about butt sex, pure and simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nLet me elaborate.  Everything he describes is the ecstacy he feels when he is with a man.  He even goes as far to say that he is a Rocket Ship on his way to Mars.  We all know MEN are from Mars.  The rocket ship is his manhood.  He's a SEX MACHINE ready to reload.  Here comes the orgasm:  an atom bomb about to whooooooaahhhhh explode.  It's all right there.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nI think Freddie's singing in the point of view of just this very fun, very free spirit who is always the life of the party, ready to show any timid guy or gal a great night on the town, hitting the discos or bars or what have you. If you want a good time, give him a call and he'll show you, turning you from a timid joykill into someone fun like he is (\"Make a super-sonic man/woman of you\"). The song itself is just bouncy and fun.\n\r\nI think the only sex oriented aspect of this song is the fact that he and the ones he's inviting are going out on the town -- presumably to look for a mate and have some fun with them. But I don't think the song's a graphic description of a sexual act as everyone is thinking. First off, if you want to look at it that way, he's saying that he's a quick and pathetic lay, an early bird. He'd essentially be saying \"I'm so fast in the sack, I'm a racing car, traveling at the speed of light! That's why they call me Mr. Fahrenheit,\" which is an image I seriously don't think Mercury would like to have been associated with! So, I personally rule that theory out.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nThis song reminds me I'm living for all the kids who died before they had a chance to grow up :)\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\ni Agree with the Swedish guy :) But i didn't hear that song from a bad movie. I heard from a really good movie thats why i like the song. I guess :)\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nA great song which seems to describe a feeling of power and excitement.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nThis song reminds me of gay anal sex.  The line \"I wanna make a supersonic woman of you\" was often said to have been included for the sake of the other 3 (non-gay) members of the group.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI love this song it makes me very happy when i hear it =) i think this is the best song queen have ever done!\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\ni heard some biography show said it was about using the drug ecstacy.  the song describes what it's like to be rolling.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nSort of annoying that everyone always thinks it's about Freddy being gay.  Yes, there are strong sexual overtones, but Freddy was well known for being very interested in sexual pleasure, and like someone said earlier, hedonism.  According to quite a few people, Freddy was (at times) not particularly interested who he got sexual attention from, and had lovers of both sexes at different times in his life.  \n\r\nIt's about loving life.  Loving the capability of feeling.  \r\nThat's what I get out of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI am so glad that many younger people are seeing what incredible musicians Freddie and the boys were. I have been a Queen fan for many years and I love this song. It has such an energy that it will make you smile everytime. I did not know it was in Shaun Of The Dead, but will have to watch it now just to hear the song in the movie. I got Freddie and Brian's autograph on a copy of \"The Game\" album. I met them at a local club after their concert here in 1980. At the time I thought I was the only one who was as crazy about them, but their genius is now recognized by most rock fans.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThere's a sweet cover of this song by the Vandals that totally pays respect to Queen's version.  I didn't even realize it was a Queen song when I heard the cover.  haha....\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nThis is hands down my favorite Queen song.  It's just so amazing.  I think the song is about drugs, it's about what the person is experiencing when they're on it.  \n\r\nEither way, it's an awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nWho cares if it's about sex? It's an amazing party song :)\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nOpen your eyes, think out of the box. It's not important what it is about. It's important what you think and believe it's about, because that it will be. \r\n   I my self think it's about life and living it to the max. Who defines that we cant have good time all the time. World is like a kindergarten and we are sent here to play and those who dont get that miss alot.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nMy first impression of this song was one of Freddie's badddddd trips.\r\nI was wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nFreddie Mercury was gay\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nThis song... Oh gosh I love this song. I just go insane when I hear it. Interestingly enough this is a song my boyfriend and I just go crazy singing together. It's really funny. This is definately Queen at their best and I love it!! Good times with this song!! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nthis is one of my favorite songs.. and it makes me so fucking happy everytime i here it...\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\neven though it was written before i was born, freddie wrote this song for me. it is my theme tune x x x i love you freddie x x x x\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nalfiebaby omg I didnt knew that! \r\ncome on everyone knows that he was and so what? this song is great. I love it since the first  I heard it. thanks Freddie for a great song! ;)))\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nFirst off this song is amazing.\n\r\nFavorite queen song.\n\r\nBut yeah this song is about sex.\n\r\n\"I am a sex machine ready to reload\"\n\r\nAnd saying \n\r\n\"I wanna make a supersonic man out of you\"\n\r\nIt also says women though.\n\r\nWhich Freddie Mercury was bi Im guessing?\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nWell I'd jus tliek to say that I think this song is about masturbating. It sure does sound like it at some parts...\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nanyway. this song is one of Freddie's best and most enjoyable.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nthis song pwns, best song by queen ever!!\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nno real hidden meaning, just plain kicks ass\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nThis was my grad song, it was amazing \t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nthis song makes me wanna jump up with a bra on my head holding my brush that i occasionally decide to brush my hair with, dunglasses @ eight in the evening & start dancing on my bed while jumping off of it each given time.\n\r\ni love queen.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\ndus any1 no wot any queen song is about? all of them r so encripted\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\ni agree with minimacas the only people who know what the queen songs are about is queen themselves! though i do like trying to guess! i think this song is pretty self explanatory though.... anyway i love this song!!! it's so fun! and just an interesting fact to minimacas about the encription and i guess randomness of queen songs freddie mercury came up with the idea of \"crazy little thing called love\" in a bath tub in a hotel in france. thats from an actual quote freiddie himself!!\n\r\ni love all queen songs but this is definitly one of the best!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nGOD!!! it doesnt all have to be about SEX!!!\r\nyes it uses \"sex machine\" in a metaphore but it can still just be about a fun night partying!!!\r\nok so it does sound like its about freddy\"s bi-sexuality but whateva ITS AWSOME and yer i agree with minimaccas queen are like one big impossible code that no one can crak because its totally RANDOM!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nThis song is so fun to song along too.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThis is a very good song....I like the way the tempo changes like 3 different times in the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\ni luv this song and queen soooooooo much! 4 yr 6 grad we danced 2 this song, and i can still remember all the steps we made up =)\r\nthis song is such a great description of childhood and lil' kids carefree attitude. wheneva i hear this song i feel so happy, just like that night @ yr 6 grad =)\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nthis song was played at a funeral of someone who was just like this. nothing could stop him and nothing ever will. i guess that's like freddie mercury nothingcan stop him not even death coz people are stil listening to his music and to his messages.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nI like this music because it tells us about having a good time!\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nthis song makes me smile. and rock out. and dance. and be happy. i just have to sing along. \n\r\ni always sing it in gym class =]\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\ni played this song in the middle of my 18 th birthday party\n\r\nit was amazing\r\ni started and everyone - so around 100 people - just started singing it word for word\n\r\nthe atmosphere was electric\r\ni love this song and everything it does for people \r\nqueen were amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nthe songs means to me that i am a happy guy nothing can stop me dont stop me now can also mean a girl/guy doesent like you back but who cares because i am having such a good time but if you do want a good time just call me up\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nI think Queen is a little on the \"happy\" side, but thats because I'm so used to rock like Disturbed. I love this song, its a pick-me-up and sends tingles down my spine. :3\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nthis song is really cool and it rocks!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nthis song is really cool and it rocks!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nOne of my all-time fave songs. This song played at the Mother City Queer Project party last year - thats a massive annual party for gays held in Cape Town, South Africa. Although I'm not gay, this song reminds me of that party and the absolute blast that we all had. Potent party song!\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nman .... this song is just about drugs, like the guy was on ectasy and he is just describing how it feels .... fucking drugo\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nIt should be pretty obvious that this is simply a fun party song. Not just in terms of the lyrics, but also in terms of the music itself. Very fast paced and upbeat, with a very \"fun\" sound. And you can tell Freddie's having a blast playing the piano. May be there are some sexual allusions, but they could also simply mean \"hooking up at the party.\" \n\r\nI don't know about the rest of you guys, but this particular song sort of reminds me of Billy Joel's music. Freddie's singing style, the liberal use of the piano (the only real guitaring here are Brian May's solo and a couple extra guitar bits here or there), \n\r\nOne of my favorite Queen tunes.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nI found this by accident two days ago when I had to rewrite a paper in a hurry. I've now listened to it about 50 times.\n\r\nI don't want to stop at all!\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\ni dunno why this song makes me think about racing, or simply speeding up at night with a bunch of friends, and liking it so dearly much :P\n\r\nor something about doing what you like (like dancing for the dancers) where you actually feel like really really satisfied and feel alive (in a good way)\n\r\nits basically saying \"hey im having a good time, you can join but dont try to disturb me having more and more of this fun\" :P (doesnt make sense? oh well)\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nahaha, \"sex machine ready to reload\", freddie is awesome!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\narghh i love this song!\n\r\nBasically its the voice of a youth with high ambitions, on the fast track and living life the way he wants to.\n\r\nand, oh what's this? a blatant sexual reference? :D\r\n\"Like an atom bomb about to\r\nOh, oh, oh, oh, oh, explode\"\r\nlisten to the track.. its sounds very orgasmic :D\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\noh, and hedonism is awesome :D\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nwhy does every one have to refer to freddy mercurys sexuality? Did they even personally really know the man hell.. I didn't but I sure as hell saw him dancing down with women too so maybe he was bi who cares really thats his personal life holy hell..\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nbefore I even end with that comment I would just like to say this song to me showed a very spiritual man who was painting a sky - u know top gun sort of play air shows have this with multi  colored stuff- and as all songs they will mean whatever they will mean to u fortunately I most often screw up lyrics so I didn't seem to recognize all of this 'stereotypical' bs thats being commented about this song I think to each is own ..but should really focus on the fun parts of the song to see its beauty u dont have to know what all of the words mean or focus on every little part imo to enjoy a song\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nI think this is about masturbation. As strange as it might sound like. - I mean hanging around by yourself having \"fun\" - \"If you want to have a good time\r\nJust give me a call\". Comprende?\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nI agree with mouse clicker. Who cares if Freddie was gay? I support that. And anyway, this song is amazing. The first time I heard it I thought it was about sex, but I think its just about having fun and thats awesome =) miss you freddie\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nI do believe that this is the happiest song in the world. I automatically feel great whenever I hear it, and it's one of those songs that involutarily has me dancing or singing before it's halfway done.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nOk. I see many people over offended of others stating every song Queen made is about sex and AIDS.\r\nOthers saying it is about drugs --' \r\nBesides the stupidity there is a lot of naivety and denial.\n\r\nThis song is not about drugs. The word Ecstasy is referring the taste of mind of a person. This song was written before ecstasy was mainstream and before Freddy Mercury did drugs (and he never did Ecstasy). \n\r\nMost of all this song is about being on a high, an incredible non-stoppable happiness. About just wanting to have fun. It is a drug and AIDS free song. \n\r\nAnd IT HAS a strong reference to sex. It's more than obvious in the lyrics and most of all in Freddy Mercury life, he loved sex with both sexes (just like it shows in the song).\n\r\nYou could call the song ambiguous but it's obviously about happiness with it's touch of sexual pleasure (if not most of the happiness achieved sexually).\n\r\nI don't agree Queen songs are most related to sex or AIDS or drugs. Many obviously are in many ways but they don't stick just to that. \n\r\nThis is one of the best Queen songs in my opinion. I just can't be sad when listening to it and feel unstoppable. I wish Freddy Mercury was still among us, he is the best musician ever (And I was just 2 years old when he died). Just hope he keeps having a ball wherever he is!\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nI'm sorry for constantly misspelling Freddie Mercury's name in the post above. \n\r\nI'm not a native English speaker and it seemed (stupidly) right.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nObviously, this song has a very sexual meaning. Sometimes it's symbolic (ex. burning through the sky). Sometimes its blatant (ex. I'm a sex machine ready to explode)\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nI think its a song about people who really enjoy doing something, and are really good at it, but their peers think that it is not appropriate or right for them to do that something and try and stop them. Through the song the writer seperates himself from the others trying to stop him. The line \"If you want to have a good time, Just give me a call\" seems to indicate he seems to be somewhat distanced from his doubters. The protagonist also seems to have an air of confidence, perhaps overconfidence and could be pushing the boundaries to do what he enjoys doing, justifing the pleas to stop. \t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nI think this songs is about enjoying the moment of happiness when you have it!\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nBack before i was the biggest Queen fan ever, i was shocked to find out that Queen did that song in Shaun of the Dead, and then Your My Best Friend played at the end of it.  both awesome songs, Queen is best band ever.period.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nawesome,rockin,upbeat and energetic song. \n\r\nalso,does anyone else hear a baby crying in the last chorus? i hear it everytime i hear this song\n\n\n", "comment_126": "\nSex. Its about sex. Its not deep. not that hard to figure out. (Still, one of my favorite songs of all time!) He's passing by like Lady Godiva (aka, in the nude), he's a sex machine, he's gonna \"whooooaaa explode!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nSuch a fun song. I love it =)\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nhow can anyone get confused about this song?\r\nits so obviously just about being really up for a proper mental night out - excited about it to the point of exploding\n\r\nit always like to imagine freddy and kenny everett (they were mates) on a night out\n\r\nin the song freddys saying - im soo up for a big one tonight dont bother coming if youre gonna be borign - no-ones gonna put a downer on it im going large!!!\n\r\nand no doubt itll involve 80s gay club grade ecstacy (as mentioned in the lyrics) and a bit of sex - but thats just by the by really - the song is about the excitement of a big fun night out freddys got planned\n\r\nalso its not a selfish attitude of\r\noh i wanna have a good time\r\noh no, he wants to share the good times - so much in fact he wants to make a\r\n'supersonic woman/man out of you'\n\r\nlike he knows hes in an infectiously good mood and if you give him a call and come out you really are gonna have an amazing time\n\r\noh ok i have got to mention the sex machine line - i dont think the song is about sex, he is being metaphorical here same as when he says hes a rocket ship on a collision course\n\r\nbut its such a great line...\r\n\"a sex machine ready to reload\"\r\ni like it cos male sexual imagery is so often portrayed at aiming towards orgasm as a final goal\n\r\nhere he's using the metaphor of a sex machine thats already reached climax - and is now gearing up to go again!!!!\n\r\nGO FREDDY!!! - youre a f*****g legend!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nAll out hedonism!\n\r\nBut you don't have to live life as a \"sex machine\" to enjoy this song.  Just have fun!\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nmy favorite part of the song \n\r\n\"I'm a rocket ship on my way to Mars\r\nOn a collision course\r\nI am a satellite, I'm out of control\r\nI am a sex machine ready to reload\r\nLike an atom bomb about to\r\nOh, oh, oh, oh, oh, explode\"\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nFreddy was certainly known for his obscure song lyrics, yet somehow, no matter what, he and the band always pulled them off.\n\nRegardless of the song's meaning, whether it was/is about sex or masturbation, it takes you on one hell of a journey.\n\n'I'm a rocketship on my way to Mars, on a collision course. I am a satellite, I'm out of control.'\n\nIt's just a really, really fun song. \nWell and truly a great journey when you listen to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nThis song is Clara's opinion about traveling through time with Doctor Who. At least that's what I think...\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nLogically, it's probably about cocaine. Freddie Mercury was living a very dangerous lifestyle at the time of writing this, so it was probably addressed to everyone telling him to calm down and play it a bit safer. The song most likely describes the sensation of being on cocaine.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nSuch a shame there is not a 'complain/remove comment' feature on this forum. That said, AdamGullets comment is pure tripe. Older experienced genuine Queen fans from their first days will also have paid particular attention to Brian May and other members of the band and staff interviews. Freddy wrote this song at the height of hedonistic days, his discovery of the gay/bi clubs in NYC and in his own interviews he admits that during this time he was having the time of his life, with little regard as to potential future consequences (aids had NOT been named yet) and his intentions during this time of exploration, less stigma for gay/bi men in the places/clubs he had recently 'discovered'. He himself said he wanted to live his life then as fully, fast, dangerous, being loved by as many people as he could, sexual and otherwise. People seem to either deny/claim that most of Queens music was about sex/gay/bi/aids...and whilst some of it was, much of it was not. They ALL wrote for the band, had written FIVE songs for Highlander after being asked for just one. They also wrote the Flash Gordon soundtrack, and their epic Bohemian Rhapsody was an expiramental piece turned down by multiple promoters and labels, and when finally picked up on a punt, became one of their most acknowledged masterpieces in spite of it mostly being ambiguous in its lyrics. Brian, and his other bandages were intellectuals, had varied degrees, with Brian being an amazing astronomer (with a PHD/doctorate, and also one of our most respected wildlife, climate, ecology advocates. \r\nI understand this forum is primarily comments that speculate on meanings, but for the love of Freddy and other artists, do some bl**dy research  first before writing thick, inane and INSULTING comments...yes, that's to the prat, yes YOU Mr AdamGullets ...proper tw*t! Ignorance can be changed with education, but Stupid is forever. ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nI'm from sweden and I say. LÃ¥ten Ã¤r bÃ¤st!\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nWe played this just after the countdown this new year's and everyone just went mad, good times. Despite all the sex ideas, i think you can take it on a different level- just about potnetial and oppurtunities, living life to the full!x\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nJust in retrospect, this songs seems sad. That sort of lifestyle was what killed a lot of geniuses, including Mercury. \r\nI didn't mean he WROTE it about dying, I just think that is what it came to mean years and years later.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nlove this songs its just one of those songs no matter what mood your in you play it it cheers you up and also proably the best driving tune ever and no matter whpo you are you will always sing along to it\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nawesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nThis stands alongside such great songs as \"Fat Bottomed Girls\", \"Bohemian Rhapsody\" and loads of others as one of the best ever Queen songs. It really is a shame that some faggity ass band like McFly had to cover this classic, what a bunch of teenage puffy posers\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nim sorry, but this song is totally about gay sex, and im not just saying that co, \"oh, its queen with freddy mercury (who was bi anyway) so it must be about homosexuality\", it actually is about gay sex! \r\ni can't prove it, but i think its so obvious, and when you look at it that way some of the lyrics are actually quite obscene, hehe.\r\nBrilliant song anyway, whether you agree with me or not on this one.\r\nup there with killer queen, deffo\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nthis is a good song....think it was made in 1978\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nA good song, hilarious in Shaun of the Dead, but obviously gay\n\r\nCome on, with lyrics such as \"Make a supersonic man out of you\"? \"Oh oh oh explode?\" \"Rocket ship on my way to mars\"? \"Mr Fahrenheit?\" \"Like Lady Godiva\"? \"If you wanna have a god time just give me a call?\" Combine those lyrics with things like with \"sex machine\" and the general tempo and way of singing, and it's absolutely one of the gayest songs I've ever heard.\n\r\nI've got absolutely nothing against gay people (because I'm not religious), and most Queen songs were not about homosexuality, but this song is absolutely gay. I calls it as I see it. It is a fun song though, and it was good in SOTD.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nPersonally, I feel this song is about love. The type you get infected by at a young age, which raises your spirits and makes you feel excellent and invincible. I'm surprised nobody's mentioned this, I guess most people are too confined within their homophobia. \n\r\nThis song is just so damn happy, and every part of it reminds me of wild love (note: not sex). Perhaps, some have forgotten the feeling of having someone in their life that makes them feel good by just thinking of them. Or perhaps, some have never had that feeling before, but I doubt it.\n\r\n~ Eschar\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nThis song is about AIDS and gay sex.\n\r\nNo, wait, that's retarded.\n\r\nThis song is freakin awesome though.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nAbsolutely one of my favorite songs.\r\nLifts your spirits no matter how down or blue you are.\r\nIts self explanitory really:\r\nDont stop me now, im having a good time, i dont want to stop at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nThe song is actually about masturbation.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nIt's a song about sex between a man and a woman, and it comes from the most talented gay musician who ever lived (and one of the most talented period!) It's basically a song that is saying I JUST WANNA HAVE SEX, and I'm all for this song;)\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nthis is the most literally gay song ever. \n\r\nbut its still fun.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nfreddy mercury is the best male rock singer in the world. it really sucks that he got impaled by Sammy Sosa in the the 2001 World Series when he was invited to pitch the opening pitch.  Wow sucks.  Anyway im just glad he didn't ever misuse his penis with a man or anything.  He was a devout buddhist and spent the majority of his day worshiping, singing, and jacking one to Mark Twain who was also a pedophile.  Freddy Mercury in this song just doesn't want to stop getting impaled by Sammy Sosa--im pretty sure, correct me if im wrong.  Fag. the End\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nI've heard many theories about the auditory and literary genius that is \"Don't Stop Me Now\", such as this song being about masturbation, space travel, wild-west cowboy brawls, the invention of radio, winning the Russian Olympics, and more.\n\nBut the one that truly makes the most sense was one that I created in my own mind, and that analysis is that this song is about prison rape. Think about it, the lyrics \"don't stop me now\" refer to the rapist telling the guards \"dont stop me now, im about to jizz into this jail bitches ass\". If that isn't proof enough,  the lyrics \"I am a sex machine ready to reload\" obviously means the rapist (Freddie Mercury is the rapist) is preparing to rape you again, because he's an unstoppable sex God who could rape you, finish, and go again 2 minutes later.\n\n\"I feel alive and the world I'll turn it inside out - yeah\nAnd floating around in ecstasy\"\nBy saying he'll turn the \"world inside out, Ol' Freddie Mercury obviously means he's going to turn your asshole inside out by raping it 60 times an hour, and the lyrics floating around in ecstasy means he has a stunningly large amount of drugs in his prison cell that he likely won from cock fighting rings and other illegal activities.\n\nSo, if this is not proof enough, then you're in denial and need your ass destroyed by Freddie.\t\t\t\t\n\t\t\t\t\n\n"}