{"comment_0": "\nShe has this emotional barrier that she has put up. He tries so hard to love her, and to break that barrier, but he's tired of getting nowhere. He doesn't want to leave her, but he feels that she is giving him no other choice. So he's asking her to let him in, because he doesn't want to let her go.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nJust heard this song for the first time and loved it.\n\r\nTo me, I think it could mean a man and a woman have just recently broken up, and the guy doesn't want to give her up and doesn't want to get her out of his mind.\n\r\nThis song means a lot because it sounds like what I'm going through right now...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthis song is word for word..me and my loves relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think this song is about a woman who is treating her man like crap.  She probably doesnt even know she is, so he is letting her know how it makes him feel, and that he's willing to love her but he cant continure on the way it is going.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThe song shows that there are 2 people in a relationship, that were both at one point in love with each other, but now only one is still in love. The man in the song is trying to make the girl fall back in love, but so far it's not working, and he's almost ready to do the one thing he doesnt want to, and thats letting her go..... all to familiar.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nyou all got it right.  but its a wonderfully bittersweet song.  This and \"austin\" are his best.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni think its more along the emotional barrier part, as he says \" i cant find the place your heart is hiding\"\r\nshe has put this wall up and obviously he sees great things and does not want to let her go but how can they have a good and loving relationship when she keeps holding back and being true to herself, thats my take on this song\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nBlake Shelton is a great vocalist,one of the better male country singers(and song writers).\t\t\t\t\n\t\t\t\t\n\n"}