{"comment_0": "\nI love the simplicty of this song.  It left me hanging for more when i first heard it because it is so short. When i first listen to a new song i critique it and naturally expect certain things from it kinda like when you listen to a song and you can guess the lyrics even tho you've never heard it.  he says everybody here's got somebody to lean on and then i hear shiver? im like whoa.  but the thing is i never get tired of the song.  When i hear this song it just makes me think of the beauty of the world. Look at the sky. It is amazing. i sound like a Stoner when i say that but i mean really......think how beautiful this world is and we take it for granted.  When i say that i am talking about Nature. Humans have created thier own problems.  Don't blame your problems on God.  \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nmike27\n\r\nThis song possesess very influential but conscious material. The song focuses around the Rapture. and how everyday life and routines will someday come to a hult, and the world will come crashing down and those who believe they are annointed by their \"God\" will be saved. for example if you look at the end of the video the Band is on a raft and are soaring through the heavens (atmosphere) away from harm. and the line 'There's nothing here to run from' 'Cause, yeah everybody here's got someone to lean on'.i believe means that when the world ends (cataclysm begins) people should not reflect any fear but cherish the moments they have with those who are very important to them. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThe thing I like most about Coldplay is that they don't pretend they've got it all figured out.  I guess I'm talking about Chris Martin since he writes the lyrics.  Anyways there is a modesty to them. They exude this fragility, like an innocent boy in a world of men.  It's not that they are blissfully ignorant or that they are infallable, but they acknowledge this and choose to see the beauty instead.  They may get down or not have anyone to talk to sometimes, but in the end they remember the beauty of the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis is easily about Doug adam's Hitchhiker's guide to the galaxy. Arthur thinks back a lot on his world and how beautiful it was but now he has nothing to go back for.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI don't normally like this genre, but this song is great, along with a bunch of others from Coldplay.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI prefer the more mellow version of the song off the Blue Room EP. Am I alone in this?\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni don't see how there could be any doubt about the connection to Hitchhiker's Guide to the Galaxy. If you bothered to read the rest of the series, you would know that the idea of home is a recurring theme that Arthur becomes less attached to throughout the books as he realizes the insignificance of a home because of how it keeps a person from seeing as much of the Universe as he can in his life. The verses refer to the battles that are constantly being fought over the ownership of planets in the book and the futility of war. THe chorus is an ironic statement on the attachment a person or race feels to their world, although their \"world\" is just their point of view and the significance of that world could be nought if they saw it from another's point of view. As for the last verse, it refers to the fact that Arthur realizes he doesn't need to continually run from place to place, he can depend on the hospitality of others as he hitchhikes through the galaxy. Seriously, read the books and you'll get a deeper meaning of what the song is about. Don't Panic.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthis is my favourite coldplay song, ever ... :) \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThe song poses the question of whether to hold an optomistic or pessimistic view of life.  This is generated through both the lyrics and melody. \"Bones sinking like stones...\" provides the pessimist's view that we are all subject to inevitable suffering, while \"We live in a beautiful world\" reveals an optomistic view.  I would classify the melody as slow and depressing (pessimistic), yet somehow it generates a feel-good response (optomistic).  Thus the question is posed.  The last line \"Oh all that I know...\" and the title \"Don't Panic\" suggest the answer is to view life with optomism. Although often ugly, one must remember life is beautiful. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nOMFG, ''Don't Panic'', um h2g2 (Hitchhikers Guide To The Galaxy) reference anybody? \r\nEspecially the lyrics, ''homes, places we've grown, all of us are done for''\r\nJust a thought :P\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nMutual vulnerability and defenseless.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ni know right??  my friend recently introduced me to this album, and now i can't stop listening to it!! \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nAnother one of Coldplay's best, the Don't Panic on the Blue Room Ep is also very good :)\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nYeah, this song is kind of self-explanatory especially if you see the video. Not only this album and their EPs are great but all of their b-sides and upcoming album songs just blow me away. They're geniuses musically. Go listen to the song See You Soon and you'll know exactly what I mean.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis song is such a perfect first song for Parachutes it stuns me. It just set the rest of the album up so damn well, its got the right tempo, the right feel, the right lyrics, everything.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song is about how no matter how troublesome you think the world is, there's always someone there to help you.  I think the song is kind of odd how the tune sounds sad and the lyrics are encouraging. Am I wrong?  I love this song anyways.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nTotally right abchak! It sorta forces me to sing it even when im pissed at the world and think no one gives a bloody piss about me.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI lovee love his voice. Especially set to the music of this song. Sometimes the simplest of lyrics leave the greatest impact-this is def one of those types \t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nNo GoodGodWhatABeatnik, you are not alone on that one. However, I'd say that the slightly more up-tempo version was better suited to the album. The EP version might have not have done the album justice - but still, an excellent version!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\ni like looking at things in an alternate light, usually things are usually deeper than you can just read right off the lyrics, so personally i think the final line in the song \"cos everybody here's got somebody to lean on\" is a contemptuous sort of envy, to whom or what though, i have no idea. \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI agree with Loveonpaper I always thought that it was an expression of envy from someone who had nobody to lean on.  I can certainly relate to that interpretation of the lyrics better than the alternate.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nIt seems helpless/sarcastic.  I don't know how to describe it.  The video is unusual ( in a good way).\r\nreally creative.\r\nFrom just the lyrics, it could be about someone who is dying but doesn't want to.\r\nHe convinces himself it's a beautiful world he doesn't want to leave; he doesn't want to let go of what he's used to or leave \"everybody here\" Or maybe he's not dying, just afraid of change.\n\n\n", "comment_22": "\nI totally agree with Silent Witness. At first, he's talking about bones sinking like stones, and how we're all done for.. but then he starts talking about how we live in a beautiful world.. it's almost as if he's trying to convince himself that the world isn't really as bad as it might seem to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ni definitely think this song has some sarcasm but at the same time thinking about the lyrics, just hearing this song makes me feel very happy. I kind of happy you can't get by laughing. helium happy.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nthis song is great...im gonna c them in november!! im so excited lol\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nHey iloveweezer, good for you!!\r\nNow people can officially harrass you or try being your friends.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI first heard this when I was babysitting and it made me feel like I was at my church camp... which is the place I always feel so alive and so calm and peaceful and happy. The song really means a lot. If you're sad, listen to it and you'll know that it will all turn out alright.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI first heard this when I was babysitting and it made me feel like I was at my church camp... which is the place I always feel so alive and so calm and peaceful and happy. The song really means a lot. If you're sad, listen to it and you'll know that it will all turn out alright.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nDoes this song have any reference to \"Hitch Hiker's Guide to the Galaxy\" by Douglas Adams?\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\n42.\n\r\ni'll read the book and see if i find any references..\n\r\ni should really read it.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ni love this song and the book hitch hiker's guide to the galaxy, but the point is that it is quick and to the point\r\ndecisive and precise\r\nand im redundant\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThis song is wonderful.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI'm glad somebody brought up the \"don't panic\" thing about hitch hiker's guide to the galaxy. I think it doesn't really, maybe on some subtext if you look at it like, we live in a beautiful world, but \"homes, places we've grown\r\nall of us are done for\". In the beginning of the book, Arthur's house is about to be demolished, but then they're all done for because the Vogon's pave the freeway over Earth. Say so if I'm wrong, but it makes sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI think this is one of Coldplay's best songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\ngreat song. I first heard this while watching the movies \"igby goes down\", cool movie and the song and the scene are match perfectly. catcher in the rye feel to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nLooking at the lyrics, it does seem very ironic.  \n\r\n\"bones sinking like stones \r\nall that we've fought for \r\nhomes, places we've grown \r\nall of us are done for \" is all very despondent, an all-is-lost kind of sentiment.  \n\r\nAnd the chorus is kind of bitter and sarcastic.  \n\r\nI never thought of it like that before, but then I never properly thought about the lyrics at all.  I just kind of listened in a blissful haze.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\ni heard this song for the first time while watching the indie film \"!gby Goes Down\". BEEEEEAUUUUUUUUUUUUTIFUL SONG! DAMN COLDPLAY. I WANNA SEE THEM LIVE!! UGH!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nColdplay puts on a fucking good show.  I lived out my dream when I saw them live...  If you don't like Coldplay now, see them live and you'll be convinced.  If you already love them ecstatically, though.. you're only going to love them more after you see them live.  There are so many Coldplay songs that mean the world to me but it's so hard to turn those meanings into words...  I don't think words do justice when describing songs...  But we try.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\ngreat song, the song has already been described so i just want to say that i love coldplay and im totally obssesed, and its weird, becuz ever since i listened to their new cd, i loved, and then  i listened to parachutes, and i loved that too, and i can't stop listening, and it seems that anything i else hear now just sucks....i suppose i have been brainwashed...:-)\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\njust beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nwhen i heard this song for the first time, i cried very spontanous. maybe it's because i was depressed that moment, but some songs, some things are so beautiful that it makes me cry...\n\r\nmaybe i'm naive.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nwhen I heard this song for the very first time, i had to cry... Maybe it's a bit because I was depressed, but some things are so beautiful, that it hurts, that it makes me cry. Maybe I'm naive.\n\r\nI feel the irony, but it's so beautiful, ... \"we live in a beautiful world\". This song is a great example of the beauty in the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nDefinitely an awesome song! It goes by so quickly that you just have to play it again. I really wish I understood the music video, they look kinda funny all made of paper.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\noh my god...i LOVE this song so much. especially the last few lines. coldplay is a great band.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI think that this is the best song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\n\"everybody here's got somebody to lean on\"\r\nquite comforting to know that it's not just me who leans on others!\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThis song makes me happy and sad and excited and mellow all at the same time. It is so pure and simple that you cant help but love it! it also nice to know that many people agree that our world is beautiful. when i listen to this song i just want to cherish the world even more.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI always have felt that songs can make a movie. The way \"Don't Panic\" was used in Garden State gave me this feeling that I just couldn't get over. How the line \" we live in a beautiful world\" was matched up with the title and the guitar riff behind it, it's just a gorgeous song and worth the listen\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nAfter watching the film clip, i actually thought this song had some reference to the environment in some way and its preservation and global warming.\n\r\nI mean if you look at the video, its happy happy la la, and yer, then the globilisation and the oil minning and polution comes in, and there is alot of use of gas and 'energy' in this film clip, and that got me thinking about how the place floods and maybe thats got to do with global warming and rising sea level.\n\r\nmaybe also the lyric \"bones sinking like stones\" could have to do with the end of the past and the destruction we've done to the earth or maybe it is in some way making reference to 'fossil fuels' as in fossils=bones, i know thats a bit lateral, but just a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nEdit, I completely agree. The song went perfectly with that scene, and that entire movie. And about the feeling that you couldn't get over? I'm with you on that. Everytime I hear the song now, I just think of the scene with the drugs in the medicine cabinet, and his blank face. I get the chills.\n\r\nThis song is beyond beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\ni think this song is very ironic.\n\r\n\"bones sinking like stones \r\nall that we've fought for\"\n\r\nit is referring to how our world is being torn apart because the goodness of people is being lost, people have lost faith in what really matters. \"bones sinking like stones\": bones represent the core of human beings and this is \"sinking\" or being lost. \"all that we've fought for\": we have fought for justice & equality and the world is falling apart (murders, crime, pollution... however you want to interpret it).\n\r\n\"we live in a beautiful world\"... this is so ironic!! it is saying that the world we were given is beautiful, but look what we're making of it.\n\r\n\"there's nothing here to run from \r\ncause here, everybody here's got somebody to lean on\"\n\r\nhere it is saying that people don't even care about what is happening around them; they are so wrapped up in their own little worlds and have \"somebody to lean on\" to tell them its all okay, its all normal... but its not.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI really don't think it's sarcastic.They just tell about the trouble all around the world, in great contrast to the beauty of it all.\n\r\nEveryone has somebody to lean on. We are saving each other. We've got the chance of changing the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThis song opens up the movie \"Garden State\" and really sets the mood for it's beginning.  The man in the movie is lying in a bed, in a small room stripped of all color, starring at the ceiling . He is numb to all emotional feeling and takes a multitude of medications and lives a \"goin-through-the-motions\" life.  It's sort of an ironic song in that since.  The Character does live in a \"Beautiful world\" but he is too detached to see it. The song has an errie-ness about it  which brings this scene to life in the movie.  This song is so amazing!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\ni agree great song to start off a beautiful movie\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThey're using this song for the Channel 10 promotional commercials on t.v here in Australia, it's got the stars in some little space world among the stars all doing whatever to the music, it's such a relxing song, and you're all right, it's ironic.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\ni agree wi sound boi, what he sed aaaaaaaages ago. I don't really know how to interpret it though, it cud b sarcastic and bitter...but if u look at chris matins' look on the world...charit n all that jazz...i think hes saying its a mess, look what it woz, we can make it beautiful again, but fisrt all the rubbish war n everything has to go woo hippie fest!\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nmost beautiful song i've ever heard. i always thought this song was about fighting for perfection. fighting for that one thing that keeps you alive.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nheard the song at the beginning of 'garden state'.\r\nperfect song to kick the movie off with...really did set the mood for the movie.\n\r\nps. garden state's an awesome movie\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nheard the song at the beginning of 'garden state'.\r\nperfect song to kick the movie off with...really did set the mood for the movie.\n\r\nps. garden state's an awesome movie\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\ni love garden state, and everything in it.\n\n\r\n\" Safe..when I'm with you I feel so safe, like I'm home. \"\n\r\nand this song just makes it .. complete.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\ni just wish she had read this lines before killing herself...unfurtunately i never got to know her that well...but she touched my life and i will miss her alot....why?...why? why did u kill yourself? \r\ni remember u coming up to me and asking me to help out this girl w/ her hw. i was surprised b/c u knew my name although i had only seen you a couple of times around. u made a wonderful first impression. i wish i could have told u. you seemed like a very independent and strong girl, why? why?\r\n\"there's nothing here to run from \r\ncause here, everybody here's got somebody to lean on\"\r\ni just wish i could have been there for u to lean on...\r\nBao 06.15.86 - 01.24.05\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nAn amazing start to the Parachutes album, so quick yet so sharp. Beautiful pieces of guitar from Chris and Jonny with soaring vocals. Fantastic\n\r\nJust heard this from their Sydney Live DVD and it's one of the best tracks on it. Great performance from a band on form and i can't wait for their third alb.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nNever panic, there is always somebody for everybody..\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nthis song brings up a lot of memories for me, especially about the movie garden state, and on its own it's incredibly beautiful. it's one of my favorite coldplay songs. my favorite line is the melodic \"we live in a beautiful world...yeah we do, yeah we do...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI think the Version of this song on the \"Igby Goes Down\" Soundtrack is amazing and it fits the movie wonderfully. I know alot of ya'll are talking about it on Garden State, which is an excellent movie however if you liked Garden State you might like Igby Goes down. Check it out.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\ni never thought it had anything to do with Hitchhiker's to be honest, but it seems like that now. i always thought it was just a person's pesimistic, sarcastic view of the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nlovely song. they achieve what they wanted to. i was in hysterics one day and after putting this song on (on repeat, mind you), i calmed down enough to make it home. there was something about how he understood that things were bad, but look! \"we live in a beautiful world.\" we do? \"yeah, we do.\" so reassuring, and definitely perfect as a first track. i couldn't listen to the rest of parachutes for the longest time because of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nFools! This is dont panic!\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nyeah, dude - this is don't panic. there is no coldplay song called \"beautiful world.\"\n\n\r\n  ...psh.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nsheesh folks....chill.\n\r\nthanks for posting the lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI can't stand Coldplay, but this is pure class. Where did it all go wrong? \n\r\nI reckon Chris Martin's a classic case of an artist who in the early part of his career is expressing emotions we can all relate to. The problem is when you have such success and start living your life with Hollywood's elite in Hampstead and the like, who the f**k is going to relate to you then? To me his recent lyrics seem empty and spiritually bankrupt because he's trying to appeal to a mainstream audience of which he is no longer a member. Consequently, all we get now over-produced turgid nonsense. And what the hell is the s**t on his hands all about? Tosser.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nHe is just on about how beautiful the world is to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nThis is the only Coldplay song I like. \r\nAnd it's in my favorite movie.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\n\"there's nothing here to run from \r\ncause here, everybody here's got somebody to lean on \" - So true...why run, there is no reason too, you just have to find some to depend on in this beautiful world.  I sing this song to my baby girl, it is awesome!  And yes Garden State was awesome too.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nback in the day when i first heard this song i thought it was called beautiful world till i bought the cd and saw it was the same as don't panic. i heard it in garden state and had a stroke. that movie has such amazing songs in it, thank god for zach braff.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\n\" Fools! This is dont panic!\"\n\r\nLol. XD\n\r\nBut it is Don't Panic. :3\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nand as for the meaning? possibly a nostalgic look back at his past and considering the wider implications.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nwow.. i can't stop listening to it... does anyone know where i can find the music video on the internet?\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThe lyrics seem screwed.. it's \"Home, all that I know, there's nothing there to run from.. 'Cuz yeah, well everybody here's, got somebody to lean on..\"\r\n   Or, thats what it seems to me.. I donno. \n\r\n                                  0_0\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nabout how fucked and depressive the world is basically, also how he has no hope left (bones sinking like stones, all of us are done for, etc) and he is pissed off how everyone else keeps telling him to cheer up and that everything is ok. (we live in a beautiful world)- it is sung extremely sarcastically, its easy to pick up. he just cant see anything beautiful about the world and life, and he sick of everyone else trying to change his mood basically.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nwow.  the beginning of the song, the first word just hits you in the gut.  its so low, and, i don't know how to say it. unexpected, i guess.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nTheyre music is good, but sometimes the lyrics are meaningless.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nI think this is about a self indulgent singer, trying to think of stupid names for his kids.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nthis is the best Coldplay song there is, it is my all time favourite of theirs and just has a humble feel to it, i dont really know how to explain it but it really just meaks you feel happy the fact that everybody has somebody to lean on.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nMEANINGLESS? are u kidding me..\r\ndude u gotta hang out on this website more often or something.. \n\r\nanyways..  abstraction is one thing and lack of meaning is another. i agree about this song being nostalgic, and it talks about the past (bones... ) sinking like stones might mean that the past that was already old is now so ancient that its sinking and being forgotten. \n\r\nthats my personal interpretation... but i think there may be many others.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\n\"sometimes it's so beautiful it hurts\"... that's what this song is to me, yes sad, but no, not at all sarcastic.  When everything's falling apart, sometimes the most terrible thing of all is the beauty all around us. If that's not enough...\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nOoooooooooh great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nis it just me or does it sound like he's singing \"cause yet, everybody here's got somebody to lean on\" instead of \"cause here, everybody here's got somebody to lean on?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\ni have to say that this is, so far, my favorite song by coldplay. i'm not a fan of their new stuff; i think only their first two albums are stellar. as for my opinion as to what this song means to me, it's saying that we should look past all of the bullshit in the world and see the beauty even if all the crap seems overwhelming at times, and the only way to do this is by affirming to yourself that the world can be beautiful. you shouldn't let all the troubles of the world weigh you down or cause you to feel anxious or regret.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\ni have to say that this is, so far, my favorite song by coldplay. i'm not a fan of their new stuff; i think only their first two albums are stellar. as for my opinion as to what this song means to me, it's saying that we should look past all of the bullshit in the world and see the beauty even if all the crap seems overwhelming at times, and the only way to do this is by affirming to yourself that the world can be beautiful. you shouldn't let all the troubles of the world weigh you down or cause you to feel anxious or regret.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\ni'd have to say that this is my favorite song by coldplay. i'm not a fan of their new stuff; their first two albums were stellar though. as for what i think the song means to me, i say that it's saying we should look past all of the bullshit and sorrow going on in the world even if it seems overwhelming at times. you should look past all of the crap and realize that the world is beautiful. you shouldn't let the troubles of the world weigh you down.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nI have been a coldplay fan for years, and I still come back to this song - its just great.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nGreatest Coldplay song. Ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\ninsane song. so good in garden state - i agree that it's an awesome movie. this song is so simple lyrically yet so moving when you put everything all together. good job coldplay. mad props.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nCan't really add to what's been said already. It says to me, hey, the world isn't such a bad place you know. It's the title that gets me because 'Don't Panic' are the exact words that are written on the 'Hitchhiker's Guide to the Universe' in the book/film/radio show of the same name. Can't help thinking there's a link there somewhere.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nHmm, being new to this place, I didn't realise before I posted that I hadn't read all the comments. So now I think maybe the lyrics go a bit deeper than I originally thought. Maybe they actually mean hey, we live in a beautiful world so don't destroy it, don't wait for someone else to save the planet - as in 'everyone here has somebody there to lean on'. Don't wait until it's an emergency - 'Don't Panic'.\n\r\nI love this site!\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\ni started thinking about this song while i was reading 1984 by george orwell, and while i dont think it really has anything to do with it, ive always felt like does i love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nwhen i saw them in concert last month, chris martin said this song is about going out and enjoying the beauty of the natural world.\n\r\nso....\n\r\nnot sure if anyone has said that or not. but yeah.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nLOVE IT.  Garden State!  I love that soundtrack and this song is definetly one of my favorites on the album.  I love the \"We live in a beautfil world.  Yeah we do, yeah we do.\"  That's my favorite part, and I love the guitars building at that part.  The last line is perfection.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nHave you ever heard this song played on piano? It sounds pretty good.\n\nyoutube.com/…\n\n\n", "comment_100": "\nOh, Garden State. This is probably the only Coldplay song I really enjoy.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\n\"Don't Panic\" is indeed the title of this mind-numbingly brilliant song. I think it may be based on the humorously redundant phrase in Douglas Adams's \"Hitchhiker's Guide to the Galaxy\". But then. that's just me.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\n\"Don't Panic\" takes its name from the inscription on the front cover of the fictional 'Hitchhikers guide to the galaxy' novels and radio series in the UK by Douglas Adams.The lyrics such as ' bones sinking like stone' are all from the the novels.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nWhen I first heard this song I broke down into tears.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\ni think its about the past and about how people used to be and act. but people change....they grow and become different people and the people they once were are often lost and forgotten.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\ni think its about the past and about how people used to be and act. but people change....they grow and become different people and the people they once were are often lost and forgotten.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nabstraction is art.. and the way coldplay puts it into music.. its just WOW.. so who ever says that the songs is meaningless ... SNAP.. hehe.. I love this song..btw It is DONT PANIC.. and at the beginning its Bones sinking like stones.. not bones are sinking like stones, by the way, the live version is soo much better check it out on the dvd (Y)\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nabstraction (Y).. its art.. hey check out the life version from the dvd.. much much better (Y) peace\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nWow, I never expected all the comments of this being an optimistic song. Along with others who commented , I felt the final line was meant to be envious and sarcastic. \r\nTo me, this song is about when you look at the world, and though you see the beauty of the interactions between people and how nice everything looks, there is a touch of sadness to every event. \r\n   The feeling you get when you have so many questions. Are we going anywhere? Could everything just fall apart, has it already started to? As much as we love this world, are we fighting a losing battle against everyone, everything, and ourselves?\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nBlatant reference to 'Hitchhiker's Guide To The Galaxy'. I thought this was brilliant in 'Garden State' and also very ironic considering the hookline, 'We live in a beautiful world' is played after he finds out his Mum is dead.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nif you actually look at whats happening in garden state during the song...it makes it sound very sarcastic...\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nThis song is about suicide i think.\r\nBecause he keeps mentioning how much of a beautiful world it is, even if your family is messed up or whatever. and he also said theres ALWAYS someone there which is true.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nMy favorite Coldplay song.\r\nI remember me and my ex boyfriend loved this song and he made me a mix CD and the first song on it was this one.\r\nI turned it on at 10 in the morning and I remember feeling fully rested and then putting on a long white skirt and it was snowing outside and I turned this song on my stero and i just danced in my room.\r\nThat was the morning I realized I was in love with him.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nThis song is about no matter what you might loose everything your house your car your tv everything that you fought so hard to keep. However, we live in a beautiful world and when it comes down to it thats all we need and that it's not the end of the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nThis song is about no matter what you might loose everything your house your car your tv everything that you fought so hard to keep. However, we live in a beautiful world and when it comes down to it thats all we need and that it's not the end of the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nThis song is beautiful. I heard it off of Garden State which is an extraordinary movie, and if you put this music on your Ipod and walk around, you feel just like you're in love with the world and anything icredible can happen to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\ni really dont kno what to make of this song. its not really sad or anything but its not happy. it says \n\r\nbones sinking like stones \r\nall that we've fought for \r\nhomes, places we've grown \r\nall of us are done for \n\r\nits like this persons place is being taken away in a storm or sumthing and everything is lost but still the chorus says we live in a beautiful world. I mean this person is loosing everything but still they think that the world is a beautiful place! u really have to admire that\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\ni really dont kno what to make of this song. its not really sad or anything but its not happy. it says \n\r\nbones sinking like stones \r\nall that we've fought for \r\nhomes, places we've grown \r\nall of us are done for \n\r\nits like this persons place is being taken away in a storm or sumthing and everything is lost but still the chorus says we live in a beautiful world. I mean this person is loosing everything but still they think that the world is a beautiful place! u really have to admire that\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nfunny thing about this song, u can play it alone for hours and never get bored...probably cuz it has a constant rythm, and the chorus has a higer faster beat...its so cool...\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nI agree with a previous poster that the best adjective to describe this song is \"haunting.\"  The title Don't Panic seems to be addressed towards someone who is freaking out over something.  The rest of the song is then an acknowledgement of the bad things in the world, but overall attempts to convince the one in a panic that the world is beautiful in the end.  \r\n    The music itself is haunting because somehow the song conveys simultaneously a pessimistic and optimistic ring to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nGarden State\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nwe are tragic, yet we are beautiful.\r\ncoldplay says it better than anybody else.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nI say...the second best song of all time for Coldplay. I can't compliment this song enough. Out of all the songs on parachutes, it is the most individuating. It feels as if no one else could've formed those lyrics. It's so very coldplay, simple drum and acousic rythym accompannied by soem thin electric guitar picking (jonny seems to hate chords). If I had to sum up coldplay in one song...this is it.\n\r\nSo many of Coldplay's early songs are angsty, and complain about the horrors and problems in this world.  Don't panic, acknowledges this but adds the positive \"but we live in a beautiful world\". The meaning is simple. The world can be a tough and terribly place sometimes, but in the end....it's beautiful. it's worth having--and life is worth living. We call have someone to lean on. \r\nCome to think of it...it goes quite well with \"everythings not lost\".\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nI just looked over some peoples replies...and I'm startled by all the pessimism (which I think is a reflection of the reviewers depressing outlook on life). To call this song sarcastic, is to surrender it to a dark fate...something I never want associated with Coldplay. Martin is not the sarcastic, pessimistic, depressing type. Considering the fact that the album ends with \"everythings not lost\", and the mellow yet positive nature of the album, this song is most definitely optimistic. They named the album parachutes so that they wouldn't be declared dark and depressing...and in every song Chris has been most sincere. I can't imagine the last few lines being sarcastic...it's just so not coldplay, maybe radiohead or some emo band...but not Chris. Not coldplay. Take the song for what it is. A song about a troubled world...that is ultimately beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nthis song fit garden state PERFECTLY. i always play this when i'm at my lowest lows and it just makes me laugh at how silly everything is and how glad i am to be alive and well... totally makes me think of this \"let us rise up and be thankful, for if we didn't learn a lot today, at least we learned a little, and if we didn't learn a little, at least we didn't get sick, and if we got sick, at least we didn't die; so let us all be thankful\"\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nThis song made me cry the first time I heard it. The lyrics, combined with that music, just does that to me. I don't know why.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\ni absolutely love this song. it's amazing, the feeling it takes you from and leaves you with. \r\ni was really sad when i heard it...it made me cry...then smile. seriously, this song is awesome for those moments when you wish you were happier.\n\r\ni did used to think that it was like sarcasm...talking about how we'll all die, etc, but now i do really see it as an optimistic song in the end. that's how it makes me feel, at least.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nIt seems to be about how ever though time goes by, and we die eventually, this world is amazing... and the fact that we die is beautiful in itself.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\ni know a thousand of you have already said this but this is the most beautiful song ever, one time i was driving through the mountains and this song came on and even though this is ridiculously emo i swear to god i teared up because i was just so overwhelmed wiht all the beauty in the world :)\n\r\nim kinda emotional.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nAGREED-with most of you. This is definitely the best song to kick off the beginning of the CD. Simplicity is key in this song. And I HAVE to agree with a couple people that this song can easily make you feel so much emotion that you cry. This is not the first song of their's that had made me cry. They put so much into their music. The last line of the song is definitely perfection and does make you have this feeling of hope. sweater_poorly_knit  REALLY made my heart swell when she described how she was driving thru the mountains and this song came on and made her tear up. I completely understand what you mean. This music just overcomes your soul and you can't help but feel emotion listening to it. You feel your eyes get deep and your heart beat fast and then slow. It's crazy what effects music can have on you. Someone also mentioned how cool it feels to put this song (among MANY OTHER Coldplay songs) on your ipod/discman and walk around places...you almost feel like your in your own music video and your thoughts run away with you. Incredible band. Incredible music. Incredible feelings. Incredibly deep profound people on here. good work guys. its nice to know people appreciate good music like this.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nfucken this song on a rainy day :)\r\ni love ittt!!\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\ni could listen to this over and over again. his voice is great, and it really does make the world seem so beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nI think this song is about 911. \"Bones sinking like stones\" (World Trade Center) and \"all of us are done for.\" That could speak to terrorism and how it has changed our lives the way we knew and lived it in this country and all over the world. I think the song is also saying that, in spite of the monstrosity of sadness that graces the planet, it's still a beautiful place to be and that we are lucky to be alive.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nI don't know why but when i listen to this song... I both feel like there some-one there But also an irony in this song like:\n\r\nbones sinking like stones \r\nall that we've fought for \r\nhomes, places we've grown \r\nall of us are done for \n\r\nwe live in a beautiful world \r\nyeah we do \r\nyeah we do \r\nwe live in a beautiful world \n\r\nbones sinking like stones \r\nall that we've fought for \r\nhomes, places we've grown \r\nall of us are done for \n\r\nwe live in a beautiful world \r\nyeah we do \r\nyeah we do \r\nwe live in a beautiful world \n\r\nwe live in a beautiful world \r\nyeah we do \r\nyeah we do \r\nwe live in a beautiful world \n\r\noh all that i know \r\nthere's nothing here to run from \r\ncause here, everybody here's got somebody to lean on \n\r\nI meann one part of it talks about how it's It's a buetiful world but also how we fight for it or destroy in pointlessly... you can hear the irony is this \" There's nothing to run from\" yet \"bones sinking like stones all that we've fought for homes, places we've grown all of us are done for \" but end with \"Cause here everybody got some-one to lean on\" I mean... It's almost has two sides of a story.... I mean everytime i heard it i feel either :\n\r\nNo matter what happens you got some-one\n\r\nOr completely oppisite:\n\r\nIn the end you're all alone o.0... i hope i don't sound starnge stating what i did.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nthe only thing i hate about this song...\r\nis that it's too short.\n\r\ni first heard it on the garden state ost. amazing movie. stunning filmography, perfect cast.\n\r\nsurrealism taken to whole other level.\r\nzach braff is the man.\r\nas is chris martin - good job, guys.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nI've always felt that this song was sarcastic and cynical. Like, \"Oh what a beautiful world we live in, we fight for so much [homes, places we've grown] but we're just going to die anyway and it will all amount to nothing [bones sinking like stones/all of us are done for].\" The last line is his jealousy at being alone while everyone around him has somebody to lean on.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nTo me its loss (your death, anothers death, love, etc.) and convincing  yourself it wil be okay even though things are terrible at the moment. Chris' voice makes it all fit like a puzzle. I adore Coldplay.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nthis song along many others from coldplay has a way of making you zone out of your problems and travel on a euphoric adventure of musical greatness. the amazing lyrics coupled with chris's soothing voice is an experience that can't receive it's proper justice from my words. it would take coldplay themselves to write a song describing the feeling you get when listening to their music.. someone also said earlier that there is no need for drugs or alcohol, just pop in some coldplay... i concur\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nevery time i get together to smoke with my two friends we always listen to this album. parachutes is definitely one of my favorites. this song is absolutely one of my all-time favorite songs. i can listen to it a million times.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nEverybody here's got someone to lean on, I find that to be true but I think theres probably at least one person out there that does not have anyone to lean on, whatchu think\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nI've been a Coldplay fanatic for years. This song is amazing... like everything else they write.\n\r\nI don't think this song is so much about someone dying. I think it's more about feeling like everything is pointless; we're all going to die someday, so what's the point in getting out of bed in the morning- type thing. That when everything is falling down around you, and it seems like things couldn't get worse... there is always something worth sticking around for... we live in a beautiful world.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nI think it's all ironic. Every time I listen to the song I think of how the world is falling apart around us. The contrast between \"all of us are done for\" and \" we live in a beautiful world\" is genius. I guess it all depends on your state of mind. I see the bad side. \t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nthis song was originally called 'Panic'. But I'm not sure if they're giving a command to panic, or if they're talking about the very notion of Panic. Anyway, to the song. They always pick the best songs to name after something other than a lyrics reference. Don't Panic, The Scientist, Clocks, Amsterdam, X&Y, Twisted Logic, 42. It's perfect in every possible way. the soft depressing sort of tune picks up at the end with 'All that I know they're is nothing there to run from'. I love that. The theme is if there's nothing there to run from, then why Panic?\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nhome is a good reason to live on..\r\nthis is really a beautifulLY strange world\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nwe live in a beautiful world upon which we destroy\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nActually, I currently believe that this is the only good song they've written.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nCould this song be a response to 9/11?\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\n\r\n\"cause yeah, everybody here's got somebody to lean on\" I think this is a statement of jealousy and pain, not feeling like you have somebody to lean on. Which is the take I can relate more to. If you listen to the Don't Panic version on the Blue Room EP it has a darker feel. And I think the re-record may have been recorded in a happier state of mind giving it the light context... But, I still do believe this song has a sorrowful nostalgia attached to it, of missing something you once had... Maybe it's because this song brings back memories of my own. \n\n\n", "comment_148": "\nSince in the video the lyrics \"everybody here's got somebody to lean on\" are juxtaposed with a bunch of people rowing while stuck to a hidden piece of land, there is a suggestion of futility. Yes, we all have someone to share with us the illusion that all we are doing gets us somewhere. We're just all in the same row boat, going from ashes to ashes and dust to dust. But it is a beautiful ride if you don't think about trying to reach a destination. Just enjoy your time at sea. \t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nI think the song is about the fact that we are all going to die one day, so enjoy life while you can and try not to fear death.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI think this song is about no matter how bad thing's are around you or in the world, you can still enjoy life and find something or someone to live for.\n\r\nI love this song, the Blue Room version is awesome to.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nWhat I think, is that he wanted to say, that we are so small comparing to the big world we live in our \"bones are sinking like stones\" in the big ocean, and \"all that we fought for\" is worthless, coz we're all gonna die one day... But still, he says that \"we live in a beautiful world\" and that we should enjoy it :)\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nThis song is about the mistake of takin life seriously. The mistake of being hooked up on the illusion of perfection. Think darwin. \t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nThis purpose of this song is to send a message to anyone fearful of death or dying. It doesn't matter what you achieved in life because the truth is, you will die someday, but you shouldn't look at death as a bad thing. You should take comfort in the fact that you aren't alone.  Everyone dies eventually, and everyone at some point in their life is afraid. The fact that we all share the same fate and the same fear is what unites all of humanity.  This unity is what makes the world so beautiful.  Death isn't something to be scared of, hence the title, \"Don't Panic,\" and whenever you feel uneasy, remember, \"everybody here's got somebody to lean on.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nI love this song because my life sucked a while back, nearly everyone hated or disliked me, but the \"Oh all that I know, there's nothing here to run from. Cause here, everybody here's got somebody to lean on\" part was fitting, cause I had my best friend and kindred spirit, and it got me through.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nI know this may not be a common interpretation of the song, but I think Chris is talking about someone contemplating suicide. 'We live in a beautiful world' - this is self-explanatory. He's trying to tell the person that this world is beautiful, thus hinting that there's no need to leave this world. 'Oh, all that I know, there's nothing here to run from. Cause, yeah, everybody here's got someone to lean on'. I think by using the phrase '..all that I know..' he's trying to submissively show the person that yes, you may have a problem, but I'm just going to tell you what I know. Then he states what he knows 'There's nothing here to run from'. THEN he finishes with a beautiful line 'Cause, yeah, everybody here's got someone to lean on'. He just says this to show the person why 'there's nothing here to run from', then I think he concurrently hints that he himself is that 'somebody' that the person can lean on. But yeah, that's just my interpretation.\r\nBut all that being said, even though I've never contemplated suicide, this songs speaks to me on so many levels. Especially when I'm down, it just reminds me that I have awesome people around me that I can 'lean on'. And this is what makes Coldplay so bloody awesome! The fact that their songs can speak to so many people, even though those aren't necessarily the people who the song was mean for - that is if my interpretation was right, lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nmeant*\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nI found this song really ironic. I discovered this song today and I just learned that my first love just got deflowered by a guy I don't know anything about. The song says \"bones sinking like stone\" and \"places that we fought for\" and then \"all of us are done for\". For me it represents this big hole in our existence of \"why are we even here\" or \"why live and suffer so much\" then the chorus hops saying how beautiful the world is and how much it's worth to keep living on. At this point I don't know what to believe...\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nEven when the world comes crashing down around you, don't freak out because you've got friends in this great world.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nI've only come across this song in the recent months (I was a Coldplay fan, but it started after Parachutes came out so I had to rediscover it). I can't believe how amazing it. Seriously considering getting a tattoo of it. \t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\ni love it\n\n\r\nsooo chill\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nIt doesn't matter how bad things can get, it's still a beautiful world! \t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nHitchhiker's Guide isn't the greatest book ever, but I do suggest everyone read it. It's funny and I quite adored Ford Prefect.\n\r\nGood song, by the way. I love that they do put references to the book, but they don't use a sarcastic, witty lyric (which is rather how the book is written).\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nmike27\n\r\nThis song possesess very influential but conscious material. The song focuses around the Rapture. and how everyday life and routines will someday come to a hult, and the world will come crashing down and those who believe they are annointed by their \"God\" will be saved. for example if you look at the end of the video the Band is on a raft and are soaring through the heavens (atmosphere) away from harm. and the line 'There's nothing here to run from' 'Cause, yeah everybody here's got someone to lean on'.i believe means that when the world ends (cataclysm begins) people should not reflect any fear but cherish the moments they have with those who are very important to them. \t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nI found that it was about how short and meaningless life is when you base it on physical things (Such as short life expectancy). But there is so much more to being alive; or it means to still make the best of it with an optimistic attitude. That`s just my opinion, great song btw.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nFirst heard this one the day I learned a friend \t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nOk so I'm getting this song is about our inevitable demise. \" bones sinking like stones all that we fought for. Homes places we've grown all of us are done for\" sounds like everything we've worked so hard for in life, all of our possessions and our nostalgia and family and us and our bodies will all be gone and mean nothing when we die. Then \"we live in a beautiful world\" which brings this uplifting spirit to the song. Like appreciate this place because it's beautiful and here and ours. This song is depressing and happy all in one. The last article of the song goes \"there's nothing here to run from, because everyone here has got someone to lean on\" I heard a quote today that went something like \"the best things in life to experience are love and art\" which I think of when I hear this last passage of the song because it's so true. Everyone here's got someone to lean on as in love in some form or another from your parents to your friends to the greatest that is another soul to share your self physically and mentally (significant other) to sum that up, have no fear because you have love and on top of it this amazing piece of art. Good day right? \t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nI feel like this song is about depression.\n\n\"Bones, sinking like stones\" - like into the dumps of depression\n\"all that we've fought for/Homes, places we've grown/All of us are done for\" - despite all this work we've done in our lives, depression does us in, and makes it all seem worthless.\n\n\"We live in a beautiful world...\" - an attempt at reassurance, like you know this world is beautiful, and you're trying to see it. Only sometimes do you succeed.\n\n\"We've got nothing here to run from/'Cause here, everybody here's got somebody to lean on\" - Depression often leaves you with feelings of loneliness and, coupled with Anxiety, fear. The song leaves a nice reminder that there are people you can lean on.\n\nOverall, I think this song was written for someone going through a time of fear, loneliness, and/or apathy. \n\nIt would make sense for Hitchhiker's Guide to The Galaxy to be the foundation of the lyrics/title, with the theme of depression. Great songwriting by Chris Martin on this one\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nI think this song speaks of the suffering and pain involved in life. We live in a beautiful world as opposed to what a wonderful world. We live in a beautiful world but he does not say we are beautiful. \nI think\n\"Everybody here has got somebody to lean on,\" should be changed into, \"Some here have somebody or something to lean on.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nThis cover will give you goosebumps!\n\r\nListen to Don't Panic by Clairity on AppleÂ Music. itun.es/us/…\n\n\n", "comment_170": "\nthis song is great for when you're feeling depressed, I seriously just listen to the verse \"Oh all that I know There's nothing here to run from 'Cos yeah, everybody here's got somebody to lean on\" cuz if im sad it makes me realize the good things i have....this song is definitely one of my faves\n\n\n"}