{"comment_0": "\ni love this song . . . its about a true love relationship that ended . . . and it will never be forgotten and no one can ever take their place . . . its a once-in-a-lifetime kinda thing, and even if the relationship didn't last the memory WILL last a lifetime . . . so for all you people who had one of these relationships . . . stop trying to forget about them, its not gonna happen, live with it . . . you loved them and you still do\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nsorry justinabeana, but everyone hates mariah carey. :D\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nNot everyone :-p ...i love mariah!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nomg i luv it!!  nt so keen on mariah, bt i jus bought her cd! this song is sooo sweet!!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nMariah Carey = Singing Pornstar\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI love this song too... but one thing really bugs me... if the relationship was that good and 'we were bigger than anything'...why did the relationship 'die'? I wish the song explained that part!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nme and this boy were best friends for a year. he cheated on hsi girlfriend with me, and when they ended we were going go go out, but it justw asn;t right because we didn't want to lose our friendship. its a lot more complicated than that, this song just about sums up everything, from the nights when i used to talk to him for hours, and how i'll always have a place in my heart for him and how yourr first true love never dies. because somehow, what we had was more than lust, i really think it might of been love. this may sound nieve of me, but i cannot explain the situation properly because theres just too much detail!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nMariah carey is a hoe...and a diva...and a slut/bitch/ ect. yes we all no. but REGARDLESS, she really does have the most beautiful and powerful voice ever!!! I mean I'VE NEVER heard anything like it....I never even knew anyone was capable of singing the way she does. I mean seriously ladies and gents- if thats not talent...then what is? \r\nand dont forget about is an ok song.....even though it doesnt completely showcase her voice.......luv ya ppl bubi!! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nMy GOD.  They have been playing this song over and over and over and over and over and over and over again.  I'm SO sick of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI had a really hard breakup and this song sums it up well. i miss what we used to have so much. great song\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nwe belong togheter part 2\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nWhen I first heard this song I broke down. This is my realtionship with my ex boyfriend to a tee. Everything in this song is true and it's almost like she is singing about us. Her ex just seemed to forget about her and she just can't help but to hurt because of it and she is telling him that no matter what happens she doesn't want him to forget about her and she says that she can tell just by looking in his eyes that he feels the same way and wants to be with her too.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthe problem with mariah is that she cant sing!!\r\nher voice becomes really irritating in we belong together, when she shouts. dont forget about us is an okish song\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthe problem with mariah is that she cant sing!!\r\nher voice becomes really irritating in we belong together, when she shouts. dont forget about us is an okish\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nYeah, I agree with Kaneda.  It's basically a We Belong Together part 2.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nlove the song the video!!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI broke up wif me gf, and it was my first true love. And when she ended it i didnt realise at the time, but i was sayin the lyircs of this song 2 her! 'just dont forget about us', and 'remember the gud tyms we had, snow fitin and l8 nyts and the fun tyms, not the bad things arguin and stuff' i fink it is amazing how real life this song is, and wat a voice she has!!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI don't really like Mariah's new stuff. Her 90's music was amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nlove this song\r\nmariah has an amazing voice regardless of what you people say.\r\nshe hits such high notes, and at the same time can go really low.\r\nso what if shes a diva? who gives a fuck. she still has an amazing voice..\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nits about not forget about of a guy and , but not able to let go \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis is the only Mariah Carey song from the 2000s decade that I actually enjoyed!  lol\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThe song is written in a story form made to be relative for a girl who can't let go of the past. She believes what they had was unique and will never be replaced by any other partner he will have in the future. The lyrics emphasize that there is still hope and a possibility for it to work out, if given the chance. The rap section shows off confidence by comparing herself to the new partner and how she will never come close to his ex.\n\r\nIn my opinion, it sounds like young love or a strong infatuation that finally ended. No reasons specified, but I take it as \"the fire going out\". Some couples find that spark to keep it going and others are left trying to figure out what went wrong when it might've just been the wrong time and place. The lyrics are easy to relate to because it leaves out the reason of the break up and allows the listener/reader to add their own reasons. The song emphasizes more on happy memories, possibilities, and that irreplaceable feeling that makes it hard to let go of anyone who shared the same moment of feeling \"love\" between them.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nPersonally I think that this Mariah Carey thing and also other pop music artists like Katy Perry, Jonas Brothers, Pussycat Dolls and other \"talents\" have a decent voice, marketable features, like decent sized boobs, and fairly quiet personalities, just crank out money for the corporations (major fucking record labels). and all these songs are shallow, yet somehow many people can somehow relate to them, and many people are unfortunately unable to see through the corporate greed behind these cookie-cutter artists. And I do not think that these songs are bad, or that these people have poor singing talent, but I absolutely hate, with every fiber of my being the greed and money there is to be made through these artists, and the shallow people who buy these records and cannot seem to understand anything aside from their own feelings and buying something that sounds good, but in essence, has no meaning.\t\t\t\t\n\t\t\t\t\n\n"}