{"comment_0": "\nI can relate to this song so much my dad moved away when I was young and I lost contact with him. Now when I hear this song I cry every time I hear this song. Can anyone else relate????\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nDivorce is the worse thing that can happen to a kid. Especially when they are old enough to know what is going on. But my paents were never married and I never met my dad because he was in a different city. And my mom was working to try to support us. The song hits me the same way. They don't have to be divorced. Just saying.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthis song hits me so hard every single time\r\nwatching a divorce is one of the hardest things ever\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI love this song!\r\nI agree with tugboatlove1, I definitely think its about a divorce...\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nyeah, it's obvious it's about two parents getting a divorce. and i'm sure it's about when it happend to his parents. to me this is the most meaningful song he's written. it's beautiful, heartfelt and true to life. \n\r\n\"So its up to to you, and its up to me that we meet in the middle on our way back down to earth.\" \r\nto me that line is about his mother, his father, and himself deciding where they should meet up so justin can go with his mother or father, depending on which one he's with at that time. it's up to him and it's up to them. \r\nit's at that short time when him and both of his parents are in the same place, and to him it feels like they're a normal, down to earth family. \r\nim probably wrong, but that's what i got out of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is beautiful, i feel sorry for anyone else that has to go through their parents divorce\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nYehh, this is the most meaningful song on the album, it's also Justin's favourite song too. Im glad this one is his favourite cos it shows his deeper side and helps everyone else understand him more too. Its pretty obvious that his past has helped turn him into the strong brave person he is today. As hard as divorce is, you have two options, you can cry and cry and cry, and give up, or do the crying, pick yourself up and battle through it. I'm glad Justin did the latter! with all that behind him, its no wonder he no longer fears easily. \n\r\nI think this kid is going to be a mega-star like MJ was. \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI can really relate to this song. Its so genuin and real. \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nIt's really deep and I really like this song cause it's a little different from everything else on the CD, and I love Justin, so I feel bad for him that his parents are divorced, and mine are too.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nmy parents got divorced,nd my dad raised another family far away.so i live with my mom and treats me good but her bf is the one that bugs me.my parents still talk nd i see him onece in a while.but i want to see him everyday.i sing this song everytime i miss my dad. i told my dad to look this song up and he told me he cried. I LOVE YOU DADDY <3\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ni honestly love justin bieber and i totally agree that the song is about divorce, but i would just like to say that his mom and dad got divorced when he was 10 months old. now that is very rough, but he probably doesnt remember the fights and the arguments and stuff, which makes him soo lucky\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI honestly don't like Justin Bieber. This song, however, is beautiful. His voice on it is great, so are the lyrics. He did a great job on this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthis is the best song ever, it has so much meaning, i love this song and JUSTIN BIEBER!  <3<3<3<3<3<3<3<3<3\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is so heartbreaking! I cry every time i hear it, also because i can relate that much to it. \n\nThe song is about his parents getting divorce, and how hard it is at a kid to see the parents move away, and you stand in the middle, not really ready to see it all change.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI can relate, my parents will be divorcing soon. I'm not sure how to feel about it. \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI never thought that it be easy\r\nCause we're both so distant now\r\nAnd the walls are closing in on us\r\nAnd we're wondering how\r\nNo one has a solid answer\r\nBut just walking in the dark\r\nAnd you can see the look on my face\r\nIt just tells me apart\n\r\n*In this verse I think he is saying he knows things are going to always be difficult with his parents and now he is just trying to figure out why it had to happen the way it did. He keeps asking why it had to happen but no one is giving him an answer. (But just walking in the dark, and you can see the look on my face, it just TEARS me apart.) He is saying that his life took a turn and he has to deal with a subject he has never learned to deal with and he has no idea what to do. *\n\r\nSo we fight (so we fight) through the hurt (through the hurt)\r\nAnd we cry (and cry and cry and cry)\r\nAnd we live (and we live) and we learn (and we learn)\r\nAnd we try and try and try and try\n\r\n*We have to get through it together and have to live through every battle we go through no matter how much it takes.*\n\r\nSo its up to to you and its up to me\r\nThat we meet in the middle \r\nOn our way back down to earth\r\nDown to earth down to earth\r\nOn our way back down to earth\r\n(back down to earth - repeat)\n\r\n* It all of our jobs to be able to live like we never had to live before. When the divorce is done and over he is trying to wake up from the awful nightmare that he just lived in reality.*\n\r\nMommy you were always somewhere\r\nAnd daddy I live outta town\r\nSo tell me how could I ever be normal somehow\r\nYou tell me this is for the best\r\nSo tell me why am I in tears\r\nSo far away and now I just need you here\n\r\n*This verse is about him just begging to have a more normal life (in family terms). He is trying to say \"Mom you tried your hardest to be there for me when I needed it the most, but you still had to provide for me and you and Dad you moved away and I can't even see you everyday, but yet you tell me everything is going to be okay, when we both know it isn't going to be. Mom and I are both wrecks about it and I just need you Dad.\" He needs his father back into his everyday life and he can't grasp that he isn't going to be.\n\r\nSo we fight (so we fight) through the hurt (through the hurt)\r\nAnd we cry (and cry and cry and cry)\r\nAnd we live (and we live) and we learn (and we learn)\r\nAnd we try and try and try and try\n\r\nSo its up to to you and its up to me\r\nThat we meet in the middle \r\nOn our way back down to earth\r\nDown to earth down to earth\r\nOn our way back down to earth\r\n(back down to earth - repeat)\r\n*Same as before*\r\nWe fell so far away from where we used to be\r\nNow we're standing and were do we go\r\nWhen there's no road to get to your heart\r\nLet's start over again\r\n*He is falling from the top to the bottom of the hole. He feels like everyone is lost and no body knows how to turn life around and starting over is the only way for him to feel like he is back on the right track*\n\r\nSo its up to to you and its up to me\r\nThat we meet in the middle\r\nOn our way back down to earth\r\nDown to earth down to earth\r\nOn our way back down to earth\r\n(back down to earth - repeat)\r\n*Same as before*\r\nI never thought that it'd easy\r\nCause we're both so distance now\r\nAnd the walls are closing in on us\r\nAnd we're wondering how.\r\n~~~~~~~~~~~~~~~~~~\r\nThis is such a heart-felt song! Everything is so emotional and metaphorical! This is just my take on what this song is about. Everyone's opinion will be different than mine most likely, but that is the best part about finding meaning of songs. Every song will have a different meaning to everyone. Thank you for taking time to read my comment!\n\r\n:D\r\nRachel\t\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nmy pearents r divorced too i live with my dad who dosnt really love me\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nPlease read this. :(\r\nI stumbled across this amazing song just a few days ago and I love it. Every time I here it, I cry.\r\nMy parents divorced when I was about five or six, then my dad remarried a woman who treated me horrible, and my mom remarried a man who treated me horribly and my little bro bad as well. Then,a few years ago my dad divorced that woman and last year remarried a woman who is making strict rules and put me into homeschool. finally me and my brother told my mom about how our stepdad talks to us and treated us(it wasnt like physical abuse, just hard labor,etc.) and now she is going through another divorce. I dont know what to do. My life is so confusing right now, I feel like it just keeps spiraling downward. I feel helpless. We used to go back and forth every two weeks, but my mom works during the day, and we cant be home alone with our sep dad anymore, so my bro and I get to see my mother one day a week. I miss her. Im doing my hellish homeschool at her office right now but after she gets our of work, I have to go back to my dad's house for another week and a half before I see my mom. I just wish everything could start over. I feel so trapped. When the line of this song \"Mommy you were always somewhere, daddy I love out of town. so tell me how could i ever be normal somehow you tell me this is for the best so tell me why am i in tears\" comes thats when i realize how much this song mirrors my life and the tears spill over.\t\t\t\t\n\t\t\t\t\n\n"}