{"comment_0": "\nI think a lot of you are on the right track with picking up on the imagery the song uses, but you're taking it very literally. Rarely does a songwriter of Polly's caliber tell a story for the sake of explaining a series of events. It's almost always a conduit for something else.\n\r\nI agree for the most part with idoubtthat. To take that another step further and discard as much literal translation as possible, I think it's reasonable to see the song with dualistic meanings. It could very well be about the tensions and conflicts of sexual maturation. From my standpoint, though, it's always partly been an anthem for difficult childhoods. I think that separate avenue of meaning might be where a lot of the connotations of rape and molestation people are picking up on come from.\n\r\nGrowing up with a difficult, inflexible mother in specific, whose love and reliability are contingent on other things and who sees any assertion of independence as an affront and a betrayal, you learn that you have to lie and disguise yourself from a very early age. When it comes to maternal ineptitude and loading responsibilities on a child, you mature very quickly in order to cope, at the cost of your innocence. You become the mother to your mother. These dysfunctional dynamics in the mother-daughter relationship are very difficult to change once they've been established. It fucks you up and it follows you into your adult life. Most people who've been forced to revoke their childhood and act as adults when they're children end up later on being prone to immaturity and longing to make up for their childhoods as adults.\n\r\nThere will always be some level of personal interpretation that differs from person to person, but I think we all seem to agree on the general framework that there's ambiguity and uncomfortable tension between the mother-daughter roles, this is a story about lost innocence in some form, and the loss is being lamented. From there, it's a Rorschach connect-the-dots blank canvas for ourselves, as most songs are. And who really wants to take that kind of purging self-projection away, anyhow?\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI disagree with the people who are saying that maybe PJ had miscarried in the past. \"Daughter\" is symbolic as idoubtthat says. I think the daughter she is referring to is infact her younger self who was so innocent and perhaps upon losing her virginity she regrets it and yearns to return to her younger innocence (\"That blue eyed girl became blue eyed whore\")\n\r\nThe mother/daughter theroy also fits.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\n\"Some critics have taken my writing so literally to the point that they'll listen to 'Down by the Water' and believe I have actually given birth to a child and drowned her.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI didn't quite interpret this the same way. I think that this song isn't necessarily an allusion to her daughter loosing her virginity and the mother wanting her little girl back, but something more direct. I think that the disturbed narrator killed her daughter; the music itself and the strain in her voice supports this idea. Also, I think that the singer is moving in and out of reality; one minute she knows that she's killed her daughter, the next, she doesn't.\n\r\n\"That blue-eyed girl/ Became blue-eyed whore\"= This is what pushes the mother over the edge: she catches her daughter with a man.\n\r\n\"Just like my daughter/ See her again\"= The girl that she killed is no longer the same girl as her daughter; she's disassociated the two people in her mind (living, innocent daughter vs dead, non-virginal girl). She's disturbed enough to think that the dead body merely resembles her daughter, and she's wondering when she'll get to see her daughter again (she thinks that her daughter is gone, not dead).\n\r\n\"I took her home\"= A reference to the previous Jesus statement, she sent her daughter to heaven, away from her being a whore.\n\r\n\"Little fish, big fish swimming in the water/ Come back here man gimme my daughter\"= Since she killed her near the river, she's returned to it, or another river. I think that as she's saying this part, she is more detached from reality. She thinks that the fish is the one who stole her daughter and she's asking him for her back. \n\r\nWhen I hear this song, I picture PJ sitting dirty on a river bank in the dark, rocking and staring blankly into the water, muttering at the fish to return her daughter.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI interpret it as being about the loss of innocence... particularly when losing her virginity (whether by force or consensual). The daughter (blue-eyed girl) is symbolic of the innocent version of herself; the Mother is symbolic of herself after she looses her innocence... The \"Mother\" then longs for her innocence/innocent-self back.  \n\nIt's really a brilliant song, and there can be many ways to interpret it, as with a lot of PJ's songs. She's a great songwriter.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ni think this is about a crazy woman who finds something out about her daughter and is angry at her. she gets so mad she kills her down by the water. she heard her daughter screaming and she was telling her to stop but she didn't. she takes the body home, then realises what she's done. she killed her in the water so she is askin for the fish to bring her daughter back\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nYes,like she thinks her daughter is not pure anymore...something like Carrie's mother...it has a symbolic quality nonethless...like a fairytale.\r\nAnd she blames it on the \"fish\"=sex.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI don't think it's from a mother to her daughter i think it's from a boy to his lover. It doesn't say in the song that the girl is the daughter of the narrator it says \"just like my daughter\" so this is what it's about; there's this guy dating this girl and they love each other a lot but somehow the girl cheats on him and that's what \"becoming a blue eyed whore\"refers to.. And he has to leave her as a punishment although he loves her.. That's what i had to lose her to do her harm means.. But now he believes that she has suffered enough and just like a father always forgives her daughter he will forgive the girl.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nall I know about this song is that it freaked me out when I was a kid. It always had a dark, Grimm-esque fairytale quality to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\n\r\nThis song is not about PJ,  she is singing it from  \" man's point of view\"   Who-ever this might be. he, is where she got the ideal for this song.  \"  Down By the Water\" \n\r\nI lost my heart under the bridge to  \" that little girl\"  = man's  girl-friend / wife\n\r\nSo much to me and now i moan and now i holler she'll never know just what i found =  he'd found Love and later hate\n\r\nThat blue-eyed girl said  \" no more\"   That blue-eyed girl Became a blue eyed whore =  she said  \" no-more\"   ( didn't want him) and became a blue-eyed whore\n\r\nDown by the water  \"I\" took  \"her hand\"  just like my daughter   \" I'll\" see \"her\"  again  =  He  killed her  ...  and like his daughter who is dead, he'll see \"her\"  again as well. \n\r\nOh help me Jesus Come through this storm  \"I\"  had to lose \"her\"  to do \"her\" harm   I heard \"her\"  holler I heard \"her\" moan  My lovely daughter I took \"her\"  home. =  when she became a  blue-eyed whore  ... He lost her, and  did her harm.  And  \" just like my daughter\"  /   My lovely daughter  ...  I'll see her again. \n\r\nLittle fish, big fish, swimming in the water.\r\nCome back here, man, gimme my daughter.\r\nLittle fish, big fish, swimming in the water.\r\nCome back here, man, gimme my daughter\n\n\n\n", "comment_10": "\nThis song is weird. I dont know what it means, I just like the buzz sound throughout the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song is about how a woman who finds her daughter under a bridge. She had just lost her virginity and she's no longer the little girl her mother had known. She takes her home as an adult and the fish represent how she wishes she could have her little girl back.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI agree with what everyone says... I just wanted to say this is a great song. Wierd, but great.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni think she could be looking at her self in a past tense for example\n\r\n\"I lost my heart Under the bridge To that little girl \r\nSo much to me\"\n\r\n and she could have realized what had happened and made her feel in the present\n\r\n\"And now I'm moan And now I holler\"\r\n be some how guiding her out that situation like protecting her \r\ntrying to keep her from getting as far as she did in her present moment\n\r\n\"She'll never know just what I found \"\r\nthinking she could save her somehow\n\r\n\"blue eyed girl\"\r\nsometimes society perceives innocence and purity with angels white skin blue eyes\n\r\n\"Became blue-eyed whore \"\r\nshe was taken or gave her self \n\r\n\"I took her hand Just like my daughter \"\r\nWhat bond and love could be stronger then a mother and daughter. The bond with that a woman haves with her self and purity.\n\r\n\"see her again I had to  lose her To do her harm I heard her holler I heard her moan \"\r\nas in she couldn't help her  and now she is begging to recognize herself in her present tense\n\n\r\n \"My lovely daughter I took her home \"\r\nShe somehow subsided to what happened she's not beaten just guilty she couldn't change the outcome.\n\r\nShe address Jesus in these album in practically all her songs.\n\r\n\"Little fish, big fish swimming in the water \"\r\nhow we are baptized we are pure again we are reborn and this what she is trying to do knowing she couldn't save her otherwise \n\r\n\"Come back here man gimme my daughter\"\r\ngive her self her purity  \n\r\nI love this song I hope I didn't look so much into it but she does that to me pj is awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nGreat song. It really can mean anything, but I think that PJ often refers to a daughter in her songs. Maybe she has lost a baby in the past.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI agree with hellas\r\n\"give me my daughter\" could be a reference to a miscarriage\r\nbut there's definate sexual abuse references in there as well\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI do not think this song has to do with any sexual abuse in it's literal context.\n\r\n'Daughter' is symbolic. What is a daughter but a young girl that a woman has created, held within her, birthed, nurtured, and will protect at all costs? When we are little, our main role in our world is the role of daughter, and when we become older, we become sexual beings, girlfreinds, wives, employees, etc, and rarely stop to think of ourselves as our parents daughters... When a girl is a small girl, she has never been a mother, an aunt, a teacher, or anything esle. She is a daughter, an innocent, curious, naive, daughter.\n\r\nWomen often unintentionally try to keep thier daughters innocent and to themselves, forever, and in a subconsience attempt to do this, women often sheild thier daughters from the joys of life as they can present a threat to the daughters well being or mothers fear that they may; like sexual pleasure, men(women), and outside influences. Rarely done for any reason other than love, but very oppressive to the daughter just the same.\n\r\nI think every woman had an inner innocence that is now like an inner child. The inner child is so hard to find and relate with.\n\r\n I guess if you see the daughter as a symbolic part of her and not actual offspring, you find a different meaning altogher and that is how I see it.\n\r\nI do not think miscarriage has anything to do with it, and although I first thought it was about an abortion, I have concluded that I was still taking 'daughter' and 'loose her' and all that, way too literally. Abortion, I have concluded, is not relative to this song.\n\r\nI just thought I would throw you all some food for thought.\r\nI will summerize what I think quickly:\n\r\nThe singer is looking back at the discovery of her sexuality, whether it was through masturbation or her first gratifying sexual experiance. While she loved what she \"found\" and could not deny herself the pleasure, she had an inner shame about it, so she tried to essentially hide her sensual maturing side from her innocent simpler side. But she could not do it forever, and eventually she lost the innocence.\r\nMost people dont think of it too deeply, or they just have sexual liberation/sexual shame conflicts within and the conflict is not something they analyze... They deal or they don't deal, and don't realize it either way...But I think some do, but every girl/woman will all do it differently. \n\r\nWhen we totally loose our innocence, we may feel liberated, but still, the complicated days of innocence are somthing we still desire at times. In the transition life can be downright painful.  \n\r\nWhen she says:\r\n'Little fish, big fish' , she is creating a metaphor, the fish are her innocence and inner child(little fish), and the big fish, who in most cases will swallow the little fish, is the new, sexual, more empowered, her...  The big fish may have swallowed the little fish, either way the big fish has taken the little fish, and sometimes she misses the little fish. At some time during her transition into a sexual creature, she may try to find it, but cannot.\n\r\n\"Come back here man give me my daughter\":\r\nA plea to go back to her simpler times, before conflict and shame. She to be almost literally asking the man who took it(which I have no reason to believe she did not willingly participate, though we do go through a time when we blame the men who we have our first sexual encounters with, so that may tie in in that way)'it', for good; to give 'it' back as a desperate attempt to get back what she could not give back to herself...\n\r\n'just like my daughter to see her again' :\r\nI think that is her way of showing her innocence was succumbing to her new, sensually aware self, and she tried to keep the innocence inside alive, with all the ignorant bliss it can bring, but her innocent side was not a permanent thing, and was bound to be lost in the new her... \n\r\n\"I lost my heart under the bridge to that little girl, so much to me\" I do not think 'that little girl is her daughter, or innocence, but rather the other side of her conscience... Like the angel on one shoulder and the devil on the other, the little girl is the temptress, the devil on the shoulder... She lost her heart to that little girl, and though she tries to keep her daughter from seeing her, and hide what she has discovered \"she'll never know just what I found\"... But  little girl(her tempted side, her sexual side)obviously will not leave the daugher alone, and the daughter (her innocence)continues to see her( the little girl, the temptress and maturity)again...\n\r\nThe transition from being your fathers daughter to your boy(or girl) freinds lover, the transition from girl to woman, the transition from innocent to not innocent.... it is an emotionally tyring time so intense many girls are depressed, angry, scared, rebellious, and conflicted... Sleep overs with friends or sleeping WITH friends... Playing dolls or getting dolled up... Being a good girl or being a young, curious woman... The pain and excitement are very stormy, especially if the seeds of religion have been planted in your psyche, you may find yourself pleading \"Oh help me jesus, come through the storm.\" If adolescence is not a storm and not a time we are conflicted about our spiritual side as well as our sexual side,  then what is it exactly, other than in it;s literal sense? \n\r\n\"I had to loose her to do her harm\"... Well, the only way to harm the other side, to would be to loose it, vice versa... You cannot continue to grow as a woman, emotionally or sexually, if you hold on to your childhood and innocence. You may try to, and think you can just adjust that side... But that just makes yo naive. Naivity is ignorant and unhealthy, even if it is blissful for a while. So you would try to subdue that side, and realize you can't, it doesnt work that way, and that you cant ever return to being that innocent child, the 'pure daughter', now that you have seen, or \"found\" your \"mother\"(mother as in the woman you have become, a sexual and creative being of maturity), and since you can not subdue the little girl, or change her, you would have to loose her... And hence a woman is born... Though many a woman will still look back and wish they could be that little, innocent daughter again... And in dreams they often are. I think we look at our selves as women(big fish) and try to find the peace we once had as a small fish(innocent daughter)and try to find her even if it is just for a moment, so that we can remember the things we knew, that we didnt even know we knew, before so many other things in life(sex, relationships, etc)overcame us... \n\r\nThe blue eyed whore was the way she was viewing herself. She was a blued girl, now she is a blue eyed girl.\n\r\nHoller and moan are likely the sound of her innocent daughter dying. Or, they are the sound of the little girl, taunting her with the sexual pleasures... I think it depends if you are looking at the first part of the song, or the latter reference.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nPJ Havey's Pronounciation of Water/Daughter > Everyone\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ni agree with certain parts of idontdoubt's comment but basically this is the river situated where pj harvey used to live as a child and how she wanted to be a boy initially because she used to \"hang\" around with brother's mates and usually she would be left out and voila down by the river covers that.    \r\nnothing to do with her \"child\" whatsoever\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nsorry its idoubtthat not idontdoubt :P\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI always assumed it was about infanticide. Or, perhaps, an abortion.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI always regarded the bridge and the water as symbolic rather than literal, but the lost innocence of a mothers' daughter was plainly apparent.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI thought it was about abortion too, and PJ is closemouthed, so I'm not sure.\n\r\nThis song distresses me because I can't figure it out. Also, it's creepy. But I love it anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nAs I said in my earlier comments, I did at once think it was possibly about abortion or miscarriage. That was the first 2-3 times I heard it. After the third time, when I really listened to the lyrics, I realized it couldn't possibly be about a pregnancy of any literal kind; not an abortion, not a miscarriage, and not infanticide.\n\r\nThe following lines show that this is not a fetus and not an infant:\n\r\n\"That blue-eyed girl\r\nShe said no more\r\nThat blue-eyed girl\r\nBecame blue-eyed whore\r\nDown by the water\r\nI took her hand\r\nJust like my daughter\r\nSee her again\"\n\r\nHow on earth would this have anything to do with a pregnancy or fetus? And how likely is it that a baby could disobey and \"see her again\"?\n\r\nI don't see why/how it would be about any literal murder or death at all. \n\r\nAll the talk of fishes at the end of the song should show just how very symbolic the song is. Same as the blue eyes, I dont see how literal blue eyes would have anything to do with anything relevent to anything else she says.\n\r\nSeveredvox basicly said what I was trying to say, only doing so neater and more to the point, lol. I hadnt noticed Severed's interpretation when Iposted or I would have just said that 95% of what he/she said is what I would say too... And I could have saved myself so much time! \r\nWhat Raul7_7 said is interesting too... The fact that she grew up with boys down by the water was somthinig I did not know, but it helps explain why the water meant so much to the \"story\" of her sexual maturation. Growing up with boys and penis envy also explains why she is so focused on the 'girl' and the 'daughter' whilst discovering her sexual self; they aren't just great metaphors, but they have a real almost literal purpose as the metaphors as well. That just enriches the symbolism even further. Very cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song quite scared me really.\r\nI lost a certain innocence I had under a bridge and I just felt like a complete whore.\r\n\"That blue-eyed girl\r\nBecame blue-eyed whore\"\r\nOh and I have blue eyes. So in a strange way I feel connected to this song, it's strange.\n\r\nTo be honest, looking at the lyrics, in one way it could be about a girl getting sexually abused under a bridge and the singer sees her as a daughter figure (not necessarily her daughter) \r\nOr if you look at it another way, it's as if the singer is the one who sexually abused the girl under the bridge, and is regretting it.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\n\"So in a strange way I feel connected to this song, it's strange.\"\n\r\nShould read through my posts before sending them :|\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThe idea of the fish in the water seem to be mocking the man doing the harm to the girl. Perhaps he can hear her mother in his mind, \"come back here, man, gimme my daughter,\" as the fish swim around in the water by the canal where he is doing these awful things to a girl. I also think it's a new girl and he's doing the same thing he did to his own daughter to her.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI think this about a girl who is wither under a bridge wherein she gets pregnant and finds herself alone.  She late drowns the baby girl,and then is haunted by the guilt.\r\nIt fairly simple,and the people who see sexual abuse references (other than abadonment) are barking up the wrong tree,IMO.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI think this song is very simple, and not about abortion or murder: a woman, who lost her own innocence down by the water, is dismayed to find her daughter has gone and done the same. She loses her daughter's love as a result of trying to bring her back, of punishing her for straying: \"I had to lose her/To do her harm\"\n\r\nAnd the big fish, little fish are the sharks (men) who have taken her daughter from her, metaphorically-speaking, by taking her innocence, and by changing her (her daughter no longer wants to be the little blue-eyed girl.)\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nbruiseviolet, I was just about to post the same quote. It's about a girl who became a 'blue-eyed whore,' had a daughter and then drowned her in a river. \t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI think that perhaps this song is about a woman whose daughter is sexually abused. The mother blames the daughter for it and then drowns her in the river, then carries her body back home. Even though the mother initially blames the daughter, she goes on to realize that she was extremely at fault and can't forgive herself.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nanyone think this song could be from a mans point of view \t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\ni say that because calling her a whore and rejecting seems more a male point of view about sex especially with your loved ones no man likes to find out his daughter is sexually active\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI had allways interepeted it as a song about abortion in some way or another.\n\r\nIn other days unwed pregnant women would often either be sent to a convent, or would hide their pregnancy and then kill the child later, usually by drowning.\n\r\nEither she is taking her daughter to the river to help her dispose of it, or she is killing her daughter for getting pregnant, or she herself is pregnant and killing her daughter.\n\r\nI took her 'home' could be referenced to heaven.\n\r\nThat blue eyed girl - infants often have blue eyes. She also could be projecting her own sin on the baby, or reffering to herself when she says blue eyed whore.\n\r\nlittle fish big fish give me my daughter - the undenidable guilt and distraught she would have after the act. Dellusionally calling out to the fish to bring her back.\n\n\n\n", "comment_34": "\nSomething I posted on youtube very recently.\n\r\nI've just concluded that it's about a young girl losing herÃ¯Â»Â¿ innocence (by either being raped, pimped, or both) and her Mother finding her lifeless body by a river or lake.The end verse (little fish big fish/give me my daughter) is the Mother begging for her child's stolen innocence back. \n\r\nThe end of the song is pretty terrifying when you think about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nIts a true story.She read an article about a woman who read her daughters diary and found out she lost her virginity.The women was extremely religious and just brought her down to a river and drowned her.Pretty simple really and quite terrifying thinking the lengths some people go to for religion.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nOk firstly they have to correct the typo as the line is \" and now I moan\" not \" and now I'm moan\". If people would just Google there are plently of comments by PJ stating she can't believe people actually think it's about her drowning a daughter or having an abortion...etc. It's all abstract and not literal. Everyone on here is saying the first bit is about losing virginity to a guy. The lyrics CLEARLY say she lost her heart to a girl, not a boy, under that bridge. After that I can't be bothered trying to figure out the rest however the few on here who said they feel the daughter is a metaphore for her younger self I think are leaning in the right direction...she has no children.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI heard in an interview with PJ Harvey that it is about a mother who drowns her own child, right after this song came out lots of people thought it was a true story and were questioning her about it all the time!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI always thought I was about a lady who caught her daughter having sex and was ashamed of what she found (her daughter having sex with another guy under the bridge). The mother thought her daughter was pure and to her she became a whore. The \"little fish, big fish\" part is like the phrase \"There's alot of fish in the sea\" and maybe her daughter slept with a lot of them. She is asking the men (the fish in the sea) who stolen her innocents to come back and give her the daughter she once knew that was pure. \" I had to lose her to do her harm\" maybe she had to let her go and be the whore with these guys before the mother would hurt her (let her grow up and be free before the mother loses her mind and worry). That's what I got out of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nPerhaps this has been suggested before, but I think that the song is about the refer over lost innocence. A girl (PJ?) was raped under a bridge. The rape resulted in a pregnancy that was aborted. PJ compares the girl that she once was to the girl that would have been her daughter. \"She said, 'no more',\" is a slightly odd phrasing for a victim of rape (instead of just \"no\"), but is worded this way because it's a double entendre for the silence of her daughter. ( \"She said, \"no more',\" becomes \"she said no more.\")\n\nWhen I was younger I interpreted this song differently. Then I heard her equally haunting song, \"Under the Ether\", which is about the actual abortion.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nTo me this song is about a rape. When she says \"that blue eyed girl became a blue eyed whore\" I take it as after the rape she was still judged. She got pregnant because of her rape and aborted the child. Later she regrets killing her baby. I don't know...that's my interpretation at least. \t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis song is about a woman drowning her daughter.not to hard to figure out.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nShe caught her daughter losing her purity and drowned her.little fish big fish part is she realizes what shes done and pleads to have her daughter back.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nIts a song explaining from a mother point of view the phenomenon of prostitution .The hole chain of trafficking ppl.Where the \"fish\" stands for the proxennet.\r\nMother lammenting about her nonreturning girl :( The bridge may have multiple meanings.Some exagerations on behalf of the mother from the past or simply the nonreturning point of an given situation.\r\nPS: escuse my poor english\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nIt is about heroin. About how it corrupts. Like you've murdered your innocent pre-heroin existence.  Lots of colourful metaphor in this; bridges, water, blue eyes wanting the return of innocence.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nIâ\u0080\u0099m inclined to interpret this as the narrator being the mother to her younger, unabused/ innocent self. \n\r\nHowever, my personal relationship to this song is much more literal. After a decade of Family Court-enabled domestic violence my lovely daughter killed herself. I heard her holler and moan for years, only to take her home in a box. She was terrified of water because of something her father did to her. There was never physical evidence of abuse. For legal reasons, our voices were ignored by authorities. After her suicide, I found her last texts, strongly suggestive of incest. I had â\u0080\u009cto do her harmâ\u0080\u009d by obeying the law. I should have fled abroad with her as a baby, or taken up the offer of others to have her father killed. She was no â\u0080\u009cwhoreâ\u0080\u009d, but her father made her feel like one. I feel so guilty for failing to protect my lovely daughter. \t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI could be wayyy off base, but maybe the event that she's talking about is her/narrator catching daughter with a \"blue eyed girl\" & her/narrator's reaction to it. Still trying to figure out \"She'll never know\r\nJust what I found.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nHelp! What does this song mean?\n\n\n", "comment_48": "\nI'm picturing a song writer coming up with words to a melody.  He is thinking of words that will rhyme and fit a mood without concern for a story line.  That's why the artist can't explain it and we can't figure it out.  It's just a cool song.  \t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI think that this song is about a young girl maybe being sexually abused under a bridge or losing her virginaty under a bridge near river and Pj Harvey is her mother...something like that its really strange but a work of art.\t\t\t\t\n\t\t\t\t\n\n"}