{"comment_0": "\nI believe this song is about the narrator coming to the conclusion that the real world is really, a big mess. He thinks that our lives are merely dreams due to how unnaware we are about the real giant mess our world is, but as he says \"Leave me to dream\", he is admitting that he likes to live in a dream, because with that mentality, he is free to do anything he wants, to reach all his life goals, just like you can control a dream. Long story short, we want life to be a dream, because in a dream, everything is possible, in life it is just much harder.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nSo this song kinda touches up on modern issues. So today, we depend on the news to tell us what's happening in the world. And in this song, the \"I\" or the narrator, has seen he need and everything and believes it. Therefore, he believes the world is find. \"The colors you painted in my head\", refers to this. But the narrator soon realizes that the world is in chaos. The lies he has heard are to keep the world calm. As if they were in a dream. When in reality everything's mess.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWow. This is impressive. A song so simple and that doesn't state it's direct meaning, but has 3 main meanings and a 4th possible implied one.\nProtected Childhood\nNot being Aware of World Problems\nNot being Prepared for the Real World\nAnd of all things: Imagination\n\nI'm not going to do this line by line because the song is so fractured, but here we go.\n\n(Protected Childhood)\n\nAnd I watch from a distance seventeen\nIn the eyes - Of a teenage crystallized\nOh the prettiest of lights that hang the hallways of the home\nWe have the curtains drawn and closed\n'Itâ\u0080\u0099s not what you painted in my head - We all are living in a dream - But life ainâ\u0080\u0099t what it seems'\nOh, I know all your reasons - To keep me from seeing - Everything is actually a mess\nBut now I am leaving\n\n'Distance 17' is an age. The age of 18 is when most people are considered adults and can live on their own. It's the minimum age a child is supposed to be protected till, or \"distance\" in this case. So it means \"I couldn't really see for 17 years.\"\n'In the eyes - Of a teenage crystallized' and 'Oh the prettiest of lights that hang the hallways of the home'  Means that he had a nice home or was rich because this implies chandlers or colored light fixtures.\n'We have the curtains drawn and closed'  They don't look outside or more specifically, aren't bothered by it. Whether because they don't look out or this child isn't allowed to look out is personal preference.\n'Itâ\u0080\u0099s not what you painted in my head - We all are living in a dream - But life ainâ\u0080\u0099t what it seems'  Easy meanings. \"Life isn't what is what I though it was\"\n'Oh, I know all your reasons - To keep me from seeing - Everything is actually a mess'  It's that child saying, \"You didn't want me to see the problems of life, and I know why. This is horrible.\" The child saw what it had been protected from.\n'But now I am leaving'  The child is saying \"I'm 18 now, and i have to live with these problems.\n\nNot being Aware of World Problems\n\nOK, most of the lines from before apply here too\n'And the cries from the strangers out at night - They donâ\u0080\u0099t keep us up at night - We have the curtains drawn and closed'\n'Itâ\u0080\u0099s not what you painted in my head - We all are living in a dream - But life ainâ\u0080\u0099t what it seems'\n'To keep me from seeing - Everything is actually a mess'\n'All of us were only dreaming'\n'Iâ\u0080\u0099m just in the tier of everything that rides below the surface'\n\n'Itâ\u0080\u0099s not what you painted in my head - We all are living in a dream - But life ainâ\u0080\u0099t what it seems'  They hold the same meaning as with childhood.\n'And the cries from the strangers out at night - They donâ\u0080\u0099t keep us up at night - We have the curtains drawn and closed'  \"We don't care about other peoples problems so we ignore them.\"\n'To keep me from seeing - Everything is actually a mess'  Also holds same meaning\n'All of us were only dreaming'  \"I/We were stupid for thinking life was easy.\"\n'Iâ\u0080\u0099m just in the tier of everything that rides below the surface'  This is a beautiful line, while it has no meaning the first time, in context to the song it means \"This is the first challenges and problems, I know there's more I haven't considered\"\n\nNot being Prepared for the Real World\n\nI won't repeat the same lines again\n'In the dark'\n'And Iâ\u0080\u0099m short of the others dreams of being golden and on top'\n'In the dark'  He doesn't know what to do. He's never had to do this before.\n'And Iâ\u0080\u0099m short of the others dreams of being golden and on top'  This means \"I'm not where I wanted to be by now.\" it could also show that he had friends or competitors that are doing better that him, but started at the same time as him.\n\nNot those are the Pretty much directly stated meaning. I didn't go too in-depth because the song it have no solid details. It's a trademark of Imagine Dragons that lets you make your own meanings and put your life problems to their songs, but it make direct meanings near impossible to find most of the time. I say this because this next part may not truly be a meaning or could just be something only I understand.\n\nImagination\n\n'Itâ\u0080\u0099s not what you painted in my head'\n'Thereâ\u0080\u0099s so much there instead of all the colors that I saw'\n'But I wanna dream - I wanna dream - Leave me to dream'\n\n'Itâ\u0080\u0099s not what you painted in my head'  This on it's own means \"It's not what I expected\" but instead think about it as \"Itâ\u0080\u0099s not what I imagined\"\nNot I want to point out the interesting wording on these 2 lines.\n'Painted in my head' and 'Colors that I saw'\nYou use colors in painting and if painting in the first line is means Imagination, then the second line could mean \"Thereâ\u0080\u0099s so much there instead of all that I Imagined'\nThey both boil down to \"Itâ\u0080\u0099s not what I imagined\"\n\nBut there's one more part to this meaning. 'Thereâ\u0080\u0099s so much there instead'\nThe 'There' it could be referring to could be the 'Head' from the first line.\nThe true question I'm asking is is what does the guy think is in his head if it's not imagination. Knowledge? Lies? I don't know, but look at the last lines.\n\n'But I wanna dream - I wanna dream - Leave me to dream'\n'I wanna dream - I wanna dream - Leave me to dream'\nIn the other part of the song the word 'Dream' has been used to mean \"Wrong\" But that doesn't work here. in these 2 lines Replace the word 'Dream' with \"Imagine\"\nHe's saying he doesn't want to deal with the worlds problems. He wants to imagine, or create, or maybe I'm completely over-analyzing and he's asking to live his life in ignorance of the worlds problems. And to leave him let him do that in peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIn my opinion this song is a commentary on society and how people live their lives. He comments on how people care about \" being golden and on top.\" He also comments on how we sugar coat our problems (poverty for example) and ignore them \"The cries for strangers in the night don't keep us up at night we have the curtains drawn closed\".\nAnd then he says he wants to be left to dream and leave the mess and sorrows society has left for him.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI feel that this song is about how people often hide their problems from themselves. But really deep inside we need to admit our issues.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think it is about a recently graduated high schooler's view of life. He thinks he's not ready for what's about to come, to live alone without his parents that had he living in a 'dream'. He is aware of what's coming and he feels scared, so he wants to keep living in the 'dream', where his parents take care of him and he doesn't need to worry about anything.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI believe that this song is about how people just pass off that the world is just a complete mess.  That there are people starving, drying, and living on the streets.  That this \"dream\" is what we believe the world is happy and dreamlike. He wants to stay in the dream,  he doesn't want to face the world,  he'd rather dream that everything is okay. \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI was at the debut concert for the Smoke+Mirrors tour last night, and Dan talked about how for him personally, this song was about living with health problems (he spoke about his night blindness, ulcerative colitis, etc) - and presumably about pursuing his goals and shaping his world the way he dreams it could be in spite of them.\n\nAs for the wider, more general meaning, I would go with pedro5qd's interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n* sigh* ok here we go...\n\r\nThis song makes me cry whenever I hear it...\n\r\nTo me, this song is about someone realizing the world is actually a mess\r\nTheir parents did their best to protect them from the evil in the world, they created a \"dream\" world for the person \"the crys, from the strangers out at night, they don't keep us up at night, we have the curtains drawn and closed \"\n\r\nAs this person grows up, they realize that everything wasn't as they thought, \"We are all living in a dream\"\n\r\nThey decide they don't want to live in a world with this evil.. They just want to stay in the world their parents created for them \"i wanna dream, I wanna dream, leave me to dream\"\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI have an invisible chronic illness and this song hits me on a deep level. I always dreamt of this stage of my life and instead I have depression, pain, and I never leave the house. I often find myself imagining what life would be like if I had not had this burden. I also imagine the future if I am cured of this. I lie in bed and I have to force myself to get up and face the reality that is my life now. I wish I could always dream and imagine because it is my form of hope. I hate this reality and I don't want to accept that \"everything is actually a mess.\" This song hits really close to home. That's just what it means to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song means a lot to me, it make a part of me feel free to dream. I like my dreams. I often imagine what kind of life I want, like what I want changed in my life. And there's a lot that seems A LOT better in my head. Sadly that is not how life works. Sadly I am stuck in this reality.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nFor me it hits on a personal note as you can relate any song you want to fit you life. But the part where he says \r\nâ\u0080\u009c Oh, I know all your reasons\r\nTo keep me from seeing\r\nEverything is actually a mess\r\nBut now I am leaving\r\nAll of us were only dreaming\r\nEverything is actually a messâ\u0080\u009d\n\r\nTo me that I related to my marriage. I knew something way wrong and I knew the reasons it was wrong and when I left I realized it . And I think the all of us dreaming was me thinking I could continue with my marriage even though I had grown and changed from what I was 13 years ago. It just reminds me of the times I would listen to it and think about how I donâ\u0080\u0099t want my marriage to end but knew it wasnâ\u0080\u0099t good \t\t\t\t\n\t\t\t\t\n\n"}