{"comment_0": "\nI think this song is simple.\n\r\nTwo lonely people--Eleanor Rigby and Father McKenzie--are the subjects.\n\r\nEleanor Rigby lives in a pretend world that she made for herself because she is so lonely and unknown--she goes into a church building after a stranger's wedding is over and grabs the rice to throw, pretending she's getting married. When she goes home, she sits by the window and smiles out, either hoping to grab someone's attention or pretending she has (\"Who is it for?\").\n\r\nFather McKenzie is a preacher that is probably used primarily for wedding services and his actual preaching isn't really well-attended. He spends all night fixing up his clothes to look good for a sermon no one will go to (\"What does he care?\").\n\r\nIn the finale, Eleanor has finally died, leaving nothing but her name (which is on the tombstone), and McKenzie was the one who buried her (because a burial is done with hands and a shovel, he got dirt on them and wipes it off). Because nobody came to her funeral, no one was \"saved\" by the sermon he had planned for her.\n\n\r\nThat's the story--as to its meaning, it may simply be a lament for all the people in the world that have no one.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ni work at this place where i call people up and survey them, and this old lady that was willing to take it, and in the middle of the survey we just started talking, and she was talking about how her husband died, and she just started crying, and i thought... i wonder if i'm the only one she has talked to in a while.. and it made me sad that i can't help all the lonely people.. and this song reminds me of that\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThough it is one of my favorite songs I always feel a bit uncomfortable hearing it. \r\nIt always seemed to me as if the lines \"All the lonely people, where do they all come from? All the lonely people, where do they all belong?\" implicate on the listeners and accuse them of being a part of a cold and inhumane society.\n\n\n", "comment_3": "\nI've had an inspiration about the meaning of this song and joined specifically so I could share my inspiration. I have not read all the comments because there are a lot but I read most of them and none of you got this. A few hinted at it but none of you got this.\n\r\nI'm going to come right out and say that this song was directed at the church. This song was directed at Christianity in general. Singing about Father McKenzie was not singing about a random individual who happened to be a church leader. For the purpose of this song, Father McKenzie =IS= the representation of Christianity. \"Ah, look at all the lonely people\" and \"No one was saved\".\n\r\nYes, there is a hint of a connection between Father McKenzie and Eleanor Rigby. But the song is not saying that they did anything together. The two might never have even spoken outside of the usual church banter. What the song is suggesting is that there should have been more of a connection between Father McKenzie and Eleanor Rigby. But \"No one was saved\" because Father McKenzie was too busy being self-righteous, too busy \"writing the words of a sermon that no one will hear.\" This song is a bold-faced accusation against the self-righteous and overly religious that refuse to reach out to the all the lonely people and then wonder why so few come to church.\n\r\nThis song is saying that it isn't enough to be friendly. This song is saying that as long as people, especially religious people, remain cold and aloof, the Eleanor Rigby's of this world will continue to die and be \"buried along with her name\". A person's name is very important in Judeo-Christian values.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis sounds crazy, but I'm a great fan of Dickens, and whenever I hear this song, I think of Miss Havisham. Especially at the beginning part of it. To all who are unaquainted with Miss Havisham, she is a character in Charles Dickens' Great Expectations (a very good novel, by the way.) She was jilted on her wedding day as a young girl, and her heart was broken. She stopped all of the clocks in her house at the time she was jilted, shut up all the windows, and left everything just as it was. As an old lady, she sits in her wedding dress and veil, the wedding feast still sitting out, rotten, in the dining room, and meanwhile exacts her revenge on men with her beautiful, unattainable adopted daughter, Estella. Eleanor Rigby's lonliness and her constant sort of waiting state always bring Miss Havisham to mind. So there! By reading this post you got one bibliophile's strange opinion and a literature lesson all in one!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think Father McKenzie and Eleanor were meant to be together but never were. Two lonely people who could have been together. She was frequenting the church where he worked and he was the only one who attended her funeral. He came as a friend because he picked up dirt to throw over her. It's sad because if you are a lonely person, you never know how close you may be to someone else who is lonely.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis is obviously a song about lonely people. It seems that Eleanor Rigby was a lonely single person, she often went to Church, perhaps to ease the emptiness that she felt inside, maybe she even hoped to make friends there. Whilst in Church perhaps she saw the rice left over from other peoples' weddings, and often regretted that she had never had the chance to get married or have a family. \n\n\"Wearing the face that she keeps in a jar by the door\", suggests that like most lonely people, she hid her unhappiness whenever she left the house and tried to appear happy like everybody else. \"Window\" and \"Jar\" suggests that her outward attempts to hide her unhappiness didn't work very well and was easy to see through, as both windows and jars are glass.\n\n\"Died in the church\" perhaps relates to the last place she visited before she passed away, perhaps she was even found dead inside the church, either from natural causes or maybe even suicide.\n\n\"Buried along with her name\" seems to indicate that she was the last of her family, having no relatives, siblings or children of her own to continue the family bloodline, maybe she was the last remaining \"Rigby\" from her family circle and nobody left to carry the surname on.\n\nIn the UK it is a tradition that when people are buried for the closest relative(s) to throw a handful of dirt into the grave before it is filled in. Because Eleanor had no relatives or friends at her graveside, Father Mackenzie felt sorry for her, and decided to do it, hence \"Wiping the dirt from his hands as he walks from the grave\"\n\n\"No one was saved\" perhaps sums up how Father Mackenzie feels, nobody comes to his Church, all he does is bury people and he has had no opportunity to help anybody with their problems or feel like he has played a part in bettering somebody else's life. Perhaps Eleanor was so lonely that she committed suicide in the Church which would also be an alternative to \"Died in the Church\", and also why Father Mackenzie feels guilty at not being in the Church to talk to her and try to stop her from killing herself.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI really love this song and being a philosophy minor makes me love it even more.  I think the Beatles are pointing out where all this unhappiness comes from.  First off, E.R is most likely a nun or janitor (picking up rice) who wants to get closer to F.M, but because of Catholicism they can't be together (implementing religion for unhappiness).  Also, the next part about wearing a face in a jar by the door is referring to makeup worn to give the illusion of happiness or just putting on a front whenever in public to try to be happy like everyone else, but it turns out there are truly many unhappy people (so society as well).  The next part about writing words that no one will hear, has to do with F.M who is trying to help others but he can't even help himself because of a religion that is supposed to make life better, but is doing the opposite \"No-one comes near\" and \" a sermon no one will hear.\"  However, in spite of this he still blindly works hard at something that is a lost cause, \"darning his socks.\"  He is trying, but not really thinking because if he was than he would realize how unhappy he is and change his path in life. The last part about E.R dying gives a truthful yet sad example of what the outcome and future holds; E.R never married \"buried along with her name\" and I might be reading into it too much, but \"she,\" not in a physical sense, but in a â\u0080\u009cselfâ\u0080\u009d sense died before her body did as a result of the church.  Also the last lines about F.M \"wiping the dirt from his hands\" is almost like he is once again not reflecting on what has happened and blindly following something that has led to such anguish.  I think this song says a lot about the Beatles views on religion and we can't really dispute all of this...............\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI remember walking through the halls of my Juinor High school, years back, with hundreds of people bumping and pushing, and thinking: \"i wonder how many times i've seen these same people, and yet i've still never seen them before, i'm seeing them for the first time.\"\n\r\nThat's what this is about. Walking down the halls, you see all kinds of people, and everyone is there with a purpose. But you, just walking to class, are the lonliest, like a fish bowl, you are only a spektator. \n\r\nI think the lines \"Father McKenzie, writing the words of a sermon that no-one will hear\" and \"[Eleanor Rigby] waits at the window, wearing a face she keeps in a jar by the door\" are the most meaning full. The first one is like all the things you hear, and see, and that maybe someone has spent time working on, and you will never really see it, or remember it. The second one is like when you have a job where 'the costomer is always right,' and you always have to smile even though you don't have a need to, or you don't want to. It's pretty depressing trying to live life impressing others. I get this image of someone sitting in a run down, dark room looking out a window, which is a rather depressing scene, and the door bell rings. So she gets up and greets her guests with a surprised greeting and a smile. But then she goes back to sitting in her chair, looking out her gloomy window. \n\n\n", "comment_9": "\nit was not written after they was a tombstone with her name on it... actually, technically, that's not true, but the tombstone was not the inspiration.  most fanatics agree that this is largely a paul song, though paul's and john's stories differ about who wrote most of the song.  paul remembers taking the name eleanor from an actress he worked with (on Help!, I believe).  and, mckenzie was an alteration of the original name \"Father McCartney.\"  however, it was pointed out to paul years later that in a cemetery where he and john used to get drunk there is both a Rigby tombstone (not Eleanor Rigby's, but it does mention an Eleanor Rigby on it, I believe) and a McKenzie tombstone (John McKenzie if I'm not mistaken).  so, it is possible that the names may have caught paul's fancy by way of subconscious recollection from his youth.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI think that this song can be interpreted many ways, but I'll just comment on, what I consider to be, the two most obvious interpretations. The first is based on the more superficial and tangible. The song begins and ends talking about lonely people, and asks the question, â\u0080\u009cwhere do they all belongâ\u0080\u009d? The answer is obvious, with each other. If they were with each other they wouldn't be lonely. We all live in our own worlds. That's why Eleanor has a (public) face that she keeps in a jar by the door. We don't let others know the Real us. Why won't anyone hear the priest's sermon? It doesn't say nobody will be there, it says, â\u0080\u009ca sermon no one will hearâ\u0080\u009d. The congregation will be there, they just won't hear, or understand the sermon. We tend to talk â\u0080\u009catâ\u0080\u009d each other, especially when given titles denoting authority or alleging expertise. We all live in our own world, by ourselves and that is why we are lonely.\n\nInterpretation #2. There is no God. Lonely = alone with no invisible friends. Notice how the whole song revolves around religion. Eleanor (old church lady) is waiting for someone, â\u0080\u009cwaits at the windowâ\u0080\u009d â\u0080\u0094 this God that she has focused her whole life on.  But why are we so lonely? If we truly believe in all the stories of our wonderful invisible friend who loves and cares for us so much, and is always with us, then why are we so lonely? (because it is a lie and that is what the rest of the song is about) Pay close attention to the words  No One and NoBody and how they are used. The reason â\u0080\u009cno one will hearâ\u0080\u009d the sermon (and not nobody, denoting physical people with bodies) is because there is no God, no spirit or ghost listening.  â\u0080\u009cEleanor Rigby died in the churchâ\u0080\u009d also speaks to the way the church holds us back from our potential (guilt, original sin, comparing yourself to a perfect being, constantly worshiping authority  figure) and kills our individuality (â\u0080\u009cburied along with her nameâ\u0080\u009d). No people seemed to show up to this lonely person's funeral, except for Father McKenzie. It specifically states that no one  (not a body but an entity, a ghost or spirit) was saved. If you surrender yourself to your religion's tenets, shouldn't you receive salvation? And yet, for this religious person, â\u0080\u009cNo One was savedâ\u0080\u009d.  Well, there's a whole lifetime thrown down the toilet, which is the point of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ni think this song is about, you know how you walk down the street and see thousands of faces that you don't know or recognize and don't even think twice about?  well i think this song is about how there are these people (eleanor rigby and father mckenzie) and these sad things happen to them and no one knows them or cares so they don't really matter to anyone.  it's sad that people walk through life not really caring about others.  they get too involved in what's happening in their lives with work and whatnot and they forget that there are other people out their dealing with problems every day.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI don't think there's any deep hidden meaning here - I doubt Father McKenzie murdered Eleanor Rigby or had an affair with her. It's far simpler than that; the song is simply saying that they are two equally lonely people, living lives so close to each other but never realising that they could give each other company and make each other happy.\n\r\nIt's just showing that if we all made an effort to connect with the people around us, the world would be a little less lonelier... anyway, it's a beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI can't believe no one has mentioned what I thought was always the obvious interpretation of this song - that Eleanor Rigby and Father McKenzie were strangers, yes, but their lives were still connected, even if only at the end, and they COULD HAVE helped each other. (And I don't even mean romantically.) I think in a way the Beatles are saying here that we must ALL work harder to love and connect with one another, and help prevent loneliness, and that it should not be that hard... maybe with someone right next door or right down the street even. (Like Rigby and McKenzie....) Or perhaps I'm reading too much into the song. ;-) heheh. I just think the song's not only about loneliness, but the irony that everyone suffers from it AND, most importantly, that it often could be so easy to cure.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nMy feeling from this song is that we are all lonely, but we aren't willing to do anything about it or help anyone else.  It's like we feel so sorry for Eleanor Rigby, but it seems nobody really cared for her.  She dreamed of happiness and marriage, but in the end, just died - lonely and unmarried.  We live, we die, nobody really cares.  The Priest obviously didn't help anyone either, he just went on living his useless life folding his socks, as if that makes him a good person.\n\r\nHow sad this is.  For the Beatles to be able to write this stuff, obviously they understood loneliness just like the rest of us.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nWhenever I listen to thos song, I always imagined an older wonan (E.R.) Who just recently lost her husband. \n\r\n\"Eleanor Rigby picks up the rice in the church where a wedding has been, Lives in a dream.\"\r\nThis is her rememnering her own wedding day. She picks it up to look at it and it make her daydream about her marrige to her late husband.\n\r\n\"Waits at the window, wearing a face she keeps in a jar by the door, Who is it for?\"\r\nSince the loss is so fresh, so sometimes feel like her husband should be walking through the door any minute, so she patiently waits her him there by the window. Look out for him.  The \"face\" she's wearing is a face of smiles and happiness that she plans to great him with. But who is it for? She knows he's not coming back.\n\r\nAs for F.M. Well, I always thought he was a different story entirely. That F.M And E.R are just two people who's have one common theme: They're lonely. \n\r\n\"Father McKenzie, writing the words of a sermon that no-one will hear, No-one comes near\"\r\nIn F.M's eyes. It seems people have lost faith in the church. They either don't come or don't really listen to the words that he preached which makes him feel like a man alone with his religion.\n\r\n\"Look at him working, darning his socks in the night when thereâ\u0080\u0099s nobody there, What does he care?\"\r\nSimply no body's there to care what he's doing. He might as well got some mending done.\n\r\n\"Eleanor Rigby died in the church and was buried along with her name. Nobody came.\"\r\nE.R is now dead and took her (and her husbands) name with her. And since her husband was all she had, one one was there to mourn at her funeral. \n\r\n\"Father McKenzie, wiping the dirt from his hands as he walks from the grave. No-one was saved.\"\r\nFron what I picture it, he was doing his typical father-type thing \"ashes to ashes. dust to dust\" (which might have picked up some other the dirt to do). After he's one with his jsut he walks away feeling hollow. He job is now just a routine that goes unnoticed and his words have no one and it's something he thinks about  while he wipes away the dirt.\n\n\n\r\nI, in no way, say that that's exactly what the songs meaning is. It's just a way I always interpret it to be. I just thought I'd share! Sorry if it's long.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nYou know that philosophy that nothing exists until it is seen?  For example, one could argue that until one sees this post on this site, it would not exist.  Or, one could say there is no war because they have not seen it.  I don't personally believe this philosophy (at least not to the extreme of my second example), but I think something like that is being conveyed in Eleanor Rigby.  It's evidenced in any lines that denote nonchalance (i.e. \"Nobody came\" \"No-one was saved\" \"What does he care?\")  It's like Eleanor Rigby hasn't been seen, and therefore doesn't exist, which is why no one came to her funeral.  And Father McKenzie has never been seen or heard, so his sermons don't matter to anyone.  I must say, I love the line \"Wearing the face that she keeps in a jar by the door\", because I can just imagine how that face must look, even though I couldn't describe it to save my soul.  The line also goes back to what I said before--if Eleanor Rigby keeps her face in a jar by the door, it can't be seen by anyone (Except while she's waiting at the window... but who would see her there?)  So there you have it.  Once again the Beatles prove that even the simplest lyrics can have profound meanings.  Good Job John, Paul, George, and Ringo.  You all rule!! ^^  (And Pete Best--you might've gotten kicked out, but you were still great, regardless.  We appreciate your work, because had it not been for you the Beatles might've never found Ringo and gotten famous.  Pete is 'Best'!!)\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI really like the way they say ALL the lonely people...where do they ALL come from. Like, you can walk through the streets of new york city and just be surrounded with people, many of whom are lonely. It's ironic. You can have everyone in the world in one room and still be lonely. I'm sure that's not the meaning of this song, but I just wanted to point that out. I really do love this song, though. It is so sad, and it's interesting as well that there are two main characters in a song about being lonely. Also, when I first heard this song and for a long time afterwards, I thought it said \"Father McKenzie wiping the death from his hands.\" (not dirt) which i know now not to be the lyrics, but it gave me a slightly different look at it, which I believe is meant to be part of the song, I just wouldn't have noticed it so much without misunderstanding that word: that the death of this lonely person, a tragic song, a tragic story, can be just wiped away, and the priest who buries her feels nothing but the constant numb of loneliness. He doesn't bury her with sympathy or loss, but with the sense that it is just another task, another day, and this ending to Eleanor Rigby seems to give her life no meaning at all. It is heartbreaking.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis one's very simple - the 'face in the jar by the door' is just make-up. 'Putting your face on' was a very common English expression in the 40s-60s. Many women wouldn't be seen without their 'face on' in those days.\r\nAnd Father McKenzie's dirty hands are merely as a result of throwing handfuls of soil onto a coffin as part of a standard burial ceremony, over which he persumably presided.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nok so let's get this straight. i'm pretty sure that the tombstone thing was just a coincidence, because you can read all about what truly happened on wikipedia. And John Lennon hardly wrote any of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI've always thought of it as a story of two people who lived alone, a man and a woman who never meet until Father McKenzie is performing Eleanor Rigby's funeral. To me it's a story of two people who missed their chance to not be lonely. It also seems to be asking the listeners to look around them and end the loneliness in their own lives and in the lives of those around them.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nTo me, it seems to be saying that everyone is lonely, the world is full of people who feel alone, who feel like no one cares.  Yet, in spite of this, some push on anyway, they work, they try to contribute, even if in the end no one notices.  They may get no results, they may remain alone, but they try regardless.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI think this song goes a little deeper than just lonliness.\n\r\nI think Father McKenzie is a representative of the Reaper. He \"wrote\" sermon for Eleanor's funeral and killed her, thus he is seen \"wiping his hands from the dirt as he walks from the grave\"\n\r\nAlso, they mention that Eleanor was buries with her name. This represents that, even in this lonely world, you aren't truly dead until you're forgtton.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI have to acknowledge that the song is a master piece.  I agree that it reflects the BeatleÂ´s point of view about religion and lonelyness.  And that is their very personal point of view...some people feel religion fills their emptyness, some others just keep following a religion to keep an image in the society and be accepted, then, maybe the song will be for that type of people.  To be religious is a choice never and imposition, we can never blame religion for lonely people...pleople choose to be lonely because there is always someone to rich to even if it is not family.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ni think, very simply, this is a song about having no one..like the chorus states \"all the lonely people, where do they all come from?\" the strings in this song just make it more beautiful and sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nthis song was written after they saw a tombstone with her name on it. it is a great song even though it has a sad tone to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nAnd Godhead covered this one. Both are good. \t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\ngreat song, sad tone which captures the feeling of being alone. another beatle classic\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis song is so clever in the way that it has an upbeat tune, but a very sorrowfull meaning behind it.  I think this song is trying to tell us that the whole world is alone, and the fact that we cant do anything to stop it amused paul.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThese lyrics are among the best of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI love this song,the string insrtuments,the melancholy of the song,and the lyrics.I think the obvious,it was about\"all the lonely people.\"Not having somebody to talk to,to be w/.It is sad,but the best.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nif you cannot be with yourself, how could you expect to be with anyone else? i absolutely love this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nAmazing song.  Very sad, but its a definite classic.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\npersonally, it relates to me because i am alone and i believe i'll die alone like father mckenzie and eleanor rigby did.  \n\r\ni've read that originally it was going to be father mccartney, but they decided against it with good reason and decided to scan through the telephone book and decided mckenzie had a good ring to it.  \r\nalso i've read that john had no part in writing the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThis song is tied for my favorite of all Beatles songs with Revolution 9. This song can relate to me  in so many ways, it just displays how the true lonliness of the world from my point of view. Lonliness grows on someone until it is the person\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nIn the Mid-eighties the name Eleanor Rigby was discovered on a gravestone at St Peter's church, Woolton, where John had first met Paul. The gravestone reads...\n\r\n\"..also Doris, W. Daughter of F + E Rigby died Dec. 24th 1927, aged 2 years & 3 months\n\r\nAlso Eleanor Rigby the beloved wife of Thomas Woods and granddaughter of the above died 10th Oct. 1939, aged 44 years, ASLEEP\n\r\nAlso Frances, Daughter of the above, died 2nd November 1949 aged 71 years.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nthis is the best song of all time. in every way. and 3ssence, i think you're right. maybe not an accusation, but it definitely says something about the way many of us are. and i can definitely relate to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nvery interesting zeus83\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\ni agree with RearChud37, i must say that this is such a beautiful song, i just like it.. enough said\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nzeus83...wow that is so interesting and insightful i never thought of it like that\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThis is one beatles song that is completely inocent, there is no real hidden meaning like there is in a lot of their songs.  This is one reason why i really love the beatles, they made you think unlike groups such as The Greatful Dead who just come on and with lyrics such as, \"driving that train, high on cocaine\".  The beatles weren't so open with certain parts of their lives which they might have not been too proud of (their massive drug abuse), so they used a lot more hidden messages to get their point across.  The beatles truly are one of the most tallented bands of all time.  This song is simply about being lonely, and haveing no one to talk to, and no one to care for.  A very sad song, but truthful and totally rad to listen too, it makes you think and appriciate all the people that i have in my life.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\na masterpiece ! a truely sad song. no hope, no future, sad and lonely people...where do they all come from. maybe, a little bit of me and you. great song !!!\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nit's a good song. no, it's a great song. one of my favorite beatles songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nIn one hundred years when students start explicating music along with poetry, as we do now, this will be the first song that they will study. A masterpiece\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThis Eleanor Rigby character must have had quite an impact on their thinking. It is one of their gloomier renditions but that makes it much more effective. Yes, a masterpiece.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nthis song is excellent, i love it so much and i love the strings...........just beautiful\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nInteresting theory...but I don't beleive it at all.  If it were about a prostitute, there wouldn't be so many references to church...and although music (and the Beatles) are notorious for not being simple to explain, I think this is relatively straightforward: E.R. is a wasted, washed-out shell of a person who doesn't belong anywhere, and ends up being just another person among the dead.  Father M knows it and, strangely for a father, doesn;'t care, 'wipes the dirt of his hands.'\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nPaul knew a woman from liverpool, that went to a church, and he thought everyone went to church for all the wrong reasons,\n\r\nFather McKenzie, writing the words of a sermon that no-one will hear\n\r\nand some went for the right reasons, yet they were so pre-occupied with god they had no time for happiness.  And this is what this woman was.  She lived and died lonely, even look.\n\r\nEleanor Rigby died in the church and was buried along with her name. \r\nNobody came. \r\nFather McKenzie, wiping the dirt from his hands as he walks from the grave. \r\nNo-one was saved. \n\r\nI have proof\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\noh i forgot, wearing a face she keeps in a jar by the door, means she only smiles when shes around others, and when shes home no one is there to see that shes un happy\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\ni think one of the most confusing lines in this song is \"darning his socks in the night when theres nobody there.\" does anyone have anything to say about that line?\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\ndon't you mean modest mouse's style is alot like this? alot of you have interesting interpretations. i, personally, think that the lyrics such as 'writing the words of a sermon that no-one will hear', 'wearing a face she keeps in a jar by the door' and everything else that is confusing is just there to give it a lonely feel. i think it's great. i try not to look to deeply it into it, though. to me, it's just describing the loneliness of two people. i think it's Paul's best song lyrically.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis song is like a lesson o be learned, don't die lonley basicly. This is my favorite beatles song mainly because it's orchestrate so well, the string in this song capure he whole mood of hte song and just pull you into the lyrics making you think about your life, and hopefully you aren't one of the lonley people they're talking about.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nthis song was voted one of the saddest songs ever indeed i agree i am very glad i am no eleanor rigby\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nThe beatles are such great story-tellers, both lyrically, poetically and musically. It is a beautiful song, yet hauntingly sad. I hate how the song just ends with that violin note and left it at that; in which the beauty of it's melodic strings dramatically lures you into it and its abrupt ending leaves you lonely already- such is the theme about the vivid characters in this sad story.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis is simply another perfect song by the Beatles.\r\nEvery word is perfect.\r\nEvery note is perfect.\r\nAnd the ending, combining the two vocal themes on top of each other, is the perfect icing on the perfect cake.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nseems to me a song about a lady who died without love\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI agree with you there, geckoman.  This is my favorite tune by the Beatles.  It so sad yet so rhythmic you can't help but sing to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\ni love this song.  i think all of you guys are right.  it's about living alone and about a lady who died and no one came, she had no love, family, friends.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThis song has a great effect on people- me and a few mates were watching Yellow Submarine while we were stoned, and when this song came on, my friend Steve said \"they're lonely..?\" And then two tears leaked out. It really tears at your heart.\n\r\nI saw an interview where the Beatles were being hounded because people thought Day tripper was about a prostitute, and Norwegian wood was about a lesbian. After Paul said \"we just wanted to write songs about prostitutes and lesbians\", the subject changed. A few questions later, they were asked what the song Elenor Rigby was about. John quickly answered \"two queers.\" A classic John moment.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThrice's cover of this song rocks.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\ni think it is about how society today is changing...not as many people go to church, and there are people who are ignored and lonely.  Eleanor Rigby and father McKenzie represent the people who nobody noticed.  Father McKenzie wrote the sermon although he knew that no one would be there to hear it.  Eleanor Rigby died and no one was ever going to remember her \"was burried along with her name\" and Father McKenzie was left alone...Lonely\r\n-Nelley\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nPaul McCartney got \"Rigby\" from the name of a store and \"Eleanor\" from actress Eleanor Bron. He liked the name \"Eleanor Rigby\" because it sounded natural. \r\n\"Father Mackenzie\" was originally \"Father McCartney.\" Paul decided he didn't want to freak out his dad and picked a name out of the phone book instead. \r\nA string section of 4 violins, 2 violas and 2 cellos were used in recording. Paul may have been inspired by the classic composer Vivaldi. The Beatles didn't play any of the instruments on this. All the music came from the string players, who were hired as session musicians. The last verse was written in the studio. Microphones were placed very close to the instruments to create and unusual sound. \r\nBecause of the string section, this was difficult to play live, which The Beatles never did. On his 2002 Back In The US tour, Paul McCartney played this without the strings. Keyboards were used to compensate.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nI think this song highlights how sad it is that father mckenzie and eleanor rigby never got together, they could have saved each other, two lonely people living close together alone every night so near to each other yet so far\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\na theory...\n\r\n\"[Eleanor Rigby] waits by the window wearing a face that she keeps in a jar by the door\" means that she is lonely and is waiting for love.  Maybe the part about wearing a face she keeps in a jar means that she isn't being herself or something.. meaning you should always be yourself \"all the lonely ppl, where do they all come from\" the where they come from part just adds to ppl not being themselves and making themselves be heard\n\r\n\"Father Mckinzey writing a sermon that no one will hear\"  means he has talent and could influence many people but isnt doing it.  \"darning his socks in a night when there's no body there\" means he's lonely.  father mckinzey teaches you to make yourself heard\n\r\n\"father mckinzey wiping the dirt from his hands as he walks away from the grave.  no one was saved\" means that if he had spoken up and got out there, and if eleanor had been herself and made herself heard, they would've been together, and saved\n\r\nmaybe not though!\r\nall of y'all's interpretations are wonderful\n\r\ni think they made it ambiguous on purpouse, so ppl could make their own interpretations, and many ppl could relate to the song.\n\r\nbeautiful song btw!!!\n\r\npeace\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI think this song is simply about being alone in the world. It's a great song but i get chills whenever i hear it. The strings make it even sadder, but it's a beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nobviously a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nThis song is good at asking questions.  It's only fitting that it makes us ask even more questions.\n\r\nI think that Father McKenzie and Eleanor Rigby lived together.  They are lonely people, but they are together.  They know each other, but no-one else knows them.  They are separated from the world.\n\r\n-Why is the rice IN a church?\r\n-\"Lives in a dream\"?  Dreams are usually good.  Does she not realize she's lonely?\r\n-\"Waits at the window...\"  What is she waiting for?  It doesn't say \"sitting at the window\", it says \"waits\"... Maybe she is waiting for a visitor?  Someone to rid her of her loneliness?  She is wearing her public face, waiting for someone, hoping someone will come.\r\n-\"Writing the words of a sermon that no-one will hear\". FORESHADOWING... key word is \"will\".  Eleanor will not hear the next sermon, because she will die before it.\r\n-\"No-one comes near\"  It sounds as if he is purposely being avoided by the rest of the world.  Eleanor does not come near because she is waiting at the window.  Makes me think of a nun and a priest, because they have their separate living quarters.\r\n-\"Darning\" means to mend, or to sew.  Why does it matter that no-one is there while he is sewing?\r\n-\"Buried along with her name\" makes me think that she had no influence on anything, as if she never existed (ironic that there is a song about her)... Her name will not be spoken again, because Father McKenzie has no-one to talk to.  If no-one comes near Father McKenzie, then Eleanor's memory will be buried with Father McKenzie.\r\n-\"Wiping the dirt from his hands\" just shows that he was the only one there.  He had to dig the grave and do the funeral.\r\n-\"No-one was saved\".  Is it the Christian meaning of saved?  Saved from loneliness possibly?  Because Father McKenzie is the only one left, maybe he is thinking that no-one was saved from death?\n\r\nNotice the contrast between the first verse, with Eleanor hoping and living in a dream; and the second verse, which uses the words \"no-one\" or \"nobody\" in every line, followed by \"What does he care?\".  Eleanor's verse isn't very negative, it's just strange.  Father McKenzie's verse is very very negative.  That's my view on it.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nAlso, I love this song because it expresses my biggest fear.  Being abandoned or dying a slow, painful death with nobody around would be the worst ways to die.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nthis song is like,every one is so sad and they are all\r\ndead almost,and all of the violins make it sound very pretty, and sad,its a depressing song,but there is a meaning,you just have to find it\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI've always loved this song, but I never realized how brilliantly written it was until we studied it in Journalism.  I think that many of you are overanalyzing the song and trying to find complex meanings.  Overall, the song is actually very straightforward.  It doesn't seem that way because many meanings are implied, and not directly presented to the listener.  THIS is what makes it such an incredible song.\n\r\nHere's my complete analysis for you:\n\n\n\r\n\"Eleanor Rigby picks up the rice in the church where a wedding has been,\r\nLives in a dream.\"\n\n\r\n[** OK, so here's the first bit of information we have on Eleanor.  Right away, we are viewing a depressing image: a lonely woman who desires companionship is picking up the rice on the ground, after a wedding has just finished.  Note how McCartney wrote that line: he doesn't say that she \"sweeps up the rice\".  She \"PICKS up the rice\", making it seem as though she is doing it piece by piece.  This would certainly indicate that she has A LOT of time on her hands.  I disagree with those who think she works at the church as a janitor or something.  The whole reason why she came to the church was because she \"lives in a dream\" that one day, she will be married or have some meaningful relationship.**]\n\n\r\n\"Waits at the window,\r\nWearing the face that she keeps in a jar by the door.\r\nWho is it for?\"\n\n\r\n[** I've heard different theories as to exactly what the \"face that she keeps in a jar\" represents.  Many people believe that Eleanor Rigby puts on makeup so that she can look her best, holding on to the hope that someone, anyone, will greet her.  This is a good observation, but I don't think that's what the line is implying.  Figuratively, the \"face that she keeps in a jar by the door\" could represent a sort of false-happiness that she only \"wears\" when a visitor has approached her door.  She keeps it \"in a jar\" because it is only a mask to hide her loneliness and depression.  The question is asked, \"Who is it for?\"  Nobody can answer this question, not even Eleanor herself.  She is still holding on to the hopeless dream that she will find love and/or companionship.**]\n\n\r\n\"All the lonely people, where do they all come from?\r\nAll the lonely people, where do they all belong?\"\n\n\r\n[** This part of the song speaks about loneliness in general.  It basically asks the question, \"Why are so many people lonely when there are so many of them?\"**]\n\n\r\n\"Father McKenzie,\r\nWriting the words of a sermon that no-one will hear,\r\nNo-one comes near.\"\n\n\r\n[** We are now introduced to another character in the story, Father McKenzie.  I do NOT believe that Eleanor Rigby and Father McKenzie knew each other at all.  Nowhere in this song is that theory even hinted at.  They were just two terribly lonely people, who both wanted to be involved in a relationship of some kind.\n\r\n** Note how many direct references there are to loneliness in this part of the song.  \"Writing the words of a sermon that NO ONE will hear.\"  This is a figurative line, to illustrate McKenzie's loneliness.  I'm sure he has church members who WILL hear his sermon, but none of them can fill the void that is in him, so it doesn't even matter.  The line, \"No one comes near\" is an example of how, even though McKenzie interacts with people at church, he manages to stay lonely because he has no relationship with them.  It's as if they don't exist.  This is where Eleanor Rigby and Father McKenzie are the most similar: both of them are WAITING for a relationship to happen instead of trying to find one.  Eleanor \"waits at the window\" and McKenzie is upset because \"no one comes near\".  Each character's passive attitude clearly has A LOT to do with their own descent into loneliness and depression.**]\n\n\r\n\"Look at him working,\r\nDarning his socks in the night when there's nobody there.\r\nWhat does he care?\"\n\n\r\n[** This part of the song can easily be compared to the line in the previous Eleanor verse, when Eleanor is \"wearing the face that she keeps in a jar\".  (In fact, the music is identical for both lines.)  The difference is that Father McKenzie seems to be \"darning his socks\" to take his mind off his own problems, and not necessarily to impress anyone.  To add to the overall melancholy feel, he's doing something that most people would find terribly boring.  Like Eleanor, he seems to have a lot of time on his hands.  \"What does he care?\"  Why should he care about his socks when he is filled with so much sadness?  It's almost as if he's going through a stage of self-pity, and he's completely given up.  It could also be compared to the first verse, when Eleanor \"picks up the rice\".**]\n\n\r\n\"Eleanor Rigby,\r\nDied in the church and was buried along with her name.\r\nNobody came.\"\n\n\r\n[** Now we come upon something interesting.  This verse clearly states that Eleanor \"dies in the church\".  Perhaps this is only mentioned to further connect the two characters, or perhaps there is a greater meaning.  It is quite possible that it was used as irony.  Eleanor wants to be married, and she dies in the very place where she would have been happiest.  According to the verse, she was also \"buried along with her name\".  This may give the listener an idea of a tombstone marking where she is buried, but it actually symbolizes how, when she died, the memory of her died also.  \"Nobody came\" to the funeral, because nobody knew her.  She would easily be forgotten.**]\n\n\r\n\"Father McKenzie,\r\nWiping the dirt from his hands as he walks from the grave.\r\nNo-one was saved.\"\n\n\r\n[** I'd like to interrupt my analysis to tell you this: I've just now realized that this song could take on a completely different meaning.  I don't know which to believe, but both are fascinating.  Here's my other theory:\n\r\nLet's start by analyzing this verse.  Father McKenzie is \"wiping the dirt from his hands\" almost as if he's actually accomplished something.  This is followed by the line, \"no-one was saved\".  At first, I thought nothing of it, but then I started to look at the complete lyrics.  I realized just how many times the narrator FIRMLY DENIES something.  \"...A sermon that NO-ONE will hear,\" \"NO-ONE comes near,\" \"...when there's NOBODY there,\" \"NOBODY came,\" \"NO-ONE was saved\".  Suddenly, it hit me, that Father McKenzie is a priest, and is traditionally not supposed to have a serious relationship with a woman.  Is it possible that the overuse of the words \"nobody\" and \"no-one\" are sarcasm, and that the narrator is trying to cover up something that DID occur between these two characters?  What if you saw the lyrics this way:\n\r\n\"Father McKenzie,\r\nWriting the words of a sermon that [Eleanor] will hear.\r\n[Eleanor] comes near.\n\r\nLook at him working,\r\nDarning his socks in the night when there's [Eleanor] there.\r\nWhat does he care?\n\r\nFather McKenzie,\r\nWiping the dirt from his hands as he walks from the grave,\r\n[Eleanor] was saved.\"\n\n\r\nPerhaps I am overanalyzing everything, but if the song did take on this different meaning, the whole message of the song would change.  Eleanor would be \"saved,\" in the Christian sense, and go to heaven.  This would also explain why she \"died in a church\".\n\n\r\nThe first theory is certainly more logical, but the second one is also an interesting possibility.  Perhaps you should form your own opinion.  There is definitely more to this song than meets the eye (or rather, the ear).\n\n\r\n--Matt K.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nThis is an incredible song.  Also one of few Beatle songs in a minor key.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nMy favorite song by the Beatles as well. I think it's about being lonely and dying alone, which may explain all the references to tombstones and graveyards in this thread.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI named my cat Rigby.  I win.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nthe tombstone w/her name on it was found in liverpool LONG AFTER the song was written.\n\r\nand..\n\r\nthis song is about a lonely woman (older) and a lonely priest who eventually come together at the womans funeral. it shows that you should not take the most important things in your life for granted, family and friends.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\n\"Waits at the window, wearing a face she keeps in a jar by the door\"...Beautiful. Plus, the violin...\r\nAah.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\ni love this song sooooo much. it made me cry one foggy day. \n\r\nmatt k, your analysis is brilliant, i totally agree with you except on the part about eleanor knowing the priest. i thought it was just about two lonely people whose lives entertwined at some point.  (At the end for eleanor.)\n\r\ni think it's a wonderful song about loneliness. that's it. that's the point.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nI just heard the song recently and I stopped what I was doing just to listen.  It really is a great song.\n\r\nI think it is about two lonely people who didn't know each other, but, if they had, could have had happiness.  They both do lonely things because they have nothing better and wait for things to change.  Only in death are they brought together, but it was too late (and neither one was saved because of it).\n\r\nThere's no happy ending.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nentrypoints.com/RockLyrics/…\n\r\nPlease check this out, it's the best, deep and complete inpretation i could ever found of this song in whole internet\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThis song is about being so close to someone yet being so far away, or lonely. Father McKenzie, a member of the church, and Elanor Rigby, a woman who cleans up (nun or janitor) the rice after weddings. They're both lonely, yet so close to eachother at the same time. He writes semons that no one listens to and darns his socks (to darn is to patch with yarn. Basicly he sews his socks together) to keep up his appearance, but has no one to keep it up for. She wears her face in a jar by the door (could LITERALLY be mascera or makeup in a jar). So close to eachother and wanting the same thing, but so far away because they don't reach out and touch eachother.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nTo me, this song is about lonely people with overlooked jobs.  A person who cleans up rice, or a preist.  I mean really, when was the last time you actually listened to what your preist had to say?  By saying \"no-one will hear\", what is meant is more like \"no-one will listen.\"  The face in the jar  is her fake smile that she puts on when she goes out, like false teeth.  \"Who is it for?\" I think is just saying that she doesnt have anyone to talk to.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\none of the darkest beatles song, and one of the beatles best. The beatles are totaly up there with simple plan and sum 41. J/k\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\n... lonely people...  the world is full of them.. everyone is lonely at heart.. they don't show who they really are.. they hide behind a fake smile and continue on with their meanignless lives.. because no one listens to a word that is said... everyone is ignored... everyone is alone in this world... and no one cares...\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nthis is absolutely my favourite beatles song. it's so amazing!\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nDid you know that \"Eleanor Rigby\" nearly had a different name?  I read in one biography that Sir Paul had had the name \"Daisy Hawkins\" stuck in his head for weeks along with the melody.  Unfortunately, I don't recall howthe original name came to be replaced; regardless, there's a fun fact for you.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nits realy sad ive grown up on the beatles and its always made me cry\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nAngelina Jolie played the part of someone called Eleanor Rigby in a film called Mojave Moon, according to IMDb. See for yourself: imdb.com/title/tt0117070/\r\nWhat's that all about?\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI think this is, by far, the most depressing song I've ever heard, and I'm in love with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nThis is probably my favorite Beatles song right now, especially the line:\r\n\"Father McKenzie, wiping the dirt from his hands as he walks from the grave.\r\nNo-one was saved.\"\r\nHonestly, that sounds like a Pink Floyd lyric (as does this entire song, lyrically).  Excellent dark song.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nawesome song..\r\nnot sure about an affair..\n\r\ni think it's just her being so alone and at night living in a fantasy world, while during the day putting on a cover and trying to fool everyone and herself..\r\nhe also does something similiar.. living a lie and having nothing better to do than write words that no one will hear..\r\nboth of them being lonely and unappreciated.\r\nin the end they are both failures..\r\nhe saved no one with his words and she couldn't fool herself into thinking she wasn't lonely.\n\r\nno idea.. but it's certainly good.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nTHis song is about two people who are very lonely.\n\r\nThey are close but not close- they could make the pain better for the other one by sharing some love but instead they stay as virtual strangers.\n\r\nI'm not a beatles fan but i love this song- specially the violins.\n\r\nEveryone dies alone\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nWow...some wild interpretations in here.  My view: the song is quite ironic in how it shows how utterly pointless the lives of Eleanor & the Father had become (\"wearing a face\" of makeup for no one, \"donning\" or mending socks when no one will see the holes) and yet you have Paul & John asking where all the lonely people come from as if they are ignoring who they are singing about.  The singers act as an aloof God (explaining the religious angle) who could care less about how lonely his followers are (to the point where his followers die but he doesn't \"save\" them from the loneliness).  Simple yet powerful lyrics that are most powerful when you don't look for hidden meanings.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\ni love this song. one of my all time favourites. How many songs have been written like this one? about the loneliness of people, people that almost seem invisible to the rest of us. these people were overlooked by other song writers but not by paul.\r\nAlso isn't it 'I look at all the lonely people?'\r\nAlso isin't it\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\ni performed this song for a school assembly a few months ago... i had fun even though we were totally crap. this song is great. the beatles were great songwriters :D\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nIts amazing how many different ideas there are about the origins of songs...I thought the inspiration behind this came from a Paul MaCartney visit to Bristol(my home town) to see his girlfriend of the time,Jane Aher in a play.Allegedly he saw the name on a shop front in Clifton & took it from there.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\noh man. i love this song, but i can't listen to it unless i'm up for a cry. it makes me so sad and i get all paranoid about maybe being an old maid some day... but i shouldn't worry about that yet.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nIf it was black plague, then it was 1300s.\n\r\nAnyway, the reason I came was to point out the existence of a Kansas cover that is just weird (and not as good).\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nisnt this song called All The Lonely People?\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nLennon Lover- not all songs are named after there chorus. clearly this is one of them\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\n< Eleanor Rigby picks up the rice in the church where a wedding has been,\r\nLives in a dream.\r\nWaits at the window, wearing a face she keeps in a jar by the door,\r\nWho is it for? >\n\r\nEleanor Rigby is a lonely young woman who doesn't know how to communicate with people. She fantasizes about having a normal married life with someone, but lives alone miserable. When people come to her door, she puts on a false, happy front.\n\r\n< Father McKenzie, writing the words of a sermon that no-one will hear,\r\nNo-one comes near\r\nLook at him working, darning his socks in the night when thereâ\u0080\u0099s nobody there,\r\nWhat does he care? >\n\r\nFather McKenzie writes uninspiring sermons that no one listens to, because he has no interpersonal skills. He is a bitter, lonely man of the cloth.\n\r\n< Eleanor Rigby died in the church and was buried along with her name.\r\nNobody came.\r\nFather McKenzie, wiping the dirt from his hands as he walks from the grave.\r\nNo-one was saved. >\n\r\nThese are just two (of many) lonely people who theoretically could add color and life to each other's lives, but their paths only crossed incidentally, after one of them died.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nthis song basically breaks my heart. it's so sad. whenever i listen to it, especially the lines about eleanor rigby's face in a jar, i see this empty woman sitting alone in a room wearing a frown and it's amazing. AMAZING.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nthis song is awesome!!!!!!!!!!!!!!\r\ni think that the truth is that there is these to really lonely people living there daily lives in the same place and being lonely. The truth is that they should have just gotten together because lonely people should get together with other lonely people. This way they are not so lonely.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nThis song is haunting. Nothing else to say but lonely and...extremely haunting. They express that aloneness so well...and the imagery is so vivid. Just wonderful, wonderful.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nIn the song, Eleanor Rigby is symbolic of religion. As silly as it sounds when The Beatles reached their peak in the 60s adults and religious leaders thought their music was evil (their were even rallies in America and Britain to burn Beatles albums). The attendance of the Anglican church in England took a downward spiral with huge loses in attendance. Hope that adds some perspective.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nthis is my favourite beatles song by far. the song is about two lonely people and their lives. eleanor rigby was a name paul came up with but the song was orignally about a young girl... paul changed it to be about an old woman because the fact that she cleans up after weddings and has no one makes her the ultimate example of true lonliness. father mackenzie started out as father mccartney but paul changed it  - johns idea- so that it wouldnt seem that it was about pauls father. the rigby and mackenzie tombstones were pointed out to paul years after he wrote the song, he admits it could have been in his mind subconciously... its a truly great song and its about two very lonely people and how they end up finding eachother at the end as father mackenzie buries eleanor.... its acctually such a sad song..\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\n**Going with my other comment**\n\r\n\"Father McKenzie, writing the words of a sermon that no-one will hear,\r\nNo-one comes near\r\nLook at him working, darning his socks in the night when thereâ\u0080\u0099s nobody there,\r\nWhat does he care?\n\r\nEleanor Rigby died in the church and was buried along with her name.\r\nNobody came.\r\nFather McKenzie, wiping the dirt from his hands as he walks from the grave.\r\nNo-one was saved.\"\n\r\nOr he could be writing the sermon for the funeral. No one will be there. No one will hear. What does he care? He cares for Eleanor.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nMy late uncle was a priest at a parish in the Old Swan district of Liverpool at the time this record was released.  Every time I hear it, i'm reminded of visits to the bleak presbytery he lived in next to the church.  It was always in the shade - a sepia, cold sandstone building where the lights were always on indoors.  \n\r\nIf it wasn't for his gregarious sense of humour, the visits would have been an ordeal......\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\ni am writting a paper about this song and in our text book they have a few paragraphs Paul McCartney wrote about the song.  He said that originally the name was going to be Daisy Hawkins but it was too sexy so he though of Eleanor Rigby.  they came up with Father McKenzie by going through the phonebook.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nThe song is simply about lonely people. Eleanor rigby is a lonely person father Mckanzie knows her only after she dies (alone, of course). The line \"Eleanor Rigby picks up the rice in the church where a wedding has been\" says it all. the rice is the left-overs of the wedding, and wedding is for people who will always have someone until death take them apart.\n\n\r\nFor me. this one is the beatles at their best. The words are so meaningful and combined with that powerful music, make it so sad. The strings are brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nThis song make me sob up.. very emotional.. because there are so damn many lonely people out there.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nOn the surface Eleanor Rigby seems to be a song about lonely people in today's world but it is so much more than that.The reference to Father McKenzie intrigues me when he preaches a sermon that nobody will hear; he preaches to an empty congregation or preaches a sermon in which people are unwilling to hear what he has to say. By the way if one wants to hear the most depressing song ever, listen to Billie Holliday's \"Gloomy Sunday\". It was actually banned over the radio for many years.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\ni had to analyze this song\r\nfor a project in my english class.\n\n\r\nin the line \r\n\"all the lonely people, where do they all come from?\r\nall the lonely people, where do they all belong?\"\r\ni think Paul and John  are really wondering\r\nhow so many people become lonely in the first place.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nSomewhere, I heard that the Beatles saw the name 'Eleanor Rigby' on a tombstone and then wrote a song about it. I really don't believe this is true. But if I was dead and the Beatles used my name in their song, I'd be a very happy angel!\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nthere is an extra layer of subtlety where the interpretation is that ER was the woman maintaining the church living a lonely life side by side with F MK, both unable to break away from their loneliness. Ultimately no one was saved.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nthis song tells normal people's lives, how empty they are... everyday, everytime. Nothing different, how they're totally on their own, and the loneliness which that fact brings.\r\nI love it, and i cannot agree more.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nI love this song,I have the lyrics on my wall. Thrice did do a great remake in my oppinion. The lyrics makes since to me in most areas. She's living ina dream by imagining getting marrid(is how I take it) and face in ajar I think, means makeup, but noone comes, maybe there was someone but they stood her up becasue it says \"who is it for\" or maybe shes pretending, I dont know. than it tells a story about a lonely preacher,which no one listens to anymore(but I dont get the darning his socks thing, ok, so he sows his socks at night , theres nobody there, hes lonely, but what does it mean by \"what does he care?\") and than at the last verse, they come toether becasue she died lonely, and he was the only one who came cause he buried her. I can take these lyrics deeply, or it could just simply be about lonely people. I will deffineately look into it, cause it intrigues me.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nPersonally, I think the song is (obviously) about being alone. Whether or not Paul or John (though I do think it was Paul) wrote the song. It is the Beatles and we can all agree that they are god. Which such lyrics and chords, Eleanor Rigby gives off this dreary feel to it. The feeling of being alone and looking at others being alone. Acting as though you are surrounded by loving people, but, yet, there is a place where you belong, and that place ain't earth. So you feel... well... alone...\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nthis is my 2nd favorite Beatles song. i absolutely love everything about it the lyrics, music, message, etc...  The line \"wearing a face that she keeps in a jar by the door\" to me means that Elinor doesn't let people see who she really is and that nobody see's the her thats behind the (symbolic) closed door. could this be why she's lonely? I also really like the lines \"All the lonely people, where do they all come from? All the lonely people, where do they all belong?\" no one ever really thinks about how many lonely people there are and how very few people in this world actually have a place to \"belong\". the story of Eleanor is one thats very depressing and unfortunantely very common. she spends all of her time watching and helping others be happy thinking her turn will come but it never does.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nI dont think this has anything to do with rape or murder but anyone can find any meaning from a song and thats not wrong. \n\r\nBut anyway. \n\r\nIt is about how Eleanor and Father Mackenzie are lonely thats really it. I dont get how people get darker meanings. About FM's sermons and the end. I think it shows how his congregation is getting smaller to the point where no one really cares about him anymore. Yet he still goes on in my mind enthusiastically writing his sermons hoping that this sunday is going to be different and more people will come so his church wont be \"lonely\". \n\r\nAlso it seems that they are the only people left working at this church and now that she is gone there is no one left at the church. And he hasnt saved anybody because everybody left and doesnt come anymore and doesnt care about his church or God anymore and so they arnt saved.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\npeople have pondered and dissected this song to death. That is not meant to diminish the beauty and mystery of this work at all. But I am going to throw my 2 cents in now:\r\nER and FM are all of us. We all are excluded from things we perceive to be usual events in our life (for ER it was illustrated by a social event); we all put on a front ( the face in the jar by the door) for other people, hiding our pain and shame; We all have something to say that no one will listen to (writing a sermon that no one will hear); there are parts of us that we keep hidden, but really may be inconsequential when viewed by others (FM sock repair); The only thing we take with us when we die is our name. What ever that name  is(reputation, literal name); We all die alone. FM wiping his hands could be absolving himself from the responsibility of no one being saved(much like Pilate regarding Jesus). As a priest, he is charged with the care and spiritual nurturing of his parishiner's salvation. Certainly during this period of the Catholic church's history, there was failure in this area. Of course, that is seen in any church's history during the 60-70's. \r\nThis was written by 'Twinhearts' mom.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nI believe this song is more about Life in general.  How we live going about the same daily happenings.  How said happenings are boring to us. And how we die without being remembered.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nThere was an interview with the Beatles some time ago where they said specifically that the \"face in a jar by the door\" line didn't mean anything at all. It was just nonsense that they came up with.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nTo me, whenever you see a tombstone, you always think 'what was their story'? You know? Like now I am thinking about Sylvia Plath. If you saw her tombstone now and didn't know who she was at all, you'd not know her real story. You'd just pull straws, wonder, maybe create a tale in your head?\r\nFrom what I gather from the song, it's like they're narrating the life of a name they found on a tombstone. Eleanor's story. If she was a real person, she would have had a completely different story altogether. It's very whimsical.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nThe song is about the tragedy of a paupers funeral, with nobody attending, and how, in this day and age, the phenominon still exists.\n\r\nHow sorry would it be to witness a funeral where there are no mourners..no wreaths...no family. Imagine how lonley that person must have felt in life!\n\r\nEleanor rigby represents somebody who had a pupers funeral..father Mckenzie was the preist who carried out the service! \n\r\nThe song simply asks the listener how this can happen..where do all the lonely people come from!\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nThis song is about two very lonely people living their lives side by side, but never really realizing that the other one was there. When it says \"wearing a face she keeps in a jar by the door\" it means she always put on her makeup when she went out or had people in. Her putting on makeup is like her putting on a mask, because no one ever sees the real her and no one knows how lonely she is. When it says \"Look at him working, darning his socks in the night when thereâ\u0080\u0099s nobody there\" it means that no matter what he does, no one notices. Darning socks is just an example of something he does that no one knows about because he is so lonely. The fact that Father Mackenzie was the only person at Eleanor's funeral is sad, but what makes it more sad is that Father Mackenzie doens't even seem to be bothered by the fact that Eleanor died or that no one was there. All he thinks about is the fact that no one got saved, which is the main goal of most ministers. All he can think about is himself and how lonely he is. I believe that this song is about how lonely everyone is, but also how we don't really try to reach out to other people.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nthe mask is more metaphorical then \"make up\" sure it may mean that but it's saying she doesn't show people who she truely is.\n\r\n my heart feels heavy every time i listen to this song\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nPaul McCartney recently said \"Eleanor Rigby is a totally fictious character that I made up,\" McCartney said in a statement released to AFP by his publicists.\n\r\nMcCartney has previously said the name Eleanor was inspired by actress Eleanor Bron, who starred in the Beatles film \"Help!\" in 1965 and that Rigby came from the name of a wine merchant.\n\r\nThis was found on Yahoo news.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nI think that \"Eleanor\" in this song is a figure of someone's imagination, sort of like an alter ego.\r\nThe line \"lives in a dream\" makes me interpret it like that. There was this woman who wasn't quite herself amongst the other people, and so she put on a visage. I think she fears letting people know who she really is, so that is why she has to act like someone she isn't. Eventually this woman let go of her visage, and \"Eleanor\" died alone.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nI found the Wikipedia article to be particularly helpful in explaining the history of this song.\nen.wikipedia.org/wiki/…\n\n\n", "comment_128": "\nobviously this song is about lonely people but the fact that it actually gives you full names and the story it makes it more easy for one to relate to the song, there are so many people in the world and you see their faces but not their lives\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\ni really really like this song... the version i listen to the most is the David Cook version where he sang it american idol and i dont think he could've done any better... he just rocked it out loud.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nI believe this song is about a priest living alone and couldn't really care for anyone else.\r\nIt ended with a murder of Eleanor. \t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nThis is a cool song. if you get a chance find Ray Charles cover of this song. He turns in into something wonderfully different \t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nThe obvious meaning to this song is about loneliness and not fitting in. There are people all over the world that are lonely, and there is really no place for them to fit in. â\u0080\u009cWhere do they all belong?â\u0080\u009d. We all have lives of our own, and most of us feel that there is no more room for new people. And so, people that lose the other people in their life, or who never had anyone to care for them, often end up lonely because no one else is willing to let them in. They have no place anymore. That is the meaning of the song that we all see, but I believe that if you look hard enough, you will see that there is another meaning. This meaning is one that I like, because it is happier then the first. At the end of the song, like I mentioned before, father McKenzie and Eleanor Rigby come together. Although, in this case, it is too late, I think that the message of this song is that, had they met earlier, these two lonely people could have come together and not have been lonely anymore. There is always someone out there who is just as lonely as you, but meeting them could end both of your loneliness. Because both do not fit in anywhere else, they fit in together.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nI agree with moisme, all the lonely people in the world that could be together but by the time they meet it is too late for them. They are together at last, but unfortunately they will be lonely forever...\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nLoneliness. \n\r\nNow, the way each person relates this loneliness to the world and other things is a question of perspective. But mainly, it's about loneliness, imho.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nthe Beatles were on very potent doses of LSD and smoking the good shit when they wrote this song. GREAT SONG!\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nAh.....look at all the lonely people\n\n\n", "comment_137": "\nThis song is much more beautiful when you take it at face value:\n\n\r\n\"Eleanor Rigby picks up the rice in the church where a wedding has been,\"\n\r\nER is really, really poor. She picks up the rice so she will have something to eat.\n\r\n\"Lives in a dream.\"\n\r\nShe's crazy.\n\r\n\"Waits at the window, wearing a face she keeps in a jar by the door,\r\nWho is it for?\"\n\r\n\"Father McKenzie, writing the words of a sermon that no-one will hear,\r\nNo-one comes near\r\nLook at him working, darning his socks in the night when thereÃ¯Â¿Â½s nobody there,\r\nWhat does he care?\"\n\r\nIt's Eleanor's funeral. Since she was homeless and had no family and friends, no one was going to assist to the ceremony, so no one was going to hear the sermon or see the Father's socks. The father does care. It's The Beatles asking why. \n\r\n\"Eleanor Rigby died in the church and was buried along with her name.\r\nNobody came.\"\n\r\nShe probably died while she was looking for some food by the church. Nobody came precisely because she had nobody.\n\r\n\"Father McKenzie, wiping the dirt from his hands as he walks from the grave.\r\nNo-one was saved.\"\n\r\nFather McKenzie probably buried ER alone and by himself, since she had nothing and couldn't afford anything other than a charity burial.\n\r\n\"All the lonely people, where do they all come from?\r\nAll the lonely people, where do they all belong?\"\n\r\nPeople come from families. We are supposed to have families and people who are related to us. So how come so many people live and die alone, having no one?\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nthis song is clearly stated as in the meaning of it:\n\r\nIts actually a very general message. its talks about how the people as in society r turning so selfish, and not caring about anything..only themselves. They choice of the name Eleanor Rigby is to represent all of us, as a society full of fake faces just like the line \"Wearing a face she keeps in a jar by the door\"\r\nWho is it for? Father McKensie is also another represantation of how we all do things without a care of others.\r\nShe was buried along with her name...another person dying just another name buried forever with no real feeling or care.  \t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nWearing a face that she keeps in a jar by the door, who is it for?} i thinjk this is saying that she wears a \"face\" of happiness wen out in public, and a \"face\" of lonliness inside. Its for her only bc shes hiding her sadness.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nSomeone mentioned that although they like the song it made them feel uncomfortable. I've always felt the same way, even as a small child. It is so sad to think that people go through life un-noticed, and even when they die there is no-one to miss them which is what I think this song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nI absolutely love this song. It's so hauntingly beautiful, yet completely tragic.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nThis song makes me sad every time I hear it, seriously...lonely people who will never meet up and be happy.  And the last few lines, \"Eleanor Rigby died in a church and was buried along with her name.  Nobody came.\"  makes me depressed.\n\r\nA great song, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nI belive that this song shows how some people look past others(like Elenor Rigby).\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nthis song is great but i think its too short!\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nI took a sociology class many years ago at a community college, and the professor pointed out that this song was about \"ritualism\"\n\r\nHe said \"who here likes the beatles\" and in early 90's most liked Nirvana, but he said what song by the Beatles describes ritualism as were studying. Eleanor Rigby.\n\r\nI've seen ritualism occur in the catholic church for years, it's the same procedure whether there is 500 people or 2 people at the mass. I think it's about lack of personlization, lack of seeing people as individuals, as opposed to a group.\n\r\nGreat song, I just never understood the \"ahh...look at all the lonley people\"   line\n\r\nWe see only one lonely person, eleanor rigby, father mackenzie aint even that lonely he's too busy running the church.\n\r\nNobody attends the funeral service, so who are ALL the lonely people? Is he being symbolic saying there are many people like eleanor rigby?\n\n\n\n\n\n\n\n\n", "comment_146": "\nTo me, this song is about a woman, Eleanor, who â\u0080\u0098lives in a dreamâ\u0080\u0099 waiting for a man that doesnâ\u0080\u0099t exist to come and marry her. Father Mckenzie is the priest obviously who is working on the sermon for the wedding that he is led to believe is happening. However days pass and nobody turns up but Father McKenzie carries on working as he has nothing else to do because he is lonely, â\u0080\u0098what does he care?â\u0080\u0099. So he is also kind of living in a dream but is more aware that it is only that.\r\nWhen Eleanor dies I think that Father McKenzie is wiping the dirt from his hands not because he has killed Eleanor physically  but because he watched her basically dieing of loneliness and allowed her to do so, when he could have possibly saved her, â\u0080\u0098 No one was savedâ\u0080\u0099. \n\n\n", "comment_147": "\nwell u guys are all somewhat right the song is talking about a funeral and the name was not taken from a gravestone or tombstone it was gonna be father mcarthy but they thought it would scare his father so they went to a phonebook and picked a random name so that is how they got father mkenzie but the name eleanor rigby did come from a gravestone\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nThis song to me feels like feeling lonely and seeing absolutely no point in your life, or the things you do. And then I really admire eleanor and father mc kenzie for going on. So I guess in that way it is encouraging. Everyone has value. But it is a real shame not everybodys value get noticed. Then the song is maybe commentary on society also a bit. But I might also be taking it to far.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nI think that this song is nothing about him killing eleanor.\n\nI feel it's simply about two lonely people seemingly unconnected with their lonely lives. I feel the song is a case of great irony that these two by chance come together at Eleanor's burial.\n\nHence \"where do they all come from?\" mccartney wonders where these lonely people are as they are not often seen, creating a greater sense of coincidence and irony that the two only are together when she dies. Thus F.M is still a lonely person.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nIs about Faith... mainly the Faith of the christians. The empty of religions.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\njdgf\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI analyzed this in an AP English class. The class/teacher consensus was that nobody cared about lonely people. Society we don't give a fuck.\n\nIt was in my textbook so cool. \n\nAnd yea I got college credits because I'm a badass and smart as fuck.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nFr. whatever eleanor they are all lonely. Nobody cares.\n\nI wanted to point out that the priest is a lonely individual.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nTeachers quote not verbatim\n\nsociety's attitude towards lonely people we don't care\n\ni suppose it doesn't matter in the end - but that's a morning dew mentality\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nand yea paul wrote this because i am the walrus co coo cachoo whatever.\n\ngoogle it\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nthis song talks about eleanor rigby, a woman who pretends to be someone she isn't and has for so long she doesn't even know who she realty is anymore.  it also talks about father Mackenzie, a priest who is discouraged by the fact that although he preaches to his sermon, no one trly listens to what he is trying to teach them about Christ. this is causing him to lose his faith and begins to not care.  these are two people who are alone in the world and have no one to turn to\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nI agree with someone else who said that Eleanor Rigby and Father Mackenzie were meant to be together. They knew each other, since he was at her funeral. I think she worked at the church, that's why she was cleaning up the rices after a wedding. How many weddings did she sweep up after during her service at the church? Probably years of weddings. But no wedding was ever for her. How can a single woman clean up after a wedding, and now think about how she does not have a man in her life. Father MacKenzie, he's darning his socks alone in the night. Darning socks is a woman's job. He must have thought how there was no woman in his life. Eleanor put on a smile when people came over, but it was a mask: she was lonely inside. Father Mackenzie would preach, also a show of interaction, but limited. No friends. They did their jobs and put on a good face, and lived their lonely lives so close to each other, but never connecting. I think he \"wiped the dirt from his hands\" because he officiated. She lived and died a lonely life, and now that she is gone, Father Mackenzie will remain lonely for the rest of his life too. If only they could have cast aside whatever formalities it was that kept them from being friends. Perhaps, if he were not sworn celibate, they could have even been married and lived happily ever after.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nOvercoming loneliness is crucial for health and well-being. I doubt the Beatles were aware of this, but still it is pretty radical that a pop/rock band mostly known for writing love songs would choose to write a song about loneliness in the elderly. \n\nThe line about picking up rice at a wedding is about living vicariously through the lives of others. She isn't married and has no one to share her life with the best she can do is collect the rice from wedding ceremonies and dream about what it must be like. \n\nThe central question that I think the song is asking is not where do lonely people come from but what is the point of life without the company of other people. Eleanor Rigby puts her makeup on everyday in case someone comes over,but none does. Why? Father Mackenzie works on his sermons that no one listens to. Why bother?\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\neven though they are completely alone the father is worried about \"darning his socks\", while Eleanor \"keeps her face in a jar by the door\".   I think this points to them both being vain and superficial  \n   the fact that Eleanor rigby and father meckenzie's lives both revolve around the same church points to their inability to connect even with each other\n   the chorus repeats \"where do they come from?  where do they belong?'  the question is how did they get like this and where is being self consumed supposed to get you?\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nI always thought the face in the jar literally meant her false teeth....\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nEleanor Rigby is lonely. Father McKenzie is lonely. Eleanor goes to the church to up rice after a wedding (check the symbolism) and pretends to be someone else. Father McKenzie writes sermons for the church by day and works on house chores at night; by himself. Eleanor Rigby dies and Father McKenzie buries her. This story is a tragedy. It seems the characters had reasonable opportunity to be together but chose not to. If they did get together they wouldn't be lonely, and they could have 'saved' themselves from dying alone.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nI haven't read through all the pages of comments (because there are so many!), so maybe this has been mentioned already, but:\n\nThis song makes me think of Arsenic and Old Lace. Except here there isn't any humour to compete with the creepiness. \n(Summary for those unfamiliar: Two eldery aunts develop a habit of killing lonely old men who come to board at their home. They think that they're being nice by allieviating the victims' loneliness & rendering them \"so peaceful\". They're \"good Christians\", and that is repeatedly alluded to ironically.)\n\nEleanor Rigby sounds like she is a lonely -probably eldery- woman. Probably the church custodian, since she's cleaning the church up after a wedding. \n\nFather Mackenzie kills her. \nPossibly because he knows how lonely she is, and sees it as a mercy killing -just like the elderly aunts in Arsenic & Old Lace do. \nHe understands that killing her is at least legally wrong, whether or not he has any moral ambivalence, so he buries the body alone.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nEleanor and Father M both lived lives that gave them a sense of purpose, worth and a measure of comfort/happiness. The implication being that others should try to, too.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nNever thought much about the lyrics oft his song when it came out. But just heard it and remembered my dad's interpretation. Eleanor was a prostitute her face is left in a jar by the door. \"jar of condoms\" Father McKenzie darning his socks at night is a reference to masturbation. He shouldn't be doing it but nobody cares.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nI think the song is about two subjects who live their life in loneliness but who have hope and live as if company is right around the corner (for example, eleanor putting on nice makeup and father mackenzie making his clothes nice and preparing sermons) In the end eleanor dies, still unmarried and with her maiden name. I think there is supposed to be a sort of dark irony to it, that these two lonely souls should only cross each others path when one has died. I think its speaking about how with so many lonely people in the world its a shame that they can't manage to find each other and fill a void in each others lives.\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nSo yes, itâ\u0080\u0099s about loneliness. We all know how it feels to be lonely with no one there for us. And Eleanor has been alone it seems for a long while. She seems to be waiting for someone to come along that cares and acknowdges her. That never happens however, and she dies alone, with nobody even caring or even aware of it, except the father, but doesnâ\u0080\u0099t seem to particularly give a ratâ\u0080\u0099s ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nSimplicity is the answer to me. Two lonely people in a world where there is a great need for intimacy and at least caring for one another. She is poor and hungry and trying to find refuge in her believes. He is isolated just the same in his useless dogma and his lack of touch with humanity ( otherwise he would has noticed the condition of Eleanor was in and consequently he could have done something to save her or at least helping her to overcome her terrible lonliness  ) . What finally unite them together is the inexorable fact of Life, that is . . . . Death. Loneliness is the most devastating feeling there is and remains a mystery how to handle it till these very days  . . .\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nI THINK ITS SAFE TO SAY ALTHOUGH \"HEY JUDE\" IS MY FAVORITE SONG,THIS IS PROBABLY THE BEATLES BEST,ITS ABSOLUTE GENIUS.RIGBY WAS TAKEN FROM A TOMBSTONE.THIS SONG IS SELF-EXPLAINITORY ITS ABOUT BEING LONELY-BUT THE KIND WERE YOU GO OUT AND FIND A CAMPANION-THE LONELINESS WHERE YOU DIG YOUR SELF A DIP HOLE THAT YOU CANT GET OUT OF LONELINESS IS NOT ONLY A APPARENT AND NOT HAVING ANYONE-ITS ALSO A STATE OF BEING AND A FEELING.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nI MEANT TO SAY-\"...NOT THE KIND WHERE YOU GO OUT AND FIND A CAMPANION...\" AND I ALSO MEANT DEEP INSTEAD OF DIP.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nok dont take this as blasphemy or anything like this\r\ni am a huge beatles fan-\r\nto me-this song was always about a secret love affair between a priest and a nun that was kept secret-\r\nif you look at the lyrics sans choruses as a poem it begns to make sense\r\n....WHO IS IT FOR?---FATHER McKENZIE...\r\nobviously as the father walks away from the grave he is leaving a secret behind- wiping the dirt from his hands as he walks from the grave. \r\n No-one was saved. \r\nhowever that is just my interpretation-\r\ni guess thats what makes for great songs-\r\nour interpretations of them\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nim doing this song as a project and i realise the meaning i agree with so many of you that this song is a bout being alkone so if anybody has anythign i should say in my project let me know\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nI have been a beatles fan for a decade now.  I have pondered over this particular song for quite awhile.  \"Father McKenzie, writing the words of a sermon that no-one will hear... Waits at the window, wearing a face she keeps in a jar by the door... Father McKenzie, wiping the dirt from his hands as he walks from the grave. No-one was saved.\"  These lyrics are so powerful and mysterious.  I always thought that Father McKenzie murdered Eleanor Rigby.\"  The dirt from his hands as he walks from the grave?  Why are his hands dirty from the grave?  Writing the words to a sermon no one will hear?  A eulogy at Eleanor's funeral?  But then there is the face and the jar.  And what about his socks?  My theories are crazy, perhaps, but what was going through John or Paul's head?  The Beatles did one thing which made them so popular in those days.  They made the listener think about the song.  Maybe not their earlier stuff, but once they emerged into their creativity, they produced powerful lyrics and melodies that boggles my mind and the mind of other careful listeners.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nim 14 and i heard the song first 3 years ago...i love it b/c 2 me it describes what many ppl feel like...especially me. alone with no1, basially burried alive.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nto me this song is about lonely people... whoa! what a concept!! lol. \r\nbut i think its about 2 poeple that are trying so hard to help other people and dont focus on themselves (elanor: the rice at weddings was eaten by birds and the birds then died. father: writing the words to the sermon, why does he care?) and in the end they dont get to help everyone. (elanor: died in the church, father: no one was saved)\n\n\r\ni still dont truly get this song and i dont think i ever will, but thats part of the reason i love it. if u have any ideas u want to share with me then email me at Vicious.0.Angel@gamil.com or LaurelLovesYou@yahoo.com\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\num yeah, the comment i posted yeserday seems a littel confuzing. \r\nwhen i say that they were trying to help people, eleanor by picking up the rice at weddings, i mean that when they used to throw rice at weddings, some birds would eat it and it would expand in there stomachs so theyd die, so she was helping the animals by picking up the rice\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nEleanor Rigby...if this impacts anyone or changes their views please tell me it is soooo important. Eleanor Rigby is a nun; yes, but she is also A PROSTITUTE. The face that she keeps in a jar by the door - Her make-up, she is a different person when she leaves her house. She picks up the rice at the church because she can't afford much food because she is a whore. All the lonely people - People who are lonely are usually the ones in need of a prostitute. Where do all the lonely people belong? They belong in Church, hence the reason the next stanza is talking about Father MacKenzie. Why would he care that there is nobody there with him? He's a Priest and Priest are not allowed to have sexual relations, he's used to it. She died in the chuch, well she worked there. The dirt part has no real meaning, only that Father MacKenzie was the last to touch up her grave. No one was saved - People wanted to be saved and have salvation before death, but since prostitution is a sin, how can you be saved if you're having pre-marrital sex with a stranger? The last Ah, Look at all the lonely people....\" - They belong in hell for committing sins. Eleanor Rigby was a prostitute.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\ni think alot of you have been foolish with your comments, obviously we all can see mentions lonely people. weither you think that means people are alone or not? right, this song if read without the chorus shows alot more then people would think listening to the lyrics... Eleanor Rigby, seems to be id like to say a nun? well shes staring out the window, seeing all these people that were happy, just at a wedding right? well lets say she knows she cannot be merried, shes a nun. Lets also say maybe she wants to break the rules, she came forward to Father McKenzie who we might see crazy, but he sees himself as a writer, his sermon is killing Eleanor, how she turned on god, no one was around to see it so he knew he would be fine, the lonely people are those dead, the lonely people are those that Father McKenzie scouts all around the cemetery, all the graves, no one was saved because everyone dies...\n\r\ni dont have proof but i have my mind, and i look beyond the written, this is where my mind led me...\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nthis means something about death and hopelessness it is about a woman who no-one cares about \r\nThis style is alot like that of modest mouse\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nI think of this as a story about a priest and a nun, obviously, and they want to help all the lonely people by showing them to God.  The lonely people, if they came to church, would not only get in touch with God but with themselves and each other.  This sounded so great when I thought it up in my head, but I can't put it in the right words now. :(\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nUntil my mom brought this up I never really thought about it but \"wearing a face that she keeps in a jar by the door\"  is very likely a refrence to the use of drugs to correct or hide emotional stress in an attempt to gain social acceptance.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nTo answer about \"wiping the dirt from his hands\", it sounds like it's in reference to the similar idiom of \"I wash my hands of this\",  which would likely mean that Father McKinzie (sp?) was relieving himself of all guilt and/or responsability for Elanor's drug abuse because  obviously at that point there was nothing more he could do since she was dead.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\ni think this song is amazing its so smart lennon is like a god how he just puts all the carictoristics of being lonely in to one sentence for example '' her face she keeps in the jar by the door who is it for an amazing peice of work\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nWOW! So many differant interpridtations!!!\r\nProstitutes, murders, love affairs, drug addictions???\r\nI had never thought so much into this song!!! \r\nalsthough i have always thought of a very mysterious and saddening song.\r\nA song that somewhat scared me... \r\nscared me of the thought of dying alone and lonely (even though I'm only 16!)\r\n\"All the lonely people, Where do they all come from...?\"\n\r\nPersonally, I beleive in what both  themelancholywalrus and scottp118 are saying!!!\n\r\nYet, at the same time...\r\nListening to the song, yet again, i can honestly say everyones personal interpredtations have effected the way in which i veiw this song.\n\r\nHowever I may veiw this song,\r\nEleanor Rigby remains one of my all time fave songs! and i thank everyone for helping broaden my thoughts on it!!!\n\r\n:) thanks guys! :):):)\r\nxxxooo\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\ni had a discussion on this once and my take is the \"lonley people\" are the ones who were left with no one after a war or the industrial revolution and, as they were tought, they could always turn to god. im sure there is some direct accounts of something in there but there is always a root to hold a plant.  the change of song purpose from the 30's and forty's- to the fiftys-to the sixties is clearly provin in this lil number.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nthis song is beautiful.  My friend told me that paul and john got stoned at this graveyard where two tombstones said \"eleanor rigby\" and the one near it said \"makenzie\" and being stoned made the rest of the song.  But it is so beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nFather Mckinzie and Eleanor Rigby both loved each other, but since he is a pope he can't get married and she always dresses up for him( face she keeps in a jar)He burries her and does ashes to ashes dust to dust (hints..whips dirt from his hands) No one was saved means that they both were in love with each other and could be with each other, so they both were sadend for that...and the serman that noone heard, was his suiced letter.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nto start off i think that the song is about a nun and a priest that are in love with each other, but being part of the church, can never be together. When eleanor is sweeping the rice from the church, she dreams of marrying someone, probably father mckenzie. Father mckenzie on the other hand may have regrets about being a priest and feels lonely, occupying himself with writing sermons in order to take his mind off wanting to be with someone. Then when eleanor dies with her name, it shows that she never married and kept her maiden name. And then when father mckenzie walks from the grave and no one was saved... i guess this is refering to the fact that the two people that loved one another, could not exist together because of what they believed in, and never got the chance.\n\r\nso basically i believe that the deeper meaning in this song is that sometimes what you want you can't have, even if its right before you, its simply out of your reach.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nI believe that Father Mckenzie and Eleanor were in love with each other but the church forbids this love affair so they were both left to be alone. It drove the father crazy and he figured Eleanor would be happier with god, so he burried her. Makes sense to me. If this was just a song about lonely people they why all the references to people associated with church?\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nPersonally after listening to this song alot i think that this tells the story of all the lonely people that anything can happen to and no one would ever find out for example \"father mackenzie wiping the dirt from his hands as he walks from the grave no one was saved\" in my opion he killed her and buried her and noone would ever notice.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nPlayed backwards, it says in this order:\n\r\n\"the people of wisdom, the people know evermore, they ask someone\"\n\r\nthere is something after this, but I can't make it out\n\r\n\"too slippery, cometh out with me\"\n\r\n\"and he died\"\n\r\n\"the people of wisdom, they know forevermore\" - x2\n\r\n\"he sat down\"\n\r\n\"there are worms in the piano\"\n\r\n\"espousing and hugging, and being good, and spoke not a word\"\n\r\n\"he loved no one\"\n\r\n\"he cometh out\"\n\r\n\"how often does he win\"\n\r\n\"the people are all right\"\n\r\nI think there might be more that I couldn't decipher.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nSome corrections:\n\r\n\"the people of wisdom, the people know evermore, OF THE TOIL OF WISDOM, THE PEOPLE KNOW EVERMORE, they ask someone\"\n\r\n\"and THEY died\"\n\r\n\"THE PEOPLE ARE ALL RIGHT WITH THAT\" (comes soon after \"and they died\")\n\r\n\"HE SNAKED THEM OFF\" (after \"he loved no one\")\n\r\n\"the people are all right WITH THAT\"\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nWow... that's really cool. Do artists mean for songs to come out like that backwards though? It would drive me crazy to work that out...\n\r\nanyway...\n\r\nI agree with what a lot of people have said here so far about this song. My theory:\n\n\r\n\"Eleanor Rigby picks up the rice in the church where a wedding has been,\r\nLives in a dream.\r\nWaits at the window, wearing a face she keeps in a jar by the door\"\r\nI'm probably WAY off here... or this whole thing has already been said, but She's watching a wedding right? wearing a face that she keeps in a jar by the door. She's in love with FM and is watching the wedding \"living in a dream\" and wishing that that was the two of them.\n\r\n\"Father McKenzie, writing the words of a sermon that no-one will hear,\r\nNo-one comes near\r\nLook at him working, darning his socks in the night when thereâ\u0080\u0099s nobody there,\r\nWhat does he care?\"\r\nFM wants nothing to do with her. He completely ignores her, because he doesn't care. The fact that he is darning his socks just adds to the apathy there.\n\r\n\"Eleanor Rigby died in the church and was buried along with her name.\r\nNobody came.\r\nFather McKenzie, wiping the dirt from his hands as he walks from the grave.\r\nNo-one was saved.\"\r\nShe died in the church. FM finally got tired of it all and got rid of her. \"wiping the dirt from his hands as he walks from the grave.\" as far as i know, the priest doesn't dig graves. He killed and burried her and no one cared about her so no one found out.\r\nor\r\nHe did love her back and was guilty, so he killed her to make himself feel better about it.\n\r\nAwesome song, just wanted to say what i though.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nThe backwards message was unintentional in this song.  In some songs (like Pink Floyd's Empty Spaces), they are inserted intentionally, but not here.  You can usually tell an intentional backwards message because it is gibberish forwards.\n\r\nFor example, if I were to say, \"Hello, my name is frog,\" it would be, \"gorf si mane I'm olle.\"  This might be interpreted as gibberish followed by, \"see man, I'm old,\" though in reality it is nonsense.  This song is the same.\n\r\nThe reason for this is simple.  There have been studies (my mom is a psychologist, and these are psychological studies, so I would know) that show that the human mind, when hearing sounds, automatically looks for meaning among them.  Therefore, if gibberish sounds remotely like speech, and is associated in some way with something we know produces meaningful speech (a mouth, a song, etc...), our minds may twist it slightly into something we recognize.\n\r\nAnother example would be:\n\r\n\"Upstyle floor,\" which is, \"Rolf lights up,\" when said backwards.  You can't see this just  by reading lyrics (usually, however, I did both of the examples in that way, and by sounding them out), you normally have to hear it, and see/know something that associates it with logical speech.\n\r\nHope this helps.\n\r\nI think the song is about an affair between a priest and a woman (married probably), that leads to the woman's death and the cover-up by the priest, as well as the priest's neglecting of his duties, which include making \"all the lonely people\" feel like they are wanted and like they belong.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nthis is one of my fave beatles songs.. i think that ER and FM had a little affair.. but he didnt want anyone to know about it.. seeing as though hes a father. i dont think he actually killed her... the dust off the hands could be because he was so sad w/ what happened? clutching her grave... you know...  but thats just what i think.. the beatles made songs for people to make their own meanings up.. thats the best part of being a performer... the listener becomes the real musician..\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nI always thought the line...\n\r\n\"wearing a face she keeps in a jar by the door\"\n\r\nimplied she wore false teeth. I know my grandma used to call her dentures her face.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nDespite all of the references to face in a jar by the door and everything, I initially thought this song might have been set back in the 18 or 1700's. This was because Eleanor Rigny is a real old-school name to me. I thought the song was referring to the black plague. No-one comes to Father McKenzies sermons for fear of catching the plague or coming in contact with a rat. No-one will hear the sermon he preaches because most of the village people have indeed, died of the plague. Eleanor Rigby died a nun. She was buried along with her name-not married to a man-, but was married to the church.\n\r\n* When i first heard this song, i thought the first line was \r\n\"Eleanor Rigby fixes up her eyes in the church where her wedding has been,\r\nIs it a dream?\"\r\nI thought she was married and was happy about it, hence the happy tears, and couldn't believe it had finally happened. Then hearing the \r\n\"Eleanor Rigby died in the church and was buried along with her name.\"\r\nThe wedding earlier was her initiation into the church, saying she's now married to the church.\n\r\nI was way off key wasn't i? Anyway, my interpretation has changed satisfactorially. Peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nanother song that has strong meaning when played backwards is Led Zeppelin's \"Stairway to Heaven\" where there's satanic messages!  For real, if played backwards with the subtitles underneath its recogniseable, but still sounds scary\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nI'm sure I'm wrong, and it's okay you can tell me! haha, but when I first heard this song I thought Eleanor Rigby was a prostitute. And the lonely people were people who went to her. Her church job is a daytime job. she \"waits at the window, wearing a face she keeps in a jar by the door, Who is it for?\" Who is it for, who will come to her tonight that she'll have to get all \"ready\" for. All the lonely people. And then she dies but no body came because no body really knew her, or her name? Okay as I said I'm sure this is completely wrong it was just what came to mind the first time I ever heard the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\ni get the feeling this song talks about a lonely woman who has little to live for except the church. she dreams only of marriage, and, having no real friends, she can fantasize only about marrying the priest of the church she goes to. loving the church as she does, she soon falls for her priest, father mckenzie. every time she goes to church, she wears her best and does what she can to impress father mckenzie and get his attention. father mckenzie's desires are out of his control and after catching on to elanor's desires, he can't help but plot her rape and murder. still a religious fellow, he writes her a nice burial sermon that he alone will hear after he disposes of the body. elanor rigby dies in the church (at the hands of the priest) and is 'buried along with her name'--nobody will ever hear it again, nobody will ever hear of her again. father mckenzie gets away with the murder and buries her in the church graveyard. nobody knew elanor. nobody was saved.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nThis song is actually a song wrote by john, when he was a pre beattle in the quarry men, him and his mates would sometimes sneak into an orphanage called strawberry field (hence also another beatles song \"strawberry fields forever\") anyways john and his friend at the time saw the tombstone in the graveyard of strawberry field labeled.... here lies eleanor rigby, loving mother and wife... asleep...\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nThis is my theory:\r\nFather McKenzie was in love with Eleanor Rigby.  If he had just told her before she died, then there wouldn't be so many lonely people in the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nFather Mckenzie wasn't a priest at all, and his real name was Tom McKenzie.  He was a friend to the band, he knew them before they were famous.  They used to stay at his house and all sit around playing songs while Tom darned his socks by the fire.  Eleanor Rigby was a real person, and I don't know whether the song was written specifically for her, but Tom McKenzie was my father's uncle and I have an old photograph of him sat at Eleanor Rigby's grave.  There is a cutting of some magazine stuck to the back with the writing: \"'Father' Tom McKenzie at the grave of Eleanor Rigby, whom The Beatles wrote a song about...' I think the picture was taken for an interview or something, I'm not sure.\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nTo me, this seems like a song about love out of reach. We discussed this in my music class. My professor is a recognized Beatles scholar. He didn't couldn't give a definitive answer to what this song as about, but it really got my attention.\n\r\nThis is just one opinion.\n\r\n\"Eleanor Rigby picks up the rice in the church where a wedding has been,\r\nLives in a dream.\r\nWaits at the window, wearing a face she keeps in a jar by the door,\r\nWho is it for?\"\n\r\nThe song never tells why Eleanor Rigby is at the church. Someone mentioned she cleans up after weddings. Makes sense to me. She's lonely. The other character in the song is Father McKenzie. They have to be connected somehow. It could be that she wants to be with him.\n\r\nBut if it's true that he's a priest, aren't priests prohibited from getting married? He's unattainable. She's lonely. She knows there's no chance, and she can't let anyone see it gets to her. So before leaving her room, she \"puts on her face\" that makes her look less empty. OR the \"face in a jar\" could be makeup. She puts makeup on, but why? Who's it for? Father McKenzie, perhaps? Even though they could never be, she can still look nice for him. \n\r\n\"Father McKenzie, writing the words of a sermon that no-one will hear,\r\nNo-one comes near\r\nLook at him working, darning his socks in the night when thereâ\u0080\u0099s nobody there,\r\nWhat does he care?\"\n\r\nNot sure how the sermon could come into this version of the meaning. Possibly just showing how lonely he is. He feels like no one pays attention to him, but he writes his sermon anyway - it's his duty. He could be darning his socks in the night for the next day. It's like cleaning house; you don't do it when people are watching. What does he care? Maybe he wants to look nice? Maybe for Eleanor? Maybe just because he's a priest?\n\r\n\"Eleanor Rigby died in the church and was buried along with her name.\r\nNobody came.\r\nFather McKenzie, wiping the dirt from his hands as he walks from the grave.\r\nNo-one was saved.\"\n\r\nWhen Eleanor died, she was buried with HER name. She was never married. Almost like she was obsessed with the idea of being with Father McKenzie. And he didn't kill her. In Catholic burials, it's a tradition to throw dirt on the casket before burying. The priest conducting the funeral does that. That's why he wipes his hands.\n\r\nNo one was saved? From what? Could it be in the religious sense, seeing that he is a priest? Or could it be from loneliness? Neither of them ever got what they wanted. They will both die alone. Nothing got better, no one was saved.\n\r\nWho knows?\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nThe thoughts are about a lonely female sexton, who hoped to have a life and family, but instead, worked her whole life, alone, living in the Episcopal Church, possibly deformed, (the face in the jar by the door), or it could be makeup.\n\r\nJust a thought about the lonlieness that people live and die with.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nPAUL-IS-DEAD \n\r\nSgt. Pepper's Lonely Hearts Club Band:\n\r\nOn the Front Cover:\n\r\n1.) All the people are looking at a freshly dug grave.\n\r\n2.) Paul is holding the musical instrument cor anglais, and it is black, symbolizing death, and the only Beatle holding a black instrument. Where Paul is holding it with his left hand (being left-handed) he is displaying three fingers, meaning only three Beatles left?\n\r\n3.) This was the first album on Apple Records and the first album that the group wrote their name as \"Beatles,\" rather than \"The Beatles.\" This is inferred to mean that they are no longer a whole as in \"The,\" but now since there are only three, it is just \"Beatles.\"\n\r\n4.) The yellow hyacinth in the shape of a left-handed guitar only has three strings.\n\r\n5.) The doll in the red, black and white stripes has a car model on her lap next to her right hand. This model with red interior is supposed to mean the car in which Paul was killed and the red interior is blood.\n\r\n6.) The other three Beatles' are standing sideways behind the drum, except Paul who is standing forward.\n\r\n7.) On the drum is written in the center \"Lonely Hearts.\" Using a mirror, place it perpendicular to the center of the drum. Splitting the words \"Lonely Hearts\" in half, the combined writing reads - 1 ONE 1 X HE DIE. This means that the \"1 One 1\" equal three, or that Paul is gone, and the \"X\" is meant to cross out Paul. Between the words \"HE\" and \"DIE\" is an arrow that points directly to Paul.\n\r\n8.) The hand raised over Paul's head, is to mean \"death.\"\n\r\nThe Back Cover:\n\r\n1.) Paul is facing the back, which can mean that he is an imposter, or that he is dead.\n\r\n2.) George's right-hand index finger is pointing directly to the words \"five o'clock,\" the supposed time of the car crash.\n\r\n3.) That the song lyrics \"Within You, Without You,\" are printed over Paul's body.\n\r\nThe Songs:\n\r\n1.) Lovely Rita:\"When I caught a glimpse of Rita,\" and \"I took her home, I nearly made it.\"\n\r\n2.) A Day In The Life: \" He blew his mind out in a car, he didn't notice that the lights had changed. A crowd of people stood and stared, they'd seen his face before...\" \n\r\n3.) Good Morning, Good Morning: \"Nothing to do to save his life.\" \"People running around it's five o'clock.\" \n\r\n4.) She's Leaving Home: \"Wednesday morning at five o'clock.\"\n\r\n5.) Sgt. Pepper's Lonely Hearts Club Band: The reference to Billy Shears is supposed to be that of William (Billy) Campbell, the look-alike.\n\r\nMagical Mystery Tour\n\r\nThe Front Cover:\n\r\n1.) Paul is alleged to be the one in the \"black\" walrus suit.\n\r\n2.) In the booklet, Ringo's drums read \"Love the 3 Beatles.\"\n\r\n3.) In the picture where The Beatles' are wearing white tails, Paul is the only one with a black carnation, the other three have red. \n\r\n4.) When you hold the album cover to a mirror, the word \"Beatles\" is a phone number, which is 2317438. It has been said that if you had called this number back then, a recording came on saying, \"you're getting closer.\" Of course there is no area code etc., so I doubt this one too.\n\r\nThe Songs:\n\r\n1.) I Am The Walrus: At the end of the song, where the spoken words from the play King Lear are placed, you here \"O, untimely death!\" and of course as we know, \"The Walrus Was Paul.\"\n\r\n2.) Strawberry Fields Forever: When John Lennon says in the end of the song the words \"Cranberry Sauce,\" it was long believed to be he saying \"I Buried Paul.\" However, it was electronically manipulated to sound like he was saying \"I Buried Paul\" but he actually isn't. 3.) All You Need Is Love: At the end, Lennon says, \"Yes, he's dead.\"\n\r\nYellow Submarine\n\r\nThe Front and Back Covers\n\r\n1.) Lennon's hand raised over Paul's head, indicating \"death.\"\n\r\nThe Beatles (The White Album)\n\r\n1.) Glass Onion: The term used for a coffin with a glass top.\n\r\n2.) 'Don't Pass Me By: \"You were in a car crash....\"\n\r\n3.) Revolution 9: The words, \"Number nine, number nine,\" repeated many times are supposed to say when played backwards, \"dead man, turn me on dead man.\" The reference to the number 9 is supposed to be that of McCartney having nine letters.\n\r\nAbbey Road\n\r\nThe Front Cover:\n\r\n1.) The common meaning of the Beatles' dress - Lennon in white for a priest, Ringo as the undertaker, George as the grave digger, and of course Paul, in his bare feet, holding a cigarette in his right hand (being lefty) all means death.\n\r\n2,) The police vehicle parked to the right in the photograph is a morgue wagon. \n\r\n3.) The Volkswagen parked on the left side of the street has a tag that reads, \"LMW 28IF. This has been construed to mean \"LMW - Linda McCartney Weeps\" and the \"28IF\" means that Paul would have been 28 years old IF he had lived\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nThis song is about a murder. No one knows Eleanor Rigby and no one knows Father MacKenzie. So Father MacKenzie murdered Eleanor Rigby and got away with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nI just found a very hidden meaning to this song. When it says \"lives in a dream\" Eleanor realizes that she is very lonely. \"the face that she keeps in a jar by the door\" is like looking at herself in a mirror on her door. When father McKenzie is \"darning his socks\" he's darning his socks in a different way. He is very mad because his daughter has a deadly disease, that's where the \"What does he care?\" part comes from. Now he can't cure his daughter because he is very poor, that's because no one listens to his sermons so he doesn't get paid. Father McKenzie is \"wiping the dirt off his hands as he walks from the grave\" because his daughter died, so \"no one was saved\" because Eleanor is dead and her father is still poor. When it says \"where do they all come from\" it means that if someone doesn't have any friends, you just forget them and then your like, \"Where did you come from?\" The \"where do they all belong?\" part means if you are one of those people that are lonely, then you try to befriend them but then they deny you.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nThis song is about a british bride who was raped by \"Father McKenzie\" who then buried her and raped her again \"wiping the dirt from his hands???\" It truly touches my heart that this man cant find love and we should pitty him. Eleanor is a bitch for rejecting him.\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\npicking up rice: she went to church to be married even though noone would show up...she's glooomily cleaning up\n\r\nalone\n\n\r\n\"Waits at the window, wearing a face she keeps in a jar by the door,\"\n\r\nshe's still pitifully waiting...the face in a jar is her makeup\n\n\r\n\"Father McKenzie, writing the words of a sermon that no-one will hear,\r\nNo-one comes near\"\n\r\nfather mackenzie is writing a sermon about eleanor's death\r\nhe killed her secretly\r\nthat's why noone will hear it. \n\n\r\nEleanor was \"buried along with her name.\" because 1. he sercretly killed and buried her ...therefore as she was so lonely, noone really knew or will know she had existed\r\n2. her name is buried as in humiliation...\n\r\n\"Nobody came.\"(to her wedding)\n\n\r\n\"Father McKenzie, wiping the dirt from his hands as he walks from the grave.\" \r\nhe buried her body\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nI think this song is about more than just lonely ppl, i think\r\nfather mackenzie killed eleanor. THATS JUST ME THOUGH.\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nthe song was inspired by the tombstone of eleanor rigby.\r\nwhen john lennon was a young boy in liverpool, he and his friends used to hang out at a graveyard in the city. once he came across eleanor's tombstone- the word \"asleep\" was inscribed on it rather than \"RIP\". This really struck John, so he went home and wrote a song about it\n\n\n", "comment_212": "\nThe songs initial concept was Paul's, thats why he sings it, but they wrote it together and it developed into a John song.  John's influence definitely took over as the song progressed. The great quality of lyrics in the song are very rare with Paul McCartney and common with John Lennon; check out their lyrics in there solo careers.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nHa Ha... sorry about that last one I just had to I love that line in the song anyway I think its sad\r\nthat they start out talking about the character Elenor at a wedding and end with Elenor being buried and \r\nhow you start out with Father Mackenzie writing a sermon and end with him filling a grave.  I also agree \r\nwith you stpittss, that this song develooped into a Lennon song. I think the song was written by both\r\nLennon and McCartney wrote the song but it has more of a Lennon influence to it. it also has a Imagine \r\nsound to it, dose anyone notice that? \n\r\nthis song is so ~sexy~\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nOops I meant the it was developed into a lennon and the next sentence was supposed to be, I think the song was written by both Lennon and McCartney. they both may have wrote the song but it has a more of a Lennon influence to it.\n\n\r\nso ~embarrassing~\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nOkay, so we know the song was inspired by a name on a tombstone. But that isn't really the meaning, just the inspiration. I think it's more than just being lonely. I think Father McKenzie possibly raped Eleanor. Eleanor apparently hangs out around the church, especially after weddings, and wears makeup to impress despite apparently not being in a relationship with anyone. This is a common symptom of Stockholm Syndrome, where victims of crimes (most notably rape and kidnapping victims) sometimes develop a loyalty to their assailants. Father McKenzie writes sermons even though he knows no one will come near him or his church. That makes me think the people who used to attend his services no longer feel safe. Eleanor later died, in my opinion a suicide after finally realizing he doesn't love her and the possibility that she became a social pariah afterward. Father McKenzie then had to bury her as part of his priestly duties. Perhaps because no one was saved, he tried to pray to save his own soul, but now the weight of her death rests on him.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nNow this may be a little unconventional, since it doesn't look like anyone else interpreted it this way, but bear with me--\r\nI kindof always thought that a lot of it was written from the perspective of \"Father McKenzie\": that he saw Eleanor Rigby, an obvious lonely person, and that the sermon he was writing was the sermon for her funeral, and he killed her. Notice how it says \"died IN the church and was buried along with her name\", and then Father McKenzie was \"wiping the dirt from his hands as he walked from the grave..no one was saved\".  I guess I always thought that Father McKenzie was supposed to be a confused person, trying to figure out how to help the lonely people(after all, he is a Father), and through frustration ended up deciding to kill Eleanor to \"save her\" from her loneliness. \t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\n!!!!!!!!!!!!!!!!!!!!\r\nthis song is about a groupie that if im not mistaken paul mccartney was in love with. \r\nand here he wrote a song about her. eric clapton was also in love with the same girl and he wrote a song about her too called \"Layla\"\r\nsongs aren't always what they seem, and the lyrics are so much more deep that what you can imagine.\n\n\n", "comment_218": "\nI'd say it's about a prostitute. Her various clients are lonely to one degree or another so visit her, but ironically when she dies nobody is present at her funeral except the vicar - she was lonely herself.\n\r\n'Wearing a face she keeps in a jar by the door' - a great line and quite ambiguous, but I think its the slightly different personas she puts on for each client - hence 'Who is it for?'\n\r\n'Wiping the dirt from his hands as he walks from the grave' - the 'dirt' could be the general view of her as a whore, or perhaps he slept with her himself and was now trying to wash his hands of her.\n\r\n'No one was saved' - her clients are still lonely and so was she when she died.\n\r\nMore broadly its about the emptiness of modern individualistic society, and interesting as I suspect it grows more relevant all the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nI know this might seem really out there, but whenever I read the lyrics to this song, I always thought it was possible that Father McKenzie was in love with Eleanor Rigby but couldn't be with her...Thoughts?\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nFor some reason, I figured that there was a secret affair, and the Priest killed Eleanor because of his guilt, and as a result of this the lonely woman that remained by the church was not saved..\r\nwiping the dirt from his hands could mean he was wiping away his guilt for being involved with the woman, but I'm not too sure\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nNo offense to the Beatles, but I have a different perspectve of the song. Father Mckenzie, as his title states, is most likely a priest, and if no one was saved, there is no reason for a preist to be at a funeral. So I have concluded that Father Mckenzie killed Eleonor Rigby and buried her. I think that her putting on a face when she looks out the window supports this.\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nThis song is very obviously about lonely people dying without having anyone. To me, this song has very weird things associated with it. When I was little, I would always stay at my grandparents house, it was here I learnt all the great beatles songs. On a particular visit to their house, we walked through a graveyard and my brother had just learnt this song and he was singing it. Later that night, I was sleeping and I woke up to someone standing next to my bed blowing bubbles. I'm certain it was real but no one believes me so I'll just say it was a dream. I closed my eyes and pretended it wasn't happening and this song was just running through my mind the whole time. I think the person who stood beside my bed was lonely and he wanted my company. Whenever I hear this song, I cry for all the lonely people.\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nI would describe this song as eerie, or haunting. F.M. murdered E.R. for sure. The violins in certain parts of the song sound like something you would hear in a slasher film. When I hear those violins I picture F.M. stabbing E.R. repeatedly. I know it sounds gruesome.. but that image always come to mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nI believe that Father McKenzie ends up killing Eleanor Rigby. He's \"writing the words of a sermon that no one will hear\". He knows that no one will hear it because that's the sermon He'll recite after he kills Eleanor. At the end Paul tells us, \" No one was saved\", well Eleanor was killed and McKenzie's soul will not be saved either for his has sinned by killing her. Remember this song came out not long after John had been in trouble for his \"most popular than Jesus\" remarks. The Beatles weren't all that happy with the Church at the time, and I feel that this was they're way of saying Ya'll ain't a bunch of saints either, not even your priests.\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nWhen I hear this song the movie that pass in my head is as follows:\n\nEleanor lived in the street but was welcomed by Father McKenzie, eventually she felt in love with him and in consequence they slept together.\n\nNow, she dreams to marry Father McKenzie and be with him forever.\n\nHowever, as he is a priest, he had to keep the secret 'buried'. Therefore he planned to kill Eleanor.\n\nSo one night, wearing his stocking on his head, he pretended a robbery and killed her\n\nNext day she was buried but since she had no family, nobody cared.\n\nNow the \"wiping the dirt from his hands\" have the literal meaning, since he buried her, and metaphorical, that he 'solved' the problem.\n\nAnd Nobody was saved because there were no preaching at her funeral, and sarcastically her soul didn't go to to heaven because she slept with the Father.\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nEleanor Rigby, picks up the rice\nIn the church where a wedding has been\n       Paul is cleaning up after an early Beatles concert\nLives in a dream\n       Heâ\u0080\u0099s a rockstar, heâ\u0080\u0099s living his dream\nWaits at the window, wearing the face \nThat she keeps in a jar by the door\n       Waits inside before exiting the venue, wearing the persona of Paul\nWho is it for\n       The persona is forâ\u0080¦\nAll the lonely people\nWhere do they all come from?\nAll the lonely people\nWhere do they all belong?\n       The lonely people are the fans. They come from everywhere\nFather McKenzie, writing the words\nOf a sermon that no one will hear\n        Father McKenzie is the more serious Paul later in life. Heâ\u0080\u0099s writing lyrics that heâ\u0080\u0099s never going to use.\nNo one comes near\nLook at him working, darning his socks\nIn the night when there's nobody there\nWhat does he care \n        â\u0080\u009cdarning his socksâ\u0080\u009d is him cleaning up lyrics\nEleanor Rigby, died in the church\nAnd was buried along with her name\nNobody came\n         This is the old Paul symbolically dying. He â\u0080\u009cdiedâ\u0080\u009d at their last concert in August 1966, same release time of the album. â\u0080\u009cBuried along with her nameâ\u0080\u009d was just saying that he got the name Eleanor Rigby from the church cemetery where he met John. Nobody came to the burial because it was symbolic, not an actual burial.\nFather McKenzie, wiping the dirt\nFrom his hands as he walks from the grave\n         This is the more serious Paul saying goodbye to the old Paul\nNo one was saved\n         This simply means that not only Paul â\u0080\u009cdiedâ\u0080\u009d but all of the Beatles went through this transition.\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nEleanor Rigby: A middle-aged or older woman who suffered from relationship or just borderline loneliness, picks up the rice in a church from a recent wedding, reasoning either out of curiosity of how marriage is like because of lack of experience or wanting to be married. She waits for the man of her dreams by a window watching as she holds the rice in her hands out of 'good luck'. \n  'Lives in a dream': By her apparent lifelong loneliness, she lives in her fantasized world as  the things she wants to be: a bride. \n  'Waits at the window, wearing the face that she keeps in a jar by the door, Who is it for?': \n  'Wearing the face that she keeps in a jar by the door', A face of hopeful delirious contentment, the jar is waiting by the door because of herself in her dream living a happy wedding, the jar in her perspective is how she views her state of content, the jar is by the door because it's everyone's view of her inside. She is waiting as long as she has to, even if it means sitting by the door of the church until her apparent death. The person she's waiting is her groom. \nFather Mckenzie: A maniacal man over his horrid loneliness in life and linger for love. He kills Rigby by his insanity and buries her at the back of the church he owns. He writes a sermon for Rigby's planned death since she won't leave his church and incites it before he wipes the dirt off his hands and forgets her corpse. Thus Eleanor Rigby is forever forgotten. \n  'Writing a sermon that no one will hear' is a reference to Eleanor's loneliness. Her 'funeral' will be lonely and no one will attend. 'Look at him working, darning the socks in the night where nobody's there' meaning his plan to kill Rigby as the days go by. \n  Rigby is murdered and buried, 'no one is saved'. No one is saved because Rigby is dead and died lonely and Mckenzie now has a possibility to going to prison and living with the guilt of the murder of Rigby. \n  Loneliness can be a horrid thing to people. I don't exactly know why, but this song is haunting to me and scares me to levels I don't understand . . perhaps the tone and the meaning? The tone itself kind of gives me a feel of irritation, or observance. Oh, and don't forget that violin . . .\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nThis is a great song.  I believe that it has two purposes, unrelated to each other.  The first purpose was to just be some kind of standard song with a subliminal meaning, like everyone else was saying.  \n\r\nHowever, this song is also reflective of the Paul is Dead theory.  The funeral being sung about is the original Paul's funeral, in which only the remaining three Beatles attended, along with Paul's parents.  The evidence can be found in the second verse:\n\r\n\"Father McKenzie\r\nWriting the words of a sermon that no one will hear\r\nNo one comes near\r\nLook at him working\r\nDarning his socks in the night when there's nobody there\r\nWhat does he care?\"\n\r\nFather McKenzie (was previously to be McCartney in his honor) wrote a sermon for Paul, but wound up not using it since the 5 people in attendance already knew everything about him.  \n\r\n\"Father McKenzie\r\nWiping the dirt from his hands as he walks from the grave\r\nNo one was saved\"\n\r\nReferences how Father McKenzie buried Paul himself.  Since the funeral was a secret, there was no one else to do the job.\n\n\n\n\n\n", "comment_229": "\nSuicide.   Nobody comes to the funeral.  Died in the church or died within the church means she was a member of the congregation in good standing.  Until, she offer herself - this merits an unmarked \" nameless\" grave z- buried along with her name.   You don't go to heaven if you commit suicide, no one was saved.  \t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nSo in my eyes the whole story is this: Rigby visits a church after a wedding that Father Mckenzie owns. She picks up residue of the wedding and wishes for marriage over her deep loneliness in her life. Father Mckenzie, being an ignored man, suffers from deep mental conditions over his lifelong loneliness, he asks Rigby to leave on several occasions, and Rigby refuses because she wants to see the man of her dreams walk in the church over the 'collected luck' the church could have.\nMckenzie begins to linger from his clinging sanity. Being a man who lives alone with no wife, he 'darns socks' as in a way of thinking to himself at night. And during the prior events before Rigby's death he is plotting her own death over his insanity. Rigby, who is still waiting in the church, is oblivious to this as she is trailing more away from reality and into her fantasies of leaving loneliness for good. \nRigby is then killed by Mckenzie and is buried at the back of the church and is buried. Mckenzie incites his written sermon of delirium and 'wipes the dirt off his hands': forgets Eleanor Rigby for good.\nI'm not saying this theory is 100% accurate, but it's interesting how I came this up in just minutes.\t\t\t\t\n\t\t\t\t\n\n"}