{"comment_0": "\nMost incomprehensible lyrics ever.  So why is it so great?  I don't know.  It's been my favorite U2 song since I heard it, but I still can't figure out any semblance of meaning for it.  The best I can figure is by the song title and various scraps - it's the love-hate relationship between teacher and student, or child and fallen hero; a tie of respect and admiration that is strained over and over, but is only strengthened by the pain.\n\r\nThe song's best quality is its smoothness.  No other song I know of uses the flow of music and song like a twisting summer breeze in quite this way (Think Led Zeppelin's \"Kashmir\" or Dire Straits' \"Brothers in Arms\" for this category).  The song just melts into your brain like an epic poem, and the words are just soothing chants that you're not meant to understand, with the occasionally perceptible utterance of a spine-tingling phrase like \"Ah, don't talk to me\" or \"You're through with me, but I know that you'll be back for more\" or \"Your heart is left out from the side.\"  And they're all whispered in Bono's most introspective of voices, and you know it's personal for him, and that makes it so touching.  It's as if each sentence is a self-spoken prayer overheard in a deserted church.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe song is about the genius of Elvis Presley. You know like nobody told you how, but you know. That lyric is reference to how Elvis held the mirophone, he just did it, he just knew how\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nOne of my favorite U2 songs along with Bad and Running to stand still. But U2 has many more great songs which I adore.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis has always been one of my most favourite U2 songs. I agree that it seems to be about a strained relationship. To me, it's more of a lover relationship though. Maybe they keep fighting but always go back to each other. I am not sure. But it is SO beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nDoesn't this song have to do with the rise and fall/death of Elvis in America?\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis has been one of my fav u2 songs of all time.\n\r\nFrom what I can recall... the reason the lyrics are hard to understand is there are no lyrics for this song. Apparently Bono was singing lyrics off the top of his head (or from partially completed lyrics) while facing a large painting of Elvis. \n\r\nu2 did not like this song but Brian Eno urged the fellows to put it on the album arguing that the song captured a great mood.\n\r\nThis song is perfect to play on a cold, grey, rainy day.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThe music is played backwards, Eno was trying things, it sounded good so they keep it\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis is the weakesty song on the album, so why does everyone love it so much? I know it is kind of relaxing, but it is extremely offbeat, and if Eno kept the music how it was it could have been better.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI don't think this is the weakest song on the album. I think its the most original from the rest, actually.  It's unlike the other tracks on the CD in its construction and lyrcis (the music is A Sort of Homecoming slowed down and played backwards) and there are no lyrics (Bono is addlibbing), at first this was my least favorite on the album as well. But new music requires new ways of listening to it. You can't approach listening to this song the same way you do the rest of the album. Its total mood. Play it on a chilly, drizzling, overcast morning.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nIts daring - it doesnt sit well with the rest of the album and I read it was almost entirely improvised.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nYeah, the adlibbed lyrics and backward rhythm track is clever enough.   But it is a wonderfully lonely, sad, ethereal piece that is perfect for being alone late at night.  The song is an implied \"open letter\" from a dead Elvis to his daughter, Lisa Marie.  \n\r\nI do have a correction for the lyrics though - at 4:10\n\r\nThey...mmm loved\r\nSkip staying sad oh Lisa\r\nDon't stay sad no more Lisa\r\nDon't stay sad no more Lisa\r\nDon't stay sad no more Lisa\n\r\nat 5:20 -\r\nYou know S.O.N.G. why\r\nYou evoke joy to God \n\r\nWith Elvis's death and self-inflicted loss of his daughter, Lisa Marie Presley\n\r\nAmerica, as a unit, gave Elvis his fame, and brought him to an untimely demise as well.  He was lost in all that \"America\" offered, but all that \"America\" offered gave him riches and fame beyond belief.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthis is my fave u2 song, period!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI am glad I was not in high school meticulously transcribing lyrics when this was released, I'd have gone nuts. I loaded it and many other U2 onto my new iPod, and when it came up in a shuffle play I was blown away all over again. It's like falling in love with a song in a foreign language and not caring about the meaning, the melody is so hypnotic I never really thought about it. So that scratching a 30 year itch by finally reading the lyrics (and comments)brought absolutely no insight was in a way a relief.\n\r\nMaybe it's a Mondegreen, but I always heard (still do) this\n\r\n\"Like you pretend you can\r\n\"You say go, you live\"\n\r\nas\n\r\n\"Like pinpricks in your hand\r\nYou say, 'Oh Julia\"\n\r\nwhich actually almost makes sense.\n\n\r\nThis song is perfect for breathing.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI thought it was a dying man and his son reflecting on their lives.\n\r\nOh, flesh from my own love\r\nTell me on my eyes\r\nOh, flesh of my own life\r\nStop telling me these things\r\nAnd I believed you\r\nAnd I believe in you\n\n\n\n", "comment_14": "\nThis song is the resulat of Brian Enos and Daniel Lanois experimentations. The rythmtrack of A Sort of Homecoming was slowed down and they told Bono to improvise the lyrics and the melody. \n\r\nItÃ\u0082Â´s a stream of consciousness where the words seems to be comming from a far. Very  ethereal and atmospheric. \n\n\n", "comment_15": "\nI believe these lyrics were semi-improvised, and recorded on the first take. The music is also based on on one of the tracks of \"a sort of homecoming\"...\n\r\nOddly enough this is one of my favorite tracks on the album, and the first song I listen to after my team loses a big game. This is mainly because of the disconnected, muttered way the lyrics are expressed as opposed to custom-made \"feel good\" songs like \"fix you\" and \"bad day\". \n\r\nThere's something strangely relatable and sincere about Bono in this song. It's not lyrically vacuous, it has an emotional sensation and a story to tell. It's just that the narrator is unclear about coming to the source of it all. It's the best example of the \"lyrical sketches\" Bono has referred to in the album. It dwells poeticly on the immediate feelings, but struggles to put it together in a complete picture. This adds a flawed, human quality that I think most of us can relate to. \n\r\nIt's like a book of abstract pictures that are being thumbed through. Maybe that's why it's so satisfying to listen to. Because it dwells on the ambiguity of mixed emotions instead of a clear consistent theme. The only real way of expressing that lack of clarity is to apply that to the lyrics. \n\r\nFurthermore, this carries over to the way the song is arranged, where the line between verse and chorus is blurred or nonexistant. And when the song ends it's, not really resolved, but just like a snippit from an infinitely long piece.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nLike most (all?) U2 lyrics, I believe that this song is about Jesus.  Especially towards the end of the song:\n(And you wipe sweat off your white brow)\nAnd you care\nAnd no one told you tried\nAnd your heart\nIs left out from the side\n\nWhen Jesus was on the cross and his brow was wiped, and when he died, they pierced his side and water and blood came out.  After, it began to be raining and storming and the earth opened up:\n\nAnd the rain beats down\nAnd the shame goes down\nAnd this rain keeps on coming down\n\nHe then joins God in Heaven:\n\nYou know \"S\" \"O\" \"N\" \"G\", why\nYou're going go join to God\n\nI'm not sure if it's coming from the angle of Bono/Mankind struggling to be with Jesus or from the point of view of one of his apostles who was with him, witnessing this, who is now saddened and scared that he has gone to Heaven, and feeling abandoned (prior to the Resurrection).\n\nAnyway, that is how I see it.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nStay stay the same\r\nNever be sad\r\nDon't stay the same\r\nNever be sad\r\nDon't stay the same\r\nNever be sad\r\nDon't stay the same\r\nNever be sad\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nWhile I love Steve Lilywhite's production, Brian Eno took U2 to another level. From EP and America to the number of lesser known b-sides. U2 were exploring new territory and Eno was such a perfect choice to help them do so as he had done with Bowie. Just love this song. It typifies why I loved U2 up until the Joshua Tree. I am sure Bono was hanging out with a particular less known poet/writer in Dublin who inspired a lot of his lyrics. If you check out the Lyrics on this album, you will see how in depth Bono became all of a sudden.\t\t\t\t\n\t\t\t\t\n\n"}