{"comment_0": "\nLast year on New Year's Eve, I was spending the night at my best friend's house, we were listening to the Mariah Carey: # 1's CD and when I first listen to this song, it sounds like Best of my Love by Emotions! :D\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI started playing this off the computer (iTunes) and my pug dog went PSYCHO when she hit he high note near the end of the song. She sings higher than I can whistle!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni love this song, because i sung it for my a level music exam. it got me an a, so it cant be bad!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nlol thats cool\r\n      its a good song\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis is an amazing song in my opinion. This song really shows off mariah's incredible vocal range!! There should be more comments here! lol. It's just amazing how she goes higher and higher!!! this song makes me want to just get up and dance!! She has so much power in her voice - I envy her so much!!! She just blasts out all the words/notes - phenomenal!! this is a fun song, one of her more uplifting songs. The whistle notes are just out of this world! wow. It blows my mind every single time I hear this song!! And I love listening to the unplugged version!! she's just way too good.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis is a great song. I like how she hits the high notes.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nAwesome song. It's fun to dance to and MC's voice is absolutely unbelievable. She's one of the best of our time. \r\nThe song is about someone getting some amazing EMOTIONS from their lover. And those feelings have them on Cloud Nine and \"satisfied\" and \"alive\". To be that in love is a wonderful experience. \r\nI love the line: \"I don't know if it's real/ But I like the way I feel... INSIIIIDE\". Great song. \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nIt's about infatuation. She likes the feeling of being with this guy. She doesn't know if it's real love, but she's in love of the moment.. not him. It basically explains the feeling of the beginning of a new relationship.\t\t\t\t\n\t\t\t\t\n\n"}