{"comment_0": "\nYes this song is definitely about fears. Also it is about dreaming and how limitless we are in our dreams. And when we realize the limitlessness we expect the worse and develop fear.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nYes, I think it's representing our deepest fears represented by a kid having nightmares.  Awesome song.  1st song I learned to play on the guitar.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI always thought this song was about fear and dreams/nightmares, and the fact that no amount of prayers you say will allow you to escape fear and be free from it.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\none of the greatest intros ever with a phenomenal guitar solo\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nsome people seem to claim this song is about suicide, but I beg to disagree.\r\nit's just a trip into the darkest part of a child's nightmare.\n\n\n", "comment_5": "\nThis is an awesome and euphoric song, which (to me) talks about the nightmare that causes heroin usage. he also reinforces it saying he is not talking aboute coke: \"...And they aren't of snow white\".\nHeroin at first its very pleasent :\"Tuck you in, warm within\".\nBut after, heroin alters his perception of reality: \"Its just the beasts under your bed,in your closet, In your Head!\":\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nhahaha....ecstasy....and other drugs you inject?  oh that's funny....\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nmaddox86, how the hell can u say slipknot is a lot better than metallica, metallica will kik slipknots ass 1 million times over, slipknot sux!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI agree with maddox in a way..and dissagree in a way, Metallica is better than Slipknot, but Slipknot still owns..all u steriotypical bastards never ever heard slipknot I'll bet and all u think is that they scream and fight and shit..u are all a bunch of dumbas people\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nTheGame56, i dont know whether or not you'll ever look on this forum again, but members of the band have in fact done many drugs. I believe load and reload are proof enough. They talk about it in some kind of monster, though no one has commented since it came out.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nSchizophrenia. Voices in one's head, horrible things that aren't there, visions and madness. \n\nOkay, so maybe that's stretching it, but it makes more sense than drug abuse, and fear seems too obvious.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nIts about Metallica warning of an Angel who turns out to also be Peter Pan.  This is an attempt by them to confuse you on who is good and who is evil\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nwhat does this song means to me?... let's just  say if it wasn't for this song, i wouldn't who metallica was!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nWtf is so special about this dumbass song listen to megadeths go to hell and tell me which is better this slowass no solo shut us not working out I want a fucking time machine to go back to the good old days with with kill em all and ride the lightning I miss that metallica not this new shorthaired metallica\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthis is the first metallica song i ever heard. i wasn't as in too music as i was until i heard this. now i have 8 of their albums. one of my top favorite metallica songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI created an account just to say this\r\nAll you have to do is five minutes of research... and the band has stated this fact several times\r\nThe song is about SIDS - Sudden Infant Death Syndrome - or \"Crib Death\" ... ie when a baby dies in its sleep for no reason\n\n\n", "comment_16": "\nBasically I think this song is about nightmares. That's what's in the video anyway \n\r\nkick ass song btw\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nWHERE SABATH LEFT THE TORCH, METALLICA PICKED UP \r\nAWSOME SONG\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nfull of cool things;like...\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\n\" ... Hush little baby, don't say a word\r\nAnd never mind that noise you heard\r\nIt's just the beasts under your bed,\r\nIn your closet, in your head ... \"\n\r\nRemember Bloom County? ... Binkley's anxiety closet? ...\n\r\nI love FEAR of the unknown!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nGod, i love these guys, as well as the rest of the Big 4\r\n(Except for Anthrax)\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nFor me it's about PTSD\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nJames Hetfield's response (in an interview) about the song:\n\n\"Weâ\u0080\u0099d had that title â\u0080\u009cEnter Sandmanâ\u0080\u009d for a long time. It was originally gonna be about crib death â\u0080\u0093 yâ\u0080\u0099know, baby suddenly dies, the sandman killed it. But thatâ\u0080\u0099s a little corny. I wanted more of the mental thing where this kid gets manipulated by what adults say. And you know when you wake up with that shit in your eye? Thatâ\u0080\u0099s supposedly been put in there by the sandman to make you dream. So the guy in the song tells this little kid that and he kinda freaks. He canâ\u0080\u0099t sleep after that and it works the opposite way. Instead of a soothing thing, the tableâ\u0080\u0099s turned.\"\n\nRead more at uncut.co.uk/features/…\n\n\n", "comment_23": "\nThis song is not about drugs whatsoever.  No memeber of Metallica has even tried drugs.  They have always been a strickly alcohol drinking band.  Enter Sandman is about the deepest darkest fears of the human mind.  It takes a trip through a nightmareish world while being chased by a mysterious figure ready to capture you if your not careful.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI agree with TheGame56, because I don't ever recall hearing of Metallica doing drugs, plus Ecstasy isn't a drug you inject.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nJup I have 2 agree its about the fear a child hs for entering dreamscape, it is so clear in the video as well. Although the explanation of drugs isn't bad it just doesnt fit metallica, but I don't think it is a stupid interpretation of this song at all,\n\r\nTuck you in, warm within \r\nKeep you free from sin \r\nTill the sandman he comes \n\r\nit could easily be a representation of a feeling you get when you are on drugs, and if you say Metallica don't write about drugs you're wrong, Master of Puppets is clearly about drugs, though alot of people think it is about soldiers getting send of to the frontline getting killed for the sake of a nations goverment ((ps sorry if my enlgish aint that good Im Dutch so :D))\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis is well gud song  i think that metallica have some ov the best guitar solos  \t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\ni can say i like slipknot but i have 2 say metallica are much better and they would beat slipknot 1 million times over\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nslipknot? what a joke. theyre just a big dumb act. id love to see those talentless dumbfucks do anything half decent\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nid love to see you try. ill talk all the shit i want. slipknot sucks. thats all there really is to it. they are just a big talentless act. and how many timnes do you have to use the word fuck to get your point accross? try a thesaurus\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ni think maddox86 is a perfect example of the type of demographic Slipknot is geared toward.\n\r\naltho, now the question comes to mind:  who is the product of whom?\n\n\n", "comment_31": "\nto compare metallica with slipknot is sort os unreal isn't it? i mean, i adore both bands, they are very important symbols of metal music, but aren't they a little bit appart in time? \t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\ntruelly this song 's just marvelous. Metallica is one of the most important bands for metal ofcorse, and they prooved it again. By the way...I got nothing against Slipknot but hm metallica is better in a way. maddox86 if u want to tell us ur opinion don't do that by using fuck the whole time, we want to hear reasons why u think so and anyway, everyone his/her own view on music ok\r\ni greet u all (hehe)\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nwait til you hear Pat Boone's cover of this song.  i shit you not!\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI never heard any of Slipknot's music so i can't say if they're good or sucky, but I'm a huge fan of Metallica and this is still one of my favorite songs today (this is the song that made me like Metallica in the first place) and I don't think any song by anybody (even Slipknot) could replace Enter Sandman\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nyeahyeah it's ok \t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nyou cant even compare metallica and slipknot\n\r\nsure, slipknot has some catchy thrash riffs -(sic) really pumps me up, i like the song- but can you see slipknot coming out with something like \"the unforgiven\"???\r\ni dont\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nSlipknot is just some generic, dime-a-dozen band that is \"angry at the world\".  Try some originality.  Metallica was a ground-breaking band that brought metal to the mainstream.  There is no way that any band in the same genre is remotely as great or influencial as Metallica, including today's heavy metal bands.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nay yall b trippin...fightin ova da net...hahahahaha...god geta fuckin life ya heard meh?\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI agree with MetalliCatMan.  and this song is kick ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nmaddox... please put your caps lock off...  you can't compare slipknot to metallica, and let people have their own fucking opinion if they don't like the same thing as you do. isn't that what slipknot is all about? 'let me be who i fucking am'\n\r\nand it's a damn shame that now a days all those peepz make nu-metal and shit. where are the beautiful kirk hammet-style solo's!?!?! \n\r\nMetallica kicks ass, too bad they don't make speed-metal like they used to do anymore\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI'm with Metallica.  That is all i wish to say.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\numm...the comments here are in regards to this song by metallica...how did slipknot get mentioned here? i really dig slipknot...to each his/her own...just shut the fuck up and enjoy the good music. and to Apathy, why would slipknot want to make something like \"the unforgiven?\" that's not slipnot's style...you don't see lars using double bass in his fills and shit...check out purity by slipknot then, there's your unforgiven right there.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nAll intelligent beings: Please ignore the brash Slipknot fans, they do not represent us!\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nWhy's everyone talkin about slipknot?  i like slipknot okay, but anyone who thinks that they can compete with Metallica needs to pause for a second to PULL HIS HEAD OUT OF HIS ASS!  Metallica are one of those elite bands that almost no1 can match in terms of talent and influence. they\"re up there with Sabbath, Zeppelin, Maiden, Faith No More and Sepultura \t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nFirstly, this lyric's page is not to discuss whether Slipknot sucks and who is better out of them and Metallica, it's to comment on what you believe the meaning of the song is, lol.\n\r\nAnyway, this song seems to represent something along the lines of perhaps a child who is afraid of the dark? Afraid of the \"sandman\"; a mythical creature that puts people/children to sleep? The child is perhaps over alert, \"sleep with one eye open\" of this sandman. \n\r\nAlthough, the meaning seems a tad jumbled. It is definitely not clear.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nhes not overly alert, he's scared shitless of an unkown, bloody death\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nEVEN THOUGH I LOVE METALLICA WITH ALL OF MY HEART, I DO THINK IT WAS A KNOCK-OFF OF LED ZEPPLIN.  NOT THAT I HAVE ANYTHING AGAINST EITHER.  THIS SONG WAS GOOD.  AND WHY THE FUCK DO YOU FIGHT, I MEAN, ITS SUPPOSED TO BE SONG MEANINGS, YOUR TAKING UP SPACE. BUT, WHATEVER\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nITS KINDA FUNNY, I'M TOTALLY PART OF THE PUNK SHIT, BUT WHENEVER PEOPLE SEE MY JACKET, THERE'S METALLICA PATCHES ON IT, SO THERE LIKE, WHAT THE FUCK\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nWat can I say wat a fukin gr8 song great lyrics gr8 music gr8 band they don't com betta than this. \t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI think this song is a kick ass song. I think it has something to do with the devil because the child is told to say his prayers and have god protect him. that's just my opinion. HOwever msot bands like metallica that have been around for 20 years have done drugs. I mean I'm sure some of them are junkies look at your typical hardcore heavy metal artist.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nDang.  So much hatred here.  I've never heard anything from SlipKnot before, so I can't say anything.  I just know that Metallica is one of the greatest heavy metal bands of all time.  I think their old stuff is better than what they produce now, though.\n\r\nI think this song is about entering the core of fear.  Or maybe from a child's perspective and going through the childish fears like sandman, the dark, etc.  Maybe it's about nightmares and dreams.  I dunno.  It's kinda unclear...\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nGood Song\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nFirst of Ecstasy is not an injectible drug--- dumbass.\n\r\nI dont know if this song has any direct meaning other than the fact that it was created in mind with this would be a good radio-friendly song and would be an easy video to make for it. Dont get me wrong I love the song but i dont think it had much meaning it was a transition from more metal to a alternative song.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nit means ALOT to me, i remember walknig into my bros room and hearing it and im still hooked to it and all the other metallica songs, \r\ni think the song is very staright forward and its talking about ur fears and that u need to over come them but sometimes u should defeat them with someone u no (take my hand were off to never never land)\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI agree with most of you. This song does represent what fears we hold in our minds. And when the Sandman enters, he brings them to life in our dreams. Might I say that this songs is one of the greatest. The guitar and drums rock.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis song is about this:\n\r\n------------------------| \r\n------------------------| \r\n------------------------| \r\n------------------------| \r\n----2--7-----0-------2--| \r\n----0-----6-------0--0--|\n\r\nSimple. \t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nwho is metallica?\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nTrent493 fuck you\r\nLess comments pls guys\r\nIf it wasn't for this song i would have listen of metallica also\r\nI know that the intro was made by kirk at 3 in the morning when he could sleep\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\ni was jst messing with everyone. metallica is my favorite band. i was just trying to get some viloent metallica fans stured up. rock on!\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI have listened to both bands and I'm a fan from both (Metallica and Slipknot), and I think that Metallica is better than Slipknot...but a lot of people think that Slipknot is a no talent band without even listened to them they only judge them because they wear masks and look different. I'm not saying that you should listen to Slipknot but at least dont say shit if you havent listened to them!.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nOKay. Slipknot does rock. I mean Wait and Bleed was SO cool... in the 8th grade. I grew out of that stage and my Metallica roots remain true. Thats not what I'm hear to discuss though.\r\nThis song is about a child's fears of the mythical creature/ being the sandman. It is about facing fears and not doing it alone.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\ni LOVE metallica...they are the greatest band ever known to mankind. they have been making music for over 20 years and they are still popular. the surpasses any boy band or singer. METALLICA FOR LIFE!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nslipknot sucks, no talent, they got popular of of people who never got hugs from their mom. \t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nenuf about slipknot, this supposed to be posting about the meaning of enter sandman, and notice how only one person has commented on what they think the song means. so seriously, if anyone has a good explanation, post it.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI hate it when people try to look to deeply into songs.\n\r\nThis song isn't giving mixed signals, and anyone who think's it's about drugs has problems. It's about going to sleep afraid, and having bad dreams and the like. The horrors of the night; it's that simple. The prayer part serves no real meaning, except being a prayer you say before *bed,* which is what the song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nHmm.. maybe the kid's praying that he doesn't have freaky dreams?\n\r\nHow about everyone quits complaining about other people's comments?  I know that sounds rather hypocritical, but oh well, I'm right.  :-D\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nYour comment sucks emmelstone, of course it's about some little kid praying for no freaky dreams, But the sand man always wins\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nDid you guys even read my last post?!\n\r\nThe prayer part of this is an actual Christian prayer, which is usually recited just before bed, to ensure any death in the night will be taken care of by God. The only reason it's put in the song is because it's said before bed, like I said, and bedtime is the entire emphasis of the song. Furthermore, I've known most small children to be rather frightened by that prayer, which also adds to the theme in this that the child fears going to bed. \t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nthis song is a good football work out song. yea im one o those \"preps\" and I play football basketball and baseball, but i love music. I also play the drums and guitar. This song is one of the reasons i started playng guitar. Just all around great riffs....\r\nDREW\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI head this song at a strip club.  Really hot goth girl stripper dance to it.  Hell yah\n\r\nsinister e\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nhow the hell did slipknot get mentioned here theyre just a bunch of ideot's ruinding perfencly good instruments while another guy shouts obsenites into a mic\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nthis song is the best song in the pop-metallica.. and there are few of them!!\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nyes, the prayer is a real thing...the kid recites it before he goes to bed and is murdered in the movie \"hard to kill\"\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nListen you guys, I may be wrong, but watch \"A Nightmare on elm street\", when she goes to bed she recites the prayer, and think about it, yeah, it may be a fictional person, but this song says \"Freddie\" all over it, to me atleast, like I said, I might be wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nNo need for fighting on here,everyone is entitled to their own opinion.yeah,this song is about nightmares.I LOVE the song,the video,the whole album,everything!\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nSeems to me like a song about Paranoia, how someone can create fears out of nothing and then the fears control them.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\ni have a problem, i heard this metallica song on the radio and once again the damn radio ppl dint say the name. i dont remember much, but i think the chorus starts out with the singer yelling jesus christ, the song seems sad. Anyone know the name?\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\ni came to a realization that this song is about the SS taking the Jews away to the prison camps. fucking shit man!\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\ni love this song..one of my favorites by metallica\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nprobably 'Tallica's most popular song...   I think this song is about a Nightmare telling someone to watch out.... or else the Nightmare may come true....   11 outta 10 for this one   =]\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nmaddox86-finally you have seen sence.well done my friend welcome to the wonderful world of appreciating metallica.good aint it,get a load of kirks riffs in the lead break in this song,not his best but worth a listen.mind blowing shit. long live the 'tallica boys.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nim not a real metalhead, but metallica plays harder & faster than anyone. gotta love these sexy beasts...\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nhaha slipknot is breaking up. METALLICA JUNE 10 WOOOOOOOOOOOO screw slipknot\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nthis song is fuckin great, i feel its about our inner fears that we feel come out at night while we are asleep\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nEverything one can say about this song has been said. I just wanted to laugh at Slipknot and it's own pathetic sound. They are the only band my brother listens to (which is why my stereo is louder than his) and damn, I can't believe people believe that shit. Metallica's rage is pure, raw and very real. The stuff Jaymz writes is exactly how he feels. Hell, St. Anger is nothing but pure rage and hate. But the reason Metallica will always stand out from the other metal bands is because the reality of their songs. Slipknot, Mudvanye and all the rest can swear, say they're gonna kill you twenty times as they fuck ya and shout as loud as they want into a mike, but that doesn't change the fact that it didn't happen and never will. Sure, it's venting rage, but not the pure rage that Jaymz has always vented. St. Anger, Load and ReLoad are about Jaymz and he rage, with the Black album being a prelude to it. This song is about nightmares, no doubt about it. But I ask, who's nightmare dreamed up this masterpiece? I'll give you a hint: his name starts with a J, and plays ESP Explorers on-stage.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nAW FOR FUCK SAKES!!!!!! Would every one please just shaddup about slipknot already?I'm sure that's not the reason we all came to this page. I am unfamiliar to slipknot's music, but all  I know is that I really appreciate Metallica's music, and that I used to have the same paranoid fears of that cursed \"bedtime prayer\". As an insomniac myself, this song gets me pumping every time i hear it. Every one is entitled to their own opinions no matter how fucked up they are. I think some of the people writing here are wrong, but that's my opinion, and they have theirs. LIVE AND LET LIVE! On another note, hate to sound like a jerk, but please people... learn how to spell. It's really frustrating trying to decipher all this gibberish, unless the mis-spellings are intentional.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nAW FOR FUCK SAKES!!!!!! Would every one please just shaddup about slipknot already?I'm sure that's not the reason we all came to this page. I am unfamiliar to slipknot's music, but all  I know is that I really appreciate Metallica's music, and that I used to have the same paranoid fears of that cursed \"bedtime prayer\". As an insomniac myself, this song gets me pumping every time i hear it. Every one is entitled to their own opinions no matter how fucked up they are. I think some of the people writing here are wrong, but that's my opinion, and they have theirs. LIVE AND LET LIVE! On another note, hate to sound like a jerk, but please people... learn how to spell. It's really frustrating trying to decipher all this gibberish, unless the mis-spellings are intentional.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nHush little baby, don't say a word \r\nAnd never mind that noise you heard \r\nIt's just the beasts under your bed, \r\nIn your closet, in your head \n\r\nMUAHAHHAAHAHAHA\n\r\nHave any of you guys ever sang this to the original tune in public just to have people look at you like your insane?  It's the hilarious.  Just thought I'd feed the fire for insanity.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\ngood song bras\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nthis song is definitly about the drugs...and the effect during and after...i love metallica..\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nThis is the essential heavy metal song of all time. This is the one song that introduced millions of people to heavy metal. At least it did me. No all I am is pure metal.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nmb1604, it's been nearly a year since you asked that question, so I'm sure you've found the answer on your own by now, but I think the song you're talking about is Man in the Box by Alice in Chains.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nAnd btw the prayer is a traditional Christian prayer, it's not just some prayer someone made up for a horror movie.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nthe riff is so badass, it hooked me on metallica\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nAfter reading these comments for Enter Sandman I have concluded one thing.......Metallica kiks slipknots ass and slipknot fans are a bunch of dumbass shit fucks.....but in my opinion both bads are badass and their fans are all jackasses who think they know everthing there is to know about both bands.....when they dont know shit......\n\r\nAnd before I forget, this song is one of the best.\n\r\n*OneWingAngel - PWNs you all*\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nmetallica sucks big time   it has to be the worst band ever (even worse than slipknot)\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI remember a long time ago, when metallica didn't suck ass so hard it made your ass bleed... This song is a classic, unlike St. Anger, what a pile of shit\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nmetallica has always sucked\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nfirstly its not what the song means to them its what the song means to u so ur all right\n\r\nan secondly if u hate metallica i hate u\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nfirstly its not what the song means to them its what the song means to u so ur all right\n\r\nan secondly if u hate metallica i hate u\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\ndudes, get the shit straight\r\nnot about drugs.\r\nThis is about a scared child at night.\n\r\n\"Hush little babay, don't say a word\r\nand never mind that noise you heard\r\nIt's just the beast under your bed\r\nIN YOUR CLOSET IN YOUR HEEEEEAAAAAAAD\"\n\r\nNow how the hell could that be about drugs?\r\nand christianlovinggod,\r\nif you hate this song, or metallica, at least have a reason. Don't just post random shit to piss off people. Cuz I guarantee that someone is pissed.\r\nOr did the Lord come to you in a dream to tell you to hate all good music?\n\r\nP.S: This song kicks ass, a classic on the Black Album.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nCool thing:\n\r\n(Enter Sandman)\r\nNow I lay me down to sleep \r\nPray the lord my soul to keep \r\nIf I die before I wake \r\nPray the lord my soul to take \n\r\n(Sir Psycho Sexy, Red Hot Chili Peppers)\r\nNow I lay me down to sleep \r\nI pray the funk will make me freak \r\nIf I should die before I waked \r\nAllow me Lord to rock out naked \n\r\nSir Psycho Sexy was recorded almost at the same time as Enter Sandman, strange though.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\ni do have a reason i hate this band :  it is the most unholiest band ever and the bible says u shouldnt listen to this kida stuff\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\noh...well the BIBLE says so...well i guess you should go kill them isn't that right? But one thing...\r\ni never heard any priest say..\r\n\"And everyone hate metallica..... it sux ass\"\r\nAnd you think metallica is \"unholy\"? \r\nHoo boy...you have a lot to learn\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nwat do u mean we should go kill them r u english or retarded?  wat makes u think  i have a lot to learn u apparently dont know god buddy\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nkickass song, but got really over played... Either way Metallica will never top this.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nMaddox is probably 13. I mean seriously. The whole \"preps\" reference gave it away. And plus, him saying that Slipknot is better than Metallica or whatever he said, just goes to show that he knows dick about music, and he falls for the false act that they put on. It's a freak show, not music. This is how this guys mind works: \"Wow! These guys look scary. Maybe I should listen to them because if they look this cool, they have to be good!\" Do you think that this kid would give them a second glance if they looked like the backstreet boys? hell no! When you hear true music, it doesnt fucking matter what people look like! If Metallica looked like Hanson, they're music would still be booming on my stereo! p.s. this music video used to give me nightmares. Hardcore shit!\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nchristianlovinfag SHUT THE FUCK UP who cares. Youre idoit. Dont you have better things to do than dis a band that has more talent in there pinky than youll ever have. \"it is the most unholiest band ever and the bible says u shouldnt listen to this kida stuff\" \r\nthats the stupidist shit i ever heard, i hope you burn in hell jackass. \r\nP.S.: Fag, why do you believe what the bible says?\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nWhere exactly does it say anything about Metallica in the Bible? You find me exactly where it says anything about not listenning to real music. I am a Christian too but I dont try to force my religion on other people. Who the fuck are you to say what is right and what isn't? Who made you the moral authority? You are extremely arrogant. You are letting the Bible run your life saying what you can and cant do in every aspect of your life. That's really sad that you don't see that you're being controlled and dictated. This music is real. It speaks truth. You only see what's on the surface, and are judging something that you dont know jack shit about. We don't try to go on jesuslovers.com or whatever the fuck it is that you look at and try to preach to you about how your religion is bullshit, so why, as a \"christian\" do you come on here and judge us? Does it not also say in the Bible, \"Judge not\"? Well it says that in a Metallica song too, so how's that for unholy? Maybe you should attempt to know the teensiest fact about something before you come on here and bitch at us like you know everything.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nwho said anything about judgin people?  i just tried to show u pepole some real music has n e 1 here ener heard odf a band called swithfoot, jars of clay, dc talk, or p.o.d dased i never was judgin anyone i was just tryin to open ur guys eyes to some REAL music listen to one of p.o.d songs then ull see wat im talkin bout\r\n\\\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nur right i dont know everything but i know good music\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nBullshit. Just because it's Christian doesn't mean it's good. You are judging us, and judging our music. That's what I meant. P.O.D. is pop disguised as rock. You don't know dick about real music. Real music is original, it doesn't try to sound like other bands; real musicians don't write songs just to sell records. Metallica is raw talent. If you actually knew jackshit about music, you would know that Lars Ulrich is one of the best drummers of all time, and this is not an opinion, it is a fact. Kirk Hammet has played some of the best guitar solos in the history of rock music. Listen to Sad But True's guitar solo. I doubt your ammature skater christian rock bullshit can even concieve of something as creative as some of the riffs that come so easy to Metallica. Metallica is truly original, you can tell it's them whether you've heard their songs or not. You can't tell one of your little pop rock bands apart if you didnt hear the song to begin with. It is so commercialized it makes me sick. They are no different from Britney Spears, but instead of trying to sell her body, they're trying to sell their fake little badass attitudes to sell albums, so that angry and depressed teenagers can have something to get their aggressions out with. It's not written for anything other than to appeal to young ppl who dont know shit about music, so they can get their records sold. You know that this is a site with ppl who love and are devoted to Metallica. I grew up listenning to them. When you insult them, you insult me, because they are a part of my life, and i think that goes for many people here. You had no right to come in here and try to put us down for something that we love. If you don't like Metallica, that's fine, at least have the decency to stay the fuck out of this section; all it does is piss people off. Do the right thing as a \"christian.\" Just leave us alone about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nthey make music to spread the word of GOD not to sell records  im not insultin mettalica im just tryin to let u hear of wat i think r better bands sorry if u think i was insultin u or if u feel that way\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\ni like metallica too some songs arent all that bad!\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nu r also right some christian bands r horrible but not the ones that i told u just listen too one of theyre songs\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nTruce? Truce. Good man.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nsure\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nAll I know is, when I hear this song, it means the Yankee game is over.  Yankee fans know what I'm talking about.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nchristianlovinggod, first lemme say that I'm a christian and darn proud of it. and I like heavy music. so shoot me. but, just because a band isn't christian doesn't make it evil. and yeah, metallica play heavy stuff and you might not agree with all their songs. that doesn't mean you can't listen to any of it. no band IMO is pure evil. so stop harping on about that. also, POD isn't that great anymore. don't get me wrong, I was a warrior for years...but since satellite their lyrics and stuff have got really vague and they don't really grab my attention on Payable On Death. to people that say that POD's pop disguised as rock, listen to a cd called snuff the punk. enough on that.\r\nI agree with most of what people have been telling you about metallica, they really are good and just judging them on a predjudice is totally stupid. and sorry, but most of those bands DO make music to sell records. I don't know where in teh christian bubble you're from, but they make their living out of it...so they kinda want to sell a few cds. yes they're singing about God, but that doesn't mean that they don't get anything out of it. oh and if you're desperate to stay within christendom, listen to some living sacrifice, soul embraced, zao, etc...or even just a band like project 86. which is not that heavy (which is why i included it because you were talking about jars of clay and switchfoot) just because it's not positive doesn't mean it's not christian (yes I know this is off topic but humour me) and it can be fantastic music. now I'm going to shut up. feel free to yell at me if you like. but I'm a christian that likes heavy music and refuses to stay within the christian bubble. overandout...Kyrie\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nok just noticed the truce (for some reason my page didn't load the last few posts...no idea why) so feel free to ignore that if you want...but still, i hope you take something from it...\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\ni agree with u kyrie on everything but them sellin records to get money i knoe that they get money from it but i dont think thats wat theyre in the business for.\n\r\ni listened to the bands u said and they were good but im still stickin to swithfoot and jars of clay\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nYea its all fun and games till everyone who likes metallica is burning in hell with satin.  Hey thats ok though cause i heard the devil throws some big parties\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nwtf? mothra, do you like Metallica, or are you just here to preach to us? im just confused by your comment, that's all. and kyrie, im also confused about yours, were the record-selling comments directed at me? because a name was not specified. but in case they were directed at me, (and I'm not going to be overly arguementative, because I have respect for you, because you seem pretty intelligent, unlike some OTHER ignorant imbeciles that i have to deal with.) what I was saying was that true artist do not just make records to sell them, but they make them to express themselves through music. Yes, they make their living off of it, and they want to sell them, but they're not just producing any piece-of-shit album just to collect money, like some commercialized pop bands. anywho, peace out. Keep rockin'!\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nnoticing the 666 by your name, i am starting to think that perhaps you are not really thinking that we are going to burn in hell for listenning to Metallica. Whatever. Just using context clues.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\ndiseased i know ur talkin about so shut ur mouth i shut up about metallica now shut up about me or do u have to keep goin on about it get over it i dont like metallica very much and u know jars of clay is better\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nyea diseased, i was just beeing humorous, but christian, you gotta calm down buddy, sounds like you need to smoke a joint and open your mind buddy!\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nyes. you got me. i've been hiding it all along. i prefer jars of shit to true, raw talent. SHHHH! you weren't supposed to tell anyone! and for your information, before you freak out next time, I wasn't talking about you. SOMEONE I know personally comes on this site and checks it out every once in awhile, and I was just teasing;) you know who you are. Sorry if that's what you thought mmbuhbye... And mothra, I am in agreement....a deep hit could calm him (her?) down some, man for real. Just playin', man. When I call a truce, I stick to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\ni gess this song is just about how hidden we are from what rely goes on, and altho we are not completely exposed to it, we still have some ideas, but when these arise they are knocked bak down, 'and nevr mind that noise you heard, its just the beats under you bead, in your closet in your head'  saying that you may have heard something but its just an illusion, its all in your head, its not real.  it also is talking to a child, perhaps implying how inoccent we are, without knowledge, ignorant to the truth.... patronising\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\ni is been readin the 'argument' between diseased and amused  with  christianlovingod, and no offence or anythin but dont you think its kinda petty to be sayin all this stuff, when its just a band and its just music. music is a massive part of evri1s life, for some people its their job, it can decide your friends, it can save you from death or insanity. but just because you dont agree ovr one song or one band doesnt mean that it can cause an 'argument' thanku\r\n oh ye and i like the song very much, my personal fave metallica genius\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nhey wasted... if they want to argue, let them argue, shit you arent their parents.... and there is reason to argue when you have chumps like chirstianlovingod coming in here and preachin to everyone like hes JC himself... lovingod, maybe you should do some research and youd find that hetfield does a lot of volunteer work for church and youth groups and makes large donations anonymously....he even visted my young nethew who has cancer, when he wasnt doing very well, very nice guy... so maybe you shouldnt be callin him the devil, ass\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nWow, I guess since I last posted, a shitload of more people hate christianlovinggod. Cool. I guess most people agree that God doesn't hate metallica, and he shouldn't smite them all. (For those of you that don't know, I was being sarcastic about the smiting part.) I'm just glad to know that I partly started this whole \"hate christianlovinggod\" shit. That little prick probly hates jews too.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nHahahahahahah HA! I love you guys, for real dude! HAHA! ~wipes tears of joy~ hey lorna. I called a truce, in case you missed that little detail, and I was just being sarcastic. And it CAN cause an arguement. You know how I know that? BECAUSE IT FUCKING DID CAUSE AN ARGUEMENT! God! haha. I don't hate christian, and I don't really think he's a prick, although I do think that he has a lot to learn, and he's really confused at how to identify real music. But anywho Lorna, none of your business, stay out of it. thank you. and did you honestly think that by trying to get into our business that that would NOT cause an arguement between you and me? Wow. No offense, but you really suck at trying to keep the peace. thanx mothra. you got my back. truth speaker, happy hunting;)\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nHey diseased_and_amused you might not hate christians but i do. Dont get me wrong I dont hate them all just the stupid ones that preach and try to convert you into one of them. Therefore this is where christianlovingod comes in. Shut the hell up. Dont come to this page just stay the hell out. I bet youre some stupid 13 year old that thinks hes a saint and that no evil exist within you. You know how i know I know because ive been to some christian churches and the people dont try to make me believe what i dont want to believe because they respect that. Dont call youreself christian, youre just a stupid fuck who thinks thats christian just because you attend it once in a while. YOU ME ME SICK.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nI'd just like to say how much Metallica generally suck. Yeh they're intro's are good and they're lyrics CAN be ok...\"Am I evil\" being one of their worse examples...I think they're just solo's which bore the audience to death to be honest. And they're thought of as \"Godly\" because they are good at the instruments...just crap song writers.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nneed4creed, ROCK IS DEAD???? no its not dead it will never, the problem is youre listening to the wrong music. You act like creed are gods but truth is they arent they a average at best.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\ntantrumdoll you do know that \"Am I Evil\" is not one of metallica's songs right, YOU STUPID FUCK.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nShut the fuck UP Linkin park fag. Go shoot youreself or something, it will just be one less idiot we have to worry about. What a fag can you believe this guy.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\ncreed is such a fucking rip off. its so fucking fake it makes me sick. rock is NOT dead. rock lives on and will always live on through the people who listen and love it. Rock fucking rules and it's dumb fucks like you who don't understand anything about it. It's people like you who are trying to lead rock's downfall. It'll never happen you piece of shit. Fuck off.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\ni don't hate all christians, but i hate most of them. my friend and i were brainwashed by a bunch of pentacostal bible-thumpers and we were so mentally abused, if you will, that i was finally just like well fuck this and we told off our pastor in front of the entire fucking cult. People behind us were all praying for our \"sins\" for actually using our brains and questioning the contradictory bullshit they were feeding us instead of following them off of a cliff like a bunch of fucking sheep. thats why i went totally opposite. i turned 100% atheist after that, but now im kinda neutral.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\noh. and tantrum whatserfuck, Metallica rules. Blow me. and you said, theyre good at their instruments. YEAH NO SHIT! THATS KINDA THE POINT YOU DUMB FUCK! go to hell.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nneed4creed I agree with somethings you say. emptytv is fucking with peoples minds and I fucken hate that because believe it or not if someone tells you something enough youll start to believe it. Thats whats happening with people watching emptyTV they keep watching it all day and little by little they start giving in. I dont agree that you say it will die because there will be that one band that will break through but not necesarely lead a revolution just open peoples mind. Also everything goes full circle. Everything is destined to repeat itself whether its bad or good. Just look at punk it was becoming popular back in the 70s then it went low key for a while then it became popular again in 2001. To tell you the truth I dont really if rock doesnt become popular i would rather have it stay low key because when its low key and it has a dedicated fanbase the sound isnt comprimised like it is when they become popular and obssesed with selling. PEACE.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nOne more thing Rock will never die because there will always be people like who dont give a fuck about MTV or selling a bunch of fucken records to a bunch of poser kids. People that dont give a fuck about death or shooting themselves, people that have a goal and know what the meaning of making music is and what it takes. FUCK MTV I HOPE IT DIES SOON. One more thing have you noticed that mtv hardly plays any music anymore and thats because they are dieying , emptytv is dieying they are getting desperate so desperate that they need something besides music to survive.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nhey diseased step off creed creed rox the house!!!!! need4creed u totally just told everyone wats up ride on brother i agree with u all the way i got ur back\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\ndude diseased u really are messed up!!! good job tantrum\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nOK. OK. OK. So need4creed. I do kinda see where you're coming from. Most of the new rock kinda blows, but there are a lot of extremely talented underground bands out there, just waiting to make it into the scene. Rock has seen its share of downfalls, but it always picks up again, and I believe it will this time, too. All rock needs is one extremely talented band to start a completely awesome new genre of rock, and we have a new rock revolution. As long as there are people devoted to the rock community, there will be rock. It'll pick up. I have faith. Peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nfuck rock may or may not be dead, but sure as hell think christianlovingod should be dead, lets kill that bitch!!\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nnow that mentioned christianlovingod i got something to say. Hey christianlovingod youre a true hardcore christian right. If you are you cant go without listening to a band name Slayer. Thats a true crhistian band man check them out theyll teach you a lot. Any \"true\" christian would tell you so.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nTwo things... I've noticed that christianlovinggod hasn't posted in a while\r\nTOO FUCKING BAD BITCH\r\nanyway... \r\nI agree with need4creed. Rock is slowly dying, wether you want to accept it or not. But if, as diseased and amused says, a talented band comes out and starts a revolution, (hence metallica twenty years ago), then rock will come back again strong and awesome. It's good charlotte and all those bands that are killing it. But rock will come out on top.\r\none other thing, I'm pretty sure people had this exact same conversation twenty years ago... and in the 50's, if I'm not mistaken. But look what came out of it... in the 60's there came the beatles and the rolling stones and led zeppelin. In the seventies, there came black sabbath. twenty years ago, there came metallica.I have faith.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nWHAT THE FUCK IS THIS NUMBER 2 ON THE TOP 50 LYRICS LIST FOR?!!??!\r\nTHIS SONG HAS THE WORST LYRICS IVE SEEN FROM THIS SITE!\r\nANY TOOL SONG !!AT ALL!! WOULD KICK THE HELL OUT OF THIS SONGS LYRICS!! WHAT IS WRONG WITH YOU PEOPLE?!?!?\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nhey billybobhenry... let me talk like you so you can understand me...\r\n!!I !!HTAE YO!!O!! A LOT!! DURRHURR!! YOO BE A STUPID!! !! DURRHURR!! WHAT IS RWONG WTITH YOO PEPLOE!!??!???????!!!!!???!?!?!?!\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nHey billybobhenry, you are asking US what is wrong with US??? you incest cousinfucker, what is wrong with you!!!!? you need to get off the fuckin computer (im surprised you even know how to use one) and get back to watchin your fuckin nascar and tractorpull, you hick ass buttplug!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nyeah for real man. I think this guy comes from the same gene pool as half the people on Deliverance. Squeal like a pig! And btw guys, I think it's pretty cool that christian hasn't posted in awhile. I don't really blame him. He wasn't gonna win. At least he was honest with himself. I think we scared him away. Haha. Oh. this has nothing to do with anything, but I'm a chick, just in case anyone was wondering. needforcreed. I just noticed you called me a homo. hmm... pretty funny.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nIm speechless, youre a chick. Fuck piece of shit internet, thats why I hate internet interacting, no one can really tell whats what, fuck youre a chick, i got to say diseased im amused. Also fuck the hillbilly why even bother with the guy. I would insult the guy for not recognizing what good music is but looking at his name he already did the job for me.\n\r\nFurthermore i dont know i feel guilty for not posting my interpretation of this song because this is song meanings right. I dont know if they have posted this but i think this song is about have nightmares that consists of nuclear war and by the the nightmare becomes a reality. I dont know whether its right or wrong but fuck it thats my take on the song, later. PEACE.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\ndude come on. im smart. im not a dyke. im straight as a fucking arrow. i was just sitting here wondering....hmmm....I wonder if they think I'm a guy, and then I looked at my previous comments and I think that that's how it sounded. i guess I'm just cool or something I don't know;)....yes that's how I talk in real life, but my voice doesn't sound like a guy. need4creed, maybe I'm just too much woman for you. but that's ok baby I like angry guys... haha\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nGuess I had a lot of you shocked. Well, like Psyke said, that's the internet for ya.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nneed4creed dude r u arguin with these people? or are u just talkin?diseased do u hang out with guys? i think u would by the way u talk thats kinda strange for u to be talkin like that\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nwhy is it strange? because I'm not a ditsy blonde who only worries about her hair??? I love music, and I know it well. Yes, I hang out with some guys, but most of my friends are girls. I'm just really sarcastic I guess.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nwhoa... if you're kidding u got me fooled... but I just want u to know that I don't really think any less of u if ur a girl or not. I'm not some weird messed up fuck that goes like \"EWWWWWWWWW GIRLS COOTIES!!! I'VE BEEN AGREEING WITH SOME GIRL!!! GROSS!! NOW I HAVE COOTIE GERMS!!\". You're still cool, and you have good taste in music.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nthanx bud;)\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\ntruthspeaker go end ur life now\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nWell you know I came up with an idea about this song a while ago. Right, how about if teh song was all about...\n\n\n\n\r\nMichael Jackson!\n\r\nThink about it, wouldn't you sleep with one eye open, gripping your pillow tight if you were a kid and Michael Jackson was around.\n\r\nHe's going to take you to 'never never land' or more specifically, the neverland ranch!!\n\r\nSeems like Metallica were writing about smoething a lot more deep and scary than originally thought eh!\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nbefore i heard \"renegade\" 5 minutes ago this song was stuck in my head all day. so i thought i'd find it.\n\r\ni think its about something scary, and if i say more i'll prolly be attacked or sumthin so i think i'll just back away slowly now...\n\r\n*runs off screaming*\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nDamn right Michael Jackson is scary.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nyou guys are all gay!!! Metallica rules\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nNICE CONTRIBUTION TO THE CONVERSATION \"KISS MY ASS\"\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nShut the fuck up Truth speaker your a homo!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nnoob metallica fan song but still a great one, gotta love the solo\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nLove this song\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nthis songs probably about a fear of going to bed like the intelligent people above said a while ago....its a good song if you like this kind of music, ive never heard slipknot and i doubt i'll listen to them (nothing to do with comments just too....scratchy....) and people, please, stop making idiotic comments about other people's opinions - you won't them no matter how many times you call a person a synomon of homosexual....they like what they like and they think what they think so shut up and comment on the SONG. if anyone makes any remark that im a hypocrite i'll shut down the site and you can all bitch elsewhere. thank you and good night.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nmetallica said on some tv show that this song is about fear, just like the video.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\ndiseased, sorry I've taken so long to get back here...I've been kinda busy.\r\nno that comment wasn't directed at you, it was directed at christianlovinggod because they were talking about 'doing it all for the Lord' type things with christian artists, which normally doesn't have a whole lot to do with it. But Christendom has its artists that just do things for the money, same as the secular scene and I would be tempted to think that more christian artists fit into that cateogory than secular. kinda sad, but fairly true.\r\nthanks for taking the time to respond anyway lol. \r\n*wonders where everyone's gone because noone's responded in a week*\r\n-kyrie\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\ngood song...lyrics are kinda weird tho\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\ni don't get it... how is this such a good song? i've heard metallica fifty times better. there are no good solos, or not memorable ones or anything. it's just about something scary living under a bed or something. now everyone is going to hate me, but i mean its not even al metal-y as a lot...\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\ndon't kill me! i still think metallica is one of the best bands ever!\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nYou have to love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\ngod damn. . . even the hippie loves this song !!! lol :)\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nokay, just joined and read this...as for the old slipknot thing, they are good, yes, good...but there is no way in hell that they will ever measure up to metallica.  as for the whole cristianlovingod fiasco...religion is worthless, it was all set up a world away, the laws of religion do not apply anymore.  the world has changed and, face it, the rules have changed.  this song was a sign post in metal. as shown, a lot of people would never had heard of metallica if it werent for this song...same for me.  as for need4creed, you are wrong, as AC/DC said, rock and roll is just rock and roll and it aint ever gonna die.  you want to know why, rock and roll is the product of generations of music evolution into the perfect genre.  nothing can beat rock and roll because it is pure, raw emotion and yes, all these bands like creed and nickleback and mudvayne are just whiners, but obviously that is what people want to hear.  i am from the seattle area so i also know a few things about nirvana and pearl jam.  the seattle scene is dead, but the music will live on.  these are just my views.  metallica rules all and will prevail, pop is only popular for a while and the world moves on, metallica is forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\noh yeah, st. anger is an awsome album...people who say it sucks because its not metallica dont know metallica.  they change their style even if slightly with every album...thats all...\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nKrazylunitic St. Anger is not a good song.  Your dumb.  Not a true fan.  Its songs like St. Anger that make me lose respect for Metallica... Ever hear for whom the bell tolls, master of puppets, am i evil?  They are real Metallica songs, not St. Anger... What a joke.  Your not a real fan.\n\r\nPS: This is for Philadelphia Eagle.  The Eagles kick ass and got robed the last 3 NFC games.  Were gona win one dont lose hope.  Also the Phillies kick ass, watch them.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nYou gotta love our Flyers too and they kick ass also.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nalright...randomdude, screw off...obviosly you are not a real fan if you do not appriciate the changes in metallica...you are just the the rest of the whole damned word, you are afraid of change.  and who the hell are you to tell me i am not a real fan.  i never said the rest of metallica was not good, i just said that i like the new album as well.  before you jump to conclusions about what other people said, think about what you say before you make yourself sound like an idiot.  as i said, i never said i didnt like the rest of metallica, so you made yourself an idiot with your comment.\n\r\nBesides, im a seattle fan.  eagles suck!\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nWow. It took me about  7 Metallica songs to read through all this. \n\r\nFor the Slipknot thing, they're just another angry, I'm gonna kill everyone and be scary, bunch of freaks. Then again, it's a free country. They have every right to sell their disgusting fake music. I've heard it before, so I speak from experience; it's not music. \n\r\nAs for the Christianlovingod person, I'm a Christian. I happen to like Switchfoot too. They're one of my favorite bands. Metallica is classic rock though. It's what gave rock it's..rock. Metallica is the greatest band of all time. \n\r\nAnyone, tell me a better band that's lived longer, not breaking up, re-inventing themselves over and over? That's right.\n\r\nNOTHING compares to Metallica.\n\r\nBTW, I think this song is about the human mind and how you can create fears out of simple things and have the fears take you over.\n\r\nGood song, this is what hooked me on 'Tallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nAfter readin through this again... I agree with the people that said rock is dying... I mean all these new rich whiny brats that make up the new bands care about it getting rich and being on MTV.. the days of good ole fashioned from the heart rock is dead... it makes me sick too... nowadays rap and pop rule the charts with no sign of a good rock band taking a stand... if this keeps up much longer, soon people will completely lose all interest in the genre at all, I really hope Im wrong but I agree... Rock Is Dead.. long live paper and sissors.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nsad but true, mothra;).................if you are a hardcore Metallica fan, you will get the joke.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nhmmmm slipknot iz better den metallica....never thought id hear tis 1 lol...slipknot SUX\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nHe's gay and has adopted a son who is afraid of his homosexual relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nhahaha hey mr I MADDOX 86 that is a pretty funny conversation you guys were having up there about slipknot. Slipknot is a disgrace. Metallica kicks ass. That's all there is to say. \r\n       Oh yea and it is so obvious that this song is about nightmares, if you can't figure that out than i don't know what to say.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nyes metal messiah i agree with you. i've never heard anyone say slipknot was better than metallica. yea , come to think of it i've never heard anyone say that anyone is better than metallica. they are and always will be the best.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nwell, anyone that matters, i should say. cuz there are some fools out there\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\n\"come to think of it i've never heard anyone say that anyone is better than metallica. they are and always will be the best.\"\n\r\nHAHAHAHAHAHA.....\n\r\nhooo boy..... phew\n\r\nmaybe at 1 point metallica could have had a chance at being \"the best\" (although what the fuck does that really mean, its all subjective anyway), but heh.... does Load, Reload, or St. Wanker ring a bell?\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nSLIPKNOT ARE GAY HOMOSEXUAL PIG-FUCKERS WHO COVER THEIR FACES BECAUSE THEY ARE TOO SCARED TO SHOW THEIR MOTHERS WHO THEY \"REALLY\" ARE AND HIDE BEHIND THESE MASKS, ACTUALLY MASKING THEIR OWN SEXUALITY.\n\n\r\nBesides that, Metallica are gods of metal\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nhahahaha... You Metallica fans think of some of the funniest stuff ever. Names like \"the King of shit\" and I think that's the first time i've ever seen someone use the term \"Pig-Fuckers\". lol....\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nMETALLICA ARE GAY HOMOSEXUAL PIG-FUCKERS WHO SHOULD COVER THEIR FACES BECAUSE THEY ARE TOO FUCKING PIG UGLY AND SHOULD SHOW THEIR MOTHERS WHO THEY \"REALLY\" ARE INSTEAD OF HIDING BEHIND GAY METALLICA \"FANS\", ACTUALLY MASKING THEIR OWN SHITNESS AT MAKING GOOD MUSIC.\n\r\nSlipknot would absolutely destroy Metallica if there was ever a war between them. metallica fans are ASSHOLES slipknot fans are REAL HARDCORE ROCKERS. SLIPKNOT are liked around the world only people in the u.s. like metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nBuddy, you don't get it. I love slipknot, but metallica is 50x's better. SO SHUT THE FUCK UP!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nSO the rest of the world sucks ass... except CANADA!\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nSlipknot is an AIDS infested cum bubble on the back of a faggots ass. Metallica would fucking rape them if there was a war between the two.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nYeah.... I agree totally (Charlie), lmao!!! Metallica kicks ass!!!! Forever will!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nThis song is one of my many favorits by Metallica!!!\r\nThe bands older stuff rocks!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nThis song is about nightmares.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nSlipknot is banned all over the world. Im Russian and I noe metallica and so do all my friends.. so keep quite about what u dont noe about\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nok whoever u are that is obsesed with shitty music(slipknot) GET THE FUCK OFF METALLICA LYRICS, AND GO WRITE TO UR FUKED UP LIL SAVAGE FRIENDS WHO LISTEN TO SHIT. u need to get a reality check and realize who the true medal rockers are....metallica. and metallica has been around alot longer than ur slipknot crap. METALLICA KICKS ASS!\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nThis wasn't written by Metallica.  They bought it from an unknown jazz musician and \"meteled\" it up.  Great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nahhhh metallica of course i love them bc they are considered \"old skool\" but yeah they rock and so does this song\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nWhat ho old chaps! I'm British and i wish to make my views clear about this topic. Metallica are a top hole band and this song is by far one of the best all time songs ever. ever. ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nGuys... metallica USED to ROCK... not so anymore! listen to there newer stuff... just with all of rock.. theyre dieing off... i said it before and ill say it again.. rock is dead... long live paper and scissors\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nRock.....Dead!?  Hell no!!\r\nAs for Metallica, All Within My Hands and unnamed... are the only songs worth their weight in ship off St. Anger, but i doubt that cd will have much of an influence on their future works.\n\r\nIn abstract...Long Live Metallica\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nwell.. i am discusted to see the taint of the name \"slipknot\" on a metallica page, especially a sacred one such as enter sandman. i am 13 years old, i heard enter sandman just before st anger came out. yes i am a newbie, but seriously this music has changed my life so much. a convert from the hip hop-rnb underground can see the talent these guys possess. and once again with slipknot, i've listened to them, and they're bearable, a bit strange yes, but bearable. a lot of their songs are boring though. i fell asleep listeneding to \"My Plague\", it was so bleedingly dull, however wait and bleed and duality have a good sound to them. but to say that slipknot is better than metallica?!?!? its blasphemy! you look at tab for the exiting solo of \"Fade To Black\", and then at the \"solo\" from \"Vermillion\", its just clear who has the better writing ability. as for lyrics, slipknot is lost. i can see no connection with the name Duality and the lyrics. (and who the fuck puts their fingers in their eyes?!?!) all you guys who like slipknot, its alright, but dont come into a metallica page and bagmouth metallica without knowing what you are actually doing. remember, if it wasnt for metallica, slipknot probably wouldnt have the \"popularity\" that they have. kirk hammett is god. long live metallca!\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nrocks dead guys... need4creed said it best up top.. he really opened my eyes to this said fact.. I didnt want to believe it either, but its sadly true.. hopefully some new great rock band will come out and start a revoluton, but untill then we'll continue to see rock fadin away\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nyea mothra you're right. i see that metal bands are becoming rare. however its all down the shitter, franz ferdinand look promising. its not metal, but its good writing for both lyrics and guitar. there are still people out there, somewhere, who still know what metal is. they just havent surfaced into mainstream\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\ni agree with metal advocate about the whole slipknot thing ahh i wnt even get started coz ill just rant about how mud slipknot is.i wudnt whipe my ass with the iowa cd insert if it was the only viable bum cleaning material i had.franz ferdinand r gud az 2, great live 2 2 bad i was 2 young 2 c metallica live in their prime, now in their fortys their live show is still mindblowing but no where near as orgasmic as their 80's concerts that ive only had the pleasure of viewing on my computer.i dnt thionk there will ever b a band that is reaches musical heights such as metallica have.whoops i ranted my bad:)\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nWhat's with all the people saying rock is dead. I'm dissapointed. Rock isn't dead it can't die.It just changes forms and hides for a while.Ill give you an example. Rock went from being Elvis to being Jimi Hendrix to the Sex Pistols to Nirvana. I see all of this like a roller coster ,it goes up and down. Unfortunately rock is down right now. It's cool with me if it's down because I know someone always come every 10 years to pick it back up.\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nok everyone who is sayin that rock is dead...wel fuk u. especially to u mothra dude, u dont know what ur talkin bout. sure st. anger is a shitty cd compared to there other cds but hey every artist has a downer somewhere in makin music. and rock will never die...it will live on forever. mothra get a life and stop talkin bout shit that u dont even no, rock lives on, and u cant do nothin bout it.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\ni totally agree with Psyke Z555, that makes total sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nPsyke Z555,\n\r\nYou're right. I guarentee a new great rock band will break through. It's dumb to think rock is dead, flat out dumb and outrageous. Get lost Mothra, we don';t need that shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nur all wrong mother fuckers rocjh is shit like yeh, its all bout the R&B now, like jay z and sean paul. all u ufking goths are just sad geeks, esp metallica geeks they are so uking geekish, they walk down the road like and i sed to one of them get iot out ofr u and they smacked me and stole my i-pod, its like i beat im up bak and stole it bak. i cudnt agree more with whatsmyname he is the bestw guy in here, metall;ica are soo fuking full of shit, id rather watch the teletubbies than listen to that ashit they call music, i have more melodic farts. they all a bunch of donkey rpaing shit eaters\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\ndis song is sucha loada jak shait ive neva eard such cripe. wot iz da point of roq? itz da shaitest type of musiq dere, rap and r&b and even mozart iz betta den metall...i cant spel itz 2 lng. dey lik sum gae hed bangin retrds and 2 b honest slipnot at least go full out. METALLICA ARE WANABES. i dun why u freaks from america keep preteding to b frm foreign countries no1s eard of and sayin 'we like this shit' cause ur losers. ppl like snoop and m&m are cool americans, but metallica re losers wit gae voices and da musical abili8 of like a banshee on a period. i respct slipknot cause dey re hench and metallica are like...not. wdf is up wid tha wierd lyrics enter sandman? dat like a fetish or summat?\r\nmetallica r weird. u freakish 10 yr olds. go lissen to nursery rhymes. or go get laid, poofs\r\nthx,\r\nsenny 'the deathmatch killa' kuntly\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nok ok... guys relax... im not putting down rock... fuck its the best music in the whole world... but what has there been lately???? seriously since the early ninetys there hasnt been a good new band... all we are left with is wanna be grungers or old washed up metal... these old artists are creatively dead and the new ones fuckin suck... so you know what we are left with FUCKIN SHIT!! fuckin wake up and smell the maple nut crunch... we need a new band to come in and give rock a kick in the ass... but unfortunately i dont see that happening for quite some time... lets all have a moment of silence for rock... RIP ROCK... RIP....\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\noh and dont tell me what to do fuckers... you can lick my brown eye for all i care... all i was stating is that rock is slowly dieing.. no need to get your pantys in a bunch\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\noh and black and big? what the fuck are you gibberin about?? im about to shut your mouth with something.. its not black and big... but its white and wide buddy\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nwat u define rock as?a bunch of fools behin intstruments wanking? or what. face it all rock, always has bin shit. btw mothra go stick ur white and wide one up yo mammas ass cauz dats the only place it eva gunna go. \r\nthx,\r\nsenny \"come get me\" kuntly\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nwhite and \"WIDE' :O ur penis enlargement go a bit screwed?\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nneed4creed,\n\r\nYou're the jackass. It seems like you want rock to die with all your negitivity. The stuff around today is shit, but it's very foolish to think rock is dying. I'm sick of \"rock is dead\" talks. Anyone who dosen't like it can go fuck a cow, because, kiss my ass, rock ain't dead. \n\r\nits black and big,\n\r\nWhy don't you start listining to real music (rock). Get lost in the mean time, no one feels like putting up with you ignorant shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nbig and black... why cant you type one coherent sentence?? whts a matta ur skoolin go wanker?? or ez itz thas u's alwus wus a fockin' wetard? im just speakin in your dumbass tounge so maybe you can understand me... im guna steeck ma' wite and wide penis in ur mama's ass while pumpan tha shit rocknrolls in hur eres while she screems then ims gonsta taks that sheeets out and plugs urs mouth shutz with your mums own sheetss... comprehend? YA YO!!! 4 eva\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nhey eagles relax bro.. hes just telling the truth rocks dieing... i know i know... it sucks... but theres no use living in denial....peace\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nbloody hell how hypocritical, mothra666, ur going on bout how he cant like speak properly, and then like u go and like dont say neything that makes fucking sense. his most recent additoipn was the best thing on this website, and u cnt fucking argue with it. cos METALLICA ARE SHIT, while ur fuking his mum, we are gona spit roast ur mum, with our blakc and long cocks, not fucking white and wide, wat u one bout, a wide cock aint a gd thing. we are then gonna get our crews down and shes gonna drink sooo much spunk cos shes a fucking hoe, but we are gonna wear condoms whilst screwing her brains out, so we dnt catch ne of her nasty STDs or summat, cos like all the fuking glas in the like wolrd wud kill themselves if we died.\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nwell get it out for u... if you read my post, you would of saw how i said i was going to talk like him so maybe he could understand it... but obviously you are too retarded to pick up on that... AND YOU!!! youre just as bad as its big and black... i have no fucking clue how to go about even beginning to try to comprehend that jibberish you just spitted out... \"wat u one bout\" ok what the HELLLL DOES THAT MEAN!??? please enlighten us! now all of us here arent dumb.. we can all tell you and big and black are the same person! you both talk like a fuckin retarded illiterate morons... and judging by your comprehension skills... you definately are illiterate, let me as you a question... do you know what site this is? can you read the url... its songmeanings.net... just making sure you havent come to the wrong place cause we know you cant read or anything.... on and just for the record... its all about the girth baby.. just remember that\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nnagpapa-alala skIn ang kantang ito na maY isan ML na maLuPit kumana s gitara!aNg bagis Mo tlga parE!isa KanG alamaT!nabuhay para hangaaN!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\n\"dis song is sucha loada jak shait ive neva eard such cripe. wot iz da point of roq? itz da shaitest type of musiq dere, rap and r&b and even mozart iz betta den metall...i cant spel itz 2 lng. dey lik sum gae hed bangin retrds and 2 b honest slipnot at least go full out. METALLICA ARE WANABES. i dun why u freaks from america keep preteding to b frm foreign countries no1s eard of and sayin 'we like this shit' cause ur losers. ppl like snoop and m&m are cool americans, but metallica re losers wit gae voices and da musical abili8 of like a banshee on a period. i respct slipknot cause dey re hench and metallica are like...not. wdf is up wid tha wierd lyrics enter sandman? dat like a fetish or summat? \r\nmetallica r weird. u freakish 10 yr olds. go lissen to nursery rhymes. or go get laid, poofs \r\nthx, \r\nsenny 'the deathmatch killa' kuntly \"\r\nI didn't understand a word you just said, learn to spell.\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nGod some people are gonna kill them selves man.....Mothra666 rock on baby\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nMaddox86 go away with your crap Slipknot...we dont want em.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nUh n4c, there are still rock BANDS out there, there are still people who play the guitar or drums. So it's not TOTALLY DEAD or else there would be absolutely none of this. Rock definitly isn't what it used to be. But have some God damn faith man.\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nAnd there IS quality out there. Just it never gets on MTV or radios, because they like pop shit. Trust me, it won't take long for one of thses bands to get a major record deal, and all the sudden, WOW, rock is back to what it was, it was never dead, only sleeping I'll put it.\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nhell ya aerosmithlover, someones gotta get those assholes \"tu shuuut upz, yo naw diggity\"\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nwell.. i am discusted to see the taint of the name \"slipknot\" on a metallica page, especially a sacred one such as enter sandman. i am 13 years old, i heard enter sandman just before st anger came out. yes i am a newbie, but seriously this music has changed my life so much. a convert from the hip hop-rnb underground can see the talent these guys possess.\n\r\ndont worry, its called puberty. Its when hair grows on ur balls and in ur case, up you ass. I realise as a thirteen year old, your one hell of convert. and mothra, keep gettin angry. :) mettalica suck.\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nhow could u say metallica r shit they are the best band eva and this song reminds me of ma uncle he loves it so much\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nDoes anyone want to report that shit to have it deleted?\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nits big and black.... i wouldnt exactly say im angry, just amazed and somewhat dissappointed that a human being could be such an idiot, it goes to show you that the human race is truly on a decline, and youre leadign the way... also you make yourself look so bad when the only way you know how to retaliate is post metallica \"are\" shit 2 millions times, i mean thats just awesome!!!.... ps: i see your english is getting a little better!! keep up the good work bud!\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nTHIS IS FOR:\r\n *MOTHRA 666*, *ITS BLACK & BIG*, \n\r\n*GET IT OUT FOR U* AND *NEED 4 CREED*!!!!!!\n\r\nGO FUCK URSELFS!!!! METALLICA FUKIN ROCKS!! and *its big n black* FUCK OFF and stop typing the same fukin thing over and over agian!!! its annoying which prolly relates to ur personality alot.  all of u  are fags that need to get a life and stop dissing metallica. if kirk, james, lars or rob ever heard u sey any of this shit they would fuckin send an army of metallica fans after u who would fukin take u down. AND ROCK IS NO DYING. all of ur faggots who keep on sayin this are gonna die from not listein to rock. \r\nSO FOR U GUYS WHO KEEP ON SAYIN BAD SHIT BOUT METALLICA....GET THE FUCK OFF OF THIS PAGE AND GET A LIFE U FUCKIN BITCHES LOW LIFED PIECES OF SHIT.\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nbig and black, your a fucking black asshole you ignoratnt peice of cock sucking shit. i bet your the kind of guy that would fuck a guy up the ass and not even have the godamn curtisy to give him a reach- around. Metallica kicks ass and if do dont like them then go back to fuckin LA and listen your rap shit you fucking peter puffer.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\n\"big and black, your a fucking black asshole you ignoratnt peice of cock sucking shit. i bet your the kind of guy that would fuck a guy up the ass and not even have the godamn curtisy to give him a reach- around.\" \n\r\nIts called homosexuality. Widely accepted in the western world, its when a man, loves men and not women. The name is black and big not big and black. Oh yeh, by the way metallica suck. And if you want, you can suck my cock.\n\r\nMetallica kicks ass and if do dont like them then go back to fuckin LA and listen your rap shit you fucking peter puffer.\r\nLA? You think rap originated from LA? Do you even know anything about rap? I believe you are the ignorant fool in this case, asshole, dipshit, dork, moron, misguided rock fan, or better said, fool.\n\r\nif kirk, james, lars or rob ever heard u sey any of this shit they would fuckin send an army of metallica fans after u who would fukin take u down. AND ROCK IS NO DYING. all of ur faggots who keep on sayin this are gonna die from not listein to rock.\n\r\nSend an army? An \"army\"? Well I don't think this will be the first time metallica have been called shit. I've heard far worse taunts...a lot worse. The best thing is metallica are shit. And did you just say \r\n\"all of ur faggots who keep on sayin this are gonna die from not listein to rock.\"\r\nI may not have had the best education and I might not be the cleverest, but according you, people who don't listen to rock will die. HAHAHHAHAAHA. You stupid fool. You display the virtues of a true metallica fan. Stupidity, foolishness and never-ending ignorance. In fact i believe you to be the ultimate idiot, and so therefore, the ultimate metallica fan.  \r\nRock IS dead. Its true. It will never be born again. Rock was going through a renaissance when Kurt Cobain was alive. The rock music of today are just after effects of his songs and actions as well as those of the likes of LZ. What your left with now are mainstream fools making pop music. Metallica? They are just their to please the masses of fools and not to my surprise we in America seem to recieve the brunt. Metallica are worse then Guns fucking Roses, and they were appaling. \r\nMetallica are Shit. \r\nBein an idiot to metallic fans iz tha best fun u get. U jus give em what they give bak and thay start complainin lik moronic fools.\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nok *its black and big* ur fuckin face will be black and big from me punchin u in the face so many times. u wanna no wut....fuck off! o and ya i like how u just assume that all of us are guys. hmmm not sexist; u piece of shit. i dont even think a dog would suck ur dick. in fact im sure u are used to using tweezers just to jack that thing off. and if ur best comback is to say how bad my spelling is than thats pretty fukin sad u geek. and u wanna no wuts \"foolish\"? the fact that ur mom actually let u live when u were born....that was a huge mistake. and when i sed \"army\" i fukin ment an army jackass. u really have no clue how many fans would take ur fat ass down if they found u. and o no metallica got called shit b4...well u wanna no wuts amazing.... so HAS EVERY SINGLE OTHER BAND IN THE WORLD.  and as u sed i was ignorant... well guess wut fucker ur the ignorant one here who keeps on going onto this metallica page and writing ur worthless shitty words.  and guns n roses fuckin rock too.... and it shows that u are obviously  jealous of these ultimate bands. if u knew anything u would know that most ppl who hate something is jealous of it. which represents u. u just wish that u could rock as much as them and be the gods of rock and roll but instead ur a nobody that no one likes. so fuck u and grow up kid. \r\nand rock is not dead. u'll be dead b4 rock ever dies..... and im sure that when u have kids and grandkids, that they'll be listening to this awsome music and telling u how full of shit u are.  \r\nROCK ON METALLICA!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nok guys... im not siding with its big and black, cause hes the biggest asshole of all, but you guys saying metallica still rocks??!! come on now!! did any of you even hear st. anger, or did you just ignore it to make yourselves feel better about metallica and the current state of rock? YES ROCK IS THE BEST MUSIC EVER! YES RAP SUCKS... BUT THE STATE OF ROCK RIGHT NOW IS JUST FUCKIN HORRIBLE!!!! stop living in denial everyone!\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nI feel sory for its black and big , being born musikly retarded and that.\n\r\nAlthough its not that bad, this track is far from metallicas best song. Id recomend fade to black; much fukin better!\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nI think the song is basically about people and life. Face your fears, at least \"with one eye open\" and whatnot. Yet, keep pretending like it's alright, like it's going to be all right. (Hush little baby, don't say a word ) although then it says \"it's just a beast under your bed\" and it sounds like it's trying to tell you that evil is there...\r\nI don't know. Mybe I'm just insane xP\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nSt. anger sucked but that doesnt mean that metallica sucks. big and black , your gay. i dont give a fuck where rap originated because it SUCKS. \n\r\np.s. your black\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nAnd, like I said before, there IS quality out there, just it never shows up because of the shitty media. It'll show some day, at least by 2015. Rock could change alot in all that time (for the good too). \n\r\nI agree Aerosmith playing with Rum DMC was, at that time, an all time low for rock. What was even worse was Jimmy Page letting P. Diddy steal Kashmir and Page even played the guitar on it for him! Rap is no more than a shit genre, it appeared in 1986 and will be gone sooner or later. Shit musical genres always go, it's just musical history; it'll repeat it's self. ROCK WILL NEVER DIE!\n\n\n", "comment_247": "\nwell sed philadelphia eagles... n rock doesnt die. and most rock thats out nowadays is underground. the media only plays pop shit. just cuz u dont see rock on the tv everyday like there is rap doesnt mean that there isnt as many rock fans still waiting for one band to break through and change all of the shit that ppl listen to now. and when u listen to mainstream music its not something to be proud of ... it just shows how u wanna be like everyone else. ya and i agree on how rock musicians have done some shitty stuf like when metallica sang a song called \"we did it again \"with ja rule!!! i was sooo disgusted!!! but ppl make mistakes and thats wut metallica did. but o well i just remeber them for all there other GREAT songs. but i cant fukin wait till rock comes bak and shockes the shit outta all u rap lovers. ROCK NEVER DIES.... IT JUST HIDES FOR A WHILE!!! SO ROCK ON METALLICA! U GUYS WILL LIVE ON FOREVER. U GUYS ARE TRUE LEGENDS.\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\n''i dont give a fuck where rap originated because it SUCKS''\n\r\ntypical ignorant answer from a typical ignorant fool of a rock fan. keep it up :) it never ceases to amuse me.\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nomg........ O MY FUKING GOD! wat are u retards on, and it must be sum pretty gd shit if u still think that rock is alive. its dead, like the last guy hu tried to start on me,just cos i offered to get it out for him. rock better fuking \"hide away fro a while\" cos us gangtas from RnB, n shit are gonna bang him up, for being such a fucking disgrace. u ask ne1 from the music industry and they all wud hav dun it for the money u cock suckers, no-one is in it for there bulshit answer of \"cos we enjoy malking music\" so y not do it for free u nobheads?? cnt u just get it through ur fucking thick fucking skulls that rock is dead, like my gran i mean come on ur head must be thicker than my immense black cock for u to hear their music an dthink it ne gd. its all u dumbass americans hu like them, cos UR SOO FUCKING DUMB AND FAT AND DONKEY RAPING NECROPHILIACS, or dont u even kno wat that word is? it means a person hu fucks dead people u retards look i aint gonna waste ay more time rite now cos i got ur mum w8ing here to get fucked by me, and she charges my the hour so oim gonna get all of my moneys worth cos she soo fuking amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nWell, a person who makes at least 50 errors in his posts isn't going to prove anything.\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nget_it_out_for_u: I come from New Zealand, a small country of about 4 million people.There are exceptions, but most of the time, music doesn't go very far from the immediate area. It's not that it sucks (well as far as the pop goes, it's no worse than any of the other pop thats around), it's just the way the industry works. anyway, as a result, you have to be doing it because you like music. There's just not enough money in it otherwise. Why not do it for free you ask? Im sure many people love their job, doesn't mean they'd do it for free. Doing something you enjoy doing, and getting payed for it (assuming you get paid enough) means you have more time doing what you like doing, rather than some other ass job. Nice language by the way, I'm sure many rock fans will heed your advice and change their ways...\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nas for rock being dead... i disagree, rock looks very much alive to me. Rock is not just a fad, it's a style of music that people enjoy. Rock will never be dead while there are still people who listen to it, and as long as that happens there will always be people who get together with friends and instruments and play. Until all that stops, rock will never be truly dead. As for the debate on who's music is better, what are you people, 12 years old? Music can never compared with music, except maybe by the size of the fan base. But everyone's taste is different, and nobody can prove that any kind of music is superior\n\r\nand one more thing: doing it for money or for music, religious or non religious, odd masks or no odd masks: who gives a fuck. Either u like their music or you dont\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\none more thing:\n\r\nits_big_and_black: what the hell is wrong with you? at least some people have tried to argue their point! Do you have a mental defect? have you even reached puberty yet?\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\n(continued)\n\r\nWhat kind of freak are you? I really can't see anybody over the age of 13 writing that.\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nsomeone answer me this... what is a pretty new rock band out now, that isnt trash!??? struggling??? theres my point, rock may never be dead... but right now its fuckin got one foot in the coffin... and this is coming from a rocker through and through! you guys gotta stop living in denial!!! i mean maybe some band can come along and revitalize rock, but as of right now its in a sad state and seems like it will be for  foreseeable future...\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\ngood point. I shall begin my search for some good recent music. i will report back if i find some, mothra666... see you in a few years, maybe :P\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nhaha i know neptune, maybe if everyone at songmeanings starts looking, we'll find atleast one decent band within the next decade\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nok i am very saddened to see people saying that slipknot is better than metallica your just a bunch of teenagers going on your own thoughts i am a music major and i can tell you metallica is some of the best heavy metal ever written slipknot isn't even in the same genre slipknot is hardcore num nuts maddox86 and all you other slipknot fans really need to get your music checked out if you say metallica isn't as good as slipknot, slipknot is a over rated band that got a lucky record deal i have listened to there music alot live recording's ive gone to three of there concerts they are fine musicians but they don't put there skills to use and they become a sideshow of screaming people and they don't actully play there instraments they thrash them sure its fun to watch heck its fucking awsome to watch but music wise i am saddened to see them shaping the future genre of hardcore you want to hear a real hardcore band look up ZAO but anyways back to metallica, metallica is has some of the best stuff ever written in the heavy metal genre of course in my mind their new stuff is no where near to what there old stuff was but either way amazing band with amazing amounts of talent that is shown in every last song of theirs but hey you can't forget led zepplin made it into the guniess book of world records twice for the best rock song ever written \"Stairway to heaven\" and the biggest crowd ever played in front of  in conclusion slipknot people go out buy a ZAO, led zepplin and metallica greatest hits cd's and u'll see what real music is \r\nP.S. don't talk about how this band suxks or stuff like that unless you listen to all genre's otherwise you really don't know what your talking about its just your opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nI think this song is about a little boys nightmares , or an adults Disease ''Insommnia read the lyrics and key over the idea of insomnia :P\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nwow calm dowm metallica... we get the picture.. you love metallica! but seriously other people have other tastes, personally i agree with you, metallica in their prime are ten times better than slipknot, but nowadays its almsot like pick your  poison, cause their both horrible now\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nthats completely unnecessary, if u have a point to make make it sensibly. Dont do that again...\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nis all that spam really needed? You're just acting like an absolute jackass of a troll.\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nyea its black and big or w.e stop doin that its annoying. u keep sayin the same dumb shit that no one wants to read over and over again.\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\natleast say something like \"metallica are shit NOW\" cause back in the day, they USED to fuckin kicked ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nI removed the spam comments by it's black and big. \n\r\nOne more time and you are out of this community.\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nhmm shouldnt there be some maximum to the amount of sentences that can be posted? \r\nAs for the stuff u write(black and big), ok fine metallica might very well be followed by ignorant fools and u might not like them, but if ur gonna respond to it by being really ignorant then whats the point? I managed to read throught some of ur err badly spelt stuff and i came to the conclusion that u feel bitter about metallica. You seem angry that people wont listen to other types of music but u did say u thought led zeppelin were gd. So my point is wat is your point???? Dont answer wit spam but be serious, wat annoys u? Mtv? metallica..wat? dont get banned but actually make ur point across..as for rock being dead..it wont be dead if people believe it is still there. I know that standards hav dropped but artists like LZ dont come around very often. Nor nirvana...who seem like the mainstream bands every1 has heard of. There are loads more tho..\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\neveryone here feels the need to turn it all into an arguement,. admit it. you all LOVE coming on here and trying to be a big controversal dude an stirr things up., i think its disgusting, unfortunatly, thats the way the world works.\n\r\npeople unite in hate rather than i love,\n\r\n do you think thats what great music is for? \n\r\nto put people down? \n\r\nno its fucking not. \n\r\neveryone take a fucking chill pill. take a relaxi taxi. sit the fuck down. almost every one here is saying how great metallica is, just in thoier own way, but you all also feel the need to point out how the way you love them is better than the way the person b4 you liked them.\r\n look at yoursleves?\n\r\nthey write and create this music for us.  at a metallica concert i jump and scream with everyone else, were one voice, we all hold up our hands in the air, we shout, we sing, we head bamd, we jump, its the atmosphere you get as a group of people, all being touched by the sounds coming out of thier guitars. \n\r\nwhy taint it by trying to indivilualize ypourself in a way that only generates hate and discrimination. WHY?\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nHey Mothra! Whats up guys? I'm back! It's about fucking time they got this website up and running again! I almost forgot about it! All I have to say once again is Metallica rocks (rockED). They are totally original and influenced a lot of these shitty poser bands we have today. Anyone who argues is either deaf or has no knowledge of music, and should therefore get their ignorant ass off this website. Thank you.\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nhey diseased long time no see... good to see you back on the site, could use some one with some common sense back... and yea metallica did rock.. im missing the good ole days when rock ruled...\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nhow has that got anything to do with lyrics? If u wanna lick up to each other do it somewhere else.\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nrock never ever ruled, unlike my crew bak home in berrylands. just cos u two bumchums are bak together dusnt mean that rock is gd cos its shit. full stop, period, end of story. as for itll be here if u want it to, now u sound like sumthing out a disney film. its shit always has been always will be i cant believe people still listen ot it i mean come on it sucks balls, big hairy balls with nobcheese. its crap get it thru ur heads.\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nrock will be here cause if enough ppl believe init then its real. just liek god. U dont hav to like god or metallica but u can believe theyre there. as shown int he lyrics\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nok for all the people who are having a fukin reuinin on this web page...shut the fuck up. no one cares that u keep babbling on crap and how rock is dieing....cuz we all not that its not. can u guys not find another song meanings page to write on. stop saying rude shit and go find a song that u like and start saying stuff that actually matters. stop talking bullshit about rock being dead and get a life.\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nMETALLICA FAN.... I LOVE THIS SONG MAN and i love metallica and the music they MADE... but FUCK quite denying shit... let me ask you something to try to get my point across... what recently new rock band do you like? is there any? cause to me the all fuckin suck... music is being taken over by rap and pop cause.. its a fact, only idiots are happy about it.. im not happy one fuckin bit about it, but its fuckin true... sad but true... and if you dont think it is, name a few good popular and new rock bands out now....\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nMetallica fan- God forgive me for taking away your precious time. Hell, I might be keeping you from spreading your hypocritical bullshit around the web. If you'll notice, at least we were talking about music, which is the basis of this website by the way, and if you'll also notice, yours said nothing about music whatsoever; just you whining and crying like a little bitch about people doing what you just did in trying to tell us off. Excuse me while I sob uncontrollably. Man up, you pathetic waste of space and quit bitching! Did anyone here ask for your insignificant little opinion? No. Grow some fucking balls and then come talk to us. Until then, fuck off.\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nok for mothra666.... ya i no that most of the music out now is crappy music like rap and pop. but hey metallica is still releasing cd's... and velvet revolver isnt that bad... it could be better but hey they have slash and duff...and they kick ass. but ok w.e then im not denying shit... u keep sayin that rock is dieing.. well its not and that is my point. rock is not mainstream rite now...and its slowed down...but hey it alwayz does. look back... 1st it was elvis then it was alice cooper and black sabbath, and they nvr came out one after another...there were time periods when there was only shitty disco music out in shit. like metallica saved everyone from spandex era and all that crap. but now it is rap n shit and we are just waiting for another rock band to save us from any more crappy music. rock cant die. music lasts forever....fuck we still have ppl listening to bethoven n shit wich is a couple hundred years old. so get over urself.\r\nand for diseased and amused maby i could start sayin my opinion on music if u stopped dissing metallica. srry but if u knew anything.... u would get the point that im bitchin at u and defending metallica and rock that i love it. and when u say stupid shit that u dont know what ur talkin bout yea that asks itself for my \"insignificant\" opinion. so fuck u prick. and if u noticed im the not only one bitchin on this website. so go suck a dick u fag. no one wants ur opinion cuz all u do is critisize rock and metallica. go fuck urself.\r\nMETALLICA FUCKIN ROCKS!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nhey hey hey metallica... thats no way to talk to a lady my friend...(thats a girl by the way..) you got some serious issues pal.. some serious serious issues... if i was living in any of those periods were rock has \"slowed\".. id say it was fuckin dieing then too... but now its even different.. now with mtv and shit rulin the media more than ever and now that the only thing any new artists care about is money... rock is going to have a hard time recovering... its fuckin sad as hell, and i know rock has recovered from some shady times... (people thought music was dead forever during disco).... but man.. this time rock maybe down and out..RIP\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nthats right rocks dead and rap lives on and will thrive thanks to people like u. thx mate.\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nso what if shes a girl? i hope you arnt discriminating, ans stop agreein with black annd big asshole.\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nwhatsmyname what the hell are you talkign about, i stood up for the girl.. shes a good poster on this site, i just said tis no way to talk to a lady, cause by the way hes talkign he must think its a girl or something.. holy shit.. try to do something ncie and fuckin idiots take it all wrong... oh and im not fuckn agreeing with him.. I FUCKIN LOVE ROCK.. are you an idiot???? im jsut fuckin stating the facts.. whatsmyname, you should ask another question.... whatsmyiq, cause i think its about equivilent to a pile of dog shit...\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nsick song, wether you like it or not everyone on this metal lovin planet will rekognize dis song, great shit. ne 1 dat dosnt like it can eat a big fat juicey dick up big and blacks arse. peace out man its time 4 a joint\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nIt has a nice beat to it and you can dance to it , too.\r\nHowever I like some other bands like Boney M and ABBA a little better. They have kind lyrics not just a nice tune. In the '70's there were warmer songs than this.\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nu contradicting little pig fucking asshole. if ur tryin to do something nice then wats the point of taking the piss out of me? how comes u say lay off shes a girl and then go and try and do a shit on me. wdf are u on about?? \r\n\"cause by the way hes talkign he must think its a girl or something\" wat?? so if he thinks shes a girl then why the feck do u have to say tahts no way to speak toa girl./ Ur fucking confusing me lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nsorry i meant \"he must think its a man\".... and then you come on here acting like fuckin king shit.. and totally misinterprrut all i fuckin say... thats what pisses me off the most,  your an idiot, pure and simple, an idiot, thats why i got on your case.. if you fuckin read anything i said youd know i wouldnt agree with the likes of its big and black thats for sure...and then after i stick up for a nice girl on here.. you go an call me discrimitory... you deserve everything i said to you whatsmyiq....\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\noh and im sorry i took the piss out of you...\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nI don't know what this song is about, don't ask me...but I love it - it's so sinister...and the video is pretty scary as well...snakes, and a lorry, and a guy tumbling down a cliff\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nYeah he misinterpreted what I said too. When did I ever say that I didn't like Metallica. I fucking LOVE their original shit, dude, wtf! Wow, this guy is not only iliterate, but is also incredibly stupid. \"This music is real. It speaks truth.  , Metallica rules- Metallica is raw talent. Lars Ulrich is one of the best drummers of all time, and this is not an opinion, it is a fact. Kirk Hammet has played some of the best guitar solos in the history of rock music. You know that this is a site with ppl who love and are devoted to Metallica. I grew up listenning to them. When you insult them, you insult me, because they are a part of my life...\" THESE ARE ALL THINGS I HAVE SAID ABOUT METALLICA YOU FUCKING BRAINDEAD MORON! I love rock with all my life and for you to come on here and challenge that is WAY out of line. Do us all a favor and just leave, \"whatsmyiq\". Good one Mothra; thanx for sticking up for me. PEACE OUT MUTHA FUCKAS!\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nBy the way, i agree with whoever it was that said rock's a rollercoaster (sorry not to mention names, but there's no way i'm looking through this entire thing again!). For example, Kasabian are on the radio now, and they're rock. And they're bloody popular. And so Franz Ferdinand (my fave band) and they may not be metal, but they are some form of rock, and they're popular too. I don't think rock's dead - not even metal, if you want me to get off the indie stuff...i hear Enter Sandman a lot, people request it...and i think that as long as rock fans exist, rock does too...so... And i haven't really heard much Metallica, so i'm in no position to say how good they were/are - but i do think that this song is much better than St Anger.\n\r\nAnd, just to let you know, Bahemian Rhapsody's on now, too, someone requested it...rock aint dead...!\n\r\nooh, and now franz is on! ... :D\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nman...how long did it take me to write that last one? it's not even very long... but kasabian, queen, and franz played during the time...wow, heh...\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nhey havent wrote in a bit.... ok mothra 666 u are a complete idiot. u are tellin me not to bitch at this chick cuz thats no way for a guy to talk to a lady. well guess wut dumbass im a chick too. and if some skank is gonna come on here and bitch at me well guess what im gonna bitch bak.and u say i have some serious issues? well look at urself fucker....ur the one callin down metallica. and to top it off u basicallly sed that i was allowed to bitch at a guy but oo no not a chick cuz thats not allowed and only rude ppl do that. pffff....grow up and stop bein sexist. \r\nalso for all the people who \"love metallica's original shit\" or w.e well then why are u on ENTER SANDMAN page?!!!! y dont u talk bout how u like this song cuz it original. go to a page with there new music on it and bitch there. y are u here.... write all ur critizism under there new cd dumbass...\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nI think you guys are very rude talking to each other like that. Probably this kind of music (?) does that to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nNOT THE BEST NOT THE WORST BUT DEFINITELY THE MOST OVERRATED OF ALL METALLICA SONGS\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\noi stop havin a go at mothra666 atleast he realises metallica are shit and that rock is crap and is dead. just like me.\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nbig and black... youre right to an extent... metallica now is shit.. st anger was a disgrace to all the music they made before which was great.. and rock isnt crap, it used to be filled with the most emotional and greatest music of all time..now its full of shit..actually i wouldnt even call anything out now rock, rock is gone..... oh and metallica fan, you wanna go out some time? maybe we can cuddle in front of a nice warm fire place, you seem like really sweet and loving lady!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nRock is NOT dead. Do you people have a clue as to the meaning of the word \"dead\"? To be \"dead' you have to be 100% dead.Rock is not and can never be 100% dead. \n\r\nJesus Fucking Christ!\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nfuck you mothra...u cant sit here n judge me.... u dont even no me. and stop bein a smart ass, u seem like the kind of guy who thinks he all that but really he needs to go n grow a dick and get over himself. and what i cant understand is why are people argueing on this song page. if you dont like metallicas newer shit like the cd st. anger then why arent you complaining on those lyric pages? this song is from metallicas black album NOT FROM ST.ANGER! so if your gonna complain get go somewhere else!\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nummm... metallica fan... i take it thats a no??? DAMN i really wanted to cuddle too...\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\npoor mothra...he's heartbroken\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nabout the dumb shit who compares METALLICA to little slipknot\r\nits like comparing a jet fighter to a mosquito \r\nor and atomic bomb to a sparkeler\r\ni cud go on for ahwile about it\n\r\nlets just face it tho METALLICA kicks ultimate ass and will for ever and for the other band o what was their name again heh guess i forgot about them already\n\r\nlong live METALLICA\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\ni agree with puppet_master_72, slipknot is cool but is no comparision to METALLICA.\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nI agree with Philadelphia Eagles. Rock is not dead, be positive, there WILL be another band to pick up the Rock drought. Right now all these shitty nu metal and pop rock bands are ruining what rock should be. Since Nirvana and Radiohead, there has been very few bands that deserve our attention. And IMO Slipknot is NOT cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\numm ... i didn't really bother to read all these comments, but i just wanna say that slipknot and maddox can both kis my hairy ass ! u call slipknot a band ? i can't believe it actually takes 9 people to come up with that crappy music , i call it crap-metal !\r\nhave u noticed how the guy with the clown mask usually has nothing to do other than scaring kids off on interviews? all he does during live shows is sit on some drums and head bang! \r\nand what's with the masks ? halloween is once a year! \r\nmaddox u're a douchebag and so is every fuckin' member of slipknot ! \n\r\nps. sorry for my english lol\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nmothra u think ur all that but ur just a smart ass....stop sayin stupid shit. and anywayz yea i agree wit puppet master 72....that is soo true, slipknot sucks...ROCK ON METALLICA!\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\ni don't like slipknot much (in all honesty, i only like 1 song) but it's a very clever idea to wear the funny masks. of course they're gonna become more well known that way - \"slipknot? oh, yeah, the band with the weird masks!\" - that sort of thing... :-P\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nmetallica.. you got some built up anger inside, girl... i think a little cuddlin with yours truly could get some of that out... relax sista... mothra will take care of you.. just let me love you... and nothing else matters....\t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\njust give it up you creepy wierdo\t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\npuppet master... no need to get jealous baby... theres enough mothra to go around.. youlll be right in line after metallica fan.. rest assured..\t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\noh, shut up now, mothra, it gets less funny after 8 days.. :-P\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nfrozen in fire.. im just so hurt, i need some good loving thats all... metallica fan is such a nice girl, i just wish shed give me the time of day. Im in love\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\nok i dont even no u.... u are one creepy dude mothra. its pathetic that u try to pick ppl up off the internet....\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\njust to let everyone know the song has nothing to d with metallica members...they actually purchased this song (the lyrics) from a jazz musician after hearing him play it in a club\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\ni actually have no idea whether it's to do with metallica or not...but i know it's a good song\n\r\nnah, metallica fan, he's not trying to pick anyone up, he's just trying to be funny and, i think, reduce the hostility that had been here before...unless he's astoundingly desperate, which on second thought wouldn't surpise me :-P nah, just kidding...or so it would seem...? and *poof* i disapear in a flash of light!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nDang, I missed a lot! HAHAHAHA! Metallica fan, I think you really do need a hug. It's pretty sad how you repeatedly misinterpret everything anyone says on here. Where the fuck do you get your crazy-ass ideas? Grow a dick? Wow. So original. Newsflash, you half-witted feminine embarrassment! Mothra was being sarcastic! Don't flatter yourself you silly little girl: he was insulting you! And by the way, if you weren't probably hundreds of miles away with your cozy little suburban home security system to protect you, I guaranfuckingtee that you wouldn't be calling me a skank to my face, you whiny little cunt.\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nmeoow... cat fight! haha im with you diseased, that metallica fan sure does need to be straightened out thats for sure.. shes way too uptight and misinterprets everything... im glad youre on this board... one of the only voices of reason left... all im sayign is that new rock sucks.. and its in a period where rock is dying off.. and these people jump down my fuckin throat... FACE THE FACTS METALLICA FAN!!!  and stop being such a bitch!\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nby the general way things are going i just hav to say this... ill fuck all of you 1 by 1 or if u want all at once :) just ask. btw metallica = crap.\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\ndiseased and amused? go get laid u fucking horny ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\n*poof* i reappear (flash of light optional)\n\r\nmothra, you might feel that new rock is crap and rock's dying off, and fine, but it's not a \"fact\" as you put it. it's just your opinion, and you shouldn't try to force it on others. ... but you aren't the only one doing it, i just felt that you'd probably take it better than some others on this board... but it's just something that everyone should keep in mind... including me at some stage, probably...\n\r\nbtw, its_big_and_black, where do you get off calling diseased_and_amused horny?...seeing as it was meant as an insult...read the post before that (yours) and tell me that's not hypocritical...\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nim not gonna go as far as saying its a fact, but compare rock now to other eras... doesnt quite match up... i mean  when the grammies rock winners include fuckin pink and dave matthewws???? FUCK... its a crying same\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nYeah, think of it this way: what are we listening to now? Music of the past, man. Since our era has so little to offer, we have to fulfill our musical uhh... desires I guess, with listenning to kick-ass rock of previous generations. What are we going to remember from decades down the road? Fuckin' Avril Lavigne and Linkin Park? Hell no! Real rock is what stays with you and lasts for years and years; shit that really matters and changed the face of music. I just think we are in a slump right now and who knows? maybe some new band will start a revolution and rock will be the earthshattering force it used to be, and maybe it wont. But until we know for sure, all we can do is continue to draw inspiration from the true, hardcore rock and roll that we all know and love, and drown out the cheap-ass commercialized pop rock bullshit that invades our stereos and calls itself \"Rock\". Real music never gets old and never dies; it continues to change us and affect us every time we listen to it. All we have to do is just keep it alive and hope it will prevail.\r\nBTW. what was that \"horny\" business all about? lol. sounds like you're the one who needs a good fucking. haha. PEACE!\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nAnd why would any one of you worry about it? You obviously have no control over such things. You can't manipulate the outcome of rock. Just hope something good happens. I'd love to see a great new band come out. The cunts that ruin rock today will take care of themselves and fuck-off sooner or later.\t\t\t\t\n\t\t\t\t\n\n", "comment_321": "\nDude, the fans have a HUGE affect on the outcome of rock. As long as we keep loving and demanding it, people will continue producing it.\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nfuck you diseased and amused... if i ever saw ur fat fukin ass on the street i would be callin u alot more than a skank to ur face u dirty hoe. and o by the way if when u sed that i wasnt original....look at what u posted in one of ur comments: grow some fuckin balls. o no diseased ur not being origianl how sad... thats y i just had to write it down...cuz u know if u say somethin that has been sed b4..well we just alll know that thats soooo bad. pfffff... give me a break miss know it all.... get over urself u conceded lil bitch. and mothra u dumb ass...rock is takin a break....YES i know that...but it is NOT dying off. It NEVER will sooo stop sayin that. \r\nand ya i agree with u for once philadelphia eagles... that is true that no one has control over rock. \r\nand i dont get u diseased cuz if there is fans like you out there who nag and bitch about how \"o rock is dying and only shit is out there now\" well then sorry to break it to ya but umm the record companies will think hmmm the rock is shit... well i guess we'll keep playin rap. (which is CRAP)\r\nROCK ON METALLICA!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\na metallica fan its not the record comps that think the new rock is shit you fuckmook... its all the general population, check out the record sales.. no ones trying to control anything.. maybe if you could control your fingers a little more metallica fan, you could fuckin type something that made half a donkey shit worth of sense\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\nThis whole thing is a bunch of bullshit.  I've been with Diseased from the start(this is my first time posting though).  Metallica is not anti-christian or evil.  Rock will not die.  MTV is polluting teenagers minds.  Creed sucks.  End of story.  Alot of you Metallica fans on here are giving us a bad rap, horrible grammer and punctuation, just perpetuating a myth that Metallica fans are idiots.  I'm suprized that this song has more comments than the true classics: Master of Puppets, Fade To Black,  One, Ride the Lightning...etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\nThis whole thing is a bunch of bullshit.  I've been with Diseased from the start(this is my first time posting though).  Metallica is not anti-christian or evil.  Rock will not die.  MTV is polluting teenagers minds.  Creed sucks.  End of story.  Alot of you Metallica fans on here are giving us a bad rap, horrible grammer and punctuation, just perpetuating a myth that Metallica fans are idiots.  I'm suprized that this song has more comments than the true classics: Master of Puppets, Fade To Black,  One, Ride the Lightning...etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\no-ri-gi-nal; adj. Not derived from something else; fresh and unusual: productive of new things or new ideas; inventive. dictionary.com. thought I'd help you out.\r\nShall we guess why I said, 'Grow a dick? Wow. So original.' ? perhaps it's because I said something similar previously, you dumb bitch. Hence, you are not being ORIGINAL; instead you are using someone else's ideas to insult someone else. OOH! YOU GOT ME! is it just me, or is this bitch trying to sound like me and failing horribly? what are you, like 12? march your preteen ass back over to the Destiny's Child page where you can find some people who will actually take you seriously. Oh my god! like metallica like totally rocks! tee hee hee! I really feel bad for you; I really do. If you knew how stupid you are making yourself look, you would be so fucking embarrassed. No one agrees with you, you make no fucking sense, and you're annoying as fuck. Now go do your homework. Haha.\r\nHey Sucrose! Welcome, Buddy. Nice of you to contribute to the small group of people who actually know what the fuck they're talking about. I totally agree; MTV is a major reason for the downfall of rock in the mainstream. it's more like, \"pop-culture television\" than \"music television\" like it was originally intended to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nMTV doesn't care about good music, just about popular music that'll let it's ratings boost. \n\r\nlinkin park and avril lavigne...well, yes, of course...but they're the worst possible rock you could find, and shouldn't really be called \"rock\" at all. i refer to them, and others, as \"kiddy rock\"... but they're the popular sorts of music, and it's...well, it's depressing. but to me, it doesn't mean that actual rock is dying/on a break/whatever, just that it's not as popular (which is baaaaad, and shouldn't be, but...) as long as the fans of good music listen to the music they like, and just keep away from the other, fake talentless music, then there's really nothing to worry about...\n\r\nlook at it like this. there's a bunch of girls at my school who think of nothing but \"busted\", \"blue\", and \"mcfly\" (that's when they're not flirting their asses off..and we go to an all-girl school, dunno what they're trying to say about themselves). but it doesn't really bother me. i couldn't give a fuck about their musical tastes, however crap they are (and believe me - the aforementioned bands are just the tip of the iceburg), and you couldn't pay me to listen to mtv, or the box, or smash hits. i just listen to the music i like. ie, good music. which, however unbelievable, is still made - but because it's good music, and therefore is unlikely to be played on mtv/etc, no one knows about it.\n\r\nbut if you'd like to know, new rock you lot might like is played on a lot of radio stations - like on \"unsigned\" shows...\n\r\nbut if you still think that ain't enough - i got an idea. let's all make our own songs! ... oh, come on! we can all mess around on various instruments until we find something that fits, and then the only step that's left, is to kill all supporters of pop/rap/etc, anyone who tries to stop us, and pave the way to a rock revolution!!! ... of course, the population will be significantly reduced by then, but still...\n\r\n...oh, what?!!! oh, well, suddenly you all think i'm crazy! well, the revolution's gonna happen! now, where did i put my gun...?\n\r\nwell, will ya look at the time...? happy new year, suckers!!! :-D\t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nHaha, Diseased I thought you were talking about me in that first paragraph until I saw \"Hey Sucrose\".  \"Kiddy Rock\" is right Frozen.  MTV is the bane of my existance, it is there to ostracize free thinkers from the \"cool\" people(mtv being the one who dictates who is cool)  its like a disease.  Eh, whatever, I dont want to hang around brainwashable idiots anyways.\t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nYeah, even the shit they call \"rock\" on MTV gives teeny boppers the idea that it's trendy or whatever to be all punk and badass. I think that if rock is ever going to really come back, it has to stay as far away from MTV as is humanly possible. Just being on MTV makes rock cheap and, ultimately, classifies itself as pop. MTV is kind of like Big Brother in \"1984\". It's like this evil force that pressures young people to all be the same and whoever does not conform shall be cast out from its society of \"cool\" people. Haha.\r\nHey mothra! Where the fuck are you, man? Anyways, I'm out. love, peace and chicken grease;)\t\t\t\t\n\t\t\t\t\n\n", "comment_330": "\nyea anywayz....i thought this site was to write what you thought about music and certain songs.....but everytime i come on here all i hear is diseased and amused bitching about something or another. so anywayz im sick of hearing her nag on and put on dictionary definiations and all that crap on( and for a hint diseased if i wanted to know the exact deinition of original.... i would look it up myself) but newayz metallica kicks ass....sometime or another(hopefully soon) another band will come out and save us from rap and pop music....cuz its killing me! ya but im out.... i wouldnt want to embarass myself...now would i diseased?\t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\nnope. I think she's getting it. It's so funny when ppl bitch about other ppl bitching.~sigh~ but all that aside, I just want to say, from one metallica fan to another, (literally) I don't necessarily think you're stupid, you're just naive and probably really young, which is understandable. i dont harbor any hard feelings, so lets just call it quits: anyone who's down with metallica is down with me.\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nalright then.....and obviously you have gotten the wrong picture of me... im not that young. im turning 17.....but if you guys consider me still as a young one, well then go for it. peace!\t\t\t\t\n\t\t\t\t\n\n", "comment_333": "\nI read in an interview that james hetfield originally was going to write this song about \"crib death\" and it transmuted into this. \n\r\nI prefer the old Master of Puppets style of playing to this stripped down sound. Frome Ride the Lightning to ...And Justice Metallica had a progressive/thrash sound that rocked with its variety in playing. Now we have St. Anger which sounds like Bob Rock's(their producer since the Black Album)\"vision\" of what heavy should be.They think it returns them to their roots after the LOAD fiasco but in opinion banging on a trash can sounding  snare drums just grates. PLEASE JUST ONE MORE MASTER OF PUPPETS PLEASE!\t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nhell yeah! diseased an mothra, you guy again?!?! your like a double team!!\n\r\nan why is it that jst cuz metallicafan n diseases r girls they both gotta call each other skanks [actually i think it was jst metfan that said that] but you guys are goin crazy w/ the insults [agn, mostly metfan] an you dont know each other! stop makin it personal! im a girl too, now all of a sudden im an ugly ho?!? you dont know me! but go on, call me it anyway cuz thats the way your mind seems to work! \n\r\nan that has NOTHIN to do with metallica or this song so why you gotta get bitchy about it? chillax!\t\t\t\t\n\t\t\t\t\n\n", "comment_335": "\nthanx for your input. please tell me that was directed at metallicafan. she clearly started shit with me. you mess with the snake, you're gonna get bit, thats all I have to say. Plus, it's cool now.\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\nya ilovelucy its kinda over now....\t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\nilovelucy and diseased are too sweet ass chicks in my book... metallica fan, you just need to relax sometimes sista\t\t\t\t\n\t\t\t\t\n\n", "comment_338": "\nwell, it's all over. *sigh* t'was fun to watch while it lasted. well, not really. well, sorta. by the way, if metallica_fan turning on 17, is considered a young one, then that makes me an extremely little and tiny young one...sorta.\n\r\nwell, i'm off to build an army of super-robots that will eventually declare me their eternal master (well, mistress) and set out to destroy the world. yup.\t\t\t\t\n\t\t\t\t\n\n", "comment_339": "\nthis song owns! holy crap thats a lot of replies...\t\t\t\t\n\t\t\t\t\n\n", "comment_340": "\nThanx baby. ;) kiss\r\nI have to come home and drown out the godawful christian rock that I am forced to listen to at the fitness center. I mean, honestly, how can I get pumped when I'm hearing \"sing his praises\" blaring in my fucking ears? Jesus fucking Christ!\r\nOk, I guess she's not really young... how old is everyone?; not that it really matters, but just for reference. \r\nno. you are mistaken! for I am the mistress of the super-robot army that will set out to destroy the world. They bow only to me, the dark angel of death! haha\r\nI'm out. love, peace and chicken grease;)\t\t\t\t\n\t\t\t\t\n\n", "comment_341": "\nsongmeanings.net/…\n\r\nCome here.\t\t\t\t\n\t\t\t\t\n\n", "comment_342": "\nyou lie! your robots are pathetic weaklings that will get down on their knees (if you built them with knees) and beg my super-powerful-almighty-destuctive robots for their lives! hahaHA!\n\r\nif you are an expert at mathematics, then you may be able to work out my age from my birthday, on my profile. however, it IS extremely difficult - no one let it slip, but einstein actually died of exhaustion after trying to work out someone's age from their birthdate. remarkable, but completely 100% true.\n\r\nhehehe...lot of weidos on the cannibal corpse board, philadelphia eagles...\t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nwow. sorry I haven't written for awhile. I had to be rushed to the hospital when an anuerysm in my brain almost burst while trying to decode the mystery of frozen's age. how do you do it? ive been in my room calculating for days up to my neck in sticky notes! I'm a failure! Stupid, stupid, stupid!\t\t\t\t\n\t\t\t\t\n\n", "comment_344": "\nman... im too tired!!! damn you supermathematicans with yourt robot birthdays.... dancing around my head and poking fun at my tired lickle body......\n\r\nim a 57yr old perv in case your wondering. [what? we could all easily be!!!]\t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nwho have you been speaking to?!\t\t\t\t\n\t\t\t\t\n\n", "comment_346": "\nor, WHAT have you been speaking to? the giant pink bunny you see after swallowing the pills doesn't count. :P\t\t\t\t\n\t\t\t\t\n\n", "comment_347": "\nholy cow ever since i started posting there hav bin like 100 posts :) i must hav the magic touch. btw diseased if that was a request for me to \"put it in u\" then ill think about it aprt from that linkin park suck and avril lavigne smells ... goood. juswt her music sucks but taht alrite cause metallica suck. btw Mozart is pretty good and i fuckin well hate ppl who fuckin smell. Hope taht answers the statement about me being contradicting . BTW U LOT BETTER NOT BE  70YEAR OLD PERVERTS.\t\t\t\t\n\t\t\t\t\n\n", "comment_348": "\ni apologise for my last post... i was VERY tired and i hadn a clue what was happenein... no im not 58 or whatevre i said, im ALOT younger than that!!\n\r\nwho says the bunny doesnt count?!?\t\t\t\t\n\t\t\t\t\n\n", "comment_349": "\nhey..... metallica rocks!!!! thats all i have to say.\t\t\t\t\n\t\t\t\t\n\n", "comment_350": "\nI think all has been said. It's a great song. Gotta love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_351": "\nalright, alright, the bunny counts...but the talking fish shouldn't - he's an idiot, not anywhere near as smart as the bunny\t\t\t\t\n\t\t\t\t\n\n", "comment_352": "\nI miss mothra :(\r\nMetallica kicks pop rock's scrawny white ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_353": "\n1 thing to say.....BEST BAND IN THE WORLD!!!! this song prooves it.\t\t\t\t\n\t\t\t\t\n\n", "comment_354": "\ngosh darn it, this board is practically dying... :-( including this, there's so far been 3 posts from the 9th to the 16th. poor Enter Sandman.\n\r\nhmm, where IS mothra anyway?\t\t\t\t\n\t\t\t\t\n\n", "comment_355": "\nFrozen in fire is right, we must liven this board and re-live Metallica! C'mon Exit Light! Enter Night! Take My Hand!!....\t\t\t\t\n\t\t\t\t\n\n", "comment_356": "\ndam got a gay night shift nvm \n\r\nMETTALICA SUCK!!!!\n\r\ndiscuss.\t\t\t\t\n\t\t\t\t\n\n", "comment_357": "\ni hate you to the max\n\r\nyar\t\t\t\t\n\t\t\t\t\n\n", "comment_358": "\nif you don't mind me asking, its_black_and_big, who are METTALICA? seeing as the band in question are Metallica. ...?\t\t\t\t\n\t\t\t\t\n\n", "comment_359": "\ngood 2 see the postings back. \r\nMETTALICA SUCK---> true? false?\r\n wat does the song mean? Who is METALLICA? \r\nwhy are they there? who are all u people? aaah \r\nMATTALIKA SHOCK.\t\t\t\t\n\t\t\t\t\n\n", "comment_360": "\nyou have nothing better to say, do you...? i don't mind if you don't like the band, i'm just poking fun at your typo...\t\t\t\t\n\t\t\t\t\n\n", "comment_361": "\nmetallica suck?!!!thats false. metallica rocks and i love em. and u dont make sense....who is metallica...well they are a band of four guys(kirk, lars, james, rob) if you really wanted to know. they are there cuz they like to play music and create it...and there just happens to be millions of fans like me and any other fan on this board ;who appreciates there music and talents. metallica = GOD\t\t\t\t\n\t\t\t\t\n\n", "comment_362": "\nif u dont like metallica ure tone deaf. but i dont think this song is there best its just been around a long time and it is good.metallica's songs bring back either happy or sad memorysfor me but i love listening to them.\t\t\t\t\n\t\t\t\t\n\n", "comment_363": "\nsomething i love about metallica is they always have the older days talk about them.like the lord of the rings type stuff.i love the warlord talk as i call it.\t\t\t\t\n\t\t\t\t\n\n", "comment_364": "\nmetallica......no no i think you mean sellouttica because thats what they did.....SOLD OUT!!!!!!....at one time they said they would never make a music video...and when they did (one) they sold out and theyve been selling out since\t\t\t\t\n\t\t\t\t\n\n", "comment_365": "\nthis song is the greatest metallica song ever!~!this is like my anthem!~!it reminds me about who i am!\t\t\t\t\n\t\t\t\t\n\n", "comment_366": "\nok back up there that christianlovingod fagg posted a comment on \"how metallica sucks and we should listen to religious music and a bunch of other bullshit..\" \n\r\nwell bitch how \"christian\" is it to randomly go to a website and talk shit to get other people upset because they dont listen to your music or share your beliefs? if you dont like this music dont come here.\n\r\ni guess i consider myself somewhat christian but i dont go around preching to people who dont really give a shit. andd i listen to metallica and slipknot(haha) and other bands like that without thinking god will strike down on me.\n\r\ngrow up..\n\r\nbtw..this song is amazing and i think its about exactly how it sounds, a little kid facing the fears of going to sleep at night, and how the prayer can be scary to a little child.\t\t\t\t\n\t\t\t\t\n\n", "comment_367": "\nthis is just a song about one child who is going to have bad dreams.That's all!!\t\t\t\t\n\t\t\t\t\n\n", "comment_368": "\nreminds you about who you are? do you dream of liars and dragon's fire? are you the sandman? are you off to never never land? and in that case do you really need to be reminded of who you are because that's a pretty goddamn memorable existance, if you ask me. please elaborate on that.\t\t\t\t\n\t\t\t\t\n\n", "comment_369": "\nfirst of all to all u ppl who keep posting get a life and stop taking up space. have ya'll 4gotten wut this board is suposed to b 4. in case ya'll havent noticed this is songmeanings.com. i think this song is about all the fear of kids. \n\r\nbig n black or wut ever ur name is: shut tha fuck up. r u black? cuz if u r ur giving a bad name to all us blacks.\t\t\t\t\n\t\t\t\t\n\n", "comment_370": "\nthey may be sellouts, but you cant deny that this is a really great song and a really great metal riff. end of story.\t\t\t\t\n\t\t\t\t\n\n", "comment_371": "\nmetallica is awsome! my band r gonna play this song cause its kick ass! howeva i read an argument earlier and i have to say that metallica is cool but slipknot is ALOT betta! ur a fool to think otherwise.... this song is about the sandman....oviously\t\t\t\t\n\t\t\t\t\n\n", "comment_372": "\n\"ur a fool to think otherwise\"\n\r\nwho are you to decide what a fool is? then again, seeing as you are one, maybe you'd know...? nah, i'm just kidding. i'm not a fool for not liking slipknot, y'know. but you're not a fool for liking them, either. ;-)\t\t\t\t\n\t\t\t\t\n\n", "comment_373": "\nso good duno how to describe T.T\r\nslipknot fans ur drowning here as this page is for a metallica song \r\nXart this isn't about the sandman ur taking it way too literal =)\t\t\t\t\n\t\t\t\t\n\n", "comment_374": "\nbut being a slipknot fanatic revolving around hate and how stuff sux i doubt u'll see anything past \"this song is about the sandman\" =)\t\t\t\t\n\t\t\t\t\n\n", "comment_375": "\nmike 81 i recommend you listen to \"hooker with a penis\" by Tool\t\t\t\t\n\t\t\t\t\n\n", "comment_376": "\nlook y must slipknot fans and metallica fans fight?\r\nwe metal heads should work togetha against ppl that really suck such as fred durst fans.....or punk fans....... and marco2polo ur comment \"slipknot fans ur drowning here as this page is for a metallica song\" the is completely faulse... r u saying that just because we lyk 2 dif bands that we h8 each otha?? no metal fans should stick 2getha as 1... .i no for a fact that metallica listens to slipknot from an interveiw so shuve that far up ur ass cock suka!\t\t\t\t\n\t\t\t\t\n\n", "comment_377": "\nThis is a great song indeed, but just like Master of Puppets, it gets tooooooo much credit and attention. It is far toooooo overrated and it's like the only Metallica song on the radio next to St. Anger and SKoM. Half the song is the same damn riff. It's way to commercial. \"Metallica\" or \"Black Album\" is still a good cd but it as well is overrated. I'm still a loyal Metallica fan but Ride, MoP, and Justice are thier best CD's. If any songs on \"Metallica\" needs more credit it's God That Failed, Thruogh the Never, Struggle Within and Don't tread on me\t\t\t\t\n\t\t\t\t\n\n", "comment_378": "\nhey havent talked in a while.... yea has anyone else seen \"metallica some kind of monster\" yet? its awseome... but when i watched it some of the scenes showed how james would say something and then was like hey this is a good line for the song. which i thnk is disapointing cuz metallicas older lyrics and stuff...well it actually meant something and the lyrics were based on events and things that actually happened....not just something they made up in there head. but some of there songs now are based on things that actually mean something but im just pointing out that in the movie james said \"some kind of monster\" and then was like hey this is a good line for the song. i dunno i thought that was very disappointing.\t\t\t\t\n\t\t\t\t\n\n", "comment_379": "\nHAHA ive dun it again!! the postings back\n\r\non topic \n\r\nMetallica suck  Rap rules rocks ass and the thing i love is that its the truth :) everyone loves rap. No one cares about rock, they just get banged. \n\r\nBUT\n\r\nlisten to the doves only band who make sense and hav ability to control musical instruments. Unline mettalika. lol or Metal Liker. on topic,\n\r\nMETAL LIKER SUCK\t\t\t\t\n\t\t\t\t\n\n", "comment_380": "\nfear not my friends... fear not... MOTHRAS BACK BITCHES... i know youve all been wondering where i was, well it turns out they decided to ban me without explaination or warning.. well they cant keep me down... and whose ever watching.. i want some explainations here... why in the hell would you ban your most educated and insightful poster on this whole damn site but still let its big and black on here when all he does is spam... mothra has done nothing wrong but bring an amazing amount of his knowledge and grace to a site which needs it badly.. well you can hold me down for long.. MOTHRA IS BACK!! howeever iif i disappear for a while again my friends, please start a riot and demand my reinstatement, they think they can ban mothra when hes not looking!??... anyway... back to this song.. it seems this forums gone to hell without the brilliance i bring to it.. we got talk of genius mathematicans... robots.. 57 year old pervs.. .seems like a great start to a porno if you ask me.. but ive said it before and ill say it again..metallica was great no question about it.. but st. anger really shows the direction of rock in general.. its a sad state my friends..oh yea big and black.. i think your mommas calling you back to the hood.. 50s been shot again, he needs your help, but on a more serious note, im glad you been taking those nigth english classes because you seem to spell and talk alot better now... congrats to you my friend, its good to see someone takin it upon themselves to raise the literacy rate a little!\t\t\t\t\n\t\t\t\t\n\n", "comment_381": "\nwell, welcome back, mothra...if all that sounds like a \"great start to a porno\" you watch some twisted movies...and your \"sad state\" comment? t'is just your opinion, mate, try not to state it as fact. :-P\n\r\nbtw, its big and black, i'd say similar to you but i have suspicions you're beyond hope. and you're right, the doves do make sense. and i like 'em. but it's a little odd to compare the doves, an indie/alternative band, to metallica, a metal band. they may both be rock, but they're astoundingly different.\t\t\t\t\n\t\t\t\t\n\n", "comment_382": "\nSlipknot sucks and in no way compares to Metalicca.\t\t\t\t\n\t\t\t\t\n\n", "comment_383": "\nslipknot is awsome bitches. metallicas good to it all depends on wut u lk.\n\r\nMOTHRA:2 words...... BIG EGO\t\t\t\t\n\t\t\t\t\n\n", "comment_384": "\npinkpony.... 2 words... GAY NAME\t\t\t\t\n\t\t\t\t\n\n", "comment_385": "\nactually moth thast 3 words u dumb gimp\t\t\t\t\n\t\t\t\t\n\n", "comment_386": "\nand oh yeh metallica suck. suck. suck.\t\t\t\t\n\t\t\t\t\n\n", "comment_387": "\npinkpony87: \"first of all to all u ppl who keep posting get a life and stop taking up space\"\n\r\nand yet it seems to me you've posted a second time. not commenting on the song. not that i mind or anything, just pointing it out... :-P\n\r\nand, i guess, you're right. it does depend on what you like...for example, my friend loves slipknot. i don't, but it hardly stops us getting along. ...\n\r\nand its big and black - how in hell is \"gay name\" 3 words?\t\t\t\t\n\t\t\t\t\n\n", "comment_388": "\nblack and big you fuckin dick head raper if you hate it so fuckin much...omg cant even finish...anyways how would you even know metallica if your such a BIG RAPER GANGSTER PERSON WHO by the way no rapers can sing up to the skills of james hetfield...SO GO FUCK YOUR SELF YOU LOSER.\t\t\t\t\n\t\t\t\t\n\n", "comment_389": "\n+ your a little elementary skool kid so fuck off you little twat...check his name\t\t\t\t\n\t\t\t\t\n\n", "comment_390": "\nMOTHRA: thanx thats real sweet of ya. lk u should b talking wut kinda name is mothra.\n\r\nFROZEN: yes i realize this is my 3rd time posting but right now i dont really have a life. sob im. sob. on.sob. probation. waaaaaaaaa :( so im sorry i wuz young and stupid when i posted that.\t\t\t\t\n\t\t\t\t\n\n", "comment_391": "\nMOTHRA: thanx thats real sweet of ya. lk u should b talking wut kinda name is mothra.\n\r\nFROZEN: yes i realize this is my 3rd time posting but right now i dont really have a life. sob im. sob. on.sob. probation. waaaaaaaaa :( so im sorry i wuz young and stupid when i posted that.\t\t\t\t\n\t\t\t\t\n\n", "comment_392": "\nMOTHRA: thanx thats real sweet of ya. lk u should b talking wut kinda name is mothra.\n\r\nFROZEN: yes i realize this is my 3rd time posting but right now i dont really have a life. sob im. sob. on.sob. probation. waaaaaaaaa :( so im sorry i wuz young and stupid when i posted that.\t\t\t\t\n\t\t\t\t\n\n", "comment_393": "\nhahahahaha hey big and black explain to me how gay name is three words???? your a fuckin idiot.. im glad your english has improved but now its time for you to pick up some math courses buddy hahaha oh and pinkpony maybe you are gay.. and im sorry to be politically incorrect.. i mean theres nothing wrong with that, but regardles i much rather have the name mothra... btu hey maybe thats your thing\t\t\t\t\n\t\t\t\t\n\n", "comment_394": "\nAHAHAH u losers actually got annoyed!!! LOSERS\r\nLOSERSLOSERS\r\nLOSERSLOSERS\r\nLOSERSLOSERS\r\nLOSERSLOSERS\r\nLOSERSLOSERS\r\nLOSERS\n\r\nMETALLICA ARE SHIT AND THEY GOT LOSER FANS WHO GET ALL SPASTIC ABOUT SOMEONE RIGHTING THAT!! HAHAHAHA \n\r\nI LOVE POSTING ON THIS SITE :D THX WHOEVER MADE IT!!\t\t\t\t\n\t\t\t\t\n\n", "comment_395": "\nhey thats not vry nice. im not gay i just lk horses and the color pink. so take that and shove it up ya ass bitch. bsides woudnt that be a lesbian idiot\t\t\t\t\n\t\t\t\t\n\n", "comment_396": "\nholy shit another girl! geez i didnt know so many girls loved metallica...\t\t\t\t\n\t\t\t\t\n\n", "comment_397": "\nhaha black and big if i were you id hate this site cause its obviously distracting from your education\t\t\t\t\n\t\t\t\t\n\n", "comment_398": "\neh ? im 20 years old? eh\t\t\t\t\n\t\t\t\t\n\n", "comment_399": "\nthen again i could be 45 years old\t\t\t\t\n\t\t\t\t\n\n", "comment_400": "\nor 99 years old\t\t\t\t\n\t\t\t\t\n\n", "comment_401": "\nmetallica\t\t\t\t\n\t\t\t\t\n\n", "comment_402": "\nhey its black and stupid didnt u say u were 13 in an earlier post u contradicter\t\t\t\t\n\t\t\t\t\n\n", "comment_403": "\nmetallica is one of the best groups out there and this song is one that rocks you socks off!~!\t\t\t\t\n\t\t\t\t\n\n", "comment_404": "\nwow this is like the 400th comment. if u dont know what this song is about by now, well, i dunno. and by the way, i didnt know what i was talking about on my last comment on here, i mean come on, that was like months ago and i was so young and foolish. heh heh. SO what i'd like to say now is that Metallica was the greatest band until the black album, and then it all went downhill. so if you like this song, BAAAAAA you're bad. you need to listen to kill em all, ride the lightning, master of puppets, and jutice for all. cuz those are the greatest albums ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_405": "\nlol number 401. i agree that a lot of their older more classic songs are good, but they still have some good songs from their later albums. i think the meaning of the song is pretty obvious, about nightmares etc, but was also just wondering if anyone knows where the piece of music they play before coming on stage comes from? i heard its from a clint eastwood movie or something?\t\t\t\t\n\t\t\t\t\n\n", "comment_406": "\nits from the good, the bad, and the ugly... haha am i stupid or something?\t\t\t\t\n\t\t\t\t\n\n", "comment_407": "\nyou know some ppl are just so stupid if you are a real metallica fan you like them no matter what so to all you stupid ass ppl who this they have went downhill go suck a cheesy dick because they are the greatest band ever and will always be the greatest band\t\t\t\t\n\t\t\t\t\n\n", "comment_408": "\nhaha! i lyk laughing at \"its black and big\" name! it oviously refering to a cock that shows hes oviously obsesed wif it so it's probly the size of ya dads cock! which is small! bloody idiot go home! go back to the hanson song reveiws and get outta the good music section! \"gay name\".....3 words?? how bout 6 words \"how the fuk does that work\" dam idiot.....\t\t\t\t\n\t\t\t\t\n\n", "comment_409": "\nits a cool song actually, but i dont really metallica much. i do like motorhead alot so i got their version. its much better.\t\t\t\t\n\t\t\t\t\n\n", "comment_410": "\nhahaha its black and big ur a bigger idiot than i thought. ok so ya so sed it was 3 words or w.e.....but then u \"tried\" to cover up ur stupidity by sayin that u meant to do that. were not idiots u loser. i think xart is right.....go back to the hansons page....or while ur at it why dont u say ur bullshit on a backstreets boy page....where ppl might take u serious.\t\t\t\t\n\t\t\t\t\n\n", "comment_411": "\nI'm back bitches! Yeah sorry I haven't posted in awhile but I've just been so God...Damn...Busy! Rahhh! I'm on crack! Not really I'm just happy to be rockin out with ya'll again! And I'm fuckin glad as hell my boy mothra is back on. Hey Mothra! They can't keep you down, fuck no! If they ban you again I'm still gonna email you sure as shit. Damn these fuckin rappers piss me the fuck off. I'm down with some rap and all that but when it's all this nonsense about how much money you have and how fuckin badass you are livin in ur multi-million dollar mansion and you call THAT keeping it real? They all sound the same...same repetitive, annoying-ass chorus and all this business about fucking this ho and that ho and all your money and bling and how many fucking cars you have, and its just like, dude, NO ONE GIVES A SHIT! WE'VE HEARD IT ALL BEFORE! Damn that shit gets on my nerves, I need a smoke, goodbye. P.S.- Have my baby, Mothra!\t\t\t\t\n\t\t\t\t\n\n", "comment_412": "\nlol. well, you cant really have my baby. I'll have urs tho. hahaha. told u im on crack!\t\t\t\t\n\t\t\t\t\n\n", "comment_413": "\nhey guys! can you please look up RANE & post sum thoughts on their lyrics. i'd really appreciate it...thanks!! God bless!\t\t\t\t\n\t\t\t\t\n\n", "comment_414": "\nhey diseased! haha well you gotta get off the crack before we have a baby or its gonna end up dumber than big and black.. but other than that hell yea.. ill enter the sandman... but yea its a big scheme to keep the voice of reason off the site.. well fuck them.. they cant keep mothra down.. mothra will always prevail!\t\t\t\t\n\t\t\t\t\n\n", "comment_415": "\nFuck yeah dude. I'm listenning to enter sandman as we fuckin speak; first time thats happened while I've been on here. It's like a strange time continuum or something i don't know. I have the munchies hella bad and I really want some cheetos. exit light! PEACE!\t\t\t\t\n\t\t\t\t\n\n", "comment_416": "\nfor fuck's sake - the bloody site keeps deleting posts. for god's sake - they're all related to the goddamn song!!! ... sort of!!! either way, it's bloody annoying.\n\r\nif you're reading this, feel privileged! you've managed to read this before it's inevitably deleted! joy!\t\t\t\t\n\t\t\t\t\n\n", "comment_417": "\noh well. they DID only delete 1 of mine. oh well. i don't even know what i said. oh well. \r\nstare at the words \"oh well\" for too long and they begin to look really odd. \r\noh well\t\t\t\t\n\t\t\t\t\n\n", "comment_418": "\nThese lyrics suck shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_419": "\nSuck shit? Never heard that one. But since we're being creative, you suck shit, you shit sucking shit sucker! HAHA, I rock! Ahh... the morons of society with whom I am forced to associate...\t\t\t\t\n\t\t\t\t\n\n", "comment_420": "\nits ok frozen... dont feel bad... atleast tehy didnt ban you without warning or explaination... its all a big coporate scheme to slowly get rid of the intelligence on this board.. ive done some research and it is MTV who is behind it all.. i was starting a rocknroll revolution.. bringint it back from the dead, but they saw it and cut me down before it could get started..but they cant keep me down... im recieving deatht threats.. but ill remain strong.. and so should you frozen.. so should you\t\t\t\t\n\t\t\t\t\n\n", "comment_421": "\n*phew* thanks mothra, i need to stay strong...it's a conspiracy - mtv want to \"dispose of\" all those who listen to music other than pop/r'n'b/hip hop etc. it's like a cult, really. thier message goes something like this: \"JOIN US OR ELSE. YOU CANNOT WIN. NO VARIETY: GOOD. INTELLIGENCE: BAD.\". i got that from an official person at mtv. he seemed strangely robotic, to tell the truth. he said it over and over again, then said \"ERROR, ERROR, CANNOT OUTPUT DATA\" and exploded. there's definitely something going on at mtv.\t\t\t\t\n\t\t\t\t\n\n", "comment_422": "\n\"altho, now the question comes to mind: who is the product of whom?\"\n\r\nHmmm... Makes me think of AC/DC - Who Made Who :D\n\r\nAnyways, this song is definatly Metallicas best... Well, maybe Sad But True is better...\t\t\t\t\n\t\t\t\t\n\n", "comment_423": "\nSomehow I'm reminded of the Nazis and their genocide method; wipe out those who stray from our picturesque view of our \"perfect world\". See, we are what is holding back the commercialistic fuckers (MTV) from maintaining corporate pop and punk rock bliss. We are standing in the way of their fluffy pink candy- coated dreams! And it really chaps their asses! But see, we are what is hard core. We are what have lasted for so long and have stayed so pure and true; not those corporate money-makers and the braindead clones who follow them! NO dammit! We are the new rock revolution! Nothing can hold us down! so hold your lighters in one hand, and sign \"metal\" in the other and keep on rockin' mother fuckers!\t\t\t\t\n\t\t\t\t\n\n", "comment_424": "\nhey my first post here.\r\ni think this cool song is about child molestation. atleast tht's wht i think.\t\t\t\t\n\t\t\t\t\n\n", "comment_425": "\nchild molestation?!! wtf?!! ok....i have to admit, i've never seen it at that angle before, ever. ever. EVER. ...\t\t\t\t\n\t\t\t\t\n\n", "comment_426": "\nAs a few hundred people have already said, nightmares seem to be the largest possibility here. But child molestation... Wow, that actually seems believable to me, although i'm probably just high. Never considered it though...\t\t\t\t\n\t\t\t\t\n\n", "comment_427": "\nno one listen to neologik.. hes not one of us, he has MTV written all over him, hes here to destroy us...\t\t\t\t\n\t\t\t\t\n\n", "comment_428": "\nHey mothra, chill out baby. I say we give him a chance. I say his opinion about the song is very original and VERY possible. Look at the lyrics again~ take my hand; off to never never land; things that will bite...Hey who knows? Some of it fits. I personally think its about childhood nightmares, but a refreshing opinion nonetheless.\t\t\t\t\n\t\t\t\t\n\n", "comment_429": "\nlisten mothra, im not here to have a fight with ne one. just givin my opinion. dont like it? dont read it.\r\nbtw, i play lead guitar for my own band tht covers of many songs, some of metallica songs. so just dont judge ne one. n yeah chill k?\t\t\t\t\n\t\t\t\t\n\n", "comment_430": "\nIt's funny how a lot of you are all \"ooh...look at me, I listen to Metallica I'm so anti-MTV, etc. etc.\"\n\r\nListening to Metallica is not being anti-conformist.  A lot of people listen to Metallica that are nothing but conformists.  Not saying all Metallica fans are, but a lot of people are jumping on the classic rock/metal bandwagon.\n\r\nYou people talk about this band and this song as if these lyrics take so much intelligence and effort to write.  I have seriously wrote more intelligent and meaningful songs in, like, 15 minutes.\t\t\t\t\n\t\t\t\t\n\n", "comment_431": "\nya i dont think its about child molestation but as soon as i read that i looked at the lyrics and its like \" take my hand were off to never never land\" and as soon as i read that tryin to fit this new opinion in it,  it reminded me off michal jackson's lil never never land molestation place.lol\t\t\t\t\n\t\t\t\t\n\n", "comment_432": "\nagree with u lurker it's just tht listening to a song becomes more interesting if u have a personal meaning attached to it. fr all u know this song could have been written in 5 mins.\t\t\t\t\n\t\t\t\t\n\n", "comment_433": "\nThat's true neologik.  I'm not anti-Metallica at all, I'm just saying that I can't stand the way people are claiming to be hardcore Metallica fans and praising them blindly.  Like how people think this song is \"genius\" or something.\n\r\nMetallica have some fucking great tunes though.  This being one of them.  Along with Fuel, Sad But True, Master of Puppets....well, it'd take way too long to name all the good songs, because there's a lot.  It seems the cool thing to do on the Metallica bandwagon these days is hate all their newer stuff and call them sell-outs...well, I wouldn't buy the albums, but there are still some good tunes off Load, Reload, St. Anger, etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_434": "\nI might as well clarify now - I am NOT a \"hardcore Metallica fan\" or anything. I'm more into indie meself, haha. but i don't think you need to be a fan of Metallica to appreciate this song. and, yeah, metallica_fan, you're right - it IS an odd coincidence they happened to say \"never never land\", heh...\n\r\ngoddam it! they keep deleting posts! gosh-darn them!!! GOSH-DARN THEM!!!! GOSH-DARN THEM ALL TO HELL!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_435": "\nYeah, true.  This song is a classic whether you like Metallica or not, there's no denying that.\t\t\t\t\n\t\t\t\t\n\n", "comment_436": "\nahahah this songs a load of donkey shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_437": "\nblackandbig, seriously, from the bottom of my heart, go eat a dick.\t\t\t\t\n\t\t\t\t\n\n", "comment_438": "\nGirls\n\r\nTo lie and snap our piercing tongues\r\nOur unforgiving\r\nSearing, burning, fiery truths\r\nand sinister motives behind \r\nour sweet, sweet smiles\r\nIs nothing but a day in the life.\r\nThe friends we love \r\nAnd love to hate\r\nAnd speak to \r\nlike our blood runs through them\r\nBut speak of\r\nlike our blood boils for them\r\nHave feelings jus the same.\r\nGirls-\r\nThese serpents made of lotion and lipgloss\r\nOf secrets both kept and told\r\nbut sworn \r\nto secrecy;\r\nOf betrayls for boys \r\nAnd hidden jealousy\r\nOf rumors and perfume\r\nAnd beer and hickeys\r\nPut friends and enemies both to shame.\r\nGirls\r\nWho we know we can't trust\r\nbut do\r\nAnd yet, \r\nThe betrayl hurts so bad; \r\nThe knives in our backs accumulate\r\nBut \"sisterly love\" overshadows every puncture.\r\nThe hugs we give and get\r\nAnd endless shoulders there\r\nFor you to cry on\r\nMake everything seem worth it.\r\nThe fun we have and-\r\nRunning all-askew, screaming, driving, cruising\r\nOut late\r\nPhoto opts and funny faces\r\nAmusement park rides and Mountain Dew;\r\nYes-\r\nThese too are what we're made of.\r\nWe; \r\nThese vicious, malicious\r\nsweet-sarcastic, wild liars and speakers of \r\npainful truth;\r\nThese unfaithful, caring\r\nFoolish but daring\r\nHaters\r\nEx-boyfriend daters.\r\nThese lovers and huggers\r\nRock solid and fair-weather\r\nThere when you need 'em\r\nAll-so-predictable\r\nGirls.\r\n totally off subject, but one of my poems. i need some feedback\t\t\t\t\n\t\t\t\t\n\n", "comment_439": "\nmothra, i sent you a pic of me\t\t\t\t\n\t\t\t\t\n\n", "comment_440": "\nthat's really good, diseased :) reminds me of a bunch of people i know...the sort of girls who are too thick to know what half the adjectives mean anyway, hmm\r\ni can never write about anything unless someone gives me a topic first. then i can go on and on - too bad it never makes sense...\t\t\t\t\n\t\t\t\t\n\n", "comment_441": "\nthanx man. I wrote it during chemistry. i don't do jack shit in that class but sit in the back and talk with my girl, flash the teacher during lectures, punch ppl in the back of the head, and, of course, write poetry;)\t\t\t\t\n\t\t\t\t\n\n", "comment_442": "\ni fucking love this song. dont see how anyone cant like it, unless theyre retarded or something. i know people that dont even know who the fuck MetallicA is, and they still like this song. i think its about some kid that has knightmares or something, but im not a very intellegent person. \r\nMetallicA is God!!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_443": "\nthis was the first song i heard from metallica, and it's still the best in my opinion. i think it's about a child who has nightmares. i love the 'now i lay me down to sleep...' part...\r\nROCK ON!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_444": "\nthis song does kick ass and so does slipknot!\t\t\t\t\n\t\t\t\t\n\n", "comment_445": "\nTHIS SONG IS A COVER!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_446": "\nmeateatingorchid wrote:\n\r\n'THIS SONG IS A COVER!!!!!!!!!!! '\n\r\nreally...?    -.-\n\r\nthanks for the xclamation marks really appreciate it.\n\r\nBtw 'diseased and amused' that poem got tears to my eyes, that was the biigest load of shit ive ever read, think u shoud take it to MTV theyd love that. U shoudl be called Disillusioned and Abused, would suit u well. \n\r\noh yeh on topic....metallica suck this song is a load of dogs booollloockkks.....  :D\t\t\t\t\n\t\t\t\t\n\n", "comment_447": "\nfromt he sounds of it most of you dont know who metallica are  :O\t\t\t\t\n\t\t\t\t\n\n", "comment_448": "\nso i wrote this for you,\n\r\nMetallica was easily the best, most influential heavy metal band of the '80s, responsible for bringing the music back to Earth. Instead of playing the usual rock star games of metal stars of the early '80s, the band looked and talked like they were from the street. Metallica expanded the limits of thrash, using speed and volume not for their own sake, but to enhance their intricately structured compositions. The release of 1983's Kill 'Em All marked the beginning of the legitimization of heavy metal's underground, bringing new complexity and depth to thrash metal. With each album, the band's playing and writing improved; James Hetfield developed a signature rhythm playing that matched his growl, while lead guitarist Kirk Hammett became one of the most copied guitarists in metal. Lars Ulrich's thunderous, yet complex, drumming clicked in perfectly with Cliff Burton's innovative bass playing. After releasing their masterpiece Master of Puppets in 1986, tragedy struck the band when their tour bus crashed while traveling in Sweden, killing Burton. When the band decided to continue, Jason Newsted was chosen to replace Burton; two years later, the band released the conceptually ambitious ...And Justice for All, which hit the Top Ten without any radio play and very little support from MTV. But Metallica completely crossed over into the mainstream with 1991's Metallica, which found the band trading in their long compositions for more concise song structures; it resulted in a number one album that sold over seven million copies in the U.S. alone. The band launched a long, long tour which kept them on the road for nearly two years. By the '90s, Metallica had changed the rules for all heavy metal bands; they were the leaders of the genre, respected not only by headbangers, but by mainstream record buyers and critics. No other heavy metal band has ever been able to pull off such a trick. However, the group lost some members of their core audience with their long-awaited follow-up to Metallica, 1996's Load. For Load, the band decided to move toward alternative rock in terms of image -- they cut their hair and had their picture taken by Anton Corbijn. Although the album was a hit upon its summer release -- entering the charts at number one and selling three million copies within two months -- certain members of their audience complained about the shift in image, as well as the group's decision to headline the sixth Lollapalooza. Re-Load, which combined new material with songs left off of the Load record, appeared in 1997; despite poor reviews, it sold at a typically brisk pace through the next year. Garage Inc., a double-disc collection of B-sides, rarities, and newly recorded covers, followed in 1998. In 1999, Metallica continued their flood of product with S&M, documenting a live concert with the San Francisco Symphony; it debuted at number two, reconfirming their immense popularity.\n\r\nThe band spent most of 2000 embroiled in controversy by spearheading a legal assault on Napster, a file-sharing service that allowed users to download music files from each other's computers. Aggressively targeting copyright infringement of their own material, the band notoriously had over 300,000 users kicked off the service, creating a widespread debate over the availability of digital music that raged for most of the year. In January 2001, bassist Jason Newsted announced his amicable departure from the band. Shortly after the band appeared at the ESPN awards in April of the same year, Hetfield, Hammett, and Ulrich entered the recording studio to begin work on their next album, with Hetfield lined up to handle bass duties for the sessions (with rumors of former Ozzy Osbourne/Alice in Chains bassist Mike Inez being considered for the vacated position). In July, Metallica surprisingly dropped their lawsuit against Napster, perhaps sensing that their controversial stance did more bad than good to their \"band of the people\" image. In late summer 2001, the band's recording sessions (and all other band-related matters) were put on hold as Hetfield entered an undisclosed rehab facility for alcoholism and other addictions. He completed treatment and rejoined the band and they headed back into the studio in 2002.\t\t\t\t\n\t\t\t\t\n\n", "comment_449": "\nnice pics diseased, a little teasing but nice.... oh and big and black.. who are you foolling... we all know you cant write that well\t\t\t\t\n\t\t\t\t\n\n", "comment_450": "\nOh...oh, YOU wrote that, its big and black? Now, that's funny, really funny, because, not only is that exact passage on tons of pages on the Internet - including this: music.yahoo.com/… - but it also says it's copyright \"Stephen Thomas Erlewine & Greg Prato, All Music Guide\" and written by \"Stephen Thomas Erlewine\". Shocking coincidence or what? \n\r\nHeh, seriously though, that \"i wrote this for you\", that WAS a joke anyway, right?\t\t\t\t\n\t\t\t\t\n\n", "comment_451": "\nhi ppl! ok i know this has nothing to do w/ mettalica and might br considered spam but there is this song that has been bothering me and i dont know the name or astist.\n\n\r\n....... and all i know is revenge is sweet when you know that you are worthless and i confess..... the games you that play princess and you always win (this time i win).........i'll take you to the top of a building and push you off..... all i know is your cute when you scream.....\n\r\nif you know the name of the song please help or i wont be able to rest\t\t\t\t\n\t\t\t\t\n\n", "comment_452": "\n\"you're cute when you scream\" senses fail\r\ni only said that because iknow peoples whos lifes have fallen apart for lack of rest\n\r\nclearly this song is about gay sex, James Hetfield is announcing he's gay and how he wants to enter a man covered in sand, the sandman, Tuck you in, warm within (his crack)\r\nKeep you free from sin (by wearing a sheath)\r\nTill the sandman he comes , (can't see an innuendo here)\r\nHeavy thoughts tonight \r\nAnd they aren't of snow white (no they're of the seven dwarfs) Exit: light \r\nEnter: night (he's so slow that days pass between repetitions)\r\nIn short I think its quite a sweet love song\r\nHush little baby, don't say a word \r\nAnd never mind that noise you heard \r\nIt's just the \"beasts\" under your bed, \r\nIn your closet, in your head(!) \r\nI rest my case I really do\n\r\nor it could be about war and corruption, or whatever\t\t\t\t\n\t\t\t\t\n\n", "comment_453": "\nPoison The Well > Metallica\t\t\t\t\n\t\t\t\t\n\n", "comment_454": "\nHAHAHA!!! fuck when i read that big long thing that its black n big wrote i knew right away that the loser copied n pasted that. god its black n big r u a moron?....did u decide to  teach a bunch of metallica fans, metallicas history?! fuck i cant say everyone on this page, but im sure there is some of you (including myself) who knew that shit like the back of there hand. hahaha \"its black n bigs\" comments are getting pretty pathetic.\r\nMETALLICA \\m/   \t\t\t\t\n\t\t\t\t\n\n", "comment_455": "\nha ha i think black n big said that he'd written that as a joke so those of you who think that he meant it seriously are pretty stupid\t\t\t\t\n\t\t\t\t\n\n", "comment_456": "\nHA HA HA I'm still laughing you dumb metal heads\t\t\t\t\n\t\t\t\t\n\n", "comment_457": "\nall due respect here...but chocolate, what the hell are you on about?\t\t\t\t\n\t\t\t\t\n\n", "comment_458": "\nno respect necessary, i'm a cackling fool\n\r\nBut my comment earlier about how this song was sexual illustrates my point that not all innuendos are intended.\n\r\nactually i'm laughing at metallicafan and mothra for thinking that black n big was trying to seriously persuade people that he'd wrote that, rather than just putting it in as a slightly lame joke.\t\t\t\t\n\t\t\t\t\n\n", "comment_459": "\nWOW, chocolate! Did you figure that out all by yourself?! I gotta say, I am impressed. It's amazing how stating the obvious can arouse such a sense of self worth and accomplishment in a complete and utter ignoramus such as yourself. I'm also going to go out on a limb here and hypothesize that ridiculing an incredibly talented and skilled musician also makes you feel like some sort of a comic genius? Hmm? Am I getting warmer? Or maybe by insulting our taste in music (this goes to you too, black and big, you fucking moron) you think that somehow we will somehow want to seek your advice on what we should listen to, because obviously you are SO MUCH MORE INTELLIGENT THAN US??? I mean, tell me, what did you hope to accomplish here? You've succeeded in making a complete ass out of yourself, and no, we won't budge on what we listen to and will continue to listen to, and I personally don't feel any worse about any of it. So pat yourself on the back. Mission accomplished, you twinkle-toed fuck! But anyways, what do I know? I'm just a dumb metal head...\t\t\t\t\n\t\t\t\t\n\n", "comment_460": "\nTeasing, hmm? Is that a good thing? lol. Well anytime, Mothra;)\t\t\t\t\n\t\t\t\t\n\n", "comment_461": "\n\"i am impressed. It's amazing how stating the obvious can arouse such a sense of self worth and accomplishment in a complete and utter ignoramus such as yourself.\"\n\r\nI sense some sarcasm here.  Anyway its not stating the obvious, I've been on the board and seen far to many examples of really good songs being turned into meditations on drugs and sex, by stupid interpretations.  I knew what I was doing when i posted that, and I was arguing a point which I think is fairly important, since it must suck to write a good lyric and then have it simplified like that.\n\r\nI don't hate metal music, I have this cd and about 15 other metal cds, so you're completely misguided to say that.\n\r\nMy criticism of the ridiculously low intelligence of the people who thought black n big wasn't joking, still seems fair to me.  If you've seen Some Kind of Monster then you will know that James Hetfield himself would have reacted in the same way in the same situation.  I wasn't ridiculing him personally, so rest assured on that.  The first thing you notice when you go on this board is that people criticise each other, a lot, most people leap in and make the kind of remarks that i was making. Actually, in a way i was sticking up for black n big because not everyone on this board is a huge expert on metallica so that was actually fairly interesting.\r\nI'm not calling everyone here a dumb metal head, just two people , one of whom seemed to react in a very intolerant way...\r\nA lot of people I know who like metal, refuse to listen to any other genre of music because its not hardcore enough, which is stupid, or else they deliberately fill a large amount of their cd collection with metal to prove that they're cool.  This is what makes someone a 'dumb metalhead', I was commenting like this in an effort to open peoples minds. Obviously, there's a chance I could be wrong and you feel totally confident in yourself to have collections that comprise multiple queen or elton john cds .  You feel no need to consiciously choose more heavy music than quiet.  You don't argue which bands are 'heavier' than others. And that you don't take the piss out of people who don't listen to heavy music. In MY experience, and thats all I have to go on, out of people i've met in the real life who reckon they're 'big fans' of metal, 90% would do at least one of these things.  I apologise if this doesn't apply to you, and I don't want to start an argument because I've found that when you exchange really long posts then it is no fun, and becomes stupid.\r\nI apologise for my gay sex interpretation, I've read it and its not funny at all.\r\nI was assuming that most of you really like the genre of heavy metal and will have irrational prejudices against quieter music, i could be wrong but that would mean that i've been subject to a large string of coincidences in my life.\r\nClearly you're not dumb, diseased because you use words like \"hypothesize\" and \"ignormaus\" and even \"twinkle-toed\" so I won't try to argue with you calling me a loser, you also seem fairly nice until you started calling me a twinkle-toed fuck, but I protest that I'm not as thick as you think.\t\t\t\t\n\t\t\t\t\n\n", "comment_462": "\nI apologize for that; I was seriously having the shittiest day yesterday, dude. God, I try to stray from lashing out at people as much as possible, and here I go lashing out at you... But that is the problem with making assumptions. Yes, I do listen to many different genres of music, and I am not one of these people who criticize rock that is not \"hardcore\" enough for my standards. Metal and hard rock are just a preference of mine. It's true also that I am a nice person and I didn't mean to represent myself as anything but that. Im out. PEACE!\t\t\t\t\n\t\t\t\t\n\n", "comment_463": "\nI know I\\'m going to be killed for saying this but I think this is by far one of tallica\\'s most overrated songs. Having said that I love Metallica, they have good songs on all of their albums, but TBA and after I don\\'t enjoy as much as first four.\t\t\t\t\n\t\t\t\t\n\n", "comment_464": "\ngreat song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_465": "\nAh, the mood's gone back to...er...\"mellow\"?\n\r\nI still don't know why I continue to post on this board - I'm hardly a metal head (dumb or otherwise...ha, I'm so witty!), but, as it happens, I do now have this song on a CD that my bro made for me. I asked him for 20-odd songs, and this was number 6. :-)\n\r\nThe more I listen to it, the angrier it sounds (not in a bad way, mind you). And it's odd how people have said this song sounds like: a nightmare, a knightmare (2nd post on this page - gotta love those typos), a fairy story (ahem), gay sex, child molestation...to name but a few I remember. To be completely honest, I really don't know what this song is about anymore, it could be any of the above as far as I can tell now. Tis all very confusing.\t\t\t\t\n\t\t\t\t\n\n", "comment_466": "\nclassic song!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_467": "\ndo cat's have penises?\t\t\t\t\n\t\t\t\t\n\n", "comment_468": "\nHush little baby, don't say a word \r\nAnd never mind that noise you heard \r\nIt's just the beasts under your bed, \r\nIn your closet, in your head \n\n\r\nmy favorite part!\t\t\t\t\n\t\t\t\t\n\n", "comment_469": "\nby BlackHoleson on 04-05-2005 @ 03:15:35 PM  \r\ndo cat's have penises?  \n\r\nHAHAHAHAHA..LMFAO *high fives* That was one of the most random and annoying things that I've ever read on the internet..or..not..but it was funny! :D\n\n\r\nBTW...Great song...amazing....This is the best metallica has to offer, and judging by St. Anger...there not making a comeback\n\r\n~Vampy\t\t\t\t\n\t\t\t\t\n\n", "comment_470": "\nIs anyone aware if this is a cover song of metallica.  I have a version done by motorhead, and since they came before metallica i wasn't sure who had done this song first.  Any help is greatly appreciated.\t\t\t\t\n\t\t\t\t\n\n", "comment_471": "\ncats have penises, but they're so small that they're not worth talking about. Blue whales on the other hand WHOOAH!  What i'd give to be a gay blue whale.\t\t\t\t\n\t\t\t\t\n\n", "comment_472": "\n\"Mummy, where do kittys come from?\" / \"Well, dear, when a mummy cat and a daddy cat love each other very much...\"\n\r\nI have a friend who's a gay blue whale. Or so he says. I'll ask him to get back to you. :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_473": "\nsounds lush if you ask me\t\t\t\t\n\t\t\t\t\n\n", "comment_474": "\nlol i've just got it, metallica and they're a metal band. its a pun on the genre. Metallica are fucking geniuses they're one of the best fucking bands of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_475": "\nanyways stop posting on here we want i cum blood to be top of the most visited\t\t\t\t\n\t\t\t\t\n\n", "comment_476": "\npalmerules the metallica version is the original, but apparently i thought that the question about cat penises was more urgent\t\t\t\t\n\t\t\t\t\n\n", "comment_477": "\nwhat's their best song btw? i've got master of puppets and the black albums.\t\t\t\t\n\t\t\t\t\n\n", "comment_478": "\nA little hypocritical, isn't it chocolate? ... I mean, you want us to stop posting here, yet you've posted ... how many times? :P\n\r\nAh well.\n\r\nDunno what they're best song is, in fact I've barely heard any Metallica songs. Just a few they play on the radio, like this. I don't even buy/download albums much at all - alls I gots is Franz Ferdinand, Turn On The Bright Lights and Antics by Interpol, and, er, Hopes And Fears by Keane, which I never actually LISTEN to...plus a CD my bro made for me. That's alls I gots - bro, on the other hand, has millions, so I just borrow his...\n\r\nI'm sure that you are now all enriched having learnt about my CD collection. Now, thank me for the nice lesson you have received here today.\t\t\t\t\n\t\t\t\t\n\n", "comment_479": "\nthanks frozen in fire\t\t\t\t\n\t\t\t\t\n\n", "comment_480": "\nthis song sucks now. i liked it at first but evidently this particular song has sold out just like a fucking crapyass rap song. way to go 19 full pages of posts. and shit on the black album isnt considered old metallica. everything up to ...and justice for all is old. black album was okay but nothing like there old stuff. and its to commercial.\r\nim sure ill get an angry nu-metal kid within minute, to post an angry message bout how he thinks im wrong...which im not. anyway this song sucks\t\t\t\t\n\t\t\t\t\n\n", "comment_481": "\nyou suck listen to linkin park\t\t\t\t\n\t\t\t\t\n\n", "comment_482": "\nno i was outside the minute\t\t\t\t\n\t\t\t\t\n\n", "comment_483": "\nThat was just sad, chocolate...look at the number of posts you've had on ONE page....Uhm, your pathetic. I've only had 2 :D. Uhm, one thing to SisterFister (interesting name...) I don't see how you can say it sucks just because it obviously did well...19 pages of posts meaning it's popular. I mean, if you liked it at first how should the fact that so many other people like it stop you from liking it?\n\r\n~Vampy\t\t\t\t\n\t\t\t\t\n\n", "comment_484": "\nfuck you 'vampirella', who are you to say whats sad or not\t\t\t\t\n\t\t\t\t\n\n", "comment_485": "\ndo you know whats really sad?\r\n1) signing all your posts 'vampy'\r\n2) insulting people who you know nothing about\r\n3) being nowhere near as funny as frozen in fire\r\n4) thinking this is metallicas best song\r\n5) finding the name sisterfister interesting\r\n6) virtualfactor come to my assistance please\r\n7) thinking that st anger is no good\r\n8) being ignorant of cat sexuality\r\n9) this list is crap\r\n10) i'm not as retarded as you\t\t\t\t\n\t\t\t\t\n\n", "comment_486": "\nthanks, she's really getting to big for her boots\t\t\t\t\n\t\t\t\t\n\n", "comment_487": "\n'vampy' now thats pathetic, how do you come up with rubbish like this i see this isn't the first time you've called some one sad\t\t\t\t\n\t\t\t\t\n\n", "comment_488": "\nare you going to church tommorow then?\t\t\t\t\n\t\t\t\t\n\n", "comment_489": "\nyeah, sorry where did you want me to speak you\t\t\t\t\n\t\t\t\t\n\n"}