{"comment_0": "\nThe song's meaning in a nutshell:\n\r\nYou are rare, unique, and beautiful (You're a fallen star).  You are the one who gets me out of trouble (You're the getaway car).  You are the one who keeps me from transgressing the appropriate boundaries (You're the line in the sand/When I go too far).  You are the one who gives me relief from my discomfort and my problems (You're the swimming pool/On an August day).  You are the one who makes me feel like I'm intelligent and clever (And you're the perfect thing to say).\n\r\nYou pretend that you are less than the amazing girl that you are, but deep down you know better.  I find this very attractive.  You can tell how I feel about you and how much I love you.  You know the affect that merely being who you are has on me.  You can see this in my eyes (And you play it coy/But it's kinda cute/Oh when you smile at me/You know exactly what you do/Baby don't pretend/That you don't know it's true/'Cause you can see it when I look at you).\n\r\nYou are fun to be around and make me feel like a kid again (You're a carousel).  You make me feel hopeful about the future (You're a wishing well).  You turn me on and make me feel good about myself (And you'll light me up/When you ring my bell).  You are someone that, regardless of your wonderful qualities, I admit that I do not fully understand.  Because of this you intrigue me and captivate my attention all the more. (You're a mystery/You're from outer space).  I think about you all the time and I care more about you than anything else (You're every minute of my everyday).\n\r\nIt is unbelievable, given who you are, that you love me too.  That I get to be together with you (And I can't believe that I'm your man/And I get to kiss you baby just because I can).  Our love is so strong, so deep, so powerful, that any problem we have in the future can be overcome (Whatever comes our way/We'll see it through/And you know that's what our love can do).\n\r\nThese are tough times.  Times that tend to make one not feel special, not feel unique, not feel in control, not know what one's limits are, not feel safe, not feel intelligent, not feel hopeful, not feel that one is able to relax and have fun, not feel excited, not feel able to connect to the mystery of life, not feel like one is able to have something to which one should dedicate oneself. (And in this crazy life/And through these crazy times)  It is my love for you that gives meaning and purpose to my life.  This song that I sing, all the songs that I sing, every line I say, every word I utter, all that I am is imbued, is inspired, is made wonderful by you.  You are the real song and the song that I am singing and its words are merely a reflection of you.  It is you, who you are, that is the greatest thing in the world.  My song is merely my attempt to \"sing along,\" to join in revealing the incomparable person that you are and the transforming affect that you have on my life (It's you, it's you/You make me sing/You're every line/You're every word/You're everything/You're every song/And I sing along/'Cause you're my everything).\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\noooh, i so love this song.\r\n'and i can't believe that i'm your man, and i get to kiss you baby just because i can'\r\nloveee that line! and his voice is amazing.\r\nloveit! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthe jazz king has returned! [not that he was gone, i just wanted to say that] love the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni love it! upbeat love songs are always great and he does a great job with it! i want someone to sing this to me :).\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nSimple, but pure I like it.. a song of metaphors for a special someone that is everything to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nthis song has such a vibe in it... makes you happy even if you're not... what can you ask more out of it? :)\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nCan I just say that Mr Buble has the most gorgeous smile in the world. I melt. His voice is pretty awesome too. The lyrics are pretty self explanatory. YOU'RE MY EVERYTHING!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nA very happy song that you fall in love with the very first time you hear it. a song to definetly put you in a wonderful mood. I love michael buble!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ngosh, michael buble's voice is so amazing.. i will love every song he sings, especially this one.. it's just simply amazing, a love song.  he does such a great job of showing love as something so amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nwow. what an upbeat optimistic song. i really like it. :]\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ncutest song ever.\r\nhis voice is the most amazing sound i've ever heard come from a male. \r\nwow. \r\ni'm totally in love with this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\n\"and I can't believe that I'm your man.\"\n\r\nso sweet :)\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthis song is so cute.  i never was a really big michael buble fan, but this is just such a nice little song.  how can you not like it?\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis is the kind of song that any man would be well-advised to sing to the woman he loves. It is utterly romantic and brilliant without being too cheesy to bear. \n\r\nBeautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ni agrre with our hearts desire.. it's a great love song but not in any way cheesy.. it's the best on the cd..\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nits cool the way he uses his words. like he makes comparisons that are so unusual but so beautiful. you can't help but hear this song and smile and laugh.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis song is adorable. Every girl wants a guy to sing something this sweet yet simple to her. I love the part where he sings: \r\n\"And I can't believe that I'm your man, and I get to kiss you baby just because I can.\"\r\nIt's so sweet ... and this is how it really feels to be in love. You're on top of the world. I love the upbeat vibe.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI love Michael Buble anyway, because I've been swing dancing for 2 years now.  I especially love \"When you smile at me, you know exactly what you do.\"  It's true.  It's definitely the idea of, \"You know you're going to get away with this, don't you?\"\n\r\nAnd someone did sing this song to me.  And I was liquid jello.  So take notice men:  Michael Buble is a god.  And you should all follow his example.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nMy two favorite lines:\n\r\n\"You're the line in the sand when I go too far.\"\r\nI love it because I am that kind of guy that tests his limits.  I push people's buttons, see what rules I can break, I pick and I prod.  I love having a girl that can just give me that loook that lets me know I have stepped out of line, that she is disappointed.  I don't like being told what to do, but I love knowing that there is someone that wants me to act right.\n\r\n\"And you play it coy but it's kinda cute\"\r\nI love the mystery of a girl... I like the not knowing.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nthis is such a great love song its just powerful and the lyrics are amazing and its just such a great song i really can just bust up the music and dance to it but instead im writing here soo yeah this song is awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI love dancing to this song, even if no one will dance with me. It's so sweet and optimistic, it's hard not to fall in love with it.  \n\r\nI've never had this song sung to me, and I don't expect it to. All guys are asses until they get into an old folks home and asking for oatmeal. But it's still nice to dream...\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nSuch a beautiful song... and well, as you can tell, it's about being everything to someone. Have to agree that this is the perfect song to sing to a girl, it's just really sweet without being cheesy!\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nMy boyfriend sent me the lyrics to this song and i instantly loved it - found out who it was by and listened to it and fell in love with his voice.\n\r\n\"And in this crazy life\r\nAnd through these crazy times\r\nIt's you, it's you\"\n\r\nEeee makes me feel all warm and fuzzy on the inside to know that this is how my guy feels about me.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI dunno, I just feel as if he was able to finally put words to what, I dont know about other guys, but I feel when I think of my girlfriend. Even when we argue. When I hear this song, I just cant help but think of all of the great things about her.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nHeard this song one Sunday morning on my way to church and couldn't wait to get back home to download it. Absolutely love it. The song is just a very tasteful way of appreciating the one you are with.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nLove this song...the only (to this date) single I like from this Michael Buble....quite a perfect wedding song....hahaha....\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ni wish someone could feel that way about me\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nGosh this song is fantastically cute.\r\nSeriously, how could you not love it.\r\nIt's the butterflies in the stomach.\r\nIt's the over the moon...\r\nMore than all the fishes in the sea...\r\nAnd every star in the sky kind of love song.\n\r\nIt's not too much of anything, but more than enough.\n\r\nPerfect, upbeat love song.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis song is one of my favorites. especially the last part of the chorus.. \"You're every song... and i sing along... coz you're my everything..\"\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthis song means simply that they're completely in love and that person means everything to them. Although this song isn't a deep song, it is so touching and if u feel this about someone, it must be one of the best things in the world. \r\n\"i get to kiss you baby just because i can\" it's so remarkable how just that line can touch someones heart so fast \r\nsoooo cute =]\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nLove it. So good! It's the perfect love song. \r\nThe lyris are so good, and his voice is melting! \r\nBrilliant song!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\naww it is just sooo gorgeous! \"and i get to kiss you baby just because i can\" That is cute as!\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI sing this to my daughter as a lullabye...\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nwould anyone sing this song to me??\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\ni love this song : )\n\r\nit's so simple yet it just makes me smile when I hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nCute! (:\r\nWish somebody would sing this to me, haha\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis whole song makes you wanna find the perfect somone who is your everything. The whole song makes you not want to give up on love.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI love this song.... This song means to me everything he was. I really miss him. =[\r\nIf we ever get back together I want this to be our song. :]\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nisn't it \"and you light me up, when you ring my bell?\"\r\nthat's what i hear.\n\r\nthis song is so perfect.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI love this song! Michael Buble is cool! \t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nlove this song but reminds me of a girl who i can't be with, we was \"together\" in secret for a few months and it was just like this song, even when i post it on fb from youtube she likes the song, just a reminder of older times\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nShe is smart (bright), and beautiful on the inside and out which guides him through the dark times and reassures him that she has his back (You're a falling star/ You're the get away car). She is his role model and sets the bar high for appropriate behavior, but she reminds him every once in a while right before he pushes the limit (You're the line in the sand when I get too far). She makes him feel relieved from all the stress he has had building on him which in return makes him feel rejuvinated and refreashed (You're the swimming pool, on an August day). He only sees her as being immaculate and absolutely flawless; No one compares to her (And you're the perfect thing to say).\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nSo the song is very effective at capturing the emotion of being enamored with a girl.\t\t\t\t\n\t\t\t\t\n\n"}