{"comment_0": "\nMy son was only 15 Ã\u0082Â½ years old in 1997 when his father died of heart disease just before Christmas.  At the time, he was learning to play an acoustic guitar.  Soon after his fatherâ\u0080\u0098s death, he discovered â\u0080\u009cMetallicaâ\u0080\u009d and â\u0080\u009cFade to Blackâ\u0080\u009d.   For weeks, I could hear him (alone in his room), learning to play â\u0080\u009cFade to Black â\u0080\u009c.  It didnâ\u0080\u0099t take him very long.  â\u0080\u009cFade to Blackâ\u0080\u009d played by a grieving teenager on an acoustic guitar is music straight from the heart. \n\r\nThe lyrics of â\u0080\u009cFade to Blackâ\u0080\u009d, more than likely, have different meanings for different people.   For my son, I believe the lyrics of â\u0080\u009cFade to Blackâ\u0080\u009d are about grieving and learning about oneâ\u0080\u0099s own mortality.   \n\r\nâ\u0080\u009cLife it seems will fade away, Drifting further every dayâ\u0080\u009d - Realizing people WILL & DO die!  And, that someday you will die too!\n\r\nâ\u0080\u009cGetting lost within myself, Nothing matters, no one elseâ\u0080\u009d - Dealing with oneâ\u0080\u0099s own feelings about the loss of someone they love deeply.\n\r\nâ\u0080\u009cI have lost the will to live, Simply nothing more to giveâ\u0080\u009d - Not wanting to go on living without the one you loved, if it means continuing to feel almost unbearable sadness.\n\r\nâ\u0080\u009cThere is nothing more for meâ\u0080\u009d - Thinking you will never be able to enjoy living again without your loved one in your life.\n\r\nâ\u0080\u009cNeed the end to set me freeâ\u0080\u009d - Thinking you will feel this way for the rest of your life.\n\r\nâ\u0080\u009cThings are not what they used to be, Missing one inside of meâ\u0080\u009d - Not feeling like the same person you were before you lost the person who was a part of who you were.. and missing them.\n\r\nâ\u0080\u009cDeathly lost, this can't be real, Cannot stand this hell I feel.  Emptiness is filling me\r\nTo the point of agonyâ\u0080\u009d - Wanting your mind to deny that your loved one has died, then facing reality and knowing it  is true and feeling agonizingly sad and lonely.\n\r\nâ\u0080\u009cGrowing darkness taking dawn, I was me, but now He's goneâ\u0080\u009d - Looking toward the future, knowing you will be a different person because the person you loved was part of who you were and is now gone.\n\r\nâ\u0080\u009cNo one but me can save myself, but its too late.  Now I can't think, think why I should even tryâ\u0080\u009d - Knowing it is up to yourself to go on without your loved one, but not sure you can.\n\r\nâ\u0080\u009cYesterday seems as though it never existed.â\u0080\u009d - Trying to remember how you felt before your loved one died.  \n\r\nâ\u0080\u009cDeath Greets me warm,â\u0080\u009d - Feeling dead even though you are still alive.\n\r\nâ\u0080\u009cNow I will just say good-byeâ\u0080\u009d - The most uplifting part of the lyrics. Being able to say â\u0080\u009cGoodbyeâ\u0080\u009d to your loved one and go on living without him or her.\n\r\nChristmas 1999 (2 years after my husband died), I bought my son a Kirk Hemmett electric guitar and amp system.  Anyone hearing him play â\u0080\u009cFade to Blackâ\u0080\u009d would think Metallica was in the house!  In my mind, my son is the greatest guitar player the world will NEVER hear!  And when I hear him play â\u0080\u009cFade to Blackâ\u0080\u009c,  I know he is remembering his father.  \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nWell this song was acually was inspired by when someone stole the band's equipment, but the song is about suicide and Metallica has gotten thousands of fan letters from people who decided not to kill themselves becuase of this song. This is one of my favorite songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIt says in the biography of metallica that it the lyrics were made from the last words of a confessional of a suicide victim.  I got this straight from  Metallica Unbound, which is a biography written by a close friend of James. I personally love the song and the lyrics are good to listen to when your going through rough times.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nJesus H Christ!!!!!! We all know that this song is about suicide, but what every one should be talking about is the whole deep down meaning behind the lyrics. This song ain't just about suicide, it's about expressing the thoughts of someone who is thinking about killing himself. A man who is lost in himself and not in the real world. Everybody thinks about suicide when the outside world is beating you down. This is about his own self beating him down and he doesn't know how to cope with it. The lyrics really get inside of the head of a sad and lonely man who lives only in his own head and cannot deal with his own insanity and finds the one true way out. Suicide. Damn people look a little bit deeper into the lyrics and what they are saying to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n\"Growing darkness taking dawn, I was me but now He's gone.\"  - I think that's such a beautiful lyric and a great way for Jaymz to illustrate the change that has occured in him.  \r\nto Metallican41:  I think you should think before you type especially on a mesage board full of Metallica fans, because you saying that their lyrics are weak is the most ignorant thing I've heard in a while.  Unless you're a 13 year old TRL watching kid and the only Metallica songs you know are the ones they play on the radio and MTV late at night, then I can see why you'd say that their lyrics are not dense.  It's easy for someone who doesn't really know Metallica to make that generalization, but in reality Metallica has some of the most thought-provoking and emotion filled lyrics of any recent band, let alone a metal band that fucking rocks.  \r\nEverything off ...And Justice For All is packed with great lyrics about the corruption of the US government it's justice system, etc.  In addition, songs like Disposable Heroes, Don't Tread On Me, and For Whom The Bell Tolls have distinctly anti-war messages (the true sign of an intelligent man because for a long time I was an ignorant patriotic kid until thing like Metallica, Rage Against the Machine, System of a Down, Carlos Castaneda, Chuck Pahlaniuk, and Joseph Heller allowed me to open my mind).  Metallica's songs point out the problems in our world that most people are too ignorant to see, and songs like Fade To Black and One convey emotion like no other band can.\r\nI'm not trying to come down on you hard, but just think and have proof to back up statements such as Metallica not having good lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song was wrote after there equipment was stolen.. Whether or no that was the reason they wrote it about that only theyll know but its one of there best songs in my book.. Had a hard time awhile back and this song was played out in my car.. Helped me get through it.. GREAT SONG!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nHey guys. I always like to talk about my interpretation of this song. I know it's written with his amp in mind. I know it's obviously about terrible sorrow that makes someone not only strongly consider suicide, but probably go ahead and attempt it, with a suicide note and all. And those undertones influence my interpretation. However, i always look at it differently, and i hope i can at least get someone to say \"wow, i never saw it like that, not bad,\" whether or not you particularly agree. \n\nTo me. this song is about someone who has gone through terrible, horrific pain and strife in their life, and has lost themselves and become someone, or someTHING else. I like to tell a very general, basic story, verse by verse, when i discuss this song. So please take the few minutes and come along on this ride..\nLife, it seems, will fade away\nDrifting further every day\nGetting lost within myself\nNothing matters, no one else\n--life as this person has known it, is fading away, and will soon be gone. Every day he wakes up, realizing that things have piled up, and he's one big tragedy away from completely losing himSELF, his MIND, EVERYTHING. All the crap that has been happening and piling on is causing a change, his mind races, and he's getting LOST within himself, his feelings, his thoughts. The last line speaks for itself--nothing matters anymore, no one matters anymore. Right about now, this is the straw the broke the camels back. There's no turning back\n\nI have lost the will to live\nSimply nothing more to give\nThere is nothing more for me\nNeed the end to set me free\n--Perhaps his/her spouse left them. Perhaps a loved one is gone. Perhaps he lost everything in tragedy...whatever it is, he cannot go on anymore. He sees nothing but despair, it's hopeless. He cannot give anything anymore, for anyone. He needs to be free, but it all needs to end--the pain, the tragedy, perhaps even his own life; but it doesnt have to be suicide. Life as he KNOWS IT needs to end, so he can be free again.\n\nThings not what they used to be\nMissing one inside of me\nDeathly lost, this can't be real\nCannot stand this hell I feel\n--he's reminiscing now, seeing that life isn't what it was for him. The change is permanent. The one inside of him, who he WAS, who he THOUGHT he was, is gone.  He's lost himself so much, it feels like death; the death of himself. It's surreal, in a bad way though of course. He cannot take it anymore; whatever tragedy has brought him to this point, is truly HELL. \n\nEmptiness is filling me\nTo the point of agony\nGrowing darkness taking dawn\nI was me, but now he's gone\n---the void left by this final straw of pain has left him no longer himself, and completely empty. People throw the word \"agony\" around, but he realizes this final pain is COMPLETE, true agony. Now that he's lost himself, he's become this \"someone/someTHING\" else, he realizes this is becoming his new self. And it's dark. Notice how the last line in this verse switches to the 3rd person---\"i WAS me, but now HE'S GONE\"....the transformation is complete. The pain, the AGONY, the HELL that he's living in caused a complete breakdown, a new \"being\" is formed...he knows that the old him is DEAD. There is someone else inside. That man no longer exists. It's only this new one. Perhaps he pushed for this new person that grew inside of him, as an escape from the pain. In essence, he has killed his former self, i.e. the suicidal tones of the song at it's first layer.\n\nNo one but me can save myself, but it's too late\nNow I can't think, think why I should even try\nYesterday seems as though it never existed\nDeath greets me warm, now I will just say goodbye\n--he realizes that it's over. His former self, the man he was is gone, and although he MIGHT'VE been able to save himself, the pain was too much and this was his only escape. It's too late to go back. And why should he even try? Why go back to the pain. THe new person, the dark and probably EVIL person he's become has taken away the pain by eliminating his former self. All those vicious memories of pain are virtually gone, the pains of \"yesterday\" and beyond are just a thought. The new self has taken over. Who he was simply never existed.\nPeople always talk about feeling \"warm and tingly\" or \"a euphoric feeling of warmth comes over them\" when they feel intense joy, even joy from drugs perhaps. So the DEATH of his former self has eliminated the pain, and it greets the new evil person, with warmth and subconscious joy. \nHe says goodbye forever to who he was....and if you are to know who this new person is, he will strike the fear of God in you. Something horribly violent is about to take place. \nThe pain of the old self's life has Faded away...dead...to black nothingness. This new self has taken over, said goodbye to the good person he was....what is about to transpire is that of pure anger and loathing, and those around him are about to witness the unleashing of this new self, in the form of maddening, horrific acts, committed completely unexpected, baffling those who KNEW the OLD HIM.\n\nSorry for the long way to get to my final thought, but i always saw this song as something no one else really saw it, and simply put in two words: HE'S SNAPPED. \nA life of pain, anger, heartbreak, love lost, abuse, etc etc, has been killed. And in his mind, a new person exists. When someone \"snaps,\" we all know what is about to happen next. That is what has Faded to Black; a life destroyed, slowly falling into the empty black void of evil, of DEATH. Whatever happens after this, will be the acts of a monster....\n\nI hope people don't think im TOO crazy hahha..but we've all felt sometimes that we cannot take anymore, and that we're going to \"snap.\" But for the individual in this story/song, it's actually happened...and the end result is frightening...\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nosu_cowboy2000 that is such bullshit! How could james write the a song about cliffs death three fucking years before he died? This song was written in October - December 1983. Cliff Burton died on the 27th of September 1986.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n\"Growing darkness taking dawn, I was me but now He's gone.\"  - I think that's such a beautiful lyric and a great way for Jaymz to illustrate the change that has occured in him.  \r\nto Metallican41:  I think you should think before you type especially on a mesage board full of Metallica fans, because you saying that their lyrics are weak is the most ignorant thing I've heard in a while.  Unless you're a 13 year old TRL watching kid and the only Metallica songs you know are the ones they play on the radio and MTV late at night, then I can see why you'd say that their lyrics are not dense.  It's easy for someone who doesn't really know Metallica to make that generalization, but in reality Metallica has some of the most thought-provoking and emotion filled lyrics of any recent band, let alone a metal band that fucking rocks.  \r\nEverything off ...And Justice For All is packed with great lyrics about the corruption of the US government it's justice system, etc.  In addition, songs like Disposable Heroes, Don't Tread On Me, and For Whom The Bell Tolls have distinctly anti-war messages (the true sign of an intelligent man because for a long time I was an ignorant patriotic kid until thing like Metallica, Rage Against the Machine, System of a Down, Carlos Castaneda, Chuck Pahlaniuk, and Joseph Heller allowed me to open my mind).  Metallica's songs point out the problems in our world that most people are too ignorant to see, and songs like Fade To Black and One convey emotion like no other band can.\r\nI'm not trying to come down on you hard, but just think and have proof to back up statements such as Metallica not having good lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ndon't rely on the website songfacts for  the meaning  of songs because they are wrong alot and they leave words out of a few songs,    they are just guessing what songs mean.    just letting everyone know this\n\n\n", "comment_10": "\nnewfoundfinch is a fucking prick.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nfirst off his name was cliff burton and this song was made b4 he died. cliff burton died after master of puppets. And justice for all was Jasons first album playing\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nwhats wrong with you baseball coconut????\r\nits not \"mike\" its cliff!!!! and this song was written way before he died!!!! \r\nCliff ruled....he made every song on every album he played on....worthwhile....\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nJust want to make this clear. If my sources are correct (wikipedia) :P, which it usually is, the amp stolen was no ordinary amp. It was given to James by his mother shortly before she died. Besides it being special that way, it was also very rare. Also the song is obviously about someone who has decided to kill himself, and what he is thinking before he does it. I feel I have to say this; Metallica didn't sell out. To say so is insulting. Just because they changed their music style doesn't mean they sold out. Also if they did sell out, wouldn't they have recorded something that people would have liked and not something that apparently everybody hates, eg Load and Reload. Half of their albums are thrash metal, isn't that enough. Just because a lot of people can listen to thrash metal for years and years, and enjoy it, doesn't mean Metallica won't get bored with it after years of writing and recording it. I'm not saying that their new stuff is better than their old stuff but lay off em. Metallica rule and if you think they sold out, fine, but don't go round saying it and tarnishing their rep. They don't deserve it. I'm not trying to target or abuse anyone, everyones entitled to their own opinion, I'm just saying what I feel needs to be said. If you don't like their new stuff, just don't listen to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThe song was actually written when Metallica's band equipment was stolen while they were on tour, which depressed James Hetfield immensely, as one of the pieces of equipment was an amplifier which was a gift from his parents, so he decided to write Fade To Black, which he didn't want to be recorded in the album (Ride The Lightning), but the rest of the band didn't want to waste such an awesome song, so they insisted to put it in, which helped James during his depression. \n\r\nThe song is basically about a man contemplating, and eventually committing suicide, hence \"goodbye\" at the end. Also, the song becomes progressively heavier throughout, which depicts the man's despair growing inside him, driving him to his death. \n\r\nThe song was so controversial that some people wanted it banned, but within weeks of its release the band received thousands of fan-letters from teenagers who claimed the song healed them as they related to it and stopped them committing suicide.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni agree with echo into darkness it talks about somebody ready to commit suicide because he thinks there is nothing in life for him\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis song is about suicide. \"I have lost the will to live. Simply nothing more to give\" This verses explains it. He was tired about his life. \"Need the end to set me free.\" He wants leave his world, he wants die, he wants suicide. All song he talks about he is sick of it all. And in the end: \"Death Greets me warm, now I will just say goodbye.\" He'll say goodbye, he'll die.\n\nI got this interpretation because i'm feeling like him. i have lost the will to live too. Maybe i'll could set me free.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI believe that this song seems to be about how fragile life is but deep down in James' heart, it is about loneliness. James' mother passed away from cancer when he was only 16 years old and I believe that deep down inside, the lyrics are about him missing his mother. \n\n\"Things not what they used to be \nMissing one inside of me\nDeathly loss this can't be real\nCannot stand this hell I feel\"\n\nThese exact lines specify that the death of his mother took a part of his life and that he doesn't want to believe the fact that his mother is not with him.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI want to listen to that song when I'll be dying.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nLife it seems to fade away\nDrifting further everyday\nGetting lost within myself\nEveryday life we grow older and death slowly creeps forward each day, geting lost within youself means that when you have depression you begin to question who you are and what you really are.\nNothing matters no one else\nI have lost the will to live \nSimply nothing more to give\nWhen you have depression well to my point of view I'd never given a shit about the people around me. It feels that you aren't in control of your own life as if you were someone's popet.\nThere is nothing more for me\nNeed the end to set me free\nYou do feel worthless, you don't know what the purpose or where you stand in life anymore. Most people kill themselves as a only way to set themselves free from the world.\nThings not what they used to be \nMissing one inside of me\nDeathly loss this can't be real\nWhen someone who have depression end up turning into a complete different person all together.\nCannot stand this hell I feel\nEmptiness is filling me\nThe line \"Cannot stand this hell I feel\" this is when someone has a suicidual thought were can not stand how life is. \nTo the point of agony\nGrowing darkness taking dawn\nI was me but now, he's gone\nGrowing darkness taking dawn this is a metaro for when someone is developing into the illness of depression. When someone has/have depression again people with this illness do turn out to be complete different person. So this last line \"I was me but now, he's gone\" that one says a hundred words right there.\nNo one but me can save myself, but its too late\nNow I can't think, think why I should even try\nThis part I think is when someone is pretty close to the edge where they are about to kill themselves. At the end you are the only way that can save yourself! but the thought corners you and then they/you begin to think why you should save yourself.\nYesterday seems as though it never existed\nDeath greets me warm, now I will just say goodbye\nGoodbye\nYou will begin to lose track on days, months even years! because they/you really give a shit. This is when they have written a suicide note/or their final moments that they/you have walked upon this earth. Death greets me warm, the person who commited suicide is dead.\nLook, I can't speak for everyone but this is my point of view about the song. And personally I am someone who has depression. So basically, this sing is about suicide this is a fact Metallica has received many fan letters about this song because they were suicidal and the sing changed they minds. So they just simply thanked the band for the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nfor starters this is my fav metallica song... but umm... yeah, well i think this song is about someone wanting to commit suicide because they don't think they have anything to live for and they think they'd be better off dead.  we've all been there.  but maybe i'm just taking it for face value and not looking deep enough? i dunno.  \t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nActually the song was written when the bands equipment was stolen during one of the tours, James wrote it straight after.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\n2 words suicide letter\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nthis is the greatest song ever\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nhetfield doesn't talk about his lyrics much, but residential evil is correct. someone stole his marshall amp and it depressed him immensely.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nthis was the first Metallica song I ever heard. I have loved it ever since.  This song introduced me to the wonderful world of Metallica.  I knew every word to this song and would play is blasting and singing it, but until now I never thought about the meaning of it, and you guys are so right, it all makes so much sense. thanks\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis IS the best song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nLosing everything after you've gotten so far and then losing the will to carry on.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nthis was not written with it in mind but i think it now refers to cliff burtons tragic demise\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI'd say that this is ONE of Metallica's best songs, and the best on the \"Ride The Lightning\" album.  This song to me is about  a guy thinking about comitting suicide.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis was also the first metallica song i heard, it almost stopped my heart, i didnt think something that articulate could ever be made.  It is one of the best metallica songs.  If i were to introduce anybody to the wonderful band that is metallica, i would probably use this song.  Everything in this song compliments the rest of the song. It has everything anybody could ask for.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nMuch respect to cliff\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThe song was written after one of the bands rare amps were stolen, james searche din two different countries to try and find an amp exactly the same.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThe song was written after one of the bands rare amps were stolen, james searche din two different countries to try and find an amp exactly the same.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nPositively Metallica's greatest song, I think they will never be able to top this. Metallica are master composers and are never given enough respect in that sence. To fully understand me just listen to\r\n...And Justice For All (my favourite Metallica album ) very carefully and you will see what I mean\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThe first scraps of the song was written after a stolen amp. They were on a two month tour with Raven at the time i think. Then later when they started putting together the material for Ride the Lightning they completed the song, and it turned out to be about suicide.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nJup this song is about suicide, and maybe metallica have had letters form people deciding NOT to kill them selfs, but they also had thousand of letters from parents saying this song could be the push that will let their child to commit suicide ((Im dutch sorry bout  my crappy english))\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nGreat song, obviously dealing with suicide. I remember going to a youth group meeting when I was a wee lad, and being forsed to watch a tape on \"the evils of heavy metal\" and how \"rock and roll is Satan's tool\" and all that general crap. They took example of this song in particular, playing it the song and scrolling the words and the screen karaoke-style. I also remember the entire group, preachers and all, staring at me gape-mouthed when I was absentmindedly singing along.....lol, that was some great shit!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nDid any of you know that Metallica's original members had degrees in Psychology?? HRMMMM ? Interesting isn't it ?\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nOne word: Perfect\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\ni don't care what anyone says, this song has the right elements of a great song.  Slow intro to a heavy ending, its amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nSuicide note...whether or not James had this in the back of his head when he wrote it is unknown to me but this def. is about wanting to just end it all!\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nOkay, I have several things to say...\r\nMetallican41: You have some nerve calling Metallica's lyrics weak. And Fade to Black is NOT all over the place. It's about suicide. Yes, the band's equipment was stolen but the song is about suicide, and severe depression. \r\nSeven: I'm not going to call you a poser because you might not be, but if you listen to Metallica, get you albums straight. Fade to Black is on Ride the Lightning, not And Justice For All. And Justice For All is my fav album though.\r\nosu_cowboy2000: Okay, how could Jaymz have written a song about Cliff's death when he was still alive? The song To Live Is To Die is about Cliff's death. Almost all of it is just instrumental but the quote that Jaymz says is in fact Cliff's.\r\nAnd NewFoundFinch, I'm not even gonna start with you, you suck ass and are full of shit. Metallica is probably one of the best bands this world has ever seen. So go fuck yourself and stop dissing Metallica biatch!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nYa newfound i am gonna hunt u down and hurt u ya fucker!!! metallica kiks ass and always will! go listen to some back street boys and take it fromthe back! and death on arrival..To Live Is To Die was written BY Cliff before he died and then Metallica afterwards composed it as a tribute...but all the rest i agree with u\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nosu_cowboy2000 you stupid fuck, how could he have wrote it after cliff burton died you fucking dickfaced wanker, cliff burton didn't fucking die until an album & half a tour later you stupid fucking uninformed peice of shit. \t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThis song is wel good i am a huge metallica fan and I just wished they did it on the S&M albumn which is the best albumn in the world. This song has a lota meaning as do a lot of them which is 1 reason 4 why I like them. METALLICA RULE!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nnewfoundfinch... strong words coming from a fan of new found glory, you emo pop piece of shit\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI agree with you Nobz. The newer stuff is different, but I've loved Metallica since the first time I heard them, and I'll stick up for 'em all I can\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nDeffinetly the greatest Metallica song ever written......it shows their skill for writing great music and combining lyrics into a \"masterpiece\"....n a great solo\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThis is one of the greatest songs along with One. Metallica is awesome. All of their songs have so much meaning to them. Metallica has, and always will kick ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nINCREDIBLE!\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\n\"Fade to Black\" is about suicide, how life can suck.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nDebbie65 - i think we've established that\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI know, but never put my opinion in before.  :P\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nPLEASE!!! PLEASE!!! PLEASE!!! someone please steal James's marshall amp again and again and again cuz another great songs like this will rise lol. this is really very good!!! very well written and very beautiful music!!! (oh, i only heard it on the \"live shit\"). \"I was me, but now He's gone\"... hmm think about it... now i will just say good-bye. good-bye... yeeeeeeaaaahhh\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI love this song, it's one of my faves.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis song has one of the coolest Hammett solos ever.  Metallica is the greatest band on the planet.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nthis is the BEST Metallica song EVER!!!!! I've loved it ever since I first heard it.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\n1 word - Masterpiece\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nmetallican41 metallica lyrics are the best\r\nThis song couldn't be about cliff since cliff did 2 albums after\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nThis song is deffinetly about suicide. Life sucks(obviously) and they just can't take it. For those of you who didn't know this was Cliffs favorite song. RIP Cliff...\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nUmm, Definately Suicidal. \n\r\nFuck That Guy That Said Metallica Sucks, EAT A DICK \r\nB-OTCH, Metallica Kicks Ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nThis song is definitly about suicide, But we should all know that..Metallica Is one of the greatest bands ever and The guitar in this song DEFINITLY kicks ass! \t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\ni like slayer a little more than metallica but they kick ass\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nSomeone should take \"Newfoundfinch\" out in the bak of a butcher shop n put a bullet in him\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nOoooh That Was Harsh!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nATTENTION: \"hell i call my head\" \r\nwho are the retards that say this song is about cliff dieing?? considering he fucking recorded the song with the band, and don't say that it's a suicide note cause he was squished by a bus. Yes this is a suicide note, no it does not have to do with Jason, Maybe James felt like shit once and wrote it maybe he wrote it what he thought a friend was thinking or maybe he just felt like writing a song about suicide..... TALIKA RULEZ !!\r\n.... Jack ass\n\n\n", "comment_67": "\nsorry if I sounded mad, that was not my intent, This song kicks ass\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nnewfoundfinch listens to wut is called Pop Punk. But I do agree everything after Metallica really wasnt worth getting, load was subpar and everything else was just selective songs.\n\r\nThis is the greatest metallica song of all time in my opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nim no metallica fan, but i love this song. especially in the begining the  guitar and bass sounds good. and in the middle of the song i love  that part to.  i also like nothing else matter, the unforgiven, master of puppets.  rest in piece cliff, you were still alive you and james  will make metallica much better.  later you metallica fans\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nThis song totally rocks \\m/ mmmmmmm fade to black \\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nMetallica,\r\n2nd Best band EVER.\r\nFirst is system of a down, Metallica saw them live and they thought they were amazing people, theyre material was gold.\r\nFade to black is a great song, but i like a lot more, and i surprisingly dont know lots of people who like No leaf Clover, fuck thats a great song.\r\nTHanx\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI just listened to this song. It fucking rocks. It seriously fucking rocks. Newfoundfinch, you are an asshole. You listen to MTV emo pop bullshit rock. You're not even worthy of reading Metallica lyrics. Never come back here again. Bitch. Metallica rocks. Soadrulz, personally, I think Metallica is better than System of a Down, but they are both two of my favorite bands. You have good taste in music.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\n/\\ Bullshit.\r\nBest metallica song ever. Incredibly emotional song, on the topic of suicide, truly classic Metallica. I think the \"Stolen Marshall\" incident has little to do with the song itself, probably just got him into a depressing mood. But then again, a whole bunch of Metallica songs are like that :D . Once again, best metallica song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nnew found finch needs to be put down\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThis is the one of the best Metallica songs of all time. \t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nfirst off, so i don't feel left out, NewFoundFinch can try and suck the dick he doesn't have. 2nd of all, he needs to be hanged from his asshole and shot all over until he bleeds to death. \n\r\n3rd of all, Load is a killer fucking album, and i fucking love it. so everything after black isn't shit. you know what else is kickass? garage inc. and reload. and s&m. So there. of course Fade to Black is my all time favorite Metallica song. and One. And Am I Evil. it all fucking rocks sooo much. peace out.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nevil killer phone i think must be one of those metal heads like my neighbor...who listens to slipknot and that crap so anythign emotional and heartfelt is disregarded. \n\r\nPerl I respect ur opinion but I still think that it went down after black. Oh well song still is amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nwow!!! i'm not a huge fan of this band, well not even a fan really but these lyrics are amazing, and i'm gonna download the song coz of how great you guys have said it is. i know this is shit and laughable but i did it the other day before finding out about this song and its about the same thing...\n\r\nBetter days were found\n\r\nWhen times were high they were everlasting\r\nTime stood still and everything was beautiful\r\nLife was full; everything mattered from the sea rocks to green grass\r\nA smile that was seen from miles away always brightened his dull face\r\nYears past by without time to think, everything was perfect\n\r\nThen came a hill, dark, steep and dangerous with no sings or turnings\r\nThis was new this was horrid this was a new life\r\nHe turned to his friends but they had gone he looked for new ones but they were too different\r\nBut a smile covered fear, fright and sadness, a smile on the outside only\r\nIt answered everything and covered his eyes\n\r\nThings will get better this cant be this isnâ\u0080\u0099t really happening\r\nLife cant do this to anyone times will change; death can be freedom now so there must be more\r\nThe sadness, darkness, loneliness and insanity grew there was no way out\r\nYears went by with the thought of things getting better even with a part of him trapped in the past\n\r\nThen one day his eyes opened, he couldnâ\u0080\u0099t even blink, the wasted years started to hurt, hurt like never before\r\nWith no one to turn to or confine in the world through his eyes had ended\r\nNothing mattered from the new born to oxygen, if it went away he wouldnâ\u0080\u0099t care\r\nNothing could ease the pain no one could even pretend to understand\r\nHis only hope now was an afterlife, a risk worth taking, a new world or an end to the soulless life he wastes\r\nThereâ\u0080\u0099s no one to care for thereâ\u0080\u0099s nothing to leave, this is the way things will get better\n\r\nThe end is near, thereâ\u0080\u0099s not even a soul to say goodbye too, the times almost up\r\nA family that didnâ\u0080\u0099t know the real him and long-lost friends whoâ\u0080\u0099s forgotten his name\r\nWith still a tiny hope the size of an antâ\u0080\u0099s heart, that things will get better he walks alone\r\nHe finds a place to make things better; he raises the gun and ends the pain\r\nHe falls to the ground with a smile again, no more pain or suffering, no more endless days that tortured him\r\nNow all that follows is the better days, finally foundâ\u0080¦\n\r\nand thats waaaaaay too much for most of you lot to read lol but its my first post so i dont mind\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nFirst off, NewFoundFinch, Metallica's music will be around forever, so you better get used to everyone talking about the best damn band since the Beatles. Second, this is a kick ass song with one of Hammett's best solo's and some of Het's best lyrics ever. And third, Load and ReLoad are two of their better albums. \"Nuff said. \t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nBest song ever made...\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nShows you that James Hetfield is not only a good singer, but a good guitar player too.  About the only time in the song that's just 1 guitar is Kirks solo, which by the way is probably one of the greatest solos ever.\n\r\nWonderful lyrics, I don't care what they said they wrote about their amp being stolen.  It's obviously about suicide.  Maybe he DID write it after their amp was stolen, but what in the fuck does this song has to do with an amp being stolen?!?\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nthis is the greatest song.  the emotions expressed by the lyrics are great, yes, but what makes this song SO great and different from almost all other songs heard in today's culture, especially pop and hip-hop, is the emotions expressed through the actual music.  after the lyrics stop you can almost feel the torment the writer was going through when he wrote each note, it is truly inspired.  try, next time you hear it, to ignore the lyrics and just focus on the emotion that the guitar insites in you, you cant do this with most songs, its great.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI actually think they should have let the guitar solo actually be solo, instead of keepthing the rythym going, and the beat as well.  Should have been just kirk playing the solo, it could be better heard that way.\n\r\nAnd this is by FAR the best Metallica song, and one of the greatest songs ever written, musically.  Only maybe Zeppelin or Floyd could write music and lyrics better than this.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nMuzzy, interesting point. Metallica vs. Pink Floyd vs. Led Zepplin, lyricallty speaking. Hmmm..........I love Pink Floydm don't get me wrong, but 75% of their stuff is getting high, whereas the 25% is the contraversial issues like politics and stuff, so I rule them out. Zepplin is Zepplin and will always rule in their own right, but a lot of their lyrics do tend to not be very deep or meaningful. ( I'm speaking mainly of a few songs by them mind you, you really can't fin any bad Zepplin, just some is better than others.) So i choose Metallica for lyrics simply because everyone song Hetfield is pouring out his heart and soul to take it to a deeper level. They also have a song for everything, something few bands can say.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\ni have a problem, i heard this metallica song on the radio and once again the damn radio ppl dint say the name. i dont remember much, but i think the chorus starts out with the singer yelling jesus christ, the song seems sad. Anyone know the name?\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nthis is my favorite song to play, wether on bass or guitar. definelty the greatest metal song of all time. \r\nzeppelin is great, but this song is a huge departure from met's music, it's a masterpiece, classical, blues, fed into rock. the solo is by far the best metal solo ever, perfect fit for the song\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nit's about committing suicide, on mtvICON they said it was because they were such big alcoholics they couldn't do anything\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nlol good call muzzy.\r\nno one can make a song this powerful about a freaking amp.\r\nThis is one of the most powerful songs ive ever heard especially the line \"need the end to set me free\"\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nand iron maiden blows a$$\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nawesome....and iron maiden does kick ass\n\n\r\ntheir singer sounds like a castrated pirate\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nPeople can relate to this song being about suicide, people can relate to it being about whatever you like but the official word (from an interview with James Hetfield) says that it's half about about Metallica's equipment being stolen on a world tour but the other half is written about James' addictive nature - same as 'Until It Sleeps' is \"So tear me open, pour me out, There's things inside that scream and shout and the pain still shakes me, so hold me until it sleeps\" (yeah, I know it's off a MUCH later album but IT'S AN EXAMPLE...\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nThis sounds like the theme song from Kingdom Hearts.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nnewfoundfinch - Metallica probably influenced Finch. :|. \n\r\nI love this song my stepdad first introduced it to me, when I was small, and I have loved it ever since.. especially the intro... gorgeous riff.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nI only have one thing to say, as the song has been explained thoroughly. I just want to address the fact that this was not Cliff's favorite song; Orion was. The band played that song for him at his funeral. Can you just think of the imagery that combination has (a funeral and a Metal-Instrumental)?\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nJames and Lars were obsessing about death, they said so on MTV icon\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nyeah i think its about suicide my friend is a huge fan of metallica and she said that when that song was written the band had problems about that...i love that song\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nThis is definitely about suicide. examples: \r\n\"I have lost the will to live\" -Come on, this screams suicide. \r\n\"Need the end to set me free\" -This has to mean that only death will set him free from all this agony.\r\nThese are just a couple examples, but if you look at the song, almost every single line makes sense to suicide, and not about a stolen amp.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nOne word:  suicide.  Anybody who reads differently is from another planet and their universal language translator is broken.\n\r\nBy the way, this is the 100th comment for this song.  Nice.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nMetallica is playing  here in Belgrade tonight..I sure hope to hear this song...one of their greatest songs!!\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\n3 words- stop doing that!!, jesus, anyway i love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nsuicide.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nApparantly when Kirk wrote the solo to this he was thinking of really depressing things, a very emotion filled song first song i ever learnt to play because it sounds so beautiful\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\ni have deemed this song my theme song, i love it\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nThis is the best song in music history. The End.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nMetallica. what can i say. ill be playing nothing else matters on my deathbed when im old. this song is maaaaaaaad. hammet is a killa. the only bad thing i can pick about metallica is that they are one of the main reason for all these new age  pathetic excuses for rock bands like new found glory as metallica inspired most of these bands to start. that kids voice is so god damned annoying!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\ngreatest solo in the history of metallica at around 6:10.. serious headbangin every time this song comes on\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nthis song is a note for not-suicide... a will to live for something... i start every guitar practice with it... not depressive for me...\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\ni listen to this song all the time, its a purification process. it takes you through the sadness, then you can decide at the solo. i either weep uncontrollably, or look around, and everything is beautiful with the ring of kirk in my ear. all the solos send chills down my spine. go metallica, go kirk, and screw mustaine\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nhaha muzzy sums it up da best\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nIt's about suicide and this could be one of the greatest songs ever\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nno actully it isnt buddy it was written after that happened but if you learn to read the lyrics is about sucide\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nmy fav song all time.its so amazing so painful,so depressing but in the end you realize the `tallica boys have been there before too.the solo in the end is like a free fall from the sky with no way to avoid it.kirk james cliff lars it`ll never be the same what a shame\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\n*rolls eyes* \r\nI love how people who dislike certain bands always find the need to go onto the band's pages and write about how much they dislike them. As though anyone cares about their stupid whiney little opinions. \n\r\nANYways...\r\nI definatly love this song. Its pretty self explanatory though....about contemplating suicide when everything gets to be too much, when you feel so lost that theres no other hope. \n\r\nOh, and I'm not certain, but I think its pretty safe to say that the timing between the equipment getting stolen and the writing of the song have little or nothing to do with each other. Look at the lyrics...so not about stolen amps. \n\r\nSometimes people are just so freakin stupid it hurts my head.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nJust ignore him. This shit gives him boners the size of a redwood.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nthis song is indeed about stolen amps and shit i'm sorry to say, it made me feel bad at first to, for them to write a song that good about amps. But the story was that all their equipment was stolen from the back on the van thing except jame's white v and they didn't have enough money to buy all new equipment, so it seems as though all was lost, also an amp that was irreplaceble was stolen, it had a certain sound to it and it was good luck for kirk.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nIt's about one's desire to die.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nThis is DEFINITELY one of the best Metallica songs.. Not only the words, but the end solo too. I loved every minute of learning that solo..\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nThis is a fucking fantastic song they're just so many layers and sections to it and its got melody, hard metal and loads of talent its about 5 classic songs but all just put into this one i dont care if its about stolen amps either i think the lyrics are great and i think i'll be that pissed off if i had my Marshall pinched.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\ni love this song! everyone should listen to it.... metallica rocks!!!\n\r\nya this song is about when metallicas music equipment got stolen, and they were all so depressed that they wrote this song. its about suicide....\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nSuicide.\r\n This song has the \r\nBEST\r\nSOLO\r\nEVER\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nFor me the best Metallica's songs.It's about a man who doesn't want to live anymore.You can find your own reasons!!\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nThis song definitely brings back memories.  -- And not so good ones, for that matter.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\neverything about this song is perfect: perfect rifts. perfect drums. perfect vocals. yet another song that makes me so glad i have ears.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nWell, Cliff died like four years or something after Ride the Lightning was released, which makes the timeline a little off for the song to be written about his death.  Also, to newfoundfinch, take your whining preaches elsewhere, yeah? so what if there older stuff was better, if you were a real fan and appreciated the band you'd accept their not so great stuff and remember the real potential they have to come up with killer music.  Damn\r\nAlso, I figured it was mostly suicide as well..\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nbest slow song by metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nKirk Hammet is better than Mustaine. I'm glad he replaced Mustaine. Mustaine is a little girl. He cried when Lars told him that Hammet was better.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nthis song in my opinion is the best metallica song out there. No one but me can save myself, but it to late \r\nNow I can't think, think why I should even try \n\r\nYesterday seems as though it never existed \r\nDeath Greets me warm, now I will just say good-bye \n\r\nduring those lines i think that was the coolest guitair solo ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\ni agree with Alston11 it is really sweet but i personaly like the ride the lightning solo better. But this is my favorite Metallica song.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nSuicide and stolen equipment. 2 events that can be married into one, huge lump of metallica's finest pieces. I once thought it was about being executed, the prisoners point of view on the electric chair. But, that observation probably stems from the album cover of Ride the Lightning! \r\nThen I found this site and all the insightful responses. So, i'm not disappointed at all because, suicide and stolen equipment seem better events than being fried on an electric chair. but, who knows - lets ask Scott Peterson.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nnewfoundfinch, that comment makes no sence since this album was 3 albums before the black album......\r\nThey had KEA, RTL (where this comes from), MoP, AJFO and THEN the black album, this was their second full length, the black album their fifth.\r\nBesides that I think this is the most beautiful/emotional song they\\'ve written, simply stunning, right along side One.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nNecronic, the song Ride the Lightning is about the prisoners point of view from the electric chair.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nI've always considered this song differently from the way you all see it.....hmmmm...\n\r\nI don't know why, but I think this song is about an old guy who has lived life to it's fullest and now that he's aged, he feels lonely and depressed so he's considering death as a solution for all his loneliness. \n\r\nI even think that this old dude is sick and he's not even willing to fight his sickness because he knows he's done everything he could've in his younger years and now it's simply not worth it.....and I quote : \n\r\nI have lost the will to live \r\nSimply nothing more to give \r\nThere is nothing more for me \r\nNeed the end to set me free \n\r\nHe needs the end to set him free from his pain essentially. You could say it's about suicide but viewing it from this angle, why does he say there's nothing more for me??? I think it's because he's done all that he could in his youth....\n\r\nHe's maybe thinking of EUTHANESIA and I feel that FADE TO BLACK and ONE have a very similar meanings....\n\r\nOther than that I would advice you to get the COVER made by SONATA ARCTICA because it's really good...of course they don't use the SOLO but it has a really good feel to it.... In between the two verses they add a little riff and they don't repeat the same riff Metallica uses four times but only 2 times....and I think that was the biggest weakness in FADE TO BLACK.\n\r\nOther than that I consider FTB as one of the 5 best  Metallica songs ...\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nAnd I would like to add that in the end my explication seems more convenient because he says: \n\r\nThings are not what they used to be \r\nMissing one inside of me \n\r\nNo one but me can save myself, but it to late \r\nNow I can't think, think why I should even try \n\r\nTry what??? I really think it's about trying to fight his illness...\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nI reckon this song is about losing love or someone and not being able to cope afterwards.\n\r\n'I was me, but now He's gone'\n\r\nInsinuating that he cant be himself anymore without that person in his life.\n\r\nAnna\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nok first of all the way the amp plays apart in this song. it was an I-N-S-P-I-R-A-T-I-O-N. That my friends is how we get a song like that. I've been a metallica fan for awhile and it has introduced me to alot of wat I would call good music. The song itself is not about suicide. The guy is just depressed as hell to the pnt where yea it would be nice to die right not but i am too much of a pussy to go through with it. \"need the air to set me free.\"  Things are going tough for him but he's not going to commit suicide why else would he NEED the air to set him free. His mindset of suicide is something he wants to do but doesn't have the ability or the balls one. Thats if you look at the lyrics. But the song has a good touch to it and brings alot of emotion out to the pnt where u don't even need lyrics. Its hard to say if this is their best song, i will always like sanitarium and to live is to die. \n\r\nBTW: The statment saying that metallica sucks would mean that they suck as musicians more than likely. I mean that's what they are a band not a person. and when you compare metallica's structure as far as lyrics and music wise they put every punk/pop band to shame. Metallica Rocks\r\nif you like the suicide thing try out dirge for november -opeth \n\r\n\\m/__(>_\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\n\"i was me, but now hes gone\"\n\r\ni love that line. like the real me was here, but now he is gone. all im left with is emptiness and darkness.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nThe song wasn't written after Cliff died, because it was on the Ride The Lightening album and Cliff died on the Master Of Puppets tour. That over and done with, I think this is one of those songs which mean different things to different people. Some may see it as dark and depressing, but James has said hes had fans tell him this song stopped them committing suicide. To me this is just the most perfect song, especially the version on Cunning Stunts. It just captures how you feel when everything around you is going wrong and its a perfect companion to get you through the worst, the soothing intro and heavy guitars. Fade To Black rules\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nIn my humble opinion this song is not about committing suicide. It is about having nothing to live for. I believe its about saying goodbye to the world, to become an empty shell filled with the essence of empty. About letting one's mind slip into the warmth of death, while the body lives in the cold.\n\r\nI choose to think so, because the music doesn't take an end. It just keeps on getting lower and lower, imaginably still there all the time, as an empty entity.\n\r\nLetting my mind slip into the warmth of death, my body is here, but I am not.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nWas the intro borrowed from Rush - Fountain of Lamneth [III. No One At the Bridge]?\n\r\nThey sound pretty much the same, and was there any mention about it from the band members?\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nHey. everyone is entitled to thier opinion..even if thier opinion is shit.\r\nNikki_sixx is correct, the cunning stunts version of this song was awesome!! the lights make it really cool-looking\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nTo newfound finch....it's ironic that you are posting this comment for \"Fade to Black\"....considering this song is off of Ride the Lightning, which came before the black album.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nThis is one of their best songs! I simply love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nvery fucking awesome metallica song i think it deals with suicide.. maybe thats the reason i like it so much......\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\ni think this song is just about a person who has tried to offer everything he has and everyone is pushing him down, no one wants anything to do with him maybe because of past expereinces and they just think he isnt good enought so he goes to the extent to commit sucide because he thinks this will cure his problems and just let him be with out all this bullshit people are feeding him\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nThis is hands down the best Metallica song... at least in my mind. I agree with most about the suicide... and.. Who gives a shit about if their equipment got stolen... that doesn't explain the song you fucking morons...\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nThis song is pretty deep for about a bunch of material goods being stolen.  I think it is evident that it is about depression and losing yourself in either vice, through a death, or anything.  I think \"I was me, but now He's gone\" pretty much shows it.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nfilling*\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nevilspyder, I just read your comment on page 5 - please don't ever say that is should have been Kirk! Kirk Hammett is a God and should be idolised as one!\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nthis song is one of Metallicas best songs. let them haters hate they have nothing else better to do but talk shit. it gets old. damn haters...\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\ni think this song is one of there greats but ther is way better by them... you guys have to actually listn to the song not just your favorites\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nI've felt like that before...depressed almost to the point of suicide...this song didn't help much either (not saying it's a bad song, I love the guitar and everything). Took a lot to convince myself not to =O\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI think lyrically this is probably metallica's best.  Musically its up there too.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nThis is my favorite Metallica song. I listened to it constantly during a very suicidal period of my life.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nfirst off, metallica kicks ass\r\nsecond, disturbed kicked ass covering this song\r\nand third, this is the second best metallica song,\r\nthe best has to be puppetz\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nok... in case no one have noticed, parts of this song are similar with the unforgiven and unforgiven II. If you read the comments on those songs you wpuld probably figure it out! (excuse my english)\n\r\nAfter having read every commnet on this song, the unforgiven and unforigiven II I only found one (ASFalcon13 commnetd on the unforgiven II, page 2) that mentioned this. I don't consider my self as a huge Metallica fan, but it was the first thing i noticed when i heard this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nFrom the start of the song I realized it was about suicide, and I\"ll be honest I've been suicidal at parts of my life. I doubt I would ever actually do it, but Fade To Black surely helped in one of my depressions and I'd like to thank Metallica personally for it. It is one of my favorite and most meaningful songs, I hope to cherish it along with my other Metallica favorites forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nOne of the greatest thrash metal ballads ever written.\n\r\nLove the acoustic riffs :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nAm I the only one who hears some of Pink Floyd's  \"Goodbye Blue Sky\" in this song?  The guitar picking is extremely close\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nlol I love how people are saying forget about metallica and theyre dead...when I believe st.anger hit #1, sold millions of copies...and sure, maybe they've gone downhill since the black album but god dammit its still better than alot of shit coming out these days all this emo shit wanna be rock bands playing progressions of horrible power chords... Just because a band is out of its prime doesnt mean they're dead. their old music is still out there, and people will listen to it when they want to and aren't going to care what a couple emo kids on a forum say.\n\r\nMetallicas first album, released 23 years ago will outlive every band since 2000. period.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\n*agrees with cheddar*\r\nFirst off-Isn't it funny that people claim to hate a band so much...but have taken the effort to look up said bands' lyrics for some reason? Almost as annoying as the fact my xbox wont work. I need to copy all the great Metallica music before the cds are scratched.\n\r\nYeah, the lyrics definetly are powerful and moving. That's why we're still talking about it in 2006. I'm not sure I can add anything more to the explanation of this song, but here goes:\n\r\nIt's that feeling when someone thinks about dying, wishes they would, but for some reason, can't, or wont kill themselves. Instead of a physical death, they die inside their mind. They wait for death to release them, but death is taking it's damn sweet time.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nGreat song to listen when you are depressed. This is one of the best metallica songs, awesome lyrics and music, that ending solo is superb.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nAll hail metallica, this is the best ever ...the fuckers almost created a rock phenomenon with this single..how he indulges the topic of darkness..n dawn..n the rythem+lead in this song is second to none..\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nThis is the best song ever.\r\nThis song is probably about suicide but to me it's mostly about accepting death(itâ\u0080\u0099s all the same in the end)\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nhahaha this was on the pmrc's top ten suicidal songs. the pmrc is a bunch of crap\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\numm SOADmad, i definitelly find myself in your story, Fade to Black, as well as The Unforgiven 1 and 2, almost stoped my fuckin heart, in case of Fade to Black its when Jamzye says 'gettin lost within MYSELF', just the way that he says this word 'myself' sends shivers down my spine. its great how such a band can go from making headbangers for most hardcore metalheads to ballads that can melt down anyone's heart, and anybody who says metallica sucks can go to fuckin hell, cuz metallica is one of those bands that will forever remain in my heart and soul. James and Kirk are Gods. \r\nalso a grat kickass band is Megadeth\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\n\"I was me, but now he's gone\"\n\r\nThis song is about conformity and suicide. It's about a certain time when he onced lived and now it's all gone and has been taken away. He has no other choice but to conform as the others have done. Or be ridiculed as a freak or has been. He must conform or he will have no friends, no women, nothing. He is forced to sell his soul, his values, his attitude, and everything that was him to live the life that society tells you to live. Conform or die. Now he feels he has no choice but to let the end or the gun barrel end his life, because there is nothing more for him.\n\r\n\"Yesterday seems like it never existed\"\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nBEST SONG BY METALLICA OR ANYONE ELSE EVER, PERIOD!!  It is not up for discussion. To the retards who don't realize that your ears could never hear anything better than this, I truly feel sorry for you. The riff during \"No one but me can save myself but it's too late (and so on)\"  literally makes me feel like i could fly!  If anything ever comes even close to that i think my head would explode. This song has the best acoustic parts, headbanging parts(take your pick, you should be able to tell what mine is), and lyrics of any song b4, during, or after the era in which it was written. Yeah, that includes everything btw for some of you who are obviously intellectually challenged. I guess i really shoulda left it like blue heart says, words are not worthy of describing the greatness of this song and there is no word for the feeling i have when i hear it.  If you will take the time to notice, my profile on this site is completely empty (or should be anyway)  cuz i only created it to post about Fade.  As far as meaning goes, whether or not it was written after the amp got stolen is irrelivant, that could only be inspiration of a dark feeling to put a person in the mood to write a song with these lyrics.  One way or another it's about death.  For some it can be about suicide, that easily links to the lyrics and i dont need to use an example if you have actually listened to this masterpiece.  However, you could also look at it like someone accepting and even being happy with the fact that they are dying.  Maybe even in a religious sense hmmmm??  I mean, if I'm dying and I know I'm going to Heaven, death is definately greeting me warmly (not that Hell wouldn't greet you warmly as well, just in a different sense)  Either way you look at it, it gets no deeper and no better than this song, bottom line!!  As much as i have written here, I haven't even began to scrape the surface as to what this song means to me.  I feel like I should be writing more but there are no words in existence that can help me.  To all you true Metallica fans, let the haters hate and masturbate while the rest of us get our kicks listening to the greatest piece of music ever written.  I bid u all a fond farewell....and I think I'll listen to this song another time or two (or twelve) b4 goin to sleep.  :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nAnd btw ppl who put the lyrics up here, there is no \"are\" in the line \"Things not what they used to be\", and it's \"Deathly loss\", not \"Deathly lost\"  correct it plz\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nDangit I'm never gonna get finished here!!  If u r as sad as me about there being no Fade on S&M then u can download Metallica and SF symphony Fade to Black off of Limewire.  There are no vocals, no guitars, and no drums, but if u truly love the composition of this song you will love it!...ok I think I'm finaly done, phew!!\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nOMG, one of the few great songs of all time, w/ others like stairway to heaven etc., and such few comments.. it's a shame. the  best song by one of the best bands ever. i hope the revert to making stuff like this...\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nthis song has a better acoustic part than nothing else matters.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nand this is my favorite metalica song next to battery, nothing else matters, and for whom the bell tolls\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nthis is one of the greatest songs of the greatest fuckin band of all fuckin time.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nI've been here for 8 months, and I havent posted in this yet? o_O\n\r\nSimply put, an awesome song. Has to be fighting with Dream Theater's A Change Of Seasons for my favorite song spot >_>\n\r\nNo band has ever covered this to be better than the original, not even Sonata Artica lol... Shows how great Metallica were before Cliff died. Shame they went and sold out eh?\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nThis is purely about suicide, they have a book out that tells u what the songs are about.  This is my ABSOLUTE favorite song by them, I saw them do this live in concert and bawled like a baby.  If anyone says that they sold out because they did this song has no idea what Metallica is really about, granted Load and ReLoad are embrassing, and St Anger is ok.  Metallica is still one of the best bands out there, I've never seen any band that has the power over a crowd like Metallica does.  From the second they walk on stage, till the secong they walk off, they grab you by the throat and don't let go!!\r\n But this song is about suicide, to be honest, I have it written in my will, that this song has to be played at my wake.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\n! WRONG ! It's about playing video games too long and wanting to quit, but the character in the game does not want the game to get shut off or he will die. He has no choice though. His actions are up to the player. (Kidding.)\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\ni'm gonna say that this is my favorite all time song. to me this song will never get old and there are so many versions that i have heard. they are all equally great. this song brings me up everytime i get sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nClassic Metallica, gotta love that riff (the progression) around 4 min, it's bad. I picture a man maybe just drinking his life away, becoming self centered and uninterested in life itself to the point of depression and insanity. I've been there before, I should know.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nits kinda funny how james would write a song like this after losing an amp. any way as most of u could see its a suicide song my third favorite metallica song after master of puppets and one\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nThis song is my favorite song ever! I just love the melodic solos and even the rhythm. My cousin and I both learned this song and played it together. He, of course, played all of the lead parts, while I played the rhythm. We recorded it on a tape recorder and have since lost it. But, anyway, this song, to me, is, like alot of others have said, about suicide and how life can bring you down. Metallica created a masterpiece when they wrote this song. This will always be my favorite song, no matter WHAT Metallica puts out in the future.  But, this song really means a lot to me. Though the song's lyrics hint suicide, this song always cheers me up. I can't say enough about this song, even though I will try. This song is best played when sitting in a dark room, just relaxing and thinking about how great life really is. Sad to hear about the stolen amp though....some ignorant motherf*ckers out there....\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\njust heard this song...can't help but listening to it again and again...out of the blue and right to my top10 of all times and i've heard a lot of music. It's art. I had St Anger and S&M, but now I'm getting everything else. Metallica fans: +1\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nin my opinion, up best song of all time, only pushed by lateralus by tool. however some of the early comments say this was written about cliff's passing, but he played the bass for this song on ride the lightning, cos it was 1984, he died in 87'. i dunno if this has already been corrected but i definetely thing it was written after their stuff was stolen on tour\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nThis is by far the greatest song that has ever been and will ever be written.  Like many people before me have said, there are honestly no words to describe this song or how it makes me feel.  \n\r\nBefore i heard this song i noticed how people would always talk about how a certain song made them feel or how they would get a special feeling every time they heard that song but i always that it was just a load of shit from someone whos trying to show how much they \"love\" the song.  Well after hearing this song, it changed my mind completely.  I had heard this song a bunch of times on the radio before but never actually listened to it so one day i was listening to some clips of Metallica songs and i heard like 5 seconds of this song and i recognized it so i downloaded it.  When i started listening to it without any distractions so i could actually concentrate on the song and i immediately loved this song but as soon as the second part of the intro began, at about 0:53 seconds into the song, i got this wierd tingly feeling like when your foot falls asleep but through my whole body and i have no idea how to explain it but it didnt go away until the song was over and my mind was completely blown because it was so amazing and it was a feeling that i will probably never forget.\n\r\nSo being the dumbass that i am i listened to it about another 30 times in a row so now i dont really get as strong a feeling any more when i listen to it because i kind of overplayed it but its still a hell of song and no song will ever come close to as good as this one.\n\r\nWell i know that nothing i can say will do Fade To Black any justice so i think i'll shut the hell up now and listen to it a few times.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nIf anyone of you have seen MTV icon -> Metallica... i don't remember if it's James or Lars that says it' but anyhow he says that under the time when James wrote Fade to Black they talked allot about death and such.\n\r\nI would agree that it's a \"suicide note\"\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nPretty excellent song. They have occasionally done the song entirely accoustic. Sounds pretty cool. \n\r\nBy the Way -  faderulz!!period, accourding to the notes that come with the \"Ride the Lightning\" album , the lyrics are \"Deathly Lost\", not \"Deathly loss\"\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\n\"Fade to Black\" is a great song, though. A slower, softer song. Because of \"Fade to Black\" and the other Matallica ballads that have followed, Metallica is better then anyother metal band. Most other Metal bands are one trick ponies that can only play one type of song.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nThe riff in this song sounds like a ripoff of Triumph's Blinding Light Show.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nDefenetly my favourite metallica song. It's about someone contemplating suicide. It's got everything you could want in a metal song, kickass solo and great lyrics and nice feeling!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nHuh. I always thought it was:\r\n'Emptiness is filling me,\r\nTo the point of IRONY'\r\nAnyway, awesome song\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nthis song is one of the greatest songs ever. people always knock metal and say that it has no substance or meaning but all you have to do is listen to this song and know that that isnt true. james hetfield is an awsome songwriter and has written some of the most powerful and meaningfull lyrics ever. Metallica fucking rule.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nThis song. Pure awesomeness. All that needs to be said.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nsuch a great song... means alot to me, I can reflect on this song when I was down in drugs and what not.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nI lost my youth, starts crying everytime I hear this song. So fuckin brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nBrings back alot of memories...\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\ni agree with  Prodigal\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\ni agree with echo into darkness\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nnewfoundfinch : burn\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\ngod! metallica is so dark! sometimes it is so easy to listen to them and just get sucked in... the lyrics just have so much depth in them and every song has its own sort of story... i think that thats why you can just listen to them again and again. Metallica u rock!\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nMy favourite song of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\n2nd favorite Metallica song behind The Unforgiven\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nBefore this song, most heavy metal/ hard rock songs did not deliver quite so far into the human psyche; songs dealt with death, but usually in a cartoonish, gothic, or mystical way. This song no doubt helped heavy metal gain some songwriting credibility. Probably their best song. Unbelievable passion in the lyrics and James delivers his vocals so spot on it's almost erie. \"Emptiness is filling me to the point of AGONY.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nIts about him losing someone and them not caring about life anymore\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nbut they are still the greatest band in history\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nthis is my favorite metallica song ever!!\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nFavorite Metallica song ever, This song I think in perspective is about someone who has lost it all, and has nothing more to live for.\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nwow this song has to be the most epic of them all. love the build up and the AMAZING outro section\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nby newfoundfinch on 05-06-2002 @ 02:56:48 AM\r\nWill the world please forget about metallica? They haven't had cd worth paying for or even downloading since the black album. Please, someone kill them. Lars is a piece of shit. \n\r\nwell so are you.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nIt is true what the people say the bands equipment being stolen. I heard Jaymz with my own two ears talk about it. His mom kicked him out and he moved in with his frien \"Metal Mike\". their U-HAUL got stolen with ALL their equipment except their guitars. ANTRAX helped them out by giving them equipment after that. ha, im only 15 and i know more shit about MetllicA then alot of the people\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nIt is true what the people say the bands equipment being stolen. I heard Jaymz with my own two ears talk about it. His mom kicked him out and he moved in with his frien \"Metal Mike\". their U-HAUL got stolen with ALL their equipment except their guitars. ANTRAX helped them out by giving them equipment after that. ha, im only 15 and i know more shit about MetllicA then alot of the people\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nThis song is my favorite Metallica songs of all time. \r\nIt is immensly morbid.\r\nI'm not going to state the meaning.\r\nThe meaning is not complicated, obviously about not wanting to live life anymore, and so on.\r\nBut it is amazingly written. \r\nThe emotion in Hetfield's voice takes my breath away. \r\nIt makes me cry everytime I listen to this song.\r\nPlus the guitars are awesomeee:D \n\r\nxx\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nthe bands equipment was stolen, and his mothers tragic death inspired james to write this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nhey newfoundfinch your an idiot, if they suck so much then dont bother looking up the lyrics to any of there song dickhead..\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\ni think this song is just about someone who is depressed...poor metallica..they're career certaintly \"faded to black\" after the black album, \r\nugh the fact that they said \"we're in love with our new album\" just sickens me because they're new shit sucks!!! i think it means like, they quit having\r\nthat edge to make the same music that lived up to the name of metallica, the same par of adrenaline based music...so its like, only till i die, will\r\ni see the truth in myself...just what i think! if that makes sense. maybe when metallica dies they'll realize what sell out douchebags they became..hey man, you can't blame them though, the money and the fame will drive anyone nuts, combined with alcohol...sorry if this offended anyone!\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nlike, i guess i meant like, they reached such a point that like, they were such musical prodigies that like, theres no way, anyone can keep making continous amazing songs...unless your led zeppelin...lol, i think after metallica gets all the fortune and fame out of there head, they'll realized the best music they ever made was the first couple of albums, but that is my opinion only!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nlike, i guess i meant like, they reached such a point that like, they were such musical prodigies that like, theres no way, anyone can keep making continous amazing songs...unless your led zeppelin...lol, i think after metallica gets all the fortune and fame out of there head, they'll realized the best music they ever made was the first couple of albums, but that is my opinion only!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nlike, i guess i meant like, they reached such a point that like, they were such musical prodigies that like, theres no way, anyone can keep making continous amazing songs...unless your led zeppelin...lol, i think after metallica gets all the fortune and fame out of there head, they'll realized the best music they ever made was the first couple of albums, but that is my opinion only!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nGreat Work..........Great Band\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nsimply brilliance.\r\nmetallica is and always will be one of those most awesome metal bands ever.\r\nmusically; this song is genius. from the initial intro, to the solo's, to - everything really.\r\nlyrically; i would'nt just limit it to saying this song is simply about suicide, or about all there stuff getting stolen. It could just simply be that life's bitches have all rushed up on them at once, causing deep depression.\r\nbut one thing i'm totally sure of; whoever said this song was a tribute to cliff's death was a fuckhead and a hoarder of cock.\r\nif you actually LISTENED to the song and actually LIKED metallica, you would be able to pic out his bass playing, because i believe that cliff, jason and robert all have their own individual styles. so therefore; cliff could not be dead. not to mention the fact that he died 3 years later. so stop having kinky and disturbing sex with monkeys and get your fucking facts right you fucking fuckity fuck.\r\nrip cliff.\n\r\npeace.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\noh! and i will hunt \"newfoundfinch\" down and saw his balls off with a razor wire if he ever opens his shit filled mouth again :)\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nMe too.\n\n\r\nPretty much every song on Ride the Lightning is about death in a different way. FFwF is dying in a fire, Ride the Lightning is Electrocution/execution, Trapped under Ice is drowning, For whom the bell tolls is war... And fade to black is suicide.\n\r\nAND I LOVE IT\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\n i saw this song live in istanbul, on july 08! it was GREAAT! the best song you can listen to, and james goes of and says, \" do you feel it?\" \"DO U FEEL IT?\" \"DO YOU FEEL LIKE I DO?!!!\" and then sings \" No one but me, cant save my self but its too late\" part! thats when u really do feel it!\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nThe song is obvious but deep.  They really paint the picture well on this one. Its obviously about a guy thinking about suicide. \t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nI know I've commented on this song before, but god damn it is just the greatest song ever written.  Period.  It's been my favorite since the day I heard it, and for good reason.  It's impossible to find a better song than this and I dare anyone to try.  It has great lyrics, a great riff, a great solo, great vocals, great drumming (what's there, at least), great bass, a great chorus (the heavy guitar riff), the best acoustic part to any song ever (the first half), and to top it all off it's THE most emotional song I have ever heard.  No other song has made me feel the way I do when the acoustic guitars break in at somewhere around the 1:00 mark (give or take 20 seconds, i don't remember) and no other song has a solo as meaningful and telling as the one in Fade To Black.  Even if there were no words at all in this song, the music itself tells a story and when the solo hits its peak and the narrator presumably ends their life, it will bring tears to your eyes.  And then, so as never to have a dull moment, the song fades out almost immediately after the solo.\n\r\nI dare anyone to find me a better song than this.  I've been searching every day since mid-July 2005 and haven't found one even close.\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nBy the way, anyone who thinks this song is written about the stolen amp needs to get their head checked.  The song was most likely inspired by the stolen amp, but it's obviously not written about it.  It's as clear as day that the theme of the song is suicide.\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nthis song is about cliff burton.\n\r\n\"growning darkness taking dawn, i was me but now he's gone\"\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\n^ For Christ's sake, when will people stop saying this?  Burton died after Master of Puppets was recorded (ie. their THIRD album, whereas Fade To Black was on their SECOND album).  He even has writing credits on this song, for the love of God.  Are you implying that he helped write a song about HIS death, two years before it even happened?\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\njames wrote this because he felt depressed and worthless after the band got robbed\r\nits about shit he felt as a kid\r\ncliff wrote the bass and some melody thats why he has credits for it\r\nthis is what i think of when i think of the perfect song; everything is just brilliant \r\nand i love the drums during the last solo its fukcing awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nthis song is for depressed people to listen to and commit suicide.\r\non the other hand, In My Darkest Hour, by MegadetH, is for depressed people to listen to and carry on.\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nLike all tracks on Ride the Lightning, it's about events where you can stop it from happening but when you do it it's impossible to escape.  You can stop from committing suicide, but when you start, it is impossible to stop.\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nhey guys, new to the site...\n\r\nrecently, this song has hit home for me too...\n\r\ni think yes, the amp being stolen made jaymez upset and stuff..and yes, u an probably say there's other elements that we've ALL been thru that at times we feel there's nothing left for us, and that the only way out is to end it all...\n\r\nbut for some reason (and mabye im looking into it too much), i feel that there's MORE to this...to me, it's about a guy who is depressed, wants to end it all, but suicide isnt just the answer. This guy is drifting into a madness that few people have, and he's about to do something INCREDIBLY vicious and grim and drastic, and whether or not he gets killed afterwards, or kills himself afterwards, that \"old\" him, that person he was..that person is GONE\r\n\"growning darkness taking dawn, i was me but now he's gone\" \r\n---i think, CLEARLY, this guy has lost his mind, split into another person (speaking about himself in the 3rd person) and this new, evil version of himself has risen out of his old self fading away. \r\nIts easy to look at this song and say \"someone is so sad and depressed, he thinks about suicide.\" But i think the harder, faster parts of this song insinuate this is more than just some guy wanting to off himself. Those riffs indicate a tremendous darnkess growing inside this guy that has finally erupted and changed who he was into this human demon, and he does not know his next STEP, much less his next choice in life. \r\nTo put it in physical terms, maybe its the guy who goes on the killing rampage in hopes that the cops will kill him, police suicide or whatever they call it.\r\nTO me, Metallica's lyrics are MORE than just what they seem---they're too deep and too good of a band to simply just be what is written. The old Metallica anyway (i for one do NOT kill the band for their newer stuff..the older stuff is way better yes, but i still get fired up for virtually any metallica song).\n\r\nAgree, disagree, i dont care..this is what I THINK, and when i hear the song, that is IMMEDIATELY what i thought. This guy has reached the boiling point and there's no turning back...a horrific change is coming...\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nRide The Lightning is superb, and this is its' best track\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\na lot of people say its about suicide, and well yea I can see where people get that. It very well may be about suicide. As I just read over the lyrics I got the impression that it could also be about depression. Falling deeper and deeper into the pit of depression. \t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\ni think it's clear that the song is about suicide. it depresses me every time i hear it, but it's a beautiful song\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\ni think it's funny that people think this song was written about Cliff dying considering that Cliff WAS one of the writers. \\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nIt's about someone who has given life their all and has never received anything to live for in return.  They've only drained themselves of their own spirit any reason to live.  Misery pursues until they decide to end their life.  The person second guesses their self but ultimately decides they feel that death is the only way to reach peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nIts's about a man and this man knows someone who has had a \"deathly loss\" that consumes him with deppresion he starts t0 think about commiting suicide and in turn does hint \"Death Greets me warm\"\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nits not because of the shit being stolen back in that time lars Ulrich  and james Hetfield were obbsesded with DEATH\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nOk, this song is not about Cliff Burton's death. That's so ridiculous, because he played on Master of Puppets, which was released two years after Ride the Lightning. Fade to Black is on Ride the Lightning. And Cliff helped right it. So why would Cliff write about his own death that he didn't even know was going happen? Because it ain't about his god d*mn death.\n\r\nNow the true meaning for the song is (and this is what I just think and what the majority of people think, so it doesnt mean its necessarily correct):\r\nI think this song is about a man/woman, thinking profoundly about committing suicide, and later on in his/her session of thoughts about suicide, he/she decides that he/she is going to do it, and ends up doing so.\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nThis is one of Metallica's best songs, along with One, Enter Sandman, No leaf clover, Master of Puppets and Sad but True, but I think they should have done an S&M version of it because I bet it would have been good.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nFirst i'd just like to say this is one of my all time favorite songs, PERIOD! and definatly the best thing metallica has ever contributed to the musical world. as for the meaning, I think it's about completly giving up all hope on life, accepting that things will never be better, and finding peace in death. you lyrics to this song really moved me, The first time i heard it i nearly cryed. and the instrumental half is just amazing! it's a shame they haven't come out with a good record since the black album, but whatever. a friend let me borrow death magnetic and the only song on it i liked was the day that never comes. tha album must feel really embarassed next to greats like ride the lightning and master of puppets. all good things need to come to an end...\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nRegardless of how/why they wrote it, here's what it means to me: this is the feeling i had after coming down from my best LSD trip. During the trip, I encountered \"god\" for the first time, everything in my life and in the universe made sense. after that trip faded away, the peace & knowledge that i had found drifted further away. nothing else mattered. without that insight it was difficult to live my old boring life. \"need the end to set me free\" was like jim morrison's \"break on through\". things weren't what they used to be, missed ONE (i.e. the one true reality) inside of me. emptiness is filling me (i.e. the buddhist notion of \"emptiness\"). \"I was ME but now he's gone\"; I was one with god (so to speak) but that feeling is now lost. like \"don't fear the reaper\", the song is probably not about psychedelics. but that doesn't mean that it can't be.\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nI really love this song but its kind of funny him writng it over losing an amp\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nobviously the song is about suicide. Everyone knows the background by now. \n\r\nThis is one of my all time favs. It's not only a beautifully orchestrated piece, but it means a lot to me. Helped me through some damn rough times. I've actually been thinking of getting a tatt with a few lines from this song.. a little reminder that thing's will get better.. just gotta work and fight for it. It's a dog eat dog world out there..\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nFUCKING METALLICA U GUYS KEEP DOING IT\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nI've heard once they were inspired also from Remember Tomorrow, from Maiden, and if you analise them you can see they are very similar, such as in the lyrics, and in the instrumental part, it begins calm, with an acoustic guitar, then an instrument-only chorus, then a violent part with solos and stuff\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nTo me:\n\r\nLosing touch with everything you once knew. Everything becoming black, suffocation. No reason to go on, I must end it all.\n\r\nBeen relating a lot to this song recently.\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nAll the evidence provided by fellow commentators above, below and around, point to conclusion that for James the all important music gear completed him and that without it he lost part of his essence.\n\r\nThe musical metaphor, and equation to the suicide is pretty much how one can feel is the only way to deal with loss of oneself, when your soul is ripped out of you and there is nothing what you can do,  the space will be grow back some day but the memory of what you lost will remain. \n\r\nJust think of the way you feel when something/someone important to you, completed you, made you one, was lost, stolen, gone, take or simple walked away from you. You are empty and lost, with no will to live...\r\nMeaningless existence and its pain silenced by deathly embrace.\n\r\n It is powerful song of grief and of emptiness in this void where powerful emotions , instincts and conscious thoughts are spiralling out of control in their last ditched fight for control of this body, that finger, that thought, that trigger. \n\r\nWell he moved on luckily to actually Sing This Awsome Song. Now that i know the circumstances of its inception i like it even more. \n\n\n\n", "comment_248": "\nThat whole stolen amp incident?\r\nFrom what i read it was his late mother who had bought James equipment ,and the loss of them was a catalyst\r\nfor his depression.Either fucking way the song is about Suicidal thoughts no matter what .\n\r\nOne the greatest Metal songs of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nYeah, this song is about suicide, according to Jaymz. Such a touching song, and I'm sure more people than just myself can relate to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nOk I am a big metallica fun and I came up with this little story based on the titles of metallica songs. the titles are in capital letters.\n\n\r\nI park my 2*4 and step out, home at last but Iâ\u0080\u0099m in a FRANTC state thinking about my narrow ESCAPE. I get into the house and I drink some of my WHISKEY in a JAR but that doesnâ\u0080\u0099t ease the pain clearly caused by the THORN WITHIN. At this point even i know the only solutions to deal with the STRUGGLE WITHIN. In the SMALL HOURS of the morning I stare into the dark night and see ORION, but now is not the time to think about ASTRONOMY the pain is too much it feels like I'm TRAPPED UNDER ICE yet I cant seem to convince myself that its my fault, betrayed by who i thought was a friend and betrayed by THE JUDAS KISS now I go towards my bed in this old rugged house, how am I supposed to sleep in THE HOUSE THAT JACK BUILT after I shot him between the eyes and left him STONE DEAD FOREVER and at that point it felt like NOTHING ELSE MATTERS. I close my eyes and try to sleep hoping it will all just FADE to BLACK but THE MEMORY REMAINS clear to me that I will always be UNFORGIVEN and it worries me because the things i just did make me wonder AM I EVIL. This cant be I was raised right how did I turn to this BAD SEED I know what I did was wrong but I canâ\u0080\u0099t feel it, itâ\u0080\u0099s like I am on ANESTHESIA.\n\r\nI had lost my mind when I decided it was KILLING TIME, I ran around taking them all out high on drugs I believed I was the INVISIBLE KID and the opponents I took out one by one where DISPOSABLE HEROES. I canâ\u0080\u0099t sleep so I stay up looking at the DIRTY WINDOW and start to think maybe its time I DISAPPEAR because right now I am CREEPING DEATH at any point the cops and feds will be all over looking for me. For so long I looked forward to exerting my revenge but that day seemed to be THE DAY THAT NEVER COMES nothing hurts more than taking the life of your BROTHERS IN ARMS. The pain was too much yet still I feel like the HERO OF THE DAY and I decided not to think about what others thought of me after all to the one who I was revenging I would always be the perfect PRINCE CHARMING her LOVERMAN as was the case when she lived and everyone else called me KING NOTHING. As my nerves began to calm I remember what MAMA SAID about salvation forgiveness trusting in God and THE FOUR HORSEMEN but I will not pray to THE GOD THAT FAILED seeing as he let my loved one die she truly was MY FRIEND OF MISERY so I decide to live the rest of my life with NO REMORSE.\n\r\nKnowing my fate as I step into the bathroom that bottle of CYANIDE seems appealing but I will not give up I will FIGHT FIRE WITH FIRE. Arrested I find myself locked in a SANATARIUM because the cops couldnâ\u0080\u0099t believe any normal person could do what I did. The DEVILS DANCE is what they called it and maybe this is where I would spend the rest of my days on THE FRAYED ENDS OF SANITY. A brilliant mind I donâ\u0080\u0099t deserve to be here but what i did deserves to be punished and that is SAD BUT TRUE. At this rate I donâ\u0080\u0099t think even a priest can PURIFY my soul. I think of to myself POOR TWISTED ME but I decide to not have self pity because when it comes to who killed those men I will always be the ONE. From a motherâ\u0080\u0099s boy RONNIE went on to become a killer and sometimes I would think SO WHAT right until the judge decided i would RIDE the LIGHTENING. I know I am SOME KIND of MONSTER but do I really deserve to die. The judge is not letting me off easy as he proclaims THAT WAS JUST YOUR LIFE and now youâ\u0080\u0099ve reached THE END OF THE LINE. Alone in my cell I think it seems I have become THE OUTLAW TORN thinking about SUICIDE AND REDEMPTION what to do I cant let them kill me oh the STRUGGLE WITHIN talk about THE THING THAT SHOULD NOT BE. After a nights sleep I think maybe its fine after all TO LIVE IS TO DIE what is this THE UNNAMED FEELING maybe its time to TURN THE PAGE. \t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\n\"Emptiness is filing me\" The most wonderfull quote in this song\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nCreeping death is the best metallica song ever\r\nin the break down with a die chant is one of the most raw and insane metallica moments\r\never seeing that live will make you cream in your jeans\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nThis song is about the despair of living a meaningless life that is always moving closer to ending in death.  \t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nThe songs lyrics are talking about a person who feels that their life sucks and there is nothing worth living for anymore so whats the point in living? His life is just nothing and all he feels is torture through himself and just wants it to end... feels like it would be better for him and everyone if he was just gone, and he wouldnt have to worry about anything anymore... he would be free...\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nIf you didnt notice the album, Ride The Lightning is based around death, which is probably because james was obsessed with it. The song is about someone who just gives up in life because they cant handle it anymore. In the last lyrical parts he is thinking is worth taking my life but he knows the pain wont go away so he just says goodbye anyway \t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nTHIS SONG ABOUT BECOMING OLD ...\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nThis song is really sad. One of my absolute favorites by Metallica though. It's so real.\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nThis song sounds like it's about suicide but I read their biography and oddly it's about them getting their instruments stolen.\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nThe song is about wondering if this life is worth living and wishing to be dead. In the last 2 verses the person in the song realizes life is too good to let go, but by that time, its too late: \"No one but me, can save myself but its too late.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nEveryone else has pretty much nailed down the meaning of this song so i won't elaborate on that;just to say Who the fuck is  \"RICK HOLLYWOOD PAGAN\" and why the hell is he  given writing credits on this track??\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nmetallithrasher2k2  you are correct,  I read that also in Hit Parader\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nThe song \"Fade To Black\" can be interpreted in a few ways, such as suicide and death itself (which is true), but my personal perspective of this beautiful yet bleak song, is it about a child, father, mother or just about anyone dealing with the loss of someone dear to them and going through the stages of grief; most notably Denial/Isolation, Anger, and Depression. \n\nThe song begins with the lines â\u0080\u009cLife it seems, will fade away. Drifting further every day.â\u0080\u009d This represents the opening up of the singerâ\u0080\u0099s feelings of depression and how they see life. Life and everything around him seems to be leaving them and fading away. It then follows up with â\u0080\u009cGetting lost within myself. Nothing matters, no one else.â\u0080\u009d This is a very vivid and strong set of lyrics because it shows how the singer is in such a dark space that he/she is so under the sense of darkness that they are just to themselves and so destroyed by the loss of their loved one, that they donâ\u0080\u0099t care about anything else or anyone, they are just simply in a coma like state. This can be shown as the stages of Depression and Isolation.\n\nâ\u0080\u009cSimply nothing more to give. There is nothing more for me.â\u0080\u009d The loss of a loved one can be brutally heart breaking and soul crushing, especially of one such as a parent of a sibling. These lyrics show how they just canâ\u0080\u0099t see a life without this person. There is no possible way that they can move on from them, as if they were their life source and motivation to keep moving forward and now without them they feel as if they have no more meaning to the world. The use of the word â\u0080\u009cnothingâ\u0080\u009d twice back to back also has a deeper meaning. By using the repetition of the word, the artist is conveying and really emphasizing the feeling of â\u0080\u009cnothingâ\u0080\u009d, how theyâ\u0080\u0099ve been drained of all hope.\n\nIn the next verse, the lines â\u0080\u009cThings not what they used to be. Missing one inside of me. Deathly loss, this canâ\u0080\u0099t be real.â\u0080\u009d This is taken place a while after the passing, being it say the words â\u0080\u009cused toâ\u0080\u009d are past tense. They finally reveal that it is indeed the loss of another being. Yet once again, it is shown how the loss is like having a piece of their soul taken away. The lyrics â\u0080\u009cthis canâ\u0080\u0099t be real. Cannot stand this hell I feel.â\u0080\u009d Is the person in utter shock. They canâ\u0080\u0099t just seem to grasp the fact that they are gone and they will never return, as if they stay up nights and just think that over and over, theyâ\u0080\u0099re gone. \n\nâ\u0080\u009cEmptiness is filling me. To the point of agony.â\u0080\u009d Is yet another set of words that have a significant meaning to the whole song.  It represents the total black hell they are in. It is also an oxymoron, as they are empty and feel absolutely nothing, yet the feel the excruciating pain of infinite despair. It continues to say â\u0080\u009cGrowing darkness, taking dawn. I was me but now heâ\u0080\u0099s gone.â\u0080\u009d The singer has transformed into a totally different person, in the wrong way. He is no long the person that used to be him, possibly positive, happy. He now seeâ\u0080\u0099s nothing but a lifetime of living in a blinding darkness of hell and grief. Thereâ\u0080\u0099s no going back to the good olâ\u0080\u0099 days when that person that was once alive and made everyone happy and just the best person, and they were taken away so young and with so much more to give. The artist once again uses style and language with the lyrics â\u0080\u009cGrowing darkness, taking dawn.â\u0080\u009d, as dawn being when he sun begins to rise, is instead replaced by a blanket of misery.\n\nTo conclude the song, the artist sings â\u0080\u009cYesterday seems as though it never existed. Death greets me warm, now I will just say goodbye. Goodbyeâ\u0080¦â\u0080\u009d I feel as if these lines are meant to be taken literally. The day the person left the earth seemed a daze, like it wasnâ\u0080\u0099t real. Then one of two things is implied. One being, when sung, â\u0080\u009cDeath greets me warm, now I will just say goodbye.â\u0080\u009d, that the person has come to peace with the persons death, and they understand it, so they say goodbye to the person, as most humans mourn for a very, very long time, and once they find peace they then say good bye. On the other side, the person could mean that death is their only option, as they just simply cannot understand why they are gone, and they cannot bear to live without this person.  From a person point of view, I was once in the position of this person, as I was deal with my fatherâ\u0080\u0099s death from over a year ago. He had passed away the last day of school after being in the hospital for 3 days. His last words to me were â\u0080\u009cIâ\u0080\u0099m sorry David.â\u0080\u009d I didnâ\u0080\u0099t think much of it, as he frequently went to the hospital, but he would always return. He had been sick for many years, but for some reason, he had passed on that day. I had felt and went through everything the song describes, from the depression and anger and denial, to the sound of the guitar and the way the lyrics are sung, but yet somehow I finally came to terms with it. As should anyone else dealing with loss.\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nAlmost everyone relates this song to suicide - and I don't disagree - but this should be the National Anthem of Alzheimer's disease.  If you have ever seen someone 'Fade to Black' from this disease it is positively eerie how it describes the person slipping and fading away when you hear these lyrics:\n\r\nLife, it seems, will fade away\r\nDrifting further every day\r\nGetting lost within myself\r\nNothing matters, no one else\n\r\nI have lost the will to live\r\nSimply nothing more to give\r\nThere is nothing more for me\r\nNeed the end to set me free\n\r\nLove the line need the end to set me free.  My father and brother from cancer and my mother from a huge stroke - was so happy for the end to come and set them free as they had already faded away so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nWhat are you people talking about??  THIS SONG IS ABOUT KILLING YOURSELF!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nThis song is about killing yourself!  That's it!\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nThis song may obviously have different interpretation to different people but to me, it's about suicide. It's about feeling lost in your own mind (\"Getting lost within myself\") and empty. It's about missing the old, the happy, and the hopeful version of yourself (\"missing one inside of me\" | \"I was me but now he's gone\n\"). It's about forgetting how it feels to be happy or even how it feels to feel (\"Yesterday seems as though it never existed\"). This song was so relatable for me once that I was going to write its lyric in my suicide note. This is my most favourite song of my most favourite band and I will never get tired of hearing it.\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nâ\u0080\u009cLife it seems, will fade away, Driffting further everyday.â\u0080\u009d â\u0080\u0094 Realising that death is inevitable. Every day we all stray closer to death.\n\r\nâ\u0080\u009cGetting lost within myself, Nothing matters, no one else.â\u0080\u009d â\u0080\u0094 Thinking about the person youâ\u0080\u0099ve lost and realising theyâ\u0080\u0099re the only one that mattered.\n\r\nâ\u0080\u009cI have lost the will to live, Simply nothing more to give.â\u0080\u009d â\u0080\u0094 Now that the person you loved has gone you feel hopeless and alone.\n\r\nâ\u0080\u009cThere is nothing more for me, Need the end to set me free.â\u0080\u009d â\u0080\u0094 Not knowing how to live on without the lost one. Only at the end of your life will you see them again.\n\r\nâ\u0080\u009cThings not what they used to be, Missing one inside of me.â\u0080\u009d â\u0080\u0094 Without them you feel completely changed and different. They were apart of who you were.\n\r\nâ\u0080\u009cDeathly loss, this cant be real, Cannot stand this hell I feel.â\u0080\u009d â\u0080\u0094 Not willing to accept that theyâ\u0080\u0099re gone. But knowing the truth feel incredibly sad.\n\r\nâ\u0080\u009cEmptiness is filling me, To the point of agony.â\u0080\u009d â\u0080\u0094 You are overcome with loneliness and canâ\u0080\u0099t take it.\n\r\nâ\u0080\u009cGrowing darkness, taking dawn, I was me but now heâ\u0080\u0099s gone.â\u0080\u009d â\u0080\u0094 The pain and darkness has taken over and you know youâ\u0080\u0099re going to be a different person without them.\n\r\nâ\u0080\u009cNo one but me can save myself, but itâ\u0080\u0099s too late,â\u0080\u009d â\u0080\u0094 You are the only person that can help you live on without them. But you donâ\u0080\u0099t know if you can do it.\n\r\nâ\u0080\u009cNow I canâ\u0080\u0099t think, think why I should even try.â\u0080\u009d â\u0080\u0094 Is there any point in trying overcome this loss. Doubting that you can live on without them.\n\r\nâ\u0080\u009cYesterday seems, as though it never existed,â\u0080\u009d â\u0080\u0094 Being completely stunned by the loss you have experienced, thinking back to the times you had with them knowing youâ\u0080\u0099ll never get to see them again.\n\r\nâ\u0080\u009cDeath greets me warm, now I will just say goodbye.â\u0080\u009d â\u0080\u0094 Realising that they are gone and that you must continue to live. When you die, you will be greeted with your loved one.\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nowsome!!!! i love this song!!  a little fyi newfoundfinch is gay !! he likes butt sex!! METALICA\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nmetalia put out 5 other albums after black.  garage inc, load, reload, s&m, and mi2. newfoundfinch is gay. there coming out with a new one this year so dont be gay\n\n\n", "comment_270": "\nin comparison to most metallica songs, this one's crap\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nduh this song is about james' stolen rare ass amp, what asshole would steel one of the rares amps in the world that belonged to metallica's guitarist but whatever IRON MAIDEN is beter!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nduh this song is about james' stolen rare ass amp, what asshole would steel one of the rares amps in the world that belonged to metallica's guitarist but whatever IRON MAIDEN is beter!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nYes, all you people saying it ISN'T about suicide, James said so himself on MTV Icon.\n\r\nAnd anybody who beleives this song is about a stolen amp is a moron.  Sorry.\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nhey i dnt like the long comment at the top just because ur 13 dnt mean u cant be a fan ive listened to metallica sice birth asshole\n\r\nan by the way he wont talkin about me\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nhey i dnt like the long comment at the top just because ur 13 dnt mean u cant be a fan ive listened to metallica sice birth asshole\n\r\nan by the way he wont talkin about me\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nthe intro is the best part of this song.  its downhill after that\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nI was reading the comments at the top and crap...and i kept reading people talking about the stolen amp... that made me kinda upset. I mean... how can you make a song like this from a fucking amp? but then again... people talked about it being about suicide. That seems like a better explanation to me... newfoundfinch is a fucking prick who listens to pop punk and thinks \"shiiiiiiiit... I don't have to listen to metallica... they're never on mtv...\". \r\nAnd people who start talking about mtvICON... dont get on my case... I saw that when i didn't no that much about metallica... I just knew a few songs that they played on it, but not many. And finally, I agree with spikemeister, you can still be 13 and be a metallica fan... hell, i am. I have the older albums and i think they're awesome, bitch.\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nthis song is probably my favorite metallica song. i miss cliff! duh it's about suicide. stolen amps are just stupid things to write a song about. unelss he was like really really really really emotionally attached to the amp and wanted to marry it or something, but that's just stupid. metallica will never get better than this song. it's so amazingly good and sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nok this song is definatly a suicide note... the funny thing about it is that if this was done by.. saysome emo band (mind u i only learnt wot emo was 24 hours ago) all the posts on this sote would b like \"oh i can connect with this song\" and \"i cry my eyes out everytime i hear this\" blah blah blah...\"im so suicidal\" im impressed that there r people who use this web page for wot it is about (i no im contridicting myself by posting this... my bad).\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nyea...raw134...u said it...i'll be making my grandkids listen to metallica!!!1 this song is sooooo fucked up!!!!\r\nits one of my favorite tallica songs....\r\njust goes to show....metal lives on...\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nmetallica fukin rocks. this is the best song in the world....its bout suicide and it really deep.\r\nomg.... some dumb kid in my class picked this song fade to black for this song project we have to do and im so pissed off cuz i was gonna do that song cuz its mi fav. and he doesnt even no anything bout metallica and how much the lyrics n the song fade to black mean. \r\nbut neways..... rock on metallica!!!!! \r\nHAMMETT IS THE BEST GUITAR PLAYER EVER.\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nThis is my FAVORITE SONG EVER!!!!\r\nits so....morbid.\r\ni listen 2 it when im sad. then i cry so much because of this song and the thought behind it, that i forget wat i MYSELF am sad ABOUT! its wat u would call un educated psycological theripy.\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nI think kirk wrote this song,after cliff died. I say kirk because the night of the crash kirk and cliff played cards to see who gets kirk bunk cause cliff always wanted his bunk. cliff won so he got the bunk, so really if you think about it it should of been kirk. thats what i think of the song if im wrong im sorry dont get all pissed.\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nfucken pussies metallica sucks my asshole this faggoty song is about someone who stole an amp from metallica woopdi fucken do those fuckers are pussies fucken cry about it commit suicide FUCK YOU METALLICA LICK MY SACK\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nu wanna no wut ironmadenman.... go fuck urself! get a fukin life...cuz u obviously dont have one if ur dissing METALLICA. and by the way they had to look in 2 other countries just to find an identical amp.and if u knew anything u would no that they were attached to there equiptment like it was there own kids. they were devistated when it all got stolen. wouldnt u?...prolly not (ironmadencrap) u are selfless and get the fuck off this page....come back when u get some sense knocked into u and can realy realize ho great and powerful this song is. TILL TELL FUCK U! \r\nMETALLICA ROCK ON!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\n^^^^****TILL THEN FUCK YOU****^^^ lolz\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nWell, I can imagine that made them dipressed!\n\r\nOh, If metallica ever make a better song... Ill kill the pope! Its amazing. Lyrics, guitar, meaning, chatchy as hell, this song has the lot!!\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nThis song is a tribute to Mike Burton, the original bassist for Metallica and how the band feel about their life and the band without him\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nCorrection....NO WAY Hammet is the best guitarist ever.I cud name a million guitarists who are better than him,.... MUSTAINE,Friedman,King,Hanneman,Dimebag Daryll,Zakk Wylde,Gilbert have u ever heard of them?\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nHey dollsteak...u want smthn morbid,listen to seasons in the abyss by slayer\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nIt has a nice alow beat to it and you can dance to it , too.\r\nHowever I like some other bands like Boney M and ABBA a little better. They have kind lyrics not just a nice tune. In the '70's there were warmer songs than this.\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nthis song is gr8!!! kirk will go down in history for this song! thank god for joe satranni who taut kirk and many otha gr8 guitarests! this song really lifts my spirit wen i listen to it...no matta how corny that sounds.... though it is a little weird that they wood right a suicide song after theri equipment got stolen! lol.... wats weird is that this song shood be on their \"black\" album and not on ride the lightning....it would make alot more sence that way....ah wel....GR8 SONG!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nnewfoundfinch! it's 2005, u wrote that in 2002! i hope by now ur dead! FUCKER! METALLICA RULE! IF I EVER FIND YOU I WILL BURY YOU ALIVE!\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\ni first heard this song as the orchestra collab version and it inspired me to choreograph a dance (im a dancer...obviously) for this dance i won 1st in competitons and i think that it is a truly beatiful song. I then heard the original and i have to agree after reading the lyrics that it has a great deal to do with suicide or cliff burton dying in the bus accident and it would have been evoked by a emotinal accident as some say the stealing of their equipment. i think that this line \"No one but me can save myself, but it to late\" shows that it is about suicide and in suicide only you can make the judgment that you dont want to take your life. its a very sad and beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nHey look above me everyone it's a retard!!! ^_^\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nOne of the most depressing songs ever but when im feeling down i always listen to it cos it makes u feel ur problems are nothing. its awesome and an inspiration to everyone - Hetfield is my idol and a god - all their songs seem to really reflect their mood its amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nSome of my previous comments have offended some of my dear American chums who spend too much time on this website, then go out to town on their little fat scooters. However, I understand why such comments would be offensive as your stupid little American brains of which don't have the independence to accept new humour due to the excessive amount of Big Macs you eat result in ruptured brain cells. Metallica also happen to be shit and lack talent. Their singer lacks imagination and the ability to sing. The guitarist is incapable of playing melodic tunes and the drummer is about as good as a retarded ostrich on roller blades. If any emoâ\u0080\u0099s are reading this, please jump of a bridge/midge.\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\nt tom, how the fuck can you say Metallica is talentless.you should have your neck slit with a fucking spoon.and dont be mad cuz you cant get a green card to live here.i noticed you didnt have any bands listed on your profile....of course,i'd be embarrassed to admit that i like Ace of Base too you cum guzzlin johnson sloshin big ole nuts in your mouth faggot!!say hi to your mom for me! Metallica rules forever ho!!and since Fade to Black didnt do it for you, listen to Call of the Ktulu.hard to talk shit about that one\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\n''I need the end to set me free''\n\r\nHaha i take it James doesn't believe in life after death then\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nI heard dat this song wos written when the bands amps or instruments or something or ova wos stolen ???? and they thought that they cudnt carry on but i dont know if its true or not but hey\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nThis songs is awesome.  \"Emptiness is willing me to the point of agony\" that pretty much explains how james felt after their stuff got jacked\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\nOk, theres alredy shitloads of comments here... and thasts no surprise. Possibly the best song ever to happen... Its beyond words *humms the riff*\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nOk, theres alredy shitloads of comments here... and thasts no surprise. Possibly the best song ever to happen... Its beyond words *humms the riff*\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nso glad to see that most people appreciate the pure godliness of metallica, but there are still some people that death has unfortunately failed to meet... t tom, may i suggest that you go into your room, shut the door, and then stab yourself in the stomach several times, as the painful death would be fitting, and if you feel like being nice and ironic, maybe we have the perfect suicide note here for you...?\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nI don't like this song...I think the whole concept of the Ride the Lightning Album is dumb...its all about death, and this song is about suicide!\t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\nUNBELIEVABLE!!! This is the 2nd best Metallica song (and 2nd best song of all time).  This is a slap in the face to all those dumbass motherfuckers who say Metallica can't write great ballads.  The song is so beautiful, great song to relax to.\t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nUNBELIEVABLE!!! This is the 2nd best Metallica song (and 2nd best song of all time).  This is a slap in the face to all those dumbass motherfuckers who say Metallica can't write great ballads.  The song is so beautiful, great song to relax to.\t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\ni don know what to write...rather i wd not write...not only becoz i blv no words are gd enough to describe the gr8ness o this song...but more than that i blv that no words r gd enough to describe what i feel abt this song n MetallicA\n\r\nplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplzplz\n\r\nfor god sake...n for the sake o burton's soul...dude come back to what u ppl were bring back the gd ol days...hey james! ulrich! kirk! create sm gd stuff man!...still love u n respect..\r\nYNWA\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\ni dont rember if ie put a post on her, probly have, but this songs kicks ass...look at all of these comments, cannot get over how such a good fucking song this is! METALLICA FUCKING ROCKS\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\nI want this played at my funneral.\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\n^ just wat i was about to post ! biatch!\n\r\nahah\r\nthis song is just SEX\r\nMetallica is just SEX\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nThis isn't a ballad Ktulu, Ballads are about love, this is about the complete opposite. Lmao.\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nYeah suicide.\r\nbtw all u twats that said bad stuf about metalica. u will all die a horrible and painful death. i shall personally kill u in one of my seven favourite painful ways. just you wait.\r\nanyway.\r\nthis song helped me thru a stage of depression.\r\nit sounds a bit dum bt it woz about a girl who i thort didnt like me.\r\nan loads more 2 bt mainly that.\r\nit basicaly described how i felt so\r\nhelped a lot.\r\nim now goin out with sed girl so :D\r\nmetallica rule  got me into metal.\r\no ye btw sum guy sed that ppl who listen 2 heavier metal disregard stuff with meaning. \r\nBULLSHIT.\r\nyou can join th ppl who diss metallica.\r\ni am also into the heavier stuff\r\nit rules as much as metalica do.\r\nsometimes it has as much or more meaning as this.\r\nin more subtle ways it shows worse depression\r\ncos worse depression is more subtle.\r\nanyway this ended up a lot longer than i thort it wd so\r\nbyeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee\r\nmetal rules :D\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nMaybe someone should steal their equipment again if it would make them write decent music again like this.. In fact, you'd probably have to steal their kids, house and even local post offices to evoke some kind of emotion for passionate lyrics liike Fade to Blacks'\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nIt's about the power outages that often occured in L.A. where they used to live. They couldn't \"live,\" or have fun, when it was all dark and the power was out. Look at the lyrics carefully. It's clear to see I'm correct.\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nboohoo METALLICA IM GONNAkill my self!!!But metallica is hard core, fade to black man, im gonna kill my self now, METALLICA IS DEAD!!!Alltheir fans should listen to this song and kill themselves\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\nyeah but it's still about suicide, he was just inspired to write a song with depressing lyrics after all their stuff got stolen.\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nwell the song is pretty all voer the place.  Metallica is one of my favorite bands of all time but I have to admit, their lyrics aren't that good.  The music is beautiful, and I love the structure of the song...but the lyrics really don't do it for me.  \"Jaymz\" has written some lyrics I do appreciate...Mama says, UNforgiven, otheras...but for the most part...they're just Eh.\n\r\n-J \t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\ni read in a guitarworld i think it was that james wrote the song shortly after cliff died...i think it was just something he thought up oneday when he was sittin by himself not knowing how he was going to be able to go on after losing a great guy like cliff\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nWill the world please forget about metallica?  They haven't had cd worth paying for or even downloading since the black album.  Please, someone kill them.  Lars is a piece of shit.\t\t\t\t\n\t\t\t\t\n\n"}