{"comment_0": "\nTo me, this song is about being depressed/suicidal, but knowing that it's bad for other people. I'm in a very similar situation, and the more you tell other people the worse they are because of it. So the best thing to do is just fake everybody out. \"Silence gives you space\" - so many people have told me that they \"need space\" but then they say you're \"not alone\" but it's just not true. He feels he has to fake everybody out for their own good and let them think the silence means everything is good.\n\nI, I'll never be, be what you see inside\nYou say I'm not alone, but I am petrified\nYou say that you are close, is close the closest star?\nYou just feel twice as far, you just feel twice as far.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAdding on to the general idea that this song is centered around depression and \"faking people out\" so they believe he's fine, I believe\n\"I'm so afraid\nOf what you have to say\n'Cause I am quiet now\nAnd silence gives you space\"\nrefers to him, once he's out of the public eye, ceasing to be talkative and dreading having to overthink everything he's done wrong, and how uneeded he is.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI feel like this song is about depression. But feeling like no one understands him. Also not wanting to show someone he loves that side of him. Like the chorus when it says And I'll fall down, and I'll break down and I'll fake you out. The song is about feeling depression but not wanting to show anyone, so he will just act like hes happy and trick people into thinking he is.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI agree with all the other interpretations, except I'd add that it seems Tyler is referencing a struggle with self-harm, specifically cutting, when he says \"And the wrists of my mind have the bleeding lines/That remind me of all the times\nI have committed/Dirty dirty crimes that are perfectly form-fitted/To what I've done and what I'm doing.\" \nI interpret this as him saying he looks at his wrists and in his head he envisions them sliced up (\"bleeding lines\"), leading me to think he used to suffer from self-harm but is trying to break his addiction, yet still he wants to cut himself when he looks at his arms. He says his cutting, or \"dirty, dirty crimes\" are \"form-fitted to what [he's] done and what [he's] doing\", meaning he cuts, or used to cut himself, as a form of self-punishment, almost. He then continues with the song to say \"that's what all the kids are doing\" and if \"you're one of them, you're one of me\", saying he understands and that we're unified in that way.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song hits me for the idea of hiding depression from other people, and feeling like you should just run away without anyone knowing, but since that's been covered I'll give something else I think it applies to. \r\nWhen he says \"I'll never be what you see inside\" it's God he's talking about, and the feeling of trying to live up to being what he thinks you could be is tough because, as a saved sinner, you fall back into patterns of sin. He might have that frustrating pattern in mind when he says, in personification of his own actions , \"I'll fake you out,\" as he is mad at himself and knows he could do better, but it seems like this is the best he can do. He says \"I'm so afraid of what you have to say\" because he knows what God is thinking. \"Because I am quiet now, and silence gives you space\" ...when you're alone you are forced to introspect and his silence gives God room to be closer to him. A long monologue occurs often in prayer because it's one sided, where God does not reply face to face--and that's exactly what the song is: a message to somone. He questions Jesus's claim that he is close...\"is close the closest star?\" Because before he lets God take over in his pain, before he is finally silent, he feels like he's so distant as lonely pain, tearing his sole multiplies...he's scared about being quiet because it gives him space where he can come close to him, bringing punishment, but the truth is He wants to know him and have a relationship and he knows it's just that his brain is sick (but that's ok). In the rap he talks about the day being the same game as it always is, and his crimes are his sins.  \r\nTyler and Josh are Christians, so I don't think this is too far fetched. I'm one too so I know some verses that show he fits the song's description. God sets loneliness in people to bring them closer to him by drawing them to thought. Psalm 68:6\"God sets the lonely in families...\" and for me, that's what got me to finally think about Jesus and realize my need for rescue. I had to force myself further into isolation incurred by the world and when I thought through my pain, I found God. The bible says those who persue him find him, and it's true. It's crazy to see other people like Tyler that have the same story (even if this song doesn't mean this, he talks about it in other songs and interviews). Luke 5:16 says, \"Jesus withdrew into lonely places and he prayed,\" so what I've found is mourning is not just something you do when somebody dies...I need prayer for my sake, that's why God makes it one sided. When Tyler does that twitching thing it's touching cuz I have always had that same strange physical exertion of emotion when I really try to deal with how I feel.  I have to think through all my hurts because sometimes I feel like I spend my whole day faking people out and I finally can get in the shower and drown out the noise and think and pray. That was my life for 2 years of school and I still need prayer like I did then, though I believe in his forgiveness a lot more now. It takes time to really see that you're forgiven. If you think I'm crazy or stupid, trust me Ive actually thought it through. when people try to prove or disprove God's real with philosophy it's just using natural means to explain the supernatural. People only believe cuz he changed them or they see somone has been changed, and Jesus knew that and so he said they will know you by your love. It's really just faith. I guess car radio would've been a better song to rant on but oh well u should probably read the lyrics to both of these songs with my points in mind and see what u get.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI believe that this song is about pretending to be okay. Tyler is feeling distant from the people who claim to want to help him, so he fakes them out. He wants them to believe he is okay, when he really isn't. \"And the wrists of my mind have the bleeding lines that remind me of all the times I have committed dirty dirty crimes that are perfectly form-fitted,\" Tyler is ashamed of his self-harm, and doesn't want the people who are trying to help him find out. He's faking everyone out.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think this song is about being alone and feeling suicidal because of it. \n\n\"I want to drive away\nIn the night, headlights call my name.\"\nBasically these lines say he wants to drive straight into oncoming traffic.\n\nTo me the hook is talking about being alone and depressed but making everyone think that you're fine, hense the lines \"And I'll fall down, and I'll break down\nAnd I'll fake you out\"\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nMe personally, i think this song is about depression. At the beginning he says \"in the night, headlights call my name\" he's thinking about walking into traffic. Then he goes on to say \"I'll never be, be what you see inside. You say I'm not alone, but i am petrified. You say that you are close, is close the closest star? You just feel twice as far, you just feel twice as far. And I'll fall, and I'll break and I'll fake. All i wanna\" i think he is feeling a little worthless. Or feels like hes not living up to the persons standards. He thinks he isn't good enough. He don't want to disappoint the person by tell them about his depression and suicidal thoughts so he hides them inside and its slowly starting to break him, but he isn't gonna show it. Then he goes on talk to about bleeding lines on his wrist, which is cutting. He also talks about kids committing suicide because they feel like they have no control over themselves, their thoughts & their lives. He goes on to say \"our brains are sick but thats okay\" thats him saying its okay not to be okay. Earlier in the song he says \"I'm so afraid of what you have to say, cause i am quite now & silence gives you space\" i think he is talking to his depression. Or his mind i guess you could say. When you're depressed and you're with others is easier to ignore the thoughts. But when you're alone and you're quiet, they become loud and suffocating and theres no way to stop it. \"I'm so afraid of what you have to say\" he's afraid of his mind and what kind of thoughts hes gonna have whrn he's alone. \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI feel like this song is about hiding his depression from people or someone close, like when he says \"You say that you are close, is close the closest star?\nYou just feel twice as far, you just feel twice as far\" whoever he is talking about thinks that they are close to him, but really they are like the closest start which is probably like millions of miles away, he feels that they dont understand and he fakes them out when he 'falls and breaks' he says hes alright and they believe him,and he fakes them out, cause they really arent as close as they say they are, i feel like i have a strong connection to this song, i feel like no one really knows whats going on inside my head,everyone believes you when you say\"im fine/its alright im just tired/im ok\" ect.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI believe that this song is about pretending to be okay. Tyler is feeling distant from the people who claim to want to help him, so he fakes them out. He wants them to believe he is okay, when he really isn't. \"And the wrists of my mind have the bleeding lines that remind me of all the times I have committed dirty dirty crimes that are perfectly form-fitted,\" Tyler is ashamed of his self-harm, and doesn't want the people who are trying to help him find out. He's faking everyone out.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nOkay, so, everyone is saying that it's him lying about being okay, which is probably true, I just always thought he meant basically the complete opposite?\n\n\"I'll fall down and I'll break down and I'll fake you out all I wanna\"\nLike in more of a \"the boy who cried wolf\" way, if that makes any sense? He constantly tested people to see if they would actually care and if they'd do something every time, because if not, why bother telling them when something did happen? Like in a 'if they can't handle me at my best, they can't handle me at my worst' kind of way? And he is just going to do it all he wants, because a true friend would understand where he was coming from, being insecure and pushing people away by pulling them closer, and still show up for him every time, despite it being too much to ask sometimes. That's just how I've always thought of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think the song is about dark times. It reminds me of how we sometimes feel like God is not there knowing that he will never leave us or forsake us. I believe that's what this verse speaks of ....\n\r\nI, I'll never be, be what you see inside\r\nYou say I'm not alone, but I am petrified\r\nYou say that you are close, is close the closest star?\r\nYou just feel twice as far, you just feel twice as far\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI've been trying to figure out what this song means. When you consider the different parts that Blurryface appears at, it adds a whole different set of layers.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI feel that this song is mainly about suicide and slitting wrists. The person feels like they're messed up and that no one understands. They have self harmed and thought it was a crime. They've felt so bad about themself that they've had to lie. They would rather die than try to face the world about their problems.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI believe that this song is about pretending to be okay. Tyler is feeling distant from the people who claim to want to help him, so he fakes them out. He wants them to believe he is okay, when he really isn't. \"And the wrists of my mind have the bleeding lines that remind me of all the times I have committed dirty dirty crimes that are perfectly form-fitted,\" Tyler is ashamed of his self-harm, and doesn't want the people who are trying to help him find out. He's faking everyone out.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI believe that this song is about pretending to be okay. Tyler is feeling distant from the people who claim to want to help him, so he fakes them out. He wants them to believe he is okay, when he really isn't. \"And the wrists of my mind have the bleeding lines that remind me of all the times I have committed dirty dirty crimes that are perfectly form-fitted,\" Tyler is ashamed of his self-harm, and doesn't want the people who are trying to help him find out. He's faking everyone out.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI haven't seen anyone comment on this but after \" Our brains are sick but that's okay\". In the chorus to me it sounds like:\n\"I'll fake you out\nI'll fake you out\nI'll break you down\nI'll fake you out\" \nAnd I thought it could mean he is helping us by breaking us down mentally so we will feel better about our mental illnesses.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI believe this song is about depression and how he wants to keep it hidden. He is sick and tired of people asking \"Are you ok?\" And \"What's wrong?\" So he wants to keep his sadness hidden. \"And I'll fall down. And I'll break down. And I'll fake you out...\" He is sad and 'dying' inside, but he wants to keep it hidden so other people don't worry about him and get nosey. \"I'm so afraid of what you have to say, 'cause I am quiet now and silence gives you space.\" He is afraid that people will judge him because he has dropped the act of being happy and started being quiet. He has given them space to think and realize something wrong. \"And believe me, that's what other kids are doing. What kids are doing are killing them selves. They feel they have no control of their prisoner's cell. And if you're one of them then you're one of me and you would do almost anything just to feel free... Am I right? Course I am convince me otherwise would take all night. Before you walk away, there's one more thing I want to say. Our brains are sick but that's okay.\" He is saying that he is different because other kids are killing themselves instead of trying to fight on their own. He saying that other kids feel like they can't control their inner selves that are actually sad because they are accidentally letting their sadness out sometimes and that he is like them in that way and that they want to feel like they can be accepted because they're sad. He is also saying you that it is okay to be sad by saying \"our brains are sick but that's okay.\" \"You say that you are close, is close to closest star? You just feel twice as far, you just feel twice as far.\" He is saying that everyone says they are there for him, but he doesn't think they are because they don't understand him. He saying that because they say they are there, they \"just feel twice as far\" because they're making him feel different by pointing out he is sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI agree with everyone here but Iâ\u0080\u0099d like to add \n\nâ\u0080\u009cYou say that you are closeâ\u0080\u009d\n\nMeaning, his friends and his family say that â\u0080\u0098hey, weâ\u0080\u0099re here for youâ\u0080\u0099 and Iâ\u0080\u0099ve gone through similar things and when people say that, theyâ\u0080\u0099ve most likely never been through that stuff.\n\nâ\u0080\u009cIs close the closet star?â\u0080\u009d\n\nTyler is confused, did they go through that stuff or is there worry platonic?\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI am tempted by the lights \nyou draw me into your wayward mind and how you believe me to be, yet\nyet you are who I am to be\t\t\t\t\n\t\t\t\t\n\n"}