{"comment_0": "\nits about two bestfriends. the boy falls in love with the girl but she won't say anything back because she dont want her heart broken again. the boy is trying to prove to her he wont break her heart and protect her.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIts pretty self explanatory a boy and a girl were bestfriends and the boy fell for the girl but the girl was too scared because she had her heart broken before and she had a wall up around her heart to protect it and she wouldn't let anyone in but the boy is trying to convince her that he wont break her heart like all the the other guys did but he will keep her safe and that she wont truly know until she lets the wall around her heart down down hence the line \"you cant fly unless you let yourself fall\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI heard this song is for Selena? lol how come? \r\n\"he fell in love with his best friend, when she's around he feels nothing but joy\"\r\nand since when Selena is Justin's \"best friend\"? she had just started to hang out with him just when the world knows him, then they only built a friendship for few months before finally dated.\r\n\"I know you got your wall wrapped all the way around your heart\" proves that its anyone but Selena. how come she got wall wrapped all the way around her heart when the only thing she does is dating any guy who's famous atm?\n\r\nI know I sound like a mean person, but I'm not. I'm just stating my opinion but...honestly I would be really disappointed if this actually tells about her\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nBy:-$uZ@^\nWell,THIS IS Really a sad song and my Fav song among Justin Bieber's Believe  Album.\nThis Has Common sensation of teling that he loves a girl though he can't say he is in love b'coz the girl he is love in is already broken by someone.He thinks he can fix it by loving her and not breaking her again.He thinks it's too late but he will catch if she falls in love.\nHe is too afraid to tell her if se deies or she won't answer his question.But if she loves her they both acn be together forever and ever when she FALL's in LOVE.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt's about his best friend Caitlin Beadles, the song explains itself.\t\t\t\t\n\t\t\t\t\n\n"}