{"comment_0": "\nyou are both right but keep this in mind......now change every word that is \" SHE HER\" to satan\r\nor sing it like if you were singing it to him....\r\nthis is not a coincidence \r\nbut i agree with CB\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nsorry, i dnt mean to get all Christian but a fallen angel is the nephilim in which chris brown is referring to in this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\n[Verse 1]\nIf I could, take a trip, to outer space\nShe(he[Lucifer/Satan]) would be the one, I will see\nWhen I get, to heavens gate\nShe(he) would welcome me with her(his) arms, open wide, and a smile\nWill shadow me brighter(2Cor11:14) than the sun\nShe(he) hasn't had a fair(so-called) chance, so I'll give her(him) one\nLet me tell you who she(he) is, yeah\n\n[Chorus]\nShe's a fallen angel(Isaiah14:12-15), sent from heaven up above\nShe's a fallen angel, waiting for me to love her(him), yeah\n(Know that she's) She's(he's) a fallen angel, take your judgment(so-called) off her(him)\nI know, that she's(he's) a fallen angel\n\n[Verse 2]\nYou know, I could\nHelp her mend, her broken wings\nSo she(he) can fly again(he never will; his time is short)\nBut I don't, wanna lose everything that I've gained(fame, money, power...)\nTurning me a selfish man (oh)\nCause without em my heart just don't go, no more (no more)\nI couldn't take the pain, from watching her(him) fly away\nSo say that you'll stay\nShe's mine\n\n[Chorus]\n\n[Verse 3]\nDon't you\nBaby don't you (don't you worry) worry\nI'm goin' help you (I'm goin' help you ) fly\n(I'm goin' help you fly)\nJust take me under yo (take me under) wings,\nAnd we can reach the (we can reach the) sky\n(we can reach the sky)\nBaby don't you (don't you worry) worry,\nI'm goin' help you (I'm goin' help you ) fly\n(I'm goin' help you fly)\nYo mama, don't you (take me under) worry\nYou goin' reach the (we can reach the) sky\n(we can reach the sky)\nShe's(he's) a\n\n[Chorus]\n\n[Verse 4]\nBaby I know\nI know that they done hurt(so-called) you\nBut I'm here\nLet's take it all away(that's not gonna happen)\nSo if you let me,\nYou know what, just put your heart in my hands\nAnd everything they(God, the angels that didn't rebel, and Christians) say, I take it back(fool)\nLike this\n\n[Verse 5: Reverse]\nYou(God, the angels that didn't rebel, and Christians)don't mean nothing,\nI don't want ya, \nI don't need ya, \nNever loved ya, \nYou're nobody,\nAnd I'll never make it(not to heaven, you won't, unless you get your soul back, chris), \nYou're a mistake(cool story, bro) (oh)\n\nHow art thou fallen from heaven, O Lucifer, son of the morning! how art thou cut down to the ground, which didst weaken the nations! For thou hast said in thine heart, I will ascend into heaven, I will exalt my throne above the stars of God: I will sit also upon the mount of the congregation, in the sides of the north: I will ascend above the heights of the clouds; I will be like the most High. Yet thou shalt be brought down to hell, to the sides of the pit. Isaiah 14:12-15 KJV\n\nAnd no marvel; for Satan himself is transformed into an angel of light. 2 Corinthians 11:14 KJV\n\nyoutube.com/…\n\n\n", "comment_3": "\nThis song is about a girl who is looked at as a nobody,or a girl who did wrong. The song is saying that no matter what happened in your past he still cares about her,despite what everyone says about her.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nBasically he's singing about this girl who he sees hurting from what other people have done to her. But he sees her as something amazing who has such great potential who just needs a little love to reach her greatness, like an angel. He knows he can help her, and she can help him, because together they can be greater than everything. You have to listen to the end of the song carefully because the first time I heard it, I thought he was saying he was going to take back everything he had said to her. But actually he is telling her to tell the people who hurt her to take it back, and tell them that they are nothing if all they do is say hurtful things to people to bring them down.\t\t\t\t\n\t\t\t\t\n\n"}