{"comment_0": "\n\"It's basically about Hollywood and what people think about it and essentially how plastic it is sometimes. It's fun and I think girls can relate to it somewhat, for me it was because of Hollywood but it can really relate to a mean girl, an ex-boyfriend, to whoever.\"\n\r\nby Selena Gomez\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nwayla i agree with you.\r\ni say the same things to myself.\r\nwhy cant people write about more meaningful\r\nthings that people can actually relate to.\r\nok, for instance, hannah mon freaking tana, \r\nher song super girl.\r\nITS SO STUPID.\r\nthe only people who probably like that song \r\nis like a 4-8 year old kid.\r\ndisney stars are horrible at singing.\r\nand to be honest, they cant act either.\r\ni dont want to be offensive to those who like disney stars, \r\nbut im just giving my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nhahaha love this song it practiclly explains all my exes!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWell it is pretty obvious what this song means.\n\r\nI actually like it and people keep saying how its so edited and stuff but who cares? It is a nice song in my opinion and there are BILLIONS of artists out there that are also edited but people just wanna keep bugging Selena. And its not that edited (well the chorus might be but the rest isn't)cause if it was really really edited then her voice would sound really the same as everyone else and you wouldn't be able to really identify it.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI really like it, so catchy!\r\nGo Selena! Can't wait for her new cd!!! \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nso her voice is like touched and shit, but she's really amazing\r\nanyway and the song is so catchy too <3\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI'm pretty sure it's \"what's out of place when you look into the mirror?\" not \"what kind of face when you look into the mirror?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song is really catchy. I love the line:\r\nSmile for the camera\r\nEverybody's looking at you\r\nSmile for the camera\r\n'Cause they're all about to trash you \n\r\nIts so true and just proving how fake people can be\r\nGreat song and i don't care what anyone says, she's a great singer!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nIt's very catchy also a pretty obvious meaning.. but who do you think it's directed at? All the fake people around?\n\r\nVery catchy, we know she has a different but awesome voice, even if it is touched we know she can legitimately sing, or at least I believe so. (: Looking forward to the albummmm! Anyone know the Australian release date?\n\r\nDemi's came out about 2 weeks after the US so hopefully it's the same. Oh, and by the way, are CD's universal? They are aren't they? So I could buy a CD from the US and it'd play anywhere in the world?\n\r\nI heart Selena :)\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nyeah, this has been on repeat since saturday.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song I think is about either Nick Jonas or Taylor Lautner cause there both famous and she says smaile for the camera cause there all gonna trash ya! So i think its a break up song.... idk\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nBasically what I think this song is about is that \n\r\n\"You walk and talk like your some new sensation\" \n\r\n(somebody thinks their all that).\n\r\n\"you spend your money you don't get a satisfaction\"\n\r\nSelena knows that the person is unhappy\n\r\n\"pick up the phone, nobody's on it\"\n\r\neveryone's setting the person up\n\r\n\"when your falling down and the world starts spen'in out\"\n\r\nthey are goin crazy\n\r\n\"and you'll know ill be around\"\n\r\nSelena will be there\n\r\nand if you listen you can hear people like whispering 'falling down',that represents how much people talk about that person\n\r\nSmile for the camera everybody's looking at ya'\r\nSmile for the camera their all about to trash ya'\n\r\nthat shows how fake people are, and that means selena will have to keep her promise, (\"and you'll know I'll be around\")\n\n\r\nI totally Luvs this song, and 4 all y'all haters\r\n\"FU\"\n\n\n", "comment_12": "\nI think it's about some person that's popular or famous and they might not always be. But I know it's probably not that's just what I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nFirst time I heard this I thought it might be about miley, cos everyones saying Miley + selena don't like each other.\r\nI think its just basically about modern celebs, the type of people selena comes across I guess.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI get so, so tired to Disney stars becoming singers when they can't sing! Just because you've become an actress doesn't mean you can become a singer. I don't think Miley, Hilary, or Selena can sing. Seriously, they need to stick to what they're good at which is acting. \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nWhy does it have to be about someone Selena knows? She doesn't really write the songs - except one.\r\nWhy can't it just be generally viewed? Something someone else can relate it to?\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nPersonally, I think this song is directed towards Miley Cyrus. It doesn't seem like a break up song at all! Her songs directed at boys are quite different if you listen to her other lyrics, she just throws the point out there and usually mentions another girl. \n\r\nIt seems like the first verse is Miley before her and Selena had their issues and the rest of the song is directed towards the new Miley that everyone hates. \t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI think that this song is sarcastic.\n\r\nI mean, listen to the way that she sings it. \n\r\nIt sounds like she's mad at the person it's directed to. \n\r\nBasically, she's saying, \"You are a mean a**hole that screwed with my life. So when everyone's dissing you, I'll be right there with them.\"\n\r\nAt least in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nWow she must have been angry at some guy. If she is then the words-if spoken about you-are so sharp and they really make you feel bad! I love it, but I couldn't believe it was Selena, it doesn't sound like her and therefore it makes it hard to believe its her!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI love this song. She sounds so sassy the way she sings it and I love that.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nDuh.... its ABOUT DEMI LOVATO! look.. look. They are not friends anymore.. and Listen to this SOng Of DEMI LOVATO - SOLO listen to that song.. its about selena Gomez. SHe said. \n\r\nYou sing to me\r\nToo bad you couldn't even stay on key\r\nIf your life is such a mystery\r\nWhy don't you just stick to acting?\r\nOh\n\r\nanother song.. listen to the song i got u about Sel Gomez. its for Nick Jonas Because Nick Just like Used Sel Gomez. for fun only..\t\t\t\t\n\t\t\t\t\n\n"}