{"comment_0": "\nThis song is well-written, but also disturbing. It's about a person raped as a child who finds his sexuality screwed up as a result, trying to rationalize what was done to him as harmless or even somehow positive, focusing on it to the point that he rejects attractive women to zero in on women who resemble his rapist so he can re-enact the trauma. If only the writer had gotten therapy rather than rationalizing his problem and embracing his sickness as though it were his only healthy aspect.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song is about Freddie being gay, and AIDS. \n\r\njust kidding. \n\r\nthis seems to be the only Queen song that didn't have that speculation, I had to do it.  \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nFirst time I read the lyrics to this song! Sometimes you never know \"who\" a song was written about, whether it was personal, or from a 3rd perspective. \n\r\n\"But I knew life before I left my nursery\r\nLeft alone with big fat Fanny\r\nShe was such a naughty nanny\r\nHeap big woman, you made a bad boy out of me\"\n\r\nThis boy was was abused by his nanny, Fanny.\n\r\n\"Oh, you gonna take me home tonight (please)\"\r\nHe likes aggressive type of ladies. Child hood experiences effect your adult impulses.\n\r\n\"Oh, down beside your red firelight\" \r\nA light he remembers from where he was taken as a child, \r\nA fancy red lamp, furnace or fireplace?   \n\r\n\"Take me to them dirty ladies every time\" \r\nladies, not girls here? Again from childhood experiences. \n\r\n\"Now your mortgages and homes\" \r\nTough one... Who knows what this means? A message to the rich maybe? Or to his folks? maybe his folks hired the nanny to care for him because they were to busy, thus he was neglected by them.  \n\r\n\"I've got stiffness in your bones\" ??   Dark stuff.  He is saying Screw you? or he is related in some way? \r\nOr maybe, New English rock n Roll money meets Old English Monarchy money.  \r\nThis is definitely rage... coming out in Rock and Roll.  \n\r\n\"Ain't no beauty queens in this locality\" \r\nThe hired help above? \r\nOr he came from the poor side of town? \n\r\n\"Get on your bikes and ride\" \r\nHis nanny rode a bike!? \n\n\n\n\n\n\n\n\n\n", "comment_3": "\nSo, it's basically \"Baby Got Back\" long before Sir Mix-a-Lot came around with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI got turned onto this song as a 12-or-so-year-old kid, and was always moved by it. As an adult, I discovered that the first verse actually refers to sexual abuse by the \"Fanny the Nanny.\"  \n\nThe song was actually written by Brian May, not Freddie Mercury, which begs the question about whether he is self-disclosing actual events from his history. I agree with the post below that since he had a warped experience as a child, he is left with compulsive sexual weirdness as an adult.  \n\nThe rocked-out mood of the song seems to be one of striving for empowerment, yet he acknowledges that he still is involved in the the residuals of his history. \n\nI always thought the final lyric was \"heap big woman you DONE made a big mad outta me.\"  But the lyrics posted above says \"you GONNA make a big man outta me.\"  \n\nQuite a big difference from an interpretation standpoint.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIT'S ABOUT HOOKERS\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nLove it when the bass comes in. Sounds nice and fat! Excuse me if I'm wrong in my years, this could be the inspiration for the Spinal Tap song \"Big Bottom.\"\n\r\nI'm not a fan of fat bottoms, I'm more of a skinny-ass liking person. But still a super song.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nbrian may wrote this song\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nUmm yeah your all pretty much wrong.. this song isnt about girls with big butts or anything its about Freddie Mercury getting raped by his nanny when he was yunger.. read carefully youll see\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthis song is very good butit is about hookers\t\t\t\t\n\t\t\t\t\n\n"}