{"comment_0": "\nDon't be unimaginative. Just because it's about coke use doesn't mean it can't be about something else also. I have never done cocaine, and yet I can relate to it. Sometimes I feel like being \"under fifteen feet of pure white snow\" - in deep, deep depression, like a sense of total hopelesness, like a catastrophe had just occurred in my psyche. Eclusion from God, one could say.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe idea about cocaine didn't even pop into my mind before I read this. I guess if you want something to be about cocaine it's about cocaine. For me it symbolised the cold war and life in the Soviet Union and it's satellite Communist states. \n\r\nIf I may:\n\r\n\"\r\nWhere is Michael?\r\nWhere is Mark?\r\nWhere is Matthew?\r\nNow it's getting dark...\r\nWhere is John? They're all out back\r\nUnder fifteen feet of pure white snow\r\n\"\n\r\nthroughout the USSR an extensive 'cleansing, assimilation and persecution' programme was taking place. People and families would disappear over night and (the ones who wouldn't be killed on the spot) would get exiled to gulags in the north-eastern part in russia (Syberia). These regions are known for it's atrocious cold weather (down to -50 Celcius) and extensive snowfall. \n\r\n\"I waved to my neighbour\r\nMy neighbour waved to me\r\nBut my neighbour\r\nIs my enemy\" \n\r\nIn my belief in a way this could be about cold war, but mainly about the atrocities, distrust and alienation of people to one another throughout communist times. \n\r\n\"I can't even find\r\nAnything worth stealing\r\nUnder fifteen feet of pure white snow\"\n\r\nCompletely unfair distribution of resources due to which most people would have to queue for long hours and still couldn't get such products as meat and bread in any market.\n\r\nHis constant questions throughought the song like:\n\r\n\"Is there anybody\r\nOut there please?\"\r\n\"Is there anyone here who doesn't know?\r\nWe're under fifteen feet of pure white snow\"\n\r\nReflect upon the iron curtain and that little information would leave the Union, and an expensive propaganda campaign was always in place. But most people knew that everything was falling apart and that they were forsaken (under 15 feet of pure white snow)\r\nThe video, the abandoned rooms, the soviet paraphernalia seem to support this argument as does the way that they are all dancing similarly to a certain tune and then everything \"falls apart\".\n\r\nI guess I see what I want to see, but I just think that Nick Cave would not simply limit himself to the simple topic of \"cocaine\" even though that might be one of the themes of the piece. \n\n\n\n\n\n\n\n\n", "comment_2": "\nI think this song is pretty obviously about cocaine. I also think it's not really just about use cocaine considering, as mackka pointed out, Nick Cave doesn't really write songs that are just about how much drugs suck. I think that the biblical referencing with the names relates to a loss of faith due to the drug use, and the isolation mackka pointed out is literal isolation due to friends dying, paranoia from the drug, and spiritual isolation from losing God. The loss of faith motif is continued when the cry for help, \"oh my Lord\", changes to \"save yourself! help yourself!\", meaning that God cannot help you until you help yourself, ie kick the drugs.\n\r\nWhich is really over-analyzing things I think, because really this is just what happens when Nick Cave, a complex writer fascinated by religion, writes a song about how much drug use sucks.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThe russian letters in the beginning of the video translates \" Former Central Committte of the Kazakh Communist Party\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nReally doubt it mate. I think Nick Cave's a bit beyond writing songs about how bad cocaine is. But if it works for you, go with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI remember I was watching the video of this song with my father and he recognized the man on the hanging picture (in the video) to a political tyrant I think of the Czech republic? I forgot the details of what he told me that day, including the name of the dictator, but it pointed that the meaning of this song is linked to a historical massacre that took place during a regime.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nFYI, the hanging picture is of Soviet Premier Konstantin Chernenko.  He was the last of the old guard before Gorbachev took office.\n\nen.wikipedia.org/wiki/…  - it's pretty obvious once you compare.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe beauty of this song, like so much of Cave's work is that it can be understood and appreciated on such a multitude of levels. It draws a vivid portrait of isolation, regardless of the cause.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis is incredibly well thought out song.\n\nChernenko aspect of the song, along with critique of communist regime is evident, but I was puzzled by the evangelical singing during the song, so I dug deeper... as in googled it.\n\nApparently, there's an anti-theistic meaning to it as well. Phrase pure white snow is reference to the verse â\u0080\u009cCome now, and let us reason together: though your sins be as scarlet, they shall be as white as snow.â\u0080\u009d Basically, the song is about how bound and imprisoned one feels when under the weight of imposed ethical standards.\n\nBy having this ambiguous meaning, song clearly makes an analogy between religion and communism (or rather, communistic regime), which I think is brilliant, even if we disregard how great the music itself is.\n\nAnd while I'll admit that \"snow\" is slang for cocaine (as are about a hundred different words), this is where any possible relation to the topic ends, if for nothing else then for a fact that cocaine is one drug that doesn't make you depressed or alienated. Or at least that's just me and six other people I know.\n\nsource: yaledailynews.com/weekend/2001/04/13/cave-spreads-the-not-so-good-news/\n\n\n", "comment_9": "\nHe obviously wanted to distract your attention from the real meaning of the song :)\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nWhen I heard this song, it reminded me of a case study from this book about clinical depression I'm reading. I think the snow is a metaphor for feeling completely buried by your problems, completely hopeless. When he worries that they \"haven't put their mittens on\", it suggests to me that he's taking about children. Whether it's about cocaine or not, I'm not sure, but it expresses all this fear and anxiety and paranoia, such an incredible song.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI discovered the song only recently (and did not watch the video), but immediately the following sprang into my mind:\n\nI saw a woman standing at a window, looking into a heavy snow-storm, her lips move according to the lyrics as she wonders about the children, where they are, if they have put their mittens on; you can see that she really is \"moved\" - and from her facial expression you think it's worry; during the time, when the music gets \"faster\" she starts pacing through the room, passing a man who's sitting in an armchair, silently watching her (next to him a phone). Her movements get more irratic, her facial expressions turn into panic; she still moves her lips, so it looks like she's talking to the man in the chair, and although he does not make a movement she yells at him not to pick up the telephone. When she raises her arms you see scars, indicating failed suicide attempts. \n\nOn the walls and desks you see pictures of children - all from baby-age to about maybe 5-6. When the lyrics change to \"doctor, doctor\" and \"where's my nurse\" you see open pill-packages, the label indicating that it's against depression (or something related). You also see strong sleeping-pills.\n\nAt \"Is there anyone here who does not know?\" the picture slowly fades into another - you see the same woman, now dressed into one of those shirts you get in a hospital, pacing through a padded room while she's watched through one-way-window by the same guy we already saw sitting in the chair. Now he's dressed like a doctor, even having a clipboard with notes. Next to him stands a police officer. In front of them, on a little table, you see files. On each file is the picture of one of the children (the same pictures that we saw standing/hanging in the \"normal\" room), only that those kids are definitely dead, and you all see them \"bedded\" in molten snow.\n\nSo my \"Story\" for this song is: There's a mother, falling into a deep depression once winter settles in, and because she's so depressed she kills her kids to \"save\" them from this evil world and buries their bodies under the snow, before she attempts to kill herself. But she is always found (probably by her neighbour, hence the lyrics \"but my neighbour is my enemy\"). Maybe - as a teenager - she had one of those \"episodes\" already, killing her younger siblings she was responsible for, going already under therapy, then being released... so the story repeats itself with her own children. \n\nThat is just my own interpretation, something that sprang into my mind while listening to the song. I consider any piece of art - song, poem, music, picture... - \"good\" when it makes you create your \"own thing\", even when it's far from what the artist actually thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nGod i love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nNot to mention that this was the very first album Nick wrote after getting off drugs the year before!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI wouldn't totally dismiss the cocaine idea but given this fella's general oeuvre, I think spiritual torment/isolation's more likely. He can't contact God because he's under 15 Feet of Pure White Snow. If you look at \"Raise your hands up to the sky\" etc. and also Mary, Matthew, John...the first time I heard this song I jumped to cocaine as well and it's possible, but Nick doesn't really seem to do drug songs as such. Finally, the last lines, \"save yourself, help yourself\" seem to be screamed at an evangelist to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ndeep deep depression\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI'm struggling to understand this comment:\n\n\" I think Nick Cave's a bit beyond writing songs about how bad cocaine is\",\n\nI can only imagine that you have never used the stuff because cocaine has completely destroyed my life. It is probably the most signiicant part of my life. My friend commited suicide because he couldn't kick it but he also could'nt live any loner with it still in his life,This subject is not beneath anyone and I am almost certain this IS about cocaine\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI'm fairly certain that this song is about taking cocaine. \"They're all out back under fifteen feet of pure white snow.\" The snow is a metaphor for cocaine, I know that Nick Cave has had experiences with drugs so it would make sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nmartynmc - you're completely right. All the names mentioned in the beginning are people/friends who was lost to cocain or just drugs in general. \n\r\nAnd yeah, Nick has had a lot of experience with drugs and with the inviorment and the people, so he surely has some idea or what he's talking about.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI agree with your cocaine theory. First I thought it's simply about avalanche, but the prase: I waved to my neighbour..... doesn't fit. And then I had an idea it can mean that he started to be paranoid because of the drugs... And the rest makes sense. \r\nI don't recognize any man of pictures on the wall, actually I can't see them well, but tha man in the biggest one reminds me leader of former Yugoslavia, so this can be country your dad mentioned elemedio. And if is it really dictator of Czechoslovakia, I will weel veeeery  ashamed!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nsave yourself, help yourself. it's very obvious. pure white snow. definitely coke.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nmackka: watch the music video for this song.  if you've never done coke maybe you won't understand how the people are acting, but there's one point where Nick steps away from the microphone and there's coke all over his face if you look close enough\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nMona, Mary, Michael, Mark, Matthew, John\n\nDos be some fucking Biblical ass fucking names doh.\n\nDis song be about being sooooo hooked on DAT ROCK dat even THE NIGGA HOMIE GOD HISSELF CANT DO NONE TO HELP YOU! \n\nseriously though.\n\ni dont see how it is anything else\n\nyou're welcome\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis song is *clearly* about Max Payne\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI know this is about coke, but it also reminds me about the schoolhouse blizzard of 1888. I'm from North Dakota, so a lot of people are familiar with the story. Anyway, there was a huge blizzard across the Great Plains. It was during school hours and many people were caught out in it, including a significant amount of kids. Many children tried to walk home and ended up freezing to death. I think the She & Him song references it too, in \"This is not a Test\". The line goes, \"Think of all the children in the drifts of snow\".\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nyou know... it's great to have your own personal interpretations about songs, but there's no fucking way this isn't about cocaine\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nFor me it is clearly a song about drug use (cocaine) and the reactions that nick must have experienced the withdrawal of his drinking problem. Even here he can not resist his own dark spot to suppress\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nIt surely is about cocaine. It is widely know that snow is slang for cocaine (see Red Hot Chilli Peppers) and all the lyrics and Cave's background make sense.\t\t\t\t\n\t\t\t\t\n\n"}