{"comment_0": "\nI love how any girl who is about to, or going to prom can relate to this song! \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nthis song is NOT about their first dance. \n\r\nit's about their first \"somethin else\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nJustin Bieber, you are talking about sex.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nyeah this sounds alot like a metaphor for taking someones virginity. \r\nso what hes 16. thats when alot of people loose it nowadays.\r\nand why whould you write a song making such a big deal with dancing with a girl? im pretty sure hes danced with many girls before. \n\n\n", "comment_4": "\nomg\r\nhe's rightin about havin his first dance wiv his girlfriend and he's really been lookin forward to it.\r\nso why do you have to assume that he's talkin about sex and he's 15 most 15 year old boys have actually done it\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nforreal...people actually listen to this shit, get some musical taste and listen to something that is actually meaningly( for example minus the bear or open hand)\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nwell, I really love this song. at first, I thought it's about first dance on the prom etc, but when I listened it carefully I relized that it's (probably) about loosing virginity. \r\n''Girl, I promise I'll be gentle, I know we gotta do it slowly''\r\n''It happens once, once in lifetime''\r\nNow I think it really is about the first sex. lol btw sorry about my english, It's not my mother tounge..\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nhe's talking about a special moment that he had with a girl\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nif u hate justin bieber why are you looking him up?unless u secretly like him.he's just a kid.GET A LIFE!!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nSounds like a double meaning for a song. The lyrics clearly state they are going to prom, and most people assume prom is where people lose their virginity -- American Pie movies, etc -- because they are going to college soon, and want to \"experience things.\" Could be special moments, too, but I believe it's about losing your virginity with a person you held close.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song is pure shit,no its not about dance yes it is about losing virginity.\nBut everzbody can get this.\nPeople listen real music not this!\nWhen i was 15 i listened the doors etc. the music that has deeper meaning not this commercial staff.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nYou really think it's only about first dance at the prom?\nNo. At least this has double meaning. \n\nFirst dance = First F*ck.\n\nLive it.\t\t\t\t\n\t\t\t\t\n\n"}