{"comment_0": "\nIts such a simple song... \n\r\njust someone who toitally falls for someone... and going... I love you so much... and I beleiev you can take me anywhere... and you mean so much to me and it takes no interpretation at all ^_^ \n\r\nLove it \r\nspecially as the ending to eva\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI always loved the song, and especially when it was used as the ending theme for the Neon Genesis Evangelion anime series. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nrofl I also got onto this from Evangelion, it's a lovely song.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI'd love this song for my first waltz on my wedding night.....\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI had to add this song.. I love it so much. Yes, the little punk that I am and i love frank s. \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nthis is such a sweet song. its so simple and cute, its the kind if song you play at your wedding. aww.....\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIts \"let me PLAY among the stars\" not \"let me sing among the stars\"\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni love frank. this is one of the best songs that he sings. anybody who appreciates music loves this man. he made a huge contribution to music and he will be missed.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ndamn right it is play among the stars; this is the tune that i always find myself humming at work. Simply awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ngreat love song.  as oakie2186 said, its a good wedding song.  especially for an astronomer, or something.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nHe changed it anytime he sang it...listen to Sinatra at the Sands it's sing amung\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song gets better every time I listen to it!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nAnother Evangelion fan, checking in. This is a gorgeous song, too. Absolutely beautiful lyrics. \"In other words, I love you!\" What a great comparison of a person's feelings with flying, etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni love this song, because its on my fav film, Down With Love.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthis song is great, i love it so sweet, and this song is played in one of my fav film called down with love.\t\t\t\t\n\t\t\t\t\n\n"}