{"comment_0": "\nTo me this song is just about war in general.  Soldiers go off to war, defending their country, and are willing to give their life for a cause that they may not completely agree with or understand.  The part, \"For a hill men would kill, why? They do not know\" could mean men are defending a hill (strategic point on a battle field) and they are willing to kill the enemy but the overall cause of why they are fighting they do not know.  The part in the song referring to the men going insane is just a typical side effect of men going off to war.  All the blood, death, and screaming sounds on the battle field are enough to rattle any man's sanity.  Last of all, \"Take a look to the sky just before you die\" is the typical thing many people are said to do before they die.  As they are looking up at the sky their life flashes before their eyes and they get one last glimpse of this world and try to take it all in.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song is based on the Ernest Hemmingway novel For Whom the Bell Tolls, and it is about 5 soldiers left to defend a hill and are killed in an airstrike.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song I've always understood to mean about the insanity of war.  Obviously the title came from Hemingway.  After reading the book, it would seem clear that the band members have read it too.  In the book, you read of the moment that everything goes quiet, just before all hell breaks loose (hears the silence so loud)  There is talk of defending a hill, and there is mention of the stiffening wounds suffered in battle.  Near the end, the book's protagonist (the American whose name I forget) looks up to the sky while he is alone, dying.\n\r\nYes, war is insane.  But sometimes, folks, war is justified.  God bless America in her fight against terrorism.\n\r\nJR\n\n\n", "comment_3": "\nFirst of all, I think this is one of the best Metallica songs ever. It's absolutly brilliant and a good example for the band's and his lyrics' genius. When I first heard the song I just thought \"WOW\".\r\nI like the Ride The Ligtnig-version more than the S&M one (that church bell in the background is absolutly cool!).\n\r\n@JR, 4saken4 and Bulkyone:\r\ncould you please stop talking that patriotism shit?! That whole \"defending our country\", \"holy cause\" and \"god bless america\" is CRAP!\r\nThere is no glorious war, no matter what people are fighting for. War was always the same and will always be the same: Senseless destruction and killing. I'me sure no one of you knows what war is like in reality. My mother often told me about my grandfather; about him sitting the whole night in his chair and crying because he couldn't forget what he saw on the front. \r\nSo I hope you pray to god (or whoever you pray to) that you'll never know what war is like in reality. With the words of Benjamin Franklin:\r\n\"There is no good war and no bad peace\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nfight against terrorism is an illusion. usa will never win this war, and by the way, there isn't a 'good war'.. i agree with Insanitas.. patriotism in THIS way is crap! how can people be proud of killing others?\r\ni'm NOT deffending terrorism, but i'm not defending war either.\n\r\nby the way, this song and all metallica songs rocks..\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n\"Crack of dawn, all is gone, except the will to be\" <=that might be referring to the chaos of battle: all that's left is your will to stay alive.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nBadass riff and lyrics. So dark too. Vintage Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis is such a great song, and once I heard it I knew Metallica was something special.  Lyrics like \"On they fight, for they are right, yes, by who's to say? \r\nFor a hill men would kill, why? They do not know\"\r\nThis shows that Metallica is a very intelligent band who realizes how idiotic war is especially because both sides think they're right, but neither knows what they are really fighting for and why it is worth killing another.\r\nThis band is so deep, I love it.  I hope everybody is affected by this song as much as I am.\n\n\n", "comment_8": "\nyes, i agree with you guys ;) metallica fuckin rulez\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\n\\m/ METALLICA RULE!!!!!! we want a new album!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis is the quote from the beginning of Hemingways \"For Whom the Bell Tolls\" and how it got its title. The \"mis-spellings\" are not typos, but of an older form of English John Donne used.\n\r\n\"No man is an Illand, intire of it selfe; every man is a peece of the Continent, a part of the maine; if Clod bee washed away by the Sea, Europe is the lesse, as well as if a Promontorie were, as well as if a Mannor of they friends or of thine owne were; any mans death diminishes me, because I am involved in Mankinde; And therfore never send to know FOR WHO THE BELL TOLLS; It tolls for the thee.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI read this book because of this song and the book was ****ing awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nNobody gave Poland to Hitler, Liebherk, the invasion of Poland is what set triggered World War II. Being a pacifist is not shameful, and most war is definitely pointless. Hitler was a never-before-seen case in history, and none of the world knew how far his goals stretched. Don't go saying that being peaceful is how lunatics like Hitler become so powerful.\n\r\nAnyway, I read the book and the poem, and I do think that this song focuses on them, but I also think it goes a little further. The last few lines don't happen in the book. I think those lines comment on the uselessness of most war, something that a soldier will only realize during his dying breath.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThe book is actually about an American dynamiter who has lived in Spain, and the Spanish Civil War breaks out. He is sent over to destroy specific targets for the Republic, and this target is a bridge. He works with 2 guerrilla bands, and one of them (made of 5 people) goes and steals horses because they don't have enough for everyone. But they did it during a snowstorm, and the snow stops. They are tracked and surrounded on a hill by a squadron of cavalry and are eventually all killed, but not without a fight. I think the first verse is about that battle.\n\r\nThe second verse, however, is probably about the actual blowing of the bridge. The dynamiter blows the bridge, but in the retreat, his horse is shot and collapses on top of his leg, breaking it. He lays on the forest floor, debating about whether to kill himself to keep from being captured and tortured. And then an enemy officer walks into view, and the book ends.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nIt is CLEARLY about the book \"For Whom The Bell Tolls\" By Hemmingway. If you havent read the book, dont bother commenting. Sure, it could be about any war, but read the book and then listent to this song, you will see the direct correlation between the two. And to you idiots who said its based on the poem by John Donne, youre wrong. The book is based on teh poem, and the song is based on the book. To read the whole poem go here: incompetech.com/authors/donne/…\n\r\n \"Crack of dawn, all is gone, except the will to be\" \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nbased on a book by Ernest Hemingway.  Which i read its pretty cool a bit cliched in parts, it talks about the world moving when these two characters have sex, but very vivid and brutal in its descriptions of the Spanish Civil War nonetheless.  I recommend reading it at somestage although you really won't find out that much more than what you already know except perhaps why they look to the sky.  \n\r\nCliff shows why he is considered by many to be one of the best bassists of all time as well. love tha bass line.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI think the song speaks about the horrible sacrifices that are necescary to win a war. \"For a hill they would kill, why? They do not know\" speaks of the ingnorance of the average soldier about the mission, yet he is the one who bleeds to reach the goal. The song is very cool, but I don't think that it is really anti-war. Sure, you could look at it like that, but myself, being pretty patriotic, I think that the song really just speaks to their sacrifices. \n\r\nOh and for all those anti-war people-\n\r\nWar is an ugly thing, but not the ugliest of things. The decayed and degraded state of moral and patriotic feeling which thinks that nothing is worth war is much worse. The person who has nothing for which he is willing to fight, nothing which is more important than his own personal safety, is a miserable creature and has no chance of being free unless made and kept so by the exertions of better men than himself.\r\n          John Stuart Mill\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI just think this song is about what is said before, the novel \"For Whom The Bell Tolls\". And in fact, \"Crack of dawn, all is goane, except the will to be\" sounds more like it is referring to how the airstrike decimated the hill. Either way I love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nMetallica is the best end of story\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nAs far the song's title is concerned....\nI think the bell being referred to in the original usage of the expression, \"for whom the bell tolls\" was a church bell used to announce or honor someone's death. So the one for who the bell tolls is someone who's just died. \n\nI'm not sure what \"For whom the bell tolls, time marches on\" implies. Except that people keep on dying i.e in wars.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI like the line, \"and all is gone except the will to be.\" this referes to that battles are chaotic, and all that's left is the desire to survive. And again, \"Men of five, still alive through the raging glow. Gone insane from the pain that they surely know\" seems to be referring to muzzle flashes from gunfire, and their mad determination to continue fighting. I thought the use of those image was fascinating, and I think it's pretty well written. In terms of musical composition, Megadeth is a bit better, with the ability to write interesting guitar lines to keep listeners interested. Although, I do like the vocals of Metallica much more.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nthanks for telling me wot the song is about. this is one of my fav metallica songs... but i never knew wot the meaning was.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nthis song has always been my fav metallica song....i had lost my older brother in desert storm....and that's when i knew the true meaning of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nthis was the first metal song i ever heard and after 7 years i can say metallica are still my favorite band, i new the meaning of this ong since i first heard the song, and everyone here is right, metallica fucking kiks ass\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nGlad to be of help :D\n\r\nMetallica rules \\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI never knew wot this song meant but thanx u lot I like this song on the ride the lighnting but wen I heard it on S&M WOW it fukin brilliant I love the ideas and stories behind these songs there gr8. BY THE WAY METALLICA KICK ASS!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nMetallica Kicks Ass!!! it's one of my favorite bands, and one of the best bands ever. I agree with nemesis and MrMojoRisin5552.\r\nthe S&M version is icredible too.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThe song \"For Whom The Bell Tolls\" is about a scene of the Ernest Hemmingway novel where - one morning - five soldiers were taking a position on a hill and they get killed by an airstrike\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis song rules but i have to agree with some of you\r\nThis isn't about all wars in general, because some wars are about protecting your country, which is a very holy cause. \t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nyeah top novel that one, i must admit though it feels like although this song was based on that tale, they sing it more about doing what you gotta do no matter what the consequences....\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nAnother one of Metallica's best. This is like the first song that \"Tallica showed signs of growth in their music. Let's face it, \"Kill 'Em All\" was a good album, but it followed what was expected of metal bands at the time. \"Ride the Lightning\" broke away from that and this song especially helped develope the Metallica style. This song, like all the old shit, is best played live. (i.e. S&M, Cunning Stunts) And as Metallica's first anti-war song, your know it will f'n blow you away. \t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nprtrs, i'm sorry to say this and not give an explanation, but i must say that, you are a moron.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nHow many rock songs start out with church bells?\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nnot many,but there arent as many as good as this are there?\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nthis song reminds me of my mum 'cause she loves it.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nJason does this song the best, his final alternation on the intro abss riff is the sweetest fucking thing ever.look at his face as he plays it,the way the lighting is on him,the camera angle....he doesnt look human!\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nthis song is class, thats all i can sya bout this songs its class, well done the greatest rock/metal band.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI'm with Nemisis on this one. Right on!! \\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nHell's Bells starts out with church bells.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\n\"How many rock songs start out with church bells?\"\n\r\nBlack Sabbath\r\nHells Bells\r\nFor Whom the Bell Tolls\r\nWhos Fooling Who (a song on Toni Iommis album)\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThis song is very saddening to me, although I feel great respect for the brave souls on the hill, outnumbered yet still fighting.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\ni use this as a street fightin song.\n\r\nor at least... i like to listen to this while playing Double Dragon\n\r\nThat game rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nmetallica r used 2 b so great when the wer pacially death metal then turned 2 metal...but no wtf is that about, i think they just made a new cd 2 pay for james' drugs\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThis song is awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nthis song is incredible, period\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nYes the book, but read the poem by John Doone \"for whom the bell tolls it tolls for thee\"\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI've seen Metallica twice in the past 2 years and this song and One are by far the best to listen to live.\r\nLast year at Download (which by the way was fucking amazing which im sure anybody who went will agree with) they started this song. Just as the line 'take a look to the sky just before you die, it's the last time you will' came thundering out of the speakers, all the lights dropped apart from one main beam of light shining onto the stage which was just when it started to rain. The rain was fucking welcome cuz everybody was just so hot. the effect was fucking electrifying. I'll never forget that moment. The moment i thought 'fuck i love metallica!) =D\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nInsanitas, you're one of the pussies who gave Poland to Hitler.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nactualy its not \"it's the last time YOU will\" its \"its the last time HE will\"\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nyup ur right...puppetmaster....\r\nthe intro's a killer....its so messed up.....\r\nonly metallica.....man...only metallica could have come up with this song....\r\nthey put the metal in metal, the rock in rock\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThis song IS in the book for Metal classics. It's one of the best period.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nsorry, my mistake. Metallica fuckin rule all!\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nfirst Metallica song i heard, i had a party at my house and someone left \"The best air guitar album in the world...Ever\" CD at my house, i wasn't into any forms of guitar music at the time but i thought what the hell i'll have a listen, this song was on it and i never looked back. THE best 'tallica song\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nthis and fade to black are my fav metallica songs......back to back on ride the lightning you dont get much better than that....ive always wondered about the line \\\"suffered wounds test their pride\\\" just because to me it does not sound like hetfield says \\\"suffered\\\".....the instrumentation is incredible on this song....one of those songs that makes everyday my own life seem so insignificant\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI really dont get it when you all talking about AcDc's Hell Bells :/ it's not the same song...\r\nBut anyway, I think Leaether Strips version of For Whom The Bell Tolls is much better than the original, its a more synth version, maybe just me that likes that :P\r\nVery good song anyway, great lyrics!! One of Metallicas best!\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nThis is one of the greatest and first songs i heard from metallica....When i was little my brother got the ride the lightning album which I stole and listening to when he wasnt around. By far the best version of this song i heard was the S&M version. Hetfields voice is just unforgettable.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\n\"Yes, war is insane. But sometimes, folks, war is justified. God bless America in her fight against terrorism.\"\n\r\nShut up\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nterrorism is everywhere, it was with us before 9/11, and it will continue to be a problem for every person regardless of the country they live in. we just need to keep our guard up without getting too paranoid. anyway...\r\nthis song is awesome! brilliant, this is a masterpiece. this is what we need more of, hard-rocking, good music that has a message to it. metallica rocks!\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nLyrics are wrong ...  It is \"stiffened wounds test their pride\" not suffered.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis is one of their best songs. Kirk's part at the beginning of the song is incredible. The lyrics and the way James sings it is amazing, especially live. \n\r\nLove the song, love Kirk, love Metallica!\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nIts referring to the wars and the battles that take place... \"make his fight on the hill in the early day\" thats talking about taking a hill over.. everyone knows the higher you are on top of the hill u have the advantage.. and for whom the bell tolls... the liberty bell.. thats the conclusion i get\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\n\"This is one of their best songs. Kirk's part at the beginning of the song is incredible.\" by stormgirl\n\r\nWhat the hell are u talking about the part at the beginning your a refering to is from Cliff's mighty bass.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\ni luv this song so much!!! METALLICA ARE THE BEST EVA!!!! i luv the bit\r\nBlackened roar massive roar fills the crumbling sky\r\nShattered goal fills his soul with a ruthless cry\r\nROCK ON!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nperfect war song\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nthis song reminds me of this hot hot hot kid named conor, because he (besides my brother) really got me into mettalica\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nthis song reminds me of this hot hot hot kid named conor, because he (besides my brother) really got me into mettalica\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nsorry this dumb site cut me off before i was done.\r\nwhoever said \"\"Crack of dawn, all is gone, except the will to be\" \t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nwtf this gay site keeps cutting me off.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\ni went on to say how dumb that person who's last on page one is. If i bother to type it a third time chances are this site will cut me off again. Screw them.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI first heard this song in '93 aged 10 and from then on ive become obsessed with metallica...awesome band long live the legends....just a shame they not doing Reading this year...ill have to go up to Donnington then!\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nGreat lyrics, great bass, grat guitar. What more needs to be said? Metallica have really gone down hill though.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nWell Anti, you have to remember how old they are. And I think they're trying to change subtly but not look like they're changing to stay popular.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nPossibly THE best song i mean..great licks and solos, great bass (slap bass and lead bass in the ONE song) and hetfields voice is one of a kind ROCK ON METALLICA\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nThis song is about a book by Hemmingway, but he got the title for the book from a poem by John Donne written in 1623. More useless information.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nKill yourself phoenix04, see if you rise from the ashes.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI agree with phoenix04 metallica sucks... rest in peace (1983-1995) but  during 10 years they were amazing!!!... really awesome song... you have to download and see this song on the video Cliff Em' All Totally Incredible perfomance by Cliff. Cliff Burton must be rolling over in his grave.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nIs there a catchier Metallica song out there?  I think not.\n\r\nHow can an album with Ride The Lightning, Creeping Death, Fade to Black, For Whom The Bell Tolls, and The Call of Ktulu be their SECOND or even THIRD best album?\n\r\nJust goes to show you how amazing Metallica really is...\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nVery cool song about war. Only Master of Puppets and Sanitarium can beat this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nI love this song. First Metallica song I ever heard, and what kinda got me listening to them. Very cool lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nmaster of puppets, dookie, nevermind, the jimi hendrix expierence: are you expeirenced, and back in black are my favorite cds of all time and metallica rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nOne of Metallica's best songs in my opinion. The Hemmingway book is so terrible though...\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nCompletely agree that this is about the insanity of war, and certainly shows that Metallica are both cultural and intelligent.\n\r\nThis I a song I never get tired of. It still blows me away every time I hear it.\n\r\nI also think the S&M version is very powerful.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\ni love the beginning of the music sounds like a \"devil worship kinda sound\" but it's not..........................oh yea and this song is awsome but too much of a long intro waiting for 2 minutes and 29 seconds don't u think thats kinda long? owell\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nlook at some kind of monster that song had a unusally long intro but it was good\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nWas Cliff the reason of Metallica's true, raw image? After Cliff's death (besides Garage Days) the albums have gone compliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nI first heard it on the radio. I was like, oh my god! This is the most kick-@$$ sound that I've ever heard! The best track on rtl, (sorry ftb.) After hearing this, Metallica became my favorite band and still are and I highly doubt there will ever be any better!!! Down the irons. Up the metal.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nClassic Metallica. I miss these days.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nthey did such a good job with the singing in this song. The book is really good 2\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI agree, great song!!! Intelligent too, based on the novel by Ernest Hemingway. \r\nTo bad they left their old school sound.\n\r\nUp the Irons\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nAppealing novel!! People should read it.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nGREAT song...Cliff's intro is amazing and live even better when he solos into it...oh my god.  I laugh at the people that think this intro is a guitar.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nI play bass, am I found a crazy-ass clip od Cliff Burton playing this song and knew this guy was my idol. Wish he was still kicking fucking ass now\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nbest intro eva\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nMetallica is awesome.\r\nI HATE when I hear people saying that they suck.\r\nCause you know what.THEY DO NOT SUCK!\r\nOld Metallica is awesome,I'm not to big of a fan for their newer hits.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nyeah their newer stuff isnt the best... but damn i love ride the lightning. to all you guys out their who say that war is useless you all should have to realize that war has its purpose though often doesnt fulfill it. i think that there is a time and place for war. dont get me wrong im no war hawk i just think that there is a large degree of pride and shamelessnes in war that is hypocritical and in many places undermines the spirit of the cause... wow thats the deepest ive gone lol. fuck you if you disagree\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nWar doesn't determine who is right, war determines who is left.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\ni belive this song is a song that is against war because in war the general and the politics start the wars and tell the soliders who actully fight the war what to do and the soldiers being bound to do so follow the orders in most case having no clue why they are doin it. and because of their blind faith they face things that should never be faced and done upon another living creature just look at vietnam and the napalm and agent orange delima\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nwhen i first heard this song i first related to ernst hemingways book for whom the bell tolls which is about a platoon of 5 left to defend a hill and are ironicly killed in an airstrike\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nwow i love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\n80s metallica KICKED SOME SERIOUS ASS\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nOkay so, I'm only 16, so it's not like i grew up with Metallica or anything of the like. But This is one of the first songs I have heard by them a few years back, and I loved it. \r\nThe intro is amazing.\n\r\n& yeah it's about war, obviously.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nthis song is pretty anti-war. in the lyrics theres a lot of questioning of why men decide to enlist and fight to the death for no real reason. even though this song has a hardcore feeling to it, its more of a tragic song.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nThis song is about war and how often the soilders who are fightinh are doing so for territorial reasons that that they are not fully aware of and how what is morally right depends on one's perspective and it that is the winning of the war that truly determines rigthteousness.  The song also expresses the view that the men who fight are tested by a war that strips away all belief systems and leaves each soilder with only his own natural instinct for self preservation and how all the fighting blinds then to the cause they were oringinally fighitng for and how wars continue throughout the ages, leaving the dead behind.   \n\n\n\n\n", "comment_103": "\nDefinitely off one of their best albums\r\nCliff wrote this song after he watched the movie about the book\r\nits about the 5 guys preparing to fight to keep their hill\r\nthe title of the book comes from \"Meditation 17\" a ESSAY by John Donne\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nLike all tracks on Ride the Lightning, this is how we can stop war from happening but when it starts we can't stop it.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nLike doofer33 said, but in more detail, the story it's based on is about soldiers sent on a mission. They don't know what they're fighting for yet they fight for the pride of their nation, even if it's not for the right reasons - \"On the fight, for they are right, yes, by who's to say?\". Ironically, it's their own people who leave them to fight for their lives on a hill top and they end up dying in friendly air strikes - \"Take a look to the sky just before you die, It is the last time you will\". One of Metallica's best..\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nAll tracks on Ride the Lighting were about losing control - soldiers being stuck in the middle of enemy territory (For Whom the Bell Tolls), being stuck in a place you don't want to be (Trapped Under Ice), being sentenced to death for crimes you did not commit (Ride the Lighting), being under pressure from stressful life on the road (Fade to Black), etc.. The guys in the band are control freaks like myself so I can relate well to the album, one of my favorite albums of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nThis is my favourite Metallica song. I read the Ernest Hemmingway novel a long time ago, and it's nice to see how two different forms of 'art' (literature and music) can influence each other to make a metal masterpiece.\n\r\nThe line 'on they fight, for they're right, yes, but who's to say?' says it all about the stupidity of war. Both sides are convinced that their cause is right and even history can't tell us who in the end was fighting for a just reason, 'cause history is written by the winners. \t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nIndeed this is an amazing masterpiece, i dont think any other band could of pulled this song off like metallica \t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nThe Sun Also Rises was my favorite by Hemingway.  \n\r\nI just had two martinis at Bar Hemingway at The Ritz in Paris to the tune of 30 Euros apiece!  $90 for 2 martinis!  WTF!\n\r\nOh I guess that isn't a song meaning.......\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nThis isn't quite my interpretation or the meaning of this song, but every time I hear this song, I think of 2 things, firstly, the American-English \"War Of Independence\", and secondly, I think of the American Civil War. The part that makes me think about these two wars (the Civil War more so than the War of Independence) is these two parts of the song:\n\r\nMake his fight,\r\nOn the hill, in the early day!\r\nConstant chill deep inside\n\r\n...For a hill men would kill, \r\nWhy? They do not know\r\nSuffered wounds test there their pride\n\r\nAnd, more centrally speaking, it is the word \"Hill\" that stands out, for some reason, and I don't know why. It just seems that this song doesn't belong to WWI, WWII, the Korean War, the Vietnam War, or any other war that I can think of, but fits almost perfectly in my mind with the Civil War.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\ndefinately my fav metallica song. the biggining riff is awsome.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\naddicting song,\n\r\nlong live /1ETALLIC/\\\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nlove this song.the scratchy guitar is the best\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nThis song is defineately about Ernest Hemmingway's book, \"For whom the bell tolls\". Specifically, it's about El Sordo's Last Stand in the book, where 5 men on a hill hold off a bunch of faschist troops until they're bombed by planes. It is also about war in general.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nBoth Metallica's and Iron Maiden's songs have total kickass meanings but the difference b/w the 2 is that Metallica's music is just at a new level!\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nWhat is the intro played on?\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nI think all Metallica songs put together describe some sort of prophecy they unconsciously wrote.  In this case I think, like other artists, they unconsciously express the thoughts of the conscious collective.  Now, in this particular case I think men of 5 refers to servicemen of the Pentagon, that is, the Army.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nI really like this song it reminds me of Cliff Burton whenever i listen the song..\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\n\"take a look to the sky just before you die its the last time you will\"\n\r\nAirstrike...\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nIT WILL TOLL FOR U AND ME SOMDAY\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nI am ex BRITISH military and I agree that this track apart from rocks has got it to a tee what war is like if it wasnâ\u0080\u0099t for members of the armed forces the terrorists would walk all over us and war is mostly the only resort a government can use to defend against all enemies foreign or domestic does none of you watch the news about home grown terrorism \t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nI think the song takes place during Gettysburg. During Gettysburg some union soldiers were defending a hill from some of Pickett's men. Pickett's men charged at the hill which resulted in a complete bloodbath.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nMetallica sucks\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\n5/1/2011\r\nAmerican Special Forces kill Osama Bin Laden\n\r\n...and I immediately put on Metallica's 1989 rendition of this song where Kirk strums the National Anthem at the end\n\r\nGOD BLESS AMERICA.\t\t\t\t\n\t\t\t\t\n\n"}