{"comment_0": "\nI always felt like this song was about worries, fears, and problems that you can never really leave behind and trying to escape from them momentarily even though you know in the back of you mind they are still there. In the first verse it gets into these problems, \"wanting to be listened to\" not \"heard\" and being bothered when others have the same name. Then after another verse it ends with \"So let's think of something better\" and the chorus starts. I think the \"forest\" represents a place to escape to and \"singing\" as something to tune out your problems with. When they mention the chorus being one that everybody knows I imagine it's because it's supposed to be \"normal\" and \"expected\" which is what he is trying to be by avoiding his problems and putting up a front. The \"hands held higher\" and \"we'll\" be on fire\" part is the problems catching up to him. Then in the next verse he addresses them:\n\"Quickly moving towards the storm\nMoving forward, torn into pieces\nOver reasons of what these storms are for\nI don't understand why everything I adore\nTakes a different form when I squint my eyes\n\nHave you ever done that, when you squint your eyes\nAnd your eyelashes make it look a little not right\nAnd when just enough light comes from just the right side\nAnd you find that you're not who you're supposed to be?\nThis is not what you're supposed to see\"\n\nIn these verses he has stepped out of the forest and is slowly coming back to the reality of his situation. That nothing is perfect and the harder he focuses on it, the worse the problems seem. After spending so much time away in his \"forest\" he has forgotten his own problems and when they suddenly show up again he panics and they seem 10x worse. Hence:\n\n\"Please, remember me, I am supposed to be king of the king\nDevil swinging on the swing, something happened in my imagination\nThe situation's becoming dire, my treehouse is on fire\nAnd for some reason I smell gas on my hands\nThis is not what I had planned\"\n\nIn fear he runs back to his \"forest\" and continues to ignore his problems.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe chorus:\n\nDown in the forest we'll sing a chorus\nOne that everybody knows\nHands held higher, we'll be on fire\nSinging songs that nobody wrote\n\n--- I am one to believe that all people yearn for something more.  However, we all get trapped in our own little lives, our problems, and the ways we cope.  Breaking out of tradition is scary.  \n\nOne of my favorite lines from any song comes from NOFX's the decline:  \n\n\"Only moron and genius\nWould fight a losing battle\nAgainst the super ego\nWhen giving in is so damn comforting\n\nAnd so we go, on with our lives\nWe know the truth, but prefer lies\nLies are simple, simple is bliss\nWhy go against tradition when we can\nAdmit defeat, live in decline\nBe the victim of our own design\nThe status quo, built on suspect\nWhy would anyone stick out their neck?\"\n\nHeading to the forest, a place outside of society, we all sing the same song, the underlying will to want something more out of life, but we sing a song no one knew, which means we walk our own path.\n\nThis is a sentiment I truly believe.  People have become so content with being a cog that the term 'individual' is slowly disappearing. Hence, \"Does it bother anyone else that someone else has your name?\"\n\nI really relate with squinting of your eyes.  It might not happen often, and when it does, it doesn't last long, but you see something in from a different perspective.  \n\nGreat song.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni agree with most of these comments however i feel like i should add one thing. the rap should be reviewed once again. \n\r\n\"quickly moving towards the storm moving forward torn into pieces over reasons of what these storms are for\"\r\nim not 100% sure but it seems like he is saying that he left his forest, his happy place, and now its harder to get back there. so now he is walking into the storm & he is coming apart. he isnt mainly coming apart because of the storm itself, he is coming apart after trying to fix the storm. \n\r\n\"i dont understand why everything i adore takes a different form when i squint my eyes\"\r\ni guess you could say his forest is like his car radio was. it distracted him from the bad aspects of life & when it was gone, he had time to think. now that he is outside of the forest, he is thinking. his forest also blinded him (like the effect of rose colored glasses: where you can only see what you want to see aka the good). when he was in the forest he could only see the good aspects & now that he is outside of the forest, he isnt blinded anymore. \n\r\n\"have you ever done that where you squint your eyes & your eyelashes make it look a little not right & then just enough light comes from just the right side & you find youre not who youre supposed to be?\"\r\nstill outside of his forest, he is now seeing everything so clearly now & he finds out that the person that he has been all of his life is not who he is supposed to be\n\r\n\"this is not what youre supposed to see please remember me i am supposed to he king of a kingdom swinging on a swing\"\r\nhe isnt supposed to be the person he thought he was. he is worth more\n\r\n\"something happened to my imagination this situations becoming dire\"\r\nhis imagination was what was blinding him. he is saying now it is gone & the situation is real and clear.\n\r\n\"my treehouse is on fire & for some reason i smell gas on my hands this is not what i had planned this is not what i had planned\"\r\nhe realised that he had caused this storm involuntarily & he wants to go back to his forest where everything was good\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI absolutely lobe this song. \nI think it is about the things that run through our minds and how our thoughts can really be all over the place. Sometimes our thoughts are so random and get distracted.\n\n\"I don't know why I feed on emotion\nThere's a stomach inside my brain\nI don't want to be heard, I want to be listened to\nDoes it bother anyone else that someone else has your name?\"\n\nHe's talking about something pretty deep and then are random casual thought. We all think like this all of the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI feel like the \"forest\" is his escape from reality and when he says \"my treehouse is on fire and for some reason I smell gas on my hand\" is him burning Down the treehouse or him trying to die\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n\"I don't know why I feed on emotion\nThere's a stomach inside my brain\"\n\nHe enjoys other people's feelings so much, that he actually hungers for them. Could be, that he even actively provokes intense feelings in others. Maybe his own emotions are too terrifying so he uses the others' as a distraction. Or maybe he feels numb and uses the others' emotions to feel anything at all.\n\n\"I don't wanna be heard\nI want to be listened to\"\n\nPeople generally hear what they want to hear. He longs for someone to take the effort of listening to his meaning behind his words rather than just consuming them. By just consuming words the other person ignores the speaker/writer, which can cause a feeling of dispensability and/or invisibility in him.\n\n\"Does it bother anyone else\nThat someone else has your name?\"\n\nWe are unique, so why should we share our name with someone else who is a completely different person? It is rather sad that we are used to being just another jane or joe and not even realize let alone worry about it. Phrasing this as a question challenges the reader/listener to question this fact.\n\n\"I scream, you scream, we all scream\n'Cause we're terrified of what's around the corner\nWe stay in place\n'Cause we don't want to lose our lives\nSo let's think of something better\"\n\nFear of the unknown is very common, which makes us walk the same roads and do the same things as always and as everyone else around us. Even when we get bored or fed up or revolted by our routines we shrink from trying new things, because it frightens us. He challenges us to overcome our fear and find better ways of dealing with it rather than just ignoring it and thereby staying slave to habits induced by culture or upbringing.\n\n\"Down in the forest\nWe'll sing a chorus\nOne that everybody knows\nHands held higher,\nWe'll be on fire\nSinging songs that nobody wrote\"\n\nI can't help but think that this is about sex which in this context stands for letting out our real self when we are with the right person. True, it could simply mean loud screaming our frustration out in the safe recluse of the forest, but I personally wouldn't call that \"singing\". Also in this part he talks about \"we\" not \"I\". \"Hands held higher\" implies that we can't help but simply surrender to showing our true self to the one person that matters once we feel unobserved by others.\n\n\"My brain has given up\nWhite flags are hoisted\nI took some food for thought\nIt might be poisoned\nThe stomach in my brain\nThrows up onto the page\"\n\nHe has fought a battle against surrendering to open up, lost it and as a result he has changed. The brain that used to feed on the emotions of others to hide behind is now coming out of its closet and instead shows its real self in writing about itself.\n\n\"Quickly moving towards a storm\nMoving forward, torn\nInto pieces over reasons of what these storms are for\"\n\nBy leaving the safe place of the known (hiding) he moves forward to the unknown (opening up) which feels threatening. He continues forward even if that means great discomfort and uncertainty.\n\n\"I don't understand why everything I adore\nTakes a different form when I squint my eyes\nHave you ever done that?\nWhen you squint your eyes\nAnd your eyelashes make it look a little not right\nAnd then when just enough light\nComes from just the right side\nAnd you find you're not who you're supposed to be?\"\n\nBy squinting we narrow our field of vision so we can focus on certain things. Focussing and dividing that part into small pieces (eyelashes that cut like lines through the vision) makes us see things more clearly. When we are in the right frame of mind this can lead to insights about ourselves. The role(s) we play in our everyday life start to feel wrong. We realize that we live a life imposed on us and that that the things our ego appreciates are insignificant when facing the bottom line of existence aka our true self.\n\n\"This is not what you're supposed to see\nPlease, remember me I am supposed to be\nKing of a kingdom or swinging on a swing\"\n\nThese are the thoughts of resistance that come up when walking new paths. We realize that others can see the change in us and that frightens us. Our changing is meant to stay a secret at least until we know our new self and feel safe with it, so we implore the world to stay focussed on the image we used to portrait. In this case either a person in control of himself and others or a harmless, happy child.\n\n\"Something happened to my imagination\nThis situation's becoming dire\nMy tree house is on fire\nAnd for some reason I smell gas on my hands\nThis is not what I had planned\"\n\nImagination is the first step on the road to self awareness. What if. But sooner or later instead of just being someone else in our minds we sooner or later start acting differently. This feels extremely scary and causes a feeling of chaos and destruction. The tree house resembles a recluse inside a recluse, a safe place in the middle of nowhere. Destroying the tree house means not withholding anything any longer from the one special person who is allowed to see our true self to the very bone of our existence. Being able and willing to do so even surprises ourselves. Opening up was not intended, it just happened out of its own accord.\n\nThat's what I get from these lyrics. Thanks for reading :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\"There's a stomach inside my brain\"\n\nI think Tyler is so insightful and smart and clever and just... amazing, but he doesn't even know it. This lyric caught my attention because there is actually something called the \"enteric nervous system\" and it is in your stomach. Some scientists refer to it as \"The Other Brain\". Literally. Something like 50% of your body's serotonin and 90% of your body's dopamine LIVES in your stomach, in that \"other brain\". These are chemicals often associated with depression and anxiety disorders. I just found that so interesting. I know he was saying there's a stomach inside his brain, not vice versa, but it's still interesting to me, even if he didn't mean for anyone to make that connection at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nâ\u0080\u009c I don't know why I feed on emotion\r\nThere's a stomach inside my brain\r\nI don't wanna be heard\r\nI want to be listened to\r\nDoes it bother anyone else\r\nThat someone else has your name?\r\nDoes it bother anyone else\r\nThat someone else has your name, your nameâ\u0080\u009d\n\r\nTaking a religious view on this song I think heâ\u0080\u0099s saying he doesnâ\u0080\u0099t understand why he is so hungry for more knowledge and he doesnâ\u0080\u0099t just want to be heard by people he wants people to listen to the words heâ\u0080\u0099s trying to tell you. When youâ\u0080\u0099re in heaven God gives us all new names and no one else knows that name but you and no one else has that name and he knows that. Here heâ\u0080\u0099s saying he wants his new name not a name other people have. \n\r\nâ\u0080\u009cI scream, you scream, we all scream\r\n'Cause we're terrified of what's around the corner\r\nWe stay in place\r\n'Cause we don't want to lose our lives\r\nSo let's think of something betterâ\u0080\u009d\n\r\nWeâ\u0080\u0099re yelling to or at the Lord because of our problems we donâ\u0080\u0099t grow with God cause weâ\u0080\u0099re scared people might think weâ\u0080\u0099re â\u0080\u009creligious freaksâ\u0080\u009d so heâ\u0080\u0099s trying to find a way to tell you these things subliminally. \n\r\nâ\u0080\u009cDown in the forest\r\nWe'll sing a chorus\r\nOne that everybody knows\r\nHands held higher,\r\nWe'll be on fire\r\nSinging songs that nobody wroteâ\u0080\u009d\n\r\nThe Churches of God will flee to the forest to find the olive tree which represents God. (In the song Trees by Twenty One Pilots he is also speaking about God and how heâ\u0080\u0099s an olive tree) during the end times praising and singing to the Lord and theyâ\u0080\u0099ll be filled up or lit up with the Holy Spirit who will teach them the songs they sing to praise God. \n\r\nâ\u0080\u009cMy brain has given up\r\nWhite flags are hoisted\r\nI took some food for thought\r\nIt might be poisoned\r\nThe stomach in my brain\r\nThrows up onto the pageâ\u0080\u009d\n\r\nHeâ\u0080\u0099s taken in information thats corrupted by satan and it disgusts him\n\r\nâ\u0080\u009cQuickly moving towards a storm\r\nMoving forward, torn\r\nInto pieces over reasons of what these storms are for\r\nI don't understand why everything I adore\r\nTakes a different form when I squint my eyes\r\nHave you ever done that?\r\nWhen you squint your eyes\r\nAnd your eyelashes make it look a little not right\r\nAnd then when just enough light\r\nComes from just the right side\r\nAnd you find you're not who you're supposed to be?â\u0080\u009d\n\r\nWhen bad things are happening to him he often over thinks things. He doesnâ\u0080\u0099t get why everything he has been told about this life can make no sense at all when you bring God into the picture and you realize that you arenâ\u0080\u0099t supposed to be living on such a corrupted Earth and youâ\u0080\u0099re not living the life God has planned for you, you are you on the inside. Your soul inside a random body. \n\r\nâ\u0080\u009cThis is not what you're supposed to see\r\nPlease, remember me I am supposed to be\r\nKing of a kingdom or swinging on a swing\r\nSomething happened to my imagination\r\nThis situation's becoming dire\r\nMy tree house is on fire\r\nAnd for some reason I smell gas on my hands\r\nThis is not what I had planned\r\nThis is not what I had plannedâ\u0080\u009d\n\r\nHeâ\u0080\u0099s telling you he knows heâ\u0080\u0099s supposed to be living an amazing life in Gods kingdom and so are you. But someone brainwashed us (satan&gov) and corrupted our minds and itâ\u0080\u0099s only getting worse. Dire means extremely serious or urgent. His world around him is on fire now from our sins and he has gas on his hands because he has also sinned even though he didnâ\u0080\u0099t want to and regrets it. \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI don't know the whole meaning of the WHOLE song. \n\nBut I DO KNOW the meaning of the \"forest.\"\n\nIt symbolizes a group of people raising their hands. \n\n\"Chorus\" is a common word for a worship song that repeats a lot (Tyler was a worship leader when he wrote this song and all the songs on his first few albums). \n\nWhen he says \"down in the forest,\" he's talking about standing among people signing worship songs, with their \"hands held higher.\"\n\nThis is a symbol Tyler uses in his songs a lot. He uses the symbol of \"trees\" to mean people with their hands raised:\n\n- In \"Going Down\" (\"Have you ever heard the trees singing their song\").\n\n- In Ode to Sleep (\"the trees wave their arms\")\n\n- In Trees (\"silent in the trees, standing cowardly,\" which is someone who is NOT raising their arms nor singing, but is cowardly seeking a connection to God as everyone around them sings and reaches their arms up). \n\nAnd I think the \"something better\" he's talking about is God.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI think its about a general state of mind and how we all feel sometimes. It really captures the desperation and loneliness at those particular moments when we are lost. Its probable Tyler Joseph related it to some personal experience and every quote is a methaphor; I say this cause its written almost as a tale or in a narrative way. I personally think its beautifully written and I find it very surprising it hasnÂ´t become a huge hit.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI feel like this song is about getting relief from the fears, and doubts in your life. It gives us a way to escape. In the verses it seems to me like Tyler is talking about his life and how he's constantly being defeated by his problems. In the bridge I think he's talking about his childhood. \"Remember me I am supposed to be king of a kingdom swinging on a swing,\" we all have all these great plans for ourselves when we are young. We think we can grow up to be or do anything. But then Tyler says,\"my treehouse is on fire and for some reason I smell gas on my hands,\" he's stating that he burnt down his treehouse. He's the reason why his hopes from being a kid has drastically changed. I think this song really ties in the meaning of Twenty One Pilots name that our choices affect us. \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThe whole song is about your childhood. \n\nThe first verse is how you become aware of things that you weren't aware of as a child. Your emotions becomes more important to you as you start to reflect them more. Other words, you try to understand how everything work, including your feelings. You may feel older but in everyone else's eyes you're still a child, which can be frustrating. No one takes what you have to say seriously. Does it bother anyone else that someone else has your name, is you suddenly you realizing that you're just one among many others and you feel pressure to make yourself count, to live up to your name. \n\nSecond verse is about how we are scared to leave our childhood behind, it's all that we know. For some it is more scary than for others. In this case you try to go back to it, to stay a child. \n\nThe chorus is about the childhood we all have gone through,Yet the songs that nobody wrote is about the childhood that's not supposed to happen and which some of us stays in as we refuses to grow up. It shouldn't exist because we need to grow up in order to cope with the challenges that is laid upon us as adults. \n\nthird verse you still feeling pressure to be someone, to succeed in life and when you fail, the emotions becomes to much and it results in them giving up. \n\nIn the rap your world comes crashing down and you suddenly don't know who you are. You don't like how everything has changed. You're not the person you are supposed to be, refers to that you should have grown up by now. Eventually you feel forced to leave your childhood behind and it feels like you are killing everything that you are, that you love. Your save zone. \n\nHands held higher, we'll be on fire, is referring to how some of your childhood lives on inside of you even if you accepted the faith of being an adult. You are no longer singing the songs that nobody wrote. because you are not longer a child but your memories of your childhood is still with you. \n\n\nThis is how i read between the lines of the song, I'm not saying this is the way Tyler mean but still this is what i feel it's about. Sorry for my grammar frends...I am not very good at english.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n\"I scream, you scream, we all scream 'cause we're terrified of what's around the corner\" - This explains a fear of the future, of the unknown. Scared of all the things that could go wrong.\n\"Singin' songs that nobody wrote\" - This is sort of a long shot here, but Tyler has said a few times that the masks they wear in music videos and on stage represent taking their faces and names off of their music. Think about it. When you take away somebody's most identifiable physical feature and their own name, they don't become anyone. No one would recognize them. They become nobody. So when they talk about songs that nobody wrote, they speak about their own lyrics.\n\"Quickly moving towards a storm, moving forward, torn into pieces over reasons of what these storms are for\" - All the rhyming might make that a bit jumbled. But upon studying the lyrics a bit closer, I realized that this \"storm\" represents depression, bad thoughts, maybe even suicidal ones. \"Torn into pieces over reasons of what these storms are for\" Your life is falling apart because of all these things that are going on, this storm of depression.\n\"I don't understand why everything I adore takes a different form when I squint my eyes\" - All it takes to form a whole new opinion on something/someone is to look at it a different way. For example, when Tyler writes about squinting his eyes and seeing the things he adores differently, it infers that maybe the things he loves aren't so great after all, maybe they're toxic, maybe they're hurting him.\n\"Have you ever done that? When you squint your eyes, and your eyelashes make it look a little not right, and then when just enough light comes from just the right sides, and you find you're not what you're supposed to be?\" - Your vision, in this metaphor, is blurry. But from what? My guess would be tears. You're at a low point and you look at yourself and you finally understand that this is not what you were meant for.\n\nAnyways, that was just my interpretation of a few specific lyrics, the entire song is an incredibly wonderful, complex thing, and I doubt I'd ever be able to analyze the it all, but this is just what I've gathered (:\t\t\t\t\n\t\t\t\t\n\n"}