{"comment_0": "\nEncouraging the use of Es? Idiot..\r\nThis is not about taking Es, it's a typical love song. Just because an artist says one word in a song such as ecstasy or protection (in Jordin Sparks: Tattoo) people assume stupid meanings.\r\nI personally didn't like this song at first and i still don't love the electro side of it but it has grown on me. Should stick to his usual sound IMO.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nEcstasy\r\nnoun\r\n1. An overpowering emotion or exaltation; a state of sudden, intense feeling\r\n2. Frenzy of poetic inspiration \r\n3.mental transport or rapture from the contemplation of devine things\n\r\nThat's what he means when he says ecstasy. The tablet was named after the word because of the similar feelings. \r\nChris is asking her to join him in feeling the emotions he's been feeling for her and the state his mind is when she's around. \r\nDrugs? No. Overpowering emotion of passion. I think so.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nOh my god this song is incredible.\r\nHis voice,\r\nthe melody,\r\nthe beat,\r\nthe instrumentals.....\n\r\nINCREDIBLE.\r\nHIS BEST YET!!!!!!!!!!!!!!!!!!!!!\n\n\r\nI LOVE CHRIS BROWN \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis song is amazing. i dont understand if people doesnt like it. i think its his best yet. i also love with you and no air. but forever is my favourite. i mean, how can you not love it ? \r\ni just feel like dancing every time i listen to it :D\r\namazing !\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI LOVE THIS SONG! It has a really good beat.  I think it's about a guy who is madly in love and telling the woman he loves that he'll protect her no matter what.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ngood beat :]\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nahh this song is amazing!\r\nLove it =]\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthis song is pure AMAZEMENT!\r\ni was never too big on Chris Brown, but WOW!\r\nlove love love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthis song is so fake\r\ni love chris brown\r\ni really do\r\nand maybe this song just has to grown on me\r\nbut when i first heard it\r\ni was like uh, metro station? no.\r\nand i turned it off.\r\new\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nwow nice.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nIt's like a combination of Eiffel 65-style techno and R&B - never heard of the guy before, but this is a good song. Very smooth, good use of synth.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI've being looking for these lyrics for soo long, I finally found them, okay getting to the point \n\r\n1: I love this song:)\r\n2: This is my fav song by him \r\n3: He's hottttt \r\n4: His voice is amazing:) \n\r\nPlease don't disagree with me, cause if you do you have bad taste\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\namazing song!!! and i agree with admiralthrawn_1, this is like eiffel 65 or Daft Punk and R&B. I can't stop hearing it!!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI dont really like chris brown, but this song is quite nice and easy listening.\r\ni dont really like people who electronically dubb their voice but iv made an exception.\r\nI agree the work on the synth is awesome and it's so upbeat.\n\r\nAmazing\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis is so different fo Chris.\r\nBut it is awesome.\r\nLove the video as well.\r\nÃ\u009c\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ngood song i wonder who wrote it?\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\ni cant help but think he only released this song coz he knew it was prom season and he'd get a lot of money out of it. I really dont think he believes in what hes saying in this song. it doesnt have the feel that 'with you' does. its got a good beat and its listenable but its certainly not his best.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis song is amazing.\r\nI didn't really like it when I first heard it, but then my sister kept playing it, and it really grew on me.\r\nNow I love it.\r\nI just want to dance every time I hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI don't usually listen to this kind of music but you cannot say that this song is not amazing.  I feel like Chris Brown took a chance with this song and I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nrousson69er i dont think that at all!!\r\nIts just another love song. its cliche', but it does sound really good IMO\r\nMost songs could be interpreted as being about drugs (or just about anything for that matter) Even though the intention of the writer was for something completely different.\n\r\nJust something i didnt like about the video - his checkered pants were big at the top so they made him look like he had really fat thighs. His jacket also made him look hunched over even though he actually wasn't.... Just putting it out there!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nthis song is ill\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nHonestly, No offense to Chris Brown fans, but his music is just so annoying. His voice, & the sound of his beats, they are like every other rap/pop songs out there, I get sick of Chris Brown easily. I'm not saying I don't like this song, because I do, it's just his songs are so over played, and the quality isn't that great, so I don't see the big deal. But that's just my opinion, to other people he might the best thing ever. But to me, he is just the same as all the other pop singers.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI love this song! The only song I like by Chris Brown was Kiss Kiss... but this is so better than that! The music is, as some have mentioned, like Daft Punk did R&B with an European twist. And for once, the autotune effect sounds appropriate and accentuates the emotion of the song. Fantastic!\n\r\nOh, and for mattsuxballs, it was Chris Brown and his writing team (and B. Kennedy) who wrote this song. Polow da Don produced it, so he also gets (well-deserved) songwriting credit.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nactually   \"Urm...\" have you ever tried E? no? well then i suppose you dont know what its about lol. try and and find out then come back and tell me what its about. you won't understand till you do\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\n\"miss gay ass perfect\"\r\nsome people have better lives than you more fun than you obviously, the song is definatly about E, its not JUST ANOTHER LOVE SONG, its not at all, you try to disprove my proof on it being about E. then MAYBE i'll consider how wrong you are\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\n\"double your plessure, double your fun\"\r\n\"dance forever\"\r\nexstacy and raving haha,\r\nits the love drug :]\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\n\"double your plessure, double your fun\"\r\n\"dance forever\"\r\nexstacy and raving haha,\r\nits the love drug :]\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nomg!\r\nwho is the idiot who thought that it ment drugs...geeze!!..how much thought did you put it the song...dont you know how to just listen and feel the music...???\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nanyways..\r\ni think that this song means that its this guy(aka chris brown) who likes this girl(girl unknown) and wants to show her a good time and have her realx and just for them to have funn 2gether.\r\nthats all\n\n\n", "comment_29": "\nThis song is about ecstasy. If you've ever rolled you would definitely understand the song A LOT better. When you're rolling you feel like you want to dance and are just in love with everything and everyone. \"Double you pleasure double you fun\" he's telling her to take another pill so she can roll harder and last longer. When he says \"I won't let you fall\" to me the way the beat and sound change, it feels like she's starting to come down and so he's gonna help her back up (another pill.) I bet this song would make me roll hard if I listened to it while I was thizzing. Also in the video him pulling out the gum and putting it in his mouth makes it even more obvious.... you usually want to have something to chew on (gum or a pacifier to name a few) when you're on ecstasy to keep your teeth from clenching.   \n\r\nThis song is absolutely amazing....I'm not a big chris brown fan, but I gotta hand it to him on this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nFirst of all:  If you think that this song is about any drug referances, you're an idiot.  It's just a sweet song about a guy who loves this girl so much he want to be with her forever, why does everything have to be a referance anymore?\r\nSecond: If yoiu don't like Chris Brown, or even just this particular song, that's great!  DON'T LISTEN TO IT! But you don't have to come on here and trash it.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThis song is AMAAZINGGG !\r\nIt reminds me of every hilarious time i've had this year =')\r\nLoveee itt !!!\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nYep, this song is all about the drug.  If you've never experienced it, you don't even know what he means. sorry guys\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\ni LOVE chris!!! and iLOVE!!!!!!! this song!\n\n\n", "comment_34": "\ni'm not usually the biggest hip/hop, r&b fan, but this song is sweet\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nMy interpretation is totally in agreement with it being about E, when you are at the ultimate high this lyric is completely true\n\r\nIt's like I waited my whole life (whole life)\r\nFor this one night (one night)\n\r\nWhen you reach that high of complete euphoria, its like you waited your whole life to feel that way.\n\r\nFor those of you that disagree, music is about interpretation and each persons interpretation to it, doesn't mean that anyone is wrong or right, music speaks to each person differently. \t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nMost amazing lines,\n\r\nIt's a long way down\r\nWe so high off the ground\r\nSendin' for an angel to bring me your heart\r\nGirl where did you come from?\r\nGot me so undone\r\nGazin' in your eyes got me sayin'\r\n\"What a beautiful lady\r\nNo if's and's or maybes\"\r\nI'm releasin my heart\r\nAnd it's feelin amazing\r\nThere's no one else that matters\r\nYou love me\r\nAnd I won't let you fall girl\r\nLet you fall girl (ahh ohh oh oh yeah)\r\nYeah, I wont let you fall\r\nLet you fall\r\nLet you fall\r\nYeah yeah\n\n\r\nNeed not to interpret, just simple enough to be said to my Lady.\n\r\nAB\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\n--\n\r\nIt's you, and me\r\nMovin' at the speed of light into eternity.\r\nTonight is the night\r\nTo join me in the middle of ecstasy\r\nFeel the melody and the rhythm of the music around you.\n\r\nIma take you there, Ima take you there\r\nSo don't be scared, I'm right here, ya ready?\r\nWe can go anywhere\r\nGo anywhere\r\nBut first, it's your chance\r\nTake my hand\r\nCome with me\n\r\n--\n\r\nIt's you and me. We're moving at the speed of light in to our eternity. For tonight is the night we come together in the feeling of ecstasy. Feel the rhythm as we make music. I will get you to your climax but don't be scared. I'm here with you. We can imagine we're anywhere. But first, pledge with me. Take my hand and come with me. etc etc.\n\r\nq.\n\n\n", "comment_38": "\nThis is my favorite song, ever since '08 I loved this song.\nI'll break down my interpretation by lines:\n\n\"It's you, and me\nMovin' at the speed of light into eternity\nTonight, is the night\nTo join me in the middle of ecstasy\nFeel the melody and the rhythm of the music around you\"\n\nSo, he's saying tonight is the night that they're gonna have fun and be together in ecstasy, complete euphoria.\n\n\"I'ma take you there, I'ma take you there\nSo don't be scared, I'm right here, baby\nWe can go anywhere, go anywhere\nBut first, it's your chance\nTake my hand, come with me\"\n\nHe's gonna take her there, he's gonna be there for her. He's asking her to come with him.\n\n\"It's like I waited my whole life for this one night \nIt's gon' be me, you and the dance floor \n'Cause we only got one night Double your pleasure, double your fun\"\n\nHe feels as if he waited forever for this night to happen, to dance with this girl. They only have one night together so \"double your pleasure, double your fun\".\n\n\"And dance forever-ever-ever \nForever-ever-ever \nForever-ever-ever \nForever\"\n\nPretty obvious, he wants to dance \"forever\" with her, or at least in their mind they feel like they are.\n\n\"Feels like we're on another level\nFeels like our love's intertwined\nWe can be two rebels\nBreakin' the rules\nMe and you, you and I\"\n\nThey feels like their on another level of happiness or excitement. The line about their intertwined love is about how they're joined together on that night. They can be rebellious and have fun breaking the rules together.\n\n\"All you gotta do is watch me\nLook what I can do with my feet, baby\nFeel the beat inside\nI'm drivin', you could take the front seat\nJust need you to trust me\"\n\nI think he's trying to impress her with his moves. The front seat part, I'm not too sure, I think he's saying she could make the decisions too.\n\n*Chorus* \n\n\"It's a long way down\nWe so high off the ground\"\n\nFiguratively, they're high above the ground, in ecstasy.\n\n\"Sendin' for an angel to bring me your heart\"\n\nAwww, I luv this line, he wants her heart, duh. \n\n\"Girl where did you come from?\nGot me so undone\nGazin' in your eyes got me sayin'\nWhat a beautiful lady\nNo if's and's or maybes\"\n\nBy far, my most favorite lyrics from any song. He's saying, \"Where did a girl like you come from?\" She changed the whole way he thought about love and changed his life. Obviously the next lines means that when he looked in her eyes he quickly realized; she's the most beautiful woman no \"if's\", \"and's\", or maybe's\". True love right there.\n\n\"I'm releasin' my heart\nAnd its feelin' amazing\nThere's no one else that matters\nYou love me and I wont let you fall girl\"\n\nHe's pouring out his heart to her and it feels amazing! No one else in his life matters to him as long as she loves him the same way and he wouldn't let her fall for anyone else but him. #Romantic\n\n*Chorus*\n\nSo basically, being with her this one night, dancing, having fun, and expressing his love for her is like ecstasy and it's a simply amazing feeling.\nI love this song sooooo much.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nWhile I support the idea that you can't simply associate certain words (like ecstasy) to imply the entire song is about drugs, I do believe this song has references to some type of substance. First of all, recently it was revealed that Chris Brown was diagnosed with a variety of mental disorders (bipolar, ptsd, etc.,) and the reason for a majority of his problems were from \"self diagnosing\" with various illicit substances to resolve these personal issues (something I can totally understand). Obviously the people on here who claim it's not a reference to drugs, have never done MDMA, (or even LSD/Mushrooms) at a Club because this really does fit oh too perfectly. People slander the term ecstasy and demonize a really amazing empathogen that has been clinically proven again and again to be less dangerous and toxic than nicotine, with numerous beneficial effects. From showing the most promise out of 60 substances tested in reversing symptoms of parkinsons, to the incredibly beneficial empathogenic effects it provides in a therapeutic setting (particularly involving married couples), MDMA is a really amazing and wonderful substance that for various surreptitious reasons, has been slandered and demonized. \n\r\nSecondly, while people on here quoted various generic definitions for the term, I'm going to quote a more well explained definition and meaning from the paper, \"Deconstructing Ecstasy: The Politics of MDMA Research\". In it Charles Grob says, \"What is Ecstasy? Defined by the New Webster's Dictionary as a state\r\nof intense overpowering emotion, a condition of exultation or mental\r\nrapture induced by beauty, music, artistic creation or the contemplation\r\nof the divine, ecstasy derives etymologically from the ancient\r\nGreek ekstasis, which means flight of the soul from the body. The\r\nanthropologist, Mircea Eliade, who explored the roots of religious\r\nexperience in his book Shamanism: Archaic Techniques of Ecstasy,\r\nhas described the function of this intense state of mind among aboriginal\r\npeoples. Select individuals are called to become shamans, a role\r\nspecializing in inducing ecstatic states of trance where the soul is\r\nbelieved to leave the body and ascend to the sky or descend to the\r\nunderworld. The shaman is thus considered a \"technician of the\r\nsacred\", having been initiated through a process of isolation, ritual\r\nsolitude, suffering and the imminence of death. Such initiation into the\r\nfunction of ecstatic states of consciousness, always accompanied by\r\ncomprehensive tutelage from tribal elders, allows the shaman to\r\nassume for his tribal group the vital role of intermediary, or conduit,\r\nbetween the profane world of everyday existence and the sacred\r\ndomains of alternative reality (Eliade, 1951; Schultes and Hofmann,\r\n1992).\" (Grob, 1-2)\n\r\nWhile modern definitions and references of the term can apply to completely generic scenarios, the song introduces a much deeper meaning. Something frequently done at dance clubs, MDMA not only causes you to feel the music but is something one would want to do with their significant other. More than anything, this song sounds like Chris Brown proposing the offer to join him \"in the middle of Ecstasy\". He then comforts her and says he'll be right there and particularly this is something very poignantly striking to me or anyone else who has done MDMA or something similar at a club with a girl.   \t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nWhile I support the idea that you can't simply associate certain words (like ecstasy) to imply the entire song is about drugs, I do believe this song has references to some type of substance. First of all, recently it was revealed that Chris Brown was diagnosed with a variety of mental disorders (bipolar, ptsd, etc.,) and the reason for a majority of his problems were from \"self diagnosing\" with various illicit substances to resolve these personal issues (something I can totally understand). Obviously the people on here who claim it's not a reference to drugs, have never done MDMA, (or even LSD/Mushrooms) at a Club because this really does fit oh too perfectly. People slander the term ecstasy and demonize a really amazing empathogen that has been clinically proven again and again to be less dangerous and toxic than nicotine, with numerous beneficial effects. From showing the most promise out of 60 substances tested in reversing symptoms of parkinsons, to the incredibly beneficial empathogenic effects it provides in a therapeutic setting (particularly involving married couples), MDMA is a really amazing and wonderful substance that for various surreptitious reasons, has been slandered and demonized. \n\nSecondly, while people on here quoted various generic definitions for the term, I'm going to quote a more well explained definition and meaning from the paper, \"Deconstructing Ecstasy: The Politics of MDMA Research\". In it Charles Grob says, \"What is Ecstasy? Defined by the New Webster's Dictionary as a state\nof intense overpowering emotion, a condition of exultation or mental\nrapture induced by beauty, music, artistic creation or the contemplation\nof the divine, ecstasy derives etymologically from the ancient\nGreek ekstasis, which means flight of the soul from the body. The\nanthropologist, Mircea Eliade, who explored the roots of religious\nexperience in his book Shamanism: Archaic Techniques of Ecstasy,\nhas described the function of this intense state of mind among aboriginal\npeoples. Select individuals are called to become shamans, a role\nspecializing in inducing ecstatic states of trance where the soul is\nbelieved to leave the body and ascend to the sky or descend to the\nunderworld. The shaman is thus considered a \"technician of the\nsacred\", having been initiated through a process of isolation, ritual\nsolitude, suffering and the imminence of death. Such initiation into the\nfunction of ecstatic states of consciousness, always accompanied by\ncomprehensive tutelage from tribal elders, allows the shaman to\nassume for his tribal group the vital role of intermediary, or conduit,\nbetween the profane world of everyday existence and the sacred\ndomains of alternative reality (Eliade, 1951; Schultes and Hofmann,\n1992).\" (Grob, 1-2)\n\nWhile modern definitions and references of the term can apply to completely generic scenarios, the song introduces a much deeper meaning. Something frequently done at dance clubs, MDMA not only causes you to feel the music but is something one would want to do with their significant other. More than anything, this song sounds like Chris Brown proposing the offer to join him \"in the middle of Ecstasy\". He then comforts her and says he'll be right there and particularly this is something very poignantly striking to me or anyone else who has done MDMA or something similar at a club with a girl.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nAnd now, six years after I made that original comment, I think that Chris Brown is one of the most loathsome, disgusting women-abusing men on the planet, and I would prefer if he dropped off the face of the earth and was never heard from again. He's truly despicable scum.\n\nSong's still catchy, but Chris Brown is slime on my shoes.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nWELLLLL first of all this isnt a site for how you like the song its the meaning behind it! lol. anywase the meaning of this song is about extacy. What he talks about in this song is the description of him on E, for example\n\r\n1,2,3,4  Is how many tabs he takes.\r\nThe echoing is when your on E everything Echo's.\r\nhe's intruducing a girl to the drug in this song\r\nand everything speeds up on E and thats why he says moving at the speed of light into eternity. and when \"tonight is the night you join me in the middle of extacy\" is that you only do it once a month or so, thats why it's only this one night he is refering to, they can go anywhere in their minds as well. and he discovers this drug and wants to dance to it, and the Double ya pleasure double ya find part is about taking more tabs. Forever is the title because it seems to last forever dancing. \"feels like were on another level\" On E i guess you feel that everything is happy and PERFECT!, and oh yeah when he sais feel the beat, on E music never sounded better to you!, you'll never understand this song until you know what im talking about. When i first heard it i thought WTF? now that i know what hes singing about you totally understand it, and when he says \"i wont let you fall\" he means that he won't let her have a bad High.\t\t\t\t\n\t\t\t\t\n\n"}