{"comment_0": "\nThis is one of Tool's most amazing songs, and really sums up the entire theme of Aenima. This song is about growing, changing, and moving towards the next level of human evolution and conciousness. It's deeply rooted in Jungian theory. \n\r\nBasically, it's believed that there are three levels of human evolution and each has it's form of conciousness. There's the 1st level with 44 chromosones. These are primitve people's like the aboriginies in Australia who do not percieve anything outside of themselves. They only see one large conciousness with no distinguishment between organisms. Then there's the second level with 46 chromosones. That is us. We are a chaotic disharmonic conciousness that is basically used as a stepping stone between the first and third levels. The third level is 48 chromosones. (Or 46 & 2, with 2 being the sex chromosones x & y). This is the higher level of conciousness. Our destination. \n\r\nBut this is where the Jungian theory comes in. It is believed that you can not reach this third level of evolution without first delving into yourself and basically cleansing your conciousness for the next jump. That's where the Shadow comes in. The shadow is basically everything about that is unseen that you are uncomfortable with or hate. This is also known as the Anima (hence the name of the CD). \n\r\nThe last part of the song sums all of this up...\n\r\n\"See my shadow changing, \r\nStretching up and over me \r\nSoften this old armor \r\nHoping I can clear the way \r\nBy stepping through my shadow, \r\nComing out the other side \r\nStep into the shadow \r\nForty six and two are just ahead of me\"\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\n\"Everyone carries a shadow, and the less it is embodied in the individual's conscious life, the blacker and denser it is. It may be (in part) one's link to more primitive animal instincts, which are superseded during early childhood by the conscious mind.\" - Jung\n\nThe song is about Jung's Psychological theory of the \"Shadow.\"\n\nAnd yes, it does have something to do with Chromosomes- Jung said that it is \"One's link to more primitive animal instincts..\" Humans have 46 chromosomes. Apes have 48. \n46 + 2 = 48\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song is so awesome and powerful I don't even have words to describe it.\n\r\nI was just thinking one thing; could the whole shadow story be, among the other stuff, even a reference to the first verse of Sober? I like to think that when in Sober the protagonist of the song was chased by this negative (his own?) shadow, in Forty Six and Two he finally evolves, he get over his misery and he's free of his old shadow.\n\r\nJust guessing of course...\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\n[This song is about self improvement]\n\nMy shadow's\nShedding skin and    [he sees himself as frayed and in a state of loss]\nI've been picking\nScabs again.            [He knows he has been the cause of it- doing it to himself]\n\n\n\nI'm down\t\t        [he is deeply..]\nDigging through\t\t[searching his inner self]\nMy old muscles\t\t[of his fundamental makeup (habits/interest/hates)]\nLooking for a clue. \t[of what is causing this]\n\n\nI've been crawling on my belly\t\t     [he has left nothing unexamined]\nClearing out what could've been.\t             [busily discarding haunting what-ifs]\nI've been wallowing in my own confused    [everywhere he digs he finds ]\nAnd insecure delusions\t\t\t     [the what-ifs and lies to self that are     -------------------------------------------------------------[truly not needed]\n\nFor a piece to cross me over\t\t   [he hopes for an easy fix]\nOr a word to guide me in.\t\t           [or the guidance to fix himself]\nI wanna feel the changes coming down.  [he truly wants to get better]\nI wanna know what I've been hiding in\t   [and identify the hidden source of his -------------------------------------------------------------[problems]\n\nMy shadow.\t\t\t\t[he identifies his Shadow as the inner self- his ------------------------------------------------[core being, or Soul]\nChange is coming through my shadow.\t[he knows that to fix himself he must mend his Soul.\nMy shadow's shedding skin\t\t[he sees that his soul is suffering]\nI've been picking\nMy scabs again.\t\t\t\t[and that he was the cause of it all]\n\nI've been crawling on my belly\t[he continues to examine himself, knowing \nClearing out what could've been.       [now what he has learned]\nI've been wallowing in my own chaotic\nAnd insecure delusions.\n\nI wanna feel the change consume me, \t[he knows to truly change will devour all ----------------------------------------------------------[that he was- and get rid of it]\nFeel the outside turning in.\t\t[he wants his outer self to change along with ---------------------------------------------------[his inner self]\nI wanna feel the metamorphosis and\t[he wants the change all through him]\nCleansing I've endured within\t\t[that he has started to repair in His -----------------------------------------------------------------Shadow]\n\nMy shadow\nChange is coming.\t\t\t[its working!]\nNow is my time.\n\nListen to my muscle memory.\t\t[in his new self construction, he looks -------------------------------------------------------------back with hindsight]\nContemplate what I've been clinging to.\t[on his foolish beliefs/delusions]\nForty-six and two ahead of me.\t\t[there were 46 cycles of refining the list ------------------------------------------------------------of what to keep, and 2 left to do]\n\nI choose to live and to\nGrow, take and give and to\nMove, learn and love and to\nCry, kill and die and to\t\t[This is self correction #45- the aspects he has chosen to hold onto]\nBe paranoid and to\t\t\t[There are 14 at this point]\nLie, hate and fear and to\nDo what it takes to move through.\t[do it again (divide the list in half)]\n\nI choose to live and to\nLie, kill and give and to\t\t[This is correction #46- the refined list of what\nDie, learn and love and to\t\t[he chooses to retain in his core being. 7 left]\nDo what it takes to step through.\t[do it again (divide the list in half)]\n\nSee my shadow changing,\t\t\t[see how it works?]\nStretching up and over me.\t\t[the Shadow is more whole than it has been]\nSoften this old armor.\t\t\t[his old defenses really arent needed anymore]\nHoping I can clear the way\t\t[to finish he must FINISH]\t\nBy stepping through my shadow,[each pass through his shadow is another turn]\nComing out the other side.\t\t[what emerges is the new self/list]\nStep into the shadow.\t\t\t[do it again-]\nForty six and two are just ahead of me. \n[he has done it 46 times, and 2 more remain]\n\nSo, he has learned how to improve himself, and we are hearing if his process between the 46th and 47th repeat\n\nHe lists his previous \"insecure delusions\" of 14, and whittles it down to 7, keeping only those he wishes to. He must do it 2 more times, leaving him with 1.7 aspects (1 fully, another just mostly) he wishes to hold onto at the end- that which he holds MOST important in his being.\n\nSo its not anything bad, nor violent. Its just ruthless self examination and improvement, performed whenever he notices his shadow looking a little rough.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nOkay, we have 44 and 2 chromosomes currently and 46 and 2 is said to be our next step in our \"evolution\". I'm not religious, but Jesus Christ was thought to have 46 and 2 chromosomes, which made him what an amazing person in which he was claimed to be lol.  It's kind of a more spiritual thing dealing with mind, body and soul. Even involving different dimensions like a 4th dimensional being,but w/e idk. This song talks about all of our problems as who we are currently and that we must live through them in order to get to our next step (46 and 2)....if we make it. Something interesting could be in our near-future.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI really donâ\u0080\u0099t like this idea of it being about selling records or TooL being tedious for Maynard. One of the reasons APC was formed was because TooL were in a battle with lawyers due to recording writes when theyâ\u0080\u0099re producers or something changed.  TooL thought they were in titled to record another album but the theyâ\u0080\u0099re new record company didnâ\u0080\u0099t agree and when tool decided to take theyâ\u0080\u0099re stuff somewhere else theyâ\u0080\u0099re company tried to sue them for breaking a contract, this went on for years so during the time tool just toured on Opiate and Maynard started APC. He also stated that he feels more at home with tool than APC, which I think, is audible as it sounds so much.... Uh, you just canâ\u0080\u0099t explain it. Like people have said before tool try to make theyâ\u0080\u0099re songs meanings apply to everyone, to me its about suffering from depression, this song helped me through some hard as shit times. Iâ\u0080\u0099m NOT talking about fucking â\u0080\u0098my parents hate me, I have no friendâ\u0080\u0099 depression it was the real shit. Its about, yeah, just waiting out, this vampire- the cloud of people and ideas is trying to drain you and its getting so tiring you do just want to walk away- suicide. But you just gotta keep thinking of what you can have at the end of it, seriously anyoneâ\u0080\u0099s who has a rough time it helped me so fucking much, I swear and Iâ\u0080\u0099m so grateful no one will ever know how much. And all this shit about Maynard being god- please stop. If I was Maynard I would take offence as in many songs he makes fools of people who believe in gods and the idea of â\u0080\u0098godâ\u0080\u0099 itself, I would feel seriously misunderstood and that my fans were complete dumbasses. Hey I dunno maybe heâ\u0080\u0099s just a good old Christian full of sarcasm or whatever, but just please stop its irritating at religion itself. \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n     This song is about Maynard delving into the painful memories of his past which he has repressed \"I've been picking scabs agian\", this is represented in Jungian Psychology as his \"Shadow\", in order to grow and overcome there effects on him.  The shadow in this song is the same as the Snake in H \"my shadow's shedding skin\", which represents urges to treat Devo how his father treated him, abusively.  In order to eliminate his shadow he must first elucidate it's comments by looking into what he has repressed in his shadow.  The song shows this metaphorically through getting in touch with past uses of his body.\n\r\nI'm down\r\nDigging through\r\nMy old muscles\r\nLooking for a clue\n\r\nI've been crawling on my belly\r\nclearing out what could have been\n\r\n     The lyrics may also imply that he's been analyzing his dreams to further elucidate these repressed thoughts and feelings \"wallowing in my own confused and insecure delusions\" also \"chaotic and insecure delusions\" all to find and bring out these unconscious fears, and urges. \n\r\nfor a piece to cross me over \r\nor a word to guide me in\r\nI wanna feel the changes coming down \r\nI want to know what I've been hiding\n\r\nIn my shadow\n\r\n     The last 2 verses of this song are merely a declaration that he will do whatever is necessary, lie, cheat, steal, love, kill, die, etc. to express his shadow and by doing so understand it, and bring it into consciousness.\r\n     He is throughout this song attempting to bring his \"shadow\" into light, merging it with his consciousness.  When he has merged his unconscious fears and urges with his conscious psyche \"stepping through (his) shadow\" he will have gained understanding of why he feels the way he does towards Devo, and these feelings will no longer be unconscious urges, effectively evolving (but in a psychological way) which is what the line and title \"Forty Six and 2\" represents metaphorically. Or at least that's what I got out of it.\n\r\nOn a related note: THIS SONG IS AWESOME\n\n\n\n", "comment_7": "\nThe title of the name does not only have to do with the Anima, it is called Ã\u0086nima. It is like saying an \"Anima enema,\" or flushing out your old self. That would relate more closely to the theme of the album, which is change.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song isn't about drugs at all...\nAs people have already said, there are 46 chromosomes in human DNA - the song is about evolving to having an extra two chromosomes, explaining the 'shedding skin'. When he says \"I\", he is talking about us as an entire, and unified, race. He's talking about people clinging to being the same old repetitions of classic human behaviours, and not allowing ourselves to properly better ourselves as a race (picking scabs - stopping the 'healing' process).\nMy interpretation of the shadow symbolism is that we have to embrace the darker parts of ourselves in order to see the light; to be conscious of our destructive paths so we can aim for a better day. It could also mean a temporary sacrificial act to secure a long term improvement (stepping through my shadow, coming out the other side...)\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nHere's how I interpret the song:\n\r\n\"My shadow's shedding skin\r\nI've been picking scabs again\"\r\n   -He's accepting things that he normally thinks of as not him.  His shadow is shrinking because there are fewer things he rejects.\n\r\n\"Listen to my muscle memory.\r\nContemplate what I've been clinging to.\r\nForty-six and two ahead of me.\"\r\n   -He's considering everything he rejects.  He's accepting things, so he is coming closer to 46+2.\n\r\n\"I choose to live and to\r\nGrow, take and give and to\r\nMove, learn and love and to\r\nCry, kill and die and to\r\nBe paranoid and to\r\nLie, hate and fear and to\r\nDo what it takes to move through.\r\nI choose to live and to\r\nLie, kill and give and to\r\nDie, learn and love and to\r\nDo what it takes to step through.\"\r\n   -He's choosing to do all these things, both things that he already accepts and things he pushes away, in order to evolve into the next step.\n\r\n\"See my shadow changing,\r\nStretching up and over me.\r\nSoften this old armor.\r\nHoping I can clear the way\r\nBy stepping through my shadow,\r\nComing out the other side.\r\nStep into the shadow.\r\nForty six and two are just ahead of me.\"\r\n   -His shadow is changing because he, himself, is changing.  It's stretching over him like it's consuming him.  He opened the floodgate when he started embracing his alter-ego.  He is hoping that by becoming everything at one time, he can evolve into a new consciousness.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nthis is beautiful. the song the spiritual meaning behind it. it makes for such a beautiful entity. tool is definately the best band in the world. it makes me feel beautiful to listen to them. thank you maynard, adam, justin, and danny from the bottom of my heart.\n\n\n", "comment_11": "\nI think this song is about Maynard getting stung by a bee\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI think a big thing about Tool is the ambience in the subject of their songs.\n\r\nThis is the only band that I can come back to and listen to a song time after time and it'll have a different meaning.\n\r\nThey have something in there for all levels of listening.\n\r\nSo be careful when taking in the surface of their songs.  You have to dig to fully understand the message.\n\r\nI'm sure Stinkfist isn't just a song about fist f*cking.\n\r\nI'm sure Prison sex isn't a song just about what goes on behind the dirty corners in a penitentary.\n\r\nAnd I'm sure 46&2 isn't just about evolution in chromosomes.  I think Mrs. Nelson said it best, \"About the song, I think the Carl Jung theory is the best. But only as a metaphor.\"\n\r\nThe message to me in this song is that evolution is not an automatic process.  It is not something that a encompasses a whole race  We as unique individuals have a chance to evolve based on our choices.\n\r\nA lot of these things are relative.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nForty-six and two is 48, the number of chromosomes that chimps have. I find it quite ironic that people think 48 chromosomes is the number we'll have once we \"evolve\", since we usually view chimps as less evolved than us. Before you decry me for ruining such a great song, let me expound.\r\n   Everyone is correct, the lyrics are based on Carl Jung's theories, which, in his day, were very elucidating, but which today, with the advent of modern science, are mostly balderdash. Maynard is, without a doubt, one of the more intelligent \"rockers\" out there today, and I greatly appreciate his lyrics for their depth, symbolism, and educational anecdotes that they provide much of their fanbase with. I would, however, advise that you take what he says with a grain of salt, however, as he is writing poetry, not scientific literature. The only reason I'm typing this is because I've seen lots of my friends, who were previously interested in Tool, fall into traps built by some of these New Age cults that feed off of people who mistake art for science. Upon becoming recruited by these people, they subsequently lost interest in their lives thinking that they were all going to miraculously evolve on 2012 hence rendering any effort to better their lives, or the lives of anyone else, futile since they'd all ascend to the next dimension.\r\nOn a lighter note...\r\nI F'ING LOVE THIS SONG!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI feel incomplete when I don't listen to this song at least once a day. And I still haven't found my meaning to it; I just find it perfect and some how connects with me. I'll find out later.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song talks about two things: chromosome levels and the shadow of the mind. 46 & 2 refers to the chromosome count in the body. Our current count is 44 autosomes and 2 sex chromosomes, but scientists theorize that the humans may evolve to a new level of 46 & 2. The shadow is a part of a person's brain that contains the faults of their personality. Most humans deny that the shadow exists because they are afraid to face what they hate about themselves. This can cause people to project these attributes on others. It is possible that the song is saying that humans of 46 & 2 will have a very bad problem with their shadow, which might cause serious problems.\n\r\nThis song can be used in explination of the show Elfen Lied. It is a show about a new breed of humans that have horns on their head and invisible hands that can be used to move objects and kill. It is believed that these humans must kill the current breed of humans to prosper, so most of them turn homicidal. This is not entirely correct, as it seems that only ones that were treated poorly as children go insane. The plot revolves around a female of the new breed that is already insane. An organization is trying to kill her, along with every other one of her kind. It gets very complicated and there are quite a few characters with important histories. If you haven't seen it, you should.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nWell it's obvious it's about chromosomes in some way or another, but my idiot friend thought it was a football scrimmage line reference \t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI conviced my Biology teacher to let me bring this song into class becuase it talks about chromosomes and evolution hahahaha =P\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nYikes.\n\r\nI can only hope Maynard doesnt actually take this stuff seriously. \t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis song is about the next step in our evolution. We currently have 44 chromosomes. the 2 extra chromosomes will bring us to our next state of being. Look up 46 and 2 chromosomes. And remember build your own faith never let someone hand you you're beliefs.\n\r\n(Look up spirit science on youtube for more info on 46 & 2)\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nSometimes you need someone close to you who gets you- to help you through the process of shaking off your demons.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nTool's best song.\n\r\nAccording to jungian theory, the shadow is your most hidden personality trait: it embodies the unknown- everything you hate and fear. In short, its your least developed mental muscle, the quality you have the most trouble displaying because its so alien to your mental makeup.\r\n46 and 2 is a reference to evolution. Humans have 44 chromosomes and 2 sex chromosomes. According to the theory of evolution, the next step in human evolution would be 46 chromosomes and 2 chromosomes.\r\nI do not think MJK is talking about literal evolution on a biological level; he's talking about evolution on a mental level. Dig through your old muscles as it were, evolve AS A PERSON. Find what you hate most and fear most and have trouble with the most and work your hardest at it until you've mastered it and \"stepped through the shadow, come out the other side\" as a better person.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI highly doubt the Jungian angle.  I read a great deal of Jung, though not all his works.  He had some cool ideas, and some crazy ideas (for example at one point speculating that the reason the number 4 appears so often in dreams is related to the valence of carbon).  However, the idea of evolving extra chromosomes sounds unlike Jung.  From other internet forums I've seen that apparently Jung thought Australian aborigines and Africans had only 42+2 chromosomes whereas the rest of the population has 44+2.  That's totally untrue, and clearly has rascist overtones.  And presumably Jung, a learned person, would have known better.\n\nI suspect this association of 46+2 with Jung is an urban legend, forgery, or fabrication.  Whether MJK bought into this or was just using the idea artistically, is difficult to know.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nWhen we embrace our archetype, we step into something like self-actualization. Digging to the bottom always ends up in darkness. The attitude prevalent in this piece is entirely aware of and excited about this. It's an attempt to travel further inward. Whether through a analysis of an individual's past or that of their species, it serves as an authentic endeavor to subsume our darker nature. The song can serve as a guided mediation in order to engage with the shadow. When the shadow is encountered, it must be integrated into one's identity to avoid dissociation and psychosis. It is neither easy nor common to step through the shadow and come out the other side. When we integrate our shadow, we gain strength and insight. We gather the strength of our demons, and subjugate them to our volition. \nThe chromosomal reference is an analogy or exaggeration of taking this next step. By briefly mentioning the genome, we are able to consider the next step human evolution.\n\"Man is a rope, tied between beast and overman - a rope over an abyss.\" - Nietzsche\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI forgot to mention at the beginning that it is not just Jungian theory, but Melchizadek as well. \t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nthe mans quite correct :)\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ni got here another theory about Forty Six & 2\n\ninnuendocornecopria.com/…\n\r\nwith much more explanation\n\r\nbut the guy above said it shorter :)\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nOberones is quite right....I don't think I could have said it any better, damn man, extreme props.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nWhen i hear this song, nothing else matters.  Poptarts047 rulz!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nOberones got it right.\n\r\nInnuendo says it all.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nhahahahha WOOOO Blink does suck! Poptarts are the shit, I eat them every morning. And the first guy explains this song very nice and neatly, i would wanna read a huge book about a song, its nice to have a kick ass song summed up..over and out\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nForty-six & 2 just ahead of me.\n\r\nChanging modes; moving laterally in order to shift upwards and out.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nHere's something a little similar for your brains, but on a LITTLE different note:\r\nThe meaning of 46 + 2: \r\nAccording to Melchezedek, our planet is covered with geometrically constructed 'morpho genetic grids'. These grids extend from about 60 feet under the Earth's surface to about 60 miles above the Earth, arranged in geometric patterns. Each species has its own grid, which supports life, and connects the consciousness of its particular species. Before any species can come into existance or make an evolutionary step, a new grid must be completed. When a species becomes extinct, that particular species' grid dissoves. \n\r\nA new grid was completed in 1989 - the 'christ-consciousness' grid. This grid will allow humans to evolve into our next version. We'll develop two additional chromosomes (which are really 'geometrical images' designed to resonate with our specific grid) for a total or 46 + 2. \n\r\nThe main change will be a shift to the \"unity consciousness\". Every cell in your body has its own consciousness and memory. You, the higher being that occupies your body, make the millions of different consciousnesses in your body work together as one being. How does this relate to this grid? Think of yourself as a cell and the grid as the higher being. We will still have individual consciousness, but will be united in the form of a higher being in order to work as one entity.\" - From toolshed.down.net\n\r\nScary, huh?\n\n\n", "comment_33": "\noh wow man...you just, like blew my mind...\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nWo man thats deep shit\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nthis song rules\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\n1st off, pop tarts do rule! Blink does suck! Anyway, this song was the very thing that made me decide to get up and DO SOMETHING with myself! Thank God, (or whatever you worship) for Maynard James Keenan! Yes, obviously this song is about change, but until I really looked into it did I realize how deep it got. Until today I didn't know about all of the principles that a few people posted above, I was alone in figuring out the meaning for myself. I'm glad I took the hard way though, my brain needed to be stirred around, i wouldn'thave it any other way. \t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nsome of the deepest and most philisophical explinations to a song i have ever heard, i like you peopl. the blink sucks was quite random and unnessesary. but true\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\njust a question though, there is a whispering part in the begining. i know i have seen the lyrics for it somwhere, and im pretty sure the first line is \"jack knife\" but i dont know what the rest is, anyone else know?\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nwell..i just read a book The Hitchikker's Guide to the Galaxy..and Forty Six & 2 is mentioned in it..and well..sence the book came before the song, i wouldnt be surprised if the idea came from the book~ but thats jsut my stab in the dark~~READ THE BOOK! its good\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nawesome song ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\n   This IS Tool's best song. Oh, ya know that whisper in the beginning; it is saying Jungian (as in the theory). Which is what the title and song is refering to. \r\n    But another thing with the title is that \"46 & 2\" is also the (people who read sheet music will get this) time signature; in other words there are 46 beats per measure and the 1/2 note gets one beat.\r\n   One more thing that occured to me is that if you turn the six in 46 upside down the number is 49 which is a square number (bare with me) and as we all know, square numbers have to do with multiplication and if you multiply the 2 by itself you get 4, so it would be changed to 49 & 4 and they are both square numbers. And, as the song says the guy is getting bigger and better or also more SQUARE.\n\r\nDeep isn't it?\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nits about taking a look in a mirror and looking at more then the outside and then putting make-up onto the inside of u not the outside.\r\nAnd the basic theory of 46 + 2\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nmetallichic. u are so wrong. \"hitch hiker's guide to the galaxy\" talked about the number 42. and don't only read that book read the other 4 in the series. \"restaurant at the end of the universe\", \"life the universe and everything\", \"so long and thanks for all the fish\" and \"mostly harmless\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nthere now some people actually have read into what tool beleives.it is a beautiful song you guys are somewhat right. 46&2 chromesones is also called christ conscienceness.the next level of human evolution.we will percieve the next demintion or wavelength but we will never reach it unless a pole shift happens and that is where the world will spin for 3 days and total destruction will happin wiping out most of you \"dumbfounded dipshits\".then the enlightened ones will acend into christ conscienceness. people with 48 thingys will be able to control life energy or prana and be able to manifest objects like in the move \"the sphere\"\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\n\"This song...is about...subtle changes\" MJK,lollapozza 96\r\nOberones,youl prob never come look at this song again,but your theory blew my mind,and i am going to study jungian now!\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nNow that we know that this song is about the 46&2 in jungian terms,lets think about what would posess a band to write a song about it. According to jungian,before one can evolve into the third realm of human consciousness,he must first face Anima,an aura made of everything he has supressed or feared within himself. And for someone whos facing  the possibility of impending doom,he sings this song with a lot of confidence that he will pass over and evolve to the third level. Maybe with this song,he is actually saying he is more confident now than he has ever been that he is in tune with himself and knows himself very well. Also,i believe Hindus refer to such an extreme confidence in ones self as a person,as well as a part of the entire universe,\"Nirvana\",or \"Enlightenment\"\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nisn't Nirvana and Englightenment all Buddhist ?\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nby ARMTHEARMLESS on 07-02-2002 @ 03:25AM  \n\r\n\"I think this song is about Maynard getting stung by a bee\"\n\n\r\nLOOOOOOOOL, It's so off topic and sillly and ruins a decent forum ... But I couldn't help but laugh XD\n\r\nand Oberones - I want to study Jungian now :) Props for the explanation.\n\n\n", "comment_49": "\nDrunvalo Melchizadek's 46 and 2 theory is fucking insanity.  Remember this next time you're taking a gentics test kids.  Aborininees have forty six chromosomes just like the rest of us.  Drunvalo's theory is borderline racist and the worst kind of pseudo science/Scientology bullshit.  Anybody who believes a theory that says people will literally have extra chromosomes added to the ones they already have are as nuts as Drunvalo and have probably been smoking to much peyote.  Can't happen.  Won't happen.  The song rocks though.  \n\n\n", "comment_50": "\nI'm still laughing from \n\r\nARMTHEARMLESS on 07-02-2002 @ 03:25AM \r\n\"I think this song is about Maynard getting stung by a bee\" \n\r\nBwahahah, Ok then Cake - That ^^^ Is the real meaning of the song ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\ni think this is about someone taking a shit that is so big ir rips apart their anus and it scabs over and ictches so he picks at it\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nwell i have to tell u people somethin, just a note on the name of the album!\r\nit is spelt Ã\u0086nima an pronuonced \"ahh-ni-ma\"\r\ndont correct me on this, cos this is how mjk pronounces it and same with the rest of the members of tool\r\ni have a video of Maynard doing an interview and that is how he pronounces it\r\nwell thats all i got to say, cya'll!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nin respone to undertoe's comment.. it is said that the planet will stand still and the pole shift will occur when niburu (planet-x) comes in spring of 2003. \t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis is Tool's all time greatest song. one of my all time favorite songs, just a kick ass song.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nYo Undertoe or Diablo2k, do u know of a good site to read about that shit?\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nthe whispering at the start of the song is not saying \"Jungian\", it says \"join in...join in my child.  digging through, my old numb shadow\" just a little correction for paedrough.  otherwise a fuckin awesome song \t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nOn a different note, AEnima is a combination of words, which would read:  \"Anima enema,\" or the flushing of the nature spirit.  An Anima is a word whose etimology is derived from the studying of older religions whose explanation of nature is attributed to \"nature spirits\" or spirit gods who reside in natural phenomena like the ocean, the sun, and the animals.  The flushing (meaning of enema) of this Anima is quite clever on Maynard's part.  Because Anima is considered to be an outdated, non-acceptable form of religion by todays standards, it has been stripped away.  Most anthropologists described it as the way less civilized forms of men without science explained natural phenomena and the reality that surrounded them.  Maynard is poking fun at these anthropologists and historians and scientologists (haha) who denounce these seemingly historic religions because they overlook their own arrogance and knowledge (or lack thereof) of nature, and how future men will denounce their ideologies as ridiculous, as well.  Just thought I'd comment on the album title.  Back to 46 & 2...Oberones and Evilangel09 have the meaning of this song down pat...it definitely is the moving from one conciousness to another, higher conciousness.  The ideology (Jungian and Melchizadek) that Maynard refers to is used in a satirical fashion.  Maynard believes that an evolution of thought needs to take place in society as a whole, but he certainly does not believe any of this scientologyesque, genetic bullshit.  The whole idea behind the song is to poke fun at the ridiculous notions of forced genetic evolution in a society where artificial selection is so prevelant for reasons that are so incredibly shallow--like looks, material success, and fame (LA anyone?).  Maynard is saying sarcastically that he is clearing out, making way for the 46 & 2 just ahead of him...as if he was magically going to get 2 new chromosomes.  He wants to show people that this arrogant nonsense is just that...another product marketed for your dirty dollar.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nAnd on one more note...Maynard who adds brilliant layers of interpretation to his lyrics has added a clever biblical allusion.  46 & 2 is a passage in the Old Testament in the Book of Genesis.  Chapter 46 verse 2 refers to the Isrealites, God's chosen people, migration to Egypt.  This is what  it says, \"There God, speaking to Isreal in a vision by  night, called, 'Jacob! Jacob!' 'Here I am,' he answered.  Then he said:  \"I am God, the God of your father.  Do not be afraid to go down to Egypt, for there I will make you a great nation.\"  For the Isrealites, the next evolution in their society was the founding of a great established nation they could call their homeland...I believe Maynard pokes fun at this passage because as we all know, all the Isrealites found was broken promises and a backwards step in the evolution of their society, slavery.  In this, I believe Maynard says not to trust in arrogantly made promises...such as the one found in this passage and the ones promised by the Jungian/Melchizadek ideologies.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\njesus!  you guys have totally analyzed this song out of existence!  i guess that's the point of this site, isn't it?  maynard is not god.  he is a person.  get a life\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI thought there were 5 different levels of consciousness. Not 3? 44; 46; 48; 50; 52. Wrong? I just remembered five, I don't know.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nwoah, that freaks me out, i mean, i really feel superior to our race, i have my third eye open, and shit, and now, they say that the world will end next sping, and my birthday is on 03/03/03, what if that is the chosen day? hmmmm... o well we will see what happens\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nevilangel09 hit the nail on the head so-to-speak. This song is about the human evolution. Humans today have 46 chromosomes and this song is about reaching 48. Hense the name 46 & 2\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nNo, there are only 3, vee\n\n\n", "comment_64": "\ni think this song is about someone who had a rough past, and later in life everything falls into place, things change the way they want them to be, they become the person they always wanted to be, in this case overcome that past,  for people to listen to your music and that music to change their life in a way and for them to appreciate you for what you are now, your talent, and what you have acomplished and not by what happened to you or what you did.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nHey Tool girl, I don't think that Maynard ever actually criticizes or denounces the idea of God.  It's more directed at the church and how their asking you to believe every word they say, which comes from a book written thousands of years ago by some guy who may have been delusional for all we know.  But maybe you're right about him being religious and maybe he's just using the church as a metaphore.  I wouldn't be surprised, Hush is a great song.\n\r\n   By the way has anyone else noticed that Tool's first 3 CD's are pretty much about death and destruction and Lateralus was about life and inspiration.  Maybe this change had something to do with his son?\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nYou can all suck poo....\n\r\n(Maynard is gay like me)\n\n\n", "comment_67": "\nCake is right, you all are wrong\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI dont think this is tools best song but i think it is one of the most lyrical ..which in its on words sums it up ..its fuckin awsome..no one can really say that there is no best  song..they just seem to keep getting better .. maynard  keep singing \t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nOk PPLZ LISTEN UP CLOSELY!!!!! Undertoe had this RIGHT!!!!!! Next year boys and girls is the big one. Spring 2003, apporx May 15, this world will see nothing like its ever seen before. And every tool song has a striking resemblance to it. There will be a pole shift in 03 and 10% of the population will survive. It sounds far out but reasearch it and you will amazed at how much data there is on this. zetatalk.com\n\n\n", "comment_70": "\nI could be wrong but hey, it something else to talk shit about for a while during work... :)\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nThat's interesting stuff, but it's kinda funny too.  Is Zeta supposed to be an alien race?\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\n\r\nJoshthack- I apologize, I got muddled up- I know Maynard and the other guys are not against the idea of religion or God(s) itself but the marketing middle men who use peoples ignorance and stupidity for theyâ\u0080\u0099re own wealth. Also, I noticed that about the albums- death- life. I'm not sure to an exact extent what thatâ\u0080\u0099s about but I definitely think its intentional. Many itâ\u0080\u0099s signaling an end to tool- nooooooooo! Like theyâ\u0080\u0099re conclusion but hopefully not! Ah, now I paranoidâ\u0080¦.\n\n\n", "comment_73": "\nI agree that this song is about change and making that transition in life.  Many of you couldn't say it better -- since I have felt those changes and now I'm going through it again.  About accepting yourself, I agree in the parts of you that you loathe, it is not those bad parts that are killing you but it is your decision to not accept yourself.  Sometimes I feel like I really didn't give a chance to know myself in pushing myself to please everyone and now I'm taking a hard listen to the beating of my own heart.  My own desires.\n\r\nI too saw the shift in Lateralus and it was as if Tool is almost opening up and being blatent in the belief of an internal being -- whether it be God, or some other force.  It just goes to show that all of us Tool fans share something in common, we are all good natured peope who are misjudged and so was Tool.  But we knew all along what Tool is really about.  I think its funny, because even the name \"Tool\" is so obvious.  Because for me, this Tool has helped me through some better times and I have become a better person that I am today.\n\r\nI feel so different from people, and maybe only solely for the reason that I chose to explore my inner self while others haven't.  But when I go to a Tool concert, I instantly feel at home.  And at harmony...  Maybe I'm being naive in believing that all of us hardcore Tool fans are alike.  But I do sense that harmony...\n\r\nPeace out! \t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nchino69- I agree about this connection between people who have this deeper, enlightened view of life which is a root of listening to tooL and to the lyrics. I feel like we have this connection, my friend and I always laugh about it, but I really think it, it like you can have nothing in common with someone but if you both have 'it' then you have this deep understanding with each other, its amazing!\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThat's right Tool girl, dig deep enough and enlighten yourself to discover that you may a lot in common with others no matter how alienated you felt in the past.  Because in the end ... \"we are eternal and one mind\"  One consciousness.  Peace out girl!\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nI think the point of the song is hte evolution of self. In a sense of clearing away the mental trash you are forcefed everyday on tv, in life. throw away your fuckin false hopes and fake destinies of livin in a world that ultimately made you. get back to the human conditon. shed the skin of useless preoccupations and yield time to yourself. I think its all here.....\n\r\nI've been crawling on my belly \r\nClearing out what could've been \r\nI've been wallowing in my own chaotic \r\nAnd insecure delusions \n\r\nI wanna feel the change consume me, \r\nFeel the outside turning in \r\nI wanna feel the metamorphosis and \r\nCleansing I've endured within \n\r\nI think the feeling consumes us all every once in awhile. The need for a purpose, the need for identity, the need for a truth to our existence. Achieving a oneness within yourself, of yourself, free of impurity (shadow)\n\r\nUltimately the need to accept yourself reigns supreme. when was the last time you contemplated your life, or your soul for the more evolved. when was the last time you listened to your instincts?' Forgive yourselves for what you cannot change and move on the wiser. Evolve beyond human within, 46+2\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI think he gots it allll right (:\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nFucking Christ, people. Aborigines do not have forty-four chromosomes. They are of the species homo sapiens, and therefore hafe forty-six, like us. And, wow, I'll bet you deathtards feel really stpuid now that spring is just around the corner and no celestial bodies are flying towards earth at insane velocities! You are over-analyzing this song. It is merely about the evolution of your personality, or who you are. It has nothing to do with your spirit, nothing to do with Christ, nothing to do with flipping 6 upside down until you come up with some inane theory about square numbers, and shit!! Get a life with this fucking \"TooL list3n3rs are s00000 sophisticated, man!\" People who listen to Tool suck.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThis is some scary shit. How do we know if we have that 48th chromosome? If 10% of the people have evolved it, then there's bound to be significant differnece between then and everyday society. And 'the hell is up with this May 15 shit? If that kind of catastrophe were to occur with in the next three months, wouldn't at least one of our space probes picked it up by now?\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nhey bizzare, yes the aboriginies do have 42 chromosones\r\ni am in grade 12 and do biology, and they are not homo sapiens, \r\nPEOPLE!!!, this thing about may 15, there is not going to be anything hitting the planet, there is going to be a magnetic pole shift, it means ice caps melting, the earth will stop spinning, tides will go nuts and volcanos erupting(because of the magnetic affects, cos lava is molten rock and metals!) before you knock these theories, you should do some research into them, like I HAVE!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nso can someone explain (not in a huge essay, i'm not enlightened enough) how there is evidence for the three consciousenesses, and how a new grid was created in 1989 (and how we know this)\r\nand also explain what exactly is a pole shift? like the earth flipping 90 degrees so the poles are now part of the equator? huh?\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nAlso, what's his \"muscle memory\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nJeff: they're making it all up. If the poles were going to shift on May 15, I think more people than just some crazy, pathetic conspiracy theorists would know about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nBy the way, muscle memory refers to the way certain movements become natural after you repeat them enough. It's as if the muscles remember them, although muscles don't actually have the capability to remember (obviously).\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nby joshthack on 09-09-2002 @ 05:05:48 PM\n\r\n\"Hey Tool girl, I don't think that Maynard ever actually criticizes or denounces the idea of God. It's more directed at the church and how their asking you to believe every word they say, which comes from a book written thousands of years ago by some guy who may have been delusional for all we know.\"\n\r\nThe same could be said about Jungian theory.\n\r\nGuys, get your heads out of your own arses, just because TooL write a song about some Jungian theory, doesn't mean that you have to believe it and it must be true. \n\r\nAnd for the person who thinks that people who listen to TooL are more introspective than other people is WAY up his or her own arse.\n\r\nAnyway  - The 3 Levels of Being:\n\r\nThere are 3 ways of reacting to things in life -\n\r\n1. Instincts and impulses, these are animal-based reactions to situations in life, and usual bring about problems. This is the lowest level of being.\n\r\n2. Through reasoning, using intellect. This can bring more order and and fairness but is full of prejudgices, emotions and calculations of the mind that are basically limited. This level of being can still give rise to bad things in life.\n\r\n3. With consciousness,  by being fully aware, we are able to unlock our consciousness and react to situations with pure objective and true intelligence of the consciousness. This is the highest way of responding in world situations; the highest level of being. We can react to situations without unnecessary calculations of the mind, emotions and negativity.\n\ngnosis.org\nmysticweb.org\n\n\n", "comment_86": "\nGorillas have 48 chromosomes...\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nGorillas have 48 chromosomes...\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nnumber of chromosomes isn't an indication of intelligence.  BTW, why is the theory that 2 more chromosomes will make us \"enlightened\" i'm just wondering, b/c there's not much evidence behind the theory, it seems just like believing someone arbitrarily\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nI agree with pretty much everyone here.\n\r\nJuSt To Be DiFfErEnT, I'lL tYpe In HaCkEr FoNt.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nthis is about him saying that change is just right around the corner.. pretty soon we will all be smart enought to forget out ego's.. like comfort over style...\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nferns have 480 chromosomes.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nJeff, those extra 2 chromosomes have something to do with a Christ consciousness, or something like that (I forget where I read that, it may be on this site).  It may sound kinda lame, but it's an interesting theory.  I don't know about this 90% of earths population dying though.  That seems a little far fetched.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nWow. I don't know anything more than what the smart people of this forum has posted but I'll tell you one thing. Maynard has got to be one of the most intellectual writes of our time, if not all time.  He has got to be the Shakespeare of the 20th Century and one day, hundreds of years later (maybe after the 46+2 evolution takes place!:P), people all over the world, scholars, universities, philosophers even high school students, will be studying analyzing his songs and lyrcis to find the real meanings and find more about the human beings as we do with Shakespeare right now....(Dang Shakespeare's Crazy!!!)....1 more thing.. Tool and MJK, Kicks the living breathing shit out of all this crazy Britney Spears, *Nsync, pop shit, rap and reggae we hear so much about now....so there!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nthe fuck not to be hostile or anything im sorry if i offend...but just drop the bullshit....jungian theory and m word whatever....im not illiterate im fairly intelligent....so it isn't like i don't understand u....but why would someone so  smart believe that they can evolve while they are living....i think that evolution is a much slower process not a goal that human try to reach in life....self actualization can however be reached while alive.....and about the chromosome shit....what the fuck....how could u ever add  more chromosomes to your genectic structure????? it is not possible...human only have a certain amount..and the number is availing me at the moment....personally i think this song is about overcoming bullshit realizing that self loathing and self pity is pointless < ive been picking my scabs again.....u get it?    and also im just still annoyed by the jungian theory shit....it is like throw in some flowery vocabulary and people agree w/whatever the hell u say.....think for yourself....\r\nthat shit has always bothered me for some reason....and it isn't bec. im jealous....i have an extremely high vocabulary and an extensive knowledge in the field of abnormal psychology....but i m not flaunting the shit man....look at my writing style i m not impressive....im straight forward...that is what i think is respectful and dignified.....i just still can't believe i read that online....i mean i thought that using flowery vocabulary to gain recognition ended in fricken middle school.......i quit the bullshit ....im done.....grow up and stop preaching shit that doesn't even add up....it is obvious that u didn't consider the chromosome shit before u wrote that.....im sure that  much of tool's music has psychological routes but why would maynard sell out and preach someone else's believes.....i think tool is above that.....god im sorry i really went off.....\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nJust wanted to say a little here about Jung straight from a college psychology book:\n\r\n\"Carl Jung [believed] there is a collective unconscious shared by all human beings, containing universal memories, symbols, and images that are the legacy of human history.\"\n\r\n\"The shadow archetype (archetype being a common theme) reflects the prehistoric fear of wild animals and represents the bestial, evil side of human nature.\"\n\r\n\"The anima represents the feminine archetype in men (whereas the animus represents the masculine archetype in women)\"\n\r\n\"Many of JUng's ideas were more suited to mysticism and philosophy than to empirical pscyhology, which may be why so many Jungian ideas are popular with New Age movements today.\"\n\r\n\"He believed that people are motivated by not only past conflicts, but also by future goals and their desire to fulfill themselves.\"\n\r\nAnyway, thought that would clear a few things up.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nAll people, Aborigine or not, have 46 chromosomes. There is a condition where you only have 45 or 47, I don't remember the numbe ro name. But that doesn't cause them to be inhuman or not of the homo sapien species, that's just ludicrous.\n\r\nYes, to say the number of chromosomes present is any indication about intelligence of spiritual evolution is a load of hooey... it works better as a metaphor.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nwell from what I can understand that if you all remember a while back there was a scandal where a lutheran church claimed to have discovered the robe that Jesus was wearing when he was crucified. and somewhere along the line someone had claimed to have analized the DNA on the loincloth and since Maynard seems to just LOVE analyzing religion in his lyrics it, to me, seems that Maynard liked the idea that this Jesus figure was so \"godly\" because of an extra set of 2 chromasones he was born with.  the dicovery was since proven to be a hoax since then. but iether way, it was a really cool idea that Maynard put a spin onto.  that people followed and believed this man becuase of this genetic difference they knew nothing about at the time and it became a big religon that now goes against, in nature, every bit of advice Jesus could muster.  I think its kinda cool.  but then again thats just my crazy take on it.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nAside from the 46 + 2 and Jungian Theory this song deals with evolving and even to those who don't know much about 46+2 and The Jung's theory it's quite evident this song deals with evolving and developing, not physical evolution but mental and metaphysical evolution. For those who are interested in reading about 46+2 I would suggest picking up \"You are a Spiritual Being Having a human Experience\" by Bob Frissel it talks about a wide range of ideas which Tool have incorporated into their songs, and art as well i.e the flower of life.\r\nAnother thing, some one brought up about Maynard and religion I don't think that maynard denouces god either. I think he does criticize the church, some followers and such but god he has never criticized. Tool I think embraces a wide range of religions, more specifically eastern philosophies.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nAs far as I recall its not 46 + 2 = 48, but rather 46 + 2 becomes 48 + 2, the + 2 refer to the the XX or XY chromosones that determine sex. There are rare medical conditions in which people are born XXY, or 46 and 3. Maynard has no doubt read Melchizadek, however is probably not a believer, just using it to talk about transcendence.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\ndolphins and mice are far more advanced than man.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nDo all the people in here who thought the world was going to end on May 15, 2003.......\n\r\n\"Cults are bad, mmm'kay?\"\n\r\nPS - This song is one of my favorites.  Thanks for the explanation.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nJust to add, I am glad to see that other tool fans have seen Jung's ideas prevalent in this song.  \r\n\"Change is coming through my shadow\"\r\nSuch a great quote.  It appears negative and pessimistic to anyone who does not know tool.  But to me I see optimism.  \n\r\nThis is how.  The idea of shadow I think is from Carl Jung.  Shadow to Jung is what we donâ\u0080\u0099t see of our self that affects other people.  When we are aware of our shadow then we may change and self-improvement is possible.  Maybe I have been an ass to a person I love but donâ\u0080\u0099t even realize it.  My loved one may let me know of my own shadow so that I can change to better myself.  CHANGE IS COMING THROUGH MY SHADDOW!  It is about change to better the self.  \n\r\nAnother theme that I see with CHANGE IS COMING THROUGH MY SHADDOW is that we must thank evil, our shadow.  Our shadows that we cast on others may cause problems with communication and relationships.  Yet it is only when we see the evil present when we may change.  Thanks shadow! You gave me a new state of being!  Like the old saying goes: without evil, good ceases to exist.  - Because all of our perceptions/reality is comparing things for perspective, in this case good/evil.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nThis song's theme could be the intersection between the ancient, primitive process of evolution, and human consciousness.  Take these stanzas:\n\r\nI've been crawling on my belly \r\nClearing out what could've been \r\nI've been wallowing in my own chaotic \r\nAnd insecure delusions \n\r\nI wanna feel the change consume me, \r\nFeel the outside turning in \r\nI wanna feel the metamorphosis and \r\nCleansing I've endured\n\r\nThis makes me think of humans, with our \"superior\" intellects, incessantly seeking release from our limitations.  Still, no matter how much we want to feel this cleansing, we are still mere pawns in the greater process of natural change.  \n\r\nWith self-awareness, people (perhaps uniquely) can evaluate possible actions, making their own decisions of how to grow and learn.  However, there is no way around the imbalance between mental and evolutionary change - one painfully slow, the other painfully temporary.\n\r\nAt least, that's what I make of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nby CosmicGate on 09-10-2002 @ 02:25:18 AM  \r\n\"Ok PPLZ LISTEN UP CLOSELY!!!!! Undertoe had this RIGHT!!!!!! Next year boys and girls is the big one. Spring 2003, apporx May 15, this world will see nothing like its ever seen before. And every tool song has a striking resemblance to it. There will be a pole shift in 03 and 10% of the population will survive.\"\n\r\nOh dear... Thank you for telling me. I hadn't realized most of the population has been dead for over a year... I really should pay closer attention...\n\n\r\nby goblin paste on 03-15-2003 @ 08:39:11 PM \n\r\n\"There are 3 ways of reacting to things in life - \n\r\n1. Instincts and impulses, these are animal-based reactions to situations in life, and usual bring about problems. This is the lowest level of being. \n\r\n2. Through reasoning, using intellect. This can bring more order and and fairness but is full of prejudgices, emotions and calculations of the mind that are basically limited. This level of being can still give rise to bad things in life. \n\r\n3. With consciousness, by being fully aware, we are able to unlock our consciousness and react to situations with pure objective and true intelligence of the consciousness. This is the highest way of responding in world situations; the highest level of being. We can react to situations without unnecessary calculations of the mind, emotions and negativity.\"\n\r\nAlso known as the \"Id\" \"Ego\", and \"Superego\" respectivly... Just to make that useless point...\n\r\nAnyway, I think the people before have analysed this song very well... I can't really add anything else... Uhm, great song. ^-^\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\ni thought it was chromosomes??? am i right, or are those people who spelled it chromesones wrong?\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nI don't know all of psychology and I don't know all of the jungian theory, but all I know and all I write is how this song communicates to me.\n\r\nI've come back and now I realize how much this song really means to me.  I do believe that people's spirits (and themselves as the spirit is a part of who you are) can progress to different levels and a human being can truly become a higher being before they leave this world.\n\r\nDo they look different?  Maybe, but most likely subtley.  Do they glow or give off an intense light?  No.  \n\r\nBut inside there is so much change that has taken place.  For example I feel that I have progressed to this stage in life because I have dug so deep spiritually.  I actually feel like my own components have a mind of their own at times.\n\r\nFor example my heart leads me most of the time, I have really learned how to master my emotions.  But, there are times when my heart differs in a direction with my mind.  And sometimes, like a child, I can feel my mind throwing a \"fit.\"  How it bombards me with thoughts of inadequacies when it feels it doesn't get its way, and how I can feel the conflict of electrical current surging through.\n\r\nI know I sound crazy, but after going in the direction that I have gone spiritually and being an empathic (a person who can feel other people's emotions), I am very sensitive to changes.\n\r\nI believe there is so much that goes on in this world that people have not even touched upon.  Why people don't spread the word of the truths they see is because of many different reasons.  One, is out of fear.  Fear of society condeming them (like in high school how kids were ridiculed for being different).  Another is doubt.  A person lacking in faith or doubting the things they experience cause them to keep such things inside.\n\r\nTHis is why I chose to post here.  THis is why I chose to write these interpretations.  In my own eyes, with my own heart to feel, and my own mind to remember, I am living proof of how life is not what is in your textbooks through what society states, it is what you truly experience.\n\r\nANd let me tell you... there is soooo much out there.  I am of course still learning and will be for a while.  The more answers I find, the more questions it creates.  \n\r\nBut I do know this.  Believe in the \"things\" that are over that roof in your house, believe in so much, because the truth is more of what is regarded as fantasy, then what is not.\n\r\nThe truth is about what we can all experience and join together.  One man cannot do this.  One woman cannot do this.  It takes two.  ANd then multiply that by two, and then again.  Hope you get the picture.\n\r\nI want brother and sister to stop disagreeing on what cannot be, and start agreeing on what truly is.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\n46 divided by 2 = 23\n\r\nTwenty three is the key\n\r\n(Seek and ye shall find)\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\n46 + 2 = 48\n\r\n\"forty six and two ahead of me\" = 48 days left\n\r\nAccording to the Tibeten Book Of The Dead, there is a 49 day period of transcendence following the moment of ego death in which you are \"reborne.\" In this state you may obtain liberation if you can learn to accept that you have lost your ego and accept the changes or CLEANSING you have endured. However, if you try to CLING to your old self or force through this slow process, you will be trapped in your own hell (chaotic insecure dilusions)and not be reborne into a higher level of consciousness. Maynard is saying he is experiencing hell and there will be 48 more days of it if he keeps SEARCHING for pieces of him old self or attempts to rush through the process by WANTING TO FEEL THE CHANGES.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nto me This song is continuation of the song H. I think H. is about heroine and i think this song maybe talking about how me misses how good heroine use to make him feel. \"I want to feel the change consume me, feel the outside turning in\"\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nDays of the New.......:)\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nPeople are dumb.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\ni heard from some one this song is about chromosones\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nThis song is such a argued song.  I listen to only one radio station.  And not even they can agree with themselves.  In the Summer of 04 they talked about the song being about the chromosomes and how if you had two more you'd be a telepathic or insane but never both? Then this fall they claimed it was about telepathy. It's a good thing Maynard never held a press conference on his songs.  Or this site would be quite boring.........I'll give my opinion on the song later.  And for people who are reading on this site for the first time.  It's worth scrolling up and reading of the threads. So make good points others are a just plain dumb.  Like some talk about the world is going to end on May 15, 2003\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nhsingarajah, there is nothing wrong with reggae... or... however... it's spelled.  And... I'm still waiting on the earth to die on May 15, 2003.  And by God, I can't wait for it to happen either.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nI agree, Blink do suck, as for the song, i agree with the chromosome theory. This song is such a well pollished song but, its awsome\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nRight props to the first guy's explanation and all those who expounded on it...but are we supposed to be able to change the physio-chemical makeup of our bodies (i.e. chromosomes & such) just by meditating and adjusting our reactions to the world? Or does the 'change' come about just by time & continued evolution (of the human species)? Or is it just about preparing in this lifetime for when you die, and move to the next 'level' (the 46+2 level)?Edited by mike on January  3 2005, at 12:48AM\n\n\n", "comment_117": "\nOberones seems to be right... I think that it's also pretty much saying that the spritual level is not the same as the bodily level, but to fully exist spritually, we need to understand how things work in the bodily existence, or at least realize that our spirit is lost somewhere in the body, and to free it we need to come to terms with the fact that it is 'self' and the body is a [possibly] temporary mask to our emotions and thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nIt seems like at the end during the last verse\n\r\nSee my shadow changing, \r\nStretching up and over me \r\nSoften this old armor \r\nHoping I can clear the way \r\nBy stepping through my shadow, \r\nComing out the other side \r\nStep into the shadow \r\nForty six and two are just ahead of me\n\r\nSomething is happenning and he can't stop it.  Whether that could be like when you're on drugs and there's no way to stop your trip once you take them, or like a spiritual experience.  This last part of the song is just different from the rest.  It seems like he's just TALKING about the song's topic during the first part and then at the end he's actually EXPERIENCING whatever he's talking about.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\n\"There's the 1st level with 44 chromosones. These are primitve people's like the aboriginies in Australia who do not percieve anything outside of themselves.\"\n\r\nThe last part mabye but they are still homo sapiens with 46 chromosones.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\npeople with 47 chromosomes have down syndrome.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nhey jarbs, My sentiments exactly.  Humans have 46 chromosomes I (and that includes the so called sex chromosomes), period the end.  Any variation on that theme is abnormal and usually results in some form of mental or physical retardation.  As far as 48 chromosomes goes? Well baboons have 48 chromosomesâ\u0080¦..are we supposed to evolve into baboons then?  Whatever tool meant by this song those are still the facts.\n\r\nP.S. and btw im a psych major and have studied Jungâ\u0080¦.dont recall anything about 46&2.  and the anima is the female side of the male ego where as the animus is the male side to the female egoâ\u0080¦the shadow is everything about us we dislike and prefer to regard as separate from ourselvesâ\u0080¦ all the while it remains part of who and what we areâ\u0080¦.jesus do some researchâ\u0080¦\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nFirst of all, it's chromosomes, not chromosones.\n\r\nNext, if you are made with more than 46 chromosomes, it is called trisomy and in the form XXX, it is incompatible with life. XXY is Kleinfelter syndrome where the person has ambiguous sex characteristics. Bad things happen with extra chromosomes... it's strictly a metaphor.\n\r\nAlso, carp fish have 104 chromosomes (52 pairs), so the complexity of an organism is not dependant on it's genetic make-up.\n\r\nAbout the song, I think the Carl Jung theory is the best. But only as a metaphor. Remember, DNA is DNA and you can't evolve to have more in order to be a better person. You'll be sterile and retarded and have a short fourth finger and all kinds of weird stuff like that. Trust me.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\ndanny carey rocks this song like whoa! lol\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\na lot of this has a ton to do with accepting yourself and who you really are. Destroying your ego(very huge point) to move on to the next level.  its some amazing stuff that blows your mind\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nthis song is freakin amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\n^what?\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nI have just read through this entire thread...well i skipped pages 3 and 4...but aside from that you all have left me utterly confused...Is the song about chromosomes or not...where does Christ conciousness come in to play....is there any educated person on here that knows of these Carl Jung theories and the Melchizadek....and where did racism come in ...Dunvco...or whatever his name is....is he racist....AM I LOSING MY MIND.....I love Tool...thats all i kno.....I CANT TAKE IT ANYMORE....entering Spontaneous combustion mode\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nmy input on this song is that maynard is the friggin man.  it's inexplicable.  if i ever came face to face with him, all i could so is just stare.  dude came from ohio.  go figure.  people like him don't come from ohio.  they just are.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nPretty good job you've done here. Just some precisions I'd like to make though; according to Jung, the anima and the shadow are two different things.  The shadow is that part of ourselves that we are uncomfortable with, that we try to suppress.  As for the anima, it is the feminine principle of man psyche which is opposed to straightforward rationality. \n\r\nThe song also seems connected to Nietzsches' work about the ubermensch stuff, which claimed that contemporary man was a bridge for the coming forth of the \"overman\".  According to him, the weakness of man came from his morality, which fits well with the passage \r\n\"I choose to live and to \r\nGrow, take and give and to \r\nMove, learn and love and to \r\nCry, kill and die and to \r\nBe paranoid and to \r\nLie, hate and fear and to \r\nDo what it takes to move through\"\n\r\nFinally, for those who didn't seem to get the point, the whole chromosome thing is to be seen metaphorically.  Of course aborigenal people don't have less chromosomes than any other human being.  It is meant to be seen as psychological/spiritual evolution.  \n\r\n\"Dans le ravin hantÃ© des chats-pards et des onces \r\n    Nos hÃ©ros, s'Ã©treignant mÃ©chamment, ont roulÃ©, \r\n    Et leur peau fleurira l'ariditÃ© des ronces\"\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nMy darkside is shrinking, been hurting myself again. Looking through my habits, trying to find the key to break them.\n\r\nBeen acting like a snake, destroying the good I could have had, wallowing in my own paranoia. I want to embrace this change, to see what I used to be.\n\r\nThe rest seems to kinda back up the first portion, then the last verse.\n\r\nMy dark side is now a tool, removing this cocoon I have been hiding in with a new form of protection I can get rid of someday. Humanity (46 & 2 being the human chromosome + sex chromosome count) is ahead of me, if I can make these changes real.\n\r\nOr I am just a raving lunatic who thinks too much of himself and his reasoning abilties. If this is the case, just remember; \"I don't suffer from insanity, I enjoy every minute of it.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nI have read your comments about what the songs mean to yall and You all could very well be right in your conclusions but this is what i think the song is about. I think its about a 46 year old man who has abuse some substance and is dying becuz of it and has 2 years left to live=\"See my shadow changing, \r\nStretching up and over me \r\nSoften this old armor \r\nHoping I can clear the way \r\nBy stepping through my shadow, \r\nComing out the other side \r\nStep into the shadow \r\nForty six and two are just ahead of me\"\n\r\nAlthough now that i go back and read more carefully I think the 1st comment on this song was the right original message of the song, but hey thats the beauty of songs is that you can apply whatever meaning to the song you want if it makes sence to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nIf humans evolve and develope 2 more chromosomes, we'd be chimps...it's not possible.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nI always interpreted 46 + 2 as meaning 46 years old and 2 years left to live..\n\r\nKnowing your death is near is what jolts a lot of people back to reality, and has them looking into their shadows, clearing out what could have been, contemplate what they've been clinging to, etc etc.\n\r\nI first heard this song when I was digging into my own lies to myself, so I really identified with it..\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nin jungian theory, the shadow is also known as the alter ego, which is considered primitive and unacceptable to the ego, because it represents evil thoughts, fears, uncivilized desires and intentions. The alter ego or shadow is usually a repressed and discarded part of our phsyche, and in this song, maynard is talking about accepting a part of yourself that you probably once thought was bad or unacceptable. the Forty-six & 2 could be a representation of 2 selves in one being. the 46 would be the ammount of chromosomes an indiviual has and the 2 could represent the ego and alter ego an individual has as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nim stoned, that song means everything and more.....\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nI hate intelligent people.  Unless they sell me their albums.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nI thought that the lyrics to this song were an â\u0080\u009cout of contextâ\u0080\u009d mixture of things, more or less like in Third eye, so I had a look in the Toolsheddown.net FAQ, where it speaks about the â\u0080\u009cgenetic gridsâ\u0080\u009d which I think is quite, well, imaginative? anyway, the lyics make a clear reference to this point which someone mentioned earlier so you wont have to bother looking for it.\n\r\nThis is a good piece of information, but it doesnt really explain the lyrics... I was taking a look at a website the other day about Chakras and â\u0080\u009ctime travelingâ\u0080\u009d and all that stuff when I found something really funny. In this page it says that to make the â\u0080\u009cnewâ\u0080\u009d soul float into your body, instead of forcing your â\u0080\u009coldâ\u0080\u009d one go, you just accept the new one and the other one will leave by itself. The funny bit is that it literally says in the text â\u0080\u009cRather than wallowing in the â\u0080\u009coldâ\u0080\u009d ways and â\u0080\u009coldâ\u0080\u009d problems, with antiquated solutions that rarely worked, we at Time Travelers stress merely leaving the old behind and incorporating the â\u0080\u009cnewâ\u0080\u009d, like shedding an old skinâ\u0080\u009d  \r\nSorry.... â\u0080\u009cwallowingâ\u0080\u009d? Shedding skin? Does that ring a bell??\r\nThere you go, I thinks that explains the whole song... Its basically talking about how someone lets his soul loose to find his new â\u0080\u009chimselfâ\u0080\u009d, to travel through time... when you time travel youre supposed to connect with your spirit from the future and learn from it... Hence the line â\u0080\u009cI choose to live and to grow, take and give and to move, learn and love and to cry, kill and die and to be paranoid and to lie, hate and fear and to do what it takes to move through.â\u0080\u009d Maybe some way of Maynard to convince us about the power of meditation... to leave your own body and open up to a new and true reality...\r\nI think this is the explanation to this song, and Im 100% confident about it, taking on account that its the same idea used on Parabola and Third Eye and so many other Toolâ\u0080\u0099s songs... I think this is probably the only song that doesnt make any reference to drugs! Take a look at this page to understand it better... its difficult to explain in few words, but definitely very interesting....\nparanormal.about.com/gi/dynamic/…\n\n\n", "comment_138": "\nthere is a lot of interesting theories out here but i'd have to agree with btherl on this.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\ndid it occur to anyone that maybe it has more than one meaning? Or he wrote it so it could mean more than one thing and keep everyone who wants to know the \"answer\" guessing, and let everyone else just take it the way they want? thats the whole point in most music, take it how you want to, there isnt a wrong or right\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nyou are correct psychojoejoe. music is music. it is intended for the listener to interpret however they want, cause the artist couldnt really give a shit half the time. i was actually ponderring MY interpretation of the song, not trying to force it on anyone else, and the amount of different underlying meanings i could find reasonable was quite an acheivement. for me the song is somewhat about this, which means that it could very well be about all your theories, and the diversity in the human race and how we have to accept this.......\r\ngees, there i am over anaylysing myself, its all a matter of opinion.\r\none of the possible meanings you guys havent explored yet that i picked up and threw into my brain/couldron was that they could just be sitting in there lounges laughing at you. Considering the song \"Die Eier Von Satan\" as i interpret was just a massive joke ripping on many misinterpretations, and \"Hooker With A Penis\" shows contempt to fans, i can see them using this complex theory as yet another bill hicksesque tribute to the man in question. A stab at the people who look so much into the music...\r\nanother thing i picked up after reading this thread and listening to the album was in the aenima title track, he rips on l ron hubbard. \"Fuck L Ron Hubbard and Fuck all his clones\". And the similarites between the scientolgist geneticisms and the forty six and two theories (cause you seem to have so many different ideas), already pointed out angrily a few years ago, are disturbingly exploited here to further to the confusion that is aenima.\r\nso after all this, i can only come up with what i originally said. its music, its life, deal with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nIt bothers me a little bit... it seems like most of the people commenting on this song are repeating other people's comments.\n\r\nTo some of the deaf dumb and blind followers- Carl Jung has nothing to do with the human evolution / 46 + 2.(this was said earlier, but I keep hearing people repeat the phrase 'Jungian Theory' then start talking about genetics) That is all Melchezedek's[thats how i've seen it spelled] theory or whatever. Now its pretty wierd stuff and isn't exactly plausible, but look past that. Stop repeating each other and not understanding it. The reason why I find him, and this song, interesting is because, like Jung, he seems to be interested in instinct. Jung thought psychics were the people who were more in tune with the wealth of instincts burried in our genetic make-ups (Jung's cousin). Melchezedek's sacred geometry sounds similiar to the  framework of instinct.  Like birds knowing how to build nests without ever being taught how, humans with psychic ability can draw from this framework to answer questions they should not be able to answer. Progress from within; change, and change is what will reveal what is in the shadow side - the repressed side. (either that or you'll start having incest fantasies. People who actually know 'Jungian Theory', and aren't just repeating the first post, know what incest fantasies represent: resistence to change)\n\r\nI also think Melchezedek is a freaking wierd a-hole cause for one - like I said earlier - his genetics ideas are not plausible, but also because he has named himself after Melchizedek who appeared to Abraham or something and many people beleive He was Jesus appearing to Abraham. What kind of nut job thinks they are Jesus... Besides Maynard. Want to explore Jesus returning, write a book like Dostoevsky.\n\r\nSum it up- stop being followers, it seems like you're all(almost all) just repeating the first post. Try to add something new\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nNow, about the change I was talking about, I think this guy rog27 is right.\n\r\n\"Back to 46 & 2...Oberones and Evilangel09 have the meaning of this song down pat...it definitely is the moving from one conciousness to another, higher conciousness. The ideology (Jungian and Melchizadek) that Maynard refers to is used in a satirical fashion. Maynard believes that an evolution of thought needs to take place in society as a whole, but he certainly does not believe any of this scientologyesque, genetic bullshit. The whole idea behind the song is to poke fun at the ridiculous notions of forced genetic evolution in a society where artificial selection is so prevelant for reasons that are so incredibly shallow--like looks, material success, and fame (LA anyone?). Maynard is saying sarcastically that he is clearing out, making way for the 46 & 2 just ahead of him...as if he was magically going to get 2 new chromosomes. He wants to show people that this arrogant nonsense is just that...another product marketed for your dirty dollar.\"\n\r\nThis change is not a good thing.\n\r\nIf you're going to repeat something someone else has said, or something from a website, give credit and quote it.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nyou seem to have ignored my point sir. opinions...\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nYes, it's about humans getting more chromozomes and evolving, a Jungian theory.\n\r\nHowever, Downs Syndrome is what happens when you have one extra chromozome. And thats just one extra chromozome. 2 would just as likely make you black, give you a mongoloid face, and make you sound like a dying giraffe as it would make you a higher functioning being.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nOberones, you are, i am afraid, obviously another ignorant fool. You said that the australian aborigines are genetically inferior to whites? What, you don't like black people? or are they just genetically inferior. I dont think tool's lyrics can be interpreted as justifying racism through some kind of \"deep, metaphorical\" crap that you come up with. If tool did actually mean that i have lost all respect for you. Are You a member of the KKK? I doubt they did mean that , i think you are just a wanker\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nI like how you all try not to be followers or conformists, yet say the exact same the guy before you did. Whether you're a conformist or non-conformist you are still conforming to something, so quit worrying about it. Great song. Deep, deeeeeeep song.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nyou all could be right, and wrong at the same time. Someone said when you have 2 extra chromosomes you are autistic, but that not entirely true. some are, but some are normal. uum, picking scabs could mean just opening old wounds. thinking about a past. whats funny is tool wrote a song about thinking, and here we all are trying think of what they were thinking. so think about it, all these people are kinda doing the job for tool. in other words, tool doesnt have to think anymore, your doing it for them. so, when you hear the next cd, and you can relate to it very well, dont be surprised. it was your input that helped it. more than likely. i mean. not to piss anyone off. but we are the fan base right? they would want to appeal to you so that you give them more money. so why not take the words right out of your mouth? really, i am just blabbing. but not to rain on your parade, but if the song is bout evolving, and you think that jumping into tool's \"hole\"by dissecting it hours upon hours will push you further into an ideal existence, relax. it wont. if it would, dont you think we would have seen a mtv news flash about a guy transforming into a metaphorical butterfly because he wrote a song called 46 and 2 and then listened to it for hours? on a lighter note, tool does rock. if your in to that kind of science fiction crap. just kiding again.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nok, im sorry. i am really not trying to depress you. if the song or this forum helps you to grow then im glad. you live and learn. and i honestly think we should learn as much as we can. so again im sorry. dissect away.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nthis is simple maynard tech.       .... its special drug related whitch none of u will every c......      he's a wizzard  !!\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI love the guitar on this song, I love all of tool songs!\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nWe have 46 chromosomes, or \"44 and 2\". There are people with \"43 and 2\", for example, which I believe is Down's Syndrome, and there are people with \"44 and 3\", as mentioned on p.5. But, there is no human with \"46 and 2\" chromosomes. HOWEVER, THAT'S NOT THE POINT. This entire theory, as I studied carefully a long while back, has been disproved and denounced. \n\r\nThe point is that for us, as humans, to grow, we need to accept the parts of ourselves we think of as ugly and instead of trying to cover them up, we need to actually do something about them. \n\r\nLet's say a kid's got awful acne. Now let's say this kid, instead of getting Pro-Active or whatever, uses makeup every day to cover up his zits. For this kid to \"evolve\" or move past his problem, he needs to take the makeup off so he can put some Pro-Active on. \n\r\nOr, it could be that he's saying for humanity to work as one consciousness, we need get rid of our fears of dying, killing, crying, etc., because we cant work as one if one refuses to do what another needs done.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nWe have 46 chromosomes, or \"44 and 2\". There are people with \"43 and 2\", for example, which I believe is Down's Syndrome, and there are people with \"44 and 3\", as mentioned on p.5. But, there is no human with \"46 and 2\" chromosomes. HOWEVER, THAT'S NOT THE POINT. This entire theory, as I studied carefully a long while back, has been disproved and denounced. \n\r\nThe point is that for us, as humans, to grow, we need to accept the parts of ourselves we think of as ugly and instead of trying to cover them up, we need to actually do something about them. \n\r\nLet's say a kid's got awful acne. Now let's say this kid, instead of getting Pro-Active or whatever, uses makeup every day to cover up his zits. For this kid to \"evolve\" or move past his problem, he needs to take the makeup off so he can put some Pro-Active on. \n\r\nOr, it could be that he's saying for humanity to work as one consciousness, we need get rid of our fears of dying, killing, crying, etc., because we cant work as one if one refuses to do what another needs done. If the hand was afraid to take or to give, it couldn't take food to give to the mouth.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nundertoe is 100% correct idc wtf all u other pll think of it ur WRONGGGGGGG...check out his post its on page 2\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nby the way we have 46 chromosomes and down syndrome is 47 DUH\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nJust some thoughts...\n\r\nWhat if the possible meaning of the number forty is 'trial and testing' (i've read about it somewhere)...six could mean 'having vision'...two as a number of balance...\r\nBy trial and testing coming to vision, with a balance within as a possible result...\r\nAnother possible meaning of the number six is 'opposites'...Through periods of trial and testing...by trying to find a balance between 'the opposites'...one can find balance within...\n\r\nA balance of mind, body and spirit... \r\nforty six and two together makes 48...4+8 makes 12...1+2 makes 3...forty six and two are three words...\r\nThree for mind, body and spirit...\n\r\nOr 40 taken as 4...'stability' is named as one of its meanings...\r\nforty six and two...Finding stability between opposites makes way for balance...\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nGood description, Oberones. Makes sense to me. And damn I just heard this last night and it's awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nWhat in the world is he saying during the parts he whispers (at the beginning of both verses)?\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nI think you all should know that the whole 48 chromosome-super-human-philosophy did not come from Jungian philosophy (the shadow does) but it came from a lil guy name Figgler. Yeah, he was the one who proposed that idea... however some say that it is totally flawed because some gorrillas have 48 chromosomes, whereas rabbits have 100! Anyone have some enlightening intellect to add to that...???\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nI think that Oberones had it right but he should've mentioned that the whole 48 chromosome theory didn't come from Carl Jung but that Figgler dude\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nA note to the first person who wrote on this song: You say, 'There's the 1st level with 44 chromosones. These are primitve people's like the aboriginies in Australia who do not percieve anything outside of themselves.'... I think you should research a little more thoroughly. Aboriginies in Australia have the same amount of chromosomes as you do- 4 plus the sex chromosomes, thus 46. Disgraceful that you actually believed that aborigines were unable to 'see outside themselves', seriously! Perhaps you're getting confused with research relating to very primitive aborigines, but the people we have living in australia today all have the same amount of chromosomes- 46!\r\nAs for the rest, I agree with the interpretation of the song as relating to  Jung's theories on the Collective Unconscious and the shadow.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\n*44 is obviously what I meant to say there, not 4 :P\r\nAnd yeah, also agree with the person above me- the theory could be quite flawed- some plants have over 200 chromosomes! Food for thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nMidlife Crisis.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nAnd the reawakening there after.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nSomething I came across\n\r\n\"OKAY!! What Does It All Mean? 46, 2, Shadows? You must have a little understanding of chromosomes and some science to get this if not just look any of this up online it is all acurate!! it took me a year or so to put this together due to my infatuation with a d*mn song!! eesh\"\n\r\nThe major underlying principles relate to chromosomes and Jungian theory. Some of the ideas behind this song are based on the teachings of Drunvalo Melchizadek. In his own words...........\"There are three totally different kinds of humans on the Earth, meaning that they perceive the One reality in three different ways, interpreted differently. The first kind of human has a chromosome composition of 42+2. They comprise a unity consciousness that does not see anything outside themselves as being separate from themselves. To them, there is only one energy - one life, one beingness that moves everywhere. Anything happening anywhere is within them, as well. They are like cells in the body. They are all connected to a single consciousness that moves through all of them. These are the aboriginals in Australia. There might be a few African tribes left like this. Then, there is our level, comprising 44+2 chromosomes. We are a disharmonic level of consciousness that is used as a steppingstone from the 42+2 level to the next level, 46+2...These two additional chromosomes change everything.\" \r\n\"Anima / Animus (pronounced On-ee-mah): \r\nIn Jungian psychology, the anima refers to personality traits regarded as feminine that are often repressed into the unconscious of males while the animus refers to traits regarded as masculine that are often repressed into the unconsciousness of females. \r\nAlthough suppressed from conscious awareness, the anima/animus influences our behavior in powerful ways. In most individuals,it is projected onto people of the opposite sex and accounts for the experience of falling in love with someone we hardly know. As the unconscious pole of the self, the counter-ego represented by the anima/animus can also be a guide to one's own unconscious realm. It is often experienced as the guiding female (if you're male) or male (if you're female) presence in dreams.\r\nTHE SHADOW!! \r\nIn Carl Jung's personality theory, the ego represents the individual's sense of personal self. The sense of personal identity is purchased, however, at the expense of certain tendencies that are rejected as 'not-self'. According to Jung, these rejected traits come together as a kind of unconscious 'counter-ego' which he termed THE SHADOW. \r\nWe may become unduly anxious or irritated when in an environment or around a person that in some way reminds us of repressed aspects of our self. If a person has rejected his or her own sex drive, for example, that person may feel irrational fear or anger around an overtly sexual individual. The shadow may appear as a person in one's dreams, usually as an individual of the same sex. \r\nOf all the archetypes, the shadow is the most powerful and potentially the most dangerous. It represents everything about ourselves that we fear and despise. \r\nTHE MEANING OF 46&2 and SHADOWS? HERE YA GO!!\r\nAccording to Melchezedek, our planet is covered with geometrically constructed 'morpho genetic grids'.YES!!! MORPHO GENETIC!! These grids extend from about 60 feet under the Earth's surface to about 60 miles above the Earth, arranged in geometric patterns\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nI think it has a submerssive piece of the worlds puzzle. the puzzle of urantia.  I think Maynard is speaking of himself ( being a reptilian )crawling on his belly (like a reptile) clearing out what could of been ( a grand collective consciousness human race) he's coming foreward with being a reptilian.  Remember, danny is of the Masonic order, as his father before him. and they worship there god, the king of the earth (aka urantia,) and the  king of corse is nonother than satan, (second luetenant to lucifer...) which is in control of 608 inhabited planets. we were born into a world of sin. 1 of 608,  ever since the serpant, in the garden of eden....... the world leaders worship satan. becouse they (the luminated ones),    (the illuminati) have been given power over ther fellow man.   anyway back to the song,  if you look at other tool songs,  \"third eye\"  I have an iguana and they have a third eye on there head to detect light changes (preditor swooping down on them)  The song \"eggs of satan\" i think he's coming out of hiding, exposing himself, like the illuminatti is starting to do,,     Like i just did....  i dont quite know whether or not what i said in 100% right, but, either way the band rocks, there my favorite besides floyd..  and one must never forget, no matter what any song that you ever hear,  like satan, and everything else in the world,    It's ALL , the will of God,  the father of the universe, of universes...... get ready folks ..  enjoy it while you can...  I'll see you on the other side. ciao\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nI've always thought that the title and context of this song was meant to be purely allegorical, with a couple references - one to the pseudoscientfic work of Jung and the other, of course, to the ridiculous hypothesis by Melchizedek.  Apparently, I didn't get the memo about the TPS reports,  as it seems that tool fans have taken the rhetoric of this song to heart.  It turns out that orangutans, chimpanzees, gorillas all have 48 chromosomes.  Potatoes have 48 chromosomes as well.  As far as current anthropological study is concerned, our most recent common ancestor with african apes also had 48 chromosomes.  Every human, disregading a specific case which I'll mention at the end, has 46 total chromosomes (diploid = 2 copies of each chromosome) in every cell, except for sperm and eggs, which of course have 23 (haploid = 1 copy).  There are cases of women who have 44 chromosomes, (occuring via mechanisms that I'll describe below) called Turner's Syndrome.  Since they are human like the rest of us, the Aboriginese have 46 chromosomes.  There is also no systematic evidence anywhere linking increasing number of chromosomes to higher functioning organisms.  For example, king crabs have 208 chromosomes.  While they are delicious, I wouldn't want them to be doing my taxes.  In fact, from an evolutionary standpoint, sometimes you see a reduction in chromosome number as a result of evolutionary change.  This is the case with us humans - the difference between us and our early hominid ancestors is that our chromosome 2 is a fusion of chromosomes 10 and 11 in the other hominids, e.g. current chimps, apes, etc.  This is an example of what you could consider an extreme type of chromosome translocation, specifically called centric fusion.  There are cases in humans where we do have an additional chromosome as a result of an error in the separation of chromosome pair 21 in meiosis 2 of our gamete production.  This results in an offspring with 47 total chromosomes, commonly known as Down Syndrome.  While this is an example of producing a triploid chromosome 21 and not a new chromosome altogether, perhaps the overall lesson is that there is little evidence to support that adding chromosomes is always a good thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nHERE IS THE ACTUAL MEANING OF THIS SONG, BASICALLY EVERYONE IS OFF, SO FORGET EVERY POST BEFORE THIS ONE, 100% GARUNTEED RIGHT!!\r\n-sorry to be harsh but everyone is completely wrong with the Jungian stuff.\n\r\nMaynard is combining a few philosophical and psychological concepts into his own message. This song is very similar to Reflection. \n\r\nAs a few people have said eariler, the shadow is an archetype of Jung, archetypes are basically what Jung calls instincts in his theory. The Shadow archetype represents the our animal instincts. Every usage of the shadow (stepping through, shedding of it, etc.) is meant as symbolism, he is saying that he, unlike most other people, is ready to evolve. Maynard believes in \"crucifying the ego\", as noted in Reflection.\r\nEgo= Jung's concept of the conscious mind. What i feel Maynard means by crucify the ego is break free from the chains that hold you down with in your own mind. Learn from experience, expand your mind, actualize the unlimited potential that your human mind has to offer you. Crucifying the ego involves many aspects that i will go into depth in \"reflection\". \n\r\nSo you see, Maynard is saying that he has come dangerously close to fully reaching the potential of his mind, and now he feels the change of human evolution is approaching, and he is welcoming it. \n\r\nThat is the message of forty six and 2. Many of Tools songs relate in their messages. \n\r\nWhat refutes the previous arguments about Jung's theory is that their information was simply false. Jung believed that there were three levels of the personality NOT consciousness. the first being the ego, the conscious mind. The second being the personal unconscious, this was our dreams. Thirdly was our Collective unconscious, which was an acumulation of our instinctual needs, rooted in sentiment. So you see these concepts had were designed to explain the personality. Jung at no point mentioned anything about Human beings transcending from one level to another. If you want proof check out this website. ship.edu/~cgboeree/…\n\r\nsorry if i offended anyone, I am simply here to spread the truth.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nDude a fucking potato has 48 chromosomes.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nThis is such an unbeliievably great song. Deceptively simple, too. I used to be obsessed with this song. Since hearing it, I actually started studying Jungianism. Pure genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nMaynard where do you get these things from??\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nI think oberone pretty much covered it\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nLike StrYdeR, I too felt this song was about midlife crisis. Not knowing about all this psychologist theory stuff, I interpreted the shadow as a symbol for your own mortality, that you have to step through, once you notice that half of your life has already run through your fingers, that you are closer to death than to birth.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nOne of my favorite Tool Songs.\r\nI totally didnt get the evolution thing at first, \r\nBut It makes sense Now,\r\nI love it,\r\nThanks for the help\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nOberones covered it awesomely, but on a note to evilangel09 so Individual person:cells could be like \"god:people\" in likeness?\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nIn 1968 Carlos Castaneda publish The Teachings of Don Juan\" a biography chronicaling his apprenticship under the master sorcer (Or Nagual) Juan Matus. Nagualism (Also referred to as sorcery) is an ancient tradition which teaches a practitioner to \"See\" energy as it flows in the universe. If you read the cover insert of Aenima you will see in the thank list \"Carlos Castaneda\". In Nagualism, it is taught that there are 48 worlds as whole and real as this one, and that one who conserves their energy may step between these 46+2 worlds.\r\n  In Nagualism Muscle Memory refers to memories being stored in the actual physical muscles of the body, which a practitioner must reclaim in order to \"Reach the totality of ones self\". Nagualism teaches that the shadow can be used as an entryway between worlds.\r\n  Step into my shadow, coming out the other side. Step into the shadow, 46+2 just ahead of me.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nstoryteller put the nail in the coffin.  many were so quick to jump on the Jung bandwagon, which could have some correlation to the message.  But if you pay attention to the lyrics \"Listen to my (muscle memory)\r\nContemplate what I've been clinging to\r\nForty six and two ahead of me\" the theory of Nagualism comes shining right through the \"shadow.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nI think everyone has a good opinion of what this song means. but when i listen to this amazing peice of art i apply it to myself. i know that Maynard and the rest of the band made this song for a reason, but it has a different meaning to me. i think its cool that everyone knows so much about what this song means to TOOL, but i like it because it has meaning to me personally. any time im in a rough time of my life, almost all tool lyrics help me through. this song especially.. i think its one of the best songs ever written\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nhaha just reading through this i stumbled accross really weird coincedences...the whole 1989 grid thing... i was born in 1989, and the whole May 15 thing, i was born on May 15. Do i think im special? Nope. But i do want to enlighten myself. Btw, this song is really pleasant to listen to, the guitar riff in the beginning is amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nBefore I try to explain what I think the song (46 & 2 byTool) means, it is necessary for you to know several metaphysical concepts. I got almost all of this information on this page from a book the band recommended on their 1994 newsletter called Nothing in This Book is True, but It's Exactly How Things Are by Bob Frissell. You can get more info in the Books section of this web site. The fine piece of literature explains that human beings are entering the next dimension or \"Christ Consciousness\" in which they will have 46 and 2 chromosomes. (Currently, we have 44 and 2.) This is the third level of five of consciousness according to Frissell. The fourth and fifth being 48 and 2 and 50 and 2. The book also explains in vivid detail sacred geometry and the future of earth. It is intriguing and a little unbelievable, but there is a lot to be gained if one reads it with an open mind.\n\n\r\nThe most important concept Frissell explains (He learned it from one Drunvalo Melchizadek.) is sacred geometry. Sacred geometry the path in which the creator moved in the void during Genesis. It forms the basis of everything in the universe, including mathematics. The Flower of Life, as seen in the picture to the right, includes in it all the necessary information for the creation of life. Frissell explains hows this figure is derived.\n\n\r\nIf any of you are like me, you have a problem with this idea because you don't necessarily believe in God. Inour terms, the Flower of Life would be the figure that included all ratios necessary for the formation of the universe. Figures that can be derived from the flower are the Phi ratio and the Golden Rectangle. Anyone with a small backround in mathematics knows these ratios are crucial in all living and many nonliving things. If you do not know what these are, look them up. (The movie Pi will also give you a rudimentry backround.)\n\n\r\nAn interesting fact is that the Flower of Life can be seen in the background of the Tool poster in which a man is emerging from a swamp. I am unaware as to whether anyone has scientifically proven the validity of the Flower of Life, but certainly a geometrical figure that included such ratios seems a logical explanation for many patterns in the universe. Many would argue, however, that it is simply a theoretical construct designed by humans to simplify the universe. If this flower does exist, it is etched into all creation. Every living entity is aware of it to a certain extent, but not necessarily fully conscious of it. Frissell explains that the most basic shape to come from the Flower of Life is the Tube Torus, the shape in which all living things emerge from including snakes, birds, rats, and human beings. One end of the tube evolves into the anal area and the other forms the mouth. It seems that since all life might share the same basic information, it might have the capacity to form a unity consciousness which would be 46 and 2. This idea has been explored by Carl Jung for those of you familiar which his work.\n\n\r\nCurrently, human beings are in the second level of consciousness, 44 and 2, but shortly they are expected to evolve in the next level. Supposedly, ascended masters have prepared the path for humans to change. 1998, was in fact, supposed to be when the change occurred. However, it looks like it might be postponed several years due to the abominable state of the world. For one to enter the 46 and 2 state, it seems it would take a mental and spiritual change. (Opening your third eye if you will.) It would require one to have a deep understanding of the world, themselves, and their consciousness. Most people are unaware that some people have vowed to change themselves and move up a level.\n\n\r\nI will not simply rehash information that I read, but tell you what I gained from it. I am not one to accept what someone wrote in a dogmatic fashion. I was very skeptical after reading Frissell and other associated reading. Obviously, what Frissell was saying cannot be literally true so I looked for a theme of teaching that could be attained. The book is very spiritual and emphasizes that people will be united at a spiritual level. The truth to this statement will be tested in the near future if all goes as Frissell said. The most important message to be derived from the work is the call for uniformity. The human race is slowly mixing out the resources of this planet and slowly usurping all space available. \n\r\nThe solution to this very real problem will not be solved unless people learn how to work together. The realization that all people are greater than their racial, socioeconomic, gender, etc. associations is crucial in my opinion. These are all the most petty issues around. The real issues deal with solving the real problems and living a real life. The above concerns are, of course, important but they can be overcome by any reasonably intelligent human being. I have accepted that all people are my equals, I cannot change them, and I do not care to change them. I want to work with them to make a better future. Though this whole point seems incredibly obvious, you just have to glance at the front page of a newspaper to learn most people are not overcoming these minor hurdles.\n\n\r\nAfter reading into such things I can only concluded that the song 46 and 2 is about Maynard's attempt to evolve into a higher spiritual being and enter the next level of consciousness. It is about looking in the shadows and discovering who he really is. An interesting line is \"listen to my muscle memories\". This might refer to the fact that within all cells lies to key to life, the mathematical construct that allows life to unfold in an orderly and consistent manner. I will not get through every line of the song, as I think you can make complete sense of them once aware of what 46 and 2 refers to. One interesting fact is that this song appears to take on a similar meaning as Third Eye. The Third Eye, or pineal gland, supposedly it an important point of access to the metaphysical world according to Eastern thought. It is one of the chakra points, designated the center of spirituality. \"Prying open my third eye\" takes on an obvious meaning once this fact is known. I apologize to the band if I severely fucked up the intended meanings of you songs. If you have read this whole thing, please do me a favor and share your comments on the bulletin board.\n\n\r\nSome of the ideas behind this song are based on the teachings of Drunvalo Melchizadek. Here's a snip of an interview with him (Leading Edge, 12/95):\"There are three totally different kinds of humans on the Earth, meaning that they perceive the One reality in three different ways, interpreted differently. The first kind of human has a chromosome composition of 42+2. They comprise a unity consciousness that does not see anything outside themselves as being separate from themselves. To them, there is only one energy - one life, one being ness that moves everywhere. Anything happening anywhere is within them, as well. They are like cells in the body. They are all connected to a single consciousness that moves through all of them. These are the aboriginals in Australia. There might be a few African tribes left like this. Then, there is our level, comprising 44+2 chromosomes. We are a disharmonic level of consciousness that is used as a steppingstone from the 42+2 level to the next level, 46+2...These two additional chromosomes change everything. \"Rachel Wells (eileen@loop.com) has written this moderately long, excellent summary of all the relevant.\r\nJungian concepts:\n\n\r\n\"Anima / Animus (pronounced On-ee-mah):\n\n\r\nIn Jungian psychology, the anima refers to personality traits regarded as feminine that are often repressed into the unconscious of males while the animus refers to traits regarded as masculine that are often repressed into the unconsciousness of females. Although suppressed from conscious awareness, the anima/animus influences our behavior in powerful ways. In most individuals,it is projected onto people of the opposite sex and accounts for the experience of falling in love with someone we hardly know. As the unconscious pole of the self, the counter-ego represented by the anima/animus can also be a guide to one's own unconscious realm. It is often experienced as the guiding female (if you're male) or male (if you're female) presence in dreams.\n\n\r\nThe Shadow:\n\n\r\nIn Carl Jung's personality theory, the ego represents the individual's sense of personal self. The sense of personal identity is purchased, however, at the expense of certain tendencies that are rejected as 'not-self'. According to Jung, these rejected traits come together as a kind of unconscious 'counter-ego' which he termed the shadow. We may become unduly anxious or irritated when in an environment or around a person that in some way reminds us of repressed aspects of our self. If a person has rejected his or her own sex drive, for example, that person may feel irrational fear or anger around an overtly sexual individual. The shadow may appear as a person in one's dreams, usually as an individual of the same sex. Of all the archetypes, the shadow is the most powerful and potentially the most dangerous. It represents everything about ourselves that we fear and despise.\n\n\r\nThe meaning of 46 + 2:\n\n\r\nAccording to Melchezedek, our planet is covered with geometrically constructed 'morpho genetic grids'. These grids extend from about 60 feet under the Earth's surface to about 60 miles above the Earth, arranged in geometric patterns (see 'Sacred Geometry'). Each species has its own grid, which supports life, and connects the consciousness of its particular species. Before any species can come into existance or make an evolutionary step, a new grid must be completed. When a species becomes extinct, that particular species' grid dissoves. A new grid was completed in 1989 - the 'christ-consciousness' grid. This grid will allow humans to evolve into our next version. We'll develop two additional chromosomes (which are really 'geometrical images' designed to resonate with our specific grid) for a total or 46 + 2. The main change will be a shift to the \"unity consciousness\". Every cell in your body has its own consciousness and memory. You, the higher being that occupies your body, make the millions of different consciousnesses in your body work together as one being. \n\r\nHow does this relate to this grid? Think of yourself as a cell and the grid as the higher being. We will still have individual consciousness, but will be united in the form of a higher being in order to work as one entity.\" Scientifically speaking, humans don't appear to be evolving new chromosomes (or much of anything else; thanks to technology).\n\r\nForty-Six and Two Essay Version 2.0 \n\n\r\nAs many of you already know, the song itself is based human evolution in consciousness by the means of chromosomes. The human genome - the complete set of human genes - is composed of twenty three seperate pairs of chromosomes. Twenty-two, of which, are numbered in order of size, from the largest (1), to the smallest (22). The remaining pair consists of the sex chromosomes.\r\nAccording to the teachings of Drunvalo Melchizedek, who is the founder of the flower of life teachings (floweroflife.org), and the originator of this theory, there are three grids for human consciousness around planet Earth, which correspond directly with the chromosomes in the human body. The first one is forty-two plus two, the second is forty-four plus two (our current evolutionary position), and a third which consists of forty-six plus two chromosomes. The third grid contains Christ conscioussness.\n\n\r\nDrunvalo predicted the planetary rise to christ conscioussness to occur before the new millenium. As you and I know, this did not happen. If you check up with Drunvalo, he now says that it should happen somewhere between 2010 and 2020. I believe most new age teachers, such as Drunvalo, are simply jumping on the prediction of Terence McKenna's Novelty Theory, which navigates the I-Ching to nail down a specific date for the jump in conscioussness. (see The Archaic Revival by Terence McKenna)\n\n\r\nIn my opinion, Drunvalo Melchizedek suffers from the same ill-fated guru/messiah syndrome that struck Carl Jung, Aleister Crowley, Jesus Christ, L. Ron Hubbard, etc. He is no more of a divine being than you and I. Drunvalo pulls in a substantial amount of money by presenting flower of life seminars to people who are willing to believe in someone and something new(ala, above the crowd, and prepared to lead the way). I hate to break the bubble of these belief happy new agers, but the current number of chromosomes (23) is of no significance at all. Many species, including our closest species amoung the apes, have even more chromosomes, and many have fewer. \n\n\r\nAlthough Druvalo is a scam artist, he does stimulate the mind, and he definately has an interesting theory behind consciousness. He also has some very interesting information about sacred geometry and how it relates to you personally. If you havent already, read Nothing in This Book Is True, But It's Exactly How Things Are, by Bob Frissell. In the book, Bob tells the story of Druvalos teachings, and reveals sacred geometry to you in an easy to understand way. \n\n\r\nNow you might ask, is TOOL, who have told us all, BELIEVE IN NOTHING, guilty of succumbing to the beliefs of a self-proclaimed space-traveler who is actually nothing more than a new age space cadet who probably ate way too much acid in the sixties? Go ahead and wipe the sweat from your face, TOOL would never do such a thing. What TOOL actually did with the song, and the teachings, was to explore a temporary belief system (coined by Robert Anton Wilson), also known as a reality tunnel, which stimulates and mind, and allowed themselves to explore a new way of thinking about consciousness and reality itself. \n\n\r\nBeliefs are cripplying to the mind, you should try and explore anything and everything. Even if you encounter success with a particular meditation, such as the MERKABA, or ritual magik, once you start to devolop your own dogma, your mind is dead. Temporary belief systems, temporary egos, or temporary reality tunnels (one in the same) are the way to go, because belief systems, are simply B.S.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nOk, the whole deal with the 44 chromosomes.  Aborignees have 46 chromosomes, so do all homo sapien sapiens.  The post about aborignees having 44 was, or maybe still is, a racist misconception, and statement.  Having more chromosomes means nothing when it comes to wisdom or intelligence.  Otherwise there would be insects, some having 100+ chromosomes, that are more wise than humans.\n\r\nI am saying this to show that this all psuedo-science, in other words, 100% bull crap.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\ni read an article not long ago in a music mag about tools 10,000 days tour and it had interveiw with manyard. he was saying that although his songs do have rather 'deep' meanings sometimes, his fans take it way to far and most of the time he didnt even realise the song could translate to some of the fuking meanings they come up with. call me crazy but that just came into my head when i reead all of this hah.\r\ni know its a song meaning web site and i love all the analysis on here, its awsome, but i hope you all dont get too into some of the shit ppl are saying, or you are just as bad as the type of arrogent upo themselves sself ricous assholes manyard is always mocking., \n\r\non another note i love this song and the jungian and melchizadek refrences are extreemly intresting,\r\nbut i think melchizadek is fuking racist and needs to evolve a bit itself if it recons aboriginals arn't as evolved as the rest of us, there philosophys may be simpler as a whole but they are just as wholesome indiviually as us, even more so because they are in tune with the earth and the spirits, even though i dont beleiv in much of that crap its respect to them ! \n\r\ntool are awsome! this sng is great.\r\npeace out\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nSomeone is bound to have mentioned this but this song has alot to do with Jung's 'shadow'. Read about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nmy life would be completely different (and for the worst) if it wasnt for tool\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\ndoes any one know what he is whispreing at the beggining?\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nOberones said it a whole lot better than I could but yeah, I am a recovering drug addict and this song gives me so much inspiration!!! TOOL IS HANDS DOWN THE GREATEST BAND IN THE HISTORY OF MUSIC!!!!!!!!!!!!!!!!!!!!!!1\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nStop reading too deep into it! Holy shit you guys are just like the scientiologist Maynard hates...although in the end I think the band loves laughing at you guys. God, even Star Trek fans have limits\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nmeddlehead40 came the closest I believe...... but I think you may have left out some things.\n\r\nThis is most definitely about Jung's shadow, but not just the shadow; it is an excellent summarization of the process of individuation.\n\r\nLet us clarify what the shadow is....... it is not you \"dark side\" as George Lucas would call it, but it is your other side.   It is only a reservoir of evil, if you are outwardly a good person..... a tyrants shadow would be kind and generous. See Man and His Symbols by C. Jung.\n\r\nJung's process of Individuation has to do with accepting all the parts of the personal unconscious, the shadow can be the most difficult part. But once you accept it, or step through it as Maynard has put it, you can discover what Jung called the Divine Self. storyteller mention Nagualism, and the Totality of the Self, but in reading that post and then reading Dr. Boeree's lecture cited to us by meddlehead40..... it is remarkably similar.\n\r\n\"Individuation means becoming a single, homogenous being and in so far as \"individuality\" embraces our inner most, last and incomparable uniqueness, it also implies becoming one's own self. ...\"self actualization\"\" C. Jung (collected works of C.Jung, 7, paragraph 266)\n\r\nIf you do go to read Dr. Boeree's lecture, please read it in its entirety, not just about the shadow and the anima...... read about the self and synchronicity...... this is the goal of individuation.\r\nThis song, in my opinion, is about the process.\n\r\nFinally there is obvious reference to Melchizadek and his chromosome theories..... lets clarify something here, I don't think anyone who posted about this actually meant that Aborigines only have 44 chromosomes, but that according to the definition set forth for that set (42 + 2).... the whole single consciousness between that being and the world around it, the Aborigines would be the best example.\n\r\nNow, go back and read that first post and what the different chromosomal levels are and their definitions, then read Dr. Boeree's lecture...... process and synthesis..... and you'll find that there are underlying similarities.  The 42+2 level would represent what Jung would call the collective unconscious, the 44+2 would represent the persona or the ego, and the 46+2 would represent someone who has gone through process of individuation, achieved Transcendence, and is now engaged in synchronicity...... Someone who truly believes that \"No man is an island\".\n\n\r\nI'm sorry, I didn't mean for that to get so long..... everyone here has good ideas...... honestly, Maynard may have just been playing with his shadow on a sunny day, lol, but that is the beauty in the autonomy of art.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nThis song relates to the meaning of Tool's word (i can't type it) Aenima.  Anima is latin for soul.  Enema is rectal cleansing.  Hmm. Basically they made up a  new word for Catharsis, or cleansing of the soul.  This term describes the song Aenima much better, but still applies to forty-six & 2.  The whole idea of chromosomes blew me away, yet I think that without going into detail, it can be summed up.  Maynard is describing the feeling of letting himself go and embracing this cleansing of his soul and growth into a higher level of consciousness.  By the way, Hitchiker's Guide to the Galaxy rocks.  42.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nHOLYSHIT!! man this is awesome.  I have read this whole posting, from 2002, up to 2007, and I want to say thank you to everyone who contributed.  This has been very mind opening.  Every hoopy frood know where his towel is, and you are some hoopy froods.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nAwesome song. I get reminded of it as we're doin genetics in biology at the moment. The music is hard and loud, pure Tool\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nAll right, I tried to read through the posts to see if this has been thrown out there yet and couldn't find it.  I remember from a while ago learning that 46 and 2 is actually the angle and degree (or some combination thereof) between the anus and vagina.  Taking that into context, this song could also be about a sex change.\n\r\n\"Feel the outside turning in\" - obvious\r\n\"Forty Six and two ahead of me\" - becoming a woman ahead of him\r\n\"Change is coming through my shadow\"\r\n\"Listen to my muscle memory\" the penis, being a muscle, is merely a memory and he's still listening to the instincts of having one.\r\nHe talks about how his shadow is changing a lot, as well as saying he wants to feel the metamorphasis.  \r\n\"Cleansing I've endured within\" - he's cleansed his soul of the male it thought it should be into the female is was supposed to be, and is changing his outer appearance to match.  \r\nAnyway...merely a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nI don't know what this song means to MJK.  Part of the beauty of TOOL is that he will not tell us what it means to him because he refuses to be what he despises.  Furthermore remember, the ambiguity and complexity is what keeps us coming back.\n\r\n\"Over thinking, over analyzing separates the body from the mind\"\n\r\nWith that in mind here are some of my simplistic thoughts.\n\r\n- Picking scabs: could be a reference to a hurt man who at the present is refusing to heal.\r\n- Crawing on my belly: may be a serpant reference which could mean the evil in him or the evil in us all.\r\n- Change coming through the shadow: could be explaining that what we see of other people is only the current product.  We don't see in others the obstacles that they had to overcome to be who they are.  Hence, to the outsider all chage occurs in the shadows of life.\r\n- Wanting to feel the metamorphosis: could be someone who is ready to change or ready to heal.\r\n- Listen to my Muscle memory: here I notice he doesn't say listen to me but his muscle memory... sounds of someone who at times feel like he's on autopilot, maybe even out of control.\r\n- Next he makes a declaration of how he'll live his life... this may be an effort to try to regain control of the chaos.  Good luck.\r\n- This declaration may allow him to [step through the shadow...to the other side] once again the new ever evolving finished product.\r\n- Forty Six & 2: just in there to screw with you.\n\r\nI already know that my analysis is completely wrong and that I am a dumbass.  I don't need you to remind me.  I am a whore for praise though ;).\r\nI also am pretty sure that I mispelled some things, and am sorry for those who spent all that money on an english  major and were actually suprised to find out that no body cares.  Get a job or start a business instead of pointing out to someone who actually has an opinion that he mispelled a werd (damn I meant word).\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\none of my absolute favorite tool songs, its just too hard to pick a favorite. i love the meaning behind it, so much depth. im right on track with what everyone else thinks its about. Tool forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nthis isnt that deep of shit if u guys think that kind of shit is complicated u cant be that smart this is the basics i learnt about chromosones in like grade 4 haha and how their is 3 steps to revelution\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nThis song is about being cRPG hero, and going to next level ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nblink-182's good and hilarious, A different genre of music, but certainly not a no talent pop band. mark tom and travis show is their best... their last cd was a little on the popfag side though.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nThis si one of my favorite songs.  The images and *metaphors* are brilliant.  Couple of comments though.\n\r\nAt least in traditional Jungian psychology, the anima is just one aspect of the Shadow (which is everything you hide in your unconcious when you create an ego).  The anima is the feminie aspects of personality that men are taught to suppress.  Women have an unconcious animUS, which is the masculine side.\n\r\nGene number is totally unrealted to evolution.  Chimps already have 48 (or 46+2) chromosomes.  Goldfish have 94, so unless your idea of enlightenment is swimming in circles with a turd hanging out of you a$$,  I'd take the Melchizadek theory with a grain of salt.  \n\r\nIt's a powerful image for self-discovery and insight, but I'd be surprised if MJK actually intended anyone to take his lyrics litterally.\r\n\"Think for yourself...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nI heard that it was about homosexuality... that the 2 in 46 & 2 was what was believed to be the gene that causes homosexuality... or atleast to Maynard.\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nMaynard does not hold the answers! nor will you obtain them by reading Jungian theory. We are all confused and want to believe something but these \"theories\" were only created by people like yourself and are true because a group has agreed upon it. take from the song what you must but you might as well be one of L.Ron's clones if your after some more chromosomes.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nOberones, there is something wrong with your take on the song. there are no humans on this planet with 44 chromosomes, \"primative\" peoples included. all humans have 46 chromosomes unless there is a mutation or a mix up in the development(like trisomy 21, Down syndrome, where there are 47 chromosomes present). in fact, we evolved from having 48 (early ancestors shared by apes and hominids alike) chromosomes to somehow having 46. the facts about human evolution are not agreeing with what you are saying. this is a beautiful song, but you have it wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nThe reference that is made to his shadow is to do with part of the whole 46 and 2 theory. It says that our shadow is everything we dislike about ourselves, and to reach this third stage of evolution (46 and 2) you must accept all aspects of yourself. When Maynard says he wants to know what he's been hiding in his shadow, I think he's saying he wants to know what it is that he doesn't like about himself. So then he can step through his shadow, almost becoming a part of it. Or in more understandable terms, accepting all the aspects of himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nfrom everything that i have heard\r\nthis song means absolutely nothing\r\nthey tried to put so much meaning into it at first and then it just meant absolutely nothing and there actually making fun of you for trying to figure it out\n\r\nbut either way.. song kicks ass\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nok...just wanna focus on one part and thats the picking scabs part. i pick my scabs...it's a common compulsive habit. those words to me mean picking, picking off layers and layers trying to accept that the digging and shedding of layers is only a way to force myself to understand and accept the pain and the blood, and therefore what lies in the shadows. once i have picked so deep that it becomes infected and unbearably paiful to do so, i stop. i let it heal. this is part of who i am personally, and i think alot of other people must see to different extents, what is there. i will sometimes make huge scarrations (wounds) even on my face. this, for me, is a literal mataphor and it shows my darkness through ugly scabs and scars. i wonder if people think that when they see them. \r\nanyways i thought i would share that...personal, but it means alot...to me\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\none more thing...after i pick too deep, the wound heals itself and literally forces itself to heal. it becomes unpickable, yet remains as a scar to remind me.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nfire dancer 76 is right as hell.  I say let your shadow take control of you.  Give in to your deepest thoughts\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nI'm not sure if anyone else said this, but the main riff to this song sounds suspiciously similar to the main riff in \"Home\" by Dream Theater (which was released earlier then this song). Check it out they're both pretty good, intense songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nThe song obviously takes a lot from Jungian Theory, if not literally describing it. On the outside, it's just a great song about making change or advancing. This is TOOL at their best for me. I love the songs with heavy philosophical undertones like this and Lateralus. This song hits me well if I hear it as a desire to advance or improve oneself instead of actually growing a couple of chromosomes. It's a very optimistic song to me. It makes me feel like something better is ahead, and if I try hard enough I can achieve it. One of my favorites.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nI have some other questions about this song.  I, myself, am a musician, lyricist/song writer, and artist.  Many times, though the phylosophical assessment is probably dead on, a song writer will write about something more concrete.  Meaning that he is possibly describing a situation encountered in his life while also having the underlying phylosophical meaning.  Also the writer wants to connect to his audience which is easier to do while describing personal events eventhough it may be in poetic fashion (though some bands have gone completely artisitc, poetic, conceptual... like old Genesis, Pink Floyd, YES, etc.)  I believe he is also describing an event he experienced.  Some of the lyrics are familiar images or expressions that are well known such as \"old armor\".  I also think that \"Forty Six and 2\", in his description... seeing that he is singing as though in that moment in time giving the listener the sense that we are watching a scene in a movie, is an address.  Perhaps the number was jumbled from the original to fit with the jungian theory, but I feel it is possible that it is an actual house or apartment number.  Anybody got any feedback on that?\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nwell madludwig, imo, anything tool usually has a deeper meaning. the fact that the song fits with jungian psychology is one thing ('my shadow', the whole 46 and 2 thing, etc.), but the albums title is a direct refrence to carl jung's anima/animus theory. so i really dont see any reason to be skeptical about the fact that it is, in fact, about jungian theory. \r\nAlso, it doesn't feel like a story to me, but thats purely my opinion. What happened? At 46 and 2nd street, he shed skin and picked at some scabs? seems like a stretch...\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nI agree with oberones, it's about changing, evolving into something new\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nalthough I can understand scientifically where everyone is coming from, I take this song differently. To me it means just shedding your old self and becoming something new.Getting rid of something thats holding you back, realising it and just transforming into something more in-tuned deep inside yourself. This song to me is about finding that inner self that you push away and keep locked up. You know the saying \"out with the old, in with the new\". Hope this makes sense to whoevers reading this.\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nthe meaning of this song is not to question our number of hromosomes or something like ti... its pure Evolution, getting stornger, getting better, step through and embrace the love, not in tradicional sense like Chritianity.\n\r\nLove because its one of things u can do once in ur liftime.\r\nEmrace it and let it guide ya...\n\r\ni felt this song in that sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nOk... I'm going to have to admit it.... I have no idea what MJK is... I know I know.... what a Tool fan right? :*( so sorry about my stupidity\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nwhhhat!.. you dont know who mjk is?\r\nmaynard james keenan?? dear lord child where have you been?\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nI'm 45, so I hope to God the people who said the song was about your life being over at 48 were VERY wrong. But seriously Folks....I enjoyed reading the myriad of interpretations of this awesome song. Being a Maynardophile I know not to take anything he says or writes literally but I'm sure there is a connection to Jung, sacred geometry, and Don Juan, ect. Personally, to me it's about AWAKENING to the Ego (chaotic and insecure delusions) and seeing this is NOT your TRUE self. While reading Eckhart Tolle's stuff about 'The Pain Body' I instantly thought of 'Shadow' and there is a huge similarity there. For those of you seeking 'enlightenment' I suggest you read Tolle. His 'Power of Now' book is the best one to start with. He doesn't believe in beliefs. Parabola and Lateralus lyrics could have come from Tolle they are so similar and both songs are my mantras for LIFE! \r\nBe HERE Now!\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nShadow is the EGO. Simple. Now interpret this song knowing that the shadow is your ego. From chaos comes cosmos ;) peace love and light.\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nOne thing people should note is that acquiring two more chromosomes doesnt necesarily mean great things will happen.  For instance rabbits have more chromosomes than us and all they do is eat, sleep and have sex... well maybe that is the purpose of life...\n\r\nIts not sure that the two chromosomes will help us out, maybe what we really have to do is loose two.  But thats not the point, the song is just introducing change and using chromosomes as a metaphor.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nwe have 46 chromosomes.  apes have 48. the last leg of evolution fused 2 chromosomes to create chromosome number 2. thus, we went from 48 or 46 + 2 chromosomes to only 46.  \r\nthe jungian shadow reference seems right.  however,the \"evolution\" aspect is backwards.  maynard seems to be talking about devolution, shedding the shadow of human consciousness that has complicated his life.  back to simplicity.  back to 46 + 2 chromosomes.  no more messy thought,only pure animal instinct.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nOberones hit it spot on. Im very impressed\r\nTOOL fans are the greatest fans alive!\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\namasing song tool is the best ever i can't wait to they tur again\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nawesome song. there are good and bad sides to everything in life, even things that are commonly viewed as \"bad\" by religion and society. sometimes you have to be willing to embrace both sides, life is not black and white. i love the incorporation of Jung's theory, showing parallels to Nietzsche's concept of \"what doesn't kill you only makes you stronger.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\ni have to say one thing tool are a great band i have listend 2 tool for about 2 years now i love how they always have a point to prove by there songs. and great meanings it is 2009 now this song was brought out in 1996 if i am not wrong anyway it is still a great song aenima is great song also \r\nTOOL - RULE \t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nTo me, this song is about plain survival. It's about just stripping away all your principles, ethics, morals, just to live for another moment. It's sort of contradictory that in doing so, the \"old armor\" softens, when it's just making it tougher.\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nI watched a 2 hour ExposÃ\u0083Â© on evolution, and it reminded me of this song. Although I don't think its what they intended, since its kind of backward, I found it interesting\n\r\nApes and monkeys and such have 48 chromosomes, or 24 pairs. Now saying that we evolved from apes, would be saying that somehow a pair vanished. Well it didn't go away cause that would be lethal, but what he found was that the 2nd chromosome in humans, is actually made of TWO chromosomes fused together, that would explain where the chromosome difference came, and would also add a lot more to the theory of evolution, because naturally chromosomes don't form like that... so at one time there must have been an original with regular chromosomes. So if we look for an animal with 48 chromosomes, and the closest to our species, we see monkey's.\n\r\nNot really relevant, but this song popped into mind the second he said that\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nAccording to Jung...The shadow is the reverse of the outward personality we show to the world. So knowing this i think the song becomes quite clear... i love the way Maynard writes.\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nsure, maynard doesnt hold the answers; however, he doesnt believe in blindly following the rediculous nonsense of religion and wasting ur life for some make believe dogmatic law... he just knows there is more to life then what we r living right now and he is spreading the word.  \n\r\ni dont believe in God.\r\ni wish i had an answer to life, but i dont.\r\ni believe in things like energy and logarythmic spirals... but it doesnt consume my life.  \r\ni learn new things every single day... i take whats given to me without question and do whatever i need to do to get through.... no matter what...\r\nbut i dont dwell...  \r\nthis music is so inspiring and it soothes my soul... it just teaches you to make ur own decisions, and wisely... dont submit to dogma and live life to the fullest... \"ride the spiral till the end, we may just go where no one's been \" \t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nI love how people back in 2002 were like \"The earth's pole will shift in 2003 and only 10% of the world's population will survive! Its real!\". hahaaa \t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nThe title references an idea first conceived by Drunvalo Melchizedek concerning the possibility of reaching a state of evolution at which the body would have two more than the normal 46 total chromosomes and leave a currently disharmonious state. The premise is that humans would deviate from the current state of human DNA which contains 44 autosomes and 2 sex chromosomes. The next step of evolution would likely result in human DNA being reorganized into 46 and 2 chromosomes, according to Melchizedek.\n\r\nFurthermore, the song references a wish to experience change through the \"shadow\"; an idea which represents the parts of one's personality that one hates and fears, which also exists as a recurring theme in the work of Carl Jung\n\r\nThe song is mostly in 4/4 time with some sections of 7/8 in between. In the intro, Danny Carey plays 4 measures of 7/8 on his ride cymbal over the rest of the band playing in 4/4, and they all meet up on the downbeat of the 5th measure in 4/4. During the bridge there are 3 measures of 7/8 followed by one measure of 4/4, and a brief polyrhythm of 6/8 over 7 in breakdown solo\n\n\n", "comment_229": "\nDoes anybody else here the word coup, not clue?\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nMaynard James Keenan is from a small town in Ohio called Ravenna. Very close by is an intersection of Route 46 and Second Street. Maybe he's really deep and it's about genetics. Or maybe something significant happened to him at that location. Just a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nthis song helped me through a very dark and lonely period in my life..thank you tool\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nnow for a more opinionated stand still...i interprut the song different when i hear the title 26+2.. who has 46+1 chromosome..somebody with downsydrome who is someone who  metaphorically lives as a shadow in a sense that they are are perfect whole and complete they dont live through the way the were told as a child but way they want.  they live to eat to sleep, but most of to enjoy.  the way i look at the title incopertated with the lyrics i think of someone like us born with 46 chromosomes free to think. but for someone with that ability can be done wrong as they think of what and how they are told.  the extrea 2 chromosones are the abailty to think and to think for yourslef out of the knowledge you have of maybe the first few years of life persay... well ikind of mixed up my ideas but what im trying to get at is a child knows how to think this way as well maybe the first 11:)yeah ok im done now \t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nhmmm.... well 46 chromosomes is a normal person.if you added 2 more to that you would be a retard,it causes more problems than gifts.so 46 is his dna and 2 is his old self and his new self.he is clearly metitating.he trying to clear the way by changing his thought process,which is his shadow.he is going by the buddhist philosiphy.you have to clear all the negative thought by going all the way back to the first time you thought a certain way and contemplating why he has been clinging to things,which causes suffering.things you cling to are attachments,attachments cause suffering.the less attachment the less suffering.in order to change your thought prosess you have medidtate just as buddha did in the feild under a tree for a very long time.in doing this he found enlightenment.cmon people are you fuckin serious,your putting too much into it.read the philosiphy of buddhism and listen to the damn song again you 48 chromosome mother fuckers.\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nok ill, show you verse for verse that this comes from the buddhist philosophy. here we go\n\r\nMy shadow's=all his feelings that cause him suffering\r\nShedding skin and\r\nI've been picking\r\nScabs again\r\nI'm down\r\nDigging through\r\nMy old muscles\r\nLooking for a clue=is trying to find out the thought prosseses from long ago that origionally caused these mental soarse.\n\r\nI've been crawling on my belly\r\nClearing out what could've been=regret,which is shame,that causes rage inside,which again,cause suffering\r\nI've been wallowing in my own confused\r\nAnd insecure delusions=he is confused cause all his life he has never been totally aware of why he is the way he is and has delusions that cause him suffering\r\nFor a piece to cross me over\r\nOr a word to guide me in\r\nI wanna feel the changes coming down\r\nI wanna know what I've been hiding in=he wants to find out what he is hiding in his subconscious,that led him to this burden by using the word of buddha for a piece of mind\r\nI wanna feel the change consume me,\r\nFeel the outside turning in\r\nI wanna feel the metamorphosis and\r\nCleansing I've endured within=when you mediditate(the right way)you discover mindfullness.which is total awareness,of everything and everone and mostly yourself.when you do this ,you will literally change who you are completely,by changing your thought prosseses.\r\nMy shadow\r\nChange is coming\r\nNow is my time\r\nListen to my muscle memory\r\nContemplate what I've been clinging to\r\nForty six and two ahead of me=ok after a certian time in your life,everone should do this,clinging is metion in buddism philosiphy a 1000 times,as to clinging to things that make him blind to the real answers to enlightenment.\n\r\nI choose to live and to\r\nGrow, take and give and to\r\nMove, learn and love and to\r\nCry, kill and die and to\r\nBe paranoid and to\r\nLie, hate and fear and to\r\nDo what it takes to move through=he chooses to live and let his concious grow by taking only if he needs to and giving only when people need to be given too.all these things love,killing,crying,diing,hating,fear,are all result of feelings which are different than thoughts.he needs to seperate the 2 so he can logically think his way through life ,rather than feeling through life and letting feeling through life,which never works.\r\nSee my shadow changing,\r\nStretching up and over me\r\nSoften this old armor\r\nHoping I can clear the way\r\nBy stepping through my shadow,\r\nComing out the other side\r\nStep into the shadow\r\nForty six and two are just ahead of me=ok this is where he finnally accomplishes what he wants,seperating his feeling from his thoughts,which seperates his old self to his new self,46 chromosomes,which is his body,and 2 which is feeling and thought.old self and new self.\r\ni mean really?  Jungian Psychology? are you fuckin kidding me? that has to do with dreams.he isnt dreaming,he is meditating.notice that tools music changes in this album completely,into a bongo,kinda chanting,like you would here at a buddhist colony.most of this cd is about this,not all the songs,but stinkfist,46 and 2,push it,eleven and 3rd eye are all about this stuff.like i said read buddism and get back with me.or maybe a meditation book.\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nJust a thought, in Egyptian magic or in magic in general there is a practice of the magician to attempt to change the shape of their \"shadow\" into the figure of a god in order to perform rites as the god they are attempting to become. The shadow is one of the subtle energy layers that surrounds our bodies kind of like an aura. Through states of meditation you can become more in tune with these energies.\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nthe term \"Forty-Six & 2\" is a direct reference to Jungian philosophy\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\n\"They were two perfectly insignificant and incapable individuals, whose existence is only rendered possible through the high organization of civilized crowds. Few men realize that their life, the very essence of their character, their capabilities, and their audacities are only the expression of their belief in the safety of their surroundings. The courage, the composure, the confidence, the emotion and principle, every great and every insignificant thought, belongs not to the individual, but to the crowd: to the crowd that believes blindly in the irresistible force of its institutions and of its morals, in the power of its police and of its opinion. But the contact with pure unmitigated savagery, with primitive nature and primitive man brings sudden and profound trouble to the heart. To the sentiment of one's loneliness, to the loneliness of one's thoughts and one's sensations. To the negation of the habitual, which is safe, there is added the affirmation of the unusual, which is dangerous. A suggestion of things vague uncontrollable and repulsive, whose discomposing intrusion excites the imagination and tries the civilized nerves of the foolish and the wise alike.\"                          \n\r\nJoseph Conrad    \"An Outpost of Progress\"    1898\n\r\nLet go of your preconceived notions and inform yourselves...\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nThe songs about digging through your subconscious via mescaline. The book Teachings of Don Juan is about becoming a peyote shaman and is referenced in the song Third Eye which is on the same album as 46 and 2. Maynard is most likely using mescaline here.\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nAnima Enima. that is the purpose of the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nI THINK IT IS ALL ABOUT, WHAT YOU ALL THINK.\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nThe struggle of reaching a higher state of consciousness \t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nThis, arguably, one of the best progressive metal songs of the 1990's. \t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nI concur with oberunes the first comment\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\n46 and 2 is the name of a song by a band named tool. 46 literally means â\u0080\u009cworld satanâ\u0080\u009d... the subject in the song is stating that his unsatisfactor condition in Almightyâ\u0080\u0099s eyes are causing him to lose his humanity... do to a forward trajectory of evil deeds and eventual loss of his free will. The statement picking scabs again refers to not allowing his wounded mind to find help, but instead further the subjects moral retribution cast in his own direction. He states more of the same in the third line about being â\u0080\u009cdownâ\u0080\u009d and â\u0080\u009cdiggingâ\u0080\u009d refers to being down in a sort of position below. Old muscles are his lack of ability to be a healthy minded human being... he is leaning toward a suggestive theme of need micro computer to posses him to grant him some relief to his physical and emotional strife... to be supervised by the angel that over sees such a idea. He is stating that he without knowledge is looking to be taken to the underworld or the small hope of being saved (most likely by law enforcement). â\u0080\u009cPlease consider reading the end of the song as he is clearly and accurately describing ideals without way or means of change in hell.â\u0080\u009d Of course itâ\u0080\u0099s just my opinion and attempt and song meaning. â\u0080\u009cI AMâ\u0080\u0094for life.â\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nChimps and potatoes have 48 chromosomes.. hermit crabs have 254, they're really evolved.. and a certain type of fern has 1260. The pinnacle of our development \t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nIf you want to have your socks blown off, listen to an 11 year old girl sing this. She's just amazing. \t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\n This song resonates with me at every point in my life as I am always reaching for self awareness even when painful.  If you listen chronologically to their albums you can hear Maynard heal some of the pain of losing his mother first to her beliefs and then to death. You can hear them use music to transform negative feelings into beauty and perfection. some of hi emotions. Turn anger and sadness into beauty as Tool does impeccably as a band. They take agression and anger and flip it into something soothing, comforting and lovely. Thank you Tool for creating all of this to help other people work through their emotional worlds. Thank You. Thank you\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nMy take on this song is the psychological \"shadow\" of Jung.  Pretty sure this is well-known.\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nAfter just listening to this song, it makes me think of child abuse.  I'm pretty sure other Tool songs have dealt with this subject, but I don't remember which.  Anyway, the shadow seems to represent the narrator's mind, clouded from the abuse.  The scabs can also be old wounds from the abuse.  The whole song seems like a reflection back on the abuse, and \"clearing out the bad thoughts\", so the narrator can go on with his life.  He chooses to walk past these thoughts (the shadow) and pick open the old wounds (the scabs) to deal with his inner problems, and move on.\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nThank god???? MJK is God!\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nsooooo...... anywhere I can get some cheap chromosones in the sale? :D\t\t\t\t\n\t\t\t\t\n\n"}