{"comment_0": "\n\"FourFiveSeconds\"\n\r\nSingle by Rihanna, Kanye West and Paul McCartney\r\nReleased\tJanuary 24, 2015\r\nFormat\t\r\nCD single digital download\r\nRecorded\t\r\nVarious\r\n2014 Jungle City Studios, New York City Windmark Recording, Santa Monica No Name Studios, Mexico\r\nGenre\t\r\nPop soul pop\r\nLength\t3:08\r\nLabel\t\r\nWestbury Road Roc Nation\r\nWriter(s)\t\r\nKanye West Paul McCartney Kirby Lauryen Mike Dean Ty Dolla Sign Dave Longstreth Dallas Austin Elon Rutberg Noah Goldstein\r\nProducer(s)\t\r\nKanye West Paul McCartney Mike Dean Dave Longstreth Noah Goldstein Kuk Harrell\r\nRihanna singles chronology\r\n\"Jump\"\r\n(2014)\r\n\"FourFiveSeconds\"\r\n(2015)\r\n\"Towards the Sun\"\r\n(2015)\r\nKanye West singles chronology\r\n\"Only One\"\r\n(2014)\r\n\"FourFiveSeconds\"\r\n(2015)\r\n\"Blessings\"\r\n(2015)\r\nPaul McCartney singles chronology\r\n\"Only One\"\r\n(2014)\r\n\"FourFiveSeconds\"\r\n(2015)\r\n\"All Day\"\r\n(2015)\r\n\"FourFiveSeconds\" is a song recorded by Barbadian singer Rihanna, American rapper Kanye West and English musician Paul McCartney for Rihanna's upcoming eighth studio album. It was written and produced by West, McCartney, Mike Dean, Dave Longstreth and Noah Goldstein with an additional writing from Kirby Lauryen, Ty Dolla Sign, Dallas Austin and Elon Rutberg. Previewed by West at the iHeartMedia Music Summit on January 21, 2015, it was posted on Rihanna's official website on January 24. The same day the song was released as the first single from her upcoming album being made available for digital download. \"FourFiveSeconds\" is a pop and soul pop song with country and folk music influences and an instrumentation consisting of an acoustic guitar, organ and cello.\n\r\n\"FourFiveSeconds\" received critical acclaim from music critics, who praised Rihanna's and West's new direction, their vocals, and the song's minimalistic production. Upon its release, it peaked at number four on the US Billboard Hot 100 chart; in doing so it gave Rihanna her twenty sixth top-ten on the chart while McCartney made a record by ending the longest break between top-ten songs on the chart. The song also peaked at number one on the US Hot R&B/Hip-Hop Songs. Internationally, the song reached number one in Australia, Denmark, New Zealand, Sweden and Ireland and reached the top five in Canada, France and the United Kingdom.\n\r\nTo promote the song, an accompanying music video was directed by Dutch photographer duo Inez and Vinoodh in New York City. Shot in black-and-white, it was met with positive reviews from critics who commended the video's simplicity and compared it to the works of Herb Ritts and Xavier Dolan. Rihanna, McCartney and West performed \"FourFiveSeconds\" for the first time at the 57th Annual Grammy Awards on February 8, 2015; the performance received highly positive reviews. \"FourFiveSeconds\" has been covered by various recording artists, including Canadian rapper Drake and British singer-songwriter James Bay.\n\n\n", "comment_1": "\nThis song is about Rihanna getting drunk at 12:00 AM on a Tuesday and getting ready to flip the fuck out based on what someone said on Monday morning. She is now worried that she is going to jail for her puerile behavior even though she hasn't even done it yet. Ah, deductive reasoning.\nDegenerate music - who needs it?\t\t\t\t\n\t\t\t\t\n\n"}