{"comment_0": "\nThis song is about the long lost respect for the individual. That respect eminates from the nether reaches of our psyche  reaching out to us, the dismembered constellations..ie the conflicted community.  Beyond the nuclear weapons that protect us from each other, the burning convictions that keep us in check and the marketing that sells us out, our psyche reflects the ancient traditions of respect and wonders how they can be made valuable again.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think it is sort of a song of hopelessness. The idea that an old man is still planning to \"be rich someday\" is kind of a sad statement.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI personally believe the song is about learning from the past and having hindsight, rather than just focusing on the present.\n\r\nThe old man saving what others throw away could be a metaphor. He's learning from the past, or \"saving what others throw away\". Expanding on the metaphor, he'll be rich someday with knowledge.\n\r\nWithout hindsight, history repeats itself.\r\n\"Cobwebs fall on an old skipping record\"\n\r\nRather than believing the chorus is truly about ancient radiation and stars, I think this is another metaphor for the past. I believe it's about how the knowledge from the past is still out there, but as the song says, it \"faintly glimmering.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThe part about \"an ancient radiation. that haunts dismembered constellations, a faintly glimmering radio station.\" Refers to radio signals that travel out into space just now reaching outer limits of space, where frank sinatra's music is still being heard(because its signals are just now arriving)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nTo add on to myh comment, it also seems to be saying that the older generatoin won't accept anything new either.  I guess its just about the general divide between generations.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nHeh, I'm repeating myself, but I simply love how many different (and perfectly sensible and valid) interpretations you can get from these songs. \r\nHere's an interesting and unusual one I came up with:\n\r\nThis song could be about the effect of the media and the \"Hollywood syndrome\" on people.  A more subtle \"Californication,\" perhaps?\n\r\nA dismembered constellation would be a bunch of stars that are split apart and are off by themselves.  They should be grouped together, but instead they alone.  There are more kinds of stars than literal gaseous fireballs in the cosmos, such as movie stars or music stars.\n\r\nThe radiation, which has been going on for years, is the unintended(?) message that Hollywood has been sending out for years about the magic of the movies and the glamorous lifestyle of celebrities.  It contaminates people's minds; they are left with dreams concocted by an industry that they can never achieve.\n\r\nThe stars from the dismembered constellation are the lonesome people who grew up in a western culture, who spent all their life idolizing movie stars and believing that the Hollywood lifestyle is what they truly want.  The message is still, and always will be, reaching them, and plaguing or haunting them.  They still feel that they can be rich and famous someday.  They think they *really* belong among the Hollywood elite (a \"constellation\" or group of movie stars.)  The gloomy and rainy sounding music and imagery of cobwebs falling on what these people bsaed their dreams on just illustrate what a sorry state they're in. \n\r\n\"Beyond your... etc.\" When you look past what the industry does (entertains, makes a point, spreads ideas, and most of all, sells) you see the people it effects.\n\r\nThe sad line about flies and spiders getting along together (really- brilliant writing.) shows the impossibility of these dreams.  Flies and spiders could never get along, because spiders feed off of flies.  Does Hollywood feed off of these people?\n\n\r\n...\r\nEh, it's just an idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think that he makes references to quasars. (ancient radiation in a constalation that's like a glimering radio station [quasars give off flickering radio waves]) the entire song he is refering to old things that most people forget about - things that most people \"throw away\" symbolically, just like they do with chinese lamps and stamps - the first time I heard this song I thought he was making out the old man to be fool, but I realize now that it is a lament for whorthwhile things that are ignored by our society - hence the sad, lament-like sound to the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nbobwronski has a really convincing interpretation but i always thought it had almost the exact opposite meaning.  maybe im a glass half full kinda guy (either that or i am incapable of picking up on irony in lyrics).  \r\ni think the song is a criticism of the 9 to 5 lifestyle.  the old man is the result of a lifetime wasted chasing the american dream working at some mundane task (collecting stamps).\r\non the other hand, musicians (like frank sinatra) can accomplish greatness far beyond mere wealth.  hell, the beatles were bigger than jesus.  popular music is appreciated by the entire world.  it can make people forget their troubles and even make \"flies and spiders get along\".\r\nthe significance of touching others with your art is greater than almost any other trivial endeavor of mankind.  \r\nits bigger than the \"ad campaigns\" of men in suits trying to take over the world (or atleast their target market).\r\nits bigger than the \"flaming truths\" about the meaning of life on earth.\r\nits even bigger than this \"roost\" we call home, or the galaxy surrounding it.  \r\nfrank sinatras songs will be riding radio waves for millions of years, exploring \"dismembered constilations\" and 1000 years from now his legacy will live on on the planet omicron persei 8.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nIt's great to read all of your comments, there are some excellent interpretations here and of course none are wrong. Even if CAKE had a certain intention for a specific message to be taken, if you take another it simply adds to the song's meaning.\n\r\nMy interpretation is rather simple. The old man is collecting old artefacts in the knowledge that 'he'll be rich someday'. The old man has lived long enough to know that history repeats itself, akin to the 'old skipping record' , therefore his collections will one day be of high value. Cross reference with 'Sad Songs and Waltzes' in which CAKE tell of a cheating lover whose crimes won't be listened to because 'sad songs and waltzes aren't selling this year' and it's a warning that even if people try to hide the truth, in the end there will be a moment when someone will be listening the truth will out.\n\r\nI agree with the interpretations already made of the radio signal, but would like to add my own. The source of the signal, like a collapsed star, may have ceased long ago or may play completely new music at the same time that Frank Sinatra has reached stars far away. I apply this to the old man, who may die soon but he will leave a legacy. Summary: art/music/collections of fine things are a way to become immortal (this is of course partially self-referential on CAKE's behalf).\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nForgive me for my Tin Hat theory, but I've always thought this song was about time travel. So, in a future world, we are not doing well. The world is violent, aoverpolutted, etc and I guess you could so close to apocalypse/armageddon. So, one of the world's goverments manages to send a man back in time useing a terminator time machine ( one-way, no way back.) \"...while Frank Sinatra plays stormy weather...\" The man is sent back to approxmantly 30's-50's, a big time for Sinatra. Useing the objectives his govement gave him, he manages to fix many of the world's future problems by correct them as they first begin in the past, creating an almost butterfly effect. While thier, however, he manages to \"collect some stamps\" because he'll be \"rich one day.\" He basically invests in things thought trivial during the 30's-50's and gains welath from them, knowing how they would be used in the future. Now, the \"...flies and spiders getting along together, while cobwebs fall on an old spinning record.\" I'm pretty sure theirs a Biblical verse that roughly states \" theirs a season for all things.\" Theirs been so many different kingdoms and empires throughout history, but even grand empires fall, and those who are left pick up and create a new empire in its place, starting the cycle over again. Now, a skip in a record is when the needle has reached an error in the disk, and goes backwords to a more durable part in the disc to continue playing ( I'm pretty sure it can also move forward during a skip, not sure though.) This means that with this new technology of time travel, their will never be another \"fallen empire.\" and that we can just send another man back in time to correct our mistakes, thus breaking the \"season for all things\" cycle, and creating an almost, if not totally perfect, society.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nWe know of an ancient radiation \nThat haunts dismembered constellations \nA faintly glimmering radio station \nWhile Frank Sinatra sings \"Stormy Weather\" \nThe flies and spiders get along together \nCobwebs fall on an old skipping record\n\nThere's a somewhat literal interpretation in the cosmic radiation background. Anywhere you go in the universe, including dismembered constellations, you will find the first light of the universe. It's been cooling for 14 billion years and presently registers on the high end of the radio band of frequencies in the electromagnetic spectrum (2.7GHz). It constitutes a majority of radiation in the universe, but on Earth we are very close to a star and make a lot of noise ourselves; it's fair to describe it as \"faintly glimmering.\" About 3% of the static on old antenna TV's was the radiation background; not exactly a station in and of itself.\n\nSo it's literally the most ancient radiation in existence, or so the majority of cosmologists believe, and you can pick it up with what I'd loosely call modern radio equipment - faintly. Conclusions: Mr. McClea is an educated man, and you're on your own with the spiders and the rest of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis is a beautiful song, and equally as sad. And as others have mentioned, it is about love, and advancing the idea that, perhaps, love is universal. \n\r\nLooking at these comments i am surprised to find that noone has brought up Frank Sinatra's \"stormy weather,\" the very inspiration for this song. In it Sinatra laments over a lost love, and how he will grow old and alone without her.\n\r\n\"When she went away, the blues walked in and they met me\r\nIf she stays away, that old rockin' chair's gonna get me\"\n\r\nCake describes an old man who is alone, without passion or future, who collects items from youth.\n\r\nThe beauty of the song, however, is that as pathetic as he seems, this lonely, loveless man..his story is immortalized in the stars. As \"Stormy Weather\" bounces from star to star through the solar systems, even the flies and the spiders stop their eternal struggle to appreciate life for a moment\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThe guys of Cake are very knowledgeable students of music.  If they throw in a reference to another song it isn't going to be randomly chosen.  So to understand the song its important to read the lyrics to Frank Sinatra's Stormy Weather.  Stormy Weather is probably Sinatra's most depressing song so its appropriate that Cake's most depressing song references it.  Here are a few lines from Stormy Weather:\n\r\nLife is bare\r\nGloom and misery everywhere\r\nStormy weather\r\nJust can't get my poor self together\r\nI'm weary all the time\r\nEvery time\r\nSo weary all of the time\n\r\nWhen she went away, the blues walked in\r\nAnd then they met me\r\nIf she stays away, that old rocking chair is bound to get me\r\nAll I do is pray the lord will let me\r\nJust walk in that sun once more\n\r\nCan't go on\r\nEverything I had is gone\r\nStormy weather\r\nSince my gal and I ain't together\r\nKeeps raining all the time\n\r\nOk, so its a song about a guy who's lost his girl, he's depressed, sits around inside and dwells on the past, worried that he will never get over it and end up a lonely sad old man.\n\r\nIt's not a coincidence that Cake's song then paints a picture of a lonely sad old man.  Its the same man 50 years later!\n\r\nThe song doesn't aim so much to tell a story but to paint a picture of the conclusion of the story told in Stormy Weather.  The beginning of the song tries to pull us back into the past, where this man still dwells, referring to the ancient radio waves from his time just now reaching the far ends of the galaxy.  It then zooms in back to earth where this man now lives.  Time has gone by in the rest of the world, but this man is still stuck in the past, he has forgotten the world and the world has forgotten him.\n\r\nI'm not sure about the flies and the spiders part, unless the spiders are so depressed they gave up hunting the flies.  BTW this is one of my favorite songs period.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nBest.  Cake.  Song.  Ever.  Hands f***ing down.  No one will convince me otherwise.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis song is sooo cool. When you listen to it, you can tell so many things just by listening to the music and the tone of his voice.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI have no idea what this song is about. Can anyone help me here? Oh well. It's a pretty catchy tune; woke up singing it. Of course, it's probably because my brother was playing it loud enough for me to hear. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI think the song is about an old man sitting in a room alone listening to old records while the rest of life passes by without him.  The imagery of cobwebs, dismembered, and haunts, etc. makes me feel that the old man has died and the singer is in his room soon after his death imaging the old man still there.  Maybe he's even going through Grandpaâ\u0080\u0099s stuff after heâ\u0080\u0099s passed since it says, \"he saves what others throw away?\"  Just my interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis really seems to be about younger people being unwilling to accept the music their parents or grandparents listened too.  The more you listen, the more it makes sense.  sammohung's comment seems to make sense, and support my idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nActually I think the ancient radiation that haunts dismembered constellations is a refrence to old stars dying (how do you dismember a constellation: you lose one of the stars) and the faintly glimmering radio station is becuase some of the static that you hear on the radio is radiation from old stars. But I like the other interpertation too. As for what the song is about, I think it's about people who forget about the past and how sad that is. Images of Frank Sinatra (an old time singer) and the old man who saves what others throw away seem to refer to that, in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\ni love this song its a classic cake song kick ass bass line, trumpet, haunting melody, its wonderful\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni love the trumpet. when i die, i want them to play this song at my funeral. and for some reason whenever i listen to it i get this strange image of a birds eye veiw of a limo. a limo in a park, driving away slowly. it's some weird shit man. but only during the beyond the suns... part and that trumpet part. no shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nmy boss sings this song all the time. its very funny.\n\r\nbtw, this song is on the sopranos soundtrack.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI think it's about the newer generations forgetting the pasts'.  \"beyond the suns that guard this roof,\r\nbeyond your flowers of flaming truths,\r\nbeyond your latest ad campaigns\" seems to talk about the future or the outside of the old man's house. Inside it we see an old man reminiscing.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nhalfbaked's interpretation = very clever\n\r\nthis song makes me want to throw my hands in the air and dance\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nListening to this song I imagine a view of this room, where the old man is sitting. An old radio, playin' Sinatra, everything is covered with spiderwebs, the room is filled up with junk, like chinese lamps and other old stuff. I think somehow this song also tells about hopeless dreams. Like being rich someday, like being understood somedayâ\u0080¦\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI think this is a song about people delving too long in the past and aren't welcoming the present. I mean with Frank Sinatra and records and the metaphors to oldness e.g. cobwebs.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI like everyone's interpretation of this song--while it probably has some deeper meaning, I see it as just a story about an old man--possible with alzheimer's or dementia--who lives within his own mind, alone, listening to Sinatra and \"collecting stamps\".  He possibly doesn't realize that he is old (thus \"he says that he'll be rich some day\").  \n\r\nIs it just me, or is there some reeeeally faint screaming while the trumpet plays in the last minute or so of the song?\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nShoot--I was going to add that this song reminds me of \"The Way\" by Fastball (because of the old, possibly senile character, I guess).\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis song's just plain cool, not sure what it means, but it's cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI think the Hollywood idea is a bit of a stretch, but I love the idea.\n\r\nThere's a strange mood to this song. \n\r\nAs to the person screaming at the end of the song, I've listened very carefully, and I don't hear it, Stone Free.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI agree with sammohung999.. the beginning paints a picture of faint, ancient radio signals roaming through the stars (dismembered contellations). The \"thin\" voice at the beginning fits here.\n\r\nI also think it's\r\n\"beyond the suns that guard this roost\"\r\ninstead of \r\nbeyond the suns that guard this roof\"\r\nnot sure if that matters though *g*\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI liked halfbaked's meaning. I see where you're coming from.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThe ancient radiation could be refering to the signal or \"echo\" that scientists have discovered that came from the big bang (theoreticaly).  That could be a metaphor for some big change or another that haunts the \"dismembered constallations\", or the people who were effected by it.  \n\r\nSo I'm kind of in agreeance with most of the people, it has to do with the past and not being able to forget about it while the modern media takes advantage of us.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nright on goodrope! i like that\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI remember being over at my friend's house, watching The Sopranos, and hearing this song and just freaking out. This is probably my favorite Cake song. And I sure do like Cake. Sure do.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\ni think its about society and how future trends always replace the greatness of the past. Frank Sinatra, a classic, is an ancient radiation. he is sometimes heard on the radio these days, but hardly ever. he has almost been forgotten. his air-time is almost as insignificant as static. \n\r\nand to add onto what sandman930 said about \"the ancient radiation that haunts dismembered constellations is a refrence to old stars dying,\" the stars dying are a direct reference back to Frank Sinatra, an old music Star. The \"ancient radiation\" occurs everytime an old song like his is played, reverberating legends like Frank.\n\r\nonto the old man, he saves all the memorabilia of the past, that everyone else has already \"thrown away.\" To him, these items are collectors. He thinks he will be rich someday when the Stars (frank and others) become popular again. The man's hopefullness and optimism is contrasted with the song's overall sense of despair.\n\r\ni think that's all i can say about the song for now\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI think Vengance's meaning is the most accurate. I know what he's talking about. Quasars are small stars that were believed to be the, how do I say this, ancient stars or the first stars that were formed in the universe. So, I can understand how he got quasars from \"ancient radiation\" and quasars to be like a series of flickering radio waves. Good thinking, Vengance!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nancient radiation... dismembered constellations... radio station...\n\r\nThat portion of the lyrics always painted the following scene in my mind:\n\r\nThe old, outdated radio station tower, possibly now defunct, blocking out a portion of the stars on the skyline, thus \"dismembering\" constellations.  Perhaps there is still a lonely old soul who can still hear the broadcasting of Sinatra?\n\r\nJust a thought.  There are some good ideas here, though, and this song is awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThis song is about love. \r\n\"Ancient Radiation\" the idea of love\r\n\"dismembered constellations.\" representing people\r\n\"radio station\" is being in love.\r\nFrank Sinatra was a god with women, he represents that even he couldn't make love work. \n\r\nSpiders and flies getting together represents people getting along after break up out of love. The cobwebs representing tainted relationships.\n\r\nThe verse after the first chorus about \"beyond\" the first three lines are a man telling a woman that she needs to give up the \"you don't love me!\" \"I am a woman hear me roar!\" where this man is just a simple man. He only really ever wanted love in his life. \n\r\nSaving what others throw away represent all the positive memories he's had with his lovers. They've all moved on and found that \"life\" they were searching for where he is still sitting collecting love, that is his life.\n\r\nThat's what I heard when I listened to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\ni agree with Vengance's interpretation. and i also hear the screams, whoever sed that.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nFirst, it isn't the \"suns that guard this roof\" but \"sons that guard this roof.\"  And, its about the mob.  Particularly an old mob boss. :) maybe.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nYea it's definitely \"roost\" not roof\n\r\nAnd no it's not about love either.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI think I can shed some light on the first stanza.  The Cosmic Background Radiation, which was found by Penzias and Wilson at Bell Labs while testing a new powerful radio telescope, is the \"ancient radiation\".  They won a Nobel Prize for this. \n\r\nLight is a form of electromagnetic radiation, as are x-rays, radio waves, gamma waves, infrared rays, and ultraviolet rays.  They are all the same thing with different wavelengths.  As light moves away from an observer quickly its wavelengths are lengthened, or 'red-shifted'.  Light that is very red shifted becomes infrared, and finally a radio wave.  The Cosmic Background Radiation is the light left over from the Big Bang that has been red-shifted to the extreme, as it has been traveling at the speed of light almost directly away from us since the beginning of time.  The \"dismembered constellations\" is certainly a reference to this event and/or the galaxy formation/destruction brought about by it. \n\r\nNow that would mean that this \"radio station\" has been playing since the light had been 'red shifted' to a radio wave.  This would take some time, but given the approximate age of the universe of around 12 billion years, it could easily be half of that.  Have you heard the idea that if a huge group of monkeys typed away on typewriters for millions of years by sheer chance one of them would manage to pound out a Shakespearean sonnet?  Well, what if the radio station played more or less a random signal for 6 billion years?  Wouldn't \"Stormy Weather\" by Frank Sinatra have to be played at least once?  Now at this wonderful time when everything comes together and clicks and all is in harmony in the universe wouldn't the flies and spiders get along together?\n\r\nI think in the end that's what the song is about.  We only have the short amount of time that we have been given so enjoy every moment.\r\nwe know of an ancient radiation.\r\nthat haunts dismembered constellations,\r\na faintly glimmering radio station.\r\nwhile frank sinatra sings stormy weather,\r\nthe flies and spiders get along together,\r\ncobwebs fall on an old skipping record.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nDefinitely about delapidation.  I think it describes a single subject, but is about a general idea.  The vaguely dark tone of the song also hints at this.  The first 3 lines (ancient radiation) quite possibly refer to radio waves in one way or the other, as many have said already.  However I think the radiation could be the ambience of a room inhabited by a depricated hermit-type; like the erieness of the home of someone who is no longer able to keep up with the world.  The person whose life is reduced to collecting worthless crap, antiques and such.  That ambience sort of haunts the room.  The faintly glimmering radio station is the memories of this man, who was in his prime when frank sinatra was popular.  These faint memories are all he has left, and continously play in his head.\n\r\nThe next 3 lines describe a run-down environment.  The skipping record is a common theme found in movies, and usually indicates someone is dead.  Perhaps in this case, dead inside.\n\r\nThe next 3 lines (\"beyond the suns...\") refer to the location of the reality this man lives in: outside of the mainstream world.\n\r\nAnd then the final four lines, which confirm what the previous lines were leading up to: it is, in fact, about delapidation, inability to be part of society, perhaps even senility.\n\r\nAlso, in the last minute of the song (during the musical part) you can hear screaming in the background.\n\r\nIt's a sad song.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI think that the song is about how back in older times, ie. when frank sinatra was a star, things were so much simpler.\r\n\"beyond the suns that guard this roof,\r\nbeyond your flowers of flaming truths,\r\nbeyond your latest ad campaigns,\"- this is saying that nowadays all music has become about spreading the truth...\r\nHowever the next line-\r\n\"an old man sits collecting stamps\r\nin a room all filled with chinese lamps.\r\nhe saves what others throw away.\r\nhe says that he'll be rich some day\" \r\nIs saying that peoples old ideals (music being about love and entertainment over truth and pain) reflects whats wrong witht he world these days...\r\nThe \"old man\" is stuck in the past...\r\nholding onto ideals that are no longer applicable..\r\nbut you will be a richer person by having these ideals...\r\nbecause of course, as a nation as we have become more and more obsessed with knowledge we have become more greedy and evil.\n\r\n\"we know of an ancient radiation\r\nthat haunts dismembered constellations,\r\na faintly glimmering radio station.\"\r\nWe remember the old ways but we are too far from them now to appreciate them...\n\r\n\"while frank sinatra sings stormy weather,\r\nthe flies and spiders get along together,\r\ncobwebs fall on an old skipping record.\"\r\nIn older times everything worked, and the world turned... but now that ideal has gone, and we are left to deal with the truth that we wanted so badly...\n\r\nI think the song is just about how amazing life must have been in the past, when al your music was spreading the words of love etc...\r\nBut that the world isnt like that today... \n\r\nThats what i got from it...\r\nsorry im not very good at expressing my ideas haha\n\r\nxxx\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nwell this song is confusing from forgotten radiations to a man basically listning to stor\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nwell this song is confusing from forgotten radiations to a man basically listning to stor\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nwell this song is confusing it goes from forgotten radiation to frank sinatras stormy weather toa man in a china shop well there is supposed to be large amounts of radiation leftover from the big bang or some type of major accurance. well ne ways the constellations are also  not the same as they wer in the day of rome and greece for all u who base thier life on the signs  and back to the radiation  im pretty sur they wer picked up in a radio station. ok that was me the realist now heres what i think i can try to explain all of  second part i believe the first line describes the american flag as suns beyond are roof or wat ever and that this second part is just telling us to look past all this crap in todays society  n maybe look at how it was be more optimistic then we r today or maybe not but i really do  think its telling us just to glimpse into the past i really dont no mwhy\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\ni totally love this song! like my new favorite ever. even though im having the hardest time understanding what theyre talking about. some interesting ideas on here...\n\n\r\n@stone free: \"Is it just me, or is there some reeeeally faint screaming while the trumpet plays in the last minute or so of the song? \"\n\r\ni totally hear the screams! pretty quiet and just a couple of times, but definately there\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI think that most all of you are just taking this way to much at face value.  Where Cake writes for it to be interpreted as such, they leave much else up to opinion, to make you think.  I am not quite sure on my own beliefs so far, I am going to listen to in a few more times, and analyze it some more, then I will let you know.\r\nI will say that so far I agree with \"halfbaked\" and \"bobwronski\".\n\r\nI will let you know shortly.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\ni think this is simply about the last glimpse of an old generation dying off to something that we no longer appreciate but still haunts the air around us\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis is starting to feel like a dystopian, almost post-apocalyptic future... As the \"ancient radiation\" of radio waves blasts Frank Sinatra across the galaxy, the remnant of mankind (the old man in the room) deludes himself by collecting, and holding on to, things from his past. I'm getting a sense of scale, which makes the world feel small and desolate.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nIt seems to relate with the american revolution.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nThis is absolutely my favorite cake song. I have seen at least 10 different theories on what this song could mean, all of them wonderful.\n\n\n", "comment_54": "\n0:54\r\nright when he sais \"beyond\" i get chills down my spine, it catches me off guard every single time. this is one of the first cake songs that i really got in to.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI'm probably wrong, seeing as what everyone else has said, but i see this song as a elderly man who befriends a middle aged suicidal woman.\r\nThe mans life is empty, and everyone has abandoned him.\r\nBut, he finds this lady (by means i'm not sure) and she plans to bring her life to a close...\r\nThe wold has given up on her, abandoned her as a lost cause and left her to her will, the only thing that keeps her to this world is her new friend.\r\n\"an old man sits collecting stamps\" From letters they send to each-other, he hangs onto these mementos to know somebody cares.\r\n\"he saves what others throw away\" Obviously, this would be his friend, that the world has abandoned\r\n\"he says that he'll be rich some day\" Meaning, his life will be full, when it comes to a end due to old age.\r\n\"the flies and spiders get along together,cobwebs fall on an old skipping record\" This would be, the thought that someone trapped in a world where they may feel unlovable, can escape and smile.\r\n\"we know of an ancient radiation,that haunts dismembered constellations\" The radiation being a horrible, dark feeling inside the woman. And the constellations are stars, once bright with hope, torn down to all that can remain\r\n\"a faintly glimmering radio station\" Would be that last beacon of hope, the music, that one smile...\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis forum seems to be filled with a lot of depressed folk it seem.\r\nDon't confuse the song's tone with the song's lyrics, especially with Cake.\r\nLook at the song Pentagram if you don't know what I'm talking about.\r\nToo many people are looking at single words from phrases and convoluting stories about old men or Hollywoodization or whatever garbage their brains generally fixate to without actually considering the song itself.\n\r\nHowever, the song is about LEGACY.\r\nThe song is about how although things are dead, they will live on in one form or another.\n\n\n\n\r\n          we know of an ancient radiation.\r\n          that haunts dismembered constellations,\r\n          a faintly glimmering radio station.\n\n\r\nTrue. We do know of an ancient radiation that haunts dismembered contellations. Dismembered constellations->constellations missing their old stars->dead stars.\r\nDead stars emit radiation forever and ever into infinity.\n\n\r\n          while frank sinatra sings stormy weather,\n\n\r\nFrank Sinatra, although dead and rotting in the earth, is still listened to worldwide.\n\n\r\n       the flies and spiders get along together,\r\n       cobwebs fall on an old skipping record.\n\r\nThe dead flies grant the spiders life.\r\nThe cobwebs are just a device to bring the lyrics around full circle. A bridge to the old man seen later in the song.\n\n\r\n          beyond the suns that guard this roof,\n\n\r\nAlthough perhaps unseen by infinite reaches(sunS not sun)\n\n\r\n          beyond your flowers of flaming truths,\r\n          beyond your latest ad campaigns,\n\n\r\nThis is the only part I'm a bit off on, not 100% sure on it. Still has the feel of \"Legacy\" as many truths as well as ad campaigns are unforgettable.\n\n\r\n          an old man sits collecting stamps\n\n\r\nPretty much a no-brainer. Stamp collecting creates a legacy to give to children or even to sell.\n\n\r\n          in a room all filled with chinese lamps.\r\n          he saves what others throw away.\r\n          he says that he'll be rich some day.\n\n\r\nOld things being repurposed, each old useless item earning its own legacy.\n\n\n", "comment_57": "\nMusic is used as a medium between the artist and the listener, and music can inspire people to do or be anything when it strikes our various emotions and can influence any number of actions and events. Math is the universal language, but maybe music is important on that kind of level as well because it's being transmitted into space.\n\r\nMaybe the only things we can take away from Earth and apply to other civilizations as means of communication in space is Math and Music?\n\n\n\n\n\n", "comment_58": "\nI believe that this song is a reflection on history.  As a huge history geek (and hopefully future teacher of classics) it always gives me chills.  The old man sitting collecting stamps and saving what others throw away is a man trying to hold onto the dead past which he still belongs to, despite time marching forward.  But at the same time I don't think the song is as sad as most people seem to think.  Although it seems to lament the passing of time, at the same time it seems to be a respectful if slightly melancholy tribute to it.  For that reason this song is and always will be one of my favorites.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nAnd as for the Frank Sinatra reference, it signifies two things.  It mentions Frank Sinatra as he is such a powerful symbol of the past I mentioned in the last comment, thus the flies and spiders get along together.  It symbolizes the harmony of society of the past.  But at the same time, \"Stormy Weather\" is an extremely melancholy song.  So as the song plays, it is still able to bring to mind the harmony and happiness of that time, but it has the melancholy aspect of the fact that it's all gone now.  This ties into the faintly glimmering radio station.  It represents a last vestige of the time, a faint memory, glimmering quietly in the darkness.  \t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\ni think its about how people that are well off get to caught up in their lives (beyond the suns that guard this roof,beyond your flowers of flaming truth,beyond your latest ad campaigns)to notice that in other parts of the world that those people dont think of or care about (we know of an ancient radiation, that haunts dismembered constellations)that there are people that are just scraping by (he saves what others throw away, he says that he'll be rich some day)thats just my theory \t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\neven though we fight we get along at some point in our lives that is the message in the flies and spiders part. Ive pissed off people but did they always hate me no,just currently\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nGuys, the \"faint screaming\" you hear...? Cake does this all the time in every song-- there's always a guy doing that, saying things, and going \"Woah!\" That has nothing to do with the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nIt's talking about a person who still uses old ways\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nNot sure if it is self evident to everyone else, but from reading through the different interpretations, I thought that maybe the cob webs are falling because the spiders have no use for it, as they are no longer catching flies with it.  \n\nI do think, like others have mentioned, that the cob webs are representing old age and places that no longer receive attention and maintenance (places left behind).  \n\nMaybe the old record is skipping because the old man is either senile or has died while listening to the record?  I don't think this is the case.  I think it is more symbolic of another meaning as some have mentioned.  Perhaps there are multiple meanings at the same time.\n\nI like all of the ideas, but still haven't put together what I feel is the intended meaning (if there is one at all).  The meanings that make most sense are the ones dealing with love, specifically about the \"Stormy Weather\" song meaning being correlated to the overall theme of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nANY CAKE FANS STILL OUT THERE??\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nI haven't heard the song yet, but I think I'll download it. Cake is a pretty cool band. They really have pretty much their own style.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nNot sure what it is about, don't care - I could just listen to the first 15 seconds or so over and over and over...\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nCouldn't it be about God?\r\nYou can imagine a bed bathed by the Sun and its meaningless in the cosmo getting zoom out. Then it goes behind the flowers of flaming truth (the stars in the sky, like a garden), where a old man stand, watching over the people, collecting our trash (as he collect our daily activities, completelly meaningless for us but amazing for him, like a person who observes a ant society glass). 'He says that he'll be rich someday' is just an irony, saying that even the allmight fucking God is poor, lost in the trash he collect trying to give a reason to life.\r\nMaybe the Frank Sinatra singing means that God is just there listening to 'the best singer' that he could find, don't minding that he is in the past, as for God time doesn't exist or doesn't have much importance\r\nThe ancient radiation would be the light coming from the most external stars of the Universe, that pass through galaxies already gone or dismantled, until it reach us, so weak after all that way as a faded radio wave. Beyond all that is the old man sitting XD\r\nThe flies and cobwebs over the record is either the representation of one of the trash we produce that amaze God, or either on the God's house itself. After trillion years, how would God be? Entusiastic with everything, cleaning and singing as someone that bought a house 1 week ago, or like a ancient highlander that already saw everything and is hardly amuzed?\r\nWhat would be the Chinese lamps I have no idea, however \t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI think that this song is about fallout. first off the ancient radiation is the radiation that has been every where for years! The faintly glimmering radio station is GNR, an in game radio station that is having some problems transmitting its broadcast. \n\r\nWhile \"Stormy Weather\" is not in the soundtrack, all of the sound track is music from that time. The Flies and Spiders getting along might be enemies having to work together to survive in the wastelands. The \"Flower of Flaming Truth\" could be the HELIOS ONE a solar farm that can be used as a death ray, owned by a group of people trying to get order back to the wasteland. The last part is the most obvious part. The main character is the old man, long after he has completed the game. Now he just collects thing to sell later.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nTEST\ngoalsbymessi.blogspot.com/\">Visit Goals By Messi\t\t\t\t\n\t\t\t\t\n\n"}