{"comment_0": "\nHalsey has bipolar disorder. She was hospitalized for a suicide attempt that was caused by it when she was 17. Though the term \"insane\" is completely unacceptable when referring to someone with a mental illness, that is the way we are seen by outsiders (I have the disorder myself). It is very difficult when we are on the depressed end of our condition. Impulsiveness is a signifier of a manic episode the other \"pole\" of the disorder: buying an expensive bottle of booze just to pour it down the drain in the moment she regrets it and using the money that should've gone to her water bill to make herself feel better about the situation. \n\nManic episodes are referred to as \"highs\" and depressive states are referred to as \"lows\" by professionals, least by all the ones I've seen. Manic states can be really exhilarating. Most people prefer them because you feel invincible; you're far happier than your are at your your baseline (\"normal\" mood state); it feels so good that some people do not seek treatment when they are in the state. The down side is the depressive state that always follows it is debilitating. The line \"are you high enough without the Mary Jane like me?\", she can get \"high\", the euphoric way people hope to feel when they take drugs, without taking them because of her condition. \n\nSelf-deprivating humor is a very common coping mechanism. I do it myself. It makes it easier to explain the way you are feeling without coming on too strong. People respond well to it, even finding it funny if you're particularly good at it. Thus the line, \"Do you tear yourself apart to entertain like me?\" \n\nWhen you reveal that you're bipolar, people most definitely look at you differently. My parents told me not to tell people for this very reason. They think people will be afraid of me because of the misconceptions that surround the disorder. Halsey is open about her condition, which people like us find really comforting because it tells us we're not alone, but it does add a lot of pressure and detour people from hopping onto her popularity team. Her line, \"Do the people whisper 'bout you on the train like me?\" is a perfect description of this. \n\nIt is really hard to reveal what you struggle with. People on the outside put in their two cents. They believe people like us should look \"crazy\" and \"act\" it at all times. She's gorgeous. People think she shouldn't \"waste a pretty face\" like hers by letting them know she's not perfect because she's pretty. \n\nSome people see us as less than people. \"And all the people say\nYou can't wake up, this is not a dream\nYou're part of a machine, you are not a human being\". And once you let something like that out, you can't go back or make it all go away. \n\nBeing so ostracized or knowing that you will be if reveal a large portion of yourself does take a lot out of your self-esteem. Someone as pretty as her and who is a public figure is assumed to have a never ending supply of self esteem. \"With your face all made up, living on a screen\nLow on self esteem, so you run on gasoline\"\n\n\"I think there's a flaw in my code\nThese voices won't leave me alone\nWell my heart is gold and my hands are cold\". It is not know exactly what causes the disorder. You can't take an x-ray or have your blood drawn to know that you have it, so you're left to assume their inherently something wrong with you, but you can't put your finger on it. The voices aren't literal. They are the \"voices\" that tell us we're not good enough or will never amount to anything, the same ones that can convince us to kill ourselves. \n\nLuckily, she knows she is more than her disorder. \"Well my heart is gold and my hands are cold\"\n\nShe's asking if other people deal with the same things she does. \"Are you deranged like me?\nAre you strange like me?\nLighting matches just to swallow up the flame like me?\nDo you call yourself a fucking hurricane like me?\nPointing fingers cause you'll never take the blame like me?\"\n\nI think this song is about her struggle with bipolar disorder. It's not an uplifting anthem, but she's painfully honest and that's her style. I really appreciate it and her for being so open. She truly helps people like us. Knowing she's using her voice for good is what keeps her going. She's said it in interviews. She says being on stage is the only time when everything melts away and she feels at peace with herself. \n\nSo yeah, meaning!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think this relates to at least 3 subjects: 1st one being someone who is a star or an artist, someone famous who cannot escape the public eye; they feel under a lot of pressure from society or the moral code and also they are told they are wasting their life by not taking enough advantage of their looks as it is expressed on this line: \"Do the people whisper 'bout you on the train like me?\nSaying that you shouldn't waste your pretty face like me?\"  and also this one \"You can't wake up, this is not a dream - basically refering to the life they live as a star,\n\"You're part of a machine, you are not a human being\", the machine being part of the media, with their \"face\" all made up, living on a screen\" 2nd one is someone who lives in a city under lots of stress and has some sort of mental disorder a \"flaw in her code\" because of this disease *the voices that speak in her head won't leave her alone*, 3rd focused on the modern type of life (living on the screen with the social media, again related to the being known by everyone, the voices that speak the people judging her. Just my take on it :)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think it's about someone who has said that I understand what you're going through and she responds with no you don't understand because no one does understand what she is going through she asks things like \"are you deranged like me?\" Which suggests that no one can relate her because she is a sociopath who isn't in control of her emotions \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think this song is about society and how most people portray others to be perfect. However, most people are far from perfect. Some people are strange, insane, but the important thing about this song is how we all think we are strange however we are all act the same way and are imperfect and they are rebelling the 'perfect person'  which indicates the lines ' the voices in my head won't leave me alone'. The lines I think there's a 'flaw in my code' also talks about how when you're different, people think you are nothing because you aren't perfect and you're different and  'strange' but there is no such thing as a perfect person and we all go through the same shit and we're all fucking hurricanes.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think this also is pointing out the fact that everyone is being the same these days. They all look the same, act the same, post the same things. People will do anything to be known and heard. That's why she sings, You can't wake up, this is not a dream\r\nYou're part of a machine, you are not a human being\r\nWith your face all made up, living on a screen\r\nLow on self esteem, so you run on gasoline\"\r\nWe all have such low self esteem that we follow others like a machine. Always the same. And when she says,\"Lighting matches just to swallow up the flame like me?,\" she's trying to say, by being different she's breaking the machine, the trend, and taking the backlash in like a queen. Because she's different, she sets a new normal. Your own normal. There isn't a fault in her code, its a virus that's gonna break trend and make people them themselves again.\t\t\t\t\n\t\t\t\t\n\n"}