{"comment_0": "\njohn said whenever paul sang that part \"get back to where you once belonged\" he would look at yoko. you know to me, in some ways, this ogn is about john and yoko. or maybe i'm letting my imagination get to me. i feel like it's paul's cry for john to stay with the beatles and also paul saying to yoko stay away from john and leave them and the beatles alone.\n\r\njojo is john and loretta is yoko. jojo left his home(the beatles)..for some california grass(this i dunno but i just took a wild guess he went with yoko and then him and yoko were arrested for having pot)\n\r\nthen paul says \"get back\" to both \"jojo\" and \"loretta.\" telling \"jojo\" to stay home with the beatles...\"where he once belonged.\" then telling \"loretta\" to go back wherever she came from.\n\r\nalso in loretta's part. it says \"all the girls around her said she's got it coming. but she gets it while she can\" maybe saying yoko's friends are like \"you're gonna get in trouble if you go with john\"...but she goes with john anyway. she gets him while she can?\n\r\nlol, no one said this is bout john and yoko i just thought of it before.\n\r\nbut anyway, awesome song\n\n\n\n", "comment_1": "\nAfter listening to this sound 50,000 times over the course of my life, it occurred to me recently that this is Paul's attempt at a Lou Reed-type song -- colorful characters with sex and drug hangups going through interesting journeys. Compare the lyrics here to \"Take a Walk on the Wild Side.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI like ther version on the Let It Be album...at the end john says \"thank you very much on behalf of the band and i hope we passed the audition\".\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWell in actual fact Jo Jo was in reference to John Lennons driver Joe ,Loretta Martin was the telephone operator at Apple.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song is about Paul's little stab at Foreigners and their insane immigration patterns, he was pissed, but made a funny song out of it, \r\nHow someone can say this is a bad one, I dont know,\r\nThis is a great song by paul, some lyrics by george and john too\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThere's one line in this song that I REALLY don't understand:\n\r\n\"Sweet Loretta Martin thought she was a woman\r\nBut she was another man\"\n\r\nCan someone please explain at the very least what they think it means?\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI just read last night an interview with John, and he said that everytime Paul would sing the line \"Get back to where you once belonged \" He would sing it at Yoko when she was in the studio.\n\r\nCool little fact I thought :P\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nfor freethegoldfish, i think  these lines refer to a woman who is in business world with men and playing by the rules of men. she thinks she is a woman but has become a part of a masquline world-she is another man.she may be working hard to''get it while she can'get back may mean to be a woman again with high heel shoes and low neck sweaters-something she cant wear at work.\r\ni may be wrong,though.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nLet it Be was originally gonna be called Get Back, Paul wanted the Beatles to Get Back to their roots (rock & roll), so that the fighting between the band members would stop.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nJo-Jo was Linda McCartney's exhusband Joe See...they used to live in Tucson and John left for S. Africa...new grass is basically saying he was looking for new land and that Paul didn't want him coming back. Loretta Martin could be Yoko we all know they didn't get along\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nmccartney wasn't making a stab at immigrants. the song is actually a response to the anti-immigrant movement that was taking place at the time in England (anti-immgrant and deportation laws were being passed at an alarming rate). He originally wrote a more literal song about the issue, but made the lyrics more obscure so as to not stir up trouble with the government. probably because of a few of the band members recent drug charges.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nOMG!! msrmx350--you actually think Paul died?? I have been reading stuff about that and it is just ridiculous! (in my opinion), but I would be interested in hearing what you think happened. And as for the song, I like the way Paul says Get Back with it sort of lifting at the end like back off in a sort of I'm not dealing with you, just go away sort of way. And I find it really interesting that it could be directed at Yoko. I believe it,\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nBy the way \"Death Cab for Cutie\" named their band after a variant of the \"Paul is dead\" myth, in which the unfortunate Beatle dies in a Taxi.  Oh, and of course Paul himself would be the \"Cutie\".\n\r\nI gotta go - I'm having way to much fun with this silly stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nummm... Death Cab for Cutie was named after a song performed in the \"Magical Mystery Tour\" film. It was called \"Death Cab for Cutie\" and was performed by Bonzo Dog Doo Dah Band.\n\r\nGet Back is my favorite song in the whole world right now. It's so upbeat and happy.\n\r\nAlso, there was a verse that was left out because it was too racially tense.\n\r\n\"Meanwhile back at home too many Pakistanis,\r\nLiving in a council flat\r\nCandidate Macmillan, tell us what your plan is,\r\nWon't you tell us where it's at\"\n\r\nAnd yes, the California grass is speaking of marijuana. The boys were quoted as saying that any song with the word grass in it was a reference to pot as well as the song \"Got To Get You Into My Life.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ncould be about the beatles dropping the psychadelia element of their music and stripping down their sound. in the record Let It Be, it could be the beatles \"getting back to where they once belonged\" \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI think JoJo is Joseph See, Linda McCartney's first husband.  They were both from Tuscon, Arizona, where they lived with Heather until he left them to go to Africa.  This was written around the time Paul adopted Heather and I bet he wanted Joseph to stay out of the picture.\n\r\nI think Loretta is Yoko.  John Lennon reportedly told Yoko he liked her because she looked like a guy in drag.  So:\n\r\nweet Loretta Martin thought she was a woman\r\nBut she was another man\n\r\nAnd undoubtedly, Yoko imposed in the Beatles dynamic and Paul wanted her to get back to where she once belonged!   \t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nMcCartney: When we were doing Let It Be, there were a couple of verses to â\u0080\u009cGet Backâ\u0080\u009d which were actually not racist at all - they were anti-racist. There were a lot of stories in the newspapers then about Pakistanis crowding out flats - you know, living 16 to a room or whatever. So in one of the verses of â\u0080\u009cGet Back,â\u0080\u009d which we were making up on the set of Let It Be, one of the outtakes has something about â\u0080\u0098too many Pakistanis living in a council flatâ\u0080\u0099 - thatâ\u0080\u0099s the line. Which to me was actually talking out against overcrowding for Pakistanisâ\u0080¦ If there was any group that was not racist, it was the Beatles. I mean, all our favourite people were always black. We were kind of the first people to open international eyes, in a way, to Motown.\n\r\nMcCartney: Many people have since claimed to be the Jo Jo and theyâ\u0080\u0099re not, let me put that straight! I had no particular person in mind, again it was a fictional character, half man, half woman, all very ambiguous. I often left things ambiguous, I like doing that in my songs.\n\r\nLennon: Yes, I played the solo on â\u0080\u009cGet Back.â\u0080\u009d When Paul was feeling kindly, he would give me a solo! Maybe if he was feeling guilty that he had most of the a-side or something, he would give me a solo. And I played the solo on that.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI thought it was about telling flamboyant men to get back in the closet\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nJust a generic 60's song about pot smokers and transexuals . Awesome song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nNow that was a really good idea. Singing this great song from the top of their record company in the middle of Liverpool. The Beatles still ROCK!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI like this song. I kinda get what you're saying about John and Yoko. The California Grass part is to me not about Pot but like How Grass is always greener on the other side... You know look at where Jojo is from... Tuscon, Arizona. My friend moved there and sent photos and her yard is made of clay not grass... so you know. This song is about you gotta stay where you come from cuz your home will make the most influence on you...\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nEr... \"themancky\", the Beatles' Apple Corps HQ wasn't in Liverpool - they'd all moved to London years earlier! No, it was in the very conservative and upmarket bespoke tailoring district of London's Savile Row. I can imagine all the \"City Gents\" getting their suits made and complaining about the noise from the rooftop.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nActually, Tommy, this was the second to last album The Beatles made. Abbey Road being the final one. Let It Be was just released last.\n\r\nThat being said, I don't think Paul wrote this song about Yoko, but I do believe that when they were recording it he had her in mind. Even when you wrote the song, your interpretations of it will change eventually. And I think that after being couped up in that studio for as long as they were, tensions are sure to rise between everyone, especially if your bandmate insists on dragging his wife everywhere with him.\n\r\nAs to what he meant when he wrote the song, I haven't a clue. God only knows what they were thinking with some of these songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI always thought this song was partially about the \"back to the land\" movement that was fairly prevailent in the 60s and 70s. I know this song was written around the time my mother moved up to Maine from Massechusetts for the very same reason to \"get back to the land\" with her (now) ex-husband. I may be incorrect, but this movement became especially prevailent around the late 60s because everyone was so tired of the social strife and just wanted to live a life of peace in the country.\n\r\nFurthermore, generally, it's more about getting back to your roots.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nTHe reference to Jo Jo is actually talking about a guy who was studying aat an Indian temple place at the same time as John Lenon. Apparently, every morning when John went into the kitchen to make his breakfast, Jo Jo would be in there, and John would have to wait, hence the \"get back\".\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nNow something about me is that I always take things literally, I don't look at a ton of songs and say that almost every single rock songs has a hidden meaning about sex, or drugs, or death.  \n\r\nBut I have to ask, if the part about California grass has to do with drugs, and not leaving his home to a non-desert enviornment, why go to California?  Arizona has a nice, long border along Mexico (for any drug smugglers) and it's not like you can't grow pot in a desert environment.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI don't know really, I just like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI love this song. I love at the beginning in Let It Be where I think its John (?) sings a short parody of the song:\r\nSweet Loretta fart\r\nShe thought she was a cleaner\r\nBut she was a frying pan\n\r\nIm not sure why i like that so much- maybe its just because Its not really expected there.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI have no idea what I was babbling about earlier.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nA brutal swipe at YOKO no doubt about it.\n\r\nJojo = yoko.\n\n\r\nFact is at this point john was on a constant acid trip so he could barely tie his shoes.\n\r\nstill a great song, but down right mean.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThe parody is in fact sung by John.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nim told that this song is about transvestites. i mean it makes sense.\n\r\n\"Sweet Loretta Martin thought she was a woman\r\nBut she was another man\"\n\r\ni could be wrong, and i could just be taking the literal meaning while there could be some thought provoking sublimal meaning that im missing. but hey, you never know. eitherway, the beatles are amazing to say the least.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nWow, I've watched the let it be motion picture, and I think Mr. Lennon could tie his shoes just fine. Just more villification of Yoko by may here. Look, these guys were growing apart; if anything, John's behavior with her was a symptom, not a root cause of their struggles. I'm sure Paul doesn't see it that way, maybe not even today, but he was too close to be objective.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI said John went to S. Africa I meant Joe\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nWhen the chorus of this song is played backwards, it seems to become, \"I need some wheels. Help me! Help me! Help me!\", referring to Paul's car being totaled in the crash.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nthis is a great song.....I like the version on the Apple rooftop better than the studio version.......the guitars are better.......the video is great..I hate the fact that they had Yoko up there. I woulda pushed her off.....lol\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\ni think that the idea that it could be about john and yoko makes alot of since. but i dont know if its true or not. but great song !\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI think the Beatles were growing apart and that is a heavy thing if you are sharing a history. it is a last action to not fall apart. this song could be wrote by the beatles keeping this idea in mind and the verses aren't much deeper, they are just examples\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI think John suggesting that this was about Yoko was completely in his head, and he pretty much was paranoid which to be fair, you would be with how they were treated. But THIS, \"get back to where you once belong\" being about Yoko? Nah, I don't buy it. It's just a song about being out of your depth, in a place you don't belong. So many people were trying to make it out in the city or trying to be something they're not, which is what I think this song is about. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI thought it was about telling flamboyant men to get back in the closet\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI think this guy JoJo left his town to California and became a drag queen to Loretta.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nwell considering I have heard this damn song 100 million times, I never really stopped to think about it til the other day, but I think that the Beatles knew their band was over so they were saying to stop doing drugs, and clean up and stop \"farting\" around. Of course they couldn't.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nYes, (Joseph) Mel(ville) See was JoJo.  I met Mel in the '70's through a close friend who hung with some of  Tucson's \"A-list\" crowd, who all knew this about him.  Being a private guy, he'd asked Paul not to confirm this in interviews, etc., but he was flattered to be mentioned in the song.  I knew him for years.  I remember reading once that Heather McCartney was in Tucson to visit him, and a couple nights later I ran into him socially.  He invited me to a party and I declined.  Asked for my phone number, I again declined.  He really wasn't my type.  So he gave me *his* number and joked \"Don't worry if a woman with an accent answers; Heather's visiting from England.\"  There was no animosity about the adoption; Mel was having issues at the time and felt it was best for her.  He, Paul and Linda always remained good friends.  P & L had a ranch here, in fact, so were doing everything *but* avoiding Mel.  Linda chose to spend her final days there.\n\r\nI was tempted to call but never did, as I didn't want to be like other women he'd dated who were only interested in his connections,  I did hang onto the number for a while, but sadly, he committed suicide about two years after Linda died.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI always thought that JoJo and Loretta we're the same character. JoJo didn't want to be alone in his sexuality anymore so he moved from Arizona to a more liberal California where he can express himself as Loretta Martin. He became a cross dresser (possibly transgender) who got around. \t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI swear when I first saw the liner notes for this song, her name was was \"Sweet Loretta Modern\"\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThis song is about pot!  \"Jojo left his home in Tucson, Arizona \r\nFor some California Grass. \"\n\n\n\n", "comment_46": "\nthis is a good song. i just recently got into the beatles. im 13, so i never had any education about them. but looking aht theyre section here, it sickens me. sickens me that the Beatles dont even have have the comments left than Blink 182. on blink 182's song I Miss You, i think there was over 200 comments left. its just sad how idiotic kids cam be these days..\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI always thought this was an anti-immigration song to. I thought the original words were something like; \n\r\nMeanwhile back at home we don't want no Pakistanis \r\ntaking all the peoples jobs\r\nGet back...get back..get back to where you once belonged.\n\r\nI never heard the version about the council flat but I have definately heard McCartney talking about \r\npeoples jobs. Is it my ears? 10 mins on google should be enough to find my version.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nThis is a song about sex. When McCartney says 'Get back to where you belong' he means getting back to the womb, where, of course, he comes from.\t\t\t\t\n\t\t\t\t\n\n"}