{"comment_0": "\nWasn't really happy with the quality of comments on this one. This song isn't just about a breakup or a young girl he likes, it's really a critique of the behavior of women (esp young, immature girls).\n\nBite your face to spite your nose\n17 and a half years old\n\nHe's talking about her general tendancy to act spontaneously or seemingly irrationally. She'll do things that aren't good for her to satiate immediate feelings etc. He then moves into a conversation between her and him as they are hooking up. He's trying to convince her to go further.\n\nGirl:\nI'm worrying about my brother finding out\nBoy:\nWhatâ\u0080\u0099s the fun in doing what you're told?\nGirl\"\nI said \"No!\"\n\nStandard girl behavior! She likes him but draws the line.\n\n'Oh give it a rest, I could persuade you\nI'm not your typical, stoned 18 year old\nGive me a night I'll make you'\n\nHis thoughts after she says no. She actually wants to hook up but he's tired of dealing with the bullshit and having to \"convince\" girls so they feel less guilty about it. He knows he could, but fuck it.\n\n\"I know you're looking for salvation in the secular age\nBut girl I'm not your savior\"\n\nHis verbal warning to her. He's not going to play these games and play into the BS. She's looking for a savior, and since she doesn't have religion she's looking to him. This is true for a lot of young people today- they expect too much from relationships. You make you happy, not someone outside of you.\n\nWrestle to the ground\nGod help me now because\n\nEventually they get around to it and get it on. God help him- he's getting caught up in the sexy intoxication of it all.\n\nThey're just girls breaking hearts\nEyes bright, uptight, just girls\nBut she can't be what you need if she's 17\nThey're just girls\nThey're just girls\n\n...and he's reminding himself not to get too caught up, because in the end they're just girls.\n\nA pair of frozen hands to hold\nOh she's so southern so she feels the cold\n\nI think this is a reference to her looking for a relationship in him when it's just not there. She feels the warmth isn't there but is still holding onto the idea of it.\n\nOne moment I was tearing off your blouse\nNow you're living in my house\nWhat happened to just messing around?\n\nSlowly she eeks her way more and more into his life as a gf, even though that's not what he wanted, and he told her that. She still thinks he'll change his mind.\n\nI said \"Yo, I think I better go, I can't take you\nYou just sit and get stoned with 30 year olds and you think you've made it\"\n\nHe leaves because she's making it serious and he doesn't want to. He then moves onto a critique of how she's spending her time. She's young and hot and is getting attention from all the 30 year old men that are successful. This makes her feel good and like she's important.\n\n'Well, shouldn't you be fucking with somebody your age instead of making changes?'\n\nHe cautions her to not get too caught up in all that. Instead he thinks she should be enjoying her youth and possibly spend it building a relationship with someone her age, rather than being used for her youth by an older man.\n\nWrestle to the ground\nGod help me now because\n\nSex again.\n\nThey're just girls breaking hearts\nEyes bright, uptight, just girls\nBut she can't be what you need if she's 17\n\nshe's immature, she can't fill his needs either.\n\nThey're just girls\nThey're just girls\n\nI told her from the start\nDestined to be hard\nI told her from the start\nIâ\u0080\u0099ll break your heart\nDestined to be hard\nBreak your heart\n\nHe told her what he was but she kept ignoring him or thinking she could change his mind.\n\nThe rest is pretty much repeat.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nso shocked this doesn't have any comments seeing as this is probably the 1975's best song. i think on the surface matthew wrote the song to come across as if he doesn't really care about the girl in question. he needs a distraction and this younger girl is exciting and dangerous because it's breaking the rules. however he's also trying to persuade himself that he doesn't care \"they're just girls\" but he can't help but feel something deeper for her. however she wants to be with him and that scares him because he just wanted to \"mess around\" so he tries to leave her. but she keeps him coming back \"wrestle to the ground, god help me now\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think is about how vulnerable girls can be especially young girls. Teenage girls are becoming women experimenting with their surroundings and having boys taking advantage of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni think that this song demonstrates how people just want to mess around. and you a girl isn't going to fix because she's just a girl. she isn't what you need, and the idea of just fooling around is bette.r\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ncan't believe only 10 comments on this, is a great track and very well written.\n\nI think it is about a girl dumping him for an older guy and thinking hes cooler just because hes older.\n\nMark.\nteethgaps.co.uk\n\n\n", "comment_5": "\nFirst of all - weirdly obsessed with this song. \n\nSecond of all - I always heard \"they're just girls\" meaning she's just a girl, not a woman, i.e. very young (he does say \"eyes bright\", meaning young and naive).\n\nI guess the song is him saying he was hooking up with a young girl, but she, being young, took it as a relationship instead of just a hookup. He starts to get annoyed with her because she's clingy and she's acting like he's what she was looking for. But he realizes that she's just a young girl, and he needs to break it off.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nMy interpretation of this is that there's a 17 year old girl, that will be 18 in a few months. She flirting with the guy but the guy's brother said to stay away because she's too young seeing as the guys probably in his early 20's. Obviously he ignores his brother's advice.\n\r\nShe offers to have a one night stand or a short-lived fling, at first he doesn't want to because she's a stoned/drunk?/broken teenaged girl and he doesn't want to deal with her. He knows he shouldn't but he goes along with it and does the deed with her, multiple times. \n\r\nAfter a while he wants to end their fling because she's too much to handle and it was just a bit of fun anyway. He calls it off, breaking her heart but he said from the start that he was going to do that anyway. \n\r\nPersonally, I love the 1975 and this album is absolutely perfect. My boyfriend bought it for me for my birthday because I really like them and this is honestly one of the best tracks. Great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThere are many situations in this song. It's like a written contradiction. Since he says no to her, but yet he is just looking to fool around which goes against saying No to a partner. He is also saying that girls are only out to play games, \"Girls breaking hearts, etc..\" It's really difficult to put into an interpretation since it's a contracting song.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI am in my mid 30's and when I first heard this song, it hit me like a ton of bricks. I was a stupid 16 year old, when I basically was exactly the girl he refers to here. I thought I had met the love of my life. Older guy, really cool, cute as hell. Instead of brother, it was my father who earned him off me. I used sex as a tool to manipulate him time and time again. Although he could of said no. I would flirt with men if I saw him in a club or pub to make him jealous and this unhealthy circle of being together, him telling me I'm too young to know what love is, us splitting then sex and together again, still breaks my heart when I think back. He used to feel bad and spend a ton of money on me. He had money, although he could have been penniless, I would not have cared. It was so toxic. I still see him now and again, mainly in Asda of all places. He once said to a mutual friend, he will never have such a passionate relationship ever again, the physical side we were perfect. He also said I'd fucked his head up. I think we both fucked each others heads up. If I had been slightly older, we would probably have been married and divorced within a year. I was not stupid enough to stop taking contraception, although I so much wanted his child. I am married now, in a non toxic relationship. I've seen the world, made mistakes, learnt from them. I am finally a woman not a girl. Any girls reading this, take heed of my story. It took a long time for me to stop hating him. I do truly believe you have to have genuinely love someone to feel so much hatred for a person. I finally realised, there is no need to hate him. I'm grateful of the times in the relationship when could really talk and we did have some fun times. He has a wife and two children now. Apparently she is a really nice person. The kids are the spit of him. I'm just happy we both managed to move on. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nEveryone had great responses, but I find the dialogue in the song diffrent.\n\n\"I said no!\"\n I actually think that's the guy telling the girl to chill. Saying NO BISH we're not having sex.\n\"oh give it a rest. I can persuade you.\"\nThats the girl talking smiling at him all seductively trying to get him to do as hse pleases.\n\"I'm not your typical stoned 18 year old?\nThe guy trying to push her away.\n\"Give me a night I'll make you.\"\nThat's her being really nasty and telling him that. In that moment he can't resist. Despite how young she is. \n -Wrestle tot he ground-\nthey eventually get on the ground (if ya know what i mean)\n\"God help me now\"\nbefor eanything goes down he's like god help me now.\t\t\t\t\n\t\t\t\t\n\n"}