{"comment_0": "\nGod doesn't seem to be threatening or intimidating at all. \n\r\nIn fact I don't think God is even present. It's a satyrical criticism of small-town christianity. They ignore everything that is going on around them, thinking themselves so self-righteous because they have God. \n\r\nThe breeding 'all the kittens white' thing is clearly racial point. And they try to hide their prejudices by explaining that they 'have a woman for a mayor'.\n\r\nThe key to this song is the progression of the penultimate lines of each chorus: \r\n\"No cause to worry now\" shows a blind confidence.\r\n\"And noone's left in doubt\" suggests more that there is doubt.\r\n\"Any day now he'll come out\" getting a little bit panicky\r\n\"Oh I wish he would come out\" could they be on their knees 'as quiet as a mouse' for something that isn't there.\n\r\nIf they were not surrounded by all of this degradation and sin then how do they no about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nhm. i think it's a bit of both. it's a criticism, maybe not of God, or Christianity, but of christians and the church. they're so afraid of God and of, essentially, being human that they've basically made captives of themselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nOne of my fave Cave songs at the moment, and he played it last night in Brighton, and messed up the words going into the \"Zero crime and no fear\" line, but recovered beautifully and with humour, and so that those who didn't know the song probably wouldn't have realised at all, although it raised a few cheers and jeers from those who did know the song. \n\r\nI have always seen it as an indictment of the kind of small-minded Parish provincial England town that I'm from, where the inhabitants care more for their cats than they do fellow human beings, and I think the song is a description of the kind of \"Daily Mail mindset\" that often prevails in such towns, hence the sensational/provocative language used in dscribing the \"homos roaming the streets in packs\", as if they were wild animals, and the \"queerbashers with tyrejacks\", and the humourous \"lesbian counterattacks\" - it is a description of the shock tactics that papers like the Daily Mail, the Daily Express, and many other of the top-selling British newspapers use to control middle England, and it is beautifully written.\n\r\nThe song seems to be sung from the perspective of one such inhabitant of such a town, whose blind faith in the \"God in the House\" seems to be waning with each passing chorus, so that by the end he or she is wishing that He would come out, either to prove His existence, or perhaps it is Cave himself wishing He would come out to show His real power and teach these people what life should really be about - not fearing such sensationalist rubbish as is fed to them through the media, but actually trying to help their society, rather than hide away from it in their well lit little town. \n\r\nMuch of the lyrics are playful and humourous in their mocking of such towns, \"We have a tiny little Force, but we need them of course, for the kittens in the trees...\" and \"We have a pretty little square, we have a woman for a Mayor, our policy is firm but fair\", it's all wonderful stuff.  \n\r\nI think the \"We've bred all our kittens white\" line probably does have racial connotations, although that only occurred to me recently, when I was talking to my fiancee about this song. I had previously just thought it an example of the paranoia of such people, who would only keep white cats, as they would be safest and least likely to get run over in traffic. \n\r\nIf Cave is religious, and the article that another quoted is hardly concrete evidence to confirm that, he is still clearly poking fun at those who use religion as a thing to hide behind, as a place to hide away from real life, and from life's responsibilities. \n\r\nGod bless all the Americans who think this is a literal song about a pretty little God-fearing town! Ha!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI'm sure you'd like to think of it as a critical view of small-town Christianity, which is a subject that's been the victim of satire for quite some time by many who barely understand it, but you must take into account that Nick Cave is a Christian himself, although he doesn't believe in an interventionist's God.\n\ndir.salon.com/story/ent/feature/2004/11/18/cave/…\n\r\n^^ That should help if you need proof.\n\r\nAnyway, Christianity has gotten a bad stereotype, but we're not all the homophobic rednecks you'd prefer to think we are.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt quite clearly is a criticism of small town christianity where people live with nothing but an overriding faith in God that causes them to have predjudices which they feel they can justify. That much is obvious from the lyrics, and Nick Cave may very well be a Christian but he certainly doesn't approve of what Christianity can become in some instances and that's been a theme throughout most of his album's, just have a read of the lyrics to Get Ready For Love if you really want it spelled out.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nSaw a document about Nick Cave on tv in which he said he wrote this song about small-town christianity.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI disagree with that. Nick's lyrics are not so optimistic as you might think. Take this for example:\n\r\nHomos [...] Queer bashers [...] Lesbian counter-attacks\r\nThat stuff is for the big cities\n\r\nPeople in this \"pretty little town\" just don't care about \"homos\", \"crime\", \"freaks\", \"moral sneaks\" as far as they are *not* concerned. And if they *are* concerned, they choose the stupid way to deal with it: They are fighting with the \"crime\" whatever it is by lighting the fires - but they do not admit, that this \"crime\" is caused by *bad people* living there. In fact they want to hide it, by stating that they need a \"Force\" for the kittens on the trees.\n\r\nI really don't think that God is present there.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nFor me this song is not about whether God is present or not, it is about how many christians forget the real message of Jesus. Jesus himself spent a lot of time with those who were rejected from society, he even went so far to claim that that was one of his main purposes.\r\nThe people in Caves song are like the pharisees in the gospels, they reserve the holy for the righteous and successful. They think that God will punish them if they are associated with the rejects of society.\r\nSo basically God is in the House is a satirical portrait of self-righteous christians who have forgotten the message of the man/god they worship.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nWhat the shit! No comments aaarrghhdowif;woaiu\r\nI first heard this song live, it's lovley..\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nLovely?? This song is anything but lovely! The music is beautiful (well, od course, it's Cave) but the lyrics... the lyrics! People in this 'very pretty town' are so intimidated by the 'God' that they hardly breathe... it reminds me of some kind of sect or... communism... can't see anything lovely about it, but still - it's such a good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nhm. i think it's a bit of both. it's a criticism, maybe not of God, or Christianity, but of christians and the church. they're so afraid of God and of, essentially, being human that they've basically made captives of themselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI definatly don't think god is depicted as intimidating, nor do I think this is a criticism of small town christianity but rather a celebration of the peace and harmony that can be accomplished on a limited scale through faith, hard work, civil obedience, respect for the law etc... but those are interesting interpretations nonetheless, especially the breeding the kittens white - racial prejudice interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI wasn't sure how literally to take this song...\r\nIt's interesting because it could go either way. He could be being serious or sarcastic.\r\nThat's the great thing with sarcasm, you never can be sure ;)\t\t\t\t\n\t\t\t\t\n\n"}