{"comment_0": "\nYeah you hope so but they are not, this was acrtually a cover from Conway Twitty\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nwhat this song means to me is basically, if your \"friends\" are more important to you that a true, living, breathing, loving person that you can have and hold, then maybe it is time to let go...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI don't think it has anything to do with friends or anything..Just that the love that they use to have isn't there anymore. That she wants to be free, not tied down onto a relationship...so maybe yes, it's time to let go. \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis song is amazing to me probably mostly becaues i feel like my boyfriend may be at that point where being free is worth what he'd be leaving behind, and it's sad because I am not brave enough to ask him... I am too afraid he'd agree and say it was goodbye time... that is why this song touches people the way it does, because it takes a lot of balls to say, \"if you want to leave then I will let you go\"  it is a major statement that many people should make, but its just all to hard for those of us so madly in love... songs like this just make you hope the writer is making it up\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nAhh, Conway how you understand me. This song for the party that is always left, aka myself, really hits home. Sorry for the bit of self-deprecation, but if you really feel this song, I feel for you. The first time i heard this I was bawling on the freeway. Anyway, it's pretty straight forward, and if I can remark interesting hearing the song was sung by a male because generally speaking the man is the one who wants his freedom.\r\nAnyway, here's my interpretation...\n\r\n\"Don't all the dreams we've seen come true mean anything\r\nYou say it's different now and you keep staring at the door\" \r\nThe other party doesn't want to fight anymore for their love. She just thinks the grass will be greener away from the narrator. The singer just wants them to work on it, everything they did together is memorable and amazing, and just because things are different or tough doesn't mean he wants to give up. \n\r\n\"If being free's worth what you leave behind\r\nAnd if it's too late for love to change your mind\r\nThen it's goodbye time\" \r\nThe narrator realizes no matter how much he loves this person, if they want to go they will go. And in the process he will need to cut them off, goodbye, not see you later, because if her freedom matters more to her than him, he knows  he stands.\n\r\n\"If we had known our love would come to this\r\nWe could have saved our hearts the hurt of wasted years\r\nWell it's been fun, what else can I say\r\nIf the feeling's gone words won't stop you anyway.\"\r\nThe narrator is saying if he had known this would happen, and the other party would so easily walk away, he would've passed on the relationship. But he's still selfless when he uses \"we\", because he still feels like she shouldn't be in pain either. And my favorite line in the song...\"If the feeling's gone words won't stop you anyway.\" He knows there's nothing he can say to keep her. If she doesn't feel it, doesn't love him, doesn't want to work for it, there's nothing he can do.\n\r\n\"Goodbye baby\"\r\nAnd at the end of the song he says goodbye. Affectionately with \"baby\", but he knows she just don't care or love him anymore, so he has to leave because he still loves her.\n\n\n\n\n\n\n"}