{"comment_0": "\nI'm surprised there are no comments on this song - the chords, rhythm, and lyrics are all very cool the way they differentiate and still blend so well. \r\nThe lyrics themselves are pretty self explanatory - its the intense moment you lose yourself with that person....the chase, the catch, and so on. Very good song, The songs are always sung with so much passion and Bruno always sings with such a purity to his voice alone....one of my favorites from the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nCrazy...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nOh I got a bottle full of liquor with a cocaine \nKicker and I'm feeling like I'm thirty feet tall\nSo lay it down, lay it down\n(He had a hefty amount of liquor/drugs thus him feeling of him feeling \"30 FT tall\")\n\nYou got your legs up in the sky with the devil in your eyes\nLet me hear you say you want it all\nSay it now, say it now\n(Self explanatory her eyes are full of lust and well her legs are probably wrapped around his neck.)\n\nLook what you doing, look what you done\nBut in this jungle you can't run\n'Cause what I got for you\nI promise is a killer, you'll be banging on my chest\nBang bang, gorilla\n(He is being the dominate one and is promising her for 'killer sex')\n\nYou and me baby making love like gorillas\nYou and me baby making love like gorillas\n(self explanatory just look up gorillas mating)\n\nYeah I got a fistful of your hair\nBut you don't look like you're scared\nYou're just smiling tell me daddy it's yours\n(She's acting naughty for his own self pleasure)\n\n'Cause you know how I like it use a dirty little lover\nIf the neighbors call the cops, call the sheriff\nCall the swat we don't stop \nWe keep rocking while they knocking on our door\nAnd you're screaming give it to me baby\nGive it to me motherfucker\n(He means their going to be making a lot of noise and they don't care about the disturbance of their neighbors)\n\nOh look what you doing, look what you done\nBut in this jungle you can't run\n'Cause what I got for you\nI promise is a killer, you'll be banging on my chest\nBang bang, gorilla \n\nYou and me baby making love like gorillas\nYou and me baby making love like gorillas\n\nI bet you never ever felt so good, so good\nI got your body trembling like it should, it should\nYou'll never be the same baby once I'm done with you\n(This is his point of view watching the woman having an orgasam) \n\nOh you with me baby making love like gorillas\nYou and me baby we'll be fuckin' it like gorillas\nYou and me baby making love like gorillas\n\nVery self explanatory song. Two lovers/ or whatever they may be/ making love to eachother I don't honestly think it needs a explanation does it :)\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI'm surprised there are no comments on this song - the chords, rhythm, and lyrics are all very cool the way they differentiate and still blend so well. \r\nThe lyrics themselves are pretty self explanatory - its the intense moment you lose yourself with that person....the chase, the catch, and so on. Very good song, The songs are always sung with so much passion and Bruno always sings with such a purity to his voice alone....one of my favorites from the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI don't know what is there to interpret,he literally says he wants to f*** her like a gorilla.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think the song is about a guy who hates the fact that he loves a girl so evil, but she has some hold over him and he is hypnotised by her when they are together because the passion between them is so strong he is addicted to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nthey are having sex and no one can stop them.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI know this song has a tendency to be misinterpreted and everyone thinks it's all about sex, but really it's all about Bruno's addiction to M&M's. He has a pretty detailed history about it and he makes it clear how much he loves them, especially the peanut butter ones...\n\nJust kidding, this song is totally about sex. Soooooo hot! I think we've all been there. Sometimes making love is nice and slow and sensual, but this song is all about tapping into that primal urge to just pound the hell out of each other.\t\t\t\t\n\t\t\t\t\n\n"}