{"comment_0": "\nThe song is about the classic meaningless of making more and more money and working till you die without any larger rhyme or reason. The video expands on this a bit and criticizes entertainment as a source of this monotonous consumerism and capitalism, hence the zombies and hitler and lots of killing and sex. It's all shot in bathrooms because all of this rehashed entertainment is *shit*, garbage in garbage out, hence the toilets.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI'm going with somebody doing illegal stuff, maybe like working with mobsters to make some money and get rich fast. \n\r\n\"See the money wanna stay\r\nFor your meal\r\nGet another piece of pie\r\nFor your wife\"\n\r\nSounds to me like someone working under the table, doing illegal things, like maybe with the mob for \"a piece of the pie.\"  \"See the money wanna stay\": He sees how good the money is and doesn't want to leave.  He makes sure he shares the wealth, stays long enough so his wife also gets \"a piece of the pie.\" \n\n\r\n\"Everybody wanna know\r\nHow it feel\r\nEverybody wanna see\r\nWhat it's like\"\n\r\nEveryone wants to know how it feels to be rich, everyone wants a taste of wealth.\n\n\r\n\"For baby wanna be a queen\r\nWell alright\r\nWe all deserve the finer things\r\nIn this life\"\n\r\nWife wants to be treated like a queen perhaps?  He's justifying what he's doing for money because he's saying his wife, himself, maybe family and friends deserve the fineries in life.\n\n\r\n\"So working on a little job\r\nIn the night\r\nThat's forty dollars an hour when I\r\nSee the light\n\r\nThe boss said I look tired\r\nI don't mind\r\nHe'll be working in a small box\r\n'Til he die\"\n\r\nBoss says he looks tired during his day job because this guy's working hard, pulling in greenbacks (slang for money) during the night.  Illegal activity.  But he doesn't care what his boss says, his boss will just be working at the same cubicle office job for the rest of his life.\n\n\r\n\"For me I gotta be free\r\nAll my life\r\nI want a little cream cheese\r\nIn my pie\"\n\r\nWants more than he has.  Not just the pie, he wants to add more flavor to his life.  Maybe now he's in over his head.  Wealth is getting to him.\n\n\r\n\"Now puttin' on a big wig\r\nWalkin' hall\r\nHanging with them big pigs\r\nHuff and toss\"\n\n\r\nBeing fancy and hanging with the big guys now (I'm going with mobsters)  Not sure of the slang meaning of \"huff and toss.\"\n\n\n\r\n\"Got me a couple ideas straight from God\r\nI want a bean pie\r\nOrder me a bean pie\r\nI'll even eat a bean pie\r\nI don't mind\r\nMe and Missy is so early busy busy makin' money\"\n\r\nNot too sure about what this means.\n\r\nAnybody else have ideas? Interpretations?  I'd love some help on this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis from above:\n\r\nGot me a couple ideas straight from God\r\nI want a bean pie\r\nOrder me a bean pie\r\nI'll even eat a bean pie\r\nI don't mind\r\nMe and Missy is so early busy busy makin' money\n\r\nSo wrong. It's;\n\r\nLivin' in a beehive,\r\nI don't mind,\r\nMe and missy is so very busy busy making money\n\r\nthat is why he sings 'busy busy' like Bizzy bizzy, sounds like buzzing bees. \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nYes, \"greenback\" means money.  And \"huff\" and \"toss\" are both synonyms for puke.  It seems he's blowing his ill-gotten gains on excessive partying.  \"Bean Pie\" is commonly associated with African-American cuisine so the line may indicate that his profitably illicit sideline is causing him to have to reluctantly deal with black gangsters, or go into a black neighbourhood to do business.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nYes, \"greenback\" means money.  And \"huff\" and \"toss\" are both synonyms for puke.  It seems he's blowing his ill-gotten gains on excessive partying.  (Note that the video begins with two people vomiting, and has a running story about a briefcase of drugs).  \"Bean Pie\" is commonly associated with African-American cuisine so the line may indicate that his profitably illicit sideline is causing him to have to reluctantly deal with black gangsters, or go into a black neighbourhood to do business.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nFunny song. Can't tell the meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\"greenbacks\" are slang for money aren't they?\t\t\t\t\n\t\t\t\t\n\n"}