{"comment_0": "\nhis most emotional song.  best display of his vocal talents.  \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nWhen I first listened to this song, I also took it to mean that he's singing about a girl he's in love with and she just takes him for granted and abuses him in so many ways, and yet he can't let her go.\n\r\nHowever, after listening to it a few times and really thinking about what the lyrics could actually mean, I believe it's not so much about a man who loves, in his words, a \"bad woman,\" but instead about a man who is completely obsessed with this woman.\n\r\nYou can see this right in the very beginning when he says he should have known she was this way because she had her eyes open during their first kiss. He asks why were her eyes open, but the only way he would know hers were open is if his were also open. Him saying that should have been the signal she was bad seems a little obsessive and almost threatening. I can almost hear the persona from the song cornering this woman and aggressively asking \"why were your eyes open?? why didn't you close your eyes??\"\n\r\nNext he says that all he ever wanted was for her to give him ALL of her love, and that's it. \"I just wanted you to love me unconditionally. Why couldn't you do that for me??\" \n\r\nThe chorus goes on to say he would do all of these things for this woman (intercepting a grenade, jumping in front of a train, getting shot in the head) and it's a little too obsessive. Imagine if you were to just start seeing someone and after two weeks s/he was already saying they would die for you and they don't want to live unless it's with you. Granted, we don't know exactly how long the characters have been together, but it's still a very unhealthy way to look at a relationship.\n\r\nSo really, to me, it sounds like this man came on too strong to this girl in the early part of the relationship and she felt uneasy and maybe that she was in danger, so she decided to stop seeing him. As a result, we hear the story of an extremely sick and obsessive man wondering why she couldn't feel the same way about him as he did about her.\n\n\n", "comment_2": "\nFirst I love this song and this video is soooo awesome. I wish they didn't give him that haircut though! \n\r\nThe song means the obvious but the video has lots of metaphors that I can't bypass because they put the lyrics' meaning on display. There is this guy who is very heart broken (suicidal) and the pain inside is the weight (piano) he drags around. This pain is weighing him down. As he is passing through this forsaken (poor neighborhood) road of heart ache he is alone. He encounters threats to his life- his own thoughts seem deadly, they are the tattooed thugs you see. They look dangerous and deadly and this being a metaphor for how his own thinking is trying to kill himself-threatening his life. His mind is telling him, die, kill oneself. He passes the thugs unharmed but frightened because his own thinking frightens him. Then when those thoughts subside the pity thoughts for the self starts this being the old man/hobo that runs at him and pointing at him mocks and laughs. You are an idiot how could you love her, she hates you and you want to kill yourself for that?\" Some times when you are in that kind of pain ( I have) you'll tell yourself \"ah you are fucking stupid, why do you feel this way?\" Or you'll say things like \" I cant believe you feel this numb, you are wasting away gosh you are an idiot!\" Next point cars and people ( a woman dressed in all black) pass him aware but uncaring or oblivious to him and his pain/weight. Then comes up to the house where the stupid bitch has her man whore. Here is all the things he is singing about, he would do anything for her, even look for her carrying the piano, thus, this and what follows sets the entire lyrics into place. He looks up and sees them-realizing there is no going back, he then lowers his eyes then his head. Right then deciding to end it. He drags away that piano, as the pain deepens and the weight (life) becomes unbearable-he can barely push the piano on such steep uphill climb- the weight is going to crush him if he doesn't hold it. And the moment of death appears when the nun and the Priest slowly pass looking. Religion and God seem significant when crossing that road. Flashing red lights means extreme danger, train crossing means crossing over to the other side, him and his pain/piano/weight are right on the tracks and faces the end. The reason why he has the piano on the tracks is that this whole time the piano wasn't a material thing outside of him, it was the pain inside him which can not be separated ( cannot be left outside the tracks) and it must die with him.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nAre you (expletive) kidding me?  People are impressed with these lyrics? LOL\n\r\n\"The chorus is fantastic.\" ROFL you are kidding me right?  \n\r\nTHIS is what the our dumbed down current/future generations find to be lyrically/emotionally poetic?  May god have mercy on us all.  Anybody who actually thinks these lyrics are emotional is even worse than those who can't even understand what the song means.  The fact that you understand the line \"I'd catch a grenade for  you\" means literally what it says, and associate \"fantastic\" with it, means you are a culturally bereft and intellectually stymied moron.  \n\r\nThe future sucks.  \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI haven't seen the video, but when I hear a song as unambiguous as this, I like to think of it in the situation of an \"unreliable narrator\" so they say.\r\nI'm reluctant to hate this woman he's singing about until I know the singer's trustworthy. The listener doesn't actually have any proof that this singer isn't a crazy stalker who pursues the woman desperately against her wishes.\r\nCertain lyrics, like \"why were they open\"...I can imagine that he forced a kiss on her and she's afraid to refuse him. Same with \"You said you loved me, you're a liar\", as she felt scared of him so said she loved him to appease him.\r\nThe fact that she wouldn't catch a grenade or jump in front of a train for the singer (as he would for her) becomes a lot more justifiable if this is some psychotic stranger who she just wants to leave her alone. \r\nWhen he says lines like how she'd watch him burn or smile and pull out the brakes of his car, that is a \"would scenario\" that he is telling us; we have nothing to go on that she did do this, and this is purely his speculation that she would be so cruel.\r\nSo I just think its interesting that, however plain and simple this song seems (while being amazing and emotional at the same time), it could represent something totally different if you look at it another way. \n\n\n", "comment_5": "\nThe meaning behind this song is rather straight forward. he threw his heart on his sleeve and she took it for granted. she is thought of as hellish at one point in the song \"Tell the devil I said hey when you get back to where you're from.\" basically he wants her love and would do anything for her but she doesn't care.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI saw this video of him dragging the piano uphill and singing about how he would \"take a granade for ya\". How his love was so great that he would sacrifice himself for this girl. I wonder if Bruno Mars saw the Christian the symbolic nature of the video and if not, did anyone else see it.... I know saw it and immediately thought of Christ dragging the cross uphill to make the ultimate sacrifice for my sins and the world. At one point in the video, he is harrassed by a street gang and ridiculed and I thought of Christ, again. How He humbled Himself to ordinary men when He could have stopped it at any time. He went through it all and died for us so that we may live through Him. Most will definitely see it as a love song for a girl while I see IN it a love song for the world. Who would have thunk it? LOL\n\r\nGave you all I had\r\nYou tossed it in the trash\r\nbut, to give Me all your love is all I ever asked.\r\nCause what you don't understand is that\r\nI took a beating for ya (yeah, yeah, yeah)\r\nWore a crown of thorns for ya (yeah, yeah , yeah)\r\nWas nailed to the cross for ya (yeah, yeah , yeah)\r\nTook a spear to my side for ya (yeah, yeah, yeah)\r\nYou know I'd do anything for ya (yeah, yeah, yeah)\r\nAnd Iâ\u0080\u0099d go through it all over again for ya,\r\nYes, I would die for ya, baby;\r\nBut, would you do the same?\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI would go through all this pain\r\nTake a bullet straight through my brain\r\nYes, I would die for you, baby\r\nBut you wonâ\u0080\u0099t do the same\n\r\nNo shit manâ\u0080¦ I wouldnâ\u0080\u0099t be too thrilled with a guy so willing to inflict self harm in the name of obsession either\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthis song is soooo great.  i have alot of respect from bruno mars.  he sings from love not like other people who only talk about having sex.  he cares 'just the way you are'.  but anyway this song he is saying that he gave this girl all he had, he loved her, he'd die for her but she wont love him back.  he would do anything for her, he cared for her and \"she threw it in the trash\".  very sad but many can relate to it.  i can and have\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI love this song. I think it's quite beautiful and sweet. In the video, when he saw his dream girl with the other guy, people said that Bruno should have 'whooped his ass'. I think differently, he would rather kill himself then ever interfere with her happiness.  \t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nthis song is amazing Bruno Mars is one of the best artists ever..he sings this song so great and the music video is a hit! ;D I LOVE IT...\"Id catch a grenade for ya\"...\r\nAshelee<3\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nEven if the lyrics weren't hollow and unfeeling- some of them don't even work. Jumping in front of a train isn't going to stop it ya idiot. \n\n\r\nBut mostly it's just how false the song is. I can't stand these kinds of songs, the music doesn't reflect the singers true feelings, it's just a gimmicky 'love tragedy' which is way overdone in the way of real human behavior. It isn't great, it isn't even good. And yet these people swoon over it like it's the most touching thing in the world. \n\n\n\r\nI just can't stand these fabricated emotions, they don't come from life experience, they come from exploiting the mainstream mindset of the mass population. \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthis song and the vedio for thae song has really two diffrent meaning in the video means he would die because he didnt have her. the song means when they were together he would die just to save her life.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song makes me crazy what i shuod to do\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthis song is dumb. if the girl treats him like crap, why would he do all this stuff for her? why would he want to give up his life for someone who cheated on him?? DUMB\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nBruno needs to cease and desist with the guilt trip because Bruno has a girlfriend who happens to be out of town for a few more days, but who will return to his side in Hollywood shortly. Bruno has a telephone. Bruno can easily call her when he's feeling less than great. Good day, Bruno. Stop putting the label \"Suckah\" on my forehead please.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nWhether the song is intended to give the perspective of a mentally disturbed stalker or not, the lyrics creep heck out of me, and I find the imagery nightmarish.\n\nJust my opinion here but it's one thing to feel you might endure all sorts of pain if it might in some way benefit your romantic interest, or keep you in a happy partnership. In a purely *metaphorical* sense, we're all willing to do that to some extent, and it might be reasonable to expect some minimum level of devotion from your partner, but grenade-catching? Head-knifing? A bullet through the brain? D:\n\nTo be prepared to literally *mutilate* yourself is not healthy (unless it's in the heat of a life-or-death situation perhaps, but even then I probably wouldn't blame a person for not going so far). To *expect* that same kind of willingness from your partner is disturbingly unhinged. To try to send a *guilt trip* over the failure to share these gleeful inclinations to self-harm is ample cause to put a lot of distance between oneself and such a person, imo.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI love this song. Its such a great song. And i love how Bruno sings his songs. I love him.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis song is soo catchy :)\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nwhat does it mean when he says \"I'd catch a grenade for ya\"\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nquestion .  I understand the \"black..black..black & blue part\" of the song but ummmmmmm, it makes absolutely [NO] sense [in my opinion] of the transition [in the video]\n\r\n..ya know the dogs..the mexi boys..[Bruno] about to get beat up throwing the picture on the ground of his girlfriend\n\r\nBASICALLY \n\r\nwhat that got to do anything with the song? [it throws me off a lot]\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI think it was just showing the struggles he was facing just to get across town to see her (pulling that piano, almost getting mugged by the Hispanics, causing traffic, etc.) Pretty sure that scene is not directly related to the song at that part, but rather to show what I just explained. Hope that helped! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni like this song.. its ok... but the chorus is the best... i don't get the title of the song tho....\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nhaha yeah i don't know how some of you don't know what this song is about...it just means that he'd do anything for this person he likes ! And yeah I like this song , and its wayy better than just the way you are i think .\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song if you listen to it also sounds like an addiction to drugs, how much he loves it(her) and how he'll basically do anything to for her(a fix) but get nothing in return \t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nSong is great for the video to me it is like a resemblance to Jesus and the cross the piano is his cross, carrying the burden and his love on his shoulders and facing his fears along the way.  Just my opinion!! \t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI could also see a Christian aspect to this song. The person talking could be Jesus.\r\nI love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nOkay I think the basic concept of this is about him loving a girl and she takes/took it for granted however I can see another meaning in the song, mainly because of the video but also the lyrics aswell however I haven't slept for 2 days straight and im a bit wired so this might sounds stupid, oh and im not religious lol. Anyway in the video he is dragging a heavy piano which could represent jesus carrying the cross, you have the gang members who shout out him and he doesn't argue back but just keeps walking and accepts it. Thats what happend with Jesus apart from it wasnt gang members lol. He meets other people on the way but noone helps him. Then there is priest and the end before the the train tracks which could be the end of his life. As for the lyrics it's simular to how jesus died for us but we take it for granted and the line: 'Black, black, black and blue, beat me 'til I'm numb' could either symbolise how we talk about religion taking names in vain etc.. or the pain that Jesus went through coming close to the end he just looked numb, didn't let the pain show and the line  'Tell the devil I said hey when you get back to where you're from' Could mean that we are following the devils way and giving in. and so on. Yeah I'm sure it's only coincidence or I'm just going a bit loopy lol.  But yeah I'm not religious so im not preaching or anything lol\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nWithout doubt the laziest attempt at songwriting since the Black Eyed Peas wrote, well, anything.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\n this song makes me cray\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nOkay, I got two f*king songs I can't handle at this point of my life.. It's Meet me half way by black eyed peas and Grenade.. every time I listen to theese songs I just cry.. and the only reason for that is that I reflect my self and our special relationship in a way. When I hear theese songs, I just cant stop thinking about her. \n\r\nbut it is said that.. at its worst, you learn the most.. or something like that, directly translated from swedish. Sorry for the bad english, now im gonna try to get something else on my mind, before my feelings explode\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI was once cornered by a bunch of guys who decided to play baseball with my head, knowing I had a concussion, who told me not to even think about getting help from the man I wanted because they had already spoke to him and he said he didn't care about me anymore, they could have me, and do what they wanted with me.  That was more upsetting than the ball. He walked in on the situation and I thought I saw him walk away but to be fair I was distracted and only allowed a few brief glimpses because I had to maintain eye contact with the guy in front of me or have the ball grazing my temples or worse if I looked away.  It was an ugly situation and when it was over I went a little hysterical on the man I was crazy about.  I don't remember everything I said.  I know I was upset.\n\r\nBack to the song.. something happened that hurt her making her think he doesn't care so she's making him \"black and blue\" so to speak making him prove he cares about her.  This song makes me cry because I would want to hear someone say \"I would catch a grenade for you'.      \t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nFrom Wikipedia :\n...Itâ\u0080\u0099s a heartbreaking, heartbreak song, and I think everyone can relate to that. Youâ\u0080\u0099re so in love with this woman and you donâ\u0080\u0099t understand, 'What am I doing wrong? What am I not giving to you? Iâ\u0080\u0099ll go as far as putting a bullet in my brain for you, and why canâ\u0080\u0099t I get that kind of love in return?'\"\nâ\u0080\u0093Bruno Mars on writing and the meaning of \"Grenade\"\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nOk! Here's my opinion.\n\nHe would do anything for her. But she won't do the same.\nSo will he still love her? Or will he jump in front of the train like Bruno did? :P\n\nThis song doesn't reach to the end. No one know how they will continue.\n\nA great song with amazing tempo, amazing lyrics, and so damn good Bruno's voice. But, sorry, the meaning this song is just good for losers who will still love the girl who won't even care them. \n\nFor me, I will push her on that Rail way ..\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThis constantly reminds me of her and my mistakes\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI think Bruno is trying to get a message across saying he would do anything for the one he loves, even if they didn't take notice of him and wouldn't do the same back, he would still carry on going, maybe to prove his love. I love Bruno so much, he's perfect, great song\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\ni love this song~\nthis song make me know how meaningful love is.\n\"You said you loved me you're a liar 'cause you never, \nEver, ever did baby\" OH YEAH. very sad huahua. the boy very storng. he will stuck into that love, he trust that's love is for him.\nbytheway, every i hear this, i feel that i am the luckiest person in this word because i have ALLAH who love me everyday and everytime. hahaha\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nSweet song\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nHow in the hell dont yall understand what he means by \"I'd catch a grenade for ya\" he basically means what he is preaching throughout the whole song which is that he would do anything for he even put his life on the line hence (catch a grenade) one of the most powerful songs of all time some of yall just dont kno good music and look far too deeply into stuff like the video for example, it's all self explanatory people come on.....\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThe meaning is pretty obvious. I think some people are reading way too much into this. While I appreciate individual interpretations and think they are quite interesting, sometimes to me the meaning is pretty literal. \n\r\nThe only metaphorical interpretation I can see for this song is the Christian one, especially if you've seen the video. I don't think that's what Bruno intended, but I can see it.\n\r\nThat said, the verses are decent, but the chorus is fantastic. Pretty simple meaning - he'd do anything for the girl and is using over the top scenarios to show how devoted he is (catching a grenade, being shot in the head, etc) however she clearly doesn't feel the same way. The video depicts him walking around with his \"pain\" (the piano) and not caring whe runs into - i.e. the Hispanics, traffic. It's a pretty deep meaning that nothing else matters to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThis guy is way too over emotional. First its about him loving some chick just the way she is, then putting his life on the line just for love. Man how the first song backfired ae.....\t\t\t\t\n\t\t\t\t\n\n"}