{"comment_0": "\nMiranda was brought up in a home where her parents housed battered women and their children. Alot of misconseptions suggest that Miranda had been abused but she actually wrote this song with everyone of those women who she lived with in her mind. She just remembered them and sang about what she would do if it came down to her being abused. and saying take up for yourself dont let the dumb bastard hit you :D\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ni love the part when she says \"his fist is big, but my gun's bigger.  he'll find out when i pull the trigger\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIt's self explainatory.. \n\r\n\"If he wants a fight well now he's got one \r\nAnd he ain't seen me crazy yet \r\nHe slap my face and he shook me like a rag doll \r\nDon't that sound like a real man \r\nI'm going to show him what a little girls made of \r\nGunpowder and lead\"\n\r\nIt's about this woman whos husband/boyfriend beats her and now she's getting her revenge by killing him.\n\r\n\"His fist is big but my gun's bigger \r\nHe'll find out when I pull the trigger.\"\n\n\r\nIt's a great song which they can't play on the radio because there are women whos husbands/boyfriends beat them and they might just go off and kill them...\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI love this part: \"I'm goin' home, gonna load my shotgun \r\nWait by the door and light a cigarette \r\nIf he wants a fight well now he's got one \r\nAnd he ain't seen me crazy yet \r\nHe slap my face and he shook me like a rag doll \r\nDon't that sound like a real man \r\nI'm going to show him what a little girls made of \r\nGunpowder and lead\"\n\r\nOmg, I love this song. It's so powerful. Little Girls are also of kerosene. Ha!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nwow this song is so amazing! i mean im all into metal but hell this song is amazing! basixaly explainitory, he fucked her up now hes dead ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is a white trash anthem if I've ever heard one.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIt means that she will stand up to someone if they abuse her and that she seems weird, but they \"hasn't seen me crazy yet\"\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nGunpowder and Lead has already helped so many woman fight and escape from domestic violence. Woman are strong and if he hits you, he is definitely not the kind of man you want in your life. Trust me, you'll find a better one.\nUntil then, stay strong girl!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song is a glorification of domestic violence.  It's written right in the lyrics, \"He ain't seen me crazy yet.\"  That there implies that she has already done acts which the man in the song would consider crazy, but she herself doesn't.  This song is completely without context, he slaps her face and shakes her like a rag doll, so she commits premeditated murder.  Thereby escalating the situation, a situation which she had already placed under control by having him arrested, all the woman in the song would need to do is call the police and say, \"I don't feel safe since he's out of jail, I'm afraid that he'll come after me.\" and they'll come and watch out and make sure everything is safe.  By admitting that she is heading home to load her shotgun she is admitting that she is waiting for him so she can kill him.  This song is atrocious and should be taken off the air because it glorifies domestic abuse.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nSign if you want real country back: petitionspot.com/petitions/fixcountrymusic/\n\n\n"}