{"comment_0": "\nThis is my semi-detailed breakdown:\n\nAn interesting thing to note is the happy music with the lyrics about depression. I believe when analyzing the lyrics, he does this because people that carelessly listen to the song will not understand it. It requires deep thought. Depression also requires non depressed people to understand the disorder before they can help. \nThe beginning of the song has to do with depression and self harm and the thoughts of suicide most depressed people constantly have. \nThe 1st part talks about the morning after a night of cutting, and the common lie to loved ones to stop.\nThe 2nd part is obvious. Constant suicidal idealization and going back and forward on the idea of suicide.\nThe 3rd part explains that he is concerned about not just his own depression and suicide, but every one else that's depressed. Now the song becomes more about the lack of help/aid depressed people get.\nThe 5th part is an attempt to let this song be the stepping stone into coming together and start helping this epidemic. It also says that depression wont get better if you become a recluse (you have to take action).  \nThe 8th part (the rap verse) is confusing. I think the first half is specifically aimed at non depressed people and trying to explain to them what the deal is with depression (showing that he also deals with it). In the other half he explains that his lyrics are trying to turn the guns (suicidal thoughts) into fists (to fight their disorder).  \n\nThis is my opinion! Let me know if you disagree with anything :)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ni think this song is about the depressed/suicidal kids in the world\n\"That you all have guns\nAnd you never put the safety on\nAnd you all have plans\nTo take it, don't take it\"\nhow he is distressed that these kids feel that way, and the fact that suicide isnt being prevented.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni think the song could also have self mutilation references and an overall anti suicide theme\n\r\ni think \"fused at the wrist\" is referring to how a lot of self mutilators will cut their wrists, and it exposes the flesh underneath. all of these people being \"connected\" through the bare flesh on their wrists. i know it sounds weird but it kinda makes sense to me lol\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think this song is about how he knows what it feels like to be depressed or suicidal and just to take a breath a think before you do anything. \r\n\"I know what you think in the morning,\r\nWhen the sun shines on the ground,\r\nAnd shows what you have done,\r\nIt shows where your mind has gone,\r\nAnd you swear to your parents,\r\nThat it will never happen again,\r\nI know, I know what that means, I know.\" \r\nIs talking about a failed suicide attempt. The sun came up and show what you did the night before. You tell your parent it won't happen again that you're okay now. He is also saying that he knows how you feel and what you mean. \n\r\n\"That you all have guns,\r\nAnd you never put the safety on,\r\nAnd you all have plans,\r\nTo take it, to take it, don't take it, take it, take it\" \r\nYou don't put the safety one because you're ready to go at any moment and you have made your plans already. He is saying not to go through with those plans to take your life. \n\r\n\"I'm trying, I'm trying to sleep,\r\nI'm trying, I'm trying to sleep,\r\nBut I can't, but I can't when you all have,\r\nGuns for hands.\" \r\nHe can't sleep, he can't rest knowing that you are ready to pull the trigger. \n\r\n\"Let's take this a second at a time,\r\nLet's take this one song, this one rhyme,\r\nTogether, let's breathe,\r\nTogether, to the beat,\r\nBut there's hope out the window,\r\nSo that's where we'll go,\r\nLet's go outside and all join hands,\r\nBut until then you'll never understand.\" \r\nJust take a minute as step back from your problem and breath. There's hope out there and together you can go find it. You must go or you won't understand that there is hope and people out there for you. \n\r\n\"We've turned our hands to guns, trade in our thumbs for ammunition,\r\nI must forewarn you, of my disorder, or my condition,\r\n'Cause when the sun sets, it upsets what's left of my invested interest,\r\nInterested in putting my fingers to my head,\" \r\nWe've stopped fighting and went for the guns instead. He mentions that he has a condition or disorder which I assume to be depression. And at the end of the day he only interest is to end it. \n\r\n\"The solution is, I see a whole room of these mutant kids,\r\nFused at the wrist, I simply tell them they should shoot at this,\r\nSimply suggest my chest and this confused music, it's,\r\nObviously best for them to turn their guns to a fist.\"\r\nHis solution to for all these kids with these thoughts to put down the guns and keep fighting. \n\n\n\n", "comment_4": "\nHis lyrics helped me so much. I just want to give him a really long hug.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis is definitely a shout out to all listeners who ever thought of/or attempted suicide, or you might even say homicide.\n\nThis band is very adamant about singing towards a crowd while trying to instill a certain sense of meaning through their lyrics.  \n\n'I'm trying, I'm trying to sleep\nI'm trying, I'm trying to sleep\nBut I can't, but I can't when you all have\nGuns for hands yeah'\n\nIn the chorus above, he's expressing his inability to sleep while he's thinking about all the kids out there that he can save through his music.  He's asking people to listen to his music, to find something else to believe in and be interested in.  A lot of his other songs promote unity through art, like Forest:\n\n(\"Down in the forest we'll sing a chorus\nOne that everybody knows\nHands held higher, we'll be on fire\nSinging songs that nobody wrote.\")\n\nor Kitchen Sink:\n\n(Are you searching for purpose?\nThen write something, yeah it might be worthless,\nThen paint something then, it might be wordless,\nPointless curses, nonsense verses,\nYou'll see purpose start to surface)\n\nI do think its a bit egocentric to play to your lyrics like Tyler does.  But i think its good enough that he can do it successfully.\n\nI have been clinically depressed, diagnosed since highschool. I like to think i overcame it.  I honestly feel very little difference now (almost 12 years later) than I did before, but i've really evolved into someone who understands the world I'm in and I've accepted it.  I have a completely different paradigm of decisions I make, and relationships I work with.  (It's difficult to maintain relationships when you're apathetic state desires complete solitude) \n\nNot a lot of people can do that.  Twenty One Pilots shows a pretty good understanding of that mentality, which is why I think i can connect with them.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni broke this song down verse by verse in a notebook of mine, and here's my interpretation:\n\ni think the 1st verse is talking about the realization of who you have become and how you turned out (depressed/suicidal), and you're promising people you won't turn out like this again, even though you don't mean it. and the 2nd verse and chorus basically says that he (Tyler) knows that they're are depressed and suicidal people out there, and he's concerned and scared.\n\nthe 3rd verse, to me, is basically saying to take life slowly, take time to heal, and you don't have to do it on your own. and that we can escape from whatever is keeping us down (\"out the window\") and go where there is hope, but you won't get there unless you're willing to try.\n\ni wasn't sure on the 4th verse, but what i got from it is that we grew up and traded our happiness for depression (turned our hands to guns, thumbs for ammunition) and when Tyler mentions the sun setting and putting his fingers to his head, i think he's explaining how he gets at night: suicidal (might not be true but that's what i got from it). and he's telling all the kids who self-harm to try to create music instead and fight. yeah, i'm not sure on the 4th one.\noverall, i'm sure it's an anti-suicide song.\n\nalso, i think it's titled \"Guns For Hands\" because we use our hands for everything, it's all we use. but there are people out that only use/want to use guns instead, and \"put their fingers to their heads\".\n\nthat is my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song is about taking the drive to hurt oneself when depressed and turning it into a drive to do anything but that, whether it be to create art or music, drive towards ambitions, let your emotions out some other way. Just taking that energy and channeling it away from something you shouldn't do and towards something you should do.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n\"\"\"\nI know what you think in the morning\nWhen the sun shines on the ground\nAnd shows what you have done\nIt shows where your mind has gone\nAnd you swearing to your parents\nThat it will never happen again\nI know, I know oh ow, what that means, I know oh oh oh ow\n\"\"\"\nI think this is when you're found after a failed suicide attempt.\n\nAs for the chorus, i believe him saying 'You have guns for hands\" means that so many people commit suicide their hands might as well be guns. And this fact makes it hard for him to sleep at night knowing all the suicidal people out there.\n\n\"\"\"\nLet's take this a second at a time\nLet's take this one song, this one rhyme\nTogether, let's breathe\nTogether, to the beat\nBut there's hope out the window\nSo that's where we'll go\nLet's go outside and all join hands\nBut until then you'll never understand\n\"\"\"\nI believe this part takes place in suicide therapy. Trying to encourage people who are suicidal to rethink. Trying to calm them down.\n\n\"\"\"\nThat you all have guns\nAnd you never put the safety on\nAnd you all have plans\nTo take it, to take it, don't take it, take it, take it\n\"\"\"\nI feel this verse is quite literal of him begging you not to kill yourself with guns. That people these days never put the safeties on and they all have plans to take their own life.\n\n\n\"\"\"\nWe've turned our hands to guns, trade in our thumbs for ammunition\nI must forewarn you, of my disorder, or my condition\n'Cause when the sun sets, it upsets what's left of my invested interest\nInterested in putting my fingers to my head\nThe solution is, I see a whole room of these mutant kids\nFused at the wrist, I simply tell them they should shoot at this\nSimply suggest my chest and this confused music, it's\nObviously best for them to turn their guns to a fist\n\"\"\n\nI believe this part also takes place in therapy. He is referring to his disorder as being suicidal. \"I simply tell them they should shoot at this\nSimply suggest my chest and this confused music\" We would prefer instead of having these people kill themselves, he'd prefer them to aim the gun to his chest and kill him instead.\n\nSo i believe its about a person heavily worried about committing suicide and those who are considering committing suicide. Possibly the man Tyler is singing about is a suicide therapist or he is just singing of his own concerns.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI think the song means that people can do dangerous things with their hands. They have \"guns for hands\". \t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI thought this was about how everyone is able to kill someone whether it's emotionally, pushing someone to kill themselves, or literally using a gun.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI see a lot of people talking about suicide, and that may well be the case. When I was going over it though, had an interesting thought that it might be about social media.\n\nThe first verse I think could be regarding posting what you think, pictures, everything you've done that day. People post unfiltered, without consequence for their actions. One of the things people do when up at night is surf social media, trying to get to sleep, but there's so much going on that you end up surfing/replying all night.\n\nGuns for hands I think could be interpreted that we are using our hands for shouting every complaint, opinion, attacking someone, etc. Trading in our thumbs for ammunition I think is a direct comment about phone usage, as well being fused at the wrist, which is what you look like when you're typing on your phone.\n\nWe get so angry at each other on social media. The point of the song could be about actually having an in-person experience with someone, and realizing that you could be friends with some of the people you may despise on social media, but you wont understand that until you actually go out and do that.\n\nmy 2 cents anyways.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ni believe that the songwriter is trying to reach out to suicidal people and kind of come out and say i know what you are thinking i have had those suicidal thoughts before and he recognizes that we all have the ability to hurt ourselves hence the title and he is trying to help them and say hey lets turn those guns into something better or point them at something different even at himself rather than your own heads\"Fused at the wrist, I simply tell them they should shoot at this,\nSimply suggest my chest and this confused music, it's,\nObviously best for them to turn their guns to a fist.\"\ni think this song is mainly about helping these \"kids\" relating to their problems and making sure they don't kill themselves you can tell that most of his songs are about depression and suicidal thoughts.... a musical/lyrical genius and I'm so glad that he is able to speak about such a heavy topic to help other people out\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think the overall theme is how people cope with stresses. The song is saying that while everybody has trouble coping we need to be careful what these feelings can influence us to do. The crux of this song is, \"Obviously best for them to turn their guns to a fist.\" It means that while violence and anger are ok to be expressed we need to be careful how it comes out. (i.e. a fistfight is better than a shooting).\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI definitely think this song is about the fact that he has depression :\"I must forewarn you, of my disorder, or my condition\" and he is trying to tell kids to put there anger in his music and in himself and not to harm themselves but express themselves instead: \"The solution is, I see a whole room of these mutant kids,\nFused at the wrist, I simply tell them they should shoot at this,\nSimply suggest my chest and this confused music, it's,\nObviously best for them to turn their guns to a fist.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI think he's is saying that no one understands him. And that everyone simply attacks him with their \"Guns\". As a person with social anxiety I feel this way often. Afraid to go out of the house to a world that is so hostile. and until \"Everyone can outside and join hands\" We will stay inside and turn our guns into fists.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis song is about suicide, and preventing it. I'll break it down:\n\nThe first verse is about the person, we'll call them Sam since it's mutual gender, but the singer knows that Sam is thinking about what (s)he has done ((attempted suicide/self-harm)) and that Sam's swearing to his(her) parents that (s)he won't do it again, and the singer knows what it means.\n\nThe second verse is the singer saying that there's hope, all you need is friends, etc.\n\nThe bridge is the singer and Sam and the others turning their hands to guns, or holding a gun to their head, based on the next line where they're holding two fingers to their heads. The singer says that he has a bad disorder of doing that, and the others shouldn't be doing it, instead turn their \"gun hands\" back to \"hands\", A.K.A. put the gun away.\n\nThe chorus is just supporting all of that. Sam and other people like that have guns for hands, and they wanna take their life. They all have plans to off with themselves, and he's telling them not to. Then he says he's trying to sleep, but he can't since he knows they're all trying to kill themselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThe upbeat of this song confuses the listener to believe that this song is about being happy. Which in reality, the person/persons that this song is about may look happy on the outside but is really having internal issues and can snap at any moment \n\"That you all have guns\nAnd you never put the safety on\"\n\nthe safety stops a gun from being fired. So it can be fired at any moment and no one would even have a slight thought of what is happening to them\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI think this song is about how a lot of 21p's fanbase are \"troubled\" kids and how it keeps Tyler up at night thinking about how his some of his fans will harm themselves because they have \"guns for hands\"\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\n\"you all have guns & you never put the safety on\" // Suicidal thoughts = you are on the edge of giving up from being in so much pain.\n\n\"but there's hope out the window; so that's where we'll go\" // there is hope (to feel better) but you can't just long for it (window metaphor) - you have to go (make the choice to stay alive & try to help yourself). \n\n\"best to turn their guns into a fist\" // telling us to choose to fight for our lives. \n\nWe need to change our point of view. Having \"guns for hands\" means we are seeing the negative, wanting to give up, living life through the lens that we can't get better. I think some of us are \"trigger happy\" with this point of view - our instinct is to think nothing will change, so we don't try. And so nothing changes.  \n\nBut if we turn our guns into a fist it means we are choosing to live life through the lens that we are stronger than we think. We have the power to keep going if we fight, together <3 \n\nI agree that the rest is about depression, suicidal thoughts and attempts, him worrying about those of us who know how he feels. If you are feeling this way slow down, breathe, connect with others, hear this music and know that you aren't alone. \n\n\"lets go outside and all join hands, but until then you'll never understand\" // \n\n\"go outside\" = choose to keep going, hold onto hope.\n\"all join hands\" = we can help each other. we are battling a lot of the same issues. \n\"until then you'll never understand\" = if you give up you won't know how much you are capable of, what life has to offer you and what you have to offer others. If you don't change your outlook (fists not guns), you will always be stuck in the same place. This part also makes me think about failed suicide attempts and being grateful to still be alive. Or after changing your life/mindset for the better in any way - when you *understand* how powerful this is, how strong you are. \n\nJust my interpretation, I love their lyrics so much. I have severe depression and don't think it's in any way as easy as just \"change your outlook and you're cured\" - I'm not suggesting that. However, these lyrics inspire me to remember that things can get better & to not give up hope. That's the first step. That's turning guns into fists. <3 <3 <3\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI agree with MashedPE. \nMy breakdown:::\n\n\"I know what you think in the morning\nwhen the sun shines on the ground\nand shows (oh-) what you have done\nit shows where your mind has gone\" \nTo me, this is like saying \"I know that you cut last night and now, in the morning, you're thinking about suicide. Or your excuse to your parents...\"\n\n\"And you swear to your parents\nthat it will never happen again...\"\nMeaning your parents found out that you cut and that you lied, and so you swear you'll never do it again.\n\n\"I know\nI know what that means...\" \nMeaning \"I know you lied even then. I know you're going to do it again.\"\n\n\"I know...\nThat you all have guns.\nAnd you never put the safety on.\nAnd you all have plans to take it\nDon't take it\nDon't take it\" \nMeaning (to the suicidal people who are listening) \"I know that you all want to commit suicide, and you always have an open mind to it... And that you all have plans to take your lives. Don't take your lives.\"\n\n\"I'm trying\nI'm trying to sleep\nI'm trying\nI'm trying to sleep\nBut I can't \nBut I can't when you all have guns for hands\"\nThis is more the narrator speaking. Like he can't sleep knowing all these people could commit suicide at any moment.\n\n\"Let's take this a second at a time\n Let's take this one song, this one rhyme\n Together, let's breathe\n Together, to the beat\n But there's hope out the window\n So that's where we'll go\n Let's go outside and all join hands\"\nStill from the narrator, \"lets come together, join hands, and share our stories and understand each other and help each other become happy.\" the 'hope out the window' going to the 'let's go outside' part; \"let's go outside and be happy together.\"\n\n\"But until then you'll never understand\"\n(Narrator) \"until we all join you'll never understand what's wrong with us.\"\n\n\"We've turned our hands to guns, trade in our thumbs for ammunition\n I must forewarn you, of my disorder, or my condition\n 'Cause when the sun sets, it upsets what's left of my invested interest\n Interested in putting my fingers to my head\"\nAs MashedPE said, it's like informing the non-depressed people and the people who don't understand depression of what it's actually like to be depressed. The first and last line to this verse is like saying \"we've given everything just to get guns to kill ourselves\" to me. \n\n\"The solution is, I see a whole room of these mutant kids\nFused at the wrist, I simply tell them they should shoot at this\nSimply suggest my chest and this confused music, it's\nObviously best for them to turn their guns to a fist\"\nI believe the narrator is Tyler now, at a concert, saying he sees a whole venue of people who've been depressed, self harmed, etc... He wants them to, instead of their selves, \"shoot him\" or rock out with the music and just be happy. This goes back to the whole \"lets join hands\" segment. Like saying \"We can all join hands together at this concert and be happy to feel alive.\"... The ending phrase, \"obviously best for them to turn their guns to a fist\" like saying, once again, \"instead of committing suicide, rock out to the music with your fists in the air.\"\n\nThis is just my opinion/interpretation. I'm not saying this is correct, but more what I believe.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThis song is about self-harm and I just think that the way Tyler sings about it is so kind heartedly. He states that he can't even sleep knowing that a lot of people out there are hurting themselves. Also, \"They should shoot at this, simply suggest my chest\" he'd rather even want to have the people that are self harming hurt him instead. This song is just so deep when you really think about it. \t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nlike many tÃ\u0098p songs, Guns for hands is an primarily upbeat sounding song however if you look more at the lyrical content it is actually a very deep song with a darker twist than it appears. \nHere is my breakdown of the song:\n\nVERSE 1:\n\"I know what you think in the morning\nWhen the sun shines on the ground\nAnd shows what you have done\nIt shows where your mind has gone\nAnd you swearing to your parents\nThat it will never happen again\nI know, I know oh ow, what that means, I know oh oh oh ow\"\n\nThis verse i believe refers to waking up after a night of cutting or a suicide attempt. it shows reflecting on where your mind went during the night to make you do that. Swearing that it will stop to your parents is referenced also in this verse showing the impact it could have on others\n\nPRE CHORUS:\nThat you all have guns\nAnd you never put the safety on\nAnd you all have plans,\nTo take it, to take it, don't take it, take it, take it\n\nThis verse shows tylers acknowledgement for depressed and suicidal people and is begging them not to 'take it' referring to suicide. the guns represent the urge to\ncut or commit suicide and not putting the safety on may mean not getting help to prevent you from doing it.\n\nCHORUS:\nI'm trying, I'm trying to sleep\nI'm trying, I'm trying to sleep\nBut I can't, but I can't when you all have\nGuns for hands yeah\n\nthe chorus of this song shows tyler's despair at seeing people who are depressed and not being able to help. the people with 'guns for hands' represent \nthe depressed people with the gun being the urge to cut or suicidal thoughts. He is saying that he can't sleep while he knows people are self harming and\nconsidering suicide. it shows his concern for people with depression.\n\nVERSE 2:\nLet's take this a second at a time\nLet's take this one song, this one rhyme\nTogether, let's breathe\nTogether, to the beat\nBut there's hope out the window\nSo that's where we'll go\nLet's go outside and all join hands\nBut until then you'll never understand\n\nThis part is harder to see what he means but for me this part is tyler trying to help people by being there for them and joining. it is a motivational verse about\njust taking life a day at a time and that there is hope and that it will not last forever.\n\nVERSE 3:\nWe've turned our hands to guns, trade in our thumbs for ammunition\nI must forewarn you, of my disorder, or my condition\n'Cause when the sun sets, it upsets what's left of my invested interest\nInterested in putting my fingers to my head\nThe solution is, I see a whole room of these mutant kids\nFused at the wrist, I simply tell them they should shoot at this\nSimply suggest my chest and this confused music, it's\nObviously best for them to turn their guns to a fist\n\nI think that this verse is about his concern for the lack of help that people who are self harming or suicidal get and him trying to explain his 'condition'\nto someone who isn't depressed. 'fused at the wrists' i believe is referring to people who self harm joining together to help each other by the cuts 'fusing'\nat the end i think it also talks about his wanting to help people who are having these thoughts.\n\n\nMy general thoughts on this songs meaning is that it is about depression, suicide and self harm and how he i distressed to see people this way and his despair\nabout not feeling he can help. It also towards the end does mention his frustration at the lack of help depressed people get. I LOVE this song and i really\nhits home with me.\n\nLYL TÃ\u0098P <3\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI want to comment on the line \"It's obviously best for them to turn their guns to a fist.\" I believe it was Freud who said \"depression is anger turned inwards.\" If we accept this, then it follows that depressed people would feel better if they could remain externally angry instead of turning their anger inward.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI feel like he is depressed with himself and knowing that in the morning, it will be his last day. He hates the people at his school, urging them to shoot at him because they are a team who is cruel to people who think about how they feel or look. It's almost as if it is a song about anti-bullying. \n\n'I'm trying to sleep' \nThis lyric seems like sleeping is dying inside.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIt interesting how some of his songs are just super explicit about what they mean\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI saw an interview that Tyler said that this song came to him when we was playing a show and a group of kids came up to him after and told him all their problems about their depression and suicidal thoughts. He was confused about this he said, \"wow, am just in a hotbed for kids going through stuff? its kinda like a crazy ratio for everyone struggling with this thing.\" Later when he was in a pizza shop in New York and he saw a magazine with a big article that was written about a small city outside of New York that had a lot of high school aged kids that going through a lot of the same stuff. Then he realized that its not just an isolated event and that theres a lot of kids all around the world struggling with it. So he wrote Guns for Hands to say that he knows you have the ability to hurt yourself. He feels like a lot of the older generation doesn't understand and just says No, your not. Your not struggling with that. Don't think about that. Think about something else. Your just trying to get attention. But the song is just saying i know you have the ability to hurt yourself. But lets take that energy and point it at something else. Lets shift momentum and look at something else like art or something like this music or even point it at Tyler. Point it anyway just don't point it at yourself. So thats what the song is saying but he doesn't want to get too deep into the lyrics because he wants you to interpret it your own way.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\ni think that the 'guns' belong to people who don't have depressing thoughts and actually make people with depression feel worse. they have turned their hands into guns and never put the safety on, meaning they let out words full of hate and cruelty. i also believe that when tyler says 'But there's hope out the window\nSo that's where we'll go' he's refering to suicide, and out of that window he hopes to find the hope he's constantly been looking for. this is my interpretation^^\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI think it is about mainly self harm, and the guns symbolise the anger you have, and to not point it at yourself. So when  he sais \"shoot a disc\" I think it's talking about shooting that anger out and making music with it, instead of self harming.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\n\"guns for hands\" is a allagorical plea for us to spend less time alone brooding on the interwebs and more time together IRL\nOr at the very least to remind us that words we say (and write) can be hurtful.\n\n In this song  he's venting frustration that people these days seem to think they'd rather sit at  home on the interwebs and catching up on or creating drama. \n=-=-\n\"Lets take this a second at a time, this one song, this one rhyme \n   (Clam down, never mind everything else just focus on this)\nTogether, lets breath, Together,  to the beat...   \n   (Relax, we are all human, we are all trying to enjoy life)\n\nBut there's hope out the window\n   (Out side, the real world offers other (better) options for us)\nSo that's where we'll go\nLet's go outside and all join hands\n   (the world is there for us to explore and experience together)\nBut until then you'll never understand\n   (You wont know unless you try it)\n-=-=\n\nThat you all have guns\nAnd you never put the safety on\n   (We often use words without thinking first or considering alternate ways to say it \n    which  (ideally) won't be as hurtful) \n=-=-\nAnd you all have plans,\nTo take it, to take it, don't take it, take it, take it\n(a brief commentary of the self centered greedy nature which can cause people to \n act that way either to get what they want or aggressively stand up for themselves. \n-=-\nWe've turned our hands to guns, trade in our thumbs for ammunition\n   (further expressing the idea that words can be hurtful)\n\nI must forewarn you, of my disorder, or my condition\n   (which it seems is genuine empathy for other people)\n\n'Cause when the sun sets, it upsets what's left of my invested interest\nInterested in putting my fingers to my head\n   (It seems his days are more stressful  to the point of suicide and he gets to relax a bit in the evening / night. Presumably at the end of the work day)\n\nThe solution is, I see a whole room of these mutant kids\nFused at the wrist, I simply tell them they should shoot at this\nSimply suggest my chest and this confused music, \n   (Rather than hurt eachother Tyler asks people to send hurtful messages to him \n    instead.)\n\nit's Obviously best for them to turn their guns to a fist\n   (fists would allow them to vent their anger or protect themselves but not harm \n    other people as seriously as \"bullets\" would. Also fists are more personal and \n    cause the aggressor to be more a part of the situation.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\n\"I know what you think in the morning\r\nWhen the sun shines on the ground\r\nAnd shows what you have done\r\nit shows where your mind has gone\"\n\r\nHe knows that this person was cutting or had a failed suicide attempt and it shows what they were thinking and their intentions. When the sun shines on the ground it probably shows blood, blades, an empty bottle of pills, a gun, a noose, bleach and so on.\n\r\n\"And you swear to your parents\r\nThat it will never happen again\r\nI know, I know\r\nWhat that means, I know\"\n\r\nThese have happened repeatedly, hence \"again\". He knows exactly what is happening and what thoughts they had because he has been there.\n\r\n\"That you all have guns\r\nAnd you never put the safety on\r\nAnd you all have plans\r\nTo take it, to take it\r\nDon't take it, take it, take it!\"\n\r\nI see the \"guns\" as suicidal thoughts and the \"safety\" as rational thinking and trying to get help. The plans to \"take it\" are plans to take their life, and then he tells them not to take it because he knows what it's like. \n\r\n\"I'm trying, I'm trying to sleep\r\nI'm trying, I'm trying to sleep\r\nBut I can't but I can't when you all have\r\nGuns for hands, yeah\"\n\r\nThis is him directly saying he can't rest knowing that other people don't have help. The \"guns for hands\" makes me think that hands, which are used for everyday life and are essential, are replaced by deadly weapons.\n\r\n\"Let's take this a second at a time\r\nLet's take this one song, this one rhyme\r\nTogether, let's breathe\r\nTogether, to the beat\"\n\r\nThis is his way of saying take it one day at a time, focus on one thing and we can do this together.\n\r\n\"But there's hope out the window\r\nSo that's where we'll go\r\nLet's go outside and all join hands\r\nBut until then you'll never understand\"\n\r\nThe \"hope out the window\" could be the person thinking of jumping out the window to commit suicide and the hope is a quick escape from their life so they don't have to suffer anymore. He's telling them let's go out the window, but by going outside to see that there are other people just like them and they all need help and each other, but by staying inside or killing themselves they will never understand how much they mean to everyone.\n\r\n\"We've turned our hands to guns\r\nTrade in our thumbs for ammunition\r\nI must forewarn you\r\nOf my disorder or my condition\r\n'Cause when the sun sets it upsets\r\nWhat's left of my invested interest\r\nInterested in putting my fingers\r\nTo my head\"\n\r\nThey have turned their hands into guns without realising it and they now face struggles. His disorder is that \"[he] think[s] twice about [his] life, it probably happens at night\" so when the sun sets he's left with these wandering thoughts that torture him at night. He's interested in putting his fingers to his head maybe because he sees his hand as and gun and is fantasising about taking his life and how quick it would be, or it could mean that he's physically trying to suppress the thoughts.\n\r\n\"The solution is \r\nI see a whole room of these mutant kids\r\nFused at the wrist I simply tell them\r\nThey should shoot at this\r\nSimply suggest my chest\r\nAnd this confused music\r\nObviously best for them to\r\nTurn their guns into fists\"\n\r\nInstead of them shooting themselves, he puts himself in the firing line basically saying that to kill themselves, they must kill him first, after all he has done for them. Or seeing him die would open their eyes to how serious this is. This music is confusing because it's hard for them to understand why he is trying to help because they believe they can't be saved. He tells them that they should turn their guns into fists to fight; \"sometimes to stay alive you've gotta kill your mind\"\n\r\nThis is just what I got from the song :)\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nMy interpretation is that this has to do with relationships, especially relationships with women.  It represents a history being hurt by women. Hince \"you all have guns, and you never put the safety on\", as if to say, no matter what they will hurt you. This is further illustrated by his sleeplessness, as is always accompanied with breakups or insecure relationships. He also says, \"Let's take this one second at a time Let's take this one song, this one rhyme, Together, let's breathe\nTogether, to the beat,\" which seems intimate. Finally, if you read the line and you swear to your parents, That it will never happen again, I know, I know what that means,\" seems to strongly suggest of forbidden love.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\ni think this song is saying that we are all judgmental of each other and at times it can be overwhelming and maybe make some feel suicidal... the truth is we all mess up so we shouldn't judge but we do and when we do it hurts those we gudge very deeply.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI Think It's Like How Everyone Point The Finger/Gun At Everyone But Themselves .\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI believe that this song is about the second hand of a clock and how every second of your life is as ear piercing as a gun firing if you let it be. As opposed to breathing to help control it (let's take this one second at a time) you just decide to take it instead of working on it and breathing to the beat. He then tells you not to take it. The mind gets the best of you when you try to wind down and sleep, and apparently it's no different with Tyler. He then says that there is hope out the window, which is where all wasted time goes. He then says that until you join hands you'll never understand. If everyone joins hands, it creates a circle, like the face of a clock. The beat in the song is also timed perfectly by the second. The song is a reminder to breathe to help silent the ego, which attempts to haunt you every second. Ever. \t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\ni was surprised when i read so many comments saying that this song was about suicide because that didn't cross my mind. i thought this was a view on gun control or maybe the lack of it. the first lines describe a scene that in my opinion, shows an accident that involves a gun, so i imagined maybe it's about someone who had a gun and accidentally shot someone with it \"and shows what you have done\" \"and you swear it to your parents that it will never happen again\". due to that issue, the narrator is afraid of this gun situation, because he could also be a victim of an accident. i think he demonstrates that fear in \"i'm trying to sleep but i can't when you all have guns for hands\" and \"that you all have guns and you never put the safety on\"\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nFrom hearing the song and watching the music video many times i believe that the song does have to do with suicide, but also to not care what others think of  you; indicated when they put on the ski masks (in the beginning of the music video) and duck taping their faces shows that evening.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI think this song is about cyber bullying.  And how our hands are \"guns\" in that our hands on the keyboard can be dangerous-even fatal.  He makes a reference to how we all need to go outside. You people think bloody everything is about suicide/depression!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI really think this song has nothing to do with actual \"guns\". Has to do with God and how we sin. As in hes in Heaven and can't sleep because we all make mistakes and need his love and support to make it through life. I think 'Guns for Hands' means we all sin, we all make mistakes. That the people in the world just sin and don't think, that's why they say \"never have the safety on\". Great song!\t\t\t\t\n\t\t\t\t\n\n"}