{"comment_0": "\nawesome song, i can't stop listening to it. great beat and eminem shows great range with his vocal talent. the new cd is diff. alot more serious lyrics. not bad though. shows alot of maturity\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nDont get ethnic backrounds into the mix dude, he is himself and that should be it.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nHe's not a singer, but I think every loving dad sings to his kid at some point, whether he is a bad or great singer.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nMarshall such a good man :) he's so misunderstood.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthis is a tight song dedicated to his girl\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nHe actually has a good singing voice. I was surprised. This is an excellent song. Sounds like the Beatles hit, \"While My Guitar Gently Wheeps\", though, doesn't it?\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ngood song\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\naw, his voice isn't horrible... \r\nand i'm sure yours isn't much better so don't complain.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nhe must really love his daughter because she got him to actually sing. he says he feels the world on his shoulders but when he sees his lil girl all of his problems dissapear. he is trying to be a good father to his daughter to recompensate for his lack of a father when he was a child. eminem really shows his \"human\" side in this song i love it!\n\n\n", "comment_9": "\nMy friend loves Rap, and I'm not a fan of it, but theres just something about this song that made me want to listen to it over and over again.  I'm not a big fan of Eminem, but this one and Sing for the Moment...Great.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nActually i said that when i heard the song for the first time. but i did really think it sucked. it's sorta grown on me since then...i just hope he doesnt sing too much like that. and ur right m0r0n...my singing voice isnt good either...but i also wouldn't make a record and sing on it if i knew i couldn't sing! LoL\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nwhat the fuck\r\nthis is not what i expected on the new album but im not complaining at all..... this song, Sing For the Moment and Cleaning Out My Closets have to be three of the better \"rap\" songs ive heard all year\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ni can relate to the beginning of this song, only with my boyfriend not a daughter, haha. eminems voice sounds kinda boy-bandish i think but i still love the song anyways. songs about Hailie always turn out to be my favs, like '97 Bonnie and Clyde!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthe part with the questions marks should go.....\n\r\n\"Woulda ripped the //prenup\\\\ if i'd seen what she was fuckin\"\n\r\na 'prenup' is short for 'prenuptial agreement' that you sign before you get married basically making everything of the husband and wife belong to both of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthe part with the questions marks should go.....\n\r\n\"Woulda ripped the //prenup\\\\ if i'd seen what she was fuckin\"\n\r\na 'prenup' is short for 'prenuptial agreement' that you sign before you get married basically making everything of the husband and wife belong to both of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nmaturity from a guy like eminem fuckin rules. you can see the change all over the new cd. cleanin out my closet shows some growing up too.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI think Em can sing really good.  this song is one of the best he has. this whole cd is awsome it is great Em rules\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\ngenius lyrics\n\n\n", "comment_18": "\ngenius lyrics\n\n\n", "comment_19": "\nthis song written for his daughter is awesome and i wouldnt hav expected sumthin like this from eminem but im glad he wrote cuz i luv to listent to it (havin him sing for once took a lil gettin use to but the lyrics are whut counts)\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni think his voice is fukin awesome. hell i wouldnt mind listening to more of his songs like this. and it truely shows not only his love for his daughter but how talented he really is which most people look past because all the controversy. peace- }}i{{ buttafly }}i{{\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nHow does one act \"black\".. how does one act \"white\"? I've been confused with this subject forever..\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni mean, i myself am a hispanic goth punk, and i talk without one hint of a hispanic/mexican (whatever the hell you wana call it ) accent..doesnt mean im trying to be white (caucasion, whatever)\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nhailies song really shocked me. eminems ok i guess, but this song actually made me cry. it was a shocker because normally eminem songs would make you laugh or think a little, but this one really hits you in your sensitive spot\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\neminem doesnt try to be black he his good at raping so that is his \"job\" he just says what he feels and he uses rap to say it.\n\n\n", "comment_25": "\neminem doesnt try to be black he his good at raping so that is his \"job\" he just says what he feels and he uses rap to say it.\n\n\n", "comment_26": "\nlol the dude can rap. \t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis song is great...Eminem sounds SO sexy!!!  He sounds all sensitive and innocent...aw, I LOVE it!  haha\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nnow i personally dont like eminem's music but frnakly i love this song and i dont know why\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nwell it's obvious the song is dedicated to his baby girl Hailie who is soooo cute. This song is hott and it tells how he really feels inside. If this song don't make u think- i don't know wut will... Kepp it tuned to Em y'all!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song is amazing, i love it...\r\nI like his voice... i dont care what anyone else said.. i was so shocked when i heard it i wanted to cry.. Eminem is a sweetie, he tells is how it is, no bullshit... its good.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nEm's voice aint the best but certainly not the worst, i really enjoyed this song, when you listen to it, its kinda sad, seems his daughter is the only source of strength he could get, great song\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\ndamn eminem... i dont want to like him but u really can't help but to admire his talent.  I dunno, i kno he says a lot of what he says to shock even tho he doesnt believe it and im kinda glad that now hes getting to the point that he can perhaps better express himself through his music.  different music does not belong to different races.  we just have to use it to express ourselves through the means most comfortable to ourselves and eminem has been able to intricately weave emotions of hate, rage, anger, and love in such a way that has captured ppl's interest... simply said, this guy is for real\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nWow surprising i do like his singing voice hes voice makes it more sad... it's soo cute... and how da song is dedicated to his daughter makes da song kewler... well... i always listen to this song da best from his album just cos it's different. \t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\neminem is a cool guy as long as you dont' mess with him...i mean he only writes sh*t about people who have screwed with him...he's not scary though like everyone makes him out to be...he's pretty down to earth considering what he could have and it's just music...lyrics...nto reality...have you ever heard an interview?\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nOMG- I am sitting here balling my eyes out! He is soo sweet! He sings good! I love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nfor one this is one of my fav songs on the new cd! He is a great father and he loves his daughter! she is his everything! i love this song because it shows how good of a father he is! for two dead bolt: how is em trying to be black what the fuck i think you need to be slapped for the bs that you are saying! you need help you are just jealous that a white man has sucess. and em is not an embarassment to white people. so stop hatin! and for three frozen dry fly: a pre nup is a contract signed that says if they ever split that the wife will not get half of what he has either before they were married and during the marriage. it makes whats his is his and what hers is hers!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nfor one this is one of my fav songs on the new cd! He is a great father and he loves his daughter! she is his everything! i love this song because it shows how good of a father he is! for two dead bolt: how is em trying to be black what the fuck i think you need to be slapped for the bs that you are saying! you need help you are just jealous that a white man has sucess. and em is not an embarassment to white people. so stop hatin! and for three frozen dry fly: a pre nup is a contract signed that says if they ever split that the wife will not get half of what he has either before they were married and during the marriage. it makes whats his is his and what hers is hers!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI just wanna say that I really love his new CD, i bought a couple of days ago and i think its his best CD ever, the songcraft kicks ass and i think it really shows his talent, its so raw, hes so honest. \t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThis song is very sweet and sad. Especially the line that says \"My insecurities could eat me alive.\" I think Eminem's fans should respect and appreciate the fact that he is willing to be so open in the name of his art. Few artists would dissect themselves the way he does in this song and in the album in general. \t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nIve NEVER liked eminem at all, but this song is awesome. i like the him that he shows in this song; its meaningful. and by the way, DeAdBoLt, i dont think that eminems \"acting black.\" wut does that mean anyways?! hes acting the way he feels confortble. theres no such thing as acting black or acting white or acting chinse or spanish or italian or french. we can all act however the fuck we want!!\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis song is great! He does sing really well & the fact that he is human enough to have a sensitive side has made me like him a lot more\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nawww how sweet of him to do that..but yea,i'm still confused on why he has a tattoo of kim..and her name is capitalized...and then he has hailie...which isn't.\r\no well...atleast thats wat i THINK i saw....\r\nyea im stupid.....sue me.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nEminem should join in a boyband :D \r\nNo, I really liked this. Awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI will answer the question that some asked \"how does someone act black?\" well people come from different cultures and no two cultures are the same in the world and modern day cultures are easily noticible so (concept) your a fucking idiot because things like advertising are aimed at a certain culture where do you think the term \"wigger\" came form? Fubu is not aimed to white people, it is a (you can argue this all you want but its true) black clothing brand ok?  eminem is a faggot who needs to stop thinking that hes black ok thats it anyone else have a problem...good...thats what i thought\n\r\n-=Deadbolt=-\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nMan, shut up with the bashing of Eminem. I'm a punk/metalhead, but this new CD really is fucking awesome. (( Can already feel the \"POSER!!\" notes building up. )) I cried while listening to this song, because it is so packed with emotion it's unbelievable. Emimen isn't some crazed maniac whom fucks every bitch he sees. He's amazing. Stop bashing him. You're only as bad as the person he can perceive himself as if you do so. So. Sit down, shut up, and listen.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI have always had an interest in eminem, maybe its because the \"cool\" people listen to him, but now that I am out of that stage of my life, I can fully enjoy his songs.  This song is amazing, he has changed alot and I think his little girl is really lucky.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\ni really never liked eminem at all.. he pissed me off so much with his moby comments.. but at least he speaks (what in his mind is) truth.. and thats sumthing i cant say for any other mainstream artist ... this song is amazing .. his voice sounds .. real.. and i like that.. hm.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nsuch an awesome song...hes hit a new level of maturity\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThis just goes to show all of the people who think Eminem is worthless, and just wants to ruin people. He's the same as everyone else. This song is amazing! He has a good voice also! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI am a hardcore punk and ska man, but this is one great song. I was amazed at how this rap song actually didn't have any sex or drugs in it! Anyone and everyone will love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\neminem is basically the only rapper i can stand because you can actually tell what he says when he raps. this song is so adorable !! i was so proud of eminem when i heard it because he basically put his heart out for everyone to pick at like you people are right now, and he didn't care cos its all for his daughter. he really does have a good voice i was surprised cos it was unexpected. crazy, what a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI think that em is a music genius. It's like he was born to rap. He went to Lincoln High School in Warren, Michigan i used to go to that school also. I had his old teacher. He dropped out of school though. Em's little girl hailey is a qt. I think that having a daughter and going to jail has been a wake-up call for him. notice... that now hes not all bashing and talking crap about killing people and stuff.  Hes matured a lot. That is why i think this is his best album ever. This song is a awsome song. He knows how to express his feelings and emotions well.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI think his singing voice is incredibly wonderful and sweet. He really loves his daughter :)\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nthis song alright! But idk what else to say except that Israelis suck dick!!! free the Palestineans\r\nMOFO's  \r\nRedfly\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nhe has an better voice then I thought.  was off pitch at a point or two, but hey heâ\u0080\u0099s a rapper not a singer.  if he was a singer I'd \"boo\" him off the stage.  But anyway, his smooth child like singing voice works surprisingly well here, disregarding the obvious singing flaws which have no president because no one expects him to be a good singer.  Best part in the song, the way he goes from light soft singing voice to the screaming singing voice we have heard on so many of his tracks to when he says \"I act like shit don't faze me... IN SIDE IT DRIVES ME CRAZY! MY INSECURITIES COULD EAT ME ALIVE\".  Got to love when an awkward high-pitched squeaky sounding voice works so damn effectively (in his raps).\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI have a question...what is bleeped out when he says, \"i'm so glad her mom didn't -------\"  I've heard it's either abort her, or want her...does anyone know what he really says there?  Send me a message if ya do...thanx!\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nhow adorable is this song? first of all, it is extremely cute by itself when, you know, these big tough guys have daughters and totally love them. this is just so nice.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI was looking at how many emo and punk kids have agreed that this song is so nice... and it is!  I NEVER thought I'd see the day when I'd be praising Eminem... but he's done it.  And it's not all bad.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\ni love this song and i knew there was a soft side to em... and he can sing good all i no is that i no he loves his daughter more than anythign and hailie made em alot more mature.... I love the eminem show! and hailies song and superman kick ass!!\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nthis song is so fucking good and i can definately relate to it right now. eminem is so fucking talented.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\ni had a baby when i was only 15 years old and i never thought there was an artist i listeneed to who could relate and nopw i found one!!  I KNOW how it feelas to be a stresed parent, juggaling work, school, parenting and since im only 18 now, a social life.  People usually think teen parents are shitty to their kids and think thery are not fit.  its not true and im glad that eminem is showing that just because you have tatoos and in my case peirxcings, you can still be a sane parent.  even if you are crazy like me and marshall.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nOh my gosh..this is one of the best songs I have ever heard..he is so nice and he has just had a hard life..I LOVE YOU MARSHALL!\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\ni love this song so much, its so like meaningful...see, for all those who think he's a bad guy...he really aint\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\ni thought he would have a bad singing voice but it was actaully pretty good.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\n see i get so pissed when everyone thinks eminem is  a hard person  cuz he has a soft side and his voice is really good  this song is from the heart as with all of his songs but you can tell this one is from deeper in his heart  great song\n\n\n", "comment_66": "\nDeadbolt your a racist piece of trash.  I'm white and I listen to everything but country and I don't think you have to be black to rap.  I think that anyone that has the talent should step up to the plate and show it.  The only reason I think that you criticize Eminem is because your a poor S.O.B. thats mad because you don't have any talent and your envious of someone that has one, and uses it.  Ride or Die B!+ch\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nVery cool song, it shows he has a better side....I think he should do more stuff like this....but still keep that bad boy appeal.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI found out what is bleeped out in this song.  since his words were only reverse, I just reversed them again.  What he says is...\r\nGod, i'm a daddy, i'm so glad that her mum didn't WANT HER\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nthanks snyder...hm...that sounds pretty terrible if you think about it.  I can see why they bleeyped it out.  i mean, what would hailie think if she heard that?  Oh well, Eminem's back at it again!  haha...\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI think that DeadBolt has some serious issues he needs to tend to.  You're so upset about white people acting black you don't think about what the world would be like if black people acted white.  What a wonderful world it would be.  I think you're jealous because a white rapper is making more money than most of your ghetto idols.  Go back to your porch.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nThank you Deadbolt for setting american race relations back 40 years.  It is good to know that if I accidently stray to far from my predetermined culture there will be wise men like you to point me in the right direction.\n\r\nBy the way this song is very well written and performed.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nthis song is so sweet! i was listening to it while driving, and almost ran off the road because i was so into it! (my mom saved my ass tho, and told me to drive instead of just sit there) it's just so great, and his voice isn't half bad either.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nAwe this song is so sweet! :o) I'm not Eminem's biggest fan or anything but I support him in everything.. and to all the jerks that say he can't rap because he's \"white\" needs to go back to elementary school and learn that that crap doesn't matter! This is such a cute song..\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nApparently we have an ICP fan who thinks spamming is fun.  I used to like ICP a little, but then I hit puberty.  Grow up.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nok this song is brilliant..the first time i heard it i actually was in awe and started to cry..people give eminem so much shit that he just dosent deserve.he has so much heart and u can see this in the lyrics of the song, eminem may have gone to jail and is on probation for another 3 years but i gurantee hes probably  one of the best fathers any little girl could have.people are just way too narrow minded these days and take all his shit too seriously...hes really matured on this album and i can see more and more people are giving him a lot more respect and thinkin \"Oh, he really is just a normal guy trying to live a normal life.\".....lol oh and by the way ..lol this is for \"slipknotkids666\" that whole SLIM ANUS is thing is awesome..but where do u find the time to do it?!?\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\ndid ne one watch on mtv Emerican Made??????????\r\nif u havent u should.................................. its a half hour long and hes interviewed ............ hes so sweet..............................\r\nif u think bout it he did that for his wife............... he loved her..... she didnt love him...................... if she loved him and showed it he probably wouldnt ahve sed all that shit bout her on the record........\r\nhe has grown up if u listen to his new record.\r\ni luv Eminem for eva\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nif u think he corrupts the world ur wrong .... the people who argue bout him and says that is the ones who are really corrupting the world........... Eminem keeps it in the world................. others do tooo but most the time there talkin bout love he does too but he focus on life and shit the most........................................ :)\r\ni luv eminem :)\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\ni just submited the correction to the bleeped out line in the song...  guess it'll get updated eventually.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nHe sings about his doughter, how she grows and become a woman\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nThis is a sweet song, Halie is so lucky to have Eminem for a dad, to all thos people who say hes a talentless fuck, screw you I'd like to see you write rymes like this and rap like him, he has talent and his new album kicks ass. Oh yeah, screw you Slipknotkids666\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nI oft-wonder about the \"size\" of his anus.\n\r\nNot slim? Loose? :-\\\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\ni love this song its soo sweet! hes sucha a good guy, hey may pick on other celebrities and shit but deep down hes a sweetie\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nHey, did you EVER listen to his other songs? If he's such a \"good\" guy, WHY does he rap about brutalizing his wife, strangling his mother, shooting people, and killing toddlers??? If he's such a \"sweetie\" why does he rap about setting up his sister to be gang-raped on her birthday (Amityville)? WHY was he sued by both his mother and wife? Oh yeah... He's SUCH a good guy.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nHe's gotten better in his lyrics, listen to the new album Kiwidd\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nKiwidd - Did YOU ever listened to his other songs? He's made numerous songs indicating why he sing the things he sing! Why? Because we love it. That's what we wanna hear! He also made songs about people taking him to seriously. Have you ever listened to them? (The way I am, Who Knew, Sing For The Moment, When the music stops, Stan, Marshall Mathers) - try listening to them before saying such dumb ass shit - you are no better than all them fucked up critics giving him shit about his lyrics. . . Other rappers don't get that much attention about some fucking words. . . . And if I had had a childhood like Marsh, then I'd probably be having those thoughts about my mother too. . . .\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nhey slipknotkids66, whats with SLIM ANUS???????\n\n\n", "comment_87": "\nWho would have ever thought, i would say, \"awww.. that's sweet\" to a song by Eminem.\n\n\n", "comment_88": "\nslim anus. hahaha. that's the shit. fo' sho' nigga!\n\n\r\nhmm. coming from a white jersey girl that sounded extremely ridiculous. then again, so do all these other comments in here.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\ndoes anybody know what that word is that gets bleeped out when he's rapping?\r\n\"I'm so glad her mom didnt [bleep] her...\"\r\nOn a side note, On White America the word that gets bleeped out in the outro has gotta be 'flag.'\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI've only read the lyrics to this song, but it sounds nice...one of his better songs. Although I've only listened to a couple. I'll have to give this one a listen.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nIn response to \"thetaker\" I'm pretty sure the word that gets bleeped out is \"abort\"\n\r\n\"I'm so glad her mom didn't abort her\"\n\r\nI've actually never listened to this song before but\r\nI think that's great that he is shrugging off his \"bad boy\" image, even if it's just for one song...\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\neveryone has that special somebody who gets em through rough times, thats why everyone can relate to this song, he did an amazing job (even his \"singing\", lol, respect)anyways, glad this is a single, ill never get sick of it, even if i do hear it on the radio at work 20 times a day. all his musics great, i hope he goes on for at least 10 more years (hes almost 30 already, 40 year old rapper????)\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nI think his music blows, but this is a actually half-way descent song. Good job Eminem.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nthanks ekayb.\r\nThat bothered me for entirely way too long\r\nby the way this song is clean\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nHey I am probobly one of the biggest Heavy/Death metal fans ever and when i got this cd i thought that this was gonna be just as dumb as his last cd. Well boy was i wrong this cd is eccelent and because he doesnt do any dum skits like that ken kaniff one or he doesnt kill his wife in this one. He gets out everything that has been stuffed inside him for i dont know how long. In this cd he really shows how much he loves his daughter. This song and Cleaning Out My Closit really got to me. And i dont give a monkeys a** about the people who say that his voice is bad. His voice is great and all you people that r saying that proboly have a worse singing voice than a dead racoon. Good Bye\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\ndamn... great song..its so sweet how he cares so much about his baby girl. Eminem is great..unlike most rappers he doesn't go around singing about sluts, sex, and other bullshit,  he actually has somin to say. congrats to em on such a great cd. Hailes Song and Cleaning Out My Closet are really powerful, and My dads gone craz...man, i was laughing my ass off. the entire cd is great though, its worth every penny i paid.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nHoly Cow, there are alot of comments on this song. Prolly because its an awesome song! I love it! Its the cutest song, and his singing voice isnt too bad! I like it, I think it sounds great. I can't stop listening to this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nthis song is great. it really shows another side of eminem that doesn't come out in most of his other songs. anyway, in response to DeAdBoLt over here, who may never read this but i felt i had to talk to anyway, since when does music have racial boundaries? i mean when did anyone ever tell jimi hendrix to stop playing guitar? no one did because most people respect the fact that people have different tastes. i saw you post somewhere else about how you've moved onto hardcore such as ptw and fata..honestly how are you going to bash rap and then claim to like hardcore when you like two hardcore bands that border on being practically new metal? go listen to saetia, or 7 angels 7 plagues, or even fucking evergreen terrace, and THEN come back and claim to be 'hardcore'.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nWay up there on list huge list of comments Player1916 says it the way it is, this guy can rap. I dont care what anyone else says...he has talent and how is him rapping making him act black?\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nhe's very clever... he put real shit in his songs...he's really smart too... seriously... it's hard to write stuff as real as he does..\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nat least he was honest when he said he can't sing lol but i think he pulled it off pretty well. i think it is so sweet that he made this song for his daughter, it just lets you know just how much he really loves his daughter. \r\nand i can relate to the part when he says \r\nSomtimes it feels like the world's on my shoulders \r\nEveryone's leaning on me \r\nCos sometimes it feels like the world's almost over \r\ncause i always feel like that. i can so relate to eminem as i am sure alot of people can relate to him as well. he is so talented, it amuses me. \r\nhailie is so lucky to have a father who cares for her as much as he does.\n\n\n", "comment_102": "\nthis is the bes tsong hes ever written i love him\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nits not \"abort her\", record it into soundrecorder in windows, than go to effects>reverse> and listen to it. its WANT HER\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\ngreat em song. it kicks ass that he wrote a song for his daughter. loved this song, cleanin out my closet, sing for the moment...those r all great. anyway, i was amazed at how many punk guys/chicks commented in here that they fuckin luv this song. thats awesome. i  am totally into punk too, eminem rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nI love this song! I think It's so sweet! It takes guts to be so open about your feelings the way Marshall did. This song is one of my favorites on his new album.\n\r\nI'd just like to add here that I think people need to stop dis'n on Eminem for the way he acts or because he's white. Race has nothing to do with who somebody is or the way someone will act, and if you think it does, then you are the racist one.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nEkayB...it's \"want her\", not \"abort her\".  Go re-reverse the words yours and listen :)\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nthis song is so sweet it shows his emotions for his daughter and just how much he loves her and how noone understands him but when he has his daughter with him it makes shit go away cause hes like his kryptonite this song makes me cry cause its so sweet\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\noh my gosh, when i first heard this song, i thought i was gonna cry. it was so sweet how he dedicated a song to his little girl. through it all he has his little girl and thats the only girl he needs in his life and the only one that can truly make him happy...well thats how i interpreted it\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nreally a good song... even a bad boy has an heart...\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nI don't really like Eminem, but this song is so sweet. I have so much respect for him since he wrote this. It shows he really is a loving father. \t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nthis song is awsome i cried when i 1st heard it...it just proves that he has a sensitive side even if he doesn't show it too often....i just got the cd and the whole cd is really good i like *Sing for a moment* White America* and Soldier* the best...Em u rule!!!!\n\r\n*~*Megan*~*\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nI honestly expected this to be a boring song that I'd skip over whenever I listened to this CD... but I was wrong! This is probably my second favorite song on \"The Eminem Show.\" (After \"Superman)\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\ni expected this song to suck. i was like ugh he's just trying to win us over with some crappy lyrics about how much he misses his daughter who he probably doesn't give two shits about. but then i heard it and i heard him trying to sing which wasn't half bad and i realized that he meant it. i love this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nwell the lyrics are cool...but eminem sucks....rap sucks\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nI love this song so much. I listened to it about 35 times already, I just keep listening to it over and over again. Everytime I listen to it I cry, I mean I never crieed when I listened to a song before. I like Ems sensitive side it totaly sweet and sensitive. Its good to see a rapper who actually talks about his kid and loves his kid so much. Hailie is such a sweetie, I wish I could meet her. There arent that many pics of her online. Does anyone know where I can find more pics of her and stuff? This song is just the best. Eminem has a great voice I wish he had more songs where he was singing. Fuck Kim ugh she makes me wanna puke lil bitch\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nLOL... I agree Juicyfruit... Kim is a bitch.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\ni wouldn't be surprised if everything i say has already been said.  but anyways, he really put himself out there on his CD the Eminem Show.  He put alot of personal stuff in his new songs (at least some of them).  \n\r\nThey should lock Kim up.  She is a bitch.  She gives Marshal and Hailie so much shit.  Someone should put her out of her misery.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nThis song is such bullshit. I like the production and Shady's singing is better than he thinks, but come on. Everyone's gushing about how sensitive and mature he is now? He starts singing about his beautiful little girl, but of course he can't make it halfway through ONE FUCKING SONG without it degenerating into angry ranting against his ex-wife and entire family. \"I'm so glad her mom didn't\" and the censored part is \"abort her\" for anyone who couldn't figure that out. I think anyone who is a child of divorce will understand the concept of using a kid as leverage - \"look at how much I love her. You bitch\". If he really cared about his daughter so much he wouldn't turn a love song for her into that bullshit (which makes up the majority of his other songs). Listen to \"Drips\" - that's our new grown-up Eminem. That's like saying Family Guy is more mature and refined than South Park.\n\r\nBy the way - to all the 14 year old idiots going \"Fuck Kim yo\", you've never met her in your life and she has not had the platform to say one word about her marriage to Eminem.  Just because he airs all his dirty laundry in his songs doesn't make it all true. He says so himself. I can't wait until he makes a track about how he dropped his ice cream when he was 3 years old and nobody held his hand. Fucking shut up.\n\n\n\n", "comment_119": "\nthis song sucks, listen to dogwood, they are so much better than eminem. peace out :)\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nI dont' like eminem that much, becuz his songs are questionable but this song is really good, he has a good singing voice rather then just rapping the whole time.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\ni'm pretty sure it's \"what'd i stick my penis up in\" not \"why'd i stick..\"\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nThis song shows that Eminem is human, he knows he has made mistakes and has learned from them.  It really proves his love for his daughter.  I think this is the sweetest rap song I have ever heard!\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\neminem love his daughter very very much.that,i believe everyone can see.the love of a father to the daughter is too big to even be pulled down by a rapper trademark\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI love this song - I can't believe dat he thinks he can't sing! Of course he can, and he's real gud at it 2! Dis song made me cry da 1st time i heard it, it is soooo sweet how he did it 4 his baby. It proves all da critics wrong who think all he does is promote violence and anger - the guy has gotta heart when it cums 2 hayley! U can't help but luk up 2 this man. After all da shit he's had 2 go thur in his life, he's cum out on top of evrythin. He's an inspiration to thousands of ppl da world over. I LOVE his new album, it's full of very mature eminem, he really has grown up a lot. He talks about a lotta things i didnt think he wud. All i can say is well dun man, keep da music cumin!!!!! Hayley is a v lucky lil girl!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\ni luv this song.. i was realy surprised when i herard it... i honestly wanted to cry.. cuz even on his otha cds.. almost all thje songs have meaning for what he says.. like in this song he says pll dun see his real side.. and if u listen to otha song u can hear meanin to what he says .. i always try to show that to otha pll but the jus hear what he says and dun like him.. but i listen to the musdin and the lyrics and u see  ya  know what im sayin? newayz this song is awesome and i luv the fac he got Hailie bak.. and  that he is hjappy.. cuz he even says he is happy lol..also..i think he has a goods voice and i honestly got all happy and like wanted to cry cuz it so great that he had his daughter and that he was happy enough to sing lol.. newayz.. me and this kid kevin agree that on sum songs on his past albums he has said things that r jus jokes.. even thought they were still great solng\\s and i luved them  but on this cd he is rappin more true and shit.. i mean  it is great to cuz he has sum song that we r  used to and know on the new cd.. and shit... helli have head the whole cd cuz i down loadin the songs and burned them to cd.. so i  dun even gotta buy the cd .. i am broke lol.. and it is jus like thje cd\\.. lol.. i dunno..i jus luv the new cd and shit .. i think its great .. \n\r\n~ConFusion\n\n\n", "comment_126": "\nits so nice to noe that he actually loves sum one  plus alot a dads now a days dont stay wid der kids or make a relationship so itrs nice to see he shows differently\n\n\n", "comment_127": "\nits so nice to noe that he actually loves sum one  plus alot a dads now a days dont stay wid der kids or make a relationship so itrs nice to see he shows differently\n\n\n", "comment_128": "\ni beilve that emiem is a fucking jackass wipe he couldnt sing his way out of a nutsack this guy has no fucking talkent and he needs to get a godamn tan i cant stand that fucking pussy mr kohler eats asshole  that stupid fuck stop raping thechildren\n\n\n", "comment_129": "\nThis song has made me think highly of eminem.  It shows the real him what he really thinks.  He has surely got my admeration. I have a little daughter too  and this song just gets to me. It makes me think of how i feel for my daughter and how hard it is to raise a baby.  I give him props.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nCorey, shut the fuck up, Eminem shows thru his songs that he has gone thru alot, alot more then u will probably ever go thru, nd he sounds like a great father, so leave him the fuck alone, he probably has made more money in a month then u will make in a lifetime to stop ragging on him u jackass\r\n    I like this song tho, it shows that eminem is all human nd shows his real side\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\ni listen to alot more rock than i do rap (result of havin alotta sk8ers and motox guys for friends) i always tried to keep from listen to em cuz everyone was talkin about how bad he and his music were. my friend told me about this song...i thought she was crazy for sayin that em had a 'sweet' song but finally i downloaded it, and i really like it! he can sing too!\n\r\n*~*rawkerchic182*~*  \t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nAWESOME SONG definately a change for him but it ROCKS.  This song definately makes you realize that no matter what we are all human... and that nothing is ever to hard to handle... even if you are lost and can't find your way.  PEACE\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nthis song is great no doubt i love it......especially the part where he says \"My baby girl keeps gettin' older I watch her grow up with pride \r\nPeople make jokes, cuz they don't understand me They just don't see my real side\" i am totally feelin' what he is sayin' there cos i'm 16 and i have a baby girl and i wuldn't trade her for ne thing in the world and people don't understand that yeah what i did was stupid (getting preg when i was 15) but i wuldn't change ne thing if i had the chance well actually i wuld change who her dad is but that's only cos he's an asshole...but like i said i totally agree with him on that verse....i love this song and kim is a bitch...she has put Em and Hailie thru alot of shit......\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nthis song......it started me on eminem pretty much. he's not really that bad of a guy after hearing this song, im actually starting to get into him again. what a sweet song i must say about his daughter. thats so special.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\ni love eminem! hes awesome... he has some problems in his life but hey... doesnt everyone?! n i think thats so awesome how he wrote a song about his daughter... and u dont see that many people doing that... so i give him a lotta credit! *Laura*\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\ni love emeinem. i can relate to alot of his songs and what pisses me off the most are people who dont even take the time to TRY to understand him. this song is increadible and anyone who thinks different has to be fucking crazy. \t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nmy life doesnt live beyond punk music, emo music, and eminem's music... his music is so deep, meaningful, and he just makes all around good listening music.. em- i kno how u feel man.. it feels like everything around u is falling apart and the pressure of all these fucking responsibilities is killing you and u just want to let go.. but then there is that one person in the world that makes all your life seem so rite and the feelings are so intense u fall to the floor and thank god for his wonderful creations, and wonder how he can could have made so many fucked up ppl, and so little ppl like the one yo love and adore.. em- keep singing for hailey, u will have her all of ur life if u continue to treat her like a princess... be thankful your 1 person in the world is still with you today, b/c mine is long gone......\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nI love this song....I love eminem\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nawww this song is so good!!! i love eminem!! and this song\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nI LOVE DIS SONG... ITS DA CUTEST SONG ON DA CD... I THINK HIS NEW CD IS PROB DA BEST CD ON DA MARKET RITE NOW... EVEN IF ADULTS DONT THINK SO IT REALLY IS.. ALL HE TALKS ABOUT IS LIFE AND HOW REAL IT IS.. ALL HIS WORDS ARE DA TRUTH AND DATS ALL HE SPEAKS... HE DONT LIE ! WHICH IS DA BEST PART ABOUT EMINEM. ALL HIS SONGS ARE GREAT BUT DIS ONE IS LIKE WHOA. NOBODY WILL EVER KNOW HOW MUCH HE LOVES HIS DAUGHTER UNTIL DEY LISTEN TO DIS SONG... I NEVER EVEN KNEW DAT. AND PLUS DAT EMINEM IS SO0O0O FREAKING HOTT!!!!!!!!!!!!! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\neminem is a good singer... i wuz surprised.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nBefor I say this I want you guys to know I don't claim to \r\nbe a big Eminem fan, and I honestly don't know a hell of a \r\nlot about the rapper, but I hope someone will straighten this out for me, \r\nWho are Debbie and Kim? Both ex-wives of Em? And if they both are, which is Hailie's mother? \r\nSounds like a dumb question I know. But I hope someone will set me straight without making fun of me for not knowing. \r\nPs-> Love Hailie's Song. One of the best. \n\n\n", "comment_143": "\ni'm not an eminem fan. my friend showed me this song. i like it. :D\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nI luv this song it shows the real Eminem this song kicks ass it shows how much his daughter means to him and how he can be a good person he isnt just a dangerous guy he really has a huge heart\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\n\" cuz my baby knows that her daddys a soilder\" that is the sweetest line, makes me cry, lol i love this song, its so sweet. hated eminem until his new cd, he grew up alot in the new cd. wow i love it. \n\n\n", "comment_146": "\nEz a szÃ¡m qrva jÃ³! :D  :P\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\ngreat song. shows the other side of eminem.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nthis is such a great song and i love his voice when he sings... theirs something about it. you can tell how much he really loves his daughter :)\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nGo Eminem! I'm so proud...I hope u release this song because it will be a number one for u for a long time. Some of it is so sweet.....I love this song......and even my mom thinks it's neat! Good work!\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\npupper_dawg.. Ok....Haylie is his daughter...Kim is his ex wife that he's been fussing with for as long as any one can remember....and he just got custidy over Haylie....Debbie is his mom that he hates for what she put him through........\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nnothing against eminem, but the proper studio can make anyone sound like Justin Timberlake.  So he can probably sing, but not nearly that well... we'll see if he ever performs the song live and even then, it's quite possible he'll have the same effects thrown on his voice (like the extreme reverb and flange) :)\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nFor once, Eminem has produced something decent...\n\r\nI have to comend Marshall on his Singing voice...\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nheh, never heard it, great lyrics though...and distant, shhh, some of us are still living in the land where live preformances will of COURSE sound exactly like they do on cd....:)\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nthis song is soo sweet! i was almost crying when i first herd it. he loves his daughter soo much and she never should have been taken away from him in the frist place. i dont like eminem, but i love this song. his singing voice is really good! i know hes a good rapper and all and shouldnt change entirely but still. \t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nyeah i know i love the song and everything and i know this makes me sound like a dork but, why does he have to curse so much in such a good song like that one part... \"my penis uppin...what shes been fuckin\" who needs that in such a good song to begin with?\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nyo i think this song is the shiznit. he finally comes to his senses and actually is a good dad.  it has good lyrics and the music is smooth and cool its hot!\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nEkayB- It's actually, I'm so glad her mom didn't abort her, but it's even blocked on the record.  Both, Em and Kim love Hailie, that's why there was a long custody battle over her, so obviously her mom wanted her.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nhey I don't even like rap or anything, actually I hate pretty much ALL rap, I listen to punk/emo/hardcore/ska, etc... but I do like Eminem, he's got a style all his own, and I really like this song, it's cool that he dedicated it to his daughter, see he doesn't hate ALL girls =)\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nI love this song. The way he loves his daughter, I've never seen anything like it. It's amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nThis is one of many songs by Eminem that I like...You see a side of Eminem that many people don't believe he has..Many people see him as a drug using pistol tottin criminal...They probably don't know that fact that he has a daughter and he will go to any depths for her. This is probably the song that you learn so much about him. Very good song. I love it\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nThis is one of many songs by Eminem that I like...You see a side of Eminem that many people don't believe he has..Many people see him as a drug using pistol tottin criminal...They probably don't know that fact that he has a daughter and he will go to any depths for her. This is probably the song that you learn so much about him. Very good song. I love it\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\ni fucken luv rap anythin else doesnt compare, eminems got the mad lyrics and his rage and anger lifts his rhymes, hes gone soft in this album which doesnt go well with rap fans, it'll b the shit wen he rakes out anotha album which has him bak 2 his old ways\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\njesus, some of you people need to learn to type, rather than punch the keyboard. I seriously hate eminems singing voice, I like the lyrics and all, its classified as a good song in my book, but its like having a good song drilled into my head witha heavy guage drill bit, I probably just got bad taste tho, I can understand why most of you like it so much, But I mean, a LOT of his songs have had serious deep meanings, just most people have refused to look past the bad language to see it. I am kinda offended by people saying he has \"grown up\" when hes always been as loving as you now percieve him, you just gotta listen harder man, look for a deeper meaning, theres usualy one there.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\ni wonder if eminem reads any of these\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\neminem is so hot an his lyrics are so tight...no white guy has ever rapped like him\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\ngood song...em's got a good voice here...ya...\n\r\nxo.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nThis is song is beautiful. . . it exposes the fact that he's not what critics claim him to be-- he's actually a stand-up guy and a pretty good dad.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nAre you people fuckin' CRAZY?!  You think this degrading piece of, uh, \"work\" is beautiful?  You think it shows Eminem's \"mature\" side??  Apparently you've all forgotten that Haley is just a kid.  Do you think this child would be SO touched by all the vulgarity in this song?  Additionally, Eminem goes off on tangents about his ex-wife more than once, hence going WAY off the topic of Haley.  Oh, and \"I'm so glad her mom didn't want her?\"  Yeah, those lyrics would make me feel GREAT!  *Notice the thick sarcasm.*  Besides, if anyone said such horrible things about my mother, I wouldn't want anything to do with them.  That poor kid!  Eminem should be arrested.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nThis song IS beautiful.  It gives me a whole new outlook on Eminem.  And did you know that he doesn't even allow his daughter to listen to his own music.  He IS a really good dad, no matter what his image portrays.  He loves his daughter more than anything else in the world.  I really truly think it's what keeps him going.  He loves that kid so much.  It's really a sweet and moving thing.  Hell, who knows?  Does everyone SERIOUSLY think that the people like Eminem are REALLY like that?  It's called BUISNESS!  He's fucking FAMOUS.  Do you think he'd dump all that?  Would you?  I also think that if it came between his daughter and his career, he'd dump his career.  The point is that I think Eminem is a pretty sensitive guy when it comes down to it.  He's not what everyone thinks he is.  This song shocked and moved me nearly to tears.  Em may not have the best singing voice in the world, but then again, do YOU?  And he's not actually that bad at singing.  If Em does read these... then EM THIS IS YOUR FINEST WORK, WHICH IS SAYIN' SOMETHIN'!\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nchrissy, maybe if your mother was a horrible person, you wouldnt mind hearing bad things about her. obviously, em thinks its best for hailey to grow up without kim in her life. at least thats what i think he was getting at.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nHey Chrissy, I dont usually like eminem's stuff but just stop listening to the lyrics jus listen to the song its a cool tune. let the poor guy rap about all the crap he wants. this is actually a decent song.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nim sick of people coming on here talking about eminem...just go away! If you people really give that much of a shit about hating on eminem take it to a chatroom and get out of a SONG MEANINGS website. because obviously you don't care about what his songs really mean...ou just come on here cuz you don't like eminem...and this is really pissin me off..great song though. it's really sad and if my dad did that for me i would really think he loves me alot. and i think thats what em wants hailie to know\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nThanks music_woohoo!!! I couln't have put it better myself.  Em is excellent!!!! We ALL no it!\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nI've always liked Eminem's music, but i got a lot of respect for him from this song.  It's great that his daughter is pretty much the most important thing in the world to him.  Amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\ni think this song is mad as lyke eminem has a really good voice and i lyke him any otha time this song is lyke a song dat lyke would make u cry\r\nLuv *Roxy* mwa mwa\r\nxxoo\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nI know only one person who likes this fucking crap! My next door neighbor's kid.\r\nHe is always fucked up, either on meth or on glue.\r\nI guess you would have to be to enjoy this shit that some retards dare to call music!\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\neminem rocks!\r\nhailie's song isn't the best on the cd, but its pretty damn good.\r\ndeadbolt, you've got serious issues that u need to fix, ok. nobody cares about racial issuses anymore except for fucking bitches like you. eminem's ten times the person u'll ever even dream of becoming, bitch.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\neminem rocks!\r\nhailie's song isn't the best on the cd, but its pretty damn good.\r\ndeadbolt, you've got serious issues that u need to fix, ok. nobody cares about racial issuses anymore except for fucking bitches like you. eminem's ten times the person u'll ever even dream of becoming, bitch.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nthis sog rox!! its so sweet, it makes me sad, i can relate 2 it :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\ni love this song, i was so surprised when i first heard it because i never thought that Em had such a sentimental feeling about anything. there are definitely 2 sides to Em, just like he says. this song is so beautiful\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nyepp this song rux. eminem's singing this from his heart. kinda downer about \"i'm so glad that her mum didn't want her \" part. i mean i know he's happy about it but if i was Hailey i'd freak out knowing im unwanted by my mom. but w/e right?? i still love this song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nteardropx I think the lyric's wrong, I thought it was supposed to be \"abort her\" that's censored out...\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nEminem is so talented wen he first come out i had my doubts n he deserves 2 b where he is now....going through the site he went through in the past ... hez a luki person man\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nEminems daughter will grow up to be some trash fluffer, so whats the point.  With a father like that no talent piece of shit what chance does she have.  Rap is a disgrace like this clown.  Bad man, bad song.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nDoes he really bang his mother? I hope Hailie doesn't listen to this when she grows up she will need one hell of a long therapy session.  Ah-thankyou.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\ncrap... i just read the lyrics then... it says \"bags on my momma\" ahhhhhhhhhhhhhhhhhhh!  How embarressing.  I take the previous comment back, and walk away in shame.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nThis song is hella tite b/c its really raw, but also because you dont just have to be a dad getting his daughter back to be able to relate to it.\n\r\nI can totally relate to alot of parts of this song.\n\r\n'Some days i sit, staring out the window \r\nWatchin' this world pass me by \r\nSometimes i think there's nothing to live for \r\nI almost break down and cry \n\r\nSometimes i think i'm crazy \r\nI'm crazy, oh so crazy \r\nWhy am i here, am i just wasting my time? '-Who doesant get like this sometimes?\n\r\n'I act like shit, dont phase me, \r\nInside it drives me crazy \r\nMy insecurities could eat me alive'-I'm deffinitly the kind of person who plays it cool ALL THE DAMN time. Anyone know how exhausting it is to just fight everyday to keep a smile on your face and pretend life is just fine? I'm sure a crap load of people do.\n\n\r\n'But then i see my baby \r\nSuddenly i'm not crazy \r\nIt all makes sense when i look into her eyes'-When all this is going on, this line is very relative to when I'm just going crazy. Then I get away from everyone, and i'm with my baby. A 4 yr old arabian that I broke on my own. I saved her from an abusive home, and trained her. She makes me sane.\n\r\n'Somtimes it feels like the world's on my shoulders \r\nEveryone's leaning on me \r\nCos sometimes it feels like the world's almost over \r\nBut then she comes back to me ' This is me just trying to live up to impossible expectations set by relatives, etc...\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nhis song sounds lik a frekin backstreet boys song sorry. eminems good but this just isnt Shady\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nThis song sounds lik a frekin backstreet boys song sorry. eminems good but this just isnt Shady\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\neminem is a washed up shithead\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nthis song is just wanna make me cry the words are just adorable and it's about his daughter hailie and I wonder why did her mother like threw her away she's just a kid and by the way it's not the first time shows his sensitive side he did once in monkingbird both songs are cool and adorable....?\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nThis song is so sweet, I love it. You really wouldn't think that Eminem would be able to make a person cry, but this song makes me want to cry, because it's so sweet.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nThis is a beautiful song which shows how much eminem loves his daughter Hailie.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nI think this is definitly 1 of his most beautiful songs. Everyone has so many different opinions when it comes to Eminem and his music, but I think some of his music is excellent. I did cry when I first heard this.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nthis song lyrics r great...very touchin it shows how eminem loves his daughter...but i dun neo y it kinda funny hearing eminem sings...i mean he got a good voice...but is just kinda funny..anyway eminem rocks...n i love him 4eva\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nMAN..I MUST ONCE COMMENT AGAIN...THIS SONG IS JUST FUCKIN AMAZIN...I DUN KNOW HOW NOT 2 LOVE HIM..HE JUS AMAZING...LOVE YA EM..\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nI had to give my 3 daughters up for adoption because despite working 70 hours a week I couldn't afford to keep them...  This song makes me fucking bawl every time I hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nwoah bOotiful song! im luvin it to bits\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nEminen is an artist, he act like a thoug guy , crazy ........but he's human, he had emotions and feelings like anyone else, he is an artist, an actor and a father! great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nguybrows is so wrong he didnt lick his fingers.He forced her to suck his cock.then he liked her ''not so virgin after all'' pussy.\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nyoungzoe, this song came out before mockingbird. like two and a half years before.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nHmm... Sorry to bring this up, but that isn't Eminem singing the chorus \"Sing with me, sing for the year...\". That's sampled from from the Aerosmith song \"Dream On\".\n\r\nBut, I must still admit that I really love this song. Everytime I hear rap-music, I simply turn of the source of where it comes out from. But Emeinem is the only rapper I really like to listen to. I'd never thought I ever would listen to rap!\n\r\nThank you Eminem!\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nGuerrera... it sounds like 'Guerrera' in the song, but this is a reference to a fight Eminem had with John Guerra, who he saw kissing his wife outside a Detroit area bar in June of 2000. Police said Eminem hit Guerra with a gun, but Eminem obviously disagrees, since he says here it was an \"air gun\" and that it was \"a fist that hit you!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\na lot of adults think ems all bad, but they dont even take a minute 2 even listen 2 what hes sayin n his songs!!!!!!!!!!!!! ppl give someone a chance 4 u make a statement bout them!!!!!!!!!\r\n~~~~~~~~~~ems biggest fan~~~~~~~~~~~~\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nYeah nice song but he can't help poppin a verse in there! lol. And he kinda sounds like JT. Brill song none the less!\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\naaah beautiful song but I just wanna show grattitude for this man's work in the industry of working hard to make things a little bit more simplistic. Also the way he put the song he sung to Hailie into another song is just wonderful and beautiful to see.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nrealy good song it surprised me that he can actually sing well he tryed n thats enough for me. i think it will bring memories back to dads and daughters he shows alot of maturity in the lyrics its a great song\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nthe censored line should read...\"I'm so glad that her mom didn't abort her.\" The fact that people are still commenting on this song consistently 5 years, or so, after it came out is impressive....love it\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\ni really like it alot..eminem u r the king\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nfunny song haha!\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nThis song makes sense, it makes people realize that eminem and other rappers act completely different on stage than what they are in real life.\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nSay what you want about Eminem, you can't deny he's a great father.  Two songs dedicated to his little girl.  It shows you a lot.  Most rappers wouldn't do that, but Eminem is different.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nThis is the song that made me reconsider my opinion about Eminem, and like some of his other songs. I actually like the double personality he seems to have, bad-ass/ adorable father...\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nmy mum says she thinks the lyrics are as follows:\n\r\n\"Yeh and if i could sing, i'd keep singing this song to my daughter\r\nIf i could hit the notes, i'd blow something as long as my father\r\nTo show her how i feel about her, how proud i am that i got 'er\r\nGod, i'm a daddy, i'm so glad that her mum *abort her*\"\n\r\nhas it been confirmed that, he says \"want her\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nThis,song,is,fucking,awesome,well,to,me,anyway,i,fucking,love,it,it's,amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nAnd,yes,i,think,it,is,*abort,her*,the,bits,thats,missing!\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nthis song is amazing, and the part where he says,\n\r\n\"Cause there's a lot of shit i keep bottled that hurts deep inside of my soul\"\n\r\nI love it.\r\nHe writes THE BEST SONGS. \n\r\n\"People make jokes, cuz they don't understand me\r\nThey just don't see my real side\"\n\r\nI love this song and love his love for Haley, it's a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nI Can't Listen To This Song Without Crying.\r\nI Love This Song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nI'm surprised that no one has brought this up yet:\n\r\nI really don't like how he says \"I'm so glad her mom didn't want her.\" You know that when his daughter gets older she will listen to this song; how would she feel, listening to that? Also, if you plan on writing a song for your daughter, you shouldn't say all that negative stuff about the mother in it. (Not to mention things like \"shouldn't have stuck my penis uppin\" or however it goes)\n\r\nI don't think any daughter would want to hear that from her father. =/ Nor would she want to hear her father bashing her mother, no matter how bad she is.\n\r\nI still think it's a sweet gesture, regardless.\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nthis song is strait az hell, the lyrics speak for em selvs\r\nem is so damn awesome cauz he givs ppl a way to relate and he knos it\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nIt means Eminem will always be there for Halie... FORVER...Im 14, but I know all of the sorrow of life\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nOk eminem sounds NOTHING like a boyband nor did he go 'soft'. If eminem had gone soft on this song, he wouldnt be making those comments about his ex would he? And while I'm not exactly his biggest fan, I think this is his Best song. With Eminem's songs I usually wanna find that imaginary FCC censorship button (although that's true of 90% of rappers), but this time I dont. I do sometimes think Eminem can be funny or deep and in this song he's both, so for what its worth, congratulations Eminem on making a song that's quite moving.\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\ni really like this song for some reason it makes me feel better wen i'm a bit down. i love eminem anyway so i cant fault any of his songs\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\n'God, i'm a daddy, i'm so glad that her mum didn't want her'\n\r\nwhen he supposedly sounds like he says 'didn't want her' it's all jumbled up and i think he's actually doing that coz he says 'i'm so glad that her mum didn't abort her'\n\r\ngreat song though\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nThis is the other side of Eminem.\n\r\nHe knows that when he wrote this song that he was on tour a lot and didn't see his baby as much as he wanted. \n\r\nHe sings about what an impact his little girl has done to his life and how much of an impact she still does. All of the bullshit that he's been through, he know that his daughter can  make it go away and make him smile and make him feel at home.\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\ndamn i really like this song hopefully em sings on at least one song on relapse he sounds good in his own way\n\n\r\nand its supposed to say abort her but the label censored it even on the explicit versions like on \"kim\" with the verse \"\"There's a four year old little boy, laying dead with a slit throat!\"\"\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nI love this song so much! I'm a total daddy's girl. Every time i hear this song I think about my daddy. \t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nThis was one of the first em songs i heard and it was what made me want to listen to him more and more, this, toy soldiers, and till i collapse. those were my first three songs i stumbled upon. i love how he love his daughter. and how hes trying not to be like his dad.\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nI luv this song and Eminem.\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nIt's like the best song ever! I still listen to it, and still love it!!! I love Em, and the love between him and his daughter. His voice is amazing btw.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\ni love this song! \r\ni like how he has his sensitive side with just him singing then has to get all loud and angry before the chorus starts, it's awesome. and of chorus him topping it off with a rapped verse :) he is truly an amazing artist to combine so much feeling into one song and have it actually mean something.\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nIts like wen all hells brakes out.. an everyting goin downhill wit no sign of return.. u got yur \"baby\".. somting dat reminds u an makes u really like everyting gonna b ok... i love dis song.. weneva i'm down i listen 2 it.. an i'm back again.. jus got 2 get somting 2 b my baby...lol^.^ \t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nthis is my and my daddys song but im not with him but i really wish i was but it is like noone cares :(\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nI believe he intended to use a clip from While My Guitar Gently Weeps in this song similar to how he does in \"Sing for the Moment\" with Aerosmith's song, but couldn't get the permissions so he had to take it out.\n\r\nI really enjoy this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nEminem has a sensitive side? This song seriously makes me want to cry! I almost did listening to it for the first time. He makes it seem as though he is really sensitive the whole time, Then he gets sorta that side of him that we all like. The crazy side >=|!!  People say he's all bad, But he seriously loves his daughter more then anything in the world! I like eminems sensitive side...however it's not the side I would want to listen to all the time. Plus he can't sing! I think his singing voice is horrible!\r\n~Pepsi\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nhey eminem...you are a millionare correct? well...dont you think you can afford a mirror? why do i ask that...cuz obviously you think your black! if white people want to listen to rap by all means go ahead i am a punker but will listne to dr dre if someone has it blasting in their car but if you try to be something your not (like a different race) then you are not being tru to yourself...at first im thought it was an act then i saw numerous interviews, \"naw man im straight up with that shit yo\"-mtv interview - eminem.  ummmmm rap all you want but why dont you act like vanilla ice atleast he didnt embarrass white people. so marshal, take off the doo-rag watch nascar, drink 12ounce beers (not fortys) and i will stop complaining\n\r\n-=DeAdBoLt=-\t\t\t\t\n\t\t\t\t\n\n"}