{"comment_0": "\nI think when he wrote it he was having serious problems overcoming drug addiction. \n\r\nVarious people have various reactions to various drugs, but I'm also pretty sure before No More Shall We Part came out he was suffering either a lack of creative inspiration or just a form of writers block as a result of either withdrawl from the drugs or a direct result of the drugs themselves (im a bit hazy about it, but there's something to do with drugs). \n\r\nTo me, \r\n\"My typewriter had turned mute as a tomb\r\nAnd my piano crouched in the corner of my room\r\nWith all its teeth bared\"\r\nfurthers this idea - he is unable to write or play due to craving, so he leaves the saftey of his home in order to find a drug dealer to help him write again. \n\r\n\"There rose before me a little house\r\nWith all hope and dreams kept within\r\nA woman`s voice close to my ear\r\nSaid, \"Why don`t you come in here?\"\"\n\r\nHe reaches the threshhold of his dealer, and is tempted to accept their offer of whatever drug. \r\n\"All hope and dreams lay within\" surely hinting at the potential highs achievable.\n\r\nHowever, he is aware that the \"nurse\" - presumably the side of his consciousness which wants him to overcome his addiction, or perhaps just the expectations of society - has helped him with the bad side of the drugs;\n\r\n\"But with her hot cocoa and her medication\r\nMy nurse had been my one salvation\"\n\r\nand so decides to return to the safe and secure confines of what is social normality (journeying back from a place remote in the countryside to the town: i'm guessing going to see a drug dealer isnt a highstreet affair).\n\r\nThe tears he cries on the way back are perhaps instilled by a sense of loss - although he is relieved to have made the choice he did (\"hallelujah\"), he did quite like drugs, and decides to bury the tears associated with them deep underground where they cant affect him, in a symbolic gesture. \n\n\n\r\nI dont know. I'm only 16. I cant begin to scratch the surface of the depth of nick cave's lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nYou've pretty much got it Starfighter. It's just about leaving safety, being drawn towards temptation and eventually escaping it. Probably to do with drugs, but that's not necessary for an accurate interpretation. The 'Hallelujah' in the chorus is incredibly intriguing since it sounds so mournful, yet is a joyous word. I get the feeling that's the whole point.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nHe is said to believe in a Christian God. However, there are certain aspects of religion that he dislikes, and he has also said that his position on the subject changes on a daily basis.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nSomehow I always see the nurse as a psychiatric nurse, keeping her patient doped up with (anti-psychotic?)medications; he escapes, but doesn't have the courage to break away so he has to go back. And I wonder about that \"little house\" - Cave has used this phrase before (in 'Papa Won't Leave You, Henry') to mean a brothel. Maybe the friendly young woman represents the temptations of the flesh?\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song is about leaving behind your bad habits, like drugs or alcohol abuse. First, the narrator - alone for the first time in a long time - sees what he has done: 'My typewriter had turned mute as a tomb / And my piano crouched in the corner of my room / With all its teeth bared'.\n\nThen he went for a walk, where he meets old temptations, the 'house' and the 'woman' - which are maybe a pub or something, where he met his old 'friends'. They are very tempting ('Now, you might think it wise to risk it all / Throw caution to the reckless wind'), but he thinks of someone he loves, the nurse, who had saved him ('But with her hot cocoa and her medication / My nurse had been my one salvation'). He knows he would dissapoint her when he falls back into his old habbits, so he turned home.\n\nThen he cries because he knows he has vanquished his habits, which had to 'buried' with a lot of trouble.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI really love these lines:\r\n\"And my piano crouched in the corner of my room\r\nWith all its teeth bared\"\n\r\nAnd the ending is so moving: \n\r\n\"The tears are welling in my eyes again\r\nHallelujah\r\nI need twenty big buckets to catch them in\r\nHallelujah\r\nAnd twenty pretty girls to carry\r\nthem down\r\nHallelujah\r\nAnd twenty deep holes to bury them in\"\n\r\nIt seems to be about trying to escape from a repressing comfort zone. He's trying to venture out in the world and live life, and he sees the house \"with all hope and dreams kept within\". But in the end he is too scared to enter. So he turns back home to his protected life and continues to suppress all his emotions. The image of his tears that as to be carried in twenty big buckets and buried in twenty deep holes is so strong. \r\nI think it could be interpreted as religion being the \"nurse\" protecting people from reality, and keeping them from truly living life. \r\nIn dream analysis a house is usually seen as a symbol of a persons identity, so it could be that the narrator is actually tempted, but afraid of looking inwards.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nWell, consider the fact that Nick Cave, himself, is a Christian. It's hard to believe, but he's admitted it himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nHe isn't Christian, just religious.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ni have to agree with the song being about the desire to leave the only comfort you've known, and apparently not being able to do so. just... admire it while you drive by.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nJust recently, it came to me that a nurse might be his wife who went away. So he, being alone and sad, wanted to cheat on her, but he couldn't. That would fit the idea of \"a little house\" being a brothel anyway:)\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nExcellent view of the nurse Starfighter, I agree.  I just wanted to add that this song was playing one morning as I was drifting in and out of sleep.  I heard the lyric about the cow and I got up to one knee thinking \"what the heck is a cow doing by my house?\" :)\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nSubstitute the word 'nurse' with the word 'wife'.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI feel it's a combination of what Morbid Morag and Starfighter wrote. I see the narrator in rehab with a nurse, maybe a psychiatric nurse, escaping and facing temptation then turning back. What is the significance of the cow being brown, anyone? Maybe because heroin is brown?\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nOh, my god...I don't believe in a religious one but i call divine such beauty and i conceive as \"gods\" any people and artists that create beauty. I recently discovered Nick Cave and i have fallen in love with his music. Reading the lyrics add much emotion to it and i have to say this particular song nearly made me weep. Nick Cave is a man that can touch the chords of your soul;and i call such men gods.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nje was a Junky, all the way.\r\nthe nurse is realy his nurse and the song is about him getting the change to do Drugs\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nHe's dead, or at least dying.  But he can't allow himself to die as his nurse has done so much to keep him alive and healthy.   Look at it, how his pajamas clung to him like a shroud.  And the house.\n\r\nThere rose before me a little house\r\nWith all hope and dreams kept within\n\r\nIt references a line in the Bible where Jesus speaks of His Father's house.\n\r\nSo yeah, he's dying but fighting against it.  He manages to pull himself back, but can't forget what's waiting for him.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis is about loyalty I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nTo me it's about temptation to relapse into drug addiction. He is bored and depressed, and he has done something unusual and risky (given his \"nurse\" the weekend off). He then takes to the streets, and runs into an attractive young girl.\n\nGiven the ending of the song, I gather that the pretty girl is a metaphor for heroin. It's not something I would immediately have though of, but there are strong allusions to relapse in the repeating verses at the end, where \"pretty girls\" are used as a vehicle to carry his pain away.\n\n\"The tears are welling in my eyes again,\nI need 20 big buckets to catch them in,\n20 pretty girls to carry them down,\n20 deep holes to bury them in\".\n\nNick Cave had a relapse into heroin addiction almost exactly 20 years since he started taking it. This is why he speaks of the number 20. At the beginning of these verses, he makes another mention of depression (the tears are welling in my eyes again). This is where he uses \"pretty girls\" as a vehicle to carry his pain away, which in reality is heroin. Perhaps it's a play on words, the pretty girls being his \"heroines\". \"20 deep holes to bury them in\". 20 years if digging deep holes in his arm with a needle to bury his pain.\n\nOverall, the song is one of an alternate universe, a path he wishes he'd taken. In the song, he faced the temptation, and walked away from it. In the real world, he faced temptation and gave in. The repeating verses at the end talk of the need to have something take away his depression.\t\t\t\t\n\t\t\t\t\n\n"}