{"comment_0": "\nThis is the MOST CLEVER pop song ever and you're all wrong on its meaning.  The song is about a woman who learns her man is cheating on her and decides to shoot him (Happiness is getting revenge on your cheating husband by shooting him).  The song begins: \"Sheâ\u0080\u0099s not a girl who misses much. \r\nDo do do do do do do do \r\nSheâ\u0080\u0099s well acquainted with the touch of the velvet hand \r\nLike a lizard on a window pane.\"  She's observant and when someone tries to conceal something she notices (You would wear velvet gloves to prevent stains and therefore prevent someone from detecting you).  The next lines follow: Lying with his eyes while his hands are busy \r\nWorking overtime \r\nA soap impression of his wife which he ate \r\nAnd donated to the National Trust. \r\nLying with your eyes indicates infidelity while his eyes desperately try to conceal the truth, the soap impression means that he didn't have high regard for his wifes intelligence, he figured he could commit sexual infidelity and she'd never notice because she trusts him too much.  Mother Superior jump the gun simply means Mother Superior (a nickname for the lady) pulled the trigger and shot him.  Then comes the brilliant twist, happiness is getting back at the unfaithful man.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI believe this song is about heroin addiction. \"sheâ\u0080\u0099s not a girl who misses much.\" describes the attitude of a heroin user who is relatively content with her new lifestyle. \"She's well acquainted with the touch of the velvet hand\" is saying she is familiar with the high heroin produces, comparing the calming feel of the drug with being rubbed by a velvet hand. \"like a lizard on a window pane\" If you think about what is taking place when a lizard is on a window pane it is not hard to connect it again with opiates. Just think of an animal blocked from the natural world by a window, the outside world is visible but the animal (or heroin user) is disconnected to it. \"the man in the crowd with the multicolored mirrors on his hobnail boots.\" describes a person who could possibly go undetected amongst a crowd but upon closer inspect would obviously be considered odd, someone who is different, a heroin addict. \"lying with his eyes while his hands are busy working overtime\" says that this addict is trying to conceal his drug habits while he is busy pursuing them. \"a soap impression of his wife which ate and donate to the National Trust\" refers to the corruption of his once clean lover who he consumed (turned her into an addict) and changed into something disgusting (turn her into trash and flushed her down the toilet: donating to the National trust) \"I need a fix cause I'm going down, down to the bits I left uptown. I need a fix cause I'm going down\" is saying: I need to use heroin because I'm coming down, and going through withdrawals, the lack of drugs is ripping him apart, and the uptown reference could be referring to a particular spot in which drugs are purchased, saying, I need some more heroin because I'm hurting from withdrawals, so I need to go uptown, the place I always go to get heroin. The next set of lyrics uses â\u0080\u009cgunâ\u0080\u009d to represent a needle. \"Mother superior's jump the gun\" is talking about a woman preparing a shot of heroin. \n\r\n\"happiness is a warm gun\" A needle+Heroin(which is usually heated prior to use) = happiness. The next line could be about a heroin addict singing to the needle \"when I hold you in my arms\" can be interpreted as when I've got the needle in my arm, \"and I feel my finger on your trigger\" and I feel my finger on the plunger (the part of the needle you need to push to inject the heroin) \"I know nobody can do me no harm because happiness is a warm gun\" the drug user knows that he's about to get high and therefore won't care about anybody or anything else. â\u0080\u009cBang, Bang shoot, shootâ\u0080\u009d are slang terms for shooting heroin.  \n\r\nAnd of course this is just my opinion, so, obviously itâ\u0080\u0099s 100% accurate and everyone else is totally wrongâ\u0080¦.\n\n\n", "comment_2": "\nAccording to Lennon, the title came from the cover of a gun magazine that producer George Martin showed him: \"I think he showed me a cover of a magazine that said 'Happiness Is a Warm Gun.' It was a gun magazine. I just thought it was a fantastic, insane thing to say. A warm gun means you just shot something.\"[1] The reference, whether or not intermediately from the magazine, was one of many 1960s riffs on Charles M. Schulz's culturally popular saying, Happiness is a Warm Puppy, which began in the Peanuts comic strip and became a widely sold book.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthe whole song is a metaphor for drug use. \"when i hold you in my arms and feel my finger on your trigger\" is a reference to shooting heroin.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nHey, is it *always* just about sex and drugs? Come on, give the Beatles more credit. Their songs became ever more philosophical. I know their stuff can be interpreted in many different ways - part of what makes them great - but I think this song has a philosophical slant. \r\nIt's a parody of typical love songs (i.e. \"when i hold you in my arms\") and it refers to the pleasure some people take in violence (\"happiness is a warm gun\"). The message here is about human nature and the disturbing way that we embrace violence rather than peace.\n\r\nBut I admit he \"I need a fix 'cause I'm going down\" line sounds like drugs, haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nDefinite sexual innuendo. \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThe title of this song comes word for word from an advertisement John Lennon saw in a local paper.  It's a little ironic that he wrote this song given the circumstances of his death.  By the way, can anyone tell me what the line \"A soap impression of his wife which he ate And donated to the National Trust. \" means?\n\n\n", "comment_7": "\nFirst, John's the one who screams. Second, the title was the title of an article on a gun magazine John saw. Look for a great book called \"Beatlesongs\" by William J. Dolwdling. It has EVERYTHING!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI thought it was Lennons voice... what are they talkin' about?\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\num, you guys, thats JOHN screaming, not Paul...\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nmost of this is based on magazine articles and stuff from newspapers. the man in the crowd with the multicoloured mirrors on his hobnail boots is a reference to a guy that put mirrors on his shoes so that he could look up womens skirts. i agree completely about the sexual innuendo, although i cant really be specific about anything...i love the background bit \"bang bang shoot shoot\" its making fun of people that shoot animals for sport. \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\n...obvious heroin references mixed in with perversion and the misplacement of affection...you must remember where john was in life when he wrote this bitter piece of shit song...its not funny, its depressive ramble of a soon-to-be junky, making a song to justify his actions...\"heroin is a way of life\"- william s. burroughs...now love, that's a whole other story...wdc (notice the chamelon reference as well...ie...the feminine illusion)\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nits about shooting up. a warm gun is a referance to the needle(you heat the heroin up, then inject it) so all they were saying is that they were happy when they did heroin\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song isn't about herion. its a really tough one to decipher since it has three distinct parts. john read an advertisment for a rifle maker that said \"happiness is a warm gun in your hand\" and wrote this song as a mockery of that. obviously he was anti-violence. and it IS john screaming, not paul. john could alter his voice in so many ways, it is incredible. great song\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nIdk, I just hear references to heroin when I hear this song. \r\nGun referencing to a needle, shooting up, how you feel when you're on heroin, even the first line, \r\n\" She's not a girl who misses much\"\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI always felt the song was about suicide. The song starts off describing the lives of these different people that are all planning to kill themselves for one reason or another. \"I need a fix cause I'm going down\" could be a drug  reference but it still ties in. Either getting a fix (of drugs) to try to fix their lives or to kill themselves with. Or a fix as in a fix for their situation. They need a fix cause \"I'm going down\". And \"happiness is a warm gun\" because they've finally escaped, they've just shot themselves. The gun comforts them when they \"hold you in my arms\" because they know the pain is almost over. And the 'bang bang shoot shoot\" in the background is the sound of their firing guns. \t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nIt's funny because everyone seem to have a very elaborate interpretation of these lyrics, whether it involves drugs, sex, guns/war or all three of them. Mine is actually much simpler, although maybe not as good.\r\nListening to this song, especially with the line \"Happiness is a warm gun\", I felt it was about how you always seem to hurt someone when you're happy. Humans suffer so others can be happy and when it's their turn to be happy, they often make someone else suffer.\r\nThe girl who doesn't miss much is waiting to be happy, the reference to masturbation could indicate she's a teenager who wants to fall in love. The man in the crowd is probably happy but it's obvious his wife suffers. The mother superior (if it is a nun and not Yoko or a dealer) is going crazy because she has spent her life working on behalf of others, so they could be happy, and she has missed much. The narrator (John?) is unhappy because he's going down (as opposed to being high) and needs a fix (a shot of heroin), for him too happiness involves suffering, actually his own.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nHappiness is a warm gun, if you don't take the phrase literally, is a metaphor for conversation and how people say things.  The Nirvana song In Blooms talks about a guy that likes to shoot his gun.  I believe both reference how people shoot off ideas, zingers if you will.  So maybe happiness is a really good comeback. My finger on your trigger to me talks about how someone can understand a person so well that, with a word, they can set off their temper.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nHow I see it, and I could well be wrong:\n\nA girl who has a life of wealth and is always busy (although clueless as to \"like a lizard on a window pane\"- could refer to some downside to her life\n\nA man who is poor but hides it. This makes his relationship with his wife suffer? \n\nThey both need a fix\n\nMother superior jumped the gun... She has it easy not dealing with the problems  most people face in life? Possibly saying drugs provide people with an escape? \n\nAnd happiness is a warm gun John explained he saw on a gun magazine. Although is it literal? Sarcastic I'd say.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThe first block of the song is the most enigmatic and looks like automatic writing, \"cut-up\" technique... or hazy druggy  state. All interpretations are possible there. However, from \"I need a fix..\" to the end of the song, the references to shooting up heroin are too obvious to be ignored. [off-topic:  did you notice the reference in the film Trainspotting, where the dealer and veteran junky (who shoots the least experienced, i.e. \"jumps the gun\") was nicknamed \"Mother Superior\"?].   I can believe John took the title from a magazine cover but man... just listen to the entire lyrics and choruses, can any informed person claim it is not about junk or heavily influenced by it? It is noteworthy that the Beatles have refrained from speaking about the meaning of the song... They knew they were more popular than JC and tried not to set the worst example. Heroin was a rising issue these days, a tabboo floating around, dangerous and attractive. In fact it was about to become pandemic and (sadly!) destroy counter-culture and hippism. Very soon \"the dream was over\" (replaced by hang-over). Very few dared to talk straight about such a problem these days. Lou Reed did (and long before Lennon). Compare the lines of V.U.'s Waiting for the Man,  \"up to Lexington... hey you white boy what are you doing uptown..feel sick and dirty..etc\" with \"I need a fix cos i'm going down, down to the bits that I left uptown\". There is another song in the same [white] album that is also plaged with [rather petty in this case] euphemisms: Savoy Truffle... Have you read the \"song meaning\" account by its own author? You just won't believe it ! George confessed he wrote Savoy Truffle for his friend Eric Clapton (and yes, you know what Clapton was into these days), and in particular that he used the song as to nag him for his addiction to ... chocolates!! ....hahaha !\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nCould be a reference to sex with a sly dig at actual guns.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nwhen paul screams in the third part of the song...\"when i hold you in my arms, and I feel my finger on your trigger...\"  paul screaming lyrics is the best.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nIt is quite rare that we get to hear Paul scream some lyrics but I still think hands down that John is the best. Actually, it sounds the best when they all harmonize as in I'll Be Back or just John and Paul as in If I Fell.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThe National Trust is slang for the toilet, I believe.  One could then infer several meanings from the line...\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\npaul screaming rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\ni heard it was about drugs?? but i can see both sex and drugs\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThe finger on the trigger reference to me is obviously about a woman's clitoris ie. in control of \"setting her off\". The National Trust lyric means that the Beatles shit would be treasured by all. \t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThe lyrics of this song have no meaning at all, or hidden metaphor. It is John screaming, but it does sound like Paul.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI can see the sexual innuendo, but the last part seems to me to be about shooting heroin.  I need a fix â\u0080\u0098cause Iâ\u0080\u0099m going down, also sounds like heroin withdrawal.  Amazing song all around!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI've been thinking of the entire heroin connection and realized that the nickname of the drug dealer in the movie trainspotting nick names is mother superior due to the length of his habit.  I was wondering if it was used the same in this song.  Mayb even John writing about himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nLennon said in an interview that it was about sex.  Nothing more nothing less.  Now, you don't have to believe him but just know that he said it is about his sex life.  I guess it's not a bad thing to keep in mind he did write a lot of his solo music about his heroin addiction though.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nMy mother told me that this song was a mocking of the Vietnam War. Lennon declares, \"When I hold you in my arms and feel my finger on your trigger, I know, know one can do me no harm,\" he is mocking the hicks who actually feel that way when they hold a gun. And the part about the ad in the newspaper is true. Other Beatles songs inspired by newspaper ads are, \"Cry Baby Cry\" and \"A Day In The Life.\" And also, \"Mr. Kite\" is based on an antique poster. Many writers, be it lyrics, poetry, books, get ideas from the paper.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nmeta4therain, I believed this was the meaning too but that was before I heard John already said it was about sex. Although John may have just said that was what it was about, as he did with MANY of his songs. He probably did have Vietnam in mind when he wrote this, I always felt it was a mock of the war too.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nNot really about sex, a relationship yes, but not sex, happiness is a warm gun meaning doesnt it feel so powerful just to hold a gun. Kinda like Pearl jam's song Glorified G. Very ironic song about john's death.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\ni don't know, man, have you ever seen \"Pulp Fiction\", (Greatest Movie Ever)? Vince (Travolta) Shoots up And Almost proves my point. But they did sing about suicide, though, so maybe.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI NEED A FIX CAUSE I'm going down\r\njohn asks HELP\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nof course, the \"i need a fix\" part does kind of hint at heroin... he was on it at the time. either way, amazing song\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nJimmy5Kittens: \"The lyrics of this song have no meaning at all, or hidden metaphor.\"\r\nWhat a retard! Of course it means something. Like most everyone said. YOu can take it a lot of different ways.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nLennon, who got the idea from a gun magazine cover that read, \"Happiness Is A Warm Gun In Your Hands,\" also Lennon's original song title. The song dealt with three themes. The first was Lennon's indignation of the American firearms lobby; the second was a sort of rock 'n' roll history; and the last was imagery that conveyed Lennon's sexual passion for Yoko.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\njust a little extra note for those who want to hear it... the intro the The Used's \"Cut Up Angels\" contains a reverse sample of this song sung by the Used's lead singer.... (who used to be a big heroin/drug addict himself) but their song is about 2 people who have had such bad lives and are trying to start a relationship... its a good song you should listen to it :)\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nWHY DOES EVERYTHING HAVE TO BE ABOUT DRUGS TO YOU PEOPLE??? This song is not about heroin, in fact, John hadn't even used heroin yet. this song is mostly about him and Yoko, like most songs in this period were.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nYou know what i think?  i think you should only say that some song IS about a certain thing if you know for a fact.  otherwise say you THINK it is.\n\r\nIn my opinion, this song COULD be about drugs, although i doubt it for basically the same reason Ana99 thinks it isn't about heroine.  Also, it COULD be about john and yoko, although that isnt positive, and that doesn't make sense to me because where does it imply that?  i suppose the part that says \"Sheâ\u0080\u0099s well acquainted with the touch of the velvet hand \r\nLike a lizard on a window pane. \"  could be it.  also, its possible its about sex.  it could also be \"a sort of rock 'n' roll history\" or it could be Lennon's indignation of the American firearms lobby.  it all depends on how you interperit the lyrics.  also i think it has something to do with the feel of the music if you listen to it.  i personally dont really know, but those are what it is possibly about, in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI think that it's important not only to interpret the song by it's words, but by the instruments as well. When the guitar comes in before \r\n\"I need a fix â\u0080\u0098cause Iâ\u0080\u0099m going down. \r\nDown to the bits that I left uptown. \r\nI need a fix â\u0080\u0098cause Iâ\u0080\u0099m going down. \" \r\nIt sounds like someone's life is spinning out of control.  This could be interpreted in many different ways, and I think that's the point.  That's why the song is so genious, one can interpret it their own way and apply it to their own life.  Each person can derive a different meaning of the song, and that's OK.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI think that this song is totally about sex, like John said in his interview. I can see how someone might get a heroin reference in some parts of the song, but it ignores other parts. \r\nCan't a gun be a euphemism for a man's...? And the girl is the trigger. \"Mother Superior jump the gun.\"\r\nIn the beginning, i think that he is saying that his girl is experienced in the bedroom. \r\nAnd the soap impression? Could that be a \"clean\" version of the wife, and the hobnail boot man \"ate\" her -- another euphemism. He would rather have the dirty one.\r\nAnyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI love the way this song was used in Bowling For Colimbine very cool effect.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nthis is song is a mix between the sex and drugs. thats happiness, not that i do drugs. but the bang bang shoot shoot can be interpreted either way you want. they were really on something back then man\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nOk, everyone can interpret this song in their own way. Nobody is 100% right. But what i want to know is, does anyone have any idea regarding this line: The man in the crowd with the multicolored mirrors on his hobnail boots ???\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nmaybe looking under womans skirts you never can tell what theses guys are talking about but i like to see what other people get out of all theses songs if everyone was beatles fans the world would be a better place\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nthis song is so mysterious and slow. it's fun to sing along to.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nJohn definitely wrote and sang this song and probably played the intricate guitar parts.\r\nThis song is one of my bizarre favorites.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nthis song is about drugs and sex, obviously and yeah it was john screaming not paul.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nhap - penis is a warm gun\n\r\nmy textiles teacher pointed that out to me\n\r\nbut i think its just a funny coincidence, as the magazine article is generally accepted to be the explanation for that section of the song.\n\r\ncorrect me if im wrong, but isnt lennon on record somewhere saying its three different 'songs'/elements cobbled together? The version on anthology 3 deffinatly points towards this as the happiness is a warm gun section doesnt even exist yet.\n\r\n.xXx.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nits about john cheating on yoko while he was doing heroin morons\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nThe thing I love about this song and a lot of Beatles songs is you go into it with a certain state of mind and you take from the song whatever is relevant to your life or mood at that point. Going into a song looking for the \"correct\" meaning is unfulfilling, because the whole point of music is to apply to you and move you emotionally. \n\r\nThe first time I listened to this I felt the sexual message very strongly. But go back and listen to it in a different state of mind (chemically altered or not) and you may pick up more on the desperation of drugs. Or even another mood and you get the message of irony and anti-violence. I have no idea exactly what John intended when writing this, but I believe he had his sex life in mind, and possibly other things. Most importantly he knew that music is art and it applies to everyone on a different level.\n\r\nI love the slow and sometimes desperate but still passionate and fierce feeling of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nIn addition, the almost dirty sexual message in the first part of the song is too strong to miss. John seems to be referring to a sexually experienced woman, who's not naive to the perverts (on a plainly sexual or deeper level) in the world. The line \"Lying with his eyes while his hands are busy working overtime\" seems to be a guy jacking off to women he's trying to seem human to. And the soap impression makes me think of the man objectifying his wife, using her, and then throwing her down the drain. The whole feeling of the song is desperate and dirty, sex, drugs, or anything else.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nu guys do realize that its a john lennon song n its not paul singing but john lennon rite\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\n\"When I hold you in my arms \r\nAnd I feel my finger on your trigger \r\nI know no one can do me no harm \r\nBecause happiness is a warm gun. \r\nYes it is.\"\r\nThat is an obvious reference to heroin, the plunger on a syringe is called a trigger alot, and the tube and needle  is called a gun (I had a bunch of friends who used to shoot morphine). But yeah idk about the meaning for the rest of the song, but the ending is for sure about heroin, like the \"no one can do me no harm\" part is obviously a reference to getting waxed\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nitÂ´s not Paul the one who screams!!!!!!!!!!!!!!!! thank you bite me, it was making me nervous.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\ni heard barry bonds used to sing this when taking steroids\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nyou dipshits the song was written and song by John Lennon!!!! NOT Paul!!! and i always heared it was either about heroin or a guy wanking off but its john so i guess u neva can guess\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nyeah, whoever said that Paul screaming during the song was the best part probably ought to relisten to it or might have the wrong song.... Happiness is a warm gun is completely John. Good try fools. And anyone who said the song was about herion is way off also. Lennon said in an interview that \"H\" was not part of the song and that most of the meaning was sexual, about Yoko, etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nThis is my fav beatles song. I think it could be about a girl whos like thinks shes really into sex an perverted stuff hence the 1st sorta verse is saying she knows about the perverts and the men that will cheat on her but she doesnt really mind, she feels flattered by the attention even if its only seein her as a sexual thing, she'll easily let men walk all over her. I think the girl is insecure and feels no1 loves her so she lets herself be used. 'happiness is a warm gun' describes how she makes herself feel happy by 'warming up' the thing that could hurt her\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nI believe this song is about heroin.  the \"when i hold you in my arms and feel my finger on your trigger i know no one can do me no harm cuz happiness is a warm gun\" is an obvious reference to shooting up. The earlier parts of the songs is just examples of crazy things that were goin on during the area, sort of things wrong with the world that would cause someone to do it. \"The man in the crowd with the multicolored mirrors \r\nOn his hobnail boots \r\nLying with his eyes while his hands are busy \r\nWorking overtime\" was about some guy who fixed mirrors to his boots so he could look up girls skirts. THere is alot of references to wierd news items of the time. Showing the flaw of man and y you need an escape, in this case, heroin\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nyou'll never know the meaning. it's a metaphor on top of a metaphor. a mystery wrapped in an enigman. elliott smith (bless his heart) did the same things (you know how he was heavily influenced by the beatles). it's a song about something (most likely yoko...) but the front is drugs. mother superior fix. etc etc etc. yoko's a drug for john. elliott wrote songs that were interpretted as songs about heroin addiction when he hadnt even tried it until later in his career.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI agree completely with Dirty Dan on the meaning.\n\r\nI love this song. I'd even go as far as to say it's my favorite Beatles song, if not one of my favorite songs of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nthis song is about heroin. a warm gun is a needle full of heroin. john did do herion but never through a needle he snorted it. People that use heroin soak it in to a cigarett butt before they putit in to the needle and leave the butts (bits) behind.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nObviously, this song has a lot of drug references in it.\r\n    \"I need a fix coause I'm coming down.  Downt to the abyss (or bits) that I left uptown.\"\r\n    OK, in junky lingo (Whcih goes way back), calming drugs like heroin are called \"downtown\" and stimlating ones like speed and cocaine are called \"Uptown.\"\r\n   Of you take a shot of \"uptown\" you will be \"UP\" for a while, but then you will \"come down.\"\r\n   When you do, you will be tired, depressed, and have frazzled nerves.  At this pont, it would be very nice to have a \"FIX\" of heroine, which would calm you down.  And make you happy.  And which, by the way, does have to be heated up, unlike the stimulants.\r\n    This dosn't negate the sexual interpretations.  The act of injecting drugs creats a feeling similer to orgasm, and is often comapred to sex.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI'm studing music at a major north american university and we covered this song in one of my courses last year. The prof who has a PhD in ethnomusicology and who is a -huge- Beatles fanatic made some very convincing points concerning the meaning of this song. \r\nI agree that it is mostly about sex as Lennon said in the interview but there is obvious reference to drugs (as in many Beatles songs, even the early ones). \r\nFirst of all, gun is a Brittish slang term for penis and listen in the background for the other Beatles singing \"bang bang, shoot shoot\" which is a euphemism for ejaculation. \r\nSecondly, \"Mother Superior\" definately refers to Yoko. Lennon revered her and had somewhat of a oedipus complex towards her, seeing her as a mother figure. \r\nThirdly, the first part of the song is meant to be non-sensical. Lennon loved words and wrote his songs to fit the rhythm of the words that he used. He picked somewhat random words and put them together in a way that was metrically and rhythmically interesting.\r\nFinally, it is true that the idea for the song came from the cover of a magazine so it would not be a strech to say that it also has an ironic anti-war message. \n\r\nThe person who said that this song has many different layers is completely right. It does and that's what makes it such a great work of music.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI'm sorry, but this song just sounds a bit dirty to me...\r\nBut I heard the title comes from an advertisement in a gun magazine. So I'm thinking that whoever made that gun advertisement knew that slogan sounded really sexual, because of that whole sex sells thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI love when John hits that high note! Man thats the shit right there\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\ngreat harmonizing\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nThis song has the most fucked up time signatures.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nWhen i first heard this song, i immediately thought it was about committing suicide for some reason... i guess i didn't really think about the rest of the words much. Then i read somewhere about someone interpreting it weirdly, and \"not as a song about sex as it so obviously was\". So i went and listened to it again.\n\r\nI took the lines\r\nI need a fix â\u0080\u0098cause Iâ\u0080\u0099m going down.\r\nDown to the bits that I left uptown.\r\nI need a fix â\u0080\u0098cause Iâ\u0080\u0099m going down.\r\ni took this as meaning he hadn't had any sex for a while, and he was starting to get a bit antsy so he needed a \"fix\".\n\r\nBut this is just how i took it... i don't think anyone can say for sure what it's about... except John... wait, *HE* said it was about sex... hm you could ask him again... oh wait, he's dead. **cries**\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\ni think it's pretty much clear that this song is about the war.\r\n\"I need a fix â\u0080\u0098cause Iâ\u0080\u0099m going down.\r\nDown to the bits that I left uptown.\"\r\ni think it means, in the war he must of gotten shot and is \"going down\" and hes returning to the \"place that he left UPtown\" meaning heaven.\r\n&this song was in \"bowling for columbine\" the documentary by michael moore which is about the columbine shooting.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nand maybe john just said it was about sex.\r\nlike he does with most of this songs, he says stuff but it doesnt actually mean the song is about that certain thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nWell whatever the meaning, it's definitely John \"screaming\". Great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nBEST SONG EVER. end of story.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nTHE SONG IS ABOUT MASTURBATION\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\n\"This song has the most fucked up time signatures.\"\n\r\nif you take this song as a reference to drugs, it fits perfectly with the lyrics. When the lyrics in the song song start singing \"I need a fix cause I'm going down\" is when the speed and poppiness of song comes crashing down, almost to a halt, and it feels to the listener almost as though they are crashing as well. It begins to pick up again at \"mother superior jump the gun\" but not to the same poppy speed. The song at this point sounds more panicked and creates a sense of panic in the listener, perhaps somewhat representing the feeling of withdrawls. finally he gets what he needs, and the song again slows to a more comfortable speed, with alot of harmonizing and very calm music. creating a somewhat euphoric feeling similar to that of being intoxicated.\n\r\ni can also see many sexual references, moreso in the begining of the song. and am not completely decided on the meaning of this song, but i find that people are not analyzing the music as thoroughly as they are focussing on the lyrics.They are both elements of the same machine, and you may be able to find support for your case by listening to the musical element of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\ni havnt a clue about the line a soap impression of his wife wich he ate and donated to the national trust but the song is like devils advocate its talking about how so many people think that war can solve our problems\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nvenusinfurs is rite but william s. burroughs sais junk not heroin and he used morphine hence the awsome jazz song old fashion morphine\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nhaha retired explorer is rite but its a bit of a pun about the poppy speed seeing that heroin originates from opium wich comes from the poppy plant\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nThe song is about happiness attained through hurting others. The first part is about a man having sex with a woman, despite the womans discomfort. The second part is possibly about the pleasure of drug use, or possibly murdering someone. Mother Superior was Johns nickname for Yoko. And Johns rant about the gun was simply summarising the idea of happiness through hurting others, and thus holding 'a warm gun'.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nThis is the wierdest beatles track I've ever heard. when i first listened to it, I thought \"........................................OKAY....................\" It's a funny song though, especially at the ending where it undergoes a major mood swing from mysteriously freaky to extastic. Haha. Mood swings. much like the effects of \"Lucy in the Sky with Diamonds\" if you get the obvious play on words. Beatles ROCK!!!\n\r\n-lennonismygod\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nI don't know if anyone said it yet (sorry I didn't read all the posts) but John said somewhere that Mother Superior is a reference to Yoko... he did call her Mother.  Whenever I want to know what is going on with songs, I always look to what the artist said.  John says a lot about songs in his 1980 inteview with Playboy... I think this song is mentioned there... but look it up!\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nyoko is a psycho bitch from hell!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\n\"When I hold you in my arms, And I feel my finger on your trigger\" trigger = heroin Needle...\n\r\n\"Because happiness is a warm gun. \" heroin needs to be melted down before you shoot it up so happieness is a warm gun is say that happieness comes from heroin... end of story\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nWow, I really love it when John sings the word \"gun\" like \"ga-wa-han\" so incredibly sexy.\n\r\nAnd please, quit it with Yoko. She's a great artist. She's a strong woman. And John even said that he was a half without Yoko. Please give her some respect.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nthis song is the best\r\ni feel bad. because my sister had to show it to me. i never even knew it existed. but now that i listen to it.\r\ni love the screaming whoever it may be\r\nand i love HAPPINESS IS A WARM GUN\n\r\nit truly is\n\r\n:D\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nyea ummm thats actually john lennon screaming so its odd how much u like pauls sxcreaming when actually its john just shows who was better i guess\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nfirst, i can't believe that some beatles fans can't tell who is singing this song...as for the meaning, I think that it is probably about sex rather than drugs. I have read that Lennon did not shoot heroin anyway (he snorted it). If he didn't shoot heroin, and especially if he didnt by 1968, then that takes away the whole junky meaning. Mother superior is the nun in charge of a convent. Strange to think of Yoko as a head nun, though. Overall, I think its about sex with so many references to women, velvet touch, trigger, etc. Happiness is warm gun: orgasms make John feel better......or it could just be nonsense like so many Beatles songs...a mood not a meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nI thought it was about sex,\r\nthat whole finger on a trigger thing.\r\nHe's gonna set her off.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nfucking best song ever\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\n\"lying with his eyes while his hands are busy working overtime...\"  definate masturbation reference there.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nthink_free hit the nail on the head, in my opinion. I listened to it again a couple of times after reading some of the posts. Here's my interpretation:\r\nThe beginning is about John's obsession with Yoko: how she is mature enough to understand that sex is a game and promiscuity is widespread. 'Velvet hand' and 'lizard on a window pane' hint at prostitution. 'The man in the crowd with multi-coloured mirrors on his hobnail boots' is a pervert, that masturbates while looking up women's skirts. He was reduced to such a form after he consumed the idealized image of his wife ('soap impression') and subsequently parted with it ('donated to the National Trust').\r\n'I need a fix cuz I'm going down' is John dealing with the realization that relationships are inherently phony to human nature and promiscuity is abound. From this point onward, sex and drugs become interchangable: the 'gun' can be both a syringe or a phallus. 'Mother Superior' can refer to a drug dealer or a woman jumping 'the gun'. The 'warm gun' that creates happiness is purposely ambiguous as well (bang, bang creates sexual innuendo whereas shoot is more strongly connected to narcotics).\r\nIt's quite possible that the contrasting time signatures between drummer and vocal parts in the section that starts with 'When I hold you in my arms' was done to illustrate that sex and drugs, while topically different, have an intertwined foundation. 'Feel my finger on your trigger' seems to be an obvious double-entendre. 'I know no one can do me no harm' ties both sex and drugs together with the freedom of mind that mortality can create. The high 'gun' is a final orgasmic pageant, all things examined. :o)\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nWow, i totally agree with Dirty dan. i never thought of the song that way until now. It all makes sense. The song is about a woman who's man is unfaithful and obviously thinks lowly of her. He could also be abusing her (and i feel my finger on your trigger, and know no one can do me no harm) that quote also makes it seem like it was his gun that she took to shoot him. There is a definite sexual innuendo and the man seems like a creep (using mirrors on his boots to use look up girls skirts). I believe the song is coming from the woman not the man. also Lennon could have added the metaphor of shooting up heroin (\"need a fix, cause i'm going down) so it could go both ways at the same time, maybe a hidden desperate message of his drug abuse.  tho i wouldn't call this song pop, more like blues mixed with pure 70's brit rock. But one things for sure, this song is pure genius. Lennon is a music god!\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nI think casperld is right. In the Anthology book, John mentioned how the three parts of the song were like a mini history of rock and roll. It's also about that gun ad he saw, and references drug use, etc...\r\nThat being said, this is one of my favorite songs ever. All three parts are euphoric, especially the harmonies during the \"happiness\" part and John's screaming. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI seem to be the only person who thinks this song is about suicide. The happiness is the sense of relief that comes from the narrator killing himself i.e. the warm gun.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nThis song is three unfinished Lennon songs strung together.  The \"Mother Superior\" part is about Yoko. The weird time changes were not done live.  They were edited together in the studio.  If you listen closely you can hear the edits.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nI got the impression it was about sex/clitoral stimulation.\r\n\"When I feel my finger on your trigger\" - yeah...\r\nBut I could understand the heroin thing, too.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nthis song is divided into 5 parts, it's about sex and drugs. the first part is about a girl...sex. the second part is believed to be from an acid trip from Lennon. then I need a fix, that's 3. Then mother superior part, the herion addiction and the doo wop part at the end I'm not sure about that.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nI get all my info from wikipedia, so probably the most accurate source on the net.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI thought this song was about someone's love for guns, but maybe i'm wrong\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nI thought this song was about someone's love for guns, but maybe i'm wrong\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nYou know, I thought the lyrics were \"happiness is a warm girl\"...much more romantic, huh? =)\r\nI would think this song is about sex.  \r\nA warm gun could be a boner. But of course, there are all these Beatle fanatics screaming that it was the title of a news article that Lennon saw.  (killer XD)\r\nMother Superior jump the gun? jumping the gun is an idiom for starting something too soon, I beleive.\r\nso is it marragie? or celibacy? nuns, nuns. \n\r\nI need a fix = for SEX, people! It's addictive.\r\na soap impression of his wife, like a soap opera.  He thinks her drama is crap (NAt'l trust)\n\r\nfinger on trigger = clitoris\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nMy dad told me that the line\n\r\nThe man in the crowd with the multicolored mirrors\r\nOn his hobnail boots\n\r\nwas about men that would attatch mirrors to their boots in order to peek up ladies' skirts and concerts and such.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nat concerts--\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\n\"I need a fix\" - heroine\r\n\"I'm going down\" - the current high is wearing off - heroine \r\n\"down to the bits that I left uptown\" - out of H, desperate to find remnants - heroine\r\n\"when I hold you in my arm\" (not \"arms\")\"trigger\" - syringe - heroine\n\r\nFor 40 years, this song has always been about heroine addiction, and I've never heard anyone disagree with that interpretation - till tonight when I read the above posts.  But I didn't see anything convincing for a different interpretation.\n\r\nYou can argue for years what the opening poem is about - maybe delirium... maybe an actual woman, but I doubt it.  To me, it's a run-on that mimics a mind out of control.  It make no sense. It's a deteriorating state of mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nonly the beatles can say \"i need a fix caz im going down\"  lmfaoo gotta love these guys they say wat they want and dont care   haha\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nyou guys have it all wrong happiness is a warm gun is the realization that you have to be strong because people will try to get your spirit down.  only when you are strong that you are happy. hence\" happiness is a warm gun\". strong will and disire to do good.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\ni like this song also because of the blues riff. ta na na na na naaaa... then the cord. that part right there kick serious ass.   but recently i saw peter frampton did \"black hole sun\".  and he got the guiter to sound even deeper. i don't know how he did it maybe i don't think it was that mouth piece i think it was his guitar.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nI picked up a LOT of sexual innuendo, call me perverted but here's what I see -\r\ngun = phallic symbol, warm gun = sex\n\r\n\"The man in the crowd with the multicolored mirrors\r\nOn his hobnail boots\r\nLying with his eyes while his hands are busy\r\nWorking overtime\" = pervert masturbating\n\r\ntrigger = clitoris, or I think it might refer to masturbation where 'you' refers to the penis.\n\r\nI'm not sure what the stuff in between means though.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nMy favorite parts of this song, is the first part, the melancholy melody at first, and i absolutely love the ending melody, the doo woop ballad, which is sorta happy sounding, but at the same time, it's kinda sad. im not too much into the middle part (mother superioir), but i loveee the part right after. overall its a pretty good song. i also love the version on across the universe. this song goes all over the place when it comes to the melody, but then again, thats what makes it unique and so good. this song can have multiple meanings, in fact, it does have multiple meanings. overall great song, its a type of song that has many feelings to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\ni dont think this song has much meaning. it is more just twisted surreal images a la William Burroughs. John was detached from normal life and in his own world, but often little snippits of the obsurd would seep into his mind. An example of this is the advertisement \"happiness is a warm gun\" its to do with sex and heroin i guess.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nI have absolutely no idea what this song is about. And i agree, Paul screaming lyrics only makes it better. =]\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nYeesh. People. HEROIN. IT'S HEROIN.\n\r\n\"She's not a girl who misses much...\"\r\n(\"Missing\" is a term for not hitting your vein with a needle when shooting heroin.)\r\n\"She's well acquainted with the touch of the velvet hand\r\nLike a lizard on a window pane...\"\r\n(Velvet Hand refers to the warm rush associated with shooting heroin. Windowpane was a strong form of LSD.) \n\r\n\"The man in the crowd with the multi-colored mirrors\r\nOn his hobnail boots...\"\r\n(Supposedly, a story John Lennon read about a man who was arrested for placing mirrors on his boots to look up women's skirts.)\r\n\"Lying with his eyes while his hands are busy\r\nWorking overtime...\"\r\n(Said to be the shifty nature of a street drug dealer, looking for cops while moving his product.)\r\nA soap impression of his wife which he ate\r\nAnd donated to the Nation Trust.\r\n(\"A donation to the National Trust\" is slang for taking a shit in the bushes.)\n\r\nI need a fix 'cause I'm going down\r\nDown to the bits that I left uptown\r\nI need a fix cause I'm going down\r\n(\"Fix\" as in fixing up heroin, \"going down\" as in coming down and needing another hit to keep from being sick or not high.)\n\r\nMother Superior jump the gun!\r\n(\"Mother Superior,\" think \"big or long habit...\" \"Jump the gun\" is a term meaning pull back the plunger on the syringe and get ready to inject the dope as \"gun\" is slang for a needle, hence the term â\u0080\u009cshoot dope.â\u0080\u009d)\n\r\nHappiness is a warm gun!\r\n(\"Warm\" think freshly cooked.)\r\nWhen I hold you in my arm,\r\n(If you listen you will notice he says \"arm\" not \"arms.\")\r\nAnd I feel my finger on your trigger,\r\n(\"Trigger\" is slang for what you pull on a hypodermic needle.) when injecting.)\r\nI know no one can do me no harm,\r\n(Dope produces a warm happy safe feeling high.) \r\nBang, bang! Shoot, shoot!\r\n(You get it.)\r\nBecause happiness is a warm gun\r\n(Yes it is.)\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nJohn explains the meaning of the song in an interview \n\r\nLENNON: \"No, it's not about heroin. A gun magazine was sitting there with a smoking gun on the cover and an article that I never read inside called 'Happiness Is a Warm Gun.' I took it right from there. I took it as the terrible idea of just having shot some animal.\"\n\r\nPLAYBOY: \"What about the sexual puns: 'When you feel my finger on your trigger'?\"\n\r\nLENNON: \"Well, it was at the beginning of my relationship with Yoko and I was very sexually oriented then. When we weren't in the studio, we were in bed.\"\n\r\nPLAYBOY: \"What was the allusion to 'Mother Superior jumps the gun'?\"\n\r\nLENNON: \"I call Yoko Mother or Madam just in an offhand way. The rest doesn't mean anything. It's just images of her.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nThis song is fantastic. I love the way that they could switch up the song tempo like 3 or 4 times and never turn the listener off to what they were doing. Musical Geniuses by far.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nSome people are commenting on the line about the hobnail boots...and I agree that it's probably referencing looking up the skirts of females...but I just wanted to add that hobnail boots were/are often used in the military, which maybe could add some more depth to the lyric.  Who knows, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nI think this song is definitely about sex, and is about the feeling of rejection when your woman turns you down. Hence the \"I need a fix 'cause I'm going down.\" As well as the the happiness and peace of mind that comes with a healthy sexual relationship: \"Happiness is a Warm Gun\" and \"When I feel my finger on your trigger..\"\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nits definitely a sexual innuendo\r\ni hate how they portrayed this song in across the universe\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nWhoa, I just got it!\r\nAt first I thought it was about drugs. I never did get the sex ref.\r\nWhat I think, is that it's in 2 parts.\n\r\nFirst part is a woman finding out her husband is being unfaithful and treating her like a fool (She's not a girl that misses much / Lying with his eyes while his hands are busy working overtime)\r\nThen when the rock kicks in, it's about her feeling so horrible and hopeless and taking her life so she can just escape it and be happy.\n\r\nI need a fix 'cause I'm going down.\r\n...\r\nI know no one can do me no harm\r\nBecause happiness is a warm gun\r\nYes it is\n\r\nAlso ties in to Max from Across the Universe. He's in the hospital after being in such a horrid place as Vietnam, so he's feeling pretty hopeless. You know?\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nEveryone is right. Don't you see its obviously a song of multiple purposes. John Lennon loved to create complexities in his music to show off his genius so that mere listeners  such as ourselves would constantly search for his meaning. He wanted to write a song that brought three emotional chords he had been having that all felt similiar, into the same song just as he felt them at the same time in his life, but particularly tripping on acid (when he wrote half the song). Its three stories in one song. Each in three sections. I'll map it out.\n\r\n(Sexual version)\r\n\"She's not a girl who misses much\" - Yoko, she's a smart and clever girl. This is a phrase John lennon's father had used to describe smart and clever people.\r\n\"She's well acquainted with the touch of the velvet hand like a lizard on a window pane\" - She's no stranger to sexual stimulation just as a lizard is no stranger to the warm sunlight from a window.\r\n\"The man in the crowd with the multicolored mirrors on his hobnail boots\r\nLying with his eyes while his hands are busy working overtime\r\nA soap impression of his wife which he ate and donated to the National Trust\" - This is John speaking of himself. Not saying he is a pervert. He was just out of his marriage (which sexually frustrated him) at this point and he felt like he was as perverted as the man in the crowd with the mirrors on his hobnail boots. He masterbated often, but his wife, although considered clean, was (in the lennon shock value fashion) being excreted out of him in a very unclean way (cheating on her). (donating to the National Trust is a sarcastic statement about helping the National trust, an organization dedicated to perserving the enviroment by shitting in bushes.\n\r\n\"I need a fix 'cause I'm going down\r\nDown to the bits that I left uptown\" - He needs Yoko, his frustration is mounting.\r\n\"Mother Superior jump the gun\" - She gives it to him.\r\n\"When I hold you in my arms\r\nAnd I feel my finger on your trigger\r\nI know no one can do me no harm\" - An obvious exclaimation of his feeling safe with Yoko and pleasing this woman brought him back home.\r\n\"Because happiness is a warm gun\r\nYes it is\" - A warm gun is a dick in a vagina. And yes it is indeed happiness. Especially now that John doesn't feel so frustrated any longer.\n\r\n(Herion version)\r\nSee spiddygoodlegs post, it explains it pretty well.\r\n\"The man in the crowd with the multicolored mirrors on his hobnail boots\r\nLying with his eyes while his hands are busy working overtime\r\nA soap impression of his wife which he ate and donated to the National Trust\" - This is John professing that he has so far been into LSD and had not yet ventured into herion but was just lying to the outside about not wanting it while his hands were craving it since his Mother (Yoko) used it and she was smart, and wise and he wished to be her equal. In doing so he would be again, shitting out his wife who did not do herion and spoke against such hard drugs and was therefore 'clean', hence the soap.\n\r\n(Including current world affairs)\r\nSome of the opening statements are about stories in newspapers or magazine ads which he related to his sex and drug situation.\n\r\n\"The man in the crowd with the multicolored mirrors on his hobnail boots\r\nLying with his eyes while his hands are busy working overtime\r\nA soap impression of his wife which he ate and donated to the National Trust\" - See both explainations above.\n\r\n\"Happiness is a warm gun (bang bang, shoot shoot)\r\nWhen I hold you in my arms\r\nAnd I feel my finger on your trigger\r\nI know no one can do me no harm\r\nBecause happiness is a warm gun\r\nYes it is\" - Comparing a soldier's emotions of comfort with a gun to that of his own toward drugs and sex. Recognizing the relation to his own idiocy of need for his pleasures and the idiocy of a soldier with his gun.\n\r\nAlso, I think that Dagger dan could also be correct. And that his version could be Lennon's fear of his own wife if she were to discover his wrongdoings.\n\r\nPoint is, the song is meant to evoke a specific mindstate that Lennon felt in several areas in his life. Even though each subject is different, they all made him feel the same. So he worte a song that covered them all and connected each emotion and feeling.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nAlso, about the time signaturesa being absolutely ridiculous... they are.\n\r\n     She's not a girl who misses much... (0:00-0:14): \r\n4 bars of 4/4. \r\n     She's well acquainted with the velvet touch... (0:14-0:45): \r\n1 bar of 4/4 \r\n1 bar of 2/4 \r\n5 bars of 4/4 \r\n1 bar of 5/4 \r\n1 bar of 4/4. \r\n     I need a fix cos I'm goin' down... (0:45-1:13): \r\ntwice through a 3 bars/4 bars/4 bars series of 3/8 (i.e. 22 bars of 3/8). \r\n     Mother superior, jump the gun... (1:13-1:35): \r\nthrice through a bar each of 9/8 and 10/8. \r\n     Happiness is a warm gun... (1:35-2:43): \r\n4 bars of 4/4 \r\n3 bars of 12/8 (with the drums doing 4 bars of 4/4 and 1 bar of 2/4!) \r\n5 bars of 4/4 (the final bar entering free time) \r\n1 bar of 2/4 (in free time) \r\n5 bars of 4/4\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI love this song, maaaan.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nJohn took many influences from this song out of the media, the line 'Happiness is a worm gun' came from a billboard john saw in america with the line 'happiness is a warm gun in your hand' trust america...\r\n'She's not a girl who misses much' john wanted a line for a girl who was smart, and got help with this line. \r\n'The man in the crowd with the multi coloured mirrors on his hobnailed boots' was about  astory john had read about a man who had mirrors on his boots so he he coul look up girls skirts.\r\n'lying with his hands while his eyes are busy working over time' was another story from john had heard about a man who was stealing things from a shop by using a big trench coat with fake hands sticking out of the sleeves.\r\nIt was written in 3 seperate sections, the first, up to the national trust line, after which john wrote 'Dirty Old Man' on his lyrics sheet. the second section was up to the MOther Superior bit, next to which John wrote 'The Junkie' and the third section was the remainder of the song, next to which john wrote 'The gunman'\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nAnd it is John screaming the lyrics, not Paul. Although Paul can scraem, Lucille? Helter Skelter?\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nBANG-BANG!!!    SHOOT-SHOOT!!!\n\r\nThis song is pure genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nthe song as a whole is great, but the intro is just fantastic\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\ni'm not sure if it's sexual innuendo\r\nbut i think it's definitely supposed to represent sex appeal of the girl being described.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\ni think tha line that says \"i feel my finger on your trigger\" is about the man who touches the girl's clitoris ... the rest is about shooting heroin or maybe is about shooting the man who seems, by the words of the song, that he cheates her\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\na warm gun is slang for a shot of heroin because unlike speed or coke you half to fire the spoon with a lighter or candle before you draw up your shot to break it down and thus the \"warm gun\"\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nby the way john lennon sang lead vocals\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nI love this song. I love the way John sceams the song. Paul sings \"bang bang, shoot shoot.\"\n\n\n", "comment_134": "\nhonestly, i think it means that happiness, although wanted and enjoyable, can be one's demise.\r\nhence the warm gun.\n\n\n", "comment_135": "\nAlright, I think that every one needs to just chill out, this is a place where opinions are welcomed and not mocked, where people should be able to offer their own insight without being belittled by someone else who has a different view. Music, like art, is supposed to be open to interpretation. None of you may be right, who knows what was REALLY in his head when he wrote this song, but because it is music and therefore great art, all of you are right because what you have to say are your opinions, what the song makes you feel, what it inspires in you, what you see when you hear it and then imagine because of it, and opinions and feelings can't be wrong or taken away by someone else just because they have opinions and feelings that are different. Everyone is entitled to their own and of course they will be different, and that is wonderful, that makes us special and unique, and what I love about the Beatles is that their music takes you to a place that lets you feel so many different things, it kicks my imagination into overdrive and each time I come away with something different, and it is because of their music. You are not supposed to just think one thing, even if it is a single factoid, I think they would love knowing that people are embracing what their music inspires in people, the good, not the bad. Let's not be ugly to each other, there is enough hate in the world, why spread it here, to people you don't know for no reason at all?\r\nwith peace and love to you,\r\nShanna\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nthis song has 3 parts and possibly three different meanings. stop beating each other down over these meanings otherwise you're missing the entire point of the beatles music trying to promote peace and love.\n\r\nif you listen to the version on anthology 3 the only lyrics to the song are\r\n\"I need a fix 'cause I'm going down\r\nDown to the bits that I left uptown\r\nI need a fix 'cause I'm going down\n\r\nMother Superior jump the gun\"\r\nthis kind of shows that the song was written in 3 different parts possibly inferring 3 different meanings, but this part was the original part. which is why i personally think it's about a herion addiction, but i can't deny any of the sexual inuendos throughout. seeing as how the only other lyric on anthology 3 is john singing \"yoko ono oh no/yoko ono oh ya.\" perhaps the intention of the song is to combine the three meanings making them each more powerful.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nHoooo-kayy\r\nSo \"jump the gun\" means to cook up some of that Heroin.\r\n\"The National Trust\" is a toilet, i'm not sure how it got its name, but it has been mentioned in several shows, including Seinfeld.\r\nAnd the last thing I know about this song: \"Happiness is warm gun\" was a slogan for a gun company, meaning that happiness is when you shoot something, because the gun is warrrrrmmmmmm.\r\n=] kthnxbi.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nI view this song as a reference to suicide.  Perhaps a failed relationship and/or drug addiction leads to the way out \"Happiness is a warm gun\"\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nyeah this song is mocking the vietnam war. john is saying that ppl find comfort in killing off others (like in a bad way). idk, i love this song, but i hate the meaning behind it (well wut i interpret from it) cuz its really disrespectful to the soldiers that died in vietnam and the ones that are now mentally traumatized from what they went through, there was not much respect for them back then, they were just trying to help the innocent, but there was way to much politics involved and the communists were just totally not humane at all. i love john, but hate his political views, its good to want peace, but sometimes you have to fight for peace, w/o war there would not be the USA!\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\neveryone's talking about paul's screaming... this song is sung primarily by Lennon\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nthe \"oh yeah\" added at the end of the \"Do do do do do do do do\" is not in the original lyrics provided with the white album\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nJohns voice is AMAZING <333\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nThis song is about the seduction and suicide of a nun by a man who intended to seduce her only for sex. She believed he loved her and ultimately she kills him and herself for her betrayal of her vows and her God. Here is a line by line analysis (somewhat out of order for clarity): \n\r\n\"Mother Superior Jump the Gun\" is a multi-layered reference literally about a nun having intercourse prior to her death (and not just any nun, the leader of the convent), when she will (according to Catholicism) ultimately be (re)-united with her groom, Jesus. (Nuns wear a wedding ring on their right hand indicating they are \"married to Jesus\"); however, this is very likely a shot at organized religion by John.In addition, it also talks of her ultimate fate, which is suicide because of her earthly seduction by someone who doesn't love here.\n\r\n\"She's not a girl who misses much\": again, when taken in this context, she doesn't miss much, but not in the observational sense; in the experiential sense; not the normal things a nun should miss such as carnal knowledge and human love, although it also, based on the line: \"Lying with his eyes while his hands are busy working overtime.,\" is irony insofar as she could not tell that he was not truly in love with her and he seduced her and threw her away for sexual gratification only, at first with his eyes and and and with his soft caress.\n\r\n\"A soap impression of his wife\" - soap implies cleanliness, so he lied to her about his wife or marriage or cleaned the picture up in someway (perhaps telling her she is dead., or he cleaned it up in some way as to make it more palatable,) \"which he ate\" --why do we eat soap or have our mouths washed out with soap? For lying of course. \"And donated to the national trust.\" - he used this piece of information to win her over or to manipulate her, national in this sense meaning more universal or far-reaching.\n\r\n\"I need a fix cause I'm going down, down to the bits that I left uptown\"- this is literally a heroin reference to coming down, but here it means a sexual fix: he is going back to the broken woman he left \"uptown\"-- this word is important and is one of the key reasons that this is not a drug reference: If he meant heroin, he would have said \"downtown\", a euphemism for heroin (just as 'uptown' is a cocaine euphemism) but he is talking about the bits or shell of the woman he had this relationship, uptown implying class or somewhere of importance.\n\r\n\"Happiness is a warm gun, bang bang, shoot shoot,\" the nun ultimately commits suicide because she violates her vows and betrays Jesus, after she commits murder: she kills him. [There is a slight reference to Dante here insofar as she is already damned to Judecca, the 9th Circle, 4th Round of Hell (Canto XXIV) in Dante's Inferno (Part III of \"The Divine Comedy.\" The 9th Circle is reserved for Betrayers, but special betrayer's and the 4th Round in particular is for those who have betrayed God; it is reserved for the Biblical giants lie Judas & Satan as well as the assassins of Caesar, Claudius and Brutus (because Dante thought they betrayed Italy and the World by killing the Divinely Appointed unifier of Italy.)] Since she will already be damned for betraying Jesus, she will receive no additional punishment by killing her betrayer (whom she betrays by taking his life), and killing herself.\n\r\n\"When I feel my finger on your trigger, I know nobody can do me no harm\" This is irony as she believes no human can do her any more harm or even God because of her damnation. The warm reference in \"warm gun\", in addition to denoting that she fired the weapon, also is an ironic Dante reference because in the 9th Circle, you are frozen in ice and not burned by fire, up to a level commensurate with your crimes.\n\r\n\"She's well acquainted with the touch of a velvet hand like a lizard on a window pane\" - this is a masturbation reference not an LSD reference. Her desires for love and carnal pleasure have often lead to masturbation. \"The man in the crowd with the multi-colored mirrors on his hob-nail boots\" Hob-nail boots imply that he was working class, used for traction so the he doesn't fall off and reveal his true self to her; the mirrors have several meanings: one, the obvious one, is that he is a pervert, peaking under dresses using mirrors on his boots, but below that level is that of her vision of herself as she looks down, constantly reflecting back at her the betrayal she is about to commit. He is also covering his working class boots with the reflection or the fantasy of what he wants her to believe, but she is a willing participant, ready to believe him.\n\r\nMobiusDick\n\r\n****Note that all interpretations of this song are valid except one and that is John Lennon's own. If you study the literary criticism of the 2oth Century beginning with Ezra Pound, John Crowe Ransom, James Joyce and TS Elliott, you realize we are in the century of Relativity; whatever meaning a song has to you is a valid interpretation [It is the meaning a song has (to you)]. The reason the author is excepted from interpretation is because of another artifact of Relativity and Quantum Mechanics (i.e,,modern physics) references, and that is related to the Heisenberg Uncertainty Principle. In physics, this means that we cannot exactly know both momentum (velocity, { that is {times mass}) and location X at the same time. [Ã\u008eâ\u0080\u009dX Ã\u0083â\u0080\u0094 Ã¢Ë\u0086â\u0080 P Ã¢â\u0080°Â® hÃ¢Â\u0081â\u0080\u009e2Ã\u008fâ\u0082¬ ]. When we know one exactly, we must sacrifice our knowledge of the other such that the product of the uncertainty of the two measurements is greater than Plank's Constant divided by 2Ã\u008fâ\u0082¬ ; or, in terms of Energy and Time [ Ã\u008eâ\u0080\u009dE Ã\u0083â\u0080\u0094 Ã¢Ë\u0086â\u0080 T Ã¢â\u0080°Â® hÃ¢Â\u0081â\u0080\u009e2Ã\u008fâ\u0082¬].\n\r\nWhen using this in terms of literary criticism, the person creating the work has too much psychological baggage to interpret his or her own work. In other words, you cannot step outside of yourself and see what you look like to other people. A good example of this occuring to me personally where I began to really understand the significance, was when I was reading over some poetry from a college poetry magazine I had been involved with in the early 1990's, The pages were typed so I could not recognize the handwriting. I read two peoms that I was blown away by and I was trying to determine which of the people involved in the magazine had written the poems. I suddenly realized they were my own work; immediately, I no longer was able to see anything special about the poems, and I began picking them apart line by line. I have always been very critical of my own writing and I cannot look at it from an unbiased veiw. No matter how many people tell me how much they like it or how impressed theey are, it is hard for me to get beyond the phase of self-doubt. MD******\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nTo me, this song is about a young girl who has been sexually abused for her entire life. \"She's well acquainted with the touch of the velvet hand like a lizard on a window pane\" Could be about her being used to mistreatment. \"The man in the crowd with the multicolored mirrors on his hobnail boots\" Could be refering to a pervert- looking up her skirt, and other men treating her like dirt. \"Lying with his eyes while his hands are busy working overtime\" Might refer to him lying to her, pretending to love her- while his hands are busy working overtime- having sex with her. She keeps trying to find love but just gets shit on every time. \"I need a fix 'cause I'm going down\" This could be either referring to drug use... but I think it could be about her cutting herself because she has no sense of self worth anymore- her \"fix\" is cutting herself. She feels guilty, like this is all her fault \"Mother Superior jump the gun\" might mean she doesn't feel worthy to go to church or that Jesus doesn't love her anymore... something like that. She finally decides to kill herself because the only way she thinks she can feel happy is death. \"I know no one can do me no harm Because happiness is a warm gun\" In the end, no one can hurt her anymore, because \"Happiness is a warm gun\" Not a happy song, but still beautiful. \n\n\n\n\n\n\n", "comment_145": "\nthe best way to defend yourself is to spread your happiness, not to shoot them...\r\nif that makes any sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nThis song is totally about using heroin. A warm gun is a loaded syringe...hot shot. John was a junkie at this point in his life.\n\r\n\"When I hold you in my arms and I feel my finger on your trigger...\"\r\nright before you shoot up and the anticipation is killing you, you know you're about to feel perfect euphoria.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nThis song is mostly about Johns heroin use\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nI like this song. It was the first song i fell in love with on the White Album. Very ~sexy~.\n\n\r\nthe spaceman lives\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nI was always told this song was in reference to the young Americans who came home from war in the time the song was written addicted to morphine because it was the drug they administered to them for nearly any ailment.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nA Great song, really great, and it gives me the kick of inspirasion I need when painting^^ and writing.\r\nThe one screaming is Lennon himself and if you look up the song on wikipedia it sais who does what:\n\r\n    * John Lennon - lead vocals, backing vocals, lead guitar\r\n    * Paul McCartney - bass guitar, backing vocals\r\n    * George Harrison - fuzzed lead guitar, backing vocals\r\n    * Ringo Starr - drums, tambourine\n\n\n", "comment_151": "\nI think the song was written with 2 topics in mind... drugs and sex; more specifically sex between an unfaithful pervert and a nun (Possibly 3 topics if you want to consider his position on guns and violence, etc.), but the way Lennon wrote it was so symbolic that you could listen to the lyrics and come up with a theory one time and another theory the next,and both could be right. That's what made him such a brilliant song writer!\n\n\n\n", "comment_152": "\nI think that the poem is obviously sexual with drug undertones.\n\r\nNot a girl that misses much-- She is \"disarming\" you can take it as a sexual overtone. \n\r\nVelvet Glove is anidiom is used to describe a person who appears gentle, but is determined and inflexible underneath. ('Iron fist in a velvet glove' is the actual quote). She is a woman that appears to be soft but she is actually stubborn and perhaps to suggest a cruel woman who takes away his male power. She is used to the role like a lizard is used to be on a windowpane (also suggests a sort of voyeurism to the song).\n\r\nThe man wears multicolored mirrors on his  Hobnail boots (inexpensive boots with nails on the bottom of the shoe that were popular in World War II the Nazi's/ German soldiers wore them and goose stepped with them). Cocaine you use Mirrors to cut and use. Crack can as I read can come in Crystals which in nature crystals are multicolored and kind of can do a prism which causes rainbows. \"When it is crystallized, many users will smoke it on tin foil or in a glass pipe and even a light bulb.\"\n\r\nThe stanza about lying with the eyes ending with the national  trust: It kind of has a suggestion of like a man taking a shower... sort of using the soap as if it were his \"wife's\" parts imagining it were here and it is sort of dissolving or like. But there are perhaps also references to those movies where the guy is stuck in the jail and then he crafts a gun out of soap and escapes. \n\r\nBits is slang for sex but also it could mean bits of drugs. I need a fix because I am going down (He is getting ahem \"disarmed\" or perhaps he is doing another american slang for going down ie on his wifie. \n\r\nThen it is ironic that Happiness is a warm gun because that means you have shot something. But of course the overly sexual meaning is obvious the relief of post-cotial. \n\r\nWhen I hold you in my arms\r\nAnd I feel my finger on your trigger\r\nI know no one can do me no harm --> This does not need to be explained but he feels empowered when he can be in control and his wife is not because he has got her good. He sort of is getting his courage up and feels verypowerful. Also Drug reference for Herion he might deny but come on he was an extreme druggy! He was on Herion. \n\r\nYoko Ono was also pretty well know for being a hard ass and took control of all aspects for John Lennon. She was pretty much his mother and his lover. EW! I know John has major mother issues. He even mentions in this one article when I was looking up about this in a Playboy magazine that the song Julia was about his mother and also about Yoko. Strange mommy issues... \t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nbrilliant song,, the beatles are the most amazing pop band of the 20th century!! i wasn't even alive when john was shot and i still love them!! (p.s. dirtydan = great interpretation!!)\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nJohn would probably be displeased with all of you. Trying to pick apart his song for a \"hidden meaning\". Honestly, the name was taken right from a magazine cover!\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nI need a fix because I'm going down\r\nDown to the bits that I left uptown\r\nI need a fix because I'm going down..\n\r\nHappiness is a warm gun (bang bang, shoot shoot)\n\n\r\nThis is one of my absolute favorite the Beatles songs.\r\nI love those lyrics...\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nMy all time favorite Beatles song. no doubt. great lyrics, sexy sound, and the placeing of the song is just right. its right after a sad but great song by George, While my Guitar Gently Weeps, and just before a pop song by Paul, Martha My Dear. its deffinately a song about sex.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nI had always thought that this song was about John Lennon and his addiction to heroin. Maybe he's referring to heroin as a gun because you shoot it up (\"bang, bang, shoot, shoot\"). You know, \"happiness is a warm gun\" as in he gets a euphoric feeling from the heroin he shoots up. \n\r\n\"I need a fix because I'm going down\r\nDown to the bits that I left uptown\r\nI need a fix because I'm going down\"\r\nThis is pretty obvious. He needs another heroin fix because he's down to the last bits he has left.\n\r\n\"When I hold you in my arms\r\nAnd I feel my finger on your trigger\r\nI know no one can do me no harm\"\r\nAnd this is saying that when he's shooting up (trigger being the syringe), he feels like nothing can get to him which is a typical feeling heroin users get.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nSad.  When i think of the title of this song, and what ultimately happened to John......sad...\n\n\n\n", "comment_159": "\nThe bits he left uptown? Bits are another name for genitals... How could he have left them uptown? It seriously sounds like he's referring to touching a clit/injecting heroine. I think it's supposed to make you think of both...\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nI believe the beginning of the song is describing happy times under the influence of drugs, mainly LSD hallucinations. And as the song progresses The trip is ending and he needs \"a fix, cause I'm going down.\" And he realizes that happiness is not real, and the end of the song is about suicide due to sobriety \"happiness is a warm gun\" (a recently fired gun)\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nI finally have it nailed.  Some of you have elaborate interpretations of nuns, suicide, jealous lovers going after spouses, etc.  Here is my take.  It is a song w/ three seperate songs thrown together, simply because it worked, and it was cool.  The obvious references to heroin and sex are w/ out a doubt.  The troubling parts are in the beginning.  Could it be John deliberately threw these disparite parts together to confuse the listener, knowing fully well they fit musically, but not lyrically?   Maybe he got the last laugh, and we are all bending ourselves into pretzels trying to stuff a square peg into a round hole w/ his disjointed lyrics.  I have always just enjoyed the song for what it was--a passionate piece of songwriting w/ great lyrics and guitar and harmony.  Maybe it is as simple as that.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nI only know this for a fact:\r\nThe reason he has mirrors on his boots is to see up women's skirts. That part of the song is called \"The Dirty Old Man\".\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nin any nonsens seeming text there is a truth that can be found and dirtydan may just have found it , spot on, it all makes sense that way\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nof course as any good poem it is about all those things : fingering a clitoris, killing your husband, shooting heroine, yes its all there and its meant to be that way, many stories folded into 1, thats why its confusing at first\n\n\n", "comment_165": "\nMobiusDick, I am completely blown away by the way you explain your interpretation [in that everyone sees what they see in the lyrics and that's ok too) and your interpretation itself. I do agree with you that you underestimate your own talent, don't let me down, I want to see you write more. For the record, the way you explained it reflected a past relationship (not in the literal sense, obviously, I wouldn't be alive to type this otherwise). My ex and his mates used to call me Mother Superior ...I have no idea why.... recently I'm being compared to a fairy with wings that should spray everyone with fairy dust ....I don't get that either ..,,,...maybe you can explain .. touchÃ\u0083Â© on not seeing ourselves the way others do\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nTHIS SONG IS MY OTHER HALF! I MEAN, MY GOG! THIS IS...AMAZING!!! OH MY...GOD! I ABSOLUTELY LOVE THIS SONG! THIS IS MY JAMMM!\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nI feel like if this song was about drugs, the title would be \"Happiness is Getting Shot\"\n\r\nYa know?\n\r\nThe \"Warm Gun\" part makes me think that it's about sex. \t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nI've read that on the lyric sheet John wrote \"dirty old man\" by the first section, \"the junkie\" by the second, and \"the gunman (satire of '50s R+R)\" by the third.  \n\r\nSex, drugs and rock + roll!\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nThe line, \"When I feel my finger on your trigger,\" is definitely referring to Yoko's g-spot. Fun.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nThe middle and the end of this song have been discussed thoroughly in this thread. \n\r\nI can possibly add to the meanings of the first amazing part, along 3 themes:\n\r\na. clever girl\r\nb. junkie\r\nc. naive girl\n\r\nShe's not a girl who misses much, Do do do do do do- oh yeah!\n\r\na. She's good at noticing things\r\nb. She's good at hitting veins\r\nc. She's good at getting sex\n\r\nShe's well acquainted with the touch of the velvet hand, Like a lizard on a window pane\n\r\na. She recognizes creepy men, who give you the creeps like a lizard on a windowpane\r\nb. She knows the heroin's high where you are looking in from above\r\nc. She is NOT acquainted with the velvet hand (control), like a lizard in not well acquainted\n\r\nThe man in the crowd with the multicoloured mirrors, On his hobnail boots\n\r\na. She'd recognize this man anywhere. He means to deceive with his demeanour/exterior (multicoloured mirrors) but his intent is to trample you (with nailed boots)\r\nb. \"The\" man is reference to a drug pusher. She sees him in the crowd with his fantastic drugs, for a price (nails).\r\nc. The innocent nymphomaniac sees this fancy dude and thinks she can score\n\n\r\nLying with his eyes while his hands are busy, Working overtime\n\r\na. His eyes betray him, while he undresses/caresses/strokes her\r\nb. The Man gives her the wrong drug, deliberately\r\nc. His eyes do not betray him, while he undresses/caresses/strokes her\n\r\nA soap impression of his wife which he ate, And donated to the National Trust\n\r\na. He buys her favours as a substitute for his wife, who is no longer worthy. [\"Soap\" used as slang for bribe money]\r\nb. Under the influence of the drug [soap], he proceeds to treat her like he really wants to treat his wife. [\"Soap\" is reference to Gamma-Hydroxybutyric acid, a date-rape drug in use since the early 60s]\r\nc. She's a perfect/cleaner version of his wife, who he defiled and abandoned\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nI know it's 3 parts that John put together to make one song.\r\nI also know Paul said this was his favourite on the White Album.\r\nIt's definitely mine!! To me The White Album is more of a Lennon album.\r\nSgt. Pepper & Magical Mystery Tour-- basically Paul's.\r\nJohn really did like the MMT album tho.\r\nI think that after all the acid & LSD, then Yoko came into the picture, John started really writing kick-ass songs like he did on Revolver & Rubber Soul. You can tell what albums that he really was into.\r\nI love songs that aren't quite as popular as the \"big hits\", \"greatest hits\" or what have you, that you hear over and over all the time on the radio. I like the deep cuts.\r\n\"Happiness...\" is a deep cut. But is one of the best songs on the White Album.\r\nThere's a few crappy Paul songs that really shouldn't be on \"The Beatles\"!!\n\r\nAllsIknow is when it gets to the lyric:\r\n\"I need a fix cuz I'm goin down\".... I freaking lose it! I jam on it. That fuzz guitar gets me goin.\r\nlove that song sooooo much!\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nJohn Lennon was sooo Genius! I've been a fan of The White Album since it was released, and this is one of my favorites on it. \n\nThe meaning, however, only occurred to me recently, while I was attempting a \"big picture\" understanding of the Beatles.\n\nAn alternative, though appropriate name for this song could very well have been \"Brian's Song\". \n\nThe importance of the role Brian Epstein played in the Beatles saga can not be overstated! They were talented when he met them, but he CREATED them. Their look. Their on-stage manners. Their recording contract. And perhaps most importantly, his ability to MANAGE them, with their egos and all (esp Lennon / McCartney). Brian resolved all their differences in one way or another. He was, in some ways, their boss. They fought amongst themselves, but Brian could always make it ok. \n\nThen he died. Suddenly. Tragically. Early. Without him there to be \"the glue\" that held it all together, they fell into disharmony, competition, and to some level, contempt.\n\nThe White Album is their first studio album RECORDED after his death. (Mystery tour was released after his death, but the recordings were completed by April '67. He died in August.)\n\nContemplate the lyrics in that light, and they make perfect sense. George and Paul had both stated it is their favorite cut on the album. That is not only because they actually collaborated. It is also because it is a memorial to Brian. (As is, I believe, the utter absence of any cover art. ie \"go into the light\")\n\n\"She's\" not a \"girl\" who misses much. (Brian was gay; referring to him as \"she\" would not be that unusual.)...Lying with his eyes while his hands are busy working overtime. (Brian was closeted by necessity. It was still illegal in the UK until a year after he died. Meanwhile, he was very savvy and ambitious. His efforts paid off, big time.)\n\n\"I need a fix 'cause I'm going down\". On the night of his death, Brian had planned to host a \"party boy\" night at his country estate. When the party boys didn't show up, he went back to London, where he accidentally) overdosed on sleeping pills.\n\n\"Mother Superior Jumped The Gun\". Brian WAS \"Mother Superior\", in managing the Beatles. He \"jumped the gun\" by accidentally killing himself, in his early 30's.\n\n\"Happiness is a warm gun\". The double meaning is obvious.\n\nThe song is clearly a memorial to Brian Epstein.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nObvious interpretation happiness is a temporary state\n\nwarm gun\n\nheat causes bullet to fire\n\nfucking idiots\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nAlternative explanation the gun is warm not at firing range. So keep it happy. Not cold, not hot the balance. I think my comment below is better though.\n\nListening on vinyl 30 years older than me...\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nOf all the bizarre lines in this song (and they are ALL bizarre), I think the best one is \"Mother superior jumped the gun.\"  It's just one of the best and most ridiculous things to come out of any Beatles song, and at this point I don't even want to know what it means, for learning its true meaning would surely ruin the humour of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nI was totally wrong 7 years ago.  oops\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nA buddy ole'pal if mine told me it's about not missing much on shooting up. The Beatles have always been over my head. Their lyrics are quite philosophical and full of double entendre's. They are all ( what's real can't die) very intelligent and excellent writers. \t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nThe gun is the woman in this man's life. She's well acquainted with his velvet touch. The more cryptic parts describe the lengths he goes to try and meet his unmet needs. The end describes the gun satisfying his needs. This song is hilarious, mocks gun owners, and is thematically similar to Bungalow Bill.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nThis is about suicide. \t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nThis song is about masturbation. The \"warm gun\" is a penis.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\ni agree..whenever paul screams, the song just gets better.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nLike all residents of the South, I am quite proud that the Beatles chose to enshrine our love of hunting and fear of nuns in a pop song. ;)  Somehow, there's sex involved here, and perhaps infidelity- can't get it up with his wife, so he nips down to the local curry shop to pick up some bint or other...\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nthis song is just fun 2 listen 2 and relax, its pretty funny if u ask me. oh and ITS JOHN SINGING AND SCREAMING NOT PAUL U DUMBASSES! JOHN WROTE AND SANG IT GOD DAMMIT!\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\ni've never even heard the song but just by looking at the first few lines i no it's about sex duh not that nice huh?\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\ni still think it's about fingering a girl.....well acquainted with the touch of a velvet hand......while his hands are busy working overtime....happiness is a warm gun. when i hold you in my arms. and i feel my finger on your trigger. i know no one can do me no harm. because happiness is a warm gun.Yes it is.....it would be too huge a coincidence for it not to be about that.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nI think its about they only way to be happy is to shoot yourself (the gun gets warm and brings you to happiness).\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nThis is either about herione, a warm gun is the needle, or about fingering a chick, \"when i put my hand on your trigger\", i dont know which one it is though.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nSince it they say \"I need a fix cause I'm going down...\" leading up to the main chorus, it makes it about drugs. If you have done any type of drug ESPECIALLY the hard ones, come downs suck. When it says \"Happiness is a warm gun\" it refers to ending the come down (which all junkies consider) with a warm gun. It fits the feeling of coming down perfectly.\t\t\t\t\n\t\t\t\t\n\n"}