{"comment_0": "\nThis song is definitely about a parent who tries to escape their misery through drugs and alcohol and eventually takes it out on his family by beating and killing them. Here is my interpretation of the lyrics for each of the 3 verses in the song:\n\r\nVerse 1:\r\nMy Life Suffocates\r\nPlanting Seeds of Hate\r\nI've Loved, Turned to Hate\r\nTrapped Far Beyond My Fate\n\r\nI Give\r\nYou Take\r\nThis Life That I Forsake\r\nBeen Cheated of My Youth\r\nYou Turned this Lie to Truth\n\r\n-- This is giving a historical view of the Harvester of Sorrows' life. It explains how he became the Harvester of Sorrow. It's pretty straight forward, no need to go into detail here.\n\n\r\n2nd Verse:\r\nPure Black Looking Clear\r\nMy Work Is Done Soon Here\r\nTry Getting Back to Me\r\nGet Back Which Used to Be\n\r\nDrink up\r\nShoot in\r\nLet the Beatings Begin\r\nDistributor of Pain\r\nYour Loss Becomes My Gain\n\r\n-- This verse explains how he thinks about himself and how the Harvester of Sorrow deals with it. He attempts to \"get back which used to be\" by abusing drugs and alcohol. Which results in him becoming violent. At this point it does not indicate that he is violent towards his family. The Harvester of Sorrow could just be getting in fights at bars or places he gets drunk and high at (like when people get drunk at bars and start fights ... get it?). Essentially, he gets drunk/high and takes his anger out on others.\n\r\n3rd Verse:\r\nAll Have Said Their Prayers\r\nInvade Their Nightmares\r\nSee into My Eyes\r\nYou'll Find Where Murder Lies\n\r\nInfanticide\n\r\n-- This is the verse that indicates that the Harvester of Sorrow has finally snapped and beats and murders his children (indicated by infanticide ... which has nothing to do with abortion BTW). He has finally become the Harvester of Sorrow.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI've always inferred that this song was about someone who's suffered horribly and perceives themselves as being wronged and even persecuted on all sides.  As a result, they become bitter, unable to feel compassion for other humans, and lash out angrily and even violently.  This resembles certain schizophrenia-type mental disorders (note: scizophrenia =/= multiple personality disorder), where the sufferer becomes paranoid and perceives themselves as being persecuted on all sides.  The song's lyrics and its emphasis on violence, alienation, and emotional blunting best matches the development of clinical psychopathy.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI'm thinking this is either a generalized Grim Reaper/Final Judgement song like Metallica is so fond of, or a bloody-justice teenage revenge anthem. I'm leaning towards the latter. Why you ask? I'll explain.\n\r\nThe song clearly indicates a strong feeling of victimhood and unjustified abuse. A person of formerly pure intentions (\"Planting Seeds of Hate, I've Loved, Turned to Hate, Trapped Far Beyond My Fate\") has been driven into vengeful bloodlust by a lifetime of mistreatment (\"I Give, You Take, This Life That I Forsake, Been Cheated of My Youth, You Turned this Lie to Truth). \n\r\nThe person in question is now motivated only by pure rage and pain (\"Anger, Misery, You will Suffer unto Me\", Distributor of Pain, Your Loss becomes my gain\" etc.) and he proceeds to exact bloody payment (\"All Have Said Their Prayers, Invade Their Nightmares, See into My Eyes, You'll Find Where Murder Lies) on those who planted the seeds of hate in his heart, pushed him beyond his normal limits of morality, took from him when he did nothing but give to them, and robbed him of his innocence. \n\r\nHe has become the Harvester of Sorrow.\n\r\nSo basically, take your average school shooter's life story and make a song out of it, and this is what you get.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\njust listen in sorrow and awe to the skill of the drummer in the first 1.17 minutes.. this song is really a chellenge for any respectable drummer and Lars seems to to give the best of himself here... It is a song dominated by anger, frustration and sorrow. The heavy guitar riff and the Bass drum rolls confirm this... i believe that if you take away the lyrics from this piece, the song will loose none of its prowess, and will still express the true pain and feeeling put in the treated subject.... Lars rules, and though technically he may not be at the skill of such drummers as Mike Portnoy, or Danny Carey, he is still my favorite drummer cause he has the ability of transmitting all his wrath and passion through his pounding... He knows music is expression of feeling and soul...\r\nThanks for reading my humble opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt tells the story of a drunken and drugged man who torments his family before cracking and murdering them. \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nthis song is about me\r\nmy life suffocates\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nOK, why hasnt anyone ever brought up what happend during WWII? The Harvest of Sorrows, it was when the russians when to a city where their were a bunch of farms, they made the people harvest their crops and give it to them. for years the russians came back and took all their crops, causing the people living there to die of starvation. \"Planting seeds of hate\". Obviosly these farmers who were planting the crops knew where they were going to, so they hated planting them becuase they knew the russians were gunna take it. \"I give, You take\" this explains that the people gave little crops at first, then the russians got greedy a took it all, this isnt a song about \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nJoeMaster bullseyed it; thats the original meaning intended by the composer(s). Very straight forward.\n\r\nNever the less, I like to think that beyond that straight forward meaning there's also an obscurant or faithfull one. It's a general complaint from a man directly to God himself - (sort of like a angry prayer if you wish), about how the poor evolution of his life (\"My life suffocates, Planting seeds of Hate\"; \"I love, turned to hate\"; \"you turned this lie to truth\"; \"I give, you take, this life that I forsake\"), turned into a present state of total frustration, considering facts and indicators that could initially point in his favor (youth, innocence, inconditional love torwads life and people). \n\r\nWith \"Anger, Misery, You'll Suffer unto Me\", God responds to him in his particular, intangible and superior way, like a true and all mighty master submits servants, by telling them that in order to reach his symphaty (and whatever that can lead to), he must first suffer to gain His trust...you know, to be reliable. To me, \"You'll Suffer unto Me\" is a too strong verse to refer simply to bad parent towards his child, or to any sort of \"booze itself\" torwads any drunk. But it fits nicelly if u think it's God. With \"your loss becomes my gain\", eventually the guy compreends that God knows that all his sacrifice will obvisously mean little or nothing to him in his mortal, short and pathetic life, but will certainly favour Him, in a misterious and much superior way.\n\r\nThe complainging comes from a man who has a life not even close to what he once expected it to be, or thinks or thought he deserved - this based in a self-judgement he makes of his once young self - a pure, innocent and highly energized and life-loving child - \"I loved, turned to hate\". The self judment is also implied in \"been cheated of my youth\" and \"trapped far beyond my fate\". It all helps building the obvious frustration. The background can be only one: poor, if not horrible, but at least neglectful - parenting.\n\r\nIn the end, he's feels so miserably torwards life, he senses he's got nothing else to give or fight for, thus leading him to start feeling he's closed to dying, or at least he can no longer feel that life welcomes him, but instead its death he senses coming closer (Pure Black Looking Clear, My Work Is Done Soon Here). At this point, God then tries to encourage him by a very tricky and dubious verse: \"Try Getting Back to Me; Get Back Which Used to Be\". This could mean God wants him to love life again, like he did in his young age, by whatever \"good means\" necessary.\n\r\nIn the end, the man remembers times he thought of murdering ppl as a way of ending great sources of the suffering (this could've come in momments of getting bullied, for instance, as many bullied children actually think or even dream of assassinating their agressors).\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI believe this song is about depression and how it can take the toll of an individual to a deep, dark path, eventually into drugs, booze, then to murder.  Depression is evil personified.  Evil is the harvester of their sorrows.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song can have two meanings. Listed above is one. Think about this one:\r\nthe song talks about abortion. The lyrics support this idea also.\r\n \"My life suffocates\" -embryo being killed\r\n \"Planting the seeds of hate\" -abortion pill or unwanted sperm\r\n \"Been cheated of my youth\" -can't live out childhood\r\n \"You turn the lies to truth\" -mother makes reality of abortion\n\n\n", "comment_10": "\nInfanticide- the killing of an infant\n\n\n", "comment_11": "\nNever thought of it that was, bassman. Puts a good twist on it for me. \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ngreat riffage completes this song perfectly. Compared to the rest of the ...And Justice For All album, this is an easy tune to play, but it works very well. the tight complication heard on the album is stripped down to the loose raw power of the E, F and B flat power chords, making for one ugly and sinful riff that just fills you with headbaning energy.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nYou know what? I think this song is about drugs. Think about it. It mentions shoot in! That's an obvious reference to heroin! And as for the rest, well, I'm not high yet so I can't reach for anything yet. Sorry all, but I just had to post something about drugs because it's the only song I've seen on this site thus far that isn't about them. *Scoff* Please.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI never thought about a drunken drugged guy.  But it makes sence.  \"Drink Up, Shoot In, Let the Beatings Begin\" He's drunk, drugged, now he will beat his wife/kids to death.  I would guess if that was the meaning, Fanticide would be that he killed a baby... hmmm... makes you wonder...\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nEver since ive listened to this song ive always thought it was about slavery. At first it was only for obvious reasons the name \"harvester\" but when you look at it more deeply it makes sense. \"Your Loss Becomes My Gain\" this means that the slaves work gets nothing in return except for master's buisness. there are other quotes that hint at this meaning too just take a look for yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI think the song is more symbolic of a concept much like the four horsemen of the apocalypse.  The Harvester of Sorrow makes bad things happen.  The first person references are just vehicles for the idea of this \"grim reaper\" type of figure who causes lots of pain, misery, and death.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nyeah im goin wif abortion, makes better sense to me, but how the $%^& did u come up wif that????\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nnice one bullzeye.. yea i think that pretty much sums it up. I was thinking along the lines of there being like an unseen force which causes people to do the bad thin gs that they do.. but upon further reading.. bullzeyes interpretation makes more sense. This is definately one of my favourite metallica songs\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nProdigal has got it in one. I read an interview with JH, and he said pretty much the same thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nits \"Too see into my eyes\", nothing big, i just wanted to feel important, great song too one of my favorites\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nlol omg i spelled \"To\" wrong.... yep, im losin it\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nlol omg i spelled \"To\" wrong.... yep, im losin it\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nTo me... I think this song is about a kid who had a very abusive father. In the long run, his child hood memories are mainly of him being beaten. In the long run, it makes him mentally unstable, ruining the rest of his life...but thats what I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nhave any of you lot seen the live performance of this on launch.com?  JASON NEWSTED IS GOD!!!!!! muahaha\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIt seems to me that the song is about teen parents that just found out they were going to have a child.  As the first one said I believe it is about a man who snapes.  That is because he founf out he was going to have a kid.  \"My life suffocates\" meaning that his life is limited and he feels he can not escape this responsibility.  Like the person after that saying that \"Planting Seeds of Hate\" refers to unwanted sperm, i have to agree no teen wants to be a parent.  As for \"Been cheated of my youth\" refers to after you have a kid you can no longer act like a kid and are forced to grow up. \"Ive loved turned to hate\" could refer to the man blaming his girlfriend for getting pregnant which is a natural respons for a teen. It goes on to say he turns to drugs and alcohol and in his rage he decides to kill his pregnant girlfriend to solve his problems.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI've always thought it was about alcohol itself, and the effect James maybe felt it had on him and others.\r\nSo, essentially James is writing the song as if Alcohol was a person/entity itself, and James takes on the perspective of Alcohol.\n\r\n\"Pure Black looking clear\" - Alcohol is often clear, but can have a \"dark\" effect.\n\r\n\"You'll Suffer unto Me\" - Alcohol has now become your master. Much like Drugs in \"Master of Puppets\".\n\r\n\"Let the Beatings Begin\" - Not necessarily beating someone else up, but pschologically beating yourself up because you've fallen off the wagon, or you hate how you are after drinking and therefore beat yourself up over it.\n\n\r\n\"Your Loss Becomes My Gain\" - Often Alcoholics will continue to drink because it numbs whatever their pain they're going through.\n\r\n\"Harvester of Sorrow\r\nLanguage of the Mad\" - This is saying that alcohol will only make you depressed, and that it'll make you mad, as often alcoholic end up.\n\n\r\nInterestingly, when you view this in context of the time, James was reportedly going through his partying/drinking phase, which would culiminate in his checking into rehab many years later, during \"St. Anger\".\n\r\nSo, as quite often the case, maybe this song was a form of subconscious therapy for James at the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nChris Geez,\r\nIt looks to me that you thought about this song way too much, even though I know what you are saying and somewhat agree with you.  Thanks for bringing that to my attention.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis is a really hard song to comprehend because it can go either way. It says clearly, \"Infanticide\" referring to the abortion side. But then it also says, \"Drink up. Shoot in. Let the Beatings begin.\" referring to the drunk guy killing/torturing people. The only way I can incorporate both of those into one meaning, would be the drunk guy is beating children. Unless it is a twisted view of a doctor performing abortions. Very hard to figure out. But anyway, that's my view.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni think this song is about  a guy who hates family life and resorts to drinking and doing drugs. he eventually gets so drugged up that he tortures and murders his family.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI think the Harvester Of Sorrow is a pusher (a drug dealer).\r\n\"My life suffocates\" the drug abuse is destroying his life\r\n\"Been cheated of my youth\" the drug abuse have destroyed his life\r\n\"Distributor of pain\" again it's the dealer\r\n\"Your loss becomes my gain\" because of the persons shitty life (his loss), the dealer can make money by selling him drugs (becomes my gain)\n\n\r\nBeen there done that.\r\nAwsome song none the less\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ni think the druken guy beating his whole family is right but what i absolutly love about the song is the solo its so erie. it fits the song perfectly\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI dedicate this song to Chris Benoit. He drank up, shot in (with steriods), and let the beatings begin.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nmost of the theories offered so far are possibilities, but this song is definitely about the law of sowing and reaping. that is why the title talks about a \"harvester\" or someone who is reaping something. There is a verse in the Bible, the first part of which says, \" he who soweth to the flesh shall of the flesh reap corruption\". The song is talking about the actions or \"vices\" of a person having direct consequences. His life suffocates as a direct result of the seeds of hate he has planted. Ive loved, turned to hate- thats talking about a vice, habit, or action of some sort that the person  \r\n\"loved\" , but has only returned \"hate\" or misery, as a direct consequence.\r\n I give, you take, this life that I forsake.  Again, giving his time and passion to his vice,  the vice ending up figuratively, or even literally, taking his life. ( been cheated of my youth) \r\nYou turned the lie to truth- The lie that the vice would bring satisfaction, but turning into the truth that his life has been destroyed\r\n Anger, misery, youll suffer unto me- The \"vice\" is talking, saying that anger and misery are the result of the action  or vice that the person engaged in.\r\n Pure black, looking clear - The vice or action is pure evil (black), but on the outside , it looks pure and harmless ( clear) before he gets sucked into its consequences.\r\nTry getting back to me, get back what used to be- The person wants to get back to the beginning when the vice was fun and appeared to be harmless, but the consequences of  his actions has caused damage and pain that he cannot get out of.\r\n I could continue , but the rest of the lines of the song obviously follow the same theme- that sowing corrupt or evil actions causes reaping of sorrow and misery. Could be any vice like drugs,alcohol, domestic abuse, gambling, sex, etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nPeople, this song is simple.\r\nJames Hetfield's father was an alcoholic, and this tore the family apart.  He is exaggerating what his father did to show how much it changed him.  \"Infanticide\"  His father \"killed\" his childhood, and what made him a child.  He mentions alcohol in the song.  \"Been cheated of my youth\" \"Distributor of pain\"\r\nCmon people.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nYeah, I'd say JoeMaster is correct. \n\r\nThis song is just freakin' badass, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nmy favorite part of the song is the slight pause at 4:42 because of one of the concerts on Live Shit where james stops, looks around, hauks loogi and continues...PURE BAD ASS RIGHT THERE.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nthis song is about james... when he was yonger he used to drugs \"drink up... shoot iin\"\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nhey guys this is my opinion\n\r\nthe guy who kills his family had a bad, horrible childhood.\n\r\nI Give\r\nYou Take\r\nThis Life That I Forsake\r\nBeen Cheated of My Youth\r\nYou Turned this Lie to Truth\n\r\nhe forsakes his life and he's been cheated of his youth. so he thinks his family doesnt deserve the life he didnt get. so he kills em\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nIt talks about a drunken, junkie person, possibly a father, that comes home after drinking and doing drugs and beats up his family\n\r\nDrink up = drinking alcohol\r\nShoot in = doing drugs\r\nLet the beating begin = beating up his family\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nit seems to be about slavery: \"i give, you take\" he's doing alot of work getting nothing back.\r\n                            \"my work is done soon here\" he's almost finished serving his slavery time or his country will come and get him back.\r\n                            \"been cheated of my youth\" tricked by someone into slavery?\r\n                            \"let the beatings begin\" slaves are normally tortured, or beaten.\r\n                            \"all have said there prayers\" the slaves are praying to be rescued.\n\n\n", "comment_41": "\nI think this song is about a child growing up in a dysfunctional, abusive family. Particularly, I think a parent is on heroin and an alcoholic (\"Drink up / shoot in\"). The child acts like a normal, sweet child, but the parents neglect him and leave him to basically survive on his own (\"I give / you take\").\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nthis song is NOT about slavery. I have to agree with everyone who thinks it an inside strugle with addiction. just read the lyrics. its too easy. maybe not on board with killing family idea, but as a metallica fan of 20 years, its well known they have all dealt with addictions that lead to the ending of friendships and so on. my favorite. many of metallica's songs are a big metaphor. but betting  my money that slavery had nothing to do with the influance of this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nto me; its about how one gets so fuckin frustrated with sorrow and the way that he lives is fucked up and not going on which he did plan..\n\r\n\"my life suffocates; planting seeds of hate\r\ni've loved turned to hate\r\ntrapped far beyond my fate!\"\n\r\nand that he sees he's youth didnt went fair at all and ppl make it look like what they're sayin is the truth..\n\r\n\"i give! you take!\r\nthis life that i forsake\r\nbeen cheated of my youth\r\nyou've turned this lie to truth!\"\n\r\nall of that ofcourse results in \"Anger\" and \"Misery\" but the thing is he's not giving up \"You'll suffer unto me\"... and then the idea of the song comes \"Harvester of sorrow.. language of the mad\":-\n\r\nhe found a way to pull away his sorrow and \"harvester\" may come as a metaphor like the sorrow is a field of straw or something and he's the harvester... and that is show how mad ppl can have some really mad ways of solving their problems \"language of the mad\"\n\r\nand then the rest of the song is about he's dealing with ppl after he got his way now and no one can stop him; it kinda of a revenge to the ones who created the anger and misery for him\n\r\n\"drink up! shoot in! let the beatings begin.. distributor of pain; your loss becomes my gain!\"\r\nas in \"do whatever ya can do now to fuck up. drink up! shoot in [drugs].. it will become my gain to see ya fall\"\n\r\nand the \"infanticide\" means as in he's killing things while its infants or \"just begun to rise\"\n\n\r\nanyway; i've also heard this song has a political meaning [check the cover]...\n\n\n\n\n", "comment_44": "\nI agree with nechronius' interpretation. I think this is a general concept of evil. The Harvester of Sorrow harvesting all these methods of causing sorrow: rape and abortion (Been Cheated of My Youth), drunken/drugged up rages (Drink up\r\nShoot in\r\nLet the Beatings Begin)...\n\r\nThis song is incredible. This is Enter Sandman, but far, far sicker and crueller. Harvester rivals Raining Blood for Most Evil Riff, in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nIt's got a taste of Nyarlathotep\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nAs many of their songs like \"Masters of Puppets\", \"Sad But True\", \"Creeping Death\" this song is about being obsessed with daemons. In this case, not exactly daemons but probably just the opposite: in the Old Testament style, something like a revenge from the God's angels. I think that is how James sees the world. He sees that the world is full of evil, so, he questions, a killer, what is he? Evil or maybe just the opposite if he murders an evil person? I guess, such ideas bothers him a lot. \r\nThis theory supported by the lines \"My Work Is Done Soon Here\", and \"Your Loss Becomes My Gain\". I.e. he has a work to do here, and he has something to gain from that (of course, it cannot be a human being, it is the Harvester). And in general \"Harvester of Sorrow\" is too general term to say that it applies to a single killer on a particular occasion.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nMetallica is my favorite band of all time.... but i have a serious question... Do you think the band is evil personaly I believe they arent extremely religious, but don't think they dislike God..\r\nPeople are going around saying bands like metallica are pure evil.. and its pissing me off...\n\n\n", "comment_48": "\nMetallica is my favorite band of all time.... but i have a serious question... Do you think the band is evil personaly I believe they arent extremely religious, but don't think they dislike God..\r\nPeople are going around saying bands like metallica are pure evil.. and its pissing me off...\n\n\n", "comment_49": "\nContinuing on to my last comment, I am very religious and yet still listen to metallica all the time...\n\n\n", "comment_50": "\nThe song is about a man who is filled with anger and hate that he takes it out on his family.  Slowly he becomes insane and murders them.  The line \"Your lost becomes my gain\" Means that their deaths make happiness for him. A twisted song, but awesome riffs and melody.  \t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThought it was about James's dad as he could get drunk & abusive. His mum could do little to protect him. He had to grow up fast hence 'cheated of my youth' & 'infanticide' - not reference to killing a baby but cutting off the enjoyment of his childhood by installing fear & control. James grew up fearing he would become just like him. Evidence suggests the drinking part is true at least!\n\r\nKiller drums - Lars best work\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI think this song is about how the government puts drugs and bad influences all over the place to make people suffer. The song alternates in perspective between the sufferer and the government. This is what I think of this song. There are so many ways this could be interpreted though.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nIt'a about a vet that returns home to his family and can't cope..that's all.\n\r\nHe's been cheated of his youth due to his enlistment at an early age, and then has a hard time coping with normal family life after having been in battle situations overseas. This is actually extremely common, and any returning vet will pick up on the themes in this song immediately.\n\r\nI don't think we're suppossed to really assume the character of the song killed anybody (by the way, infanticide, by definition refers to the killing of a newborn, not abortion)...it's just a study about the sickness going on inside the guy's head.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\ninfanticide may mean the fact that drugs and drink \"killed\" him in his early life in his youth. \"Been cheated of my youth\"; I just don't know...\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI was thinking how the last verse didn't support the abortion idea, when I reallized that it might be the dead baby haunting the paren.... ahh fuck it, I don't know.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\ni always thought this song was about the reaper,because if you think about it,some of the lyrics match it;death brings anger and misery,your loss of life has become his gain of soul,all say their prayers before they die,he invades your nighmares because many fear death,if you look into his eyes,murder may lie there,he plants seed of hate,leading up to possible killing,etc.,but then i looked at all these comments and saw abortion,drug/alchohol and i was like \"huh,never thought of that\". i still kinda like it if it's about death,im kinda goth.who knows?maybe it is.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nFunny fact: James got the \"let the beatings begin\" line from a Bill Cosby show. In his stand up routine, Cosby would talk about his children messing around and making noise in his house until his wife couldn't take it anymore and announced \"the beatings will now begin\".\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nSimple word says what the song is about\nÂ¨InfanticideÂ¨ means the crime of killing a child within a year of birth. \nBasically the song is about abortion\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nWell, That's ruined the song for me....\n\nThrough the verses you could simply interpret it to be from the point of a father, who got drunk and impregnated a girl, and later received a baby, that he used to relieve his anger on...\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nit's about killing ones young child to get back the life they had before it was born.  the word \"infanticide\" pretty much gives away.  add in \"cheated of my youth...get back which used to be\" and its pretty much a done deal.  possibly could be about abortion, but the \"look into my eyes you'll find where murder lies\" seems more like its an infant child a person is killing.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nPlanting the seeds of hate:  Alcoholic or drug addict having children \n\r\nTrapped beyond my fate : the inescapable genetic element trapped in genealogy after death \n\r\nI give you take this life that I forsake:  Alcoholic addict has children cant raise them  Alcholism adiction raises them\n\r\nbeen cheated of my youth you turned the lie into truth :  alcoholism adiction  takes away your childhood  the orgin fear false. evidence. appearing . real.   passed on and passed on\n\r\nHarvester : a person or organization that collects or obtains a resource for future use.\n\r\nThe more sorrow the more drinking the more sorrow it progresively  gets worse  over time (you get it) \n\r\nIts the langauge of the mad \n\r\nInfactcide could be it kills your childhood young? Or maybe a wish to have died young to not continue the cycle?  \n\r\nHeavy shit   17 years out \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "comment_62": "\nThe song is a historical account of Stalin ruling over the USSR with communism. Many references are made to farm collectivizing (I give, you take, harvester, planting seeds) and early forced employment (Been cheated of my youth) false news (you turn this lie to truth) and show trials (let the beatings begin) and redistribution of wealth (distributor of pain).\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nInfanticide is likely not literal. I dont see how that would fit into the rest of this emotion filled song.\r\nInfanticide is simply the killing of a baby or and infant, usually by a parent or caretaker. A baby is a completely defenseless and innocent undeveloped creature that relies completely on the trusting the parent or caretaker to survive and grow. So I doubt any babies being killed were the problem in this song. If taken figuratively and in context, infanticide might refer to a total bitch move on a trusting and defenseless victim. Naturally the victim might want revenge.\r\nSo in light of the rest of the song which gives a strong sense of a victim mentality, I think that infanticide further drives home the justification for revenge.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI think you guys are being too literal. Hetfield was always writing about control back in the day, imposition of freewill on the self, the will vs. external pressures, and most of all, suffering brought by internal conflict.\n\nThis song is about the murder of one's true self. The separation of youthful innocence from experience and the psychological toll that it takes on everyone. I could spell it all out for you verse by verse but that would be... pedantic.\n\n:)\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nMy life suffocates\nPlanting seeds of hate\nIâ\u0080\u0099ve loved, turned to hate\nTrapped far beyond my fate\n\nI give, you take\nThis life that I forsake\nBeen cheated of my youth\nYou turned this lie to truth\n\n( Uncle Sam is the Harvester of sorrow. This song is about the typical young American soldier mislead to go to the middle East to fight for Freedom. The soldier realizes that the war has nothing to do with freedom, was needlessly cheated of his youth and recognizes all that wad achieved is destruction and fuelling terrorism-planting seeds of hate.)\n\nPure black, looking clear\nMy work is done soon here\nTry getting back to me\nGet back which used to be\n\nDrink up\nShoot in\nLet the beatings begin\nDistributor of pain\nYour loss becomes my gain\n\n( The soldier's mission is almost over and realizes he can't get back his innocence, get back which used to be. He resorts to drugs and alcohol.)\n\n\n\nAll have said their prayers\nInvade their nightmares\nTo see into my eyes\nYouâ\u0080\u0099ll find where murder lies\n\nInfanticide\n\n( The soldier suffers PTSD and has nightmares as he remembers the war crimes )\n\n\n\nAnger\nMisery\nYouâ\u0080\u0099ll suffer unto me\n\n( He feels anger and has thoughts of revenge against the government.)\n\n\n\n\nHarvester of sorrow\nLanguage of the mad\n\n( Indeed, the Harvester of sorrow speaks the language of the mad )\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nHarvester of sorrow\n\nThe title has two components: the idea of the profession of harvester and the feeling of sorrow. To be a professional feeling harvester is to very seriously collect such feeling. Notice that to harvest, one must kill the object being harvested.\n\nMy life suffocates // All seems to be against me; the meaning of my life is being hated by god.\nPlanting seeds of hate // As life is lived, god plants seeds of hate in me.\nIâ\u0080\u0099ve loved, turned to hate // The relentlessness of the external hate makes one reinterpret love as hate.\nTrapped far beyond my fate // I might have wanted another life for myself, but god hating me condemned me to a specific fate.\n\nI give, you take // I try to counter this external hate with love.\nThis life that I forsake // Tried suicide, but reincarnated into the same hateful world.\nBeen cheated of my youth // Being forced to Awaken by hate.\nYou turned this lie to truth // A hateful reality shaped me into a hateful person.\n\nAnger\nMisery\nYouâ\u0080\u0099ll suffer unto me // Now hate is interiorized. I hate you (god).\n\nHarvester of sorrow // I will inflict pain, and suffer the consequences.\nLanguage of the mad // Language of the Awakened.\nHarvester of sorrow\n\nPure black, looking clear // By accepting hate, at least I'm swimming with the current. There is no more doubt.\nMy work is done soon here \nTry getting back to me \nGet back which used to be // Inflict evil - and cultivate sensibility to feelings.\n\nDrink up\nShoot in\nLet the beatings begin\nDistributor of pain\nYour loss becomes my gain // As an awakened evildoer, your revenge unto me is sin.\n\nAnger\nMisery\nYouâ\u0080\u0099ll suffer unto me\n\nHarvester of sorrow\nLanguage of the mad\nHarvester of sorrow\n\nAll have said their prayers // We all have our arrangements with the deities.\nInvade their nightmares\nTo see into my eyes\nYouâ\u0080\u0099ll find where murder lies // (A hateful god made me) evil incarnate.\n\nInfanticide\n\nHarvester of sorrow\nLanguage of the mad\nHarvester of sorrow\nLanguage of the mad\nHarvester of sorrow\n\n\nI think this song is about a person who interprets the world as being against him; perhaps a schizophrenic who sees signs of a hateful god everywhere. Living in such condition eventually makes him accept the perceived evil without as a sign that he must be evil himself, and he starts to see himself as an instrument of a deity in realizing this evil on this world - be it by being evil to others, or by being seen as evil to others.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nVery true man. Awsome fucking song too.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nWOW PRODIGAL RIGHT ON MAN!! FINALLY SOMEONE ELSE CAN GET IT RIGHT!\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI go with the idea of the song talking about a guy who is going to have a kid before expected, then freaks out and kills it (or forces his girlfriend to abort)\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nOk I am a big metallica fun and I came up with this little story based on the titles of metallica songs. the titles are in capital letters.\n\n\r\nI park my 2*4 and step out, home at last but Iâ\u0080\u0099m in a FRANTC state thinking about my narrow ESCAPE. I get into the house and I drink some of my WHISKEY in a JAR but that doesnâ\u0080\u0099t ease the pain clearly caused by the THORN WITHIN. At this point even i know the only solutions to deal with the STRUGGLE WITHIN. In the SMALL HOURS of the morning I stare into the dark night and see ORION, but now is not the time to think about ASTRONOMY the pain is too much it feels like I'm TRAPPED UNDER ICE yet I cant seem to convince myself that its my fault, betrayed by who i thought was a friend and betrayed by THE JUDAS KISS now I go towards my bed in this old rugged house, how am I supposed to sleep in THE HOUSE THAT JACK BUILT after I shot him between the eyes and left him STONE DEAD FOREVER and at that point it felt like NOTHING ELSE MATTERS. I close my eyes and try to sleep hoping it will all just FADE to BLACK but THE MEMORY REMAINS clear to me that I will always be UNFORGIVEN and it worries me because the things i just did make me wonder AM I EVIL. This cant be I was raised right how did I turn to this BAD SEED I know what I did was wrong but I canâ\u0080\u0099t feel it, itâ\u0080\u0099s like I am on ANESTHESIA.\n\r\nI had lost my mind when I decided it was KILLING TIME, I ran around taking them all out high on drugs I believed I was the INVISIBLE KID and the opponents I took out one by one where DISPOSABLE HEROES. I canâ\u0080\u0099t sleep so I stay up looking at the DIRTY WINDOW and start to think maybe its time I DISAPPEAR because right now I am CREEPING DEATH at any point the cops and feds will be all over looking for me. For so long I looked forward to exerting my revenge but that day seemed to be THE DAY THAT NEVER COMES nothing hurts more than taking the life of your BROTHERS IN ARMS. The pain was too much yet still I feel like the HERO OF THE DAY and I decided not to think about what others thought of me after all to the one who I was revenging I would always be the perfect PRINCE CHARMING her LOVERMAN as was the case when she lived and everyone else called me KING NOTHING. As my nerves began to calm I remember what MAMA SAID about salvation forgiveness trusting in God and THE FOUR HORSEMEN but I will not pray to THE GOD THAT FAILED seeing as he let my loved one die she truly was MY FRIEND OF MISERY so I decide to live the rest of my life with NO REMORSE.\n\r\nKnowing my fate as I step into the bathroom that bottle of CYANIDE seems appealing but I will not give up I will FIGHT FIRE WITH FIRE. Arrested I find myself locked in a SANATARIUM because the cops couldnâ\u0080\u0099t believe any normal person could do what I did. The DEVILS DANCE is what they called it and maybe this is where I would spend the rest of my days on THE FRAYED ENDS OF SANITY. A brilliant mind I donâ\u0080\u0099t deserve to be here but what i did deserves to be punished and that is SAD BUT TRUE. At this rate I donâ\u0080\u0099t think even a priest can PURIFY my soul. I think of to myself POOR TWISTED ME but I decide to not have self pity because when it comes to who killed those men I will always be the ONE. From a motherâ\u0080\u0099s boy RONNIE went on to become a killer and sometimes I would think SO WHAT right until the judge decided i would RIDE the LIGHTENING. I know I am SOME KIND of MONSTER but do I really deserve to die. The judge is not letting me off easy as he proclaims THAT WAS JUST YOUR LIFE and now youâ\u0080\u0099ve reached THE END OF THE LINE. Alone in my cell I think it seems I have become THE OUTLAW TORN thinking about SUICIDE AND REDEMPTION what to do I cant let them kill me oh the STRUGGLE WITHIN talk about THE THING THAT SHOULD NOT BE. After a nights sleep I think maybe its fine after all TO LIVE IS TO DIE what is this THE UNNAMED FEELING maybe its time to TURN THE PAGE. \t\t\t\t\n\t\t\t\t\n\n"}