{"comment_0": "\nCamila was born in Havana, Cuba. She immigrated to Florida when she was a child.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ni think it is about a girl who wants to be in havana again with the man of her dreams great song im glad she made such a relateable song\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI like this song because it's not complaining about an 'enormously drastic, life-threatening break-up' like most songs these days. She's just saying that she loves (either a boy or her birthplace, Havana) and half of her heart is there linking them together.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nHavana is about someone who falls in love with a boy. Remember when people from Cuba were fleeing, well she has to leave Havana, Cuba. That is what she means by \"Half of my heart is in Havana,\" meaning the boy has half her heart or her home Havana has half her heart.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt's a long story but,it was in the early 90\"sometime when George Bush was in office the father,people were smuggling merchandise clothes,shoes,people and a little drugs from Havana over to GA,there was no east GA at that time so people thought that was funny,so anyway the girl really was from Havana she was basically kidnapped and she was with a young black man from ATL running the smuggling merchandise back and forth she was beautiful,so beautiful she couldn't get away from the young black man because people would always tell him where she was and she tried to get away but it didn't happen,but anyways the young black man was younger and not very smart good looking tho,and really only wanted a better way of life,he was a little slow he wasn't a good driver and in the early 90\"there wasn't many GPS and if there was they the smuggler and the young black man didn't have GPS.so they were carrying big deal items Versace Nike Levi designer dresses made by seamstress in The Havana Etc,,to make a long story short the beautiful young woman had to kill the young black man to get rid of him because he would not leave her alone..they say her had to cut his heart out of his chest and nobody in Havana would help her or in ATL she was on her own. She was an immigrant so she didn't know everything,but the young black man needed her to rid with him because she helped point the way a little bit on the highway with directions and he had to bring her because she was beautiful on the highway and plus she could speak another language little bit.so they would tell people they were looking for a place to live or moving stuff like that that's why they there on the highway sometimes truck sometimes old cars..but anyways the song is to be played big and scary like I'm dead I left my Heart in Havana played with a huge mariachi band and drums and horns and everything kind of like the Dawn of the Dead kind of Celebration and the girl in this video that sings the song really looks like the woman a lot and the guy did a perfect job with the rap solo but that's the basic story and it's even better than that that's just a little synopsis of what the song is really about and it kind of went down and folklore history because they use that type of people in situation all the time it is really an important song and is not making fun of that John ra of music as serious as really beautiful and sometimes when I hear it I sad..and no she didn't make much longer after she had to kill him to get away from him..cause the smuggler people still wanted her to work..and no they there no from where I was from but some other people followed in they footsteps and I had seen those people around and that's how we all found out the facts..so it's not a sweet fairly love song it's real life song ..about a beautiful spirit..when it's played with a live band you can still feel them..I'm only telling the shortest version few details about the young black man and she tried to love him but he just didn't know or understand how to treat her right it's a rough life circumstances.\n\n\n", "comment_5": "\nI was pretty sure the lyrics were \"I knew him forever in a minute\". Makes a bit more sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nCatchy\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think this is a weird song\t\t\t\t\n\t\t\t\t\n\n"}