{"comment_0": "\nSimple meaning really, it's about a guy who's had their heart broken many times and finds it hard to trust anyone now in case he's let down again,\r\n\"I've broken my heart so many times\" and \"I get all worked up, Then I let myself down\"\n\r\nBut one day he's met a girl or seen one (love at first sight?) and can't help but like her and tried to talk himself out of it.\r\n\"I tried so very hard not to lose it, I came up with a million excuses\"\n\r\nHe hasn't given up on love entirely but he's still finding it hard to trust someone, and he needs the girl to work hard to prove she loves him to bring him out of his shell, so they can work on their relationship, and once he does trust her fully then he gives more then he gets, he just needs to get to know her better.\r\n\"And I know someday that it'll all turn out\r\nYou'll make me work so we can work to work it out\r\nAnd I promise you kid that I'll give so much more than I get\r\nI just haven't met you yet\"\n\r\nAnd the rest of the song is just talking about how he's sure someone's gonna change him.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nSomeday it'll turn out,even if the other one is the reflection in the mirror.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI love this song. It gives me hope to wait for the person I'm meant to be with, even though I don't know who they are yet. :] \n\r\nI also love how it's so positive, because some songs with similar meanings make you feel all depressed. Haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nvery a beautiful song..\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ni love this song, i can totally relate to it <3\r\ni think it means that you could have had many relationships that didn't work out, so you have to look forward to meeting that one person that you can spend your whole life with.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nVery realistic.. and optimistic.. specially if youre out a bad breakup-..\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nMy pregnant sister keeps singing this to her bump : ) Such a lovely song\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis is totally about his girfriend Luisana Lopilato.\r\nHe sings \"kid\" because he's 12 years older than her.\n\r\nLovely tune.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ni just got out of a relationship and i love listening to this song-it's saying your going to one day find that great person that makes you happy.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthis song is amazing, i listen to it all the time! the music is perfect, and i really like Micheal Buble's voice! it makes me really happy when i listen to it, it's a really hopeful feeling!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nIn Michael BublÃ\u0083Â©â\u0080\u0099s song â\u0080\u009cJust Havenâ\u0080\u0099t Met You Yetâ\u0080\u009d, he expresses his feeling of hope of finding the right girl for him, even after having so many ended relationships that have left him heartbroken. In this song, he talks about his desire to make his relationship with the right girl last. This song encourages us not to give up and to stay positive during even the most heartbreaking cases of relationship. \n\r\n The beginning of this song is Michael BublÃ\u0083Â© talks about having his heart broken many times and trying to get too worked up about it. Thereâ\u0080\u0099s a line in the song that says â\u0080\u009cAnd I know someday that itâ\u0080\u0099ll all turn outâ\u0080\u009d (10) and thatâ\u0080\u0099s him showing that he hasnâ\u0080\u0099t given up yet.  Then in the next stanza it says â\u0080\u009cYouâ\u0080\u0099ll make me work, so we can work to work it outâ\u0080\u009d (11). In this stanza he is talking about working really hard in the relationship that heâ\u0080\u0099ll have with the right girl so that he doesnâ\u0080\u0099t have to go through another break up again. The beginning of this song, I think, is elegiac. He seems sad about getting his heart broken. I think the rest of the song is hortatory because itâ\u0080\u0099s encouraging and positive. \n\r\nI think that this song is postmodernism because it is a personal song. The things Michael BublÃ\u0083Â© is singing about is not a universal truth, itâ\u0080\u0099s personal. Itâ\u0080\u0099s how he thinks about his own life and how he chooses to live it. \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nAMAZING LYRICS :) thats all i can say in my 2 cents\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nstory of my life. XD\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis is how I feel about my current situation with my ex, Great new Single!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nahhh i love this song. It just gives such great hope to find the future person you'll be with for the rest of your life. It gets me excited because I just have to wait a few years so its a perfect song to me. I have liked so many guys and I feel like its just been a big mess. But this song makes me so hopeful. I LOVE IT!!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nIf you look at it from another way, it sounds more like he's talking about his future kid... because it would be kind of weird to  call your girlfriend 'kid'. But I like it a lot more as a song about hoping for the best in your future. It's a little hard to relate to it when you first break up but as you start to move on, this is a great song to keep you positive! \t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThe music video makes it clear, that it's all about \"timing\" and \"the other's half is luck\". \t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nGreat song after you've broken up with someone you loved. Its just so up beat and optimistic for the future. Makes you excited to find someone new and share all the feelings again.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nbrilliant simple song. no need for sex to sell with video either like all the others in the charts. \r\ni can sing like him \t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI've broken my heart so many times\r\nI stopped keeping track\r\nTalk myself in\r\nI talk myself out\r\nI get all worked up\r\nThen I let myself down\n\n\r\nGreat lines, a friend of mine said she heard the lyrics and laughed thinking of me. Because whenever i meet someone new I always tell everyone about how amazing they are (talk myself in) then after a few weeks start to doubt things (talk myself out) yhen i get all worked up and end up single again!\n\r\nAnd obviously due to the above I've broken my heart so many times I've stopped keeping track!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI agree with CasanovaFrankenstein. This music video makes me want to walk the isles of a super market with a basket full of produce.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni listened to this song after listening to father of mine by everclear. if you taking out the meaning of love between two people, and ignore that, then i believe that this song could also be a message to a father who never got to know their child, or was never apart of their childs life, and is now having regrets and wants to connect with their child. thats just my interpretation\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI'm completely crazy about this song.\r\nIt's makes me feel happy, intoxicated and toughed all at the same time. Just like being in love.\n\r\nGreat great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nHe has been engaged four times; maybe the problem is him not the girl. I believe he has said the song is inspired by his current fiancÃ\u0083Â©.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nwhen I first heard this, I too thought it was about his future child. \t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIn a recent interview, when asked about him saying \"kid\" in the song. He stated \" I view myself as a old soul, and that was a term for a spouse when a couple were young.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nCute song.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nthis song reminds me of the sticky icky. you know when you are elbows deep in it and you can't possibly escape?  it makes you want to ravage someone so hard that even if there's blood you are just going to taste it all over your lips. like a gushing fountain. my heart bleeds. why fight it? fight for it. dig deep and just let loose and let them know that you know what's up.  this is love and it is blood all over the body even if you had to chloroform them.  because what it takes is sometimes a little Quaalude. \t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis is a beautiful song. We just heard it tonight when my family went out to dinner. It was performed by a musician in the restaurant with an acoustic guitar and he did such an excellent job. It's obviously about keeping your spirits up until you meet the right person. I had to look up the video when I got home and I love it. Very beautiful girl playing the part of his \"love-to-be\". She's about as close to perfect as you can get.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThis is such a wonderful song. It's about a guy who is ready to give everything he has to the girl, and she's just so perfect, and the only problem is that he's yet to meet her!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI agree that the song is great, but I don't know about romantic, it is actually cynical.  HE is not able to commit to a relationship.  There is nothing out there stopping him, it is HIM.  Lyrics:\n   \"I'VE broken my heart so many times, I stopped keeping track\"\n   \"I get all worked up, then I LET MYSELF DOWN\"\nHe is looking for a girl to \"MAKE HIM WORK\" to work it out.\nHer love is going to CHANGE HIM.\n\nIt reminds me of a great poem in The Last Unicorn, where the guy is waiting to meet a similar \"girl of his dreams.\"  When he finally meets her, he betrays her, and she ends up committing suicide.  The lesson:  \"True love is strong, but habit is stronger.\"  \n\nNow that is some funny shit!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI may be one of the people that is as ridiculous as this song entails.\n\nI believe the song is talking about this guy having a \"love at first sight\" moment, thinking all about them, how they'll be like, what a cute couple you'll be, etc. Nearly obsessing thoughts about the person, yet in reality, you don't even know their name. After a couple of heartbreaks, people can start easily attaching to people just in hope of finding \"the one\". \n\nThat is my interpretation, at least. I am most definitely one of the people who do this anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nMore like he's learned a lot from the mistakes in his life, specially in love and relationships, and continuously learned from them. He accepted those mistakes and wish to make it right with the right person that will come to his life. \t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThis song seems like it is about a guy who is not entirely over the girl he broke up with and is looking for a filler to be part of all the cliches he thinks a couple should have.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nMusic: very, very good quality, interesting harmony, great sensitive talented singer, good instrumental work, great idea, great melody, great chorus, great main theme. Very similar to song \"Bad Day\" by Powter... melody and chord changes.\r\nLyrics and meaning: Also decent job, a song about love at its finest - unconditional love, which you don't have to fight for - you just give it out and receive. Go figure. Great lines, well put words, nice rhymes, good phrasing.\r\nOverall it's a very good piece of music, even though it's modern. Some of the new shit is still lit.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThis is me right the fucking now. I don't want to get my heart broken again, so I'm in a shell. I wait for a magical girl to come out of nowhere and change me, gain my trust and get me out of this shell, so we can love each other. And boy, I can love, my love is strong.\r\nSo basically I can completely relate to this song, which makes it my favorite one at the moment\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nthis song reminds me of the sticky icky. you know when you are elbows deep in it and you can't possibly escape?  it makes you want to ravage someone so hard that even if there's blood you are just going to taste it all over your lips. like a gushing fountain. my heart bleeds. why fight it? fight for it. dig deep and just let loose and let them know that you know what's up.  this is love and it is blood all over the body even if you had to chloroform them.  because what it takes is sometimes a little Quaalude. \t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nIâ\u0080\u0099m convinced that this song is about his wife being pregnant and heâ\u0080\u0099s talking about what his life with his new son/daughter will be like. For instance, when he says, â\u0080\u009cIâ\u0080\u0099ll give so much more than I getâ\u0080\u009d;  newborn babies and even just kids in general arenâ\u0080\u0099t always easy to parent, so heâ\u0080\u0099s saying that he knows itâ\u0080\u0099s going to be hard, but heâ\u0080\u0099s willing to work for it. He also wouldnâ\u0080\u0099t refer to a love interest as â\u0080\u009ckidâ\u0080\u009d, which is also what leads me to think he really is singing about his child. He also starts the song saying that he doesnâ\u0080\u0099t really want to have kids, but heâ\u0080\u0099s gonna do it anyway. It sounds like his wife really wants to have kids, but he doesnâ\u0080\u0099t so much. Heâ\u0080\u0099s convincing himself that itâ\u0080\u0099s gonna work out and itâ\u0080\u0099ll be great. Then, it wraps it up when he says, â\u0080\u009cI just havenâ\u0080\u0099t met you yetâ\u0080\u009d. Of course he hasnâ\u0080\u0099t met a kid that hasnâ\u0080\u0099t been born yet. So, thatâ\u0080\u0099s my interpretation of the meaning, but I could be wrong.\t\t\t\t\n\t\t\t\t\n\n"}