{"comment_0": "\nThis is how I see it: The character in the song is so deeply neglected that heâ\u0080\u0099s desperate for a sign that someone cares.\n\nâ\u0080\u009cTry to hear my voice\nYou can leave, now it's your choiceâ\u0080\u009d\n(He canâ\u0080\u0099t make the person care for himâ\u0080¦)\n\nâ\u0080\u009cMaybe if I fall asleep, I won't breathe right\nMaybe if I leave tonight, I won't come backâ\u0080\u009d\n(But he wants to see them care, so he tests them with extremities.)\n\nâ\u0080\u009cCan nobody hear me?\nI've got a lot that's on my mind\nI cannot breathe\nCan you hear it, too?â\u0080\u009d\n(He really wants a reaction to his suffering, but the things that bother him mean nothing to them.)\n\nâ\u0080\u009cYou've got a history list and the rest is above\nAnd if you're warm then you can't relate to me\"\nâ\u0080¦\n\"You've got to love and adore and the rest is a lie\nAnd if you're warm, then you can't relate to meâ\u0080\u009d\n(Warmth is often associate with love and comfort. If youâ\u0080\u0099re loved, then you canâ\u0080\u0099t relate to him.)\n\nâ\u0080\u009cLeave your shoes at the door, baby\nI am all you adore, lately\nCome with me and we will run awayâ\u0080\u009d\n(This is what he wishes for deep down; for someone to love him enough to drop everything to be with him.)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIt describes Hypnagogia:\r\nHypnagogia occurs either when you are stressed (as the singer is, emotionally \"I've got a lot that's on my mind\") or simply uncomfortable, while falling asleep, and your body falls asleep faster than your mind. You can't move your body and it feels like you can't breathe (\"Maybe if I fall asleep, I won't breathe right\") or like something is sitting on your chest. These sensations might cause the person to think that they are screaming, which they aren't. (\"Can nobody hear me\"). This component of Hypnagogia is called sleep paralysis. Often in Hypnagogia, people hear sounds, either crashing and explosions, sentences that sum up their current state of mind, their name being called, if there is any sound in the room in which they are falling asleep, they would hear that  (\"Can you hear it, too?\")\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nMaybe I'm just a massive Whovian, but this song reminds me of the Master and his desire to make other people hear the drumbeat, as well as his false love for Lucy Saxon and his real love for the Toclafane. Yeah.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI luv this song too but sleep is just the analogy for not being able to achieve what the singers deems as love because the other person that they're involved with is a not capable, they are emotionally unavailable and refuse to hear, they may even act like they don't care or intentionally toy with the singers heart and the singer is caught between what they feel for the person and their idea of a relationship and the hard realities of this circumstance, when they say they can't breathe or sleep that line represents the lack of normalcy or peace in the relationship..Isn't love like sleep or air? Something us humans can't live without.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nMy other favorite song from this album. \n\n\"I said it before, I won't say it again\nLove is a game to you, let's not pretend\"\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nits obviously about love someone in love who is trying to get there \"person\"to listen to them about how much they need them, the love person is on their mind a controling desire, i agree with the other people that have commented this song is great and  love is something we can not live without like air lol\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThe song is about a guy trying desperately to get a reaction out of his lover. He's depressed, stressed, anxious, and overall in a lot of emotional pain (\"I've got a lot that's on my mind, I cannot breathe\"). His lover won't listen to him, instead treating the relationship as one of the many fleeting ones she's had (\"You kiss and you kiss and you love and you love, you've got a history list...\") (\"Love is a game to you...\"). He threatens suicide to try and make her pay attention to him (\"Maybe if I fall asleep I won't breathe right, maybe if I leave tonight I won't come back\"). The singer is frustrated and wonders if his suffering is all in his head (\"Can you hear it too?\") because nobody will listen to him (\"Can nobody hear me?\"). In the end, he gives up and tries to escape his pain by dismissing it like his lover (\"Leave your shoes at the door, baby...come with me and we will run away\"). \nSad song. Dan Reynolds has struggled with depression and anxiety and it's likely that inspired this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI was under the impression that the guy was irritated with the girl for not loving him or maybe not understanding him. I'd had this fear that the day I didn't tell someone I loved them would be my last day, and they'd never know I loved them. That was sort of the feeling I got here, like he has the same fear and she doesn't understand that. Or, quite possibly, she just doesn't appreciate him and he's trying to tell her he could be gone any day. The part about \"Can nobody hear me?\" may be about no one hearing him out. Simply my thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think this song is about dealing with anxiety I have it and this sounds like he is trying to be heard from but can't talk because he can't deal with it on stage no one can criticize you in person that can and it is tuff dealing with anxiety because great ideas come and go and no one can hear them\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI absolutely love this song!!!!!\t\t\t\t\n\t\t\t\t\n\n"}