{"comment_0": "\nI fixed the lyrics to match the lyrics posted on the band's homepage.  I truly believe this is the best song Lady A has recorded to this date.  Especially with all that's going on in the world, this is a rare BIG-MEANING song for them to record.  Finding hope in today's world in the small things that can bring you joy, and put your trust and beliefs in whatever you believe in to help get you through.  \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI really can't relate to this song in any way. I honestly don't get it that much, either. But I love their voices, harmonies, instruments, and the feeling of this song. There's something about this song that connects with me, I just don't know what it is! It's an AMAZING song, though! You did it once again, Lady A. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nTo me this song is about what is important in the world.  He start off by singing about all of the distractions that this world has and how this little girl in a van is just seeing it all for the first time.  It ends with him realizing that his world is important because of his family not the day to day rush.  I love this song I love Lady A all of their songs are about the simple things the important things.  \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think this song is also a lot about God... not just the part where they say\n\r\n \"Maybe talk to God like He is there. Oh, I know He is there, yeah I know He is there.\" \n\r\nbut also the part where they say \n\r\n\"Well the empty disappears I remember why I'm here. Just surrender and believe, I fall down on my knees. Well hello world, hello world, hello world.\" \n\r\nBeautiful meaning all around! I love the music video! I choked up and I usually dont cry in movies or things like that!\n\n\n\n\n", "comment_4": "\nI believe is like in the first verse when he's says he sees a girl with chocolate on her face and she's smiling and waving at him. He things of the beauty of a child and thinks, \"I see a light, a little hope, in a little girl. Hello World.\"\n\r\nThen he talks about going to church and he describes how a church gots all those crosses. Then he talks about going in an just pray a little bit and talk to God. Because when you're in church that's Gods home and you can go in when you feel like you need to let certain things out of your chest. \"I see a light, a little grace, a little faith unfurls. Hello world.\"\n\r\nThen finally he saying sometimes he forgets what life is all about. Then he looks at his wife and children and again thinks. Well hello world.\n\r\nSo it pretty much says don't take certain thing for granted and be thankful that you got faith in God, believe that there are miracles in this world, and don't forget about the beauty that this world has. \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThe first time I listened to this song, I instantly thought of someone recovering from addiction. Be it an addiction to drugs, alcohol, work or life in general. He is observing the world for the first time in this 'sober' state. All the smallest, most insignificant details to us are vivid to the singer. He seems to enjoy this life that he has come back into. \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nHe is numb out in the world,but when he gets home-he's alive again and he can go back\r\nout into the world and face it. :) His family and his faith are his saving graces.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nIt is someone depressed and questioning existence -- both his and God's.  He is slowly dealing with depression. It is the depression healing process for those lucky enough not to need medicine or once meds take effect.  First you realize hiding in your head from all the really heinous noise also blocks out little moments of beauty and meaning that happen in life all the time (a pure innocent noticing you and feeling joy). When you can finally see past your pain, then you have to determine if there is a bigger meaning.  He thinks about stopping church and talking to God like He's there.  Then as he thinks about it, he repeats it twice more until he's asserting it.  Finally he reaches home, his responsibilities -- but the beautiful ones.  The reasons he's going to keep going and tomorrow will be better.  That's what I get from it.\t\t\t\t\n\t\t\t\t\n\n"}