{"comment_0": "\nIt's a slide. The kind that you find in any kiddy park. The song was written BEFORE the Tate murders. Peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nvery simply, this song blew my mind. it's like a four minute trip. and i love the end when john (or whoever it is..it sounds like john) screams \"I've got blisters on my fingers!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni just checked out \"helter skelter\" and i didnÂ´t like, what i read, so i decided to sign up and place a comment to put things right...\n\r\nnow read -  all who are interested in how this song is related to the manson family:\n\r\nit is not true, that the beatles got inspiered by the murders - FACT!!!\n\r\ncharles manson believed that the beatles were sending him messages through their songs. he saw a race-war coming up between blacks and whites - of which he preached to his disciples, the so called \"manson family\".\r\nhe gave this war the name \"helter-skelter\" named after the song.\r\nin the song he heard machineguns and pigs. when he realized, that his \"helter-skelter-war\" wouldnÂ´t start, he decided to start it by himself. he went out with the family to commit the murders. the murderers stole a wallet in the polanskiÂ´s house and it was dropped in a toilet in a petrol-station in a \"black area\". then - so he thought -the war would start. he believed, that the blacks would win the war and kill all the white population. he and his family would escape and hide under the earth surface in the \"bottomless pit\" (described in the bible) which he saw located in death valley. after a long period of time the children of the family would arise out of the bottomless pit, kill all the blacks and then rule the world.\n\r\nthere is a lot more to this story but this version is enough for you to know. \n\r\nall the beatles wanted to do with this song is to outrock pete townsend - THATÂ´S ALL\n\r\npeace!!!!!!, fnord\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think this song is about having sex while you're high. Paul McCartney most likely wrote this song in a girl's POV.\n\r\n\"When I get to the bottom I go back to the top of the slide,\r\nWhere I stop and I turn and I go for a ride\r\nTill I get to the bottom and I see you again.\"\n\r\nBasically, Paul (still in a girl's POV) is describing the different sex positions and how she's so high she's comparing the experience to a slide.\n\r\nBoth:\r\n\"I'm coming down fast but I'm miles above you.\" - refers to how she's about to cum but she's still higher than he is.\r\n\"I'm coming down fast but don't let me break you\" - refers to how she's about to cum (again) but doesn't want him to yet.\n\r\nWhich is also why the song laters says \"She's coming down fast, yes she is.\" in the guy's POV (or Paul's)\n\r\nThe chorus \"Helter Skelter\" is just another reference to their sex experience or a possible orgasm.\n\r\nThe entire song is just one correlation for a crazy sexual exp.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI can't believe that the same guy who wrote this song wrote \"Blackbird\". Paul McCartney is something else...\n\n\n", "comment_5": "\nwhen i was young (this was the 80s...) helter skelter came on the radio in the car. my mother said to me 'this song started all the punk music' and i didn't forget it. \r\ni must say, this song really proves the beatles' strength as innovators.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nDid the come up with this title from Zora Neale Hurston's quote? \"Even in the helter-skelter skirmish that is my life, I have seen that the world is to the strong regardless of a little pigmentation more or less.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nForget the Manson thing for a moment.  Heavy Metal had not come out yet, but this song had all the properties of an awesome metal song.  So metalheads who are against The Beatles, shut the hell up.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nAwesome song, probably one of the first modern 'hard rock' songs.  Even though the Beatles were anything but hard rock, for it's time this song probably was.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nIt was not about the Manson murders, Charles Manson believed in some Beatles songs they were sending him messages. Take George's song, \"Piggies\". Manson spelled this out on walls in blood in some of the murders, if I'm not mistaken?\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nHow could this song be about the manson family murders if it was written before. It is a song about an amusement park. Not that big of a deal. Charles Manson was a psycho. They found \"Helter Skelter\" written in blood on the house walls. The Beatles however are no blame for the crime.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song was written by Paul after he was sick of people saying that he only did cheesy love songs. I think this song is brilliant. Paul's banshee howl of \"HELTER SKELTERRRR\" really makes the entire track.\n\r\nThis also reminds me of Sonic Youth. This seems like a more fitting song for them than \"Within You Without You\", which they covered (surprisingly well, too). \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ni think this song is about a relationship.\r\nit makes me think of my last relationship...\n\r\n\"When I get to the bottom I go back to the top of the slide\r\nWhere I stop and I turn and I go for a ride\r\nTill I get to the bottom and I see you again.\"\n\r\nshe/he is going bottomwards and tries to bring him/herself back up, but wants to stay with that person so he/she goes back to the bottom.\n\r\n\"Do you, don't you want me to love you.\"\n\r\nasking the other person if they want to be loved by the speaker.\n\r\n\"I'm coming down fast but I'm miles above you.\"\n\r\nthe other person is bringing the speaker down, but the speaker is still - mentally? maturity wise? - above the other person.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nJesus christ everyone SHUT THE FUCK UP about manson. It's not written about him and you're not special for knowing he was inspired by this song. For fucks sake.\n\n\r\nAnyway, I believe this song is about straight up, raw, hard, crazy sex. The chick he's fucking may be a 'lover' but she lacks the finesse and elegance of a 'dancer' and can't keep up (i.e. dead fish, wooden board)\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nBut, the song was written in the 60's. So it couldn't have been about the Manson murders. It is actually Ringo that screams \" I've got blisters on my fingers!!!\" He screamed this after they had a long recording session of Helter Skelter.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nafter this song charlie threatened to kill paul mcarthy in which mcarthy replied: John wrote this song\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nAww come on people!! Why are the beatles soooo great?? Look at the words , we are more than the physical. This song is about reincarnation.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nthis is a great song. i sort of wish heavy metal had stayed in this direction, and i probably would like it alot more.  the backing vocals and music are sketchy as hell, but thats what makes this song so good.  helter skelter is actually hte name of a big slide in england, if that hasnt already been said.  sorry if it has, i didnt feel like reading through every post. U2 does a good version of this song, at the beginning bono talks about how he is stealing this song back from charles manson, who stole it from the beatles\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nFor the first person who commented- the person who says \"I've got blisters on my fingers!\" at the end of the song is actually not John, it's Ringo. When I first heard it I thought it was John, too!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI read somewhere that the recording of the song went as long as 27 minutes hence why Ringo's hands were bleeding by the end of the session! And that they cut down the song into 4 minutes or however long it is.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song is about a slide. thats all it is, and all its was.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nMurder music!  ...nah.   I heard from a book on the Beatles that Charles Manson thought that the Beatles were angels telling him to kill black people or whatever (see Fnord's post), and he was inspired by Helter Skelter and also the Piggy song by the Beatles (which he interprited to be about how blacks are pigs or something stupid).  Anyways, Manson killed some black actress- I forgot her name, sorry-- and wrote \"helter skelter\" on the wall in her blood.  Creepy creepy man.  Nifty nifty song.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThey probably got rid of the slide because of the bad associations with the Manson things. Or maybe they just renamed them. Who knows? I don't. I don't even know what I'm saying.\n\r\nIt's about a slide, for real. But Manson's insanity changed the meaning. And I can see why, the song really sounds like it could be the end of the world and stuff, it's just so disturbing and once you hear his meaning, you don't foget.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nthis song is just about a girl you al know the feeling you feel great then you see her and your heart sinks hense the line Till I get to the bottom and I see you again. also the line you may be lover but you aint no dancer is about him he openly joked about not being able to dance well\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nAccording to the Beatles anthology it's about the slide that paul is remembering from his childhood.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nhas anyone heard the grey album? what that guy does with this song and \"99 problems\" by jay-Z is fucking amazing.i love the beatles and jay-Z, download the grey album!\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis song was not about charles manson murders, it was the song that charles manson claimed when played backwards it told him to murder those people. Any ways great song, this song is ahead of its time, sounds like it could have came out of 90's grunge scene. the meaning of the song maybe about doing drugs to forget about this woman, then when he comes down she's back again.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nthis song is all about funkin rocking only. not that asshole charles manson murder tate.the version of the anthology is so awesome although ther is a little bit changes doesnt mean it will take you to manson's world of rotten\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nits about a damn slide\n\r\ni think piggies are the cops\n\r\nrocky racoon... put it together, there is a list of all the weird shit charlie was thinkin\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nManson never killed anyone, his followers did on his orders.  They were not black, they were white (Sharon Tate, wife of Roman Polanski who later fled the country for having sex with a minor, and others).  He wanted to start a race war.  \"Pigs\" and \"Helter Skelter\"(Manson's name for the impending \"war\" which he derived from this song, were written on the walls in the victims' blood as a message from blacks to whites to start the war.  The manson \"family\" was going to hide out until it was all over, thinking that blacks could only do what whites taught them, and then they would come out and rule the blacks.\n\r\nSomething to think about:  Who is usually waiting for you at the bottom of the slide?...your mother.\n\r\nWho abandoned Manson repeatedly throughout his childhood?...his mother.\n\r\nMaybe all this was a reaction to that...no mom waiting at the bottom of his slide though...\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ncharles manson, man hes a nutcase! he killed all the people in the \"tate house\" becuz the beach boys manager had moves out , charlie wanted a record deal more than e\\anything, besides the \"helter skelter\" war, he thought he was jesus, and so did his \"family\" and it wasnt just this and the pigs, he thought \"revelation #9\" was for him two, have you ever read the bible, revalation is about a huge war, number 9 is about a bottomless \"abyss\" that charlie thought was the place that the family could hide \r\nout\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThis is just Paul making up words and turning this into a metel song. GREAT SONG\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI want give an applause to Fnord... great explanation! \n\r\nAs for the song, it WAS created before the Charles manson murders. I bought the book \"Helter Skelter\" only because it was a Beatles song, and I thought it would be about them, and I later found out that it was in fact about the Manson murders, and it does clearly state that Charles Manson believed The beatles were giving him \"Codes\" through their songs... \n\r\nThe song is freaking awesome, I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThis is just a tid bit. Charlie killed Sharon Tate in a house, wrote \"helter skelter\" on the wall in her blood, and now Trent Reznor lives in that house. Connections between my two favorite artists in three steps! IT'S A SMALL WORLD AFTER ALL!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThere was a documentary on CBS in May called \"Helter Skelter\" about Charles Manson. As someone said earlier, according to the special, he thought Revolution Number Nine referred to Revelation Chapter 9 in the Bible. This chapter talks about 4 angels with iron swords or shields or something, which Manson interpreted as guitars, and that the Beatles were those angels. Creepy, yet cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nyeah manson was fucked up...this song is great and so is the whole white album....a very diverse album\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nDid you guys know that the manson murders were committed just hours after the \"Abbey Road\" cover picture was taken?\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nSolinus said something about this being to outdo the Who on \"I Can See for Miles\". That made me think of \"I'm miles above you\".\n\r\nAlso, I'm not really familiar with the exact details of John's first wife and why he left her. If he left her for Yoko, then I'm thinking the line \"Well you may be a lover but you ain't no dancer\" might be saying that he preferred Yoko because she was a \"lover\" and a \"dancer\"--dance is a very artistic thing--compared to his first wife who was only a \"lover\", meaning he got both physical and artistic stimulation from Yoko but only physical from the first wife. I think I'm probably overreaching there, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nBeatles with distortion pedals.. now we're getting somewhere. Alot of people consider this the first \"metal song\" or the first \"punk rock song\". A friend of mine used to joke the Beatles started the grunge rock movement\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nok someone definetly did already talk about the slide..but oh well now you know again\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nthis song is certainly ahead of its time, but i wouldnt call it the first \"heavy metal\" song, that honor goes to \"Black Sabbath\".... probably one of the \"hardest\" of the first hard rock songs though.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nFor the people asking \"Does the Helter Skelter still exist?  Where is it?  Can I ride it?\" - a helter skelter is not a specific slide, but any tall, spiral shaped slide.  These can be found in many childrens' playgrounds in the UK.\n\r\nGreat song too :)\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nrocks \r\nso \r\nhard\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThe \"I got blisters on my fingers!!!\" line was actually said by Ringo, and it wasn't supposed to be on the song. Paul wanted this song to be so loud and so hard that he kept pressure on Ringo to play the drums HARDER AND LOUDER!!! At the end, Paul actually thought it was still too \"SOFT\"!!!!!\n\r\nRingo was actually bleeding at the end of the session. So the \"I got blisters on my fingers!!!\" scream was ACTUALLY TRUE! Cool!\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nMy brother was telling me that the beginning of the song, \"when I get to the bottom I go back to the top of the slide where I stop and I turn and I go for a ride 'till I get to the bottom and I see you again\" means exactly what he said, he got to the bottom of the slide, went back up, and went down again. I thought it was about the murders until I read about Helter Skelter, the amusement park place.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nIn Feb., 1967, Brian Wilson was writting for and producing a non-Beach Boy recording project.  One of the songs he was working on is called Teeter-totter Love.  I wonder with Paul dropping in on the SMiLE sessions in April, 1967 if that song title might have been mentioned in some talking and over the months might have partly been an inspiration or spark for Helter Skelter.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nin reference to Ana99's comment, Trent Reznor doesn't live in the Tate mansion, he recorded the Downward Sprial there. sick song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nchelzador- You obviously have not even read Helter Skelter so why would you make a post like that? If you actually have read the book you would understand that it is believed that the Manson family was somewhat influenced by this song to murder, along with other stuff too. Plus the beatles were in the 60's!!!!!!!!!!!!!!! Now when were the Manson murders chelzador??????? Make sure you know your facts before you make a post that just makes you look ignorant.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nLOL @ \"I got blisters on my fingers!!!\". Damn, I needed that laugh.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nwhen the tate murder house was being destroyed, reznor took the door that had 'pig' painted on it and put it in his recording studio.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThis is going to sound strange but I always thought it sounded like it was either about making love or a slaughter.   Yah, like I said it does sound strange but listen to the song and think about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI got this book on the beatles (The Beatles Forever) and it mentioned something about the white album being about an interracial war. Kind of cool analyzing if you think about it. \n\r\nAt the back of the book it gives a list of least favourite beatles songs as voted. \n\r\nNumber three (after Revolution Nine then You Know my Name) was this song, and i was outraged!\n\r\nThis is one of my favourite songs on the White Album!\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\n[Awesome song, probably one of the first modern 'hard rock' songs. Even though the Beatles were anything but hard rock, for it's time this song probably was.]\r\n-posted by Muzzy\n\r\nI noticed that too...it sounds so different from all of their other stuff because it has such a modern sound. A song that I think might have been influenced by this song is Bloc Party's Helicopter...the beginnings at least. They sound different for sure but also strangely alike...I love this song! Too bad some sick fuck had to tie such terrible acts to it...my mom has a hard time listening to it for that reason alone.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nmanson wanted the murders to be blamed on the blacks\n\r\nand check out his myspace!\nprofile.myspace.com/…\n\n\n", "comment_54": "\nno charles manson took the song helter skelter and saidf it was his theme song because its about anarchy and chaos\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nOasis did a great cover for this song \r\nkeep rockin' Oasis\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\n\"I GOT BLISTERS ON MY FINGARS\"......perfect\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nthis song is loud and angry. i heard it on the radio today and it kicks ass! I love the end they just freak out and as otohp says that is so awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nalso whoever says this song is about an amusement park was correct.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nIt's about sex.  It's probably a double entendre with a roller coaster.\n\r\nHelter skelter means confused, messy, chaotic, etc.\n\r\nAnd Charles Manson was a psychopath that listened to the songs and thought the Beatles told him to kill people. End of Story.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nCharles Manson has a MySpace page??? Anyway, how the hell did he manage to interpret this as a sign of a race war?\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nCool song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\ni heard U2's version of the song. All I can say is, nobody does it better than The Beatles themselves. What I like about U2's version is, Bono said \"This is a song Charles Manson stole from The Beatles, we're stealing it back.\" before he sang.\n\r\nI'm really sad because this song has great music, but Manson released the unreasonable filth. Thanks to those fans who appreciate this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nahhh the bass in this song makes me wet my pants\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nHeychelzDOR THER IS NO Wy in hell that this song is based on the manson murders. manson used these songs as  a bullshit excuse as a  reason to commit his murders but if u look mat the song and listen there is no way you can link a connection\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nHelter skelter is British slang for a playground slide, not a ride like Space Mountain. Ya, Paul was trying to outrock Pete Townsend, and the song, I think , is about a girl. Manson had a different interpretation for EVERY song on the White Album. Helter Skelter= the race war. Piggies- rich snobby whites. Revolution 9- Book of Revelations. Charlie thought the Beatles were the 4 horsemen of the Apocolypse. Honey Pie- telling Charlie to start the revolution. Blackbird- the blacks rising up against whitey. I forget all the rest.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\neverybody stop attakin chelzdor! he made a mistake leave him alone!\n\r\nsomeone a couple of pages back said about the mum bein @ the bottom of the slide and charlies mum was never @ the bottom of his.mayb the  songs did set off a deeper meaning in his brain but he covered it up woth all tht twisted shit.\n\r\nAlso at the end it fades out and fades in again. they did this also in strawberry fields and some other songs. Does anyone no why?\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI have a very small detail to add that wasn't mentioned before. When Ringo yelled \"I GOT BLISTERS ON MY FINGERS\" it was after 18 takes and he threw his sticks across the room before he said it.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nand like some people said before, it's about a children's playground and a slide, nothing more, nothing less.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nU2 had the last word on this, I think.  They cover the song on their \"Rattle and Hum\" double album.  Bono starts the song by yelling at the audience, it goes something like this; \"A murdering bastard named Charles Manson stole this song. WE'RE TAKING IT BACK!!!\" and off the boys go into a rough, nasty, hard-rocking cover of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nthis song is a straight out rock n' roll trip its amazing how much energy goes into this its like a drug when i listen to it my band is so covering this\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nHelter Skelter was written by McCartney, (not Lennon, suprisingly), in response to critics who said he \"only wrote ballads\".\n\r\nMcCartney was inspired to write the song after reading an interview of the Who's Pete Townsend where he described their latest single, \"I Can See for Miles,\" as the loudest, rawest, dirtiest song the Who had ever recorded. McCartney then \"wrote 'Helter Skelter' to be the most raucous vocal, the loudest drums, etcetera\" and said he was \"using the symbol of a helter skelter as a ride from the top to the bottomâ\u0080\u0094the rise and fall of the Roman Empireâ\u0080\u0094and this was the fall, the demise.\"\n\r\nA \"helter skelter\" is not a particular ride in England, but rather the name of a popular type of ride with a slide built in a spiral around a high tower. Users climb the tower and usually slide down on a mat. It is thus similar to a waterless hydroslide. The term is primarily (but not exclusively) found in British English.\n\r\nCharles Manson saw the song as prophetic of a race war between blacks and whites. LADA Vincent Bugliosi, who led the prosecution of Manson and family, named his book on the murders \"Helter Skelter\", the book was the basis of two movies on the subject.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI always thought the lyrics had a clear sexual double meaning. It's nothing profound really, and the fact that Manson read anything else into the song only says something about his deranged mind.\n\r\nWhile there are several contenders for \"first heavy metal song,\" this one has a number of qualities that put it way ahead of its time. First of all, it may well be the loudiest, noisiest rock song of the 1960s. Second of all, most proto-metal songs were rooted in blues, and this may be the first to have a melody that is squarely rock, not blues. Finally, consider the screaming vocals, which would not become a feature of heavy metal until much, much later. Even Black Sabbath, widely regarded as the first true heavy metal band, almost sound restrained by comparison.\n\r\n\"Helter Skelter\" may not have directly anticipated extreme forms like death metal or black metal, but its misuse by Manson contributed inadvertently to the dark reputation of the genre.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nCharles manson NEVER murdered anyone.\r\nhe told people to murder for him.\r\nmake that clear.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nthis song just fucking rocks. \r\nperiod.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nPaul said in an interview he did in the late 70's to early 80's that \"Helter Skelter\" was a musical interpretation of the steady downfall of The Beatles.  One must remember that this was around the time that Yoko Ono became a prominent figure in John's decisions.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nOK, I think the meaning of this song is about a guy who likes a girl but he's not sure if she likes him back.  The slide is a metaphor for for his feelings towards. He really wants her at times, but other times he's not sure.  \n\r\nShe's a lover and not a dancer, because she's not playing his game.  She's playing hard to get.  \n\r\nNow he's asking himself, DO YOU WANT ME TO MAKE YOU?  TELL ME THE ANSWER, before I break you.  \n\r\nBefore he goes nuts and just gives up all together.\n\n\r\nThen at the end... well, we find out that she told him the answer.  She joins him at the bottom of the slide.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nthis is one of the funniest songs i've ever heard. lol. I mean the ending is just so strange like it's the ending but comes back on with the guitar solos. Then the screaming of, \"I'VE GOT BLISTERS ON MY FINGERS!!!\". lol. that's kind of a cool song of their's too.\n\r\nI also like Motley Crue's cover song for, \"Helter Skelter\".\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThis wasn't inspired by those murders.\r\nThis was written and recorded in 68, th murders were in 69.\r\nit was the other way about. The beatles were blamed for inspiring the murders as the words \"HEALTER SKELTER\"[sp] and \"PIGS\" were written in blood at the scene of the murders.\r\nManson had told the \"family\" his idea of what the song was about (some racial war. i won't go into details)\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nCharles Manson listened to the song and thought the Beatles were sending a message of an apocolyptic war called \"helter skelter\".  Manson claims that the Beatles speak to him through the White Album.  This song has NO connection with the murders other than the fact that manson interpreted the lyrics that way.  The Beatles have denounced manson for thinking that way.  Get it straight people.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nThis song is about being on a rollercoaster, \r\n\"When I get to the bottom I go back to the top of the slide\r\nWhere I stop and I turn and I go for a ride\" and so on.\r\nCharles Manson was said to have killed because of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nI've read alot  about serial killers manson ect i like to read that sort of thing, the sociopathic human mind is very interesting. but what's with defending him. So what Hitler never killed anyone either he had people kill for him infact he hated hunting animals thought it was inhumane does that make him okay though 'cause he didnt kill people with his own hands? You have the right to your opinions that fine with me its what makes (some partsof ) this world great I dont care, and I dont dislike you but that's just my two cents worth.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nthis song has no meaning\r\nthe words are incidental\r\nit's just meant to be heavy as shit\r\nand it is\r\nplay this song from 3:11\r\nthis is the heaviest song ever recorded\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\n\"helter skelter\" was acually an amusement park ride\n\r\nwhen the white albulm came out (i beleive in 68?) charles manson adapted it, especially this song as kind of like his soundtrack \n\r\none of my favorites by the beatles tho... it sounds so differnt from most of their other stuff\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nChelzador, actually Manson used this song as his inspiration. His entire operation was called \"Helter Skelter\" because he thought his actions would trigger armageddon and make everything helter skelter.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nWell, this song definitely wasn't written about Charles Manson, but he felt that this (and the entire White album, in fact) was written to direct the Manson Family in their goals as a group. This song, in particular, was believed to tell them to start a race war between the blacks and the whites, in which the blacks would end up winning and then then Manson Family could emerge from the Bottomless Pit in which they had been staying while the war had been going on, and they would rule over the blacks. When Manson personally felt that the race war wasn't happening soone enough he decided they would start the war, and ordered the Tate murders and then the LaBianca murders. The song really has nothing to do with that, or at least, most people don't interpret it that way.\n\r\nCharles Manson didn't think he was Jesus, by the way, not really. He told some people he was, but he never really thought he was. I don't really think he is crazy, he had the potential to be one of the greatest men to ever live.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI don't think that this song has ANY connction to the Manson Family murders, and I don't want to think that. Same goes for Piggies. Why do people have to put such negativity towards something beautiful such as a beatles song. Just leave it as it is. Okay?\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nDo some research before you people go running on and on about how this was inspired by the Manson cult murder.\r\nNo it wasn't.\r\nHelter Skelter was released ONE YEAR before the murder even happened. \n\r\nCharles Manson and his \"family\" attacked while, if I'm not mistaken\" during this song and then wrote \"Helter Skelter\" on the walls in blood.\n\r\nI think this song is about a drug trip. \"I'm coming down fast, but I'm miles above you.\" I think is talking about the sensation of a trip. When you get high, depending on what you're taking, the high doesn't last very long, but of course you are still \"Miles above\"\n\r\n\"When I get to the bottom I go back to the top of the slide\r\nWhere I stop and I turn and I go for a ride\r\nAnd I get to the bottom and I see you again.\"\r\nThis is once again talking about getting high, once you do it, you want to get high again and again. and when you are done the high, you are (Somewhat) back in reality.\r\nSo all in all,\r\nTHIS SONG IS ABOUT DRUGS AND A DRUG TRIP!!\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nLennonGirl4, that does /not/ make Hitler right AT ALL!!\r\nHe was a deranged and angry man who blamed the Jewish people for all of Germany's problems. He was the one who targeted minorities and bullied other countries and started the genocide known as The Holocaust. He used fear to control people and he was...ugh. I can't even describe my hatred for that man in words...\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nMolly Mugshot, you are wrong when you say \"Helter Skelter\" is about drugs.  It's about a WATER SLIDE.  Paul wrote the song in response to Pete Townshend when he said their newest song \"I Can See For Miles\" was the rawest rock song they ever wrote.  \r\nI found a picture of the water slide here:\nsouthshields-sanddancers.co.uk/your_photos/…\n\r\nDiscussion OVER\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI always thought John sang this but damn Paul, you can scream too! :D \t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nOk, so the song is based on a roller coaster.  I got that.  But the roller coaster is a metaphor for a hot, steamy romance.  Do you, don't you want me to love you.... It is about hot, raw, sex.  Nothing more, nothing less.\n\n\n", "comment_92": "\ndid they mean dancer as in a stripper?\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nThis song is about drug use.  \t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nI can see sexual conotation... am I a pervert??\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nBest song by The Beatles no doubt.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nAnother favorite!! Paul's best song on the White Album!\r\nI like the Anthology version too! No cover version compares to the original.\n\r\nAll I want to know is, what the hell is Paul whispering when the song fades out & fades back in?? \t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nWhoever she is-helter skelter-she is a heart breaker.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nI remember reading somewhere that Paul saw an interview with Pete Townshed in wich he said that I Can See for Miles was the noisiest song ever written.\nPaul thought \"challenge accepted!\" and wrote Helter Skelter, trying to be as noisy as possible.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nOh for God's sake ppl... there's nothing deep about the lyrics so stop over analyzing. Basically he's just trying to persuade the girl to be a risk taker. . and in the end she takes on his challenge... like riding a roller coaster for scaredy cats. The end\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nSGT. POPGRASS has a very original version  of this one...Check It Out !!!\nsoundcloud.com/sgtpopgrass/…\n\n\n", "comment_101": "\nI did know about Charles Mansion and that he wanted a race war and tried to start one with the Taite LaBianca murders and the song existed before that.\n\nMy take on the song is that it's just a guy who is very unsatisfied with his girlfriend and thinks he's better than her and enjoys putting her down.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nHester Skelter was actually a water slide in England. Paul cleared up the meaning of many of the Beatles songs. Most were things they experienced as children. Nothing more.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nshe'll bang him but won't be seen with him on the dancefloor\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nI always thought he said he had blisters on his penis at the end\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nif you play it backwards it sounds like he says \"she never takes me anywhere\"\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nU guys are idiots! It is a song about a slide. Dont act like CM owns it. He is just a sick disturbed individual that  was good at controlling zombies much like he's gotten in ur heads and let u steal this song from John and give it to CM.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nHitler has been dead for a very long time you waste too much emotion hating him now. Hate fogs your mind and not healthy let it be\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nEverything on the White Album can be explained away as just pure coincidence, except Sexy Sadie! Manson gave Susan Atkins that name the year before the White album was released, and that song word-for-word explains what she wound up doing. And don't try to tell me that she did it on purpose. She spent the last 40 years of her life in prison before dying of cancer. People think they know everything, but they don't no shit! At least not for sure. \t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nI understood the lyrics as Danny Zuko's ode to Sandy. As in there's a romance going on between the 2 people, but the singer is saying he moves at a faster pace than the other: \"You may be a lover but you ain't no dancer\" and \"Til I get to the bottom and I see you again.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nThe Beatles came right up to the edge of heavy metal with \"Helter Skelter,\" and flirted with very early punk on \"Polythene Pam.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nIs the Helter Skelter slide still around today? I'd love to ride it next time I visit the uk. I know it's a part of Dreamland Park, which is in Margate. But I don't know if Dreamland Park still exsists anymore.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nthis is all around a great song! and u know wut? i know this is kinnda sick and twisted but manson had alot of good views on things! like it's horrible that he desensitised his \"family\" into murdering those people and he wuz completely psycotic but other then that alot of the things he said made alot of sense!....anyways i'm not crazy i'm really not! lol wutever this is a great song! it is the song that started alot of the punk music! the beatles rock!\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nThis song is sometimes considered the first song of the earliest form of Heavy Metal.  In other words, the first Heavy Metal song ever.  Damn Beatles, they started everything.\n\r\nFor those who are wondering, the song that Paul wanted to \"Out Rock\" with this song was \"The Who - I Can See for Miles\" which some magazine called the most rockin' heavy song ever or something.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nHelter Skelter is about having sex with a dead woman. She can lie on the floor for sex but she cannot stand and dance.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nThis song is actually about the murders committed by the Manson \"family\" back in the seventies, i believe.  Their code name when they discussed their plans was \"helter skelter\" and there is even a book entitled \"helter skelter\" written about the murders.\t\t\t\t\n\t\t\t\t\n\n"}