{"comment_0": "\ngod, this video is just so....\n\r\nseducing\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI love Nick Caves & pj`s version of this song.\r\nits lyrics are based around a 1930`s version by dick justice.\n\r\n\"Get down, get down, little Henry Lee, and stay all night with me.\r\nThe very best lodging I can afford will be fare better'n thee.\"\r\n\"I can't get down, and I won't get down, and stay all night with thee,\r\nFor the girl I have in that merry green land, I love far better'n thee.\"\n\r\nShe leaned herself against a fence, just for a kiss or two;\r\nWith a little pen-knife held in her hand, she plugged him through and through.\r\n\"Come all you ladies in the town, a secret for me keep,\r\nWith a diamond ring held on my hand I'll never will forsake.\"\n\r\n\"Some take him by his lily-white hand, some take him by his feet.\r\nWe'll throw him in this deep, deep well, more than one hundred feet.\r\nLie there, lie there, loving Henry Lee, till the flesh drops from your bones.\r\nThe girl you have in that merry green land still waits for your return.\"\n\r\n\"Fly down, fly down, you little bird, and alight on my right knee.\r\nYour cage will be of purest gold, in deed of property.\"\r\n\"I can't fly down, or I won't fly down, and alight on your right knee.\r\nA girl would murder her own true love would kill a little bird like me.\"\n\r\n\"If I had my bend and bow, my arrow and my string,\r\nI'd pierce a dart so nigh your heart your wobble would be in vain.\"\r\n\"If you had your bend and bow, your arrow and your string,\r\nI'd fly away to the merry green land and tell what I have seen.\"\n\r\nyou can hear it here youtube.com/…\n\n\n", "comment_2": "\nthe song is way too nasty! god, can jeaousy make one kill another just like that?\r\nThe only other place I saw such extreme nasty and mean lyrics is E.A.Poe's poems&stories and I just love it.\r\nanyway, one of the greatest cave songs i'll say.\r\nby the way, this is sung with ex-lover p.j. harvey right?\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis is one of those songs I like to listen to when I feel victorious. =P\n\r\nI've used it as an away message quite a few times over the years, I love morbid things and this is one of the most morbid songs I've ever heard. for some reason, it reminds me of john steinbeck's east of eden... heh, cathy trask...\n\r\n\"lie there, lie there, little henry lee\r\ntil the flesh drops from your bones\r\nfor the girl you have in that merry green land\r\ncan wait forever for you to come home,\"\n\r\nthis is my favorite verse in the song, and the imagery I get of a single bird watching the events unfold... perfect.\n\r\nit's definitely some evil subject matter, but that's what makes it so delicious. it's a perfect combination of talent, if you ask me (pj and nick).\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt's quite nursery-rhyme-ish, I think. In a twisted kind of way.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nwow! i first heard this song when i friend of mine played it at a party....the \"la la la la la\" part just haunted me for days before i figured out which song it was from the lyrics. theres something so eerie and waltz-like about it. the melody just wraps itself around your head and twists in hooks with the lyrics. a truely beautiful song. seriously.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nSlightlyMad, I think you are right on with the comparison to Poe.\r\nIt also have some charactaristcs from mideval ballads with expressions like \"lily white hand\", and the rythm of the lyrics with the same lines at the end of every verse instead of the usual verse-chorus-verse-chorus...or however the modern pop song go.\n\r\nA wonderful song. The meaning is very straight forward though. Not much room for interpretation there, hehe\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nBeautiful song, and the video is damn sexy.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI don't know if nick and Pj were ever a couple. But I wouldn't put it past me after seing the cover of the Henry Lee single :)\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nNick says: \"This is a song about extreme sexual conflict, and, uh...\n\r\n...shit like that.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI just looked again in the lyrics booklet and it says \"lyrics: traditional/Cave\" So I guess it is adapted from a traditional ballad. And so are other songs on this album (Murder Ballads)\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ncouldnt agree with you more Songmeaningsuser\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nTo Sunquai: Yes, Nick Cave and PJ Harvey were together for some time.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nLove it. I love Nick's fascination with violence, sex (etc) .. it's delicious and intriguing ..and addictive.\r\nThe video is sexay. The chemisty between those two is amazing!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nAre there more people than me that sees the irony in PJ killing Nick?\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nthere is a traditional version apparently, here's a link to it:\n\nbad-seed.org/~cave/lyrics/…\n\r\nI remember that this song entered my mind when I was just kid, and that eerie feeling about it, but in a good way.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThe traditional version sung by Dick Justice can be found on Harry Smith Anthology of American Folk-or hopefully as easy as a sound file online.As well as Cave covers King Kong Kitchie Kitchie Ki-Me-O by \"Chubby\" Parker.  Mr. Cave has the job of keeping these tracks alive pretty much to himself these days.  Fascinatiing stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\n'Murder Ballads' is an equal opportunities album! Altho' most of the murderers are male (as in life), the women get a fair go, too. Old ballads are full of jealous & murderous women, & some of those ballads are far more extreme than anything Nick Cave has done. That last verse is chilling - \"the girl you have in that merry green land/ can wait forever for you to come home\". That line sends a shiver down my spine.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI think Nick Cave draws pretty successfully not just on Poe's style but also on the whole Victorian predilection with the macabre, as well as a style that reminds me of early 20th century/depression era.\n\r\nHe also does a pretty good job of taking traditional/historical themes and putting his own spin on it. \n\r\nMurder Ballads is a good album to hole up with and listen to when you're pissed off with the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis song reminds me a LOT of William Faulkner's short story \"A Rose For Emily\".\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI always thought it had something to do with Henry Lee Lucas and his somewhat incestous relationship with his mother...anyone else ever heard that?\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nSimply gorgeous. Such a disturbed story, but I think anyone could relate to Polly Jean sometime in their life!!:P\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI ve checked all of the translations could find all over the world(French, Russian, Italian), and there is one verse, nobody could translate it, I think. (3 languages, 3 different meanings)\nCould Somebody explain me, what this sentence mean?\n\n\"A little bird lit down on Henry Lee\"\nI couldn t find the verb in any dictionary, (not even in synonym one.\n(In all of the lyrics versions on net is written 'lit down'. (But can be 'let down', too, as I listen to Nick's or P.J.'s voice)\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nHi LograyX!\nThanks for your reply!\nI thought so:-))\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nFor me this song is a bit confusing:\n\r\nFirst Nick Cave sings from a first person perspective.  \"I can't get down and I won't get down \"\r\nThen in the next verse he's not singing about him anymore: \"She plugged HIM through and through \" \n\r\nAnd another thing I noticed: \r\n\"Come take him by his lily-white hands \r\nCome take him by his feet \"\n\r\nSo Henry's killer takes him by the hands, but who's taking him by the feet then?\r\nDid Henry's killed had a companion?\n\r\nMaybe I'm just taking it too serious. \r\nExcellent song, nonetheless though!\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nFor me this song is a bit confusing:\n\nFirst Nick Cave sings from a first person perspective.  \"I can't get down and I won't get down \"\nThen in the next verse he's not singing about him anymore: \"She plugged HIM through and through \" \n\nAnd another thing I noticed: \n\"Come take him by his lily-white hands \nCome take him by his feet \"\n\nSo Henry's killer takes him by the hands, but who's taking him by the feet then?\nDid Henry's killed had a companion?\n\nMaybe I'm just taking it too serious. \nExcellent song, nonetheless though!\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nOne of my favourites off Murder Ballads (favourite is Stagger Lee).  Henry Lee Lucas was a serial killer.  I doubt very much there's a connection there, and I only thought of it recently when listening to Fantomas' album \"Director's Cuts\" (Henry: Portrait of a Serial Killer).\t\t\t\t\n\t\t\t\t\n\n"}