{"comment_0": "\nThis song is nothing but comfort for me. It was the first song I ever heard, my mom would sing it to me when I had a bad dream, and the night my dad moved out when my parent's divorce was final, I listened to this on the cassette player. Now it's one of my recovery from depression songs. I'm not fully recovered, in fact I just started treatment, but this song makes me smile with the assurance that in my life the sun will come. It seems like when I'm about to fall apart, The Beatles have a song that saves me!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI don't think this song is about summer. It's about being happy. Being sad (long cold lonely winter) and then being happy again (here comes the sun).\r\nA very nice tune. Love it, one of my fav from George.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI love this song, it always makes me feel happy! George Harrison decided not to attend a meeting with Apple and went to Eric Claptons' house. While there he walked around the garden with one of Claptons' guitars and wrote a love song. It is about tomorrow, and the optimism it brings. It has no underlying negativity, or cryptic ideologies. It gives you a sense of something that is coming, something so clear and beneficial. Happiness.\nIt is refreshing; a cold sunny morning.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nMy take on these lyrics is that is it a reflection on a depressive episode that was lifting and the brighter clearer future is in sight.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nWhen George wrote this song, I think what he was trying to say that every new day brings a chance to start all over and forget the mistakes you made in the past, and that anyone has this opportunity.  George talks about winter and the cold and it seems to me that those represent the hardships that he's ready to leave behind to start a new\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI can't stop listening to this song lately.\n\r\nI am going through a huge spiritual awakening.  After years of addiction, self will and turning my back on God, I have finally let him into my life.  And He is working miracles.\n\r\nThis song captures it all for me.  After that long, cold, dark spiritual winter - the sun (Son?) is finally peeking through.  I feel that ice is slowly melting.  It feels like years since it's been here.  The warmth, the hope, the optimism - all returning like Spring after a cold winter.  After all the years of worry, anxiety, self-will, resentment, anger, fear - I have turned my life over to God.  And - like George Harrison said - I finally feel like \"it's allright\".\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nGeorge was getting sick of the music business.  it had lost its fun with everyone telling him to \"play this, sign this, do this.\"  he wanted a break, so he went to his good friend eric clapton's house to relax.  he borrowed one of erics acoustic guitars and went for a walk in the garden.  he strummed a chord, looked up into the sky just as a cloud passed away from the sun, and said to the sun \"here comes the sun and its alright.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI know this song is about all the great things everyone else has mentioned... but ever since my daughter was born, I have automatically always personally thought of this song being about her. Her smile is perfection and I feel like I am looking at the sun whenever I see her little face light up.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song reminds me of my friends' mom, Angie. She LOVED this song. When she passed away a little over a year ago, it was one of the hardest things in life for me. First funeral I've ever been to. They also played this at her funeral. Even though it makes sad to know she's gone, but I'll definitely never forget her. Now, I think of it in a good way. Remind myself of all the memories I have of her. It brings me to tears, because I can still hear her voice, her laugh. They're happy tears, though. She was such a beautiful woman. I miss seeing her little short self, hearing her jokes, seeing her smile, & even saying my name. I can still hear it. I just know she's in a better place jamming out with some of The Beatles, living the dream. :) So, R.I.P. Angelia Cooper. Love & miss you. Gone but never forgotten. You'll forever be my always. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni love this song, it has the same meaning as \" i can see clearly now\" it simplizes the chance to make new and start over.. like your worries have passed over head and the sun is coming out to dry up all those tears,,, i LOVE THIS SONG !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI love this song. It always helps me stay positive and not worry about the bad things or what went wrong. It just always makes me in a better mood. \n\r\n\"Little darling I feel that ice is slowly melting\"\n\r\nTo me, this means that the problems are going away. Its my favorite part in the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nWell besides all the obvious positive stuff, I wonder if it also has to do with the group as a whole. I've heard when they were recording Abbey Road they were overall happier and worked more together than they had for the past few years. Maybe kind of like after some breakups, you actually enjoy that other persons company again, even if for a short time. Well, the choruses mention smiles returning to their faces, and ice slowly melting, and it seeming like years since thats been the case. I don't know, nothing too deep but maybe a commentary on how the band seems at the time, knowing it's over.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI think this song is about how recording the album was almost over and it was a please to be finished\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni love this song so much. i think its nice to hear it when things were going abit wrong, but now are better again, it can almost make you feel like the good never went away. in the top 10 of best beatles songs i think\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nGeorge is my favorite Beatle, and this song just makes me want to get a time machine and go back and marry him.\n\r\nThe lyrics are so light and easy.  It doesn't have a dark, hidden meaning and it's not heavy.  It's just a lovely, fun song, and it makes me smile whenever I hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI love this. <3 \t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nTo me, this song talks about how we're so used to everything in the world not being positive or upbeat, that when something nice finally happens we're too afraid to acknowledge its presence. And the narrator comforts that person with \"it's all right\" and shows how everything is slowly getting better.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI think this song is about reflecting on the past and remembering the bad things, or the things that have brought us down and finally coming to the realisation that they have happened and we have dealt with them and now it is time to move forward and look to new beginnings and focus on the things that bring us happiness\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nMy interpretation of the meanings within this song are similar to the saying you are able to see things clearer, things have changed and change is being welcomed. Its going from a place of darkness/unhappiness to happiness.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think this song is about looking forward into the days to come , and reflecting on the past and wat once was. Looking forward to a brighter warmer future and saying goodbye to a cold dark distant past.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nAnd even after a long winter, it has to get warm again... nothing will perpetually stay bad.... all things end well, and if they arent well, its not the end\n\n\n", "comment_21": "\nMy parents had a clock, and the alarm was an instrumental version of this song. So, every time I hear it, I think of being like 5 years old and listening to it in my parents' bedroom.\n\r\nAnd I think this is George's best song, along with \"Love You To.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nGeorge Harrison wrote this in Eric Clapton's garden using one of Clapton's acoustic guitars. When the Beatles' manager Brian Epstein died in 1967, the band had to handle more of their accounting and business affairs, which Harrison hated. He wrote this after attending a round of business meetings. \r\nThis was inspired by the long winters in England which Harrison thought went on forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nkmk is right.\n\r\nI guess that harrison probably had a condition known as Seasonal affective disorder.  I have it, and I know it's fairly popular over in G.B., but it wasn't discovered until the mid 80's.  To people with SAD, the sun means everything, and in may/june it lets us be happy and we get our energy back after the depression and lethargy we suffer in winter.  It really sounds like Harrison could have it, the way the whole song is written, and I know it sounds exactly how I feel right about this time of year, just gettting my own self back again, being happy, relaxed, and everythings alright agian.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ni love this song!!!!\r\ndefinitely one of my favorites by The Beatles\n\r\nits so optimistic...and I agree this song is like the epitome for The Beatles...its so great!\n\r\nI love the beat to it just gives so much hope and optimism, it just makes me smile\n\r\nBecause of this song I always relate the sun to hope/optimism...the way it shines...the way its calming and comforting...and how it makes a lot of people happy....the sun always comes back after a rainy day or a hurricaine or a tornado....just knowing that...in a way...gives me comfort\n\r\n^ that may seem weird...but I guess that's just how the music makes me feel\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is so amazing. When ever I'm depressed. I just listen to this song and everythings better. It totally gives you an optomistic view of life. One of the best beatles songs.. For sure.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nDon't read into this song... just simply here comes the sun and it's alright... just a beautiful moment you can experience everyday, i really don't think there is anything else to it... perfection\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nLiterally, George wrote this song because winter in London is over at that time.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis song really shows a drawback that CDs have over Long Players.  This song was the first track of side B of Abbey Road.  The last track of side A was I Want You (She's So Heavy).  That song was so dark and forboding, flipping over the album and playing this was like physically flipping over to a new day.  You just don't get that by hitting 'next track' on the cd player.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nGreat song.  Anyone who lives in colder climate can appreciate the line about \"it's been a long, cold, lonely winter.\"  The return of sun and warm weather, the line \"it feels like years since it's been here.\"  It's about re-birth and a return to happiness.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI don't think it's just about the bad things inevitably coming to an end, but that whatever bad things he had been experiencing at the time WERE coming to an end. It is such a nice nice feeling this song creates.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nGeorge said \"'Here comes the sun' was written at the time when Apple [the recording company] was where we had to go and be businessmen:'sign this ' and 'sign that'. Anyway, it seems as if winter in England goes on forever;by the time spring comes you really deserve it. so one day i decided i ws going to sag off apple, and went over to Eric Clapton's house. The relief of not haveing to go and see all those dopey accountants was wonderful, and i walked around the garden with one of Eric's acoustic guitars and wrote 'here comes the sun'.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI get a positive vibe from this song. \r\nThe first time I heard this song was on the morning of January 1, 2000. I was listening to the radio. The dj commented about how during the past 24 hours the entire world in just about every country (no matter their differences in politics, cultures, etc.) had celebrated the coming of the new millenium. \r\nCapital cities from one time zone after another celebrated with fireworks as the clock turned to midnight at their location. The dj observed how remarkable it was that the entire planet was united for a common purpose to celebrate a moment(s). \r\nThe world was in harmony.\r\nWhile the dj was making his comments, \"Here comes the sun\" was being played in the background. Ever since then, whenever I hear this song, it makes me think that better days are ahead for humanity despite any current negative news. And on an individual level, a new day means new possibilities and new opportunities. It is an optimistic song.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThis song gives you a warm feelling Inside , I like to play this song in the morning  it just gives you a great feeling for the day and it also helps you to get through the day  and it puts a smile on your face and thats always a good thing to have.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThis song is open for interpretation.  I like to think it's about finding love.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI love this song...even had some friends play it at my wedding!\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nlove this song. love the beatles. \t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nIt's about enlightment, after a dark period in life: 'Here comes the sun', and: 'it's all right.'\n\r\nLove the Love-version (But then again, wich song from that album isn't a lovely reworking?) with the random 'Inner light', festive ending \t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nSaying the Beatles are amazing is an understatement.\n\r\n& ha, saying \"the Beatles are amazing is an understatement\" is a freaking understatement.\n\r\nI love this song, it's beautiful. (:\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThis song is mainly about the changes that occur within our life that block us from seeing the light of day. Here comes the Sun is really about welcoming the beauty of love. When George sings, \"it's alright\", he means it because once he has welcomed hope and warmth into his life...there are no worries! The truth is though, that it sometimes takes years of winter to make us realize we are surrounded by beauty. Well, I could go on and on forever..\nBut there's no fear to explain more.\nI know those \"do do do do\"s ring forever...\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nthis song is very simple. its a love letter to humanity. in a word HOPE. the long cold lonely winter will pass and we can enjoy happy times in the sun.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nHere comes the Sun to me is that every day when i see the Sun it brings me positve erengy in the world and it reminds me of my Grandpas they always bring out positve things to say to the world to me and also the sun makes me think of my Boyfriend all the time i am always happy when i see the sun it brightnes my entire day.  Jacqueline Hammond\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nmy parents were divorced and i didnt see my father much, but when i did, he would play this song in his car or home hifi,being a huge george harrison fan.  i always listened in silence thinking that he was happy that his 'son' was around and had 'came'....\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nStory time\n\nLast year I had a same-sex crush on a dear friend of mine who is not only straight but also fairly conservative. I was terrified that she'd reject me if I told her, but, I felt like I was lying by not telling her the truth about my feelings, considering we were so close. So I decided to tell her the truth.\n\nThere was a few days between when I made this decision and when I had a chance to tell her. During those few days, the only thing that could calm my nerves was listening to this song. So I had it on repeat over and over again.\n\nShe didn't reject me. We're still friends. So now this song fills me full of joy, reminds me of how thankful I am to have her friendship still, and how an impossible situation turned into a beautiful one.\n\nDefinitely not the Beatles' intent, but it means a lot to ,e :)\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI chose â\u0080\u009cHere Comes the Sunâ\u0080\u009d by The Beatles, and my take on it is that itâ\u0080\u0099s a moment of realization from a person finally knowing that theyâ\u0080\u0099re â\u0080\u009chappyâ\u0080\u009d.\n\nThe line â\u0080\u009chere comes the sunâ\u0080\u009d is repeated constantly. The use of â\u0080\u009csunâ\u0080\u009d giving off a bright and joyful feeling, and I believe that and the fact that itâ\u0080\u0099s repeated 10 times throughout the entire song is used to emphasize the idea that better times are coming. \n\nIn the first verse of the song, The Beatles reference winter time even though the majority of the song focuses on the sun. I believe that they did it to symbolize the more melancholic times. That can be seen as they say â\u0080\u009clong cold lonely winterâ\u0080\u009d, for the use of â\u0080\u009clonelyâ\u0080\u009d and â\u0080\u009ccoldâ\u0080\u009d give off a sadder mood than the rest of the song. \n\nHowever, in the second verse they say that winter â\u0080\u009cseems like years since itâ\u0080\u0099s been hereâ\u0080\u009d, and I say that is done in order to metaphorically say that the subject of the song went from a depressing and more â\u0080\u009cwinteryâ\u0080\u009d time to a happier â\u0080\u009csummerâ\u0080\u009d time. \n\nLastly, the subject of the song constantly references a â\u0080\u009clittle darlingâ\u0080\u009d, and those two words turned the entire song into a conversation form one to another, as if it could be a father and a daughter or maybe a couple. It makes the song a lot more encouraging because it shows that as heâ\u0080\u0099s telling the other person that thing can and are getting better, heâ\u0080\u0099s realizing that himself.\n\nI believe that in its entirety, the message of the song is that better times are coming no matter how â\u0080\u009ccoldâ\u0080\u009d life is getting.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nA very optomistic song. Not one of my favorites though.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nA Classic song that everyone has heard and loved!\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI know it's a Gerge song, but it sounds to me like typical Paul in its simple optimism. One of my all-time favourites. Also the first Beatles song (and one of the first pop songs) to feature a Moog synthesiser.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI just love this song following I Want You (She's So Heavy).  It almost sounds funny.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nhaha!  i never noticed that...\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI agree with 0cool. To me this song says that there is always going to be happiness no matter how dark some times can get. This song has helped me sort alot out and is a very special song to me. And you just gotta love the tune.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nbeautiful song. i think it's about starting a new and leaving all your mistakes and regrets behind. i miss u george\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nProbably one of the best Beatles songs ever written.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\naCTUALLY BUTTERFINGERS YOU ARE INCORRECT THE FIRST WAS \"I FEEL FINE\" ONE OF BEATLES EARLY TUNES,IT IS DEFINETLY A EXCELLANT SONG,PROBABLY THE BEST ON ABBEY ROAD,gEORGE IS SO UNDER RATED,HE DOESNT GET AS MUCH CREDIT AS JOHN AND PAUL,THIS SONG IS JUST AS GOOD AS ''GLASS ONION'' OR PENNY LANE'',''STRAWBERRY FIELDS FOREVER'',''LUCY IN THE SKY WITH DIAMONDS'' OR EVEN ONE OF THE BEST ''HEY JUDE''!!!GEORGE HARRISON IS THE MAN-HE WROTE OTHER EXCELLANT SONGS THOUGH THIS ONE IS JUST WELL KNOWN,WHAT ABOUT ''WHILE MY GUITAR GENTLY WEEPS'',PIGGIES'',''THE OCTUPUS GARDEN'' OR ONE OF HIS LEAST KNOWN FROM THE EARLY DAYS\"I ONLY WANT TO DANCE WITH YOU''AS I SAID GEORGE HARRISON IS THE MAN-AND HE IS MOST CERTAINLY MISSED-R.I.P MUSICMANYOUR DEFINETLY LOVED!!! \t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nOH I FORGOT ''SOMETHING'',ALSO ANOTHER GREAT SONG,OH SO UNDER RATED!!!!!!!!!!!!!!!(DONT FORGET ABOUT RINGO,HE'S SO UNDER RATED ALSO,BUT THATS A WHOLE OTHER STORY\"LONELY HEARTS CLUB BAND...\"ONLY IF YOU WERE A TRUE BEATLES FAN WOULD YOU GET THAT!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nmetallicaman123,\n\r\nThere is NO Moog on \"I Feel Fine\". Firstly, the instrument wasn't even invented when the song was recorded and secondly the sound you're probably thinking of (at the song's beginning) is a bass guitar note doubled with string feedback from Lennon's Rickenbacker guitar. Sounds strange, but definitely NOT a Moog.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nBy the way, Octopus's Garden\" was written by Ringo, NOT George.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThis is probably my favourite song of all time. It's so optimistic but not overly so, just hopeful. The guitar intro sounds really ~ fragile, I guess, would be the right way to describe it; and the way George's voice has a narrow range makes it seem like he's trying to express more than he can ~ this song is so perfect. \t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nthe epitome of beatles songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nGeorge wrote this song about himself, and Here Comes the Sun is just how he interprets himself growing as a person- personally, spiritually, and musically.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nAnd in addition to it being about everday anew, I think it's also about there being a silver lining on every cloud, because each winter will lead to spring. \"the guitar intro sounds really ~ fragile\" -Allisonwonderland, that's exactly what I could never express\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI thought this song was written by George after he had become friends with Bob Dylan and it was about shooting up, could be wrong, but I think it's in the anthology book somewhere\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\ncan anyone tell me the story behind the abbey road cover? (isnt george supposed to be  christ like??, i dont know)anyway... in a book i have written by georgehe says it was written in eric clapton's garden when he was skipping work at apple.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\ni heard somewhere that in this song george is talkin abt their first paycheck and how good it felt to be earnin  their own money. \n\r\nanyway, i gotta disagree with metallicman123 abt ringo. i don't think he's underestimated. he's said to be the beatles' most brilliant mediocrity. he's a good drummer but he doesn't even compare to the others' brilliance, i mean, the other three are complete geniuses. in fact, i think george is more underestimated than ringo.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\njust want to say i love the song. makes me smile and feel good.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nsame here, sirkindheart.  it's just a positive song, definitely my favorite george.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nthis must be meant sarcastic... that's too .... gaaaah .. you know?\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\ni never really appreciated this song until i was stoned. heh, it made me fall in love with the beatles all over again.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\ni know, like if u're all sad, then u just listen to it, and noone can be sad after hearing it...its just soo cheery and happy and perfect\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\n\"this must be meant sarcastic... that's too .... gaaaah .. you know? \" lol\n\r\nits entirely positive. This is good in 2 ways. firstly imagine having this playing at  a time when you've been through months, years, or even decades of misery and then the world gives you a break. secondly it drives u to make a difference in the world, to the loner in the corner, to the kids who are handicapped, to the poor and needy. you might not directly make a difference to people who need help, but how you treat people has a massive knock on effect, which tilts the balance of good in the world. just think, any system of governement could ensure the end to world poverty if people stopped being greedy\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI Love Here Comes The Sun Too  Its A Great Song To Sing To!\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nThis song makes me happy when I listen to it, especially EVERY Spring.  Its just coming out of the winter, which in my opinion is a great thing to celebrate.  \n\r\nThere is an awesome cover of it by Nina Simone.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nWell I love the Beatles, and this is one of their best songs. I like how they say the Ice is slowly melting, I hate winter so it's like spring is here at last!\r\nIt's a good upper song, it's a good one to listen to when your coming down off of something.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\ni like it i love to play it on my guitar and i agrea its about his hardships and a \"new day\" because he wrote this song after leaving india where he gained a deep love for hinduism and krishna and hinduism has a lot to do with detatchment as does the song\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nThis is one of those songs where you can actually say it makes you feel \"all warm and fuzzy\" inside. It's very optimistic and makes me smile.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nIts a hippy song. Happy and smiling types.. optimistic and NOT philosophical. Its a Sunday-afternoon-post-lunch-stoned-15-minutes-nap song for me. George I miss you man. I dont think George is underated. To me he is the best musician and human being ever existed on this planet. A poet who was always musically and politically correct.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nGeorge had just got into hinduism and this song is about his enlightenment. And its just a cheery song about the sun and how a it brightens up so many ppls lives.\r\nthe greatest song any religion can take credit for helping create.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nOkay I didn't look at any of the other comments so sorry if someone else said this but at the end it goes\r\nHere comes the sun, here comes the sun,\r\nAnd I say itâ\u0080\u0099s all right.\r\nTHEN there's the part where they repeat it\r\nHere comes the sun, here comes the sun,\r\nItâ\u0080\u0099s all right, itâ\u0080\u0099s all right\r\nSorry, I know I'm being really picky but still!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nWow. That's just it. Wow. This song is just amazing. It makes you feel like everything's gonna be alright because one day that sun (whether it's a person, God, or some event) will come on out and take away all of your sorrows. I simply love this song. George rocks. He's definitely my favorite and I wish that he was still here... :'(\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThis another song that was supposed to be a \"Paul is dead\" clue.  It's about the morning after Paul had his car crash (a very rainy night, you can hear the \"storm\" at the end of She's So Heavy), and about the band members moving on and finding Paul's \"replacement\".  Well... that's what I have always heard... LOL\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nApparently George wrote it when he wasn't enjoying recording, and it's about when he left the studio ready to go home.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nProbably one of my favourite Beatle songs. I'm not to sure why but somehow the whole song is just so... uplifting. At one point I'd listen to it constantly. Now I'm listening to it again many months later. Very nice :)\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nif you like anime director Hayao Miyazaki, check out the Here Comes the Sun AMV.  it is awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nTo me this song means a lot , it gives you a warmth feeling inside and  that it makes you feel good. But when i listen to this song it just makes my day better.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nThis song is like comfort food to me!\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nHere Comes The Son (of God)\r\nEverything's all right.\n\r\nOk, I know that's not the real meaning of it, but it's an interesting way to interpret it...any comments?\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI love This song so much absolutely Beautiful\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nThis is it dudes - life in a nutshell\n\r\nIf you disagree with this - take a course in Nihilism\n\r\nOtherwise, you are on to IT\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\n\"here comes the sun\",in my opnion this is history about the girl that live in the wold sad,maybe she was seach the sun for find the hapiness,for not feel bad and always experiment accept the good thinks that your life.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nthis song is about coming through the fog of an addiction, sickness or it could be also about the dawning of a new day\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nOne of the great things about this extremly charming song is that any interpretation works, but my look on this song means something big. When a sun rises shows that its the dawn of a new day, throughout the song it is referenced that \"it feels like years since its been here\". My imperpretation of the \"long cold lonely winter\" was war, or something tragic that happened. The war/tragic event has passed and therefor the sun has risen.\n\n\"The smiles are returning to the faces\" is showing that people are recovering from the tragedy and it has been a while since it was that way. \"The ice is slowly melting\" shows the bitterness of war (winter) causes people to be close minded and predujice towards one another, but the \"ice is slowly melting\" and now its a lot more open and free.\n\nThis is an absolute amazing song and its bound to put a smile on someone's face, I love the beatles and see them as one of the big pioneers of music.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nGeorge may have been familiar with the writing 's of Samual Birley Rowbotham. ..Earth not a Globe.   Geo. personifies the sun...calling it Little Darling. IT's alright may refer to the book....\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nThe cultivation of maraijuna is the message here. I was listening to the song one day when high and realized this. The Phrase's \"here comes the sun\" .\"Smiles return to the faces\" It seems like years since its been here\". Put them together and see what  I mean.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nstupidity amazez me IT IS ABOUT GETTING HIGH !!!!!!!!! yall are donkey butts seriously tht or cumn of a hangover wow the beatles songs are bout sex and drugs bt if u dnt no tht they make a great kids cd \t\t\t\t\n\t\t\t\t\n\n"}