{"comment_0": "\nI think this song is far more personal to James than being about soldiers off to war but everyone is entitled to their interpretation. It has a great dream like quality, rich in symbolism. Ultimately it is about James' feelings toward his mother. Remember that he starts the song addressing his mother. \n\r\nThere is a tradition where a lighted candle is lit and left in the window to help travellers find their way back home. In this song it sets a metaphor of the home being the family and the love that holds the family together. That love keeps a person returning to their family, their mother, throughout the journey of life. The travelers represent the author who like all children sets out on the journey of life looking to be cared for. A hero is someone who saves you, protects you and cares for you. This also the role of a mother. The Hero of the Day that he seeks is his mother.\n\r\nBut in this case something is wrong because the window itself is lit on fire suggesting that the person at home is over zealous in their desire for the travellers to return. Their love could actually destroy the home. The idea of being overwhelmed by his mother's love is common in James lyrics, like the Apron strings around his neck in Mama Said or the fury he feels in Dyer's Eve. And just as in Dyer's Eve he feels unprepared to face the world due to being sheltered from it by his mother, James expresses that same fear and anger toward his mother because now that he is on this journey and she is gone he feels vulnerable to the world and worries that he may fall by someone's wicked ways. He wonders if his mother can hear her baby crying, does she know the pain he feels? All he can hear is her sighing. Now that she is dead all that remains is the whispers of her voice in her mind.\n\r\nAs the song progresses you feel that transition from the soothing mellow intro that is like being cradled by his mother's love to that furious anger expressed as the music breaks into the verse about the dreams and the waking screams which is him living through the pain and anger he feels toward a mother he can no longer reconcile with. And then of course the song ends with the repetition of the whole point of the song,  that the world is trying to break him and his need to feel her love again. Always James wants love but is afraid of it because love is control to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ngreat song by a great band. METALLICA FUCKING ROCKS\n\n\n", "comment_2": "\nYeah I agree that it's definitely about war...\n\r\n'These things return to me that still seem real\r\nNow, deservingly, this easy chair\r\nBut the rocking stopped by wheels of despair'\n\r\nMaybe talking about flashbacks but now he's safe..\n\r\n'Don't want your aid\r\nBut the fist I make\r\nFor years can't hold or feel'\n\r\nHe doesn't want anyone's help..\n\r\nBut now the dreams and waking screams\r\nThat ever last the night\n\r\nAgain,flashbacks..\n\r\n'So can you hear your babies crying now?'\n\r\nIn agreence that this could be vietnam reference as when the war was on Johnson was preoccupied with it and ignored problems at home in America...\n\r\nmeh\n\n\n", "comment_3": "\nFirst, this is a fantastic song because it can mean so many different things to so many different people.  That said, let me give what it means to me.\n\r\nThe first part of the song is a reference to soldiers going off to war and how there thoughts are always on home.  The line \"if they should fall by someone's wicked way\" is about falling in battle.\n\r\nThe second part is about how so many soldiers continue to fight the war after they come home. \"no, I'm not all me\" is about how a soldier is forever changed into a different person by war, while \"things return to me that still seem real\" is a clear reference to PTSD, along with \"but now the dreams and waking screams that ever last the night\".  \n\r\nI think the song refers to how a soldier going off to war is \"the hero of the day\" and then how different it is when they come home.  Even things like \"don't want your aid\", clearly about how a lot of soldiers try to deal with PTSD themselves instead of seeking help.\r\nJust my 2 cents worth.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nit's pretty vague lyrically, as it seems to almost be talking about different things. what i feel he is saying is similar to mo0stah, but it involves looking up to someone who is not quite the hero of the day you thought they were.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nHero of the Day Interpretation: Personal victory is within our reach. Each person in this war is fighting not to win, but to find their honor.  \r\nWhat if someone fighting, dies in vein? \r\nThe fight is so long and hard, it's easy to become discouraged.  Keepers of these inner flames that thirst for honor, can you acknowledge\r\nthe ones who care about you, praying for your safe return from your journey?  Your loved ones want you with them, not your dream of\r\npersonal conquest.  Will the enemy break my will?  They haven't relented.  Now this fight seems so vein, remembering the reason I was brought here.\r\nIt seems I can relax now, I've remembered the reason for the fight, I shall deservingly sit on the chair of righteousness.  But it's too late, I can't return\r\nback to the way things were because I now live in shame for my vanity.  I've made these mistakes, and now I have to reconcile them without confiding\r\nin the ones I've loved, I have to do it myself(or with God).  I've become a hardened person fighting this war. I've lost the ability to feel.\r\nPlease excuse me while I fight my inner demons so that I can save myself from making anyone else a hardened person.  So I seek emotional shelter while\r\nI recover from the trauma of fighting, until I've cleansed myself of the demons(little metal things coming out of the kid's ear, unconsciousness is the \r\nwall in this case).  The war in my mind continues, I have to fight these demons before it's too late and I can never feel emotion again.  Mama, they try \r\nand break me while I cleanse myself of these inner demons.  They try, but I will put up my best fight.  Even if I fail, at least I've tried.  The metal\r\ndemons are expunged from the kid's mind, the inner battle will eventually die down and peace will be restored.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song is about love, a broken heart, returning home with battle scars of a woman who is now looking for a new hero of the day.\n\nTheyâ\u0080\u0099re off to find the hero of the day\nBut what if they should fall by someoneâ\u0080\u0099s wicked way?\n\nMama, can't you hear your baby crying?\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nLost in the world with only one person to look to. This sentence basically sums everything up for me. Both released versions of this song are awesome, but I like to think the S&M version is better due to the deeper, melancholy sounds to it. To me, the one person I can look to to understand my feelings and thoughts is myself, so naturally, I find this song to be of great intriguing value to myself.\r\nListen and Feel.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ncould this be a reference to the vietnam war? i recall, vaguely, reading that Hetfeild's brother was a protester back in the day. one might certainly read that way, and it just seems there's that consistent theme there, of someone gone that's not coming home.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nIt's about people who like to worship the people in the media and all, when the people you really should be is who you meet in everyday life.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI agree King Nothing\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI agree with shoelessz because if you think about it, it does sound like somebody thats gone off to war.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n\"Hero of the day\" I thought was referring to the passing trends in society.  How often is someone a hero one minute then their 15 minutes of fame is up and they swiftly leave the spotlight.  People are looking for different heroes to fit differing occasions.  Once we are done with our heroes we toss them aside and let the next hero take center stage.  Like King Nothing said, it could be applied to people in the media spotlight.  One minute they're on top, and the next everybody forgot about them.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni think the song is about people not knowing who to look up to so they find somebody to look up to from day  to day\n\n\n", "comment_14": "\nthe song is fuckin awsome\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI really am not sure bout the meanin but wen he sings it, it coms from the heart this is a gr8 song I love it. I must admit it was quite awful on the load album but on the S&M album it's sounds sooooooooo good. Metallica RULEZ\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI definately agree that the S&M version of this song was the best.. It was very deep. I think that Hetfeild wrote this song knowing that it could mean something different for everyone. For me, this song is about people looking for hero's in society, like finding that one person to look up to, but this song depicts the way a person would feel when they find out their hero is a fake.. I think it is a very meaningful song..\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nive mostly read that the song is about people lookin to tv stars as heros, but i think of the song as a tribute to war veterans who risk their lives for other people but wind up in the hands of the enemy and nobody else will do the same for them\" But what if they should fall by someone's wicked way\" \n\n\n\n", "comment_18": "\n       I think that this whole song is written to someone's mother (hence) \"Mama they try and break me\" I think that the \"they\" in this instince is people who are the enemy's at war.\r\n       \"The window burns to light the way back home\" I think this means that the this means that the only way out (window) is through flames that light the path home.\r\n       \"A light that warms no matter where they've gone\" I think this means that no matter where people are, these 'flames' that light the path back home, always make u feel warm and fuzzy inside.\r\n       \"They're off to find the hero of the day\" This is obviously the most important part of the song bc of the tittle, which is why i think that this song has everything to do with war. \"But what if they should fall by someone's wicked way\" meaning (in my opinion) what if these people searching to become a hero were defeated?\r\n       \"Still the window burns, Time so slowly turns\" I think this means that time goes by so slow at war, especially when u think about the way home.\r\n       \"Someone there is sighing, Keepers of the flames\" I think that \"there\" is refering at home someone is sighing (waiting), the keepers of the flames (the way back home) \r\n       \"Do ya feel your name? Can't you hear your babies crying?\" I think this is directed back at the mother again.. i think its saying that, \"do u feel ur name\" - the last name is what i assume, meaning, can u feel that u are part of this too, can u feel ur babies crying, - i think this emans can u feel their pain\r\n       \"Mama they try and break me, Still they try and break me\" - i think this is refering to the struggle between  the enemy and the writer, jus saying to his mother how much pain it is\r\n       \"'Scuze me while I tend to how I feel, These things return to me that still seem real\" - i think this means that this whole song is a type of flashback to when he(no im not sexist, but it most likely was a he) was at war, and hes tlakin to his mother about the pain and fear\r\n       \"Now deservingly this easy chair, But the rocking stopped by wheels of despair\" - i think \"he\" is saying that he deserves the chair bc he went through so much, but he stops wiht dispair as he remeneses about something terrible.\r\n       \"Don't want your aid\" - hes trying to say hes doesnt need help now \r\n       \"But the fist I've made, For years can't hold or feel\" - hes trying to tell his mother that hes a harder person (no feelings) bc of his experience \r\n       \"No, I'm not all me\"- hes implying that this has changed him,a dn hes not who he used to be \r\n       \"So please excuse me, While I tend to how I feel\"- its a given \r\n       \"But now the dreams and waking dreams, That ever last the night\"- i think this is saying that there is another war soon, (the dreams are waking), and there will always be war, (everlasting night)\r\n       \"So build the wall, behind it crawl, And hide until it's light\" - i think hes saying to his mother that for her own protection, to not be like him, she should hide form the society and war\r\n       \"So can you hear your babies cryin' now?\"- again the war is going on, can u hear the \"children\" (what he used to be) being sent to war \r\n       \"Mama they try and break me\"- i think this is the last flashback that says that the enemys always try to break eachother\r\nWell, this is all jus my thoughts, and what i think the song means... its a great song no matter how u interpret it :)\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\ndamn, that last comment was long. oh well, i think this a really awesome song. \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nking nothing is hella right, but to add, i think it also that they worship you, untill you turn bad, then they break you, rip you apart, and leave you for some hungry rabbits, we have all seen it, they love you then they leave you\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nSounds to me like someone's flashbacks about experience in war or other conflict and his musings on the fact that the people who start these fights are always looking for someone to fight for them (\"off to find the hero of the day\") and how they don't really care what happens to these heroes as long as they \"win.\"  It seems to be about the nightmarish nature of war and conflict, contrasted with home and family, and hope kept alive by the latter (\"a light that warms no matter where they go\").  \"Can't you hear your babies crying?\" refers to the way soldiers or others off fighting and trying to win various conflicts have left their homes and families, literally or figuratively, behind, and, I think, more broadly, to the way that domestic issues like poverty and homelessness are often ignored in favor of more defense spending.  \"War sucks.  Let's go home\" might be a good way to sum it up.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI agree with an ealier statement - it's just a song that can have so many different meanings. The song itself is so deep and beautiful. The guitar riffs and melodies go straight to the soul, and Hetfield's voice is almost haunting.\r\nBut i kinda dissagree about S&M though... I thought every other song from the concert was better than the studio-version, except for this song. It kinda felt out of place. Don't get me wrong, HotD is one of my all time faourite songs, but I don't think the S&M version was as good as the Studio version.\r\nWasting My Hate would have been a better song to put in S&M, rather than this one, I feel. But please, no arguments. It's just my opinion, please respect it.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis is the kind of Metallica that I like. The song is good lyrically and instrumentally, nice combination of hard and soft. James' vocals, I think, are excellent at the end. My personal interpretation of it was how we treat actual Heroes, they are just someone to look up to for a day. The people who get spotlight are those that do so little for society.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ni completely agree with wolsey.  this song is definately about the narrator reliving something bad that has happened in the past and he is turning to his mother.... if you really wanted to get out there with this whole thing one could say the \"hero of the day\" is his mother and that this song is and ode to her\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song evokes for me a strong feeling of being haunted. \"The wheels of despair,\" \"time so slowly turns,\" the obvious pain/emotion/frustration in James's voice; these all along with the music perfectly create the sense of something being unresolved. Whether flashbacks of war, addiction, depression, or memories of the past, this song is trying to exorcise some kind of demon.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nMaybe it's just me but I think this song is about someone's search for a hero.  I think it's about someone searching for their hero and along the way they're being let down and disappointed because they can't find the hero they are looking for and they never realize the the \"heroes\" they need are the one's that are around them....not some anonymous strangers.  They're friends, family, etc....  I think the keepers of the flames are the one's left behind while this person is searching.  But the song goes on the explain that \"still the window burns, time so slowly turns...someone there is sighing\".  I think this pretty much sums the songe up for me in that...your loved one's are the real heroes because they wait on you....they have the light that will lead you back home if you'll only realize it and follow it.  In other words instead of searching for heroes take inventory on the heroes around you instead of taking them for granted.  That's what I think guys...fell free to tear this one to pieces.....\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI love the bass line that jason keeps going throughout this song...amazing stuff.Absolutley beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nOh my god,this is one of the best songs ever written.Holy shit,It will live forever,it is beyond words,that a sound so amazing could be made,the uplifting mastery this song displays,the lyrical emotion.This song is the ultimate.Load and reload are the best things Metallica have ever made.Beyond words.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nFor everyone who think this song is about following a certain hero and such, read one verse from Papa Roach \"fuck a hore, be yourself\" - I think that would be the solution to that problem - follow nobody! (and yes, Metallica still rocks...)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\njust wanted to make a quick correction:\r\nwhere he put \"But now the dreams and waking dreams \r\nThat ever last the night\"\n\r\nit's really\r\n\"But now the dreams and waking screams\r\nThat ever last the night\"\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI think this song is about someone that was broke by the world and desperatly serches for a hero to look up to.  Just read the lyrics with this in mind or watch the video and you might see what I mean.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nin simple words this is a song about the war. like when jhonny comes marching home again... or one du-du-du-du-du-du-dun!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nmost definately one of my top 5 metallica songs.. the sounds put me into a harmonic state.. Ill put this on when im in a mood for reflecting\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI was about 16 when i first heard the S&M version of this song. It has been my favourite song ever since. And Metallica only rank at #3 on my fave bands list behind Pearl Jam and Audioslave. But easily and forever I love this song, the S&M version. I have cried lilstening to it. The emotion is phenominal. The sentiment is palbable. The utter melancholy is beyond beleif. The lyrics, even if it is a very personal interpretation, offer such inspiration. I actually have to ration out my listening of this song. If I listen to it once, I want to listen to it straight away again. I listen to it less than once a month. I only listen to it on full volume, with no possibilty of disturbance (I actually take the phone off the hook). The adrenaline flows through my veins, the hair on my neck and arms stand on end, and I cry. Tears of sheer joy that such a beautiful song exists. Four minutes and forty-four seconds of heaven.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nIf you watch the video, it's about a teenage kid who looks up to the members of metallica on the tv\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI think that this song is about the vietnamese war. naypalm (not sure about the spelling) and fire were used a lot in this war, there is a lot of references to burning in the song. Also, when burning is refered to it is in reference to windows busning. a window is something that you look through, suggesting that people cannot see what is happening and clarity of vision has been lost. Also, during and after the vietnam war there was controvasy over american troops in vietnam who were apparently killing every vietnamese person that crosses there path:\n\r\n'But now the dreams and waking dreams \r\nThat ever last the night \r\nSo build the wall, behind it crawl \r\nAnd hide until it's light \r\nSo can you hear your babies cryin' now?'\n\r\nHowever these lines suggest some sort of supressed civilisation: 'But the fist I've made For years can't hold or feel'. which doesnt quite fit in with this hypothesis.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\ni love this song!!! i listen to it all the time...i jsut got into Metallcia..i no i is late...but atleast im into them now!! they is wicked!!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI see the song metaphorically. the window stands for hope.... get the imagery of a watchtower \"light\" and warmth....to light the way back home. IM not sure what hes experiencing as u guys suggested could be a war...or something along the lines of evil, bad experiences comin back to him and he regresses to his mother... \"mama they try and break me\" gives imagery of a child lost and innocent asking for his mother. Whatever you can derive from this song it stands to say that hes fighting something and it will forever haunt him.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI would say that the war definition would be valid, but one thing that people don't appear to understand is the window part.  A lighted window has been a metaphor for welcoming for a very long time, and it is used in lots of different songs and types of music, like CCR \"put a candle in the window\", and countless songs talking about leaving a light on for people.  The window burns means that this person, be it a soldier, or just someone who is losing everything and wants to go home, wants to still be welcome back home.  People leave lights on when they know someone is going to be coming, like on halloween, when you're willing to have kids come and trick or treat your house, you put a jackolantern out, a light.  the idea is that if there is a light on, then the people are still thinking of you and expecting you to come back.  The next line, a flame that warms no matter where they've gone, is talking about the comfort given by knowing that light is on.  The candle in the window, although not giving any actual warmth to speak of, still comforts that person, and it doesn't matter how far away that candle is.  and the can you hear your babies' cryin line is asking if they can simpathize with him.  That's the main things that i wanted to point out.  the rest seems to be there pretty good.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nYour heros are the people or person that brings you up from a child,(maybe)look closer to home before looking out side,influences are great but the home fires always burn.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI'm pretty sure it's about war. More specifically the fact that when a lot of veterans return from war they find it hard if not impossible to return to a normal life - to put the things they've seen behind them.\n\r\n\"Now deservingly this easy chair\r\nBut the rocking stopped by wheels of despair\n\r\n...\n\r\nBut now the dreams and waking screams \r\nthat ever last the night \r\nSo build a wall behind it crawl \r\nAnd hide until it's light\"\n\n\r\nThe idea of keeping a candle or fire lit to guide soldiers home has also been around for a long time. This was a popular song during World War 1:\n\r\nKeep the home-fires burning,\r\nWhile your hearts are yearning,\r\nThough your lads are far away\r\nThey dream of home;\r\nThere's a silver lining\r\nThrough the dark cloud shining,\r\nTurn the dark cloud inside out,\r\nTill the boys come home.\n\n\r\nReminds me of another song:\n\n\r\nLight In The Window ~(Doro Pesch)\n\r\n...\n\r\nKeep a light on in the window\r\nSay a prayer for me my friend\r\nKeep a light on in the window\r\nDon't give up on me cause I'll be back again\n\r\n...\n\r\nKeep a light on in the window\r\nDon't give up on me cause you're the only one\r\nIt's hard to get back once you've been there\r\nOh heaven knows how hard I've tried\r\nIt's hard forgettin' what you witness\r\nOnce you've seen the other side\r\nSo hard to forget\r\nKeep a light on in the window\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI feel stupid. The first time I heard this song when he said Mama they try and break me, i thought he was saying mama they try and rape me. Wow,  Im such a dumbass\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI definately get the \"window burning\" metaphor described above.  I would like to add that for some reason I feel this song may be more about the \"heros\" everyday (such as police and firefighters).  I don't know why...but I just sense that its almost like it's about a cop getting killed and the \"sighing\" and \"babys crying\" refer more to the killer creating bad karma (like--you just shot a cop...you've just ruined your life...and karma will come back because your own child will need to protection of the very thing you just killed).  I know that's a long shot---but I just picture that \"story\" whenever I hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI love VVolsy's comment! Long but good! I completely agree with it all the way.\n\r\nPs. the video was awesome! Love Kirk as a boxer!\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nObviously Hetfield was being ultra-truthful about himself in this song. He speaks about issues from his past and how they effect him today. Every single person on this planet can relate to the lyrics in this song, they touch home so deeply and that is why this is Hetfields best written song.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nWell; if you ask me, which you haven't, I believe the song is about a parent or parents abandoning a child at some level. Whether its at birth or later in life, its about someone longing for the knowledge of that person that is lost to them. Be it an adopted child who doesn't know his roots, a teenager who can't possibly believe he is related to his parents, or an adult who feels disconnected. I think it woks on a lot of levels, but, to me, it speaks of abandonment.\r\n'Keepers of the flames\r\nDo ya feel your name?\r\nCan't you hear your babies crying?'\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nAs far as \"sell-out\" Metallica goes, I like this.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nthis song is obviously a tribute to parents, teachers, and other people in our daily lives that make a difference. this song is saying that the real heroes are these people becuz heroes that are artists athletes or actors go away when u turn off the TV or push stop on the cd player\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nyeah i always thought it was about war \r\nbut hearng your opinions about finding your own hero i can see that aswell!\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThis is one of the rare metallica songs I dont really like.. I dont actually like the whole album as much as earliers, but.. well, OK song.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis has to be one of the best Metallica Songs ever. The idea of people throwing themselves on a five minute hero is a deep concept. In society today we allow ourselves to praise someone for five minutes but the minute they screw up we say that they were always a peoblem. The song is definately about this topic. I agree with King Nothing.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThe S&M version of this song is one of my favorite songs. As for the meaning, I suppose I'd have to agree with King Nothing, though I like to have my own meanings for songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\ni think Wolsey's explanation is very convincing,  but i also agree with RIPDARREL.\n\r\nand MetallicaRockz93, mama they try to rape me....LOOOLL\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nWell, this is my favourite song of all time. It is so beautiful. I think it is about us looking for heros in the people we don't know, when we should look to those close to us and worship them. And I agree so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI love this song. It reminds me of the days my dad was with us. He loved me so much. He passed away on sunday.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nTaken from Encyclopedia Metallica: \n\r\n\"James wrote this song about somebodies who are looking for heroes in the media and that they are not realizing that those you should be \"worshiping\" are the people you come across in everyday life.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nDoubtlessly one of the most soothing song metallica ever made. I think Jaymz has done a massive job with the lyrics. To put forward such a point [for eg. breinholtz' excerpt from Encycmet.com] is putting forward a massive messege to everyone. This point can be further emphisized by simply looking at the line \"Mama they're trying to break me\" and the title \"Hero of the Day\". Normally, kids believe in superheros. You would expect a kid to call their superheroes to help them in trouble. But if a kid is hurt in anyway they dont call their superheroes. They call their mothers. This song kinda emphisizes on how Jaymz felt about his mother later in his life. The loss of his mother and the fact he never appriciated her love is portrayed in the song \"Mama Said\" in this album [Load].\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThis is one of my favorite songs ever.. it's probably the best they ever came out with after master.. or justice.. or black, whichever you prefer.. I just know it's the best thing on load and their hasn't been anything as good since but that's just me, heh.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nthis song means soooo fucking much to me...i have to cry and i have goosebumps everytime i'm listening to it. it's just so amazing how james hetfield is singing  it! (especially on s&m!!)\r\nI just can tell you that i fucking love it so damn much!!\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nWar Turns Man Into Beast.... Read The Book \"My Brother Sam Is Dead\" And You'll Understand What It Means.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nJames wrote this song about somebodies who are looking for heroes in the media and that they are not realizing that those you should be \"worshiping\" are the people you come across in everyday life.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\ni love this song. metallica rock. rock rock rock 4eva\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI could sum this song up in three words: war is hell\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nthis is one of my favorite songs off load and reload\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI personally like to think this song is about how the general public is always trying to find someone to fix their problems, and the person in this song talking to his mother and just generally saying that they (the public, media, whatever) is trying to break him into relying on others as well.\n\r\nWhen he talks about the dreams, I think he means that's all their heroes are, dreams. And because they're just dreams and they will never find someone to take their problems away for them that they should just build a wall and hide away from their problems instead of facing them.\n\r\nThe guy in the song on the other hand is talking about tending to his own issues, taking care of his problems. He asks the general public if they can hear their babies cryin', which I think basicly means he's wondering if they had snapped out of their dream and realised they have to face their problems on their own.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nHas anyone seen the video to it? I don't really understand it. :S to sum it up, a person, who looks like an emo, gets up, watches tv, eats toast (lol), gets changed, has sex with some girl (or something along those lines. :P),  takes some pills, falls asleep, wakes up, pukes in the toilet, sleeps again.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nthis song is so deep i dont think i can really find a definet meaning\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nthis is my favorite Metallica song!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nThis song is about warfare, and the effects it has on its victims, the soldiers. It's about searching for a \"hero\" among thousands of soldiers who can put an end to the war easily. A \"hero\" who will fight the war effort and never be recognized for it, because he dies in the war/is paralyzed for life.\n\r\n\"The window burns to light the way back home.. Time so slowly turns\"\"\n\r\n(symbolizes soldiers' desire to return home, and how it seems like so far in the future. Also time goes by so slowly when at war.) \n\r\n\"These things return to me that still seem real\"\r\nReferring to shell shock (soldiers experiencing flashbacks about the war), which was caused mostly by the Vietnam and gulf wars; \n\r\n\"Now, deservingly, this easy chair\r\nBut the rocking stopped by wheels of despair\"\r\nAn old man's rocking chair replaced by a wheel chair (wheels of despair), a result of physical paralysis caused by injury in the war.\n\r\n\"Keepers of the flames\r\nDid you hear your names?\"\r\n(The countless, nameless soldiers who do not receive recognition for their efforts in the war.)\n\r\n\"But now the dreams and waking screams\r\nThat ever last the night\"\r\n(Referring to the dreams of returning home, juxtaposed with the waking screams of death at war, and the seemingly everlasting night caused by the war.)\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nYou could also look at this song in a different respect. It could also be symbolic of society's need to find a \"hero of the day\" in the mass media, when they are really ignoring the people of everyday life.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\njust a question... why is that if the song's meaning is about war... then how come the music video is not about (any) war? ??? the video shows a boy having a time of his life with his girl... hope anybody can clear this up...\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nThis a killer song , these lyrics are easy to understand when you read them.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nThis song is about children and their parents. Listen to the lyrics carefully. Its about children growing up in the world but always needing a place to come back to... their parents.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nTo all of you who think this is one of Metallica's best songs: It's not.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nFRYEGUY you are entitled to your own opinion. Just don't try to tell people what they think is wrong... I bet all you listen to is albums before the Black Album... very open minded thinker I can tell...\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nMetallica may be the best band ever, but this song sucks. \n\r\nReLoad > Load     ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nNah, DARKPILATUS, Metallica were great in the 90's! I just don't see what's so special about this song.\n\r\n1-puppets\r\n2-lightning/black\r\n4-killemall\r\n5-justice\r\n6-reload\r\n7-load\r\n8-anger\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nUrine. And rabbits.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nWhen I first heard this song, it reminded me of the movie Seven Years in Tibet.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nFrom what I understand and I am fairly sure this is the correct meaning but I might have forgot how it was worded correctly.  The song is about young adults or teens that have moved out or away from home an are struggling but still liveing there life in some manner.  \n\r\nNow there parents or parent/guardian has kind of turned there back on this child when they still need help in this harsh world.  You can see how the young man in the music video is living he does not have all that much stuff and everything is a mess but he makes it all work.  To get though his life this person needs to find the \"Hero of the day\" let it be a friend who lends him $20 or a girlfriend to drain some of his sorrows , or anything that helps out.   So the person is out to find the hero to get him though that day. And the next day it might be someone different.  There you have it I believe this is the correct meaning but I am not 100% sure.     I know it has nothing to do with war , ect.  It is for sure about a teen or young adult and some form of parent neglect if you watch the video and read my comment you might see where I am coming from.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nI've heard this sing is about people who are looking for heroes in the media, when the people you should admire are those who you come across in everyday life. When listening to this song I initially thought it was about person(s) who are simply ordinary human beings doing extraordinary things, hence the title of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\ni dont know why...but i think its another anti war song much like One...it really sounds like its about the mixed feelings about the vietnam war.\n\r\n\"The window burns to light the way back home\r\nA light that warms no matter where they've gone\r\nThey're off to find the hero of the day\r\nBut what if they should fall by someone's wicked way?\"\r\n-the families saying that they support the troops and are waiting for them at home\n\r\n\"But now the dreams and waking screams\r\nThat ever last the night\r\nSo build the wall, behind it crawl\r\nAnd hide until it's light\"\r\n-the fear that he feels every night\n\r\n\"So can you hear your babies crying now?\"\r\n-the anti war protesters trying to guilt the troops home\n\r\n\"Excuse me while I tend to how I feel\r\nThese things return to me that still seem real\r\nNow, deservingly, this easy chair\r\nBut the rocking stopped by wheels of despair\"\r\n-the veteran after the war coping with the memories and flashbacks\n\r\nthis is just what i think...but knowing metallica it wouldnt be much of a stretch\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nFuel album is their album which shows their real style in music which is trash but after this album they became sucks and has no direction on their music especially St.Anger, i hope there new album ( if they have ) is just like there past album !\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nThis song does Not mean what everyone keeps saying ( That its looking for a hero in the media when in reality the real heros are right in front of you )\n\r\nThere is no evidence in the lyrics to back up this meaning, i really feel like that was just a direction they took with the music video , but the song has a much more deeper meaning\n\r\nthe message i get from this song is a little boy scared and lone looking at the world around him searching for a savior to solve their problems , to protect them , and to guide them, i see the little boy growing up in that search and falling into its desire , and wishing so deeply that this man ( or woman) would come and silence the problems of the world....Lastly i see that little boy grown up and no longer waiting for that savior to save him , hes become stronger and wiser and seeks to become that very same hero that the people have been waiting for , so the boy seeking a savior becomes the hero of the day; a short lived hero that seeks to bring peace over a snippet of time.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nI think that this song is about the anxiety a parent feels when their child strikes out on their own for the first time.\n\r\n\"The window burns to light the way back home\r\nA light that warms no matter where they've gone\r\nThey're off to find the hero of the day\"\n\r\nParents always \"leave the light on\" for their children when they leave. Their children set off to obsess about people in the media, or to try and impress their new boss or professors at school.\n\r\n\"But what if they should fall by someone's wicked way?\"\n\r\nParents worry that their children will encounter evil and twisted people that will pervert their child's views.\n\r\n\"Still the window burns\r\nTime so slowly turns\r\nSomeone there is sighing\r\nKeepers of the flames\r\nDo you feel your name?\r\nDid you hear your babies crying?\"\n\r\nThe parent's sit at home wondering what has become of their child, perhaps the last line means that the kid has gotten into a jam that the parent can't get them out of. All the parent can do is watch and hope they taught their child right.\n\r\n\"Excuse me while I tend to how I feel\r\nThese things return to me that still seem real\r\nNow, deservingly, this easy chair\r\nBut the rocking stopped by wheels of despair\"\n\r\nOnce again, the parent can't do anything but sit in their chair and wonder what has become of their child, not knowing exactly how they feel about the whole situation.\n\r\n\"But now the dreams and waking screams\r\nThat ever last the night\r\nSo build a wall, behind it crawl\r\nAnd hide until it's light\r\nSo can't you hear your babies crying now?\"\n\r\nAcceptance, the parent realizes that they need to build up their defenses and hope for the best. Everything will turn out all right in the end, even though it looks bleak at the moment.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI think it's the opposite to Mama Said.  Mama Said is learning how to stand on your own two feet, but Hero of the Day is about you can't drop your birds out of the nest and not pick them up-basically, you can't just abandon your kids.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nthis is probably wrong, but i see this as a song about looking for someone to soothe you as the world around you crumbles\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nYeah I agree that it's definitely about war...\n\r\n'These things return to me that still seem real\r\nNow, deservingly, this easy chair\r\nBut the rocking stopped by wheels of despair'\n\r\nMaybe talking about flashbacks but now he's safe..\n\r\n'Don't want your aid\r\nBut the fist I make\r\nFor years can't hold or feel'\n\r\nHe doesn't want anyone's help..\n\r\nBut now the dreams and waking screams\r\nThat ever last the night\n\r\nAgain,flashbacks..\n\r\n'So can you hear your babies crying now?'\n\r\nIn agreence that this could be vietnam reference as when the war was on Johnson was preoccupied with it and ignored problems at home in America...\n\r\nmeh\n\n\n", "comment_89": "\nthis is a beautiful song by metallica, and i got tears in my eyes when i found out what this song means.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nLol, I loved reading all these.  Over the past 8 years there have been almost 90 responses and they all basically take one of three interpretations, the anti-war, the child finding his own way and the hero in the media versions.  What gets me is that all three of the positions are defended with the same quotes, just from a different perspectve, so who is really right?  While I have my own feelings on the meaning of the song, I also like to think that everyone is right, because the song never comes out and directly says anything, which is the beauty of a well written song, or even music in general.  It is completely open to interpretation and the desiding factor in what a song means is someones own personal experiences or opinions, even if that differs from what the song means to the band.  I read in some of the early responses that James' brother was a protester of the Veitnam war, so that might be a scourse of inspiration for the song, but the music video obviousely has the theme of short lived heros in the media, so even the guys that wrote the song have at least two interpretations of the song and I have a hard time imagining that one person is right or wrong with one interpretation when the masterminds are split in opinion, both of which are different from my personal feelings on the song.  Regardless of what your views are regarding the songs meaning, I think that one thing we all can agree on is that songs like this one are the reason that we all love music enough to write blogs on individual songs and their meanings, so keep doing what y'all are doing and never stop loving it\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nThis song is obviously about war, the Vietnam war maybe, the soldier is writing home, ie mamma they try and break me, his mother leaves a candle on the window to light the way back home safely.  Each new patrol brings a new hero of the day lest he fall by someones wicked way 'the enemy'.  excuse me while I tender how i feel, things return to me that still seem real, ie 'post traumatic stress syndrome', flashbacks.  'Now deservingly this easy chair, the rocking stopped by wheels of despair', he is in a wheelchair from the wounds of war.  'Another dream and waking screams' more flashbacks, 'so build a wall behind they crawl and hide until its light'.  \r\nThe entire song is filled with references to war and its consequences, hard to believe that it's not so obvious....\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nThis song is about war; they way war separates families, leaves the warriors with post traumatic stress and yet still somehow strengthen our familial bonds.\n\r\n>The window burns to light the way back home\r\n>A light that warms no matter where they've gone\n\r\nThis opening rhyme lets us know that there is a light in the window, more specifically, fire light. Candles placed in the window during the holidays represent love ones off at war. It is a light that burns to light the way back home. \n\r\n>They're off to find the hero of the day\r\n>But what if they should fall by someone's wicked way?\n\r\nIn wars fought by American soldiers it is a rule that you never leave a soldier behind, not even if he has died. This is to keep morale up. The enemy could parade a dead body around or even torture a person to gain intel. Often these rescue missions are very very dangerous and involve returning to hostile territory. \n\n\r\n>Still the window burns\r\n>Time so slowly turns\r\n>Someone there is sighing\r\n>Keepers of the flames\r\n>Do you feel your name?\r\n>Did you hear your babies crying?\n\r\nthese two rhyming triplets show us the person or family at home, still tending to the candle in the window, anxiously awaiting the return of their loved ones. The possibility of their death is disconcerting but the family at home is very powerless in this situation. All they can do is sigh.  \r\nThe last two lines tie into the practice of torturing POW's; a practice very prevalent during Vietnam. Tortured people commonly call to their loved ones in pain and anguish. \n\r\n>Mama, they try and break me\r\n>Still, they try and break me\n\r\nThe purpose of torture is often to \"break\" a persons will and make them disclose information. \n\r\n>Excuse me while I tend to how I feel\r\n>These things return to me that still seem real\n\r\nPost traumatic stress is a disorder caused by traumatic experiences. Rape victims often suffer from it, and tend to seize up or have dreams and intrusive memories of this trauma. The same goes for people who survived wars. \n\r\n>Now, deserving, this easy chair\r\n>But the rocking stopped by wheels of despair\n\r\nVeterans deserve respect and comfort in their civilian life.\n\r\n>Don't want your aid\r\n>But the fist I make\r\n>For years can't hold or feel\r\n>No, I'm not all me\r\n>So please excuse me while I tend to how I feel\n\r\nVeterans can also feel a strong sense of independence due to their experiences and may feel ashamed of receiving help.   The trauma of war often leaves them a different person. \n\r\n>But now the dreams and waking screams\r\n>That ever last the night\n\r\nThe nightmares and post traumatic stress is brought up again\n\r\n>So build the wall, behind it crawl\r\n>And hide until it's light\r\n>So can you hear your babies crying now?\n\r\nThe war veteran can not explain the things that has happened to him; the things he has seen or the manner he has been changed, to some one that has not experienced it first hand. They often retreat and hide their emotions instead of expressing them. \n\n\n\r\nOverall this song is about the Vietnam war, a POW who was tortured and the strain it has put on his emotional and mental well being as well as the health of his family he returned to. \n\n\n", "comment_93": "\nI think Bones76 is the MOST correct interpretation. \n\r\nIt's definitely about a parent who's naive and stubborn child (who is actually a young adult) refuses the good advice he/she keeps giving; even though the kid complains the whole time about how hard life is:\n\r\n\"Don't want your aid/But the fist I make/For years can't hold or feel\"\n\r\nAt 30 years old, there's definitely a few bad decisions i could have avoided if only i listened. Like, never get a tattoo of David Lee Roth no matter how badass it looks! (j/k) Another line that makes me sure that that is what the song is about is the line:\n\r\n\"No, I'm not all me! So please excuse me while I tend to how I feel\" \n\r\nIt's a kid snapping at his parent cuz he doesn't have the patience to listen to advice. The kid doesn't have patience, cuz the kid is too distracted with his/her drama. \n\r\nI love you, mama :)\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nIt sounds like the life of someone who bullied all through growing up and their mother ignores them, and is so angry that they forget what is right and wrong and which path they truly want to go in. \n\n\n", "comment_95": "\nYou people are getting to deep into it, its about a guy on drugs, his friends are trying to help him get off but he doesnt care about his \"Hero Of The Day\" hence he says 'Now excuse me while I tend to how I feel\" & \"Dont Want Your Aid\". \"Mamma they try & break me\" well thats obvious, he talking about every1 trying to get him off the drugs & hes pleading to her to make them stop.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nI believe this song is about looking up too someone your whole life... but when you need them the most there not there for you. \t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nIf anyone has had to deal with PTSD (or anyone with PTSD for that fact) the song kinda brings on a new meaning.  Hetfield is famous for referencing the Vietnam War.  But I'll tell you the song speaks to several of us...we used to listen to Hero of the Day as our pre-mission song.  My reasoning:\n\r\n(Mama, they try and break me)\r\n(Still, they try and break me) - Both are about combat and the stress of never quite letting go of it.\n\r\nExcuse me while I tend to how I feel  -  Drinking to remember or forget what has been done in conflict.\r\nThese things return to me that still seem real  -  PTSD symptoms...can't let go.\r\nNow, deservingly, this easy chair  -  You've made it home and think things will be better now.\r\nBut the rocking stopped by wheels of despair  -  Sorrow for what was done in wartime.\n\r\nI know this was long, but this song speaks volumes anyone who's been in combat.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nThis Song is talking About how Teens call one person hero for a short while and then in a year or so almost completely forget about it and hence the name hero of the day\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nBeing a fan of Metallica's since the early days-I think this is my favorite of all...\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nThis is about a parent addicted to drugs who leaves their family and is consumed by guilt.  they hears their kids crying for their parent and do more and more drugs to cope.\n\r\nBut even after all that they have done, their family is waiting for them to return.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nI agree to those who said this is about children and their parents.\n\r\nIts about a mother who gives permission to her son to go out facing the world, to be a man. At the same time, she worried that her son cannot cope with the problems that he will encounter during the process. so, she will always be waiting for him to come back to her arms in case he failed. \n\r\nits a mothers instinct to know when their children are in problem. even from far away. (Did you hear your babies crying? 'Mama, they try and break me')\n\r\nToday is the day my mother passed away a year ago, due to breast cancer. during her life, she has been supportive to me to her last day. I have been listening to this song nonstop. I love you, mom. May you rest in peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nThe song is about kids who start to break out into the world and try to make it on their own. They start to idolize money and personal effects and find that the world is much harder than they thought when their parents took care of all the worries. Mom and dad are still sitting at home worrying about their kids and are there to help pick them up. The kids have a tendency to hide their failures and lie about how awesome their lives are but they are in turmoil.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nAgree this could be about His mother as she died when he was only 16\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nI think relativity plays heavily into your interpretation of this song. Growing up, and entering the workforce when Metallica was at its peak, this song definitely made the environment seem more familiar. Someone's wicked ways were whatever bosses had a meeting about, shunning them and refusing their help and the help of anyone and the window burns was taking comfort in the fact that you had a safe place to escape to should everything fall apart on you. This could easily be construed in different ways based upon anyone's situation - depending where you are at in life.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nThis song Is awesome, And theres a lot of Great Interpretations,\n(The Soldier with PTSD is my favorite)\n\nBut, I Have an Interpretation of my own.\n\nI think it is about a Teenager that suffers from bullying, and how he deals with it.\n\nWith that said, Im gonna do a full Lyrical Interpretation, So caution, Long post ahead:\n\n\"Mama, they try and break me\"\n\nApparently, This teenager suffers from bullying, and he tries to tell his mother.\n\n\"The window burns to light the way back home\nA light that warms no matter where theyâ\u0080\u0099ve gone\"\n\nHe is just waking up with the sunlight, On a new day\n\n\"Theyâ\u0080\u0099re off to find the hero of the day\nBut what if they should fall by someoneâ\u0080\u0099s wicked way?\"\n\nHe is told by his parents that he has great potential, Hence the term \"The Hero of the Day\", and should recieve the new day with joy.\nBut since he suffers from bullying, He feels that he will be stopped.\n\n\"Still the window burns\nTime so slowly turns\nAnd someone there is sighing\"\n\nHe just waits for time to pass, Nervous of the abuse he suffers\n\n\"Keepers of the flames\nDo you feel your name?\nDid you hear your babies crying?\"\n\nHe tries to tell  his parents about his problem,\nOnly to be Ignored.\n\n\"Mama, they try and break me\nStill they try and break me\"\n\nHe tells his mother about his bullying problem,\nHoping to be paid attention.\n\n\"Excuse me while I tend to how I feel\nThese things return to me that still seem real\"\n\nHe now reserves the problem to himself, Knowing that he will be ignored,\nAnd he now suffers anxiety, knowing he will get bullied in school\n\n\"Now, deservingly, this easy chair\nBut the rocking stopped by wheels of despair\"\n\nThe few moments of joy he gets,\nOnly for them to be ruined by the bullies\n\n\"Donâ\u0080\u0099t want your aid\nBut the fist I make\nFor years canâ\u0080\u0099t hold or feel\"\n\nHe wants to stand against the bullies,\nSince no one else wants to help him\n\n\"No, Iâ\u0080\u0099m not all me\nSo please excuse me while I tend to how I feel\"\n\nPeople start to notice his changing behaviour, \nBut he tells them that he is Ok and to leave him alone\n\n\"But now the dreams and waking screams\nThat ever last the night\"\n\nThe anxiety is now provoking him insomnia and nightmares\n\n\"So build the wall, behind it crawl\nAnd hide until itâ\u0080\u0099s light\nSo can you hear your babies crying now?\"\n\nHis parents start to notice his changing behaviour,\nAnd how he is now more quiet and distant\n\n\"Still the window burns\nTime so slowly turns\nAnd someone there is sighing\"\n\nHe now spends his days in total anxiety, sighing to vent his fear\n\nKeepers of the flames\nCan't you feel your names?\nCan't you hear your babies crying?\n\nHe cant believe his parents arent paying attention to him\nAnd that is making him suffer.\n\n\"But now the dreams and waking screams\nThat ever last the night\"\n\nHis anxiety now cant let him sleep\n\n\"So build a wall, behind it crawl\nAnd hide until itâ\u0080\u0099s light\nSo canâ\u0080\u0099t you hear your babies crying now?\"\n\nHis parents finally decide to ask him what is happenning to him.\nThey finally hear their baby crying.\n\n\"Mama, they try and break me\nMama, they try and break me\nMama they try\nMama they try\"\n\nHe breaks down to his mother,\nHe tells her all that he suffers,\nhe can finally vent all the suffering and anger.\nHe is now heard.\n\nWell, that was my interpretation, thanks for your time \n\nMETALLICA ROCKZ!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nwell in honesty if you know anything about sumeria history you know metallica and many other bands point to everoyne living in a lie\n\n The window burns to light the way back home\nA light that warms no matter where theyâ\u0080\u0099ve gone\n\n= nibiru \n\na star in the sky warms no matter how far away\n\nif you think im full of shit read about ENKI and his trip to find gold on earth and then listen to Unforgiven 3\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nIt could be about parents losing their children to the darkside of this world and they are hoping they just come home the light is on and leads the way. It's like it could be drug related...hide behiND the wall..hide til it's light..to live another day...almost..can you hear your babies crying..meaning the persons son or daughter is living a life of agony..mama they try to break me could mean they as in they as in whatever is or has influenced their destructive desires.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nI think these are Metallica's best lyrics. Everyone shits all over Load for \"selling out\" but this album had the best lyrics in Metallica's entire career; poetic, meaningful, beautiful, even haunting in certain songs. Tracks like \"Aint My Bitch\" and \"Ronnie\" are exceptions, but the rest of the album mostly contains amazing lyricsmanship.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nIt always reminds me of Lord of the Rings! Ha ha! Especially this part:\n\n\"A light that warms no matter where theyâ\u0080\u0099ve gone\nTheyâ\u0080\u0099re off to find the hero of the day\nBut what if they should fall by someoneâ\u0080\u0099s wicked way?\"\n\nThe ring leads them, Frodo needs to prove he's a hero and there are so many trying to divert the main characters from the quest.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nthis is a bad ass song!!!\n\n\n", "comment_111": "\nthis is a bad ass song!!!\n\n\n"}