{"comment_0": "\nthere are two Mariah Carey's. one that made great songs like this and one that makes the stuff that sells today. both are creditable, but this stuff cannot be touched. simple, true, inspirational and just great.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song brings me to tears or near tears every single time I hear it. In my town a guy named Nate saved one of his buddies and tried to save another one when they're boat capsized in rough water in the harbor. One of them survived with frostbite, the other died of hypothermia and other complications. Nate's body wasn't found. I know this song is about inner strength. But I always think about him when I hear this song because he helped his buddies get to safety and lost his own life in the process.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nit's great. it talkz about people who don't trust themselves, have no faith and self-confidence, they can search themselves and find that there's a hero inside,a hidden talent, everything...\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nwhat ggroessl said was so fricking sad!! *sniffs*\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ni cant stand mariah carey, but i absolutley love this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think this song isn't about yourself being a hero, I think it is about god being inside of you, and helping you when times are tough. He gives you strength and he is the hero saving you.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nOne of the most beautiful things I have ever had the good fortune to hear\r\nWas Mariah's duet with Luciano Pavarotti, where she sang Hero\r\nAnd he sand either an italian version of Hero or an opera song (not sure, anybody know?)\r\nIt was magic.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthe most important song to me~\r\nlove it!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI Love This Song So Much...\n\r\nThe HERO IS OURSELF....MYSELF...\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\n*tear*\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\n**great song**\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI love this song...I can't even begin to tell u just how much Mariah has inspired me. \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthis is such a great song\r\ni first heard it when it fist came out and ive always loved it\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nAt the NBA All Star Game 2003, Mariah sang this song at halftime- dedicated to Michael Jordan.  She was wearing a #23 Wizards jersey, but it was customized at ankle length.  It fit her very tight and her breasts were about to fall outta it. Anyway she sang it beautifully and afterwards MJ gave a speech.  Later Charles Barkley, Magic Johnson and a couple other guys were talkin about it and Magic said Mariah's dress was very 'nice' and another announcer 'u know what was even better then Mariah's dress was Michael Jordan's speech' and Charles Brakley said 'I dont know about that!' LOL Then later on Cheryl Miller asked Tracy McGrady what he thought about the halftime show and he said ''Michael's speech was really touching and 'Hero' was a good song choice and Mariah's dress was reeeeeeeaaaally um pretty, i really liked it alot- the halftime show.\" Then he giggled and blushed a little. I was laughing so hard.  She can sang and her songs are all beautiful and give me cold chills but she do dress like a ho.  No offense :)\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\n::mad awesome song::\r\nmakes you believe in yourself :o)\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nIt makes me feel good about myself\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nthis song is great its saying that theres a hero in you when you think everythings going wrong you need a hero look inside you and youll find the hero is yourself \n\r\nthats just what i think\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nlove it to death!!!but its so sad :( *tears and small siffs* i wish i could write like that and sing like that but no one beats m.c she is talented!i just got music box its a great album!be sure to pick it up!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis song means the world to me, eventhough its not about anybody else, it reminds me of my best friend who has helped me through so many hard times !!\r\nOne of the greatest songs sung !!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nHa, there was an event at my college; a girl sang this song amazingly well, and I actually loved it... was annoyed to find out it was originally a Mariah Carey song... oh well, I still like it :]\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nwell said leahdelonge, well said.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI love this song it has so much meaning :-)\n\n\n", "comment_22": "\nthis song is one of the best songs i've heard! Like Adele's someone like you and rolling in the deep, or Alicia Key's No one and if i aint got you, Jessie J's price tag, Lady Gaga's Bron this way, Beyonce's Halo and irreplaceable ( and so much more cause she's awesome! ) and lots of Hannah Montana's song! i also luv Hero so much! My mom likes it too!!!!!!!!!!!!!!! And all i want for christmas is you!!!!!!!!!!! i love Mariah Carey! All of her songs are meaningful!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ni really love this song because not only it encourages me to be a great hero, but to inspire me to try my best so that i can have a better voice just like this beautiful girl:Mariah Carey\r\nit's one of the very best song in my life...\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song takes us into an atmosphere of peace, warm, and foster a sense of optimism in us, and uplifting to always struggle with the challenges of life.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song takes us into an atmosphere of peace, warm, and foster a sense of optimism in us, and uplifting to always struggle with the challenges of life.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis song is definitely about inner strength, but more than that. It's about being enough â\u0080\u0094 that everything that we seek already lays inside of us. It's also about not seeking to be saved by others (ie: being saved by a man in a relationship, which women are socially and culturally encouraged to seek). That I am my own hero, I am enough and don't need saving.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI love this song: it reminds me of my boyfriend zach, he has helped me throgh the hard times of my life and we are still going strong!! I love him soo much Zach is my \"hero\"!!\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\na hero lies in you.  It's about being your own hero, not depending on others, or letting them break you.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni know it is about letting you be your own hero, but right now is a really low time in my life, and Zach is helping me get through it without becoming a drugy or a run away or nething, so he is like my hero...and i am not totally dependent on him....\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song is about masturbation.  Don't read into it too much.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ni mean sure this is a old song but this is a old song that will be carryed with us for the rest of our lives! i MA a hero and i have the voice and the body to be a hero you and i are a hero changing the world a person at a time love you carey even doe you might never read this i love you and respect this song and you..... sign thanxs\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nLord knows\nDreams are hard to follow\nBut don't let anyone\nTear them away\nHold on\nThere will be tomorrow\nIn time you'll find the way\n\n\nbasically a dream that is difficult to achieve, but if we keep trying to reach it, there are many paths that the gods will provide.\t\t\t\t\n\t\t\t\t\n\n"}