{"comment_0": "\nThis song was written be Paul to Julian, John and Cynthia Lennon's son. \nJohn and Cynthia had just been divorced, and Julian, being young, didn't understand what was happening between his parents, but did feel bad about it. So Paul wrote this song on his way to John's house. So in a way, this song is about divorce. This song was originally titled \"Hey Jules\" because of Julian's nickname, Jules, but Jude naturally sounded better. \nHey Jude was probably one of John's favorite Paul songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nHAHAHAHAHHAHAHAHAHHAHAHAHHAHAHAHHAHAH\n\r\nyou all can have your opinions about the song from heroin to jewish people hahahah.\n\r\nbut the song was originally titled \"Hey Jules\" \r\nthe song was written by Paul to help \r\nJulian during his father (john lennon) and mother (cynthia lennon)\n\r\nbut you guys are entertaining.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nFor me this song is about someone, whos struggling to take the leap towards the life he wants to live and hes made for. He found a girl that he desperately wants to be with and he is afraid to make that step towards her. For he always worries about too many things, he carries the world on his shoulders even tho he is not responsible for every problem in the world. I think hes making things too complicated by thinking too much about them. He is adviced to be himself and not act cool in order to win the girl's heart. Also the change towards the desired life is all on his shoulders, saying he alone has the power to get what he seeks. He just has to take that leap.\nThis is what this song means to me, not what McCartney or anybody said what it is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nActually, the song was changed twice from Hey Julian to Hey Jules to Hey Jude. It would have been one of the greatest honors to have the Beatles or just one of them write a song for you.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nNo!  6 minute version is the best!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nGreat Song.\n\r\nJohn Lennon says fucking hell at around the 2:58 mark which i found preety funny. \n\n\n", "comment_6": "\nIt's worth noting that St. Jude is the patron saint of lost causes (in the RCC).  It could be about having a little hope when a relationship feels like a lost cause.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nYou're waiting for someone to perform with. To me this song is about finding a good love. Anyone who's been in relationships understand how this works.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThe thing that sums up this song is the lyrics  and anytime you feel the pain hey jude refrain. i dont know what it is but that line sticks in my head after listening to the song\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\n\r\n This song is advice to be able to love, let love go, and move throuh the world with an open heart, for a man. Maybe advice to julian for living as an open man.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThe person being adressed has gone through a tough time.  Get on with your life is the message>>> love again.  the second you move on it gets better.  I don't understand: \"anytime you feel the pain, refrain.\"  Is he telling him to give up when it gets tough? -Nicole\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI believe that this song is about John Lennon.\r\nWhen u put John as 'Jude' , it makes more sense than if u put Julian  (John's Son) as 'Jude'. Listen to the song again y placing John as Jude !\n\n\n", "comment_12": "\nit makes me laugh that a lot of people think it's about heroin.  i'm not saying they didn't do heroin, or that they didn't write songs about it, but i think saying its about drugs is taking it too far.  i mean, why would he be telling a 5 year old to take heroin? \nwhat makes sense to me and adding some of what paul said is that it's about getting through the bad part of your life and making it better.  even though paul said it was about john's son julian, it seems more like a song about getting over the bad part in general.  it was originally hey jules, but paul thought it sounded better.  he wrote it going to julian, so it makes sense.\n\nand it kind of angers me that john thought the song was about him.  i mean, he's a brilliant songwriter and a excellent musician, but he was kind of a jealous ego-maniac.  he was never very supportive of paul and the songs many people loved that paul wrote, maybe cause he saw paul as competition.  and to be honest, john was never really a good father to julian.  he didn't really spend time with him, and wasn''t very loving.  he also wasn't a good husband, what with the affairs and everything.  then paul writes this song to comfort him about the divorce his parents are having, and john thinks its about him!\n\nif you really believe the song is about heroin, then think that.  i can't change your mind.  thats your opinion.  this is mine\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nIf you want to \"Take a sad song and make it better\" , \"Don't carry the world upon your shoulders\" , Don't \"make your world a little colder\" , You must sing \"Nah nah nah nah nah nah\" and Scream \"Ma ma ma ma ...\" !\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nTo us, brazilians fans  at 6;35 minutes (close to the end of the song) we can hear someone speaking: ( pega o cavaquinho) means \"get the ukulele\"... We laugh a lot !!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nEveryone (but John), including Paul, says this song is about Julian Lennon and the divorce of his parents.  What I really think (sort of like John) is that Paul started out with that, but lyrics about his relationship with John sort of crept in there.  The most famous one...\"The movement you need is on your shoulder.\"\nPaul said that was something he just said to fill in the time and was going to change it,,,John said, the hell you are, that is the best lyric in there.\n\nSee, John thought right there it was about him.  And how could it not be, he was always being recruited for these movements, and pulled around by various groups to do or say this or that (didn't he write revolution in response?).  Anyway, Paul is saying, \"hey, it is in your head, your brain...that is all you need.\".  I just can't think that has anything to do with Julian Lennon.  And John had basically said, I always heard him talking to me in that song.  \n\nWhat woman is Paul saying Julian has found her and now you go and get her?  But John found someone who he was truly connected to in his soul (yoko) and Paul was giving him his \"blessing\".  \n\nAnyway, that is how I see it.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nPaul wrote this song for John's son Julian.  He was comforting Julian about something.  Originally, the song was Hey Jules, but Paul changed it becuase he thought it was \"a mouth full\".\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nhe was comforting julian about john and cinthia (john's wife at the time) divorcing. how cool would it be if paul mccartney wrote a song for you? wow...\n\r\ni like this song, especially when paul starts freaking out and singing \"HEY JUDE, JUDY JUDY JUDYYY!\" at the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nPaul always thought the line, \"the movement you need is on your shoulder\" was rather corny. The first time he played it for John he said \"Don't worry, I'll change that line\" and John replied \"Don't, it's the best line in the song.\" Paul often refers to this song in interviews and says that this song, and line in particular reminds him of John. \t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nthis is a great song,starting off as a ballad and ending as a huge sing-song!quality!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI like this song, but I don't like the 6 minute version.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nNone the less...I love the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nno Paul, definately wrote it for Julian! and Julian didnt marry his step-mom!!!  sorry lauren!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nHA HA I didn't mean that Julian was marrying Yoko Ono! Sorry, I even heard on the radio that John wrote it, I guess I was mistaken about that. Julian didn't accept Yoko as his step-mom right away, and John is telling him to let her into his heart.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nYou mean PAUL is telling him.... haha having trouble?\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nWho ever saw the concert at the buckingham palace on the 3 of june 2002 must agree that this song was the right choice for a really good ending.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThe 6 minute version of the song is the best. The song was written towards Julian. Also I read that at the 3 minute mark of the song, you can hear John say a four letter word that is meant for Julian. I have tried my best to hear what it was but could not. But I think it is \"love.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nit's good.....................................................\r\nfor 6 min...definetely perfect...\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI love the 6 minute version, perfect sing-song, song IMO!\r\nGreat stuff :)\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nOk well obviously I'm either not saying something right or somebody told me something that was incorrect in the first place. All I know is that I was told that Paul wrote the song for Julian but I was also told something about it being from John to Julian? Anyway I guess I'm just totally messed up about this whole thing...lol....sorry if I confused anyone... I'm glad at least you guys know what you're talking about!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ni like the song to but i just recently started listening to the beatles b/c my friend likes them a lot and on a trip she brought the cd and i liked this song the best...i really dont no much about julian but someone told me... and i dont no if its rite... that paul rote the song for john... and it was ariginally gonna be hey john but john didn't like that...??? is my friend completly wrong?\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI went to the Beatles 1 website and I listen to a 1 min. explantion by Paul. He wrote the song on a hour long drive to John's house to visit him and Julian. It was originally hey jules, but he changed it after talking to John and Yoko. It was an optimistic song sort of saying, 'Yes your parents got divorced but everything is all right.' Just wanted to share that, that's all.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\ntoronto has it right.  i love this song.  it has awsome music and good lyrics and it's by my favorite band.  it is my favorite beatles song.\n\n\n", "comment_33": "\nPAUL WROTE THE SONG! and john thought it was about him, but obviously it was about julian. The only way to listen to it is the 6/7 minute one. I've never even heard another one, and I wouldn't want to\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nJust to add to what I had written before about the line \"The movement you need is on your shoulder,\" here's a quote from Sir Paul himself:\r\nâ\u0080\u009câ\u0080¦and driving out there, (to John's and Yoko's) it might have been an hours drive and I started doing this â\u0080\u0098Hey Jules, donâ\u0080\u0099t make it bad take a sad thing and make it better.â\u0080\u0099 You know, as optimistic, â\u0080\u0098Come on man, you know, itâ\u0080\u0099sâ\u0080¦your parents got a divorce, I know youâ\u0080\u0099re not happy.â\u0080\u0099 Instead of Jules, I eventually changed it to Jude. I played it to John and Yoko. There was just one bit of the words which was â\u0080\u0098The movement you need is on your shoulder.â\u0080\u0099 And Iâ\u0080\u0099m playinâ\u0080\u0099 it, and I just looked at John and said â\u0080\u0098I'll fix that, I'll fix that.â\u0080\u0099 He said, â\u0080\u0098What?â\u0080\u0099 I said, â\u0080\u0098Well, you know, the movement you need is on your shoulder. I-I-Iâ\u0080\u0099d used the word shoulder once and anyway, itâ\u0080\u0099s just a stupid expression, it sounds like a parrot, you know, I'll change that.â\u0080\u0099 He said, â\u0080\u0098You wonâ\u0080\u0099t, you know.â\u0080\u0099 He said, â\u0080\u0098Thatâ\u0080\u0099s the best line in the song, you know.â\u0080\u0099â\u0080\u009d \t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI luv this song....\n\r\nI don't like Yoko Ono...heh heh sorry just thought I would share...\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\ni love this song. my mom said she doesn't like the end when they keep going \"da da da da..\" i love it! i believe the song is 7 minustes and 03 seconds long. you can hear paul still going \"jude jude judy judy judy yeow wow!\" and etc. mick jagger said it was like 2 songs...the song and then the \"dada\" chorus\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nmetallicaman123-\n\r\nI never once said I was an expert on the Beatles. I was only repeating what I'd heard, which was obviously incorrect. I admitted that though, and I'm so sorry that I've just gotten into the Beatles and I'm still learning, I don't think that makes me a \"poser beatles fan\" or a \"dumb shit\". Of course I'm sure you've never made a mistake in your life so you have the right to go around accusing other people for theirs.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nNon the less-\r\nit is an excellant song written for John Lennons son-Julian Lennon-Wriiten by Paul during his parents divorce(john lennon & cynthia lennon(powell). AND I LOVE THE END-IT MAKES ME FEEL HAPPY\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nAND I HAVE BEEN LISTENING TO THE BEATLES MY WHOLE LIFE OR FOR AS LONG AS I CAN REMEMBER-MY PARENTS ARE AVID LISTENERS OF THE BEATLES AND I GREW UP ON THEM-SO YA IV LIKED THEM FOR AT LEAST 14 YEARS OF MY LIFE!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nOk, hang on, I'm sorry but I think this whole thing is a huge misunderstanding. I heard that stuff about this song from a friend of mine... in fact, I don't think I've even said I liked the beatles on this post so how could I be a poser beatle's fan? Anyway, what I was trying to say was I'm sure you weren't born knowing everything about the beatles. I appreciate you trying to explain yourself but I thought that you were acting nice in PMs and not on this board just to make me look stupid. I realize now that it was just that both of us read each others messages in a different order than what was intended and that made us both look like an ass to the other. I sincerely apologize for this whole thing, I'm sorry- I should have checked into that information before I even said anything, but I didn't. I also apologize for my rudeness to you. As you can see, I have a lot to learn about the beatles, and until I have a little more knowledge I'm just going to keep my big mouth shut. \n\r\n(Just so you know, I didn't start liking the Beatles because of I Am Sam. :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\n*beatles\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\ni also apologize for my rudeness,i shouldnt have said\"lauren is indeed a dumbshit...\"-and i dont know you so i shouldnt have called you a poser,but there are alot of people who started liking them after \"i am sam\",b/c it was such a popular movie.i apologize once again and do appreciate you apologizing also,and also its cool that you show an appreciation for good music,i thought i was the only teenager who liked them,(all my friends think their gay)more power to you in your learning exprience for the greatest band to ever have been and to ever be.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThanks and sorry again! I know what you mean, too, not many of my friends like them either! \t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nWhat is I am Sam. hahah\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\ni'd heard beatles music when i was younger, and a few songs glued themselves to the inside of my brain: 'Love Me Do' 'Please Please Me' 'Can't Buy Me Love' 'I want to hold your hand' 'She Loves You' and a couple more, when the I Am Sam soundtrack came out my mum bought it for me, and it kind made me fall in love with beatles music. some songs i don't like, but who likes every single song a band has ever written, especially with the amount that the beatles have written?\n\r\ni'm gonna stop prattling on now and go...\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\ni remember listening to the na na na na na part when i was a kid...then i heard it again for the first time like last summer and i was like: i know that from somewhere!\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI didn't know that the theme to the Wonder Years came from a Beatles song until we did some stuff on the Beatles at school. Most of the other people thought it was stupid but I was so surprised about how many Beatles songs I'd heard and not known it! \t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI love this song!!! This my frist favorite beatles tune. Its such a sweet song. I think every man should listen to this song then maybe there wouldnt be so many commintment- phob men. Haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nDefinately my favorite beatles song. Always a classic. And I love paul :D~~\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nNoone talks about the possibility of Heroin as the general theme....   Any comments?\n\n\n", "comment_51": "\nI  do not think it has anything to do with heroin.\n\r\nI saw the Beatles three times, two times in Seattle and once in Portland.  When I first began loving the Beatles I was shunned and laughed at.  The kids at my school were a bit slow, don't you think?  The years were 64-66!\r\nSo to most of you I am probably pretty old, but a true Beatles Fan for sure, I even had Beatle Wallpaper!\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nBeatle wallpaper? Man, you're my new hero.... hehehe\r\nI have the beatles on my wall, but I painted my mural. \t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\ni know this song was written for julian but i think its interesting that st. jude is the patron saint of lost causes\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI think it's interesting that \"Jude\" is German for \"Jew\".  The Beatles got their start in Germany, didn't they?  This song is obviously an expression of empathy for the Zionist movement.  The Jews had undergone the Holocaust, and were in the middle of the biggest test of the state of Israel--the Yom Kippur War / Seven Days War interem period.  Paul is calling the Jews to stay strong, but not cold--to go after their goals of security with love and peace.  To not try to pull down the entire Middle East upon their heads, but to make peace--when they feel the pain of regional strife, Paul called Israel not to retaliate (refrain) and not to \"carry the world upon your shoulders.\"\n\r\n\"You're waiting for someone to perform with. \r\nAnd don't you know that it's just you. \r\nHey Jude, you'll do, \r\nThe movement you need is on your shoulder.\"\n\r\nIsrael lacked true regional allies, and was entirely dependant on American / UN aid to remain afloat.  However, what the Jewish world needed to do was renounce foreign aid, and stand alone in peace with its neighbors by negotiating for peace.\n\r\n\"Her\" is peace--in both Hebrew and Latin, respectively the classical Jewish and Christian languages--Peace takes the feminine tense.\n\r\nAnd Jewish history has always been a sad song: the Jews have been among the most persecuted people in history.\n\r\nAny takers?\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nNo.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nWe've all heard the story Bobo.  It was a joke.  Perhaps I should have prefaced it.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nDefinitely. Sorry for the... um, confusion.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nNo offense taken in the slightest.  Far too often things more preposterous are meant too be taken at face value.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nHey i wanna no what the real story is... is the song about Julian Lennon's son or Jews???????  Plz either post an answer or else email it to me plzzzz\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nIt's definitely about Julian. I've posted the official story, if you can see it.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI don't care if its cocky. Bobo is right.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nOf course it's cocky. I can't help it, darlin', that's just me. Otherwise, it's such a famous interpretation, that I know it off pat anyway. Plus I've got about 20 books which tell me so.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nAn addendum that I missed out: from what I've learnt about basic psychology and the books I've read which explain the dreams both John and Paul had (of which there were many) which inspired the songs they wrote (this included many of the weirder songs which, like I do whenever I write, they thought up during sleep.) Let me just bore you with a little background.\n\r\nI started writing songs four years ago. Little tunes, nothing big, maybe eight bars long. I could only write four bars at a time because my attention span was so low. Brian Wilson of The Beach Boys worked in the same way. (He, if you are wondering, IS one of the people I look up to as a songwriter). I used to write little snatches of tune, four bars each, when suddenly, out popped an entire tune. I had just finished listening to The Everly Brothers' \"All I Have To Do Is Dream\" (again, pertinent). I thought to myself how I could do it, and in my sleep, I came up with words. Single words at first, then phrases, then sentences at a time.\n\r\nNobody can argue with me where my songwriting inspirations are from. I write down everything. Inspiration, date of authorization, and every single word of the song, in my (very sharp) click-click pencil. My point is, such that the words and the tunes were all documented at the beginning, so after The Beatles' career, some guy went back to Mr. McCartney and asked where every single song came from. The result was A Hard Days Write, but that's not the point. Everything's now been documented. Recording dates, correct to the hour, complete journals, correct with master copies of their complete 13 year schedule from 1957-1970.\n\r\nFrom this, what do I glean? Official stories, with professional backing. That sounds arrogant, but believe me, when I say I'm right, it's been literarily proven.\n\n\n\n\n", "comment_64": "\nPoint of interest: Hey Jude was recorded 31st July 1968 to 1st July 1968. Julian Lennon was born 8th April 1963. This gives you an idea of the time-scale of the recording.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nGrr, I was too dumb when I wrote that. It's meant to say 31st July to 1st August...\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nok back to the song, i swear so many pitty stuff when it's about the music. So many people have done a cover of this song, i know i'm going back a little here but my fav. cover was by wilson pickett. Not as good as the beatles but it was good on it's own.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI like this song. Classic Beatles man. Good Tune.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nfrom paul to julian about john leaving cynthia? I don't think that's right. then what's meant by the lyric \"You were made to go out and get her\" among others? sounds to me like it was paul writing for john encouraging him to court yoko (I bet he'd regret it now if he hadn't made so much money from the song)...and doesn't jude translate to john is some language?\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nInteresting reading all the stuff above. I've never heard of this song being about julian lennon before now. I heard that it was written about John's aunt Jude, who looked after him while he starteed the beatles. The song is a thank you for giving him somewhere to live and providing for him as he struggled as a musician\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nRead the latest issue of Cosmo.  Then read Jack Keruoacs \"On the Road\"  Compare and contrast. If you still don't know what this song means, you are probably dead.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nto me, it sounds that the lyrics perfectly describe that of injecting heroin \"the minute you let her under your skin, then you begin to make it better.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nnot all beatles songs were about drugs. i HATE when people hear a beatles lyric that they dont understand and assume its about drugs. give the beatles more credit, man, they had more to their songwriting than that.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nnottheonlydreamer:\n\r\nIt was a joke.  Not real.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nthis is my first post and it has 2 be on the best band eva! yeah oidimed, i agree with u there. just like Lucy in the Sky with Diamonds and every1 thought it was about L.S.D when it was actually about a drawing that Julian had drawn for John!\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nencouraging,  heartfelt, somewaht obscure..and the whole obscurity regarding the references to herione; i think dat jus add to character of the song..a classic\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nare you kidding me? how cum people always says songs are about drugs and devil worship?\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI've begun to relisten to this one, \"Yesterday\" and \"Sympathy for the Devil\" by the Rolling Stones because of a novel I've finished reading, called \"Vivienne\" by Richard Hoyt.  The title character uses lyrics from \"Hey Jude\" as a message to the man she loves.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThe Beatles were and are the ground-breakers of Rock and Roll as we know it. They established the basic STRUCTURE of rock music! Sure, the Articles of Confederation were impractical. And true, we don't focus on them whatsoever (except in US History, otherwise how could we refer to them?). You only proved our point. Society DOES focus on the Beatles, and revere them, because they were innovative and inspired. We would disregard them (like we did the Articles of Confederation) if they were anything other than that. Sure, many of the initial songs were light and free, but then again who says that a song about love and happiness is insignificant? And who could blame them for seeking monetary gain? Aren't they human? Do they not need to make a living? And in contrast, many of their songs, such as this one, are meaningful and inspirational. I truly pity people who disregard the Beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nFirst of all, The Beatles rock! Most of my friends make fun of me for liking them, but what can I say, all their songs are so meaningful, I love them. I will never ever find a band that I love as much as them. This song is one of my favorites.\n\r\n-Give them a chance\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nso what does the \"movement you need is on your shoulder\" line actually mean?\n\r\nto shrug your shoulders, as if to shrug off a burden?\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nI think this song is telling Jude to give head, read the lyrics and think about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nDuh!!!! Pauls nickname for Julian Lennon was Jude ffs. It was a mixture of Julian and dude(very much used term of affection for a friend). And like its been said before John and his wife were breaking up and it was affecting Julian quite badly.  phatboytackle u don't know shit!!! Paul wrote the song, why would John write it and let Paul sing lead? Dickhead. Get your facts right.\r\nAnd let her under your skin, is Paul telling Jude to look after his mum and don't blame her.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nPaul saw how the breakup of Julians parents was affecting him. So he wrote a healing song for him. Jude is a mixture of julian and dude(much used in the 60's and still today) and it was Pauls nickname for him. There really is some idiots posting crap about things they don't know on here.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nThis is the most commercially successful Beatles song. It was #1 in at least 12 countries.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nDuring the ending vamp, Ringo does a lot of cool fills.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nThis is my favourite Beatles song...it's just so indescribably (sp?) wonderful!\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nThis song is, as many people have said, is about John and his wife breaking up, and Paul is trying to soothe their son Julian. Hey Julian and Hey Jules didn't work, so they used Hey Jude, not as a combo of Julian and Dude, but as a take on the character Jud from Oklahoma. John thought this was Paul approving his relationship with Yoko.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\ngreat song..\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nThis was my getting stoned song all through high school. The length of the song was perfect.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\ni love this song. lol i went to see the beatles tribute Rain, and they did this and made everyone sing. the \"john lennon\" was like \"ok everyone 20 and under\" and me n my friend were the only ppl going \"NA NA NA NANANA NA! NANANA NA! HEY JUDE!\" it was awesome. Hey Jude is one of the beatles best songs ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nTechnocrats.. all of you. It's just a \"silly love song.\" Whether to Jules or \"Judy, Judy, Judy, Judy..\" the purpose is to make someone swoon with attention. And, singing this song to the right person, makes them pay attention, like \"Hey\" their singing to me. And, like Jim would say, \"It's B-U-T ful\" a bouquet of roses being handed to someone you love. And, the NA NA NANA, NANANANA... is the icing on the cake. One of the main reasons we love the Beetles is because they made \"goot\" love songs, and when they tripped-out they took us with 'em.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nThis is an amazing song... beautiful i think anyone can relate to it really, everyones been in a situation where you need to accept someone, or love someone... that mayb u didnt wanna love? i love it. at a beatles tribute concert this was the last song, and they said \"everyone 20 and under!\" and me n my friend were the only ones, singing NA NA NA NANANA NAAA NANAN NAAA! HEY JUDE. it was magical.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nhaha its me again, i jus realized i already posted that story...im a retard:P\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nI haven't read Jack Keruoacs \"On the Road\" yet but I intend to.  I'm already convinced this song is about heroin and always will be.  It sounds just like a pusher trying to convince someone to shoot the stuff for the first time.  Naturally Sir Paul McCartney isn't going to come forward and say: \" why yes...Hey Jude is about trying heroin for the first time\".  \r\nIf you turn your stereo all the way up at the very end of the song you'll hear Paul McCartney sing \"take it Jude\".  \r\nTake what? After listening to the previouis lyrics I'm convinced that he is talking about heroin.\r\nI know all songs by the Beatles aren't about drugs but it's no secret they all were heavily into them.  And this may sound a bit strange to some of you but it is very possible that the lyrics were influenced by McCartney's drug use and he didn't even realize  it.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nOne of the the greatest songs ever written.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\na song written for jude to show support on his parents break up. one of the best. \"hey jude, don't make it bad. remember to let her under ur skin, then u begin to make it better. couldn't ask for a better artist for it.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nwho does 'her' refer to in this song? ..and wut does it mean by the movement you need is on your shoulder? sorry i'm really bad at understanding songs\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nOkay, so say it is based on Julian - turned Jules -turned Jude. \n\r\nPaul may have very well used \"Jude\" because \r\n(1) Jew translated to German is \"Jude\", and being a peace-loving man, Paul wanted to lift up the scarred souls still raw from the Holocaust \r\n(2) In the novel Jude the Obscure by Thomas Hardy, Jude was the guy that no matter where he turned, what he did, tragedy was always there to bite him harder than before. Considering that, this song just might be about hopeless causes and whether or not you should even have hope.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nhey  globunnyglo  were signing this on the same day, isnt that cool?\n\r\nif i meet paul or ringo ill ask them who wrote it and why\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\ni think this is a song about growing up on the tough streets of chicago... sleeping out in the cold.. no food.. no shelter... its tough to imagine\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nisn't it \"For well you know that its a fool who plays it cool to make his world a bit more colder\" or some thing like that\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nthe beatles are british absent124 they never grew up in chicago it may mean that to you but THEY'RE BRITISH\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nThis song is written to jude (julian) because he was having problems with relationships...and this was his song to jules...to help him comfront the problem...yea thats just what my dad said...not sure...but yea\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nsadly this song is actually about Paul's experimentation with Heroin. Of course the masses quickly reject this claim, but apon further review most realise this is in fact the truth.\n\r\nA) this was written at the height of the Heroin crazy among rock stars.....B) Jude is/was a slang term for Heroin in Great britian....C) the Lyrics.'So let it out and let it in'----refer to the practice of pulling blood out and than injecting the H back in mixed with blood...\r\n'Remember to let her (Jude/ Heroin) under your skin'---not real complicated here.\r\n'Then youâ\u0080\u0099ll begin to make it better'-----and other lyrics make it ring true as well.\n\r\nStill a beautiful song. At the time Hendrix, Morrsion, Joplin, Jagger, Richards, Lennon and Dylan all thought H was just another drug that would aid them...McCaurtney of course quickly found out how nasty Heroin is and stuck with the meaning that certainly stands up because it was true enough, but not the entire truth.....\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nI think that this song was written for Julian, But still...\"let her under your skin\"..Big references to drugs in this song...\r\nOf coarse this song has the most posts because it's arguably the best beatles song out there...I have never had a song stuck in my head so longs, its pathetic.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nPT UR POST WAS THE STUPIDEST THING I HAVE EVER READ!\r\nur source is messed up!  Hey Jude was OBVIOUSLY written for Julien (John's son) when John left Cynthia for Yoko Ono.  Paul was always good with kids and he just felt bad for little Julien.\r\nPAUL NEVER TOOK HEROIN\r\nI'm paraphrasing but... he said that he was thinking about taking heroin but when he saw what happened to the people who did, he decided to not do that.\r\nNO WAY, MAN\r\nI don't know who he is referring to as \"her\" but it is defiently not heroin.  Paul hated heroin and would not tell a little boy to take it.  \"Her\" might refer to Cynthia, who Julien was angry at after the divorce.  But why just Cynthia and not John??\r\nI do know that John likes to think that the song was sort of made for him... that means that \"her\" would be Yoko Ono, his new found love.\n\r\nty William for telling absent that he is an idiot and if he doesn't know the obvious fact that the beatles are british, he should not be commenting on anything beatles.\n\r\npeace\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\n\"Hey Jude\" is such an overwhelming song. To me this song really proofs that Lennon and McCartney are equal, song writing wise. \"Hey Jude\" is not only one of the best Beatles songs, it's one of the most beautiful songs EVER! I saw/Heard Paul in 2002 (the closest thing I'll ever get to experience The Beatles live) and when he performed this, I really felt that EVERYTHING in my life made sense. Thatâ\u0080\u0099s a very powerful thing when that happens and the fact that a song can do that to you is one of my favourite things in the world.\n\r\nMy favourite lines are:\n\r\n\"For well you know that itâ\u0080\u0099s a fool,\r\nWho plays it cool,\r\nBy making his world a little colder.\"\n\r\n(The lyrics posted on this page are actually incorrect.)\n\r\nThose lines (and the entire song for that matter) are some of the wisest words I have ever heard! To me those lines means: If you let love out of your heart, if you let it go or you play it cool even if you like someone, youâ\u0080\u0099re a fool. For anyone who does that makes his or her and the world a colder place to live in.\r\nI know that thatâ\u0080\u0099s not exactly what it means in the song, but I guess you sometimes change the meaning of a lyric to identify with it. And a lot of times lyrics inspire you to think thoughts you havenâ\u0080\u0099t thought before. And IMO The Beatles are masters at that!\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\n\"For well you know that itâ\u0080\u0099s a fool,\r\nWho plays it cool,\r\nBy making his world a little colder.\"\n\r\ndoes not mean \"to let love out of your heart\" This line also strongly indicates this song is indeed about heroin.\n\r\nWhen you take heroin your body becomes very warm, and when you know that and listen to the line again it makes perfect sense:\n\r\nFor well you know that it's a fool, who plays it cool, by making his world a little colder \n\r\nIts a fool who doesn't take heroin and makes his world  colder.\n\r\nAnd towards the end (at 6:03 on the 7:04 minute long version of the song) He clearly says \"take it jude\" \n\r\nThis song is clearly about trying to get someone to take heroin. Let's go over all of the indications one more time:\n\r\nRemeber, to let her into your heart,\r\nThen you can start to make it better. (let it into your bloodstream, and you can make it better and get a high)\n\r\nThe minute you let her under your skin,\r\nThen you begin to make it better. (to let the heroin under your skin)\n\r\nAnd anytime you feel the pain,\r\nHey Jude refrain, (when you have a bad trip, he is telling jude to refrain)\n\r\nFor well you know that itâ\u0080\u0099s a fool,\r\nWho plays it cool,\r\nBy making his world a little colder. (i explained this earlier)\n\r\nRemember (Hey Jude) to let her into your heart,\r\nThen you can start to make it better.\n\r\nSo let it out and let it in (when you take heroine you pull out the blood and then push it back in)\n\r\nHey Jude begin, (start taking heroin)\n\r\nand the last line is...\n\r\nRemember to let her under your skin,\r\nThen youâ\u0080\u0099ll begin to make it better. \n\r\nand then he says \"Take it Jude\"\n\r\nHow can you deny that this song is not about heroin? Because Lenon said it wasn't? Do you think he would actually say that it is?\n\r\nnaaa naaa naaa na na na naaa take it juuude naaaa\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nI felt the need to correct the last comment made by jimfranklin, especially since it was the last entry.\n\r\nPaul was not into heroin. His mother was a nurse so he stayed away from heroin for this reason, plus he hates needles. He only took soft drugs like pot.\n\r\nThis song was written for Julian, John Lennon's son, like the others said before jim franklin's entry. He wrote the song to comfort Julian during John's divorce from Cynthia, and changed it to Jude because it sounded better to say.\r\nI felt the need to defend Paul and this song's meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nTo eeskride's response:\n\r\nNo one knows whether or not Paul took heroin. And you can't say he never did. No one knows. \n\r\nCertain lyrics in this song do not make sense if this was indeed written for Julian, to comfort him during a divorce. \n\r\nWhen paul says \"Remember to let her into your heart\" ... who is \"her\"? \n\r\nLet her in to your heart\r\nLet herin to your heart\r\nLet heroin to your heart.\n\r\n\"her in\" sounds a lot like \"heroin\" doesn't it?\n\r\nAnd the line \"Let it out and let it in\" How does that relate to a kid struggling with a divorce? \n\r\nAnd please, everyone listen to what paul says at 6:03 in the song. You don't have to turn it up all the way like someone said earlier in this forum. You can clearly hear it when he says \"Take it Jude\"\n\r\nAnd if this song is about a divorce, does \"Take it Jude\" make any sense? No it doesn't.\n\r\nI'm not saying Jude is not Julian. This song probably is for Julian, but Paul doesn't sound like he is helping him through a divorce, it sounds like he is telling Julian to take heroin.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nTo jimfranklin:\r\nI agree completely with you.  I listened to the song recently and \"take it Jude\" is quite audible without turning the volume all the way up.  So no need to disturb your neighbors folks.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nCould be about heroin, but on another level \"Hey Jude\" is about the Jews. \"World on your shoulders\" refers to the weight of Jewish destiny as the Chosen People, \"waiting for someone to perform with\" is the Jewish expectation of the Messiah.\r\nRemember that \"Hey Jude/Revolution\" was released as blasphemous counterpoint to the Biblical \"Jude, Revelation\". \r\nInterestingly, when the song first came out, the windows of the Apple boutique were smashed...by a Jewish Holocaust survivor, who reacted to the publicity posters, the \"Jude\" reminding him of the \"Juden Raus\" etc. campaigns of the Nazis.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\ni realy dont think hey juse is about taking heroin! Paul Macca rote this song to comfort julian Lennon johns son after julian and Cynthia left John after he had been fooling around with yoko (john not julian!). Paul played it first to Cynthia and then to John. Or so Cynthia says in her new biography \"john\". it has nothing to do with heroin! Paul never took heroin, that was john and the reason it doesnt sound like paul is helping julian through his parents divorce is because he was using his artistic licence. loads of artists do that. People twist things around to make it less easy and less blatant about what they are siging about. like if someone had just smoked a joint they wouldent exactly say \"oh yeah and by the way i am stoned while writing this!\" that would just be dumb! and of course its not about the jews because it was written before that jew guy! sorry for being so aggressive but the beatles are too amazing to have people writing rubbish about their music.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nPeople have the attitude that if it's *possible* to take song lyrics to be about drugs, then they *must* be about drugs, and anyone who thinks otherwise is a naive fool. That's an incredibly superficial outlook.\n\r\nMy guess is that Julian was hurt and angry over his parents' divorce, as well as his father's very open relationship with Yoko Ono. And Paul couldn't stand Yoko and empathized with Julian. So the song is partly for Julian (who was only about 5 at the time) and partly for Paul himself. The lyrics, \"Let her into your heart...Let her under your skin\" probably refer to Yoko: Julian may not like Yoko (as Paul doesn't) but she's the woman in John's life now and both of them have to learn to accept it. Only then can they \"make it better.\"\n\r\nThe warning, \"well you know that it's a fool / who plays it cool / by making his world a little colder\" is probably a warning against the emotional coldness that hurt and anger often create. So he urges Julian (and himself) to \"let it out and let it in,\" i.e., let the pain out and let the healing in. He can't put it on someone else to do that for him or with him (\"someone to perform with\"); he needs to do it himself (\"the movement you need is on your shoulder\").\n\r\nUltimately, it's by accepting the pain and the reality of the situation that it can ever get any better. The more I think about it, the more I think Paul was really writing about himself. He was furious at John for bringing Yoko into the Beatles recording sessions, but he had to get past that in order to keep the Beatles going at all. Too bad it didn't last much longer, anyway.\n\r\nJust a personal note: this used to be my \"work up the courage to ask a girl out\" song. I used to play it in the background when I'd call her up. And if she said Yes, then I'd dance around the room during the \"da da da da da da da\" section. (Smirk all you want; I'm verrry happily married now!)\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nbamaman1488--\n\r\nYou think your point is made because that's all you can see. Haven't you ever heard of the expression, something \"getting under your skin\"? Besides a needle, that is? It means that something is getting to you; you're allowing it to affect you. Paul is telling Julian (and himself) that they can't just have a thick shell. They have to take the risk of being vulnerable.\n\r\n(And I suspect that \"Jude\" became slang for heroin  after this song was released and users took it to mean heroin.)\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nI heard some dj on  the radio talking about this,  just after \"remember to let her under your skin\" John knocked some headphone on the floor during recording and he says \"arrhh!! fucking hell!!!\" as he thought he ruined a perfect take but they left it in. it does sound more like 'fuckin' 'ell\"\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nThis song makes you so proud to be british! Does anybody remember the finale of the Queen's Golden Jubilee? Paul McCartney is a legend! And even much so is John Lennon. I loved the tribute to George Harrison with Eric Clapton! This song is their best!\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nYtseJam edited this song for me with my additions (all the stuff after the first naaaanananananana)... it was hard, and honestly I'm sure I missed a couple of na's on the parts of the song where he goes so damn fast. If anybody wants to slow the song down with software and discover exactly how many there are, feel free, but I'm content with what's up there. (I do think I got the mymymy's right, though :) ).\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nby far the best Beatles song\n\r\nI think after listening to all their albums and going through all their songs, this one seems to have the most longevity\n\r\njust my $.02\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nTaken from sfgate.com/cgi-bin/…\r\n Thanks \n\r\nThe Rolling Stones -- now rolling around the country as sexagenarians -- are the best band in the history of rock music. I submit that this can be proved with mathematical rigor and now propose to do so. Follow this closely. \n\r\nSartwell's First Law: The quality of a rock band is inversely proportional to its pretentiousness. \n\r\nCorollary to Sartwell's First Law: The pretentiousness of a rock band can be expressed as a ratio of its artistic ambition to its artistic accomplishment. For example, on a scale of 1 to 10, the artistic ambition of the band Yes equals 9, its artistic accomplishment 1. This yields a pretentiousness ratio of 9:1, one of the very worst in rock history. \n\r\nThe evaluation of rock music is no longer an impressionistic expression of opinion, but rather a precise, quantitative science. Anyone who disagrees with me from now on is simply irrational. \n\r\nSome quick applications: The Ramones (1:8) are better than the Talking Heads (7:7). Nirvana (3:9) is exactly as good as Pearl Jam (9:3) is bad. The worst music ever made (literally) is art rock: King Crimson (10:1), for example. Early U2 and early Bruce Springsteen, who took what were fundamentally fairly simple ditties and mounted them with an elaborateness usually reserved for Wagnerian opera, are almost unbelievably overrated. \n\r\nAnd finally, the Rolling Stones are much better than the Beatles. \n\r\nNow admittedly, this Stones versus Beatles thing is decades old. But it rages still through the halls of nursing homes the world over. \n\r\nBoth the Stones and the Beatles started out as interpreters of rhythm and blues. They cleaned up African-American music and sold it to the world, a tried and true commercial strategy for white folks throughout the century, from Benny Goodman to Elvis Presley to Vanilla Ice. \n\r\nWhich brings me to: Sartwell's Second Law: The quality of a rock song varies inversely as the square of its distance from the blues. The bluesier the better. \n\r\nThe world's popular music is African-American music because African-American music is extremely intense and powerful. If you're playing music in a European tonal framework, you're not a rock band at all. \n\r\nThe history of rock is the continuation of the history of the blues, both in the way it is made and in the way it is received (by dancing in bars). \n\r\nThe two laws are connected: When was the last time you saw a pretentious blues band? Rock is a traditional, as opposed to an avant-garde, art form. The authenticity of a work of traditional art is measured by the way it venerates and explores the tradition. The authenticity of a work of avant-garde art is measured by the way it destroys or transcends the past. Avant-garde rockers have profoundly misunderstood their form. \n\r\nSomething awful happened to the Beatles about 30 years ago, something that happens to most young rock musicians who achieve extreme success: They mistook themselves for avant-garde artistes. They made, for example, Sgt. Pepper's Lonely Hearts Club Band, a truly bad album. They lost the blues and, to paraphrase Chuck Berry, started sounding like a symphony, a vapid symphony. They went baroque. \n\r\nNow that was exactly what the Stones never did (though there was one scary moment: Their Satanic Majesties Request). They have remained, for much longer than anybody else, a knockdown, straight-ahead basic blues and rock band. Mick Jagger never mistook himself for Luciano Pavarotti or T.S. Eliot. Keith Richards never tried to do anything but make great little riffs. \n\r\nThink about how hard this must have been: You can do anything you want, and instead of making a statement for the ages demonstrating what a profound puppy you really are, you just write another great, simple rock song: \"Beast of Burden,\" say, or \"Rock and a Hard Place,\" or, from their excellent current disk, \"Rough Justice.'' When Bach (10:10) made profound statements for the ages, they stuck. When Emerson, Lake and Palmer (10:1) made profound statements for the ages, they were dated before they were released. \"Twist and Shout\" and other early Beatles songs sound like they were recorded yesterday. But \"For the Benefit of Mr. Kite!\" sounds like the relic of an extinct, incomprehensible culture. \n\r\nEverything the Stones have ever done, with the exception of some very early work recorded before they could sing and play competently, holds up beautifully: It's the rock of ages. Albums like \"The Rolling Stones, Now!\" (1964), \"It's Only Rock 'n' Roll\" (1974), \"Undercover\" (1983), and \"A Bigger Bang\" (2005) all sound perfectly fresh. There's a very simple reason for that: They are excellent examples of Sartwell's laws, completely unpretentious and always undergirded by the blues. \n\r\nThe accomplishment of the Stones never exceeds their grasp; they know exactly what they play well, and they just keep on playing it. Do that successfully for a year and, if you're lucky, you've got a good recording and a concert tour to show for it. Do it for 35 years, and you're the only rockers who ever have. \n\r\nSo there you have it: Perfectly irrefragable proof that if you go see the Stones, you'll be seeing the greatest freaking rock band in history. Anybody got an extra ticket?\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nyoure a great sartwell shit talker\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nThe guess here is that the non drug takers would say it's clearly not about Heroin and the current (and thank goodness) one time drug takers are saying it is about dope.\n\r\nWell Paul clearly was a heavy drug user. He has admitted as much, without shouting it from the tree tops.\n\r\nThe fact i fear some of you are missing is that Herion wasn't know as the demon we now understand it is now.......Hendrix, Morrison and Joplin we're all alive and well.\n\n\r\nName a great musicain and you can rest assured they used drugs.....the drug of choice for the elite in 1969 was heroin.\n\r\nIt's still a beautiful song, don't let the facts lessen your enjoyment of it.   and don't let your desire for Paul to be saint Paul allow you to cloud your judgement.......Get Back wasn't exactally a sweet little # either.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\npt-\n\r\nCertainly some of the Beatles' songs were inspired by drug usage.  I still think \"Lucy in the Sky with Diamonds\" was describing an acid trip, regardless of John's protestations. Paul has acknowledged taking pills, pot, cocaine, and acid. He ticked off the other Beatles for talking to reporters about their LSD usage before any of the rest of them did. And yet, he describes himself (and is acknowledged by the others) as having been more reluctant than they were to get into the heavier drugs. He said somewhere that he drew the line at heroin (he was told, \"It's only a problem if you run out of money, and that's no problem for you,\" and thought, no, I don't want any part of that).\n\r\nThe problem I have with \"Hey Jude\" being about heroin is that it makes the singer out not only to be a user but to be a pusher--and a pretty heavy-handed pusher at that. That's not Paul's MO. He had already seen the devastating effect that heroin usage had had on John back in '66 or '67. I just don't think that that was his drug of choice, or that he would write a song pushing it that hard. And there are other ways to interpret the song that make more sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nwell said  KevinWayne.\n\r\nWhen did John first use Heroin? If it was before 1967 i'd be shocked. Happiness is a warm gun has made me wonder over the years and of course .....cept me and my monkey gives one pause to thought .......but as far as John having something negative to say about drugs Cold turkey (a Lennon solo tune) is the first negative thing John had to say about drugs on album and that was in the 70's.\n\n\r\nHey Jude was Released 26/8/68.\n\r\nI'm telling you what i think it is about. I think i have made a very interesting arguement. Please try to convince me other wise.\n\r\nThanks PT\n\n\r\nby the by......what Paul (or any artist) say a song is about in a book means little to me if the artist has something he would obviously like to hide.\n\n\r\nenjoy the music\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nFWIW\n\r\n\"Cold Turkey\" was released 24th October 1969, a year and two months after \"Hey Jude.\"\n\r\nYou enjoy the music too\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nsorry if i was mistake on the release date of cold turkey but it doesn't make my point any less strong.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\ni think this is one of the best beatles songs ever. so creative. esp. the ending part so awesome! \r\nits about paul cheering up julian\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nWHY DO PEOPLE THINK THAT PAUL IS TEACHING JULIAN HOW TO USE FUCKING HEROIN?! Seriously, what is wrong with you people? Paul made this song to cheer up Julian because of John's and Cynthia's divorce. Though the lyrics may sound like how to take heroin, USE YOUR FUCKING COMMON SENSE PEOPLE. Do you people actually  think John and Paul want him to do heroin?\n\r\nMy god. Some people just really deserve to be killed.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nGreat song, but how can the lyrics be meant for Julian who was only 5 years old in 1968. \"you were made to go out and get her....\"    \"take a sad song and make it better....\". He must have been a precocious 5 year old, far advanced for his tender years. Maybe it's about a grown up male pondering on whether to lose his virginity.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nPeople people people. Brother and sisters.......it was i different culture than.\n\r\nBut if it makes you happy to think the world is flat and that we all came from Adam and Eve that Literally God is blessing you and Santa will show up this year on time.....\n\n\r\nUnder your skin........let it in and let it out.....\n\r\nDrugs are terrible and we all know this N O W.....but in 1969  artist thought Cocaine was healthy. Both Hendrix and the Beatles and stones all made Coke references on songs and on album covers. Heroin was a touch more heavy but the majority of artist were using it.\n\r\nNOw as Paul would be the first to say; Love is the answer. Let's argue like we are trying at least.\n\r\npt\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nI saw 2 people say that John said F'in Hell in the song and I agree, but according to \"What Goes On\", a compilation of Beatles Anomalies... it was because John sang \"let her into your skin\" as opposed to \"under your skin\" which he was known for... and it's not about heroin.  Many of the drug-written songs were claimed as those, and this one was for Julian after John and Cynthia's divorce\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nGive us proof of the references and I'll go tell you what you thought is complete bollocks, pt.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nThe Rolling Stones? I respect those guys, but I just CAN'T love their songs. And please, The Beatles gave their song for The Rolling Stones and the Rolling Stones were extremely impressed because John and Paul wrote that song while The Rolling Stones are having a conversation. I always picture it like.. \"So Mick, what's-\"\n\r\n\"Boo, your song is finished.\" John said.\n\r\nAnyway, it's no use arguing with die-hard fans, because I don't think they'll listen to you.\n\r\nBut really, it was Mick Jagger who is following The Beatles, not the other way around.\n\r\nAnyway, both bands are friends, so why fight about it?\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nThat nananana comment is so stupid and (somehow) funny. But is sure causes me inconcevience to see those other comments.\n\r\nI'm so proud of this song! If I'm not mistaken, this was the first six-minute song to reach number 1 in the UK charts! That's why The beatles are so powerful. Producer George Martin said that it's wuite impossible fror this song to be popular because it's too long. But my hero John said that it will be popular if it's by The Beatles!!! Yay!\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nIf the lyric was, in fact, let it in and let it out, perhaps the heroin thing would make a bit more since. But it's let it out and let it in. If they were talking about using a needle, I don't think they would've reversed it. The lyric instead could be encouraging Julian (and everybody else the song was supposed to relate to) to try and love, and be loved. \"Let out your love, and let it her love.\" Eh... that sounds a bit far-fetched, but I like it more than the drugs thing personally.\n\r\nAnd as far as \"remember to let her under your skin,\" well, come on, \"under your skin\" is a common phrase. The more usual way of putting it would be \"don't let her get under your skin\" of course, but I think Paul was just being original and changing the meaning of the saying a little. He's telling Jude (Julian) that he shouldn't ignore his feelings and build a wall around himself, but that he should try to accept it.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nJ Black i follow, good stuff.....i just don't agree.\n\n\r\njaimetoi  great point. 'Jude was 5 when the song was written'.\n\r\nOver all people some very interesting thoughts. Thanks for the interesting comments\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\ni think this song is overrated.. amazing.. but way overrated\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nThis song is excellent until the real lyrics stop.  Then it gets pretty bad.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nOh My God! You're probably right , yoach! about the \"fucking hell\" theory! Guys! Listen to Hey Jude at about 2.58!!! It so rocks!\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nIve not checked out the other 156 comments,so I may be repeating someone else...as stated,this is a Paul song written to comfort Julian Lennon during his fathers marriage break up.Its sad to think that although John could write stuff like \"beautiful boy\"(for Sean) it needed Paul to write a song for Julian!\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nWilson Bryan Key (the subliminal-advertising guy) had a big long thing on \"Hey Jude\" in one of his books where he basically reiterates the proposition that the song was about heroin.  I thought he was spouting bullshit then and I think he's spouting bullshit now.  Actually, what I heard was the song was really Paul talking directly to John (not Julian), counseling him not to be afraid to \"go out and get her\" - that is, Yoko Ono. (This would have been before all the tsouris caused by Ms. Ono's wanting to be something of a fifth Beatle.)\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nLol. First off, I don't know who the bloody hell Yoko Ono is aside from that she's John Lennon's wife. I like this song a lot and it is probably one of my favorite songs by the Beetles. I love them which is probably my boyfriend's fault because I used to hate them. I didn't used to have a respect for oldies. Boy, was I ever stupid. Anyway, I definitely see how this could be about Julian accepting Yoko as his new stepmother. It's such a great song! Makes me think of myself and how I felt when I got a stepfather.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nI love this song...\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\ntheres a mistake in this song where is it? wrong chord on piano?\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nI heard this is about heroin, but im not gonna say thats what it's about. If it's not, we all must seem pretty low when really Paul was writing for a good cause. regardless, a beatles gem.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\ni always saw this song as the narrator knowing somebody whos depressed and feels hopeless and saying 'its going to be alright, you can make it better'\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nI don't think the song has anything to do with drugs or heroin.. but I think it appears there sort of as a subverted metaphor for being optimistic.\n\r\nThe song is so fantastically genuine. Though I do agree the \"movement\" line is kind of cheesy, I think Lennon only liked it because... well... I'm sure you can surmise why. Which makes it ironic because the line doesn't feel as genuine, and yet that's what he was always after Paul to be. More genuine.\n\r\nA lot of Pauls \"cheesy\" ballads sound far more genuine than John's rock.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nmy fav quote:\r\nyou know that its a fool\r\nwho plays it cool\r\nby making his world a little colder\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nAnd anytime you feel the pain, hey Jude, refrain,\r\nDon't carry the world upon your shoulders\r\nFor well you know that it's a fool who plays it cool\r\nBy making his world a little colder\n\r\nThis is easily one of my favorite lines in any song. I can't imagine what it would be like to have someone write a song like this with me in mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI don't know if it actually was about John, but John DID think it was about him.  In the 1980 playboy interviews Lennon said, \" I always heard it as a song to me.\"  He basically said he thought it was Paul's way of telling him to go out and get her (Yoko) and leave him, even though Paul himself didn't want to lose John.\n\r\nJohn said, \" I know I'm sounding like one of those fans who reads things into to it, but you can hear it as a song to me.\"\n\r\nI guess even Beatles themselves can interpret/misinterpret other Beatles' songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\ni agreee with centralboi83!!!\r\nthat is the best part of the song i love it\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI love this song -- especially the 7 minute version.\r\nIt's like in Mulin Rouge when they say they'll make a song that whenever they sing it they'll know that they love each other, or whatever the exact quote is. I think that's what this hits. The Na-na's at the end is like that song. If you sing it, it'll give you hope. Everybody knows that part of the song, and The Beatles repeat it enough that the whole world could recognize it.\n\r\nBeautiful and genius. I love this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nPaul wrote this for John's son Julian and changed the name to Jude\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nI thought, when I first heard it and every time since...until I read abt it actually being abt John's son (which I believe and am not trying to despute) that this was about a boy who had the potential to really fall in love with a girl, if he would only give it a chance and let her in. Like, let down his guard. But wow it has been so interesting to read abt all the other views on it. It does disappoint me, however, to think that these songs which have so intensely inspired me, are all about drugs. As such, I try not to come to such a conclusion. :)\n\r\n(In the way I saw it...\"Take a sad song\" referred to the boy being lonely and afraid to let the girl affect him, because he was too afraid of getting hurt by her. But love is about the risks and Paul was trying to say that it's worth it. And even though this was before I knew the true meaning, I wanted to put it up here to see if anyone thought it even made sense, b/c no one I talk to cares abt the meaning of Beatles songs lol...which, btw, I LOVE THEM!!!! oh, and I am in love with Paul McCartney.)\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nOh, and I love the line \"For well you know that it's a fool who plays it cool by making his world a little colder.\" omg!! I have been so baffled and blown away by the genius of Paul's lyrics (along with John's and other beatles'...but I must admit Paul is my favorite)!! I've been trying to think of how one can come up with such clever turns of phrases that work and make sense! And I am continually amazed at how Paul could write this and have it work with the rhythm when he's rhyming in the middle of the next line rather than the end...it reminds me of the style of Edgar Allen Poe in The Raven. This song just moves me. I love love love it. Oh and the seven minute version is the bessssst bc this song is too wonderful to end EVER! i seriously will repeat it on my ipod over and over, even with it being so long! Okay and that is all. I will stop imposing my ridiculous thoughts upon cyberspace :P\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nhahaha\r\nsome of your guys' theories are so funny\r\ni mean, i see how you could maybe get that the song was about heroin or devil worship (?!)\r\nbut paul himself has said on record what the song is about and that it is for john's son julian after john's divorce\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\n\"When John and Cynthia split up I felt particulary sorry for Julian. ... I thought, as a friend of the family, I would motor out to their home and tell them that everything was all right: to try and cheer them up. I had about an hour's drive. I woud always turn the radio off and try to make up songs. ... I started singing, 'Hey Jools ... don't meake it bad, take a sad song and make it better. ... It was optimistic, a hopeful message for Julian:'Come on, man, your parents got divorced. I know you're not happy, but you'll be okay.' I eventually changed 'jools' to 'Jude'.\" Paul said this about this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\ni love this song. C:\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nThis song means so much after it reaches the point of just random segmented ooos, yeahs and judes\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nThis is just a song. It can be understood many different ways. In my opinion this song may be about heroin. All the words fit. It seems to me like a junkie is going through withdrawl.\n\r\nhey jude, Don't make it bad.. aka don't let withdrawl start.\n\r\nTake a sad song and make it better... inspiration from the drug.\n\r\nRemember to let her into your heart and then you can start to make it better... Life seems better when your high, when heroin is injected it goes through the vein and passes through your heart on the way to your brain.\n\r\nDont be afraid to meet dealers, go out and get her(heroin is offen referred to as her).\n\r\nLet her under your skin about the needle.\r\nand then begin to make it better,\r\nInstant bliss is felt seconds after injection... also stops withdrawl.\n\r\nAnytime you feel the pain... Of withdrawl\r\nHey jude refrain... Shoot up\r\nDon't carry the world on you shoulders.. Apathy from heroin.\n\r\nFor well you know that it's a fool who plays it cool\r\nBy making his world a little colder.. People who are physically addicted to the drug and act like they can just stop make there lifes miserable and \"colder\"\n\r\nJust my opinion. \r\nP.S.  lots of artists have written songs about things they havent done...\r\nThere just lyrics..\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nThe song was written for Julian. There is no doubt about that. John, and Paul went on record about it. There were people out there that tried to see some underlying meaning to a number of their songs.\r\nBelieve it that sometimes there was no underlying thoughts. \r\nA duck is just a duck - nothing more.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nI love this song :]\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nI guess I agree with HeyJude91... I always just thought it was a guy who had to be given a nudge to go after this girl he liked, but whatever...\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nGood song, one of the only Beatles songs I like lol\n\r\nExcept that when they say \"Hey Jude, don't be afraid\r\nYou were made to go out and get\" I always think they're gonna say \"laid\" lol.  I don't know why, but I do.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\ni forgot to write divorce.\n\r\ndurring his father (john lennon) and mother (cynthia lennon's) DIVORCE\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nThis always reminds me of the Dark Tower Srries...haha! \n\r\nHey Jude, I see you lad....\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nOne of my all time favorites.  I believe there's meaning on a number of levels here.\n\r\nThe song begins with Paul directly addressing John's son Julian, offering consolation in the aftermath of his parents' separating: 'remember to let her into your heart' as if to say yer mum's there for you, don't shut her out.\n\r\nAfter that it gets less specific to Jules and more abstract, while seeming to address John himself.  'you were made to go out and get her (yoko)'...'fool who plays it cool by making his world a little colder' these definitely evoke Lennon.\n\r\nBut then he sings 'you're waiting for someone to perform with' and then it becomes blatant.  'don't you know that it's just you, you'll do', you're gonna be okay, you'll be a success on your own.\n\r\nBut on another level, this second address also goes out to Paul himself, who as John's counterpart in the Beatles faced a similar predicament as the group was breaking up, and perhaps at the time was also thinking about hooking up with Linda.\n\n\r\nOn another level, the meaning of the words hardly matters, it's the overall sound of the music, the melody, chord progression, instrumentation, the vocal delivery...it's a song of consolation, and encouragement and of joy of music itself and the uplifting power of music.  The effect of the song, and particularly the Beatles' recording of it, transcends language, I think.\n\r\nWhat I find particular cool is that the song begins with something very specific, he's singing to a little kid, a lone voice a capella starts..'Hey...' followed by plain piano chords, then some tentative tambourine notes, a heartily strummed acoustic guitar, gradually the band and more reassuring voices join in, John singing harmony with Paul, it becomes really festive, then calamity breaks loose with the double orchestra and the na na na na's....so the song begins as a direct, personal sentiment to a kid, with Paul as a sort of avuncular voice, and then gradually progresses toward a sentiment that is massive and universal, and with every beat the music wonderfully echoes this progression.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nI think everybody understands the meaning of this song by now--I hereby declare it casual conversation time. I'll leave you a topic to discuss: Comments that look like they were written by a very dirty-mouthed third grader. Begin!\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nSaint Jude:\n\nstraightdope.com/classics/…\n\nen.wikipedia.org/wiki/…\n\r\nCalled the Forgotten Saint, the parton saint of hopeless causes, and sometimes confused with Judas Iscariot, the betrayer of Jesus. \n\r\nJust another possible angle to the song!\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\ngod do i love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nits about divorce.\r\nand accepting a new mom.\r\nduh.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nhahah allie, we just talked about this yesterday.\r\n(today... ?)\n\r\nduh.\r\n[:\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nYou guys already nailed the song, just wanted to say how happy it makes me. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\ni love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nthis song to me is about how this boy is afraid to ket her into his heart.and he can either make it worse  or better.take a sad song and make it better, interprets that you can make this relationship better.\r\nson't give up.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nyea, after john and cynthia broke up, paul was the only beatle to go to visit cyn and julian... and on his way to see them, he wrote this song for julian.. who was obviously going through a rough time when his parents broke up. \n\r\nI never really liked Paul that much... until i heard about that, I have so much respect for paul after that.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nthis is what the song means. it just talking about people who pretend to be cool and hide who they truely are. and that is bad because they will never recieve love -at least genuine love.  you have to be who you are. hence \"you know its a fool who plays it cool by making his world a little colder.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\njust look at the most poetic and powerful line then you can frame the whole song from that.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nThis is one of Pauls most beautiful songs. For me its directed at all hetrosexual males. When a man falls in love he is uncertain whether or not to truly throw himself into the relationship because he is afraid he will get hurt. Hear Paul writes a soothing song for the male psyche telling men to go for it and it will all be alright. That is true compassion and true genius on the part of Paul. I like the line \"the movement you need is on your shoulder.\" To me this suggests that you must look to your past to help you with your future. Or it could suggest you always have to keep moving forward, never stand still.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nwell im shocked no one really talked about drugs. and im sure the beatles could have possible written the song for julian. But they also said lucy in the sky for diamonds wasnt about lsd. This song could easily mean both ways the song could be interpreted. drugs are making them feel better, they had so much pressure back then \"And anytime you feel the pain, hey Jude, refrain,\r\nDon't carry the world upon your shoulders\"! they were taking stress of my taking lsd and marijuana and they also tried to achieve inner peace. im not knocking any ones juian theory but for the people who dont want to believe it its true the beatles were drug users. PS: I LOVE THIS SONG AND THE BEATLES GREATEST GIFTED MUSICIANS OF ALL TIME AND EVEN BETTER PEOPLE. and in the end all were saying is give peace a chance.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nI love this song.  It just makes me happy.  =)\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nThis song was written for Julian Lennon to cheer him up after John and Cynthia Lennon got divorced, or at least that's what I've heard. All in all, it's a great song with heartfelt lyrics and a catchy tune.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nCan anyone comment on the image associated to this song?  The four of them outside a church, but it appears above them is a picture of them also.   Curious about that picture above them.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nI love this song. The 'Across the Universe' version is amazing. I love it. There are obviously enough comments on what this song means so I thought I would just input my opinion...\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nJohn Lennon in an interview explained \n\r\nPLAYBOY: \"Let's go back to jogging your memory with songs. How about Paul's song 'Hey Jude'?\"\n\r\nLENNON: \"He said it was written about Julian. He knew I was splitting with Cyn and leaving Julian then. He was driving to see Julian to say hello. He had been like an uncle. And he came up with 'Hey Jude.' But I always heard it as a song to me. Now I'm sounding like one of those fans reading things into it... Think about it: Yoko had just come into the picture. He is saying. 'Hey, Jude'-- 'Hey, John.' Subconsciously, he was saying, 'Go ahead, leave me.' On a conscious level, he didn't want me to go ahead. The angel in him was saying, 'Bless you.' The devil in him didn't like it at all, because he didn't want to lose his partner.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nThe Beatles songs, My friend and i think, could mean anything you wanted them to...finding their real meaning kind of ruins mine. I Read their lyrics and see what they mean and than go to this website and see what other people think...unless its like the the heroine theory, If you really think a song like this could be about heroine than you obviously are not a true fan of the Beatles. lol. and also may believe in the Paul is dead theory, which is fun to see what they think is a clue. lol. same with the jew thing... people are trying way to hard to make up stuff like that! I mean why would you want to think a song like this is about heroine? I don't know about you but if that was true It would kind of ruin this song for me. but i completely believe that the Julian story is true and by far the best, and back to the lyrics could mean anything...Take any random Beatles song and try to see if it works into your life! Thats exactly what they did in Across The Universe. They used Hey Jude to cheer up Jude in the movie and get him to go back and make things right with his love...so see if you can make Beatles songs fit into your life...when your depressed, happy, in love...anything! Even if they mean the opposite thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\n3 minute version of this song!? It just wouldn't be the same!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nYeah, but then John thought the song was for him, and not for his son. Julian found out like 20 years later that tihis song was for him. Kinda cool, huh?\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nYoko Ono on desert Island Discs (UK) talked about beatles heroin use (smoking not injecting, she said). Lots of reference to heroin in the song, but who knows for sure. But please don't start spouting this rubbish that the beatles only did soft drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\ni'm not going to repeat what the song means since it has been mentioned like a million times already, but i LOVE this song so much. it just touches my soul...cheesy as that sounds...it really does.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nthis was for julian lennon. \r\nand i love the beatles. they did it best. \t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nsweetbeat, it doesn't sound so cheesy. \r\nbut if it does..same with me. it gives me the chills. and makes me want to cry.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nI think this is a really great song. It's not my favorite Beatles song, but it's still pretty good. I named my hamster Jude after this song, though. You see, we've got two dogs, Molly and Lucy. When we named them, we weren't thinking about the Beatles or anything. They were just cool names. Except then I realized that they were Beatles names, and so when I got my hamster, I listened to Hey Jude on the way there, and so then I named him Jude. And now my best friend always tells me to \"say hey to Jude for me\".\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nthis is the fucking best song ever.\n\r\nthe beatles will NEVER get old.\n\r\n& my father keeps telling me that john lennon thought this song was about *him*. that was probably already observed dozens of times, i'm just too lazy to go back and look through the comments.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nthis song is not about heroin!\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nThis song made it as an opener on my lyrics game show i start with my friends.  I don't think they understand the real purpose of the music and so i open up a new meaning by posing questions and giving them information!\n\r\nAside from that i really love this song! i'll make it short and sweet! the best verse in the whole song is-And anytime you feel the pain, hey Jude, refrain,\r\nDon't carry the world upon your shoulders\r\nFor well you know that it's a fool who plays it cool\r\nBy making his world a little colder!-\n\r\nyou can't wait for it to happen, not just love but anything! you need to go out and get it done!  without trying or playing the fool...\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\n this song shows how close the beatles actually were\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nwait let me restate that, if this song is to johns son then it shows how close the beatles were.\n\n\r\ni didn`t read the other comments i just skimmed through it\n\n\n\n", "comment_199": "\nyou did a very good job transcribing Paul's backing lyrics behind the na na na nana na na's\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nwhich album is this off??? if anyone knows could you please kindly reply to this message.\n\r\nthank you :)\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nMy mom also thinks the song is about someone who's shooting heroin, because of the \"let her under your skin\" part. Personally, I don't care who wrote it or why. To me, it's about when you're feeling like there's no hope and nobody can help you, just take a minute to see the bright side of things. You're not responsible for everything, so don't carry the world upon your shoulders. Shit happens and you have to carry on. The minute you'll let hope enter into your heart you'll start feeling better.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nI absolutely love this song, the Beatles are by far one of the GREATEST bands to have ever live! \r\nThis song, even when Paul Mccartney sings it by himself in his old age, is still amazing.\r\nHe really knows how to get the crowed involved.\r\nWish I could see him live!\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nApparently Paul McCartney wrote this for John Lennons son...... its awesome.....\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nthis sone is about heroin not for Julian. It is a hidden meaning..\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\n***HEY JUDE, DON'T MAKE IT BAD. TAKE A SAD SONG AND MAKE IT BETTER. REMEMBER, TO LET HER INTO YOUR HEART, THEN YOU CAN START TO MAKE IT BETTER. ***I LOVE THE BEATLES. THEY'RE MY ALL TIME FAVORITE BAND. I COULDN'T LIVE LIFE WITHOUT LISTENING TO THEM ON A DAILY BASIS! THEY'RE MY OTHER HALF!!!! LOL\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nIt all makes sense now. Always thought it had kind of a childrens song vibe going on.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nI like the song but the drawn out primal screaming of the outro is too much. It's almost embarrassing it's so redundant.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nI like the song but the drawn out primal screaming of the outro is too much. It's almost embarrassing it's so redundant.\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nI think he wrote it with Julian and John in mind and it applies to both of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nPaul McCartney wrote this as \"Hey Jules,\" a song meant to comfort John Lennon's 5-year-old son Julian as his parents were getting a divorce. The change to \"Jude\" was inspired by the character \"Jud\" in the musical Oklahoma!.\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nEveryone the meaning is very obvious.  I don't understand why so many people ignore the facts.  It is about a guy finding a girl that has changed his life.  Not neccesarily because of great attraction, but because of a great connection they have. The girl is distant at first, but the guy can't deny he has strong feelings. \n\r\nYou have found her now go and get her:  You've met her.  Possibly you might not have spoken much with her, but something caught your eye.  You saw something special.  You might not notice right away, but it bothers you in the back of your mind.  Once it hits you more, you'll realize.  You see how caring and nuturing this girl is.\n\r\nYou were made to go out and get her: Meaning you have some of the best qualities that would truly win over this girls heart.  The girl is the one you know is a soulmate of somekind, but the tension of being so alike makes a challenge. Therefore you got to work for her and never give up.\n\r\nAny time you feel the pain refrain:  There will be times when you are probably turned down by her because she is busy and you met her so randomly.  There are times when you probably won't get what you need. There are going to be times where you a really frustrated and want to throw all your anger on her.  You may be lonely and be spereated from her for long periods of time.  You can't be negative.\n\r\nDon't Carry the World Upon your Shoulders:  Be patient.  You may be in love, but this is going to take time.  You may feel like you have met your best friend ever, but theres only so much you can do about it.  Be smart.\n\r\nDon't be Afraid/Take a sad song and make it better:  This can be a common issue.  It is hard to not be afraid.  You are possibly facing unrequited love, but if you are too weak about it how could you ever make progress. \n\n\n\n", "comment_212": "\nI haven't read all about the meaning of this song but still sound good.\r\nA subject to meditation probably about life meaning but in a playing way.\n\r\nthe ingredients: some time is white... about  experience of voluptuousness to absolute.\r\nlife as a game because escaping routs probably. Up on as.\n\r\nAnd don't you know that it's just you, hey Jude, you'll do\n\n\n\n", "comment_213": "\nTo me it seems like Jude is someone who suffers from depression and anxiety, and lets these things get in the way of being with the person he loves. I think this song is trying to tell him that cutting things out of his life will not help him. Rather, the only way things can start to get better, is by letting this person into his heart (remember to let her into your heart / then you can start to make it better). \nThe song seems to me to serve as a general reminder to not let this person (Jude) dwell on their sadness (And anytime you feel the pain, hey Jude, refrain / Don't carry the world upon your shoulders).\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nFor me, too, this song is about someone who is struggling to take the leap towards a girl whom he has found interest in. He is afraid to make that step to tell her: he loves her. He is fear of her rejection. He perhaps thinks too much and concern of facing her. He has too little confidence. This someone in fact is myself. Thus this song touches me in this way.\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nFor me, too, this song is about someone who is struggling to take the leap towards a girl whom he has found interest in. He is afraid to make that step to tell her: he loves her. He is fear of her rejection. He perhaps thinks too much and concern of facing her. He has too little confidence. This someone in fact is myself. Thus this song touches me in this way.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nFor me, too, this song is about someone who is struggling to take the leap towards a girl whom he has found interest in. He is afraid to make that step to tell her: he loves her. He is fear of her rejection. He perhaps thinks too much and concern of facing her. He has too little confidence. This someone in fact is myself. Thus this song touches me in this way.\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nThe song is about Julian Lennon and Paul's relationship with when Yoko came on the scene.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nJude = Julian Lennon, John's first son. At the time, Paul visited Cynthia when she was divorcing John. John was barely around to see Julian grow up, and his relationship was strained b/c of his own issues and Yoko. Paul wrote this song to Julian (originally titled Hey Jules) to make him feel better.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nThis is one of my favorites by the Beatles :D\nI can't help but sing along every time I listen to it, even if I do suck at singing. That's how good it is.\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nIf you want to \"Take a sad song and make it better\" , \"Don't carry the world upon your shoulders\" , Don't \"make your world a little colder\" , You must sing \"Nah nah nah nah nah nah\" and Scream \"Ma ma ma ma ...\" !\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nBefore I knew this song was about John Lennon's son, I interpreted 'Jude' as being female, as 'Jude' is a unisex name. For me this song is about a woman who is coming to terms with her sexuality. The narrator of the song is the person who is telling Jude that to be truly happy she has to accept herself for who she is and not be afraid of what others think. There is a woman who Jude has fallen for and she doesn't know what she should do about her feelings, however, the narrator suggests that she goes out and gets her! After all, all you need is love.\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nMaybe this song is really about the cycle of heartbreak.\n\nJude's heart has been broken and he's so enwrapped in his loss that he's angry and continues to close his heart, which makes him a fool with colder world pushing everyone away. So he's gotta let his heart breaker piss him off and get under his skin before he can open up and let the one he was made to get from the beginning.\n\nProbably not at all. Just gotta look at it all from all sides.\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nNice, I Just Love It...â\u0099¥\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nGuess I got it wrong...always thought Jude was a substitute drug reference. \"Go out and get her...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nThis is the lyrics to Can't Buy Me Love.. not Hey Jude\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nThe first main meaning to this song was to help Julian Lennon during his parents (John and Cynthia) during their divorce, since their son Julian was too young to really understand what was going on, Paul wrote a song about it to somewhat explained what happened to Julianâ\u0080\u0099s parents. the song was originally titled hey Jules, however he used the title â\u0080\u009chey Judeâ\u0080\u009d because he thought it was more catchy and sounded better\n\nJohn abandoned his five year old son and wife Cynthia when he started dating Yoko Ono. Paul McCarthy, knowing that it was difficult for johns son and ex-wife he came over to visit and on his way he wrote the song. He did change a few things, like from Jules to Jude, but most of the song remained the same.  \n\nThe next topic is one that is up for debate, many people consider there to be heroin references in this song, it was known that â\u0080\u009cJudasâ\u0080\u009d is slang for heroin, and it was speculated by some people that â\u0080\u009cJudeâ\u0080\u009d was commonly used as well, with the lyrics \"Remember to let her into your heart, / Then you can start to make it betterâ\u0080¦ / The minute you let her under your skin, / Then you begin to make it better.\" many people believed this was a reference to shooting Heroin, however that was never widely recognized The song is mostly slow and sad. Which one might expect, being about a child whose parents are divorced and heroin. These elements make the song have the dark, mellow, yet smooth tone.\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\n\"Remember \nto let her into your heart\nthen you can start\nto make it\nbetter\"\n\n~ ~ ~\n\nYou can't truly improve your life or yourself until you can love.\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nI've always loved Hey Jude, like everybody, but today i was listening to it and it suddenly hit me. I was enlightened!!! Thank The Lord for leading me to his light and the truth. I knew the truth, the true meaning of this song. This song is about rape! Here are some of the lyrics to proof it:\n\r\n\"Hey Jude, don't be afraid.\r\nYou were made to go out and get her.\r\nThe minute you let her under your skin.\r\nThen you begin to make it better.\"\r\nHe is urging him to go out and \"get her\" at any cost and tellin him he was made for that (classic male rape mentality, women were made to be fucked) and assuring him that if he let her under his skin then it's gonna be better, meaning she will love him eventually, like not taking \"no\" for answer will make that a \"yes\" in the end. Classic.\n\r\n\"For well you know that it's a fool who plays it cool,\r\nBy making his world a little colder\"\r\nHere he's telling him that playing it cool and playing the game is not beneficial because it will make his world cold meaning dull and that getting the girl without all that, without her approval and consent aka rape, is what's gonna make his world exciting.\n\r\n\"Hey Jude, don't let me down\r\nYou have found her, now go and get her\r\nRemember to let her into your heart\r\nThen you can start to make it better\"\r\nSame as the lyrics above with different words.\n\r\n\"So let it out and let it in, hey Jude, begin.\r\nYou're waiting for someone to perform with.\r\nAnd don't you know that it's just you, hey Jude, you'll do.\r\nThe movement you need is on your shoulder\"\r\nThis is where it's clear. It's so obvious!!! \"Let it out and let it in\"? Seriously? Can you make it more clear? More sexual? Huh, Paul McRapey?\r\nAnd the fact that he basically said \"don't wait for anyone to preform. You need to go and get it and it's all just you and you're the one who needs to do it\"???!! What the actual fuck? He's telling him to ignore the girl's feelings and just do it and do it all himself and that's okay?\n\r\nWhat the actual fuck? Wake up, sheeple! You knew the truth now! There's no excuse for it to continue listening to it and keep it in the legendary and best of songs status!! This is the truth! The Beatles had a lot of hidden evil meanings in their songs and soon people, smart people who are enlightened, will get those meanings and share them with the rest of the blind sheeple. And remember this was written in the late 60s when the freaky sexual culture awoke and began to spread the idea of \"free love\" and all that crap which men created just to get girls get their panties off and have \"free sex\" but they can't say that! They need to hide it into something beautiful like \"free love\" or this ugly and disgusting song. And \"nah nah nah\"? You know what i say to that? Fuck yeah it's nah nah nah for rape!!! Please say and do the same by sharing it with your loved ones so they don't have rape installed in their unconscious by listening to this ugly song. Thank The Lord for all of this. I'm just The Lord's vessel.\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nOne of McCartney's best songs\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nHeroin is a type of addiction. A heavy one. I don't know if this song is about heroin, but I do think is about addiction. Addition towards \"her\". My guess is that the song promotes it. Self indulgence? A trap (a sweet and brilliant one) for others? A mixture? \n\nThanks for all your interesting and suggesting contributions. And thanks to the Beatles for the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nit was written during John pennons divorce to his first wife Cynthia ,John neglected Julian focusing more on the band and other things than his son, Paul was sympathetic towards Julian and was a father figure to him more than John was, Paul wrote this song for Julian entitled hey Jules but thought it sounded better as jude. John once commented on the song that it was one of the best songs McCartney had ever written .\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nit was written during John lennons divorce to his first wife Cynthia ,John neglected Julian focusing more on the band and other things than his son, Paul was sympathetic towards Julian and was a father figure to him more than John was, Paul wrote this song for Julian entitled hey Jules but thought it sounded better as jude. John once commented on the song that it was one of the best songs McCartney had ever written .\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nYes Paul started the song for Julian Lennon. Paul then Changed it to a song for John. He wanted John to be happy, so Paul encouraged John to let Yoko into his heart or under his skin. Listen to the song and think of it as a message to John to go for it in his relationship with Yoko. Prior to this only Auntie Mimi and Paul, had ever made it through John's armor.\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nJules ? Jude ? How About June ? Paul Birthday at June ....\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nI'm pretty sure this song is about his son or the son of John who is sad about a breakup with the one he loves but maybe she's kinda narcissistic so she play with him \t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nI don't think that this bears any relation to the song, \"Hey Jude,\" but it's sort of interesting to note that the meaning of Jude is \"he who is praised\". Jude, or Saint Jude, was said to be one of the Twelve Apostles. Saint Jude is known as The Patron Saint of Hopeless Causesâ\u0080\u0094which it's not a strain to make a relation to Jude in the song. That said, everybody's saying it's about Julian. I don't really understand the relation, but hey... nah nah nahhh it's all good. Plus why the last minute change.\n\nI have to say too that the line, \"the movement you need is on your shoulders\" is absolutely brilliant following the impossible line to not carry the world upon your shoulders. Release the pressure and begin. Brilliant. Man, they were just incredible, each and all.\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nNot even Beatle fans have been able to explain what Paul is saying...just keep hearing about comforting Julian Lennon and what a great song. Music is good, yes, but could the lyrics be a joke on us? 'go out & get her,' 'let her under your skin,' her, her , her.'Movement'--yeah, John liked that line. Sorry, I'm drug free.\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nJohn wrote this song for Julian when he was getting married to Yoko Ono. He's telling Julian he needs to let her into his heart--\"Remember to let her into your heart, then you can start to make it better\". At least that's what they told us when we did a Beatles concert at school.\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nNope, definitely not. This song was about the divorce proceedings between John and Cynthia. Paul had always enjoyed a close relationship with Julian, then 5-y-o, and to show that he was supporting mother and child during the time, he drove down to Weybridge from his home in St John's wood bearing a single red rose. A lot of the driving time was spent mashing new lyrics together, and Paul started improvising \"Hey Julian... hey jules..., and finally Hey Jude\".\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\n\"It's definitely about Julian\" don't you think it's a little bit cocky to claim your interpretation is the official one? Authorial intent can often be taken farther because sometimes you write or dream something and you don't know what it means and different perceptions can enlighten you. I think pkjun fully backed up his opinion and both sides can be argued and there doesn't always have to be a right or wrong answer.\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nyou all are retarted Lennon is calling his son to accept satan.  Reffering to satan as \"she, her...\" the whole song.  Paul was, beleive it or not, very satanistic.  That song Halleluia toward the end he starts saying Hare Krishna who was a satan worshiper.  Read the lyrics keeping in mind that Paul is calling his son to accept the fallen angel.\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nwhen i heard this song i thought it was about Paul talking to his penis (jude) about preparing to have sex with a girl.  \"You have found her now go and get her, \r\nRemember (Hey Jude) to let her into your heart, \r\nThen you can start to make it better. \r\nSo let it out and let it in \"\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nBeatles song meaning book. Paul and Julian were always very close, even closer than John was to Julian. Paul was riding home one day, and started singing \"Hey Julian, don't be afriad\", then changed it to \"Hey Jules\" and finally, \"Hey Jude\"\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nGreat song. At about 2:58 into the song you hear John Lennon yell \"Fucking 'ell!\" after he apparently played the wrong chord. Kind of interesting.\n\r\nAnd anyone who says it's about heroin is wrong. Sorry.\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nEr... \"let out your love, and let IN her love.\"* is what I meant. It's kind of the whole \"And in the end, the love you take is equal to the love you make\" Paul later wrote. Sorry if my comment's confusing. :\\\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\n\"The movement you need is on your shoulder\" was John Lennon's advice to Julian with regard to his attitude toward Yoko Ono. His head or mind was literally on his shoulder, and all Julian had to do was let go of his head strong attitude toward Yoko Ono. \n\r\nHe didn't need to join any movement for social change, or carry any heavy load of anxiety over global issues (which was John's job at the time), he only had to budge his own determination to oppose Yoko Ono.\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nthis was written after john and cynthia divorced and john was about to marry yoko. it was to comfort julian as his father moved on from his mother.\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nI think you can say its about heroin...but i don't think so. I think its about someone who falls for a girl but is afraid to let her in because he is afraid of getting hurt. So, they are saying let down you guard and go for it....\"you found her now go out and get her\"Fear can make you a prisoner. Its about taking a risk...how do you know unless you try...\r\nLike all songs the meaning can be what you feel that it is to you.....\r\nPersonally I think its one of Pauls best and I love the song. Thats my take.\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nThis song is about shooting up heroin.\r\n'Hey Jude, don't make it bad, take a sad song and make it better, remember to let her into your heart' being high makes songs sound better as well as when you shoot up your blood carries the heroin and is pumped by the heart\r\n'Remember to let it under your skin, then you can begin to make it better' shooting up heroin\r\n'The movement you need is on your shoulder' reference to a syringe where the injector is above the shoulder of the syringe\r\n'So let it out and let it in, hey Jude begin, you're waiting for someone to perform with' when shooting up they draw out some blood into the syringe and then inject it - most junkies share a needle\r\n'Anytime you feel the pain, Hey Jude refrain'  getting high helps to escape the pain\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nWHERE IN GODS NAME DID YOU HEAR THAT THIS SONG WRITTEN FOR JULIAN LENNON BY PAUL MCARTNEY WAS WRITTEN BY JOHN. BEATLES FANS KNOW THIS IS A PAUL MCARTNEY TUNE JUST LISTEN TO THE STYLE,TOWARDS THE END JOHN AND PAUL HAD STATED TO GROW APART AND STARTED TO HAVE DFFERENT TASTE,JUST LISTEN TO \"GLASS ONION\"OR \"STRAWBERRY FIELDS FOREVER\"BOTH LENNON TUNES Edited by oofus on October 31 2004, at 06:29PM\n\n\n", "comment_251": "\nsounds to me as if he wrote it to johns son about liking a girl and being at an age were girls still have \"cooties\" hahaha but paul says to go and get her and it will make it better for the love sick young lad\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nI can't believe it. John Lennon is still releasing songs long after his death.\r\nApparently he was working on a song but never finished it and recently someone has released a very similar song.\r\nPaul McCartney, who has parts of the original song recognised it and is trying to sue the artist that released the copied song!\r\nYoko Ono is helping but is already trying to claim rights to the song!\nyoutube.com/…\n\n\n", "comment_253": "\nThis song yes Paul wrote it for Julius lennon. But in the other hand it has another meaning to it.\r\nBy the time they were rock stars abusing on sex, drugs and rock n roll.\r\nThis song is about drug addiction.\n\r\nJude refers to Heroin.\r\n\"Hey Jude, don't make it bad\"\r\nThe drug itself is bad.\r\n\"Take a sad song and make it better\"\r\nWhen you are a junkie breaking cold and you get a hit everything becomes better.\r\n\"Remember to let her into your heart\r\nThen you can start to make it better\"\r\nIf you let the drug get into you and be part of you in life you carry it in your heart.\n\r\n\"Hey Jude, don't be afraid\"\r\nMetaphor of the drug having a life on its own.\r\n'You were made to go out and get her\"\r\nThe drug was made so go and look for it, is on the streets.\r\n\"The minute you let her under your skin\"\r\nso i've heard the moment you pop a syringe in your vein it acts quick and the junkie begins to feel better. \"you let her under you skin. Syringe??\r\n\"Then you begin to make it better\"\r\nAfter the hit he feels better.\n\r\n\"And anytime you feel the pain, hey Jude, refrain\"\r\nWhen your a junkie and you cant hit yourself you begin to feel pain.\r\n\"Don't carry the world upon your shoulders\"\r\ndont carry the troubles of life on your back.\r\n\"For well you know that it's a fool who plays it cool\"\r\nevery junkie is a fool trying to play it cool to cope with society.\r\n\"By making his world a little colder\"\r\nrefers to cold, shallow , boring life.\r\nNah nah nah nah nah nah nah nah nah\n\r\n\"Hey Jude, don't let me down\"\r\ntelling the drug, dont let me down.\r\n\"You have found her, now go and get her\"\r\nYou found it on the streets go and get it!!!\r\n\"Remember to let her into your heart\r\nThen you can start to make it better\"\r\n\" dont forget to let her in. So you can feel better.\n\r\n\"So let it out and let it in, hey Jude, begin\"\r\nrefers to the syringe going in and out.\r\n\"You're waiting for someone to perform with\"\r\nsometimes you like doing it with someone else\r\nAnd don't you know that it's just you, hey Jude, you'll do\r\n\"The movement you need is on your shoulder\"\r\nC'mon to a kid your writting this verse... it means that the movement of the arm while sticking a syringe starts frm the shoulder.\r\nNah nah nah nah nah nah nah nah nah yeah\n\r\nHey Jude, don't make it bad\r\nTake a sad song and make it better\r\nRemember to let her under your skin\r\nThen you'll begin to make it\r\nBetter better better better better better, oh\n\r\nWhen you hear the outro of this song it doesn't have anything comforting for a kid at the time of his age.What showas is how crazy the beatles were already that anything the sang became famous. All that screaming and hyperness only comes frm drug abuse. Think of if. Rock stars at that age in america having everything becoming millionares. (Drug, Sex and Rock -N- Roll) at that time.\n\n\n\n", "comment_254": "\nwhoever this song is about is irrelevant, the best version of this song is by Wilson Pickett not the Beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nMay be it is written for a boy but without knowing the background, just for the wording of the lyric, it is a song about masturbation!\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nWRONG WRONG WRONG. You are all wrong. This has nothing to do with Julienne Leno or heroines.\n\nThis song is about the relationship between Judas and Jesus, whom Paul McCartney is suggesting was secretly a woman. Jesus (the woman) is trying to seduce Judas, but he is resistant (Remember to let her into your heart). McCartney is also suggesting that Jesus is a lousy singer and performs lousy songs like Amazing Grace (Take a sad song and make it better). He wants Judas to help Jesus sing better and perform less depressing songs. Jesus is also a metaphor for Ringo Starr.\t\t\t\t\n\t\t\t\t\n\n"}