{"comment_0": "\nlol i love this song. i live in a little town and its full of hicks.its exactly like my town. i cant believe no ones said anything baout this song! its great\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song really describes the town I grew up in. I love it because it's so true.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song is awesome! I don't come from a small town or anything, but I've lived in some pretty far off places, and I've got friends that live out in the \"boondocks\" as it is called. Well, from the city where I'm from it's the boondocks. Anyway, great song, very funny\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis is an awesome song to crank up in your car on a sunny summer day.... being from the hicks, I believe that a lot of people can relate to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nHELL.  YES.  Country Weekly readers voted thie #1 Crank Up Song for 2005, and I totally agree.  I crank it wayyyy up whenever i hear it.  Omg, I love it.  Especially the beer at amoco part ahahaha.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI love listening to this really loud. It puts you in a good mood.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni love this song. me and my friend sing it everytime it comes on! i grew up in a small town,but all these people came in and made it bigger. makes me mad! but,this song is amaziingg.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nbest song to drive around a lil town and crank up =]\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis is one of those songs that you have to be careful playing while driving because the rocking tune might cause you to speed! So many towns are referred with the humerous and odd lyrics, which is why it can be proven that this song is very respected by a lot of people who live out in the subhurbs or the country. Crank it loud!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthis song is like around where i live imma lil country girl i love goin to foot ball games, untin and muddin lol\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nObviously it's about living in a town full of hick, and it talks about what goes on in it, It's exactly like my townn.\t\t\t\t\n\t\t\t\t\n\n"}