{"comment_0": "\nI think it's not about the religion or the decay of our \"godless\" civilization. I think it's about searching for knowledge in different places at different times. It's also about media & popular culture.\nWhile there was time when people went to Memphis to aquire some experience (a place where blues musicians made music so great that it seemed they were selling their souls to the devil), but the protaginist chooses Geneva to be the place he can learn something important.\nThe protagonist is the present-day missionnaire / a present-day blues musician (in my opinion, 'blues' is here synonymous to 'knowledge'): he will preach & \"teach it to you\". There is always a cost of any knowledge: either it is small pox & flu, or a bullet in Lorraine motel, or death under unknown circumstances.\nThere is also kind of knowledge, which is useless and does no harm (a teenage icon Miley Cirus aka Hannah Montana swimming in her pool). The connection between all these pieces is that all of them represent the culture in a certain period of time and people's obsession by it (by accepting it, learning it, teaching it, etc.). Still, it's quite unstable: \"I can't remember anything at all\". Might be, there is just one thing that really matters and stays: the protagonist's realtionship with another human being (\"you are the best girl I've ever had\").\n\nOn the second thought, these checkpoints on the protagonist's memory lane might be just alternative Universes (whose existence might be proven in Geneva some day) :)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe reference to Robert Johnson is much deeper. The legend is that he sold his soul to the devil and got guitar skills for it instead. However:\n'He got the real killer groove\nRobert Johnson and the devil, man\nDon't know who is gonna rip off who'\nJohnson is so skilled that he can beat the devil. Like people that found the god particle and could (once) surpass god.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIt seems he's making a parallel between the story of Robert Johnson (blues musician who purportedly \"sold his soul to the devil\" in exchange for guitar skills) and our discovery of the Higgs Boson particle. This \"don't know who is gonna rip off who\" part is the real issue -- did we compromise anything in order to make this discovery, and what impact will it have on our world? Will it help us as a society or will it lead us down a path of further environmental destruction?\n\r\nThe \"Higgs Boson Blues\" seems to suggest that the future holds little direction or meaning. The discovery of the Higgs Boson completed the Standard Model of particle physics, so where do we go from here?\n\r\nThe only thing we can be certain of is our impending mortality, and it can come with little warning to anyone, no matter their moral standing. He paints a picture of the assassination of Martin Luther King at the Lorraine Motel in Memphis as a jarring example of this.\n\r\nIn the great uncertainty that follows death, material requests like \"bury me in my favorite yellow patent leather shoes\" seem trivial. Our society's superficial fixation on celebrities like Miley Cyrus seem especially banal in the wake of this.\n\r\nThe line \"look here comes the missionary with his smallpox and flu\" describes a double edged sword. We are always searching for ways to better our society, but it comes at a cost.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI'm pretty sure all of that business about the Lorraine Motel is regarding the assassination of MLK. He was shot as he was standing on the balcony off room 306. The motel is now the National Civil Rights Museum. The man preaching in a language that's completely new is MLK. \n\nI get a strong sense of existential dread from this song. The whole idea of sitting in a \"basement patio\" (What is that, exactly? Probably just a dark, sad basement.) while girls walk by outside with roses in bloom. It implies to me that all of these things: the Higgs Boson, Miley Cyrus and celebrity culture, the deaths of our revolutionaries, the legends that we surround ourselves with, are weighing him down. \n\nI think this is one of the \"biggest\" songs Nick has ever written. It's arguably the best song of 2013.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis is what a \"blues\" should sound nowadays. Nick has talked about this one as the depiction of the general decay and confusion ruling our reality nowadays (referring also to Hannah Montana, which is the only discording note, she's there to contrast with naivety and unaware calm all the chaos around). Of course the decay is especially spiritual; I believe that the Higgs Boson fits because its revelation in a way (in a very collateral, poetic way) denies the existence of a God. A world in which God is denied, all kind of stuff happen, some other stuff are justified by it (black babies dying, Marthin Luther shot dead, Robert Johnson dead with any given credit -- basically there's just Lucipher hanging around like it's nothing). There's also a sarcastic look at science, on the other side, when he goes like: \"here comes the missionary\" -- maybe a doctor without borders carrying vaccines and knownledge like everything is under control, and everything can be explained. But in a messed up world without any God, nothing can ever make sense and 2+2 always make a 5. So in the end, Cave suggests he's just accepting the way things roll and flow; we're in a mess, no matter what they discover in Geneva. He does this long journey thro the whole human chaos but ends up defied in his basement patio, just like Miley Cirus in a way. But at the end of the day who cares? Who cares what the future brings?\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nYou need to know a little about the Higgs Boson, and a little about Nick Cave to get this song. Nick is not a typical Christian, but he is a Christian, so the spiritual decay he sees is not some request to put prayer in schools, or for people to follow his religion or something, it is a deeper, existential crisis in modern society. The Higgs Boson is called the \"God particle\" because it is an attempt by physics to find the most elementary particle, the particle that is essentially at the bottom of everything. Now that they've found it, there is no fulfillment, nothing is better, and the spiritual crises is still there, God particle or no. It's an existential emptiness type thing. Lines like \"saving the savages with the Higgs Boson blues\" are easily explained by reading people like Christopher Hitchens writing about howt he Iraq war was a good idea to civilize people, and bring them our wonderful, perfect modern ways of life and views. The references to MIley Cyrus are obvious, she is a great poster child of our empty, fame-groping, celebrity obsessed pop culture.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\"Higgs Boson Blues\"\n-----\nHiggs Boson particle (aka God particle) is the very fundamental particle that explain many things. It has been discovered in CERN lab in Geneva. In these lyrics we can see it as a metaphor of the God. Blues is referring to the Blues music and at the same time to sadness. So I interpret the title as : The sad God.\nWhy he is sad? We'll see in the rest of the lyrics\n----\n\n\nCan't remember anything at all\nFlame trees line the streets\nCan't remember anything at all\nBut I'm driving my car down to Geneva\n-----\nDriving car to Geneva, where the God (Boson Particle) has been discovered.\nIn other words, he is searching for the God. I like to see god as being that has the answer to everything. Answer to all our needs and our question. An escape from the darkness. And he wants to find that God.\n-----\n\nI've been sitting in my basement patio\nAye, it was hot\nUp above, girls walk past, the roses all in bloom\nHave you ever heard about the Higgs Boson blues\nI'm goin' down to Geneva baby, gonna teach it to you\n------\nWe can see two side in this world. One is sad and dark one because you can see the beyond of the meaningless circle of life. And the other one is bright, and blooming. Belongs to the people in modern world who are enjoying their superficial life. \nThen he mentions the sad God. And he wants to teach it to the people that, meaninglessly, are living up above. We'll see his teaching in the reminder of the lyrics.\n---------\n\n\nWho cares, who cares what the future brings?\nBlack road long and I drove and drove\nI came upon a crossroad\nThe night was hot and black\nI see Robert Johnson,\nWith a ten dollar guitar strapped to his back,\nLookin' for a tune\n------\nHe, again,  mentions that the world is dark and he is seeking a meaning, a real light in this darkness by driving to Geneva (God's place).\nOn his way he sees Rober Johnson, which according to Eric Clapton was the most influential Blues guitarist. There's myth about Johnson says he sold his soul to the Lucifer in order to become a great blues musician. So here R. Johnson is going to meet Lucifer in order to make a deal with him.\n------\n\nWell here comes Lucifer,\nWith his canon law,\nAnd a hundred black babies runnin' from his genocidal jaw\nHe got the real killer groove\nRobert Johnson and the devil man\nDon't know who's gonna rip off who\n-------\nSo here's the confrontation of the Lucifer and Johnson. But in the Cave's version seems he is not going to sell his soul to the devil. And there's a fight between them. His miraculous music, for sure, is from something divine, from heaven. How it is possible to acquire this divine music from Lucifer?\n\nIt's noteworthy that Johnson died because he drunk a poisonous wine. Who poisoned the wine? A jealous husband whom Johnson flirted with his wife. We can see this matter also as a fight between him and Lucifer. Lucifer finally killed him with the help of a temptation and a jealous husband.\nâ\u0080\u0093----- \n\nDriving my car, flame trees on fire\nSitting and singin' the Higgs Boson blues,\nI'm tired, I'm lookin' for a spot to drop\nAll the clocks have stopped in Memphis now\nIn the Lorraine Motel, it's hot, it's hot\nThat's why they call it the Hot Spot\nI take a room with a view\n-------\nAgain, he sees the world as a dark hell. In many Biblical notes hell described as  a lake of dark fire.\nAnd he is driving, driving toward the place where they discovered the God. \nWhy the earth we live in is like a dark hell? Here he mentions one reason:\nIt was on this earth, in Lorraine Motel at Memphis, where Martin Luther King Jr. was killed. An innocent individual, warrior of the lightness, who was looking for freedom and equality bled to the death there. \n------\n\n\nHannah Montana does the African Savannah\nAs the simulated rainy season begins\nShe curses the queue at the Zulus\nAnd moves on to Amazonia\nAnd cries with the dolphins\nMama ate the pygmy\nThe pygmy ate the monkey\nThe monkey has a gift that he is sending back to you\nLook here comes the missionary\nWith his smallpox and flu\nHe's saving them savages\nWith his Higgs Boson Blues\nI'm driving my car down to Geneva\nI'm driving my car down to Geneva\n------\nHere we can see a comparison of that superficial meaningless modern world and the sad reality on other side of this planet. Hannah Montana might be the best symbol of the corporate-created superficial celebrity. She does African rain dance and the result a meaningless simulated rain. She cries for the dolphins. But they are fake as crocodile tears. This modern life, which she is a very symbol of, is the main reason of dolphins' death. \n\nHere, he focuses on how AIDS firstly created because of poverty of the poor people of the Africa. I think he regards himself as the missionary. A messionary that makes you sick. He opens you eyes to the dark sad truth. With his Higgs Boson Blues. With the sad reality he carries with himself. (Remember, I said God is the being that has the answers, that has the reality). \n\nSo we search for the God. Maybe he can save us from this dark hell of a world. But the reality is \"God Blues\" himself. He wasn't sad if he could offer a solution.\n-----\n\nOh let the damn day break\nThe rainy days always make me sad\nMiley Cyrus floats in a swimming pool in Toluca Lake\nAnd you're the best girl I've ever had\nCan't remember anything at all\n-------\nAnd again happy people up above are swimming in their pool. And they don't care about the sad part of the world. But who he sees the darkness, crimes, and inhumanity. And cares, belongs to the dark basement, Down here. \nLet's drive to Geneva. Who knows maybe we can find something maybe we can change something....\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nD'you know what, I haven't a clue.\nGlad to say that the Bad Seeds have yet to release a bad album, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThere are a lot of references to the 'God particle' (Higgs Boson) and death. Reminds me in some way to The Discovery Of Heaven, by the Dutch author Harry Mulisch. When one of the main characters discovers heaven, an angel sends a meteoroid to kill him.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nfor me its either about an experience of drug withdrawal or drug usage.\n\nGonna teach it to you --> withdrawal\n\nWho cares? Who cares what the future brings? --> usage\n\nin my opinion it's about someone who checks into a motel who writes down everything he is experiencing on his trip and stay there. i'm pretty sure it's drug related.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nSomeone below mentions that AIDS may have come from humans eating primates... there may be something to that. Missionaries came to the \"savages\" to teach them \"civilised\" ways, only to inadvertently spread smallpox and the flu etc, killing millions.\n\nAlso, with the reference to MLK and Robert Johnson, both of those men were brilliant/visionary, their greatest achievements also eventually turned against them.\n\nMaybe this is where the higgs boson reference comes in. The large hadron collider (the experiment used to discover the higgs boson) was rumoured in popular culture to risk creating a black hole and hence destroy the planet. So maybe he is using the \"higgs boson\" as a metaphore for how humans always seek new knowledge/artistic creation/growth and development of culture (thinking in new ways like MLK, creating amazing music like Robert Johnson, or bringing civilisation to the savages) but may be unaware of the potential catastrophic price we might pay either personally or as a culture for those things.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThat is new then, if you know anything about his career, you know at one time he did in fact, identify as a Christian...not a particularly traditional one of course.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nRepetition, looping conversation, and circular thought processes are all apparent in severe mental illness. This song speaks of the past and the character (spoken by Mr. Cave) rambles in these patterns.  \n\nMr Cave repeats \"driving down to Geneva\" among his ramblings which is similar to how Dementia/Alzheimer's patients communicate towards the end of life.\n\nIsolation and loneliness are also present in the song, as it is also common in widows/widowers and the late stage of old age.\n\nThe connection between Cyrus and Robert Johnson seems to be a comment on musicians and music and the vast differences between present and past. The devil met Robert Johnson at the crossroads and traded him his soul in exchange for talent for music. Miley Cyrus however has no need to sell her soul, she was given celebrity and wealth from birth. \n\"She curses the queue, and The Zulu\nAnd moves on to Amazonia\nAnd cries with the dolphins\"\nHer charity isn't sincere and she only seeks attention from her good deeds, according to the character. Ending up dead in a swimming pool in Toluca Lake, Mr. Cave remembers her fondly as the best girl he ever had. Either mixing his memories and fantasies together, or perhaps he has sympathy for her regardless. \n\nI visualize an ancient, feeble, tired man sitting alone in the his basement, talking to himself. Attempting to stave off lost memories by repeating phrases he spoke or heard. He tells himself the same story every day, eventually losing/forgetting parts or mixing different parts from other tales.  \n\nThe ending the song starts as it began - \"Can't remember anything at all\"\nHowever Mr Cave adds an important bit that is never repeated and seems to confirm mental illness in the character - \"Sitting here in my, basement patio\"\nThe last words we hear \"Driving my car, down to Geneva\", completing the loop and returning us to the beginning.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nIt's about rape &  murder. Nothing is said straight out but many things are implied, creating an unsettling & dangerous vibe.\n\nThe lyrics start and end with; \"Can't remember anything\". Something that is commonly said in police interrogations. Maybe the protagonist doesn't want to remember.\n\n\"Driving to Geneva\" Geneva is in Switzerland, which stayed neutral in WW2, there was no war there. \nSo ;\"Driving to somewhere peaceful, harmless..\n\nThe Lorraine Motel. \nA hotel where murder, violence happened. M.L.King was assasinated there.\n\n\"Girls walk past, roses in bloom.\"\nLust, desire.\n\n\"Who cares what the future brings?\"\n\nIndifference, coldness.\n\n\"Hanna Montana does the african savannah.\"\n\nHanna Montana = overtly sexually dressed teenage girl.\nWhat happens in the savannah? Predator, prey, killing, eating.\n\n\"Miley Cyrus floats in a swimming pool\"\nThe dead body, afterwards.\n\n\"You're the best girl I ever had\".. \n\nHiggs Boson, The God Particle, may have many meanings? Maybe the protagonist asks if there is god?. Or maybe even sees himself as god? I feel it implies a feeling of hopelesness, emptiness.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\n\"That's why they call it the Hot Spot\"\n\n\"The Hot Spot\", probably, refers to Java HotSpot Performance Engine as Java is now everywhere en.wikipedia.org/wiki/…\nAt least, that would make perfect sensein the context of the collider and the Higgs Boson\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI do believe the Lorainne Motel in Savannah is where Martin Luther King Jr. was shot and killed.\nThe Monkey could refer to the narrator himself, to drug addiction, or to a disease transmitted by eating monkey meat, as some have hypothesized bush meat to be the source of AIDS-\nJust my thoughts, could be full of beans......\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI am correcting my own comment below-\nas soon as I hit \"send\" I realized I had said the Lorraine Motel was in Savannah-\nNot so, it's in Memphis\nHannah Montana does the Savannah-\nShit, the world is teeming with monkeys and wildebeests!\nBetter shield yourselves-\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\n\"With the Higgs Boson Blues\r\n I'm driving my car down to Geneva\"\n\r\nGeneva (Switzerland) is the home of CERN   (The European Organization for Nuclear Research)    - the worlds largest particle physics laboratory where in March 2013 they confirmed the existence of the Higgs Boson Particle\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nPretty sure it's \"I see Robert Johnson with a 10-dollar guitar\nStrapped to his back looking for a tune\" not \"tomb.\"  That completes the devil at the crossroads narrative of the second verse.  Except Cave manages to subvert even that, by suggesting that Johnson might be so good he can actually beat the devil (\"Don't know who is gonna rip off who.\")  In the real story, we all know it was the devil who beat Johnson, who died young after being poisoned by a jealous husband.  So the notion that the outcome is unknown is provocative.  Maybe it suggests that art has the power to defeat chaos?  After all, Robert Johnson's story and style are still being evoked in contemporary music, which gives him a sort of power that transcends death.  So maybe he did win his bargain in a sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nHeh, this song is a incarnation of Alex Harvey... Just listen for example \"Hear a man preaching in a language that's completely new\" and \"a bellhop hops and bops\"  and you can hear Alex himself ! \n Correct me if I'm wrong, but I think that AH has been one of the biggest influences for Nick Caves music, but I haven't heard it this clearly in the earlier production.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI take the first paragraph as Nick writing from the perspective of a Higgs Boson:\n\n\"Can't remember anything at all\nFlame trees line the streets\"\n\n-- Boson created after a big bang, flame trees being a metaphor for the explosion of light\n\n\"But I'm driving my car down to Geneva\"\n\n-- The path the Boson takes after the initial explosion and heads off around the LHC, headed around the loop (\"road\") to Geneva\n\n\"I been sitting in my basement patio\"\n\n-- A nonsensical place; basements cant have patios. A metaphor for the concept of space pre-big bang which we can't comprehend.\n\n\"Gonna teach it to you\nWho cares? Who cares what the future brings?\"\n\n-- Alluding to the information/mystery CERN is aiming to solve.\t\t\t\t\n\t\t\t\t\n\n"}