{"comment_0": "\nI think this song is about some people in her life that are helping her getting famous in the music industry, maybe a producer or something like that. They are supposed to be helping her, walking her across a fragile line, trying to help her finding the right way in a tricky business but they are not quite right for her because they are rushing her and shushing her and so she refers to them as demons and the devil. They are begging her to open up her mouth as in rushing her to write another song but she needs them so it makes the words come out mechanically, she is in a way forcing herself to write a good song for them. She talks about how she sold her soul to a three-piece (a man wearing a suit) and he told her she was holy but he has got her down on both knees, she needs his help and would at this point do anything he tells her to do but she still knows that he is the devil who is just trying to hold her down. \nThis is what I get when i'm listening to this song, it just makes so much sense when you think about it like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nTW: RAPE (GRAPHIC)\n\ni believe this song to be about rape from a man.\n\n\"my demons are begging me to open up my mouth\ni need them, mechanically make the words come out\"\nhe's telling her to open her mouth to suck his cock, and that she needs to do this, because it's best for her.\n\n\"they fight me, vigorous and angry, watch them pounce\nignite me, licking up the flames they bring about\"\nwhen she rejects what the raper says, he forces it onto her. she's angry now because of him (\"ignite me\"), but it just turns him on, and forces it further.\n\n\"i sold my soul to a three-piece\nand he told me i was holy\nhe's got me down on both knees\"\nupon her first encounter with this guy, she thought he was nice because he had a very clean appearance. now it's all gone wrong.\n\n\"but it's the devil that's tryna\nhold me down, hold me down\nsneaking out the back door, make no sound\"\nhe's got her, and now he's not letting her go. the rapist is covering her mouth so no one hears her pleas for help. \n\n\"knock me out, knock me out\nsaying that i want more, this is what i live for\"\nnow he's trying to give her drugs, and attempting to convince her that this is what she wants. this is what she lives for.\n\n\"throw me in the deep end, watch me drown\"\nnot only does he find it humane to do this, he takes pleasure in it.\n\n\"selfish, taking what i want and call it mine\ni'm helpless, clinging to a little bit of spine\"\nshe's fallen into it now, and is starting to take pleasure in it as well. she's starting to take more dominance in the intercourse, but the rapist comes back even stronger.\n\n\"they rush me, telling me i'm running out of time\nthey shush me (sssh), walking me across a fragile line\"\nthe rapist has other things to do, and is fearing getting caught. she's getting loud now, and he's being even more assertive, controlling every action of hers.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThe song seems to be born of a sexual and religious experience. They could be the same experience or she could just be drawing a parallel. \n\n\"I sold my soul to a three-piece\nAnd he told me I was holy\nHe's got me down on both knees\nBut it's the devil that's tryna...\"\n\nShe wrote the song after flying over Las Vegas. In an interview, she said that she was contemplating how a place could allow for so many bad things, but they were accepted because what happens there stays there. It's a city made for vice- a bizarre concept.\t\t\t\t\n\t\t\t\t\n\n"}