{"comment_0": "\nI think this song is about being depressed and suicidal. \r\n\"You are surrounding all my surroundings. Twisting the kaleidoscope behind both of my eyes.\" that to be sounds like depression being all around you and effecting how you see things.\n\r\n\"I'm taking over my body. back in control, no more shotty. I bet a lot of me was lost \"T\"'s uncrossed and \"I\"'s undotted. I fought it a lot and it seems a lot like flesh is all I got.\" This to me sounds like he's taking control of himself again, he's fighting back. But when he was under, going through deep depression, a lot of him was lost. \n\r\n\"And now that I write and think about it and the story unfolds. You should take my life, you should take my soul\" I think that's depression's opinion coming back, with some suicidal thoughts.\n\r\n\"Time is slowin' and it's rolling still, and the windowsill looks really nice, right? You think twice about your life, It probably happens at night, right?\" That's like a panic attack, and the windowsill part is implying jumping out of it and committing suicide. and it happens at night, because that's the typical time that you feel alone and hopeless and there's no one to stop you.\n\r\n\"Fight it, take the pain, ignite it. Tie a noose around your mind, loose enough to breath fine and tie it to a tree tell it, you belong to me, this ain't a noose, this is a leash and I have news for you, you must obey me!\" This part is about owning your depression.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI'm sure the guys in Twenty One Pilots would probably want their listeners to interpret the lyrics personally, so I'll just say that WHAT I THINK personally (for me) is that they're talking about holding onto FAITH to overcome personal (flesh-based) problems - in this case, suicidal/depression-type thoughts. He's saying flesh is all he's got, and he can't trust himself, so he's going to try to control his mind (put a leash on it) and just give it over to God - telling God to take his life, take his soul - and let God surround him. And he's also talking to other people who struggle with the same problems (\"at night, right?\"), telling them to also entertain faith. BUT he's making it clear that people shouldn't just follow these lyrics - he doesn't mean it that way - he's saying people should think for themselves - because God gifted us with the power of thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI agree that it's about coming out of depression, but there is more to it than that. It's about the person/ people or things that you hold on to in order to get out of the depression. I have been depressed for a little more than a year now and I despretly cling to anything that makes me happy. It makes me look kind of obsessive but, I love orange (the color) so almost every thing I own is orange, I'm absolutely in love with Fall Out Boy (the band) so I listen to every song they have everyday, I'm a very very loyal friend, there's alot. That's what this somg says to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think it has to do with coming out of depression. \n\"I'm taking over my body\nBack in control\" and \"And the windowsill looks really nice, right?\nYou think twice about your life\nIt probably happens at night, right?\" shows about how the person has gone through it and wants to get back in control.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI know quite a few people who go to church with these guys and most of their songs have Christian subtext; this one is about coming to Christ and dying to one's self (\"You should take my life, You should take my soul\") and holding onto Him through that transition (\"Holding on to you...\" and \"Entertain my faith\").\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nTo me the song's definitely about depression, and since I suffer from it it connects so well with me. \n\n\"Tie a noose around your mind\nLoose enough to breath fine and tie it\nTo a tree tell it,\nYou belong to me, this ain't a noose\nThis is a leash and I have news for you\nYou must obey me!\" \n- probably the most powerful part of the song. It shows that even though you live with depression you can overcome it and control it. I feel like he really has some issues because many of his songs are like this. I also like how he's calling out hip hop: \n\"Lean with it, rock with it\nWhen we gonna stop with it?\nLyrics that mean nothing\nWe were gifted with thought\n\nIs it time to move our feet\nTo an introspective beat\nIt ain't the speakers that bump hard\nIt's our hearts that make the beat\"\n\nbasically saying how in hiphop now all it's about is catchy beats and dance moves, relying more on the speakers than your own mind. We were gifted with thought, so we should use it to its fullest potential, not just to make a catchy song\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nAll the depression themes have been mentioned, why I agree, it is about someone trying to overcome depression, but is so evident that this song is about God. The whole chorus is about the Holy Spirit, \n\r\n\"You are surrounding all my surroundings\" \r\nGod is always with you. \r\n\"Sounding down the mountain range\r\nOf my left-side brain\"\r\nThe left side of the brain is said to be the 'logical' part, meaning that all of his logical thinking is sort of reliant on God. \r\n\"You are surrounding all my surroundings\r\nTwisting the kaleidoscope\r\nBehind both of my eyes\"\r\nGod is the one that shifts his views so he can see more than meets the eye. \r\n\"And I'll be holding onto you.\" \r\nCome on. \n\r\nThere's heaps of other little references in the verses as well\r\nAs well as sort of worshiping God, it's more than it. It's to inspires others to start thinking about their own, to use our knowledge to our advantage rather then leave it dormant. This song is fantastic in juxtaposition to \"Car radio\" as they both have similar morals.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI agree with the depression theory that most people have, but I want to add that the part where it says \"Tie a noose around your mind\r\nLoose enough to breath fine and tie it\r\nTo a tree tell it,\r\nYou belong to me, this ain't a noose\r\nThis is a leash and I have news for you\r\nYou must obey me!\" Is talking about how if your mind is the problem and you are having bad suicidal thoughts,  instead of cutting of your mind completely, or killing it,  you need to find a way to control your thoughts, or \"put a leash on your mind\" you need to control your thoughts instead of thinking that the only way to stop them is to kill yourself. \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ni think the song is about someone letting go of the fear of suicide and depression.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nYes, I definitely agree with the song being about depression and also the things that keep your head above water. It seems like he's angry at himself for being depressed but can't seem to shake that it keeps creeping back (as in the first verse). He wants nothing more than to overcome the feelings, but the emotional ups and downs are beyond his control. The \"I must'a forgot, you can't trust me. I'm moment-to-moment and close but don't show it. Before you know it I'm lost at sea,\" shows the struggles he cycles though as one minute he can be fine and the next moment snap back into his old ways/thoughts/patterns. His depression controls him (\"Twisting the kaleidoscope behind both of my eyes.\") And the only thing he can do is hold on to whatever his buoy is. I don't necessary believe it has to be religious, though. It could be friends, family, things such as music (as the person below me stated) or painting, or even the faith he has that the future will bring better times (\"Entertain my faith\"). I'd assume the last bit of the song pertains to his wish that people could express themselves more genuinely through the heart like he is himself. If people worldwide weren't so judgmental or cold, and more open to the idea that we're all human, I'm sure it would be easier for someone who needed help to find it and not feel so small and insignificant. I really enjoy this song because it shows me that twenty|one|pilots are really making an effort to make a song that people across the board can relate to, not a song about big booty hoes or \"getting paper\" because deep down everyone has hard emotions they have to deal with, no matter how hard they can cover it up externally.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI think it's kinda a breakup song. Wether it's a break up between him and another physical person or if it's faith or a concept (I speculate that he tries to make it relatable to both so that listeners can find their  own meaning in it), he goes from this more upbeat mood, saying that he's \"back in control, no more shotty\" he's done with that it is that he's left and feels free, but like any other guy, that sense of freedom is short-lived and he finds himself wanting it back, continuing to hold on, glorifing it in his mind like a kaleidoscope.\nHe then starts to realize what he's doin to himself and tries to teach himself to control his pain like a new pet owner might try to self-teach a dog (the reference of tying it to a tree and demanding obedience)\nThe rap I feel is him kinda breaking the fourth wall and saying \"see? This actually means something. I'm sick of all the meaningless music out there.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think its about saving himself and his fans, In the music video when it comes to the part \n\"Fight it, take the pain, ignite it\nTie a noose around your mind\nLoose enough to breath fine and tie it\nTo a tree tell it,\nYou belong to me, this ain't a noose\nThis is a leash and I have news for you\nYou must obey me!\"\n\nYou can see him instead of hanging himself he tries to save a bunch of people from falling and i think that symbolises that in his songs he's not trying to get people to get depressed, he's trying to save the one's that is depressed and about to die. And he wants everyone to understand that we have to get up and move on and stop feeling sorry for urselfs if we can fix it.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nIf you notice the beat is the same from Migraine. Migraine is a song by Twenty One Pilots about thoughts. And this song is referencing to coming out of those thoughts. \t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nWell, mental struggle theme is pretty visible in this one; I also agree with the God interpretation. But, I want to make a refrence to the music video.\nAsk yourself: why does depression usually occur? Due to the insufficiency of love. \nAnd here we are shown \"the oldest story in the universe\". \"It's not a ghost story, it's a... love story.\"\n\nI bet a lot of me was lost\n\"T\"'s uncrossed and \"I\"'s undotted\nI fought it a lot and it seems a lot\nLike flesh is all I got\"\nHe spent a lot of time thinking and struggling with his emtions, possibly going through a real depression, not quite aware of what's up.\n\n\"I must've forgot, you can't trust me,\nI'm open a moment and close when you show it,\nBefore you know it, I'm lost at sea,\"\nIt's a bit far-fetched, but I'll take a shot at it: he thought all he wanted was a relationship and considered himself comitted, but now he realises he tends to change moods and attitude towards his situation quite often - as if, he wouldn't be fully open with the girl, especially when he'd be shown how vulnerable she  makes him.\n\n\"And now that I write and think about it\nAnd the story unfolds\nYou should take my life\nYou should take my soul\"\nNevertheless, it comes to him now that the way it all makes him feel, he can't resist. Almost as if it was a set up from above - it's what's right, it's what she should do.\n\n\"You are surrounding all my surroundings\nSounding down the mountain range\nOf my left-side brain\nYou are surrounding all my surroundings\nTwisting the kaleidoscope\nBehind both of my eyes\"\nThis love is creeping up on him, curving the logic, changing his perception.\n\n\"Fight it, take the pain, ignite it\nTie a noose around your mind\nLoose enough to breath fine and tie it\nTo a tree tell it, you belong to me, this ain't a noose\nThis is a leash and I have news for you\nYou must obey me\"\nInstead of deliberating on an escape from all these overwhelming sensations, he decides to stand up; to immerse in pain in order to have enough of it and start taking some control. Also over his \"surroundings\" - to have a say in the way things look to him, not just giving up on what his mind and heart are offering. It could also be a follow up to the girl,a refusal to letting her do whatever she wants to him (even if she does it unconciously).\n\nEntertain my faith\nFor me that is a powerful line, specifically so that it is sung with more and more power and desperation in Tyler's voice. It might mean that, while he's waiting for her, he want her to show somehow that she cares or even only give a peek of how a future with her might look.\n\n\"Lean with it, rock with it\nWhen we gonna stop with it?\"\nDive in the feeling, go with the flow. Then a question, when they're going to stop with the whole subterfuge, dancing, playing and evading which can actually a question of when they're going to start (reveal their feelings). Throughout the video we can see people with skull-painted faces and that is the moment when Tyler is being transformed into one of them. My interpretation is this: the kind of love that makes you nearly lose your mind, changes you. At one point it \"kills you\" and that's why everyone around is, in this sense, \"dead\". \n\n\"Lyrics that mean nothing\nWe were gifted with thought\"\nThat's actually a tricky one. No matter whan he writes or says about the matter, it won't change anything. He can only think his way through it, how to make everything come to place and not get lost, not lose her. It could also indicate how we should think before we speak out a flood of useless and often \n(unintentionally) hurtful words.\n\n\"Is it time to move our feet\nTo an introspective beat\nIt ain't the speakers that bump hard\nIt's our hearts that make the beat\"\nI like how everybody there seems to be connected by all those strange forces that make them want to lose themselves in love. He asks, now for all of them, if it's time to start acting upon what their insides tell them, to express what's coming from themselves. He then makes a point - it's not the music that makes you want to be alive, it's you who puts the life into music.\n\n\"And I'll be holding on to you\"\nTo you, girl (the black ballerina), or God (he's pointing at the sky), or whatever this madness is and wherever it comes from.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nIt's a suicidal song. It means about what Tyler holds onto when he feels suicidal. Holding Onto YOU, you means the fans.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nSome people believe that this song is talking about the struggles of mental illnesses. Throughout the song the singer is talking about the constant fight within him with depression and other problems that he's struggling with. Specifically in the song, when he says \"you are surrounding all my surroundings\" he's talking about how it's constantly around him and constantly a struggle for him.\nUsing this song, the artist is trying to communicate with those that are dealing with the same struggles and appeal to their emotions. Several listeners enjoy this song because it talks about fighting the urge of suicide and finding something to hold on to. Not only is this song catchy, but it's also completely logical. It makes sense in the aspect of mental illnesses and gives hope to those struggling, making it popular and pathos-related.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI think the first verse is about regaining control of his life. He's saying that he gained the ability to truly be in the driver seat no longer allowing society to influence his thoughts. \nsecond paragraph\nIf you are a true independent thinker then the majority of people disregard what you say. If you dont follow societies guidlines on what your opinions should be you can be cast aside.\nthird paragraph\nI see it as a description of society, perhaps more specifically the media, being everywhere attempting to influence his thoughts.\nFourth\nDiscibing the power of reflection, \"You think twice about your life. It probably happens at night right.\" saying thats how you can gain control of your thoughts.\nFifth\nAt first this can be a struggle but if your able to loosen up on attempt to control you gain a type of freedom.\nthe ending\nHe wants to write songs about how we should use our minds more. Songs with a true message that connects to the heart. He feels that alot of songs dont have an important message and thats what he thinks he can contribute to the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nok, im guessing this song is about someone trying to overcome their depression because Fight it, take the pain, ignite it\r\nTie a noose around your mind\r\nLoose enough to breath fine and tie it\r\nTo a tree tell it,\r\nYou belong to me, this ain't a noose\r\nThis is a leash and I have news for you\r\nYou must obey me!\r\n their like trying to fight tht great depression\r\nand close to the end it says \"entertain my faith\"\r\nentertain mean with amusement trying to get his\r\nfaith to be happy because he/she is under great depression\r\nsrry for writing so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nIn my opinion this song is definitely about someone trying to overcome depression. I've used to suffer from depression and this song shows exactly how I felt.  With depression it seems like darkness controls you, rather than yourself. You're not strong enough to hold yourself. When he says \" I must have forgot, you can't trust me,\" it shows how  little confidence you have in yourself. You feel like you can't do anything right and nobody likes you. You begin to hate your life so much that you feel life dying just to get out of the suffering. But there's always one thing that takes the pain away. For some people it's a person holding them up, keeping them a float. For me that thing was music. It's all that made me happy during that point of my life. It's whatever helps you overcome it.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nTo me, and I'm fairly certain i'm correct, this song is about control. Control over your thoughts, fears, and most importantly your flesh (see \"flesh out the door\"). He is also calling upon God to allay his fears and to give him something to hold on to. (proof of this is in his other album with a christian band, link here five14church.com/band/…, check out the song dead come alive). Also the rest of his songs have christian themes, such as \"Implicit demand for proof, the god he is talking to in Addict with a Pen, and most importantly Screen. He is also telling us that we need to think for ourselves and not let music completely control what we think.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ncan anyone explain what exactly is \"T\"'s and \"I\"'s??\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI agree with the early comments about this being about depression and attempts to reconcile with God. Proof that this isn't too outlandish to say is Tyler Joseph's (lead singer) unofficial album titled \"No Phun Intended.\" There are five tracks on the album and almost all of them make direct references to God with words like \"Lord\" and \"Jesus.\" I highly recommend listening to his album.\n\nyoutube.com/…\n\n\n", "comment_22": "\nI believe that this song is about Tyler Joseph's journey out of depression through his relationship with God. \"I must've forgot, you cant trust me...You should take my life, You should take my soul.\" These lyrics mean that he can't trust his own mind to control his life, so he gives himself over to God. \nAlso the chorus \"You are surrounding all my surroundings. Sounding down the mountain range of my left side brain. You are surrounding all my surroundings, Twisting the kaleidoscope behind both of my eyes. And I'll be holding onto you\" means that he is surrounding himself with God, and the phrase \"sounding down\" can also mean \"a way of communicating faith\" and the left side of the brain is the logic and reasoning side, so his faith in God is even being communicated to his logical tendencies and overcoming any doubt in his mind caused by reasoning. The kaleidoscope part of those lyrics means that God is changing his perspective on the world the way a kaleidoscope changes your view of things when it's twisted. Also, a kaleidoscope only works if you are looking into the light, and God is that light he is looking to for salvation and guidance out of the dark place he was in.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nIt's about a struggle against a mind filled with depression and sin, and the turning over of his life to Christ, because he realizes that a life with God is better than the hand he's been dealt. God is the one surrounding his surroundings, and twisting the kaleidoscope behind his eyes (aka making his brain and thought process change as he turns his life over). The verses after the first chorus are basically saying to anyone struggling with their sinful thoughts that they need to \"remember the moment they know exactly where they're going\" and remember the direction God is taking your life because the next moment you could be overwhelmed with the enemy's negativity. But he say fight, tie a leash to it, control it- take over the negative thoughts and tell them, \"you belong to me. I'm in charge here.\" In the bridge, he implies that media and music these days is a big reason for everyone holding themselves to high standards and as a result plunging into depressing and suicidal thoughts (when we gonna stop with it?/Lyrics that mean nothing,/We were gifted [by God] with thought). He simply wants people to think for themselves rather than letting society feed you lies about life and morality, because those lies will only lead your life down a path of destruction. And finally, Tyler ends the song with \"And I'll be holding onto you\"- the conclusion to all this is that the solution is God, and he will be staying alongside God for the rest of his life.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ni totally agree that this song is about coming out of depression, and personally i can also relate it to my eating disorder, i don't know much about the band but this song makes me really really really happy and is super important to me, they're awesome guys\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is diversely complex and poetic.  Within the song, the singer changes to who he is speaking to at least three times.\n\r\nThe song obviously has an overarching message of battling depression and suicidal thoughts.  However, as Twenty One Pilots is a Christian-influenced band (check Wikipedia and Jesus Freak Hideout for proof), God also takes a front seat, especially in the chorus.\n\r\nThe first line shows the speaker speaking to himself as he states with determination that he's taking over his body that he has lost control of for a time (\"I'm taking over my body, back in control, no more shotty.  I bet a lot of me was lost, 't's uncrossed and 'i's undotted.\")\n\r\nHe states that he has been fighting the force against him to gain control of himself heavily.  He then doubts himself, but then quickly regains determination to come back, as he is determined to kick his carnal desires/chains and regain control. (\"I fought it a lot, and it seems a lot like flesh is all I got.  Not any more....flesh out the door.\")  The \"Swat!\" transition is a tad unclear.  It shows however, at the very least, a dramatic split-second changeover.\n\r\nThis song is definitely \"schizophrenic,\" as the singer muses and doubts a lot.  After \"Swat!\", the singer begins to feel inferior again and realizes he isn't trustworthy as he begins to address God: \"I must'a forgot, you can't trust me.\"  He then proceeded to point out that he's open one moment to God, but then closed and hardened as soon as He shows his plan/wish/remedy.  The singer then proceeds to realize he just needs to give over completely to God as he writes music (\"And now that I write, and think about it, and the story unfolds, You should take my life....You should take my soul.\").\n\r\nThe music video for \"Holding On To You\" throws things a bit off here.  As he then begins the chorus (in the music video), there is an emphasis on the demons/death surrounding him.  However, without the video, the speaker is still clearly speaking to God.  There is no indication of a speaker change (He lets God completely consume him: \"You are surrounding all my surroundings.  Sounding down the mountain range....of my left-side brain.  You are surrounding all my surroundings.  Twisting the kaleidoscope....behind both of my eyes\")  He then states he is \"holding on to You (God)\".....otherwise, according to the music video (if you follow it that far), he is holding on to death, which is very contradictory to the entire song and thus, unlikely.\n\r\nThe singer then turns his speaking towards a generic unnamed individual (namely, the listener) as he begins a spiel on a moment frozen in time, of thought and brink of suicide (\"Remember the moment......you think twice about your life....it probably happens at night, right?).\n\r\nHe then gives a strong-armed solution against the suicidal thought in that moment: \"Fight it, take the pain....ignite it.  Tie a noose around your mind loose enough to breath fine and tie it, to a tree, tell it, 'you belong to me.'   This ain't a noose, this is a leash, and I have news for you....you must obey me!\"  (The \"tree\" could possibly be the Cross, however there isn't enough evidence to confirm anything.)\n\r\nAs the bridge begins to play, Joseph continues to repeat the phrase \"entertain my faith.\"  He is implore God to feed his trust in Him as he continues on.\n\r\nIn the last section of the song, the singer turns his attention to the general public (everyone) as he questions how effective/meaningful song messages and lyrics are....almost as if to humble himself and inform the public to not look to music exclusively for the answer to life.  He then points to the fact we were gifted with thought that has been given to us by God.  He implores us to become introspective and check our hearts, as they are more powerful than any piece of music can be.\n\r\nOverall, a highly complex musical piece of poetic musing.  In short, it is brilliantly made.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ni beleive this song is about coming out of an abusive relationship, \"i bet a lot of me was lost\" abusive relationships can make people scared to express opinion or do anything without being told to do first \"you are surrounding all my surroundings\" the abuser often takes up most of your life and becomes the only thing you can think about \"twisting the kaleidascope behind both my eyes\" it also changes how you see yourself and things around you \"and I'll be holding onto you\" holding onto the good person they were when the relationship started \"tie a noose around your mind loose enough to breathe fine\" when the abuse comes in it starts gradually so the person won't just leave \"this aint a noose this is a leash and i've got news for you, you must obey me\" abusive relations slowly kill a person from the inside out, but they often don't see that it was killing them until they're out, they're convinced the person is a bit controlling, not killing them\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI think there are too many people who listen to this band who are depressed. There are themes of depression in the song, but its important to point out a couple other things. The way I see it, this song is more about the struggle for self control.\n\nYou are surrounding all my surroundings\nSounding down the mountain range\nOf my left-side brain\nYou are surrounding all my surroundings\nTwisting the kaleidoscope\nBehind both of my eyes\n\nthe first half referencing the need for order and predictability in our lives \"left brain\"\nthe second half referencing the need to be creative \"right brain\"\n\nIts also important to note that the lyrics are\nIt ain't the speakers that bump HEARTS\nIt's our hearts that make the beat\n\nThis section makes this comment kind of hypocritical, as it means that we should listen to ourselves and find meaning rather than listening to music or anyone else to tell us what to do with our lives. Something I strongly recommend if your depressed and looking for meaning in depressing song lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI feel that it is definitely about coming out of depression (\"Not anymore, fresh out the door\")\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nTo be completely honest I personally believe that they perform the way they do to make it so their music means something different to everyone. While they continue to hint at God because of the Christian influence on them. It could mean the struggle with depression while also meaning a variety of things like Christ, suicide, pain, suffering, faith, etc. It is amazingly poetic and deep in many different ways both secular and spiritually.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nSo I think this song is as literally everyone else said about Tyler's own experience with depression, but more than that it's about how the only solution to that for him was turning to God and holding on to him in the midst of that and then him turning that into the band and the music, which I think is really about helping kids who are in similar situations see the light at the end of a very dark tunnel.  \t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI believe this song is referring to people who are being deceived my the world and people who choose to dwell in the flesh. The singer wants to get rid of flesh and Hold on to God. He wants God to \"take his life and soul\". He wants to be made new. The sinful world is the \"surrounding all my surroundings sounding down the\nmountain range of my left-side brain you are surrounding all my surroundings\" and it is \"twisting the kaleidoscope behind both of my eyes\". If you know what a kaleidoscope is it will make sense when I say that it shows one pattern and you twist is a bit and it has completely morphed into something else. That is how easily we are deceived and tricked by the world and everything in it. Sin does that. Now, the next section of the songs talks about knowing where you will end up, heaven or hell: \"Remember the moment You know exactly where you're going' 'Cause the next moment before you know it Time is slowing' and it's rolling still And the windowsill looks really nice, right? You think twice about your life It probably happens at night, right?\" and when this thinking process about your life happens you should \"fight\" going insane but you should \"tie\" or control your mind and where it goes because it is yours and if you do not control it, it will control you and it will not be good as we also know from other songs of Tyler Joseph and Josh Dun. The he refers back to the world and what it does. After, there is a section where he repeats the phrase \"entertain my faith\" 10 times. He wants God to entertain his faith. He wants God to help him become stronger in his faith. This whole next section \"Lean with it, rock with it When we gonna stop with it? Lyrics that mean nothing We were gifted with thought Is it time to move our feet To an introspective beat It ain't the speakers that bump hard It's our hearts that make the beat\" talks about being in sync with the world, rocking and leaning with it. In the world there are meaningless songs that people write and the singer is asking us if we going to stop going with the world and pick ourselves up by following our hearts and using the gift of thought that God gave us to stop being in sync with the world and start holding on to God. The last to choruses confirm that he will be holding on to God.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI have a bit of a different perspective as to the meaning of this song. I do beleive it does come with a bit of depression and a sort of break up. I beleive it is him saying he is breaking up with everything. I beleive he is saying that he only sees this as someone else wants him to from his reference to an object behind his eyes and someone else manipulating it shows he doesn't think he is actually seeing what he chooses but the choice is made by someone or something else. So I think he is saying he is breaking up with \"the system\" and how everything seen today is so controlled by media, big business etc.\r\nThe statements he is saying from my belief is that nothing in today's typical persons world is really real and he is viewing things with open eyes and he sees what matters and what really doesn't and he is calling out all musical artists to cut the \"I got money\" BS and start using their talents to talk about things that matter and to spread the word around otherwise everything gold will go. Like the tree that he claimed ownership too. \t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI think it's about all faith.... \nThe Real One..\nThe real faith that can be seen when you're blind. :) I hope you get what I'm saying..\nThis is how I see blindness: it's when you aren't able to see the truth and you're full of doubt. You're stuck in the dark and you can't see a thing. But when you're able to overcome the darkness, even without any light, you are a genuinely faithful man. Praise God for guiding you and congratulations for letting God guide you.\nAnd my favorite line is \"You are surrounding all my surroundings\" God is omnipresent. Yeah, I know, it's apparently about depression I think, the depression was just a part of my so-called blindness.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThis song in particular was inspired by depression and thoughts of suicide.  The beautiful thing about Tylerâ\u0080\u0099s lyrics is the ability for them to be interpreted in many different ways.  This song can be interpreted as someone who is coping and coming out of their depression and the objects or people they use to help them feel at peace or happy in a sense.  For me, I saw this as a piece about depression and how it is a constant battle between being in control and letting your depression take control of you mind and body. \n\r\nIn the beginning, the song states, â\u0080\u009cI'm taking over my body, back in control, no more shotty. I bet a lot of me was lost \"T\"'s uncrossed and \"I\"'s undotted. I fought it a lot and it seems a lot like flesh is all I got,â\u0080\u009d which is about being aware that the person has not been in control of their actions but they are taking over control.  As the song continues it says, \"You are surrounding all my surroundings. Twisting the kaleidoscope behind both of my eyes,â\u0080\u009d which sounds like depression being everywhere and affecting the way a person views their surroundings.  The song continues with the feeling of anxiety and thoughts of contemplating suicide which is common in those suffering from depression, â\u0080\u009ccause the next moment before you know it time is slowin' and it's rolling still.  And the windowsill looks really nice, right?  You think twice about your life, it probably happens at night, right?â\u0080\u009d  Before the person made the decision to fully cave in to their depression, they are faced with the strength and courage to fight the feelings and regain control, â\u0080\u009cfight it, take the pain, ignite it.  Tie a noose around your mind loose enough to breath fine and tie it to a tree tell it, you belong to me, this ain't a noose, this is a leash and I have news for you, you must obey me.â\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nTo start off this song is like bomb\r\nI know it might be weird, but we all know that Tyler is Christian and I feel this song has a lot of references towards that. (The reason I said it might be weird is if you're not very religious) \"I'm taking over my body, back in control no more shotty\" I think this is him saying that he is stronger than depression now and that he's come out, and I feel 'no more shotty' Is him trying to say like \"no more, im done\" I don't know how to say this but i feel he's trying to say it in a way that everyone will understand like when i see 'shotty' i first thought alcohol, and now i think it fits in, some people don't get that depressing state and how he is trying to interpret that he is ready or has come out so he put it in that way to say like \"i'm stopping drinking\" but what he means is depressed? i don't know really. \"You should take my life, you should take my soul\" At first I thought it was talking to someone, and now I feel he's saying that to God. \"You are surronding all my surroundings\" When you're in church, you're told that God is always there and everywhere. \"twisting the kaleidoscope behind both of my eyes\" This actually makes a lot of sense if this song is about Christianity because like (i don't know how to say this lol) you are given  your eyes by God, and I feel 'kaleidoscope' is a reference to his eyes? Now, \"Entertain my faith\" I honestly don't know why I get emotional everytime I hear those words, I feel like those three words make so much sense and I'm just like \"JHdisjejshsjGsk wHOA\" and i just can't explain how much this song means to me. Anyway, this was just my opinion and i usually don't get into religion much and the song might be something totally different lollll \t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI believe that this song means a lot of things...\r\n\"Like flesh is all I got.\" I think this means what is the purpose of life, and their is no point in being here because all we are is flesh\r\n\"Twisting the kaleidoscope, Behind both of my eyes\" i think this could mean that someone is manipulating the way he sees things maybe different religions trying to get us to believe in something that isn't really there. \r\n\"Fight it, take the pain, ignite it\" I think the verse following this line is about finnaly taking control of our life\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI think the first verse is about regaining control of his life. He's saying that he gained the ability to truly be in the driver seat no longer allowing society to influence his thoughts. \r\nsecond paragraph\r\nIf you are a true independent thinker then the majority of people disregard what you say. If you dont follow societies guidlines on what your opinions should be you can be cast aside.\r\nthird paragraph\r\nI see it as a description of society, perhaps more specifically the media, being everywhere attempting to influence his thoughts.\r\nFourth\r\nDiscibing the power of reflection, \"You think twice about your life. It probably happens at night right.\" saying thats how you can gain control of your thoughts.\r\nFifth\r\nAt first this can be a struggle but if your able to loosen up on attempt to control you gain a type of freedom.\r\nthe ending\r\nHe wants to write songs about how we should use our minds more. Songs with a true message that connects to the heart. He feels that alot of songs dont have an important message and thats what he thinks he can contribute to the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nTyler said in one show that he wrote this when he didnâ\u0080\u0099t have any ideas for more songs. He didnâ\u0080\u0099t know if he was supposed to do music. â\u0080\u009dEntertain my faithâ\u0080\u009d part I think would mean that heâ\u0080\u0099s faith is to write songs. \t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI actually feel like this song has a lot of Christian references. I normally wouldn't go there but these lyrics are too hard to ignore. Judging by the windowsill verse he may be coming out of depression, but I think he's had a little help getting there. Lyrics like \"it seems a lot like flesh is all I got Not any more, flesh out the door\" and \"A lot of me was lost\" resemble a little bit of a rebirth reference. He says \"I must'a forgot, you can't trust me\" like he can't trust himself to control his own life; he needs a little help. Not only that, there's some very spiritual lines like \"take my life, take my soul\" and \"entertain my faith.\" Who else to trust with your life than someone who can \"surround your surroundings\" and \"twist a kaleidoscope behind your eyes\"? He's either talking to some kind of ghost or God himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\none of my favorite lines is \"Lyrics that mean nothing, we were gifted with thought\" because he flat out says that for all we know, the lyrics really don't mean anything, but they just sound good. But because we all were gifted with thought we are able to create our own meanings to every word.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis song has to do with Depression, schizophrenia and waking up from being completely mind-dominated \n\n\"I'm taking over my body\nBack in control, no more shotty\nI bet a lot of me was lost\n\"T\"'s uncrossed and \"I\"'s undotted\nI fought it a lot and it seems a lot\nLike flesh is all I got\nNot any more, flesh out the door\"\n\n- He's waking up from unconsciously being lost in depression of thought.\n- He fought depression a lot and the more he fought the more he realized he wasn't just his body. (he's a soul as well)\n\n\"I must'a forgot, you can't trust me\nI'm moment-to-moment and close but don't show it\nBefore you know it I'm lost at sea\nAnd now that I write and think about it\nAnd the story unfolds\nYou should take my life\nYou should take my soul\"\n\n- His mind is scattered and he easily becomes lost in thought\n- He then explains with all this experience he should give it to other people so they can know what he's gone through.\n\n\"You are surrounding all my surroundings\nSounding down the mountain range\nOf my left-side brain\nYou are surrounding all my surroundings\nTwisting the kaleidoscope\nBehind both of my eyes\"\n\n- Intense fear causes you to fear all your surroundings even if they are non-life threatening\n- left side brain = interpreter (right side is emotion) = Waking up from depression and schizo which changes the way you see things \n\n\"I'll be holding on to you\" = faith or fear. People often cling to fear than to face the unknown \n\n\"Entertain my faith\" = All the fear, and depression based thoughts makes one feel like their faith is being tested like an experiment.\n\n\"Lyrcis that mean nothing\nWe were gifted with thought\"\n\n- Fear = False.Evidence.appearing.Real = Nothing \nHe's talking about explaining nothing (fear) with lyrics\n- He realizes the very thoughts that are tormenting him were there to wake him up from depression, and hence its a gift.\n\n\"Heart that makes the beat\" = bringing awareness to the heart instead of the BRAIN DOMINATED SOCIETY.\n\nAnd there you have it. You're probably wondering how I can even conceive such ideas. Well, I've experienced everything he has.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI still believe it's about trying to leave an emotionally abusive relationship, and how they're still trying to save this relationship and hold onto it. \"Entertain my faith\" is like saying be the good person I know you were and \"twisting the kaliedascope\" is altering how they veiw themselvs because a big part of emotional abuse is convincing whoever is being hurt that they can't find anyone better so they won't leave the relationship\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI get the feeling of depression and the singers effort to get out of it while listening to this song. I do believe he wrote it based on his past life struggles (the lyrics don't really show us which were or I can't really tell xD) because most of the song is based on retrospectives and sang with a lot of assertiveness, what makes me believe he has already phased it out or is on the urge of doing so. I hadn't the time I listened to it, still the song fit me so sad and hauntingly right. When I now listen to it I remember how desperate I felt and get astonished by realizing how things did change (yeahh I managed to overcame my depression :D).\nI know some won't like my interpretation, yeah because it involves not only but mostly love. Sorry guys...xD I am not the type of figuring out what the singer meant but what it means to me, so here it goes:\nSince birth, I was never the social and confident one, and as I grew due to various situations I became the weird girl that never really talks with almost anyone, gets good grades, shakes uncontrollably when she has to speak out loud just to answer a teachers question, goes home right after school finishes etc you got the picture. I always felt really different in terms of mentality, personality, sensitiveness and tastes with the particularity of being an introvert person. Depression started at 7th grade: I always liked to know and felt the need to figure everything out thoroughly however it just got to a hole new level when I was 12 (eg: getting to ask about the meaning of life, god's existence... things like that) after I experienced some hard things that destroyed 6 years of my life by making me doubt if I was worth being loved â\u0080\u0093 I was mocked and that truly destroyed me completely. So while still being very uncertain I had also been full of myself and a little bit arrogant before my colleges hurt me really bad and after that moment I realised I needed to improve myself which made me fight my ways to become an idealistic person (the one I wanted and that people I admired and loved wanted me to be) and got more careful not to get hurt again â\u0080\u0093 I was 12 for god sack, it destroyed my childhood completely!!!  It was everything but easy, I wanted to change because I felt horrible on my skin and I didnâ\u0080\u0099t want anyone to feel bad cause I knew how it hurt. With thought came really horrible realities/perspectives that killed my dearest dreams (have a stable life, marry, have kids etc), peace of mind and love for life â\u0080\u0093 I got conscious of adult reality and the uncertainty of my fate and it was too much to take in as it wasnâ\u0080\u0099t hard already to fit in in this world as an introverted, crazy person that is indecisive and not confident by nature -.-â\u0080\u0098. I was just full of pain, doubts and fears because I also felt pushed to fulfil my parentsâ\u0080\u0099 dreams - have a very good paid job, follow their ideas, be the person they wanted me to be etc while I just wanted to be a singer, had in general a very different opinion and felt I was all by myself by finding the need to judge the ones I took more into account because I realised some of their ideas were doing me and my brother no good: by seeing that my brother started hiding knifes on his bedroom (my mom was always very scared that something happened to me and my brother so she was almost always talking about robberies, deaths, rapes etc so for us to be safe and because of that I lived in permanent fear as I was obsessed with it) or my mom by saying that image wasnâ\u0080\u0099t important while girls at school mocked me by the way I dressed (my mother used to say it and I always got the idea it was as self defence as she also said she was horrible but when there was a need to dress formal or someone would compliment her I could see just how she got delighted) - without actually being able to fulfil any. What most hurt me at that time was my mom, I blamed her for the horrible situations I was in (she was my mom after all; wasnâ\u0080\u0099t she suppose to guide me? Protect me? So why this? I remember crying in bed convincing myself that I would never have any kids so not to raise a child as miserable as me and that suicide wasnâ\u0080\u0099t the answer cause it would only hurt the ones I loved the most â\u0080\u0093 I just felt that happiness wasnâ\u0080\u0099t attainable but pain would decrease if I just left that house). But on the other way I loved her and I still do, cause she is a wonderful person for what she has done for our family and the struggles she has been threw so I also felt horrible for blaming this on her, and who was I to say she was wrong? She had a more active role in educating me and my brother and having always passed the message that school was crucial and there was no other way to have a life, I just shut up and never said what I really wanted to do by knowing she would never even take it seriously, I mean she was write, school is actually the most secure and efficient path of success, besides I hadnâ\u0080\u0099t what was needed in the music industry (body and confidence) and maybe the problem was me, I had always been a little bit too dreamful,  I just had to grow up and face things as they were â\u0080\u0093 it was just one more dream to burry, I was used to it. \nTo â\u0080\u009cfacilitateâ\u0080\u009d things I fell in love with the most popular, happy, joyful, funny, loving men I have ever met, bit by bit, as we shared the same classroom for 4 years but nothing more, after he entered my classroom a year after my traumatic experience. I knew he would be the perfect person for me, only because I got him and I even saw a little bit of myself in him (the crazy, honest, committed, funny and loyal part xD) but I also knew I couldnâ\u0080\u0099t. It just wasnâ\u0080\u0099t right for him to be with such a lost person that would make his life tumble down and we did actually have really different opinions that were a bit conflictual. After meeting him my world became a mist of dark and light to be honest. His energy inspired but I knew I couldnâ\u0080\u0099t nourish the dream so he just made the hurt unbearable when I was alone.  Eventually the feelings for him got bigger and bigger and even harder for me not to show them. I started avoiding talking, looking and paying attention to him, till the cursing day I let it show. We started to go to the same explanation classes and at the end of the first class we started talking as we walked together along the footpath the conversation was so flowy, so as we were saying goodbye, I said it with such a tone of â\u0080\u009cI love youâ\u0080\u009d that he got speechless and really surprised (I do remember his face still). The instantaneous contentment became the bitterness I carried for the 3 following years and if I ever had the chance to travel back in time I would have changed that moment. The 3 years that followed were darker than any other. I just cried every single night because of everything I was going threw but especially because I didnâ\u0080\u0099t feel worthy of him or able to fulfil his future needs, he deserved more (so there I was witnessing the guy of my dreams while completely tattered). So I knew that this attachment needed to be broken and would only be so if we separated from the same class and I did what I had always done (the ignoring wasnâ\u0080\u0099t new for me), so I did what had to be done. I committed some more errors by showing I still liked him but minor compared to the other one â\u0080\u0093 got some control skills you got no idea.  \nAlong the days I still managed to stalk him by youtube, share some musics on facebook for him and I do believe he did that too for me because he also came to realise we would be a great couple (for more stupid that it sounds I believe it was our way of talking till the day he got tired and moved on). I was a horrible person because since I knew it wasnâ\u0080\u0099t going to work out I focused on everything that could go wrong making sure he would have enough of me and move on 1)me being shy and extremely awkward and not caring what other people though (plus some of his friends didnâ\u0080\u0099t seem to like me) and him being extremely social and wanting to have a good reputation 2)the fact he was always very flirty with girls and girls would normally like himâ\u0080¦ and I got jealous, but when was with me he didnâ\u0080\u0099t flirt at all because he got awkward too 3)the fact that we just didnâ\u0080\u0099t talk for 3 years, his decision to talk to me only after I showed him my soft side and knowing it could get really awkard when so 4)the fact my love for him what kinda stupid cause it was based on how I though he was 5)the fact I probably liked him because he was sexy as fuck, dam and I wasnâ\u0080\u0099t so well of my mind xD 6)the fact he made go threw a horrible time by not being able to have him, due to his existence 7) the fact I am a weird girl that ofen thinks of death and really strange things (he didnâ\u0080\u0099t like that and he though I belived in everything I read hahahaâ\u0080¦I wasnâ\u0080\u0099t the only one wrong) 8)the fact he had recently broke up with his girlfriend which was also from our class which made me feel much more secure about my body and not at all jealous xD. The love I felt for him was crazily maddening but is gone. I still respect him and admire him but I am ready for his face of disgust when he sees me again as I sent him songs with all of this themes for him to want me dead. This song was one of the songs I sent to him.\nMy world in the past years was a mess, and I had no one I could talk to, not even my parents (my dad because he was never really close to me or my brother, my brother because we werenâ\u0080\u0099t that intimate and my mom because she never tried to understand only feed me information of how to be), they just had different perspectives and I knew it would only make it worse for me to talk to them as they wouldn't know how to calm me down and guide me, leaving only more worries behind not only for me but for them too. So I figured it out myself: 1st I got myself to have a deep understanding of life so to fit myself and my weird ways in it at the moment, 2nd figure how I wanted to be and become that person 3rd make a plan for the future to get rid of this depression that involved distancing myself from what hurt, therefore my parents and him and what made me relive those horrible memories. \nI did manage to achieve all of that, the first two goals while on high school with life actually getting better because I achieved clairvoyance of my way of seeing things, quitted on trying to be perfect and I found peace with myself (however I just learned how to love my body a year back on the first year of university) and had finally known people I identified myself with who I still talk to and I am glad I still need in my life. Still there was a lot of hurt and I wasnâ\u0080\u0099t complete, I needed a fresh start and only when I moved out of my city to go to university on another city did I manage to get my life back together (and I feel happy again! :D). I am now taking the second year of a medicine course, donâ\u0080\u0099t truly know if this is what I really want to do with my life but I am grateful my mother pushed me here.\nLooking back during the 6 years there were a lot of mood swings and the only thing that made me sain were my strength and the love I felt by my friends and family specially my cousin, that I love and is like my little sister that I protect with all my heart.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThis song is awesome to start off. I can't believe I am the first to comment on it. It will be overplayed all over the radio over the next 6 months and I will grow to despise it I am sure. \n\nThe only vibe I am getting as far a meaning to the song would be that this song is about an ex that you can't get out of your head....hence the title Holding on to You. The line you are surrounding all my surroundings rings very true to me. I can't go a day without running across something little that reminds me of my Ex.\t\t\t\t\n\t\t\t\t\n\n"}