{"comment_0": "\nI can't get over his voice, it makes me all mushy inside and I'm not even gay lol\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nBeautiful lyrics with such a wonderful voice to back them up.He's singing of nostalgia for a lost love - going separate ways - and finding their way back to each other in the end. A classic love story I suppose. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nSimply fabulous... this is exactly me, over in Europe, while my boy is back in Canada. I've been here since September and I'm ready to go home now.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song just screams out to people in long distance relationships. I've always imagined MB writing this song while on tour and missing his beau. He knows it was his dream to be a singer and that he should appreciate the different cities he gets to experience -- but sometimes he just wants to go home and be with his friends and family.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nno place like home.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nMaybe it is about a person who is stuck in a relationship that never what all that he/she dreamed of. Home is this person that he or she loves, but didn't dare to go for. Home could also be about finding back to yourself, the dreams you always carried with you, which is the home of his/her soul. If you're not in contact with you're soul, you are not home anywhere.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nsee to me this isn't just nostalgia for his hometown. it could be more general, like i wanna come back to the place where i felt comforted, felt safe. that's ususally what keeps drwaing me back to this beautiful beautiful song.\n\n\n", "comment_7": "\nThe song was actually written for Michael's long-time ex-girlfriend. He's said so in a bunch of interviews and stuff. Basically it's him telling her that he misses her, but he understands why she can't/won't go with him on his tour. And that he'll be back as soon as he can. They broke up later anyway, which was when he wrote \"Lost\".\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nMy boyfriend broke up with me about a week ago, due to being kind of lost in his life at the moment. We've talked every day since, we're still like best friends. He sent this song to me today, and I cried. He still cares about me and wants to come back but he's pretty confused. The last week has been rough on both of us due to the breakup, but this song is making things seem okay<3\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nTo me this song can be interpreted in two ways. \n\r\nA musician on tour. If you've ever seen the music video shot for this it is just footage of Michael on tour which could explain the whole long distance relationship thing. \n\r\nIt could also be interpreted as a soldier's song home. A lot of soldiers from the earlier times never sent their letters back, they just kept them (reason I don't know) and soldiers travel a lot to different countries... I don't know. \n\r\nI am just guessing.  \t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI went to his concert and he said it was about his Grandfather. It's such a beautiful song. awwwww\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nâ\u0080\u009cIâ\u0080\u0099m fine baby, how are you?â\u0080\u009d damn him and his beautiful voice.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nBeautiful lyrics with such a wonderful voice\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ngreat song...beautiful lyrics. At first I thought it was about his fionce (sorry about spellin) but natural angel you say its about his grandfather??..alright.. Anyways he has a wonderful voice. The lyrics are beautiful...did he right them?????\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nMy best friend just moved to ireland... so i guess it seems like this song is for her. gosh.. and his voice.. perfection...\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song means alot to me at the min cos the guy I thought the world of has just moved away for a year.  This song sums up how I feel about it - that I hope he enjoys himself but at the same time i hope he misses me as much as i miss him\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nWhen i'm away from home I always think about what I left behind and how much I miss it! Being on tour is great but I miss the people i've left behind including my gorgeous girl! This song relates to my case and I love the way he performs it! Awesome voice and great lyrics... \"let me go home\"\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nIt seems like everyone has a story they can relate to this sad yet beautiful song. My bestie just went on exchange to England, and I miss him heaps.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nIts such a beautiful song. whether its about a beau or his grandpa it doesnt matter...it can apply to anyone you miss i think. and i think it sort of humanises him as a performer coz he still just wants all the home comforts even though he's been to all these luxurious places. gosh! its just gorgeous.....on repeat atm! =P\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis song is the best, one that you repeat over and over until someone tells you to shut up lol... but the thing i love the most is that instrument that sounds like you're in paris or italy... what is that called?! is it the accordion maybe?? anywho, its beautiful, and his voice...wowwww, his girl is lucky lol...love this song, definitely one of my favorites :)\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nthis song helped me a few times when i miss my boyfriend.  he's a marine and he is in the middle east right now.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nAnd I feel just like Iâ\u0080\u0099m living someone elseâ\u0080\u0099s life\r\nItâ\u0080\u0099s like I just stepped outside\r\nWhen everything was going right\r\nAnd I know just why you could not\r\nCome along with me\r\nBut this was not your dream\r\nBut you always believed in me\n\n\r\nI heart this song so much because of the fact that the lyrics seems to sing out to long-distance relationships everywhere - in my case, whether me and my girlfriend are physically or emotionally apart. Now i miss her more than ever *sigh* but all I can do now is wait...\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThis song is amazing....I am in high school and I dated a girl for eight months that I fell head over heels in love with her. She ended up breaking my heart, but I still can't seem to get over her and love her just as much as the day I realized I loved her. I am headed to the United States Air Force Academy in four months and I am SOOO worried that she seriously could be the one for me and I may lose any chance I have left of getting back together with her. I pray and pray and pray that if she really is the one, that God will let our paths meet again in the future and under the right circumstances where we could be in love as we were before.\r\n     I am planning on handing this girl a copy of this song the day I leave her for what could possibly be forever. I hope she will realize someday that she loves me and misses me as much as I do her. I know I am going to want to be with her everyday until the day that I meet someone like her or better (if that day comes) There's always hope right? I'll continue to hope.........\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nit WAS written for his grandfather, whom he missed on tour, but I can definitely see it for those in long distance relationships.\r\nI  can also see it in relationships that may have had a rocky spot but are slowly coming back together...\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nIt may be written for his grandfather, but appropriately adjusted for a long-distance relationship. It is evident by him referring to the person he is writing to as \"baby\"- not something you'd call your grandfather- at least I hope not. Anyway, this is a dumb, obvious comment by me, but just saying to all of you who say this also could be for long-distance relationships that the intent of the song was for that. The reason he was feeling homesick and the reason he decided to write the song, however, was because of his grandfather.\n\r\nI have only been gone from my girlfriend for three weeks, I'm in school not the army, and I'm going back home in four days, but this song still grabs at me as if I were gone for a long time because I miss my girl so much. This song also pulls me because in a year I may be leaving for a year or two and that's when this song will really kill me.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\ni can see why its about his grandfather. He was the one that introduced michael to swing and jazz music, so probably without him michael wouldnt be doing what he's doing today. Amazing song, why it wasn't a christmas number 1 shows that the world has really lost its taste in music\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nSorry, but I actually went to one of his shows, and before he started singing this song, he announced that this song was for his GIRLFRIEND.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI think this song is about just being away from the ones you love and how you know you have to be where you are, but you just want to be home with them.  \r\nWhether it's your family or a long distance relationship, it's hard, and like he says \"maybe surrounded by a million people I still feel all alone\" that's how it feels sometimes.  blah i love this song, i love his voice, he's an amazing singer.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nWith death coming to someonje you love, you'll be there for them. But also, since life is mysterious and painful, good moments are precious and even though we take things for granted, you can't take such moments for granted.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nhe takes a time off from someone to see how he felt about it after, he realized that he couldnt do it, now he wants to come back home, as in back in the security of their friendship.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song! I moved away to Argentina and every single time I get homesick I play this song... the guy nailed it...\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nthis song is perfect. and by the way, it was written for his FAMILY which he missed on tour in Europe. All his loved ones.. And thats a true fact!\r\nI love MB\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nthis song always makes me tear, wherever & whenever i hear it. my boyfriend and i were in a long distance relationship for the first 8 months and the night before i had to leave him i heard this song for the first time & i couldn't stop myself. i like to think of it as 'our song'.\n\n\r\nit's pretty explanatory. gorgeous nonetheless. & a perfect voice to sing it. he's amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\n\"Another summer day\r\nHas come and gone away\r\nIn Paris and Rome\r\nBut I wanna go home\"\r\nEven though it's a beautiful day, all he wants is to return to his loved one(s).\n\r\n\"Maybe surrounded by\r\nA million people I\r\nStill feel all alone\r\nI just wanna go home\r\nOh I miss you, you know\"\r\nGirlfriend, Grandfather -whichever. It's said you're never more alone than when you're in a crowd, and he's reflecting that in this song. Surrounded by people, but it makes him feel upset to not be with his loved one(s), perhaps he's seeing happy couple all around and missing his girl, or he's seeing families and missing his grandad... Whichever.\n\n\r\n\"And Iâ\u0080\u0099ve been keeping all the letters that I wrote to you\"\r\nHe writes letters, but deems them unworthy to be sent.\r\n\"Each one a line or two\r\nâ\u0080\u009cIâ\u0080\u0099m fine baby, how are you?â\u0080\u009d\r\nWell I would send them but I know that itâ\u0080\u0099s just not enough\r\nMy words were cold and flat\r\nAnd you deserve more than that\"\r\nThe person he misses deserves so much more than a letter, in his opinion, and he feels sorry for leaving them behind when he left. A letter doesn't really show emotion too well, it can seem quite formal.\n\r\n\"Another aeroplane\r\nAnother sunny place\"\r\nMaybe he's traveling somewhere else, somewhere hot and luxurious perhaps.\r\n\"Iâ\u0080\u0099m lucky I know\r\nBut I wanna go home\r\nMmmm, Iâ\u0080\u0099ve got to go home\"\r\nHe knows it's a life many might crave and envy, but all he wants is the person he loves.\n\r\n\"Let me go home\r\nIâ\u0080\u0099m just too far from where you are\r\nI wanna come home\"\r\nHe needs to be close to whoever the song's for, and he's begging to return to them.\n\r\n\"And I feel just like Iâ\u0080\u0099m living someone elseâ\u0080\u0099s life\"\r\nIt doesn't feel real, doesn't feel right.\r\n\"Itâ\u0080\u0099s like I just stepped outside\r\nWhen everything was going right\"\r\nStepped outside, as in leaving a comfortable environment, he left the people he loves. Like stepping outside a warm room in the a cold back garden, he realises it was a mistake and wants to turn round and go back.\r\n\"And I know just why you could not\r\nCome along with me\r\nBut this was not your dream\r\nBut you always believed in me\"\r\nHe wanted to follow his lifelong dream, and he must have begged whoever he loved to come with him - but it wasn't what they wanted so they wished him the best and he left. Perhaps he feels guilty for leaving.\n\r\n\"Another winter day\r\nHas come and gone away\r\nIn even Paris and Rome\r\nAnd I wanna go home\r\nLet me go home\"\r\nThis could be representing either the passing of time, from Summer to Winter, to show how long he's been away. Or it could show how cold his life, and the world,  feels without the person he loves. Or both.\n\n\r\n\"And Iâ\u0080\u0099m surrounded by\r\nA million people I\r\nStill feel alone\r\nOh, let go home\r\nOh, I miss you, you know\"\r\nA bit self explanitory.\n\r\n\"Let me go home\r\nIâ\u0080\u0099ve had my run\r\nBaby, Iâ\u0080\u0099m done\r\nI gotta go home\r\nLet me go home\r\nIt will all be alright\r\nIâ\u0080\u0099ll be home tonight\r\nIâ\u0080\u0099m coming back home\"\r\nHe's finally resolute, he gives up with what he's doing, he's \"had [his] run\", so he's perhaps finished what he wanted/needed to do, he's exhausted - he can't stand being away from them anymore and returns.\n\r\nHmm...\r\nEasy enough song to decipher.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nOf course, you could also interpret it as the person he loves has died, and so all the hot Summer days feel cold and crowds feel lonely.\r\nHome could be the sensation of love, how he feels with the person who cared for him. He really wishes for that yo come back, really craves it, and really needs it.\n\r\nBut I don't think this is correct because then he mentions \"coming back home\", which would infer suicide; which I think is a tad incorrect.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI hated this song because it was overplayed.  And then, I went on a semester long study abroad trip, and after the \"afterglow\" of arriving was over, it meant everything.  Especially \"another sunny day/I'm lucky I know/But I want to go home/I've got to go home\"  It's that feeling of having EVERYTHING you've ever wanted, and not being able to share it with the people who matter most.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\neven though i'm stating the meaning of these lyrics.\r\nI absolutely love michale buble.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\neveryone seems to kinda relate to this song...me to!\n\r\nAnd I feel just like Iâ\u0080\u0099m living someone elseâ\u0080\u0099s life\r\nItâ\u0080\u0099s like I just stepped outside\r\nWhen everything was going right\r\nAnd I know just why you could not\r\nCome along with me\r\nBut this was not your dream\r\nBut you always believed in me\n\r\nmost of all the verse, my boy friend wanted to go traverling but couldnt go as i needed a job nd to start getting my life together so i couldnt go, he still did, nd hes not even coming home for christmas       :(...........  this song breaks my heart!! x\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\neveryone seems to kinda relate to this song...me to!\n\r\nAnd I feel just like Iâ\u0080\u0099m living someone elseâ\u0080\u0099s life\r\nItâ\u0080\u0099s like I just stepped outside\r\nWhen everything was going right\r\nAnd I know just why you could not\r\nCome along with me\r\nBut this was not your dream\r\nBut you always believed in me\n\r\nmost of all the verse, my boy friend wanted to go traverling but couldnt go as i needed a job nd to start getting my life together so i couldnt go, he still did, nd hes not even coming home for christmas       :(...........  this song breaks my heart!! x\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThis song reminds me of my daddy. I've lived in Oklahoma all my life, but they say home is where the heart is, and my heart has always been in California with him. :[[\n\r\n\"I'm just too far from where you are; I wanna come home.\"\n\r\nMakes me cry every time, LOL.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nAh I am so excited to see him next month, he's great...\r\nThis song is the best. Love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis song always takes me back to the summer of '05.I got hurt and in return hurt somebody else.I was dating David,who was married.I thought it was over with them because she cheated on him.I am so naive sometimes! \r\nI stayed even though he was slightly abusive to me and my dog,and said if anything happened to his wife he would probably get back together with her.I cried and he said dont cry.WTF!!! I shouldve kicked him in his balls and shoved him out the door, but oh no stupid me.August 2nd-I come home from work and I find a letter on the table.He's left me.I turn around.His tv's gone.Thank god I kept that 13 inch tv! I look at my cd's-3 ARE MISSING! Of course,that asshole was already with HER on their way back to Oregon so I can't exactly do anything.I packed up his annoying 5 year old kids things and what little stuff he did leave behind and had a nice little bonfire! >:)\r\nAbout 2 weeks go by,I meet this guy,Steven.I tried to go out with him but I just wasn't feeling it so at the end of the week I let him go.He was pissed and said I was crazy.I was in tears but ya know if you're not into someone you cant keep stringing them along.Let me tell ya something you probably already know,REBOUNDS don't work.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nthe beautiful art of losing everything. sinking the moments.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\n'i'm fine baby, how are you?'\r\ndoesn't really sound like something you would write to a grandfather.\r\nnot doubting, just saying.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\ni think he wanted to get out and see the world, but his significant other wanted to stay home, and he's sorry he left her because he misses her so bad, and even though he's been to these amazing places, he feels empty without her\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThis song just gives me chills and some tears in my eyes.\n\r\nThe first time i heard in on the local radio..by then I love it, not knowing who the singer behind this great song is...and later some years..I got to know MB.\n\r\nLove his voice!\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\ni thought this song was about a soldier at war, and he was wanting to come home!\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nA very beautiful song that just hits me whenever I hear it. It could be about anything you long for, home could be anyone, anywhere or anything. The song is somber but hopeful. \t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nSimply beautiful!\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nBack in 1999, when i was sent to Melbourne for my study and life continued until the day this song released. It gave me so much feeling and i would cry every single time i listened to it. I still have this song in my iPhone and listen to it every single day and, surprizingly, still crying. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nSome years ago, I met an extraordinary woman in an online game. While we were both promised to other people, something drew us together that I could never explain. In a short time, despite living apart across an ocean, we became close in a way that I can only describes as \"home.\" Home, as in, \"a place that I've always known, always loved, and always will.\" But this home is not a place; it's a person.\n\nWe've never met in person. But knowing her has changed my whole life. I love more deeply, I care more about people, I feel healed of hurts and disappointments that I could never seem to move past, until I knew her.\n\nNeither of us ever wanted to hurt the ones that we loved before we met, and still love now. We keep in touch in a light, conversational way, when we can, because it's just not appropriate to be as close as we once were. Sometimes the thought that I might not ever be able to meet her face to face seems too difficult to contemplate, because to me, she is the home I carry in my heart every day. \n\nThere is nothing that I want more than her happiness. It's because my life seems so full having felt everything she has made me feel. Some will live an entire life and never feel what she has made me feel. Even the sadness that I have not being able to talk to her freely now is a melancholy that somehow warms me always. I think it's because to feel it is to remind me again and again of the happiness she gave me.\n\nThat's what this song means to me, this kind of \"home.\" And I always, always, believe in her :-))\t\t\t\t\n\t\t\t\t\n\n"}