{"comment_0": "\nShe wants that honey,if you know what I mean. LOL.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI gotta say that agree with babydaul16 on this... it's written in a way that you can't interpret it sexually unless your mind is a little creative (or dirty) but I think that the sexual interpretation is the most accurate, since I can't interpret it any other way.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nyeah, but does she really want to taste the \"Honey\"? Cos Mariah has said on numerous occaisions that she doesn't \"slob the knob\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nlol\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthis is my favorite mariah carey song! its catchy too!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIt's very saucy, I'd like to say so to someone!. I remember watching the video back in '97 (I'm feeling old lol) which was also very funny.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song is definitely about Carey's liberation from her ex-husband, Sony Records president Tommy Motolla. He was an abusive jerk towards Mariah, and had just divorced him before her album, \"Butterfly\", came ou, this song, along with the album is Carey's declaration of independence from Motolla! Go MARIAH!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song is definitely about Carey's liberation from her ex-husband, Sony Records president Tommy Motolla. He was an abusive jerk towards Mariah, and had just divorced him before her album, \"Butterfly\", came ou, this song, along with the album is Carey's declaration of independence from Motolla! Go MARIAH!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nhot song.. good vocals.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ngreat sexy song\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nMariah's most bold song ever. She's clearly singing about cum. Had this song not been so catchy and instantly went up the charts, it would have definitely been controversial.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nA great, hot and sexy song!!! It's awesome!! Just makes you wanna dance. What a hot video clip!!! She looks extremely sexy and gorgeous. Yeah it's pretty clear what the meaning of the song is lol.\r\nYeah, great vocals for sure!!! She's the BEST!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song is definitely about heroin.\n\r\n\"One hit of your love addicted me\"\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nIt's a song about cumshot. Mariah just wants a guy to fap hard and jizz his load all over her.\n\r\nSUPERMAN DAT HOOOOOO!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\njesupisto; this song is NOT definatly about heroin.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nyour all right... she wants his 'honey' \n\r\nI LOVE THIS SONG.... I WANT 'HONEY' TOO ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nLittle known fact - this song's working title was \"Bad Boy Bukkake\". While Mariah was almost divorced from Mottola, she ate a bunch of ecstasy, and most of the Bad Boy Records lineup enjoyed a gang-bang with MC. The song mostly references how most of the guys were a bit \"backed up\" (coincidence?), thus affording all involved a \"Honey\"-like viscosity to their...well, \"Honey\", as well as North-like volume. The occasion also afforded MC a chance to compare with her ex, whose older loins could only, by the late 90s, produce man sauce whose color and consistency, according to Mariah, was more like Gulden's Mustard.\t\t\t\t\n\t\t\t\t\n\n"}