{"comment_0": "\nI had a boyfriend for 7 months. We had fallen for each other really quickly... In the beginning of the relationship we thought we were invincible because we were so in love, and so attached to the relationship. \n\r\n\"You know how to drive in rain\r\nYou decide and that's okay\r\nStuck in the same old lane\r\nGoing the wrong way home\" \r\n..eventually we began to argue over little things and the spark was beginning to drift away, but he didn't think anything of it, but our relationship began heading to that wrong direction. Because of his ex girlfriend, he was used to the fighting and didn't think the \"rain\" or my sadness was too serious so he flew right by it.\n\r\n\"I feel like my heart is stuck\r\nIn bumper to bumper\r\nTraffic, I'm going to crash\r\n'Cause I can't have you the way that I want\r\nLet's just go back to the way it was\"\r\n..I felt like I was trapped in the relationship because I wanted to go back to how we were in the beginning: in love.\n\r\n\"When we were on Honeymoon Avenue\r\nHoneymoon Avenue\r\nBaby, Constantly crazy\r\nCan we get back to the way it was\"\r\n..to me a \"honeymoon\" is sort of the beginning of something. A celebration where you can't have enough of each other, and just a bunch of emotions.\n\r\n\"Hey, what happened to the butterflies\r\nGuess they were moving kinda fast, that time\"\r\nOur relationship started off pretty fast, where we just wanted to I straight to being in love and now those feelings we had are drifting away.\n\r\n\"And my heart is at a yellow light, a yellow light\r\nHey, can we go back to where we found it\r\nBut that's if we can turn it around\r\nYou're saying baby don't worry\r\nBut we're still going the wrong way baby\"\r\n..he didn't think much of it, or take it too seriously to a point where that empty feeling we both had wasn't going away.\n\r\n\"Think I'm in love\r\nBut we continue to fight\r\nHoney I know\r\nWe can find our way home\"\r\n..I was \"in love\" with him and didn't want to break up and wanted to keep the relationship going and wanted to try and go back to all that love we had before.\n\r\nLove this song and ariana grande!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song was written by Ariana when she was very young.  This song was very important to her and was put as her first song on her first album for a reason.  She also performed this many times before the album release and even before \"The Way\".\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nEvery so often, this song will pop up while my music is shuffling and it's such a beautiful song and Ariana does a great job with it. And there was something about it that was giving me feels (lol), feels that I don't really get from modern songs. I looked it up and turns out this song was written (along with a bunch of other people), by Babyface. It all makes sense now. He's a genius and has written a great song for a talented singer.\t\t\t\t\n\t\t\t\t\n\n"}