{"comment_0": "\nThis is about some kid talking to Maynard about Undertow.  The kid, declaring himself a true Tool fan (OGT - Original Gangsta Tool) apparently called MJK a sellout for releasing Undertow, a major label record.  Maynard turns his words around into the chorus that says, \"We all participate in capitalism, so by saying you don't like it, you're being hypocritical.\"  He goes on to say that the kid knows nothing about him except for what Maynard lets him know, so he's in no position to tell him how to live.  Just invest in Tool and your soul is safe.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI disagree. I don't think that he's saying capitalism is the H w/ a P, He's saying that HE's the H w/ a P.  He's like \"You know what buddy, (I love when he says buddy!) I might have sold myself (hooker), but I'M still the one who fucking YOU!(-he's got the cock) So fuck you.\"  That's what it is.  Most definitely.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think you guys are wrong about the name\r\nI think that Hooker With A Penis is a reference to \"You only know what I've sold you\"\r\nMeaning, You only know the surface of Maynard. I.E. What he wants you to know.\r\nHe's the hooker and you don't know he has a penis.\r\nWhich is saying that you have no idea what really lies beneath.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song taught me everything I needed to know to pass High School economics\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI don't think this song is purposefully about capitalism. It's more about hypocrisy, just Maynard responding to people who tell the band that they are selling out.\n\r\nThis kid has the audacity to tell Maynard that Tool is \"selling out and sucking up to the man\" for making a major-label record, even though he's wearing brand name clothes, drinking Coke, and getting tattoos of products. And Maynard is calling him out on his hypocrisy and telling him that unless he's willing to throw away his clothes and get rid of his tattoos, he can just shut his fucking mouth.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nAll I have to say is why does this song have the rating it does? What fool rated it low? This song is not only hilarious but it brings a good point across and is just entertaining. The chorus is great to sing along with. Tool will always be a great band.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song is a big FUCK to all the \"dip shit\" who repeatedly call bands sell outs. EVERY single band who ever releases an album is litterally a sell out. MJK is basically telling all of them \"We live in a capitalist world, deal with it. Criticizing bands for this only shows you're a dumb fuck who's completely missing the point. You're criticizing, but you're the one getting fucked in the end, so don't tell me what to do.\" \n\r\nI think we can apply this message to other aspects of the world than the capitalist system. This represents the essence of Maynard's message saying , we all have our flaws, don't be a fuckin' hypocrite and admit that you are a inperfect person as well. The world would be a much more peaceful place if more people thaught this way.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI absolutely love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ni like that tool throw's out props to the beastie boys. I think this song is very unique in the manner that from what i understand there was a lil controversy over bands selling out so to speak and tool just like many other major bands within the culture of music \"sale out\". Honestly, we as fans dont truly know the individuals writing and recording these songs, and I think the point of this entire song is that whether or not TOOL sold out or not is irrelevent because the music that they write and produce continues to be amazing and what we the consumer want more and more of. Honestly, there people just like everyone else. They believe what they want and leave the rest up to the individual to believe what they want. At the end of the day, there pretty awesome and create well thought out and well put togethor music that we all love and enjoy. If that makes them a \"sale out\" then so be it, im going to keep buying there shit. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nlol ive never heard it but the lyrics are fucking hilarious\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nthis is such a kickass song\r\none of my favorite of the Ã\u0086nima album\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthe first tool song i heard, it made me a fan\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthis song is about bands selling out.It's really bad ass cuz he can say he sold out but tool still kiicks assand if someone other than maynard said they sold out i'd kick their ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\na big fuck you to all---i love maynard!!!  i especially like \"all you know about me is what i sold you\" how true!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis is the easiest tool song to understand...It's about capitalism. so this system is a hooker, cause it will sell out to anyone at anymean necesary, and has a penis cause eventualy it's going to fuck you...so the capitalism is a Hooker with a Penis\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nGalactic Cactus hit it on the head.  The song isnt about Capitalism.  Tool isn't a political band!!  When is everyone going to realize that.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nyou gotta' love this song, he curses out his own record and his fans.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nAlthough I always thought this was about capitalism, I have to admit that Galactic Cactus' theory makes a lot of sense. In my English 1 class, we were going into depth on capitalism and I wrote an entire essay on this song and how it portrays capitalism... my teacher (an older hippie guy) asked if I could bring in the CD so he could hear the song and he dug it. Even though I'm not sure if I believe it's about capitalism anymore, I have to admit, I B.S.ed a really damn good essay.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nthey might not be a political band, but capitalism does play a role in the song's meaning. everything you see is a product with a message, and tool is no different, as maynard explains. i think galactic cactus got the meaning of the song title, although coldandugly applied the same meaning to a broader range of people just like maynard (hookers w/ penises). and isn't that what capitalism is made up of?\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI really don't think it's about that God-Aweful thing we call 'Capitalism'.  I think it's just as the other guy had said...  the Undertow thing.  No matter, it's an extremely funny song.  Somehow, though, I can't help but think there's some hidden theme in it!  lol.  How often does MJK say EXACTLY what he means?  Galactic Cactus has a good theory for the title, though.  I love this song (as I love all Tool songs :)).  Ã\u0086nima was just great.  Wouldn't ya say? ;)\n\r\n-The Prynce\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI hate you all.  He's fucking talking about the nerve this kid has to come up to him and critique him when he basically had to bare his soul to write the music, and the kid bought it anyway.  People hate being told what to do and especially being told what they're doing is wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\n He's baisically laughing at the kid. The kid thinks he knows it all \"holier than thou\" attitude, realizes how dumb he by pointing it out. Maynard makes a fool of the kid, makes him look like an idiot, by showing him how far it actually went, how everyone's a sellout, and how hypocritical he's being...\r\n That was my view, but if anyhting GuythDan is the only one who really knows what he's talking about.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI don't think that the lyrics has any \"deeper\" meaning. It's just Maynard's answer to some punk ass kid who thinks he knows it all.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis song is percieved in alot of different ways. Basically this kid is walking around in this name brand shit trying to say he's OGT and telling Maynard he's a sellout. It is a statement Maynard is making saying how hipocritical it is to judge a person you don't know anything about, saying that he has sold out when everyone is guilty of it. \"all you know about me is what i've sold you\" The members of Tool are fucking artists, they don't need anyone trying to limit what they do or reduce it to \"not good enough\" \t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nSee here...Maynard is astounded by this kids obvious oversight....MJK is part of Tool...it's his life and words...how can he sell out his own words?  \t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nwhat? sell out on his own words? what the hell are you talking about?\n\n\n", "comment_26": "\nwhat? sell out on his own words? what the hell are you talking about?\n\n\n", "comment_27": "\nwhat? sell out on his own words? what the hell are you talking about?\n\n\n", "comment_28": "\nHow do you make the 'AE' thing?\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni really dont know how neone can insult a band with Maynard in it... this is a great song... one of my 3 favs off of Aenema\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nu know what's gay, 15 year old kids who listen to rap and hate anything that's not.  They listen to shit music and don't realize that they are hearing great music when they listen to bands like Tool.  And what is the point of posting those idiodic messages\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nstrait up joshthack, you make a good point\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nhey joshthack, I'm 16, I have been a Tool fan for several years and have seen them 4 times.Other bands I like are Pearl Jam, Jane's addiction and Pink Floyd, so don't make assumptions about people's music tastes just cos of their age!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nhey i agree with addictedjane joshthack, i am 15 and i stopped listening to rap about 6 months of listening to it.\r\ni listen to techno and rock mostly.  i love the rocky soundtrack and pink floyd.  plus i am a hardcore tool fan.  i like most rock and techno that you put in front of me.  like addictedjane said, \"dont make assumptions about peoples music tastes just because of their age.\n\r\nanyways i think this song is hilarious.  its good to listen to when your mad or something like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI don't make assumptions based on age, I was just pointing out that C Mo(who is a 15 year old kid) is one of those types of high school kids who listen to rap, thinks he's tough because of the way he dresses, and won't even try listening to any other types of music.  There are plenty of young kids who listen to actual, good music, like you guys, you're right.  I used to listen to rap too and out of all the rap CD's I ever bought, the only one I still have is DMX's first album(great album).  Pink Floyd kicks ass, if you like them you should try listening to Led Zepplin and the original Black Sabbath w/ Ozzy.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nsorry joshthack. anyway i love led zep and sabbath, although ozzy's solo stuff is shit. i like music from that time best, there are hardly any good bands around nowadays. And don't call me a young kid!\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nwell, you are a young kid.  You will learn so many things in the next few years, and when you look back you'll be like, where the hell was I.  Well at least that's what it was like for me, I was in a completely different world when I was 16 because I was all depressed and shit.  Then I started using drugs when I was 18, that's when everything changed.  Take my advice, if you're depressed do not use drugs for an extended period of time, because when you stop all of your problems are right there waiting for you.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI just had a bad experience ... and I fell back on this song... It's all about sell outs etc.\n\r\nJust now I signed onto MSN, and some tart from my school has the nick: (%)U claimed all this time that u would die 4 me then y r u so surprised when u hear ur own eulogy he had alot of nothing 2 say(%)\n\r\nGRRRRRRRR THAT MAKES ME SOO FUCKING ANGRY, THE BITCH CAN'T EVEN SPELL, I DOUBT SHE EVEN KNOWS WHAT A EULOGY IS, OR WHO THE SONG IS BY, OR WHAT IT MEANS!!!!!! ARRRRRRRRRRRRGH!!!!\n\r\nI hate it so much when little pop girlies add amazing bands like Tool to their n'sync album collection. I expect all her friends will come online now, and she'll tell them all about how she's found this new underground band called Spade, And how sexy they are...\n\r\nWraaa >:(\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI heard Suger when it was reletively new ... Since Chop Suey SOAD are pretty sold out around my school now :(!\n\r\nArgh, I spoke to that girl all about her name and tool etc ... She'd so blatantly rehearsed EVERYTHING she said!\r\nWaiting for someone like me to challenge her about how she felt about the music etc, and she gave me a long explanation straight out of a book or weeks of thinking.\n\r\nAnother thing she said to me was something like \r\n\"well, if tool wuz 2 sell out, thatd suk cos den theyd be on da cova of smash hits or smt, and all the pop listners wuld like it\"\n\r\nPot calling the kettle black!?!?\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nOnce I woke up naked on a nike tower.  I don't know how I got up there, but I fucked my leg up when I fell off of it.  I ate a too many mushrooms that night.  It reminds me of that track with the dude who wakes up and sees red, a car the sky people as his.... \r\nI was that dude...  kids, say no to drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nwell we pretty much already established that this song was saying he says he's a sell out so i'm just gonna say tool kicks ass and this is an awesome song :)\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nTHis is a great song. Do you know many bands that insults their fans in one of their songs?\n\n\n\n", "comment_42": "\n*nods and agrees with Bonzo* oh all your fans love you too Tool.. you kick arss! \t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nbjm2m5,  you said that tool isnt a political band. well they arent a political band, but dont forget, they did some shit RATM, the most political band that was out there. such as know your enemy, and cant kill the revolution, so im just saying, dont forget. i mainly think this song is about capitalism, but dont forget, this is tool we're talkin' about here, there could be some more behind it.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nif its such a great song why only the 2.69 rating?!?!\r\ni love this song...i love how when he screams fuck you buddy how his voice gets all scratchy. this song just lets you say fuck you to everyone who judges someone by their own actions.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nAfter being completely and utterly rocked by the song \"Schism,\" I bought the Aenima cd and just let it play a few times in the background and waited for a song to catch my attention, and this one did. I even think I heard it on the radio, but it's hard to say (think of the title, after all). What I like about it, more than the message, is the power in his voice when he flings the first few lines out. It's the kind of thing that really sticks, and I got the image of him standing in some darkened room, while the boy lies on a filthy bed and, always smiling, lays out all his faults. I didn't go straight to the symbolism, myself, but to each his own.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\ni feel the same way as all of you guys i am 14 and going to 8th grade i live in a fairly big city and we have our own mall recently we got a hot topic now the biggest nsync fans are shopping there the cool thing to do now is were baggy jeans and wear all that listen to tool,s.o.a.d,flaw,slipknot and all that.its stupid because no one understands the music the people still like nsync and the unique thing to do know would be to dress \"preppy\" its stupid because about 2% of our school actually knows the music and what it means.the thing that gets to me the most is they all try to worship satan and hate god now cuz its the \"\"cool thing to do\"\" these people dont understand anything!\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nExactly! ANYTHING you hear directly from tool,about tool,and by tool,they make money off of!,And if you think theyre sellouts,than youre the dipshit cause you helped them and if you dont like it, you can point that fucking finger up your ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\ni wonder where this kid is now... im sure theres literally millions of tool fans that would love to kick his ass.   :)\n\r\ngreat song.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\njust like to say that Josh up there is right, but what's sad is that some people don't grow out of that stage. I have to put up with dipshits like that all the fuckin' time!\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nTool is a kick ass band, and anyone who doesn't see that is a dumass. This song is one of my favourite Tool songs, although i love all of them. \t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\n\"Ar3s, i totally agree. I h8 it when i start to like something and then it gets sucked into the world of Fad and what everyone else listens to. I used to LOVE Linkin Park, but now they're just a bunch of sell-outs because these little 13 year old people are running around watching MTV which decides what THE WHOLE USA LISTENS TO!!! (in majority on the Teens part) My 2 friends and I are especially destroyed by this because we're only 11 and we're the only people who even knows who Tool or Flaw or S.O.A.D. is IN OUR HOLE SCHOOL!!!\"\n\r\num... i dont like linkin park... but about the sell out comment... i think you may want to reread the lyrics to hooker with a penis...\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nthey arent insulting the fans... they are insulting the idiots who betray a band they love just because they reach a little success... those arent true fans\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nhaha i dont know or care, this song is just awesome and you cant even fucken distinguish what the hell hes saying... nevertheless, great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nWhenever  I hear this song it reminds me of all the fans of music that I have spoken to who 'discover a great new band' and once the band puts out an album that becomes popular they dispise the band as a sell out.  The band hasn't changed, just more people have been exposed to their music; and after all, isn't that their goal, to be successful?  I'm sorry that you cann't take claim anymore for a band that was never yours, but to change your mind on a band due the way others view them is pure hypocritical vanity, your the one selling yourself out.\r\nThis is exactly what I think Maynard is refering to in his lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI love this song for the prime reason that it speaks the plain simple truth behind the minds in nearly everyone nowadays. People decide almost entirely at random or at least when x does something that'll get him some money (and who doesn't want money? We need it to survive, and more of it is just dandy) that 'omg u r a sell out i h8 u' and go listen to the next big underground act. It's apparent now with most other bands, ie People who used to like slipknot almost obsessivly now turn to mushroomhead becuase slipknot are 'sell outs' and mushroomhead are 'keeping it real, and underground man'.\r\nAnd yet while thye're doing this, they're wearing the latest fashon, drinking the coke they just bought from their local wallmart, and after they listen to their new cd of elite underground indie music (which they bought from hot topic) they'll go around to macdonalds with a few friends.\r\nIt's not about being a sell out or not, it's about who it's cool to like and it's uncool to like bands who make money.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nOne of the first Tool songs I ever heard. GREAT song.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nYaaaay I love this song.  Makes me laugh.\r\nI always just thought it was about Maynard paying out stupid kids who make a big deal about bands selling out.  The ones that profess their love for a band to anyone that will listen, say that their music is their life and such, and then when they become even remotely popular, they say that the band sold out.  And they hate the band now for selling out.  People like that are stupid.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nnutin :( :D :) \t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nthis song is actually tells you everything about a poser...\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nk here's how i see it.  I agree with all of you that he's dissing the people that bail out on Tool because they got a little more fame.  Don't you like the band because they play great music and make you feel the way you do??? Well obviously if something is really good, lots of people are going to like it when they discover it.  I like bands that are underground, like right now I like mushroomhead too(love the piano!), but i still like slipknot even though they \"sold out\" so to speak.  The band cant really control how successful they are.....they are just doing their thing, and peole dig it.  when u get those stupid faggets that \"pretend to like it because its the kool thing to do\" thats messed up on THEIR part, not tools.  just my .02 cents\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\ni definitely dont feel that this song is all about capitalism but i kind of felt that tool mightve been onto a political side.  since this song is widely thought to be about econmics i just wanted to point out that marx had said that religion is the opiate of the people.  not only does tool criticize the instutions of organized religion, but the song opiate has a whole bunch of religious metaphors.  also i thought it seemingly political that maynard affiliated with rage who are apparently openly political about their communist beliefs (but hey, im not a rage fan at all).\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nfirts band i ever listened to was kon, but tool, takes me to a whoel another place....\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\ndanny carey is the best drummer ever to walk this earth\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nMaynard met a kid that said they were selling out because of making Undertow... but thats too simple so i'm prolly not right maybe i am but no TOOL song is simple...\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nMaynard(I think) is talking about talking to the old bass player from Opiate(since they switched bass players after Opiate) and he's talking about how Tool is selling out, and Maynards saying that he obviously doesn't know shit about him, so he needs to shut the fuck up, cause he's not sucking up to anyone. And pretty much tells him to go fuck himself with his middlefinger. And I completely agree, because Tool(to me) is one of the biggest bands out there who have the done the best job of NOT selling out. It just depends on your defenition of selling out.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nDid they switch bass players after Opiate or after Undertow?\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nundertow i believe\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nThey shoulda made a video for this with Maynard rolling around in a pile of cash with 20 hot bitches......that would be cool.  Or they could have me roll around in a pile of cash with 20 hot bitches....either way that would kick ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nMaynard sounds so demonic in this song. maybe he really did sell his soul.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI think that this whole album sounds the most demonic, aside from Disgustipated, of all.  Also, when I listen to Flood I can imagine him like a Christ figure preaching to all his listeners.  Then Lateralus is so much different even though he still kinda sounds like he's preaching.  But if there's one thing that they specifically want you to understand about their music it's that you should think about what you're hearing and try to understand the message and see how it relates to you.  It's kind of like philosophy and the one thing that sticks out in my mind when I think about philosophical teachings is that they all seem to be wrong; and their music even tells you that maybe they are wrong and you shouldn't listen to them, because they are just like the ones that they are speaking against.  Really all philosophy is, is what you personally want to get from it.  You can read(or listen in the case of Tool's music) something and completely disagree, agree, or maybe feel somewhere in between.  It all depends on the reader or listener.  However, I think that Tool does have a lot of good messages in their music.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nIn order to make it in the \"industry\" you do have to sell out. Everyone knows that...Maynard is just telling the kid to go fuck himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nFuckin genius!  Another good reason why Tool is one of the greatest bands ever.  The lyrics are so simple, yet carry so much weight.\n\r\nGreat song, great meaning, amazing band.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI think every song can be seen to have something to do with the 'system' in it, but \"the truth is: whatever cracks you can throw at us we'll still have more fans, more great music and more money than you'll ever have, and you pay me buddy\" Just a theory.\r\n~T~\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nThis is a song about buying something and not getting what you had planned. Kinda like a guy buying a hooker and realizing she has a penis. You buy Aenma thinking you're gonna get something angry and hard like the first 2 albums, then, hold up, he's abstractly sticking his penis in your ass.     TOOL = ass fetish = great metaphor\r\n                        = fuck you metal exclusive pieces of shit\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nAre you fuckers on crack? MJK sings about how this kid, holding a Coke, wearing a Beastie Boys t-shirt, is telling him how he thinks Maynard sold, out, how he thinks Maynard is conforming. Maynard takes a look at him and says, of course I've conformed, it makes fucking sense to, and who are you to talk anyway?\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nThe greater picture isn't just some kid being an idiot, it's about not pointing fingers and avoiding accusations. It's about recognizing your own problems, thus helping you realize that you aren't any better than anyone else.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI'd like to point out something minor that is mentioned in this song.  I feel that the beginning of the song enlightens most to the true definition of what a sell-out is.  How many of us can honestly say that before we listened to this song, that we knew what MJK's definition of a sell-out was.  We all assume that a sell-out is someone who changes his music in order to sell more records.  MJK is kind enough to show us that anyone who makes a record must sell-out in some way.  The term \"sell-out\" is very hackneyed, and it's convenience has caused it to lose it's meaning since people don't think about what it means anymore.  If a band changes anymore it's so easy to say, \"Man, they sold out, they totally changed, they don't respect their fans, i hate them, blah blah blah.\"  People shouldn't care if their band that could fit in their pocket before becomes more popular/bigger/whatever.  Like the music you like, don't take things for granted, and be self-righteous like the dude MJK talks to in the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nI'd like to point out something minor that is mentioned in this song.  I feel that the beginning of the song enlightens most to the true definition of what a sell-out is.  How many of us can honestly say that before we listened to this song, that we knew what MJK's definition of a sell-out was.  We all assume that a sell-out is someone who changes his music in order to sell more records.  MJK is kind enough to show us that anyone who makes a record must sell-out in some way.  The term \"sell-out\" is very hackneyed, and it's convenience has caused it to lose it's meaning since people don't think about what it means anymore.  If a band changes anymore it's so easy to say, \"Man, they sold out, they totally changed, they don't respect their fans, i hate them, blah blah blah.\"  People shouldn't care if their band that could fit in their pocket before becomes more popular/bigger/whatever.  Like the music you like, don't take things for granted, and be self-righteous like the dude MJK talks to in the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nIn an interview the bassist Justin said\n\r\n\"Like the song 'Hooker With a Penis', \r\ndon't bother even bringing up the idea of selling out because we're all participants and slaves. \r\nWe're all trying to cope with the system we've been born into, it's important to try and change it, but don't dwell on the fact that that's the way it is.\"  \n\r\nSo that's it\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nSorry, i'm an idiot... i meant to say... don't be self-righteous like the dude MJK talks to in the song... it was late at night, and i missed that typo when i read over it.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nmy favourite part of this song is the irony, a song about selling out and he's saying all of these name brand products, great stuff\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nHe only makes refrence to these name brand clothes to potray how \"hip\" this person that he's talking about is.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\ni think this song is about how the asshole kid criticizing maynard said \"sucking up to the man\" and maynard spits it right back in his face by saying \" im the man, and if im the man, then youre the man, and hes the man as well...\", which means everyone has their own different views, so fuck off.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\n\"All you read and\r\nWear or see and\r\nHear on TV\r\nIs a product\r\nBegging for your\r\nFatass dirty\r\nDollar \"\n\r\nIsn't about capitalism?\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nI think he's kinda attacking the whole music industry. There is always the \"man\" that decides what's good and what is not.  I think this song is about how there is not \"man\" but rather it's the population's choice on what's cool and what's not.  Kinda like democracy.  (ref: I'm the man, you're the man, he's the man, ...)\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nlol if you cant figure out what this song is about just by listening to it theres something wrong with your mentality\r\nthe meaning is clear\r\nin black and white\r\nor \r\nin melody\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nyou see the puppy was a dog but society my friends...now that was a revolution\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nalso, Mattallen is an absolute MORON, no clue\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nRexway does an awesome cover of this song.\n\r\n\"If I'm the Man and you're the Man and he's the Man as well...\" means that you can't sell-out to the Man if we are ALL buying into CONSUMERISM.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nMore proof: look at what the kid is into\r\n501s\r\nVans shoes\r\nNipple rings \r\nNew Tattoos\r\na Beastie Boys \"T\"(not cheap, folks!)\r\nCoca Cola\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\ngood point\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nthis is my favorite tool song...\r\ni dont no why everyone thinks theres a hidden message...i meen not ALL tool songs are symbolistic\r\nand this song is very litteral\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nI really like this song, as xopiatex said, I really don't think there is any deep message in this song, beyond Maynard Feeling that \"sellout\" is a term that is thrown around too often with no idea of what it means.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nIts my opionion that this song is about Tool's first bass player, Paul. I could very easily be wrong though.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nthe best part about this song to me is how  Maynard doesn't give a sh*#  about what this kid thinks,  since what he is being accused of is simply doing his job as a musician.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nGreat lyrics, dreadful music.\n\r\n*awaits shitstorm*\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nIts your opinion mate, cant see why it would start a shitstorm.\n\r\nI like Tool and these lyrics seem to be pretty straight forward. \n\r\nAs for 15 year olds thinking their tough because of the way they dress and the music they listen to.\n\r\nYou sound like a chav.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nanyone who says \"the song is about this\" is thinking about it too hard....maynard has said so, and will continue to say that he writes songs so openly for YOU to interpret.he wants YOU to get they dont even release the lyrics untill a while after the album has been out.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\non another note, i dont think maynard is a sellout at all. fame hasnt affected him at all, its not like hes in commercials selling someone else's product \"try our new and improved formula\"...no. the dude stays in the dark in his concerts and doesnt ever come on tv and stuff. tool, also, has 4 people working on their music. period. when a 5th person, who isnt a part of the band, makes the music, then they are sellouts, but untill then they are a band whos music connected with alot of people. especiallly those who take alot of LSD :-) >>personally i recomend their concerts on acid, simply because the entire mood is perfect for a hallucinogenic drug<< anyone know what drugs maynard did? he couldnt have smoked much, cos his lung capacity is really really high >>the grudge, 7:00-7:24....24 second scream. thats unbelievable<<\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nhenry rollins is the hooker with a penis\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nKrazylarry, please elaborate...\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nheres my take on this song...\n\r\nwhat i believe maynard means when he says \"im the man and youre the man and hes the man as well\" is that:\n\r\nwhen people usually say something about \"the man\" they usually mean that there is someone or something out there that is keeping them back from their aspirations. but what maynard is saying is that the only\r\nthing that can hold you back is yourself. so therefore everyone is \"the man\" themselves.\n\r\nwhen it comes to the lyrics \" i sold my soul to make a record.. and you bought one\" hes saying:\n\r\nwhen a band signs a record deal they are agreeing to make a music album (their soul) for money, in essence selling their soul for money.\n\r\npretty much the rest of the song is just making fun of people who change their self image consantly according to the media.\n\r\nim still in debate with myself whether he says \"sips of coke\" or \"sniffs of coke\" tho....\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nC Mo gay name and to let you know tool is one of the best of the best groups out there and this song is to any song by tool is one of the best so you can just go blow yourself\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nanyone know what OGT means?\n\r\n\"New tattoos that claimed that he\r\nWas OGT,\"\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\ni think part of the meaning to this song is that a band cant \"sell out\" by putting out any material, this is their goal in the first place by writing it, they want it to be heard and some want it to be heard by alot of people, sone keep it for themselves. tool's message is usually to inspire people to think further so why wouldnt they want everyone to hear it, research the messages like we're doing and therefore make the world a better place for them to live in. sure its selfish, but thats part of the human nature we're all trying to improve. maynard is telling a message that it doesnt matter if thousands of 13 year old girls think the band is sexy its the message in the material and how it is interpreted by the listener. maybe those 13 year old will put the record away for a few years then take it out and realize meanings that they never noticed before. like when you watch a movie you saw when you were a kid after years and years and finally notice all the graphic sexual references you never understood before. anyway BANDS DONT SELL OUT when they sign to a major label or everyone in a school listens to them for 90 days while theyre in the \"15 minutes of fame\" this is part of their goal to keep their messages going.  i would sell myself to make everyone think  more like me and you probably would too. anyway i can ramble forever its 8:13 in the morning. maybe im insane. enjoy...\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nogt is original ganster tool or something along those lines, its there if you read this whole thread, somebody else said this song might be about the original bass player from tool who left/was replaced after undertow, so therefore he probably doesnt like any tool after undertow and would call them sellouts for any material after that...\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nFred Durst was the boy. Which made me laugh when I read someone earlier on who said, \"I wonder where that kid is now.\" Well I guess he's not exactly sticking it to the man.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nhenry rollins is the hooker with a penis because he was on the first ep. he has lots of tattoos, he always wears beastie tees, he has nipple rings. Rollins is also old school hard core were doing videos and other mainstream shit is selling out.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nrollins also does not drink achool so the drinking coke is refering to that\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nAll i know is that this song has grown on me a whooolle fuckin lot i think people have cracked the story behind this song\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nI love this song. The vocals are great- as are the harsh lyrics. Has it occured to anyone that when MJK says,\n\r\n\"And if I'm the man,\r\nThen you're the man, and\r\nHe's the man as well so you can\r\nPoint that fuckin' finger up your ass,\" \n\r\nthat perhaps the hooker with the penis is the \"he\" in the stanza above? Who knows. Its a possibility, just like anything else is.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nIt is always quite Fun New and Interesting to Listen to peoples thoughts on most of these Tool Songs but All songs are up to you Own interpretation even though they are frequently Wrong Maynard Does Not have Cancer And this Song is not about Paul D Amour Or Selling out. Maynard has now sold out with APC and I wont listen to anything but Mer De Noms but Tool has Been great From opiate through lateralus and Im excited for new shit From Tool But not APC and Maynard is a different Person to Totally different to get what he gets/puts into the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nThis song is percieved in alot of different ways. Basically this kid is walking around in this name brand shit trying to say he's OGT and telling Maynard he's a sellout. It is a statement Maynard is making saying how hipocritical it is to judge a person you don't know anything about, saying that he has sold out when everyone is guilty of it. \"all you know about me is what i've sold you\" The members of Tool are fucking artists, they don't need anyone trying to limit what they do or reduce it to \"not good enough\"\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nThat Meaning is Incorrect Disregaurd what I say and You dont know maynard anymore than anyonbe else so you most likely wrong when you talk about him in realtion to his music sorry.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nFrickin brilliant song.  The kid never sold out because he never had anything he was already owned by Coke, Vans and Lee jeans.  The kid was a tool himself of whatever marketing scheme happened to catch his eye when he had change in his pocket.  He plays the kid for a fool when he tells him 'man say whatever you want just keep buying my records and merchandise to fund me saying whatever I want to say'. Brilliant.\n\r\nOh and I have to disagree tool is political because Maynard is political and he writes the lyrics.  If you don't think he is political just read the lyrics to Pet by APC.  He knows he has an audience and thus influence and he uses it maybe just to tell his side of things, maybe to sway people that's debatable.  He deserved a lot of credit for being not only intelligent and a freethinker but a creative genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nDiscordian, you are totally correct i mean the lyrics in this song are just so in your face, theres no deep meaning i get this picture in my head of MJK just coming off stage and this kid at the bottom talkin alll this shitt to Maynard about how hes \"sold out\" and then Maynard kickin the shit out of him!! haha\n\r\nBut seriously all of us come across people in our lives that like to contradict us for some reason or another, these people are low, boring, and people who have attitudes that just stink most work in the media and im just glad that Maynard wrote this song because its making one hell of a point!!\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nMJK is my fucking jesus! 'all you know about me is wat i sold you' so fucking true and that stupid guy who dissed undertow is a fucking dumb shit!!\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nwho gives a fuck if tool sold out they still kick ass and which one of you stupid dumbfucks wouldn't sign a contract for like 5 million dollars for doing something you love and if you wouldn't then you truly are a dumbfuckTOOL RULES and if you don't agree go look up some other fuckin' lyrics you peice of shit\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nlove this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nTo me personally, this song makes me think about how everything is a product. He probably wrote it as a reaction to how stupid he found being called a â\u0080\u0098sell-outâ\u0080\u0099 though.\n\r\nIn our current society, we need to get jobs in order to make money and survive. At the end of the day, this is MJKâ\u0080\u0099s job. MJK makes music to put food on the table. The primary purpose of making this song, indeed every song they have released, is to make money. There may be a message, but that message is only a secondary purpose for making this song.\n\r\nMJK is a sell-out. Every musician is a sell-out. The main reason to pick up their instruments or pull out their pen in the first place is so they can earn money. They care more about surviving by earning money than entertaining you. However, itâ\u0080\u0099s good to know you entertain people too. Take a look at that Ã\u0086nima CD and picture this. That isnâ\u0080\u0099t piece of art full of deep meaning, that is a product used to make MJK money. In our society, everything is a product. That monitor in front of you. The designer of that created it for the purpose of making money. That table, that TV, that lamp, that window, your house, everything you eat. Everything is a product designed for the fundamental purpose to make the creator money. The news doesnâ\u0080\u0099t report stuff you need to know, it reports stuff you will be interested so you will tune in so companies will give them money for advertising space so you will know about their products so you can buy.\n\r\nIf you donâ\u0080\u0099t want to feed â\u0080\u0098the manâ\u0080\u0099 in any way and not be a sell-out. Follow these steps.\r\n1: Give away all their processions (including their clothes) and money\r\n2: Move into a place where our species have not inflicted their plague of â\u0080\u0098modern societyâ\u0080\u0099 on and live there. I recommend the jungle.\r\n3: Start a new life and live one with the animals, carefree from the pressure of the system. You've probably got the best idea acutally.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\n\" Fred Durst was the boy.\"\n\n\r\nOH MY SHIT THIS JUST MAKES THIS SONG 2398762987362187335987387462 TIMES BETTER HAHAHAHAHAHAH!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nThis song is about capitalism,  and in capitalism everyone is \"the man\". All you have to do is not buy into something and they are not successful. So that whiny kid yelling \"sell out\" was the one who made Tool famous in the first place by buying their shit. When bands start to sell more records that's a good thing, right? Why does everyone always whine about capitalism? The person trying the hardest goes the farthest. As opposed to communism where everyone is equal. Who wants to live like that and have the government up your ass at all times? Why does everyone always assume that rich people got that way through evil exploits? Tool are rich, and for good reason, they are true genius. Thanks in part to capitalism. Thank you.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nwhy is manyard so ........MAYNARD??OHH god id give my left tit to know what goes through that mans mind!!! he capatalized on his own insanaty. god i wish he was hot i would almost fuck im just cuz of his genious\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nAlmost racist song, â\u0080\u0093just like Morrisey, James Kennan hates homies.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nYou do know that Maynard sometimes \r\nprances around on stage in a dress and wig, right?\r\nAnd that's just fine with me because He, Tool, and APC\r\nMake great music.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nYou do know that Maynard sometimes \r\nprances around on stage in a dress and wig, right?\r\nAnd that's just fine with me because He, Tool, and APC\r\nMake great music.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nHooker with a penis is talking about the kid being a sellout that whores himself off to different organizations but he's a guy and guess what guys, men have penises... duh...\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nHas anyone ever thought about this song being about unity?  Well, I heard a Tool live clip about an essential thing. One essential topic that was discussed was in fact unity.  Since the band says in this song \"I'm the man, you're the man, and he's the man as well.\"  That would be unity yes?  Just a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nVery powerfull song. Gives me goosebumps^^\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nFuck you C Mo, you can't hate MJK, it's not humanly possible.\n\r\nAlso, I agree with everyone that says that this song is about some kid criticizing Tool. Hypocritical little bastard.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nI think this song is taking the piss out of all those fans who go on about bands selling out and shit, and it's a great song\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nWow you people are fucking stupid.\n\r\nHooker with a Penis.  The title is for comic effect and shock value.  He calls himself a hooker.\n\r\nThe song is poking fun at a human vice.  Fans talking shit as they often do.  As soon as a band changes or moves up fans choke up a \"sell out\" remark.\n\r\nThe whole beginning of the song Maynard throws out Product names and then bring up some ego-kid saying he's selling out.\n\r\nThis song is Maynard's reply to all you fucking imbecils who throw out the phrase sell out every chance you get.\n\r\nThe Man plays a very important role in this song.  The Man being of course a term for everything corperate(sp?), everything media; mainstream.  Maynard is basically saying everyone is \"The Man\" (\"If I'm the fuckin' Man then you're the aswell\").  Corporations(sp? again) are systems of capitalism and capitalism is buy/sell and is nothing without either one.  Calling him a sellout is fucking stupid because you are the buyer.  Everything maynard is to you is what you paid for.\n\r\nThis song basically is saying, \"Fuck you, you dumb fuck!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nSelling out or buying in? The man is supposedly the guy calling the shots. MJK is saying that he is the one calling the shots and anyone who wants to stand up can do the same. The hooker part is because he is playing \"the game\", the penis part is because he is firmly in control of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nHe's regretting the fact that he got high one day and did a transexual.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nThere is a subtle whispering in the backround of this song, along with third eye and others. If only i knew what he was saying.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nYeah, there is. I think he says something like \"I fought for you\" at one point, but eh. I can't figure it out.\n\r\nGreat song though, excellent stress reliever. It still sends shivers up my spine the last time he screams \"AND YOU BOUGHT OONNNNE!\" with the guitar and stuff. It's just so powerful.\n\r\nBut yeah, this is about the music business and stuff....like everyone said. Pretty much says: \"You claimed to be a fan of mine, now you're saying I'm selling out?\" The huge irony would be if the character depicted in this song still goes to some music store and buys the new Tool CD or something....\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nI agree with other posters. Its about the irony of the fact that someone who drinks coke, wears 501s, has nipple rings, tattoos and wears/consumes everything merchandise-y and corporate is calling Maynard a sellout. \n\r\nEverything's a sellout noawadays so people might as well give up with that soap-box whinge.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nThe song doesn't claim integrity of music, especially theirs, is a myth.  What's ironic in the song is that the guy claims he is 'OGT' and yet Maynard explains the contract was before that record (Opiate).  Maynard would like to sell 10 million records, but won't change and hasn't changed a damn thing to do it.  As for Tool not being a political band, that's rubbish.  I suppose they need to talk about election candidates to be political huh? To quote MJK \"Every album I've done with Tool and APC has strong political content\". End of that one.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nLook at Ar3s comment on 06-16-2002 @ 11:36:29 PM its on the second page\n\r\nHe uses the cliche Pot calling the Kettle Black\n\r\nI know thats not a underground cliche (heh underground cliches) but i thought that was funny, because that was then and this is now\n\r\nand track 5 is like pshaaaaa\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nLook at Ar3s comment on 06-16-2002 @ 11:36:29 PM its on the second page\n\r\nHe uses the cliche Pot calling the Kettle Black\n\r\nI know thats not a underground cliche (heh underground cliches) but i thought that was funny, because that was then and this is now\n\r\nand track 5 is like pshaaaaa\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nBasically it's a \"Shut the fuck up\" to all the people who believe that they are sell-outs \"I'm the man and your the man and he's the man as well\", - I'm doing what's best for myself and so should you.\n\r\nHe is calling the fan a whinging hypocrite with a terribly misconceived idea of what selling is all about \"I sold my soul to make a record\" - You sell out the instant you sign the dotted line - whether it's a major label or not. \"Vans 501\", \"Sips of Coke\" - brand names showing the kid really doesn't know what he's talking about. \n\r\nI love this song it's the exact opposite to the song \"Jenny from the Block\" by Jennifer Lopez (hate to bring her into a Tool conversation but there you go). Whereas Tool stands up to the kid in a level-headed and down-to-earth manner, Lopez pathetically protests to her fans pleading with them to continue to regard her as \"Cool\".\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nlol ogtool, nice way to disguise the song's meaning as a comment on the song, pretty clever I wonder if anyone thought you were serous?\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\n'I love my fans and do not know what I would do without them. Sure some are exasperating, but for the most part they are the ones that motivate me to keep on writing. They could never actually make or break me...well except for one...I am sure you all know him, his name is adam fadly!! \r\n                              - Maynard James Keenan \n\r\nBUT UNFORTUNATELY I DUNNO WHO DIS ADAM FADLY IS...n wen i searched fer sum info...i came across dis site where it was written dis song is for Adam Fadly. i can say maynard hates dis guy fer sum reason...but i need 2 kno a little bit more abt who dis adam guy is. anyone who can help me?\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nWell, I don't know if this is a major factor of the song... but I have noticed that the song is entirely heavy. Maybe they're using that as a sarcastic approach towards the people complaining about how Tool isn't like how they used to be, back in the Opiate days? Just a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nI think this song is about a certain conflict, a duality in MJK's mind. On one hand, he's a strong defender of a musician's right not only to make music as he or she sees fit, but also to sell it and profit from it. He's said so himself in at least one interview, strongly, and the lyrics of this song certainly imply it. So he's angry with this kid for not respecting that right of the artist. On the other hand, it sounds like he is indeed angry with that part of himself and the system. The lyrics also seem to form an indictment of the music industry itself, and the hell musicians go through to reach success, and how little that translates into respect for themselves or their art. He also seems, at least in part, to despise the pressures financial gain put on art. So I think it combines his opposite opinions on a singular issue.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nOccult, that is the funniest shit I've ever read.....\n\r\n...the song is pretty self-explanatory.  It's also, the truest shit Maynard ever said.  We're all guilty of it....labling ourselves, with anything.  The kid is a walking commercial....but so is is Maynard, and so am I, and so are you. (I wonder how many deftones albums I've sold, owning like ten deftones shirts, and wearing them all the time and everywhere.)  I should get a piece of the profit...damnit!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nThis song is about Trexor.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nThey like fingers in asses. Lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nWho doesn't like fingers in asses?\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI don't care who you are, if somebody offers you money, you'll take it.  People offer Tool money.  They take it.  They aren't sellouts because they take people's money.  \r\nThey're human.  That's all the song's about.  No hidden messages in this one.  It's just pure realism on their part.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nwell, i think we already got to the meaning a few pages back, so I'll just point out that this song is fucking AMAZING and leave it at that.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nthe lyrics to this song make me want to listen to tool. which is pretty amazing for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nsurely any tool song makes you want to listen to more tool?\r\nthis song kicks ass! all tool songs do, really.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\ni thought it was fat and dirty daughter\r\nits what i heard\r\nand has more impact lol\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nVans. 501's. Coke.\n\r\nMJK is hilarious.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nthis song is very self explanatory, hes basically telling some kid who thinks hes been a fan since the beginning of tool and getting jealous of their newfound popularity to go fuck himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nFacts:\n\r\n- It's not a song about capitalism\r\n- It's not a song speaking out against \"selling out\"\r\n- It's saying \"yeah, we fucking sold out as soon as we made a fucking record, just like every other fucking band. Get off your elitist high horse you dipshit.\"\n\r\nThat settles that.\n\r\n:)\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nYou people are silly.  \"No, it's not about capitolism!\"  Then you describe capitolism and say that the song is about what you said.\n\r\nIn other news, this song is fantastic.  I refer everyone who uses the words \"sell out\" to refer to an indy band.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nNo, it's not about capitalism.\n\r\nIt's about some dipshit thinking he's above capitalism. It's a huge difference.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nLol, I know what this song's about...  Someone claiming to be a loyal Tool fan, then saying that Tool \"sold-out.\"  Since Hookers sell their body for sex, Tool selling out is like being a Hooker, and since they're all male, essentially, each of them is a Hooker with a Penis.\n\n\n\n", "comment_161": "\nFor the longest time I thought Maynard was saying \"fuck you Reagan\" instead of \"my new record\", at the end of the song.  Oh well, I still sing it that way. XD\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nI just wanted to point out to everyone the irony of how everything described about the kid is something name brand or some sort of product that he paid for the kid is trying to call Maynard a sellout.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nthis song is real fuckin rock, Tool forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nits simple. he sold his soul 2 make this cd\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nHow could Tool be \"sell-out\", as they first signed at the only condition to keep 100% artistic control ?\n\r\nAnd why would the song be about Paul, as he left the band at the beginning of Aenima recording, because he wanted to make softer music ?\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nactually this song has an extremely deep meaning that most kids wouldn't understand, why they listen to him is definately for the song, its about that guy who wrote diuretics, the guy who created his own religion and turned it into a book, and basically he's calling him a dumbass\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nthe guys name is Ron Hubbard\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nThe outro to this song is way too fuckin' powerful.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nwow, no one has posted anything since 2002?  Fuck you guys...  Tool will never die.  They are probably the most important education you will ever have.  \n\r\nBack to the debate on whether or not they are political or humanitarians... If you havent noticed, Maynard is renowned for his magnificant double entendres.  The best there is at what he does.  So when you are trying to decipher his messages and come to a fork in the road, remember, all the gaps are bridged.  Tool is the spider and you are all caught in their transcendental web.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nacrazedfan, What an asshole :)\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nA Tool song bashing Tool fans. Strangely Maynard has a fascination of cursing off the people that made him famous and rich\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\ni really had no idea what the song meant til i looked on here. maynard is probly the best lyricist on the face of the earth. tool is an amazing band\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nI've been reading posts on this site about Tool for a while now, and I'm starting to be amused by a reoccuring observation.  Tool fans are extremely unreceptive to new listeners.  I have to admit, I just recently started listening to Tool, so I can't in any way call myself \"hardcore\", but I still love them all the same.  I appreciate the experience of Tool, meaning their music is more than sound and lyrics.  Anyway, I'm always reading these posts from angry protective Tool fans who are jealous and frustrated that Tool is mainstream.  I know the feeling.  I'm not making fun of you hardcore tool fans, I'm just relating to the feeling of wanting to protect, or posess something that isn't everyone elses.  It's sad and frustrating to see something that you care for and appreciate used and misunderstood by someone else merely for the benefits they gain from it.  Just throwing this out there.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nthis song is simple you idiots, its just about how little dickheads point at their favourite bands and tell them they're selling out, whereas theres no such thing seeing as they'd already 'sold out' in the first place\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\n....bobroebling you are a dumbass. not every tool song has to do with L. Ron Hubbard. especially this one. there is nothing, absolutely nothing in the song that could lead even the dumbest person on earth to believe that this song has anything to do with L. Ron Hubbard and scientology.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nthe most entertaining thing is watching tool fans try to decipher lyrics that are so fucking obvious. maynard could literally tell you EXACTLY what his song is about and you would still try to find a hidden meaning. tool has already sold out, but that doesn't really matter as their albums are so boring they put children to sleep.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nHey! Don't insult Paul D'amour like that! He left the band because he wanted to start his own band aswell as continuing to persue his film career. He's got nothing to do with this song. I hate it when i go to Incubus posts and see on all the songs on a crow left of the murder how everybody insults Alex Katunich for leaving the band. I listen to Tool and i'm proud of doing so because it defines that i have a good taste in music and even though it's sort of wrong of me to think this way i really hope that people don't listen to tool and that their fans are people who listen to them because they love them the way i do, if not even more... It should be like a test to see if your motives for being a fan is right. I'd like it if people asked themselves, why do i listen to Tool and i hope they come up with a better answer than.. They rock or they are cool. And here's a big raise of the wine glass to all the true Tool fans out there (caduceus wine).\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nyeah, this is a great song.  i love that he puts the kid in a poser type of outfit before he tells you what he did lol.  makes the kid's words more ironic.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nthis song is amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\ngaodene, the word is hypocritical (not meaning to sound mean or condescending, you were going in the right direction, buddy). But that isthe most important thing about the song. The kid is in all these name-brand 'Generation X' bullshit stuff that's supposedly 'breaking trends' and 'setting new boundaries' Well, got news for you. Vans is still as much a name brand as Abercrombie. Getting a Beastie Boys T is scarcely different from buying some fake surf party advertisement shirt from Hollister. And then the kid has the nerve to tell Maynard that MAYNARD sold out. To say that MAYNARD was sucking up to the man (the man in this case being popular culture). Maynard really did say it best \"Before you point that finger you should know that I'm the man. And if I'm the man then you're the man and he's the fuckin man as well so you can point that fuckin finger up your ass.\" Maynard is saying (once again 'the man' being pop culture) that he IS pop culture, HE starts the trends everyone follows. But so is the kid. And the random guy. In other words, what's popular to one person is different to the next guy. And the next guy. And the next guy. Catch the drift? This ain't about capitalism, or L. Ron Hubbard or some other off-the-wall bullshit. It's one of VERY few Tool songs that's blunt and straightfoward, wasting no time with intricate metaphors.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\n\"Before you point that finger you should know that I'm the man. And if I'm the man then you're the man and he's the fuckin man as well so you can point that fuckin finger up your ass.\" I don't think Maynard thinks he's a trend-setter or even if he did, I don't think he'd pick this song to try and tell us that in.. I think it's more a rant against people that jump on the wave as \"fans\" as soon as bands become popular. And how they feel \"important\" by judging/critisizing the band when they really have no clue. Like stated earlier this song isn't that deep, it's more straightforward and hence this line is just a cool way for Maynard to say that: We play kickass music (I'm the man) and everyone is free to listen to it, and whoever listens openhearted without trying to judge the music or the band is \"the man\" aswell.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nhahahaha this is definately one of tools best songs \n\r\nits them doin what they do best\n\r\nstickin it to the man!\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nThe title refers to the lines \"He thought We were sellin' out, Layin' down,\r\nSuckin' up To the man\"- thus making him a hooker, and the lines \"Before you point the finger You should know that I'm the man, And if I'm the man,Then you're the man, and He's the man as well so you can Point that fuckin' finger up your ass\" Which is where penis comes into it.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nmate if im the man your th man he's the man aswell...to be blatent...its sayin...as long as one personb likes th music...even if its the artists...the music is goos! th statement 'that band are shit' does not never will never has meant anything...it's a none statement! x\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nThe brilliance of Maynard lies in that the song IS about capitalism, but it's not like he's going to sing a lecture about capitalism. Saying that Tool is not a political band is simply not true. They may not have songs directly addressing political issues like APC does, but many of MJK's songs are about society and the state of man (Vicarious, The Pot, Right in Two, Aenema). His metaphors are often so deep that it's difficult to extract all of the meaning. Basically, I think Maynard sometimes intentionally writes songs with multiple multiple meanings just to spark conversation like this.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nit's ironic...cause if tool didnt \"sell out\" then their amazing music would not be available to me...i know that when i first discovered tool, was in 6th grade when i saw a music video of theirs.\n\r\nbeen in love since.\n\r\ntool are not sell outs...fallout boy = sellouts....tool = mainstream art.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nC Mo.\r\nwho the fuck do youthink youare saying tool sucks.\r\ntool is one of the most talened bands out there. \n\r\non another note, \r\nhooker with a penis is probably on of my faves. by tool.\r\ni fucking lovetool, \r\nthey're my life.\r\n:]\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\ni think too, this is about a stupid boy, telling MJK that hes a sellout. right. The boy says, \"you sold out\", mjk says \"fuck you, everything we do is 'sellout' if we get money for it! we sold out when we made a record, expecting money for it. fuck you, how can you judge me without knowing me? fuck you, don't tell me I sold out, YOU bought our record!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nI think \"the man\" is referring to the record companies. And when Maynard says \"Before you point the finger you should know that I'm the man\" he's telling the kid that the record companies don't control him, he is in charge of his own band and he makes the descions of the band, not the record companies.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nThis song is obviously about a male prostitute named Landon Mills, who is not afraid to sell out for the ladies.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nThis songs meaning is in the title. This kid comes up to say how maynard sold out but the kid bought his albums, and made him famous (you cant be famous if no one likes you). Hooker with a penis, you pay a hooker for sex. Now if that hooker has a penis then its going to fuck you. So all maynards saying is his fans made him \"sell out\" (they made him famous). So your paying to be fucked, you pay them to \"sell out\". pretty good break down ay?\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nthis has got to be one of the best songs by tool... and Im pretty sure we've got it covered that its about some guy who was saying to maynard (not literally but, thats how its explained) that theyre (tool) sell outs now so the guy doesnt like them any more, and yeah maynards just saying a big fuck you to that. i have to admit, ive done that before haha, like 2-3 years ago i liked p!atd and fall out boy and shit (i dont like fall out boy anymore, like i dont like there music but i still like p!atd) and when they became mainstream, and everyone else loved them and shit i got so pissed off because everyone was acting like there were their favourite bands when theyve been around for ages and now theyre on the radio everyones like yay lets like them to be cool, so i stopped listening to them but i got over that and i listen to them again now, even though i only like some of their songs (music taste has changed), i know i was a dick for doing that. oh and i like old mcr stuff, but their new stuff is shithouse and since theyve become mainstream there music has become more pop influenced. which is annoying. anyway...\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nlove this song, my personal favorite from tool\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nlol he called him little buddy.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nSome guy tried to attack Maynard on stage during this song back in '96. Maynard floored and dry humped him. That is what this song is all about.\r\nI only worked out the lyrics a week ago - been singing it all week now.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nmaynard is the hooker with the penis and you retards are sucking it\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nI love this song. It's been explained, someone tells Maynard he's a sell out, Maynard in returns calls him a sell out for buying into society (Vans, 501s, etc) pointing out the hypocrisy in the kid's statement. I thought the song title fit very well. \"Selling out\" is just like prostitution, getting paid to do something for money in return.\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nMaynard is such a great writer, one of his less cerebral but straight to the point. Great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\ndeadcow666 i'm not a fan of fallout boy or any of that but calling them a sellout is the same thing as the guy w/ the vans isn't it. that was a very hypocritical statement. who are any of us to bag on people for making more money and making their music more wide spread so they can have a larger fan base. also what are 501's are they a type of van shoe or something? and how do u make the AE thing from aenima\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nI'd stillbe pretty happy that Maynard had written a song aout me if I was that guy.\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nOk really... C Mo... why don't you just stick to your pathetic rap and stay off of the real musics discussion boards.. Thats fucking pathetic\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nOK... C Mo... if tool is so gay... why do you flippen comment on all of the boards?\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nI like this song because it's one of the tool songs you dont have to think about a whole lot to get what he's saying.  Dont get me wrong i trying to figure em out, but its nice to have one given to ya lol\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nthis is one of tool's best songs, this and parabola are my favourites! i love how straitforward mjk is in this song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nI love the reference to the kid sipping \"coke\" when talking about sellouts. And how he has NEW tattoos, claiming he was OGT. I believe Maynard was a little bit pissed off at the whole \"sellout\" name calling thing. And he decided to let his feelings out in song. Also, you either have to not really give a shit at all about pissing off a huge genre of fans that have purchased your \"stuff.\" Or be so extremely confident in your music that it doesn't matter. Which I think is true in both situations with Tool. I like the last portion of the song's lyrics:\n\r\n-All you read and\r\n-Wear or see and\r\n-Hear on TV\r\n-Is a product\r\n-Begging for your\r\n-Fatass dirty\r\n-Dollar\n\r\n-So...Shut up and\n\r\n-Buy my new record\r\n-Send more money\r\n-Fuck you, buddy\n\r\nDoes it getting any more clear than that?\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nWow. Phenomenal song. Tool are a simply mind-blowing entity that the world is lucky to have. Anywho, so many people I know (not on here, but in reality) immediately dismiss this song for being \"fucking stupid\" or only laugh at the profanities. But the fact of the matter is, this song is the work of Maynard James Keenan's lyrical genius. It is obviously about an encounter he had with a boy who claimed to be a \"true\" Tool fan, dressed in a fittingly ironic inauthenticity, who accused Maynard of \"selling out\". There are awesome meanings in the profane lines, for instance, the chorus; \"I'm the man, and you're the man, and he's the man as well, so you can point that fucking finger up your ass\". It shows how each and every one of us is a cog in the capitalist system, and as a result of that, every single one of us is the famed \"man\" who is always out to get us. And the \"point that fucking finger up your ass\" is obviously a blatant fuck-off that basically screams \"I win, you lose. Bitch.\" Also, a thought on the title; a possibility as to why the song is titled \"Hooker With A Penis\" could be that the piercings, tattoos and other nuances of the boy's appearance made him look so ridiculous, that he almost looked feminine, or like a hooker with a penis. Just my interpretation and some food for thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nGreat song, period.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nhere is how I interrupt this part of the song,  \" I sold out long before you new my name \"  I think he is referring to his time in the Army here, I can relate being a service member myself as well as a poet, It really does go against the grain of who you are as an artist being in a controlled environment, Lucky for us he didn't decide to make a career out of it.  I am going Pusicfer in Vegas on the 13 of Feb. floor tickets too, My friend can't make so I  gotta an extra ticket, wanna go email me here, No BS.  this is my way of giving back to Maynard what he has given all of us.\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nI think the title is a play on words. Take the lyric \"...if I'm The Man then you're The Man and he's The Man as well...,\" and extend it to say even hookers are The Man, the play on words being that if a hooker were truly a 'man', she'd be a hooker with a penis.\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nWe are all sellouts in our own way you dont need to be rich and famous to be a sell out you just need to exist now-a days It is inevitable.\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nTool has been one of my fave bands for the longest time, every album they release is a mind-blowing experience. Anyone that thinks this band sucks should shut the fuck up and go back to listening to the Jonas Brothers. As for the song, it's pretty much giving the finger to all of the people that follow a band when they are \"underground,\" and as soon as the band goes mainstream those same people criticize the band for doing so. That is my interpretation at least...\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nAll I wonder is if this actually happened. Did someone actually come up to Maynard and say this crap to him? And, if so, I wonder what his expression was when he heard this song...\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nMaybe this has been said before somewhere, but it seems original to me. The obvious meaning is that Maynard hates sell outs and people who think they are non-conformist while actaully conform and just fake people in general.  He says \"I sold out long before you ever heard my name/I sold my soul to make a record\". What I didn't get was why he would call himself a sell out b/c he hates them so much. I think this song is also a reaction to all those ppl who are like \"Maynard is God\" and that he sees himself like a Hooker With a Penis b/c he is only human and not a god at all. He wants people to think for themselves, but they just listen to him w/o questioning him, which he doesn't like. I am putting words in his mouth though, thats just my interpretation of the song.\r\nOh and it would be hilarious if some commented like \"hey, i met maynard wearing Vans, 501s, and a\r\nDope Beastie tee, nipple rings, and new tattoos, told him i was OGT and bought his 1st EP back in '92 and told him he was a sell out between sips of Coke. I hate this song though, its nowhere near as good as their old stuff.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nI posted this on the RHCP's lyrics page for \"Around the World\" just the other day, and I feel it should be here as well....\r\n-------------------------------------------------------------------\r\nTry listening to the beginning of Tool's \"Hooker With a Penis\" and then the beginning of the Peppers' \"Around the World\" Maybe it's just me, but I swear they sound identical. I haven't seen any reference to them sampling the song either. Hmmm...\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nYou're all idiots with the exception of maybe GuythDan.  They like to joke around.  The song is a joke and you're putting far too much meaning behind all of this.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nI'm only 13 years old and I belive Tool is an amazing band. Anyone who calls Maynard a sellout, should at least keep it to themselves. Everybody stop being so hypocritical. Maynard will probably be more successful than most of you. Nobody knows exactly what Maynard has had to go through in his life so don't judge him or his lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nHe is saying \"You are a sellout ... what do you know?\"\n\r\nHe is comparing him to trolls on a message board.  Their opinions mean nothing.\n\r\n'Trolls on a message board' would be a good name for a song.  I'd like to hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nI agree with the person who said that Keenan himself is supposed to be the hooker with a penis. Basically, yes, he's selling himself out (like a hooker selling their body on the street), but he's still the one fucking you (with this song and, metaphorically, his penis!).\r\nI've seen live footage of him performing this song, too, in which he was dressed up as a woman, which I would say supports this theory.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nYou know, really, even this song is a product. Tool did sell out, mind you, and thats what he's saying. He is telling everyone who complains about it to fuck off, because everybody sells out. Dont misinturpret this comment please or ill have to verbally kick your ass. Listen to the song again before you tell me im wrong.Hypocracy is something that everyone hates, and so MJK experienced that and put it into a song. For the record, i fucking love tool, so as i said, dont trip on me, because im not bashing in any way. \t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nThis song is so great.  Cracks me up everytime I hear it.  There are very few bands that could get away with these lyrics.  I don't see how anyone could be exclusively an OGT.  I enjoy Opiate as much as the next guy, but it is far from their best stuff.  I would rate Jerk Off as one of their best though.  That scream at the end (live mind you) is insanely wicked to the wicked degree.  \n\r\nIf they truly sold out, they would pump out a new album every year or two instead of every 4 or 5 years.  You know Adam could easily have his own silverburst line of guitars.  Heck, everyone one of those guys could have their name on something with the snap of their fingers.  Additionally, their music would gradually suck more and more, which has not happened.  In a day with so few decent bands, it's hard to call Tool sellouts.  If Tool is a sellout then EVERYONE is a sellout.  Sooooo, suck my balls!\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\ni think that since maynard was in the army before he joined tool, he shoulda popped a cap in that kids ass!!! haha...\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nthere is no \"and\" in \" nipple rings, and New tattoos\"  so it should read \" nipple rings, New tattoos\" and im about 95% sure its \"sniff of coke\"\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\ni think this songs about chino moreno of deftones..\r\ni heard somewhere that he was the \"boy\" talking to maynard, and maynard got pissed the fuck off and wrote this song about their conversation.\r\ni could very well be wrong..\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nPoint #1- I once heard another artist say that in order to make a living as an artist, you have to sell out a little bit. To compromise what your own art means to you in order a make a marketable product of it. So in a sense, he did sellout. But only a little bit.\n\r\nPoint #2- I think its funny that so many people want to say that they \"know\" The true meaning of any of these songs, when they the whole reason Tool doesn't print their lyrics in the albums is so that people are free to interpret the lyrics as they see fit.\n\r\nPoint #3- I always thought the \"Hooker with a Penis\" was the boy in the song. Has no one ever heard of a male prostitute!!\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nDefinitely a good punch in the face to these imbeciles who say 'they sold-out, blah blah'. \r\nIsn't that the damn point! Make music = make money. Also, what the heck is so bad about one of your favorite bands gaining a broader audience? It just means they will be around longer. I can't stand kids who have no common sense, who don't even understand what the hell they are talking about, and use these moron phrases simply because it makes them seem 'in the know' or knowledgeable about something. In fact, it doesn't and the next little douche-bag who says it is going to get an earful and maybe a punch in the face. \n\r\nGood song, Tool. \t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nIt's simply about a \"original Tool fan\" saying Tool is selling out. Every band has those fans and I'm pretty sure they hate those fans, Tool is just saying what every band thinks when they hear someone tell them they're selling out.\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\ni think it's a kick in the face to anyone calling him a sell out who is obviously by description a sell out too. also that the sell out theory is so black and white, i believe  he means that by  this guys definition he has sold out but his definition has no merit because of  the lifestyle the dude lives with his brands and stuff. end of the day i don't like sell out bands but sell outs to me are bands who change what they write just to be famous and have money, they give up what they believe in and let dreams of money chicks and fame interfere with their music. and there is no way by that definition that tool have ever been sell outs.   good music, meaningful music and  at least contributes to society, rock on\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nThis is what makes Tool so fucking cool...they don't give a FUCK about what ANYONE thinks besides themselves.\n\r\nThey're making music for the band...not for you.  If you like it, great...but don't you dare tell these guys what to do because your ideas suck anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\ndoes anyone else hear the subliminal whispering in the background?? lol idk what it says but i just noticed it\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nThe song is written to an individual who had interviewed Keenan.  Basically, what he's saying is You're wearing all this name brand shit and drinking name brand soda during this interview and you're calling ME a sellout??\n\r\nAnd when he says \"advice\" with stress on the AD, he's speaking of advertising and marketing.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nBiggest clue is in the beginning of the song: \"claimed that he / was OGT / from '92 / the first EP ... \"\n\nOGT is \"Original Gangster Tool,\" or someone who is not just a Tool fan, but who only listens to the \"Opiate\" EP (released in 1992, duh). Artists whose so-called hardcore fans accuse them of selling out may relate to this scenario, but the song specifically and intentionally confronts fans of early Tool -- people who refuse to accept the value and relevance of the band's more recent work.\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nIt refers to a fan who accused the band of going soft, or selling out after releasing 1992's Opiate. Maynard responds to the fan by pointing out the hypocrisy of such a statement, noting anyone who listens to bands and buys music is a sellout themselves and that everything you \"read and wear and hear and see on TV is a product\". \"OGT\" is taken to stand for \"Original Gangster Tool\"\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nTool hated hipsters before it was cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nI have been told by many die hard Tool fans that this song is about Fred Durst and how he said that Tool was selling out. It would make sense because \"from '92, the first EP\" could reference when he began making \"music\" in 1992. \"claimed that he was OGT\" because of his terrible rap-metal style. Ironic that shitty Fred Durst would try to call out Tool for being sell outs...\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nMaleia 1000\r\nIt means the boy is a dumb ass, and bend over buddy, I'm making money off you \t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nThis song is a follow up to 46 and 2.\n\nIn 46 and 2 the song is talking about the next step in human evolution and the most powerful state in conscience. The 46 chromosomes during our type as a fetus in the womb help determine our gender, but after the transition that is \"46 and 2\" the person is now confused on who he/she is. They cannot decide who their identity is and is mixed up like a \"hooker with a penis\". The lyrics are all weird and shit to symbolize the confusion within the whole spiritual transition in the whole album.\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nAr3s, i totally agree.  I h8 it when i start to like something and then it gets sucked into the world of Fad and what everyone else listens to.  I used to LOVE Linkin Park, but now they're just a bunch of sell-outs because these little 13 year old people are running around watching MTV which decides what THE WHOLE USA LISTENS TO!!! (in majority on the Teens part) My 2 friends and I are especially destroyed by this because we're only 11 and we're the only people who even knows who Tool or Flaw or S.O.A.D. is IN OUR HOLE SCHOOL!!! \t\t\t\t\n\t\t\t\t\n\n"}