{"comment_0": "\nI would think that having never caught a rabbit would actually help refute the accusation that one is nothing but a hound dog.\n\n\"You're nothing but a snake, and you've never swallowed a mouse.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nHound Dog was written by Lieber and Stoller for an R&B singer Big Mama Thornton who did a low down and grittier version of it.  It features one of the coolest guitar solos of that time period.  The Elvis version is a more hyperactive version of the song.  No less or better than the original in my opinion just different.  It rocks.  Watching Elvis do the \"raunchy\" version on that old tv show was certainly a big moment in rock and roll history.  I think it's one of the coolest things I've ever seen.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThe Elvis version is good in its own respects, but nothing compares to the Mama Thorton version. That is AMAZING! It just  puts me in a great mood and she sings with such a  passion.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI swear at one point he says \"you never cut a record, you aint no friend of mine\"....or maybe thats just me. Such a great song to shake yo hips to.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nHas anyone heard Robert Palmer's version from his last album 'Drive'? It's a cover of the ORIGINAL blues version. \r\nLyrics are:\n\n\r\n\"You ain't nothin' but a hound dog,\r\nbeen snoopin' round the door\r\nYou ain't nothin' but a hound dog,\r\nbeen snoopin' round the door\r\nYou can wag your tail, \r\nbut I ain't gonna feed you no more\n\r\nYou told me you was high-class,\r\nbut I can see through that\r\nYou told me you was high-class,\r\nbut I can see through that\r\nNow mamma I know you're just an alley cat\n\r\nYou ain't nothin' but a hound dog,\r\nbeen snoopin' round the door\r\nYou're just an old hound dog,\r\nbeen snoopin' round my door\r\nYou can wag your tail, \r\nbut I ain't gonna feed you no more\n\r\nYou nearly had me fooled, \r\nbut I ain't throwing you a bone\r\nYou nearly had me fooled, \r\nbut I ain't throwing you a bone\r\nBecause you ain't no tiny-dinner (?)\r\nYou stole my soul\n\r\nYou ain't nothin' but a hound dog,\r\nbeen snoopin' round the door\r\nYou ain't nothin' but a hound dog,\r\nbeen snoopin' round the door\r\nYou can wag your tail, \r\nbut I ain't gonna feed you no more\"\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nthe song is like 2:16 and it doesnt take a chapter of writing to create great music. the song just picks you up and gets you going. easy to follow. simple and fun. dont hate.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song is as is implied about a character who believes a friend of his to be a hound - dog, simply because he is crying all of the time. It is possible that if he has some sort of medical condition or mutation which means that he has no tear ducts, and if he has lived an entirely solitary life then he may not realise that human beings are capable of crying, but that he has seen a dog cry before. This is how he mistakes a human being for a species of dog, having seen very few human beings, let alone one in distress enough to cry.\n\tIt is the next section of this song that is considered the most controversial and dubious of all, as the singer refers to his misidentified subject as having never caught a rabbit and not being as friend of his. It has long been a debate amongst musicologists about whether the man who is misidentified as being a canine was not his friend to begin with, or whether being his friendship is subject to having caught a rabbit. May this debate continue for many years.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nevery time I want to write something, but I'm afraid because I do not speak English particularly well, so that once I am sorry for the mistakes\nabout this song, t is unclear how plainly perceive it, and so I had the idea that since the song was originally written on behalf of the on behalf of the woman that threw a man (played by Big Mama Thornton), the most natural way take it like a songâ\u0080\u0099s character was thrown by the girl, and he sing that was said to him, and then a little bitchy manner of performance of Elvis become justified\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nLots of people cry just to get their way. Shamelessly.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI like to think the song was based on this taleswithmorals.com/…\n\n\n", "comment_10": "\nI love this song .My Mom is really likes him.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\njesus christ ther is only 4 ppl or 5 now writin about the king....... i ffind that hopeless this song is awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nu no y theres noone commenting this song or the king? cause its like 60 years old and the elvis died of a drug overdose and was a fat horny slob!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nHey ledskynyrd, you aint no English major.  It's just a simple blues song that made him a ton of dough, not bad for a non song.  Elvis had more talent in one pube than you could ever imagine of having, loser.  looks slike you aint nothin but a hound dog scratchin round this site.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ni love the line 'well they said you was high classed well that was just a lie'\n\r\nlovin it!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ncool tune bitch\t\t\t\t\n\t\t\t\t\n\n"}