{"comment_0": "\nI wish John were alive to see this site.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe song was written after the Beatles were going through fan mail, and they picked one out at random, which turned out to be from a school John had attended when he was young.  And, the letter said that they were analyzing the lyrics of his songs in class.  So, John wrote the nonsensical I Am The Walrus, largely based on The Walrus & The Carpenter by Lewis Carroll.  It has been said that some of the lines were written by John under the influence of LSD, but Paul had nothing to do with it.  It was John scribbling on scrap paper (I believe some of the handwritten lyrics to this song were auctioned off a couple years back).  Semolina Pilchard, by the way, was a combination of two names of nasty foods John remembers eating as a child.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nJohn wrote this song and said,\" If Bob Dylan can write this crap, so can I.\" Just if anyone was wondering.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI read in a book once that this song was John's answer to all the people interpreting his songs because \"it doesn't mean anything\".  \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nit is true that the Beatles deliberately put hidden messages and meanings in their album covers and lyrics and recordings just to keep their fans frothing at the mouth.\n\r\nthe Beatles never took themselves seriously.  their music may have taken a serious tone by the time Sgt Pepper was done, but the Beatles never took themselves seriously as a band.  \n\r\nJohn, for one, resented all the hype and worked feverishly toward the end of the Beatles' career (along with Yoko) to destroy any little box the media and the fans tried to put them in.\n\r\n\"I Am the Walrus\" was based on Carroll's \"The Walrus & The Carpenter\" as Jabbatut pointed out, but was more along the lines of Carroll's \"Jabberwocky\" in terms of nonsense.\n\r\nthe lyrics all have some foundation in Lennon's childhood and early adult life pre-Beatles.\n\r\nthe lyric about the Eggman is supposedly about Eric Burdon, of fellow Brit band the Animals (House of the Rising Sun).  Eric Burdon apparently liked to involve eggs in the bedroom, and John was taking the piss out of him.  the Eggmen would be the rest of the Animals.\n\r\nand yes, tho debatable, it does sound as if there is a crowd chanting \"Smoke pot, Smoke Pot, Everybody Smoke pot\" in the background.  \n\r\nalso amidst the flurry of voices in the end of the song you can hear the Beatles singing the lyrics from their past hits, which is something they did quite often!\n\r\nJohn actually wrote the song after he found out a class at an English University was started for the sole purpose of deciphering the Beatles' lyrics.\n\r\nreportedly, after recording the song, Lennon smiled to producer George Martin and said, \"There, let those buggers figure that one out.\"\n\n\n\n", "comment_5": "\njohn wrote the two first lines on two separate acid trips the rest of it was a bunch of random stuff just to piss off people trying to find meaning in his songs including part of a nursery rime he got from a friend (Pete Shotton)\"yellow matter custard\" etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\na philosophy for life: everyone in their lifetime is at one point the walrus, the eggman, and even.. the goo goo goo joob. so i suppose the walrus is the leader, the eggman is the follower, and the goo goo goo joob is just undecided. this song holds all the answers.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nOk, and Paul was supposedly dead because he wasn't wearing shoes on the cover of an album, and Come Together was supposed to mean at his funeral.  MAybe people should stop trying so hard to find 'hidden meanings' and stop playing their music backwards looking for little things that really aren't there.  I realize they were heavy into drugs, but I really don't think they tried to push them on anyone, and their music was too important to them to do that.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nTrue, John Lennon said the song was \"Tongue and Cheek,\" and had no meaning.   But then again, the meaning could have come out of his subconscious.   If you watch the video and listen to the words, you hear a lot of tongue and cheek, but then again, there's the persistent theme of trying to understand a complicated society.   In the end, you could hear what sounds like John saying, \"I educate myself.\"    John said similar comments about another Beatle song, but watching him sing, he's clearly trying to convey a message.    So in a nutshell, I believe the song is about a brilliant mind trying to grasp meaning to a complicated society; his spirit very active amidst the confusion.   Perhaps Mr. Lennon might agree to that one?      John.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nSorry to disappoint you but (according to George Martin's original hand-written score) the voices are actually singing \"Got one, got one, ev'rybody's got one!\" and \"Oompah, oompah, stick it up yer jumpah!\" They were professional singers hired in for the session, and also did the \"wooooh!\"s and the various \"hee-hee-hee, ha-ha-ha, ho-ho-ho\" bits. Also, the lines from Shakespeare's \"King Lear\" were mixed in live from a BBC radio broadcast - it was just a coincidence that it was on air at the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI like the line \"Expert texpert choking smokers \r\nDonâ\u0080\u0099t you think the joker laughs at you?\"  It's pretty self-explanitory.  It says how we have so many imperfections but we think that we're perfect\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nJohn was tired of people trying to find meanings in his songs, so he made this song to confuse people. I'm pretty sure his exact words were, \"Let the fuckers figure this one out.\"\r\nHaha, go John.\r\nSo stop trying to find meanings in the song, because you really won't... it's a song that means nothing. Those of you trying to find meanings, well, John would be laughing at you.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nyeah, i would say this is a product of john randomness. funky little song..it's cooool.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nA lot of the lines in this song come from old liverpool playground songs eg, \"yellow matter custard dripping from a dead dog's eye\". I think this is just a mixture of all john's experiences through life totally meshed together in a dream-like way through the use of LSD. Maybe it doesn't mean anything at all but i'm sure that it meant something to john, even if it was only that nothing really makes any sense. ? ?\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthis is the best of what i consider the \"new school\" or \"hippy\" beatles.  great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni've heard that john wrote this song to screw up people that always try to analyze songs.  did a pretty good job so far.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nBy the way, the words in the middle are (with times)\n\r\nOsw. Slave, (3:53) Thou hast slain me:- villian, take my purse. If ever thou wilt thrive, (4:02) bury my body, and give the (4:05) letters which thous findest about me to (4:08) Edmund Earl of Gloster. (4:10) Seek him out upon the British party. :- O, (4:14) Untimely Death! \r\nEdg. (4:23) I know thee well, a (4:25) serviceable villain. As duteous to the (4:27) vices of thy mistress as badness would desire. \r\nGlo. What, is he dead? \r\nEdg. (4:31) Sit you down father, rest you. (Ends) Let's see these pockets, the letters that he speaks of may be my friends.. He's dead. I am only sorry he had no other deaths man. \n\r\nKing Lear :)\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\ni've heard this is related to the paul is dead theory (i'm very interested in it if anyone wishes to share clues). supposedly when humpty dumpty fell off the wall he said \"goo goo g'joob\" in some version. paul is the walrus on the cover on magical mystery tour so he is the one cracking his head like humpty dumpty...i know its weird and i don't entirely believe it but i thought it was interesting\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThank you, butterfingers. I was about to go ballistic on these people for saying \"Everybody smoke pot.\" Argh.\n\r\nWhen being interviewed once, John was asked \"Everybody's got one what?\" and he said \"One asshole, one penis, one vagina, you name it.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThe story I heard about this song was that it was written at a time when people were over-analysing The Beatles songs looking for hidden meanings. To make up an imaginary egsample: \"When John says 'I wnt to hold your hand', what is he really saying about the socio-economic impact on south-east asia as a progressive result of amazonian logging?\" when what he actually means is \"I want to hold your hand.\" So john wrote this one which makes no sense whatsoever and said to Paul: \"There you go. Lets see the fuckers try to work this one out.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThe song is a string of very important but not connected ideas.  So to say it is gibberish is a bunch of bullshit, but to say it all has one meaning does as well, as it seems the song changes theme every two lines or so...\n\r\nThe beatles not liking the hype: they didn't, they were more about music and artistry...but who wouldn't enjoy it somewhat.\n\r\nThe joker line refers to John saying that people who smoke or do anything and think \"it can't happen to them\" will have the joker literally laugh at them...and get screwed over just like everybody else...\n\r\nYes, the beatles did drugs, but most of the time while recording they were on a mild high or smoking...in fact most of the time it was just cigarettes and such...and those who think this is a drug song, you fail to relize the deepness that is within this song.\n\r\nAnd at the end of the song the lyrics are \"Ev'rybody haha!\" (repeated) so this smoke pot bullshit is...well...bullshit.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nObviously, this song is about 'being the walrus' and how as the walrus we must fight for the walrus way and bring together our warring walrus clans so that we may better defend ourselves from the one eyed devils. I think maybe... Yeah deffinately.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nJohn Lennon wrote this, but it was released as the B-side to \"Hello Goodbye,\" which Paul McCartney wrote. This angered Lennon because he felt this was much better. \r\nLennon wrote most of this while tripping on acid. The up and down rhythm was inspired by a police siren he heard. \r\nLennon made sure the lyrics didn't make sense so he could confuse all the people trying to analyze his songs. He got the idea for the oblique lyrics when he received a letter from a student who explained that his English teacher was having the class analyze Beatles songs. Lennon answered the letter; his reply was sold as memorabilia at a 1992 auction. (thanks, Emery - San Jose, CA) \r\nThe voices at the end are from a BBC broadcast of the Shakespeare play King Lear. \r\nThe idea for the Walrus came from the poem The Walrus and The Carpenter from Alice in Wonderland. In his 1980 Playboy interview, Lennon said: \"It never dawned on me that Lewis Carroll was commenting on the capitalist and social system. I never went into that bit about what he really meant, like people are doing with the Beatles' work. Later, I went back and looked at it and realized that the walrus was the bad guy in the story and the carpenter was the good guy. I thought, Oh, s--t, I picked the wrong guy. I should have said, 'I am the carpenter.' But that wouldn't have been the same, would it?\" \r\nWhen Lennon decided to write confusing lyrics, he asked his friend Pete Shotton for a nursery rhyme they used to sing. Shotton gave them this rhyme, which Lennon incorporated into the song:\r\n\"Yellow matter custard, green slop pie, all mixed together with a dead dog's eye.\r\nSlap it on a butty, ten foot thick, then wash it all down with a cup of cold sick.\" \r\nThe song's opening line, \"I am he as you are he as you are me and we are all together\" is based on the song \"Marching To Pretoria,\" which contains the lyric, \"I'm with you and you're with me and we are all together.\" (thanks, bertrand - Paris, France, for above 3) \r\nThe choir at the end sings \"Oompah, oompah, stick it in your jumper\" and \"Everybody's got one, everybody's got one.\" \r\nThis song helped fuel the rumor that Paul McCartney was dead. It's quite a stretch, but theorists found these clues in the lyrics, none of which are substantiated:\r\n\"Waiting for the van to come\" means the 3 remaining Beatles are waiting for a police van to come. \"Pretty little policemen in a row\" means policemen did show up.\r\n\"Goo goo ga joob\" were the final words that Humpty Dumpty said before he fell off the wall and died.\r\nDuring the fade, while the choir sings, a voice says \"Bury Me\" which is what Paul might have said after he died.\r\nDuring the fade, we hear someone reciting the death scene from Shakespeare's play \"King Lear.\" (thanks, Tommy - flower mound, TX) \r\nThe BBC banned this for the lines \"pornographic priestess\" and \"let your knickers down.\" \r\nLennon got the line \"Goo Goo Ga Joob\" from the book Finnegan's Wake by James Joyce. \r\nIn The Beatles song \"Glass Onion,\" Lennon sang, \"The Walrus was Paul.\" He got a kick out of how people tried to interpret his lyrics and figure out who the Walrus was. \r\n\"Semolina Pilchard\" was Detective Sergeant Norman Pilcher, head of the Scotland Yard Drugs Unit. He led the arrests of both John Lennon and Brian Jones et al, before being investigated himself for blackmail and bribery in the '70s. (thanks, Matt - London, England) \r\nEric Burdon (of Animals and War fame) stated in his biography that he is the Egg Man. It seems he told John Lennon of a sexual experience he was involved in where an egg played a major part. After that, John called him Egg Man. \r\nELO's song \"Hello My Old Friend\" has an identical form to this - almost the same tune and orchestration but different words. No wonder Jeff Lynne is sometimes referred to as the 6th Beatle. \r\nIn the Anthology version of this song, they experiment with 4 octaves in the intro. Also, just before Lennon says, \"Sitting in an English garden waiting for the sun,\" Ringo does 2 hits on snare and floor tom before hitting crash. (thanks, Riley - Elmhurst, IL) \r\nIn an episode of The Simpsons, \"The Bart Of War,\" airing May 18, 2003, Bart and Milhouse break into a secret room in the Flanders' household to discover that Ned is a Beatles fanatic. Bart takes a sip from a can of 40-year-old Beatles-themed novelty soda and quotes this song: \"Yellow matter custard dripping from a dead dog's eye,\" while Milhouse takes a trip and sees various Beatles inspired hallucinations. (thanks, Ashley - Moncton, Canada) \r\nStyx covered this song in 2004. They made a music video for it with a cameo from Billy Bob Thornton\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\n\"Donâ\u0080\u0099t you think the joker laughs at you?\"...That line is so great, very deep; I don't care what anyone says about LSD and writting this song and how it doesn't mean anything. It's deep, mainly that line...for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nHow people would always try and decipher his lyrics and yet miss the man.  Heâ\u0080\u0099s having fun at the listeners expense, and delivering a personal message through the only non-whimsical line is: â\u0080\u0098Iâ\u0080\u0099m cryingâ\u0080\u0099\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\n a.)I have read that this song was written as a satire to those scholars who try to dissect The Beatles Songs.\n\r\n b.)I believe that the meanings have either come from laid back gibberish or memories.\n\r\n c.)This song is my religion. I am a follower, yes.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nHAHAHA THIS SONG IS AWESOME!\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI may be repeating what someone else may have said previously but John Lennon made this song out of 3 songs he was was working on when he found his school teacher was setting work for his students to discipher Beatles lyrics, John Lennons actual words whe he strung all three songs together and finished it said \"F**K**G WORK THAT OUT\"!\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nwell i think this song is the best song in the whole world including every other beatles song....                                                                                                                                THEY ROCK!!!!!!!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nPart of this song was written while John was on an acid trip but the reason for the song is too fuck with people. Everyone was trying to analyze the beatles lyrics so they decided too write a song that didn't mean anything. Then there was sort of some philosophy behind it and everyone thought Paul McCartney had died and was replace by a look alike. So Lennon said McCartney was the Walrus so people further speculate\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nJohn and Paul were reading some fan mail when Paul found a letter from a boy who went to their old \r\nschool. In the letter the boy mentioned that his English master would use Beatles lyrics in class.\r\nHe would put the lyrics on the blackboard and the class would write down their analysis of the lyrics.\r\nThe teacher would then give his interpretation an that was always slightly different to what the children\r\nthought. I think he gave a specific example. Paul read the letter to John, who thought this was interesting and said something to the effect of 'analyse this then'... and came out with one of the most nonsensical lines of the song immediatley - I think it was the one about the pilchards. Paul thought this was hystericaly funny and they both started coming out with lines that ended up in the song. John edittedd the ideas together into the song and it was finished quickly.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThe first few lines, Lennon admitted, him and Yoko wrote while on acid.  He said that the rest was complete and udder useless ramblings written while completely sober.  He thought it was funny that everyone from other artists to college students were trying to analyze all the bands songs so he wanted to write something that would throw everyone for a loop.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nFrom what I've heard, it doesn't really mean anything in particular. It was written to confuse all of those crazy people trying to \r\nanalyze all of The Beatles' music to look for clues for the whole \"Paul Death Hoax\" thingy..\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nLOL! Actually, I am laughing at-uhhh... i mean with- the ones who try to find the meaning of this song\r\nThe story is...\r\nJohn Lenon once found out that a teacher from his old school was teaching his students about song interpretation of lyrics using his songs, so he wanted to have some fun and make a completly sensless song this one, oh that John is EVIL indeed.\r\nImagine you, in elemantery, trying to find out an eggman sitting on a cornflake means\r\n*head explodes*\r\n(insert irony here)\r\nL.O.L.\r\n^-^\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nthere is no meaning to this song it was made to be complete randomness with no deeper meaning\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nACTUALLY, i was reading patty boyds autobiography(and those who dont know she was married to gorge harrison..a beatle.) this song was actually about a cop who used to try to frame the beatles and get them caught with drugs. he succeeded with john lennon and gorge harrison. if you read eric claptons autobiography he will also say this. its not about drugs or written during a acid trip. true they were on acid and drugs back then, bit this song isnt about that. LEARN your facts. and you probably call yourself a beatles fan. WHATEVER!\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nthisÃ¯Â»Â¿ song was a response John Lennon had to some English teachers in Britain who were analyzing Beatles songs in their classes, to throw them off. Worked well huh?? \t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nFinally, a site that posts \"goo goo g'joob\" instead of \"koo koo k'choo\"\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nthis song is just a big f you to every one who tries to over analyze songs and look for meanings like this site does lol this song has no meaning but it does have a story\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nDidn't Lennon say in a Playboy interview that when he wrote this song, he commented, \"let the f***ers figure this one out!\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nIt has no meaning at all. John Lennon absolutely hated the school he went to as a kid. The school ended up having students do a project on the meaning behind various Beatles songs and when he found out, he wrote this to mess with them. No meaning at all, just pure trickery.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI have read that John Lennon was inspired to write the beginning notes as he sat at his piano one night, and heard a British police siren go by.\n\nIt seems that John Lennon preferred to keep his songs pretty clean. Like they were \"doable\" live. Knowing this, Paul McCartney was in cahoots with George Martin to add lots of strings, other instruments, and sound effects. Possibly just to piss him off. But it is reasonable to assume, for the most part, that he eventually signed off on Martin's final version.\n\nAs for Paul, there was payback! Namely, the way that Lennon had Specter turn \"The Long And Winding Road\" into something like a highly orchestrated and dramatic movie score.\n\nRumor has it, Paul never even heard it until the vinyl was pressed. And he was none to happy about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nTo me this song is about how people judge each other so harshly and hurt each other; but at the end of the day we are all alike, and are fragile like eggs to some degree.  At the end of the day respect and trust is so important. If we analyze the Walrus totem, we would see how important caring, respect and kindness is. \t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nLOL@BWoodmeyer\n\r\nBest thing I've seen all day \n\r\nLOL\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nStop it, I have to die laughing... :)\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nBiteMe: No, they don't say  \"Smoke pot, smoke pot, everybody smoke pot.\"  They do say, \"got one, got one, everybody's got one.\" Thank you butterfingersbeck for pointing that earlier. \n\r\nThe whole Paul being dead thing was something they played with. Somebody looked into a song a bit too far, The Beatles got wind of it, and went with it. Here's what I know about the whole thing:\r\nApparently, the cover of Sgt. Pepper's album is supposed to be Paul's funeral, atleast that's what I've heard. And if you hold a mirror in the right spot on the bass drum in the middle, there's supposed to be an arrow that points to Paul and it should read \"he died\" or something like that. Paul's hand is on Ringo's shoulder (the clay figures), to comfort him...On the back cover, paul is the ONLY one that is standing with his back towards us. signifying him being dead (not sure how, but it does). In the Magical Myserty Tour movie, there's a scened where they're all singing and dancing and Paul has a black rose on his jacket, also signifying his death. To go back to the comment someone made about Paul being the man that died in the car, and that he was looking at a meter made, the meter made was Lovely Rita.\r\nThe Abbey Road cover...The license plate on the VW Beetle reads \"LMW(which I haven't heard has any meaning) 28 IF\" The 28 IF supposedly means that Paul would have been 28 if he was still alive. John is wearing White and is represents God, Ringo, in his suit represents the Preacher, Paul - no shoes - dead. George, in his denim is either a Pall bearer, or a grave digger. \r\nI saw all of this on a special on VH1. It was interesting. I also have a few Beatles books...such as the anthology book. Gives you a bit of insight into it all. That's all I've got...\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nfavorite line: Dont you think the joker laughs at you? it could be a reference to john's distaste towards the over-analyzation of his work. to say that john simply wrote songs to baffle listeners is trash. every song john wrote... even if only one line makes sense, has at least one amazing philosophy. If john really wasted his genius to write songs that were bullsh*t he was a petty man. but ive never seen a song that didnt have some intellectual worth... \"I am he as you are he as you are me...\" i take it as we are one and connected spiritually. In his songs he either puts forth an astounding philosophy like the one above or he creates really cool images. this song in particular contains some of those cool images.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThis is one of my favourite Beatles songs... I think it is soo cool. Okee, lol, sorry but I always wondered (and I am sure this is wrong) if this song was referring to literature or something. Sounds stupid but I dunno... \n\r\nAlso when they something about sitting in an english garden waiting for the dun, if the sun don't come you get a tan from standing in the english rain....are they refferring to polution?\n\r\nJust Curious. Don't call me a dumbass or anything I am not trying to prove anyone wrong... Im just looking for answers,\n\r\n:)\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nsmoke pot smoke pot everybody smokes pot, i like that better then the got one got one thing I'm going with the smoke pot one..........\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI listened to it really hard ( because i have no life) and i think he is saying fucked up fucked up everybody fucked up. thats my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nits just john playing around with words. but the first line is great. very catchy 2, a classic, and amazing beatles song. and do u hear the shakespeare at the end??\n\r\n\"I am he as you are he as you are me and we are all together\"\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nTHE BEATLES NEVER TOOK THEMSELVES SERIOUSLY,HE WAS NEVER REALLY INTO THE HYPE OF THE BEATLES,THATS WHY HE MAD THE COMMENT ABOUT BEING BIGGER THAN JESUS-THAT PEOPLE DID PUT THEM ON A PEDISTLE OF COURSE HE WASNT SAYING THAT THEY MORE POWERFUL OR ANYTHING HE WAS MEERLY SAYING THAT PEOPLE HYPED THEM TO MUCH,BUT IT IT WELL DESERVED THEY HAVE WRITTEN SOME OF THE BEST SONGS I EVER HEARD AND \"YESTERDAY\" IS THE #1 SONG FOR COVERS,ITS TRUE LOOK IT UP.THE SONG IS BASED ON THE WALRUS AND THE CARPENTER,IT SOME OF HIS FAVORITE LITERATURE AS A CHILD.THE BEATLES PUT MESSAGES N THEIR MUSIC AND DURING THE \"PAUL IS DEAD\" THING THE PUT REFERENCES IN THE MUSIC TO THROW PEOPLE OFF.I THINK THAT COLLEGE STUDENT STARTED THA HOAX ABOUT PAUL BECAUSE HE WAS CONSIDER THE CUTE ONE AND HE WANTED ALL THE LITTLE TINY BOPPERS TO WORRY>\r\n     NON THE LESS ITS A GREAT SONG AND PROVES TO BE ANOTHER EXAPLE OF JOHN LENNONS GENIUS!\r\n(FOR THE RECORD WE ALL KNOW TO MUCH FOR ARE OWN GOOD)\n\n\n\n", "comment_52": "\n(PARDON ME I MADE LOTS OF MISTAKES,I WAS TYPING TO FAST-BUT YOU WHAT IM SAYING)\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI heard that there is a British- (or something) folktale that when you see a walrus it is the ghost of someone who recently died...  This might have alot to do with the Paul Is Dead theory... Also, in Glass Onion, the line \"the walrus was paul\" is quite relavent.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThe licence plate on the beetle reads LMW this means Linda McCartney Weeps \r\nYes this song is about Paul!! Walrus represents death Paul is the Walrus. Egg man  yep humpty dumpty. and I woulden't believe John when he says what songs meanings, or Pual\r\nex one time paul said he had a black rose because they ran out of red roses. black roses are very rare and red roses are very common!\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\noh yeah also note:\r\nthe bit about police men, William Shears the guy that played the part of paul use to be a police man for canada,  \t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis song was John Lennon getting angry at the world for overanalyzing. He pulled most of the words out of a hat.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nhey tusedays gone LMW is said to meen Linda Mcartney Weeps just thought u might like 2 no\n\r\nP.S.  I'm not the Beatles #1 fan even tho i like them so if i spelt ne thing wrong sorry... like I said im not their #1 fan\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThis song is just John's liking for the word play in Through the Looking Glass. No real deep crazy meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\npaul was never a police man in canada\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\ni think the policeman that they were talking about was william campbell, the paul lookalike.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nJohn Lennon could not write his way out of a brown paper bag\n\r\noooooooooo you've got big sheds\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nJohn loved to fool the press especially. It was\r\njust words on paper. One word not relating to \r\nthe next.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\ni think the beatles were smoking copious amounts of drugs at this poiint. i find the paul conspiracies quite interesting. if he is dead though, who is paul macartney today. anyoen know any good conspiracy websites?\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI think bite me has a point in the crowd sayin \"smoke pot smoke pot everybody smoke pot\"     incase u wanna listen it begins on 3:30 of the song\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\ni think that people need to chill out. the beatles were a band, and its members were JUST people that could play instruments. albiet this is a cool song but you dont have to get angry if people dissagree with you about the meaning....what THAT said...\n\r\nthis is the only beatles song i like, its great because it says alot. it means alot and its still fun, obviouslly like the songwriter and band...they have a lot of theroies on life but they're still chill and dont get upset about it.\r\nall of you argueing this song almost ruins it because to me, the whole thing is about thinking and seeing important everyday things that resonate with your mind and having fun with them.....\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\njohn said he liked to write songs with no meaning just to freak people out. thats so great.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nfor not having a meaning and all, i relate to it very well\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nall i have to say is they were incredibly high when they recorded this song. They are the most wacked out and amazing lyrics i have ever heard. This is one of the songs that make the Beatles... the Beatles\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nOasis did a pretty good cover of this song, it can e found on their B sides album, The Materplan.\n\r\nreally good song...and paul Mcatney isnt dead people...hes the richest musician in the world right now...\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nnobody thinks paul is dead, buddy. this song is awesome, just shows the genius of lennon. one of my favorite beatles songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI'm not sure a walrus says 'GOO GOO Gâ\u0080\u0099JOOB' but I have to give John credit, great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI used to believe the paul is dead thing was just a hoax, until i saw this: \n\nfreewebs.com/breathingcadaver/… \n\n\r\nTell me what you think...\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nIf you have ever smoked pot then you get this song you just do\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nThe song was written when there was much publicity about hidden meanings of songs, etc., playing records backwards, etc. This is John Lennon saying, \"I give 'em something that'll keep 'em busy for years...and they'll never figure out that it's just rubbish.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nAdman,\r\nexactly, that's right on.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nwell i just assumed some sort of acid trip when i heard this one and thought nothing more, but it's interesting hearing other peoples thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThanks Philadelphia Eagles...BTW, I looked at your link...pretty wild eh?\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nZappa's live version, really puts the Beatles to shame.. Listen to Zappa.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nthis song is obviously paying homage to one great sea creature of our socitety today....the walrus.....and the goo goo goo joob and if youre not aware what that is...then go to china.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\noh for Christ's sake!!!!!! did u actually believe the stuff that was written on that site, philadelphia eagles??!!! it's the worst rubbish i've ever seen!!! paul is not dead!! and that site was really really bad, especially the part abt his dead body lookin like a walrus!! \n\r\nand as for this song, it doesn't have any meaning at all and congratulations to those who have wrung out any semblace of sense out of it because i bet john to sadistic pleasure it writting stuff that had no meanings and hearing others' interpretations of it. i really wish he were alive to see this page. he'd be rolling on the floor laughing!!\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nThe thing that had always put me in doubt is the hight, face, ect... diffrences in Paul in 67 compaired to that after. Just about being observent. Bottom line: unsure.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nyoure all idiots, think of it like this, its lennon on heroin and going through a big anarchy phase, the egg man, hey have you ever heard the humpdy dumpdy nursery rhyme? well he was an egg wasnt he?!?!?!?! and when he fell, the kings horses and all the kings men tried to put him back togeather, so think or it as saying the policemen running, same as the kings men running, the walrus i BELIEVE not sure is the king did you know that the walrus is the king of the sea?  This song is a total anarchist song, pigs in a sty is again police men, how they do before thinking and couldnt think if they tried, ofcourse it has meaning, but it was deffinitly based off of a high john was feeling one day... im guessing LSD\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI could've sworn it said, \"Coo coo ca choo.\"\r\nI mean it sounds more like Koo rather then Goo.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nEreinion is totally right. Lennon himself has said the song is meaningless. These artists get off so much on us people analysing their songs. We look like fools to them, and they are just laughing at us as we try and discover hidden meanings to their tunes. \r\nLennon probably did not write this when on one of his \"trips\", cause you cannot write good songs when your high. He was probably sober and just reflecting on a trip he had. He was probably laughing his head off when writing the lyrics as well. If your a musician or songwriter you already know that not everything you write has a meaning to it. Some songs you just right for fun, and to be odd. So people get this stright! Not every damn song The Beatles write has some hidden meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nIt is once again time to revisit the conclusion I came to back when I was 16 - that nobody really knew what The Beatles were talking about, anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nif u watched da documentry on macartney he actualy confessed dat thy wer high n the song was 4 fun him n lennon wrote it 2geva n it ws as thy wer quittin drugs n he did also confes 2 sayin smoke pot smoke pot everybdy smoke pot so i supose ya rite sum ov yas :P\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nThis song is even too fucked up for the pothead Beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nWell said Prog Rocker(?), John Lennon was taking the piss out of everyone on this site who has even attempted to analyse this track. Hard to write Bull Shit songs though!\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\n...it sounds completely different when you're actually dropping Orange Sunshine...I could only hear the bass line and some wolves howling in the background. No wait, that was my dog barking at the mailman...\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI know this song has \"no meaning\" and is nonsense and all, but before I knew this I always saw it as a song about a deranged sexual fantasy...if you really look, almost every line could be a smirking innuendo.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nthe reason this song was wrote was because Pauls body after he was decapitated in the car accident looked like a walrus so thats what the song is about so BOOYEH\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nthis song had one of the very first cuss words in it ever to be played on the radio. u know that laughing kinda werid thing part? well in that part theyre saying something like \"lets all get f*cked, everybody get f*cked\" but it wasnt recognized till they told media, but it was warped and disguised anyway, so they didnt do much to it...this is a pretty pointless song the beatles just started doing heroin and LSD and stuff like that. Lucy in the Sky with Diamonds is strictly about LSD....these guys are awesome...\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nThe meaning of this song is about tiny little radios being implated in the homeless fingernails to controll the flying monkeys we dont know exist but they do trust me they do!\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\ngoomba...shut the fuck up.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nif you people actually think this song means anything, you obviously know nothing about the beatles and shouldn't trash talk them becaus they are the most amazing musicians of...well ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nActually, this song is a joke played by the beatles. In indian culture, an eggman is a prankster, or one who plays practical jokes. The walrus, is the chinese zodiac for one ewho jokes around too much. The theory is that paul is dead, and they made this song to play with people's heads. The Beatles also made album covers with \"clues\" to pauls death all as a joke. This post is complete BS, but its just to show that your gonna hear a million different things on this song. There really is no hidden meaning!\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nThe first verse is about Ringo.  The second verse is about John.  The bridge is about Paul.  The third verse is about George.  The crying part is about Paul.  The walrus too.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\n\"i've heard that john wrote this song to screw up people that always try to analyze songs. did a pretty good job so far. \"\n\r\nHow ironic.\n\r\nSeriously, I have no idea what this song is about, and maybe that's the point.  \n\r\nAll songs have meanings, even if the meaning is there is no meaning (I hope that makes sense).  But if an artist writes a song, there is a reason behind it (even if he isn't trying to give a hidden message)\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nmmm... that \"yellow matter custard dripping from the dead dog's eye\" sounds good!  I think i'll have some!  Seriously, people.  It's a good song, the lyrics aren't supposed to make sense, but don't listen to it before you eat.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\njesus christ man! why dont we all just start a boxing match aye! Music is about the way you interpret it yourself. So if someone things this song its a load of shit but the other thinks it has hidden messages about Paul being dead or whatever then so let it be. Respect other peoples opinions i say\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nladymadonna123:\r\ndo you know how many forum laws you're violating by typing in all caps?\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nyeah so if you like this song.... of course nothing compares to the original...... but most likely you will like \"because of Dee\" and their version...... it is really hottttt.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nJohn actually admits to being the walrus later on in his solo career, with the song 'God'\n\r\n\"I was the Walrus \r\nBut now I'm John \r\n\"\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nI actually meant to post that in Glass Onion, oops.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\ngoo goo g'joob! actually i always thought he was saying Koo Koo Cachu.:P\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\ni purley think this song is about nothing imparticular- it is some random words put together very cleverly to create a really good song.\r\nThe beatles liked to confuse thier listeners i think- try to get them to look into something that doesnt really mean anything!\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nLem's right, the entire story is in \"A Day in the Life\", a very good Beatles biography. And \"Semolina Pilchard\" is not made up, one is a brand of sardines and the other may be a type of pudding, however I can't remember. \n\r\nYeah, the song is definately just John trying to fuck with the world, and it worked, look how many incorrect guesses there are.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nJohn Lennon had a meaning in a lot of their later songs, like the Let It Be album, but \"I am the Walrus\" was just to tell people that not all of their lyrics had to mean something, like \"Yellow matter custard dripping from a dead dogâ\u0080\u0099s eye\". The intro obviously implies that we are all equal or something of the sort, but honestly? Paul dead? I think not.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nAlways thought at the end of the song - the garbles voices were saying either:\n\r\neverybody smokes pot, everybody smokes pot\n\r\nor \n\r\neverybody's f-d up, everybody's f-d up\n\r\nand it's coo coo ka choo, not GOO GOO Gâ\u0080\u0099JOOB!\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nWhile it is still a great song, I think it is a bit of a disapointment, to learn that there is no hidden meaning to this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nAll of this song is really about is the fact that they are all pot heads, and how everyone elose sshould be too.  I guess they probably wrote that song while heavily stoned!\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nThis song is aboot the evil in the goverment and how they send you bills of 5000 dollers so you cant go to visit your f*cking realatives in NORWAY!!!\n\r\nNot realy it means nothing it's like me I write songs that are pointless i mean POINTLESS Lennon just wanted to screw round with the people who who try to interperet his songs.\r\nLennon kicks f*cking ass man...\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nbeatles are awsome but i think they were high when they wrote this song,it makes no sence and in the back ground it sounds like there saying smoke pot smoke pot everybody smoke pot\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nWhen will people learn not every song has a meaning and that just because this song sounds weird dosent mean that they were high. In the background there saying everybody gets f*cked, not everybody smokes pot.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nWhat do these lyrics mean?  The cool thing about art is not the artist's intentions in the creation, but the observer's interpretation.\r\nTo say the Beatles didn't take themselves seriously is misleading.  John especially took the band's status as the best band very seriously.  John hated pretense and supersillious people.  And, in that way, didn't take the meanings of his songs seriously.  As an artist, though...he took his work damn seriously, which is one of the reasons he left the Beatles.  I reference his December, 1980 Playboy interview where he cited that as a band, they started working harder on Paul's and George's songs; glossing over John's songs.  This hurt John deeply because he took his work seriously.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nalright this song might sound like john wrote it during an acid trip but no this song is full of hidden meanings before the beatles let out the album sgt peppers..... there was a conspiracey which was that john lennon had killed paul mcartney by sending him driving drunk and paul mcartney crashed and died and at the time the goverment was scared about what the beatles had said in the album revolver with songs like taxman etc and didnt like the influence they were having on the generation that listened to them which happened to be the baby boomers so there was high tension so the theory was once that mcartney was found dead the goverment had his body hauled off and disposed of its a long complicated theory but in the song i am the walrus there is a bunch of symbolic eliments for example in the song \"Sitting on a cornflake - waiting for the van to come.\" the corn flake represenst the crashed car paul is sitting dead in the car waiting for his ambulence that will never come\" even the chorus \" i am the warus\" john is posing as paul and the walrus in noregion symbol of death there are other things in this song too these are just the obvious ones other songs include strawberry feilds forever if u listen untill the very end and turn it all the way up u can hear John say \"i buried paul\" A day in the lige discribes the accident itself in the beginning of the song paul is the man that made the grave look into this conspiracey on the web just put somthing in like \"paul is dead\" and youll probably find alot of info on it\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nThere's an article in today's Independent on Sunday in which Stephen Bayley claims to be the schoolboy who wrote to Lennon saying his English teacher had been using Beatle lyrics in class, thus indirectly inspiring the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nAt the end of the song, where you can hear radio static, I clearly says, \"Dead? Is he dead father\". Thats supposed to be about the whole Paul's dead thing. I reckon the Beatles at the time just wanted to shit stire, because people where, as already stated, over annalysing everything. So they gave the skepticks clues to a wild goes chace to have some fun, like Paul having no shoes on on Abbey Road cover. Quite obvously Paul Maccartney is still alive... but is it the original Paul... nah just joking.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nAt the end of the song, where you can hear radio static, I clearly says, \"Dead? Is he dead father\". Thats supposed to be about the whole Paul's dead thing. I reckon the Beatles at the time just wanted to shit stire, because people where, as already stated, over annalysing everything. So they gave the skepticks clues to a wild goes chace to have some fun, like Paul having no shoes on on Abbey Road cover. Quite obvously Paul Maccartney is still alive... but is it the original Paul... nah just joking.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nAt the end I believe they're saying \"Everybody's got one, everybody's got one\" although I've heard allegedly false rumors that it's \"everybody smoke pot, everybody smoke pot\"\n\r\nI think the first line \"I am he as you are me as you are he and we are all together\" sets the stage for the rest of the song.  It's all open to interpretation.  I think if John was alive today he would laugh at the idea that there are five pages of text on a website devoted to discovering the meaning of a song he intentionally wrote to throw people off and make them look for meaning that didn't exist.  :)\n\r\nThat being said, who knows what associations he had when he wrote each lyric?   I'm sure they all mean \"something\" but I don't think they're written in such a way that we can say for sure.  I know some of them are specific references (\"yellow matter custard dripping from a dead dogs eye\", some schoolyard saying twisted around).\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nI can kinda hear the \"smoke pot\" at the end thought I've read that it you're expecting to hear something you can hear something that really isn't there.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nok heres what i know... the first line... i am he as you are he ect... is about lennons strong belife in unity. and that supposed to be the only seriouse part of the song every thing else is just nonsence. but goo goo g joo is what humpty dumpty said right before he feel down the wall in the book. and egg man = humpty dumpy. the walrus is based on a poem that jhon liked. and ummm at the end of the song your suposed to here \"untimly death\" with is said to be about paul dieing and all that shit. idk its a really good song but its weird. and yea all the made up words and shit were put in becouse jhon thought bob dylan got away w/ murder cos he made words up and shit. the end thats all i kno\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nthis song is definetly meant to mean nothing. its more about your senses and how it makes you feel. if you listen you just think about all of the stupid words and create and image of your own. this song is great. its a carefree master piece really.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nThe very end the words are: Smoke Pot Smoke Pot Everbody Smoke Pot. Then entwined into that is Everybody's F**ed up, Everybodys F**ed up. Everybodys F**d up.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nMy teacher told me he figured out this song when he was drawing awhile back. I will try to put his words down well enough to seem as clear as he did.\r\nThe first part, \" I am he...\" has four pronouns, and four lines. There were four Beatles.  They are the \"pigs from a gun\", since everywhere they went they had to run, or fly to, since Beatlemania was in full effect. A cornflake is a very fragile thing, and sitting on it would cause it to break.  Fame is very fragile, and one false move could make or break your career. The next part refers to the various media events the Beatles were always a part of, like TV, radio, etc. Since they were first a \"boyband\", their sponsers always wanted them to be cheery and fun. John was not one to smile, hence the\"face grown long\", and would have a fake grin when asked to smile. \r\nThe eggman part my teacher could not explain, just that they were like milkmen, and the walrus is a figure of death.\r\n\"Mr. City policeman sitting pretty little policeman in a row\", refers to how the police would stand in a row to block the fans when the Beatles made an appearance. He skipped to the \"Pornographic Priestess\", which was a reference to the groupies that were all over them.\r\nThe whole stanza about the \"English tan\" means that they made the best of their situation, regardless of what others did.\r\n\"Expert texpert choking smokers\" is an English reference to the old Englishmen who read the news of the Beatles fame, and laughed, because he knew they were not free individuals, but just receipts to the big moneymakers behind the scenes, which is the reason that they are crying throughout the song. Last, \"kicking Edgar Allen Poe\" meant that now the Beatles were trying to be considered serious, and acknowledged as writers.\r\nNow, my teacher admits this song is about nothing like John said, but they probably put in personal experiences and little references when in a daze of writing.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\n\"I am he, as you are he, as you are me, and we are all together\"\n\r\nQuite possibly the greatest lyric ever written.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nhehehe i bet the beatles had such a laugh coming up with these lyrics and sending out. They wont have had any specific meaning behind them i mean sure they'll have sat about and smoked some marijuana thinking up some crazy idea about \"what the lyrics mean\" who doesn't. But the whole point of this song is that it could be interperated so many different ways that they released specifically to see what other people would think the meanings were. The point is people always think there is one big hidden meaning behind everything, therefore they made a song that could be looked at at so many different angles that it was impossible to figure out which meaning was the real one! I bet they had some great times listening to all the theories that people came up with about the song and i'm sure they came up with a few after they'd released it! Man what i'd give to live in that era...\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nIt's my all-time favorite song. The strings wrap around me like a blanket, and the song is filled with drama as it plods along...What a hauntingly beautiful thing. I'm glad so many people care about it enough to post. I wish modern-day stuff was as compelling.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nActually, i've just been reading Marianne Faithful's biography and  this song isn't completely meaningless.\n\r\nbrian jones, mick jagger, marianne faithful and john lennon were all busted for drugs possession several times by a notorious Detective Sergeant Norman Pilcher who Marianne says John described as the 'semolina pilchards' in this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nThe Song has all the meaning in the world if you consider the context and don't take the lyrics literally. I'm no expert on the Beatles, yet, but i'm going to go ahead and say that they had no idea how much f***ing meaning this song has or how important it would be in that it is pop culture WITH VALUE. There's a shock. Yes it can happen, wasn't shakespeare considered pop culture in his time? ----hang on---- TheRighteous(i just read your post) I think your teacher did an excellent job of understanding the personal experiences of the beatles that led to those exact lyrics\r\nbut,\r\nhe failed to see the larger picture. These guys are perfect examples of what happens to a person whom----this is difficult for me to define (I need to improve my vocabulary)----a person whom turns their back on life is one way to say it albeit quite vague. These guys are not happy, they're using drugs, they would rather misunderstand the world around them than face up to the truth. They express this in their songs, if you think they are encouraging drug use you are in denial my friend. It's more than just the drugs, however, the drugs are just crutches on which they support their broken spirits because they are not whole. I'm only beginning to get back on the true path myself. I hit some major bumps in the road to becoming an honest and emphatic person. Things like being influenced by troubled people and caring for them and trusting them to my own detriment. Using Pot, which i will never touch again. And eventually closing up emotionally until recently. It isn't always easy opening yourself up to people. Conflicts happen. Lately i find it scary how well i can read people from their talk and how they move even, because i don't like what i see around me. There are a lot of troubled kids where i go to college and i find that I can be exhausted by it all. I'm the type of person who doesn't like to see others in pain. And when i say troubled i mean these people have emotional problems regardless of economic status or what have you. I wish i was in a position to make some major changes in our society because if someone doesn't soon i fear that the situation will only worsen. It can be so very hard for some people to change. I've learned that you can't force a person to correct upon his/her mistakes, one can only show him or her the way and hope that they can come to a self-realization that they need to change themselves. This becomes more difficult as time drags on. I believe everyone has the potential to be a good person if they are strong enough to be themselves! Say what you really mean and mean what you say. Keep your eyes open and pay attention to the world around you. Form your own principles and values and believe in them as well as yourself. Listen to John Lennon in Imagine, live for every friggin day. We're all going to die someday, don't count on a form of eternal existence, live it now! Help others, love others, fall in love. Live well and die well. But don't forget that rationale and common sense etc. are necessary tools in life. A balance must be found between reason and feeling.\n\r\nI mentioned many different things here but they all tie in to the song if you think about it =D.\r\nThis is the first time i've posted anything like this on the internet, I wonder if i'm making any sense? Regardless i'm glad i got these thoughts out with a possibility of someone understanding them, because they would definitely would be wasted on my room mate. He's one of the aforementioned people i can't help and although i hate to do it I will be kicking him out soon.\r\nOh quick note to anime fans out there i believe certain series such as neon genesis evangelion and rahxephon convey messages similar to my personal realizations.\r\nLast thing i promise, I just saw One Flew Over the Cuckoo's Nest. Great Movie. Not only is it funny and shows so many sides of human nature, not only is it sad, it's also ties in to my point! The indian guy, chief, finally musters the determination to live his life by the end of the movie-Hurray!\r\nOk i'm done. I successfully de-stressed myself today between talking with my parents, listening to the beatles, reading a new book (Eldest) a little more humor in it would have been good but cool nonetheless, movie, beer (I only had one can) i'm not a complete boyscout after all, and this post. Should be fun to see what happens if anyone bothers to read all this (maybe i should have kept it more to the point with less free association?)\r\n-To the Beatles- No offense intended to them, From the songs i've heard they sound like good-hearted people and possibly reflected back on their lives in a similar manner.\n\r\nI'd like to say thank you for reading this and I wish you a good life.\r\nGoodnight\r\n-Marco\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nHello again and good morning.\r\nI thought a bit about the lyrics this morning and after listening to the song again I realized that the lyrics directly support my claims.\r\nOk the first part-I'm skipping the all together part for now. \r\nSee how they run \r\nlike pigs from a gun\r\nsee how they fly. I'm crying.\r\nMy point is made clear right away look at the association right there. They run and he's crying and they are also he right? so he runs, they all run, and he's crying. But what do they run from exactly or why?\r\nThe answer is simple. They are running from themselves. They are running from truly feeling, from being honest about themselves and who they are and who they would like to be. He's the walrus, norwegian death symbol eh? If lennon had that association then he is saying that he is dead, symbolically. Paul is dead huh? I think that whole deal meant that Paul had changed in the eyes of the other Beatles. The old Paul is/was \"dead\" and a new, changed Paul was born, for better or worse i don't know, I don't know much about the Beatles' history, yet.\r\nok next, \r\ni am the eggman they are the eggmen\r\nI associate the egg as something fragile, breakable, hardened on the outside with soft mushy yolk on the inside. Humpty Dumpty comes to mind, he is an eggman after all. whoa, i just looked up humpty dumpty on wikipedia and that led me to Lewis Carrol's Jabberwocky. I can tell there is much to be discovered in there and much emotion although the new language makes it difficult to understand perhaps thats what the guy needed because he felt plain words were inadequate to express himself. There's a fiery eyes line in there, that was used in another beatles song connected to the paul is dead thing right? if so then lennon or the beatles were familiar with the poem and probably with humpty dumpty as well since he is connected to that through alice in wonderland translating the jabberwocky.\r\n-Fascinated with lewis carrol after reading bio, will soon begin extensive research\r\nAlright so where was I? Oh humpty dumpty alright so in the poem it never says he is an egg right? It is stated that he is an egg after the reciter of the poem asks about it. So this guy was a weak person, no determination, he experienced some type of trauma that he or she, ahem, could not handle and he broke, psychologically, and no one could help put him back together. He was too far gone, too much time spent off the correct path fearing understanding. So lennon being the egg man fits in with the rest of what i'm saying.\r\nI caught a bit of penny lane a few minutes ago while writing this about keeping a clean machine, was this someone in the group abstaining from drugs? What's the song about, is it about someone falling in love with a girl? If so that would make sense since love is the most powerful healing force.\r\nThere's more in the song to support me but i need a break for now. Laps in the pool and more research on Lewis Carrol for me If i wasn't in the middle of two books i'd go buy at least the alice books right now, ah maybe later.\r\nFarewell\r\n-Marco\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nIf you reverse the chanting at the end it sounds (quite clearly actually) like \"Ha Ha, Paul is Dead\". I found that on a website, and it creeped me out. Usually they sound nothing like it's supposed to, but this sounds like either Ha Ha Paul is Dead, or \"Ha Ha, Polly Bed\". It's still probably a coincident, but try it.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nIt is so sad that John was killed.   I didn't even know him.  (I was only 7 when he died).  But I miss him.\n\r\nPerhaps the meaning of this song is indeed no meaning at all and to tell us to stop overanalyzing things and just live.,,,while we can.  We'll all be dead someday.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nokay I can give you some history on this one. Lennon was going through a small heroin phase (he was the only Beatle that did and he only ever smoked it) and lying on his old childhood couch for days and already had the lyrics \"I am he as you are he as you are me and we are all together\" typed. He then heard a police or ambulance siren go past his house which was the inspiration to the opening instrumental bars. He then wrote the rest there and then and yes it was all \"gobble-de-gook\". \n\r\nOn the inside cover under the title it says \"No you're not said little Nicola\" which was meant to suggest that it was Paul (later confirmed in the lyrics of \"Glass Onion\"). But it couldn't be a Paul-Is-Dead clue because there is no proof that the walrus died in the film Magical Mystery Tour.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nisnt this song to wind up all the people who were over-analysing all the beatles songs, as the words mean absolutely nothing at all. tis a cool song though\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nHmm... nope, John & Paul have got me on that one. Which is probably their intended purpose.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nUsually i don't like covers but Jim Carry singing this is pretty cool\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nmeaning shouldnt be searched for in this song, that would defeat the whole purpose of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nokay, so  i didnt read all the posts, but am i wrong when i say whoever posted the lyrics to this song was kinda wrong.... its not goo goo goo joob.... its COO COO CA CHOO  or with K's .... what ever.....i cant spell....\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nI think the what most people are failing to grasp is that  this discussion is all Lennon's artistry.  Why did he write the lyrics he wrote?  So that we'd be sitting here 25 years after his death hotly debating their meaning. Maybe they had meaning, maybe not, but that's not the point.  So, don't curse thisdiscussion, it's a beautiful tribute to John Lennon's genius, and exaclyt what he wanted.  RIP JOHN!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nI'm not going to analyze it too much- as the original intent may have been to not mean anything or maybe it means something, who knows? But, if it did- \"Donâ\u0080\u0099t you think the joker laughs at you?\"- Isn't a jokers' job to make you laugh? And saying that he laughs at you would be saying how pathetic you are or how much dignity the joker has (by not taking it too seriously and getting his own personal satisfaction). He laughing that you can be entertained by such childish actions and so easily at non-intellectual gestures. If the writer's job is to write something for you to interpret, maybe the writer is interpretting you or laughing at you for doing it. I don't know, but it's a reversal of roles nonetheless. At the very least, the person you're laughing at is laughing at you- but if it means more (if anything at all)- then what?\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nI was reading my friend's \"The Beatles Song Meanings\" book, and all this song is, is a whole bunch of random words put together to make up a song. \"Yellow matter custard dripping from a dead dogâ\u0080\u0099s eye\" is an old rhyme from where they grew up.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\n.    From what i read from, this song was originally about three ideas. the first one was about lennon sitting in a cornflake(where did he come up with this?) the third one was the idea lennon got by listening to a police siren, singing \"Mr. Policeman...\", and the third one was oubviosly \"I AM THE WALRUS\". They were soppused to be three different songs, but he merged it to be -=\"1\"=- song.\n\r\n.        The actuall meaning of this song is:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n.                                   NOTHING\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nthis song is soo awesome, i think john wrote it too confuse people b/c he hated when people sat their and analized his songs....i love the beatles!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nFor the person who was talking about the LMW on the VW lisence plate, I heard it could be interpreted as \"Linda McCartney Weeps\"\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nWhile a lot of the song is gibberish to terrorise people who read too deeply into his lyrics, at least small sections of the song have coherant meanings. The \"Sitting in an English garden waiting for the sun...\" could be a criticism of late 1960s society, as people waited around doing nothing thinking they were changing the world and when this was eventually realised they just made do with a flawed society. This is also true of the line \"Sitting on a cornflake, waiting for the van to come.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nOkay, I only read the first and last pages of everybody's comments (because I am too lazy to read the rest) but none of them are what I had thought. Here is the situation as I know it; John wrote the first few lines on acid and the rest of the song was loosely based on Lewis Carroll's 'The Walrus and the Carpenter'. John originally thought the walrus was the good guy but later learned he was the one who wanted to eat the oysters. (I think it was oysters, I don't really remember) Aside from that, it didn't really have a planned meaning. Also, I'm pretty sure John Lennon said 'Let the fuckers figure that one out' to Pete Shotton, not George Martin or Paul McCartney, but I could be wrong. It's all in 'The Beatles Anthology'. \r\nA lot of people looked for 'Paul is dead' clues in this one and some thought the walrus was some ancient symbol of death, which is really stupid. They thought this because in 'Glass Onion', John wrote 'the walrus was Paul' but he only wrote it because he was considering leaving the group (he started thinking about leaving the group, so stop blaming Yoko Ono, people!) and he felt bad about ditching Paul so he started letting him have little things. Again it's all in 'The Beatles Anthology', which is a giant book written by the Beatles and taken from interviews and stuff.\r\nAnd benniegirl19 is wrong about the goo goo g'joob being the wrong spelling because I have the record 'Magical Mystery Tour' and the lyrics are printed on it. It does sound like coo coo ca choo, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nI read in the new Beatles biography that the line \"I am the eggman\" refers to Eric Bourdan of the Animals -- he was known as the eggman because in some orgies he and John went to together, he would break eggs on girls while they were having sex.  Just something to think about...\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nWhen John wrote the lyrics he probably intended us to read what we like into it...\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nThe end chant, to my ear, sounds like a mix of \"everybody smoke pot\" and \"everybody's got one\"\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nI am the Walrus Analysis\n\r\nI myself have read a bunch of things such as the song alluding to criticism of songs by such greats as Bob Dylan whom John evidently thought could not write meaningful songs...I have also read that the song is also an allusion to the \"Paul is Dead\" conspiracy theory  by the fact that a walrus represents death in Greek mythology...Also read another Paul is Dead theory in the song relating to the King Lear passage...Read that the song is to create difficulty among the fans in interpreting the song...But I think I have figured it out, or at least in some part, with thanks to reading many articles on the song. Firstly, if you listen to the song Glass Onion on the White Album, the song reveals that the \"Walrus was Paul\". The Walrus is evidently referring to the Lewis S. Carroll story \"The Walrus and the Carpenter\" in which the Wlarus and the Carpenter lure young innocent oysters to be eaten. The Walrus, howerver, feels immense remorse for his actions. Also, in the cover of the Magical Mystery Tour, under the song title there is handwriting \"no you're not!\" Said Little Nicola. I believe that this is stating that the Walrus was not John, and that he was alluding to Paul being the Walrus. I believe it is showing that the oysters are the fans being lured to believe Paul is dead, and that Paul feels remorse for having tricked so many of their fans. I don't think they would reference a song in later tracks if it didn't mean anything....especially in the track Glass Onion which means a see-through coffin (possibly mocking the Paul is Dead Controversy).\n\r\nI'm never set in my ways and any other ideas on the song are greatly appreciated as I like to read into the meanings of their songs and develop some ideas myself. In no way are much of my ideas original, and there are many other sources on the net that can provide you further information. These are mainly ideas which I have accepted as a truth in my opinion.\n\r\nThanks,\r\nRyan\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI read somewhere that reading some fan mail John read one that said some teachers class were trying to find the meaning to the beatles song, so he just came up with this. A lot of it came from old ryhmes that they knew as children, and then in the song \"Glass onion\". one line was \"by the way Paul was the walrus\" but that didnt mean anything, it was just to fuck with people some more.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nI read somewhere that reading some fan mail John read one that said some teachers class were trying to find the meaning to the beatles song, so he just came up with this. A lot of it came from old ryhmes that they knew as children, and then in the song \"Glass onion\". one line was \"by the way Paul was the walrus\" but that didnt mean anything, it was just to fuck with people some more.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nI read somewhere that reading some fan mail John read one that said some teachers class were trying to find the meaning to the beatles song, so he just came up with this. A lot of it came from old ryhmes that they knew as children, and then in the song \"Glass onion\". one line was \"by the way Paul was the walrus\" but that didnt mean anything, it was just to fuck with people some more.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nI think the idea that the song is deliberately meaningless makes the song more meaningful. Combined with the later reference in \"Glass Onion,\" it is one of the most postmodern Beatles songs. Dada meets pop music...eerie.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\ni rekon they were just fucked on some crazy shit drugs when they wrote this!! sitting on a cornflake!?? wtf? sounds like something you would say when your off ur face on something. ive done dope which is a soft drug and sometimes you say wierd shit like that...\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\njohn wrote this one which makes no sense whatsoever and said to Paul: \"There you go. Lets see the fuckers try to work this one out.\"  \n\r\nthat's fucking hilarious!\r\nyellow matter custard dripping from a dead dog's eye.....such a good song\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nGOO GOO Gâ\u0080\u0099JOOB! this song is fucking catchy\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nNo matter what everyone else says, I love this song.  I like the play on words that John is known for.  I don't think it means anything in particular, but the Walrus was from the poem the Walrus and the Carpenter (see John's interview in Playboy 1980).  The lines are \"everybody's got one\" and I'm sure John says that in the above mentioned interview.  If I remember correctly, John also said he wrote the song to the sound of a police siren... he took the beat and put the lyrics to it or something... again, he mentioned it somewhere, maybe the anthology.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nI know the true fact about this song.\n\r\nWhen all the rumors of \"Paul is dead\" were goin around, John got mad and wrote this song and said: 'Let the f***ers work that one out\" to his friend Pete Shotton.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nThey were reciting Shakepeare's King Lear! Did anyone notice that? If I'm not mistaken, it was in the 3 minutes and thirty-three seconds of the song. I THOUGHT The \"Paul Is Dead\" hoax started after that student saw the Abbey Road Cover! And I Am The Walrus was in The Magical Mystery Tour album! How is that possible?\n\r\nJohn wrote this song because people are always interpreting their songs, which annoyed him. So, he wrote a catchy song about a Walrus or something. Ha, I laughed out loud when I heard a comment in page one saying that Paul wrote what John Lennon said under the influence of LSD!\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nIsn't it, \"you can get a tan from standing in the English WARM?\" that makes much more sense than rain...\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\n\"Isn't it, \"you can get a tan from standing in the English WARM?\" that makes much more sense than rain...\"\n\n\r\nUh, the whole point of this song is that it makes no sense whatsoever. Yes, he is saying 'rain.'\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nYou all who say that the beatles took acid you all are idiots they did not put one drop of that crap in their bodies anyways that's the dumbest thing i've ever heard about the beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nThe Beatles are awesome no matter what they did their music rocks and thats the only thing that matters.\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\ngoo goo g'joob\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\ni haven't read everybodys comments but it's been interesting to say the least. i had, how can i say it, an incident, with this song. more like a long moment. i've long been a beatles nut (not betel nut - popular narcotic in asia) but one night after reading a lot of david icke and other spiritualist stuff i listened to this song for the umpteenth time and i'd just had my first joint in over a week. i started shaking violently as the lyrics suddenly dawned on me -  this song is an indictment of the powers that be that have enslaved us into their matrix of fear. we surely have been naughty boys and girls. we have let our faces grow long. we've let our knickers down. but i am he and you are me and we ARE all together. lennon knew that we are all ONE. that's why they killed him. i'm not saying i understand every word in the song and i'm sure like many have you have said, it was a compilation of his life's experiences, but there is no mistaking the undertones of spiritual revolution because contrary to what i've read from one comment the beatles, at least john, did take themselves seriously - they knew they had a responsibility but it wasn't even that - they wanted to be more than just musicians, they were thinkers. and by the way, at the end the chant is \"umpah, lumpah, stick it up your jumper\" (a playground phrase in england) not \"smoke pot, smoke pot...\"\r\npeace.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nme again...\n\r\ni am he as you are he as you are me and we are all together... the plainest statement of the Oneness of us all.\n\r\nI'm crying... John's despair at the state of the masses (see Working Class Hero - \"you're still fucking peasants as far as I can see\")\n\r\ncorporation t'shirt, stupid bloody tuesday... why do we have to work all week to line the already bulging pockets of those that sit comfortably at the top of the pyramid?\n\r\nman, you've been a naughty boy you let your face grow long... Humans - you have been conned into believing in `The Fight For Survival - Every Man For Himself`\n\r\nMr City, Policeman sitting, pretty little policeman in a row... the steady introduction of the World Military State... (see post 9/11 Earth)\n\r\nExpert texpert, choking smokers, don't you think the joker laughs at you?... isn't it just the biggest irony that nicotine is the number one seller and the number one killer? someone's chuckling (see again W.C.H - keep you doped with religion and sex and T.V.)\n\r\nSee how the smile like pigs in a sty, see how they snied... can anyone say Fat Cats? sing it with me... \"Have you seen the bigger piggies?\" Orwell would have been proud of his musical sons.\n\r\nMan, you should have seen them kicking Edgar Allen Poe... Wasn't he the guy who wrote \"life is but a dream within a dream\"? He knew his shit aswell. \n\r\nJoob A Joob A Joob A... fuck knows what that means.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nThe Beatles admitted they took acid. Harrison talked about what it looked like under a microscope. George Martin took John Lennon up to the roof during an acid trip. John admitted the lyrics of this song came from two separate acid trips. Paul caused a huge scandal by admitting he had taken it \"about four times\" on network television.\n\r\nIt's not really a big deal, nor is it a dangerous drug, but that is where a lot of the music came from. It's just what people did for fun back then.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\n\"drop out, drop out, everybody drop out\" referring to (i think it was) timothy leary's statement about lsd, \"tune in and drop out\" thats just a guess, but its my opinion anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nthe evidence appears to say the lyric is \"got one got one everyboyd's got one\" see what the mind does when its forced to fill in the blanks...\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nFascinating!  Both the song itself and the myriad comments posted to this website are very (or should I say \"highly?\") entertaining.\n\r\nOne of the early posts mentioned that the \"I am he as you are he...\" line could refer to the Beatles themselves - interesting.  I never thought of that, and it sounds quite plausible.\n\r\nTo me, the entire song is meant to evoke the emptiness and existential meaninglesness of modern life.  I liken it overall to T.S. Eliott's \"The Wasteland.\"\n\r\nTwo powerful literary allusions refer to treachery and doublecross.  In Carroll's poem, the Walrus tricks the oysters into taking a nice walk, only to eat them.  And the quotation from Shakespear's \"King Lear\" is the from the death scene of a traitor, late in the play.  The lines, \"I know thee well - a serviceable villain - as duteous to the vices of thy mistress as badness could desire\" is spoken about the traitor who has tried to harm Lear and the daughter who protects him.  After the traitor falls from a cliff to his death, Lear himself says \"Is he dead?\"\n\r\nAll the other imagery powerfully conveys the absurdity of modern life and society's rejection of meaning and quality - \"Man you should have seen them kicking Edgar Allen Poe,\" \"Semolina Pilchard climbing up the Eiffel Tower,\" et al.\n\r\nI came to these conclusions years ago after studying The Wasteland in college.  It just all seemed to fit together.\n\r\nAnd, by the way, I remain convinced that the chanting is \"Everybody smokes pot, everybody's fucked up, everybody smokes pot, everybody's fucked up.\"  Crank it up - you'll see...\n\r\nJust one man's opinion, but as so many here have claimed Lennon wrote, \"Everybody's got one!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nEggman - A guy who liked to crack eggs over a naked woman's body\n\r\nYellow Matter Custard Dead Dog's Eye - A childrens rhyme Jonh used to have with a friend.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nThe John Lennon track \"I Am The Walrus\" allegedly implies that McCartney died on a \"stupid bloody Tuesday\"; if we are to believe that McCartney died \"Wednesday morning at five o'clock\", as in \"She's Leaving Home\" from Sgt. Pepper, this could translate to be Wednesday morning UK time, while it would still be Tuesday evening in the U.S. West Coast. The chant at the end of the track, played backwards, seems to reveal \"Paul Is Dead, Paul Is Dead...\" And when played forwards to the end, contains a portion of a BBC radio broadcast of King Lear which mentions, \"O, untimely death!\" John had simply turned on the radio while recording and the \"King Lear\" bit was a coincidence. Also, right at the end, if reversed a voice says, \"Paul is dead, his head off lies with his spirit.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nThis song has  no point  at all,  but yet  it is my favorite song from the fab four. I love  the end  with all the Goo Goo jubes  and the joker in the  back ground.......very catchy. \" Lets see the basterds figure this one out\"  RIP LENNON\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nThere is no meaning it this song. John did it to piss off all the people who /look/ for meanings in Beatles songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nthey are notttt saying everybody smoke pot.. they are saying EVERYBODYS GOT ONE\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nJOHN JUST WROTE THIS SONG IN HIS  SENSE O HUMOUR TO MAKE NO FUCKING SENSE AT ALL,,,BECAUSE OF THE IDIOTS WHO TRY AN DISSECT AND EXAMINE EVERY SINGLE LYRIC THAT HE PUTS ON PAPER\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nAt the end of the song John is chanting \"Everybody's got one, everybody's got one.....\". I heard him say that on WNEW radio many years ago. He wasn't saying \"Everbody smoke pot\"....although I would agree with that sentiment, too.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\naccording to john it was based on the walrus in the carpenter, the walrus was the bad guy in the story but john said that he didnt realise that until after he'd done the song. \r\naccording to the hoax theories, the walrus is a symbol of death in some cultures making the song, and the walrus on the album cover another paul is dead clue. they were put off by the fact that it was john who sung \"i am the walrus\" in glass onion, which is a heap of beatles song references put together john sings \"and heres another clue for you all, the walrus was paul. hoax people think this means john is saying paul is actually dead. it also could be (more likely) him taking the piss out of the hoax people just like i am the walrus is said to have been him taking the piss out of people who tried to analyse there songs. john said the line in glass onion was about him giving paul the credit for the beatles beacause he now had yoko. it could also have been him saying paul was the bad guy though.\r\nenough analysing for now. :D\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nAccording to John, this song is about an eggman trying to sell eggs to a walrus.  It is a back-and-forth between the two and throughout the song the walrus is getting more and more angry at the eggman, who will not quit.  Finally, when the walrus can't take it anymore, he stabs the eggman in the kidney, pisses on the eggman, takes a massive dump in the eggman's mouth, cuts off the extremities of the eggman, cuts off the eggman's eyelids, rapes the eggman, and finally decapitates the eggman and places the severed head on a pike for all the other eggmen to see.  Needless to see, no more eggmen chose to sell eggs to this irked walrus.  ITs a delightful little tale of hardships and overcoiming inner demons.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nI think the begining: \"I am he as you are he as you are me and we are all together,\" is refering to the  transcendentalists movements in the 1800s.  Such authors as Emerson and Thoreau believed in the idea that we are all one.  In the mid and late 1960s the transcendentalists movements was revived in the form of \"hippism.\"  Seeing as at this point the Beatles were definitly a part of the \"hippie\" movement, I beleive this is refering to those philosophies.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\ngray matter re did this song and its actually really good its on flip sorry ( a skate video) thts wherei first herd it so yeah\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nLike most people said, it isn't about anything...John took 3 different songs he was writing, combined them as well as some random things he wrote down during acid trips and other random rhymes and stuff. \n\r\nThis was his response to fan mail he got about a teacher making students interpret Beatles' lyrics in class.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nI have read quite a bit of these thoughts and I like \"carpetpetals\" take on this song.  It is heavily influenced by drugs, but what a original sound!   Name one song that is as original and ambitious as this in the last 5-10 years?  \n\r\nAs for the \"Paul is dead\" thing:  a DJ in Detroit (Russ Gibb) came up with the theory based on \"clues\" in the songs and albums: (Paul has a black rose in the MM Tour photos --the rest have red, he is dressed as a dead man in Abbey Road, the hand over his head in Sgt Peppers is a sign of death, the four Beatles manequins in the cover of Sgt. Peppers are looking at a grave, the supposed voices in the songs)  All this (and there are many others) is crap.  Mr. Gibb did a very effective job of putting this together--so much so, that Paul had to publically come out and say that he wasn't dead!   Of course, John has some fun in the White Album when he says \"here is another clue for you all/ the Walrus was Paul\".   What great fun for them.  I think they really had fun with it.  Google \"Russ Gibb Paul is Dead\" and you will find a site.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nI was watching a video about the beatles recently and this song HAS NOTHING TO DO WITH ANYTHING!! at the time that john wanted to write a song that no one would be able to see what the meaning ment. That whole time period was all about song meanings and they wanted to screw with peoples minds... there is nothing normal in this song that you can get a meaning from\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\ni love the beatles, as do most, but i honestly think (no disrespect intended) that they were SOOOOOO high when they wrote this one!\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nthis is another one of my favorite Beatle songs. Its awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nhaha i think it is funny that people are trying to analyze this song when John Lennon wrote it on acid, and wrote it so obscure because he had people telling him they were trying to analyze his lyrics lol\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nObviously this was not the intent of the song, but when I hear this song I for some reason see this as a statement of arrogance from John.\n\r\nThis is one of my favorites by the Beatles.  It's funny that one of probably many peoples favorites can be complete nonsense.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nI think its wonderfull when the beatles mentioned there other songs in there songs ex:\n\r\nSee how they fly\r\nLike Lucy in the sky\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nat the end the high pitched voice is saying \"F-ed up F-ed up everybodys F-ed up\"\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nRather than rendering it to mean nothing, why not let it mean everything?\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nThis is a great song. I love the refrain, especially that \"GOO GOO G' JOOB\"-thing. it alway makes me smile when i listen to it. \r\nI dont think that the song has a meaning. i agree with the guys who said that john simply wrote a song with NO meaning to see how people analyze it.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nhahahaha i like magicnudiesuit's philosophy, but i think the googoogoojoob isn't an actual creature but more the sound that a walrus makes as he just stated that he was in fact a walrus. hard to tell though as this song doesn't make a lot of sense, good to throw ideas around and i wish there was a creature called a googoogoojoob\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nWhen i fist heard this my immediate thought was 'Oh, they've all just sat in a room while off thier faces and written down random lyrics that don't make much sense, just for kicks.'\r\nAlong with the whole not wanting people to analize thier lyrics too much thing, i think that may just be it.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nIts funny... because when you read the lyrics you can follow john's thought process as mine is VERY similar when i am *ahem* \"under the influence\". \"Crabalocker fishwife pornographic\r\nPriestess boy you been a naughty girl\" especially\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nthis song is scary....im not a walrus! why would he call everyone a walrus at the beginning?\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nman....dude....OMG.like.....i think...i think....I...I...ME...I...AM....i think...I AM....THE WALRUS!!!\n\r\ngoo goo goo joob maaaaaaan *dances away*\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nman....dude....OMG.like.....i think...i think....I...I...ME...I...AM....i think...I AM....THE WALRUS!!!\n\r\ngoo goo goo joob maaaaaaan *dances away*\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nno, no, no!\r\nThey are saying  \"suck cock, suck cock, everybody suck cock.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nthis is what is created when you sit in your room and use laughing gas all day. lennon is fucken ill\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nThe lyrics to the song are a kind of test to listeners...everyone was going crazy over the \"Paul is Dead\" hoax, and Lennon wanted to see what interpretations people would come up with if he wrote a song that was about utter nonsense. And, as predicted, many people tried to find a sort of \"hidden\" meaning, listening to each word over and over obsessively. And Lennon probably laughed at those people and did the Goo Goo G'Joob dance.\n\r\nWhich makes it all the more surprising at the sheer awesomeness of the song...but, let's face it, they were the Beatles. This just might be the best Beatles songs, definitely one of the more harder-rocking ones. I think many people overlook the influence the Beatles had on the alternative movement, with their cryptic lyrics in this, \"Come Together,\" \"Lucy in the Sky With Diamonds,\" and \"A Day in the Life.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nAaaaaaand, this is the 200th comment, BITCHES.\n\r\nBeat ya to it. Hah.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nHey \"T Cap\" this is the 201 st comment....beat ya to it...BITCH!!\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nThis song is a piss-take of all the people here trying to find meaning in the lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\ni think that this song probably has connections to alice in wonderland as Lennon was experimenting with LSD. \"I am the eggman\" - humptydumpty, The walrus was obviously a character in alice in wonderland. What does it really mean though? Well, that's anyones guess\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nWhat a catchy song, eh?\r\n\"I am the walrus GOO GOO Gâ\u0080\u0099JOOB.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nI love it\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\n\"reportedly, after recording the song, Lennon smiled to producer George Martin and said, \"There, let those buggers figure that one out.\" \"\n\r\nXD If he really said that... Holy crap is that amazing!\r\nHooray for this song! I love the way John's voice sounds. Freakin' A. : D\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nWell let me put in my two cents about this song.  They are clearly talking about how the Walrus is really lonely, and is trying to find the Mint of the Sea.  And he has trouble finding the Mind of the Sea because of the Egg Men who represent the Ghosts of our past mistakes.\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\namuseyourself.com/amuse-2000/epitaph/paulisdead/…\n\n\n", "comment_213": "\nwell lets see here..... i music my teacher taught us about this song he says As you are he As you are me\r\nAnd we are all together. meaning the beatles are eachother except back in 1966 when the asume paul died there was a look alike competion and a man name william campell won they they r sayin u r me like William was paul then in Sitting on a cornflake - waiting for the van to come.\r\nCorporation teeshirt, stupid bloody\r\nTuesday  people eat cornflake for breakfast sometimes and in the magical mystery tour movie they had a van some he was waiting for it to come but he died and stupid bloody tuesday was either the day he crashed or when he died. then when it says I am the eggman, oh, they are the eggmen -\r\nOh I am the walrus. Gâ\u0080\u0099JOOB, Gâ\u0080\u0099GOO, Gâ\u0080\u0099JOOB. in one of the old humpty dumptys humpty dumpty couldnt talk and right before he smacked his head, paul died from a head injury, humpty dumpty was G JOOB G GOO G JOOB then walrus is a sign of death in anicent greece\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nwell lets see here..... i music my teacher taught us about this song he says As you are he As you are me\r\nAnd we are all together. meaning the beatles are eachother except back in 1966 when the asume paul died there was a look alike competion and a man name william campell won they they r sayin u r me like William was paul then in Sitting on a cornflake - waiting for the van to come.\r\nCorporation teeshirt, stupid bloody\r\nTuesday  people eat cornflake for breakfast sometimes and in the magical mystery tour movie they had a van some he was waiting for it to come but he died and stupid bloody tuesday was either the day he crashed or when he died. then when it says I am the eggman, oh, they are the eggmen -\r\nOh I am the walrus. Gâ\u0080\u0099JOOB, Gâ\u0080\u0099GOO, Gâ\u0080\u0099JOOB. in one of the old humpty dumptys humpty dumpty couldnt talk and right before he smacked his head, paul died from a head injury, humpty dumpty was G JOOB G GOO G JOOB then walrus is a sign of death in anicent greece\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nwell lets see here..... i music my teacher taught us about this song he says As you are he As you are me\r\nAnd we are all together. meaning the beatles are eachother except back in 1966 when the asume paul died there was a look alike competion and a man name william campell won they they r sayin u r me like William was paul then in Sitting on a cornflake - waiting for the van to come.\r\nCorporation teeshirt, stupid bloody\r\nTuesday  people eat cornflake for breakfast sometimes and in the magical mystery tour movie they had a van some he was waiting for it to come but he died and stupid bloody tuesday was either the day he crashed or when he died. then when it says I am the eggman, oh, they are the eggmen -\r\nOh I am the walrus. Gâ\u0080\u0099JOOB, Gâ\u0080\u0099GOO, Gâ\u0080\u0099JOOB. in one of the old humpty dumptys humpty dumpty couldnt talk and right before he smacked his head, paul died from a head injury, humpty dumpty was G JOOB G GOO G JOOB then walrus is a sign of death in anicent greece\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nk seriously people fuck off\r\nno one is yelling smoke pot at the end of this song\r\nits coplete fucking jibberish just like the rest\r\nthis is what john lennon was amazing at doing making people over-analyze his songs\r\nthere was nothing to do with the bible and they werent constantly stoned\r\nthere is one thing i can say and it is \r\n\"its just a FUCKING song\"\r\nno matter how good it is\r\nits still just a song\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nthis song is about the beatles on lsd. john even assembled the band to tell them that he is jesus Christ.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nsee how they fly like lucy in the sky\n\r\nhow people can say their songs aren't about    , i have no idea. it's so obvious.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\n\"Brian's bust was the work of the infamous Detective Sergeant Norman Pilcher (the \"semolina pilcher\" in John Lennon's \"I Am The Walrus\").\"\r\n-p. 114 of Faithfull: An Autobiography by Marianne Faithfull\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nI love how when a song with lyrics that make little sense comes out, there are a bunch of ignorant \"experts\" who claim to know what the song means. That's what John was fighting when he wrote this; he had always been a rebel, and this was one of the products of his rebellion.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nanother possible clue of the Paul-Is-Dead hoax.\n\n\r\nVisit  ludix.com/moriarty/…\n\n\n", "comment_222": "\nPAUL-IS-DEAD \n\r\nSgt. Pepper's Lonely Hearts Club Band:\n\r\nOn the Front Cover:\n\r\n1.) All the people are looking at a freshly dug grave.\n\r\n2.) Paul is holding the musical instrument cor anglais, and it is black, symbolizing death, and the only Beatle holding a black instrument. Where Paul is holding it with his left hand (being left-handed) he is displaying three fingers, meaning only three Beatles left?\n\r\n3.) This was the first album on Apple Records and the first album that the group wrote their name as \"Beatles,\" rather than \"The Beatles.\" This is inferred to mean that they are no longer a whole as in \"The,\" but now since there are only three, it is just \"Beatles.\"\n\r\n4.) The yellow hyacinth in the shape of a left-handed guitar only has three strings.\n\r\n5.) The doll in the red, black and white stripes has a car model on her lap next to her right hand. This model with red interior is supposed to mean the car in which Paul was killed and the red interior is blood.\n\r\n6.) The other three Beatles' are standing sideways behind the drum, except Paul who is standing forward.\n\r\n7.) On the drum is written in the center \"Lonely Hearts.\" Using a mirror, place it perpendicular to the center of the drum. Splitting the words \"Lonely Hearts\" in half, the combined writing reads - 1 ONE 1 X HE DIE. This means that the \"1 One 1\" equal three, or that Paul is gone, and the \"X\" is meant to cross out Paul. Between the words \"HE\" and \"DIE\" is an arrow that points directly to Paul.\n\r\n8.) The hand raised over Paul's head, is to mean \"death.\"\n\r\nThe Back Cover:\n\r\n1.) Paul is facing the back, which can mean that he is an imposter, or that he is dead.\n\r\n2.) George's right-hand index finger is pointing directly to the words \"five o'clock,\" the supposed time of the car crash.\n\r\n3.) That the song lyrics \"Within You, Without You,\" are printed over Paul's body.\n\r\nThe Songs:\n\r\n1.) Lovely Rita:\"When I caught a glimpse of Rita,\" and \"I took her home, I nearly made it.\"\n\r\n2.) A Day In The Life: \" He blew his mind out in a car, he didn't notice that the lights had changed. A crowd of people stood and stared, they'd seen his face before...\" \n\r\n3.) Good Morning, Good Morning: \"Nothing to do to save his life.\" \"People running around it's five o'clock.\" \n\r\n4.) She's Leaving Home: \"Wednesday morning at five o'clock.\"\n\r\n5.) Sgt. Pepper's Lonely Hearts Club Band: The reference to Billy Shears is supposed to be that of William (Billy) Campbell, the look-alike.\n\r\nMagical Mystery Tour\n\r\nThe Front Cover:\n\r\n1.) Paul is alleged to be the one in the \"black\" walrus suit.\n\r\n2.) In the booklet, Ringo's drums read \"Love the 3 Beatles.\"\n\r\n3.) In the picture where The Beatles' are wearing white tails, Paul is the only one with a black carnation, the other three have red. \n\r\n4.) When you hold the album cover to a mirror, the word \"Beatles\" is a phone number, which is 2317438. It has been said that if you had called this number back then, a recording came on saying, \"you're getting closer.\" Of course there is no area code etc., so I doubt this one too.\n\r\nThe Songs:\n\r\n1.) I Am The Walrus: At the end of the song, where the spoken words from the play King Lear are placed, you here \"O, untimely death!\" and of course as we know, \"The Walrus Was Paul.\"\n\r\n2.) Strawberry Fields Forever: When John Lennon says in the end of the song the words \"Cranberry Sauce,\" it was long believed to be he saying \"I Buried Paul.\" However, it was electronically manipulated to sound like he was saying \"I Buried Paul\" but he actually isn't. 3.) All You Need Is Love: At the end, Lennon says, \"Yes, he's dead.\"\n\r\nYellow Submarine\n\r\nThe Front and Back Covers\n\r\n1.) Lennon's hand raised over Paul's head, indicating \"death.\"\n\r\nThe Beatles (The White Album)\n\r\n1.) Glass Onion: The term used for a coffin with a glass top.\n\r\n2.) 'Don't Pass Me By: \"You were in a car crash....\"\n\r\n3.) Revolution 9: The words, \"Number nine, number nine,\" repeated many times are supposed to say when played backwards, \"dead man, turn me on dead man.\" The reference to the number 9 is supposed to be that of McCartney having nine letters.\n\r\nAbbey Road\n\r\nThe Front Cover:\n\r\n1.) The common meaning of the Beatles' dress - Lennon in white for a priest, Ringo as the undertaker, George as the grave digger, and of course Paul, in his bare feet, holding a cigarette in his right hand (being lefty) all means death.\n\r\n2,) The police vehicle parked to the right in the photograph is a morgue wagon. \n\r\n3.) The Volkswagen parked on the left side of the street has a tag that reads, \"LMW 28IF. This has been construed to mean \"LMW - Linda McCartney Weeps\" and the \"28IF\" means that Paul would have been 28 years old IF he had lived\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nOk. The song is purely work of The Beatles+LSD. It is completely illogical, yet oh-so-entertaining. The beat rocks, so people like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nJohn thought it was hilarious 2 c everyone insanely attempt to find the meaning of his songs, so he wrote a nonsense song!  Also..... some guy called him and said \"hey lets compare songs tomorrow!\"  since john had nothing he started freaking!  he started pacing and whenever he passed the table where he was writing he would add a sentence!\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\ni think it's hilarious that John apparenlty wrote the song to make people try and analyze it... and here you guys are 41 years later still trying to decipher it. This song has possibly the most comments i've seen.\n\r\nHahaha.\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nWell i think this song is about the establishment, It is talking in the begining about how we are all together and we are eachother and then goes on to say \"look how they run like pigs from a gun\" wich could be a metaphor for the police and how they dont really protect us. \"sitting on a cornflake - waiting for the can to come\" could be talllking about everyone is watching every time noise or move you make up untill you die which is \"when the van comes\". When it says \"Tuesday man you been a naughty boy You let your face grow long.\" It is mocking the government and there standards. The chorus is basically saying that i am an eggman, i am a walrus what does it really matter as long as we please the establishment. goo goo'jb is just a way of saying whatever. It goes on and talks about the policman running away. Then the part about the custard dripping for a dead dogs eye could be a english school song and crabalocka fishwife could just be made up words (perhaps from a LSD trip) \"pornographic Priestess boy you been a naughty girl,You let your knickers down.\" could also be reffering to everyone making such a big deal when people do what is natural such as having sex, or letting you hair grow. The part about smokers could just be saying that everyone makes such a big deal about smoking and act like the smokers are so bad when really they know, they just dont care.\n\r\nIn a summary i beleive this song is\r\n1. About the establishment and how everyone is watching every move you make and you cant do the things that come natural.\n\r\n2. Based of an LSD trip\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nbut really i beleive  this song was made to say everyone is over analyzing thing. We should all just let things be \"goo goo goojb\" doesnt make any sense so we should let it be and just exept it instead of having to figure everything out. The government should not be caring about sex, smoke, morals, hair, and making sure other people know what they are doing. Theyu should defend and not run away from the important things by over analyzing the small. Becuase eventaully we are all sitting on a cornflake waiting for the van to come\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nwell, i dont think the walrus, the egg man, and goo goo goo joob are representing people. Back in the day(shortly prior to this song being written) a student at a college mailed The Beatles and told them that their teacher made them analyze Beatles songs(much like we do). So The Beatles purposely made this song confusing. (the letter was sold online...big bucks) as for the term \"egg man\", John Lennon loved to go to orgies, and at one of them when a man finished up this guy cracked raw eggs on the girls faces. so John Lennon called him the \"eggman\" .\n\r\n               The end\r\n                hope this helps\r\n                   -Daniel\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nHardly any of their songs have a distinct meaning, from what I can tell. They were on acid most of the time...\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nI'm not sure what the Walrus represents, if anything, but I do know the eggman is about the time they were walking off a plane in Brisbane and a politician named Bob Katter, along with several other men, threw eggs at the Beatles. It was a huge mystery for years as to who threw the eggs, but he finally admitted to being the culprit.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nI have no clue what it means, but isn't it reasonable to assume, since John sings both \" I am the eggman\" and \"I am the Walrus,\" that John is both the eggman and the Walrus?\r\nAnd the way to explain John singing \"The walrus was Paul\" in Glass Onion-He was just trying to throw us off, get us confused, stir up some controversy.\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nany one else notice that all those goo goo gjoobs are supposed to be coo coo ca choos?\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nThis song is kinda Johns statement to the world. Its everthing that was on his mind in 1967 mashed together and mixed with LSD. \n\r\nThe piano intro is taken from the sound of a police siren. John will have been sitting in his garden, perhaps on acid, and he will have heard the police siren. This will have set his sinister train of thought onto notions of authority and societies control over individuals. An aspect of Johns genius was to get influenced by all that was going on around him, and this is shown in the way he reacts to the police siren.\n\r\n\"I am he As you are he As you are me And we are all together.\" This basically means were all the same. Its a gesture of togetherness, a hippie slogan. John was ultimately a believer in the goodness of human kind. This line is a plea for empathy amongst humans.\n\r\n\"See how they run Like pigs from a gun See how they fly.\" Possibly reffering to police again in \"pigs.\" Sinister surreal imagery. Hear Johns politics are more agressive and punk like. This is the counter side to his peacefull humanitarien opening to the songs lyrics. Hear already we see the confusion in Johns mind and the many contradictions in his politics. \n\r\n\"Iâ\u0080\u0099m crying.\" Johns confusion and frustration about society bubbles over. He is crying over what he see's all around him. But no one can see him cry.\n\r\n\"Sitting on a cornflake - waiting for the van to come.\" All though his life John feared he was insane. He was an original, and saw things in a unique way. But he wasnt sure if this made him a genius or insane. Hear he believes himself to be insane.\n\r\n\"Corporation teeshirt\" An image of materialistic society, posibly refering to Beatle merchandice, posibly to some sort of authority figure, ties in again with the police.\n\r\n\"stupid bloody Tuesday\" This is the sort of expression a straight nine to fiver may mutter to himself. Its again Lennon looking at straight society. Similar to \"Good Morning Good Morning\" also written around this period.\n\r\n\"man you been a naughty boy\" possible refers to psychology very popular at the time. At our heart we are all just the children we were before. frightened and scared. This is again John singing about straight society.\n\r\n\"You let your face grow long.\" Society dosnt let us express our true feelings. It is \"naughty\" to express sadness or dissatisfaction with the world. John is very sad and disatisfied in 1967. He is also saying that most \"normal\" people are as well, and it would be better if we were allowed to express it without being deemed insane.\n\r\n\"I am the eggman \" In victorian Britain insane people were made to wear egg caps. In the video to this song John wears one of those caps. Hear John is admitting to the world that he is insane.\n\r\n\"they are the eggman \" In the matter of seconds John has flipped this on its head. He now says that he is not insane just because he see's the world in a different way to everyone else. He says the people who live supressed lives in straight society are really the insane ones.\n\r\n\"Oh I am The Walrus\" John concludes that no one is insane. Instead John is an original and he might be insane, he might be a genius, he dosnt know, and he dosnt care, he is what he is. \n\r\n\"Mr. City policeman sitting pretty little policeman in a row, See how they fly Like Lucy in the sky See how they run. Iâ\u0080\u0099m crying - Iâ\u0080\u0099m crying Iâ\u0080\u0099m crying.\" More sinister surreal images of societies authority.\n\r\n\"Yellow matter custard dripping from a dead dogâ\u0080\u0099s eye.\" This suggests tiredness, defeat, resignation. The feelings of John perhaps, or the feelings of everyone in straight society maybe? surreal imagery, he never expressed himself obviously.\n\r\n\"pornographic Priestess\" A dig at religion, another authority in society. John has a dig at religion in a school boy way. He was not an intelectual and distrusted the middle class intelectual way of looking at the world. John was a naughty scouse schoolboy at heart, poking fun at authority.\n\r\n\"boy you been a naughty girl, You let your knickers down.\" This challanges concepts of gender. In the sixties every taboo was being challanged and John was a true rebel who loved the idea of outraging straight normal people.  He was at the fore front of the challanging ideas of the sixties. \n\r\n\"Sitting in an English garden waiting for the sun,\" John spemt alot of the mid sixtes sitting in the garden of his English mansion. He would usually be on acid. Whilst sitting he would make up songs, get weird ideas, do weird drawings, read, watch tv. His life was aimless and he was unsatisfied. He was unsatidfied with fame, unsatisfied with his marrige, unsatisfied with LSD and crushed by feelings of rejection from his childhood.\n\r\n\"If the sun donâ\u0080\u0099t come, you get a tan from Standing in the English rain.\" This shows how strung out John was. The weather meant nothing to him. He didnt mind just standing in the rain. This also explores similar ideas to \"Rain.\" written a year earlier.  \n\r\n\"Expert texpert \" John expressing his distrust at middle class intellectuals who theorises the sixties youth movement. Again he expresses himself in a school boy like way.\n\r\n\"choking smokers Donâ\u0080\u0099t you think the joker laughs at you?\" John looking at mainstream society again. People working nine to five, on there way to work.\n\r\n\"See how they smile, Like pigs in a sty, See how they snied.\" The smugness and self satisfaction of these people angers John.\n\r\n\"Im Crying\" And his frustration with the world boils over again. The tears flood down his cheeks.\n\r\n\"Semoline pilchards climbing up the Eiffel Tower.\" Something bad is slowly creeping over society, but no one can see it but John. We are heading for disaster.\n\r\n\"Elementary penguin singing Hare Khrishna Man you should have seen them Kicking Edgar Allen Poe.\" A final dig at middle class intelectual hippies jumping on the bandwagon. They claim to be enlightened but dont understand the genuis of Edgar Allen Poe.\n\r\nIf this song is about anything it is frustration at the world expressed through a alienated school boys eyes. It is Lennon looking back to his own childhood in which he was misunderstood and labelled a trouble maker by teachers and other authority figures. In this way it can be seen as an English counter point to JD Sallingers \"Catcher In the Rye\" filtered through copius amounts of acid.\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nThis song to me is complete nonsense. an thats the beauty of it. this was was created for that exact pupose. at the time john lennon was told that a teacher had assighned a group of students to inturpret a beatles song and relate it to what they thought one of their songs actually meant. at the time lennon was in between creating 3 diffrent songs but decided to put them all together after hearing this. while writting all parts of this song lennon was on lsd and just let the words flow. he included parts such a -Yellow matter custard, dripping from a dead dog's eye. just to confuse others. that part of the song is meaningless to the song. this part of the song was from an old nursery ryhme his friend and him created back when they were kids. another part of this song that makes it so careless is that john actually has made a mistake. the song should actually be called \"i am the carpenter.\" while lennon was writting the song he was reading the book \"The Walrus and The Carpenter.\" before finishing the book he believed that the walrus was the good guy in the story when actually it was the exact opposite. the walrus was actually the bad guy who was trying to steal as much fish as possible from the carpenter. over all this song is just a frivolous play on a beatle song. people everywhere, everyday try so hard to intturpret beatles songs, and the funny thing about this song is you cant really understand it. and if you do, then you have lost the complete meaning of this song. this song i believe was created to actually mock beatle listeners and say,\"hey not everything makes sense\" i personally love this song. this is by far my favorite beatle song. due to the fact that it is so odd and absolutely crazy.\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nsmitty1312: I really hope you're kidding.\n\r\nLindaRonstadt: You are exactly the reason why they wrote a song like this.\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nPeople this is the actual meaning!! its important! This song was based off of the accusations saying that Paul was dead! The walrus is the eskimo sign for death! Listen to the song GLASS ONION by the Beatles ( of course ) and it explains it!\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nWow....first page....Bite Me is certainly angry that we are under/over analyzing this song....ooooohh,\n\r\nThe Beatles were geniuses, and if they wrote this song to mess people up, well, job well done hahaha\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nOkay, let's get this straight. This song is based on the poem \"The Carpenter\". John was reading the poem while high, so he kind of blew it out of context. In the poem, the walrus is actually the villan while the carpenter is the good guy  saves the world (citation please). The eggmen are what I think to be all the normal people in the world. I'm not really sure if it is even called the carpenter, but I know I've read the poem.\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nits a shame all of you are doing the exact thing john lennon wrote this song against. analyzing lyrics. its about nothing. he was sticking it to everyone who analyzed his songs because he felt that they were also analyzing him.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nps. its coo coo cachoo.\r\nnot goo goo g'joob.\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nIf you play this soung backward \"i am the Walrus\" becomes \"Surlaw eht ma i\"  \r\nIt's hard, cold, fact.\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nthis song does not actually mean anything. i love it :D\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nhello i rly like this song and yes theres no way in hell ur lookin at this at page ten but why do so many of u fight over the paul is dead hoax if some ppl find interst in it then let them find there messeges and clues its not lke there harming anyone and besides the beatles if they were alive would prolly be having fun watching the ppl try to find all the messages all over again i mean theres no point in yelling at ppl over it and i dont mean every one i only read the firt few padges got bored of reading comments and went bak to music >< but still i think the songs were put there to have fun so enjoy them ;) and pls stop yelling at the ppl who r looking for clues :D\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nI've read so many fucking people's theories on this song. I honestly think that noone knows, which makes it even better..\r\nWhen you think about how amazing these guys were, its mind blowing. They were way ahead of their time, turned the music world upside down. simply genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nI really don't believe they are saying\r\n\"Smoke pot, smoke pot, everybody smoke pot.\"\r\nI know people think they hear it, but I have a feeling someone started saying that and then all of a sudden everybody decided to listen for it. If you think something says something, your subconcious mind will let you hear what you want to hear. I think it's just nonsense. If the whole song was just written to confuse people and stop them from over-analyzing and reading into the lyrics, then maybe it's all just nonsense at the end that John Lennon was using to confuse people even more. Has anyone ever considered that?\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nI really don't believe they are saying\r\n\"Smoke pot, smoke pot, everybody smoke pot.\"\r\nI know people think they hear it, but I have a feeling someone started saying that and then all of a sudden everybody decided to listen for it. If you think something says something, your subconcious mind will let you hear what you want to hear. I think it's just nonsense. If the whole song was just written to confuse people and stop them from over-analyzing and reading into the lyrics, then maybe it's all just nonsense at the end that John Lennon was using to confuse people even more. Has anyone ever considered that?\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nI really don't believe they are saying\r\n\"Smoke pot, smoke pot, everybody smoke pot.\"\r\nI know people think they hear it, but I have a feeling someone started saying that and then all of a sudden everybody decided to listen for it. If you think something says something, your subconcious mind will let you hear what you want to hear. I think it's just nonsense. If the whole song was just written to confuse people and stop them from over-analyzing and reading into the lyrics, then maybe it's all just nonsense at the end that John Lennon was using to confuse people even more. Has anyone ever considered that?\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nI really don't believe they are saying\r\n\"Smoke pot, smoke pot, everybody smoke pot.\"\r\nI know people think they hear it, but I have a feeling someone started saying that and then all of a sudden everybody decided to listen for it. If you think something says something, your subconcious mind will let you hear what you want to hear. I think it's just nonsense. If the whole song was just written to confuse people and stop them from over-analyzing and reading into the lyrics, then maybe it's all just nonsense at the end that John Lennon was using to confuse people even more. Has anyone ever considered that?\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nUhh. My computer was being dumb. I didn't mean to leave that comment 4 times. Don't mention it. xD\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nat the end the chanting says \"everybody smoke pot\" if you listen closely\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nIt doesn't mean anything. John Lennon wrote this on, I want to say two, separate acid trips. Also, some verses, were written in response to discovering that a school was having their students analyze Beatles' lyrics. John wrote the \"yellow matter custard\" verse and made the comment, \"Let the fuckers figure that one out.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nthe song doesn't mean anything UNLESS you're high =/\r\nThen again, almost every Beatles song makes more sense if your under the influence of weed.\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nthe song doesn't mean anything UNLESS you're high =/\r\nThen again, almost every Beatles song makes more sense if your under the influence of weed.\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nWow. There are a lot of people who didn't get a memo about the fact that this song has no meaning.\n\r\nI repeat: This song has no meaning. Please stop trying to assign meaning to a song which. as per it's author, has no meaning at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nif you re-watch alice in wonderland, which many haven't seen in years, you will notice that this song has direct symbolism to the story that tweedle dee and tweedle dum tell about the walrus, the carpenter, and the clams. It also has a double meaning in reference to the gorvernmet; the walrus being the big man, the eggman/carpenter being the people (us).\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\ni just think they were high\r\nnot that it isn't an awesome song x]\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nAh, it's about time I visit this song, I've been putting it off awhile now.\n\r\nMy namesake, indeed.\n\r\nAs I have mentioned in several other cases in other songs, it's ridiculous for anyone to assume they know the meaning of certain random or 'deep' lyrics.\n\r\nPeople need to stop trying to overanaylyze music, and just accept it for what it is.\n\r\nInstead of trying to rip eachother apart, arguing over who's right about what the artist meant, join together in admiration of them. I'm pretty sure John Lennon would be pretty ticked to find his fans arguing over his lyrics.\n\r\nWhether or not he was trying to say something by this, if he wanted you to truly know what it meant, they probably would have released a book explaining it as well.\n\r\nMaybe we all need to just take a step back, and 'Let it Be'.\n\r\nGet it? Play on words..it's another Beatles song..Ha.\n\r\nI am just riotously funny.\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nIn the Glass Onion, it clearly says, \r\n\"I told you about the walrus and me-man\r\nYou know that we're as close as can be-man.\r\nWell here's another clue for you all,\r\nThe walrus was Paul.\"\r\nSo the walrus is no longer an abstract concept; just Paul.\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nI heard that parts of the song had to do with the three dead rockstars (Joplin, Hendrix, and Morrison) Like the pornographic priestess was supposedly Janis Joplin, the sitting in the english garden line was supposedly about Hendrix, and the Eiffel Tower line was supposedly about Jim Morrison.\r\nHowever, whoever came up with this theory failed to realize that the song was written in I believe, 1967. All three of the rockstars died at least two years after the song was written.\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nI heard that parts of the song had to do with the three dead rockstars (Joplin, Hendrix, and Morrison) Like the pornographic priestess was supposedly Janis Joplin, the sitting in the english garden line was supposedly about Hendrix, and the Eiffel Tower line was supposedly about Jim Morrison.\r\nHowever, whoever came up with this theory failed to realize that the song was written in I believe, 1967. All three of the rockstars died at least two years after the song was written.\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nhe could just be referrencing them, it doesn't necissarily mean he was talking about their deaths. i've never heard that theory before, though, it's pretty interesting\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nActually at the end, the chanting in the background at the end was a group of vocalists that sang,\r\n\"Get one get one everybodys got one!\"\r\nIt wasnt 'everybody smoke pot!', but it kinda sounds like it. \r\nOf course some bands put hidden messages into their songs, but in the 796 page The Beatles Biography, it says that this song was a bunch of random crap John put together to get a laugh at the people trying to interpret his songs. It says that he even said, \"Lets see those fuckers try to work this one out!\"\r\nThe song maybe had some meaning, but it certainly didnt have any hidden messages.\r\nDo a bit of research before making dumb claims.\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nEleven pages of conflicting origin stories for the song, with not one reference to a credible source, proves how funny and useless this website is. The song is meaningless. It is a joke. Read the lyrics to the Dead Milkmen song with the same name. They got it. All of you did not. \n\r\nF- for making up stories to look cool on the internet. You all must be social giants.\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nGOO GOO GOO JOOB\r\nGOO GOO GOO JOOB GOO GOO\r\nGOOOOOOOOOOOJOOOOOB!!\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nI think this song is about as meaningful as the poem Jabberwocky.  I'm sure they got a kick out of people trying to find meaning in the lyrics.  I know I would.\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nOne word- narcotics\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nI think it's nonsense and mockery about overinterpretation.\r\nLike \"I am he\r\nAs you are he\r\nAs you are me\r\nAnd we are all together.\" - this might refer to the usual \"when he says \"I\" he means the whole mankind\" and so on.\n\r\n\"Elementary penguin singing Hare Khrishna\r\nMan you should have seen them\r\nKicking Edgar Allen Poe.\"\n\r\nThe penguin might possibly refer to Penguin books, don't know if they are used in British schools, but we did use them in our English lessons. Well, they rather interpreted Beatles lyrics then, therefor the penguin is singing Hare Krishna. But this is just an idea.\r\nBut \"kicking E. A. Poe\" could really mean kicking classic lecture for pop music lyrics.\n\r\nAnyway, I think it is not all words without sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nMy friend bought a book on The Beatles that talked about all their songs. I was reading about this one because frankly, I have no effing idea what it means... anyway, John said that the \"eggman\" term derived from, I'm not sure if he was a rapist or just some famously weird sex-fetish man who cracked eggs over the heads of the people he was having sex with.\r\nThat's just what I read.\n\r\nLove this song, nonetheless.\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nThe song is about Edgar Allan Poe and Alice in Wonderland filtered through LSD.\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nI love the irony in the fact that decades after John Lennon stated that this song is full of nonsense and don't have a meaning, everyone on here is still trying to find one.\n\r\nReally, he thought everyone over-analysed his songs, he said this one would keep us busy for ages and this has all proved him right. \n\r\nWe're here on songmeanings.net discussing a song with no meaning.\n\n\r\nPAUL MCCARTNEY IS ALIVE & WELL\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nNo it's true, they were all tripping on LSD and John Lennon started to say freaky things, so Paul just recorded them down and created this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nAt the verrrrry end it says \"SMOKE POT, SMOKE POT, EVERYBODY SMOKE POT\".\r\nYou'll hear it if you listen closely.\r\nPromise(:\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nyou know that I actually was reading \"Dianetics\" the other day and in that it said that the Walrus was actually the true killer of JFK before disappearing and finally re-emerging years later, this time with his gang of \"eggmen\" and were involved in 911.\n\r\nOJ Simpson was also having an affair with the Walrus\n\r\nanalyse that \t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nI'm not gonna waste time saying what's already been said.\r\nAt the end, it's saying \"Everybody jump up\" \r\nThis song is about: ________\r\nAnd that's it.  It's awesome, but it has no particular meaning, other than \"Hey, howabout \r\nlets do some LSD and write some random shit down!\"  \"Oh, yeah?  Bloody good idea, Johnny boy!\"\r\n\"You know what would be even MORE amazing?  Would be if we were to make a SONG out of it!\"\r\n\"Oh, come off it, John, that's just RIDICULOUS, you can't make a bloody SONG out of a bunch of useless\r\nLSD jibber jabber!\"  \"...Yeah, I suppose you're right.  Hmm, let's still do the LSD though, eh?\"\r\n\"Well of COURSE, John!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nOk, as for the whole \"Smoke pot, smoke pot, everybody smoke pot\" and \"Got one, got one, everybody's got one\" is a major arguement (or so i've noticed on the first page of comments). I listened to my iPod (on my speaker dock) at maximum volume and replayed the last minute of I am the Walrus. After all of the goo-goo-g'joobs, you begin to hear voices. They start out as, \"smoke pot, smoke pot, everybody smoke pot,\" then it repeats again in deep voices. Then the voices pick up and you hear simultaneously \"Smoke pot, smoke pot, everybody smoke pot\" and \"Got one, got one, everybody's got one.\" Do not focus on anything but the lyrics. The two phrases are so closely blended together, you can hear both. Focus on the pot phrase, you will only hear the pot phrase. Focus on the got one phrase, and you will only hear that phrase. \r\nLook for yourself. They are both there.\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nThis song is part of the album's meaning- it is the greatest hoax in music history- it was meant to mean that Paul McCartney had left the Beatles. \t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nSo just because the Beatles were geniouses everybody thinks they could see the future?\r\nNobody predicted Lennon's death because Chapman was crazy. Chapman didn't know when he'd kill John either.\r\nAnd Paul is very much alive. He was on the cover of Rolling Stone in July!\r\nThis song was probably written when they were high, but some of it could refer to hippy theology, like \"I am he, as you are he, as you are me, and we are all together.\" (see Across the Universe) or maybe not. Who cares, it's a good song. All you conspiracy theorists are dispicable. You're disgracing the Beatles. Also Lewis Carrol was on PCP when he wrote Jabberwocky and Alice in Wonderland. And have you seen the video for I am the Walrus? Paul is the first one wearing the Walrus head (the Walrus was Paul!) there. Mark Chapman was mentally ill and Paul is still very alive.\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nthis song has to do a lot about the time in which john was living in.      i am he as you are he as you are me and we are all together. basic eastern philosophy. pretty much daoist idealism. the tao being the ultimate spiritual force that we are all a part of. i am the eggman they are the eggmen i am the walrus was I BELIEVE taken from the book alice in wonderland which of course is a book about a trip off shrooms. its from the poems in the book about the walrus who is weeping (im crying). which is also what i believe the goo goo gjoob is. the sound of sobbing. john is singing everything he sees hears and feels. which in the sixties was a whole bunch of shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nWhat if this song was simply about trying to be yourself when everyone is so different from who you want to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nThe walrus is the suppose to be the villian (alice in wonderland; Walrus ate the little shells or w.e)\r\nThe eggman is suppose to be humpty dumpty (clumsy and innocent?) good.\n\r\nits about different ppl i'm guessing.\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nI think the walrus represents a leader, and the eggmen are the followers. Just an idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\n...Really? The whole song is just a joke...seriously.\n\r\nMost of those things people find on songs are unintentional on the band's part. Sure, they make some messages intentional, and some even mean something big, but I highly doubt the Beatles, or John for that matter, would put hidden messages in a song intentionally and mean something big anddramatic--if anything, they'd only try to mess with our heads. \n\r\nAnd I'm fairly certain, with all that I read on John Lennon, that the whole, \"Everybody, smoke pot!\" line was just John's way of playing a joke on society. Possibly trying to see just how far people would go to be like them, or just for the crazy fanatics who try to find hidden meanings in everything they listen to instead of just trying to enjoy the fucking song. I'm sure the mass's ignorance would be sending John into hysterics right about now...if he were still alive (R.I.P.).\n\r\nAh...John was too advanced for our time. But hey! At least he doesn't have to deal with us war-mongering, ignorant scum-bags anymore.\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nok, ihave read all your crap.  this song means zilch\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nmy friend [who's like a MASSIVE beatles fan] said that this song was written, because everyone was trying to analyise the cover of their Abbey Road album.\r\npeople were saying, \"perhaps the man in the Blue suit symbolises peace, and the one in the black suit represents death..\" etc.\r\nso they wrote a complete NONSENSE song to confuse the fuck out of everyone :)\r\nLong live the Beatles\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nOne of my favorite Beatles tracks as a kid.  Now as an adult, I reread the lyrics and am gobsmacked.\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\neverything is here,\n\nen.wikipedia.org/wiki/…\n\n\n", "comment_287": "\nI think it's safe to say we've all had days like 'Goo Goo GooJoob'.\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nI think it's safe to say we've all had days like 'Goo Goo GooJoob'.\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nThats what LSD does folks\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nThis is a john Lennon Masterpiece! He describes many things in his unique way about the world we live in, and sings \"I'm crying\", he was very aware of the corruption and gruesome acts of the world. \"I am the eggman, they are the eggman, I am the walrus\" It's like he says at the beginning of the song, \"I am he\r\nas you are he, as you are me, and we are all together\" He's saying were all in this together; The part where he says \"I am the walrus\" is John saying I am going to try and do something about it. He is going to sacrifice everything and become a leader in the fight against the war and the system. I urge you to watch the videos \"Money Masters\" and \"Zeitgeist Addendum\". John Lennon was very aware of what's going on.\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\ncomplete none sense\n\r\nI love it, it's just a classic\n\n\n\n", "comment_292": "\nMany people keep saying it was John flinging out random lyrics to confuse schools, to confuse people, to test his creative boundaries, to see if it would sell... etc. But some of you clearly forget what kind of artist John Lennon was... If you would asked him why the grass was green he would say \"No it's purple\" just because you wont try to figure it out yourself. His music was a part of him, if no one took the time to try to understand it, then they don't deserve to understand it at all. If you sit here and tell the child \"No it's hot don't touch it\" (I am sorry for using a cliche as an example) the child will doubt it and probably learn the hard way, but I bet you that child will remember not to touch the stove again... Same thing with his music. If he tells you what that song means to him, then it's out! You wont learn you'd probably sit there shake your head and say \"Oh I get it now\" but you really wouldn't. Words are just words, letters forming sounds that represent things. You can hear someone talk without understanding/feeling. To truly understand is to reach for the feelings/lessons/motivation behind the words.\n\r\nPS sorry for posting this twice, I'm somewhat new to this forum... Er... I accidently posted this as a reply to someone's comment... Sorry all!\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nThere is some meaning to this song but most of it is nonsense.  The music video both elucidates and confuses the deciphering of it.\n\r\nAnd here's another clue for you all, the Walrus was Paul.\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nthis has no meaning in my opinion i say they we're on an acid walk as they wrote the song\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nit's a LSD-song! cool\n\n\n", "comment_296": "\nI'm not sure that the song is so meaningless.  \r\nJohn might have initially been motivated by the desire to wind up the \"pseuds\" with a meaningless song, but...well, read Ian McDonald's book \"Revolution In The Head\" for the best theory as to what the finished song is about (\"the most idiosyncratic protest song\" outside Dylan's catalogue, that's how he sums it up).  It's not often I agree with McDonald, but I want him to be right about this!\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nThis song is definitely about drugs; either shrooms, or an acid trip, possibly even a bad trip.  Although The Beatles don't come off much as druggies or junkies, this song is quite trippy. With such lines like \"sitting on a cornflake, waiting for the van to come\"; what could this possibly mean? Oh yes, you're tripping! Nothing in this song makes much sense which is what happens when you take hallucinogenics. The Beatles wanted to make a song a little bit out of their comfort zone with the lyrics, and they achieved it here. \t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\nI have crabs.\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nPure psychedelic lyrics but it HAS to be a meaning, whatever it is. I don't know which way to search. Maybe the exquisite corpse technique. I can see meanings on this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nI hate this song. It has a few good lyrics, but most of it is just sick, especially the bit about the custard. Seriously, does this song have ANY meaning?\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nfind the meaning of the song is just one way to enjoy the song. so, go for it as long you enjoy it! and i don't think this song has no meaning at all, since words come out when we have something to think about. even gibberish have meaning so we have something to feel about.\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\nit just a chaotic song, but damn great! \"everybody smoke pot! everybody got one! everybody fucked up!\" epic ending! \t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nLewis Carroll's Looking Glass characters show up in James Joyce's Finnegan's Wake. The Walrus is from The Walrus & The Carpenter which concerns a walrus who befriends/comforts some young oysters and then disingenuously eats them. The Eggman is a reference to Humpty Dumpty. In FW he represents (among other things) the Cosmic Egg and when he falls off the wall an his yolk is running out of him his last words are, \"Goo goo g'joob\"\n\r\nMany people have commented that Lennon was purposefully trying to confound those who would over analyze Beatles' lyrics, but that is more specifically 'Glass Onion'. 'Walrus' like both FW & Looking Glass, is deceptively nonsensical; there's much actual depth to it for those who search.\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nI think this song is about the universe at war, and all the depths in the subject....\n\r\nI am he as you are he as you are me\r\nAnd we are all together\r\n...this is a metaphor. this person is actually alone, and is not understanding what to do with his life at the moment.\n\r\nSee how they run like pigs from a gun\r\nSee how they fly\r\nI'm crying\r\n... do you know the saying 'when pigs fly'? i think The Beetles are stating that pigs someday WILL fly, if they put their mind to it, so we should never give up. even when a gun is pointed to our heads.he is 'Crying' because the milk he had was expired, and that led to tears. he is telling us not to get worked up over such small things :) he was a wise man...\n\r\nSitting on a cornflake\r\nWaiting for the van to come\r\nCorporation t-shirt, stupid bloody\r\nTuesday man, you been a naughty boy\r\nYou let your face grow long\r\ni beleive  he is imagining he is Snap, Crackle or Pop and he is looking at things forom their point of view. and when children are naughty, their 'faces grow long' as in they are sad. so lets prevent this :D \n\n\r\nMr. City policeman sitting pretty \r\nLittle policeman in a row\r\nSee how they fly\r\nLike Lucy in the sky\r\nSee how they run\r\nI'm crying, I'm crying, I'm crying\r\n...War is very wrong, and we need to stop it.\n\n\r\nYellow matter custard \r\nDripping from a dead dog's eye\r\nCrabalocker fishwife pornographic\r\nPriestess boy, you been a naughty girl\r\nYou let your knickers down\r\n...Be careful when you around dead dogs, you never know what your meal is made out of. 'boy, you been a naughty girl' it's OK to have a sex change and priests are pedo's sometimes, so be careful.\n\r\nSitting in an English garden \r\nWaiting for the sun\r\nIf the sun don't come\r\nYou get a tan from\r\nstanding in the english rain\r\n...don't loiter for too long, or you will pay the price. this man sat in an english garden simlpy to wait for the sun. becuase of this loitering, he payed the price by 'tanning (getting burned)' by Acid rain.\n\r\nExpert texpert choking smokers\r\nDon't you think the joker laughs at you? Ha, ha, ha!\r\nSee how they smile like pigs in a sty\r\nSee how they snied \r\nI'm crying\r\n... This person keeps cryimg for some unknown reason. i think it's becuase he has trouble quitting smoking. the Joker (his alter ego) laughs at him. this makes him angry, so he collects pigs, to take his mind off things. they often Snide when they see him angry. A 'texpert' is a Tax collector doomed by gods, and is forced to master writing texts. that is why  he is a Text Expert. a Texpert. ;)\n\r\nSemoline pilchards climbing up the Eiffel Tower\r\nElementary penguin singing Hare Khrishna\r\nMan you should have seen them\r\nKicking Edgar Allen Poe\r\n... 'Eiffel Tower' is a metaphor for a dwarf giraffe named Gilbert. 'Gilbert' is often being Hunted. which explains the Pitchforks. an elementary penguin is a penguin that enrolled in a private school to learn martial arts. 'elementary penguin' is a code name. you can shorten it to 'elempen' then to 'elpe' eventually to 'errpe', to '3rrp3' into, 'Code name: 3pr' . get it now?? Edgar Allen Poe, is ALSO a metaphor. it is actually 'New Brunswick'. they are 'kicking it' in the front seat, sittin' in da back seat! you gotta make yo mind up, which seat, can you take? (it's Friday.)\n\r\nI am the eggman, oh, they are they eggmen \r\nOh, I am the walrus, goo goo g'joob\r\nGoo goo g'joob, goo goo g'joob\r\n... the meaning of life. Figure it out for yourself. \n\r\n(We LOVE the Beatles :P, and hope we didn't offend anyone in the making of this post. we were just bored :3\r\nThe last line is the only important one.)\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nlmw upside down could mean 'my wooden leg' ??\n\r\ni know the timelines are a bit off but you never know  ...........\t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\nthey forgot the paul is dead clue lyrics\n\n\n", "comment_307": "\nI don't see why it can't be a mix of everything-- life messages, references, and nonsense. Still trying to learn all the tongue-twisting lyrics by heart :)\t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\nJohn Lennon wrote this song over two weekends...on two LSD trips.  It was made to make no sense at all.  I love John :P\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nIt's so fucking funny to see people trying to figure out the meaning of this song. HAHAHAHA\n\r\nIt was written by John was a joke for those who try to interpret Beatles' song and so are people trying to understand what I Am The Walrus means. LOL\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\ngjoob.terryarchonship.com/\n\n\n", "comment_311": "\nYellow mellow custard dripping from a dead dogs eye\n\r\nMEANS: World war one, using mustard gas to kill people.\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nLet me restate that,\n\r\nArmy guys were called DOGS \n\r\nYellow mellow custard dripping from a dead dogs eye\n\r\nRefers to and army man being killed by mustard gas in world war one\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nAs others have said this song seems to be based on Lewis Carroll's \"The Walrus And The Carpenter\" and one question about this poem has been how sincere the walrus is when he says \"I weep for you\" and \"I deeply sympathize\" (after tricking the oysters and eating them.) So it seems fair to wonder about The Beatles' sincerity as also suggested by various posts. As for the comment about Humpty Dumpty, and the eggman, maybe it's a comment about the old British cannon called Humpty Dumpty and a comment about religion (Humpty Dumpty was by St. Mary's Church and notice the word play of \"cannon\" and \"canon.\" but, whatever it may mean we've all been on the fence about something and if we do build a wall, we have a barrier. That is how I see this song. It's like a drug barrier that closed off the gray matter of the brain leaving only residual fragments streaming in the white. The Beatles have done immeasurably better than this.\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nI think the song means... what you want it to mean! ...which is normally a cop-out, bulls**t thing to say. But, sincerely, it's pretty apparent that the song is another installment from a fairly established dadaist, absurdist tradition of opening up the skull and letting the subconscious mind spill on out onto the page. Why? One perhaps inadvertent reason is to provide yet another Rorschach upon which we can project our own fantasies and world-views.\n\r\nSo I can set out to give you my interpretations of the song, but in the end (more than usual), I'll really just be giving you a front-row seat to an exhibition of my own glories and hangups.\n\r\nIt's interesting to compare this to John's earlier dues-paying as a songwriter; he wrote some of the subtlest, tenderest little songs that've ever been heard on this planet. The fact that a guy with that kind of reputation could even pen something like I Am the Walrus shows how a person can change; and if John could do it, so can we.\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nSimply written to mean nothing... and yet ppl still analyze. How ironic eh John?\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nI always thought It was Parliamentary Penguins\r\nOh well\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\n\"I Am the Walrus\" is John Lennon's admission that he has become an integral\n\r\npart of the system that he once bucked and despised. The trappings of fame are\n\r\nindecent to him. The eggmen say to him good job, you made us a tidy profit\n\r\nsitting on our cornflake. His response is \"Do you know what I had to give up\n\r\nfor that? You made me an eggman and now your giving me shit for not shaving.\n\r\nGoo Goo Ga Joob\" (Fuck You). The very first line implicates the listener as\n\r\ncomplicit in the scheme but the balance of the lyric is an indictment of\n\r\nentities that John found distasteful in his day to day celebrity existence,\n\r\nnamely the government, record company, police, groupies, various beatniks and\n\r\nmost sharply  the press. He is not comfortable with the role thrust upon him\n\r\nand can hardly believe that he has become a tool of pop culture profiteers.  He\n\r\nis a little bit sad but above all he is mocking and most prominently of himself\n\r\ni.e. \"I am The Walrus\"!\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nYou know Lennon was clearly stoned out of his face when he worte this. I think this songs is best enjoyed when you have the lyric book infront of you. So you can appreatite just how crazy the lyrics are. (Sitting in an English garden waiting for the sun. If the sun don't come, you get a tan. From standing in the English rain.)\r\n It a very unique song.\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nI Am the Walrus has nothing to do with anything. John Lennon said that the song was written to confuse people. It has nothing to do with drugs. John didn't even know who the walrus was! He was just trying to confuse people in the White Album song Glass Onion when he said \"And here's another clue for you all.... the walrus is Paul.\" Another attempt to confuse people was in the Plastic Ono Band song God, when he said \"First I was the walrus, now I am John.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nWhat is Semolina Pilchard?? \nI heard that Lennon was just stacking certain thoughts and views in the song, one on top of the other without relating one to the other.\t\t\t\t\n\t\t\t\t\n\n", "comment_321": "\nOne of the most interesting songs to date. I still Love it \t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nI am quite sure that I have no idea what this song is about. I don't know who the people are who they mention in this song. And btw do you really get a tan from standing in English rain? I kinda always liked that line lol\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\nIf you guys would watch Anthology, you might know this.\r\nJohn was trippin on acid when heard an ambulance go by, which is how he got the melody for the song. He wrote this an ode to Lewis Carroll, his fave author.\r\nI always thought he got the \"I'm crying\", from Smokey Robinson's \"Oo Oo Baby Baby\", but I've never found any evidence of that.\r\nLove this song! \r\nA little band from Georgia, JACKYL does a great cover of this song!  (even tho JJ Dupree gets a few words wrong)\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\nit's just throwing out random words to entertain trippers. the juxtaposition of bizarre and incongruous images can be very entertaining partly because they are pure meaningless fantasy\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\nIts missing the \"Oompah oompah stick it up your jumper\" lyric which has been confirmed by The Beatles to come towards the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\nI think he is describing the picture.\n\nIf you look, there are eggmen, John is the walrus, and there are \"policemen in a row\"\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nJohn said he came up with the first line of Walrus (\"I am he as you are he as you are me And we are all together\") while on an acid trip.  It's interesting though that it's very similar to a line that appears in two or three of Richard Condon's books (the author of \"The Manchurian Candidate\"): \"I am you and you are me and what can we do for the salvation of each other?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nIt can all be summed up in one line---\n\n\"Don't you think the joker laughs at you?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nI think its a nonsense song. Brilliant song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_330": "\nThe meaning of this song? Destroying your brain with Acid...\t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\nAs I recall, one of the controversies about this song (there was several) was that at the end, background voices sound like they are saying \"smoke pot. Smoke pot. everybody smoke pot\". And they do sound like that. But the official version claims they are saying \"...everybody's got one\".\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nThere are essentially two different schools of thought practiced by artists.\n\nOne would define \"what I meant by that\".\n\nThe other would define \"it means whatever YOU think it means.\" \nJohn Lennon was a master at both!\t\t\t\t\n\t\t\t\t\n\n", "comment_333": "\nSitting on a cornflake evokes thoughts of sitting at home with no food in the house.\t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nThe playboy interview, while enlightening (Dylan and Gingsberg) is kind of funny because it's really just Lennon rubbing it in everyone's face that he's taking acid and doing his work, all orchestrated in a crazy way.\n\nOne of their best, for sure. Psycadelic masterpiece, this and Strawberry Fields Day in the Life those can't be topped as far as psycadelia in that style.\t\t\t\t\n\t\t\t\t\n\n", "comment_335": "\nSome people take drugs and lye around drooling, some people write masterpieces that stand the test of time.\nSome people don't use drugs and ruin the lives of others, some people try to distribute love and peace no matter what chemicals running on their bodies.\n\nI don't use illicit drugs, by the way.\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\ngreat song but it nots supposed to mean anything to us. John knew but it was childhood recalls and tid bits of his life.  \nthe Walrus was Paul, must of liked Paul that day\t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\nLucy in the Sky? With Diamonds.\t\t\t\t\n\t\t\t\t\n\n", "comment_338": "\n\n\n\n", "comment_339": "\nWow. What a weird song.\t\t\t\t\n\t\t\t\t\n\n", "comment_340": "\nMaybe he was writing his thoughts down while high and rearranged them later. It would make sense that they don't make sense (it happened to me).\r\nAnd give the teachers a real challenge.\t\t\t\t\n\t\t\t\t\n\n", "comment_341": "\nHate to necro an old song, but you are 'ALL BONED'!!\nThe song was MADE to be a joke, and the lyrics mean Zippity Do Da....\nLennon, while writing the song, was growing disheartened by the amount of time being \"wasted\" on deciphering his lyrics, and wrote a song that had NO meaning on purpose, after which he remarked \"T\"Let the fuckers work that one out.\"\nSorry to interject reality into this, but it means nothing, on purpose!!\t\t\t\t\n\t\t\t\t\n\n", "comment_342": "\nStill, if you NEED to dissect this song, he was really into King Lear at the time, and likely stole a bunch of lines from this....\nUnfortunately, he includes everything in an unordered confusing order of statements that also likely has zero meaning!! :P\t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nAs many have noted, Lennon wrote this attempting to defy anyone who interpreted the meanings of his songs. In particular, some university had a class in which his songs were analyzed and he wanted to write this completely meaningless song to vex that effort.\n\nHowever much Lennon may have intended to make this song devoid of any central meaning, there is a tone to it which is very distinct and repeated throughout, and it reiterates his purpose in writing it: Lennon felt that institutions are inherently flawed and repress the people beneath them.\n\nSo, \"I Am The Walrus\" repeatedly provides examples of authority trampling people beneath it, and lyrics in which Lennon belittle the authority.\n\n\"Corporation t-shirt\" â\u0080\u0093 An institution juxtaposed with informality.\n\n\"you've been a naughty boy, you let your face grow long\" â\u0080\u0093Â Beards were considered undignified, a convention that the Beatles respected early in their career, but around the time of Magical Mystery Tour, Lennon rebelled against by growing his out.\n\n\"pornographic priestess\" â\u0080\u0093 An institution juxtaposed with obscenity.\n\n\"you've been a naughty girl, You let your knickers down\" â\u0080\u0093Â Society judges promiscuity, particularly on the part of women. Lennon, obviously, did not agree.\n\nIf you ask a person to generate a lot of nonsense text, they won't make something truly random, and will inevitably bias it towards their own interests and beliefs. Lennon wrote a song here with no central meaning, but he repeatedly criticizes repression in the society around him. And, in doing that, it conveys a message as much as any song that intentionally has a central meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_344": "\n\"Nothing is real\"\t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nA [y]egg man is a safe-cracker. Read the surrounding lyrics. Make of it what you will.\t\t\t\t\n\t\t\t\t\n\n", "comment_346": "\nIt contains made up words like crabalocker and Semolina Pilchards.\t\t\t\t\n\t\t\t\t\n\n", "comment_347": "\nI don't know how true it is, but I've heard that Paul McCartney wrote everything that John Lennon said during an acid trip and the result was.........\r\nI AM THE WALRUS.  Sounds logical.  Can anyone verify?\n\n\n", "comment_348": "\nWho cares what you heard or what this song is \"supposed to mean,\" what difference would it make, either you like the song or not.... Im pretty sure that John didnt write this song and think *this song is only gonna have one significant meaning*... In my opinion, anyway you guys interperate this song, if it makes you happy or it depresses you or it just gave you the meaning of life, its all right ... :) \t\t\t\t\n\t\t\t\t\n\n", "comment_349": "\ni know, i am trhe only human being on earth that hates the beatles. but, this is one good song :)\t\t\t\t\n\t\t\t\t\n\n", "comment_350": "\ni cant believe there are 78 posts here. The song means absolutely nothing....Lennon said that himself. Case closed.\n\r\nOWNED!\t\t\t\t\n\t\t\t\t\n\n", "comment_351": "\nI have an alternative theory that, as strange as it is, I think I can prove. I stumbled on the proper context for 'Walrus', and after considerable research, believe that the song is an accurate prophesy of John Lennon's murder, 13 years before it happened. Just a couple of hooks: google Mark David Chapman's images and you will find him wearing the 'corporation t-shirt' (the second verse is all about Chapman immediately after the shooting). 'Mr. city p'liceman, little policemen in a row' refers to the two NYC cops who drove Lennon from the Dakota to the hospital uptown, as Lennon viewed them while dying in the back seat of the squad car. The whole song is an accurate timeline starting with the shooting, including who is telling the story. There are about two dozen verifiable facts including that Lennon would be 40 years old when he died. The entire song contributes. Everything means something. Want to hear more? Let me know.\t\t\t\t\n\t\t\t\t\n\n", "comment_352": "\noh and the egg man is humpty dumpty from alice in wonderland or through the looking glass which is the sequel. i forget which one. some trippy ass shit if you sit and read straight through it\t\t\t\t\n\t\t\t\t\n\n", "comment_353": "\nThis song was written just to fuck with people. I love you, John Lennon.\t\t\t\t\n\t\t\t\t\n\n", "comment_354": "\nthe lyrics are probably meaningless, but at that point when it sounds like they're saying \"paul mccartney is dead\" it gets kinda freaky.\t\t\t\t\n\t\t\t\t\n\n", "comment_355": "\nThis is a great song. Especially because it's about nothing. And especially the smoke pot bit.\t\t\t\t\n\t\t\t\t\n\n", "comment_356": "\nThis is a great song, regardless that John was on LSD, and I believe that no-one will ever write a song like this again. \n\n\n", "comment_357": "\nCan't wait for Rock Band: Beatles. This song is going to have a video just as awesome as the actual video lol\t\t\t\t\n\t\t\t\t\n\n", "comment_358": "\nIf you all forgot...the Beatles were very popular in the 60's and 70's when drugs were very popular, and people experimented with them. The Beatles did this stuff too, so most of their songs (exs. I Am the Walrus, We All Live in a Yellow Submarine, etc.) were probably written while they were high. And if you listen to the end of the song really hard, you can hear in the high voices people saying, \"got one, got one, everybody got one,\" and in the low voices, \"smoke pot, smoke pot, everybody smoke pot.\" \t\t\t\t\n\t\t\t\t\n\n", "comment_359": "\nFirstly it's about drugs. Secondly, it seems to be some sort of philosophical statement. \t\t\t\t\n\t\t\t\t\n\n", "comment_360": "\nOK, quite honestly, the first thing that came to my head when i hear this song is just that they were high when they wrote it. \"(L)ucy in the (S)ky with (D)iamonds\" was a reference to LSD. or so I've heard. I'm sure there is SOME meaning to this, but come on. They were high.\r\nAnd any1 who denies that the Beatles did drugs are idiots, sorry.\t\t\t\t\n\t\t\t\t\n\n", "comment_361": "\nI cannot begin to state how many different \"Paul is Dead\" clues there are but there are enough to fill the Albert Hall.  Among Sgt Pepper, Magical Mystery Tour, Yesterday Today and Tomorrow, the White Album and Abbey Road there must be 100.  Maybe one day I will return to this site and run through 100 of them when I have more time on my hands.  Hasnt anyone written a book on it yet?  Maybe I should.\t\t\t\t\n\t\t\t\t\n\n", "comment_362": "\nBite ME, it does not say \"smoke pot, smoke pot, smoke pot, every body smoke pot\" it is a hidden message yeah but it is froma  play that has to do with someone telling paul's dad that he is dead (go to this site and watch and listen to the whole video) i mean i partially think he is dead but i am not 100% sure yet youtube.com/…\n\n\n", "comment_363": "\nthis band just all around fuckin sucks hardcore. if your going to listen to oldies listen to \"the doors\", \"tommy james and the shondells\", \"ccr\", \"buddy holly\". i could go on.\t\t\t\t\n\t\t\t\t\n\n", "comment_364": "\nthey are almost definitely saying \"everybody smoke pot\" at the end of the song- some brilliant shit, whatever the song means\t\t\t\t\n\t\t\t\t\n\n", "comment_365": "\nthe walrus is representing god and it's ku ku kachoo\t\t\t\t\n\t\t\t\t\n\n", "comment_366": "\nits actually koo koo cachoo!!\t\t\t\t\n\t\t\t\t\n\n", "comment_367": "\nbeatles suck\t\t\t\t\n\t\t\t\t\n\n", "comment_368": "\nIf you listen closely at the end of this song, the chanting behind all the noise is supposed to be a hidden message that says, \"Smoke pot, smoke pot, everybody smoke pot.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_369": "\nThis piece of sh*t reaffirms my belief that the Beatles are the most overrated musical entity in history.This is actualy worse than la la la la la la la la la la la hey jude.\n\r\nWouldnt it have been way more interesting if he had expressed his true feelings or intentions in the song \" I wanna hold your hand \" by replacing \" I wanna hold your hand \" with \" I wanna grab your arse\" or \" I wanna squeeze your tit\"\t\t\t\t\n\t\t\t\t\n\n", "comment_370": "\nTo nikkileemn: \"Smoke pot...\" is really there, you bitch! Did you even bother to look for it? Everyone knows the band were potheads, and yes, sometimes bands DO put hidden messages in music, even backwards ( Some, like the thing at the end of Prince's \"Darling Nikki\" are obviously intentional because they sound like gibberish forward). The Beatles wrote the book on weird stuff like this (The \"Paul is dead\" thing was wonderful!) The ex-singer of Judas Priest even admitted to putting clues that he is gay is their songs. People like you, nikkileemn, are such ignorant assholes!\t\t\t\t\n\t\t\t\t\n\n"}