{"comment_0": "\nIt's about a parent/child relationship where the child admits that he gave his parents hell through the years, and the parents keep putting up with him. It describes my relationship with my parents too because they've never given up on me no matter what hell I put them through.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI Bet My Life\" is a song written by Ben McKee, Daniel Platzman, Dan Reynolds and Wayne Sermon of American alternative rock band Imagine Dragons. The track first appeared as a single on October 27, 2014, released as the lead single promoting their second studio album.\nLead singer Dan Reynolds has stated that the song is about his relationship with his parents and explained that while \"at times it's been strained and difficult... in the end, 'I Bet My Life' celebrates the bond that we still hold on to.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI know Dan Reynolds specifically says the song is about his at times strained relationship with his parents, but to me this song can be applied much more broadly than that.  I see the Parable of the Prodigal Son is this song pretty clearly (which I suppose parallels Reynolds's own relationship with his parents to a degree).  \n\r\n\"I know I took the path that you would never want for me\r\n I know I let you down, didn't I\r\n So many sleepless nights where you were waiting up on me\r\n But I'm just a slave unto the night\n\r\n Now remember when I told you that's the last you'll see of me\r\n Remember when I broke you down to tears\r\n I know I took the path that you would never want for me\r\n I gave you hell through all the years\"\n\r\nThis verse parallels the Prodigal Son asking his father for his share of the inheritance before the father has passed (a big cultural no-no at the time) and then going off into a faraway land to squander it on riotous living.\n\r\n\"I've been around the world and never in my wildest dreams\r\n Would I come running home to you\r\n I've told a million lies but now I tell a single truth\r\n There's you in everything I do\"\n\r\nThis verse captures the conflict that the Prodigal Son must feel on some level before returning to the father.  It's humiliating, but yet his situation has become desperate enough that he has no choice.  And in that difficult return, he comes to the realization that the father is always in him.\n\r\nThe chorus is sung in a very different voice, and to me that means that it's a response from the father.  The father loves the son so much that he will bet his very life on him.  He's all in.  Lines up perfectly with the overall Biblical narrative.\n\r\nI didn't care for the song the first time I heard it but it's growing on me.  Not as good as the best few songs from Night Visions but still a good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI've listened to this song like, 12 times, it says I bet my life on you, not I bet my life for you.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think this song is about someone feeling as if they have treated someone terrible throughout their life, and feel bad about it now. \"I gave you hell through all the years\" says it all. Also, he/she thinks that he also done something bad since then \"I knew I took the path that you would never want for me\" also explains. I think \"So, I, I bet my life\" is about saying now I will help you, I will care for you. Dan Reynolds (main singer of Imagine Dragons) says that he thinks that he as always been the black sheep in the family, I Bet My Life, I think, is all about that.\n\nThanks for reading my interpretation!!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIt's a religious based song. The lyrics sound like they're being spoken to god from a person who at one time turned their back on religion and now have embraced it again. Couple that with the Church Choir esc background and you've got a semi gospel styled song.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis could be what Darren Shan may have told his parents and sister when he transformed into a half human, half vampire creature. Because of his transformation, he had to leave his childhood home and fake his death. Now, he is like a slave unto the night since he bet his life to save a friend from dying from a prank he caused so he wouldn't go to jail for murder. The friend, however, doesn't believe him and vows to kill him when he grows up after he wakes up from his coma. Later on in future stories, he returns back to his hometown and maybe he'll ask them to forgive him for every stupid thing he's done.\t\t\t\t\n\t\t\t\t\n\n"}