{"comment_0": "\nHow music can take you back in time - it is tied together with painful and happy memories and that's what makes it so powerful. \r\nThis can both be the music of the time that memory was reality, or the lyrics of a song that are so like what you yourself went through...\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song makes me thing of my last year of high school and evertying else that goes with it. high school isnt your whole life, but its a big part that determines who you are, and should be embraced. this song also kinda makes me cry, thinking of all the crap me and the people i love have been through in high school.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song reminds me of all the good times I have with friends and how no matter where we go in life...those memories will always be a part of us.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI LOVE THIS SONG OMG-BEST SONG EVER. My favourite line is deffinatly \"I used to rock all night long to keep on rocking me baby\" I love how he says it haha LOVE IT\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthis sogn reminds me of good ole times eating cjicken and cake w/ bubba....he was gr8 to me both in bed and person...but now since i killed him i'll sleep better\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nFirst time I got the CD I never really listened to this song that much for some reason. But lately I've just been loving it and realizing how well it fits me.\n\r\n\"I go back to the smell of an old gym floor \r\nThe taste of salt on the Carolina shore \r\nAfter graduation and drinkin goodbye to friends \r\nAnd I go back to watchin summer fade to fall \r\nGrowin up too fast and I do recall \r\nWishin time would stop right in its tracks \"\n\r\n\"And I go back to the loss of a real good friend \r\nAnd the sixteen summers I shared with him \r\nNow \"Only The Good Die Young\" stops me in my tracks \r\nEverytime I hear that song, I go back.... \"\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\"I go back to a two toned short bed Chevy\r\nDrivin my first love out to the levvy\r\nLivin life with no sense of time\r\nAnd I go back to the feel of a fifty yard line\r\nA blanket, a girl, some raspberry wine\r\nWishin time would stop right in its tracks\"\n\r\nreminds me so much of my high school life, sitting there at football games with my now fiancee wrapped in a blanket even though he was out of school, and although I know he is singing about church choir, that line kinda gets me a bit too, as choir was one of the main parts of my high school life.  Although I certinally have funny memeories of sitting there at church with one of my best friends having writen conversations on bulitians, silently giggling over some guy or class or the pastors ear hair LOL.  I still miss high school like crazy and cry almost every time I hear this song, especially with the music video, it really makes me think of the times I spent with friends back in HS (class of 2003 baby!).  I also love how he incorporates how songs take you back, I've always been that way with songs, but music has always been my life.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nNot only does this song namecheck a whole bunch of classic rock songs, it makes reference to -- holy crap -- being in college.  This is a huge demographic shift in country music.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI'm still in highschool, so this song makes me not take things for granted and try to live life to fullest, but yet it still makes me think of my old friends before I moved, I love this song....\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song is wonderful. I never get tired of it. Like others have said, I think the song is talking about reliving old memories through music and how songs just take you back.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nKenny Chesney kicks HINEY! I have two favorite lines from this song. \"Chuck and Diane painted a picture of my life and my dreams. suddenly this crazy world'd make more sense to me\" You guys surely must all have favorite songs that make the world seem clearer to you? I know I do. and also when it goes \"now Only the Good Die Young stops me in my tracks\" the first time I heard the song, i sort of stopped in my tracks when it did that. You know when something touches you, and it feels like your heart and everything stops for just a moment? Great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nits Jack, dear , not chuck, its a old song by that one guy, I forget his name right now.\n\r\nbut your right the line Only the Good Die young does stop you and make you think of if that did happen.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthe song 'jack and diane' is by john 'cougar' mellencamp.  'only the good die young stops me right in my tracks'.  He's talking about the song by billy joel.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nBORING... Country is about as creative as rap, New Country anyways.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nBORING... Country is about as creative as rap, New Country anyways.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nYa know I really can't stand country too much. And Chesney hasn't put out anything close to this in my opinion in awhile. But this song is so realatable.\n\r\n I lost a friend recently at athe young age of 18 and I do stop in my tracks when I hear Billy Joels only the good die young I do stop what I'm doing and ponder. The way Chesney makes this song work is amazing, perfect job with the lyrics.\n\r\n Music does take you places, I can remember High School and listening to Jack and Diane, getting ready for the weekends. I currently do feel frat parties and college bars, as a freshman. I do listen to Steve Miller band and rock all night long. I love this stuff. Reminds me of everything about my life, so far.\n\r\n Great job Kenny.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nIt is a very good song, but there is something I have wondered since the first time I heard it - has Kenny Chesney ever listened to Billy Joel's \"Only The Good Die Young\"?  Many people, myself included, have suffered the loss of a friend too early, but other than the title, that song has absolutely nothing whatsoever to do with premature death.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\ni always thought it was \"now when the good die young, stops me in my tracks\". hm. \t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nGood song. It basically is just saying that there's always a few songs in your life that each represent a different time in your life when things may have been better, worse, or just different.\t\t\t\t\n\t\t\t\t\n\n"}