{"comment_0": "\nThis song is so sweet. \n\r\nWhen you're a child you run to your parents when you need someone to help you. When you're a teenage, you run to your friends. But when you're older, you need that special someone you can run to when you need to get away from everything else.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song is about needing someone and always going to them when things don't go right. As for Clancy81, 'this world keeps spinning faster to a new disaster' means that as days go on there will be bad things eventually and no matter what disasters come you can always run to someone.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI discovered this song on Conan O'Brien! =D\r\nThe meaning is pretty clear..no?\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ncould someone help me.what does \"this world keeps spinning faster into a new disaster\" mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ni think carlysunshine is right!!! there can be a christian meaning to this song and i think this song should be labeled as a christian song too!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nReminds me of a guy I once dated. The circumstance wasn't typical and didn't work out. But he would say that he wished at 'times like these that I could just run to you' .. Sometimes life just seems too much and you just want to run to the person who makes it all better.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nthis song is really cute ^_^\r\nit's basicaly saying, when life gets me down i know that i have you to run to.\r\nhow sweet[:\r\ni love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\n:)\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song has a deeper meaning than simply being a love song as some sources suggest. It's about having someone to turn to for support in a difficult time.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nwhat is the meaning of this song\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI cannot believe this only has three comments. I love this song. \n\r\nIt could very easily be turned into a christian song, also! \n\r\nVery nice :)\t\t\t\t\n\t\t\t\t\n\n"}