{"comment_0": "\ni watched the video and i think this songs is just being youself and not being the way socity wants you to be break free from the image and the way people exspect you to be .i think if you havent scen the video you should the meaning of the song my change after you watched it >U<\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe mood changes as the song goes on - it's quite clever really.  The first two verses (\"I want to break free\", \"I've fallen in love\") are very strong, positive and defiant in the desire to get out of whatever it is (a relationship, I think) that's gone wrong.  There's nothing he wants more than to break free (\"I've got to break free\").\n\r\nThe \"It's strange, but it's true\" bit always threw me, but I think it's sung to the person he's fallen in love.  The doubts are setting in now: \"But I have to be sure, when I walk out that door\" - does he really want to break free?  Does he love this person enough to leave whoever he's with at the moment?  Can he break free?\n\r\nBy the last verse, he's done it - he's left her/it/whatever.  And now he's done it, he realises how much he needed her/it - \"I can't get used to living without you/I don't want to live alone\".  The person he's left has such a hold on him that, although he knows he's got to complete the break, he can barely bring himself to do it.  \n\r\nAnd the last line, \"So baby can't you see, I've got break free\", re-enforces that: he hasn't broken free yet, not really.  She's still got that hold on him so that he's truly not free.\n\r\nLike I say, it's a bit more ambiguous than the title might suggest and it's a cracker of a song.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nAmazing song from an amazing band.\n\r\nI interpretate it the following way:\n\r\n'I want to break free'. \r\nHe's moaning about the person he's with, and that he wants to break free from the persons  lies. As the song progresses, I interpretate this verse as some kind of excuse for how he truly feels: he says he want to get rid of the person he's with, but secretly he doesn't want that at all. That what a lot of people do: it's called putting up a brave face!\n\r\n'I've fallen in love'.\r\nThis verse shows what his true feelings are. He is in love with someone and he's convinced that it's real. \n\r\n'It's strange but it's true'\r\nHe's kind of doubting wether he wants to break free or not: It's strange but he can't seem to get over the way how this person loves him. But, he continues to give himself power by saying that 'he wants to break free, he wants to break free'. \n\r\n'But life still goes on'\r\nHe has broken up with the person, and as everyone always says: life goes on. But he can't get used to living without this love. Now he wants to break free from the feelings of wanting the person back, but deep down he just wants to be with the person. \n\r\nAt least, that's my interpretation, I tried! ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think this is one of those songs that can be interpreted in lots of different ways. I love songs like this that can identify with so many people that need to identify with a song. For me the way I interpreted \"I want to break free\" is partly explored in the way it is used in the we will rock you musical. Wanting to break free from a a world that is just so false and corrupt and untrustworthy and evil, etc. And also I can identify with I want to break free, in terms of wanting to break free from my life the way and break free and change it and myself. This is one of my favoruite songs, based on the fact that it a brilliantly written song but also because the lyrics are so powerful. Songs like bohemian rhapsody are such amazing songs and so creative and imaginative. But I find that I connect more personally to the lyrics in songs like \"I want to break free\".\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI intepret the meaning of this song as a guy who is utterly in love with this one girl who is constantly leading him on. He gives her everything but in return she does not give him nothing. He knows that he needs to move on a \"Break Free\" from her lies and how satisfied she is with herself. However he is scared of this change of not being there for her and does not think he can make it on his own\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI've pondered the meaning of this song for 25 years--it has a deep personal meaning to me, and has always left me perplexed, because a guy that I was dating & deeply in love with dedicated the song to me at a bar one night. Our relationship was young, but we felt the same way about each other--in fact, he had professed deep love for me on our second date, despite being on the heels of a recent break-up.I honestly didn't know what the song meant, or what he meant by dedicating it to me As I think about it all these years later, I can't help but think that the song conveys a man's feelings of wanting to 'break free' from one relationship to pursue a new one; leave a relationship where his feeling have not exactly been returned, yet he was afraid of walking out that door & being alone if things don't work out.. His insecurities have kept him trapped in one relationship, and a bit hesitant to pursue a new one as he says \"you're so self satisfied, I don't need you.\" He seems truly overwhelmed by his new lover, whom he proclaims to be his first true love (as my boyfriend did me), & saying \" I can't get over the way you love me like you do.\" My boyfriend felt this way also--I accepted & loved him unconditionally, not just in spite of his flaws, but because of them--they made him who he was. So I think he was scared by these feelings, that someone could love him wholly & unconditionally. He ultimately does break free, immersed in a new relationship, but seems to express some remorse at the end of the song--perhaps leaving a long-term relationship for someone new, he felt apologetic, explaining why he had to break free & still a tad unsteady without her familiarity by his side. That's the best meaning I've come up with after years of thinking about that night in the bar! I suppose I could have asked him what he meant by playing it for me & never once questioned this!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis was one of my first Queen songs. I still love it to this day. However, the music video has to be the best. All of Queen is dressed in drag, and Freddy's in his leather shorts and vaccumming. Viva Freddy!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nDespite most people thinking that this song was written by Freddie about him being gay,  the song was actually written by John Deacon and in my opinion I think it was kinda inspired by the fact that John's seen as the quiet one but he'd love to 'break free' or it could mean that he wants to end a relationship but feels he can't because he 'can't get used to living without' the person in particular, so there you go, I've given you plenty of points to comment on now so write a comment because I can't believe only2 people have commented on such a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis video rocks, the meaning of the song is really obvious, somebody is trying to scape and be free!!!!\r\nCOOL SONG, Freddy's voice ROCKS!!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthis song rox!\n\r\n\\\\// Peace\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nIt's about Freddie wanting to break free from his AIDS so he can get on with his love life.\n\r\nSeriously though, John Deacon said that the songs he wrote were pretty simple, so the meaning of this should be pretty self-explanatory.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nFor Christ's sake, this song was written BEFORE Freddie had been diagnosed with AIDS, look up the facts before you post a mistake.\n\r\nI think the song is simply about breaking free from the oppression of being single, needing someone to love you.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nApparantly they were taking off a TV programme by dressing in drag... any idea which programme, anyone?\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is great.... the melody is played by like, 4 different instruments! ☻\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nIs there ANY Queen song on this listing that some eejit has not claimed relates to Freddies sexuality or illness. Just show me one. Please\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nWhat is the meaning of its video?\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\n\"Apparantly they were taking off a TV programme by dressing in drag... any idea which programme, anyone?\"\n\r\nCoronation Street - a very famous soap in case you don't live in Briatin.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nquite right, Mercury Girl =oD Roger says so on the audio commentary on the Queen's Greatest Video Hits 2 DVD\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nSo baby can't you seeeeee-heeee? I've got to break frrrrrreeee!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nMaybe it was just a pure piss take and it was done for humour? I heard though that Freddie really wanted to shave off his moustache for the video but  everyone told him no, as it'd defeat the purpose of the video....But he did it anyways...for the 'lycra' bits....\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni dont care what its a bout, it just makes me feel how i want to break from being a teenage coz its so depressing. i think people try to fidn out menaing of songs, but it can be anything really. maybe they wrote the songs to mean loads of things....hmm i dont know, im in a reflective mood today..\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nit means that he wants to be out of a relationship.\r\nhe had \"fallen in love...for the first time\"\r\nhe says 'i cant get used to livin without you by my side\", but then says \"God knows, got to make it on my own, So baby can't you see, I've got to break free\"\n\r\nHe loves the person, but the relationship is shitty:\r\n\"I want to break free from your lies, you're so self-satisfied, i dont need you\"\"\r\nHe is trying to convince himself that he does not need the person who treats him like shit, even though deep inside he feels like he still DOES need that person.\r\n\"when i walk out that door, i've got to be sure\"\n\r\nhe is kind of questioning, but really wants to \"break free\" from the relationship.\n\n\r\nOr at least that's my take on it.\r\nIt's how I feel about my boyfriend....so..... maybe I just analyzed it based on my own feelings..\r\n\"\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nhe kept his moustache because it was funnier, also, he was sexier with it. when they released this in the land of chains they lost a lot of sales thanks to meat head yanks who needed dissecting. people are so fucking shit. and stupid too - i'm assuming these people who stopped buying queen records used to go around listening to his genius not knowing freddy was gay. the fucking  wastes of d.n.a\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis song is great and I would bet money that everyone of us has felt like this about someone at some point in life. A fabolous song - Oh how I want to break freeeeeeeeeeee\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nthat's it, i don't want to see another person ending their post with a quote from the song in question.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nthis song is great! the guitar solo is sweet! i used t not listen 2 thsi song cos of the camp video even though its funny but after reading katherine7486's comment that it wasnt freddy who wrote the song has made me luk at the song in a new light. Oh yea this song is also gud cos if u sing it like in the shower u sound like a soundalike until u hear urself but owell. im trying 2 watch the video but i cant find no sites 2 show it, any1 no 1?\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\n\"I WANT TO BREAK FREEEEEE!!\" A true anthem! This song is kinda complex once you look at the lyrics, but if you break it down... it's about wanting to get out of a relationship that you think you're too deep into, and trying to get out, and finally getting out. I think the way to relate that to the music video is about breaking off the relationship between you and your normal, unfulfilling life.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI think, when you look at it without thinking of relationships, it just seems like it's based on life, as a whole. Just wanting to get away from everything, even though he's not really sure about anything, he knows he wants to be free from it. Thoughts anyone? (I may not be right but, hey, at least I tried!) \r\nP.S. anyone want to add me? jersey_girl_22@hotmail.com\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nMy favorite song ever\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nawesome song. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ni hate it when every queen song has to be interpreted to mean something gay... if any other band were to have done this song, people would talk about anything else this songs means to them, but just because freddy is gay, and queen did it, people have to say its about something gay...\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI have know this song in Ireland with on holidays. I love this song because it is wonderful and the lyrics too.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nmedia.eod.com/kleptones_opera/…\n\r\nAwesomeness.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThis song was written so I could eventually lip-sync it in front of the entire student body at school...\n\r\nI've grown to hate this song in a sense since then\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nIt's written by John, not Freddie, so it's not necessarily \"a gay song\" despite of the drag theme.. In an interview long time ago John was asked what this song is about or where did he got the idea and I remember John answering something like \"It came from frustration\". He didn't say what he had been frustrated about so I just thought maybe it was his marriage.\r\nMaybe he was just longing for the certain freedom he probably did not have as a married man with children. I think it's kinda natural, I recall he got married quite young.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI always thought the song meant that the song meant that the guy fell in love with somebody and wanted to break free from his life, whatever is holding him back. \"But I have to be sure when I walk out that door\" is challnging that person. He's saying in this song, \"Okay, I'll leave for you, but if I do, will you be willing to love me?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI think if from a teenage point of view, its about falling in love and wanting to be free from your parents.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI think it's about breaking up.  He still loves the person in question or maybe he just needs them and it's about him needing to breakup and be free of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nhahaha Palevengeance that's funny :D\n\r\ni used to hate Queen but now i'm in the stage where i'm sooooooooo addicted to them..\r\ni especially love john deacon and freddie mercury... hehe (the north and the south, the queens most different from each other)\n\r\ni also think that it's about wanting to break free from a relationship and yet not wanting too... (strange but it's true... i can't get over the way you love me like you do...)\r\ni also read somewhere that some people in south america felt that it's a song about breaking free from oppression. u can really feel the force with the way freddie sang it, i can understand why it also sounded like a battlecry...\n\r\nfunny video too... i saw interviews of john and of freddie... \r\njohn said it was roger who first thought about dressing in drag and the others agreed. (i also read somewhere that when his daughter cried when she saw him dressed as grandmother.. hahaha.. probably got scared..)\r\nfreddie also jokingly said everybody ran to their frocks... i can just imagine them macho guys checking out blouses and skirts that suits them best!!!\r\nroger looks sooooooooo pretty!!! brian looks like a dried up old lady... maybe he should've been the grandma instead... :D \r\nfreddie is hilarious as the maid... somehow i thought of him as cinderella with john as the step mom and brian and roger as the step sisters... :D\r\ni don't like the other part of the video though, sort of hellishly scary...\n\r\nsorry i got too carried away... i ended up writing song and video meaning..\r\nQUEEN rules!! GOD SAVE THE QUEEN!!\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nWhen I was writing my review of the song Bohemian Rhapsody, 1 of the things I said it was about was the fact that homosexuality was usually hidden back in those days. With the clip and the title, it sounds like he wants to reveal his sexuality, but is afraid to do so, in case his family hates him or it could affect his musical career. \r\nAnd with the lyrics, it sounds like he's fallen in love with someone and wants to reveal it, but can't.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nJust another interpretation that nobody seemed to touch on (pun intended..) Deacon is writing about an addiction to self-lovin, aka masturbation. He wants to break free from the addiction; that masturbation is purely \"self-satisfying\"; \"living without you by my side\" aka his hand; he has actually fallen in love for the first time with someone else, and he's now trying to break free from the \"love\" he expresses with himself - because at this point of his life, it's only holding him back from living his own life free from the addiction; \"God knows, got to make it on my own\".\n\r\nComments?\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nFor me this song symbolizes my own experiences, in a way that I broke free and found myself again. Again in a world, that tells us what is nice and what not, what to do and what not.\n\r\nI have always loved myself, but I had to break free to dis- and recover this love again.\n\r\nBecause we are what we make out of ourselves and our lives are as pleased as we let them be.\n\r\nFortunately I have learned my lesson, and thanks to Queen for sharing this great music\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI once dated a guy who after a huge fight said this was our song...thats when I knew the relationship was over, it just took me some time to actually accept it hahaha...I absolutely love the song tho, even after that :)\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI think this song is about someone in a relationship who's fallen in love with a different person. The first verse is about his current relationship: \n\r\n\"I want to break free from your lies\r\nYou're so self satisfied I don't need you\"\n\r\nHe does not love this person. In fact, he does not even like this person.\n\r\nThe second verse reveals he's fallen in love with someone else. \"But I have to be sure\r\nWhen I walk out that door\"... but he is unsure if this person he loves returns his feelings. He wants a guarantee that if he leaves his current relationship, the one he loves will be available, so he's not left all alone. \n\r\n\"I don't want to live alone, hey\r\nGod knows, got to make it on my own\"\n\r\nHe knows he should just leave, and that being in a relationship with someone he doesn't love is worse than being on his own. But he's torn, because he fears being alone. \n\r\n\"So baby can't you see\r\nI've got to break free\"\n\r\nThis verse is addressing the one he loves. It's within his/her power to simply say he/she returns the feelings and won't allow him to be left all alone. Then he will have the courage to finally break free. \n\n\n", "comment_44": "\nI think this is one of those songs that can be interpreted in lots of different ways. I love songs like this that can identify with so many people that need to identify with a song. For me the way I interpreted \"I want to break free\" is partly explored in the way it is used in the we will rock you musical. Wanting to break free from a a world that is just so false and corrupt and untrustworthy and evil, etc. And also I can identify with I want to break free, in terms of wanting to break free from my life the way and break free and change it and myself. This is one of my favoruite songs, based on the fact that it a brilliantly written song but also because the lyrics are so powerful. Songs like bohemian rhapsody are such amazing songs and so creative and imaginative. But I find that I connect more personally to the lyrics in songs like \"I want to break free\".\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nLove the video- so funny! Roger Taylor actually looks really pretty as a girl! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nAfter reading the comments I looked up the song on youtube... BEST VIDEO EVER!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nPersonally I've always thought of this about getting over or recovering from a addiction. Breaking free that the thing that controlling your life.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nMaybe it's because I can relate to it but it always made me think of someone who's gay who has a lover and wants to let people know.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nAt first, I thought it was about wanting to come out as gay but you're afraid to because it goes against your parents religion. \n\nThen I read the lyrics and it seems like it's about wanting to get away from an abusive relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nIt's about getting free of the people or things that are holding us and prevents to be ourselves completely.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nIt's about want to break free from a relationship with someone after you find someone new, and yet missing the old relationship after the new one fails.\n\nThe singer is obviously dissatisfied with the first relationship:\n\"I want to break free from your lies\nYou're so self satisfied I don't need you\nI've got to break free\"\n\nThe new relationship is exciting and feels real.\n\"I've falled in love for the first time, this time I know it's for real\"\n\nStill, the singer struggles to leave the first relationship, which is comfortable.\n\n\"It's strange but it's true\nI can't get over the way you love me like you do\nBut I have to be sure\nWhen I walk out that door\nOh how I want to be free, baby\"\n\nAfter leaving the old relationship, however, the new relationship breaks down.\n\n\"But life still goes on\n...\nI don't want to live alone, hey\"\n\nand the singer now misses the first relationship terribly: \n\n\"I can't get used to living without, living without, living without you by my side\"\n\nThis means that he still hasn't really broken free from his attachment to the first relationship, from which he had wanted to break free:\n\n\"So baby can't you see\nI've got to break free\"\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI can't get over how clever the lyrics are. For me, it's about individuality and independence, especially when you love someone. Falling in love can test your yearning and need for freedom and just being yourself. Falling in love means bring selfless, but can you really be completely selfless? You can try walking out that door and could you really do it? You can taste the freedom, but you won't probably take the final steps. It's an exquisitie kind of hurt. I've never been in love, but the visual I get from this song is just...wow! Queen Rocks!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nThis song explains his first proper gay relationship. Freddie was being treated like a goldmine, taken for granted because he was too easy going, when he wrote this song he knew that he could go longer stay with the guy but he was too used to him being around, having him run around and do everything for him. The bloke in question used his house to invite men over on a regular basis for free partying, drink and drugs, but it got to a point where Freddie didn't want all that anymore and realised he needs to \"break free\" from it all... \n\r\nThat's how I see it...\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI think , this song is dedicated to the world gay...doesn't matter this song it's a Roger's song.. I'm from Mexico.. and here it would be \"Quiero salir del closet\", but it's a great song and funny video... Viva Freddie Mercury... Freddie Mercury lives forever...\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI can't believe that Coca-Cola got a hold of this song. It seems like more of a Pepsi anthem to me...\t\t\t\t\n\t\t\t\t\n\n"}