{"comment_0": "\nHe found that her girlfriend (or boyfriend) cheated on him, but though, he still need her/him around. It's a very sad song, because it shows how hard it is to find out something like that and not to be able to shut down your emotions and get over it soon.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI really like the song, but don't quite get the lyrics. i don't understand when he sings: You say I'm crazy\n'Cause you don't think I know what you've done\n\nWhy would she call him crazy? He hasn't accused her of anything. If he had said, \"You're cheating on me\" yes, then she could say, \"you're crazy.\" But he hasn't made any accusations. I thought the video was odd because here's a guy singing in the first person but about a third person, the woman. Why didn't he sing about himself being cheated on? In Adele's Someone Like You, she sings in the first person and she's acting out the song from her perspective.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nMy opinion on this song is that the person whom he was with did him wrong cheating ,or what have you, and apparently was confronted about it...but when asked the response was \"You crazy\" as if to say I didn't do anything like that, you are tripping,  when the singer is saying you are saying that ONLY because \"you don't think I know what you've done\" and \"when you call me baby...I know I'm not the only one\" is because you are calling another person the same thing. To sum it up the cheater got caught and tried to deny it by making the accuser look crazy.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI have been through exactly the same dysfunctional, self sacrificing Gay relationship as Sam has here. It Sux! Clearly he has felt the pain and degradation at the hands of his emotional manipulater too. Like Christian Grey, a lover incapable of giving his heart hasn't hesitated to take Sam's trust and love to feed his own narcissistic personality, cheated, and worst of all, lied and denied it, making Sam feel wrong! But he was right and denied himself his instinctual truth, further damaging himself by not asserting!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nâ\u0080\u009cIâ\u0080\u0099m not the only oneâ\u0080\u009d - by Sam Smith \n          My opinion in â\u0080\u009cIâ\u0080\u0099m not the only oneâ\u0080\u009d by Sam Smith is that he is relating this song to people who have experienced what itâ\u0080\u0099s like and how it feels to be cheated on. Cheating is a daily occurrence in society today and you canâ\u0080\u0099t really relate to it unless you yourself have experienced it. The emotions and heartache that follow cheating are almost what feels like impossible to overcome. Sam Smith uses parts of his songs to describe what it feels like such as the line â\u0080\u009cI have loved you for many years, Maybe I am just not enough, You've made me realize my deepest fear, By lying and tearing us up.â\u0080\u009d That line is describing how that being cheated on makes you feel like you were never worth it enough to be loyal too. You finally realize that the person you've loved for such a long time has been lying to you and never thought you deserved to know the truth. The tone of the song Sam Smith sings in is a complete somber desperate tone. The beat of the song and the way he sings it, it automatically screams heartbreak. His voice sings in such tragedy that you can almost feel how upset he is and how much pain he is in. Sam Smith also sings in such a way that you can almost predict how his song is playing out. Along with the music video he made, you have a pretty good idea of the imagery his song is creating. When he says â\u0080\u009cFor months on end I've had my doubts, Denying every tear..â\u0080\u009d You can almost envision tears streaming down his face as he sings the song. It helps you get a good feel of how he truly feels. Overall his song hits deep with many people who have gone through exactly what heâ\u0080\u0099s singing about which is why itâ\u0080\u0099s been a huge hit. Sam Smith did an excellent putting his feelings and words into a song and making it feel like a reality. His points are very clear that cheating hurts and you shouldn't ever do it to someone that loves you.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIn agreement with the first comment. It's a lovely song to experience.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nHis ex-girlfriend discovered that he is gay (he revealed this in May of 2014 to the public) and maybe cheated on him because he kept that secret from her (\"You say I'm crazy\"). Back in the 1960s and earlier, gay people were considered crazy, and she must have been a conservative type.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI personally believe that â\u0080\u009cIâ\u0080\u0099m Not The Only Oneâ\u0080\u009d by Sam Smith has to do with people breaking up from awful experiences they go through and having to be hurt all of the time. The first key idea would be a couple where one of them is being cheated on; So in the 3rd and 4th line the speaker wrote, â\u0080\u009cI can't believe you let me down\nBut the proof's in a way it hurtsâ\u0080\u009d to let one know that the speaker has never been disappointed from the love of his/her life and ever since he/she confessed, their world has just been horrible and hurt. Another lyric from this song the speaker wrote about the person finding out he/she has been cheated on is â\u0080\u009cYou've been so unavailable\nNow sadly I know whyâ\u0080\u009d.  The second key idea would be the lover being hurt all of the time. The speaker wrote â\u0080\u009cFor months on end I've had my doubts Denying every tear I wish this would be over now But I know that I still need you hereâ\u0080\u009d, indicating that he/she is hurt and feeling sad and hopes that from being cheated on and being left alone all of the time will end soon. The Third key idea from this song would be where the lover being cheated on, tries to have revenge. The speaker wrote â\u0080\u009cI have loved you for many years Maybe I am just not enough You've made me realize my deepest fear By lying and tearing us up You say I'm crazy 'Cause you don't think I know what you've doneâ\u0080\u009d, telling us that he/she have had enough of the relationship, so he/she tries to find ways to have revenge on him/her by changing their aspects of life even though the lover knows that he/she is crazy to be with the love of his/her life.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI personally believe that â\u0080\u009cIâ\u0080\u0099m Not The Only Oneâ\u0080\u009d by Sam Smith has to do with people breaking up from awful experiences they go through and having to be hurt all of the time. The speaker expresses his feelings and life aspects, using a couple as an example to make the listener understand through the song.\nAs one begins to go through the song, it immediately gets the attention of people from the speaker that can easily be understood and feel the aspects the speaker is going through. The first key idea would be a couple where one of them is being cheated on; So in the 3rd and 4th line the speaker wrote, â\u0080\u009cI can't believe you let me down\nBut the proof's in a way it hurtsâ\u0080\u009d to let one know that the speaker has never been disappointed from the love of his/her life and ever since he/she confessed, their world has just been horrible and hurt. Another lyric from this song the speaker wrote about the person finding out he/she has been cheated on is â\u0080\u009cYou've been so unavailable\nNow sadly I know whyâ\u0080\u009d.  \nThe second key idea would be the lover being hurt all of the time. The speaker wrote â\u0080\u009cFor months on end I've had my doubts Denying every tear I wish this would be over now But I know that I still need you hereâ\u0080\u009d, indicating that he/she is hurt and feeling sad and hopes that from being cheated on and being left alone all of the time will end soon. This could also possibly mean that the speaker was often hurt like when he wrote â\u0080\u009cDenying every tearâ\u0080\u009d, meaning that the â\u0080\u009ctearâ\u0080\u009d is a symbol of being hurt from the past events that he/she would deny.\nThe Third key idea from this song would be where the lover being cheated on, tries to have revenge. The speaker wrote â\u0080\u009cI have loved you for many years Maybe I am just not enough You've made me realize my deepest fear By lying and tearing us up You say I'm crazy 'Cause you don't think I know what you've doneâ\u0080\u009d, telling us that he/she have had enough of the relationship, so he/she tries to find ways to have revenge on him/her by changing their aspects of life even though the lover knows that he/she is crazy to be with the love of his/her life.   \nThe speakerâ\u0080\u0099s ending seems that this couple could possibly end up being back to the way it was from a little hope, or could possibly mean to just end things for once before the after life. The speaker clearly states his feelings and hopes towards the end of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nSpeaking from experience I can tell you that this song is simply about betrayal and how painful it is to live with the knowledge that your significant other yearns for another.  No secret is ever such and when the truth is revealed it is so agonizingly painful.  Being betrayed by the love of your life is so hard to recover from, especially if their charade continues and they have no intention of letting up. Being in love with someone whoâ\u0080\u0099s betrayed you and continues to do so regardless of your feeling slowly destroys your mind and soul.  You begin to blame yourself and wonder how you had failed.  A betrayer will try to tell you that you are crazy and that itâ\u0080\u0099s all in your head â\u0080\u0093 that YOU are imagining things.  They will tell you what you want to hear to appease you, all the while they are only biding their time until they can talk or be with their lover. With their secret exposed, they will turn it all around on you and blame you for their transgressions.  They will blatantly lie right to your face to appease their own selfish needs. You soon become numb and try to push the thoughts and memories into the dark recesses of your mind. It is easily one of the worst feeling when you are held hostage by your heart for you will soon become a hopeful fool with the hopes that someday, perhaps tomorrow, that it will all be over â\u0080\u0093 that they will come to their senses and that their heart will truly be yoursâ\u0080¦ but that tomorrow may never come. In a nutshell, thatâ\u0080\u0099s what this song is all about.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI loved Sam Smith...and i heard this song.......hte is the new live off my life\t\t\t\t\n\t\t\t\t\n\n"}