{"comment_0": "\nI'm 16 years old, and I don't consider that young or old... or important information for anyone to know regarding my opinion on this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe idea that this is about some chick he's in love with is just the surface meaning. What this is really all about is drugs, and specifically, injected drugs such as heroin. \n\n\"I've got you under my skin\". Does it have to be spelled out?\n\n\"I would sacrifice anything\" - we know that addicts will stop at nothing to get their fix.\n\n\"wake up to reality\" - under the influence of the drug, he is detached from reality.\n\n\"So deep in my heart that you're really a part of me\" - the addict is so far gone that he identifies with the substance.\n\nJust all so obvious, really.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nMost of the meanings I see are about Frank Sinatra.  The song was not written by Frank Sinatra, it was written by Cole Porter (and, yes, he had his own demons to deal with).  However, the song has been sung by many both male and female singers.  I think a very important word is \"affair\".  I think this is a torch song sung by someone in an intense affair with a partner who is committed elsewhere (to a family, a career) hence \"little fool (singing to him/her self) you never can win\".  Wake up to the reality that you are never going to get the relationship your heart aches for.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nMy favorite Frank Sinatra song :) So good\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nOne of my favs too. Very good.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nElla Fitzgerald sings it best.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis one needs little interpretation.  But it is still an excellent song.\r\nBy the way, it's \"sacrifice\".\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nwell, frank sinatra was a huge alcoholic, wasn't he?\r\ni'm wondering if this has to do with his addiction to alcohol...lol. i mean, it works.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think it's about that someone who you get so used to. You can't imagine living your life without them anymore, you're so used to loving them that you feel them \"under your skin\" - you simply can't be alone because they're so deep in your heart. \r\nYou simply got love under your skin, and you carry it with you wherever you go.  \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI think it's about that someone who you get so used to. You can't imagine living your life without them anymore, you're so used to loving them that you feel them \"under your skin\" - you simply can't be alone because they're so deep in your heart. \r\nYou simply got love under your skin, and you carry it with you wherever you go.  \t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI think it's about that someone who you get so used to. You can't imagine living your life without them anymore, you're so used to loving them that you feel them \"under your skin\" - you simply can't be alone because they're so deep in your heart. \r\nYou simply got love under your skin, and you carry it with you wherever you go.  \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis is very obviously a song about parasites. I mean, if you really listen to the lyrics, it makes perfect sense. chiggers=under my skin, heart worms=deep in the heart of me. Then he does on to say how \"you are a part of me\" clearly describing a parasite that someone is born with. Later, the song states that \"I try so not to give in. I said to myself this affair, it never will go so well.\" That's talking about deliberately consuming tapeworms. He's trying to fight it because he knows that it's wrong, but he can't resist because he wants to lose weight (hey, I didn't say it, he did). \"Don't you know you fool, you never can win. Use your mentality, wake up to reality.\" \n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tHhismeon February 12, 2011   Link ", "comment_12": "\nGreat tune. Check out Cole Porter's life to get the meaning of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni'm 14 yrs old and i love this song. one of his best\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis song is an illusion to his illuminati connections and he is basically giving up because he realizes there is no way he can win. They are \"under his skin\" in the sense that they controlled his life and he is just a suit or puppet. He realizes that he shouldn't be doing it, but by this time he has lost himself.\t\t\t\t\n\t\t\t\t\n\n"}