{"comment_0": "\n1968 comeback special - If I Can Dream, brings tears to my eyes. He put so much meaning into it, it's truly truly beautiful. \n\r\nThis song leaves me speechless, and watching him perform it in concerts reassures to me why I'm an Elvis fan. Thank you Elvis, for everything you've given to us through your music. You will never be forgotten, and we will remember you for eternity through your music and songs like these. thank you\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAn amazing inspiring song that Elvis sang with more emotiona than almost any other song.  \n\r\nElvis cared deeply about people and treating each other with dignity and equality, he had a few songs like this where he sings about social issues like \"In the ghetto\"  But \"If I can dream\" is about the dream of everyone getting along, no fighting about stupid issies, etc.  And might be a tribute to Martin Luther King Jr. now that I think about it and his hope that peace was possible between people.  It's a song of hope, \"But as long as a man Has the strength to dreamHe can redeem his soul and fly\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis is my favourite Elvis song and I agree with ephilbrook that Elvis sang this song with more emotion than any other song. I saw him singing it live on TV and I almost cried. Amazing stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis is an inspiring and powerful song, vastly underrated...my favorite elvis song, bar none\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nJust beautiful... All about searching and hoping for truth and beauty adn goodness and holding on in the darkest of times. Elvis sings it so beautifully. He puts his everytihng into it.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nthis is one of my favourites. Ever.\r\n' got to be birds, flying higher...'\r\nthe way Elvis raises his voice in this line is beautiful. its an inspiration. If we could all dream.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI do a bit of singing and sing this whenever I can I love this song so much, this was one of Elvis' favourite songs and definately mine! The emotion on Elvis' face when he sings \"Deep in my heart there's a trembling question,\" just shows you how much he loved and felt for the words in this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI get lost in this song every time. I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nGreat song. Powerful message and so much emotion. My favorite Elvis song. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\n\"ephilbrook\" and others - you are right. Following the assassination of Martin Luther King and others Elvis wanted to make his own political speech. His \"minders\" advised him against that so he took the next best step and recorded this song.\r\nThe raw emotion in this song is really powerful, sung from the heart and it shows.\r\nAt the 2010 Parkes Elvis Festival a finalist in the Elvis impersonation contest chose this song to sing - unfortunately for him he couldn't get near the vocal and emotional intensity of Elvis.\n\n\n"}