{"comment_0": "\nFirst of all, I'd like to say that I don't truly think anyone's really given this particular song a justified response, as to what the song is actually supposed to mean.  Sure, some people give very surface-level statements about what it means, but nothing deep -- and it's a deep song, as Lennon said.  Most of the comments involve the poster's life, and how the song has affected them, rather than what the song actually means.  Hence, I'd like to actually put some attention in the song, where it belongs.\n\r\nIn its entirety, the song is basically written to someone beloved to the songwriter.  The speaker is expressing their love for someone special.  This is indicated by the line \"In my life I love you more.\"  Although, rather than simply saying, \"I love you,\" the writer decides to compare their newfound love to everything they've known to love and cherish their entire life.  This is indicated by the lines, \"And these memories lose their meaning/  /When I think of love as something new.\"  Hence, the writer is saying, \"Compared to even the most cherished of all of my life's memories, I love you more.\"  \n\r\nHence, the song isn't necessarily about reminiscing or nostalgia.  Instead, it's more about expressing one's love for someone, by comparing them to the past.  \"You're greater than my most cherished and fond memories.\"  Although, in doing so, the writer must express how great and cherished these memories actually are.  Hence, there is a sense of nostalgia and reminiscing, in order to express the depth of this love and appreciation for the past.  And so, by showing how deeply in love he/she is with their past, the writer is truly saying miles, by comparing their love to these feelings.  They are, in essence, saying that they respect and appreciate their past indefinitely, but that even those memories cannot surpass the love he/she now feels for this new special person.  And so, they express the immensity and seriousness of their love for that person.  \n\r\nAlthough, the average person will only really relate to the nostalgia and reminiscing, so that the song isn't really cherished as a love song.  Instead, oddly, it's cherished as a looking-back song.  A song of memory.  A song of reflecting on the past.  And it's odd how the chord structure of the music, and every selected note, seems to get across a sad, somber feeling, rather than some excitement and seriousness of an expression of love.  Instead of a love song, it comes across more as a melancholy perspective of the past; a deep, sad look at all of the memories of one's life.  \n\r\nAnd personally, I think the beat is too Beatlesque.  In other words, it's too poppy.  Too upbeat.  Too rock and roll.  John Lennon's later music was very serious and deep -- expressing worlds of emotion, as he had matured as an independent songwriter/musician.  I think it's sad that John Lennon didn't re-record this particular song in his later years.  It was truly one of his all-time best songs, along with Imagine.  And also, I feel the same way about Help.  I think Help should have been re-recorded, along with Strawberry Fields Forever.  While Strawberry is simply odd-sounding, and could've been orchestrated better, Help suffers from the same problems as In My Life: the beat is too poppy, too upbeat, too Beatlesque.  The odd thing is, these aren't Beatle songs; their Lennon songs.  One can sense Lennon's particular style all over these songs.  The very lyrics are philosophically deep and moving -- full of meaning and emotion, whereas most Beatle songs are simply catchy, without the extra sense of meaning, for which Lennon was no doubt talented.  \n\r\nI think McCartney's Yesterday was a good example of how these Lennon songs should've been recorded.  Solo piano, or solo guitar, without the rest of the band, and without the drums.  Lennon's songs were simply too bare and special to involve the rest of the Beatles.  He should have recorded In My Life, Help, and Strawberry Fields Forever in a very personal, solo manner.  I think the songs are now left in a form which isn't truly genuine to Lennon.  I feel they are songs suck in the past, in a form Lennon could have done away with.  I feel Lennon's true mature song writing style would've naturally brought out the true depth and scope of these earlier songs.  And now they're simply stuck in a two-dimensional Beatlesque box of pop garbage.  But I still think they are decent, even if they aren't exactly entirely Lennonesque.   Lennon's spirit still lies within the music -- one just has to overlook all of that Beatly nonsense to hear it!  \n\r\nCheers.  \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song is the ultimate lookin back, reflecting, mistakes and triumphs, loves and losses, missing your old friends, loving the new ones song! It was played on the Wonder Years a few times, along with many other Beatles songs. The best part about this song, is it all come back to one person \"but of all these friends and lovers....there is no one compares with you\", it all centers around true love, that one person that means more than all the others...in your life.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nmost people think, as i once did, that these lyrics are simply a \"nostalgia trip\" but if you get beyond the first verse, it is fairly plain to see that John's mentioning of old friends and nostalgic moments serves merely as a means to express his love through comparison; \"But of all these friends and lovers / There is no one compares with you / And these memories lose their meaning /When I think of love as something new.\"  In the next \"stanza,\" if you will, or the second bridge to be precise,  he goes on to say that even though he loves those memories so much that he'll \"never lose affection\" for them, he will actually \"love you more,\" whoever \"you\" happens to be.  What it basically comes down to is that this is a love song that compares one's romantic love for another with his nostalgic love for his memories... and as we all know, the latter is a very powerful emotion, hence the magnitude of the implication that the subject in the lyrics loves his woman more than his nostalgic memories.  \n\r\nhad this been a different day, i might have considered arguing against the idea that these lyrics have \"hidden\" drug meanings.... but such an idea is so ridiculous that it really doesn't merit more than the brief mentioning it just received.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis is the only song that i have ever heard and cried.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI hate to think about this and when I mentioned it to my mom she almost cried but I am requesting that my family members, when I die, play three songs at my funeral or whatever I have: Free as a Bird, Real Love, and this In my Life. Johns voice in those three songs move me to tears and when I was Watching the Anthology and this song came on and it is so beautiful. I love John Lennon and the other Beatles. \r\n~ ((OLO)) lives ~\n\n\n", "comment_5": "\nI'm only 18 and saying a beatles song which was released about 20years before i was born, is my favourite all time song may not be a common thing of someone my age, but it is true.  this has been my favourite song for the last two years and i think it always will be.  I recently split from my girlfriend, who i believed was my true love, it really hurt and this song reflects the way i feel about her, and life, and often makes me cry listening to it.  i don't think ive known a song with so much meaning.  It's also one of those rare songs that you can actually describe as being 'beautiful'.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI have always loved this song since I heard it as a kid in the sixties. It took on a whole new meaning when I heard it coming from the hospital the night my daughter was born.I \"cried like a baby\" driving home. My daughters' birth changed my life, I went from thinking about only myself to being a father with responsibilities. The song summed it all up, all the lovers and relatives and friends pale in comparison with loving a child. \"Damn\" I'm crying now......\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nA wonderful song. I think everyone can listen to this song and remember all the good things in their past.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThe \"harpsichord\" solo is actually a piano (played by producer George Martin) recorded at half speed. A great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nAmazing..quite a change for John\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\n...in the style of music, that is\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthis is such an amazing song... it always gives me goosebumps\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nwhere i go to (went to, i'm now too old) camp in the summer, it was a tradition for nevermores (people, like me, who can't return) to sing this song a capella, in harmony, at the end of the session.  i cry whenever i hear this song now.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song reminds me of when my dad died. i remember listening to it that day and it just fit so well. \t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthis song is the light that shines on me\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nEverytime I hear this song I just sit back and think about my life. This song just gets to me, its awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\njohn wrote this when he was 15. i love it\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis song reminds me of the first and only guy i've ever fallen in love with.  He was and still is my best friend, and there was never a person who could've fascinated me more than he did.  Although he doesn't feel the same feelings toward me, i will never stop loving him.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nmy future wedding song\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nits probably one of the 5 best beatles songs ever. Its just about reminising about all ur memories. its so great. no matter who ua re or what ur memories are, this song'll make u smile and think. and my future wedding song 2!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song means, too much. I had never heard it before until now, and now i realize why my boyfriend told me to listen to it..it's amazing, and it's true, the only song that has ever made me cry. I love you, and you know who you are.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThis is one of my favorite Beatles songs. The concept, the music, the lyrics...they all come together so perfectly. The harpsichord section is so original.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nOh...I was wrong. lol. It sounds a lot like a harpsichord though. Oh well...still a great tune!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ni hate to bring on a more crude view on this song, but i think it's about drugs. I mean... we all love the beatles, but they did have some pretty bad dug problems.\r\n\"there are placesi remember all my life, though some have changed\" - maybe he was on a \"bad trip\" \r\n\"in my life, i love you more\" - sadly he loves drugs?\r\n\"thought i know ill never lose affection, for people and htings taht went before, i know ill often stop and think about them\" - friends and lovers are important, but the drugs are just utterly beautiful\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nYeah, I know a lot of people who take this song to be a veilÃ\u0083Â©d drug reference, and, heck, there are a lot of Beatles songs out there about drugs, so it may well be. Personally, however, I don't think this figures in it, I just think it's a nostalgia trip. All these memories remain from what you've done in your life, coming back to this place at this time... and so on, and so on. I'll add some more later with the help of a reference book.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThough The Beatles are most definitely not above veiled drug references in their music, I agree with Bobo. And like many of the entries before, this is my favorite Beatles song as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nYeah, I definitely like this track. Obviously, not every single Beatles track is not going to be about drug references.\n\r\nThis lyric, in fact, bears a resemblance to Charles Lamb's poem \"The Old Familiar Faces\" which John could have come across in the popular poetry anthology \"Palgraves Treasury\". The poem goes like so:\n\r\nI have had playmates, I have had companions,   \r\nIn my days of childhood, in my joyful school-daysâ\u0080\u0093   \r\nAll, all are gone, the old familiar faces.   \n\r\nI have been laughing, I have been carousing,   \r\nDrinking late, sitting late, with my bosom croniesâ\u0080\u0093\r\nAll, all are gone, the old familiar faces.   \n\r\nI loved a Love once, fairest among women:   \r\nClosed are her doors on me, I must not see herâ\u0080\u0093   \r\nAll, all are gone, the old familiar faces.   \n\r\nI have a friend, a kinder friend has no man:\r\nLike an ingrate, I left my friend abruptly;   \r\nLeft him, to muse on the old familiar faces.   \n\r\nGhost-like I paced round the haunts of my childhood,   \r\nEarth seem'd a desert I was bound to traverse,   \r\nSeeking to find the old familiar faces.\n\r\nFriend of my bosom, thou more than a brother,   \r\nWhy wert not thou born in my father's dwelling?   \r\nSo might we talk of the old familiar facesâ\u0080\u0093   \n\r\nHow some they have died, and some they have left me,   \r\nAnd some are taken from me; all are departed \r\nAll, all are gone, the old familiar faces.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nOH MY...this song is just a beautiful reminder of what's really going to matter someday...of meeting that one person, and you KNOW they're the one because the past just blurs together and it's only importance is the fact that it lead up to this point...to this person!!! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nTotally. As for now, methinks all I can see is my blurry typing hand. That might be enibriation, but I'd bet against it.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nSong is one of their bests. Everytime I listen to it I reflect what is going on or has gone on in my life. Wonderfully sung. Beatles are the greatest.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis was my grad song! It makes me cry everytime I hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ni dont know what this is about, but all i can picture during this is a group of teenagers, who were at a party. they were drinking and then they left. the driver was drunk, and they crashed, and everyone died except the driver, and later he realized what a mistake he had made. thats all i can see when i hear this\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThis is one of my all time favorites.  It was the last song in a play my friends wrote in HS and will always remind of good ole theatre times...\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nthis is a great song...why? Because it's so down to earth really....people coming and going in your life, all the memories....and the singing ability that john possesed is just amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nwhy are the beatles accused of using so many drugs. in reality, its not true. Some pcp, pot, MAYBE lsd, but they werent hardcore druggies\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\neven if they did drugs a lot, that doesn't mean they wrote all their songs about them... look at it for what it is\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nLOVE this song.  My favorite of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nPaul Mcartney said this song was about cannabis in an interview.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nJohn said that this was the first song that had any real depth. Before they had done just pop rock songs like buddy holly and the everly brothers that had pretty shallow and straitforward meanings. This was the first to come from the heart. O yeah this song rules!\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThis was my graduation theme.  I actually had never heard it until then.  But the lyrics are definitely my favorite of all time, and they reflect my nostalgia thinking process.  I think almost everyone can take these lyrics and apply it to their own lives very easily, which is beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nProbably their best song out of so many. John Lennon was a great talent.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nAnother perfect song.\n\r\nBut the best part is the piano solo by George Martin, truly the fifth Beatle.\n\r\nIn the boys' absence, Martin took it upon himself to slow down the empty solo sequence to half speed and record a piano track.\n\r\nUpon restoring the tape to normal speed, the piano sounded almost like a harpsichord, matching the nostalgic mood of this piece.\n\r\nThe returning Beatles loved the sound of it, and another chapter of musical history was written.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThis song is all about life.  And best of all, it seems to describe any possible moment.  Whenever you hear it, doesn't it seem to be right for the moment?\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThe best song the beatles have ever made, considering they are such legends\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nGreat Beatles song. reminds me of the good things in life, and memories.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\ni just can't get enough of the solo, it's amazing ...\r\nthis song reminds me of my old friends that are in my homeland and i haven't seen them for years\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI forgot to mention the bizarre drum beats.\r\nRingo is too much maligned.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI think this is one of those great songs that McCartney has taken credit for, but Lennon wrote and sang, in response to Lennon's taking the bulk of the credit for \"Eleanor Rigby\" and \"Fool On The Hill\".  Can't blame him, but I distinctly remember George Martin saying that he remembers Lennon coming to him with the song and watching him complete it.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nThis and Imagine are my favorite songs ever.  This song just sounds so good.  I love it so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nEver since I was a child, growing up hearing my dad play the Beatles in the house, this song has moved me.  I'm still young- just 18- but especially since I've gone off to college, this song rings even more true.  It can give me goosebumps or make me cry.  I really liked reading what other people think of it too, and some of the history behind it.\n\r\nFunny question: Does anyone else remember this song being in the movie \"Lassie,\" the one that came out about 10 years ago?  I loved that movie back then, and I always cried when this song is played and the boy gets upset because it reminded him of his mom.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nanother class A meaningful song by the beatles.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis is quite simply a gift from the Beatles to the world.  Such a beautiful, sweet, simple song.  The opening riff is enough to make me start welling up inside and it just builds from there.  The lyrics combined with the chord progression just make for something very sweet and lump-in-throat inducing.  And listen to Ringo's off-kilter drumming - it's strange but somehow it works.\n\r\nThis is definitely John's song but in some ways it seems like more of a Paul song in the way it looks back and reminisces.  Maybe that's what made them such a great songwriting team - when they were most like the other they were at their best.  (?)\n\r\nAnyway, there is a softness and a sweetness about John's vocal here.  He is really emotionally connecting as he is singing because it's almost like he's caressing some of the words.  You can especially hear this when he says \"there is no one compares with you\" and at the end when he says \"I love you more.\"  I love the last high-pitched \"in my-y-y life\" that leads up to the end, as well as the coda with George's guitar and the way the song ends so satisfyingly and so \"up\" by bringing us right back to the root of the chord.  \n\r\nFlat-out good songwriting.  The Keep It Simple Stupid rule really shows itself here.  The Beatles sometimes took themselves too seriously and got too fussy and too overly artsy.  This is not one of those times, obviously.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\n\"In my life\" together with \"Yesterday\" are, for me, the two most beautiful Beatles songs. And not only the most beautiful Beatles songs but two of the most beautiful songs EVER!!!\r\n\"In my Life\" is the kind of song that changes as you get older. And it grows on you as you grow as a human. As you meet new people and go new places, you get new memories and than when you hear this song the meaning of it changes. When ever I hear the song theese days I think of my exgirlfriend, my parents, my sister, my dog. And I know that in 10-20 years I'll probably still be thinking about my parents and sister, but I will have met lots of new people and than I'll be thinking about them instead or aswell. And THATS a great song to me. One that changes with you, and still hold up more than 40 years after it was written.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI've been listening to the Beatles for the entirety of my adolescence. I'm 18 now, ready to go off to college and all of that, but even at such an early time in my life (not intentional there) I can hear this song and think about how it relates to me, and I know that when I'm ready to get married and even ready to die, I'll be able to play it and have it mean more and more with each listening. That to me, makes this more than just a two and a half minute pop song. This is the stuff legends are made of.\n\r\nA side note, this song was voted on by some British magazine as the most beautiful song of all time. I know what a bunch of people in England think isn't important, but any recognition this song and the Beatles get now as their core fan base is starting to age and die off is needed. The Beatles should be listened to in 300 years the way we listen to Mozart and Beethoven now. They deserve that much.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis song, according to Paul in the book \"Many Years From Now,\" is about their early days in Liverpool, walking around in the evening and strumming their guitars.  \n\r\nWhen it comes to how the song came together, it is one of only three where John and Paul's recollection differs.  \n\r\nThis is seriously my favorite song of all time, universal  and wonderful.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nim 16, im scared because i have an entire life ahead of me, a life that could lead to meeting the one i love and having a family, or a life that could be led in a horribly bad path or drugs and whatnot. \r\n    What scares me more is not how i will live my life, but sometimes i think about how i will end...will i be in a nursing home, with nobody to love me, and for no love to return?\r\n     i look at my girlfriend now, and my best friend, and people that just make me happy, in a few years, were going our seperate ways, we see each other everyday at school and soon ill be lucky to get a phone call...when im in a nursing home, are they going to be down the hall, or are they going to be the ones taking care of me\r\n     john and i were at the same age when we had these thoughts, as he was 15.this song is for the young and old, its just something to think about life, and how pointless it is without love\n\r\nim roughly trying to qupte J.D. Salinger from the Catcher in the Rye (ironically i think lennons assisian began to read this right after he killed john?not sure about that)\r\n...when he visited the museum over many years\r\n\"the entire place stayed the same, but it was you who was different everytime you came back\"\r\nexcelent grad song...\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nthis song is epic, the only song I think -no one- can trash.\r\nit's so meaningful, yet so portable, any beatles fan could sing you this one back.\n\r\nyou have not lived until you have heard this track.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThis was my class song... Boyertown 2005.  Good stuff!\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI've heard that this is the only song in the entire Beatles catalogue that John and Paul have debated about who wrote the majority of it.  Personally, I think it was all or mostly John.  It just sounds more like him, although it is quite a departure from many of his songs at the time.  An incredible song, one of my all time favorites.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nProbably my favorite song of all time. You can just feel it has been written and recorded with so much emotion...it sends shivers down my spine and tears to my eyes.\r\nI want this to be played at my funeral.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nDave Grohl and the boys played this song at Kurt Cobains memorial. Itâ\u0080\u0099s a beautiful song, with a beautiful meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nOne of the best Beatles tunes ever...It is basically about remembering all the good times you have had and all the people that were there. I sang this at my graduation and it makes me cry everytime i hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nThis is my favorite song, and Im 13, so paul_draper, dont feel left out in thinking youre a lot younger than the song and its your favorite.... I am a HUGE beatles fan.... I would have been one of the chicks screaming at the concerts....\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nIt is a very close song. It is about the inevitable passage of time, about the glance backwards with sweet flavor some times, and bitter others. It evokes in us all those memories that we have forgotten and that sometimes they arise unexpectedly when passing by a place, or simply when stopping to us to remember the past. All those people who were close for us in a moment of our lives, and that now is only memories stumped in our memory. As the Buddhists say: â\u0080\u009cIf you have arrived at this world, you must understand its nature. Everything is prepared to disappearâ\u0080\u009d.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nThis song is a very reflective song.  I always think about how life is always changing.  But you'll always have the memories of the people you've met and the places you've been.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nHere goes...\n\r\n\"It was the most boring sort of 'what I did on my holidays' bus-trip song, and it wasn't working at all. John recalled. \"Then I lay back and these lyrics started coming to me about the places I remember.\"\n\r\nAs he labored over the song, it took on a new, more mournful tone. The names of specific places were dropped in favor of a more general approach. The song became one about loss-as John said, a \"remembrance of friends and lovers of the past.\"\n\r\nThe Beatles recorded \"In My Life\" on October 18, 1965, at Abbey Road studio in London. They added the instrumental break four days later. It was released in December 1965 on Rubber Soul, an album that John felt marked the beginning of The Beatles' \"self-conscious\" period and the end of their \"tribal, child-like\" stage. As for the song itself, John tolf Playboy in 1980 that it was his \"first real major piece of work.\"\n\r\nSome twenty-five years later, the British music magazine Mojo polled many of the world's finest song-writers, asking what they considered the greatest songs of all time. \"In My Life\" finished first.\n\r\npJ ;p\n\r\nP.S. The stuff that I wrote was taken from a book called LennonLegend: An Illustrated Life of John Lennon. PAge 5. By James Henke. You should buy that book! I can't explain in words how much the book means to me!\n\r\nJOHN LENNON FOREVER!\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nIn My Life is, without a doubt, my favourite song of all time. \n\r\nMakes me think of good times, happy memories, love, friendship,... makes me think of summer, as it sounds summery to me... the song is The Beatles at their absolute best.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nWell, I'd just like to comment that this is my absolute favorite Beatles song ever! And I think no one can ever listen to this song and not reflect on their past! Its just one of those good ol remembering songs that whenever you hear it, you think of your life as a whole and how its been so far and where its going....I'm not that old, but whenever I hear this song, it makes me think of my childhood and how I thought when I was younger that it would last forever and now its gone....*tear* ok sad moment over.....\n\r\nAlso, I heard some where that Billie Joe from Green Day said that at his funeral, this was one of the songs he wanted to be played...I don't remember where I heard it, but I've always remembered it...this just increased my love for the song since I'm a hard core Green Day fan....\n\n\n\n\n\n\n\n\n\n\n\n\n", "comment_68": "\nAlso, I'd like to add as an after thought that Ozzie Osbornes version of this song SUCKED!\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\namazing song...when i was younger, i heard a slower version of this song and fell in love with it...does anyone know anything about this, because i would LOVE to find it!\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nThis is by far my favorite Beatles song, it makes me want to cry, and I don't cry..\r\nI'm not sure, but this may be the best song I've ever heard, and is by far the most touching.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nYeah, this was sang at my graduation by the senior choir members. I was so touched, and because it was graduation and I was a complete emotional mess I began to cry. If that wasn't bad enough, it was only 15 minutes into the ceremony to begin with, so I looked like a complete idiot.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\n^^ lol. That's okay. It's actually reasonable. \n\r\nI SO hope that my classmates will be too cool and will think of this song as our graduation song, but it's almost impossible.\n\r\nWOW! My bestfriend loves Green Day, I'd better tell him this! Thanks, NataliesADDICTION! And I heard Billy Joe singing Across The Universe with Norah Jones and many others, too. :)\n\r\npJ ;P\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nThis is definitely my most favorite Beatles song. One of the best songs ever written. A wonderful and truly meaningful song that is so captivating. A superb Lennon song.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nBeautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI want this played at my wedding.\n\r\nThis is the best love song in the entire world.  It is one of the few sincere and real love songs in the world.  It's sappy and wonderful but it still manages to be realistic.\n\r\nIf anyone ever sang this to me, I would marry them on the spot.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nMe an my mates sang this at karaoke after high school graduation.. but listening to it, I have mixed feelings, since it seems conflicting to say you have great memories but love a person better. But if you present this song to somone.. that truly illustrates how much you love them!\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\ngreat song i also love the ozzy version....\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThis is one of my all time favorite songs.  It's simple and beautiful and a true work of art.  RIP John.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nTo me, this song means in life there are things we go through. Good or bad, they make us who we are today. John sings about a true love, and being content with everything that has happened in life. It has led to being with a true love. Don't regret your past. It makes us who we are today. \n\r\nI have been a Beatles fan for many years now. I just now thought into the meaning of this song. It's amazing how much I can relate to this song now that I, myself have found the love of my life.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nthis song means one thing only: he's not in love with me\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nJust told a girl to listen to this to get how I felt about her and life at the time being. I hope she takes it well..\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nWhile Paul McCartney may have said that this song was about cannabis, this is most certainly not a drug song.  True, John wrote this shortly after having been introduced to the drug by B.D, but it is my feeling (as it is the feelings of many others who knew him) that John wrote this song mostly for Stuart.  Paul's a great guy and the most talented songsmith alive but he's also got a bit of an ego on him (and never got too well along with Stu).  Take this from someone who knows.  As for John's song \"In my life\"...it's his best.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nthis is the first song i can ever remember hearing in my childhood. it will always have a special meaning to me, and a special place in my heart :)\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\ni have this friend mark and weve been best friends since 1st grade and we are now just finishing up 8th and i never thought of him as more then a friend until i heard him sing this song and now i just absolutely love him!\n\r\n         Forever and always ill love you markykins,\r\n                           Mandy\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nthis song has alot of meaning to me... I sing this song to my son because it describes how I feel so perfectaly...there is no one that compares to him And these memories lose their meaning\r\nWhen I think of love as something new....I'm actually getting \"In my life I love you more\" tattoed on my foot soon...beautyful song, it will always have meaning to me\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nIn fall 1969, I had the words to \"In My Life\" posted on a little piece of paper on my dorm room wall.  My dad, age 62, quiet, precise, proper, military, scholarly and mystical came up to visit.  He silently surveyed the room, paused, and read the lyrics.  Then he looked at me and asked respectfully, \"Did you write this?\"  I was 18 and clueless.  No longer.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nJohn wrote this song about his then-wife Cynthia.  He said as much in the Playboy interview with him shortly before his death.  Despite his overall poor treatment of her, he must have felt something special to make this great of a song in her honor. \n\r\nWe played this as our first dance at my wedding.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\n\"There are places I remember\r\nAll my life, though some have changed,\r\nSome forever, not for better,\r\nSome have gone and some remain.\"\n\r\nthose lines really get me. i heard this song for the first time on the radio yesterday and i got the chills.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nJohn said \"in my life was , i think, my first real, major piece of work. Up until then it had all been glib and throwaway. It started out as a bus journey from my house on menlove avenue to town. I had a complete set of lyrics, naming every sight. It became...a remembrance of friends and lovers of the past.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nSimply a beautiful song.  Requires no explanation.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nThis song has strong value to me in terms of holding onto blessed memories.  I requested it to the DJ at my cousin's wedding reception and as soon as it came on many people were reaching for tissues.  Just beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nThis is EXACTLY what happens when you fall in love. I met my future wife (God-willing) my senior year of high school. I was really into the whole (this is the end, lets make it count) thing pretty much that whole year. All I thought about was the past, all the great times I had (and with regret, the times I didn't have), and how to make the best of the rest of it so I could look back on it. Well, once I realized my true feelings, anything that didn't have to do with her I pretty much told (in my mind) to go F*ck itself. Stuff that I really enjoyed, lots of great memories of things before her, memories I thought I 'd take with me for the rest of my life suddenly meant nothing, and my only thoughts of the past, triumphs and regrets, revolved around her. That hasn't changed...\n\r\nJohn Lennon is the man.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nThis song to me means so much , this song was played at dad's furnrel.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nit's so beautiful...\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nI don't understand the drugs theory at all.  It's just the most perfect, most beautiful love song.  Everything that went before pales into insignificance now that he has met someone he loves so completely.  Makes me a blubbering mess after not hearing it in a while.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThe first time I heard this song I was talking to my boyfriend about what our wedding song would be. He told me he already picked it and had me listen to the song right then. He told me that this was how he felt about me. I cried.\n\r\nIt's a beautiful song!\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nOH MY GOD if you think this song is about drugs then you are STUPID.  GOD any love song can be about drugs. so the beatle got into the drug problem. DOESNT MEAN EVERY FUCKIN SONG THEY SANG IS ABOUT DRUGS.\n\r\n      PEOPLE ARE SO IGNORANT\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nIf there's ever a Beatles song to take at face value, this is it.\n\r\nIn my opinion, this is the most beautiful song ever written and performed. Except by Ozzy, of course. Everything from start to finish is perfectly executed...it's a true classic.\n\r\nIf there ever was a song I would want dedicated to me, whether it be at my wedding or my funeral, or both, this would be it.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nYes this song reflects back at life with the maturity and wisdom of someone at the end of their life. The fact that Lennon was only 23/24 when he wrote it makes it all the more remarkable. This song signals a new maturity it pop music writing, where artist began to express deep thoughtfull feelings, rather than just cliched teenage expressions. As an artist John was leading this new maturity in pop. The singer songwriters of the late sixties early seventies such as Neil Young and James Taylor have Lennon and this song to thank for alowing a more grown up artistic outlook to become acceptable in pop.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nYes, I simply love this song. The piano you hear is actually sped up. George Martin was good, but it was easier to record himself playing and then speed it up to sound like that than play it like that without speeding it up. That would've been tricky, as I've tried it. Also, speeding it up makes it sound, in my opinion, like an electric piano.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nJust wanted the song to have 100 posts.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nPerfect song. Won't hear anything like this on the radio anymore. Too bad I'm only 24... never got to see them live. I'm sure it would've been life changing.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\ni've always thought that it was about either Stuart Sutcliffe or his mum Julia or both\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\ni love this song.\r\nits a tear-jerker...especially the video to it on youtube... yeah\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nWhile in England 2 years ago, I visited Liverpool and took a \"Magical Mystery Tour\" of the city.  We were driven by the house where John lived with his aunt after his mother abandoned him  We were told the song was dedicated to his aunt.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nI'm a HUGE HUGE HUGE Beatles fan and this is the song that I want to be playing at my funeral. When I'm dead and everyone is sad, I want everyone to know that I loved them all. God such a beautiful record.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI know this song does deal with past memories but I don't think it's not about remembering them so much as it is recognizing that life right now is in concord with them. \"In my life\" literally. He loves living more then being in the past because even though love comes and goes and it's all the same, it always feels new in the moment. Am I confused about this?\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nLike this song. To me, it's obviously about reflection.... all the people I've know, old friends, lovers, old memories, but I like the twist of 'moving onwards with life', i.e; \"Of all these friends and lovers / there is no one compares to you...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nThis is one of my favorite songs. I grew up listening to it and i can absolutely relate to it. I dont exac tly love my home town but it is home and i guess all my memories and the people i love live here, so even if i travel a million miles away i can never leave it behind.\r\n`There are places I remember\r\nAll my life, though some have changed` \r\nlove this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nFabulous classic work from one of America's or Britain's greatest band's of all time at that. Love how he's looking back on his life of everyone he's shared time with, and how it's all valuable to him, but not as valuable as the time he spends with this special person. Wonderfully written song\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nthe first time i heard this song, i felt like the lyrics were the very definition of love. while there's many friends, lovers, and memories you'll always treasure, this one person outweighs them all.. that's seems so powerful to me, that you'd exchange everything for this one person :)\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nso ... this song just came up on my pandora..and i am near tears because it is purely awesome. a true timeless classic. \t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\noh man this song\n\r\n i swear i could listen to every day till i die and love it more than the day before\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nthis song is so beautiful. :]\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nOne of the Beatles best, John Lennon was an amazing songwriter.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\ni think this is about the places in liverpool he misses and when he says \"some are dead and some are living\" he's refering to his friend who was in the beatles in their early years i think his name was stuart sutcliffe who stayed in germany after their tour and died when they later came back\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nJust might be my favorite song of all time.  If I ever get married or when I die I would love this song to be played for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nmy girlfriend tried to explain to me the relationship she maintains with an ex. i wasn't getting it. this song served as the perfect analogy. \t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nThis is my favorite Beatles song :) \t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nBeautiful !\nUnlike many other songs where the listener's perspective could be different from the writer's this one is pretty straight forward. the meaning is what is sung.\n\ni couldn't agree more with Lennon, sunee...\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nDefinitely on the list of best songs ever for me.\nAnyway, this is a song sung in reflection about all that has happened and changed. It makes me cry sometimes. Such a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nI have to agree with Ursamajor59 , perfectly sums up the profound love of a father.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nI must admit, when I was younger, I thought this song was ok; liked the lyrics, but the melody just didn't seem to do it justice; too pop. But as I have gotten older, I am finding this song to be such a deep and moving song. There is a sort of eeriness and yet sadness in the song. I think I started to notice my feelings change toward this song when 1) I heard it used in a commercial on TV about a father holding his newborn child, and 2) especially in the movie, \"FOR THE BOYS\" with Bette Midler, where she sang this song as a slow ballad with only an electric piano as her musical accompaniment. Now, it has become one of my 10 best Beatle songs. Just a truly great song. Just wished it hadn't taken me so long to find that out.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nThis song is simply about the unavoidable and bittersweet nature of life itself.  It's about how, as human beings, we are endowed with a memory that inevitably collects moments and events from our past and prescribes thoughts and emotions to them. But life is for the living. And though we all have cherished memories, our nature compels us to move on and always be open to new love. And so the song sings of the meloncholy nature of life. While it celebrates new llove, it also sings about the unavoidable sadness of having to separate from the past. It's like crawling out of old skin. \t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nto say that this is songs about drugs is a disgrace..it's an insult to the song and The Beatles..and of course the fans..so..those of you guys that think that this songs is about drugs, you might as well, stick that idea up your ass...and go fuck your mama!!\t\t\t\t\n\t\t\t\t\n\n"}