{"comment_0": "\nAs someone who has suffered from anxiety and depression for her entire adult life, listening to â\u0080\u009cIn My Bloodâ\u0080\u009d is truly inspiring. What a beautiful and chilling peek into the life of someone suffering with one of these disorders. While they obviously do not manifest universally in the same ways, it is always eye-opening to hear the way someone else experiences them. With all of the stigma surrounding mental health, it is refreshing to hear a star talk about his own experiences and gift us such a vivid portrait of his emotions.\n\nYou can even hear how he experiences these emotions through the tone of the song. Beginning on a somber note, we hear Shawn Mendes open with a quiet plea for help. This is followed by the confession that he sometimes feels like giving up, an unfortunately frequent experience for those who suffer from depression. Suddenly, the meek voice that weâ\u0080\u0099ve been hearing is disrupted by an impassioned battle cry. â\u0080\u009cIt isnâ\u0080\u0099t in my blood!â\u0080\u009d He cries out loudly (probably for his own benefit just as much as ours). I hope that everyone, even those not suffering from these disorders, finds some solace in this passion -- something deep down inside that helps them to keep going. I know that he inspired that in me.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nShawn Mendes has commented that this song is about his struggle with anxiety, since becoming famous.\n\nIn my opinion, I interpret the song as him expressing his experience in words when he's anxious, but choosing to dig deep from within to fight through it. Instead of masking the issue or temporarily \"fixing\" it by using alcohol or sex, he's choosing to be stronger than that.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI love this song and I totally agree with Kim10 and ReonataO! I mean yâ\u0080\u0099all covered it and all I can add as a Mother of the most awesome 16 year old Son who suffers from Depression, Anxiety, Stress, Anger, and his counselor said he suffers from PTSD from My Motherâ\u0080\u0099s Passing. She helped me so much when I needed her so I paid her to watch him when I started working. Long story short She was like another Mother to him cause he started staying with my Mom during work starting  at 2 months old and we held her till she passed and it was rough! He has now gotten so introverted and a loner that is dealing with exactly what this song says and means! I heard it and instantly fell it. I apologize for this isnâ\u0080\u0099t about my life itâ\u0080\u0099s my opinion guess I just needed to get that out! It wasnâ\u0080\u0099t a good day......Thank you for reading if you made it through my book....;-) Gotta keep on keeping on....\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIn this song \"In My Blood\", it is about dealing with anxiety and other various factors in your life. Whether it be school, health related, drama, relationships, etc. Shawn has found a way to express we can get through the hardships. \n\nI have anxiety factors in my life, and when he says \"Its like the walls are caving in\", it related to everything crumbling. Even though your world may be coming down, it can be rebuilt one way or another. Then the lyrics \"I need somebody now\" go into we all need to help work with each other. We need someone to help out and its important to have people who care about you in your life. \"Im overwhelmed and insecure give me something\" is the most powerful lyric. We shouldn't use drugs or alcohol or other substances to get over the bumps in our lives. Overall, has been my inspiration as a true human being. Love you Shawn!\t\t\t\t\n\t\t\t\t\n\n"}