{"comment_0": "\nthis song is so sad. It's about not being able to get out of poverty; being subjected to crime, hatred, prejudice; and when you finally die(probably after being in the mids of a gang shooting), another baby has born and he/she is to lead the same life you did.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\none of the best songs of elvis\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI agree \r\nsurely one of his greatest\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nStrong lyrics.  I think chamiga hit the nail on the head.  Elvis himself came up poor but I don't think he was a criminal.  But he did know about poverty.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ndear la_femme_morte89,\r\nso you're saying that as soon as a person becomes rich and famous, they're no longer allowed to discuss social and political issues?\r\ni'd say that if anyone should be discussing life in the ghetto, it is someone like elvis who has a large enough platform to influence/educate a lot of people\r\nin the words of bill hicks, \"you fucking moron. you FUCKING moron.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nla_femme_morte89, Elvis was dirt poor growing up.  Did you ever see the shack he lived in for the first 18 years of lhis life?  And now you begrudge him for singing about the visciuos cyle of poverty?  One that he know s and is grateful to have escaped.  He gave millions to charity, how much do you give?  And as Elvis sang, \"Walk a mile in my(his) shoes\" Bee-ahhch.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nAlso, listen to, \"If I can dream\"  maybe if the dead woman (La Femme mort) had that kind of optimism, as others should, we'd all be living in a better world.  Obtuse troglodytes like her should just go live in France, spoonge off thier socialism and fade away.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI agree with the vicious cycle on this song. The thing about this song that really gets me is Elvis' ability to step into someone else's shoes even though he was rich and famous. And, he didn't grow up so well, so maybe he was writing from personal experience. Of course, this song would be funny if you listened to Cartman off of \"Sout Park\" sing it as they walk into Kenny's neighborhood. =]\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nLa Femme mortr89 I think your full of shit!!!             as for the song I love it and I think chamiga got it    and different people get different meanings\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nelvis's best song! so full of emotion and sad, brings a tear to my eye just listening to it, well nearly\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis is easily one of the greatest songs of all time!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nAs the snow flies\r\nOn a cold and gray Chicago mornin'\r\nA poor little baby child is born\r\nIn the ghetto\r\nAnd his mama cries\r\n'cause if there's one thing that she don't need\r\nit's another hungry mouth to feed\r\nIn the ghetto\n\r\nChild born in the ghetto which mom will have a hard time tryin' to take care of.\n\r\nPeople, don't you understand\r\nthe child needs a helping hand\r\nor he'll grow to be an angry young man some day\r\nTake a look at you and me,\r\nare we too blind to see,\r\ndo we simply turn our heads\r\nand look the other way\n\r\nHelp the kid or he'll grow up to be an enemy. Do you just ignore him?\n\r\nWell the world turns\r\nand a hungry little boy with a runny nose\r\nplays in the street as the cold wind blows\r\nIn the ghetto\n\r\nMost of you turn and he's hungry and sick.\n\r\nand his hunger burns\r\nso he starts to roam the streets at night\r\nand he learns how to steal\r\nand he learns how to fight\r\nIn the ghetto\n\r\nthe stage when he grows to be an enemy.\n\r\nThen one night in desperation\r\na young man breaks away\r\nHe buys a gun, steals a car,\r\ntries to run, but he don't get far\r\nAnd his mama cries\n\r\nThe climax; he dies trying to get the heck out of the ghetto.\n\r\nAs a crowd gathers 'round an angry young man\r\nface down in the street with a gun in his hand\r\nIn the ghetto\n\r\nCrowd watches him dead\n\r\nAs her young man dies,\r\non a cold and grey Chicago mornin',\r\nanother little baby child is born\r\nIn the ghetto\r\nAnd his mama cries\n\r\nAs he dies another mom has a baby and the process starts all over again\n\r\nJust my attempted interpertation. To shorten it up. I could be wrong I could be right.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ngreat song and performance\r\nThe original sub-title was `The Vicious Circle'\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis is an amazing song while also being an incredibly sad song, it's amazing what it portrays. These children have no help, they are born into a situation that they can't help and do things that they have to do to survive. We talk of the horrible things that happen yet we turn a blind eye to the things we could have an impact on. These kids need people who care about them and can help them but we don't do it.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ncervante,\r\nare you talking to another personality or what? You know they say it's ok to talk to yourself, but when you start responding you might want to seek help. lol\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nlol. he must have forgot he already posted a comment about it and then come back the following YEAR. hahaha that is hilarious.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nLOL.  Well I can't say much i've done something dumb like that before my self.  Anyways I think this is just basically a song about the vicious circle that we can get caught in be it the life of crime or other distructive behaviors.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\ncervante should be more careful.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nyeah you're right, he really should be more careful.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nhey chamiga i like ur meaning and i totally agree. its such a sad beautful song, and la femme morte 89 obviously hasnt a clue wats going on, because the song is not about 'The Ghetto' entirely, i think when he says the ghetto, it could mean anywhere and its a beautful song with a lot of meaning for its time.\r\nim a big elvis fan!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nHaha :):):) Zek, completely agree with you. But I still love this song though. Oh man, Elvis was one talented son of a bitch. He had the most amazing voice. Kinda feel sorry for him too. This is definitely his best song I've heard. Although, the guy probably didn't make his own music, right? Well, whoever wrote this is a genious. the melody is so beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\none of the best songs of elvis\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni agree\r\nsurely one of his greatest. lolxxxxxxxxx\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nIt's not about having sympathy for irresponsibility, it's about equal rights. Any person's undeniable right to a decent life shouldn't be hindered by any factors, whether they're societal or some other factors.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nokay, I know this song is supposed to be sad, but I just laugh hysterically every time I hear it. I mean, Elvis, singing about the ghetto? Too fucking funny\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nOk, yeah.  It's a sad song.\n\r\nBut if you can't take care of a kid, either stop screwing or wear a damn condom.  I mean, come on.  We're supposed to have sympathy for irresponsiblity?\t\t\t\t\n\t\t\t\t\n\n"}