{"comment_0": "\n\"the lyrics aren't that bad\"\r\nNick Cave is one of the greatest songwriters ever\r\nthe only person whos better that comes to mind is Leonard Cohen\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI agree, this song is about perfection, about platonic love, about how it feels when you love a person in the very purest sense of the verb \"to love\". \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI choose this song as my wedding song as it just seemed so appropriate and how I felt. I feel the song is almost a prayer to say thank you for having this woman in his life and it is almost a plea to say please look after her and to keep her safe in his life so that they may journey in life together. It is this journey that he believes that provides the meaning in his life and is why he is almost pleading to the Lord to keep her safe.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ncorruption? perfection?  Platonic love? what are you all talking about?\r\nThe song speaks for itself, it's a romantic torch song.  It's a beautiful piano line, but let's face it, these aren't exactly Nick's best lyrics, not that they should be - it's a simple little diddie of a song.\n\r\nAnd Karma330, please do us all a favor and don't comment on a song you've never heard...but if you must, have it make sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nOh, and liammacrae1, while I do realyze that a whole lot of what appears to be love songs are actually about drug use; how the FUCK does heroin belive in an interventionist god?!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think this is one of the best love songs ever written.\n\r\nI agree with JASGripen's comments about Into My Arms' first stanza transforming intervention into something bad.\n\r\nkrburg and productofthe80s, please compare the lyrics of West Country Girl, Black Hair and Green Eyes (which are definatly about P.J.) to Into My Arms.  All songs are off the same album (The Boatman's Call) and presumably written around the same time.  The Boatman's Call is Nick cave's \"breakup album\" and I don't think this song is about anyone in particular, but if itwas, I doubt it would be P.J.\n\r\nAlso, I don't understand where the comments about the lyrics being \"a little corrupt\" or about \"a corrupted man being humbled by love\" are coming from.  This is simply a love song no more, no less.  It is not aout either platonic love or perfection, all though the theme of perfection is present from Nick's idolisation and romanticisation of the woman as being angelic.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nHmm... I think you are all maybe seeking something what does not exist. But It is not a mistake, sometimes I do so, but I think there is'not better explanation to this song that Nick has simply written some very, very specific and wonderful prayer. And he says simply, that we can love each other ( you and your beloved one ) despite being different, having different believs, different colou of skin and whatever. A music video of this song proofs this too. And maybe - another aspect that you've mentioned - the platonic love. I see it there too, because Nick Cave speaks here of love in most divine form, mos saint and ( from my own expriencis ) this kind of love in this highest point, as I can say, cleans out all other \"human\" aspect of love... maybe... but as well as this maybe not... it depends of you, how you will explain it... ;-)\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nwow..i think it must just be me but i cant help but think this song is about death. i guess in a way it is a love song.. but to me about a dead person. its almost as if the persona, who had never previously belived in god, is asking him to look after that person who has passed, is pleading to leave that person exactly as they are, and is almost asking that in the chance that the loved one needs to be directed to another place, that it one day be back into the persona's arms. Its interesting that i feel that interpretation from that song, seeing as even though i believe in some kind of higher presence, i wouldnt consider myself religious. I dont know i guess if i died i would want my special someone to think of me in this way.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nTo me I think this song is simply about that \"special someone\" who is perfect as he or she is and not wanting them to ever encounter harm. Hence the lyrics \n\n\"I would kneel down and ask him\nNot to intervene when it came to you\nOh, not to touch a hair on your head\nLeave you as you are\"\n\n\"But if I did I would summon them together\nAsk them to watch over you\nOh, to each burn a candle for you\nTo make bright and clear your path\"\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nA song of absolute surrender. To acknowledge that nothing is more important than the love that has been discovered and that nothing is purer. Not even the deepest of beliefs.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ni like this song because it's not about corruption, rather perfection.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\naaahm..the lyrics are quite incomplete...\r\nit's the most beautiful lovesong 2 me, but i don't know if it necessarily is about platonic love.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nIsn't it about a relationship between two people with different spiritual beliefs? I don't think he's talking platonic love but that's just me. It's an absolutely beautiful song anyways.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nA woman with divine stature, one that can only be reached, related or treated as an equal by other creatures of religious nature. You can't get to her, touch her; you can only hope there really is a god that can preserve her as sublime as she is.\r\nFor someone like that, I would also sacrifice my reason just to be able to be on the same world that she lives in.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nafter the last line that this post it continues with...\n\r\n To make bright and clear your path\r\nAnd to walk, like Christ, in grace and love\r\nAnd guide you into my arms\n\r\nInto my arms, O Lord\r\nInto my arms, O Lord\r\nInto my arms, O Lord\r\nInto my arms\n\r\nAnd I believe in Love\r\nAnd I know that you do too\r\nAnd I believe in some kind of path\r\nThat we can walk down, me and you\r\nSo keep your candlew burning\r\nAnd make her journey bright and pure\r\nThat she will keep returning\r\nAlways and evermore\n\r\nInto my arms, O Lord\r\nInto my arms, O Lord\r\nInto my arms, O Lord\r\nInto my arms\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ncorruption? perfection?  Platonic love? what are you all talking about?\r\nThe song speaks for itself, it's a romantic torch song.  It's a beautiful piano line, but let's face it, these aren't exactly Nick's best lyrics, not that they should be - it's a simple little diddie of a song.\n\r\nAnd Karma330, please do us all a favor and don't comment on a song you've never heard...but if you must, have it make sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nPlease fix the lyrics. This is horrible.\n\r\nBeautiful song and fantastic lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI like the twist \n\r\n \"I don't believe in an interventionist God\r\nBut I know, darling, that you do\r\nBut if I did I would kneel down and ask Him\r\nNot to intervene when it came to you\"\n\r\nMaking intervention into something bad, which it actually can be; both if you look around you for horrible actions, but also if you look at the jewish aspect of God; a God about obeying Law, not about love.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis song is written about PJ Harvey\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nA currupted man humbled by love.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI love this song. But I don't think the woman in the lyrics is actually PERFECT... its told in a first-person narrative, which means it's automatically biased/flawed (we only hear the narrators point of view)... so while he thinks shes perfect, in reality shes probably just like anyone else. That just makes the song all the sweeter though. But yeah... gorgeous, gorgeous song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI love this song. Im an agnostic, dont beleive in god, angels but my partner does, so I can really identify with it. Its about how inspiring love is, the narrator has been inspired to think about god and the existence of angels because of how this person has made him feel.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI think of Nick singing this to PJ and I think its beautiful. Hes basically pouring his heart out, for the one he loves. i like the idea of love in its 'purest form' thats the feeling you get from this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nits pure love... and desire\n\r\nhe doesnt believe in god... but if there is, just in case, dont change her... just lead her to me....\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nJASGripen.\r\nthe interventionist god is because he ASKS him to intervene.\r\nalso, the judao/christian god is an interventionsist god.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\n@forensick: yes I do know that (even if Christians have different opinions in the matter). What I wrote was about the difference in focus: Law/Judao vs Love/Christian. \n\r\nAlso, it is clear that Cave do not asks for intervention in anyway, but fears it as an action (not reaction) of God.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI heard this song for the first time yesterday.  I aree with Dressed2Depress.  One of the best love songs I've heard.  \r\nIt's a 'simple' love song, about knowing that there's that someone, an angel put on this earth just for you (borrowing from Good Will Hunting right there) and wanting them to never be hurt but also yearning to be the one who does the protecting.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nHas no one considered that this song might be another in that overflowing genre of Cave songs - those about heroin use. Not just the 'into my arms' but the burning candle too. Just a thought. Sorry to mess with the minds of all you romantics\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nNot all Nick Cave songs are about PJ Harvey. I think this is just a generic love song, with no real deep meaning. Still nice though.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThe song to me is one of his most simple. But one of his most brilliant! Sometimes its what you leave out of a song or the spaces between the notes that have the most meaning. The song represents the strongest love there is the kind of love where you can put aside your own beliefs for someone else. Where you want nothing about the other person to ever change. And all you ask from God is that the person remains the same and protected. If someone said that about me I'd be over the moon :)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI agree with the simplicity. Almost every atheist or disbeliefer finds themselves at a point when they are in love with a girl or boy who believes and then you have to leave the critisism against believing and take it to be a part of your life in a way. Cave has said that love songs are the purest form of making songs - totally honest and beatiful. And i think this si one of them. The speaker isn't sure whether to trust in the existance of somekind of god but it doesn't matter. And so he whisperes to the sky: \" If you are there - don't interrupt. Please. This girl is mine and i wan't to lead her home and protect her from the world.\" And maybe he adds: \" Oh and thanks for creating beer\" :D   .... or something like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nA beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nFrom what I heard Nick Cave is not an athiest but a christian.  I think he is just stating he has different beliefs. He is not saying \"I don't believe in god\".\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI think he is more speaking to himself than to God. He apparently has a very divine image of this person, which it seems as though he very often does get. He doesn't want that shattered (through seeing her as she could potentially \"really be\"), but he doesn't want her to be nothing more than what he sees either... He doesn't want to believe she's an angel, he wants her to be forever exciting and \"new\". But of course, he wants her to be his, to be able to walk down this exciting path of getting to know each other and themselves better together. And, out of the love he feels, he wants her to be watched over; that this divinity he sees in her has also resulted in her being happy with herself, and seeing his true self. In short, he wants this person to be forever exciting, forever a tangible mystery that he can appreciate, as well as he wants the \"her\" he knows to see his true self, and as a result, love him like he loves her. \n\r\nIn a way, it's a bit of the same as what I think \"black hair\" is about - this angelically perfect image one gets when falling in love, that he in this song wants to develop further, but which he gets trapped in later, in \"black hair\". I don't think it's the same person ,but there's definitely a connection.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nA good southern gospel or bluegrass song is full of romantic love inferences to Jesus. I think that he is using the beauty of the gospel music genre and allowing it to tell the story of a romantic love he has for a woman.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\ni dont think this song is about rape, the video shows people that r upset...... this song to me is about, hoping a love u want or have lost will eventually be urs.... but in the first chorus he doent want a god to help in the situation that they r in, but he does cause he says direct her to me.... its about a love u cant have but maybe someday u can the last verse confirms that for me......\n\r\nAnd I believe in Love\r\nAnd I know that you do too\r\nAnd I believe in some kind of path\r\nThat we can walk down, me and you\r\nSo keep your candle burning\r\nAnd make her journey bright and pure\r\nThat she will keep returning\r\nAlways and evermore\n\r\nand i hope if there is a god and angels they will.......\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI first heard this song on the soundtrack to \"Gettin' Square\" one of my favourite Aussie films. Check it out.\n\r\nThe scene itself is a love scene, of course and the song will stir your emotions around love. \n\r\nI adore this track for many reasons.\n\n\n\n", "comment_37": "\nI don't know why nobody has said this, and maybe I am really wrong, but I always thought he was singing this song to a girl he loved who was a Christian and most certainly a believer, and he himself didn't care for religion and couldn't connect to the personal God of Christianity, but the girl he loves makes him want to.\n\r\nJust me?\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nTHE BEST LOVE SONG EVER WRITTEN (ONE OF THE)\n\n\n", "comment_39": "\nI was seeing someone for a few months, and we met by chance somewhere. We were both taken by surprise how much we needed each other. He lived far away, but would visit, and we would laugh for hours, and feel at peace together. On my birthday he sent me this song as a sort of gift. Two weeks later he sent me a good-bye letter with little explanation. I have been reading everyone'e interpretations here.. \r\nIt's been a month, and I am still confused.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI heard the Coral song Jacqueline where the same melody is used, before hearing the Nick Cave original melody and lyrics. Whilst the Coral imitate the same melancholic atmosphere, this song wins hands down - everytime.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nan amazing love song about PJ harvey...  i can imagine nick (the scary looking bugger) serenading her, with some kind of dark mystical love being forged between them\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI often prefer songs with simple but true lyrics than others with more complicated ones with which just want to grab your attention... This song is one of them and I think it is one of the most beautiful and sweetest lovesongs ever written... Including one of the best lyric lines ever \"And I don't believe in the existence of angels but looking at you I wonder if that's true\"... Man, the woman for whom he wrote this pure masterpiece must be sooooo lucky.....:P :)\n\n\n", "comment_43": "\nÃ\u0083â\u0080° acerca de uma miÃ\u0083Âºda que eu conheci e pela qual, sem querer, me apaixonei!\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI can't see anything obscure here, and nothing needs to be explained, all is crystal clear. I am, I feel, now first time ever in my life truely in love, and I can feel the strength of it, .. though I am not religious in anyway I first time ever also find this direct talk to Lord perfectly fitting, with these words, about woman one truely loves.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\n\"I don't believe in an interventionalist god\" somes up my entire Christian stance.\n\r\nI don't believe God is waiting to step into our lives everytime we need him. I believe he gave the world free will and all the tools we need to survive.\n\r\nHe does believe in god just not one thats ready to step in and solve all your problems or answer your prayers. Just incase he is wrong, I believe this is his prayer to god to let their love happen naturally.\n\r\nIf god really does have angels who watch over people, then just keep her safe till she returns to him and he will take over.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nFirstly, I think that songs can mean different things to different people. I don't pretend to know what Nick Cave was thinking but to me this song always makes me feel sad because I was in love with a girl who was a muslim and i am not. Because of this we could not be together, we saw each other secretly but because i would not convert and she didn't want to lose her family, it was always doomed. We both love each other and still do but religion got in the way because neither of us could make that drastic change even though we love each other still. So the interventionalist God thing takes on that meaning for me....\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nDifferent spiritual beliefs of course as mentioned in a former review.  The man is trying to convey that what she believes in (which is fine with him whether it be divine and/or supernatural) is what he feels of her.  She is so perfect in his eyes that he would be bold enough to ask (not to intervene etc...) to the creator(s)/angels she holds faith in.  That is my interpretation as I have been there.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nhow i understand the lyrics, which would be different to others, is that he doesn't believe in God, but this girl is making him doubt his belief, or non-belief. she's an example to him that there is a God, and there are angels. however, they have a common believe and that is love. that's how i understand it.\n\nit was my wedding song but i didn't choose it for its meaning, rather that it is just a beautiful song on its own.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nit is funny but I have always thought of this as a very sad song because it so often seems to be played at funerals \n\nI think the people saying this is about a couple from different religious backgrounds are right as the lyrics make complete sense read this way\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nHe's lost her and wants her back. He's hoping that the interventionist God, that he doesn't believe in, will protect her. But most of all he wants God to send her back into his arms.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nBest song ever \t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThis is truly a stunning love song.. short and simple. Nick may believe in God, but not an interventionist God which is 99 percent true of any god you may believe in.. and the Christian God certainly doesn't intervene most or all of the time. He may NOT believe in God, but prepared to speak with the god of his love if need be... Stunning lyrics, stunning song.. love it...\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nSo I'm havin a wee Friday night drink or two tonight and this song starts playing off my personal playlist that is set to random. Excellent. This is my favourite song of all time. Happy days. \n\r\nBasking in my recently acquired turn of musical good fortune I decided to Google \"into my arms\" lyric meaning and as a result came across this page...\n\r\n.... And that would be the point where my confusion began. \n\r\nSeriously now, and please understand I'm not just trying to be controversial here.... \n\r\nI'm very surprised that the top rated comments have any positive ratings at all given how they are mostly either:\n\r\n1. Devoid of any attempt to actually interpret the song's lyrics meaning and are just general commentary that is, at best, vaguely related to the song\n\r\nOr\n\r\n2. Worryingly bad interpretations of the meaning behind the lyrics of a song which I think most people would I hope agree is pretty simple in what it it trying to say and is probably pretty fucking hard to misinterpret? \n\r\nSorry for the long winded rant there and for maybe being a pretentious dick. I feel a lot better after that. Needed to destress! \n\r\nANYWAY , my interpretation of the song/lyrics/meaning:\n\r\nLike all good art it takes something incredibly complex, in this instance true love, and expresses it in a very simple form. \n\r\nMy interpretation of the meaning behind the lyrics?\n\r\n He's saying that I love you so much that even though I'm a staunch aethist I am  willing to put that to one side and try and make myself see the world through from your viewpoint as a religious person. And going even further, I'll ask your deities to bless you, not becuase I belive in them, but because you do and I'd do anything for you. Even forsake my own beliefs or lack there or. \n\r\nLast thing - I challenge anyone to come up with a more romantic line than \"I don't belive in the existence of angels. But looking at you I wonder if thats true\" \n\n\n\n", "comment_54": "\nIt's a love song.  That is all.\n\nIt is also NOT a religious song. \nHe states he does NOT believe in an interventionists God (Christian concept of \"God\").  He reinforces his denial with an \"IF\".  \"If, I did...\"\nThat is not saying you believe.\n\nIt's like saying, \"If, I could lift the world, carry the full weight of the world for you...\"\n\"If\" see how that works...doesn't mean he believes he could.\nShe believes in all of it, though, and that is how he is able to convey how much he loves her using something she KNOW he doesn't buy but it's important to her.\nSo, that is something he's conceding to her, without actually giving up anything.\n\nBut, he DOES believe in Love. And, it's because of her.\n\nIt's a love song. It's like saying \"If, I could climb the tallest mountain...\"\nThere is no intent to actually climb said mountain. \n\n\nPlatonic love? Perfection, a prayer?  LOL\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\n'But I believe in love\nAnd I know that you do too\nSo keep your candles burning\nMake her journey bright and pure \nSo that she'll keep returning\nAlways and forever more\n\nI think in this part of the song he is talking to God. He tells us that he doesn't believe in a god who intervenes in human affairs, but by the end of the song he has changed his mind. He has faith in God from time to time, and in this part of the song he tells God that they both believe in love, so, for both their benefits, God should help him to keep her in his arms.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nPretty sure this song is about rape.\r\nEver seen the music video?\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nthis isn't as bad as O'Malley's Bar but, who does this songwriter think he or she is? i like it. i'd have to hear it but the lyrics aren't that bad. a little currupt but in the world of music, it'll be ok.\t\t\t\t\n\t\t\t\t\n\n"}