{"comment_0": "\nHere's what this song means.\n\nThis is about someone who is lost in the mix of everything. \"Football on the TV.\" He's become subject to the 21st century. He has no friends, or life. He is lost and doesn't even know who he is anymore. Throughout the song, he is trying to become someone and do things. But in the end he resolves to \"it's too late, I can't escape\" meaning that he's wasted too much of his life and must go back to the same old same old.\n\n\nThis song is a pretty remarkable song. Both in how he presents it and lyrically. I honestly thought they where a \"shitty\" boyband until their new album came along. If you still think they're a boyband, they're not. I'm a guy who generally prefers Radiohead, Beck, Bowie, and the Grateful Dead. But these guys really aren't that bad. They're not 1D and are turning into more of a Green Day.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song has been talked about by fans for a while now. Trying to figure out the meaning. It can be taen in different ways. Personaly, this is what I believe. It starts with the sound of type writers. The person is writing a note. \"Another day, of painted and football on the TV. No one sees me\" The person feels unwanted/needed by the people close to them. \"Lost inside a memory of someone's life. It wasn't mine\" They are thinking back on the few good times they've had. They are leaving/have already left. \"Just me and my shadow and all of my regrets\" They are alone, thinking back to every mistake made. They feel \"Invisible to the people around them. As the song progresses, it repeats \"Who am I? Invisible.\" They feel like no one is there or sees them. The music builds toward the end. Almost like a climax of a story. It gets louder and more intense, as Calum sings harsher and more emotionally attached. The scratchiness of his voice shows fear. The music represents the persons emotions. Scared, afraid of what is happening. Then, suddenly, it all stops, going back to a single acoustic guitar and type writer, signaling the story for this person is almost over. Everything is suddenly calm and okay. I think this means the person has left. (died) \"Another day\nThe walls are built to keep me safe, I can't escape\nIt's too late\" Its too late. They are already gone. It cuts off like that and goes to a symphony. Whats weird is this is a song written in a major chord, but ends on a minor note. Just stops and ends. Kind of like what happens in life. It just....stops.\t\t\t\t\n\t\t\t\t\n\n"}