{"comment_0": "\nIn this song, Tyler is crying out for help, because he has these wings, but they have no purpose because he can't fly. What that is really saying is that, he realizes that he has talents blessed to him by God, that aren't being used worthwhile, because he isn't using them for God. \n\nTyler then realizes that all that he and humanity are doing on their own is useless, and making their depression worse. Relying on yourself instead of God, and living by what YOU think is wrong and right, will ultimately ruin you. Then he goes on to say; \"If we wake up every morning, and decide what we believe, we can take apart our very heart and the life will set us free.\" I believe this is saying that, if we take the time to deeply consider who or what we believe in, then we will have new life under be it Jesus or whatever you find to be the truth. \n\nTyler then goes on to talk about the grace of God, because here on Earth, we are caught up in our own selves, wasting his time and ignoring what his will for us is. But he is waiting patiently, for us to realize that we can't and aren't doing this on our own. While we're down here, doing the same daily routine. Tyler then encourages you to not be afraid and push away Jesus knocking at your soul, wanting to enter in and give you new life. Because it's time you find your purpose, and he promises you that this is his.\n\nThese are all my opinions, feel free to read into the lyrics and come by your own meaning. Because Tyler's songs can interpreted in so many different ways.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nListening to this song I thought a lot about the struggle of a young man whose family is stuck in a bad financial situation. There's more than one voice in the lyrics, that being the first flightless bird crying out to the demons and angels, and a close one of that bird who sees what the flightless bird sees but does not have the strength and courage to attempt flight like the first bird does.\n\n\"Now is the climax to the story\nthat gives the demons and angels purpose\"\nThe intro could be being sung by either a third voice, a narrator, or possibly the second bird, who could be the narrator.\nThe angels and demons are made up of the super-elite. Actors, the 1%, those who don't have to deal with the struggle of a family living in a ghetto. The story could be thought of as the containment and leash that big business and wall street have on the flightless birds. The way they thrive in the sky is through the misfortune of the flightless birds (not to say that they all purposefully force the flightless birds to suffer, but they would not be as high up if the flightless birds could fly. This is the climax because the first flightless bird is going to attempt to fly, to get off the ground and get out of his ghetto, thus ending his story of being confined to the ground.\n\n\"I am cold, can you hear\nI will fly with no hope no fear\nAnd the ground taunts my wings\nPlummet as I sing, plummet as I...sing\"\nJust like any young person trying to lead a better life than their unfortunate parents, the flightless bird is afraid, courageous, brave, and hopeless all at once. Confused and seemingly alone, he struggles to lift off of the ground and fly.\n\nI don't think the first verse is sung by the second voice, only because in my interpretation, the second bird hasn't yet attempted to fly, but is only being inspired to fly by the first bird. The first bird sings the first verse, because they know what the pain is like to attempt to fly, or break the leash they are restrained by.\n\n\"All we are is an isle of flightless birds\nwe find our worth in giving birth and stuff\nWe're finding our homes again winding roads\nand we think the going is tough\nWe pick songs to sing, remind us of things\nthat nobody cares about\nAnd honestly we're probably \nmore suicidal than ever now\"\nThis is the flightless bird singing about his situation, the way his people distract themselves and his unsustainable position.\n\n\"If you decide to live by\nwhat you think's wrong and what's right\nBelieve me you'll begin to wish you were sleeping\nyour weeping will creep in your head and you'll cry\"\nThe painful thing for the flightless bird is more than just the ghetto he lives in, but also the pain of his own morality that extends to what he sees as the evil of the flying birds. It's the pain of being blinded by the light that is his possible salvation, mixed with the horror of the impossible odds he, and the rest of the flightless birds, are given.\n\n\"But if we wake up every morning\nand decide what we believe\nwe can take apart our very heart \nand the light will set us free\"\nEven though the pain of the previous lyrics can be unbearable at times, he know that in the end it will be worth it.\n\n\"How frustrating and so degrading\nHis time we're wasting as time will fly by\nand the sky will cry as light is fading\nAnd He is waiting oh, so patiently\nwhile we repeat the same routine\nas we will please comfortability\"\nThis is the voice of the close one to the first flightless bird. They are talking about how sad it is for the first flightless bird to want so bad to rise above and live a better life, but he is held back by things like his family and friends, who are fine with staying comfortable and distracting themselves from the problem he sees.\n\n\"And please think about \nwhy you can't sleep in the evening\nAnd please don't be afraid of \nwhat your soul is really thinking\nYour soul knows good and evil\nYour soul knows both sides\nAnd it's time you pick your battle\nAnd I promise you this is mine\"\nI saw this as the second flightless bird being inspired by the first, and getting ready to attempt to fly themselves. They are crying out to their people and family to listen to their own sense of morality beyond themselves, and to judge the flying birds for their satisfaction off of their misfortune.\n\nThis is just my interpretation of the song, others are of course valid. \nIt's been a little while since a song has been so relatable and so powerful to me. It's songs like these that really pull on my innards and force me to wear out my headphones.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think this song about just believe is what you believe in and not what others pressure you to believe in. \n\n\"\"\"\nIf you decide to live by\nwhat you think's wrong and what's right\nBelieve me you'll begin to wish you were sleeping\nyour weeping will creep in your head and you'll cry\nBut if we wake up every morning\nand decide what we believe\nwe can take apart our very heart \nand the life will set us free\n\"\"\"\n\nInstead of letting others set what you believe, like religion or anything, wake up every morning and decide what YOU believe, and the pressure lifted off of you will set your life free.\n\nAs for the rest of the song, what i could see it correlating with this verse above is that the angels and demons know what they believe, while you are pressured to what you believe. You have wings, but you don't know if you truly believe, so they are flightless, but \"if we wake up every morning\nand decide what we believe\nwe can take apart our very heart \nand the life will set us free\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIf you have wings but never leave the ground, there is no hope to get anywhere but also no fear of falling. If we rely on our own strength, we will never truly leave the ground and we will feel cold as we are unable to fly from the winter approaching. It's a strange and depressing expectation that everything will slowly freeze over, but we are too afraid to put our faith in the sky. The sky is unpredictable and difficult to understand, much like God, but without it we will never escape the coming winter.\n\r\nThe last verse describes the sky, or God, crying because we refuse to take flight. But as we attempt to stay comfortable, God is waiting so patiently for us to trust in Him. That being said, don't be afraid of what the truth will uncover. If the sky is really our only hope, we have to accept that sometimes it brings storms as well. We have to pick the side of a difficult truth which leads to life or blissful ignorance that will cause us to die. It is time to choose your battle: will you fight for yourself, which is easy to fight but impossible to win, or will you fight for something greater, which is hard to fight but possible to win?\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nNot much to say but we are a sinful people and don't want to accept what God tells us. I have a cousin who needs to understand this. If we wake up and tell ourself who we will obey today life will be clearer.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nOr it could just be about a suicidal dodo. \nJust imagine yourself being a useless, fat, defenseless creature, doomed like everyone else you know because you're trapped on an island together with bloodthirsty dogs. Aha.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think this song is a continuation of taxi cab and the two chronicle the journey of one person to the afterlife and how they come to terms with this. This song seems to be about the person looking back to the real world and describing what actually goes on in the structure of society. Those are just my thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nSo I just thought of this. The first 2 lines. â\u0080\u009cNow is the climax to the story that gives the angels and demons purpose.â\u0080\u009d I think heâ\u0080\u0099s saying that we are in the end times right now. In the rest of the song he explains that we shouldnâ\u0080\u0099t rely on our own understanding, we must rely on what God says. Heâ\u0080\u0099s basically saying we find our worth in the things on this earth, but we are worth more to God than what we find our worth in here. We all must pick whether we want to follow Jesus or let the devil control our lives.\t\t\t\t\n\t\t\t\t\n\n"}