{"comment_0": "\ni like that they used this song for Breaking Dawn, it was a really good choice\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nwow first one to comment. this song totally differentiates racoons from squirrels - the former being the more polite and courteous procyonid while the latter just sneaks pancakes and tacos near the window panes. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nBasically i think that this song means to saay thaat if she ever leaves bruno he'd rather die than live without his love.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI really like Bruno Mars. It's easy to see who or what might have influenced him (Michael Jackson, and for this song a blues tune called Aint No Sunshine When She's Gone) yet he still manages to feel authentic because all of his dramatic passion sounds sincere. His quirky off balance imagery; if you ever leave me baby, leave some morphine at my door works because he has a sort of desperate sensitivity/streetwise gallantry that is missing from other urban drawing artists. Also, his arrangements show an ingenious sophistication despite their simplicity. Go Bruno1\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthis song means that he cant live his life without his true love and that if she leaves, he would be bawling and his heart would be broken.\r\nwhen he says \r\n     And just like the clouds\r\n     my eyes would do the same\r\n     If you walk away\r\n     Everyday it would rain, rain, rain\r\nhe means that his eyes would rain like the clouds: he would cry\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ngood song!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think this song is really good. I heard someone say that they really liked Bruno Mars but this song was a let down. I'm like whatever ! This is one of his best songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song is one of my favorite songs ever.\nAnd Bruno is my love. I never felt this for a long time now.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nme and this guy dated for almost two years and he sang this song to me. a few weeks later he breaks up with me for a girl that gets around a lot. so i freakin hate this song. but i cant stop listening to it.!!! why???\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nwhen me and my boyfriend had first gotten together he was like every time i hear thisa song i think of you cause if you ever leave me then i will cry like never b4\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI love this song for the simple fact that I can joke that I 'feel like Bruno Mars', whenever I predict rain.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nnice feeling s\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nNew version of \"Aint No Sunshine\"\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni think this song is about a boy losing his girlfriend and it mad him feel sad..\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthis song is a boy loskns his girl\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\na boy missing his girlfriend\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis is a really good song and its relatable to :)\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nSimilar sentiments to the song 'I wish it would rain' by the Temptations but written by a guy who committed suicide when he couldn't live without his love.\nBut this song is also great from the opening line to the end and sung wonderfully by Bruno.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI think it's about an interracial relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think Boyce Avenue sings it better.. just my opinion. But all in all he's just sayin if you left me it would kill me inside.\t\t\t\t\n\t\t\t\t\n\n"}