{"comment_0": "\nMy favorite of F.S. songs. It's hauntingly beautiful with such bittersweet sentiment. I did not discover (enjoy, really) Frank's music until my 40's, although I grew up watching him and Dean (and their musical friends) on television. Those were the days when you sat around the television set with your family after a meal at the table, and was blessed with the likes of the talented musicians of that decade. It was a time of sweet naivety and innocence, which made Sinatra and the like seem like kings.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nmuch like his song \"my way\" i think it is an old, dying man looking back on his life and thinking how good it was and that he is ready to go.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nmy favorite sinatra song\n\r\nits meaning is not cryptic enough to require analysis, really; pretty straightforward\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nBeautiful song about those great days of yore that everyone had - not just Frank - very universal song.  Loved how they used this song in that Season 2 episode of The Sopranos.  PS - that's a Frank Sinatra poster in the back of the Bada Bing!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\none of the gems on the first Sopranos soundtrack.\r\nALOT of great music in that show.\r\ncan;t wait for the 2nd half of season6\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nTHE BEST SONG EVER WRITTEN\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nSo few comments for one of the most universally beloved musicians? I though there would be so many.. I grew up on this song, and it's a song I make a tradition of listening to every birthday. Very bittersweet, with lots more sweet than bitter, I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe final verse makes this song amazing. Here's what I think it means: \"I'm in the autumn of the year\" gives you an idea of his age; around 3/4ths of his life is over. He says he thinks of his life as vintage wine and that the wine is of a very good year, meaning he believes his life was a very good one. So the title \"A Very Good Year\" is referring to a life of great value and happiness. I like the metaphor as a life being compared to a year of wine; there are many years and many lives and, just as there are especially good years for wine, this life stood out specifically as a good one.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI am going to say the same thing somebody said in the page for: In-a-Gadda-Da-Vida : \" who thinks of the Simpsons when they hear this?\" .\t\t\t\t\n\t\t\t\t\n\n"}