{"comment_0": "\nI don't think this song can get any more perfect...\r\nTo me I think it means he was trying his all to be what someone else wanted him to be, but after trying to change he just realizes he's never going to change who he really is and learns to be proud of it\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song really speaks to me and how I've been feeling since I graduated high school.\n\r\nI feels like my time in this town is done, that I don't belong here anymore, and I need to venture off to some other place to pursue my dreams and learn to live my own life.\n\r\n\"It's time to begin, isn't it?\r\nI get a little bit bigger, but then, \r\nI'll admit, I'm just the same as I was\r\nNow don't you understand\r\nThat I'm never changing who I am.\"\n\r\nMy father thinks that if I move out and move on with my life, it's going to change who I am but deep down inside, I'll always be same person. I just need to turn the page and start a new chapter of my life. I absolutely love this song, it tells the listeners a lesson that no matter where life takes you, you don't have to change- just be who you are or who you've always been. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI don't want to take the mystery or the personal meaning out of it for anyone.  This can be an emotional song, as it surely was for Dan Reynolds.  So stop reading if you want it to be special for you.\n\nI'll just leave it at this for now:  Imagine you're raised Mormon and you believe it deeply, so much that you honorably serve two years as a missionary in Nebraska, you come back to major in music at BYU, and it isn't working out the way you want it to, or the way you think it should.  Your interest in it is waning.  Now you've started a band and you're going to drop out of your church's most renowned school to pursue your career (Packing my bags and giving the academy a rain check).  A lot of emotions probably go with that.  And some of those emotions are in this song.  People might even call your decision-making ability into question (I don't ever want to let you down).  And you might wonder if they're right.\n\nReference: purevolume.com/news/…\n\n\n", "comment_3": "\nIt's about growing up and following your heart. Having to walk your own path and letting the people you love follow theirs without holding them back or letting them hold you back. Forgetting about school if it doesn't make sense. Forgetting about a crappy job. In the process of reaching for them we make the hero's journey, going out into the world, telling ourselves we haven't changed despite enormous growth. As time goes on though the relationships begin to break down slowly, each person has grown beyond the place they started.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI don't ever want to let you down\r\nI don't ever want to leave this town\r\n'Cause after all\r\nThis city never sleeps at night**\n\r\n**the band is from vegas. the city doesn't sleep at night. the guy did not want to leave his hometown and change.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI believe that this song was about someone who's parents or someone wanted him to become 'better' than they were.  However they did this by pushing him to become something he is not.  He then realized that what they wanted was not what he wanted.  He faces them and they are disappointed.  He then feels like he is on his own and tries to start over on his own.  A lonely road and the old house burned to the ground to erect a new one.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI love the clapping in the beginning that carries out through the rest of the song. It's so powerful and awesome. Based on what the band said, the song's about \"being true to who you are\"\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song means a lot to me. \nI think this song is about someone who is incredibly shy (like myself) and is going through some tough times (depression) and just wants someone to notice ore be his friend, and just when he thinks that very thing will happen, he sinks back down again, However, he eventually realizes he not gonna change for their benefit. I have a lot of real experiences of that sort. People always tell me, oh you should talk more, but they never listen when I do, they just ignore me like always. There will be times when I think, this is it, someone might finally notice me and understand what I'm going through. But then I just sink back into my original form. I'm starting realize, though, that I don't need them. If they can't appreciate me for who I am, what are they really wort? That's what I think this song is all about.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nSo this is what you meant when you said that you were spent?\r\nAnd now it's time to build from the bottom of the pit right to the top,\r\nDon't hold back\r\nPacking my bags and giving the academy a rain check\n\r\nI believe this song is about a young musician/artist who has been constantly resisting and pushing back against his parents who want \"better\" for him, and are trying to push him in a direction his heart is not in. \r\nfinally they give up trying and give him free rein to make his own decisions, telling him they will try their best to support him in whatever he does. He then takes full advantage of his situation, and drops out of school to pursue his dreams,not holding back anything because he is so passionate about his art. However, since his parents had disconnected him from his dreams as much as possible, he has to start from the bottom.\n\r\nI don't ever want to let you down\r\nI don't ever want to leave this town\r\n'Cause after all\r\nThis city never sleeps at night...\n\r\nI assume this part means he lives in NY, NY because NY is known as \"the city that never sleeps.\" This provides him with a plethora of opportunity.\r\nEven though he strays from his parents' preferred path he still sets his sights on doing his best not to disappoint them with his decision.\n\r\nIt's time to begin, isn't it?\n\r\nhe's nervous\n\r\nI get a little bit bigger, but then, \r\nI'll admit, I'm just the same as I was\r\nNow don't you understand\r\nThat I'm never changing who I am?\n\r\nreassuring his parents that as he gains popularity he won't change into the stereo-typical self-absorbed movie-star-monster.\n\r\nSo this is where you fell, and I am left to sell\r\nthe path that heaven runs through miles of clouded hell, right to the top\n\r\nHe has come across some adversity. His parents say he is on his own because they can't either handle it financially or they just don't like the path he is on. Either that, or a label drops him.\n\r\nDon't look back\r\nTurning to rags and give the commodities a rain check\n\r\nHe is still not giving up. He spends all of his money to try and make his dream come true and gives up a lot of things. Probably getting a job or at least more hours at work, not getting enough sleep.\n\r\n(chorus) \n\r\nHe is still continuing to gain popularity \n\r\nThis road never looked so lonely,\r\nThis house doesn't burn down slowly,\r\nto ashes, to ashes...\n\r\nBasically he has done all he can do without killing himself, and his dream isn't turning out like he planned, and basically it fails. Yes, dream = crushed, failed, flopped.\n\r\nBUT, The song is not over people!\r\nonly his plan A failed. Now he moves onto plan B! NEVER giving up his dream, and ALWAYS listening to his heart. Never changing who he is!\n\r\nNow THAT is inspirational my friends! perseverance at its finest\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI believe this song is about how even though its time for him to leave and start a new chapter in his life, he's scared.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nIt'a time to let go and start over. It's time to move on from the past to the future. It's time, not to forget memories, but to learn from them and become someone new. It's time to take a new path, to walk alone and to find ourselves to know where we have to go. \n\r\nIt's time to begin again, not by changing who we are, nor by forgetting who we used to be, but by combining both of these people and transforming into who we were always meant to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song is basically describing a person who loves his home town but yet wants to venture out into the world and take his talent where it will be noticed and respected.  this individual has negative issues with the academy for unknown reasons but decides that he is going to leave regardless and his career is growing but never-the-less he is going to remain the same person  and want people to understand.  his intent to capture his journey is related to his loneliness on the road to success but yet he notices himself burning to ashes as the old saying goes \"burning your candle at both ends\".   there was much thought put into this song.   i guess we all have our own interpretation of this song due to our own views on life.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n>And now it's time to build from the bottom of the pit right to the top\n\r\nIt's about someone taking steps to change his situation without changing who he is at his core. \n\r\n>the path that heaven runs through miles of clouded hell,\n\r\nIt'll be a tough road. \n\r\n>It's time to begin, isn't it?\r\n>I get a little bit bigger, but then, \r\n>I'll admit, I'm just the same as I was\r\n>Now don't you understand\r\n>That I'm never changing who I am?\n\r\nI have left this town, I have become something, and I have pursued my dreams, but through all of this, ALL of this, I have never changed who I am.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nIt's time to begin (a new: high school, college, home, or job) isn't it I get a little bit bigger (i'm getting older) but then i'll admit that i'm just the same as i was (i'm still the same person as i used to be) not dont you understand (that i'm not a little kid anymore) that i'm never changing who i am (i wont let other people change who i am).\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis song for me represents a person that try's to be someone they are not and finally letting go the passion they have and pursuing what they want in life. They won't change through the process and going to stay true the their roots. \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI think this song is about letting you be yourself. I think this person tries to live a life that doesn't fit with who he is inside. After a while he can't take it, he needs to be who he is deep down, no more fake acts. I love this song because I think represents how I feel. I live in an area where I can't be myself, for a long time I have done that, and I am torn between two worlds. Now I accept and am proud of who I am, and I will never be anyone else other than myself. Next year I will change my environment and then I will be able to be myself. I think the singer deep down will miss some things, just as I will. But we know there is a brighter future ahead of us. But, no matter what \"I am never changing who I am.\"\nPeace, M.C. Callaghan\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nHe will never change because he's satisfied with himself and where he has came from. Even if his circumstancesâ\u0080\u008b get better or stay the same he would always be who he wants to be. He doesn't mind giving changing a try but he's not going to promise anything.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nFor some reason, every time I hear this song it reminds me of college.\n\n\"So this is what you meant\nWhen you said that you were spent\"\n\nThis person is listening to advice from older people or older friends.\n\n\"And now it's time to build from the bottom of the pit, right to the top\nDon't hold back\nPacking my bags and giving the Academy a rain check\"\n\nOnce you graduate high school you start over in college. And you need to leave no regrets... And let's not forget you have to pay up too.\n\n\"I don't ever want to let you down\nI don't ever want to leave this town\"\n\nThe person doesn't want to let the people who support him/her down. The person also doesn't want to leave - in my opinion- because everything they have ever known is in the town (home).\n\n\"Cause after all\nThis city never sleeps at night\"\n\nThis could be referring to the fact that in college, late nights happen because of studying or partying. Or also the late nights staying up and thinking about life in general and what the future holds.\n\n\"It's time to begin, isn't it?\nI get a little bit bigger but then I'll admit\"\n\nAdmitting that this is a new era in one's life. That it's time to begin living the life of adulthood where consequences directly affect your future. The person 'changes' into a different person, becoming confident (perhaps cocky) in the college life. But in reality they admit that although they act differently in the new environment they never changed as a person but changed their persona.\n\n\"I'm just the same as I was\nNow don't you understand\nI'm never changing who I am\"\n\nThe person has changed themselves to live the college life, and no one understands why they don't change genuinely or why they are faking it. The person admits that they won't change as tempting as it is.\n\n\"So this is where you fell\nAnd I am left to sell\"\n\nAt this point in their college career, the person has reached the point where many people have dropped out. And the person is struggling to continue their education.\n\n\"The path to heaven runs through miles of clouded hell right to the top\nDon't look back\nTurning to rags and giving the commodities a rain check\"\n\nThe person says that they have to sacrifice their comfort for the sake of the future - which means they have to struggle. No pain no gain. No regrets.\n\n\"This road never looked so lonely\nThis house doesn't burn down slowly\nTo ashes\nTo ashes\"\n\nIn college, the person is all alone. His/her new friends are practically strangers and if she/he screws up (the house) it'll be a slow burn to failure. \n\nSo essentially, in summary:\nA college student struggles with the reality of continuing their education, surviving without family/friends from home, and their mental health.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI think this song is about growing up. However, it's about growing up realizing your childhood dreams.\n\n\"So this is what you meant\nWhen you said that you were spent\"\n-He finally sees what it means to come to point where life gets harder. Where you feel drained because you're doing something you don't want to do.\n\n\"And now it's time to build from the bottom of the pit, right to the top\nDon't hold back\"\n-Now it's time to start all over. Don't hold back on yourself and what it is that you want.\n\n\"Packing my bags and giving the Academy a rain check\"\n-Quitting school, most likely college.\n\n\"I don't ever want to let you down\nI don't ever want to leave this town\"\n-He doesn't want to fail the ones closest to him. However, he also doesn't want to leave \"this town\" or his dreams\n\n\"Cause after all\nThis city never sleeps at night\"\n-Many people would most likely see this as meaning New York City, or even Las Vegas (where they are from). However, I see this term as the city of dreams literally. The heart of a dreamer never sleeps. Pretty sure his dream, specifically, is to be a musical artist, but I like the idea of generalizing it to dreamers.\n\n\"It's time to begin, isn't it?\"\n-It's time to be an adult, isn't it?\n\n\"I get a little bit bigger but then I'll admit\nI'm just the same as I was\"\n-I'll get older (no longer will be a child), but I'm just the same. I have the same dream from before.\n\n\"Now don't you understand\nI'm never changing who I am\"\n-My dreams will never change\n\n\"So this is where you fell\nAnd I am left to sell\"\n-So this is where you gave up and I am left to learn, profit, from the lesson\n\n\"The path to heaven runs through miles of clouded hell right to the top\nDon't look back\"\n-The path to top, fame/your dreams, involves many hardships. Don't look back and hesitate, just move forward.\n\n\"Turning to rags and giving the commodities a rain check\"\n-Becoming poor by choice by giving up anything of convenience.\n\n\"This road never looked so lonely\"\n-The journey to one's dream is hard. There are many times where you lose touch with loved ones.\n\n\"This house doesn't burn down slowly\nTo ashes\nTo ashes\"\n-His childhood is leaving him, forcing him to be an adult. There's no way in going back to his childhood. He has to be an adult, one that he wants to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI love this song, I think I heard it on a tv show like Gossip Girl but now it's everywhere because of The Perks of Being a Wallflower, can't wait to see that. I keep hearing one bit wrong though haha changes the meaning completely...\n\r\nIt's time to begin, is it in?\r\nI get a little bit bigger, but then, \n\r\nSorry about the username I've signed into my old account accidentally, made this when I was about 12!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI love this song it explains excailty how Im suppsed to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nIt sounds like a break up occurred and the person must build themselves back up to what their ego was formally before that person was crushed by the break up. I feel like the academy is referring to a place for the person to be applauded for achievements. Honestly, the chorus sounds as if the person is just demonstrating that a person grows into themselves with their initial environments and conditioning. Once they grow in a certain location in their childhood, they will stay as that person. Habits may change, but their personalities do not vary as much as they could in their childhood. The person is getting away from a break up, and in order to get through this break up, they have to leave to figure out who they truly are and to build themselves back up again. I think the â\u0080\u009chouseâ\u0080\u009d during the last bridge symbolizes the relationship that was over. Itâ\u0080\u0099s time for the person to begin as an individual instead of being in a relationship with someone and always submitting to their whims. This person wants to begin making autonomous choices because the person would only try to fit the mold for their former significant other.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nMy interpretation is that the the singer here is not willing to change himself but he wants to venture into life again after something terrible has happened. He is going to start a new life but just because he got hurt the last time he is not gonna change himself, and he is gonna stay himself. maybe people around him think that it's foolish but he holds on to his own belief. This song can be related to many things: big failure, heartbreak... it kinda gives the energy the encouragement to move on... Great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nSo in my opinion, the male has decided to get a fresh start to his life after being dumped by his partner 'So this is what you meant when you said that you were spent?' and it seems that he's made some pretty bad decisions that upset his family.\n\r\nHe decides to go out and find out what his purpose in life is, and drops out of school 'Packing my bags and giving the academy a rain check'. \n\r\nHe's afraid at what his parents will say and he's reminiscing about the town that he has grown up in, but decides that it's for his own good to leave and discover himself; 'I don't ever want to let you, I don't ever wanna leave this town'.\n\r\nIn the chorus, he's telling his loved ones that he's tired of this life here and that he's leaving temporarily, but that he'll always be the same person that they know and love. \n\r\nIn the bridge, he's finally made it out on his own and he's exploring, but he still wonders if he made the right decision and is doubting himself. \n\r\nBut when the chorus starts again, it has a new air of achievement and joy and in my opinion, it's the male finally being happy with himself and he's found someone who really cares for him unlike the girl who broke up with him at the beginning. He comes back to his hometown at last, and his loved ones are ecstatic to see him again and they finally decide to accept him for who he is, despite the decisions that he's made. \n\r\n I really do love this song. Sorry for the long back story :)\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nto me, everything in this song is relative. But I relate it my world to those who say they have given up on me. \nI take what he is saying as... Hey, you've given up on me... but through the ups and downs, which he goes through in the song... I'm going to continue to rise, that I'm not changing who I am and what I'm here for. \nIve seen this song used as pump ups for sports, for depression, and for a challenge for one to take back whats theirs.\nIts all relative... but this song just speaks to me as a writer taking a choice to overcome the obstacles\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nFrom what I got from the song was: Even though its time for him to leave and start a new chapter in his life, he's scared.\n\nI also got from the song was: it's about trying to get over someone who had died, there were quite a few references, e.g.\nTo ashes, To ashes\nThis is what they say in a funerals:\nAshes to Ashes\nDust to Dust\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI think this song is about a project or something that someone is trying to finish but other people want him to stop, also the project is sort of failing, but he still continues, sort of a nostalgic song almost. (Like Photograph by Nickelback.) By a little it also means not to listen to other's input.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI invision something different when I hear this song. Here's the scenario.\nThere are two friends, one who is perhaps struggling with depression, or is just overall sad. The other friend sees this, \"so this is what you meant\" \"so this is where you fell\". He's reminding his sad friend that he cannot remain \"at the bottom of the pit\" and not to \"look back\" at what made him so miserable. \"Cause after all this city never sleeps at night\" he's telling his friend that their little world will never stop running, so don't get left behind in your pit. \"It's time to begin isn't it?\" His sad friend has finally come to this conclusion and is asking if it is finally time to move on, or atleast start trying. \" I get a little bit bigger but then\", the sad friend is struggling with an emotional relapse or perhaps an actual drug relapse. \"I'm just the same as I was\" \"I'm never changing who I am\" is the sad friend saying that he is still the same person he was before his depression, and he will never change who he is because of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis song struck a simple cord with me:\n\n\"It's time to begin, isn't it?\nI get a little bit bigger, but then,\nI'll admit, I'm just the same as I was\nNow don't you understand,\nThat I'm never changing who I am.\"\n\nI interpreted this as: As I grow up, I will not grow old. No matter what new stage or chapter in life that it's time to begin as I grow and move on in life, I will still be the same person/kid at heart, no matter what, and that will never change.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nPlain and simple, I think it's about teenage immaturity and stubbornness.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nMaybe it's about a fire...\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThis is a great song for someone who likes the way he is living but other people around him are trying to change. reynolds himself told that he wrote this song when he dropped out of college and was going through a time of depression.\n\r\nI dont think this song can get more perfect. Absolutely love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nObviously, this song is about a corpulent man who wants to get close to a girl he likes, but he keeps getting fatter, so then he decides he ain't gonna change.\n\nI get a little bit bigger, but then\n\nobvious innit?\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nBasicallly this is about a couple leaving each other. The guy is leaving his establishment and venturing out to new and different things. But even though its new things doesn't always seem like he is assimilating to his environment. its a great song and a great message about remembering your past and being strong in life no matter how weak you think you are. \n\nHe is trying to tell everyone that i don't fit in, but I cant go back to my life. Even though i am not going to never leave my town mentally, I can leave and move on physically and grow and build new and different things. \n\nIt really relates to me because it reminds me when I got out of the military and I felt soo lonely. BUT i decided to move to CA to pursue the dreams that i have always wanted to do. Sometimes I get caught up a little bit from the pretentious side of LA but I always tend to realize who i truly am and who i will truly always be. A southern guy with standards, morals, and values.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI think everyone in the world should listen to this song.It's a great one\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nOMG. I'm just imagining dragons now - it's hilarious. They're breathing fire and stuff. In a cave. In Wales. Thanks to this band for encouraging me to imagine dragons - much appreciated.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI think that it's about sex.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI think that the song is about the size of a guy's dick, and he is insecure about the size of it when having sex. The other meanings are kinda tied into this.\t\t\t\t\n\t\t\t\t\n\n"}