{"comment_0": "\nSomeone posted this on Spreadnet.  I don't know who to give credit to, but I think he/she nailed it.  Everything below is someone else's words:\n\r\nRe: Jack Translation\n\r\nOK, so I was listening to the weekly MP3 of Jack and for an \r\nunknown reason it occurred to me what that song was about. All of these years, I guess I had never given it any thought. If you already know, then disregard this.\n\r\nIts about a card game. Actually a Straight Flush. \n\r\n\"Jack was really a jester who held his one good eye on the queen\"\n\r\nThis means that One Eyed Jacks are wild and that the card holder also has a Queen.\n\r\n\"And there sat the king beside her. He's pointing his sword up and down with every scene\"\n\r\nObviously he has the King of the suit. But this also tells you \r\nwhat suit is held. There are only two one Eyed Jacks. Spades and Hearts. The King of Hearts is a Suicide King meaning that his sword is horizontal, so it means that the holder has a Jack, Queen, and King of Spades.\n\r\n\"And the wizard's in the corner, catching peanuts between his teeth\"\n\r\nThe Corners of a straight are your high and low cards. Now, I \r\nhave never heard of an Ace being referred to as a Wizard, so I am guessing that Jokers are also wild and that the holder has a Joker to represent his Ace. I will get back to that in a second.\n\r\n\"And the dogs lying in the shadow in the archway. There's one good dog sleeping filled with good ole' dog dreams\"\n\r\nYour Dog is your low card in a straight. In this case it is a two \r\nof Spades. I will come back to this.\n\r\n\"He slipped next to the wizard, whispered something deep, to the bottom of his ear. A little joke, the one about the farmer's daughter. How she was stomping on grapes, coming up with blue feet and beer. And he slipped behind the queen\"\n\r\nWhats important here is that the holder rearranged his cards. He moves his Jack behind his wizard. In any Poker game, it is important to rearrange your cards even if it is an old trick. Or an old Joke, maybe about a farmers daughter. Then he slips the Jack right back behind the queen where it started.\n\r\n\"Where the fools go the rich don't mind\"\n\r\nWild cards can go anywhere.\n\r\n\"Lately the king's (k)nights have turned a little rusty, and his halo - I mean his crown - has gone and slipped around his \r\neyes\"\n\r\nHe is going to have to go from a Royal Flush to a lesser flush. I will demonstrate that.\n\r\n\"The wizard's in the corner, pulling lizards between his knees. And the dog hesbeen long gone, gone to pitch for the winning team\"\n\r\nThe Wizard, or Joker had been the corner or high card in the \r\nhand. Now he pulls the Lizard (Two) to the top card corner. By doing this the two is no longer a Dog and it completes the straight and wins the game.\n\r\n\"Fifty-two, I mean fifty-four bicycles on the wall, ready to ride, ready to ride until the last of them falls. Jack's been cooking in the kitchen, whompin' up some biscuits for us all. For us all. For us all. Ready to ride, ready to ride, ride\"\n\r\n52 Bicycle playing cards in a standard game. 54 when playing with Jokers. The One Eyed Jack was really the pivotal card in this game and \"cooked\" up a win. His hand was Jack, Queen, King, Joker, Deuce. Spades.\n\r\nWell, what do you think???\n\r\nThe only thing I don't know is \"catching peanuts between his \r\nteeth.\"\n\r\nHow bout a little help.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThat above definition is proof that hippies have no concept of reality...particularly if they spend most of their time shootin' squirrels, rippin' bingers and sniffin' teeners while being the Flemmish King of Rocky Hocky. \n\r\nSong is about one thing and one thing only...shopliftin' the pooty from the queen while no one's lookin'. Period. If you know much about cards you'll know most of that is contrived. \n\r\nStick to slaughtering rodents... beware of Peta and In Earl We Trust.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nBout a doggy lyin in the shadow in the archway. Dog song.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\n\"dog in the shadow of the archway\" -- I always assumed shadow of the archway was representative imagery of a spade, with its black arch.  \n\r\nFollowing along with rflem550's thoughts, the archway could the arch in which the cards are held.\n\r\nThis song is definitely about playing cars though I never saw the straight flush interpretation before\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n\"dog in the shadow of the archway\" -- I always assumed shadow of the archway was representative imagery of a spade, with its black arch.  \n\r\nFollowing along with rflem550's thoughts, the archway could the arch in which the cards are held.\n\r\nThis song is definitely about playing cars though I never saw the straight flush interpretation before\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nSo straight flush\n\nJimmy doesn't get every part Michael played, as incredible as he is.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nObviously about a straight flush. \n\nI dropped acid after I blew off a girl and my buddy took me to his marsh. The marsh.\n\nWell yea I called her the next day but that marsh. The crabs. Our pre-smart phones.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nYea everything I posted was blackout drunk so I'm gonna make it easy and have one post.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think the poker interpretation is dead on.  Regarding the Mikey vs Jimmy thing:  Mikey was unique which is what made him so popular.  It sad that we lost him, especially so young, but you have to remember that Jimmy came from the same Athens/Horde scene as Mikey and they knew each other well.  If there was ever someone to take over for Mikey Jimmy is the logical choice.  I think he does a great job preserving the feel and message of WSP's music while bringing his own style as well.  Remember, there will never be another Mikey.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nmakes sense to me. i must confess\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nWho else would you rather play for panic? Jimmy does it but there are parts\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthe drive to the marsh was what everyone else experienced. jack\t\t\t\t\n\t\t\t\t\n\n"}