{"comment_0": "\nHmm, I think there is more sinister stuff under the surface of this song and lots of double entendres. Elvis certainly did not write it, and most probably had no idea about any of the meaning's.\n\r\nObviously there's the \"Number forty-seven said to number three\" verse, but isn't the title a euphemism for shagging. Also, \"The Purple Gang\" were sex cases either, rapists, peadohiles or homosexuals (1950â\u0080\u0099s, hey) but someone state side can confirm or shoot this down. \n\r\nAynone know what \"The sad sack\" is?\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nA sad sack is somebody who's not into it.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\n\"Little Joe was blowin on the slide trombone\"...I bet he was\n\r\nFunny how old people are always talking about how disgusting today's lyrics are - yet they get up and dance and sing along to this very disturbing Homosexual Prison Gang Bang song....cracks me up!\n\r\nI bet the \"purple\" gang had a blast!...LOL\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI definatly see this as a big double entendre, I'm especially surprised no ones mentioned \"If you can't find a partner use a wooden chair yet\", haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n\"Bird\" Is an old slang for \"girl\" or like \"young girl\" so obviously \"jailbird\" is a girl in jail.\n\r\nElvis was not gay or bi or anything weird like that. He had a wife and he sang a lot of love songs about girls.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nHey this is a really cool song what d'ja say han???\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI am sorry guys the other Jailhouse Rock is incorrect this is the right one\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nGreat movie and great song\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song is about rapists, drug addicts, and convicted terrorists all getting together to play music, and escape from a heavily guarded jail.   lol.  Ok, So I dont know what its about. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nstill pretty awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nElvis was gay.\n\r\nNot quite true, but I thought my first post should be controvertial in some way. This song does contain a bit of homosexual inuendo however,\n\r\n\"Number forty-seven said to number three: \r\nYou're the cutest jailbird I ever did see. \r\nI sure would be delighted with your company, \r\ncome on and do the Jailhouse Rock with me. \"\n\r\nA bit of a joke I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nIt means Elvis was bisexual: \r\n\"Number forty-seven said to number three:\r\nYou're the cutest jailbird I ever did see.\r\nI sure would be delighted with your company,\r\ncome on and do the Jailhouse Rock with me.\n\r\nWe also know he conquered many women...\r\nOr he's heterosexual, and the song's a joke. besides, he didn't write it as far as I know. all I know is that before singing the song on this tv show (I saw it) he said: Well I was at this place with all these men( blushes) and we were having fun you know and stuff..\n\r\nThe introduction induces things..\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nElvis is the king!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThere could of been a girl inmate. Lol. I think it was a kinda of joke by the writers. If say a little kid asked \"Why did he say that guy was cute?\" There parents could say \"......It was girl.\" This was the '50's anyway and nobody was gay. At least they didn't tell anybody. Anyway..........\n\r\nThe band the Purple Gang (\"Granny Takes A Trip\") got their name from this song. And if you want a GREAT cover of this check out The Residents' version. It's definitely different.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis song is simply AWESOME in 'The Blues Brothers'. And how come there's no Sweet Home Chicago posted anywhere on this site?\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nJust a show tune, so how could it not be interpretted as being gay?  Elvis was harldy gay, got more tail than anyone alive.  It's a simple song that means nothing.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nPresley sang it as straight hard rock, there are parts of the Leiber and Stoller lyrics that represent talk about same-sex relationships between inmates. For instance: \"Number forty-seven said to number /… the cutest jailbird I ever did see./I sure would be delighted with your company,/Come on and do the jailhouse rock with me.\" However, many see this as a lighthearted reference to forced environmental improvisation.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\noh, how i fancy elvis :) well, the 50s wasn't terribly musically complicated, so. rather, i'm going to share this:\n\nyoutube.com/…\r\n\"Jailhouse Rock\" music video!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nMotley Crue covered this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI was wondering if anyone knew if all the names mentioned in the song were real criminals. Mostly the first three, Spider Murphy, Little Joe and the Purple Gang...\n\r\nDoes anyone know?\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThe warden said, \"Hey, buddy, don't you be no square- if you can't find a partner use a wooden chair!\"\n\r\nLove that line! Makes me want to bust my hip-shaking moves out, haha\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThe Purple Gang ran the streets of Detroit during the 1920's & 1930's when alcohol was illegal. The Purple Gang was feared by other gangsters, they were killers; they ran all the alcohol blind pigs & speakeasys, as well as all the prostitution and drugs. \r\nDetroit, being across the river from Canada, was a quick route to bring in illegal alcoholin America by boat. \r\nThe Purple Gang even provided illegal alcohol to Al Capone's gang & other well known gangs. \r\nAlso, the Detroit Jails housed females & males near each other until after Sentencing, then the females & males were sent to separate male/female housing. The song did referred attraction between a male and female, most likely a prostitute. \r\nI'm grew up with all the first hand stories from Grandparents involved in both the legal & illegal parts of Detroit history.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nCool song, it is a nice change from his other songs that are always about being in love....it gets a bit boring. \r\nI am off for the day now! :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nSodomy in jail.\t\t\t\t\n\t\t\t\t\n\n"}