{"comment_0": "\nTool - Jambi\n\r\n\"Here from a kings mountain view,\r\nHere from the wild dream come true\"\n\r\nHe is introducing the song by speaking from the perspective of someone who \"has it all\" in a material sense.\n\r\n\"Feast like a sultan, I do\r\nOn treasures and flesh never few\"\n\r\nThis person is only concerned about piling up materialistic idols and putting themselves over others. \n\r\n\"But I would wish it all, away\r\nIf I thought I'd lose you just one day\"\n\r\nAlthough he has everything worldly, he would throw it all away if it meant getting rid of \"you.\" (He is about to define \"you\") \n\r\n\"The devil and his had me down\r\nIn love with the dark side I'd found\"\n\r\nHe is relating this materialistic mentality of the world to the \"dark side\" or work of the devil. \n\r\n\"Dabblin' all the way down\r\nUp to my neck, soon to drown.\"\n\r\nHe uses the word Dabblin' to describe someone that is digging into this materialistic lifestyle almost as if he is searching for something but the lifestyle is taking over him too much and he is about to 'drown'.\n\r\n\"But you changed that all for me\r\nLifted me up, turned me round\r\nSo I, I would wish this all away\"\n\r\nBut \"you\" changed that all for me. Here is that reference to \"you\" again and it is positive. It is the reason he would wish away the fleshy outlook of the world. \n\n\r\n\"Prayed like a martyr dusk to dawn\r\nBegged like a hooker all night long\"\n\r\nHalf of the time this person acts very christ-like or pious but the other half of the time this person begs for this \"dark side\".\n\r\n\"Tempted the devil with my song\r\nAnd got what I wanted all along\"\n\r\nAlthough this person acts as if they are a noble and good person he is actually getting all of the materialistic and evil lifestyle he craved.\n\r\n\"But I\r\nI would\r\nIf I could\r\nI would\r\nWish it away\r\nWish it away\r\nWish it all away\r\nWanna wish it all away\n\r\nNo prize that could hold sway\r\nOr justify my giving away my center\" \n\r\nThis is a key lyric of the song, Maynard defines the \"you\" that \"lifted me up, turned me round.\" It is his center. Tool is a very spiritual band and I can assure that the center referred to here is not a God, it is the center of himself. It his balance within Nature and this experience, his connection to \"oneness\" or the divine. \n\r\n\"So if I could I'd wish it all away\r\nIf I thought tomorrow would take you away.\"\n\r\nHe would wish anything away that swayed him away from his center. He holds his center to a higher respect than his entire external experience. \n\r\n\"You, my piece of mind, my all, my center,\r\njust trying to hold on one more day.\"\n\r\nHere he clearly defines \"you.\" He's trying to hold onto his center and not be caught up in \"treasures and flesh.\"\n\r\n\"Damn my eyes!\r\nDamn my eyes!\r\nIf they should compromise the fulcrum\"\n\r\nIf his eyes should take him away from his fulcrum (a reference to balance), then Damn them. Take away his ability to see in order to restore balance within himself.\n\r\n\"(If) wants and needs divide me\r\nThen I might as well be gone...\"\n\r\nHe defines what could take him off balance and that is his own \"wants and needs.\" If this does take off his balance, he might as well be dead (gone).\n\r\n\"Shine on forever\r\nShine on benevolent sun\"\n\r\nThis reference to \"you\" and \"center\" is related to the sun. Like a sun, shine on forever (beyond space and time). Let balance be larger than your current experience. \n\r\n\"Shine down upon the broken\"\n\r\nSome people have lost their way. In order to fix the broken from their dark side, let their center awaken in them and fix the problem. Remember, the sun is a reference to the center. He's not actually saying let the sun shine light on us and somehow be fixed. The sun is within.\n\r\n\"Shine until the two become one\"\n\r\n\"Two become one\" can mean many things, but the short version is to say that the sunlight is the answer and will fix the broken. \"Two become one\" is also a trinity (father, son, holy spirit). Son (you), holy spirit (the light within), father (god state - oneness). \r\n\"Two become one\" can also be seen as duality and oneness. Everything in this world is either a 1 or a 0 just like in the Matrix movie, it's duality (day-night, up-down, good-bad,) without it we would not have this experience. In the Matrix Neo gives up fighting his enemy and instead, lets his body merge with his enemy's. He gives up trying to make duality fight its other part, and instead lets the \"two become one.\" \n\r\n\"Shine on forever\r\nShine on benevolent sun\"\n\r\nIronic that Maynard references your balance to the sun again because right after the scene I just described in the Matrix where Neo becomes his enemy, Neo appears as a sun in the final scene. \n\r\n\"Shine down upon the severed\r\nShine until the two become one\r\nDivided, I'll wither away\r\nShine down upon the many.\r\nLight our way, benevolent sun.\n\r\nBreathe in union\r\nSo, as one, survive\r\nAnother day and season\"\n\r\nBreathe is a key word here. Breath is the whole focus of meditation and yoga which are two great techniques to finding your center and balance within duality. If everyone is following their center, we all act as one, and we survive to move forward. \n\r\n\"Silence, legion. Save your poison.\r\nSilence, legion. Stay out of my way.\"\n\r\nLegion is a reference to the group of people still dabbling in the materialistic dark side. The people who seem to be holding onto everything but still can't find what they are looking for. Their poison won't effect the speaker.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAs far as people stating so adamantly \"THIS IS ABOUT HIS MOTHER\"...ok. So what? It may resonate some feelings about the relationship he has with his mother, but it can also be interpreted individualistically, about the relationship I have with my daughter, for example. I have had moments of despising everything and everyone...but my daughter. And I never will. \n\r\nI don't really want to buy into the arguments, and I won't be arguing at all. \n\r\nHowever, it is very...ironic?...that so many \"Hardcore TOOL fans,\" insist that practically *every* song TOOL releases is about Maynard's mother. Interpreting the music that way, is not the real crime committed in and of itself...it's the added line people choose to give again and again, which is, \"A real TOOL fan would know that.\" Which is ridiculous. \n\r\nA real fan of TOOL would recognize that the band members are individual people, complex in every way as you and I (perhaps more the former than the latter), and the death of his mother is not the only thing that has ever happened in his life. TOOL should be, in my opinion, afforded more respect for their artistic abilities than this sort of pigeon-hole, so many creepy \"fans\" want to place them in.\n\r\nThe name of the band is TOOL. They are a TOOL. Sometimes for aggression. Sometimes for reflection. Sometimes used for anger. Sometimes for sadness. But, the key message in so many songs, is to evolve. Mainly to evolve past the \"Stinkfist\" manner of living, which society throws on us. And, claiming you are a \"real\" TOOL fan and others are not, because they don't point every single thing, specifically, back to the death of his Mother, is nothing but a \"Stinkfist\", in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nJambi is the name of the genie on the 80s show Peewee's Playhouse.\n\r\nThat ties in with the whole \"wish\" theme.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nFROM TOOLNAVY.COM\n\r\nI think that this song is about how Maynard was on the brink of a problem with excess and he changed for his son, Beacause his son changed him.\n\r\n--------------------------------------------------------------\n\r\nHere from the king's mountain view (I am on top of the world)\r\nHere from the wild dream come true ( Its a dream come true)\r\nFeast like a sultan, I do ( I love the excess)\r\nOn treasures and flesh never few ( money and women especially)\n\n\r\nBut I would wish it all, away\r\nIf I thought I'd lose you just one day (But I love you and would give it up)\n\n\r\nThe devil and his had me down ( I know a dark side of excess)\r\nIn love with the dark side I've found ( and I tended to like it )\r\nDabblin' all the way down ( I tried it all )\r\nUp to my neck soon to drown. ( It was starting to be a problem)\n\r\nBut you changed that all for me ( but then you came into my life)\r\nLifted me up, turned me round ( and I realized you were more important)\n\n\r\nSo I, I would wish this all away ( So I would give it up)\n\n\r\nPray like a martyr dusk to dawn ( Worshipped excess all night long)\r\nBeg like a hooker all night long ( begged for it...loved it...lived for it )\r\nShout to the devil with my song ( My Music got me all the excess)\r\nAnd got what I wanted all along ( And I got all I wanted and more)\n\n\r\nBut I\r\nI would\r\nIf I could\r\nI would\r\nWish it away\r\nWish it away\r\nWish it all away\r\nWanna wish it all away ( I wanted to leave this life in a way)\r\nNo person could hold sway ( nobody could tell me to change)\r\nOr justify my toe just a fine line (nobody could justify my being at the edge)\r\nGiving away my center ( I was giving away my energy and love )\n\n\r\nSo if I could I'd wish it all away\r\nIf I thought tomorrow, they'd take you away ( I realize now )\n\n\r\nYou're my piece of mind, ( your my focus )\r\nmy own (my own son)\r\nmy center (my new center of focus and love)\r\nI'm just trying to hold on\r\nOne more day ( I am taking it day by day..like anyone else)\n\n\r\nDamn my eyes! (damn these temptations I see all the time)\r\nJambi Eyes....\r\nDamn my eyes...\r\nIf they should compromise\r\nA fulcrum (Damn them if they lead me to stray from the balance I have found)\r\nWant and need; ( I need to be mindful of what I want -vs- what I need)\r\nif I need, ( beacause if I need the excess )\r\nThen I might as well be gone... ( I might as well not be here for you at all )\n\n\r\nShine on forever ( Let your love and spirit and who you are shine on forever)\r\nShine on benevolent son (my SON )\r\nShine down upon the broken ( Let it shine on me untill my two personas balance)\r\nShine on 'til the two become one (untill I find that balance through my love of son)\n\n\r\nShine on forever\r\nShine on benevolent son\r\nShine down upon the severed\r\nShine [on 'til / until] the two become one (see above)\n\n\r\nDivide and wither away ( If I try to keep these aspects divided I wither away)\r\nDivided, withering away\r\nShine down upon the many, light our way,\r\nBenevolent son. ( Let your love of your son heal you )\n\n\r\nBreathe in union ( So let these two aspects of myself come together)\n\r\nSo, as one, survive (And as one person survive)\r\nAnother day and season (and it will get easier day to day ...season to season)\r\nSilence legion save your poison (And temptation to slip dont speak)\r\nSilence legion stay out of my way (And temptation to slip get out of my way)\n\n\r\nI really feel like this is it.\n\r\nA few things to keep in mind :\n\r\nThe whole Son/Sun thing and Jambi being a kingdom with a sultan in Indonesia is fine...Maynard loves the dual meanings....in between sniffs/sips of coke anyone ?\n\r\nHe talks in 10,000 days/Wings about the little light she gave to him he is going to let it shine to guide her home........hmmmm letting a light shine to heal and guide someone you love dearly..... (see above)\n\r\nAlso this song before 10k days/Wings makes sense in that it is about his relationship of focus with his future (son) into his relationship of focus with his past (mom)....nice transition in my opinion....\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nen.wikipedia.org/wiki/…\n\r\nThe only reference I can really find to Jambi\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nTrexor. just cause your relatives touched you in the shower doesn't mean you have to hate everyone and everything. we won't touch your special area... i'll hit it with a fucking club though if you don't shut up.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nTREXOR, a little lesson you should've learned from elementary: if you don't have anything pleasant to say, don't say it at all. Fine, you're opinion that this song sucks, it's only an opinion. As for anyone that wants to bash TREXOR, it ain't worth it and you're no better than he is.\n\r\nAwesome song instrumentally O_O Adam outdid himself on the guitar in the beginning... it's like glue, lol. For anyone that doesn't know (someone else mentioned this in the 10,000 Days thread, kudos to them for recognizing this), 10,000 days = 27 years --- the amount of years between Maynard's mother's crippling stroke and her death. This song I think is just Maynard's way of saying \"I miss you, why couldn't you take me with you, mom?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nAwesome track, admittedly different to Lateralus, but then again Aenima was different to Undertow likewise Undertow different to Opiate. \n\r\nTool are progressing naturally, but the important thing is that they still sound like Tool, and that's something no other band can ever do.\n\r\nAnd if this \"Trexor\" Guy thinks this is a fake? He's in for a hell of a shock when he picks up the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nJambi is the name of the genie off of the old show Pee-Wee's Playhouse.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nAfter the 5:00 mark in the song, it just completely owns the rest of the way.\n\r\ndivided I'm withering away, shine on upon the many, light our way, benevolent son!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nWow, I think this is as close as we're gonna get-well said sa5ha...nice to see that someone remembers why the fuck we're all here-I'm not sure why stricktown78 even showed up...Kinda like a Vegan showing up at a BBQ...\n\r\nThe name of the sight is \"SongMeanings\"-not \"Why this Song Sucks\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nmy interpretations is as follows:\n\r\nIt's about himself, his divinity and his connection to the the \"one\". Verse one, he has it all, his dream has come true, he's accomplished his goal musically. He's overcome the \"devil\" inside himself, once in love with his dark side. He's overcome the self destructive devil. \"But you changed that all for me\" I don't believe is a person, not his son or his mother, it's the realization that he is one with the divine the divine is \"you\". He prayed and begged to receive enlightenment or collective consciousness and through his lyrics cursed and shouted at the \"devil\" the dark inside him. And then realizes he \"got what he wanted all along\" it was always there he just had to \"see\" it. \"no price could hold sway or justify my giving away, my center.\" His center is wholeness/oneness with it all, would give away all of his worldly possessions if he thought they would take that away from him. It's his peace of mind, his home, it's everything without it nothing else matters, and trying to hold onto it is the struggle because of what we see and what is all around us it is hard to hold onto that divine consciousness. \"damn my eyes if they should compromise... divide me, then I might as well be gone.\" if he lets what \"seems to be or what he sees\" separate him from what he \"knows\" then it will divide him from the divine and he might as well be gone, for repugnant is a creature who would squander the ability to lift the light of heaven conscious of his fleeting time here. The benevolent son is just metaphor for the divine light shining down upon him, \"shine down upon the severed\" all of us who are separated from each other and therefore separated from our connectedness our divinity. \"Shine on until the two become one\" until we realize that we all are one, the collective consciousness. \"Divide and whither away.\" divided we whither and suffer. \"Shine down upon the many, light our way, Benevolent sun\" show us all the way. \"Breathe in union\" \"So, as one, survive Another day and season\" As long as we are separate alls we can do is survive another day, another year. \"save your poison\" don't project your negativity out onto me save it for yourself. \"stay out of my way\"\n\r\nFor me this cd is so much more right in your face and personal, not as many hidden messages or interpretations. For ex. Vicarious, it's all right there, no hidden messages there. 10,000 days pretty raw and personal, no way to misinterpret. Same with Right in Two. Just my take on it all.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI'm never happy about the fact that this world has such a vast and plentiful supply of douche bags such as TREXOR who think that just because they say a song (or anything for that matter) sucks that the rest of us should conform to his or her opinion... Fuck you, you ignorant shit pumps and stop spammin' up the fucking comment section with that garbage is about all I have to say about those ass hats.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\n\"Its obviously about resisting satan with gods help \"\r\n1. Why the hell does everyone interpret every tool song to be something to do with god?\r\n2. No tool lyrics meanings can be explained starting with 'obviously'.\n\r\nIm not bashing religion or anything coz im religious myself, but some people just like to try to look for it everywhere.\n\r\nIts a very complex song... but i like the theory about his mother... after a couple of listens i thought it might be about his mother even though i had no idea she died or anything. \n\r\nAs people have mentioned, 10,000 days is approx. the amount of time it took for his mother to die after her stroke. It sounds like after a while he was actually maybe praying for her suffering to end (\"tempted the devil with my song, and Got what I wanted all along.\" and \"I would wish this all away\")\n\r\nThe lyrics about the benevolent sun could be a reference for him wanting her to look over him in death.\n\r\nThe title is an odd one too, but someone mentioned it was the name of a genie in an 80's TV prgramme? This could tie in with the idea of him wishing for the end to her suffering.\n\r\nThe whole album almost feels lament-ish, with the title track at the centre of that. You can really feel the emotion in maynard's voice too (but hes such an awesome singer anyways lol)\n\r\nBut hey, just my theory.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis song is about someone going through a spiraling addiction, mostly like, if not some sort of depression, but my gut tells me drug addiction, just because I've experienced that myself, and find it in a lot of Tool songs. \"Dabbling all the way down. Up to my neck, soon to drown.\" Very close to the point where the drugs are completely controlling his life, killing him even. \"But you changed that all for me. Lifted me up. Turned me round.\" I believe this is a lover, I too experienced meeting a women I fell in love with, and believed could help me change. \n\r\nPrayed like a martyr dusk to dawn.\r\nBegged like a hooker all night long.\r\ntempted the devil with my song.\r\nAnd Got what I wanted all along.\n\r\nOh, the longing to just rid yourself of the addiction (praying), yet the desperation for more (begging). And you always get what you want one way or another, usually the drugs though.\n\r\nYou, my piece of mind, my all, my center, just trying to hold on one more day.\r\nDamn my eyes if they should compromise the fulcrum.\r\n(if) wants and needs divide me then I might as well be gone.\n\r\nSo, this love is the single thread keeping him clean, the only positivity, the only light. It would be devastating to lose it, and if he goes back to drugs, he might as well be dead.\n\r\nThe next few lines of the song is basically saying this love is THE fix, and it's necessary, and it can save many more people placed in this position too. Sun being love, I can only assume.\n\r\nso as one survive another day and season.\r\nSilence, legion. save your poison. Silence, legion. Stay out of my way. \n\r\nTaking sobriety day by day is a common tactic of recovery. Save your poison, stay out of my way. The rehabilitated addict, but never recovered. Stay out of my way, because all addicts have that relapse just a few wrong moves away. Silence, legion = those many constant voices in the addicts mind calling them to use.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nin my humble opinion:\n\r\nthis song is about possession, given the name jambi (relating to a genie in a bottle)... the difference is the devil (or a demon) is the genie and the body of the possessed, the bottle (or vessel).\r\ndon't get me wrong... i don't believe at all that maynard thinks he is possessed... it's simply about the struggle with getting what you wanted.  asking for something grande, in exchange for something you didn't know you cared about, and getting something you wanted in a different way than you wanted it. (kind of ironic, but it's not a perfect world)\n\r\nin the first verse he describes what he's been given in exchange for accepting a demon.\r\nthe lyrics make use of the words \"wild\" and \"feast\" and \"flesh\".  overall, he got what he asked for.\n\r\nthe second set of lyrics describes how he achieved his status, when he tempted the devil.  it's pretty interesting that he has to beg for attention, pulling hard on the line before it snaps in your face... (that's at least how i think of it)... if you think about it, it's probably pretty hard to get the devil's attention in the present time... so many sinners to choose from (if you believe in that sort of thing)\n\r\nwhy would he want to wish this great dream away then?  because he's realized his soul is in jeopardy. his \"center\" is not justifiably given away.  he wishes he could take it away, the decision to use the demon as a way to achieve great riches and pleasures.  however, what's done is done, and there is no turning back for him now.  if he could he would...\n\r\nthe third verse relates to what his life is going through, now that he's accepted his \"prize\".  he can only hold on day-by-day... never in control, trying to balance what he wants (what he's gained) and what he needs (his soul or self, however you may think of it).  he states he might as well be gone, again, another reference to how a possessed person may feel.  separating himself from what he's done may be the death of him, and he's struggling for choices.  \n\r\nthe fourth verse is one that i fully expect debate on, being that i don't agree with what most people think the lyrics are saying.  i believe at this point the demon is in control, or he's accepted and merged with it, mocking god and jesus.  he's calling out for the benevolent son to heal the separation (earth and heaven), the same as when he was mocked on the cross, saying come down from the cross.  he's saying to jesus, \"why don't you come fix this if you can\"... the mocking of jesus is the demon in him, who's changed him. he's gained a demon but lost his soul and has learned to accept that and does it's bidding.  the part of the lyrics i disagree with is when it says \"divided i'll wither away\".  i propose that this is actually saying \"divine head a witherin' away\", mocking god, saying that he's useless.\n\r\nthe fifth verse is in the present, how he speaks to his passenger on a day-to-day basis... \"so as one survive\" it's how he's survived, being one with it... otherwise be torn apart.  he's done what it's asked him to do, cursing god breathing in union, and now he demands it stay out of his way.  \"legion\" is another reference to demon possession. \n\r\nall-in-all, i don't expect many of you to agree with me, given that if i'm right, this may be one of the most intriguing yet evil songs out there.  i also expect some cursing and name-calling.  hey, whatever helps you out.  i love tool, and this is one of my favorite songs regardless of it's true meaning.  the fact that it can be taken multiple ways is another thing that makes it a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nFirst off this is my first post and I believe MakeSense has a great interpretation.\n\nMine however differs in one main point, instead of him wishing \"you\" away he is saying he would wish it all away to keep \"you\".  In typical MJK fashion this song is an allegory to a common modern issue.  There are people in this world who have \"everything\" they have ever wanted and look back and realize there was somebody that is more important than all of it.  To me this is someone the singer loved and wanted to impress with all of their gains, and found out that who they desired has moved on to a less materialistic yet happier life and the singer realizes it but it almost too late and this is his last plea to win their heart over.\n\nAn amazing song, and I have several more interpretations coming.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nGoing to put in my perspective: he's talking about his career, he got all he wanted; he lives like a king, but it's tainted with flesh, and he's still as powerless as before he was famous. When he's saying you, I think he's talking to god. Maynard is saying he hates what he sees and it's dividing him, and he'd wish it all away if he could but there's something stopping him, and he's hoping the sun will guide him and all of us to be in union.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI think the last 2 lines of the lyrics are incorrect. I believe he say:\n\n\"Silent legion, Save your poison \nSilently just stay out of my way\"\n\nAt least thats what it sounds like to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI personally feel that Lateralus, was obviously the spiritual awakening that Maynard and the band went through which was hinted at throughout Aenima, and with 10 000 Days, whilst the focus isn't entirely on spirituality, there are still references throughout the album which encompass certain spiritual beliefs and/or understandings.\n\nSo with this song in particular, I found it interesting that the second song on the album (Jambi) makes blatant reference to the concept of monism/non-duality, and the concept of \"two becom[ing] one\", whilst the second last song (Right in Two) is all about the polar opposite, duality, which has become a common framework of understanding in Western society (ever since Descartes came up with Cartesian Duality), and \"where there's one they're bound to divide right in two\". So yeah, it's that dichotomy which I found really interesting and gave me a slightly different opinion on the meaning of the song.\n\nThe first stanza just describes the royal pleasures of materialism and economic \"success\", quickly followed by how he would \"wish it away\" if he lost the \"you\" he references, which I believe is his understanding of \"oneness\" and awareness, taking him away from a dualistic interpretation of the world and towards a sense of connection. It obviously has nothing to do with an anthropomorphized god because Maynard has made it clear that he feels... Less than fond of the traditional concept of god.\n\nI feel like the next stanza only uses the term \"devil\" as a metaphor for darkness, or loss of direction and purpose. He was a very angry and depressed individual in the beginning of their career, and he describes that stage as \"the dark side\", and it basically consumed him. \n\nEnter his state of enlightenment, where it \"lifted [him] up, turned [him] round\". Yogis, mystics, sages, and other enlightened beings have described the ego as darkness, and isn't a presence, but an absence. It is an absence of light, awareness, and once you've shed some light on the ego, its only option is to slowly disappear.\n\nThe stanza about the martyr, hooker and devil just explains the concept of \"reap what you sew\", he projected his own negativity onto everything, and in turn negativity came back to find him. \n\nThe monism concept starts showing more blatantly by \"giving away my center\", because the concept of \"being in your center\" means to be completely aware, focused, in tune with your \"nothingness (nirvana)\" beyond the ego, which most people caught on to with their mentioning of materialism. One way to keep in your center is to perform mantras, where you repeat a sound/sentence/tone/hum/whatever sick sonic manifestation you can create with your mouth, and go into meditation on that, which Maynard does with the repeating of \"give it away\", the idea of moving beyond the egoic state of mind.\n\nThe following stanza makes sense once you get all that so far, and the lyrics on this site are wrong, he says \"my peace of mind\", not \"piece\", so again the confirmation of nothingness, relaxation, stillness.\n\nAfter that, at \"damn my eyes if they should compromise the/our fulcrum\", that's a blatant comment about non-duality, a \"fulcrum\" is something which basically connects and supports pivots. We are the pivots, the fulcrum is what is beyond that, what connects us (no, obviously not a personified god), which could possibly also be collective consciousness, as well as unconsciousness. Which Maynard most likely believes in, since almost all songs on Aenima had themes of Carl Jung's psychological concepts.\n\nThe next part on this site is kind of wrong again, it's supposed to be \"[if] wants and needs divide me then I might as well be gone\", it's really such a fucking brilliant lyric, the man really is fucking genius. The use of \"divide\" to point to loss of oneness. And then the use of the concepts of \"wants and needs\", which again is mostly created by the ego, which is the catalyst for his division, loss of awareness.\n\nI don't think I even need to explain the next part at all, it's just a ridiculously beautiful visual metaphor for the sun being the light, the light of awareness, consciousness, which can connect us all, as well as the concept of duality.\n\nThe last part, \"breathe in union\", the word \"union\" again solidifies the concept of oneness, and breathing is another focus in meditation and regaining center. Thus, existing harmoniously, we \"survive another day and season\". The very last lines, it isn't \"leech, and\", it's \"legion\", the whole ridiculous system we've created which spreads its poison, all the schizophrenia and insanity of humanity. If society were to be a collective person, that person would be diagnosed as a schizophrenic, megalomaniacal, prone to murder and self-harm, power-hungry, very \"asleep\" individual. \n\nI'm going to shut up now, I talk way too much =/\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\n[Here from the king's mountain view\nHere from a wild dream come true\nFeast like a sultan I do\nOn treasures and flesh, never few]\n\nIf you've ever been one of those people who seeks status, seeks power over others, seeks attention, seeks to feed your greed and feed off the weak....or if you have been the weak....You know what he means. \n\nIf you're the sultan - the controller of exploiting another human - it is often compared to feasting on souls. Many users of methamphetamines, benzodiazipines, opiates, will often sink so low into their hole, they want to drag others in with them. As thought they are a wolf with a fresh kill, dragging it back to the den to consume all the energy it once stored for itself.\n\nNow, if you look at it from the other side of the spectrum, on the victims side, you may see something a little different. \n\nTo the victim of exploitation, human trafficking, drug use, \"Here from my kings mountain view\" - You have been brought up to his \"kingdom\" something he'd like to share with you, as your flesh is new, and he'd like to take it from you. \"Wild dream come true\" Many women, men, victims of human trafficking and exploitation are roped in by their controller. They are often told that they will make some form of fame and fortune out of their wildest of dreams. Dreams they may not have ever had before the extortion. Many of these trafficking victims are former drug users, relapsing. Their wildest dreams to come true would be to be able to use without spending anything of monetary value. Instead, they trade themself chasing a wild dream, of intoxication, of fame, of love, of appreciation, and of good fortune in life. The truth is, nothing will come of it all, except for the intoxication, and hallucinations, and hurt.\n\nGo back to the manipulators point of view. You'll see a lot of narcissism, such a classic thing in drug users and people who exploit others for things they want. \"Here from my kings mountain view\" - The controller seeks to stay on top of the victim, to drag them into a so called \"kingdom\" to see what they might want to see. \"Wild dream come true\" Many people lost to drug use will do anything they can to get theirs, to get off. A wild dream come true for one of these controllers would be a victim, who walks right into their arms, who doesn't put up much of a fight, so that this controller may \"feast on treasures and flesh never few\", ie: feast upon the soul, health, and happiness of said victim, as well as the drugs and cash that often follow such a lifestyle. \n\n\n[But I, I would wish it all away]\n[If I thought I'd lose you just one day]\n\nLets take this from the victims perspective: The victims of human trafficking, drug abuse, mental illness, often wish that they could go back in time to save everything they have lost when they are on the verge of losing every single thing they have ever had. I was a victim of human trafficking, I can tell you first hand, when I first left that life behind, all I could think was \"I would wish it all away\". Every second of it, every single day I wasted my life away, letting the rest of the world control me. I walked straight into it, and I stayed unwittingly destroying myself, everything, everyone I had in my life. I lost it all. Lost my job of seven years, lost my house, lost my job, lost my pets, lost my health, lost my family, lost my friends. \n\nFrom a controllers perspective: Controllers often realize the error of their ways as soon as they begin losing as well. When they lose their freedom, perhaps then, in hind sight, they would wish all their filthy deeds away.\n\nPeople who sink themselves so low into holes, often would do anything they could to bring back what they once had before they fell into the quick sand.\nIf you thought you'd lose it, you might have never walked into the trap. Sometimes, in your delusions, you never did stop to think of what is on the line. You won't care anymore, you won't think anymore, you're lost.\n\nControllers often do whatever they can to keep those that they prey upon in their control. Should they have made some mistake in their exploitation plans, allowing the controlled to slip away for even a minute, they'll often beg forgiveness, make their victims feel guilty, coerce victims into coming back with the thought that the victim they are controlling has no one else but the controller to really \"care\" about. Said victim usually lost everything by the point the controller slips up a bit, and so, in a way they are both wishing many things away. Feelings of guilt will often spread over both in times of withdrawal, separation, mental and physical pain. Often times the controller has nothing left to their name but the fine art of stealing souls and lives right out from under their victims. When they lose their victim, they often lose their food, their mind, their way of life. They will have nothing, and they usually want nothing more than to wish all the abuse and pain they've caused themselves and others away. Controllers are lost individuals, often individuals who have themselves gone through horrific abuses in life. They want others to feel the devastation they've felt.\n\n[The devil and his had me down\nIn love with the dark side I'd found\nDabble in all the way down\nUp to my neck soon to drown]\n\nSin. Everything that a human being trafficked might feel, is often associated with dark immoral things. Sometimes the victim may become disallusioned, they may wish to dabble further into the depths. Either by sheer deception or sheer insanity and psychosis, they often sink further down into the control of \"the dark side\"\n\nThese people sink so far into this sand pit that they've walked into, that they are up to their neck in problems. They won't survive long. They'll either die of disease, murder, suicide, overdose, or in prison. They really do rarely survive these circumstances long.\n\n\nFrom a controllers perspective; you can very easily see that a controller who is addicted to hard drugs seeks to exploit those around him for his own gains. A controller is in love with the darkside they've found. Controllers are not without their own trauma usually. Somewhere along the way they fell into the \"devils path\", dabbled themselves all the way down, to the point where they drag others into hell with them. Controllers are drowning in their own mental illness, their own sick wants and needs; they seek people out to drown, while they also drown themselves.\n\n\n\n[But you changed that all for me\nLifted me up, turned me round\nSo \nI\nI\nI\nI would\nI would\nI would\nWish this all away]\n\nFrom a victims point of view, often times they lose people they truly care about on their way down the rabbit hole. I personally had family and a boyfriend who ripped me out of the situation I had sunken myself into. If I could've controlled the addict in myself, if I could've stayed faithful to the people who really changed things and lifted me up, then I wouldn't be \"wishing this all away\"\n\n\n[Prayed like a martyr dusk to dawn\nBegged like a hooker all night long\nTempted the devil with my song\nAnd got what I wanted all along]\n\nIf you've ever been so lost that you can't tell real from fake any longer, that you have no idea what reality truly is anymore, then you'll know what its like to \"pray like a martyr all night long\" --- You're begging, pleading, hoping for some shred of truth, grace, and hope to grace you. I do not pledge to any certain religion, but in the times that I was truly scared, truly lost, I certainly wished for a god that would hear out my prayers.\n\nNow, begging for a hooker all night long truly hits home. If you've ever been addicted to drugs, especially methamphetamines, you know how this goes. Hookers will stay up 24/7 in drug induced, psychotic states, doing anything they can to make a quick buck or their next hit. They beg, they plead, just as hard as they may have prayed, for something to come along to rescue them from the come down. Trent Reznor refers to it as \"The Downward Spiral\". There is lots of contradictory thoughts and confusion that plagues the trafficked and the abusive. They want further into their situation when they are high, they want out when they are coming down, they want more when they need to blind the pain of the abuse they've dished out to themselves and dished out to them from others.\n\n\"Tempted the devil with my song, and got what I wanted all along\" \nThese people often enter these situations wishing for a high that they'll never be able to truly obtain. They get what they wanted often, through abusing themselves. commiting heinous acts, things they never would have before, in search of the high. Some people would say these people \"Want this\", in many ways they do, but when they find their way out - if they find their way out of the hole - they often realize the error of their ways and where they fell astray.\n\n\n\n[Wish it all away\nWanna wish it all away\nNo prize that could hold sway\nOr justify my giving away\nMy center]\n\nI always said, and many people always say, especially drug users; they start out saying that nothing could cause them to fall into the trap of human trafficking and escorting. They often claim that nothing could sway them into such a lifestyle, however manipulation, drugs, and mental illness are usually enough of a combo for someone to give way to their controllers wishes. The victim is essentially signing their life into their controllers hands, who exploits them for their wishes, their treasures and their need for new flesh. Giving your center away, to me, means giving up your moral values to your addictions and your kryptonites.\n\n\n[So if I could I'd wish it all away\nIf I thought tomorrow would take you away\nYou're my peace of mind, my home, my center\nI'm just trying to hold on\nOne more day]\n\n\nOnce again, in between being so high up and being so low down, these victims will often wish that they could take all of this pain away and go back to being the more stable person they once were. Whether it be going into the past, or finding their next hit they are wishing many, many things would be different. They are confused about the circumstances they've trapped themselves in. Often times drug users have lost heir mental and physical health, they are literally hanging onto life and reality by a very frayed, thin, thread. Thus, they are holding onto life itself, the people they love, and the things they love with a shaky, clammy palmed grip. They know they are losing all of this at a fast rate, and they are just clinging to what they can. Clinging to what sanity they have left.\n\n\n[Dim my eyes\nIf they should compromise\nOur fulcrum\nWants and needs divide me then I might as well be gone]\n\nIf you've read this far into my explantation, I feel this part explains itself well. The escort, victim of trafficking, controlled, eaten, beaten new flesh just wants to close their eyes to it all. \"Dim my eyes\" reminds me of the feeling of nodding off into oblivion on opiates. I didnt want to see the hell I had created with my abuser, in a way, I would've rather been dead than in the state I was. Being lost in this lifestyle, this drug addiction, the abuse, divides a person. It tears the good from them, leaves the bad, thus dividing their life into small pieces, some of which they truly will never get back. The wants and needs they used to have, when they become sober and are out of the manipulative situation, these acts they look back upon...often times they'll wish they were just gone, that they would have died, they rather would have been gone, they feel as though they are nothing. Compromise of the fulcrum, just further proves, they are sinking themselves further and further into the hands of abuse and insanity. Like sitting on a rocking teeter totter, the victim will stand on the edge, waiting for something to tip. Waiting to further spiral down into their hole, watching themselves dig a grave for the person they once were before this began.\n\n\n\n[Shine on forever\nShine on benevolent sun\n\nShine on upon the broken\nShine until the two become one\n\nShine on forever\nShine on benevolent sun\n\nShine on upon the severed\nShine until the two become one]\n\n\nWhen you start to see the error of your ways, how you fell into this trap, and perhaps a glimpse of a way out, it is as though seeing a light of hope. A brief glimpse, you hope for this truth to shine through. For this truth to seek out the part of you that you have now buried underground, that your controller has helped you to stow away. If you've ever thought of an angel ascending into heaven, I think of this as a beam of light descending into the grave, a person who once cared about the victim might be this beam of light and hope. Said savior may still see the good side that the controller has buried of their friend or family member. They may seek to reunite the broken pieces of this loved one they once had, that was lost to drug abuse and sexual exploitation.\n\n\n[Divided I'm withered away]\n\nSimply put, once one side, the addicted side, the exploited side of the victim has overtaken that good side, everything around them truly begins to crumble down upon them. Pieces of their soul, their mental health, their physical being are slowly being stripped as though they're poured hydrochloric acid all over themselves. They are withering, the good in them is slowly becoming annihilated by the callings and wantings of this devil within them. They have realized, once they've lost everything, and catch a few glimpses of the hell they've helped to create, that they are dying slowly. Drug abuse, sexual abuse, exploitation, it's all a form of slow suicide. The you that everyone once knew, has withered away.\n\n[Shine on upon the many, light our way\nBenevolent sun\n\nBreathe in union\nBreathe in union\nBreathe in union\nBreathe in union\nBreathe in union\nSo as one survive\nAnother day and season\n\nSilence, legion, save your poison\nSilence, legion, stay out of my way]\n\n\nMany, many, many people fall victim to human trafficking and drug abuse. It is not as uncommon as the general public wishes it were. This person who has realized the error of their ways, who has been saved by the light and the way of good, wish for no one to ever go through the hell they dragged themselves into. They realize that there is no one who deserves that sort of torture, no one, often times not even the person that abused them.\n\nMany seek recovery, many seek to help others. I can tell you, from the drug addiction and sexual exploitation I have experienced in my young life, I wish that upon no one. I do, however, wish to silence those who do wish for these hells to be brought upon others. My controller was seeking to drag me into his pit, he succeeded, and we dragged others into the pit together. Soon, though, I was ripped out of this by the light, my friends and family who decided to drag what was left of me out of the self-made grave he and I had dug for ourselves and others. I thank them every day for saving me, and I wish nothing more than to stop others from doing what my controller and I did to ourselves.\n\n\nI'm in recovery now, and I can see this song being sung from so many points of view, mostly though from a victim of drug addiction and human trafficking.\n\nJust my .02$\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI love this song... Very unique among the other Tool songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nTuneeeeeeee, get the lyrics for the pot up\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nyou suck whoever sais this song sucks.... how can you even produce such words to criticize tool\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI wonder why the song is titled Jambi? I've been thinking, but I can't come to a conclusion. I would have to say this is one of my favorite Tool songs, it's amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nahhh, isn't subjective nature of reality grand... i have in my hands a great CD filled with great music... and even the possibility of another one in a few days...\n\r\nTrexor on the other hand, has a cd full of crappy songs that he hates... and he might not have anything more coming... what will he think then?\n\r\ndid you ever think that all this controversy was to make people doubt the validity of the leaked album... make them doubt it up til the last second?\n\r\n have you heard any alternate track listings or album names? because the packaging has been made... printed... and shipped off to distributers at this point... HAS ANYONE HEARD ANY OTHER LEAKED TRACKS, TRACK NAMES, ALBUM NAMES, ANYTHING?\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\noh dear... it seems the word is in from the auzzies and kiwis... the album is selling fast...\n\r\n10,000 DAYS IS THE REAL DEAL... THE LEAK IS NOT FAKE... THE FAKEOUT IS FAKE\n\r\nHey TREXOR ... 'foot in mouth and head up ass, so whatcha talkin' bout'... eh?\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nJambi is in Indonesia....Sumatra. the guitar work is nice.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nwow, we Tool fans are gonna miss you...\n\r\nTREXOR, the only reason you don't like this album is cause you were convinced it was a hoax from the beginning...\n\r\nIT IS SELLING RIGHT NOW IN NEW ZEALAND AND AUSTRALIA... IT IS NO HOAX... 10,000 DAYS IS WHAT WE'RE GETTING... \n\r\nbye bye now TREXY\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nfuck the guitar, the bass is incredible.\r\noh, by the way, what the hell is he talking about?\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nthis aint a hoax...for gods sake look at all the artwork adn shit...how can it be a hoax..it's real music from them, obviously, with thier usual weird art..adn this time with cool glassess adn 3d pictures! i'm australian, i got it yesterday, it's reall goddammit, adn what the hell is with this hoax concept...\r\nif this entire album does relate to maynard's mother judith, then it could be a representation of how he has become so consumed by it, her life, suffering and death...\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nTREXOR, why would you say such things about this song? It's awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\ncan anyone ban trexors ip? due to he has no standable interpretations other then \"this album sucks\".\n\r\nit kicks ass by the way. jambi could be the plural of a metrik style \"- =\" but i cant refer it to the song\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nif u didnt notice TREXOR, xdvr was talking to u. damn, u r narrow minded.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nwut do you know trexor ITS THE REAL ALBUM, its been formally released in north america and guess wut? ITS AMAZING!!!! guess all of your stupid bullshit argueing, theories and criticism went all to fucking hell u stupid shit\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI bet trexor has done this before in the past with the other Tool albums that wernt released yet.  \n\r\nEverything you need to know about the whole album is on WIKIPEDIA.  Search it up.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nJambi was/is Pee Wee's genie that would wish him whatever he wanted (\"I would wish this all away\"). Jambi is also a providence of Indonesia.\n\r\nTrexor, this would be the best hoax i've ever HEARD and HELD...\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nMaybe I am being too superficial with this, but one layer to this song could be Maynard's relationship with his son.  Maybe this is too obvious a conclusion... ie: \"bonevolent son\".  My initial impression was that of Maynard, living quite comfortably \"feast like a sultan\", \"treasures of flesh\", but he would be willing to give everything up in a heartbeat if it meant losing his son.  That is just how it rubbed me...\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nbearcules\r\ni think u nailed on of the layers of the song head on\r\nalso \"your my peace of mind, my home\" could have to do with that\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nCould this song be, atleast partly about Maynards mother?\n\r\n\"But I, I would wish it all away \r\nIf I thought I'd Lose you just one day \"\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nOne of the most artistic experiences I have ever encountered. The perfect marriage between Aenima and Lateralus. \n\r\nTREXOR, we all know what you think of the CD, and if you can't appreciate the exquisite art behind TOOL's new \"10,000 Days\" opus, then you weren't really a TOOL fan to start. True TOOL fans will evolve with the band. You are allowed to dislike it just as everyone else that has posted is allowed to enjoy it.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nitm doesnt sound as much like he's morning as some of the other ones about his mother do, so mebbe it is about his son. but he could b considering how it would b 4 his mum 2 lose him considering she was a devout christian, so if she is in heaven then yeah. (remmber though, mjk is massively anti organised religion but it could show his respect 4 her and therefore her beliefs, however different they are from his). the lines \"shine on forever\" sound like its about her in 'heaven'. hmm sunds a bit frustrated @ the end...\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nTrexor, I completely respect the fact that you don't like this album, but could you give us specific reasons instead of just going around saying shit like \"It sucks! You go to hell bitchez cause I'm SMRT! Haha!\"\r\nSeriously, I wouldn't be surprised if you actually did say that, but anyways, if you're going to badmouth the album, give reasons.\r\nThis goes for anyone who posts on any part of this site.\n\r\nYou're more than welcome to hate any music you want, just tell us why instead of just saying \"It suxs!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nWell put The_Drummers_Angel.  Great song, shows alot of strong emotion.  It almost sounds like he is describing a \"born-again\" experience that he no longer wants to burden him.  Just a guess though. Awesome bass though.\n\r\n\"Silence leech, and say your poison \r\nSilence leech, and stay out of my way\"\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nHaha, ya'll should click on the \"born-again\" link.  Pretty funny stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nI love this song. The part when he sings \"...shine on forever...\" is such ownage.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nJambi was the genie from pee wee herman. He was blue and looked like jay leno. He granted pee wee a wish once a day.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nIf you notice in Wings for Marie, and 10,000 Days, Maynard sings about his soul being saved by his mother, which shows a spiritual side of Maynard. Maybe he beleives in God.\n\n\r\n[Here from the king\\'s mountain view \r\nHere from the wild dream come true \r\nFeast like a sultan I do \r\nOn treasures and flesh, never few]\n\r\nMaynard is talkin about his life now.\r\nHe continues to say that he would wish it all away if he knew that he would of lost his mother (assuming he is talkin about his mother)\n\n\r\n[(The devil with his had me down) \r\nIn love with the dark side I\\'d found. \r\nDabble in all the way down \r\nUp to my neck soon to drown.]\n\r\nHere he talks about his past, and how involved with the dark side he was to the point of \\\"drowning\\\". \n\n\r\n[But you changed that all for me \r\nLifted me up, turned me round ]\n\r\nOnce again, Im going to assume he is talkin about his mother in this one.\n\n\r\n[Prayed like a father dusk to dawn \r\nBeg like a hooker all night long \r\nTempted the devil with my song \r\nAnd got what I wanted all along]\n\r\nI think after his mother died, he HAD to accept God. H prayed she went to heaven.\r\nHe tempted the devil by his old music with the whole anti-christian attitude and got what he wanted (to be in a successful band).\n\r\nI could continue over analizing every lyric, but I doubt anyone would agree with me anways, so I\\'ll stop here.\n\r\nFlame away.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nx1himynameiseric: My thoughts exactly.\n\r\n\"Dim my eyes if they should compromise \r\nOr fall from what sin need you find within \r\nI might as well be gone \"\n\r\nWith Dim my eyes, I think he says he must ignore the logic of atheism, so that he can believe in God and his mother's ascension.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nMudvayne guy, u got it right on. We're all allowed to enjoy this album, just as others are allowed to dislike it. Trexor, you remind me of my ex-boyfriend. He loved giving short, snappy answers to people to make himself look intellectually superior. The whole, 'I know something you don't' thing. You may have your own ideas and opinions which to you are correct, but your head appears to be so far up your own ass that you're not expressing them in a way that people can actually give a shit. That's unfair to others, who are actually here to discuss things and listen to different interpretations maturely.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nYou know he's right. You tool fans often state your opinions as fact, and if someone gives an opinion that does not coincide with your own, you are always quick to say \"Keep it to yourself\" or \"if you don't have something nice to say, don't say anything.\" Children, this is not how the freedom of speech works. Just because you don't agree with someone doesn't make them right or wrong. What the fuck do you care if this fellow doesn't like the album? Did you write the album? Do you think the people who wrote the album care? No, they don't. You chump stains really need to grow the fuck up, already. It's only a band.\n\r\nAs for the song, the title is, no doubt, in reference to Jambi the Genie. That is why there is that whole wish theme. Tool are nerds, if you hadn't guessed already. They dress up in full costume and go to Star Trek conventions and people don't even recognize them, so why is it so hard to digest that everything they do doesn't have to be something important? Why can't the song title be in reference to Pee-Wee's Playhouse? I suppose you're the kind of dumbass tool fans who will tell me Maynard's Dick has some deep link to quantum immortality or some bullshit you really don't know anything about, but pretend to know about.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nDon't worry about jackrules and TREXOR-they were dropped on their heads when they were babies. They still act like babies too. Losers.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nholy shit! if you go to Wikipedia, it actually says Jambi is a Tool song....... .....cool\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nJust noticed a flaw in the lyrics posted here... it should be...\n\r\n'Pray like a martyr does, all night long...'\n\r\nanyway, i've decided to take a stab at guessing what the song's about... or at least one of the themes... which seems to be fame, and expectations from fans, in relation his son...\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI agree with egb that this song refers to his relationship with Devo. It seems to me, from what I have read and seen, that Maynard goes to great lengths to keep his personal life still somewhat personal. I've read that he does this for his son, so he can be a normal dad and not get mobbed every time he walks out the door. Not exactly in those words but you get the point. I think it is about the balance between Rock Star and Good Dad and how his son is the most important part of his life and that he would give up the rest, if he could, if it ever meant losing Devo in anyway.\n\r\nOh and I think that it is ~ benevolent SON ~\n\r\nOh yeah and one more thing, the beginning of this song....exhilarating!\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI always thought instead of \"in love with the dark side I found\", it was \"eleven the dark side I found\", because didn't his mother get sick when he was 11? Isn't 11 extremely important to Maynard...ya.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nIt's \"pray like a martyr dusk to dawn.\"\n\r\nDim my eyes\r\nDim my eyes\r\nDim my eyes if they should compromise\r\nOr fall from what sin need you find within\r\nI might as well be gone \n\r\nI always though it was Jambi I...\n\r\nI think Jambi is a genie.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nive never seen the genie show you guys talk about but the first time i heard it i also thought the last part of the lyrics were:\n\r\nSilence leech, and save your poison\r\nSilence leech, and stay and rub my.. way?\n\r\nwell, or something. not at all sure but i think i hear the word rub there.. still makes no sense if it is rub my way.. i guess. or well.\n\r\nbesides that i love the song. might be about how he learned to appriceate his son even more after his mom died (in a new perspective or something) or maybe its about this sultan in indonesia, allthough i doubt it, since Tool seldom writes about a specific happening, but rather about wide stuff. my 2 cents. peace, and The Pot rules the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nthe lyrics posted here are not correct.\r\nthey TRULY are:\n\r\n\"Hear from the king's mountain view \r\nHere from the wild dream come true \r\nFeast like a sultan I do \r\nOn treasures and flesh, never few. \"\n\r\nand\n\r\n\"The devil and his had me down \r\nIn love with the dark side I'd found. \r\nDabblin' all the way down \r\nUp to my neck soon to drown.\" \n\r\n(whoever posted this got these next parts VERY wrong)\n\r\n\"Prayed like a martyr dusk til dawn \r\nBegged like a hooker all night long \r\nTempted the devil with my song \r\nAnd got what I wanted all along\n\r\nNo cross you could hold \r\nSway or justify my giving away \r\nmy center\r\nSo if I could I'd wish it all away \r\nIf I thought tomorrow would take you away \r\nYou're my peace of mind, my home, my center \r\nI'm just trying to hold on \r\nOne more day \r\nDim my eyes \r\nDim my eyes \r\nDim my eyes if they should \r\nCompromise our fulcrum \r\nWant and need divide me \r\nThen I might as well be gone \r\nShine on forever \r\nShine on benevolent Son \r\nShine down upon the broken \r\nShine until the two become one \r\nShine on forever \r\nShine on benevolent Son \r\nShine down upon the severed \r\nShine until the two become one \r\nDivided I'm withering away \r\nDivided I'm withering away \r\nShine on upon the many \r\nLight our way \r\nBenevolent Son \r\nBreathe in union \r\nBreathe in union \r\nBreathe in union \r\nBreathe in union \r\nBreathe in union \r\nSo as one survive \r\nAnother day and season \r\nSilence leech, and save your poison. \r\nSilence leech, and stay out of my way.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis sheds a new light on the song \n\r\n\"Light our way \r\nShine on forever \r\nShine on benevolent Son \r\nShine down upon the broken \r\nShine until the two become one \r\nShine on forever \r\nShine on benevolent Son \r\nShine down upon the severed \r\nShine until the two become one \r\nBenevolent Son\"\n\r\nSurely he means Christ, as the word Son is, indeed, not sun and it is capitalized. He calls Him the Light that guides our path, and the Good Book says that Christ is the Light of the world.(Light is also capitalized)\n\r\nMaynard James keenan, however, has come out against Christianity in the past, and even admitted to being a ritual magician. But, its true that he was brought up as a Christian and that his mother was one, a very devout one. It seems that he has dedicated an entire album to her and her suffering, as mostly every song is about Judith Marie, his mother.\n\r\nIt seems that because of her death, he has \"given up\" the Magik and realized it as evil, hence the line\n\r\n\"The devil and his had me down \r\nIn love with the dark side I'd found. \r\nDabblin' all the way down \r\nUp to my neck soon to drown.\" \n\r\nHe then goes on to say that the Light (Jesus) led him up and turned him around. There are more examples on the album, and i will continue to post them\n\n\r\nP.S.\r\nFor anyone who has noticed the recurring theme of 11's in Tool's music, chew on this \r\nJesus Christ has 11 letters. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nThat was very interesting DIS. I hadn't even thought of that.\r\nThanks for posting the correct lyrics also!\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nYou are very welcome! I thought it was very annoying to see that the lyrics were off THAT much.\n\r\nHere's something else: Maynard James Keenan has written other songs about his mother, Judith Marie Keenan. 27 years ago, she had a stroke and, tragically, was left paralyzed. MJK wrote the Perfect Circle song \"Judith\" about his mother. (Notice its her name) In this song he, much to both my shock and dismay, curses our Lord and blames Him for her tragedy. Here is the song \"Judith\":\n\r\n\"You're such an inspiration for the ways\r\nThat I'll never ever choose to be\r\nOh so many ways for me to show you\r\nHow the savior has abandoned you\r\nF*** your God\r\nYour Lord and your Christ\r\nHe did this\r\nTook all you had and\r\nLeft you this way\r\nStill you pray, you never stray\r\nNever taste of the fruit\r\nYou never thought to question why\n\r\nIt's not like you killed someone\r\nIt's not like you drove a hateful spear into his side\r\nPraise the one who left you\r\nBroken down and paralyzed\r\nHe did it all for you\r\nHe did it all for you\n\r\nOh so many many ways for me to show you\r\nHow your dogma has abandoned you\r\nPray to your Christ, to your God\r\nNever taste of the fruit\r\nNever stray, never break\r\nNever---choke on a lie\r\nEven though he's the one who did this to you\r\nYou never thought to question why\n\r\nNot like you killed someone\r\nIt's Not like you drove a spiteful spear into his side\r\nTalk to Jesus Christ\r\nAs if he knows the reasons why\r\nHe did it all for you\r\nDid it all for you\r\nHe did it all for you\"\n\r\nHe says that she was an \"inspiration for the ways that I will never choose to be\" and that she was\"abandoned\" by the Savior. Maynard had lost his faith when his mother suffered her stroke and she became paralyzed, 27 years ago.\n\r\nThis brings me to my next point, which is like an epiphamy(i think thats spelt right)The latest Tool album, 10,000 Days, shows evidence that MJK has changed his ways(please, just look at the other song lyrics)Jambi, Wings For Marie, and yes, 10,000 Days talk about his mother, and her return to the Savior. He even says in 10,000 Days:\n\r\n\"Fetch me the Spirit, the Son, and the Father\r\nTell them thier pillar of Faith has ascended\"\n\r\nNow, it gets wierd.  Judith Marie, his mother was paralyzed for 27 years... or 10,000 days.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nRight on JackRules.\n\r\nI like this song, as with most tool. I don't mind if Tool's sound evolves because they always do it well.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\n\"(Notice its her name) In this song he, much to both my shock and dismay, curses our Lord and blames Him for her tragedy.\"\n\r\nCurses our lord? Don't speak so loosely. I have noticed several lines in the cd that sound as though they could be referencing religious meanings, but I doubt MJK has \"found Jesus\". \n\r\nIf this song is suppose to be about how MJK believes in this religious garabe now, then ending the song by saying  (Silence leech, and save your poison.\r\nSilence leech, and stay out of my way.) is kind of contradicting what your saying.\n\r\nAlso note in Judith he says (inspiration for the ways that I will never choose to be), note that he says NEVER choose to be. \n\r\n\"Fetch me the Spirit, the Son, and the Father\r\nTell them thier pillar of Faith has ascended\"\n\r\nI personally think that in this line he just means if what is mother believes to be true is true, then she is ascending to heaven.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI got the impression from those lines that he was referencing his mother's beliefs, not his own. Despite what Maynard himself believes, he always respected how his mother held true to her beliefs throughout her entire life. To me, The Pot is about the hypocricy of the other people in his mother's church, who Maynard grew up seeing as entirely fake. He has said that he is not against the beliefs of Christianity or any religion, but he is against the organization and heirarchy of the modern church. So I don't think this cd shows an epiphany in any way.\n\r\nOh, with Jambi, when I listen to this song, I got the impression that the \"Shine on..\" lines were from Maynard's mother herself. She tells him to \"Shine until the two become one.\" I think this is about the same thing as \"Right In Two.\" That Maynard's mother wants him to devote his life towards bettering mankind. \n\r\nI don't know, this album has evoked so much thought from me and seemingly everyone on this site, so to me this is the best album to come out in a long, long time.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nHave you ever considered that the references to the leach could be referring to the devil or satan whom he references in the song by name \"Tempted the devil with my song,\" and alludes to elsewhere \"The devil with his had me down) \r\nIn love with the dark side I'd found. \r\nDabble in all the way down \r\nUp to my neck soon to drown.\"\n\r\nI think he is speaking of how the devil drug him into the hole that was atheism and that he fell in love with what he found there for a time. In my opinion the leach that he is referring to is the devil standing in his way or obstructing his path to God. \"Silence leech, and say your poison \r\nSilence leech, and stay out of my way\" In my opinion this is Maynard placing his own wording on the same sentiment Jesus expressed when he said \"Get Thee Behind Me Satan.\" \n\r\nIn my opinion, while Maynard may not be ready to pick up a hymnal and start singing; his once steadfast atheism has at least been shaken. I sight as evidence from 10,000 days \"Set as I am in my ways and arrogance, Burden of proof cast upon non-believers. \"  To me there is no disputing that he is saying here that while he may not be a believer, at the very least the burden of proof is no longer on christians because his mother's experience and ascension was all the proof he needed. Instead from this point forward the non-believers, whom he used to be so quick to side with, now have the burden of proving to him that he should continue in his atheism. \"Never took a life but surely saved him.\" Could be very literal, she saved not his mortal life but perhaps the eternal life of his soul to come after this one. \n\r\nAt the very least I think people have greatly exaggerated Maynard's hatred for God. In reading his lyrics and watching interviews, it has always struck me that his primary objection has been the type of people who follow God rather than the faith itself.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\n^^Maynard's not Trent^^^\n\r\nhe's never been an atheist, or against god, or whatnot... if you listen carefully, in each and every interview where the subject of religion is breached, Maynard's gripe is with the structure of organized religion... the 'middle men'... the people who use faith to control people...\n\r\nhe's always been pretty spititual, agnostic to be sure, but the belief in a higher order of some kind is there...\n\r\nanyway, i really think (even though this isn't really the place for it) lyrics like \n\r\n\"Set as I am in my ways and arrogance, Burden of proof cast upon non-believers. \"\n\r\nis more a reference to the fact that 'true believers' (like his mom was) don't need to prove anything to those who don't subscribe, it's more like their burden to prove otherwise... get it?\n\r\nhe's hasn't become a christian... but you don't need to be to respect and accept someone's faith...\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nPlease could people remember not to justify their own POVs through Tool songs. It is well established that MJK is and never has been in his adult life a believer of Christ, yet alone a re-born Christian. His opinions from Opiate regarding organised religion have never swayed.\n\r\nHowever, Maynard, like the logical minority in the world, is not simply atheist or dogmatic (which are ostensibly hypocritical in their perspectives...the pot?) but rather an atheist; he is aware that we cannot prove or disprove God or the reliablility of a repeatedly transicribed, and therefore unreliable, text.\n\r\nBut here is my 2cents anyhow, from what I have understood from the past ten years: MJK is outstated in his spirtualism and respect for fellow man and the world, as every right minded citizen should be. This is the essence of most Tool songs, and I believe that in general, one of the gripes that the band has is society's ideal that 'Religion makes good people' and 'infedels are inherently worse people'. \n\r\nSociety affords religion no responsibility for all the harm it does. Similarly, mass society does not see how individuals can be good, moralistic people without following a questionable source material.\n\r\nThe tension in Tool's music is predominantly built on the premise that the world can be a better place if we concentrated our love on that for each other and not on God (if He does exist we are loving him by loving his creations anyway). In my opinion - an opinion fostered in part through some of Tool's music and my own experiences - the majority of organised religion is more selfish than it is holistic in that it joins people together vicariously through some intangible hope instead of actively doing good in the outside world.\r\nI think that MJK's general statement is that by finding our own spirituality within ourselves, we will gain mutual love and respect and only then is the world going to be a better, less hypocritical place.\n\r\nI know this is more of a general analysis, and definately more in relation to 'The Pot' than with 'Jambi', but just thought I had to say that. It makes me pull a funny face when people claim MJK to have found the Saviour Jesus: The saviour he has found is himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\n^^^ (golf clap) ^^^ well said...\n\r\nexcept where you said... '...but rather an atheist' ... i think the word you were looking for is agnostic, being as you said just before that that mjk was NOT atheist... but yeah, well said, sums it all up pretty well...\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nFINALLY AN ACCOUNT NOW I CAN RIP ON TREXOR ALL I WANT CUZ HE KNOS DAMN WELL THAT TO HAVE AN OPINION ON ANY OF THESE SONGS THAT HE HAS TO HAVE HEARD THEM WHICH MEANS HES JUST SOME LOSER WITH TO MUCH TIME ON HIS HANDS RIPPING ON WHICH IS PROBABLY ONE OF THE GREATEST BANDS EVER!!\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nWow, I really appreciate all of you people responding with such dilligence! However, let me get a few things straight:\n\r\nFirst of all, I never said definitely that MJK had changed his ways, rather that there was a somewhat overwhelming evidence that he has done so. I have to say i might not be right, but i could be.\r\nNow, you must admit, even if you dont think that Maynard has changed his ways, he at least questions them now. \n\r\n\"Also note in Judith he says (inspiration for the ways that I will never choose to be), note that he says NEVER choose to be.\"\n\r\nIs it even POSSIBLE that he can change? Its easy to think that he does in fact mean never, but this song was written several years ago, before the death of his mother, and before he had time to think it all out.\n\r\nI am a Christian myself, and the one thing i hate most of all are those pious hypocrites and \"ignorant flippants\" of the church, probably even more than those who arent one. Maynard described it accuretly as the collective Judas, for the ones who betray Christ are the ones who say that the love Him while they dont show love to thier fellow man, they judge while they shouldnt, and who are ever the hypocrite.  Look, Jesus Himself was mostly about how hypocrites like those cause people to turn away from God, so what i think is one of Gods major complaints is how those who claim to be followers of Him neglect His word to the point that they cause others to turn away from God for what has been done unto them.\n\r\n\"Let he who is without sin cast the first stone\"\r\nI try to live by that and it reminds me that, sadly, there are people who claim to follow the path of love, compassion, and forgiveness, but are the first to pont the finger, the first to pick up a stone.\r\nMaynard has, and I mean this as the most respectable of complaments, more faith than many believers because of how he preaches the love of one's fellow man, because he underlines basically the teahings of Jesus, that to love your fellow men and serve them is to serve Him. I agree with danger TH14 that you dont have to follow a religion to be a great person and a respectable, decent human being.\"how you treat the least of you is how you serve Me\" Overall, i think that if Maynard isnt a Christian, his messages are.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nIMO organized religion is a joke, people should think for themselves and make up their own minds about religion and not have it done for them. Why can't people believe certain parts of the bible, but not all of it? People need their own views an interpretations, not just what their parents and society shoves down their throat.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nThis song seems to be one of the classic \"...wha'?\" kind of songs where literally anyone could have any meanign they wanted for it. Personally I see it as almost a love song, where the narrator is so attached to one thing that he is supported by it and guided by it. This could be their country (like the sultan of Jambi did until he died), a person (Maynard's mother/son, whichever suits you) or a religious figure (which is viable, although I don't really see it). Whichever you choose, understand the fact that Maynard has shed his wisdom on us, and we need to appreciate, understand, accept and then implimetn whatever we learn. (PS seeing them live!!!!!!!!)\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nonce again DISGUSTIPATED (iroinc name for a christian considering the content of that song)... you've missed the point... there is a clear-cut difference between being agnostic (spiritually aware) and subscribing to a dogmatic religion like the baptist church (of whom mjk's mom was a member)... or any organized religion where one requires an intermediary to speak to a deity...\n\r\na common theme throughout all religion is an underlying message of compassion. saying that messages of this manner (from mjk) are christian only goes to show the shallow logic that followers of any specific faith get trapped into.\n\r\nto be sure, there is a lot of christian symbolism in tool's music, but there's also a lot of buddhist, hindu, even muslim symbolism, not to mention jungian, freudian, quantum psyiology.... well, i could go on and on... \n\r\npoint being it's ignorant, not to mention a bit arrogant, to assume that because you relate to his messages that he's 'preaching your gospel'... so to speak...\n\r\nif there's any god being referenced in tool's music, it's the god that exists in us... in our infinite potential for compassion and goodness... in our ability to reason...\n\r\nmjk's views towards christianity haven't changed since Opiate... many people would assume it's just ragging on religion in general, and calling 'believers' idiots... when in reality it's criticizing those who use faith to control the lives of their followers...\n\r\norganized religion is about keeping people small, weak, helpless (deaf and blind and dumb, if you will)... what mjk's talking about is something much greater than anything christianity has to offer, and that's the facts...\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nNo, I dont think that i have missed the Point. I call those who control others through a religion for what they are: evil. I KNOW that there are many different religions being referenced in Tool's music, and thats great, because in order to understand yourself better, it helps to look through someone else's eyes.\r\nNow, for you to say that disgustipated is an odd name for someone who is a Believer, well, i just don't agree. That song is about people who are insane, using the cover of a pulpit to preach thier perverted and dogmatic ways-ways that have nothing to do with a religion but are connected to it because those crazies do so by taking God's name in vain- for personal gain. What comes to mind(and its a little off topic, lol) is that one episode of South Park where Cartmen pretends to be a preacher to get money. And there are plenty of real people out there like that. Come on, who hasnt seen that one \"preacher\" on t.v. with his \"miracle spring water\" that will cure you because \"God told him to sell it to you\" That is horrible, and I am, as well as a majority of Christians, againt fools like that, and its true that it is people like that who cause others to turn away. But please, I ask you, look beyond that, and you will see the Light. Just look at the Middle East right now-people are twisting and perverting a loving and peaceful religion and killing many innocent people in the name of thier beliefs, and even in the name of God. But only a minority of Muslims use a loving religion to kill- my point is, do you honestly believe that this is the will and work of God? NO, it is MAN who does evil, and unfortunatly, some of the most horrific things have been done in the name of religion and in the name of beliefs. But on the other hand, religion has also done some of the greatest things for mankind, so you cant say that religion and beliefs are what is responsible for evil, because the most dangerous belief, the most sinister idea is the lack of one. Ignorance fuels the fire of hate. Hitler, for example, was completly against Christianity, and look what he did. He was brought up to be Christian, but at a young age, something horible happened and he turned against it, he turned to the dark side of himself. Its well known that Hitler, and Stalin too, were both huge narcissists, and even Megolamanics. Hitler saw himself as the father(of germany, and all of mankind, for that matter), he controlled people's minds, and was the closest thing to the devil incarnate-but remember, he shared the idea that beliefs were dangerous. Look, all im trying to say is for you to look past all of the darkness, all of the hypocracy, and all of the other evils, and maybe, just maybe, you will find that all of religion is not bad, that people are still good at heart, and that fullfillment can be found, you just needonly to look up...\r\nWe all have a third eye, and i can say that mine is open, and it was opened by the Light\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThis song and CD is amasing. Tool is one of the only bands out there that I know can sound different but their core style of play never changed. The guitar whail in this song is unbelievable; it gave me goosebumps it was that good. Danny Carvey still proves he is the best at the drums too. As far as this CD being fake... I went recently, May 13th, to a Tool concert where they played this song. It was just as kickass as the song on the CD. Tool obviously produced this song.\n\r\nThe long wait for this album was worth it! It rocks!\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nthe message of this song is clear:\n\r\ngod rulez j00\n\r\nsux4u nub\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nOf course i do, but that isnt reason itself to stop believing. I agree that beliefs are dangerous, but not all of them are. Remeber that movie Dogma? Well i think that Chris Rock said it right, that \"beliefs are dangerous, and its hard to change a belief, you shouldnt have beliefs, but rather IDEAS\" And, no, I dont need the threat of Hell to \"scare\" me or the reward of Heaven for me to live right, i do it for it is commanded and expected of me. Christ said \"If you love me, you will obey my commandments\"\r\nI dont know about you, or if you even believe in God, but i do and the God i believe in dosnt \"advocate the enslavement of your enemies\"\r\nHow can you say that? Have you never heard \r\n\"It has been said 'hate your enemeis and love your friends', but I tell you, LOVE your enemies and pray for those who persecute you\"?\r\nNow, I am a devout Christian, but I dont go to Church every Sunday, and I can tell you why- The church that i would go to was full of the types of hypocritical congregants that Christ preached so fervantly against. I left that Church and, rather than abandon my own faith, i sought a more personal relationship with God, because afterall Christianity was never meant to be a religion, but a relationship with Christ. I TOTALLY agree that a large part of organized religion is, for lack of a better word, flawed. Again, i will use a movie as an example, Stigmata made an excellent point (if you havent seen it, do so) it talks of a gospel that was written by Christ himself (i think that the movie was based at least partially on the gospel of St. Thomas, that isnt in the bible because the catholic church deemed it as \"heresy\" due to its view of the church, or rather, the lack of one) in this gospel, it talks  of how the kingdom of God is inside you, and all around you, and that a church is merely  wood and stone. This basically agrees with what is in the New Testament, but anyway, my point is, you dont need a church to love and serve God, you dont need a man in a collar to tell you that your sins are forgiven, as only God can do that, and you don't need any man to serve as the \"middleman\" between you and God. No one should be forced to believe, and no one should exploit those who do. I think that we can all agree on this.\n\r\nRemember, we are all still brothers to each other and we should all play our part to make it better, regardless of faith.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nwell good, that's the kind of christian view i consider to be among the most enlightened... but i think more than a few of your fellow christians would consider it heresy...\n\r\nthe only point where i truly disagree with you is where you said...\n\r\n'...i do it for it is commanded and expected of me. Christ said \"If you love me, you will obey my commandments\"...'\n\r\nsee, you act a certain way because you believe your god expects certain things from you. i act a certain way because i am god... or rather, because god exists inside me, in my higher thinking and in my ability to moralize...\n\r\nthe fact that we as humans CAN generally all come to concensus on the idea of right and wrong... killing is wrong, helping the weak is right... goes to prove my point... that god exists in our shared abiltiy to do good... not as a deity or spirit that is so vain he needs to be worshipped, but as a shared conscienciousness that we can all experience...\n\r\nor maybe i'm just crazy... if so, i'll recant on my death bed (swish...)\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nSee, we can agree! The Believer and the Athiest both have a sense of right and wrong, both have morals and freewill, an ability to think and understand -- all of those senses were was given to all of us by God, whether or not you choose to believe in Him is up to you. Remember, God dosn't make you worship Him, He lets you if you CHOOSE to. See, you have a right to believe that you are a god if you want to (i personally think that God dwells within the hearts of those who invite Him there) God, however, isnt vain, He does not need us, but rather, we need Him. Again, if you dont want to worship Him, no one is making you and nobody should desire to make you. Just keep in mind that, although you may not believe in Him, He does believe in you. \n\r\nI think its true that God is Love, that if we love one another we fullfill what Christ called the Greatest Commandment, which is to love thy neighbor as you love yourself. To think, if man could only live by that, even those who dont believe in God, we would have something close to a perfect world.\n\r\nWith that, i just want to end with a nice little quote:\r\n\"For those who believe, no explanation is neccessary;\r\n For those who do not, none will suffice\"\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI think basically all religions speak the same message. Just look and you'll see.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\n\"Set as I am in my ways and arrogance, Burden of proof cast upon non-believers. \"\n\r\nis more a reference to the fact that 'true believers' (like his mom was) don't need to prove anything to those who don't subscribe, it's more like their burden to prove otherwise... get it?\r\n==============================\n\r\nI disagree primarily due to the fact that the entire perspective of the narrative changes during those lines. He has been speaking about his observations about his mother the whole time, but those lines use the word \"I.\" Implying that now, rather than making observations about the subject of the song, i.e. his mother, the lyricist is looking inward at the impact all of the previous observations have had on him. He even comments that she was HIS evidence. Taken in the context you suggest that line would make absolutely no sense. \n\r\nNo where did I suggest that this means Maynard is now a Christian. I simply think his view of some of those who chose this path has softened considerably.\n\r\nMy mistake for mislabeling him an atheist. \n\r\nAs far as religion being a form of control, I have always found that argument to be fundamentally absurd. Sure ideas are powerful but they are incapable, from a purely physiological and biological persepctive, of controlling a human being or forcing compliance. In the end not even laws or government have proven an effective means of controlling the mind, the body, and human behavior; otherwise, there would be no crime. Fundamentally, it is each individual's decision whether or not to adhere to a particular ideal or faith, and no amount of threatening or coercion can alter the fact that in the end there is still a choice. If you have a choice, that consequentially negates the idea of control.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nXenocide- the answer is simple...\n\r\nthe govt. can only hand down earthly and mortal punishments... whereas failure to adhere to church doctrine will land you in a lake of fire where your soul will be burnt and boiled for all eternity...\n\r\nif i was a believer that'd scare the hell out of me... i'd do whatever my 'holy (middle) man' told me was necessary to avoid it. avoid premarital sex (even though it's a lot of fun), avoid drugs (even though they're a lot of fun), avoid sinning in any form (which is generally a lot of fun)...\n\r\nyeah, eternal damnation is a lot heavier than a couple years in jail, don't you think? it works, as it always has for abusing power and manipulating people (in some cases, as i've discussed with Disgustipated)\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\ni think the song could be about maynards son, he is saying that he was \"in love with the dark side' maybe deppressed or doing something wrong them someone (his son?) change that all for him and that he would give everything up for his son btw jambi is a charcter on pewee's playhouse\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nTrexor, if you call a straight A grade A level student whose got into a damn good university 'intellectually inferior', u must be pretty damn smart. go you. \r\nxxxxx\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nEGB this is an excellent statement:\n\r\n\"if there's any god being referenced in tool's music, it's the god that exists in us... in our infinite potential for compassion and goodness... in our ability to reason...\n\r\nmjk's views towards christianity haven't changed since Opiate... many people would assume it's just ragging on religion in general, and calling 'believers' idiots... when in reality it's criticizing those who use faith to control the lives of their followers...\"\n\r\nI agree wholeheartedly.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nPoor song from a poor album.  Lateralus was a great album, 10,000 days is a piss poor album.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\n^^ sorry you feel that way rubyoverdiamonds...\n\r\ncare to explain a little more? or is it just such an objective comment that we should all just 'get it'...\n\r\nis it because maynard was more of a participant in the song writing? (most of Lateralus was written while he was on tour with APC)\n\r\nis it because this is by far their most musically ambitious album to date? \n\r\nis it the new and fresh feel to the song formats? do you miss the verse (quiet) chorus (loud) verse (quiet) bridge (louder) climax(loudest)...\n\r\nis it the more personal, heavy, emotional lyrical content? do you miss abstract lyrics that aren't really even tangible outside their direct context?\n\n\r\nyou know what though... i've decided that it's great that this album has seemingly alienated so many 'so called' fans... leaves more tickets for me... anyway, the opinions of a few small minded individuals aren't going to stop this record from selling millions and millions of copies...\n\r\ngo tool, i await the next, more ambitious, harder to appreciate, and more alienating album...\n\r\njctw769- thank you... thank you very much...\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI can't help but to notice that some of you guys (DISUSTIPATED, are you still there???) seem to think that because Tool makes use of Christian symbolism, this would demonstrate that they are Christians.  So I'd like to cure everyone's amnesia...\n\r\nWay back in -oh, say April of 2005, MJK made the bizarre annoucement that he had \"found Jesus\" and was subsequently leaving Tool.  The annoucement was an April Fools Joke of course, and he retracted the statement effectivly by saying something to the effect of \"Jesus-that guy's a punk!\" and said the Savior drank up all the wine in his celler, pissed in the bottles, and tried to perform a miracle in his enebriated state.  The original annoucement was so big and scary that mainstream media ate it up.\n\r\nI have a hell of a time believing that \"the dark side\" and \"the devil and his\" refers to the literal Christian devil.  I'm pretty sure this is a referednce to MJK's drug use, and I'd like to think the song Jambi is about his boy, Devo.  Listen to the language MJK uses-to me it definitely sounds like he talking about an irreplaceble relationship.  I'm also perplexed at how anyone could think that the song Wings for Marie demonstrates MJK's repentance.  When I first listened to it I got this image of subject (Judith Marie) marching up to the gates of heaven and demanding her reward for being faithful(GIVE ME MY F***'IN WINGS!)--a rather un-christian image...\n\r\nAs for the song-it's my favorite on the album, and yes this is a great album (but I think first place for me goes to Aenema).  The guitar and bass work on Jambi, in particular, is so intense, I found that everything else I hear on the radio is rather...weak?\n\r\nAnyhoo, just my humble agnostic opinion.  and oh yeah-no one should have to apologize for being an atheist OR an Agnostic.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nso yeah,not only does this album rock but i think this song is about his relationship between his loved ones (devo and BreÃ±a mainly) as the perfect circle song BreÃ±a is about her,and other songs reflect different aspects of his relationships with them,or maybe with some other personal relationship as it doesn't really have the feel of something to do with his mom nor do i really think he found \"jesus\".the whole band has DEFIANTLY spent more time on the light side of the line as can be seen in the sharp contrast between the 2 albums before this one and 10000 days really feels like it closes the gap between them,and a lot of the best elements of lateralus and anima are well blended in this album.sorry if this is recycled or what ever but i didn't see much to this affect,but yeah compare the song BreÃ±a to this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nforgot to add this but also i think a lot of it has to do with the fact that as a 'rock star,god,wtf ever' he can do about anything,hence the first set of lyrics, but most of the options are very physical or carnal (sin more or less) and this pulls a person from anything greater then those actions and if this song pertains to a person hes with it may be a big part of that,so many options but willing to sacrifice them to be with said person.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nThe lyrics are wrong,\n\r\nIt's \r\n\"Damn my eyes.\r\nJambi Eyes\r\nDamn(this one sounds like 'dim' as well though) my eyes if they should...\"\n\r\nIt's distinctly clear the second is Jambi eyes...\n\r\nIt sounds like Jam Bye eyes though\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nHow can you criticize Tool? I wonder if they will make music/be around in 15 years. I'm curious to see if their music will change as much as Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nTREXOR-you can't form you own opinions. That's my reasoning for ya. You believed everything about the album hoax and couldn't see otherwise. I, on the other hand, looked at both sides arguements and came to the conclusion that I didn't know if the album was a hoax or not because both sides had goo arguements.  That, my friend, is forming your own opinion. Too bad you have to have people think for you. That is why you act like a baby.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nmecca lecca hi mecca hiney ho......\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nDude, egb, you are waaaay too tunnel visioned. You can't even accept another's point of view. For example, rubyoverdiamonds said that he thinks that 10000 Days sucks and Lateralus is great. You, on the other hand, think it's wrong to say such 'horrible' things about Tool. I agree that Lateralus is lyrically better than 10000 Days, although I do really like 10000 Days a lot. It seems that you think 10000 Days is better or equal to Lateralus and/or other Tool albums, and you try and make everyone think the same, when we can have our own opinion about it.\n\r\nYou asked rubyoverdiamonds if \"that was an objective statement, or should we all just get it?\" Well, I got it. It's not a hard thing to understand if he doesn't like the album. You state your beliefs and he stated his. It seems that you're afraid if someone's views differ from yours. And why the hell do you care if someone doesn't like the album anyway?\n\r\nAlso, on the stance of religion, why do you care of people, such as disgustipated, believe in a religion. I do not think that trying to change someone's religious views is a good thing to do. In fact, it's really mean. If you don't believe in religion, you can say so, but do it in a respectful manner. Don't just tell them that because the Bible talks about 'homosexual rape' is reason enough not to believe. If it's anyone with a 'flawed vision of religion', it is you. I myself am not religious, but why should I care if someone else is? \n\r\nYou also told disgustipated that he acts a certian way because he believes a certain way. Well, if you haven't noticed by now, EVERYONE acts a certain way depending on their beliefs. So what is it to you if someone doesn't have pre-marital sex? I can't imagine why you are so concerned about other people's lives.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nJust wanted to through this out there...\n\r\nThe last lines: \"Silence leech, and say your poison. Silence leech, and stay out of my way\"  I'm pretty sure these are wrong.  I distinctly heard \"Silent legions\", not leech.  Does anyone else think the last lines are up for debate?\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nYou have GOT to love the beginning bass here.  I do!\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\ni think the word santa in this song is actually center\r\njust a thought\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nthe last lines, to me,  sound more like...\n\r\n'silently, just save your breath and silently just stay out of my way'\n\r\ni'm not sure if that makes more or less than any other suggested possibilities, but that's how it sounds to me...\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nTo get back to the meaning of this song, I completely disagree with DISGUSTIPATED's analysis. However, I can see how a believer in Christianity can view these SOME  of these lyrics as being pro-Jesus Christ.\n\r\nLike most Tool songs, I see multiple things going on in this song. The beginning of this song is interesting though. Let's use logic to help us. \n\r\n\"So if I could I'd wish it all away \r\nIf I thought tomorrow, They'd take you away\" \n\r\nDespite his use of the word if in this song, I believe his reasoning follows this: If by wishing it all away, the result would be i'd lose you, then I would wish it all away.\n\r\nHe continues to keep solidifying the fact that he would wish it all away, so what does this mean? Well logically what would follow is that the person/thing/organization spoke of in the beginning of this song, Maynard want's it the fuck out. \n\r\nBased on this, It leads me to conclude that this song is anything but religious. The thing he \"wishes away in many past songs, ( schism, the grudge, opiate, ) is organized religion.\n\r\nBut don't get me wrong theres much more to this song. He flips the script all together right here:\n\r\n\"You're my peace of mind, my home \r\nI said I'm just trying to hold on \r\nOne more day\"\n\r\nAlso right where he says this: \r\nBut you changed that all for me \r\nLifted me up, turned me round \n\r\nHe's giving us a hint about where this song is going to end up.\n\r\nHe changes the subject matter to his son, or possibly his mother in these 2 small section, but uses similar language to confuse us all.  Whether it be his mother or son, I believe he's just saying that they are in inspiration to him.\n\r\nNow the ending, the shine on part: You've got to conclude that this part is a message of hope to his son, where he brings in another reoccuring theme in tool's lyrics, the 2 becoming one, the ego, and the self. A lot like some of the lyrics in Right in Two, and Reflection, i believe he is simply saying to his son that he must be the best person he can be, he must strive to exist as one, he must crucify the ego.\n\r\nDivided, he will just fall into the masses and wither away, but as one, you can be a great person and spread the word to others:\n\r\n\"Shine on upon the many, light our way \r\nBenevolent sun\"\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nBlindrider- maybe you should go back and read a little more carefully friend...\n\r\nhe (ruby) didn't state his beliefs... he didn't say 'i don't like this album' he said 'this is a piss poor album'... and he didn't bother backing it up with reasons... i'm as entitled to debunk peoples reasons for not liking it as bs for the same reasons they're not required to like it... like i implied, it's about the least objective thing i've read on these boards...\n\r\ni gave reasons why this album is superior to lateralus...\n\r\nas for religion... plain and simply i enjoy debating religion. along with other things that no one will ever be able to prove or disprove... my beliefs, plain and simply, are that organized religion is a cage... that's it's primitive, and that we as a species can't evolve beyond this point unless we start thinking with our minds instead books written by mad zealots thousands of years ago... books that have little practical application in this modern world. hell, many religious folks don't think we should be exploring mars or beyond because we might find something that would debunk their beliefs... i mean honestly? what the hell is that all about... \n\r\nwe came to a civilized agreement, so i don't even see why you brought it up....\n\r\nbut basically, you call me tunnel visioned? that i can't accept other people's points of view? well, i can't accept ignorance... but I CAN accept other points of view... i respect disgustipated because he's clearly one of the more enlightened less dogmatic among his bretheren... i don't respect ruby cause he/she?'s a little cock who just wanted to flame this thread...\n\r\ni accept that people think differently than me... but that doesn't mean i don't think certain beliefs are highly dangerous and should be snuffed out for the good of everyone... nuf said.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\n* in case you were wondering, i meant beliefs that would say that taking the life of another human being for any reason is OK... which is digusting and wrong if you ask me... but hey, it's not pc to name certain religions or belief systems which seem to condone these kinds of things... or at least sects of certain religions...\n\r\nif thinking that hypocracy, killing, and mindless trash talking (ruby) is bullshit makes me narrowminded... well than, i guess i am... but isn't that just the pot calling the kettle black...\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nDamn!!!  I love 03:55 on the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nlemon juice can be used as an invisible ink.  You write with the lemon juice, then to read the message you coat the paper with iodine.  The writing appears white while the paper turns indigo.  I have no idea if this has anything to do with the song\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nShit, that was supposed to go in the pot forum...  the lemon juice thing I mean\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nTREXOR he has been right about everything he has said besides the album being a hoax everything else is sooo true he is the only one that can truly criticze this band let him critiszce jesus christ\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nThe only thing I can say about this album is that is it another progressive way of new art. it's really genius how these guys put an album together and Jambi is at the moment one of my favourite songs. It has al elements that a song need and especially the way that tool does it.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nI agree with the \"damn\" vs. \"dim\" comment from jarbs.  I definitely hear \"damn my eyes ...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nTREXOR I SIGNED UP TO THIS SITE JUST TO TELL YOU TO GET A FUCKING LIFE if you don't like tool, stay the fuck away from their lyrics you EEEEEEDIOT!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nJambi was a country near indonesia i think and i remember hearing in my socials class that the ruler of jambi taunted another government and held out on the invasion for a while.... Jambi is the genie from pewees play house too i think...... The song ties in with both. I think that this song is about ppl biting off more then they can chew which ties in with the line \"damn my eyes\" (not dim my eyes) cause his eyes were bigger then his stomache and he bit off more then he could chew. The wish it all away lines tie in with the genie line too. I think that this songs deeper meaning is about maynards opinion on ppl who want somthing alot but once they get it or do it or whatever they dont like it anymore. Like (excuse the political incorectness) Indian giving. Oh ya the ruler of jambi was betrayed by his ppl before he was invaded so that ties in with the \"divided I'm withering away\" line as well which sounds alot like  sumthin from right in two.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\n\"Prayed like a father dusk to dawn\"\n\r\nshouldread\n\r\n\"Pray like a martyr dusk to dawn\"\n\r\naswell,\n\r\n\"You're my peace of mind, my home \r\nI said I'm just trying to hold on\"\n\r\nshouldread\n\r\n\"You're my peace of mind, my home \r\nmy center, I'm just trying to hold on\"\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nanti social...  at no point in your constant ramblings did you even come close to a rational thought.  you should be booted and flogged.  \n\r\nthe song is about his relationship between his son and the conflict with his fame and being a good father.  stop trying to make it into something it is not.  this is pretty much the only good song on the album and it does not need you ignorant hicks trying to delve some deeper meaning in to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nI think DISGUSTIPATED hit it pretty close with this one. And I am surprised that so few people disagree and he was the first one. \r\nC'mone guys listen to the song...\n\r\nTempted the devil with my song\r\nAnd got what I wanted all along...\n\r\nBut I....Would\r\nWish it away \n\r\nThe devil with his had me down\r\nIn love with the dark side I'd found...\n\r\nBut you changed that all for me\r\nLifted me up, turned me round...\n\r\nSo I would wish it all away\n\r\nNo, he may not be a born again Christian but he may be on the path, but he'd wish away his bad past and evil deeds if he could\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nto egb and disgus. i totally agree w/ points in all of ur posts however hav either of u ever thought that the church is simply a medium in which to act out ur religion i do believe that religion has caused some of the worst things iin the world it is b/c of the fact the pple in my church are so hypocritical and so opposite of wat christ wanted is why i do not go anymore but as one of u sed b4 we need to go back to ideas not beliefs it is b/c of this that pple hav killed and harmd others if either of u hav anything else to say on this matter id really enjoy talking more about it\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nthe title jambi\r\nsounds kinda like\n\r\n\"damn my eyes\"\r\nwhen he sings it\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nThis song is an obviously about the relationship he holds with his son and how he would give up everything for him if he had to.\n\r\nThe first part is stating that he is living comfortably and he seems to have everything in the world. But if he was going to lose his son, he would give it all up, for one more day.\n\r\nAs for the 3rd stanza i think he is stating how he almost lost sight of what meant most to him, his son.\n\r\nAt the \"Damn My Eyes\" part he is yelling this because he hates how his relationship with his son may have been gone, and divided.\n\r\nThat's why they must breathe in union so their relationship can last one more day\n\r\nThe last part deals with the fame and how it is a leech/poison to some, and he must not give in to it.\n\r\nAs for the title; Maybe his son liked watching pee wee's playhouse, and his son will know what that means.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nholy fuck blindrider, u wanna jump any further up egb's ass? he wanted to rip apart that dumbass's unbacked claim that 10,000 days is a \"piss poor album\" as far as im concerned every damn person on this site should be doing the same, if your commenting on this site, why the hell would you if dont like the song? you think we care/want to hear your bitching about an album that proven by this site is more widely liked than disliked? \r\nand on his comments on religion, damn straight he can put his views, im an athiest; im both proud and content to be an athiest, and thats not going to change, now if all you die-hard christians want to go around posting your \"this is about god, this is about religion\" comments, why the hell shouldnt we react in the exact same way and post our views that \"no this isnt about god or religion, its about an actual topic or event\"\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nand damn nicely done Pixiespider, i read trexors 1st comment and thats the origional reason i signed up for this too, but i told him to fuck off not get a life\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\n3 Major corrections to this one...\n\r\n1.\r\n(The devil with his had me down)\r\nIn love with the dark side I'd found.\r\nDABBLING all the way down (Not: Dabble in) \r\nUp to my neck soon to drown. \n\r\nCome on, this is pretty obvious. He discovered the dark side and was enamored with it, thus beginning a downward spiral into darkness and evil, dabbling in the occult, spiritual alchemy, sexual experimentation, etc... on the descent. \n\r\n2.\r\nPrayed like a MARTYR dusk to dawn (plainly Not: Father. Listen again.)\r\nBeg like a hooker all night long\r\nTempted the devil with my song\r\nAnd got what I wanted all along\n\r\nDuring Ramadan, Muslims forgo food, drink and sex, and pray unceasingly from sunrise to sunset or vice versa (so it rhymes). Some of these people, in today's violent world frequently martyr themselves by detonating explosives strapped to their bodies or driving a vehicle heavily laden with explosives into groups of school children. They're called terrorists. Maybe you've heard of them?\n\r\n3.\r\nDim my eyes if they should compromise\r\nOr fall from what sin need you, IF I LEAVE IT \r\n(Not: find within)\r\nI might as well be gone \n\r\nThese's a passage in the Bible that says something like \"If your eye causes you to fall into sin, pluck it out for it is better for you to enter into the kingdom of God with one eye, than having two eyes, to be cast into hell-fire.\"\n\r\nThe idea is that we get caught up in our sensory experiences of the world and neglect our spiritual, intutitive natures. MJK has developed his spirituality and recognizes the great benefit he has received in doing so. So great in fact that he would rather be without THE major human physical sense (sight), if it leads him astray, than to fall back into the \"old\" sensory, physical, primitive ways of living (and dabbling in the occult). \n\r\nDimming the sight (as happens naturally in old age) is one kind of \"blinding\" accomplished in the referenced Bible verse by actually \"plucking\" the offending eye out. The thrust is that if you can't see the distracting physicality of the world, you have fewer obstacles to spiritual development.\n\r\n... and as crazy as it sounds, people actually do it:\n\nworldnetdaily.com/news/… \n\n\r\nOk, that's all. I've listened to these over and again. Have a listen with my corrections and judge for youself.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nagrees with blackinator.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nActually, no.\n\r\nHe definitely says: \n\r\n\"I said I'm just trying to hold on .\"\r\n(Not: my center)\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nIt's definitely \"Dim my eyes.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nHe said \"Santa.\"\n\r\nHahahaa.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\n6 comments on the 6th page on the 6th.\n\r\nTake that.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nSweet\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\n--During Ramadan, Muslims forgo food, drink and sex, and pray unceasingly from sunrise to sunset or vice versa (so it rhymes).--\n\r\nnot exactly... cause that'd be a rough month with no food or drink, don't you think? no, during ramadan muslims forgo food and drink during the daylight hours. convieniently enough this occurs in the winter months, when the days are at their shortest.\n\r\nand the martyr part... generally the ritual of the (muslim extremist)suicide bomber includes praying all night to purify ones self the night before their 'martyrdom'...\n\r\notherwise, great interpretation...\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nActually, Ramadan occurs for one month according to the Islamic calandar, which is about 11 days shorter than the traditional solar calandar. The month of Ramadan is 11 days earlier each year, so it's actually not in winter months. You keep saying you accept other people's beliefs, but you seem to jump all over Islam (conveniently enough).\n\r\nAnyway, I think that any references to religion in this song or basically any of Tool's are definitely linked to Christianity, not any other religion. I think this is just a singular way for Maynard to express his views on all organized religion, but Christianity in particular is used because it is what Maynard grew up with and it is what is most familiar to him. I think martyr is used in a more classical sense then people strapping bombs to their chest. I see the term being used more in the sense of someone who would defend their beliefs to the death.\n\r\n\"Prayed like a martyr dusk to dawn\r\nBeg like a hooker all night long\"\n\r\nThese two lines go hand in hand. A martyr is being likened to a prostitute in that they are wasting their time all night begging to God and getting nowhere.\n\r\nIn general, I think it's safe to say that Maynard tends to write only about things he is personally familiar with. In the case of religion, he will steer towards hypocritical Christians over extremist Muslims.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nIf you read \"The Golden Bough\" by Sir James George Frazer, you might understand this song better. I think this song is dedicated to his son, in the same way \"Wing for Marie\" is to his mom. Great Album\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nFirst off, my opinion of this album is that it is BAD FUCKING ASS!  That being said, let's address some issues:\n\r\n  TREXOR - You thought I was gonna flame your ass, huh?  Fuck no.  You da man, bro.  As for anyone else reading this who's posted a comment  regarding TREXOR's entries, WHO THE FUCK ARE YOU!??!!  I'm not saying I agree with the guy's opinions in any fashion, yet THEY ARE HIS OPINIONS!!  WHY DOES IT MATTER TO YOU?!?  The assumption can probably be made that TOOL doesn't give half a rat's ass.  \n\r\n  Speaking of which, I've seen so many entries on this site in which people state as fact (not assumption, which it always is) trivial information regarding the personal lives and views of the band members.  HOW THE FUCK DO YOU KNOW!?!  DO YOU KNOW THEM?  \n\r\nto SmileyGladHands:  Mecca lecca hi mecca CHONNY HO!  (old school, no doubt!)\n\r\np.s.  If anyone would care to discuss any of the aforementioned topics in depth, FUCK OFF!  I'm never reading this retarded shit again!  \n\r\nlove, \r\n  not you and glad.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\ntrexor honestly u need to stop bashing everyone and this album YOUR WRONG in every conceivable way shape and form\n\r\njust becuz u hav sum strange dillusion that tool shud be the same band over and over again on every album doesnt mean everyone else shud\n\r\nhowever if this is how u feel then i guess theres nothing we can do about it \r\nbut plez just stop being a dickhead to everybody on here and bashing them just because their opinions arent the same as yours\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nThis song is amazing along with all the other tool songs,\r\nim sorry TREXOR but i cant see where your coming from?\r\nTool might not want to be mainstream but that doesnt mean they cant be good!\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nAs far as the \"Damn\" and \"Dim\" my eyes debate goes, I think you're supposed to hear both in there. \"Damn\" has a Judeo-Christian connotation, while \"Dim\" ties it in with the benevolent sun (son) at the end of the song.\n\r\nHaving said that, I think anyone trying to understand this song should go look over the record at Wikipedia on \"Jambi,\" the region in Indonesia that the Dutch took away from the Sultan, slowly but surely.\n\r\nIt's pretty obvious after you read that that Maynard is putting himself in the place of the Sultan of Jambi. The \"center\" that Maynard refers to could parallel the main geographical part of the sultanate of Jambi.\n\r\nNow I suggest you take a look at Meddlehead40's analysis, and perhaps Blindrider's. I think the fact that you can read \"I would wish it all away/ if I though tomorrow/ They'd take you away\" in two different ways is deliberate. While the sultan's quest to regain the \"center\" of his kingdom feels to him like a quest to regain a part of himself, it also claims his life. Maynard recognizes this by having somewhat contradictory language. I think he might be doing something similar to \"Stinkfist,\" in which he wrote a dialogue between an addicted person and the object of their addiction. In Jambi, I believe he is addressing (you my center) two different things/people, or at least two different aspects of that person. Part of this person acts as his savior, while part of them he's thinking about \"wishing away.\" He's not sure whether his quest to find his center yields wishing this person away or keeping them in his life.\n\r\nHaving two aspects also ties in with the \"two becoming one\" at the end of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nthis song is just awesome, like almost all from 10,000 days.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nIsn't jambi the name of the floating fortune teller head off of Peewee's playhouse?\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nOk, after about a million more listens... I have to recant...\n\r\nOnce again, I agree with Blackinator... \n\r\nHe definitely says \"...my Center, just trying to hold on\" not \"...I said I'm just trying to hold on\"\n\r\nMy bad, dawwwwwrg.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nthis songs about mr. bungle, as is dani california by rhcp\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nI recall an elaborate april fools joke maynard pulled by publicly announcing he had converted to christianity. Also, I find it odd that a self proclaimed christian (Disgustipated) listens to a band with songs entitled Die Eier Von Satan.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nPlus, I started watching Pee wee's playhouse and noticed the genie named Jambi, then listened to the song and the lyric \"wish it all away\" really stood out. It seems like a childish interpretation for such a deep band, and many others have noticed it before me, but it's noteworthy.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\ntscottrocks-\r\nWhy do you find it odd that I listen to a band that promotes open-mindedness, compassion, and the elimination of the ego? I suppose you think I lack a sense of humor, or perhaps I'm an unapproving prude sitting in judgement of that 'there devil music while rocking in a chair and recanting whats wrong with teenagers and thier camflamit MTV. I don't know, I guess maybe because I'm a Christian I cant listen to a song with cooking instructions in German.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\noh my god on page 4 egb said that agnostic means that your \"spiritually aware\". what a fucking moron. way to discredit your whole arguement, dipshit.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nI love this song. =]\r\nWho could possibly be convinced even a little bit that this album is a hoax? I must say, this is the best album yet, in my opinion. I finally got it. Heheh. I'm going to look up tabs for it...Maynard is a genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nwhats that thing Jambi says when the kids want to make  a wish, wakka laka wini lika heini ho... or something\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nThe word Jambi also means \"iambic\" in Finnish and the verses are in iambic pentameter.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nThis song displays how fame and fortune can cloud perseptions about what is really important. In this song, he speaks of selling his soul, (tempting the devil with my song, and got what i wanted all along) but he would wish it all away to have someone (or something) that really mattered. Jambi is a river in India, and i think he is making an analogy to British colonialism in the 19th century, it was not uncommon for God fearing brittons to go to India and get caught up in the fake superiority that they created there, clouding all importance.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nthe person he wants back is his mother.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nWhy all this crap about maynard finding \"jesus\"? A refeence to some obscure lyrics you take literally (once again, christians with their literal interpretations) is billshit. It's almost like you are so desperate, like you WANT maynard to find your god and so the heathen is saved. The bigotry and elitism from the christian right that only the christians can be saved.\n\r\nArrogance and hubris of the religious right.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nthat t.. person seriously quit bitching about him and talk about the fucking song.\n\n\r\nby continuing this your giving him what he wants.\n\n\r\ni want to read about the songs, not how someone hates such and such.\n\n\r\nkthxbye\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nMinor correction here, not sure if this is the place for it.\n\r\n[dim my eyes if they should compromise\r\nor fall from what you need believe in \r\nI might as well be gone]\n\r\nsays it more of a \"whatch-you\", but I could POSSIBLY buy \"what's in need to believe in\", but the one I have up there makes more sense. Definately says \"believe in\"\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nShort response from me...\n\r\nI think it's a love song of some sort. Whom he \"loves\" I'm not sure, he doesn't really say in the song which leads me to believe this is one of those songs you can interpret however you want.\n\r\nOne thing is for sure, he loves something or someone enough to give it all away( his music, his wealth, his celebrity status) if he thought he'd lose his love for just one day.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\n-collegeguy, \r\nyou really need to re-examine some things. what i have bassically stated was that maynard has, in a sense, reconciled his and his mothers beliefs, but i guess that gives you an excuse to start ranting and drawing such rash generalizations about ''us christians\" that have not been founded on some version of truth or reality. Oh, and at what point did i say that only christians can be saved in my argument? You shouldnt be out there looking for a way to persue your personal vendetta against christians. Feel what you will, just dont go out there and make blind accusations on all of christianity by using my argument as a point of reference, which hase nothing to do with anything in your incoherent rambling. \n\r\nand to ckywierd, \r\nWOW. what a terrible conclusion that you have come to. im truly sorry that you need to pull your head out so badly, but you better hurry- i think the lack of air in your rectum is causing you to radiate statements that dont come close to a thought or observation.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nWow. The anger.\r\nChill.\r\nWho want's to fight over some song lyrics?\n\r\nVery interesting about Jambi meaning Iambic. But...\r\nThe verses aren't in pentameter.\n\r\nPentameter is 5-footed phrases.  Each foot is two syllables.  An Iamb is a foot with a soft-stress followed by a hard-stress.  Maynard uses 4-footed phrases, and sometimes 4.5-footed phrases.  Not pentameter.\n\r\nThis is one of the most enigmatic songs on the whole album I think, because of the second part of the form.  This may turn out to be a valuable clue. :)  Thanks Janster!\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nFrom the July newsletter:\n\r\nSUBJECT: JAMBI, LAMBIC METER \n\r\nQ: \"So, it seems that at least the first verse of the song is in Iambic meter. It is used almost exactly a typical Finnish Iambic meter: \n\r\nUnstressed-Stressed-U-S-U-S-U \r\nUnstressed-Stressed-U-S-U-S \r\nUnstressed-Stressed-U-S-U-S-U \r\nUnstressed-Stressed-U-S-U-S \n\n\r\nThe first verse seems to follow this formula, except all of the lines end with an unstressed syllable and are equal in length. So, the funny side of the thing is that in Finnish Iamb is called \"jambi\". How intentional is this?\" \n\r\nA: Finally! Very intentional.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nDude u guys are digging WAAAAAAAAAAY too fucking deep. \n\r\nI think it has to do with a symbol losing authority because of what a higher authority wants out of greed. Basically i think its a bout political battle within a country. Democrats Vs. Republicans; Conservative Vs. Labor; Christians vs Atheists. \n\r\nIt has a point that even though power will be lost they still have the poeple behind him \"Shine on forever\". FOr some reason the song meaning of political battle jumps at me.\n\r\nMaybe if you look towards that direction it will jump at you too. But, usually Tool isn't that political (thats APC's job) This also could be just a love song similar to Schism. Who Knows? Maynard does.\n\r\nWe all should have opinions about this song. Maynard wants us to have opinions about all their songs.\n\r\nKeep this post in mind\n\r\n-James!\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nDISGUISTIPATED , I find it odd that a person who is a supposedly committed christian like tool, who have been quite hostile towards religion. Naturally you jump at the chance that he has \"become one of you,\" and he can enter the pearly gates - automatic pass to the fluffy cloud land. \n\r\nSorry, I'll pass thanks, it has too heavy a price. I enjoy fre-thinking and science too much cower to some bully.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nI think one interpretation that a few have hit on but most everyone else is ignoring is probably one that Maynard intended, at least in part.  I am sure he considers many, many things when writing so that the songs have various levels.  But, \"Jambi\" is the genie from Pee Wee's Playhouse, ties in with the whole wish thing.  Also ties in with children.  He states the whole \"benevolent son\" bit clearly.  I don't think he's talking Jesus folks, I think he means his own child.  I am pretty sure his anger and \"get out of my way\" stuff at the end are for all the fans that cross the line.  He is just saying he would give up anything, even the amazing life of a musician that is sought after if it interferes too much with his relationship with his son.  Plus, I really think at least one of the parts of the song that everyone writes the lyrics out as \"Dim my eyes, or Damn my eyes\" is really \"Jambi\", just sung with it drawn out a little.  You know, calling for the genieâ\u0080¦ give me my wish.  It makes since because otherwise the song never mentions the title once which is not unheard of but still a little strange.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nI will not, nor will I ever, assume to know the meaning to any Tool song unless Maynard, himself, confided in me the meaning to that song.  Until then, I will let the words be as they are, and let the melody of those words carry into my ears without bias.  That said, I'm fairly convinced he's saying, \"Dim my eyes, if they should compromise, or fall from what you need.  Divide me then I might as well be gone.\"  It makes to most contextual and continual sense of any of the other interpretations, in my eyes.\n\r\nI still think it's funny to have lyric sites post lyrics to music that released no official lyric.  Just let it be and enjoy the music; Drums, Guitars, Vocals and all.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\ncollegeguy\r\ni'm not saying that maynard's \"become one of us\", as you say, I'm saying that he's sort of reconciled his beliefs with those of his mother, and not those of dogmatic hypocrites. And by the way, I hate the idea that only (and all) christians go to heaven, especially when coming from one. That idea is so distorted and un-christian in nature that im surprised that so many \"christians\" actually believe it. I'm against them, as are you, and as is everyone.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\n\"kneeling away, my santa\" wtf were people on when posting these lyrics. lmfao\n\r\nI don't know what the lyrics are, but those aren't them lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nI have only had a chance to read abou the first 100 postings, so I don't know what has already been written recently, but here is my take.\n\r\nIt seems that most of you are trying to pin the words into one specific meaning.  Take, for example the words \"benevolent son\" (or sun).   Have you all heard of the word polysemy?  It means multiple meanings.  It seems to me that this part of the song has many many meanings, including A) because the song and album definately seem to be about his mother, after her death, Maynard himself (maybe even as a representation of Jesus...he also refers to himself as the chosen one) is the benevolent son who must shine on and bring light to humanity. B) Obviously the SUN shines on to bring life and light to humanity, so maybe in fact he also means the literal sun or just Life-giving light will shine on forever bringing the separated back together (two become one).  C) Son as is not only Maynard's son, but all of the sons of men (sorry ladies, this is not to discount you, I believe that this still also refers to the daughters as well...unfortunately the language we have come to use in talking of spirituality is highly masculine dominated) and the continuing creation of diverse life.  \n\r\nOf course there are many more meanings to not only this line or song but in all of Tool's music. \n\r\nAlso, in analyzing the meaning of many of Tool, many of us tend to get so caught up in the lyrics that we forget the meaning found in the music itself.  The strongest example I can think of comes in the song \"Schism,\" where in the beginning of the song, Maynard calmly states that \"I know the pieces fit.\"  At this point it is as though he is embracing the \"falling away\" of the pieces.  That is, the separation is initially good.  It is amazing that we are able to be individual, unique, and separate from the whole.  After all \"the circling is worth it/finding beauty in the dissonance.\"  Now as we get to the end of the song, after having been taken on a ride through the dissonance and experiencing all that life has to offer, Maynard still \"knows the pieces fit,\" but he is almost no longer calm.  It is as if he is trying to bang the pieces back together - to hammer them back into place.  Tool, Not just Maynard, takes you not only on a spiritual journey through the lyrics, but an emotional journey through the music.  Danny Carey's drums alone have the ability to take you places you may never have understood through the mere words.  I suggest you all try to listen and interpret the songs in there entirety.  It can be a mind-expanding process.  \n\r\nI guess I'm just rambling now, but I am just trying to offer a unique perspective that may allow for an even greater tool experience.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\ni always thought it was about his son\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nJambi was the genie that lived in the TV on PeeWee's Playhouse. \n\r\n\"if i could i'd wish it all away\"\n\r\nKinda funny\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nSory i sorta lost track of the convo and im not sure wat the agreed lyrics are at the moment, but ponder this:\r\nSanta is Satan with the letters rearaganged\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nalso...A Rear Ganged is rearaganged rearranged!\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nyea yea, sorry it was getting late by then...\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nSeen tool live in cardiff, they played this, AMAZING!!! tool were amazing all night, te guitarist out of motorhead came on and played a solo During Schism and in maynards words 'i belive that is what is known as shredding!!' it was the best gig i ever been to, the set was two and a half hours long, and they just kept the crowd going, AMAZING!!\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nI totally agree with Palisade1218.  I could not propose to begin to understand the depth & meaning of the lyrics to any of these songs.  One of the great things about music is personal interpretation.  We listen to the lyrics & draw from personal experience.  Yes, we can analyze Maynards life & try to draw conclusions, but I prefer to just listen & enjoy the brilliant music that this band has produced repeatedly over the years.  One of the things I have always admired about Tool is that each album is its own story.  Its own style.  Yes, every Tool song has that distinct Tool sound, but each album feels different.  I have long thought that Lateralus is the most perfect album I have ever heard.  Granted, that is just personal opinion & in no way fact.  It is just an album that seemed complete.  Just one long story & the songs were inseperable from each other.  As with any new album, I am bit reserved.  We hold our favorite bands in high expectation & we often unfairly criticize their artistic vision.  I think this is a great album.  It took a listen or two to fully appreciate it, but for anyone who truly enjoys Tool for more than just being a rock band can't deny that this is a brilliant album & Maynard seems to be baring his soul on this album more than any.  It feels more personal for him & in turn I respect the album even more for it.  Anyway, enough with the rambling.  This is my favorite song on the album.  To me it is a great love song.  For your spouse or child or anyone you cannot be without. \n\r\nTool rocks.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nthe lyrics are a little different than those that are posted...here is what I believe that the lyrics are...and they make more sense too...Santa???\n\n\r\nHere from the king's mountain view\r\nHere from the wild dream come true\r\nFeast like a sultan I do\r\nOn treasures and flesh, never few.\n\r\nBut I, I would wish it all away\r\nIf I thought I'd Lose you just one day\n\r\nThe devil and his had me down\r\nIn love with the dark side I'd found.\r\nDabbling all the way down\r\nUp to my neck soon to drown.\n\r\nBut you changed that all for me\r\nLifted me up, turned me round\r\nSo I\r\nI\r\nI\r\nI\r\nI would\r\nI would\r\nI would\r\nWish this all away\n\r\nPrayed like a father dusk to dawn\r\nBegged like a hooker all night long\r\nTempted the devil with my song\r\nAnd got what I wanted all along\n\r\nBut I\r\nAnd I would\r\nIf I could\r\nAnd I would\r\nWish it away\r\nWish it away\r\nWish it all away\r\nWanna wish it all away\r\nNo present could hold sway\r\nOr justify my giving away\r\nmy center\n\r\nSo if I could I'd wish it all away\r\nIf I thought tomorrow would take you away\r\nYou're my peace of mind, my home, my center\r\nI'm just trying to hold on\r\nOne more day\n\r\nDamn my eyes\r\nDamn my eyes\n\r\nDamn my eyes if they should compromise\r\nour fulcrum what you need divides me then\r\nI might as well be gone\n\r\nShine on forever\r\nShine on benevolent son\n\r\nShine down upon the broken\r\nShine until the two become one\n\r\nShine on forever\r\nShine on benevolent son\n\r\nShine on upon the severed\r\nShine until the two become one\n\r\nDivided I'm withering away\r\nDivided I'm withering away\n\r\nShine on upon the many, \r\nLight our way benevolent son\n\r\nBreathe in union\r\nBreathe in union\r\nBreathe in union\r\nBreathe in union\r\nBreathe in union\n\r\nSo as one survive\r\nAnother day and season\r\nSilence leech, and save your poison\r\nSilence leech, and stay out of my way\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nthere is music in the song as well y'know\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nPerhaps we all need to accept that like all great works of art, Tool's music has an infinite amount of meanings and no one person is going to summarise it all in a post.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nthat being said, one interpritation is this: it seems the central character in the song (Maybe Maynard, maybe someone else) has technically become a Christian but is still very cynical towards the faith. What a paradox eh?\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nI'll justify my interpritation when I can be bothered\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\n\"The devil and his had me down\r\nIn love with the dark side I fell\r\nDabbling all the way down\r\nUp to my neck soon to drown\"\n\r\nthis is describing the plight of the unbeliever.\n\r\n\"But you changed that all for me\r\nLIFTED ME UP TURNED ME ROUND\"\n\r\nAn Integral part of the Christian faith is the concept of repentance. to repent literally means to TURN AROUND.\n\r\n\"So I would wish this all away\"\n\r\nAnother Christian belief is the destruction of the old creation/world and the birth of a new creation/world.\r\n  In longing for the new creation and rejecting the old one, it could be said that this is 'wishing it all away'\n\r\n\"Pray like a martyr does till dawn\r\nBeg like a hooker all night long\"\n\r\nself explanitory.\n\r\n\"You're my peace of mind my home my center\r\nJust trying to hold on one more day\"\n\r\nChristians also believe in a coming day of Judgment i.e. the end of the world. Where this can be scary to some, Christians have peace of mind in the knowledge that this final day will be the end result of their salvation. Until then, one could say that they're 'just trying to hold on one more day'.\n\r\nAs for the \"shine on\" part (cant be bothered typing it all out) it seems to be describing the Rapture. particularily the \"Divide and delivering away\" part, seeing as on the day of Judgment the sheep will be divided from the goats and God's chosen will be delivered away to his kingdom.\n\r\nKeep in mind that this is just a rant and nothing but a rant. Flame away if you must but just remember MJK's lyrics back in 92:\r\n \"I can say what I want to, even if I'm not serious.\"\r\nI doubt he's changed his mind on that.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nAnother interpritaion:\r\n Jambi could just be a jam, sing that meter thingy and a collection of random lines from MJK.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nREAD AND LISTEN TO THIS!!!\n\r\n7812569103411/67584131221911310/15\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nTool: The Cyclic Playlist.\r\n6,7,5,8,4,13,12,2,1,9,11,3,10 / 15 / 7,8,1,2,5,6,9,10,3,4\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nTool Synclist (complete)\r\n7,8,1,2,5,6,9,10,3,4 - 6,7,5,8,4,9,13,1,12,2,11,3,10 â\u0080\u0093 15,14 (or 14,15)\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nfirst of all what is with allthese 7,8,34,7,4,3,99,12,,34,67,911000,666,45,8,3,1,2 things you guys are doing? second of all, I heard this song was talking about the music scene right now. Just look at the lyrics, they kinda seem a bit stereoytpical such as 'beg like a hooker all night long' and the line 'got what i wanted all night long'. just re read the lyrics over and see what YOU think yourself, thats probably the point of his music.!\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nsy5tem , i think you really hit on something there, i haven't read through all the stuff here on this song but just clicked to this page to post a similar view.. the song seems to deal with the fact that in today's society, especially with the internet, credit cards, etc, we pretty much get whatever we want, whenever we want.  maybe not everyone, not completely, but relatively speaking this is true.  our music definitely reflects this in its materialistic nature.  the title Jambi, since yes, that was pee-wee's genie's name, sort of implies this \"get whatever you want\" mentality that has emerged in our culture.  now, as for what this results in us losing?  societal identity? personal fulfillment? spiritual connectivity? it's really endless...\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nA recurring line in the song is \"wish this/it all away\"\r\nThis is the link to Pee wee's genie.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nTool have always reflected on the state of society at the time their albums are released, and will most likely continue to.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nWell...a tiny observation...buuuut if I remember the story correctly (lol) ... Bambi lost his mother...and now, perhaps spelt like 'Jambi' in honour of Judith? And maybe Maynard feels kinda like Bambi when it lost its mother...Lol..I feel helluva silly writing this...but just a thought..\n\r\nOn a general note...spite seems to be a central theme...\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nAl.B.Crazy, your crazy, darrenr you kick ass\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nInteresting theory Al.B. I would've never thought of that.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nlyrically its the most beautiful thing tool has ever written.\n\r\n:)\n\r\n10,00 days is epic\n\n\r\ntool are the greatest band ever\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nIndeed they are.\r\nBtw, I believe the last two lines are;\n\r\nSilently just say your praise and\r\nSilently just stay out of my way\n\r\nI guess we won't know for sure until they release official lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nHmm, so it seems to me that Maynard has become quite accepting of Christ nowadays, at least in a metaphorical sense -- although I think it's safe to say he's still opposed to the organized Christian religion(s). Whether this denotes a true belief that Christ has real power or whether it's he's just overcome his disgust of Judeo-Christian metaphor will probably stay as much as mystery as it has with T.S. Eliot.\n\r\nWhat would frame such a huge transition?  Songs like \"The Grudge\" and \"Reflection\" and \"Disposition\" come to mind, where you get a definite sense of transition in Maynard.  In fact, with Reflection he even muses that our sense of self stems from a greater source of being, essentially \"God\", though that's certainly a word stained with centuries of gross graffiti.\n\r\nJambi was an ancient kingdom in Indonesia that stood on a major river and served as the waypoint between warring Buddhist and Islamic nations.  There is even a \"Legend of Jambi\", but I can't find any link to it at the moment.  My guess is that the song references this, since Jambi would be a powerful symbol of division between spiritual beliefs.\n\r\n\"The two become one\" I think means many things on many levels here.  It reminds me of how in the Biblical book of Romans Paul says that we are divided between the law of sin and the law of the I Am.  The two becoming one could be a reference to a resolution of this conflict, so that want and need are no longer in contridiction, but have become a unified desire, as in Taoism.\n\r\nIt may also reference how the \"Benevolent Son\", Christ, was both man and God, the Tao manifested, the two greatest opposites (Spiritual and Physical, Heavenly and Earthly, Death and Life, unified).\n\r\nAnd finally, it may also reference another letter from Paul in which he says this very phrase, that in Christ, \"the two have become one\", which in this context means that Jews and Gentiles are one people in God -- that God's chosen people transcends earthly barriers of race or religion.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nOh, and I think the last line is\r\nSilence leech and save your poison,\r\nSilence Legion, stay out of my way.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nOh, and finally, I just noticed, in relation to the \"two become one\" and allusions to Christ in this song, it's interesting to note that the opening beats (not time sig, which is 9/8 or whatever that craziness is) are 6, then 7, 6, then 7, repeated 40 times.\n\r\nIn Jewish Gematria, these numbers mean\r\n6 = man\r\n7 = God\r\n40 = trial or test\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nYou guys are thinking about this way too much. It's like that scene in Batman: The Movie with Adam West, when they figure out how the shark attack on Batman is the result of four super villains teaming up to take over the world. \n\r\nSeriously, if you clowns having figured it out by now, every person in the band is a complete nerd. They wouldn't name a song which mentions wishing after a province in India. It's just a pop culture reference.\n\r\nThen this ass busts out the Pi nonsense. Damn\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nI think you need to Chillax Nafzger. People can look as deeply, or as shallowly as they want into Tool's music. Therein lies the beauty of their art. Anyway, as for the 'two become one' part, it could be a reference to \"Right in Two\". Seeing as how we have divided so much, the two becoming one could simply be a reunification of these divided parts e.g; countries, religions etc. I think that understanding the rest of Tool's work will help us understand this album better.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nI think that it says 'kneeling away my CENTER' not my santa. but if it does say santa then maybe the theory of this song being about society and stuff then maybe its talking about peoples greedy-ness,and how today people seem to worship santa and presents.OR maybe santa means saint in this song, because santa in spanish means saint.  i dont really know. maybe maynard just made this song to screw around with all us tool fans.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nI agree SY5TEM. It definately says 'kneeling away my center'. This correlates with the line 'your my piece of mind, my own/ohm, my center, just trying to etc.'\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nSorry if I was a bit rambling in my last post.  Ultimately it's just my opinion, and I personally feel that this song is about the resolution of an internal personal and spiritual struggle within Maynard.  This whole album has a very personal sound to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\n\"every person in the band is a complete nerd\"\n\r\nheheh, I think you hit the nail on the head with that one. these guys are ultra-nerdy religon-philosophy-mysticism nuts. that why i like em so much!\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nI also think the \"Benevolent Son\" reference works on several levels ... the son (Jesus) would represent Maynard's respect for his departed mother, Maynard's own role as a son, and his own son.  So it's a simple symbol that creates a continuity through the poet's entire life, much like the \"Sun\" creates a continuity through every generation of mankind, despite all our differences of culture and philosophy.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nDamn I should have consolidated this into one post ...\n\r\nin at least one of the \"Dim/damn my eyes\" I think he is saying \"Jambi eyes\" ... along with my theory about Jambi = the indonesian kindgom, it was a sultanate, and he mentions something about kings and sultans and the beginning of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nLet me begin by saying i am new to this site, although not new to Tool, I love their music and Maynard is, in my opinion, one of the best lyricists out today. \r\nThis morning, I was reading some posts of fans' interpretations on Lateralus (my fav. Tool album, hands down) and I was surprised at how inciteful some of them were. It made me think of the lyrics in a whole new way. But then, I thought I'd read some posts on the 10 000 Days record since I've been listening to alot of it lately... \r\nExpecting to find some equally-as inciteful thoughts on Vicarious as I found on the Lateralus album, I was dissappointed to find that one of the first comments was not an interpretation of the lyrics, but some ass-clown named TREXOR who claims that 10,000 Days is a hoax (this was posted early 2006, before the record's release). Obviously at this time, we all know better. I had heard about these rumours following up to the album's release, but this guy spread it like it was etched in stone! \r\nI skipped through his ignorant rant looking for some thought into the lyrics and all i could find was pages and pages of TREXOR runnin his mouth about how everyones gonna look dumb when the album is revealed as a hoax. I then laughed at him. He must feel stupid now.\r\nI proceed to read text that was posted after the cd was released and naturally, everyone calls him out on his bullshit, and he doesnt even admit he was wrong!! Plus, the guy sounded like an infant throwing out the worst insults I've ever heard.\r\nI was SHOCKED to find that he spread his b.s. throughout most of the posts for this song as well, saying the new record and Jambi sucks, again without explaining his words...\n\r\nWell, I am a believer in free speech, but this little PUNK BITCH NEEDS TO HAVE HIS ASS ROYALLY HANDED TO HIM! WHERE THE FUCK DOES HE GET OFF JOINING A FORUM OF MAINLY TOOL FANS, AND BAD-MOUTHING THEIR WORK? I personnally think 10,000 Days could have been better, but to say it SUCKS??? Even in comparison of their earlier work, this record DOES. NOT. SUCK. Anyone who makes this claim without backing it up with some damn-well thought out reasons is just asking to be called an idiot. I've never seen a person so determined to stick around in a place where everyone hates him so much... i think I speak for everyone when i say FUCK TREXOR! \r\nAnyway, theres my rant, this will be my only post: dedicated to a big FUCK YOU to TREXOR, much like Pixiespider, my inspiration lol \n\r\nBy the way: TOOL is the GREATEST BAND on EARTH! my favourite songs are: H., Aenema, Hooker w/ a Penis, The Patient, and what I consider to be an epic 24-minute long story of [Dispostion, Reflection, Triad]. ---------and Maynard is NOT God, you dumbfounded dipshitz!\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nTREXOR may had been wrong but they had a right to write what they wrote. It's a shame that TREXOR was exiled from the message boards because I would've really liked to tell them about the synclist. Perhaps then they would've realised how great of an album Ten Thousand Days is.\r\nJust remember people, arguing online is like competing in the special olympics: Even if you win, you're still retarded. (not my quote)\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nhey you f**** trexor, why did you post your whole rant on the jambi page, is that what this song means to you,FUCK TREXOR,well sorry but that isnt a very good interpretation of this song. now i hate trexor as much as every one else but i am trying to find out what this song means not how much you hate trexor, so please stop wasting my time with your whining, oh, yeah and trexor doesnt even post on here anymore so whats the point.there will always be ass holes out there but you need to just ignore them.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nTREXOR makes me laugh.\r\nSo much controversy.\n\r\nWith that said.\r\nI'll be one of those annoying people that just comments on how much they enjoy Tool and how great of a song Jambi is.\r\nor\r\nI'll be one of those people that says the song could mean anything and that it has different interpretations by different people.\r\nor\r\nI'll be the one who talks about how great Marnard is.\r\nor\r\nSomeone who says a lot of nothing.\r\nWait........\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nLOLageness\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nhey (me) who the heck is MARNARD?!!!??\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nI'm seriously suprised nobody brought this up yet.\n\r\nI think that, not only does it refer to the Sultan of Jambi (an Indonesian province), and its style (Jambi is Finnish for iambic, the meter in which this song is written), but the character on Pee-Wee's Playhouse as well. He would appear whenever someone said the word \"wish\", which Maynard says multiple times in this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\n\"But I, I would wish it all away \r\nIf I thought I'd Lose you just one day\"\n\r\nummm not to be a stupid idiot... but didnt Maynard recently get engaged?\n\r\ncould this possibly be a really odd(maynards norm) love song to whatever person he chose to spend his life with?\n\r\nsaying he has everything he could ever want as far as material possessions... but he would give it all up for her? This isnt typical of his music... and i dont think im right... its just a possibility...\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nIts not nessecarily about the destination,but the \r\njourney.\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nIsn't that from Monkey Magic?\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nFUCK TREXOR...lol...Thankyou for making that name.\r\nAnyways just want to say that I cant wait till I see Tool live; especially this song...My first Tool show ever...cant wait.\n\r\nBack to TREXOR, I don't know how a Tool fan (which he claimed to be...) can possibly hate the 10,000 days CD. All Tool songs have one thing in common. They all have amazing build up to the end of the song, especially this one and 10,000 Days. I bet TREXOR put on the CD and listened to The Pot and read some of the lyrics and gave up on it because it was different from what he was used to. I bet now after he's listened to the songs he actually likes it. It took me a while to start liking the CD, but I didnt go off saying I no longer liked Tool because they did something different.\n\r\nFuck you Trexor, Fuck you up your stupid ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nJambi is an Indonesian island\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nThis song is (in my opinion which prolly means crap to all of you) about the wish that Maynard can take back the song Judith, the King and sultan are merely a metaphor for him describing himself as a rockstar despite his King like power and sultan like treasures he would wish all that he said in his previous albums concerning his mothers faith back not because he now found god but because he loved his mother and respects what she loves. \n\r\nSomone already prolly said exactly what I said but I got sick of reading through all your pointless argueing\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nI'm not gonna get into any of the deep shit you folks are talkng about, but I do love the solo and the whole \"Dim my eyes\" part\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nIn response to this guys comment...jackrules or something. ya ik its been awhile but oh well..it bothered me.\n\r\nvvvvvv\n\r\n\"\"\"You know he's right. You tool fans often state your opinions as fact, and if someone gives an opinion that does not coincide with your own, you are always quick to say \"Keep it to yourself\" or \"if you don't have something nice to say, don't say anything.\" Children, this is not how the freedom of speech works. Just because you don't agree with someone doesn't make them right or wrong. What the fuck do you care if this fellow doesn't like the album? Did you write the album? Do you think the people who wrote the album care? No, they don't. You chump stains really need to grow the fuck up, already. It's only a band.\n\r\nAs for the song, the title is, no doubt, in reference to Jambi the Genie. That is why there is that whole wish theme. Tool are nerds, if you hadn't guessed already. They dress up in full costume and go to Star Trek conventions and people don't even recognize them, so why is it so hard to digest that everything they do doesn't have to be something important? Why can't the song title be in reference to Pee-Wee's Playhouse? I suppose you're the kind of dumbass tool fans who will tell me Maynard's Dick has some deep link to quantum immortality or some bullshit you really don't know anything about, but pretend to know about.\"\"\"\"\"\"\"\n\n\r\nI dont agree with ur defenition of a tool fan...i just dont think we like people dissing the music when people are trying to figure what the song meens. If he doesnt like the music and he can go fuck off and not even come here (trexxor)...and it aint about pee wee's playhouse i believe its about Jambi the seaport that was hit in Indonesia by the Tsunami....Sure maynard makes a connection with the whole wishing thing but thats just him being clever....so before u call us children think a little harder and get ur facts straight.\r\ngo listen to fall out boy or something.\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nDespite jackrules' shortcomings he did have a point. People are to quick to flame someone because their opinion is different to the majority. Too often I read (in a nutshell) \"So, you don't like Tool's new stuff huh? Well FUCK YOU!!!\" Rather than respond in this way, it may be better to ask why they don't like Tool's new stuff. After that, if they turn out to be a total prick then it's okay to tell them to go fuck themselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nFuck TREXOR! Hope he dies a firey death, stupid ass mother fucking bitch.\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nYAAYYYY FUCK TREXOR UP HIS FUCKIN ASS. MAN I HATE THAT NAME SO MUCH, \"TREXOR\" what kind of fuckin name is that. A HOMOSEXUAL CANNABALISTICAL FAGGOT's NAME thats for sure\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\ni think this song is about his son, he is telling him that all the material goods don't matter to him as much as he does. The song name i think is from pee wees playhouse the genie was named Jambit, hence \"i would WISH it all away\"\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nI'm pretty sure that the lyrics in one part of the song go\r\nDim my Eyes if they should compromise this fulcrum want and need divide me then i might as well be gone\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nwow, nine pages, twasn't all a waste of time though, interesting facts and views i might add...\n\r\n.balance.\n\r\ncenter.fulcrum.division\n\r\nwant:need\n\n\r\ncall me crazy, however, poetically, the open lines should be:\n\r\nHalf in the King's mountains view\r\nHalf in the wild dream come true\n\r\neven if they were not written or sung as such...\n\r\nalso:\r\ndamn his eyes if they should inflict or influence an offset in the balance (fulcrum) that he has found in his own ways...\n\r\n.:leon:.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nThis stikes me as odd.It's been almost a good year since this song has been posted on SongMeanings, and people are still worried about what one person said when it first came out.  People are infact intittled to their own opinions, wether you like what they say or not. So maybe they don't like something.  How the hell is this going to offend you personally.  I know I might as well be called a hyprocrite from bringing this up, too.  But hell, people.  You practically spam this site from your bullshit ranting. If  you had any sense you would ignore something so immature as what some people say, but your head is too far up your ass to realize that.This site is about meanings to songs.  Not \"this song is so amazing how could you be such a dipshit and think otherwise and since you do you are not intittled to your own opinion because  you're opinion is wrong since it's different from mine.\"Shit.I come here to find out the real meaning of the song, but really, no one has found the exact meaning behind it because you're too worried about what other people have to say.So what if they don't like this song.  Maybe you don't like a song that they think is cool.And another thing, some of the things you say could possibly personally offend other people reading them.  One person posted that they were dropped on their heads as a baby.  Yeah, I happened to be dropped on my head as a baby.  It was a pretty dramatic time for people who wittnessed it and they don't like remembering it.As for my opinion of this song, it's totally amazing, though I wish someone could figure out what the hell it's really all about.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nthis is a little out there, i'll post it anyway...\n\r\nthe words: i, it, you & son all refer to maynard\n\r\nalso the verse,\n\r\nIf I could \r\nAnd I would \r\nWish it away \n\r\ni don't believe these lyrics are implying if he were granted a 'wish' capability, but more along the lines if he \n\r\n'could' bring himself to wish away everything he has always 'wanted'...\n\r\nhe has found a metaphoric reasoning between both good and evil that brings pleasure to him, and if it was somehow \n\r\ncapable to fuse the best of the both worlds, life in itself would be harmonious...\n\r\n.:leon:.\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nI actually read somewhere (Can't remember exactly, maybe a wiki) that this is about his mother.  Maynard's mom recently died, and he wrote a few songs about her.  Jambi, Wings for Marie, and 10,000 days.  \n\r\nThis would make sense with the overall theme of the song: Maynard has everything, has done everything, but would give it all away to have his mother back in his life.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nKickingbird: by saying i, it and son rfer to to maynard, do you mean that he would wish himself away?  that sort of doesnt make much sence...\r\ni think him wishing his lifestyle away would make more sence... like SoBe8503 said..\n\r\nI think that yes this song was meant to be recieved on at least 2 levels.. the more obvious being about his mother.\n\r\nBut like most song i can sorta feel a big spiritual/religious over tone. the first thing i think when i hear the first line is dwarves and odinism. and christianity through the devil, although that could just be a general refernce to personified evil...\n\r\nIm pretty sure its \"prayed like a matyr dusk till dawn\" as well...\n\r\n\"Dim my eyes\" sounds like hes trying to avoid or shelter himself form the light that seems to overwhelm him and he supports in the rest of the song.. not sure what thats about.\n\r\nanother thing that confuses me is breathe in union, in union with what? i dont think he is refering to his mother there.. dunno\n\r\none thing i am sure about is the leeches at the end is reference to \"ticks and leeches\" from lateralus..\n\r\nSorry for the lack of order\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nyes, he would wish himself away, i.e. 'damn his eyes if they should compromise the balance' and if were to compromise said balance 'then he might as well be gone' \t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nbeing gone is as good as being \"wished away\"...\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nSoBe: his mother's passing was not a consequence of his lifestyle/actions though... so why would giving up the things that brought him pleasure have any effect on her well-being? even if he lived within a perfect lifestyle his mother would have left this earth in the same fashion...\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nalso:\n\r\nyou're my peace of mind, my hope, my center\n\r\nnot home \t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nagain, poetically speaking...\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nits quite simple\r\njambi is a country close to sumatra and part of indonesian isles its about a king rising from the underground\r\npossibly a drug or crime lord\r\n\"Here from the king's mountain view\r\nHere from the wild dream come true\r\nFeast like a sultan I do\r\nOn treasures and flesh, never few. \"\r\nand theres lines that back up that it is drug or crime\r\n\"\r\n(The devil with his had me down)\r\nIn love with the dark side I'd found.\r\nDabble in all the way down\r\nUp to my neck soon to drown. \"\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nNO NO NO Nswsurfy thats too blunt\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\ni would like to think maynard is putting down his crown for all to see the humbling of the pretencious metal king/queen.but i personally feel like its a slap in the face of the born-again experience due to the fact IT'S FUCKING MAYNARD who has red lights beaming down on him.ps 10000daysconceptallalbumscombinedfinaldisc?\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nI think each verse is about a diferent experience in his life, i only have one verse figured out\r\n(The devil with his had me down) \r\nIn love with the dark side I'd found. \r\nDabble in all the way down \r\nUp to my neck soon to drown. \r\nBut you changed that all for me \r\nLifted me up, turned me round \n\r\nI think this verse is talking about a religios experience that he had where he turned away from satan and turned to God, the verse i believe is not talking directly to God but is talking to the person (i think for some reason a girl) that convinced him to turn to God. Either that or this is all ttl BULL and im an idiot, peace and plz reply to my post =)\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nDim my eyes\r\nDim my eyes\r\nDim my eyes if they should compromise\r\nOr fall from what sin need you find within\r\nI might as well be gone\n\r\nSHOULD BE IN MY OPINION:\n\r\nDamn my eyes!\r\nIf they should compromise a fulcrum:\r\nWant and need divide me\r\nThen I might as well be gone...\n\n\r\nThis really makes the album more cohesive to me. Right in Two is another great song, but what could maynard mean by cutting it all right in two? This is the answer. Want and need. think about it. Think about how it really goes along with the idea of both Jambi and of Right in Two. What else could be cut right in two?\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nby the way, what i think are more accurate lyrics are at\r\n:\n\ntoolshed.down.net/lyrics/…\n\n\n", "comment_233": "\nRegarding the \"Dim my eyes\" part, thse are lyrics from Opiate:\r\n\"Jesus Christ why don't ya come save my life now, OPEN MY EYES BLIND ME WITH YOUR LIGHT now\"\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nit could be 'compromise our fulcrum', as if he were talking to 'himself'...\n\r\nand the other song is about our inability to share, in turn, the inevitability to divide anything and everthing just so we can call these divisions our own...\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\ngood call. by 'compromise a fulcrum' i assume he basically means to disrupt the sort of natural balance for personal benefit, but if u could elaborate on why you think it could be 'our fulcrum' id be interested. I like the comment on 'right in two' though, that clears things up for me a little. However, if were taking the words more literally, for lack of a better word, then it seems odd that he would choose the three words \"right in two\" to be the sort of main idea of the song when splitting everything into divisions to gain ownership would make more sense if he said \"cutting it all into billions of little pieces,\" if you know what i mean.\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nI believe that this song describes a figure, or person that Maynard cannot live without and whom had a significant impact on his life  This person \"lifted him up, turned him around.\"The first figure that the lyrics suggest is Jesus.  However, this is not highly probable considering that we all kind of know that Maynard isn't a huge fan of Jesus.  Maynard says that he would give up posessions and pleasures just to not lose this person from his life.  It sounds like this relationship that he has fulfills needs he has.  He says \"and got what I wanted all along.  He also refers to them as a Santa, in a manner of speaking.  Does this refer to Maynard feeling like Jesus could be this figure that people abuse thinking that he is someone who grants wishes, or delivers gifts to the prayer?  But I digress.  Whomever Maynard is describing, he seems to suggest that this person is providing him with something and in turn, this person is a part of him and completes him.  However, if this person was ever in danger of leaving, he would gladly give up the things he has been provided.  Maybe this doesn't make sense.  Hopefully it contains some useful insight.\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\njambi89, true, however, a division has to start somewhere and in this case he's talking from the so-called 'beginning', \"don't these talking monkeys know that eden has enough to go around?\"...\n\r\nthe world is too big for one to own (plenty to share), it is also too small, which causes our greed & insecurities to want/love to own, with love breeds fear, fear breeds confusion, confusion breeds war...\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\npoetically, \"compromise our fulcrum\", would seemingly indicate that he is talking to someone on a personal level...\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nread my short comment on page 9, basically says what you stated, and when i say 'our' i mean, him and whomever else that provide integrity to the 'fulcrum', also a fulcrum can also work on a three-way division as well, mind:body:soul\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\ni had to make this account just to dritisize TREXTOR or w.e\r\nhow fuckin dare he?! if he doesnt like tool then he shouldnt comment on them at all..fuckin douchebag..\n\r\nTOOL ROCKS MY SOCKS\n\r\nwow..extremely deep opinions, guys\r\nyou all are doin like, a complete analysis on this song..jesus\n\r\nill go with any positive remark about this song\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nTREXOR is awesome. Whoever you are.\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\ni can REALLY relate to this song. especially the part about eyes. and fulcrums.\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nAfter listening to Jambi over & over along with the rest of the entire album & reading multiple interpretations, I've grown to view Jambi as a great song towards the end of the album. Let's face it, it's just plain f*cking epic. Maybe not as epic as the intension/RIT duo, but damn close. The last couple of minutes in it could easily end the album well. Especially how it echo's \"stay out of my way\".\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nHey , everyone, everyones favorite is back, TREXOR!!!! Congratulations on making all thes TOOLS mad over your pussy little WORDS.          TREXOR= PAUL Damour???!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nWelcome back TREXOR!\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nNot sure what this song means, Maybe its not supposed to mean anything.  Maynard is a trip and anythings possible.  Trexor may be right though about a good portion of this CD.  I don't care much for any of the other songs except Pot and Vicarious.  The rest seem to be a bad attempt at recreating the Wall or something.\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nI also agree that the bass lines are exceptional.  Saw Tool a few months back and will be seeing them again in July.  Awesome show\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nI think that this is about his mjk mother.\r\nbut because jambi being the name of a place and a genie he's tied in the themes of wishes and sultans etc.\n\r\ni strongly agree with the people who have said that even though he is (or was if you like) an aithiest, he still had to 'Prayed like a martyr from dusk to dawn' that his mother goes to heaven even though he doesn't necisarilly believe it excists, because thats all he could do.\r\nIt sounds like at the end that he's saying 'pray in union' rather than 'breathe in union'\n\r\nthats my opinion, i maybe wrong, but im open for discussion\n\r\nbut thats only the lyrcs this song fuckin rules man, amazing musicianship on all acounts.\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nHere's what i hear...\n\r\nHalf in the king's mountain view \r\nHalf in the wild dream come true \r\nFeast like a sultan I do \r\nOn treasures and flesh, never few. \n\r\nBut I, I would wish it all away \r\nIf I thought I'd Lose you just one day \n\r\nThe devil with his has me down\r\nIn love with the dark side I've found. \r\nDabble in, all the way down \r\nUp to my neck soon to drown. \n\r\nBut you changed that all for me \r\nLifted me up, turned me around \r\nSo I...\r\nI... \r\nI... \r\nI...\n\r\nI would \r\nI would \r\nI would \r\nWish this all away \n\r\nPrayed like a martyr dusk to dawn \r\nBeg like a hooker all night long \r\nTempted the devil with my song \r\nAnd got what I wanted all along \n\r\nBut I \r\nAnd I would \r\nIf I could \r\nAnd I would \n\r\nWish it away \r\nWish it away \r\nWish it all away \r\nWanna wish it all away \r\nNo prize that could hold sway \r\nOr justify my\r\ngiving away my center\n\r\nSo if I could I'd wish it all away \r\nIf I thought tomorrow, It'd take you away \r\nYou're my peace of mind,\r\nmy hope, my center,\r\njust trying to hold on,\r\nOne more day \n\r\nDamn my eyes,\r\nDamn my eyes,\r\nDamn my eyes if they should compromise our fulcrum,\r\nWant and Need; divide me,\r\nThen i might as well be gone...\n\r\nShine on forever \r\nShine on benevolent son \n\r\nShine down upon the broken \r\nShine until the two become one \n\r\nShine on forever \r\nShine on benevolent son \n\r\nShine on upon the severed \r\nShine until the two become one \n\r\nDivided withering away \r\nDivided, wither it away \n\r\nShine on upon the many, light our way \r\nBenevolent son \n\r\nBreathe in union \r\nBreathe in union \r\nBreathe in union \r\nBreathe in union \r\nPray in union \r\nSo as one;\r\nsurvive,\r\nunder the day\r\nand season\n\r\nSilence leech, and save your poison \r\nSilence leech, just stay out of my way...\n\n\r\n_____________________________________\n\r\n\"So if I could I'd wish it all away \r\nIf I thought tomorrow, It'd take you away\"\n\r\nThis line, if sung as such, really alters the way\r\ni was originally percieving these lyrics.\n\r\nIt would state that he doesn't want to change his ways; and if he could, he would wish it all away if it would get rid of this \"being\" that is trying to sway him into being something he is not.\n\n\r\nAs you recall .jkm. will \"play on words\" in such a subtle manner that it is often translated as something other than it really is...\n\r\n\"relax, turn around and take my hand\"... sounds inviting doesn't it? extreme violation if put into it's correct context...\n\n\r\nwell, that's my take so far, so i'm waiting for someone to contest my thoughts, or elaborate on them if they so wish to...\n\r\nthanks, leon...\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nwow this song is great. in my opinon the best on the cd. woo i get to see them soon. i cant wait.\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nI couldn't be bothered reading ALL of the posts, but I think a lot needs to be made of the lines including \"benevolent son\". It was rumored that Maynard had found god not too long before 10,000 days came out.\n\r\nDid he indeed find god? Then what do we make of the line \"tell them the killer of faith has ascended\" in another song?\n\r\nThoughts?\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nto collaborate on what i noted earlier below are more chunks or my thoughts:\n\r\n\"But you changed that all for me. Lifted me up, turned me around so I would wish this all away\"\n\r\nThe mere fact that he draws this line out into saying \"I\" seven times is only steering the novice listener into believing that the \"wishing away\" of the things that he is \"in love\" with, is his infact his choice. which it's not. benevolent maynard? i think not...\n\r\nif the sentence is not broken up, he is implying that someone/something else has interfered with his ways and is trying to redirect his attention to something that he is not and never intends to be. almost like the action you would inflict on a child or pet in order to redirect their attention and or to instill shame into their minds in return for a gift or treat. In this case \"no prize could hold sway\" because the benefits/lifestyle are definately outweighing any consequences to him.\n\r\nthe above makes me lean on the below even more...\n\r\n\"So if I could I'd wish it all away, \r\nif I thought tomorrow, It'd take you away\"\n\r\nIt'd is (the wish)\n\r\nyou is (the interference, the benevolent)\n\r\nHence the 'mocking' from \"Shine  on forever\" to \"under the day and season\"\n\r\nhe makes sure to close with his personal thoughts in the last two lines...\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\njohnny,\n\r\nit's \"pillar of faith\" as in a \"model christian\", model enough to step outside a comfort zone and aim to be nothing but the best for mankind and god...\n\r\nhis actions in the last few years of his mother's life, despite the publicity, was most likely to help him cope with her failing condition and to also provide a sense of accomplishment for is mother, he wanted to be 'worthy' in her eyes, and only her eyes, because she was the one who had faith in him...\n\r\nagain, in anger, he is mocking by summoning in a demanding way that the trinity should stand before judith and welcome her into heaven for all that she has done for them, almost to the effect that \"they are somewhat debted to her\"\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nSomething i recently learned was you havent listened to Tool until you listen to them on a really good system. I recently got a lexus and omg when i put this song on it was heaven. This song fucking rules. fucking 5 days till my first tool show and im already shitting in my pants.\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\n\"Silence leach, save your poison\"\n\r\nTies into his mother possibly? Sounds hes telling the medical profession to f*** off and save their cures (poison), because Maynards mother was paralyzed for 27 years and doctors couldnt do anything for her. Hes saying \"shove it, Im not a firm believer in God, but it seems like a shot\" This is where the genie and wishing comes in. (By the way, his mother was a very firm believer and so they \"prayed in union\") Also, goes well with the song 10,000 days and the album. (10,000= approx 27 years, OMG CONNECTION)\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nMaybe it says 'pray like a barter dusk to dawn, as if in saying for himself because a barter would want a better deal and naturaly humans are greedy and maynard  wants his mother to stay alive for him, and well, being paralyzed for i gues 27 years^^  he thinks it would be better for her to die.\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nSpeaking as a practicing Jew of Lebanese decent, a registered Republican (although my political leanings tend to be more Libertarian), conservative on most issues, member of the Oklahoma National Guard, I am probably the last person that anyone would think of as a Toolhead.\n\r\nThat being said...I am.  I might like other bands more if TOOL didn't make them look like they just entered kindergarden while MJK and crew have just finished their 5th post doctorate with 10,000 days.  I mean, seriously, most other bands look like they should write jingles for comercial by compare.\r\nForget double entendre, TOOL songs tend to have deci-double entendres...all very valid.\n\r\nStop sniping that one interpretation is corret while others are not.  They are all correct.  It was written that way.  \n\r\nJambi is an excellent song that can be taken at face value while also being open for interpretation.\n\r\nNow for what has seemed to be the real topics of this post.  TREXOR and the Disgustipated vs. erb (D v. E) debate.\n\r\nAlthough I disagree whole heartily with TREXOR on the value of this most recent TOOL release; I do agree that if I don't get some tacos soon that I shall soon perish.\n\r\nAs for D vs. E.  Go through those threads again to see how 2 people can be at odds end with each other both civilly and thoughtfully.\n\r\nTruths as maybe only I see them:\r\n- It is okay to be religious, agnostic or athiest.  Just not sheepish, and all three can be.\r\n- Science and G-d are not incompatible.  And only the narrow minding would thing as such, whether it be only science or only G-d.\r\n- More people have been murderd due to absence of religion than to religion, but not until the last century when three experiments were carried out.\r\n  - 16 million in Hitler Germany\r\n  - 50 million in Stalin Russia\r\n  - 100 million in Mao China\n\r\nBTW to save some of you time...I already know that I am a dumbass and have no life, but I don't plan to rebut any future comments concerning my post so do your best.\n\r\nCan't wait to see what TOOL puts out in 2011, or what APC and Puscifer put out in between.\n\r\nMJK for Prez.  Write in vote since it won't seem to matter which two losers the big parties put forth.\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nTREXOR\n\r\nor should i say ANT/LEX? i havent yet figured out which but im thinking lex, either way sup? you really know how to piss people off dont you lol, but then when it comes to tool you dont take shit from anyone, but if you read this before you get kicked off the site, hi there! later\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\ni believe the benevolent one is the leach in this case... although, i do like your medical analogy snow.blind...\n\r\ni can't wait to map the lyrics of this album...\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nhey goofneck, nice to see another Oklahoman on here, oh yes and here is what im thimking, maybe, JAMBI could be some enochian word, possoibly, such as Faaip de oiad is. if we find out what the jambi thing is , then maybe wii could figure this thing out, oh and tool kicked ass on this song here in OKC.\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nOk everyone just to let you know why the name of the song is Jambi.  If you watched TV in the early 90's late 80's there was this tv show called pewees playhouse, and in this playhouse their was a genie called Jambi that Pewee  would ask for wishes.  That is the significance of Jambi, Meka leka hi, meka hiney ho! and your wish is granted.\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nO.K.,  there WAS a genie in pewweee but thats too obvious and simple, plus its a part of pop culture, which maynard is obviously aginst  and dont forget the island of jambi  in asia, and also this song can be about anyone- or anything,  i am starting to think that many of the things TOOL does is in honor of pink  floyd, because there are many similarites in tool and pinks stuff, shine on, you crazy diamond, shine on forever benevolent sun!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nOK, the point of this is to say what the song means. None of that is saying whether or not it rox your sox or not. Get over the fact that some people don't and won't like a song! I came on here cause the song wasn't meaning anything to me and now I understand the title because SOME PEOPLE can use the site for what it is for and not argue.\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\no.k , but you just put in a meaningless comment,  and now you are a hypocrite and now thanks to you, so am i  (dont argue!!)\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\ncorrection to the lyrics\n\r\nNo pressure could hold sway\r\nOr just a fine line\r\nKneeling away, my Santa \n\r\nis \n\r\nNo pressure could hold sway\r\nor justify my\r\nknelling away my center\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nyah,   santa sounds kinda stupid.  i think it might say   \"no prize that could persuay or justify my kneeling away my center.\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nstrong then weak, using the jambic pentameter.....\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nand what exactly is that?\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nDISGUSTIPATED &\r\negb\r\nI've read their conversation back and forth, I think they have really good points, And I agree totally.\r\nOpened my mind some. \r\nAnd I see how religion can relate to this song,\r\nhis mother... or his son...\r\nAnd this song is pretty much one of my favorites by tool. (: thnx.\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\n(MY TWO PENNETH IS IN BRACKETS)\n\r\nHere from the king's mountain view \r\nHere from the wild dream come true \r\nFeast like a sultan I do \r\nOn treasures and flesh, never few. \n\r\n(fame and fortune. Where he finds himself)\n\r\nBut I, I would,  wish it,  all away \r\nIf I,  thought I'd, Lose you just one day \n\r\n(TORN........cant live with it fame/fans/ : can't live without it)\n\r\nThe devil AND his had me down\r\nIn love with the dark side I'd found. \r\nDABBLING all the way down \r\nUp to my neck soon to drown. \r\n(HINDSIGHT.....drunk on ego/power (or an addiction of somekind) looking back.......Where in time is anyones guess. The guy is human after all)\n\r\nBut you changed that all for me \r\nLifted me up, turned me round \n\r\n(Friends/colleagues/fans, human nature? SOMETHING/ONE, a point, life changing experience)\n\r\nSo I, I, I,I, \r\nI would, I would, I would \r\nWish this all away \n\r\n(it's not all good)\n\r\nPRAY like a MARTYR dusk TIL dawn \r\nBeg like a hooker all night long \r\nTempted the devil with my song \r\nAnd got what I wanted all along \n\r\n(wanting fame, or just recognition. A&R(devil) bingo record contract.......... quote \"i sold my soul to make a record, dipshit man, you, bought, one!!!\")\n\n\r\nBut I, And I would, If I could \r\nI would,\r\nWish it away, Wish it away \r\nWish it all away, Wanna wish it all away \r\nNo PRIZE that could hold sway \r\nOr justify, MY \r\nGIVING away, my CENTRE \n\r\n(i'm not letting the world see all of me, i want to remain human/my own no matter how much filthy lucre is on that table!)\n\r\nSo if I could I'd wish it all away \r\nIf I thought tomorrow, They'd take YOU away \r\nYou're my peace of mind, my home \r\nI said I'm just trying to hold on \r\nOne more day \n\r\n(a crutch, posession. Almost love, the tone of voice is everything, LISTEN)\n\r\nDAMN my eyes \r\nDAMN my eyes \r\nDAMN my eyes if they should compromise \n\r\n(i mght (want to) destroy all this but it would destroy so much more)\n\r\nOUR FULCRUM (of) WANT AND NEED\n\r\n(they produce we consume (aNother To0L?) it's a hard balance to maintain spiritually AND ethically)\n\r\nDIVIDE ME\r\nTHEN I MIGHT AS WELL BE GONE\n\r\n(if all us poor dipshits had a piece, he might as well not be (his own bad self)\n\r\nShine on forever, Shine on benevolent sun \r\nShine down upon the broken \r\nShine until the two become one \r\nShine on forever \r\nShine on benevolent sun \r\nShine down on upon the SEVERED\r\nShine until the two become one \n\r\n(Tragic opimism, the universe is what it is. The severed and broken speak for themselves. \"the two become one\" end of the world/time..... 2012 ? whatever....... all are equal and \"they'll (devils) get theirs in the end\"\n\r\nDivided, withering away \r\nDivided  withering away \r\nShine DOWN on upon the many, light our way \r\nBenevolent sun \n\r\nBreathe in union, Breathe in union \r\nBreathe in union, Breathe in union, Breathe in union\r\nSo \r\nas one survive \r\nANOTHER day and season \n\r\n(hope again......irrepressible humans, lets just survive and not try to climb higher that each other, kill, maim, or destroy, find a way to BE one.)\n\r\nSILENTLY,  JUST SAVE YOUR POISON !\r\nSILENTLY,  JUST stay out of my way !\r\n(love y'all but, you live your life, and i'll live mine)\r\n=====================\r\nPEACE. OUT.\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nFantastic song, the rhythm and timing on the bass and guitar are stunning!\n\r\nI would like to post  a lyric correction: It is not \"santa\" it is \"sin\". \"kneeling away my sin\".\n\r\nI think that is correct.\n\r\nAlso> The song is about how he is famous (king's mountain view), he's indulged in his fair share of bad things (dark side), but he'd trade it all in a second for more time with his mother - the benevolent sun.\r\nAs for the title... no clue!\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\ntrextor seems like a clown but enough of that this son is about his son, and how the life of a rockstar is interfering with it\r\nhence why 'i would wish it all away if i were to lose just for one day' and as a father and someone trying to get in to the music world i love this song\r\nand to be honest as a tool fan i have never liked any of there albums to begin with in fact i hated all of tool at first but then they hit me as did this song\r\nit is very emotional shit and this is why i love tool it is not just music it is meaning and a deep meaning at that and people who think they suck because they don't like a song or an album meh stiff shit go listen to something else\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\ni think it's either about his mother or his ability to be an artist.\r\nmother: his mother was paralyzed and confined to a wheelchair for almost 3 decades and died not too long ago and he's written more than one song about her (most notibly 'judith' with a perfect circle).  in the past it seems like he's expressed his anger with religion, so i'm thinking that perhaps she was truly devout and he, being a loving son, was also (at one time), but her sickness shook his  belief (the devil and the darkside stuff... even though i don't think he believed in that, but those are terms his mom would be more in tune with).  \n\r\nhe's been very successful, but he'd trade it all. in theory, to save her and appease his own needs, but his OWN belief system is that of balance.  this balance would be thrown off somehow if he could and did trade it all for her.  in turn he learns that this balance is kept with losing her through his permanent spiritual union with her (two become one).  the jambi stuff comes in as a theme of wishes and the imagery of kings and sultans.\n\r\nartistry:  he's become incredibly successful doing what he wants.  if he ever had to compromise he'd just quit and let his career die because he's found a balance in success and freedom of expression\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nI believe this song is about Maynard's mom and she helped get over his demons.\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nthis is a deeply spiritual song showing the postion of man today -Devided form the source( call it god if you want) , devided consciousness. why? becouse ofthe LEech(devil), who tie  us down , tempting us (the devil with his hase me down\") and the hope for maynard that the light of God will shine on forever until we become one with him. This song is connected in a very deep space witn Right in two. think or feel about it\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nI just seen tool earlier this month in Albany and they opened with jambi, it was great, i snuck in a recording device and got it all on tape, its great maynard stretched the vocals in the beginning of it so it sounded different than the album version but very satisfying\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nthis is what i believe the correct lyrics to be, it makes more sense if you listen to maynards references to saturn\r\nand eleven on previous cd's and even more sense if you know what they are.\r\naditionally i thought he said\n\r\ndamn my eyes salvation compromise but it really seems like\r\ndamn my eyes if they should compromise is correct.\n\r\nHere  from the king's mountain view\r\nHere from the wild dream come true\r\nFeast like a sultan I do\r\nOn treasures in flesh, never few\n\r\nBut I, I would, wish it, all away\r\nIf I, thought I'd, lose you just one day\n\r\nThe Devil and his had me down\r\nEleven, the dark side I'd found.\r\nDabbling all the way down\r\nUp to my neck soon to drown.\n\r\nBut you changed that all for me\r\nLifted me up, turned me round\n\r\nSo I, I, I, I,\r\nI would, I would, I would\r\nWish this all away\n\r\nPray like a martyr, dusk until dawn\r\nBeg like a hooker all night long\r\nSheltered the devil with my song\r\nAnd got what I wanted all along\n\r\nBut I, and I would, If I could\r\nI would,\r\nWish it away, wish it away\r\nWish it all away, want to wish it all away\r\nNo prize that could hold sway\r\nOr justify my kneeling,away\r\nMy Saturn\n\r\nSo if I could I'd wish it all away\r\nIf I thought tomorrow, would take you away\r\nYou're my peace of mind, my own\r\nmy Saturn's just trying to hold on\r\nOne more day\n\r\nDamn my eyes !\r\nDamn my eyes !\r\nDamn my eyes if they should compromise\r\nOur fulcrum\r\nWant and need\r\nDivide me\r\nThen I might as well be gone\n\r\nShine on forever, shine on benevolent sun\r\nShine down upon the broken\r\nShine until the two become one\r\nShine on forever\r\nShine on benevolent sun\r\nShine down upon the severed\r\nShine until the two become one\n\r\nDivided, withering away\r\nDivided, withering away\r\nShine down on upon the many, light our way\r\nBenevolent sun\n\r\npray in union, pray in union\r\npray in union, pray in union, pray in union\r\nSo as one survive\r\nAnother day and season\n\r\nSilence,Legion,save your praises\r\nSilence,Legion,stay out of my way!\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nThis song is very personal to Maynard.  My interpretation is that he is talking about his own son and how he'd give up everything for him.  He sings \"shine on forever, benevolent son, until the two become one.\"  this could refer to the many voices in Maynard's head (which are evident throughout the album in the multiple vocal tracks per song) and how his son will shine on until all are consolidated.  In this way, he transposes Jesus' role as the Son of the Father who shines, thereby uniting all fragments into one Unity.  The song is very simple and a personal statement by each band member;  each instrument holds its own underneath the polyrhythms but they mesh together very wellâ\u0080\u0094it's almost like a drum circle.  When played live, they use visuals of fire, further strengthening this effect.\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\ni think the song's name derives from the person from pee-wee's playhouse who always sticks his head out the box whenever anyone says the word wish, and i think his name is jambi\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nPerhaps Maynard was speaking from the point of veiw of the man in this myth. Just a thought\n\r\n\"The Myth and Legend\n\r\nOral traditions established the roots of Jambi's relationship with Java and the founding of the kingdom and Islam within it. According to the legend, in the fifteenth century a Turkish prince, shipwrecked on the coast, met and married Princess Selaras Pinang Masak, the ruler of the coastal kingdom of Tanjung Jabung, around the lower riches of Batanghari River. The couple had four children, of whom one, Orang Kayo Hitam, became the central hero figure in Jambi Legend.\n\r\nThe Javanese kingdom of Mataram was demand tribute from Tanjung Jabung and when orang kayo hitam was a young man he determined to put a stop to this. He traveled in disguise to the mataram capital, where a master smith was forging a keris with which to kill him. Orang Kayo Hitam killed the smith and seized the 'keris', which he later took back to Jambi. There it becomes known as 'Keris Siginjei', the symbol of royal power in Jambi. The stories goes that the Javanese ruler, fearing the wrath of Orang Kayo Hiram, called for a truce and sealed the agreement by arranging a marriage between his daughter Ratumas Pemalang and Orang Kayo Hitam\r\nAnother legend tells the incorporation of the upriver region into the kingdom and the establishment of the Jambi capital at Tanah Pilih, or chosen land, its present site. Orang Kayo Hitam is said to have journeyed upriver into the interior where he came across a log with a lock of black hair entwined around it, the hair, he thought of a beautiful girl.\n\r\nHe sees off in search for her and eventually came to a village where he found her guardians. As was the norm on occasions when men with magic powers met, he was challenged to single combat. Both he and his adversary leapt, thrust and struck at each other using all the skill of pencak silat, and the fight went on for several days. Eventually, however, orang kayu hitam proved the stronger.\n\r\nAs his prize, he asked the girl's guardian if he could marry her, but they were extremely reluctant for this strange black man to marry Mayang Mangurai, as she was called. They set him a test, traditionally considered to be impossible to fulfill. The test was in four parts. First he must hand over a mortarful of gold, second, the hollow of a blowpipe, third the sleeve of a shit, and fourth, a measure of louse heads. He had a year and a day to perform these tasks. Orang Kayo Hitam set off to Java where he easily obtained the gold. Neither did the other requirements present him with any difficulties.\n\r\nOn his return, the wedding gifts were handed over and the guardians had to concede. After the wedding, the young couple set off down the river in a small covered boat, following a pair of white geese. Mayang Menguarai's father had told them that when the geese left the water and settled on the bank for two days and two nights, there they should build a city. The place was this occurred was then known as Tanah Pilih. When Orang Kayo Hitam struck the ground for the first time with his knife, he hit a gong buried in the earth. When he hit the second time he hit a cannon. Many believed these to be the parents of the girl, transformed in their graves. Others believed that they had fled into the forests rather than embrace Islam. There they became the ancestor of Kubu People (Suku Anak Dalam), the forest dwellers that have retained their animist beliefs and hunter-gatherer existence.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nthis song scares my a little, Am I the only one who sees a lot of strong christian influences. The most prominant being, the Shine on Benevolent son part, if you think of it like son instead of sun, then the first thing to come to mind, or for me atleast was jesus...and like I said to me that's scary, in the entire album 10,000 days the strong occult overtones you see in all of this other work are replaced by more christan seeming stuff. Really I hope im just making it up but, who knows...ya know.\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nmaynardslyrics.com\n\r\nI think Maynard's words need to be shared with the world, in their most accurate form. He is something of a lyrical genius, and we all know this. The site is very simple, but the main object of my site is not the layout, it's the lyrics. You will not find more accurate tool/apc/puscifer lyrics anywhere. So feel free to browse, peruse, if you will, maynardslyrics.com ...\n\r\nI have all the Tool albums done, minus Opiate, which will be added very soon.\n\r\nAll his APC stuff, minus emotive, which will be added very soon.\n\r\nAnd as soon as his Puscifer stuff comes out, expect it to be added as well.\n\r\nIf you see any lyric or line that you feel is not what you think it should be, please feel free to email me @ magiclessmarker@maynardslyrics.com\n\r\n-magiclessmarker.\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nHaha, maynard talken shit about his own songs...aynard you are a funny man\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\ni love this song. Tool is wothout doubt my favorite band, their music has meaning, as well as kick ass musicians playing kick ass music.\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nEmbrace me, Song Meanings people, for I am a newborn Tool fan. I used to hate this band with a passion, but I have been positively influenced by my friend in to appreciating them. \"Jambi\" is my favorite song so far. I love the lyrics, I love the music, I love the meaning and I love Maynard's voice. Does he not sound simply sexalicious when he says the line \"Beg like a hooker all night long\"?\n\r\nBasically, I think the song is about a man who is completely in love with a woman [Jambi is a woman's name] who means the entire world to him. She is his life, the heart in him, his everything. All else revolves around her and if he thought she might be taken away from him for so much as one single day, he would give up anything and everything to keep her with him. It's absolutely beautiful. I want this to be me and my boyfriend's song.\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nAnyone wana tell me what the fuckin songs about .\r\nthats what this site is for .\r\ncome on guys, lets grow up and learn that fighting online is FUCKING STUPID .\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\ni can't really say much for a meaning on this song other then its very spiritual (about being reborn?) and the talkbox/guitar solo kicks ass. Oh and one thing to people who go around saying to other people that they aren't \"true\" tool fans because they don't like a certain song or album. is really any requirements for being a fan other than listening to the music? Just curious :)\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nI get the feeling this song is about us.  We are The Legion.  He would give all of his fame and fortune up to be rid of the burden we put on him to \"Light our way\".\n\r\nP.S. - The lyrics are wrong.  The correct lyrics have been posted on toolarm and toolband.\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nCorrect lyrics:\n\r\nHere from a kings mountain view,\r\nHere from a wild dream come true,\r\nFeast like a sultan, I do, on\r\nTreasures and flesh, never few,\n\r\nBut I would wish it all away if I thought Iâ\u0080\u0099d lose you just one day.\n\r\nThe Devil and his had me down.\r\nIn love with the dark side Iâ\u0080\u0099d found.\r\nDabbling all the way down.\r\nUp to my neck, soon to drown.\r\nBut you changed that all for me.\r\nLifted me up. Turned me round.\n\r\nSO I would wish this all awayâ\u0080¦\n\r\nPrayed like a martyr dusk to dawn.\r\nBegged like a hooker all night long.\r\ntempted the devil with my song.\r\nAnd Got what I wanted all along.\n\r\nBut I would wish it all awayâ\u0080¦\r\nno prize that could hold sway or justify my giving away my center so\n\r\nIf I could Iâ\u0080\u0099d wish it all away if I thought tomorrow would take you away.\r\nYou, my piece of mind, my all, my center, just trying to hold on one more day.\r\nDamn my eyes if they should compromise the fulcrum.\r\n(if) wants and needs divide me then I might as well be gone.\n\r\nShine on forever. Shine on, benevolent sun.\r\nShine down upon the broken . Shine until the two become one.\r\nShine on forever. Shine on, benevolent sun.\r\nShine down upon the severed . Shine until the two become one.\r\nDivided, Iâ\u0080\u0099ll wither away. Divided Iâ\u0080\u0099ll wither away.\r\nShine down upon the many. Light our way, benevolent sun.\n\r\nBreathe in union. Breathe in union. Breathe in union. Breathe in union.\r\nBreathe in union so as one survive another day and season.\r\nSilence, legion. save your poison. Silence, legion. Stay out of my way.\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nI felt that this album (10,000 Days) paled in comparison to Ã\u0086nima, which was completely and utterly brilliant in every way. The reason I feel this way is because throughout this album it sounded like they all had lost a lot of energy, even though they still have more energy than a lot of bands.\n\r\n     Something else that is on my mind is how people could think that this song is about a genie on a childrens show...Tool isn't made up of a bunch of juvenile delinquites, but rather, matured, seasoned musicians with enough musical talent and passion to find something better to write about than something like a genie named Jambi (which is pronounced Jam-BEE, not Jam-BYE as in the song). This genie mumbo-jumbo that people keep relating the song to is a COMPLETE coincidence! Please, believe on this! Tool write about subject matters with purpose to them (like an indonesian location in a time of crisis *HINT**HINT*)\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nI personally think that 10,000 Days is a concept album about insanity.\n\r\nVicarious - insanity due to mass media\n\r\nJambi - insanity due to love\n\r\nWings for Marie/10,000 Days - insanity due to religion\n\r\nThe Pot - insanity due to social conditions\n\r\nLost Keys/Rosetta Stoned - insanity due to drugs\n\r\nIntension - insanity due to human nature\n\r\nRight in Two - insanity due to war\n\r\nViginti Tres - insanity due to fear?\n\r\nI didn't include Lipan Conjuring because it's only 1 minute long and has no lyrics, therefore having no discernable theme.\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nemilythegreatduh: there was no fighting on this page, wtf are you on?\r\nthis is a very friendly area at the moment. i'm rather enjoying the interperetations. um, devilslittlesister, congrats on liking tool!\r\n^_^\r\ni'd never thought about the song in that way! it makes alot of sense as a love song, yeah.\r\nbut, as with all tool songs, tehre is never only one meaning.\r\n:]\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\noh my days raggeddruid, i think you're fuckin' right!\r\n:D\r\nand viginti tres... why particularly fear? i know there's a couple of words slowed down greatly, but what do they say? although yes, the general feeling of the song is fear. that could REALLY give you a bad trip.\r\n:/\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nI think this is about how he and his mother both disagreed on things (his dark side) but even though he is famous (kings mountain view) he would give it all away for his mom. \n\r\nOver half of the CD is about Judith (MJK's mom)\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nSo Maynard having been sadly disappointed at hearing Christana Aguilara's \"Genie In a bottle\" for the umpeenth time on the radio decides to consult with his own genie in the bottle - a bottle of Mexican tequila.  He asks that genie in the bottle (he looks sorta like a worm) to grant him a wish and his jambi says \"There are only a few wishes I can grant but I think I know what you want and I believe it's within my power to grant this one... speak\"  \"I wanna wish it all away\"  \"Granted\".  The rest of the song is merely drunken hallucination.  That was a joke but some of the posts here are far too seriess or even threatening (earlier). \n\r\nDo any of you have experience writing lyrics for a band?  Especially a band that plays in meters of 9/4 (and permutations) -- it's tough.  I'll bet Maynard's life is busy and much of it must filter into his music, intentional or otherwise.  Relationships seem manifest in this song but one can have a relationship with anything - even a bottle of booze.  What I'm saying is that these are confusing lyrics because the song is confusing.  The band often times has grooves laid out and so Maynard picks up a mic and starts to scat and improv.  If it's good he'll write it down.  He'll write down a good lyric wherever he is anyway,  I'm sure he carries around a notepad for it.  Another issue is that the lyrics you write seem alot different when you're in a different mood on a different day and what if the band totally changes the feel?  There's alot that can happen and you guys should know that the song is an entire package and knowing about the life Maynard lives (or speculating) only goes so far with this time of endevour.  The music has to come together to create something as unique as possible while maintaining consistancy - the guys have to like it basically, at least the other guys in the band. \n\r\nThe allusions to religious issues shouldn't be a big deal.  It's everywhere.  Anybody plugged into a society gets a fair dose of it.  It's just a tool anyway if one makes it out to be too big of a force it gains superficial power.  If the Lord has any real power at all he doesn't need to get that inflated by iterations of the same stories.  Jambi as Tool wrote it is their story as a band - one of many.  I gave you my story up above.  I said it was a joke but it wasn't really.  To me the genie that grants wishes could be a bottle a god a hallucinogen or just a dream with power.  That might sound bad but there is alot in this world that I'd just assume wish away if I could so that lyric right there pulls me especially with the style it's deliivered.\n\r\nOne last thing... this is mostly reiteration but why do you guys always have to bring into play Maynard when talking about lyrics?  Not all artists are so egotistical that they obsessively write only about their life and near tangents.  With alot of awereness (and I'm sure Maynard has plenty of that) you find numerous impersonal sources to draw inspiration from.  I prefer to hear people simply talk about what they want the song to mean or what they've decided it means and why... on a personal level for themself because you're all different.... I can only stand so many posts about Maynard's son and mother... CHRIST!\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nHey all...thought the song was also tight but couldnt relate as much to what he's saying compared to previous albums, this album is def not one of his greatess but, I think it was an release of his feelings about his mother passing and how he was coming to terms with it?\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nTo those of who curious, yes, as said before, Jambi is a province is Sumatra.   And yes this song kicks ass, just look at those Youtube video Morgasmo.\n\r\nAlright, TREXOR, time for you buddy\r\n   I'm all for opinions on a personal level.  Having said that, a website for expression MEANINGS on songs is what belongs in this space.  The idea of 10.000 days being a hoax has no place in this forum.  Like for me, this song is about staying true to personality and developing personal spirituality, and whatever or whoever the song is about is up for the Arbiter (that means you dipshit) to decide, and it will be different for mostly everyone.  \r\n   Now! You, and everyone who else tries to bash artists and songs via behind a computer screen, a couple words.  Until I fuck your mothers eye socket and she has my demon seed oozing out of her mouth and ears,\r\n              QUIT BITCHING\r\n                            thank you,\r\n                    no gets and little man in your speaker\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\nI would like to say that I have been a big fan of Tool's music for many years now.  \n\r\nWhen I first heard some of the leaked tracks (as did TREXOR) I thought they were fake as well. \n\r\nAs with most of Tool's music, it has taken me the better part of a year or two to come to appreciate the complexity of their compositions.\n\r\nJambi is now one of my favorite songs on this new album.  \n\r\nIt is about the passing of Maynard's mother.  He laments her death and wishes that he could do something about it.\n\r\nThe highlights of the song come at about 2:50 into the songs and the at about 6:45. \n\r\nThe 2:50 climax occurs when we hear the lyrics...\n\r\nIf I could Iâ\u0080\u0099d wish it all away if I thought tomorrow would take you away.\r\nYou, my piece of mind, my all, my center, just trying to hold on one more day.\r\nDamn (Dim) my eyes if they should compromise the fulcrum.\r\n(if) wants and needs divide me then I might as well be gone.\n\r\nAs his mother has died, he sings about his desire to take back this tragic event, saying that if he knew she was going to die, he would have done things differently. If his success could be traded for one more day of her existence he would gladly do it. \n\r\nLater at the end of the song we get a very religious reference.  \n\r\nShine on forever. Shine on, benevolent sun.\r\nShine down upon the broken . Shine until the two become one.\r\nShine on forever. Shine on, benevolent sun.\r\nShine down upon the severed . Shine until the two become one.\r\nDivided, Iâ\u0080\u0099ll wither away. Divided Iâ\u0080\u0099ll wither away.\r\nShine down upon the many. Light our way, benevolent sun.\n\r\nBreathe in union. Breathe in union. Breathe in union. Breathe in union.\r\nBreathe in union so as one survive another day and season.\r\nSilence, legion. save your poison. Silence, legion. Stay out of my way.\n\r\nWho knows what Maynard is thinking, but I think of this section of the song as being his acceptance that there is some sort of higher being in the universe.  His mother has died, and now he looks to her after death in spirit.  \n\r\nshine on benevolent son. shine on until the two become one.  \n\r\nBenevolent son is Jesus.  This phrase could either refers to the reference of his mom joining souls with Jesus Christ, or his mom and him joining souls after her death.  \n\r\neither way, its about the union of the dead and the living via spirituality.\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nAlso by the way the lyrics are not \"... should compromise the fulcrum\"   it is \"... should compromise OR FALL FROM\"   thanks\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nBased on what I've read & know of Tool, I am sure that \"Jambi\" is in reference to the genie on PeeWee's playhouse. My guess would be that the song is in fact about his relationship to his son, and not wanting his fame or reputation get in the way of being a father. I doubt that the seemingly biblical references in this song are meant to be taken literally. I know maynard is very interested in many new age, metaphysical, psychedelic kinds of things and I do not believe he has now renounced these beliefs and/or practices as being \"the dark side\" he fell in love with. This dark side is probably more along the lines of anything from hard drug abuse, pretentiousness, being cruel or unfair to those he cared about, or anything he felt was a negative consequence of his stardom. And whatever possitive effects have come of it (I know he recognizes there are some) he would give up in an instant if he thought it would somehow harm his son.\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nby getminesnogets on 12-20-2007 @ 08:42:46 PM\r\nAlso by the way the lyrics are not \"... should compromise the fulcrum\" it is \"... should compromise OR FALL FROM\" thanks \n\r\nTell that to Maynard.  The lyrics I posted on here are taken straight from the September '07 Newsletter.\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\nI think this song is about being addicted to something (drugs porn who knows \"flesh\" can be interpreted many ways) and then finding someone (to love maybe?) in reality that changes how you feel about the world. But whoever it is in the song is still tormented, because they still feel like they need it. I think its a love song.\r\nThe addiction is the devil's work, which is the first verse, and he finds someone and they become his center, his reason for being. \r\nThen he reflects on the addiction, some nights he prayed for it to be over, and forget it ever happened, some nights he wanted more and more of it, and couldnt get enough.\r\nThen he tries to voice just how much the person means to him, and saying hed wish the addiction away if he might lose whoever it is.\r\nHe then pretends that he is enlightened and no longer needs the addiction, and on the outside it looks like that. however inside he is still divided by his want, the addiction, and his need, the person. At the end he is commanding the addiction (a LESION, not legion) to be silent in his soul and stay out of his way.\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nhe could be singing about how fewer and fewer people are practicing catholic christians these days  due to the corrupt and out of touch nature of of the vatican, and that without its followers the church will die. so the church needs jesus to appear again to restore the faith and lead the people back to the church.\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nOkay I changed the lyrics because they were really off. The ones in CAPS LOCK are the changed parts\n\r\nHere from a kings mountain view,\r\nHere from THE wild dream come true,\r\nFeast like a sultan, I do, \r\non Treasures and flesh, never few,\r\n[this verse is maynard saying that he lives a good life, at least in material possessions] \r\nBut I would wish it all away if I thought Iâ\u0080\u0099d lose you just one day.\r\n[then he lost 'you' and he's saying that he'd wish everything he had away if he just got a bit more time to spend with 'you'(his mother)]\r\nThe Devil and his had me down.\r\nIn love with the dark side Iâ\u0080\u0099d found.\r\nDabble IN all the way down.\r\nUp to my neck, soon to drown.\r\n[he gave up his time that he could have spent with the ones he had, for the things that he wanted, and it kept building up until it almost drowned hime copletely]\r\nBut you changed that all for me.\r\nLifted me up. Turned me round.\r\n[the sudden death of his mother turned everything around, and made him focus on what he had, and not what he wanted]\r\nso I would wish this all awayâ\u0080¦\r\n[already expained]\r\nPrayed like a FATHER dusk to dawn. (why do people always get matyr?)\r\nBegged like a hooker all night long.\r\ntempted the devil with my song.\r\nAnd Got what I wanted all along.\r\n[He begged and prayed and gambled with the devil, and found what he truly wanted all along]\r\nBut I would wish it all awayâ\u0080¦\r\nno prize that could hold sway or justify my giving away my center so\r\n[he says nothing should justify giving away family or any true center]\r\nIf I could Iâ\u0080\u0099d wish it all away if I thought tomorrow would take you away.\r\nYou, my piece of mind, my HOME, my center, just trying to hold on one more day.\r\n[he says that he is still holding on too his true center, the people close to him]\r\nDamn my eyes if they should compromise the fulcrum.\r\n(if) wants and needs divide me then I might as well be gone.[his eyes decived him, he was emotionally destroyed by the apparition of matter, and he lost it all because he did not focus on what he had when he had it]\n\r\nShine on forever. Shine on, benevolent sSON.\r\nShine down upon the broken . Shine until the two become one.\r\nShine on forever. Shine on, benevolent sun.\r\nShine down upon the severed . Shine until the two become one.[easiest line(almost). His mother is telling him not to be sad, keep moving on, don't give up, and I will be a part of you. Some people concider this song to be religious because of this verse, its not]\r\nDivided, I'M WITHERING away. Divided I'M WITHERING away.[maynard feels split in two because he always felt his mother as a part of him, and now that he's lost her he feels like only half a being]\r\nShine down upon the many. Light our way, benevolent SON.\r\n[already interpreted]\r\nBreathe in union. Breathe in union. Breathe in union. Breathe in union.\r\nBreathe in union so as one survive another day and season.\r\nSilence, legion. save your poison. Silence, legion. Stay out of my way.[he says he's learned to deal without his material wants and telles the devil he doesn't need him anymore, and to save his poison]\n\r\nThere you go, that was what Maynard intended to put out.\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nOkay I changed the lyrics because they were really off. The ones in CAPS LOCK are the changed parts\n\r\nHere from a kings mountain view,\r\nHere from THE wild dream come true,\r\nFeast like a sultan, I do, \r\non Treasures and flesh, never few,\r\n[this verse is maynard saying that he lives a good life, at least in material possessions] \r\nBut I would wish it all away if I thought Iâ\u0080\u0099d lose you just one day.\r\n[then he lost 'you' and he's saying that he'd wish everything he had away if he just got a bit more time to spend with 'you'(his mother)]\r\nThe Devil and his had me down.\r\nIn love with the dark side Iâ\u0080\u0099d found.\r\nDabble IN all the way down.\r\nUp to my neck, soon to drown.\r\n[he gave up his time that he could have spent with the ones he had, for the things that he wanted, and it kept building up until it almost drowned hime copletely]\r\nBut you changed that all for me.\r\nLifted me up. Turned me round.\r\n[the sudden death of his mother turned everything around, and made him focus on what he had, and not what he wanted]\r\nso I would wish this all awayâ\u0080¦\r\n[already expained]\r\nPrayed like a FATHER dusk to dawn. (why do people always get matyr?)\r\nBegged like a hooker all night long.\r\ntempted the devil with my song.\r\nAnd Got what I wanted all along.\r\n[He begged and prayed and gambled with the devil, and found what he truly wanted all along]\r\nBut I would wish it all awayâ\u0080¦\r\nno prize that could hold sway or justify my giving away my center so\r\n[he says nothing should justify giving away family or any true center]\r\nIf I could Iâ\u0080\u0099d wish it all away if I thought tomorrow would take you away.\r\nYou, my piece of mind, my HOME, my center, just trying to hold on one more day.\r\n[he says that he is still holding on too his true center, the people close to him]\r\nDamn my eyes if they should compromise the fulcrum.\r\n(if) wants and needs divide me then I might as well be gone.[his eyes decived him, he was emotionally destroyed by the apparition of matter, and he lost it all because he did not focus on what he had when he had it]\n\r\nShine on forever. Shine on, benevolent sSON.\r\nShine down upon the broken . Shine until the two become one.\r\nShine on forever. Shine on, benevolent sun.\r\nShine down upon the severed . Shine until the two become one.[easiest line(almost). His mother is telling him not to be sad, keep moving on, don't give up, and I will be a part of you. Some people concider this song to be religious because of this verse, its not]\r\nDivided, I'M WITHERING away. Divided I'M WITHERING away.[maynard feels split in two because he always felt his mother as a part of him, and now that he's lost her he feels like only half a being]\r\nShine down upon the many. Light our way, benevolent SON.\r\n[already interpreted]\r\nBreathe in union. Breathe in union. Breathe in union. Breathe in union.\r\nBreathe in union so as one survive another day and season.\r\nSilence, legion. save your poison. Silence, legion. Stay out of my way.[he says he's learned to deal without his material wants and telles the devil he doesn't need him anymore, and to save his poison]\n\r\nThere you go, that was what Maynard intended to put out.\t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\nby Tool4ever on 01-15-2008 @ 07:00:10 AM\r\nOkay I changed the lyrics because they were really off. The ones in CAPS LOCK are the changed parts\n\n\r\nThis is incorrect.  As I said above.....look no further than the September '07 Newsletter.\ntoolband.com/news/letter/…\n\r\nJAMBI\n\r\nHere from a kings mountain view,\r\nHere from a wild dream come true,\r\nFeast like a sultan, I do, on\r\nTreasures and flesh, never few,\n\r\nBut I would wish it all away if I thought Iâ\u0080\u0099d lose you just one day.\n\r\nThe Devil and his had me down.\r\nIn love with the dark side Iâ\u0080\u0099d found.\r\nDabbling all the way down.\r\nUp to my neck, soon to drown.\r\nBut you changed that all for me.\r\nLifted me up. Turned me round.\n\r\nSO I would wish this all awayâ\u0080¦\n\r\nPrayed like a martyr dusk to dawn.\r\nBegged like a hooker all night long.\r\ntempted the devil with my song.\r\nAnd Got what I wanted all along.\n\r\nBut I would wish it all awayâ\u0080¦\r\nno prize that could hold sway or justify my giving away my center so\n\r\nIf I could Iâ\u0080\u0099d wish it all away if I thought tomorrow would take you away.\r\nYou, my piece of mind, my all, my center, just trying to hold on one more day.\r\nDamn my eyes if they should compromise the fulcrum.\r\n(if) wants and needs divide me then I might as well be gone.\n\r\nShine on forever. Shine on, benevolent sun.\r\nShine down upon the broken . Shine until the two become one.\r\nShine on forever. Shine on, benevolent sun.\r\nShine down upon the severed . Shine until the two become one.\r\nDivided, Iâ\u0080\u0099ll wither away. Divided Iâ\u0080\u0099ll wither away.\r\nShine down upon the many. Light our way, benevolent sun.\n\r\nBreathe in union. Breathe in union. Breathe in union. Breathe in union.\r\nBreathe in union so as one survive another day and season.\r\nSilence, legion. save your poison. Silence, legion. Stay out of my way.\n\r\nWORDS\n\r\nby\n\r\nMAYNARD JAMES KEENAN\t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nwhat I get from the song personally is being saved, or pulled from a dark place in life. and living good after going through that dark period. and thanking that person place or thing. (most likely a person), and wanting them to know that they or it is the reason for living so well, and that everything would be given up for that person place or thing.\n\r\nand as for the title I think it has something to do with the Genie from Peewee, and the phrase that's muttered when summening Jambi. \"Mukala Hi Muka luka hidy ho\" or something along those lines. the guitar riff pattern is pretty similar to the roll of those words. in my opinion probably something that Danny and Adam used to remember the timing and rhythm of the intro to the song. perhaps it just stuck. who knows. only Tool, but will they ever post on here?.\t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\nThis song got me sober. I swear. Well, God and myself truly got me sober... but this was the song that was stuck in my head, which inspired the enlightenment which I had some to fully embrace. You see, my love left me because of the stupid choices that I wsa making (\"...the Devil and his had me down, in love with the dark side I'd found...\") and I was near the breaking point (\"...up to my neck sure to drown...\") And the thought of losing my true love to that awful lifestye terrified me. So I made that committment (\"...but you changed that all for me, lifted me up turned me 'round...\") and I wished it all away, so as not to lose him just one more day.\n\r\nThank you Maynard!\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nThe theory of the guitar rift following the phrase from PeeWee's playhouse (to summon Jambi) is pretty interesting.  The syllables and notes sync.  The irony of a song named after a PeeWee character would certainly fit the \"Tool\" sense of humor.\n\r\nLike much of the album, this song could certainly be about Maynard Keenan's mother, directly or as a metaphore.  There are several stages of facing death/grieving.  One stage is \"negotiation\" or \"bargining\" to escape what a person faces.  Maynard here is essentially doing just that-he'd trade everything he has for his mother to live.\n\r\nThe theme of religion runs through the entire album, so religious imagery is consistant with that theme.\n\r\nLegion was the name of a demon in the Bible...could be a reference here (\"Silence, Legion...\")\n\r\nThe entire album is full of reflections on death (of Maynard's mother) and life in general (the song \"Vicarious\" is so forceful because, after seeing his mother die, Maynard is appalled by how some people waste their lives).  Tool's songs are often layered in terms of \"meaning\", but this album is fairly stripped down in that regard, though the songs do leave room for personal interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\ni agree completely with the maynard and his son theory\n\r\nas of the whole trexor thing\n\r\nwho honestly cares? like im a die hard tool fan, seen em live 7 times, but they appeal to me, they might not appeal to others, thats ok, thats how life is, everyone has opinions\n\r\nits alright if trexor doesnt like new tool or whatever\n\r\nbut dont u think hed just keep it inside if that was the case? he obviously wants to get a rise out of everyone\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\namazing song, pretty much everybody here got it right except trexor who clearly has no idea what good music is.\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nright, this song has lyrics, but let's just phocus on the f*cking instrumental mastery here,,Jones ryff is like some kind of Iraqi 3-17 or something, Dr. Carey's hi-hat work is incredible during the verses, very slick, and then the dope-ass guitar solo part, with the fat drum and bass bottom and Jones guitar part comes out of Satan's hidden basket and leaps into one's head piece.......the grinding and groaning textures of the guitar are a new step up....it's not about 10,000 notes, it is shaping a liquid dragon into sound\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nI haven't the slightest of what the meaning of this song is.\n\r\nI love the lyrics\n\r\nBut sadly, this song just isn't very melodic.\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nThe second track on the Tool album 10,000 Days takes its name from the character Jambi. The song is about wishing yourself to another state if you think you can lose someone in the state or position that you are in. The words \"Mekka-lekka hi mekka-lekka hiney ho\" are mouthed into a \"talk-box\" used by Adam Jones the guitarist in his solo at 5:01 into the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nPS Trexor you suck until you sell as many albums as Tool.   And Legion was NOT the Devil in the Bible, Legion was demon comprised of many souls.\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nJust to settle the whole trexor dispute, i clicked on his name by accident, and I saw that his homepage was listed as his myspace. out of curiousity i clicked his link and it turns out he's a bi-sexual canadian with no friends. That would explain his unfounded anger towards 10,000 days, I suppose.\n\r\nAnd about Jambi, this song to me is definitely a love song. I mean just read the lyrics\r\n\"The Devil and his had me down.\r\nIn love with the dark side Iâ\u0080\u0099d found.\r\nDabbling all the way down.\r\nUp to my neck, soon to drown.\r\nBut you changed that all for me.\r\nLifted me up. Turned me round.\"\n\r\nThat stanza is about how he was living a crappy life or sinful lifestyle until he met his significant other.\n\r\nThe end about breathing in union is about love too, in my oppinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\ndim my eyes. as in take away my life. some1s eyes dimming as they die  sori just my interpretation of that line kinda tyes in wth the protect his son miss his mother theme as in he wod let his life be taken to protect his son\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nNew Tool just doesn't compare to old tool =/\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nPrayed like a martyr dusk to dawn\r\nshould be like a father does,\r\nand...\r\nShine on forever. Shine on, benevolent sun.\r\nshould be SON,\r\nthe song is about maynards son,\r\nim pretty damn sure.\n\r\nSilence, leech and save your poison. Silence, leech and Stay out of my way, is tlaking about the other parts of the song, such as in the first verse.\n\r\nMaynard can have whatever he wants,\r\nbeing fmaous n all i guess,\r\nand now he has his son, Devo,\r\nhe wants nothing else to get in his way,\r\nof his relationship with his son?\r\nmake sense?\n\r\npeace ya'll\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\noh i think someone pointed out the son theory before me,\r\neither way theyre right too then.\r\nkudos.\t\t\t\t\n\t\t\t\t\n\n", "comment_321": "\nI agree with Trexor. Get off his dick. I LOVE Tool with all my heart and soul but the VERY first time I heard this song, I couldn't believe it. First few bars were like, EWWW... come on guys, why did you just suspend hard work and creative openness for this? Great music like the rest of their stuff takes a lot of creative energy to get what feels good in your soul OUT, on paper and in the studio. But it's like......I can feel how... rushed? Lazy? Cocky? They were (whatever it was) feeling when they created this song. The Pot and a lot of songs on 10,000 days obviously took the necessary and very real devotion that we feel from most of their music, but this one sounds too much like.......filler. Thanks for not making me feel like a dick, Trexor. Maybe the rest of you should at least stop and consider WHY people like us think this about the song; we all have the right to our opinions.\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nkuro5hin.org/story/2006/6/2/23729/… is where studies of the City Jambi and it's history, and how it relates. Read up! \n\r\nMaynard has always implemented trickery within his songs. He will make you think a song means one thing, when it really means another. Maynard himself stated his music and lyrics is more for humor than most seem to realize. ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\nstay away IDIOTS!\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\nI'm not a big tool listener, but i'm just gonna say what's totally obvious to me. \r\nIf he would've known he was about to lose his mom, he would've changed his lifestyle sooner. The devil had a huge hold on his life, and he regrets wasting so much time. Then, he prayed to God to be forgiven and saved, and realized that's what his life had been lacking all along. \"Damn my eyes if they should compromise the fulcrum; if wants and needs divide me then i might as well be gone\". If his eyes cause him to sin, damn them. Just like, in the bible, if your right hand cuases you to sin, cut if off. Better to have one hand than die and go to hell. (That's very paraphrased.) I mean, surely he hasnt made his mother the God of his life. He's references Jesus Christ, of the christian bible. (fulcrum-one that supplies capability for action) \"shine on benevolent son\" definately reference to Jesus Christ.\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\nTo me this is about how he would wish it all away to spend one more day with his mother.\n\r\n\"But I would wish it all away if I thought Iâ\u0080\u0099d lose you just one day.\"\n\r\nIf I could Iâ\u0080\u0099d wish it all away if I thought tomorrow would take you away.\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\nJambi is a term of indearment (African origen I think) that one uses towards a son or child.  It's about how Maynard's son has re\"center\"ed his life and piorities and helped save him from the destructive path he was on.  Maynard had \"treasures\" and \"flesh\"(sex) but those things are meanless now that he has his \"benevolent sOn\", \"Jambi\".  Jambi is his \"All\", his \"fulcrum\", his \"center\", his \"piece of mind\" and now he can not imagine beening separated (\"severed\") from him.  \n\r\nI am a father, so trust me on this one.  If you don't have kids yet wait until you do before you try to comprehend this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nI would argue that it doesn't have anything to do with his son, but Jesus Christ, the son of God. I've already written some comparisons. If you've read the bible before, you'd definately know what he's talking about. \n\r\nBTW, I have two sons.\t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nJambi is flesh in finnish and theres a legend a of a guy called jambi that was rich!!!!!!!!!!!\n\r\nok now\n\r\n\"Here from a kings mountain view,\r\nHere from a wild dream come true,\r\nFeast like a sultan, I do, on\r\nTreasures and flesh, never few,\n\r\nBut I would wish it all away if I thought Iâ\u0080\u0099d lose you just one day\"\n\r\nHaving alot of material wealth but being able to sacrifice it for someone meaning that someone means more to you thana ll ur wealth and here is why\n\r\n\"The Devil and his had me down.\r\nIn love with the dark side Iâ\u0080\u0099d found.\r\nDabbling all the way down.\r\nUp to my neck, soon to drown.\r\nBut you changed that all for me.\r\nLifted me up. Turned me round.\n\r\nSO I would wish this all awayâ\u0080¦\"\n\r\nhe was in a very dark kinda depresed way of living and that someone lifted him up\n\r\n\"Prayed like a martyr dusk to dawn.\r\nBegged like a hooker all night long.\r\ntempted the devil with my song.\r\nAnd Got what I wanted all along.\n\r\nBut I would wish it all awayâ\u0080¦\r\nno prize that could hold sway or justify my giving away my center so\r\n\"\n\r\nwanting all of his riches only to when he has them he realizes that that someone (his center) is worth much more\n\r\n\"If I could Iâ\u0080\u0099d wish it all away if I thought tomorrow would take you away.\r\nYou, my piece of mind, my all, my center, just trying to hold on one more day.\r\nDamn my eyes if they should compromise the fulcrum.\r\n(if) wants and needs divide me then I might as well be gone.\"\n\r\ni dont know what dolclrum but it also resates this person is important for his stability and is worth more than its riches its almost as this person is part of him\n\r\n\"Shine on forever. Shine on, benevolent sun.\r\nShine down upon the broken . Shine until the two become one.\r\nShine on forever. Shine on, benevolent sun.\r\nShine down upon the severed . Shine until the two become one.\r\nDivided, Iâ\u0080\u0099ll wither away. Divided Iâ\u0080\u0099ll wither away.\r\nShine down upon the many. Light our way, benevolent sun.\"\n\r\nhow he wants this someone to be with him forever\n\r\n\"Breathe in union. Breathe in union. Breathe in union. Breathe in union.\r\nBreathe in union so as one survive another day and season.\r\nSilence, legion. save your poison. Silence, legion. Stay out of my way. \"\n\r\nhow now he and the person need each other and are kinda one\n\r\nlegion is a demon (or well 1000 demons) in the bible and remember what this person saved him from (\"the devil\") so he wants his problems (or maybe problematic person) to stay away\n\r\n:)\n\r\nlisten to the drums on this one\t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nHey does anyone know if this is true and if so what song and cartoon. I read once that Tool had actually allowed some cartoon to use one of their songs as the cartoons theme song. If this is true then please note what cartoon and song was it.\t\t\t\t\n\t\t\t\t\n\n", "comment_330": "\nJambi is me and my boyfriend's song.\n\r\nEven though it kinda sounds like a love song, it's a song that Maynard wrote for his son.\n\r\nI love it :]\t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\nits about finding jesus\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nI know this is stupid to say. This song made me tear up. I dont know why. It was toward the end up the song when it made me do that. Its just the whole composition of the song. I youtubed the jambi video for tool. I found this one with the clay art. It was a beautiful. Theres just no words for this song. Even if there is a meaning or whatever. Its beautiful\t\t\t\t\n\t\t\t\t\n\n", "comment_333": "\nThe 2nd verse is so strong I love it\t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nif anyone one doesnt know this, but jambi was also the name of the magical genie head on peewees play house, doubt that really has anything to do with anything\t\t\t\t\n\t\t\t\t\n\n", "comment_335": "\nI think this song is about the U.S. Government. Because the \"blood sucking parasites\" reefer to how the government can just take things from the people (SOCIALISM).  But then again it is a Tool song so you know it has like 100 different meanings.\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\nthis song is about the lose of his mother. His mother lifted him \r\nup when he was down. He had what he wanted all along but everything\r\nhe would have given up if he knew he would have lost her for one day\r\nHe is torn inside because his center (mom) is gone. He has a \r\ndifferent consiousness and realizes what is important. He does \r\nnot want to be led away from whats important. He wants to be whole \r\nagain and is looking for guidance up above. At the end I believe\r\nit is in reference to the devil in legions to leave him alone, he\r\nhas an altered consiousness... Being a product of a single mom \r\nand having lost my dad at a younge age I understand how devistating\r\nand the strife you go through, this is a very deep meaningful song and when i found out the meaning I cried I uderstand the pain and the hurt of loosing a parent and how I would wish all the riches of the world away for just one more day with my father.\t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\nthis song is not about his mom. wings for marie was about is mom. its about him struggling with a dark side of him hes found, but cant live without it \"Divided, Iâ\u0080\u0099ll wither away. Divided Iâ\u0080\u0099ll wither away.\" if it was about his mom how do u explain the line \"Feast like a sultan, I do, on Treasures and flesh, never few,\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_338": "\ni duno I still think its about his mom. His mom lifted him up and without her he has to deal with his evil side that she helped to repress. I dont know atleast thats what I think\t\t\t\t\n\t\t\t\t\n\n", "comment_339": "\nFor everyone who thinks new Tool sucks, you can't expect everything to be the same. We are all human, we change, we grow, some regress. To say Maynard or anyone from the band has changed irrevocably is sort of silly. Who cares what they do? As long as they are staying true to themselves and the reason they're writing music, I don't think the rest of us have any room to complain. You have your own opinions about music, if you don't like it, make some of your own or stop listening.\t\t\t\t\n\t\t\t\t\n\n", "comment_340": "\nThis song is one of the best off 10,000 Days. I think it's about drug addiction and two people trying to get through it together.\t\t\t\t\n\t\t\t\t\n\n", "comment_341": "\nDoes every goddamn 13 year old in the universe have to interpret every song as a drug addiction? Seriously, what the fucking jhell?\t\t\t\t\n\t\t\t\t\n\n", "comment_342": "\nthe beginning of the song was fucking amazing in concert!  this was the first song they did too.  \t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nthis is a love song. \t\t\t\t\n\t\t\t\t\n\n", "comment_344": "\nIts obviously about resisting satan with gods help\t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nto me i kind of see every song on this album to have relation with his mother which makes sense considering 27 years is roughly 10,000 days but as with almost evey song ive heard there are double meanings often times political attacks... but then again i could be reading into it to much but truely the only one i have a hard time putting any part of his mother in is the pot...\r\nanyways i almost agree with commander micheal except i see it as his mother keeping him from the \"darker side\" wether it be himself or satan because of his mothers strong belief in god... which you have to admit at least in the morals of almost every religion there are good morals or things to follow reguardless of faith\t\t\t\t\n\t\t\t\t\n\n", "comment_346": "\nto me i kind of see every song on this album to have relation with his mother which makes sense considering 27 years is roughly 10,000 days but as with almost evey song ive heard there are double meanings often times political attacks... but then again i could be reading into it to much but truely the only one i have a hard time putting any part of his mother in is the pot...\r\nanyways i almost agree with commander micheal except i see it as his mother keeping him from the \"darker side\" wether it be himself or satan because of his mothers strong belief in god... which you have to admit at least in the morals of almost every religion there are good morals or things to follow reguardless of faith\t\t\t\t\n\t\t\t\t\n\n", "comment_347": "\nDosent he say jambi twice before he says ''damn my eyes?''\t\t\t\t\n\t\t\t\t\n\n", "comment_348": "\nJambi means iamb in latin. Iambic pentameter in poety is beats of 5. the timing of this song is 5/4. thats where half of the meaning for the name comes from, that and the province in sumatra\t\t\t\t\n\t\t\t\t\n\n", "comment_349": "\nI think this is taken too literal and most of the time considered a blow-off song.  I personally think that this song refers to the feeling experienced when one loses theirs sense of purpose for the first time.  Most people would wish away all that they have just to have that old purpose and don't want to accept the reality they are given (hence; \"Damn my eyes\").  That's my opinion and I'm sticking to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_350": "\ni think there may have been a mistake in the lyrics in the second to last paragraph in that its supposed to be \"benevolent son\" not \"sun.\" I'm still trying to work out a meaning to back this up though. one of my ideas is it could be his mother's voice. \t\t\t\t\n\t\t\t\t\n\n", "comment_351": "\nany one else have any thoughts on this?\t\t\t\t\n\t\t\t\t\n\n", "comment_352": "\nTHIS SONG IS ABOUT A GENIE WHO APPEARED IN A CHILDRENS T.V. SHOW CALLED PEE WEES PLAYHOUSE WHEN MAYNARD WAS A KID, ITS ABOUT A FLOATING HEAD CALLED JAMBI WHO JUST HAPPENS TO BE A GENIE AND GRANTS WISHES, THE SHOW ITSELF WAS SLIGHLTY DISTURBING EVEN TO ADULTS AT THE BEST OF TIMES BUT THATS PROBABLY WHY IT STUCK WITH MAYNARD, WHEN HE SINGS '' I WOULD WISH THIS ALL AWAY'' HES REFERRING TO THINGS FROM HIS CHILDHOOD INCLUDING.... JAMBI, FEEL FREE TO ARGUE LOL \t\t\t\t\n\t\t\t\t\n\n", "comment_353": "\nTHIS SONG IS ABOUT A GENIE WHO APPEARED IN A CHILDRENS T.V. SHOW CALLED PEE WEES PLAYHOUSE WHEN MAYNARD WAS A KID, ITS ABOUT A FLOATING HEAD CALLED JAMBI WHO JUST HAPPENS TO BE A GENIE AND GRANTS WISHES, THE SHOW ITSELF WAS SLIGHLTY DISTURBING EVEN TO ADULTS AT THE BEST OF TIMES BUT THATS PROBABLY WHY IT STUCK WITH MAYNARD, WHEN HE SINGS '' I WOULD WISH THIS ALL AWAY'' HES REFERRING TO THINGS FROM HIS CHILDHOOD INCLUDING.... JAMBI, FEEL FREE TO ARGUE LOL \t\t\t\t\n\t\t\t\t\n\n", "comment_354": "\ni want to say that this song goes back to the passing of his mother( the thoughts and feelings he may have had). He knew he was losing her. he talks about his life as a \"rock star\" and would \"wish it all away\" to not lose her.\t\t\t\t\n\t\t\t\t\n\n", "comment_355": "\nWhen I heard this i thought it may be about maynard's son.  With the loss of his mother, death may be on his mind, and it reminds of of the impending pain that would come with the loss of his son.  Just a theory.  Maynard sings in a lot of metaphor, and disguise, but if you catch the right meanings, the lyrics will pop out at you.  You will see how straight forward it is, but only once you know what he is talking about.\t\t\t\t\n\t\t\t\t\n\n", "comment_356": "\nI'm sure i'm the only one to feel this way, but I interpret this song as someone living a reckless lifestyle without any consideration for the consequences. And then when it comes down to it and realizing how much they've royally fucked up, they regret it and want to \"wish it all away.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_357": "\nI believe the song is about the king of Jambi in indonesia. Jambi was an island in Indonesia. \n\r\nHe was a king, and he was rich. \"Feast like a sultan, I do, on Treasures and flesh, never few\"\n\r\nThe king fell in love with a woman and tried everything to win her over, but she was already married. \r\nAccording to the story of the king, he killed the woman's husband in order to have his love to himself.\r\n\"Prayed like a martyr dusk to dawn. Begged like a hooker all night long. tempted the devil with my song. And Got what I wanted all along.\" He begged and did all that he could, but then was tempted by the devil...leading him to murder the husband. In the end he got what he wanted\n\n\r\nMaynard reiterates the \"wish it all away\" because the king really would wish it all away to have his love.\n\r\nMaybe someone could enlighten me on their interpretation subsequent to \"and got what i wanted all along\" \n\n\n\n\n\n", "comment_358": "\nI have been trying to figure out why the song is called Jambi\n\r\nthe only thing I can come up with is that the line \"damn my eye\" (might be \"jab my eye\", I have seen both but I think the first fits the best) sounds almost as if he is saying jam-bi-i.  but I think that is probably just something i am imagining.  other than that the only other thing I can think of is that the song kinda sounds exotic and tribal and the title adds to that effect.\n\r\nanyway a lot of people say this song is about Maynard's mother, it is but the song can apply to any loved one and anyone who loves someone enough to give up anything just to be with someone for just one more day.\n\n\n", "comment_359": "\nthere is a word \"jambe\" which is pronounced like jambi. its is a alcohol extract. to me, the lyrics to this song is either that of love, or of struggle. love because of the \"i would wish it all away if i thought id lose you just one day.\" but that same line could also be about alcohol addiction. just brainstorming.\n\n\n", "comment_360": "\nhistory of jambi - Before what is now Indonesia was colonized by the Dutch East India Company, Jambi was the site of a well-established, powerful Srivijayan kingdom[citation needed] that engaged in trade throughout the Strait of Malacca and beyond. It succeeded Palembang to the south, which was a frequent military and economic rival, as the later capital of the ancient kingdom. The move to Jambi was partly induced by the historic 1025 raid by pirates from the Chola region of southern India that destroyed much of Palembang.\n\r\nIn the early decades of the Dutch presence in the region, when the future colonizers were just one of several groups of traders competing with the British, Chinese, Arabs, and Malays, the Jambi sultanate profitably traded pepper with the Dutch. This relationship declined by about 1770, and the sultanate had little contact with the Dutch for about sixty years.\n\r\nIn 1833, minor conflicts with the Dutch, who were well established in Palembang, meant the Dutch increasingly felt the need to control the actions of Jambi. They coerced Sultan Facharudin to agree to greater Dutch presence in the region and control over trade, although the sultanate remained nominally independent. In 1858 the Dutch, apparently concerned over the risk of competition for control from other foreign powers, invaded Jambi with a force from Batavia. They met little resistance, and Sultan Taha fled to the upriver, inland regions of Jambi. The Dutch installed a puppet ruler, Nazarudin, in the lower region, which included the capital city. For the next forty years Taha maintained the upriver kingdom, and slowly reextended his influence over the lower regions through political agreements and marriage connections. In 1904, however, the Dutch were stronger and, as a part of a larger campaign to consolidate control over the entire archipelago, soldiers finally managed to capture and kill Taha, and in 1906, the entire area was brought under direct colonial management.\n\n\n\n", "comment_361": "\nJambi\" is a song by American progressive metal band Tool. The song is released as a single and the second track from their fourth studio album 10,000 Days. It was made officially available for radio airplay on February 12, 2007.[1][2] Adam Jones uses a talk box effect during the guitar solo.[3]\n\r\nThe song is in 9/8 time, except for the guitar solo where the rhythm is temporarily changed to 6/4 before going back to 9/8.\n\r\nIt primarily refers to the iambic meter used in the lyrics of the song as 'jambi' means 'iamb' in Finnish.[4]\n\r\nDrummer Danny Carey stated when bassist Justin Chancellor played the bass track of the song, it instantly reminded him of the children's television program Pee-wee's Playhouse, then singer Maynard James Keenan thought of the genie \"Jambi\" and had the idea to make the song's theme about making wishes\t\t\t\t\n\t\t\t\t\n\n", "comment_362": "\nI didnt read all comments so sorry if i reiterate someone....but as all tool songs go, there's no telling what its about unless it comes straight from maynards lips, he writes his lyrics so that people will actually research them and come up with a meaning for themselves and what it means to them, but for the sake of this site I will try to come up with something about what he might have been thinking. Here is my interpretation:\n\r\nHere from a kings mountain view,\r\nHere from a wild dream come true,\r\nFeast like a sultan, I do, on\r\nTreasures and flesh, never few\n\r\nI think this section is focusing on his life, how great it is. He feels like a king or sultan, from a wild dream. He feasts on only the best food and gets only the best treasures. His life is good.\n\r\nBut I would wish it all away if I thought IÃ¯Â¿Â½d lose you just one day.\n\r\nThis line directs the focus of everything else that follows on his mother. Hence the cd's name 10000 days (which is 30 years). Maynards mother was diagnosed with cancer and it was 30 years from that day until she passed.\n\r\nThe Devil and his had me down.\r\nIn love with the dark side IÃ¯Â¿Â½d found.\r\nDabbling all the way down.\r\nUp to my neck, soon to drown.\n\r\nThe devil took him for himself. He loved doing what felt good, not what was right. He dabbled in evil all the way down to his lowest moment in life. If he went another step further he would be past the point of no return from the devil's grasp.\n\r\nBut you changed that all for me.\r\nLifted me up. Turned me round.\n\r\nEither the day his mother passed away led him towards God or she influenced him to become a better person and to lead a life that she saw fit for him.\n\r\nSO I would wish this all awayÃ¯Â¿Â½\n\r\nPrayed like a martyr dusk to dawn.\r\nBegged like a hooker all night long.\r\ntempted the devil with my song.\r\nAnd Got what I wanted all along.\n\r\nDuring the time when his mom was diagnosed, he prayed and begged God to help her out, to heal her. But in order for God to help, maynard needed to try and live up to His standards. Maybe he feels responsible for his moms death.\n\r\nBut I would wish it all awayÃ¯Â¿Â½\r\nno prize that could hold sway or justify my giving away my center so\r\nIf I could IÃ¯Â¿Â½d wish it all away if I thought tomorrow would take you away.\r\nYou, my piece of mind, my all, my center, just trying to hold on one more day.\n\r\nIf he would have known what would happen in the end, he would have given it all away just to have his mom back.\n\r\nDamn my eyes if they should compromise the fulcrum.\r\n(if) wants and needs divide me then I might as well be gone.\n\r\nHis eyes let him see what he would like to do, things that caused him to be in a mess before. They have compromised his relationship with God and his mom. He needs his mom, but he wants to do these bad things. They are causing him to lead a life that he didnt intend to fulfill so he might as well have never been born if he can never do the right thing.\n\r\nShine on forever. Shine on, benevolent sun.\r\nShine down upon the broken . Shine until the two become one.\r\nShine on forever. Shine on, benevolent sun.\r\nShine down upon the severed . Shine until the two become one.\r\nDivided, IÃ¯Â¿Â½ll wither away. Divided IÃ¯Â¿Â½ll wither away.\r\nShine down upon the many. Light our way, benevolent sun.\n\r\nMaybe this is something he imagined his mother saying to him. Live a life that is good enough for himself. Let the good in him shine through until his good side takes over his bad side. \n\r\nBreathe in union. Breathe in union. Breathe in union. Breathe in union.\r\nBreathe in union so as one survive another day and season.\n\r\nA battle inside of him between good and evil.\n\r\nSilence, legion. save your poison. Silence, legion. Stay out of my way.\n\r\nWhat he tells the devil, to stay out his way and out of his life.\n\n\r\nI could see this being a powerful dream that he had. And like i said, no one will ever know what its about until maynard reveals it.  \n\n\n\n", "comment_363": "\nIt is worthwhile for listeners to allow their imagination to create personal ideas and possible meanings for such rich, creative lyrics. However, Maynard wrote with a specific purpose. I do not know enough about Maynard or his thought process to assume my analysis is accurate, and have seen other well-supported interpretations. Yet, I do have an experience-backed understanding of what a relationship with Christ offers and recognize that what is expressed in the lyrics can function as a beautiful response to a newly found relationship to God. The song notes how the author experienced lifeâ\u0080\u0099s peak in pleasures, how these same peaks can also bury, and how a new relationship provided the needed capstone (benevolent son being Jesus, also biblically called the â\u0080\u009clightâ\u0080\u009d) to stabilize his foundation and keep the person together even with the divisive wants and needs we all feel. Even with that need met, the â\u0080\u009cwantsâ\u0080\u009d still threaten to divide as a â\u0080\u009clegionâ\u0080\u009d (reference in the Bible) keeps coming for him. Itâ\u0080\u0099s a daily struggle with seasonal highs and lows, but recognizing the value of his new relationship provides a positive hope and drive to remain united. \t\t\t\t\n\t\t\t\t\n\n", "comment_364": "\nThis song screams Meth Addiction. \"Dabbling all the way down, in love with the dark side i'd found\" For people that don't do drugs, or only do them occasionally. The dark side isn't just a side of the force in Star Wars, it's the binge-crash-nonstop addict who loses himself and everything around him to get high again. We call them dinosours because their shoulder blades are usally jacked up above their neck everytime you see them. The dark side is easy to get lost in, with a drug that makes you feel like you're King of world, riding the fastest rollercoaster ever made and fucking the hottest porn star all thrown into one hit from a pipe can and will make the weak give everything they own and don't own for just a taste. However for recovering addicts like Maynard whom was saved by someone close to him, probably given an ultimatum to keep doing dope or lose this person. He wishes he could give it up, but his wants and needs are clouded. He wants to still feel human and care/love, but he needs to get high. Crystal Meth is a life long addiction, don't rock the pipe unless you're ready to either deal with the come downs or lose everything. For most that next hit is all that matters, in the end, it's only a drug. It can never love you like a human being can.\t\t\t\t\n\t\t\t\t\n\n", "comment_365": "\n Is this Tools attempt at a love song?What ever it is...it fukin rocks!!!Tool is a genius super group...end of story.\t\t\t\t\n\t\t\t\t\n\n", "comment_366": "\nI saw Danny Carey do a drum clinic in Kansas City recently. He talked about how he creates chants to help him keep time in Tool's complex polyrhythms. He said when he heard Justin's bassline for this song, the chant he came up with was \"Mekka Lekka Hi Mekka Hiney Ho\". This is the same chant the genie Jambi says in Pee-wee's Playhouse to make Pee-wee's wishes come true. Maynard thought it was funny so he named the song \"Jambi\".\n\r\nThat much Danny said pretty much straight up. My own interpretation of that story is that the title of the track is not related to the lyrics. However, Danny didn't say whether the lyrics were related to the title or whether they were written before or after the title was chosen. I know from previous interviews with Maynard that Tool writes the music first and then he adds the lyrics, so it could still be true that the bass track inspired the title which in turn inspired Maynard to write lyrics about making wishes. I don't think that's the case, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_367": "\nTHE SONG IS ABOUT HIS MOTHER! \n\r\nIT WAS SAID IN AN INVERVIEW\n\r\nhahah someone thought it was about meth lol\t\t\t\t\n\t\t\t\t\n\n", "comment_368": "\nMaynard James Keenan sings about how he would willingly give up the fame and fortune that he got by being the lead singer of Tool just to bring his mother back.\t\t\t\t\n\t\t\t\t\n\n", "comment_369": "\nThis is about finding true love and how he'd wish it all away if he thought he'd loose it just one day. She's his peace of mind his home. Even for just one more day. It says he has it all but he'd give it away just for her. This is really to me a love song. But guys what you have to remember is art isn't \"just\" it's however it makes you as a person feel, open ended, not defined, like a lot of the feelings we get.\t\t\t\t\n\t\t\t\t\n\n", "comment_370": "\nBeautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_371": "\nThis is an amazing song. My boyfriend brought it to my attention... Not only are the lyrics deep but the beat just has something about it I can't describe. This song gives me chills. Magnificent chills. I think the lyrics have multiple meanings and relate to many areas of my own life. \t\t\t\t\n\t\t\t\t\n\n", "comment_372": "\nMy first thought was that this song was about Maynard's son. Just a thought. My brother had a much better interpretation. Yes, he was stoned.\n\r\nIt's about Star Wars. This is Darth Vadar's inner dialogue to Luke. Cast aside your knowledge of how Darth Vadar acted and think about what he really wanted.\n\r\nHe wanted Luke to join him and rule the galaxy. He was willing to risk everything and take on The Emperor in order to have his son at his side. He wanted to rule the galaxy but Luke was unwilling to join the dark side, insisting on remaining in the 'light'.\n\r\nOriginally, it was believed that Darth Vadar was the prophesied hero that would save everyone from the dark side, but then it turns out that Luke was actually that hero. Vadar is unable to completely forsake the dark side, but he's proud of Luke anyway. \"Shine on, benevolent son. Shine down upon the broken...\"\n\r\nI know the song isn't actually about Star Wars and Darth Vadar, but it's fun to smoke a bowl and think of it like that while you're listening to it. \n\r\nGreat song. Great band. This song was the fucking shit at the Gorge in George, Washington four years ago.\t\t\t\t\n\t\t\t\t\n\n", "comment_373": "\nMy fave song! Jambi is a LOVE song. Think about it:\n\r\n \"But you changed that all for me./Lifted me up. Turned me round./ So I would wish this all away[the bad]Ã¯Â¿Â½\"\r\n\"no prize that could hold sway or justify my giving away my center so\"  \r\n\"You, my piece of mind, my all, my center, just trying to hold on one more day.\"\r\n\"Breath in union.\"\n\r\nThanks I figured it out for you. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_374": "\nIt sounds like more or less the story of \"Faust\" by Goethe. Basicly same idea, but I can't find any connection to \"Jambi\".\t\t\t\t\n\t\t\t\t\n\n", "comment_375": "\nThis is my favorite Tool song :)\n\r\nThe lyrics are great, the bass sounds like the apocalypse hitting, the guitar is so intense, it has the most kickass kick-pedal bass beat ever, and a freakin' nuts guitar solo... what not to fucking like??\n\r\nThe first few verses are the best I've ever heard, both lyrically and the way the vocals sync with the music. Damn my eyes...\t\t\t\t\n\t\t\t\t\n\n", "comment_376": "\nA lot of people don't realize that most of 10,000 days was written in memory of maynards mother. if you know that and read the lyrics, you can understand his point of view on a personal level, with all these other confusing metaphors that people who aren't tool fans wouldn't understand. Another genius thing about this song is the syllable work tied into it. if you notice every verse follows syllable pattern. \n\n\n", "comment_377": "\nHey, this one is a very touching song\n\r\nSomeone said that after victory one forget many things\n\r\nDon't waste your time with \"little victories\" keep yourself for the biggest ones, the ones that appear on your dreams, follow them, fight with them and conquer them\t\t\t\t\n\t\t\t\t\n\n", "comment_378": "\nAbsolutely love this song.  It's one of my favorites from Tool.  The meaning is pretty obvious in it though.  It's a love song.  Tool is not known for writing love songs, so it was nice to see their version of one.  I supposed it could also just be about a person who is extremely important to you or changed your life in a great way, but it comes across to me as a love song.\t\t\t\t\n\t\t\t\t\n\n", "comment_379": "\nThis song is without a doubt written for his mother. If any of you didnt understand that than i wont put any stock in anything you write on this site.  In fact almost this whole cd is written for his mother. 10000 days is around the ammount of time his mother was in a coma before she passed away and he loved her so much even though hes against religion his mother was very very religious so he prayed she would go to heaven because he knew she devoted her life to god and he didnt want everything she lived for to be for nothing.  Obviously hes saying he would wish all the fame and money away if he could have 1 more day with her. here from the kings mountain view, wild dream come true but id wish it all away.\t\t\t\t\n\t\t\t\t\n\n", "comment_380": "\nThis song shows off how emotion should be projected through a song.  This is a masterpiece and the pinnacle of influential music.  I completely agree with the Rolling Stone; Tool is one of the most influential bands of our time.\t\t\t\t\n\t\t\t\t\n\n", "comment_381": "\nWhen I first heard the song title, Jambi, I thought of the genie from Peewee's Playhouse. According to wikipedia, Danny heard the bassline and thought it reminded him of Jambi, so they made the song about wishes. Meckaleckahi, meckahiney ho!\t\t\t\t\n\t\t\t\t\n\n", "comment_382": "\nThis album is pure genius, as most of their work is of course. These guys continue to set themselves apart from the pac by not just their raw ability but the lyrics and thought put into them is just...well amazing. I have been music lover for all of my life and a musician for 22 years and these guys are one of a kind and most definitely one of my favorites of all time. This one in particular I can relate to from problems with alcohol (comparing to his addiction to women, I'm guessing)and having a child, not feeling worthy of having such beauty in my life.. \"damn my eyes, if they should compromise our fulcrum. What you need divides me, so I might as well be gone\" hits home. Just like Wings for Marie... my Grandmother was basically a vegetable for many years before passing. His words reach in many ways to many people! Thanks Maynard and band! \t\t\t\t\n\t\t\t\t\n\n", "comment_383": "\nI'd like to say what this song means, but the great part about Tool songs is that they are somewhat user friendly, in that they are very shapeable to what kind of message you hear from them. This is what Jambi means to me.\n\r\nI am 16 years old and live, for some reason, in New York city. It's a shit hole. However, I am also a pantheist, and that means I dont consider myself to be a part of any organized religion. I do, however, feel a primal connection and belonging to nature and the creatues that live nestled in her breast. \r\nOne such animal, is one that also has a bit of belonging to me. I have an Irian Jaya Blue Tongue Skink. I named him Jambi. Not just because it's a nice name for an animal, but there is more behind it. To me, the song Jambi is about a love for something so delicate, so fleeting, and so tantalizingly impermanent, and yet so beautiful like nature. But understood, much like a Lizard. Like my Jambi. People mainly see reptiles as slimy, stupid, heartless, affectionless creatures who lack the ability to love, to think, to feel, to fear. But if everyone looked at nature and her creatures more closely, with a willingness to learn, rather than a desire to conquer, these misconceptions would disappear, when we allow ourselves to observe and live in the world around us with a sense of vulnerability, and as students of our environment, we see that nature... and animals like Jambi... can be intelligent, thoughtful, loving, feeling... all that. He greets me when I come home, sits next to my computer to listen to music, and crawls into my lap when he wants affection. He begs to be petted and he digs through his food for his favorite morsels with the precision of a human mind. He explores his world with a curiosity and inquisitiveness that challenges that of my dog and my cat, be it his tank, my room, the hallway, or the back yard. But yet, as an animal, Jambi is a mortal. And he wont be here forever. Neither will we. \r\nSeek fulfillment any way you can. Through religion? Sure. Through music? Please do. Through nature? I do. Wether or not you believe in an afterlife, there is still the now to take care of. Take care of the now, yourself, your loved ones, and the planet.\t\t\t\t\n\t\t\t\t\n\n", "comment_384": "\nThis may have been stated in the last seventeen pages posted to this thread, but since I am new and don't know...how about it means what it means to Maynard and the boys and whatever you take away from the words is what it means to you? Quit speculating about what you think you know about Maynard, his mom, their relationship, his religion, and her disease. Does it make it better for him, her, or you? No. It's life, it's death, and the music helps us all deal with it, make light of it, forget about it, or face it head on.\r\nI love Tool because of what the words mean to me, the instruments, the vocals, the buildups, the crescendos...it's all a part of the experience. I stopped trying to analyze the meaning and associate it with my values a long time ago because it's a very slippery slope to compare your ideals wrenches to wrenches with an artist of Maynard's caliber. Listen to it, love it, don't love it, I don't care, but don't think you know what it means to him and the band...that's for them, not you. Learn to swim or don't, I'll see you down in Arizona Bay.\t\t\t\t\n\t\t\t\t\n\n", "comment_385": "\nI agree with Tig, in many ways. Infact, in almost every way.\n\r\nAll songs, all words, all pieces of art, even just your own reality, are open for interpretation. TOOL would not be a good band, if this wasn't recognized. Further, they wouldn't introduce such mysterious lyrics, if they didn't know that the song can be open for interpretation. \n\r\nMy interpretation:\n\r\nJambi = The thing which you hold so dear, that you cannot even allow your dark side to come anywhere near it. That thing in life, be it a person, pet, idea, place, memory, etc., for which you love so deeply, you would give up anything. \n\r\nFurther, it's that thing, whatever it may be, that may have changed your life. Which, by its nature, because of whatever manner, it allowed you see something beyond the darkness. To see the Sun. \n\r\n\"Shine on forever. Shine on benevolent Sun.\"\n\r\nThe first god humanity knew, was the Sun. When the Sun is risen, we are not in fear in the darkness and everything which lurks there in. \n\r\n\"I'm just trying to hold on one more day.\" - That is all early man did. Hope to see the Sun rise. \n\r\n\"Damn my eyes if they should compromise our fulcrum.\" - No intent of betrayal.\n\r\nI really think the rest is self-explanatory.\t\t\t\t\n\t\t\t\t\n\n", "comment_386": "\nfeeling eternal well it is an illusion , i recognize being powerless against peoples problems instead of taking others crap u must fix yors first\t\t\t\t\n\t\t\t\t\n\n", "comment_387": "\nHere are my two cents..\n\nThis song could easily be interpreted as the remorse of success.. And to some extent I believe it is, but as with many TOOL songs I think it's layered.  I've often imagined this song in correlation with nature, the Sun singing a song to the Earth, Moon, and surrounding bodies, life, etc.  A kind of back and forth duet.. for example: \"Up to my neck soon to drown..\" (the Sun setting) \"But you changed that all for me, lifted me up turned me round\" (directed toward the moon).. lol I know it's kind of far out but when you look at the song from this perspective It gives it a new spin!\t\t\t\t\n\t\t\t\t\n\n", "comment_388": "\nMJ Keenan for me is a modern day Dante. The lyrics are always multi-faceted and full of allegory. I believe he has stated many times that he is not an artist to do your thinking for you but to help heal himself. If it helps others that's just a bonus. This song for me, is about how the trapping of what is termed \"successful\" in Western culture is based within the materialistic and really the coveting of possessions is actually meaningless. \nA lot of his songs pay tribute to how he was raised and his mother (her religion, and her being disabled), but this hits me to be more about his son. How a relationship such as father and child is so pure without the need to embelish it with material things. Just the gift of time and teaching, and the beauty of a sunrise is enough. At the end I think the lyrics are actually \"Silence, Legion....\" rather than Leech here but it means the same. Stop tempting me with the meaningless trappings of this rotten society and let me see what is real and worthwhile and live a wholesome life.\t\t\t\t\n\t\t\t\t\n\n", "comment_389": "\nI think it's \"Dim my eyes\", not \"Damn my eyes\".\t\t\t\t\n\t\t\t\t\n\n", "comment_390": "\nI disagree with the lyric \"begged like a hooker all night long\" It's bed like a hooker all night long. It shows how religious people can be hypocrites.\t\t\t\t\n\t\t\t\t\n\n", "comment_391": "\nThis song is about wishing so bad for something to come true and then when it does you wish you didn't wish for it.  It's about someone who projects their problems onto someone and wants to use them, and then realizing that they were wrong and that they need to make up for what they put that person through.\t\t\t\t\n\t\t\t\t\n\n", "comment_392": "\nMy interpretation is that this song is about internal conflicts; being somewhat forced to choose between his lover and his own mother. He has much wealth from his music, but values the person he is talking about in higher regards. Success with his music drives him from his mother and towards a 'darker' life that the lover girl seduces him with.\n\nThe person supposedly changed him, and drew him away from his mother and her religious lifestyle that she had imposed on MJK. She helped him out of an emotional black hole, and he ended up in a carnal relationship with her. She could potentially be an Indonesian girl from Jambi who had troubles with immigration (\"...they'd take you away...\").\n\nHe also says he is 'divided', in this case between his mother and his lover.\nAt the end, he repeats 'breathe in union', reminiscent of sex; then he decides to choose his mother over the girl who had dragged him away from her.\nHe calls her a poison-spitting leech; a money-burning manipulator, and someone who is in the way of being close to his mother.\t\t\t\t\n\t\t\t\t\n\n", "comment_393": "\nI always thought this was like an overdependece on a deity or higher being and a satirical play on it. I always pictured Maynard in this song as being a hypocritical and rather evil person who has reached a breaking point and has reached out to a god but as he \"prays like a martyr dusk to dawn\" he still does not give up his corrupt ways and continues to claim he wants to be better and reach a higher level through this higher being but he is too broken to truly change.\t\t\t\t\n\t\t\t\t\n\n", "comment_394": "\nJamb = side support post to a door or window\r\n'i' international symbol for information\r\n'i' as in self\r\n'i' as in eye\n\r\nDim/damn my eyes ??????\r\nRather Jambi eyes!!!!!\n\r\nJambi eyes should they compromise\r\n(if my eyes are dimmed or closed how can I see????\r\nJamb my eyes OPEN.....PUT TWO MATCH STICKS THERE)\r\nFor they are the doors windows to the soul................\n\n\n", "comment_395": "\nI always thought this was pretty straightforward for a Tool song.\n\nHere I am with everything i could have possibly dreamed of, and boy have a I milked it for all its worth.\n\nThen you came along (my child) and changed everything. I'd give all this away in a second for you.\n\nYou're my world, my center. If I compromise you or our relationship by going back to those excesses (and it turns out I won't give it all away), then i might as well be gone from your life.\t\t\t\t\n\t\t\t\t\n\n", "comment_396": "\nI think the relationship between the song, album, and Jambi (location), can kind of be summarized with key words from the first few articles' headlines:\n\r\n\"losing\"\r\n\"cure\"\r\n\"paralyzed\"\r\n\"dirty water\" (right in two's \"muddy water\" line possibly?)\n\r\nI'm going to devote a large portion of my time to interpreting this album, damnit.\t\t\t\t\n\t\t\t\t\n\n", "comment_397": "\nI half agree with trexor, the album has its moments and meanings, but some songs are just purly made for meaning and not for listening.  Tool needs to get a little more interesting for me to stay interested.  NO FLAMING PLEASE i know this album is not a fucking hoax.\t\t\t\t\n\t\t\t\t\n\n", "comment_398": "\nAnd you know what?  I got the CD and it is real as it is.  Trexor you need to get a life.  You sayin this was a fake?  Dumbass.  \n\r\nWell aside from that, Jambi is a province in Indonesia.  And I think this song is talking about the Tsunami wave that hit Indonesia in 2004.\t\t\t\t\n\t\t\t\t\n\n", "comment_399": "\nJambi is a city & port in Indonesia in SE central Sumatra population 340,066. This song is a follow up to the song Aenima....\t\t\t\t\n\t\t\t\t\n\n", "comment_400": "\nIt's \"Damn my eyes\" not \"Dim my eyes\".\r\nIf you read up on the history (as provided by the link to wikipedia) then it would almost tie in from the Sultans point of view. It even says at the beginning \"Feast like a sultan\".\n\r\nSo I guess that's one layer of this onion.\n\r\nHas that narrow minded idiot Trexor sodded off now?\r\nHe obviously needs to get laid.\t\t\t\t\n\t\t\t\t\n\n", "comment_401": "\nDisgustipated- some of the most awful, obscene, and violent things i've ever read have come straight out of the bible. \n\r\nhomosexual rape...mutilation... misogony... shit, if you read closely you'll find that the christian god advocates making slaves of your enemies...\n\r\ni'm saying that because of the human element that all organized religions are flawed... \n\r\ni don't need anyone to tell me who and what to address my hopes and dreams to... i don't need guidelines to know how to live my life righteously... i don't need someone else's sense of morality forced upon me...\n\r\nso how are you going to go about it? do you need the eternal threat of hell to scare you into not having pre-marital sex? not using mind expanding drugs? or other 'forbidden fruit'? or the rewards of heaven if you live well, and don't sin...\n\r\n... the catch of course being that you can't find out for sure until you're dead... what great circular reasoning that is... \n\r\nMIND CONTROL friend, that's all it's about, that's the only reason to get people to believe that your manner of spirituality is the only way...\n\r\nsome of the nicest, most generous people i've ever met have been religious folks... but let me quote Nietzche for a moment...\n\r\n'Beliefs are more dangerous enemies of truth than lies'\n\r\nwhen you have 'faith' of the organized religious manner, you have closed yourself off to other possibilities... if you have doubts, you don't really believe... but what if you're wrong? i know i could be, but do you realize the same?\t\t\t\t\n\t\t\t\t\n\n", "comment_402": "\ndefinitely a beautiful song about love\t\t\t\t\n\t\t\t\t\n\n", "comment_403": "\nJambi is a province in Indonesia by the coast of Sumatra. Sumatra known in ancient times as \"Island of gold\" I'm sure you can see the reference and correlation to the song there. Just for all who pondered on the title of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_404": "\nthis song is about his mother, there is no denying that.\r\ni dont understand why these retards are saying that its about a genie simply because of the name...\n\r\ninterpretation.\n\r\nits about how his life is/was perfect, he indeed 'feasts like a sultan'.\r\nbut he describes that he would give all of that away if it meant his mother could still be with him.\r\n\"But I would wish it all awayÃ¯Â¿Â½\r\nno prize that could hold sway or justify my giving away my center so\"\r\nThis means that nothing is more important to him then his mother, and he would trade the world to have her back if he could.\n\r\nthe song also includes that, (after his mother's passing) he became regretful about his past lyrics about aetheism, and anti-religion. He regrets this because upon his mother's passing, he litterally prayed that she went to heaven, despite his previous attitudes toward religion. \n\r\nIn love with the dark side I fell\r\nDabbling all the way down.\r\nUp to my neck, soon to drown.\r\nBut you changed that all for me.\r\nLifted me up. Turned me round.\n\r\nif you listen to this song from start to finsih, (after reading this interpretation) you can easily pick up on the lyrics that relate directly to: his mother, her death, his life on earth before her death, and his life after her death. these themes are recognizeable as the true meaning of this song. \n\r\nnot some bullshit about a butt fucking genie -.-\n\r\ni hope i may have helped even just one person by posting an interpretation, instead of flooding these forums with pathetic immature bullshit flame wars and retarded arguments.. just use this how its meant to be used :/\n\n\n\n", "comment_405": "\njambi is the name of a DJ. one of his cd's was said to be a cross between \"acid house meets techno.\" seems to be another reference to acid on the album. but since jambi is an indonesian province that was colonized by the dutch, it seems like the song the song is about the good and bad things that come along with imperialism. fitting since the album seems to be an obervation of human nature.\t\t\t\t\n\t\t\t\t\n\n", "comment_406": "\nthe opening sounds like metallica's st. anger album\t\t\t\t\n\t\t\t\t\n\n"}