{"comment_0": "\nFinally, 10 years later, some clarification from the band!\n\r\nIf you listen to A Perfect Circle's \"Judith\" and more importantly, Tool's new \"10,000 days (Wings for Marie Part 2)\", most is explained.\n\r\nHis mothers name was Judith Marie Keenan.\r\nin Judith, Maynard sings 'fuck your god, he's the one that left you broken down and paralyzed'.\r\nIn 10,000 days, he sings '10,000 days in the fire is long enough, you're going home', 'Judith Marie, unconditional one'.\n\r\nJudith Marie suffered for 10,000 days, perhaps from a stroke that left her paralyzed?\r\nShe died on 18 June 2003. Maynard was born on 17 April 1964, so he was 39.2. 10,000 days is 27.4 years.\r\n39.2 - 27.4 = 11.8. He was 11 years old when it happened.\n\r\nLike Jimmy, the track 10,000 days also refers to \"holding the light\" and the light leading you home. In this track, the light is her gift of guidance and faith in him. Home is heaven.\n\r\nTherefore I think Jimmy is about Maynard losing his mother as he knew her. He was young and depended on her. \"The face of your own stability\".  He talks to/of himself (jimmy, eleven) in third person as he is no longer the innocent child he was prior to this event. \r\nHalf way through the song, \"So glad that I have found you\" is Jimmy realising that he himself is lost, not her. The person he knew is still with him in the form of the gift of guidance (the light or \"loaded memory\") she has instilled in him, and he goes on to use it to lead a successful life.\r\n\"I am wide awake and headed home\". There's an ongoing theme in Tool about pain being necessary to advance, and life being that step (best example is Parabol). \"Heading home\" means living his life, moving forward towards the afterlife. \"as soon as pain allows\" means as soon as he has learned the lessons of life.\r\n\"So we can reunite, and both move on together\". Maybe the song is about them reuniting back to the state of happy memories, when they become \"one\" in the afterlife. There's also an ongoing theme of collective consciousness through much of Tools work.\n\r\nAnyway, my main point being that Tool's new work surely confirms \"he\" is mjk and \"she\" is jmk.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nOk, first off I wanna say that I never sign into sites like this.... but just reading all the bullshit on here was just pissing me off. Honestly are you people really that dumb? Obviously 90% of you aren't actual tool fans or maybe bought one CD and consider yourself Maynard experts. Yes Maynard has said that his songs are purposely written in a way that could have several meanings and leaves it open for the listener to interpret it the way they want (that's why he never discusses what his songs are about). But come on...... Sept 11th.....guess he sees into the future, Horoscopes, Numerology, The 11 11 time clock crap, and the list goes on and on. I mean some of you morons are talking about his sister (which P.S. doesn't exist since he's an only child), his mom Peggy, Susie, Kathy. Just stop embarrassing yourselves if you don't know the facts about his family, at least the basics like his moms name. Oh yeah I almost forgot besides getting his moms name wrong lots of you got HIS name wrong. HOW THE HELL COULD YOU BE ON THIS SITE AND NOT AT LEAST KNOW THAT HIS BIRTH NAME WASN'T MAYNARD. The songs name is jimmy.........his name is James......hmmmmmm I wonder who the songs about........maybe his dog. Anyway long story short the song has a pretty simple meaning people......just put the pipe down cause it's not doing all of you any good. It's about him as a boy jimmy......his mom became paralyzed when he was 11...he was sent off to his dads when he was 11..........his whole world changed because of what happened to his mom when he was 11............1+1.......11...the end.  \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThe song is about spiritual growth, as achieved through overcoming painful events that have been put into Maynard's life path.  \n\r\n\"til one and one are one, eleven..\"  means 1 and 1 together make 11. In numerology and spirituality 11 is a 'master' number.  this means that someone who's life is lead by the number 11 has the opportunity to achieve spiritual mastery and move on from this plane of existence upon death. Maynard is talking about gaining insight into the pain of his past, his childhood. \"glow child glow\" means that his childhood will lead him back home. Home being the place beyond, the great light.\n\r\nIt's also worth knowing that individuals whose lives are governed by 11 are believed to be spiritual 'messengers'.  In many cases they are artists and spiritual leaders.\n\r\nThe general content of the album deals with spiritual growth, for example the song \"third eye\".  Look into what third eye means if you are interested.  \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni'm not bread...\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ncan't put any truth to it specifically but the feeling i get from the lyrics over tools whole discography is a general darkness and anger to begin with in undertow and opiate with a sense of tension between anger and happiness and an overwhelming feeling of being lost while having such strong direction. lateralus has more of a feel of realisation of contradictions, prime example grudge - whoever's right or wrong holding a grudge helps no one... aenima feels like the flushing out of the darkness within. realising lack of self control and desensitising just leads to wanting more(stinkfist) hating the martyr within (eulogy), stepping thru shadows(46 and 2)- this all makes me think of one realising he's missed seeing the world in a way he used to before he started being so hateful and cynical towards the world. so when i here the song to me it's about being in a state of confusion about the misdirection of ones life philosophies and wanting to reconnect with the view held as a child, that part of yourself was always there holding a light that you denied and he's wanting you to return, now i'm heading 'home' to my own self that i've ignored and repressed for so long, reconnecting, one and one is one, eleven... i don't know maynards life story but my interpretation of jimmy agrees with my own so that's what i think of when i listen to it, but i wasn't 11 so i think of 11 being two halves of a whole number, one and one can be one together in eleven...\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ni believe this song is about maynards inner child. His real name is James as we all know and Jimmy is sometimes used as a nickname of sorts for james. Think of it as a name people used to call him when he was a kid. anyway something happened when he was 1, either a family member died or moved away (most likely female), and it tormented him. So in the song he talks about coming home to make peace and free his inner child.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIt seems that Maynard is referring to his eleven year-old self in this song (calling him simply \"Eleven\").  Something was lost in Maynard when his mother experienced her aneurysm: a part of Maynard stopped growing with him and moving on.  This is evidenced by the lyrics;  \"Eleven is standing still,\"; and, \"Eleven has been and will be waiting.\"  \n\nFor whatever reason, Maynard needed to go home to \"reunite\" with that lost part of him.  Perhaps it is the part of him that looked to his mother as his \"stability\" or just as someone to share mutual care and love for.  Eleven may be the part of him thats capable of loving his mother unconditionally: of idolizing and adoring her the way young children tend to; but that post age eleven, he moved on with the realization of his mother's mortality and may have been angered by it. It does seem that he's grown more compassionate and understanding towards her throughout his songs about her over the years. He might be seeking the balance between loving her as a young child does, but accepting her mortality and that what happened was beyond her control.  Going home seems like a good place to do so if thats where his mother was. \n\nJust a guess though, as I'll never know exactly how he felt towards his mother before, during or after this song (or any of them for that matter).\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nEleven is how old he was when something traumatizing happened...he lived the rest of his life reflecting off of this experience \"sleeping, lost, and numb.\" \"Leaving me with the dead and hopeless\" his Mother may have been paralyzed from her stroke at this time, maybe. He is hypnotized and \"Eleven (Maynard (James \"jimmy\" as a child)\" is guiding Maynard to him to mend the gap, reconnecting with his inner child. Creating closure...\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nas it turns out your lyrics are aren't quite correct in a few spots, corrections:\n\r\nopening me with INNER GESTURES\r\nI was too SCARRED to realize\n\r\nAlso, if anyone knows the mumbling that starts around 2:50, they should post it, I know it ends in \n\r\n...memory\r\nHold your light\r\nHold your light\r\nHold your light where I can see\n\r\nyep\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nWho fucking cares his real name is James Keenan.  He added Maynard later as one of his ultra tongue in cheek jokes that only he and his bandmates really get.  Once again I hate you all.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nEl = god \r\nEleven = El-Even = God comes from balance \r\nGod = Higher frequency of light and conscious awareness\n\r\nJimmy is his inner child.  It escaped him through his taking on of ego. He is now reconnecting with his inner emotional self. But to do that, all built up pain and fear must be set free: \n\r\nI'll move to heal\r\nAs soon as pain allows so we can\r\nReunite and both move on together\n\r\nClearly he is in the process of reconnecting to his inner soul flame.\n\r\nAnd possibly, the departure of this inner child might have happened subsequently at age eleven.\n\r\nYet, Eleven is also a significant number in relation to the activation of DNA and entering into higher freaquency vibration, evolving into higher conciousness. Awakening ocmes through healing and the creation of balance, 11.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nCONFIRMED\n\r\nWhen Keenan was 11, his mother suffered a paralyzing cerebral aneurysm, which would later serve as the inspiration for many of his creative works. \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthis song is about maynard james keenan(jimmy). When he was 11 his mom suffered from a cerebral aneurysm that left her paralyzed. \n\r\nWhat was it like to see\r\nThe face of your own stability\r\nSuddenly look away\r\nLeaving you with the dead and hopeless?\n\r\nEleven and she was gone\r\nEleven is when we waved good-bye\r\nEleven is standing still,\r\nWaiting for me to free him\r\nBy coming home\n\r\nhes talking about the fact that his mom could no longer be there for him. \n\n\r\nand also in his song prison sex he is talking about being sexually abused. and some believe it was by his stepfather. \n\r\nHe was too strong to realize that\r\nYou you were the voice that was calling me back home\n\r\nthese lyrics probably mean the only reason he came home everyday was for his mom.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nIts about his mother's paralysis.  Same as \"Judith\", \"Wings for Marie\", and \"10000 Days.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nEleventh Step Prayer\n\r\nLord, make me a channel of thy peace--that where there is hatred, I may bring love--that where there is wrong, I may bring the spirit of forgiveness--that where there is discord, I may bring harmony--that where there is error, I may bring truth--that where there is doubt, I may bring faith--that where there is despair, I may bring hope--that where there are shadows, I may bring light--that where there is sadness, I may bring joy.  Lord, grant that I may seek rather to comfort than to be comforted--to understand, than to be understood--to love, than to be loved.  For it is by self-forgetting that one finds.  It is by forgiving that one is forgiven.  It is by dying that one awakens to eternal life.\n\n\n", "comment_15": "\nThis song focuses on Maynard looking back to the period in his life in which his mother suffered the anurysm that left her paralyzed and unable to care for him. He was eleven when this happened.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI'm sure i read somewhere that he was 11 when his mother became paralyzed? (Her name being Judith, hence the APC song 'Judith' about why she retained her faith in god after that) \n\r\nI'm not claiming this song to be about that, but look at the 'eleven' parts of the song, makes sense..\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nMaynard is a nick name he got later in life. This song is about his childhood. He was born James H Keenan. Jimmy/James. Eleven and she was gone. Eleven is when we waved good-bye.\" This is when his mother first became sick, with the cancer that would paralyze her and stay with her for 27 years (10000 days). \"Eleven is standing still, waiting for me to free him by coming home.\" \"Til one and one are one, eleven\" One and one are one, he and his mother are one person, 1 + 1 = 11. The age that it happened.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nGreat song! \t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nYeah, the fact that confirms reverand chris' meaning is that maynard was born in Ohio. So there. Maynard mentions ohio in the song if you didnt notice\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni read a story, written by a tool fan, on his website. it seemed to fit well to the song. i think you should read it. easyweb.easynet.co.uk/~gavlees/… \n\n\n", "comment_21": "\nThis song is about a young Maynard.  Here's the proof,  he is Maynard James Keenan; James = Jimmy what little kid wants to go through life being called Maynard? Second the title is lowercase jimmy not Jimmy to show that it's a child. Thirdly Maynard grew up in Ohio, which goes with the lie \"under a dead Ohio sky\". and lastly eleven is when his mother married his stepfather whom he hates so much as was stated in earlier interviews.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nWe all know that it's about his inner child.  But even more, it's about reuniting with it and dealing with an experience he had when he was 11.  Something happened (read datheR's post) at that age that was very difficult and it's one of those repressed occurances that psychiatrists spend years with patients trying to bring out and get them to accept.  He talks about \"coming home\" maybe not in a literal sense but meaning that he is coming to grasp with the events of eleven.  The event left him torn and it almost seems like he's describing a therapy session. \n\r\n\"Moving me with a sound \r\nOpening me within a gesture \r\nDrawing me down and in, \r\nShowing me where it all began, \r\nEleven \"  -Hypnosis?  if so, then the rest of the song is about what he saw in that state of hypnosis.  It makes sense.  Read through and listen to the song with that in mind...\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ndoes any body know if the story uppity cracker talked about is true? did he really kill his dad?\n\n\n", "comment_24": "\nwhat does the light represent? ive done some thinking on it and i would like to know.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\naight nvm i figured it out. the light is his hope and longing to connect with himself and to accept his past. we wants to heal and free himself of the pain in his life and the light represents his hope for peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nDuke... Parabola is a tool song... and insulting people randomly is not cool. \r\nMaybe he added the maynard B/c of Brother Maynard from Monty Python and the holy grail?\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nSomewhere I read that Maynard's mom died when he was eleven. This fits pretty well with the song \"Eleven and she was gone. Eleven is when we wave goodbye.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nGreat story, Uppity, moving and brings the entire song full circle.  The alternate personalities of Eleven and Jimmy make quite a lot of sense, and bring together one of the lines I hadn't thought much of in the past:  \"Until one and one are one.\"  Thanks for the enlightenment.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nuppity ...... that story is .... wow...\n\r\nBreath taking, shocking and very moving :o\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nfirst off, you people have very valid points here.  I admit i knew nothing of his issue with his stepfather and things of his childhood.  But I took a different take on this song.  I think eleven symbolizes him being forced apart from someone he loves.  \"what was it like to see the face of your own stability suddenly look away, leaving you with the dead and hopeless?\"  that could be when he was forced to leave the one he loved.  \"eleven and she was gone, eleven is when we waved goodbye, eleven is standing still, waiting for me to free him by coming home\"  coming home is being able to return to the one he loves.......at the end he says until 1 and 1 are 1......1 and 1 are him and the one he loves....2 people......when they become one they are together again....also if you notice the number 11 is two one's (two people) separated......oh well, its just an opinion i came up with on my own, take it for what its worth.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI see that too, But\r\nI see the person he was separated from as his mother when she remarried. he didn't really LOSE her, but she changed and became some new person, probably totally submissive to his new step father\n\r\nalso, i think the 1 and 1 are him and jimmy.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nyeah, i can definitely see the thing with his mother and stepfather, the main reason i took it the way i did was that i can relate to it that way.....my girlfriend and i live like 900 miles apart, we talk constantly on the computer and phone but we rarely get to see each other, and so when we do its just hard to leave.....thats why the song meant what it did to me\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nWhile the story concerning the death of Maynard's mother is convincing when listening to this song, it doesn't ring true.  This mistake was that of Rolling Stone Magazine (the staff of which later printed a retraction of the article) ; Maynard's mother is actually still among the living.  Rather, I tend to agree with idiotic in that she remarried someone Maynard strongly disliked when he was 11, and that the song is about reuniting with his 11-yr-old self in order to come to terms with this stressful period in his past ; coming home, so to speak. \t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nthe story from that link above is absolutely fantastic! I was left open-mouthed after the ending. It may not be the true meaning to the song, but it does fit well with the song lyrics\n\n\n", "comment_35": "\nRedrum you are so idiodic, I don't even know how to respond to your lame post\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nSorry Ozzy460 James Keenan's mother is not dead. Go to toolshed.down.net  and got to FAQ and look under jimmy. You read that his mother died in a old Rolling Stone magazine. that is not true.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\ndoes anyone wonder what maynard would think of all of us if he came upon this page. tool isn't the most media friendly band. and just maybe a song that is this personal should be left alone. interpret what you will, but leave little jimmy be.\n\r\np.s. i think this song is about moving past your pain and finding some peace. but i am stupid.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThis is the best TooL song in the world besides Stinkfist and Forty Six and Two :D\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\n\"by FortySixandTwo on 10-14-2002 @ 11:45:15 PM  \r\nThis is the best TooL song in the world besides Stinkfist and Forty Six and Two :D\" -Oxy m0r0n? /o.0\\\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nummmm--did you ever hear about 11:11 theory and lightworkers? did you ever see 11:11 sign on clocks or whatever constantly? well i have. and if you see it alll the timethat means you should become a lightworker and hold your light or go back home.\r\nit probably means that maynard saw those signs and someone taught him about it but then he failed on his mission and returned back home,and that's why he's talking bout ohio.and i think that he WASN'T eleven when that happened,eleven is just in the song because of 11:11 signs.\r\nremember, we are all connected.\r\nanyway,here is an article,it's all there people:\n\n\r\n''11:11 is a wake-up call for lightworkers. Lightworkers are people who signed up for a \"green beret\" type of mission when they were on the spirit plane ( before being incarnated on Earth). What the mission is, in short, is to hold as much Light as possible, as strongly as possible, on this planet. This twenty year period (starting on January 11, 1991) will see matter holding more light than it has ever held before. The vibration on this planet has dropped to a very, very low frequency. That is why it is so difficult to remember our origin, remember that we are all connected, remember who we really are. This is often referred to as the Fall. This mission is very important and very difficult. As I see people around me go through so much, I understand why some go back home. It's intense here right now. ''\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nthe beginning of the song (the strings getting tighter) gavve me thought of getting raped in the ass, thats pretty fucked isnt, but it defenelty got the message across\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nRedrum kicks ass. . .ignore everyone talking about 11:11.  It is total bullshit.  Its just blue car syndrom you dumbasses.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI WISH people would stop fucking leaving comments such as \"this is a good song\" or \"this is my favourite\" NOONE GIVES A FUCK FOR A START! AND SECONDLY YOU ARE WASTING OUR TIME!\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nNo. Idea. The closest I have is the step-father thing at the age of eleven, because Judith (Mother) only died recently.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nMaynard's mother did not die when he was 11. In fact his mother April Keenan ( I think that's her name), died rather recently. Within the past year. They had it on the tool website. They had a splash screen with the \"In memory of \" message.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nMaynard's mother did not die when he was 11. In fact his mother April Keenan ( I think that's her name), died rather recently. Within the past year. They had it on the tool website. They had a splash screen with the \"In memory of \" message.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nMaynard's mother did not die when he was 11. In fact his mother April Keenan ( I think that's her name), died rather recently. Within the past year. They had it on the tool website. They had a splash screen with the \"In memory of \" message.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nGod you guys that say maynard is a prophet really need to shut up. Maynard is a normal human that just happens to be very opinionated and very intellegent. It is about  MJK's mother marrying his stepfather (whom he hates) and her becoming a different person. You stupid fucks that claim Mr. Keenan is a prophet seriously need to get a fucking life.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nWoweeZowee is a prophet!!! hahah jk.  But yea, fuck off you moronic tool fans.  If you're really having that much trouble getting laid, i suggest supporting your local prostitute.  I mean come on, those whores need money to feed their kids n shit like that.  Please do society a favor because as of right now you should be shot.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\npeople who say MJK IS GOD!!! piss me off\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nits about when he was 11 his mother left him in ohio with his father(or step father, i get those 2 confused)\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nmaynard ist talks aboutn his penis.  duuuhuhhh\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nlol that eleven theory is quite funny... let me laugh a little more... also the whole death of his mother... oh man. ignorance is funny. 11 has to do with his mother leaving him I believe. Also this is typically the age of a child finding that they are their own person, not connected to their parent figures, and that their parents have a life outside of themselves. and the one and one are eleven has to do with perfect numbers or something blah blah blah. Maynard's a bit too smart for me sometimes.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nby namrepus on 02-02-2002 @ 01:57:18 PM and by billybobhenry on 05-22-2004 @ 04:15:57 PM \r\ni dont know wat the fuck ur guys problem is but in no way can someone saying, \"this is a good song\" or \"this is my favourite\" can have any affect on your time.quit being a whiny bithch and deal with it. its fucks like you that think there better than every one else that piss me off so eat a dick.\n\n\r\np.s. this is a great song and it kick ass\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nSorry if someone has already put this, i kinda just skimmed thorugh them.\n\r\nThe song jimmy is about Maynard himself.  Maynard \"James\" Keenan.  James=Jim/Jimmy, the song is about something that happend to Maynard when at the age of Eleven in Ohio; Ravenna, Ohio to be exact.  What event happend that i dont know, but it has to have been something that would have made a big impact on his life perhaps with a woman (his mother) or woman figure he was close to and forced to move away from or died (not his mother though she is alive and well) hence:\n\r\nEleven and she was gone \r\nEleven is when we waved good-bye \r\nEleven is standing still, \r\nWaiting for me to free him \r\nBy coming home \n\r\nAnd was always trying to find his way back to her or whomever he left hence:\n\r\nHold your light, \r\nEleven \r\nLead me through each gentle step by step \r\nBy inch by loaded memory \r\n'till one and one are one, eleven, \r\nSo glow, child, glow \n\r\nI'm heading back home\n\r\nOf course this is my interperatation of the song, and i could be way off.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nNot much else to say about this song that hasn't been mentioned already or that you aren't aware of, but there was rumor that if you were to look through the linear notes carefully in the CD jacket, you would find out who this guy \"jimmy\" is. \n\r\nNow, before I even knew about this site, I read through it a few times. Never found it. \r\nFaTaL  has the answer I think, so this is a rather awkward moment for me... \n\n\n\n\r\nAll those sleepless nights....\n\n\r\nJoking. But nevertheless, besides Third Eye, this song is one of the greatest on TOOL's best cd.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nMaynard is a nickname he got in the military. His mother's name is Judith (yes, the Judith of the namesake APC song) and there are other rumors that the \"she\" mentioned in the song are his sister (who he was apparently very close with as a child).\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nhow can you say mjk is a prophet\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nFirst of all, Nailbunny simply, clearly, and concisely analyzed and interpreted the song (thank fucking god--someone has to do it):\n\r\n\"by NailBunny on 07-19-2002 @ 11:55:56 AM  \r\nWhile the story concerning the death of Maynard's mother is convincing when listening to this song, it doesn't ring true. This mistake was that of Rolling Stone Magazine (the staff of which later printed a retraction of the article) ; Maynard's mother is actually still among the living. Rather, I tend to agree with idiotic in that she remarried someone Maynard strongly disliked when he was 11, and that the song is about reuniting with his 11-yr-old self in order to come to terms with this stressful period in his past ; coming home, so to speak.\"\n\r\nI'd just like to add that I find it funny that everytime I visit this board, there are the same types of people posting. There are the flamers/haters that hate life and everyone living it (including those with legit opinions), the spammers/bots that constantly put garbled nonsense that many dumbasses actually read and that posts links that takes you to a website trying to sell you something or that automatically installs spyware/malware on your computer, the overanalyzers that post ridiculously out-there theories, the emotional idiots that relate everything to their life/girlfriend/boyfriend/parents, and the shallow morons that can't think of anything to post but \"I love this song\" or \"great song!\" Well fuck all of you. The name of this site, like an intelligent person earlier in this thread said, is Songmeanings.net, which implies that you should only write something if you have a good idea what you're talking about and base it upon some kind of concrete and/or analytic evidence.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nwhy do you waste your time writing that, its not like anyone cares about it  rog27\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nOk I may be wrong on some facts (hell it could all be made up) but this is what I've come to know about the very interesting Maynard James Keenan. He does not have a sister as mentioned above, he is an only child. His mother was paralized, maybe when he was eleven, his step father was an asshole and they lived in Ohio. Also as someone else mentioned MJK took on the name Maynard while in the Army. Thank you and goodnite!\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nA thought I've had that I thought share...\n\r\nWhen One and One are One, Eleven\r\nWhen 1 and 1 are one 11.\r\nThey aren't just words remember, but also numbers, with their numerical magic.\r\nTwo individuals standing together, or even as suggested his child and his adult selves standing together, side by side. Rather than as in The Grudge, choose 1 or 10, ie, 1 alone or 1 with a clingy dependant 0, sucking the light out. Return to the inner child to forgive the past pain and rediscover what it is to be alive, and whole, with a whole partner.\n\r\nDiscovery of identity then seeking of others of such enlightenment perhaps?\n\r\nAhh I ramble. The light could also refer to the light carried by the tarot card the hermit. One who walks a lonely lighthouse path to ware the others of the rocks. Carrying the light to guide you back home. Lighthouses rule.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nwasnt maynards name  maynard hubert keenan when he was born and he later changed his name to maynard james keena so why is the kid in the song named jimmy\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nJames Hubert Keenan at birth. I'm pretty sure anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\neleven is a warning, good or bad. throughout history signifigant people or  events that change history have this number...stating that the next eleven is already alive, but has to go through his/her life test before ever becoming or realizing their purpose.  This person already knows there is more to his/her life than this and despite all the negative things that accure in his/her life knows that it is for a greater cause.  Must keep faith until the time is right...simple way of describing what this means to me\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\njimmy keenan=11  james keenan=11 jesus christ=11 people who are awaken, knowing they have a purpose, a message to share with you...\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\n11... if we use the alphabet what letters do 1 and 1 correspond with? \"A\" and \"A\" and if we put the two together its AA as in a double A battery with are used is adult toys..... If the members of tool stumbled here, they'd probably think that atleast some lessons were being learned, and that people are thinking for themselves\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nah found it the eleven thing actualy refers to this.... \"The most common 'wake up' trigger are the numbers 11:11 numeric codes - which represent your DNA evolving\" found at a website about developing phycic abilities and evolving\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI believe that this song is about Maynard when he was a child...jimmy which is short for James, which is Maynards middle name, is what the song is called. And if you notice the song is written in lowercase meaning that \"jimmy is just a kid\"\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nby REDRUM158     \r\n\"Its about September 11th you dumb fucks!!!\"\n\r\n...It was written in 1996...\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nEleven. \r\n1+1=11\r\nNumerology: Eleven is a master number, as it is 22 and 33. 10 is perfect, 11 more than perfect. \r\nTool, they like mysticism, the occult. Maybe what he was trying to say is that...\r\nELEVEN.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nthis song is about maynards childhood... his name used to be jimmy.... the title of the song has no caps on the j to show him as a child... he was born james herbert keenan... his mother married his step-father when he was eleven years old and his stepfather allegedly used to beat him and was a total dick to james who changed his name to maynard.... this song is about maynard finding closure in his childhood by revisiting it mentally/spiritually.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nT_E_O is right in my opinion. Aenima is very much about evolution on the album, and they are very much into numerology it seems. \r\nAnybody getting a grasp on 46 & 2? It's all about evolution as well. In this song, heading back home is a metaphor to evolving into the inevitable form without physical existance. He feels we've been there before because that is where we came from. \r\nTake note of the movement of this theme throughout the album. Look at the track H. before 46 & 2: \r\n\"I have died, and will die, it's all right, I don't mind.\" Then for 46 & 2 \r\n\"Feel my shadow, streching up and over me... coming out the otherside etc\", and then in Jimmy he refers to his old self as a different person \"He was too strong to realize that \r\nYou you were the voice that was calling me back home...\"\r\nThen the song aenima is about preparing for the cleanse of ego bound commericalism.\r\nThird Eye speaks for itself...\n\r\nThere is much more that I could write on this approach that I can't be bothered putting down =P.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nTreebeard says a story is only worth telling if it takes a long time to tell (or something like that)\n\r\nHere's what I think...\r\nNailbunny and the first two paragraphs of Rog27's sub sum it up well (Rog does unfold his portable soap-box and go on a bit of a rant in the last bit...)\n\r\nBut I can read other interpretations in it, too.  The narrator (i.e. Keenan), might be describing a painful event at an early age, or we could even go so far as to say that Keenan is lamenting the (for want of better words) 'separation of his spirit', around the age of 11.\n\r\nAs a child, he was a 'perfect spirit' (and please don't mistake me for a crushed-purple-velvet-wearing, palm-reading, chrystal-giggling clairvouyant) as a child, complete; innocent.  His loss was not a literal one, but a spiritual and psychological one.  As he grew/grows into a man, he loses his feminine aspect, or his anima.\n\r\nNo, I didn't misspell aenima, the anima is roughly, in the terms of analytical psychology (founded by Carl Jung and distinct from psychoanalysis, founded by Sigmund Freud, who Jung was mentored by) the female aspect of any male.  i guess it goes along the argument that we are not 100% MALE, but only the majority of our genes/physiology and mental processes are male.  females have a male-aspect, too, and Jung calls this the animus.  Web search these words, there's tonnes of stuff out there.\n\r\nSo our little jimmy is growing into a big James, he's becoming a man, he's losing that unique, androgenous state that we all have as kids (more or less).  The narrator is quite obviously the man that jimmy has become.  He is the lead singer of Tool and he's more than dabbled in the occult, mystical, spiritual etc. endeavours of other people.  He's read a tonne of Jung's work (and stated as much in interviews) and he's aware that Jung talks about the chymical marriage, or reunion.  It follows the lines of the alchemical process (I think), which is the black, white, yellow, red stuff in Lateralus.  The chymical reunion (see the 'Art' card in Aleister Crowley Thoth tarot cards - again, web search it), is the joining of the king and the queen, or rather crudely, Keenan trying to 'reunite' with this anima, to become 'One' again.\n\r\nIt's not an easy process; the negredo, albedo, rubedo parts of alchemy involve a lot of soul-searching, self-exploration and -realisation, and, possibly, copious amounts of hallucinogens and other intoxicants, hence, the 'as soon as pain allows', bizzo.\n\r\nI've dived way deeper into the Jungian interpretation of the song than I intended (but I s'pose it's appropriate, considering the album is choc full of it) and I wanted to also quickly support jimmy11:11's theory on 11:11 and Lightworkers.  The reference stinks of Tool, who take a concept (like Jung's Anima), put their own spin on it (as they rightly should), and then layer it, or relate it to other theories, such as 11:11.  Observe Keenan's battle with his Shadow (another Jung concept) and how Tool combines this with theories on genetic evolution/perfection (46&2 chromosomes, as opposed to the normal 42&2, or whatever it is).  It's the 'wheels within wheels' that Frank Herbert so loves, and which makes Dune (among his other books) such interesting reads, and gets them into the recommended reading list by the band.\n\r\nOnce I send this, i'm going to have another quick look at: greatdreams.com/…, where jimmy11:11's quote came from.  I know it's crackpot gobbledygook, but, like we're asked in aenema, \"show you can read between the lines.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI just wanted to complement myself on a fantastic post, and say that I rock.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nYes, I did read in a Spin Magazine article that this song is named Jimmy after James for James Keenan.  I think this song could have just as easily been called 11.  Eleven could represent when something traumatic or tragic occured and how it changed him forever.  (Can't be sure though)\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThis song is about pillows. Maynard told me. When he says, \"Eleven and she was gone,\" he's talking about 11 pillows that were gone. When he says, \"lead me through each gentle step\" he's talking about stepping on soft pillows. Because pillows are soft and gentle.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nQUEER^^^\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nI think 11 could have many possible meanings in this song like someone said his mom married stepdad on the 11th or whatever which would explain\r\n\"Eleven and she was gone\r\nEleven is when we waved good-bye\"\n\r\nbut i also think in this song 11 has another meaning in numerololgy 11 is the number of the \"light holder\" or spiritually enlightened person explaining \r\n\"Hold your light,\r\nEleven\r\nLead me through each gentle step by step\r\nBy inch by loaded memory\"\n\r\nas for who the light holder he is referring to in the song is i have no idea, but thats what i understand from the song...\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI think 11 could have many possible meanings in this song like someone said his mom married stepdad on the 11th or whatever which would explain\r\n\"Eleven and she was gone\r\nEleven is when we waved good-bye\"\n\r\nbut i also think in this song 11 has another meaning in numerololgy 11 is the number of the \"light holder\" or spiritually enlightened person explaining \r\n\"Hold your light,\r\nEleven\r\nLead me through each gentle step by step\r\nBy inch by loaded memory\"\n\r\nas for who the light holder he is referring to in the song is i have no idea, but thats what i understand from the song...\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nOkay, the song is about an experience (probably traumatic) that changes a person forever. And now years later the speaker's trying to go back and find what was lost. And of course the inner child which he serperated from so long ago is simply standing in the past saying \"where did you go? why did you leave?\" And he holds a light so the protagonist can find him again. This song is personal probably, after his mother married his hated stepfather, Maynard was probably scarred. 11 could be a metaphor for that, or a seperation of sorts 11= two people seperated. 1=reunited.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nthis is a great song, i think its about maynard himself, his mom apparently died when he was 11 so i guess it makes sense\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nso thruthfully i have to dissect this song into sections but i mainly believe its about something .. maybe two people.. that were once together that are no longer together any more. when it fell apart it was sudden and impacted mjk alot. \"ill move to heal as soon as pain allows so we can reunite and both move on together\" reunite proves they were once together and it really is hurting him to the point of not being able to function even if temporary-- \"by inch by loaded memory til one and one are one, eleven\" -- think about the symbolism of the number 11  thats like two bodies standing next together but if they combined together they would solely be 1.. so until 1 and 1 are 1 they will remain seperate as 11.. \"under a dead ohio sky, eleven has been and will be waiting\" -- obviously somethingin ohio.. i was laying under the stars last night thinking maybe maynard meant \"dead ohio sky\" like where was God in the midst of all this? maybe at that time he sought for help (since we all know maynard had a christian foundation) and God didn't react fast enough to keep maynards faith.. so hes referring to God's powers as dead... and \"eleven has been and will be waiting\" -- theyre now separated but are waiting to get back together\n\r\nidk.\r\ni love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nOK. That is good. but, this is better. OK im VERY good friends with MJK's Old Friend. She used to watch him and her son while they were younger. she said this song is about her. she was the \"mother he never had\". and how he misses her. He wants to go back to when he was with her and her son. It turns out that while he was younger, he hated his parents, so he spent time with this family. So its about his inner child and wanting to find her again. Pretty cool Huh?\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nya i agree with the whole maynards inner child thing as the meaning of this song. but it can also apply qute well to almost anyone whose having a really bad time with someone (mostly of the opposite sex)\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nThis song is definately about maynard losing his mother as Lynx explained. Listen to Judith, Wings for Marie and 10000 days(Wings 2) and it's quite clear.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nagain it makes me think that,this song is about father/son relationship\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nWhat's the point in sitting here arguing about what the song means? No one but the person who wrote it knows. Listen to it, read the lyrics, try to understand what it means to the person that wrote it sure, but also take the lyrics and apply it to your life and your experiences and situations. It's not always good to define every piece of art that comes down the pipe. Sometimes it's best to just leave it alone and give it your own meaning, but while doing that you have to be open minded enough to realize that not everyone is going to interpret the song the same and be accepting of their opinions. In short...who gives a fuck? It's a song. A damn good one. Stop arguing about what it means and enjoy it.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nwho was arguing? everyone was already doing exactly what you said... applying the song to thier own life and experiences, or else they wouldn't be here. the whole point of this site is to take whatever youve gained from listening to the song, and post it where everyone can see...so that we can try to better understand what the artist was trying to communicate through the song. I mean...the comment box im writing in right now says, \"what does this song mean to you?\" and i do agree that it isnt always good to label everything. it seems to take away from the impact that the lyrics have when you know EXACTLY what they mean, because then you can no longer apply your own experiences to them. they become impersonal. on the other hand...i came here to find the significance of the number eleven in the song. and if everyone was just talking about what it meant to them, instead of trying to figure out what it meant, i might never have found out. so...i guess...i give a fuck... \n\r\nanyway...i always thought maynard was talking about his inner child because of the reference to his old name. and i also have to agree xlynx9's theory... it makes the most sense...and, it seems to be mathematically sound too, i guess... \n\r\nalso, does anyone know what maynard is whispering between 2:54 and about 3:03?\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nok there is a dumbass way back on the first page who said that this song is about september 11th. id just like to thank him cos i didnt know that maynard was magical, could travel fowared in time, write a song about that day, then go back and record it\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nFLAMAGE!\r\nIn retrospect, Eleven is used alot in 10,000 Days. Could that hold any significance?\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nI can't believe this hasn't been updated since the new album (10,000 Days), but I think I got this figured out.  I can't claim to know all about this song, but this should at least clear up some stuff (this also isn't original, as I've read it other places, but keep an open and skeptical mind).\n\r\nMaynard was born April 17, 1964.When he was 11, it was 1975/76.  This means he is now 42 years old. 10,000 days is equal to 27 years and some-odd days.  His mother had a stroke in 1976, and died in 2003.  This period of time is equal to 27 years, or 10,000 days.\n\r\nSo in other words, when Maynard was 11, his mother had a stroke, leaving her paralyzed for the rest of her life (being 27 years, 10,000 days).  The song jimmy is about his mother having a stroke, Judith is about her unwaivering support in God despite those around her and her position, and Wings for Marie/10,000 Days is I guess more or less a eulogy.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nSorry, didn't see the post before me, but I just hope it adds more credibility.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nLooks like his mom \"left him\" by marrying some one he hated at 11, and he uses a play on words to make 1 and 1 1 at the end, like he lost part of him self that he was finally united with.\n\r\nSo 11 is the age it happened at each 1 represents part of himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nOf course I didn't read em all, so I could be completely wrong. But maynards already said that he reads these meanings and most of them are completely wrong so w/e.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nEleven = Hell / Heaven\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nFrom Wikipedia:\r\n\"11 is the first of the ten Master Numbers, used in numerology. To a numerologist, such as Cheiro, 11 (numerology) would be made use of to derive \"occult symbolism given to what are called the 'double' or 'compound' numbers\"[1]. In this sense, symbolic use of 11 is often not strictly logical. Furthermore, occult use of the 11 as a 'compound', differs greatly from 11 used mathematically as a natural number.\n\r\n11 AS A SUBLIMINAL SYMBOL\n\r\nTo a numerologist, the number 11 can represent the beginning, the architect of the universe, or oneself, and can signify a higher esoteric life purpose. (MC Universe) This number can literally mean a rebirth number â\u0080\u0094 the number of change, of personal-inward revolution. When considered numerologically, the number 11 can either be thought of in its original form as 11, or 2, i. e. 1 + 1 = 2. In this sense, the number 11 has an unstable nature that switches between itself and its sum of two, itâ\u0080\u0099s a hard number to master, especially for individuals with this life number.\n\r\nTHE LIFE PATH NUMBER OF 11\n\r\nAccording to MC UNIVERSE, 11 represents the illumination, wisdom, channeling into the subconscious level, and unpracticality. Alone, it is capable of a 50/50 chance of using its potential for good, and the other for evil, but that depends wholly on the person. 11 is duality, not singularity, being able to alter the face of the world. It depends strongly on its uses, people, and attitudes of the individuals with this Life Path Number.\"\n\r\nAlso, 1 and 1 are 1 in boulian mathematics.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nxlynx9 just blew my mind.  fucking wow.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\ni agree with everybody, this is by far one of my favorite tool songs, i use to listen to it over and over again because the lyrics are so powerful, but in my opinion i think he is talking to himself dealing with his own internal struggle. Something tramatic happened to him when he was 11, whether his mom died or left him or he is missing the woman who took care of him. When he says \"I'll move to heal ass soon as pain allows so we can reunite and both move on together\" i think he is talking about himself, reuniting and confronting his memories, accepting them and moving on. Another example \"Under a dead Ohio sky eleven has been and will be waiting defending his light and wondering... where the hell have i been sleeping, lost, and numb so that glad that i have found you i am wide awake and heading home.\" I believe this was a definative moment where he tried to detach his self but a part of him was still there and he was never fully able to accept what happened. But when he finally let go he was reunited with his childhood self. Again to me this song is all about acceptance and understanding, his struggle to accept the things that have happened to him in the past, and reuniting with the memories of his childhood. \r\nHa even though im probably completly off target!\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nI think that all of you are correct......... those who actually contributed anyway.......\n\r\nCrymie, in my opinion, is coming closest to the heart of it though....\n\r\nThe stroke and the marriage to the evil stepfather do play into all of this, the loss of his anima.  But, there is more to Jung's theory that got left out.\n\r\nFirst is the theory of opposites..... opposition creates energy, this is why in adolecence, boys try as best they can to be manly and girls are as girly as they are ever going to be...... If JMK's stroke did happen when jimmy was 11, post re-marriage... perhaps jimmy felt a need to \"man-up\" to take care of his mother..... causeing him to lose touch with his anima.\n\r\nNext is the Theory of Equivilence.... stating an equal amount of energy is given to either opposing side, if one side is given to much energy, it can cause a complex.\n\r\nFinally the Theory of Entropy, which talks about the tendency of opposites to come together..... when boys and girls grow up, they become more androgenous. This is often a product of Individuation.\n\r\nDuring the process of Individuation (for a man) the anima acts as a guide for the ego to the unconscious.  Leading him to be able to \"step through his shadow\", or in this case deal with the painful memories of his mother's stroke and the effects, and her remarriage and its effects.\n\r\nThis is why in the song she holds a light and leads the way to what Jung called syzygy...... the reunion of the anima and animus. They are often seen in dreams as the king and queen of the enchanted castle. (see Jung's Man and His Symbols) Reuniting the male and female of the inner self, as well as accepting the shadow are of utmost importance in the process of individuation and the discovery of the divine self. All of these theories seem to be a recurring theme in this album.\n\r\nTo protect the autonomy of the song I must say that I based my opinion on the male relating to the anima, as MJK is a man...... but it works both ways..... for women the animus, often comes to us as a wise old man, would lead the way to the \"enchanted castle\".\n\r\n(as a side note, he refers  to her   as \"the face of your (his) own stability\"...... the face of your balance, your anima/animus..... while for men the anima usually takes the form of a maiden, at the age of eleven, generally before boys discover girls, the anima can very well come in the form of his mother.But as an adult,looking back, he sees her as a child; exactly as he left her, at only 11 years old)\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nYou all are fucking crazy. It's obviously about a PCP tripp. Becky and I would know.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nidk if anyone's noticed, or mentioned this, but the length of the song, 5:24 adds up to 11 (5+2+4 = 11)\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nThis really doesnt have a lot to do with the meaning, but i found some irony in the song. Jimmy is track 9 on Aenima. The key number to the song is 11. 9/11 comes to mind especially with the line \" Eleven and she was gone. Eleven is when we waved good-bye.\" I thought that was intresting. Like i said, i know this has nothing to do with the meaning, but i thought it was quite ironic that it came out that way.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nThis is about his mom when he was 11 years old. She had a stroke and it left her in a wheelchair and partially paralysed. He grew up in Ohio, it doesn;t have anything to do with sptember eleventh... this album came out in 96...\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nHence why i said \"this really doesnt have a lot to do with the meaning\". I know damn well when the CD came out (i own it, actually and can tell you just about anything about it cuase its taht damn good :). I was just merely pointing out the irony in it being track 9 and the main number in the song being 11, that is all. Next time i will try to state things more clearly...\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\n11nirvana11, after reading all this stuff you still think its about a pcp trip? whatever, your opinion. (go listen to nirvana and leave tool alone)  oh yeah  and i got 100th posting!!!!! i own this song now!!!!  its mine now\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nOMG THAT IS SO FUCKIN SAD ABOUT HIS MOTHER. I have absolute faith that this song is about his mother.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\npeople who don't quit being complete shitheads will pay the price of karma.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nLuke 11:11. And which of you, if he ask his father bread, will he give him a stone? Or a fish, will he for a fish give him a serpent?\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nguys,, H is the 8Âª letter in the alphabet and the 8Âª music of the Cd is Intermission .. I is the 9Âª letter and the 9Âª music in the Cd is Jimmy..\n\r\nand i put the 3 musics in the sequence.. Intermission sounds like the introducion of Jimmy and then like the chorus : 'Under a dead ohio sky,\r\nEleven has been and will be waiting,\r\nDefending his light,\r\nAnd wondering...\r\nWhere the hell have I been?\r\nSleeping, lost, and numb\r\nSo glad that I have found you\r\nI am wide awake and heading home'\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nand then i search for '11' and 'light' and i founded pages about Nuclear War Survival Skills and First World War\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nJimmy is the 9Âª music in the Cd and have these 11 thing .. and the Cd is from 1996.\r\nkeeping in mind the 11/9/2001..\n\r\n9/11/1996\r\n11/9/2001     \n\r\n9+11= 20 \r\nbetween 2001 and 1996 is 5 five years .. so..letÂ´s see what we have in 2005..\n\r\n20/1/2005  Under a dead Ohio Sky , Bush is the president of de USA now.. and this isnÂ´t good thing..\n\r\nbut ... the song is called Jimmy !\r\nJimmy Carter !!\n\r\nhe won a Nobel Peace..\n\r\nand what does that mean at all ?\n\r\ni donÂ´t know..but it was fun to me , to put all the pieces together\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nTo me the song is about finding that light in your past waiting for you return. The most beautiful song on the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nfor all you who think that in the song when he says \"til one and one make one eleven\" means that 1+1=11.  thats not the case. it is written as: \r\n Hold your light,\r\nEleven\r\nLead me through each gentle step by step\r\nBy inch by loaded memory\r\n'till one and one are one, eleven,\r\nSo glow, child, glow\n\r\nnote the comma after the second one. he's telling who ever 11 is (probably his inoscence, inner child or some shit like that) to lead him through his hardship until him and 11 are one. (one and one are one)\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\ni think the whole 11:11 is pretty cool, and probly is what its about, combined with his step - father thingy.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nMaynard's mother was paralyzed when he was eleven, and he frequently calls her his light... this song, Judith by a Perfect circle and 10,000/wings for marie as an example\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nI'm not sure she was paralyzed, but I am pretty sure that he uses \"light\" in referenceto his mother\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nMaynard's mother was paralyzed when he was eleven but I dont think this song is JUST about that. Its about him coming to terms with having to grow up quickly. Leaving then coming back.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nhmm i saw some movie where they said 11year is the year of one big step of ageing.... :P\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nMaynardâ\u0080\u0099s mother suffered a crippling stroke in 1975 or 1976, presumably when he was eleven years old. Born James Herbert Keenan on April 17, 1964, Maynardâ\u0080\u0099s child name was probably Jimmy.\r\nK is the eleventh letter of the alphabet. Ketamine was an inspiration to Maynard, especially on this album. For proof, read the fourth inside page of the liner notes describing (without naming) K as a dissociative anesthetic used for surgery on different species of baboons or monkeys. Anyone who has experienced the â\u0080\u009cemergent stateâ\u0080\u009d of conscious anesthesia on K will draw a distinct psychosomatic connection with the lyrics to the left. K users call the drug state â\u0080\u009cbeing stuckâ\u0080\u009d or â\u0080\u009cbeing in a hole,â\u0080\u009d because the profound detachment promotes stillness, yet within the sinking depth of the conscious dream state, the mind is wide awake, experiencing a state that is more psychedelic than anesthetic. K is very reflective, often causing the user to put together information about his/her past in a profound way (showing me where it all began). Movements and sounds take on a profound, extended meaning and a sense of ritualism.\r\nIn the reflective state of Ketamine it seems that Maynard recognized an inner calling that has been subconsciously urging him to return to and re-inspect aspects of his difficult childhood. He realized that this voice was a part of himself that he had disconnected from: Jimmy, the eleven year old. Perhaps one reason Maynard rejected his past self was the religious view that eleven-year-old held. Jimmy held a light (a holy view of the world) that is no longer the light that Maynard holds (Maynard killed that light).\r\nThe adult Maynard has a new understanding of the world, a new light to hold. K is especially powerful in that kind of transformation. The experience feels the same each time, yet it is hard to remember it explicitly, once sober. It is like coming home to an elusive but familiar place every time. It is a comfortable, still, quiet place where memories converge and reunite. It feels like you are tapping into a place that has always been there, and that will always be there for you, like home.\r\nEmboldened to confront and accept his childhood, he can heal, reunite with his past, and move on. â\u0080\u009cJimmyâ\u0080\u009d is probably a song about that, as most carefully analysts have concluded, but they miss the parallel to the drug that caused it to happen. This omission is understandable, because not many people have tried K, and also for that reason many will reject this Ketamine analysis of the song. My answer is this: look at the liner notes, try the drug, and listen to the song again. To not acknowledge K is to not fully understand Tool. â\u0080\u009cPrying open my third eyeâ\u0080\u009d also refers to using K or similar drugs to attain a visionary state of projected mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nI'm pretty sure this song is a reference to the fact that his mother had a stroke that left her paralyzed when he was 11. Hence, the recurring mention of the number 11. It's about him coming back to himself, reuniting with his young self to come to terms with what happened to his mother.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nHaha, perhaps I should have read the comment above mine. I don't know about all that K business, though it's an interesting idea and could very well be quite true, but I do know it's about Judith's stroke.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nok so we have i assume concluded that 11 was the age Maynard James Keenan (born James Herbert Keenan on April 17, 1964) was when judith marie garrison, his mother had her stroke. an event that left her paralyzed and in a wheelchair for 27 years(roughly 10,000 days) until she died in 2003. I believe that based on the song judith done with a perfect circle...as well as common sense that this had a devestating efect on young jimmy, and he drifted from the love and faith that his mother had. she was very religious and remained so thru it all unto her death. check lyrics on judith...\r\nIt's not like you killed someone \r\nIt's not like you drove a hateful spear into his side \r\nPraise the one who left you \r\nBroken down and paralyzed \r\nHe did it all for you\r\nHe did it all for you\n\r\nhes obviously even after jimmy was written dealing with this faith shaking ordeal. and how his mother never lost faith.\r\nbut i digress... jimmy lost that innocence and faith in god at age 11 and this song is about james' awakening and yearning to return to that innocence. hes asking his 11 year old self to hold the light up to guide him home... if you know or read the lyrics for wings for marie off of 10,000 days the light is faith, the faith that his mother instilled in him and he lost when she had her stroke. \n\r\n This little light of mine, a gift you passed onto me,\r\nI'm gonna let it shine,\r\nto guide you safely on your way \n\r\nYour way home...\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI think that 'eleven' refers to the age that Maynard was when his mother married his stepdad and this abuse began. In the verse \"What was it like to see\r\nThe face of your own stability\r\nSuddenly look away\r\nLeaving you with the dead and hopeless?\n\r\nEleven and she was gone\r\nEleven is when we waved good-bye\" refers to what probably happened or the way he felt when his mother was involved with a new man(the stepdad) and maybe he felt that she suddenly turned her attentions to her new husband, and then also the stepdad probably started abusing him around that time. The verse \"Eleven is standing still,\r\nWaiting for me to free him\r\nBy coming home\" and then later on in the song \"I'll move to heal\r\nAs soon as pain allows so we can\r\nReunite and both move on together\" refers to maybe his stepdad now realizes what he did was wrong and has gotten help professionally and really wants to apologize to Maynard and to tell him that, and he has been \"standing still\" emotionally waiting for the oppurtunity to tell him so that they can both heal and move on. But Maynard has stayed away for so long. Maybe after some type of psychotherapy, where these buried memories were drawn out, he realized that in order to heal, he would have to go home and confront his stepdad. Does this sound on track or am I way off?? No matter what, this song could have a variety of different meanings for different people. I love that about Maynard's writing...that it is obviously very personal for him, but also that it becomes very personal for others who listen to the songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI agree with polyscient and fnxone. While I've never tried ketamine, I have read about it and user's experiences and the way polyscient has described it while on k sound true. Maynard's mother had her stroke when he was about 11 and the \"light\" is (was) his faith and such.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nMany of you are correct. It is about the coma of his mother for 27+ years, 10k days. She's Judith Marie. As for the Light, she used to sing to him. One of his personal favorites was \"This little light of mine.\" Which goes on to say, I'm gonna let it shine.... yada yada. \n\r\nNow, I've heard rumors his friend died in a car crash on Route 11 in Ravenna, Ohio where he's from. look on a map, I've driven that road. Stories have suggested that this song is double meaning for the loss of his friend and mother.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nI asked maynard in one of my LSD enduced visions and he told me that this song is about his world of warcraft charecter, a level 11 undead mage \"11 is standing still (nodobut in an inn), 11 is when he waved goodbye\". Clearly feeling neglect for his charecter left in cyberspace, he wrote this song to remember him.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nI think he's interpreting 1 and 1 creating 11 instead of 2.\r\n\"'till one and one are one, eleven\"\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nI think this is about Maynard being born James, nickname Jimmy as Galactic Cactus stated, but I think he was 11 when his mom got in the car accident that paralyzed her.His recolecttion of how he felt when it happened.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nThe song is with out a doubt about his mother when he was a child.  Because when he was 11, his mother became paralized.  Sending him to live with his father.  Ever since then, he hated god with the passion, which also explains the meanings of Opiate and Judith.  It is in no way, shape, or form linked to September 11 like the dumbass REDRUM claims, because this song wasn't released untill 1996.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nTOOL writes a lot of songs about AA.  AA originated in Akron, Ohio and Step 11 is the step practiced to achieve continued spiritual growth.  Step 11 in AA is a step of self examination and self discovery to face yourself in yourself and grow  The lyrics:\r\nMoving me with a sound\r\nOpening me within a gesture\r\nDrawing me down and in,\r\nShowing me where it all began,\r\nEleven...\n\r\nThis represents the spiritual seeking Maynard speaks of in a lot of his songs.  Step 11 is a step of mediation and self discovery seeking answers, whether it is sound, word, picture, whatever  it is that draws you into a heavenly conscious.  Step 11 is practiced to examine the core issues of your problems within yourself...where all problems begin in the sub-conscious.\n\r\nThe lyrics:\r\nHold your light,\r\nEleven\r\nLead me through each gentle step by step\r\nBy inch by loaded memory\r\n'till one and one are one, eleven,\r\nSo glow, child, glow\n\r\nI'm heading back home....\n\r\nRepresents spiritual growth to \"head home\" to the creator of your understanding. \n\r\nThis is the beauty of music, to find individual meaning in a song and grow from it....no one is right or wrong... How one interprets lyrics and music to their own individual meaning is the beauty of self discovery.  To me, Tool and all their songs are about positive messages that has opened my mind to infinite possibilities that has helped me grow as a person.  \n\n\n\r\nWithin the inner circle of membership, members will often refer to themselves as\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nTool basically hides multiple meanings in their songs, so any of them could be right, and there's really no way of telling which is the right one.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nAnother weird connection to 11 (although I realize that you can find connections to any number anywhere if you stretch far enough), if you assign the letters in \"jimmy\" a numerical value based on where they are in the alphabet, you get j=10, i=9, m=13, and y=25.  Add the two m's because they're the same letter, you have 10-9-26-25.  10-9 is 1; 26-25 is 1.  Two 1's next to each other, 11.  \r\nJust a little something I thought of working second shift, thought it was interesting.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nI just want to point out, to who it is that stated that K is the eleventh letter of the alphabet and that the substance in the liner notes is Special K...\n\r\nI think the substance referred to in the liner notes is actually DMT, which is also a dissociative.  Tool has many references to DMT (I would say definitely more so than K), and it seems to me that it would be more appropriate.  I guess what I'm saying is that I don't think there's a connection b/t the song jimmy and K.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nWow, i m sorry but some of you are really pathetic tool fans. Getting basically something like biblical codes out of jimmy? Ok Maynards real name is jimmy. At age 11 is mother became ill and he had to spend time with his stepfather. He hated the idea . And ohio is where he lived at age 11 with his stepfather. he just basically calling out to his mother . i dont get how you decide that this has something to do with 9 11 or president bush.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nThe repetition of Eleven is perhaps more relevant, think about hypnosis. The hypnotherapist counts to ten, but you fall into unconciousness before ten, Maynard seems to be suggesting he's gone beyond and seen Eleven?\n\r\nJust a thought\n\r\nThough I like the description of how he lived with his stepdad at 11 because his mother grew sick, the song definately reaches out to his mother, because Ohio with his stepdad isn't home to lil Maynard so he wants to go home.\n\r\nThough I think most of you are right, Tool songs also try and allow the listener to grasp something, I can't think of a totally introspective Tool song. So it must have some more universal meaning, though it's impenetrable to me.\n\n\r\nAny thoughts drop me a PM\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nIt's obviously about a particular moment in Maynard's life, but I get a general \"face your demons\" sort of vibe from it.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nLet's not also forget the rest of the Album. Aenima is a concept album. It's about growth. Forty six and 2 is about Shadow Work. \"Stepping through my Shadow. Coming out the other side.\" Memories are a huge factor in Shadow Work. Getting to all of that Bullshit, peeling back layers. Childhood almost always comes up. I think the song is about Maynard figuring his shit out.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\njust a thought about the idea of 'hold your light' someone mentioned on page 1- ive read that several of the songs reference jungian psychology, and in jungs analysis the ego is seen as the 'light of consiousness', as opposed to the subconcious 'shadow'. so perhaps the meaning is that the young MJK had his ego damaged when he was 11, leading to fears of being overcome by his shadow. this links to the idea of individuation & evolution explored in 46 & 2, where the ego and shadow are transcended to form the true self. smart stuff, inspirational. \t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nHi guys, I believe this song could be about divorcing. His mother and father did divorce, and I think the bad happening he is speaking about is when they divorced. The reason why: He is talking about 1 and 1 becomes 1, which I think refers to, that 2 elders becomes his parents. I don't think that it's he and his mom reuniting because he wouldn't speak about it as 1. He is also talking about \"Waiting for me to free him\r\nBy coming home\" which includes a guy (possibly his dad) right after he mentions that she(mom) is gone.\n\r\nAnd somehow I think the light and the loaded memory he talking about is the good times, which he is clinging to and which he wants to build his life on. The ending relates to this as well, the fact that he doesn't want to rely on the bad things, he wants to rely on the good things.\n\r\nThe impressing thing is that nearly all Maynards texts can be interpreted in many different ways, it's so unbelievable! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\n\n\r\nin a recent interview for puscifer maynard talks about when you first start experimenting with hallucinogens you notice SYNCHRONICITY like when you dont look at the clock all day but when you do it says 11.11 (duh) 1 AND 1 ARE 1 ELEVEN.....\r\nSYNCHRONICITY (duh)\n\r\nthe songh is a direct mockery of angels and the god system described in the 11.11 theory\r\nmaynard is just bending shit like he always does and you fags are all like he hates his stepdad. he misses his mum or lover or some sissy shit.\n\r\nthe earlier tool stuff is satire (duh) i cant believe you fucks cant see this shit\n\r\nim not even a fan \t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\ni'm going to tell you all a little secret about Maynard, what he puts strait foward is never what it is but only an illusion so that the ones who understand (smart people) can keep it secret from all of the others (dumb people) this song track 9 jimmy is about 9-11-2001, and if you don't beleave that then you are one of the dumb people but it is not your falt, from all of Maynard's clues on september 11 2001 i was waiting for it all morning, then it happend i will admidt even i was confused on some of the clues but after it happend it helped me to understand Maynard's codes even more, redrum you were the only one in this list who got it right but it's sounds like your high strung be carefull my friend when they wiegh your heart, the next level is going to be alot of fun you don't want to miss it and for the rest of you good try but it takes more then that to defined a tool song! goodluck, 2012 is just around the corner i hope your ready for the next level\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nWhen Maynard James Keenan (jimmy) was 11 his mother suffered a paralyzing cerebral aneurysm this incident has ispired Maynard to write many songs about. But this song is specifically about his mother having the aneurysm and then his mother Judith perseuding him to move in with his father, Maynard says this was the best move he could have made ( coming home) Also jimmy is spelled in lower case letter to let it known that he was small and /or young.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nI agree that there may have been a tragedy as a child (I believe that his mother suffered a stroke and ended up in a wheel chair when he was eleven and she died ten thousand days later).  However, I truly belive this song is about us as humans reaching a new level of conciousness... in regards to our souls or psycoholigical \"beings\". Eleven is the position of the aquarious within the zodiac, a representation of the next age humans will enter in 2150 (starting in 2012 as the shift in conciousness; allowing us to truly see humans capailities and we will learn to live as one mind). He states \"eleven has been and will be waiting, defending his light and wondering where the hell have I been, sleeping lost and numb\" this means that eleven is waiting to happen, today in our human form we are limited (as humans we are \"sleeping lost and numb\", when we die our bodies may decompose but we still have astral bodies, therefore he will be able to reunite with his mother in their new state of being. We will learn how to live as one mind and experience astral form of being in the future.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nJimmy is often a nickname for someone named James.  This song is taking about his ordeal when he was 11 years old.  When he was 11, his mother suffered from a cerebral aneurysm which paralyzed her.  He is talking about how hurt and how young he was at 11.  \n\r\n\"What was it like to see,\r\n the face of your own stability\"\r\n--- This could mean what was it like to look at your stability as it leaves you.  As I just said, His mother, Judith Marie, suffered from cerebral aneurysm which PARALYZED her.  It took away her stability.  \n\r\n \"Eleven and she was gone\r\nEleven is when we waved good-bye\" \r\n--- This could mean when he was 11, she was gone, when he was 11, he had to say goodbye to his mother.  \n\n\n\n", "comment_146": "\nEveryone saying that Eleven references his mother's cerebral aneurysm is correct.\r\nEveryone saying that the 10,000 Days album-name references 10,000 days = 27 years, the amount of time between her aneurysm and her death MIGHT be true, I don't know enough about her death to confirm this or not.\n\r\n\"Eleven and she was gone\r\nEleven is when we waved good-bye\"\r\nThe literal meaning of that lyric is, of course, saying 'bye' to your mother as she's rushed to the hospital.\r\nHowever, I believe it means that her aneurysm lead to her death (which it did), and so, when he was eleven, he had to say goodbye to her, as she was killed by the aneurysm. It just took 27 years or whatever for her to die. Poor Mrs. Keenan.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nFirst i would like to say that the band Tool, mainly MJK are very adept at creating alter meanings to there songs. IN all of there songs there all multiply meaning that anyone can perceve differently. For this song Jimmy is specificly about the idea of 11:11. If you arent aware of this term than you should all now do so. 11:11 as i stated before is the hole main meaning of the song. This idea is based off of \"all matter is merely energy condensed to a slow vibration. That we are all one consciousness experiencing itself subjectively. There is no such thing as death, life is only a dream, and we are the imagination of ourselves. Said by the marketeer Bill Hicks. His ideas of 1 is what MJK is trying to convey.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nWhat I'm going to add may or may not be relevant to Maynard's concept; however, it is still interesting.  \n\r\nEleven is the positioning of the Aquarius within the zodiac, which represents a new age.  Here me out, before \"Jesus\", we were in the age of the Torus which Moses represented.  After that (presently) is Picies which Jesus represents.  2012 will be the BEGINNING of the shift of consciousness into the age of Aquarius (which will be in 2150) when ppl will stop believing in God, start thinking as one.  Right now we (I shouldnt say we, because I dont follow however, you get my point) are all blindly following the shepherd.... We need to understand that the human mind is capable of absolutely anything.  Perhaps life on earth is a test... Who knows, nobody does.... But I do know that there are many wonders in the universe, to think that there is something better after we die is not silly; however, thinking that there is a man waiting at a set of pearly gates anticipating your fate...is.\n\r\nIn my opinion, when eleven comes around.... either when we die or to those privileged enough to live during the age of Aquarius, we will be able to connect again with those who we lived our human lives with.  The energy we hold is indestructible.  Even when we are dreaming, our consciousness is separated from our bodies.  Our bodies actually could be a barrier, I'm not sure.\n\r\nReligion holds so many restrictions on us right now.  For example, stem cell research.  Stem cells could have helped his mother, but she was unfortunate and lived in a time where stem cells research is not allowed because of religious folk.\n\r\nI have so many theories, but little time to explain, just thought I would give someone who appreciates this info, something to research.  \n\r\n\"Swing On The Spiral Of Our Divinity\"....  Forget Dogma... who says GOD is better than us humans?  Think for yourself!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nI wish i knew more tool fans personally... i would love to discuss their songs every minute of the day if i could... actually, only when im not listening to them... hahahaha\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nIt really is a nuisance to come to this site and see so many people wrong about the inspiration about the song. Simply read a Wikipedia page about Maynard and you'd be intellectually stimulated in his discourse.\n\r\nThis song pertains to, well of course, the age of eleven for Maynard James Keenan. When he cites:\r\n\"Eleven and she was gone. Eleven is when we waved good-bye. Eleven is standing still, waiting for me to free him by coming home.\" - He's clearly stating that he and his mother left each other, in the sense that during the age of eleven, his mother (Judith Marie) had a cerebral aneurysm which ends up causing plenty of dissension between the two, hence the song 10,000 Days (Wings for Marie Pt. 1) and Pt. 2.\n\r\nHe then, two years later moved in with his father after his mother made the suggestion, he considers this the \"best move he ever made.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nI just made a account here only to say the following:\n\r\nThe ones that say that one interpretation is better than the other are completely full of shit. The lyrics to any of tool's songs is simply a way of filling out and redefining the full picture of the band. Sound is a higher form of language, listen to the music instead of focusing on the words cause in the end, they dont matter as much. What matters is your interpretation of the whole picture, the whole song and even the whole album. \n\r\nIt is the sounds that gets you into that emotional state, not the lyrics. Every tool fan should know this, if not. You can go fuck yourself cause you are the ones that destroy, and are also responsible for at least 90% of the comments on tool songs made here on songmeanings. Corporate, brainwashed fucking kids that have no right to even try to influence the mind of others with your complete BULLSHIT. There should be a website just for discussing and analyzing the songs of Tool, invitation only. Then we get rid of these britney spears and justin timberlake-listening FREAKS that ruins for the rest of us with your non-intelligent bullshit.\n\n\n\n", "comment_152": "\nObviously people have a good understanding of this song.  I'm sure some have mentioned this is influenced by Carl Jung, as was 46&2.  But one thing everyone seems to not understand is eleven.  It's true he is using 11 to signify that something happened to him as a child, but he's not referring to himself as 11.  He's using 11 to signify the the child and the adult connecting again.  \"so 1 and 1 are one, 11.\" Combining the 1 and 1 together, so they can both move on, you get 11.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nHas anyone here posted the fact that eleven is three in binary? The main piece that caught my attention in this song was:\n\r\n'till one and one are one, eleven,\n\r\nIn combination with the story in the song this may represent the simultaneous presence of your past and future to your present life. Surely you can see how this proposition is involved with numerous songs/philosophies/religions/etc.\n\n\n\n", "comment_154": "\ninbreeds indeed, maynard has a thing for his cousin or sister or a close relative, thats what all his songs are about. you are only listening to the audible parts of the song, you cant or have not felt it. true all the clues are all to draw you away from what he feels to be a shame he cant sing about but needs to let his emptions out. every song is about incest, or what feels is incest due to his religious upbringing that he hates. at a young age this love starts with a relative due to reasons of what he feels is neglect and dispair. he confuses roles and so on. the exact age does not matter since he mentions 11 its to throw anyone off. a clever mince of words always makes him vulnerable to discovery of his true feelings, he would not write of people he avoided!\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nThis song is about losing your free will as the result of black magic.\r\nApparently Earth is a rehabilitation center for fallen angels.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nSome almost have it right, I think.  Maynard's mother, Judith had suffered a cerebral aneurysm which left her paralyzed.  Maynard talks about it in the documentary, \"Blood into Wine.\" \t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nSo, I was listening to this one night and I could've sworn after maynard says \"Drawing me down and in\" there's a faint \"Yes!\" in the background. Maynard will steal your soul! Ahhhhhhhhhhhhhhhh. \t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\n11 definitely is referring to one of the time signatures in the song - 11/8. i'm not sure what other back meanings it may have, knowing Maynard there are more meanings behind it. at one point, he says \"11\" right before they play the 11/8 riff.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nI can't speak for Maynard, but to me this song seemed to represent overcoming the fear of death.  Two parts of himself coming back together, the light of acceptance, and going back to a mind unafraid of dieing.  Just my two.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nI agree with Baker, but more specifically I think the song also hints around him hitting puberty/getting his first erection. Listen to the lyrics with this in mind and it makes a lot of sense!\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\n\"When Keenan was 11, his mother suffered a paralyzing cerebral aneurysm, which would later serve as the inspiration for many of his creative works.\" He was born in Ohio. jimmy is just kiddy James (his birth name.  \r\nOne and one are one? One present, One past, are one/together/11. He's simply making peace with a loss and the past that has shaped him and presented him with many of his personal troubles that were absent before he cognitively lost his mother. \n\r\n- The more thought and research you put into it, the more meaning and fulfillment you'll get out of it. Of course, if the song means more to you when interpreted in a different light then stick with it. Whatever works!\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nWhen Maynard was eleven, his mom had an Aneurysm that confined her to a wheelchair for the rest of her life. After this, he moved in with his father in Michigan.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nsounds like using drugs man and coming to a spiritual awakening .no pain no cares than coming back clean an realizing  it all\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nBROTHERS! SISTERS! Boys and girls and dabblers of all ages!\n\nYou are all right, and yet at the same time you are all wrong my friends.\n\nMaynard's lyrics, much like life itself, carry a duality. \n\nThere's your opinion, and then there's his opinion.\n\nBUT that's not even the end of it. guess what else there is? The connections between those opinions intertwining.  \n\nOver the years, Maynard has expressed coming back to his songs he written all those years ago, and seen them in new light.\n\nThis is due to the reception the external to himself, has given him.\n\nMaynard has a fundamental understanding of the universe itself: EVERYTHING IS PERCEPTION.Everything is ever changing and nothing stays what it is. \n\n\nThis song changes. His view on the song changes. your view on the song changes.\n\nSo IF you want to take anything out of this TOOL you have been given ladies and gentlemen, take this:\nWhatever you perceive from this, at least understand it is whatever you perceive it to be, as long as you are true to your higher self.\n\n..... and i'm not bloody well getting into that on a public forum\n\n.....I will however tell you how Maynard has gotten there to some extent.\n\nWe are dealing with someone who has based his life dealing mainly in one fundamental form of energy for quite some time: Sound.\nIf we are to take the notion of sound from a number of different ideologies tool have incorporated into their music over the years, we come to understand this chap has been focussing on a certain 'branch' of the tree of life, if you will, or to put it in Hindu terms (usually the easiest to digest) the sound chakra, or the 5th chakra:\n\n\"Chakra five (throat chakra) is the doorway to consciousness and the energy center of sound, rhythm, vibration, and communication.  The meaning of its Sanskrit name is â\u0080\u009cpurificationâ\u0080\u009d. \nThis is the chakra that is the energy center that is connected to communication through sound, vibration, creativity, and self expression.  \n\nThe fifth chakra is responsible for the \ntranslation of symbols and other forms into coherent information and it is also our centre of creativity. \"\n\nHis purification was to get the bullshit on pen and paper, yell it out, then be done with it.\n\nIf i had to guess, he's easily past the 6th chakra and is most likely at 7th.\n\nBut once again brothers and sisters, Tis merely a humble souls perception ;)\n\nPeace and blessed be.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nmy bro. Jimmy\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nOne time at a concert Maynard stated that jimmy is a sequel to prison sex. I think when you take this along with what others said about the song being about reconnecting with your inner child this song makes more sense. I read through the lyrics with the thought of a therapy session in mind. Maybe he did EMDR therapy or hypnosis idk and discovered something tragic in his past  \"but it took so long to remember just what happened\" prison sex. Then after the discovery began the healing process of rekindling his relationship with his 11 year old self who was \"defending his own light and wondering where the hell have I been?\" Sleeping, lost and numb. Fucking brilliant \t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nYeah Jimmy is very clearly about Maynard and the relationship with his mother. Basically he's singing to the inner 11 year old version of himself. Due to the stroke his mother, Judith, had when he was 11, the impact was so profound that a part of him was left there. \n\nMaynard left to live with his father at that time. Its clear he loved his mother but did not follow the same beliefs in fact a part of himself resented her for her religious believes this is very clear in APC's \"Judith\".\n\n\"Jimmy\" is about him coming to his own resolution and facing what he left behind. \n\nWings For Marie 1 & 2 are his eulogy to his mother and his acceptance.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nAlso worth noting Maynard said this song is \"kind of a sequel to Prison Sex\" \n1996-10-21 San Francisco\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nThis song is about moving on ... to find the source of the negative patterns we create in our lives that repeat themselves over and over again, which often begin in childhood. It's about revisiting your child self where this pattern began, understanding the reason why we have this problem, and then moving past it.\n\nI believe that \"Jimmy\" is referring to his child self, and eleven years old is when some negative pattern in his life started. He is revisiting it in an attempt to move on. I realized this as I was doing this in my own life, and this song randomly came into my head.\n\nFeel free to disagree, everyone has the right to their own opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nJimmy refers to one of the 12 disciples of Jesus, St. James, patron saint of healing and comfort. After Judas was cast out there were 11 disciples left. Judas could only be freed upon the return of God. \"11 has been waiting defending his light and wondering where the hell i have been.\" His light is the heavenly light of the Lord. The song refers to an ancient soul, I wouldn't say my mother was ancient if she passed when I was 11. This song most likely had a double meaning of his mothers passing and biblical references. Knowing Maynard it has multiple derivatives. Tool, a perfect circle and pucicer all reference Christianity and Catholicism over and over. Dig a little deeper into your souls folks and stop doing so much math, Maynard wasn't about factual mathmatics as much as spirituality and emotion. Yes, his name is James but it's just not that simple everyone. It's Maynard and Tool for God's sake.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nMaynard may be speaking from his father's point of view. Another theory that I think fits. \t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nLyrics correction:\n\ncorrect: You are the voice that's been calling me back home\n\ninstead of: You hold the light that's been leading me back home\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nI think this song is about meeting his twin flame and/or feeling them, they separate (runner/chaser) dynamic, and then 11:11 = he becomes more self-reflective and addresses what needs to be looked at in himself and what needs healing.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nThis song represents for me the process of trauma confrontation and reunification/healing. For me it has been a powerful Tool (pun intended i guess) and a real gift.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nno offence Kenshin, but i hate it when people just write shit like \"i love this song\" that's not something we want to hear, no offence but i don't give a shit what song you like. the site is called SongMeanings, not WhatSongsILike :drool:\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nWait...let me check...yup, yup, it's confirmed.  Random insults RULE, so piss of poopy dick.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nI know what it's about...it's about that time i had diarrhea and how it shot out of the window onto some guy.  My pants are orange.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nI \t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nRead everything written by Aleister Crowley and you will know where the meanings to 80% of tool songs come from, if you understand that much you will know their meaning - it's black magick.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nAlso, \"ELEVEN I HAVE FOUND YOU\":\r\nEver since getting his ass kicked during the battle in Heaven, Lucifer has been looking for a way to get revenge on Michael. He is constantly looking for him. Both of them have the ability to bend light and reality itself through the manipulation of relativity - which makes it difficult for them to locate each other.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nwell, this song is a clear reference to numerology (in which practice Danny is a Master) all Tool's artwork is based on numerology, for instance, the fibonacci sequence of Lateralus album, all the drum patterns are specifically dedicated to numerology formulas.\r\nHowever JIMMY is a song that is consagreted ti the idea of HUMAN SACRIFICE, as a ritual in order to fulfill certain agenda of superior etities or spirits. Likewise, Jacques LAcan stablised that the mirrow stage is the moment in which the child recognize itself before the mirror for the very first time: \"What was it like to see/The face of your own stability\". Now, since 11 is a number of power, control, and simultanueslly sacrifice and disposition, the song is equilibritad amog both emotive-psicological phases: \"Defending his light,/And wondering.../Where the hell have I been?/Sleeping, lost, and numb\"\r\nTherefore, the end of the first verse of the song is: \"Suddenly look away/Leaving you with the dead and hopeless?\" Well all this means that a sacrifice is allways a painfull and at the time a releasing ritual...\n\n\n\n\n\n", "comment_182": "\nSorry but all of you are wrong. Tool is all about the Flower of Life. Learn as much as you can about it and you will understand all of Tool's songs. This song is about his soul finally meeting his body. When he sais \"where the hell have I been? sleeping lost and numb\" he is talking about how he has been separated from his soul for thousands of years now and he has finally found himself. Our souls are given many lives yet we fail to make our way to \"heaven\". Now he is finally wide awake and heading home.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\n11 is Da'at. Lazarus is the partzuf of Da'at. \r\nFind out who Lazarus really is and you will understand much...\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nThis song is actually about the death of maynards mother when he was eleven. The song is describing the state he was in. It describes how he was lost in her death. He has made songs that talk about her religious beliefs and how he resents them, but this song is talking about how his experience as an eleven year old guides him through life to make him a stronger person pretty apparent at these lyrics.\n\r\n\"Hold you light, eleven lead me through each gentle step by step, by inch by loaded memory, I'll move to heal As soon as pain allows so we can Reunite and both move on together\"\n\r\nHe describes how hard it was to handle this as an eleven year old and he comes to terms with the fact and finds a deeper meaning to death.\n\n\n\n", "comment_185": "\n11 is when James mother became paralyzied. 11 is the age he last saw his mom ya know? Deep shit. I'm sorry for the kid\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nI am pretty sure that it is about this kid that shot himself in front of a class room:\r\nEleven is when we waved good-bye\r\nEleven is standing still,\r\nWaiting for me to free him\r\nBy coming home\n\r\nlike eleven- the time\r\nwaved good-bye. free him, home- the kids are saying bye and home, as in heaven.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nWow some of you are stupid. Jame's mother did not die when he was 11, its not about numerology, human sacrifice??? THIS SONG IS NOT EVEN ON LATERALUS, IT IS ON AENEMA. It has nothing to do with sequences in drum beats or guitar notes. His mother became paralyzed when he was 11 years old. I'm also assuming he was called Jimmy by his mother perhaps. He then had to go live with his dad. When he was old enough he went home to see his mother. (This could be after Tool was formed, I don't know). He is reflecting on how this turmoil has changed him and made him into the person he is today. Thank you. It's Tool....enough said.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nI am appalled at most of the people in these comments. Over HALF of you guys posted your thoughts about what it's about the same year and YEARS AFTER 10,000 days was released. To you guys that claimed that Jimmy is about his mom dying at 11 is retarded. Wings for Marie is the song he wrote about his mom passing in 10kdays. 10,000 days is 27~ years - the idea behind that song is that she suffered for 27 years with paralysis. Which makes Maynard 38(27+11) at the time she died. He is 47 right now as I type this. So she died around 9 years ago. 10kd was released in April 2006... 3 years after she passed and 5 years after Lateralus.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nfuck shit fuck u all ur gay....yea well parabola....u math beast.....i would like to know what the fuck ur talkin about u dumbass fuck\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nIts about September 11th you dumb fucks!!! \"under a dead Ohio sky\"...HELLO!!!!  Ohio is the polar oposite of New York,... Dumb ass's!!! Maynard is a prophet, DUMB SONS OF BITCHES!,He put it in code so that people in N.Y. wouldnt freak out...HELLO!!!!!! Could you be any stupider?!?!?!? He knew that they had to die...so he put it in code! (jack ass's!) Not even the rest of tool knew about it!!(dumb shits!!!(ASS HOLES)!!!)!!! I have a very educated (unlike you sick shits!!)source...thaT I CAN'T TELL YOU ABOUT!!!!\n\n\r\n                                 Hugs and Kisses\r\n                                                   REDRUM158\n\r\n                                      P.S. YOU ARE ALL INBREAD\t\t\t\t\n\t\t\t\t\n\n"}