{"comment_0": "\nThe protagonist was a client of Bee, a prostitute, who had a room down on Jubilee Street. When Bee was closed down the Russians moved in their sex workers. The Russians made the scene more intimidating'; their presence pricked the allusion of romance and love that the protagonist had felt for Bee.\n\nAs Bee had been shut down, she could no longer make money as a sex worker, She had to make ends meet some way or other. She blackmailed him, as his name was on every page of her little black book. \n\nHe was besotted by her and also hated her, which is why there is the conflicting imagery of him pushing a wheel of love but also having a a 10 ton catastrophe on a 60 pound chain. This threatening image is of his male sexuality perverted by rage and fear from the blackmail and the chance of being publicly exposed. \n\nDown on Jubilee Street he went into a dis-associative state - our of his mind - and did something which is against what he preached. He was not personally troubled by having had sex with Bee in the past, he did so willingly. However he was against violence but this time he did not practice what he preached - he harmed or probably murdered Bee. \n\nAfter he had harmed or killed Bee, his reputation was no longer threatened and he still had his status - he could wear his tie and tails about town as though he were a respected man. Gone was the 10 ton catastrophe on a chain replaced by a foetus on a leash: potent male rage now calmed, impotent and under control. \n\nThe last stanza is the freedom of one who had been trapped and feared public exposure but no longer does. All that threatened and allured has gone - Bee and the furniture in the room - and he is liberated from his sexual needs and the fear of blackmail. \n\nThe song has a brutal individualism to it. Unlike Raskolnikov in Crime and Punishment who was compelled to guilt plead guilty by the fact he had murdered, the killer in this song is redeemed by his act without any other obvious consequence other than preservation of himself. The values he held have been dispensed with in the need to protect and preserve the individual.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAfter watching the video, I feel like this comes a little clearer. There are 2 layers in the storyline I think, one from the point of view of a young prostitute, Bee, while the other one belongs to the man that got her pregnant (foetus on a leash, where leash is simply the umbilical cord?) For some reasons Bee has to leave the apartment in Jubilee Street where she received their clients (probably she's turned down by them because they discover the pregnancy -- or maybe caught and arrested) and so the man, who somehow was obsessed with her \"is too scared to even walk on past\" (maybe eaten by guilt and memories and all of that).\n\nI think this could be all wrong, but the song to me is more generally about how people focus on a fake appearance of morality and decour, but then deep inside they all know they are fucked up and desperate and, ultimately, need love, no matter how \"dirty\" and immoral it is. The contrast here is beautiful, Jubilee Street is a symbol for this formal morality, this masquerade of social order, somehow connected with the figure of the Queen (the ultimate thing is that Bee could be a nickname for girl called Elizabeth) and all that she represents. But on Jubilee street there's darkness too, there are prostitutes and stories going horribly wrong. Guys, this is still Nick Cave after all.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nTo me Jubilee Street represents the people of church and the main character the pastor or the priest.\nHe's got love in his tummy, didn't mean no harm, the ten-ton catastrophe is in his soul.\nMaybe her abortion was his, d'nt matter, morals d'nt matter, he got busted and ruined his reputation, now he's the one that has no past, should have practised what he preached... or should he? \nNow that he is really alone, now that he has no furniture, only now beyond recriminations, he can go dowtown on his tie and tail, look at him! He glows, vibrates, he's flying. \nOnly one larvae suffering it all through becomes a butterflies. Her peers only survive until death without transformation.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI was driving through Whitechapel the other day and turned into a road called \"Jubilee Street\". My partner raised the possibility that the song could actually be a reference to this street, as it's in the area where Jack the Ripper murdered prostitutes. \n\nI did a brief Google search and found references to the history of the street, including a period where the \"Russians moved in\". Also, if you search for this street and Jack the Ripper, there are some links, especially to a suspect who attended the Jubilee Street Anarchist Club.\n\nThis theory fits with the \"Tie and tails\" vision, and Nick Cave has written about Jack the Ripper before, so is this a re-imagination? I can't find any other clues that it is, but thought I'd share what I have.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI don't know how many pop musicians can write a beautiful, interesting and intelligent song on a public library. Nick Cave was able to do that, in a very amazing way. This song is about Bee, that is an old brownfield site in Brighton UK, which was regenerated through a private finance initiative of Â£50 million, in order to obtain a fantastic public library. Notoriously, in Brighton there's a relevant Russian community, and many natives know Russian language. Nick Cave visited the library, and has become enthusiast about it. However, he was a little bit sorry, because at the library - baby boogie - all of his songs were on the little \nblack book (black list), therefore it was not possible for babies to listen to them. From my point of view (disco DJ), the song is precious, because it goes from 76,5 to 94 BPM. In conclusion, I hope it will enter into baby boogie service, also in memory of Nick's dead son.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nWell, it's still a Cave song, and I suppose no matter how old he gets, his songs will always be about the murder of beautiful young girls.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nLove it!  This song lyric are so beautifully written and know wants to listen its melody also. \namazon.com/Guardians-Galaxy-Peter-Trench-Leather/dp/B01J4TS5WM/\">Guardians of the galaxy leather trench coat\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI interpret this song as being about hypocrisy.  Not practicing what you preach.  Protagonist  is attempting to maintain the appearance of respectability (tie and tails) even while the is loathing himself for being involved with prostitution (10 ton catastrophe and 60 lb chain being the weight of his guilt).  \nBut at some point he gives in to his temptations, he's alone and beyond recrimination (he's past the point of caring about what others think).\ncurtains are shut and furniture is gone - feels protected and his only focus is the sexual act he's involved in\nThe rest of the song seems to be orgasmic in nature - transforming, vibrating, glowing, flying\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think this song is about a guy who kills a woman named Bee who is expecting and keeps the fetus and umbilical cord as trophies. He also likes to take a lot of drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nAbsolutely NO clue what this song means. Too bad Nick didn't use his own beautiful voice; I'm confident he could have explained it better\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI'm not getting the idea he murdered her. I am more inclined to believe he got her pregnant and then she had an abortion. \n\r\nOTOH maybe she had him banged to rights and named him as the father and he took the child and brought it up? There is a suggestion of him with a baby later in the song \"pushing my little wheel of love\" .\n\r\nAgain maybe he made her abort the baby and the \"foetus on a leash\" reference might be suggestive of an abortion. \n\r\nAlternatively, could it be that he is now with a child he has subsequently fathered but remembering his past experience of impregnating this woman which ended badly and where he did not \"practice what he preached\" by having the pregnancy terminated? Nick is a man of religious convictions so an abortion would be difficult for him to countenance perhaps.\n\r\nWhatever, I don't see any reason to assume he murdered the prostitute.\n\r\nAnyway it's just my idea and it could all be nonsense. One of the great things about Nick's songs are their ambiguity\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nNothing to do with Whitechapel I'm afraid. Jubilee Street is in Brighton, where Nick lives. He actually thought Jubilee Street was a nearby Brighton street and wrote it about the wrong street he says. This comes from a recent interview with him. If you can be bothered you can google it.\t\t\t\t\n\t\t\t\t\n\n"}