{"comment_0": "\nThis song seems pretty self explanatory, or at least this is my impression the chorus says it all\n\r\n\"Just a kiss on your lips in the moonlight\r\nJust a touch of the fire burning so bright\r\nI don't want to mess this thing up\r\nI don't want to push too far\r\nJust a shot in the dark that you just might be the one I've been waiting for my whole life\r\nSo baby, I'm alright with just a kiss goodnight\"\n\r\nHe/she is saying that they are content with how things are going and that they are fine with just a kiss good night because they dont want to move to fast or push to hard and drive the other person away and possibly mess things up. They love each other and believe that the other person could be their future husband/wife soul mate type of deal.\n\r\nOn a personal level this song definitely what im going through with a really good friend. She is my world and i absolutely love her to death and these lyrics fit perfectly to describe the situation. \r\nSo that's my opinion  \n\n\n", "comment_1": "\nArgh, so madly in love with this song! Can't stop listening to it, really beautiful.  I don't know what it is about it but it has this way of making me feel full and contented inside, really resonates with me somehow, the combination of instruments and their amazing voices.\r\nCan't wait for their new album! My most anticipated album of the year so far :D\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nGreat song. It really reminded me of why I fell in love with country music in the first place. Even if you do not fully understand what the lyrics mean on brilliant songs like these, you just know that they're perfect for when you're tryna express how you feel, but just can't put it into words, but you know the song more than takes care of it for you.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni dont no what should i say i just can say this song is really brilliant\r\ni love this song so much and i cant stop listening to it\r\nwhen i listen to this song i feel  really calm\r\nits a soft music that makes you wanna think about it.it makes you wanna think about what you did with your love or what are doing with her or him\r\nand when you listen to this song you wanna stay with him or her 4 ever\r\ni dont want to mess this thing up\r\ni dont want to push too far\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthe first coures its NO i don't wanna mess this thing up****\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI agree that this songs meaning comes out in the lyrics no real interpretation but how you relate is where the difference lays. \r\nI think of back to how my fiance and I started dating and all the memories of the past 4 years comes back as I listen to this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni love this song it reminds me of the love i let go of being stupid but your still in my dreams!!! =]\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nDiffinatly a memory for me.\r\nIt was playing at my friends when i hocked up with a random guy that I ended up falling in love. It only took a shot in the dark to find the one.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song defiantly means to take things slow. If you take things too fast it may end up you losing the one you love. It says in almost the entire thing that you should go slow.\n\"We don't need to rush this,Let's just take it slow\" just basically says what this song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI feel bad each time i listen to this song...because i used to listen to this song by the memories of the love of my love about a year ago...but he left me alone...though i still listen to this song and have the same feelings for him...;-(\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nA very sweet song about two people being patient with their relationship, so they can seal\nThe deal without rushing into too much intimacy.  I feel they are tremendously committed!! \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nItsss sooo romantic.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song relates back to when my boyfriend and I first started dating.. everything started off with a kiss in his car at night. Feelings for each other grew stronger but we were starting off slow. So a small kiss was enough for the both of us back then. Every time I got out of his car I didn't want to say good night yet. But we gave it some time and now we are tight as ever (':\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis is such a great song! I think it is about falling in love with someone and within the midst of passion, realize that surrendering to the physical aspects of love must first be because they already have emotionally/spiritually. There are also elements of \"no sex before marriage\" and is such a great message because that concept is nearly gone in modern society. Ultimately, this is more of an indication of not giving in to the heat of the moment when you are not certain that you or the other is completely inlove. A goodnight kiss is enough. Such a sweet song!\t\t\t\t\n\t\t\t\t\n\n"}