{"comment_0": "\nWhat a terrific song, written by Eddie Rabbit. This song was one of Elvis' last hits (along with In the Ghetto, Suspicious Minds and Burning Love) - it is not an easy song at all to sing, and Elvis just does a phenomenal job with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nthis is my favorite Presley song, it is so good.  Meaning is pretty much self explanatory\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nwith the rain in my shoes.... searching for you, in that old kentucky rain!!\r\ni really like this song... its unique, its elvis.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWhat I lie about this ong is the imagery it provokes, I always see a story board in my head when listening ot this song.  I can see the grey bearded men sitting on the stoop.\n\r\nBut this guy obviouly lovesd this woman to go trudging through the cold Kentucky rain. Is it his wife?  Girlfirend? Or maybe a runaway?\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song doesn't get the respect it deserves. uh huh\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nephilbrook, i can see what your seeing! haha.  This so was made vor elvis' voice..\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nthis is THE utmost best song in the world...I LOVE IT....its so powerful and i agree ephilbrook too....the imagery is amazing...i see the song everytime i hear it...(if that makes sence lol!)\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nElvis never wrote music, and his real strength is his\nuncanny ability to interpret other composers' songs - \nhe could make anything sound good; sort of like a\nchef who can make bean soup exciting -\nthis is my favorite tune of his although I'm not as\nbig a fan of his as are my aunts/uncles -\n\nalso, I tend to like good bean soup\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think you have to break Elvis's work into two Eras, Pre - 1968 and post 1968. Elvis evokes such imagery of the entire song's story from the weather to the old man , the preacher, and the tows. The music is almost sub lineal and simple but it plays a powerful feeling in the song. Talk about the greatest comeback in music, from Jail house Rock to Kentucky Rain wow! Believe it or not Number 2 form and  for personal reasons is If I Can Dream.  Thanks Elvis we miss yo but to paraphrase one of your lyrics \"You are always on our minds.\"\t\t\t\t\n\t\t\t\t\n\n"}