{"comment_0": "\nThe last lines in the song fit beautifully...\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI love this song! It fits me perfectly, because i did give up on love because it did give up on me!!!\r\n                           *~*Laura*~*\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI LOVE THIS SONG!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIt's just a nice song too hear.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis is such a good song. I hated her first single, Bring Me Down, and Me and Charlie Talking was okay, but this is a really good song and she has such a pretty voice.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nthis song is the country version of \"You Oughta Know\" :-P\n\r\nIt's pretty obvious what it's about: the guy cheated on her then proceeded to leave her for this new fling. When this happens to someone, it makes you not want to be in a relationship\n\r\nDoes it mean something that my ex chose this song to be his designated ringtone on my phone...and then he did EVERYTHING the guy in the song did?\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis is the BEST SONG EVER!!!!!!!!!!!!!!!!!!!!!!!!!\n\r\nI love the part were she says \"I don't hate the one who left you can't hate someone's that dead!\"  X]\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis is a great song.  I love the beat to it too.  I just makes you want to tap your feet or get up and dance.  I agree, I love the line \"I don't hate the one who left, you can't hate someone who's dead.\"  So true....\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nawesome song :) everytime i hear it i have to turn it real loud.\n\r\nobviously the meaning is about her exboyfriend and he cheated on her and well, she's just getting her revenge.\n\r\ni'm givin' up on love, cuz love's givin' up on me!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI love this song. Everytime I hear it, I turn it up and sing along. My favorite part is \"Forget you high society, Iâ\u0080\u0099m soakinâ\u0080\u0099 it in Kereosne Light â\u0080\u0098em up and watch them burn, teach them what they need to learn HA! Dirty hands aint made for shakinâ\u0080\u0099, aint a rule that aint worth breakinâ\u0080\u0099 Well Iâ\u0080\u0099m giving up on love cause loveâ\u0080\u0099s given up on me\" So powerful.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\n\"Now I donâ\u0080\u0099t hate the one who left You\r\nHeâ\u0080\u0099s out there holding on to someone, Iâ\u0080\u0099m holding up my smoking gun\"\n\r\nI believe its supposed to be Now I dont hate the one who left you cant hate someone whos dead\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nSign if you want real country back: petitionspot.com/petitions/fixcountrymusic/\n\n\n", "comment_12": "\nThis song is about suicide. I translated the whole song as I understand it.\n\r\nShe's been up all night.\r\nShe lost a big part of her life and she doesn't know what to do with herself now.\r\nHe chased after her but she didn't care what he had to say.\r\nShe's giving up...\n\r\nShe put everything she had into their relationship.\r\nShe doesn't want to continue life now that he cheated on her and they're through.\r\nCheating is unforgivable.\r\nShe's giving up...\n\r\nShe doesn't want to be civilized about it.\r\nShe's going to call them out publicly to all of their friends for what they did.\r\nShe doesn't respect them so she wont be doing anything that helps them.\r\nShe's giving up...\n\r\nShe's happy with her decision\r\nIt doesn't matter to her what anyone else thinks because she will be dead.\r\nThey'll still be together when she will be t her life with a gun.\r\nShe's going to kill herself on their wedding day, laying blame refers to the suicide note she will leave.\r\nShe's giving up...\t\t\t\t\n\t\t\t\t\n\n"}