{"comment_0": "\nCountry music may have a reputation as a dumbed-down brand of music meant for backwoods rural folk, but according to a new study released this week the genre actually boasts the smartest lyrics of any major American genre over the past 10 years. According to the analysis, country had a â\u0080\u009creadability scoreâ\u0080\u009d well above pop, rock, R&B and hip-hop, though that wasnâ\u0080\u0099t saying much. Countryâ\u0080\u0099s average reading level came in at just above third grade.Kick the Dust Up is representative of a systemic issue plaguing country music, which is that so many of the biggest singles are written by the same handful of writers. Why are there so many party songs that sound just like Thatâ\u0080\u0099s My Kind of Night and Kick the Dust Up? Because half of them are written by Dallas Davidson and Co! The number of hitmakers has shrunken into a tiny, label-approved pool. According to a report by the Tennesseean earlier this year, Nashville has lost a whopping 80% of its songwriters since 2000, and that lack of variety is (unsurprisingly) leading to a lack of lyrical variety as well.\n\nCountry may be the most intelligent genre for now, but with songs like Kick the Dust Up permeating airwaves, itâ\u0080\u0099s looking dumber and dumber by the moment\n\n\n\n\nCountry had a leg-up on rival genres thanks to longer words like â\u0080\u009ctackleboxâ\u0080\u009d and â\u0080\u009cLouisiana\"\n\nThe study didnâ\u0080\u0099t take into account metaphors, tone or potentially playful lyricism, and instead based its findings on word count, word length and the number of syllables contained in each word. Country had a leg-up on rival genres thanks to longer words like â\u0080\u009ctackleboxâ\u0080\u009d and â\u0080\u009cLouisianaâ\u0080\u009d, according to author Andrew Powell-Morse, though he also argued that countryâ\u0080\u0099s intelligence was in decline over the past 10 years. Among the genreâ\u0080\u0099s biggest stars, Carrie Underwoodâ\u0080\u0099s lyrics were deemed the smartest at a grade level of 3.72 and Florida Georgia Lineâ\u0080\u0099s deemed the dumbest, with just a 2.93 reading level. As it turns out, lines like â\u0080\u009cThis is how we roll/We rollinâ\u0080\u0099 into townâ\u0080\u009d arenâ\u0080\u0099t considered especially smart.\n\nThe studyâ\u0080\u0099s conclusion that country lyrics are getting dumber is well-timed given the release of Luke Bryanâ\u0080\u0099s thuddingly dim new single Kick the Dust Up, which will undoubtedly become the A-listerâ\u0080\u0099s latest No 1 track. (They all do. He has been the genreâ\u0080\u0099s biggest star for two years running.) It is almost a carbon-copy of Bryanâ\u0080\u0099s divisive Thatâ\u0080\u0099s My Kind of Night, which Zac Brown unceremoniously called â\u0080\u009cthe worst song Iâ\u0080\u0099ve ever heardâ\u0080\u009d in a radio interview, claiming that songs like it made him â\u0080\u009cashamed to be even in the same formatâ\u0080\u009d.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nA pretty vapid song that wants to be country but can't shake its pop sensibilities.\t\t\t\t\n\t\t\t\t\n\n"}