{"comment_0": "\nThis is about a high class call girl, or whore, or prostitute, whatever you wanna call it, that is what it is...\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI hate to be the one to point out the obvious, but Gunpowder, Gelatin & Dynamite are 3 basic explosives. They are all volatile, dangerous. Exciting! Throw in the Lazer Beam for a good rhyme and more raw energy.\n\r\nFreddy did confess on several occassions that this song was just about a high society call girl. In particular, I agree with psa09140: Freddy had Christine Keeler in mind when he wrote the song. But, most people on this list are WAY too young to know who she is.\n\r\nAlso: wazojugs -- Margaret Thatcher was not PM when the song was written in 1974. Learn something about history.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song has absolutely nothing to do with homosexuality.  \n\r\nFreddy Mercury said:\n\r\n\"It's about a high class call girl. I'm trying to say\r\nthat classy people can be whores as well. That's what\r\nthe song is about, though I'd prefer people to put\r\ntheir own interpretation upon it - to read what they like into it.\"\n\r\nHe did say that it is open to interpretation.  I would take it a step further and say that it is about a female assassin / secret agent who poses as a high-class prostitute.\n\r\nThroughout the song it refers to the technology she uses as a secret agent / assassin:\n\n\r\nGunpowder\r\nDynamite\r\nLaser Beam\r\n(not sure about the reference to gelatine)\n\r\nOther references to her secret agent / assassin:\n\r\n-Of course, the most obvious, she's a \"Killer Queen\"\r\n-Khrushchev and Kennedy- they were key figures during the cold war....it implies that she spies for one or the other or both\r\n-met a man from China, possibly a target of hers\r\n-never kept the same address (covert)\r\n-Fastidious and precise\n\r\nThen of course all of the references to her \"cover\" as a prostitute and how well she played the part:\n\r\n-champagne, caviar, perfume, etc.\r\n-well versed in etiquette\r\n-blow your mind (double meaning- sex and also assassin)\r\n-recommended at the price (this could also be a reference to her work as an assassin or prostitute)\r\n-reference to Marie Antoinette, the queen of France\r\n-Geisha (not sure about Minah...it is a legend of the Sisters' Islands...off the islands of Singapore....maybe a place she had to go for her secret agent work)\r\n-spoke like a baroness\r\n-Insatiable an appetite\n\r\nApparently she is out the business for a spell:\r\n\"Then momentarily out of action\r\nTemporarily out of gas\"\n\r\nAn awful lot of information in a song of 3 minutes 1 second!!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni love this song =]\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI hate to be a b*tch, but every line gives its own answer...many of your comments refer to historical inaccuracies due to timelines...here we go...\n\r\nEverything up through the first chorus is referring in general to the well-groomed \"Will and Grace\" & \"Queer Eye for the Straight Guy\" gay man.  \n\r\nThe Kruschev and Kennedy line is basically referring to \"if they'd just get it over with and make it then everything would be fine.\"\n\r\nDynamite with a laser beam.  Are you freaking kidding me?  Are there no gay men on this site?  Laser beam is weenie!\n\r\nGunpowder/gelatin think people think...what shoots out of a \"laserbeam\" and is a sticky gelatin substance?\n\r\nGuaranteed to BLOW your mind! Do you really not get this yet?\n\r\nInsatiable an appetite...a common stereotype for gay men.\n\r\nTo avoid complications, she never kept the same address.  Yes, yes, yes! You got it, a high class TRANNY, well paid at that.\n\r\nThe Geisha line refers to the most famous of all transvestites, Madame Butterfly!  I can't believe no one got that one\n\r\nIf you are that way inclined...again, how literal does Freddy have to be for you guys to get it.\n\r\nMomentarily out of action...a female prostitute could go all night, but a male would need a short period for recovery, ya know.\n\r\nIf you think playful as a pussycat refers to a woman, think again.  It refers to a man who is as COY as a woman.\n\r\nSome people think the last lines are \"wanna try..wanna try\" they are actually \"What a Drag\"\n\r\nThat says it all... now, if you want to take an introductory poetry class, let me know.  The first thing you'd learn is that metaphors are not mixed.  A message in a poem is generally consistent.  Freddy Mercury is one of the greatest poets in music.  I doubt he'd mix his metaphors.\n\r\nSorry again to be so bitchy.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nPeople are used to hard rock, energy music from Queen, yet with this single you almost expect Noel Coward to sing it. It's one of those bowler hat, black suspender belt numbers â\u0080\u0094 not that Coward would wear that. (...) It's about a high class call girl. I'm trying to say that classy people can be whores as well. That's what the song is about, though I'd prefer people to put their interpretation upon it â\u0080\u0094 to read into it what they like. -Freddie Mercury\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nImages of Joan Collins flash tomy mind when I hear this... And the \"dynamite with a laser beam\"-bit, I believe that it's just a description of some sort.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song has the greatest guiter solo on earth in it\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nwell, I just remember what the Freddie Mercury impersonist said at a Queen tribute band concert said - \"a song full of creatures of the night and wickedness\"\n\r\nwell, it was probably nothing like that, but whatever he said, it was cool!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI always though the following lines:\n\r\n\"Perfume came naturally from Paris\r\nFor cars she couldn't care less\"\n\r\nWere actually:\n\r\n\"But she came naturally from Paris\"\r\n\"For that she couldn't care less\"\n\r\nBut I guess the posted lyrics make more sense.  There are a lot of big words in this song that are hard to pick out in casual listening.  Great imagery though.  Yeah, I wanna try.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI love this song. The way he sings it it so appealing, especially, for some reason (for me at least), \"Caviar and Ciggarettes\". I think it may be about a hooker, but I'm not so sure, because...uhm, it's QUEEN...if you get my reference. But then again...eh, never mind. Kick ass song. My favorite by Queen.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nAWESOME SONG.\r\ndefinately about a high classed prostitute. a transexual I think \"Then again incidentally, if you're that way inclined\"\r\nin the 70's \"that way inclined\" ment gay. Still does except for the uber politically correct. \r\nHave you ever seen the SNL skit with Christopher Walkin and the short brown haired guy dressed as a transexual stripper named \"MANGO\"\r\nyeah.. this song to me is about a MANGO like person. Someone said it might be about a friend he had for a long time that lived with him and served him tea? all the way till he died? If i was rich and gay and famous i would have someone like MANGO serve me tea.. come to think of it, I might even if I wasn't gay. \r\nincidentally, I just got a cat this weekend.. I think I'll name it Mango...\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nA legendary song that got me hooked on Queen so many years ago. I heard this song and was like this is the most unique music I ever heard. It still sounds great today. Remarkable lyrics that keep you guessing. I will still listen to Queen when I am old and gray. I love them.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nR.I.P Freddy Mercury...\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nAnd the thing is, she's a clever one, too, because she disguises it with her high class and tries to seduce people with charm and wealth.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nIn the words of the lead singer, Freddie Mercury, \"It's about a high class call girl. I'm trying to say that classy people can be whores as well. That's what the song is about, though I'd prefer people to put their interpretation upon it â\u0080\u0094 to read into it what they like.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nOk so I've just read almost all of the comments and I had to stop and put my to since in it. Believe it or not Freddie had written this song about his first boyfriend. From a you tube video of  â\u0080\u009cFreddie Mercury The Untold Storyâ\u0080\u009d they talk about how his first boyfriend kept Moet et Chandon which is wine from France, and he kept it in a cabinet that Freddie defined as pretty. The part where he says about Marie Antoinette,(who was the Queen of France in the late 1700â\u0080\u0099s) defined his hair stile the same as hers. Through out the song Freddie is telling how great this guy is. When he says â\u0080\u009cSheâ\u0080\u0098s a killer Queenâ\u0080\u009d he saying this guy is the bomb, he will blow your mind away. When he says â\u0080\u009cRecommended at the price, Insatiable and appetite, Wanna try? You wanna try?â\u0080\u009d. in away heâ\u0080\u0099s telling other gay men if we donâ\u0080\u0099t stay together for some reason I highly recommend him.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\n With refrences like \"remedy, for Khrushchev and Kennedy\" and  \"To avoid complications\r\nShe never kept the same address\" I always saw the song as being about a Femme fatale. Even the chorus would suggest an assasins tools  \t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis song in no way speaks of a woman being a prostitute.\n\r\nInstead it speaks of a confident woman, with accumen, cultured tastes, who defines herself, instead of allowing others to do it.  She is educated and wise to the ways of the world, and because she is complez and not \"common\" in her ways or means, is bequiling to others.  More of a conquest and a curiosity.\n\r\nThis role in ancient times might have been a \"Courtesan\", who was not simply a subject for sexual pleasures, but sought after for her company.  A woman who was independent, made her own means, was highly educated and refined, and able to position herself as more of an equal to men than other women of her times.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\n\"People are used to hard rock, energy music from Queen, yet with this single you almost expect Noel Coward to sing it. It's one of those bowler hat, black suspender belt numbers â\u0080\u0094 not that Coward would wear that. (...) It's about a high class call girl. I'm trying to say that classy people can be whores as well. That's what the song is about, though I'd prefer people to put their interpretation upon it â\u0080\u0094 to read into it what they like.\" - Freddie Mercury\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nIt is absurd to expect Mr. Mercury to name the subject lady of Killer Queen. There would be a lawsuit.\nBut the mention of \"Kruschev and Kennedy\" (who married JFK?), \"Paris\" (who hailed from French aristocracy, who got her clothes and perfume from Chanel, who had a BA in French lit, and visited Paris frequently), she smoked cigarettes, Well versed in etiquette, Her stepson (Alexander Onasis called her \"the geisha\".\n\"You wanna try?. You wanna try\" Heck, EVERY man wanted to. \"Playful as a pussycat\" may reference her catalog of affairs and her later reclusive life \"momentarily out of action\".\n\nMakes sense to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nIn my opinion this song represents a woman with a certain life style - the luxurious life style with the good food and all life' pleasures. On the other hand I believe the song also mocks this vacant and superficial life. Plus the insinuation and comparing to Marie Antoinette and more over a Killer Queen, all seem to lead to a vey destructive way of life.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\n::this song reminds me of the cocaine blues, i think this is one of their best songs ever::\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nIt is about a high class prostitute...not sure what all that laser beam stuff is all about though :)\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThe song rocks cause its about a women who uses people for her own gains.  The women with her own experience trying to discover something.  Though it seems she makes her life meaningless and she dosnt realize it.  The men see her as an assurance of life and is foolishy in love with her and she introgate them for her own pleasure.   \t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nthis is my favourite queen song, to me it's a mockery of the high-class and describes how superficial and empty it all is.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI always saw the \"killer queen\" as a travestite... I may be wrong but that was my first impression\r\nI guess it could also be a female prostitute\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI am under the impression that it represets some travesitite because Freddie Mercury was gay. Good song anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nAlright well first of all,, This song has absolutely nothing to do with aids. Aids was discovered in the early 80's and freddy mercury was diagnosed in 1988, He kept it a secret from the public untill 1991. On the 23rd November Freddie confirmed the worst by issuing a statement saying that he did in fact have AIDS. At 7pm the next day Freddie's fight was over.\n\r\n  And because this song was released in 1974, in the sheer heart attack album there is no possibility it was. I like Number6's definiton of the song, but i always thought it was a high class prostitute. Never keeping the same adress etc etc. \n\r\n Its a great song, One of queens best. Followed only by Flash, Bohemian Rhapsody, We are the champions and a few others. \n\r\n   Queen rules ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nOne other thing;  no matter how seemingly swishy Freddie *could* be, he was (in fact) bisexual, and had a girlfriend for many, many years, whom he was also very close friends with.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThe song, well done for those who have got it, is about a high class lady who is a prostitute. Freddie wrote beacuse he wanted to show that posh birds can be whores too. Not just people who are broke and need money. I too hav seen the band Killer Queen and would reccomend them.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI just think it's about an immoral woman who'll suck you in with her charms and such.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nit's just great\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nok one, dont try so hard to find a \"bisexual\" double meaning into this song you frikin homophobes\r\ntwo, this must be talking about a hooker, judging by \"Recommended at the price\" and how notorious she is as a lovemaker\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nYeah, I don't think this is about gay people in the slightest. I think that the Killer Queen is a high class call-girl, like a western equivalent to a geisha (they even mention \"geisha\" in the song). This makes sense because of the references to high-class people like Khrushchev and Kennedy and invitations you can't decline.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI thought, in high school, Killer Queen, a beautiufl girl with a heartwreckin' reputation, like a groupie extraordinaire or a call girl in the expensive class. Well that still maybe true, in the song, but I think it's about a girl, who is an assassin, by the lyric and reference to the price\n\r\nShe's a Killer Queen \r\nGunpowder, gelatine (sex and blasting you) \r\nDynamite with a laser beam \r\nGuaranteed to blow your mind (sexually and literally)\r\nAnytime (for hire)\n\r\nthat's what I think now adays, maybe the kennedy thing made me think. it's a hit-girl!\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI think it's about a female con artist who is very sly and comes off with all the luxyries and life.  She seems very well cultured and classy and she uses unsuspecting rich men for their money, etc. and then kills them.  That's just what I think\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nUp class prostitute, both Brian May and Roger Taylor have said it themselves...\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nYup exactly that.  It is quite obvious \n\r\nGuaranteed to blow your mind \r\nAnytime, ooh \r\nRecommended at the price \r\nInsatiable an appetite \r\nWanna try? \r\nYou wanna try\n\r\nThis is probably my favorite Queen song of all time.  The only time I ever felt gay in my life was when I did eight minute abs and push ups while listening to Queen's A Night at the Opera.  I quickly lit something on fire to restore my manhood.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nYeah, dyanamite with a laser beam is just trying to say something very dangerous i.e. two weapons spliced together. The \"recommended at the price\" line among others makes it pretty obvious that it's about a high class prostitue. Kruschev and Kennedy might just represent problems/occurances int he world, and how the sex with this certain high-class prostitue is a \"remedy\" for such things.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI had thought this was a James Bond-esque bad girl...but a closer inspection of the lyrics makes it look like a prostitute. I dunno, maybe Freddie wanted to leave it to interpretation, because I still like my bad girl theory, and the bit with the laser beams is evidence for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI was reading this book with interviews from all these classic rock bands about what this song means and Freddy said that this song was about a high class hooker. It just goes to show no matter how \"classy\" or rich someone is they can still be skanks... I agree with rexiudeorum with the whole remedy bit\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI personally believed the song to be about a woman who is a mistress among many of the wealthy and therefore she gets whatever she wants. She isn't a force to go against because she's got such influence among the higher-ups.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThis is easy!  Killer Queen is about Christine Keeler:get it? (Keeler - Killer)  Hence the reference to Khruschchev & Kennedy.  Check it out & you'll see what Freddie was trying to say. Currently teaching a '60s college course & was planning to use the lyrics as a class assignment.  Saw all the comments & had to write.  Great song, too!\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nProbably a stupid meaning, but anyway... I always thought it was about drugs (which Freddie Mercury knew a lot about, remember) - with lines like 'Wanna try?', 'Little man from China' (a sort of contrived smuggling connection?) and the whole atmosphere of extravagant self-destruction. All the stuff about 'Guaranteed to blow your mind', 'insatiable an appetite' and 'recommended at the price' kind of ties in as well - on the other hand, it ties in just as well with the prostitute theory. Since Freddie Mercury was experienced in both, it could have been deliberately designed to be ambigous.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nIn a 1974 interview, Freddie said this: \"It's about a high class call girl. I'm trying to say that classy people can be whores as well. That's what the song is about, though I'd prefer people to put their interpretation upon it - to read into it what they like.\" So, if you want to think it's about homosexuality or transvestites, or whatever, go right ahead. (the interview is at: geocities.com/SunsetStrip/Stadium/5025/… for anyone who's interested.)\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nnothing to do with homosexuals, people.....it's about a high class prostitute.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\ni think the song is about Margret Thatcher, who was the british priminister.\r\nthe lyrics portray her in her ruthlessness and no pissing about that she was fearer by many in parliment and that she also had another side that was the opposite that nice\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\ni don't know...i always assumed it was about drugs...i mean look a certain parts of the song..\n\r\n1.\"A built in remedy, for Khrushchev and Kennedy\r\nAt anytime an invitation, you can't decline\"\n\r\n2.\"Recommended at the price Insatiable an appetite Wanna try?\"\n\r\n3.\"Drop of a hat she's a willing as\r\nPlayful as a pussy cat Then momentarily out of action Temporarily out of gas To absolutely drive you wild, wild..She's all out to get you\"\n\r\nand the part about the man from china could possibly be a referance to heroine...\n\r\nthat's just how i've always interpreted it....\n\r\nalthough the person above me has a very good theory...\n\r\ni don't know why you guys criticize eachothers opinions...\n\r\nsongs mean different things to differen't people, it just depends on your interpretation...\n\r\nif YOU think killer queen is about transvestites, it will be about transvestites\n\n\r\nand if you think it's about prostitues, then it is about prostitutes\n\r\nif you think it's about drugs..then it is.\n\r\nit all depends on what i means TO YOU..\n\r\neveryone thinks differently so there really isn't any right or wrong answer when it comes to song interpretation....\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI agree,\r\nlaser beam just rhymes\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nIT IS ABOUT A HOOKER.\n\r\ncase closed. Whoever said a high-class one was also correct.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI'm pretty sure this song is about a very high class woman, not necessarily a hooker, prostitute etc but one that is probably single and gets around. Obviously a very seductive type - guys should know the type - you know, the chick you see every so often, just look at her and go WOW! Hence all the explosive, energetic words :)\n\r\nInstead of a hooker I would say she's probably more like a conceited pimpette. Well, she's \"extraordinarily nice!\" ... conceited isn't the right word, how about posh? The first part is the tricky part of the song. I understand a few of the references, but I'm getting that the jist is just details that support the notion that this woman is on top.\n\r\nShe's just the chick that everyone digs :)\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI think this song is talking about a female assassin disguised as a high class prostitute. The \"guaranteed to blow your mind\" just seems like a humorous double entendre for either driving you wild or killing you.. I don't know\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\n\"Dynamite with a laser beam\" definetly my favorite lyric in the song. i love the guitar at the end :)\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis song is great.  It grabs you. But what could be better than a song about a high class prostitute sung by homosexual men (and it has a great guitar solo)?\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\n\"Caviar and cigarettes\r\nWell versed in etiquette\r\nExtraordinarily nice\"\n\r\nLove that part.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI love the guitar solo.. I love the entire song.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nahh, i know this has been said already, but i think this is about a prostitue. a high class one, like a call girl.\n\r\n\"She keeps emotion in a pretty cabinet\"\r\nshe doesn't show emotion, she doesn't get attatched to her clients.\n\r\n\"Guarenteed to blow your mind... anytime\"\r\nmaybe not just blow your mind, if you know what i mean. ;)\n\r\n\"Recommended at the price, insatiable an appetite\"\r\nshe's always ready for sex, or whatever, as long as you've got enough money.\n\r\n\"Drop of a hat she's a willing as\"\r\nonce again, always up for sex.\n\r\nanyway... there are other lyrics that support my idea but im just a bit busy.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI know! Freddie himself said it was a about the fact that rich girls, living lovely lives can still be whores. From his own words\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThe song is about Mary Austin. His only friend, and his wife.\n\r\nThe mix of huge attraction and repulsion is the fact that he loves her so much, and finds her so amazing, but he's gay, and even she can't make him straight.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nFirst of all, Freddie was very gay. He was not bi-sexual. And this song IS in fact about a transvestite who had aides and gave it to Freddie and sealed his fate. She/he is the reason he is no longer with us. If you read his biography than you will know this\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nthis song is about a high end prostitute. just because  a woman is dainty and wealthy doesn't mean she isn't loose.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nthis song always floors me\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nThis is my all-time fave Queen song too...the lyrics are so creative and coy.  I don't think Freddie is moarlizing that high-class life is empty, on the contrary, he is celebrating it and camping it up.  It's definetly about a transvestite/prostitute who is actually a cold-blooded killer.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nyea, i definatly agree. Its about a superficial queen, who seems to have it all, but is empty inside. She has a nice exterior, but she will tear you apart if you cross her. She is malitious and mean. (hence \"killer queen\" and the whispered \"shes going to get you\")\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nim almost completely content with my thought that this song is actually about marie antoinette. i keep watching the movie is actually the story behind that, and there isnt a word in this song that makes me believe otherwise.\r\ni sound like my uncle.\r\nthis is quite an amazing song. ringtone status.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nits about a really rich whore\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nok i think its about marie antionette or a women now who lives like she did.... rick maybe promiscouis.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI have to say, the only thing I dislike about Queen is the fact that Freddy was a homosexual.  But other than that, this band is kick ass, love their music.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nbest line hands down\n\r\nShe's a Killer Queen\r\nGunpowder, gelatine\r\nDynamite with a laser beam\n\r\nwith a friggen laserbeam how bad ass is that come \r\non\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nIt's about a high-class prostitute; like Marie Antoinette. Meaning she just knows how to sell herself and she knows how to spend her money.\n\r\n-linds \"let them eat cake.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI think this song is about a high class prostitue.\n\r\n\"A built in remedy, for Khrushchev and Kennedy\" both know for their infidelity\n\r\n\"Met a man from China, went down to Geisha Minah\"\r\nMinah I think is a  brothel\n\r\n\"You wanna try\"\n\r\nThe luring call of a prositute class\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\ntrippy song\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI think that the song is about a prostitute, there's some lines that say that.\r\n\"Anytime an invitation\"\r\n\"Recommended at the price\"\r\nIf we talk about a rich girl, she shouldn't smoke, but there's caviar too. A rich girl will keep her adress\r\nResult: It's about a prostitute\r\nSorry for my poor english\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nthis is a good song. And You know what analyzing it, isnt going to make it better. Its so freaking obvious. Okay Freddie Mercury is freaking wonderful. So is David Bowie. Now; its not about a prositute. Just to put it out there...\r\nDo people have to analyze everything?\r\nJust enjoy it.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\numm dude the reason why people are analyzing the song is cos this is SONGMEANINGS.net... its where you discuss the meanings dubmass... anyway the song prolly is about a high class prostitute, but it could just be a high class girll y'know... the marie antoinette line, she was the wife of the king of france right before the revolution... and let them eat cake was a line from her because people were starving in france... meaning she could care less about anyone cept for herself.... blah\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nIt's about a high class prostitute, and how that even if your weathy you can still be a whoar, Freddie said that himself in an interview.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI think its about women who find rich guys and get all their money and kill them. \"gunpowder, gelatine\" She poisions them and uses there money to buys stuff eventually it all becomes meaning less. When that happens She just goes and finds her new target.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nHere's a quote from Freddy Mercury\n\r\n\"People are used to hard rock, energy music from Queen, yet with this single you almost expect Noel Coward to sing it. It's one of those bowler hat, black suspender belt numbers â\u0080\u0093 not that Coward would wear that. (...) It's about a high class call girl. I'm trying to say that classy people can be whores as well. That's what the song is about, though I'd prefer people to put their interpretation upon it â\u0080\u0093 to read into it what they like.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThe song is definitely about a high class hooker - FM said so himself. Now about the gay/tranny thing, that is open for interpretation. I don't think every song Queen ever did is secretly about homosexuality and AIDS.\n\r\nTo the person who said,\n\r\n'She keeps her emotion in her pretty cabinet.'\n\r\nIt's actually Moet et Chandon, not emotion.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nwhat i get from this killer queen is not a transvestite though, prostitute maybe, but clearly not a woman who would bow down to a man. Instead, she makes all men bow down to her, respect her and maybe scared of her. \n\r\nHer first priority is, of course herself. She keeps her Moet et Chandon for herself, while people keep best champagne for important people (in business, goverment, etc). She is ignorant (Marie Antoinette said \"let them eat cake\" as the answer of the protests from the masses about the very scarily expensive bread price, noone can eat because of that). As a woman, she is unbelievable, she is irresistible, yet not vulgar because she is elegant, she has high class taste and seems very smart, confident and well educated. she has all the power; \"Gunpowder, gelatine, dynamite with a laser beam\" and she clearly can protect herself, thats why she doesnt need a man, instead men crave a woman like her.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nwith a friggen laserbeam how bad ass is that come\r\non\n\r\nxDD\r\ni fucking love you.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nI think this song is about a wealthy whore.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nAt work my co-worker and I always discuss songs that remind us of one another and this one always pops up about me.\r\nquite perplexed, i am.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\ni love this song. i'm thinking it's a mockery of high class and false prestige, or maybe just about a prostitute.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nby cktaresh on 06-26-2007 @ 03:45:41 AM\r\nI have to say, the only thing I dislike about Queen is the fact that Freddy was a homosexual. But other than that, this band is kick ass, love their music. \n\n\r\nwow. what. the. fuck. i have to say, the only thing i dislike about your comment is that you're a shallow asshole. just because freddie was gay, doesn't mean he wasn't a genius. his orientation didn't stop queen from becoming one of the best bands of all time, did it? but whatever, you're probably right anyway. because i'm so sure that since you're straight, that makes you such a good person, and an even better songwriter.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI agree with everyone about the high price call girl. But just for arguments sake what if it were something deeper, with the Kennedy and Krushcev reference, and the mention of weapons could it just for the sake of argument be about war? Love Queen! Wish that there were bands like this these days!\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nWhich woman might make \"A built in remedy, for Khrushchev and Kennedy\" ???????????!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nobviously, as aforementioned, it's about a high class prostitute (transvestite maybe, but maybe not.)\n\r\n\"A built in remedy, for Khrushchev and Kennedy\r\nAt anytime an invitation, you can't decline\"\r\n--She has very high paying clients, obviously..\n\r\n\"Met a man from China, went down to Geisha Minah\r\nThen again incidentally, if you're that way inclined\"\r\n--Possibly this is her meeting place, client. \r\nOr maybe (if tranny) she got a sex change from the Asians..\n\r\n\"For cars she couldn't care less\"\r\n--Does the deed in cars, obviously.\n\n\r\nThat's all the bits I'm going to analyze. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nThe whole Kennedy thing may be a reference to Marilyn Monroe. That kinda girl.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nWell before I discovered that Mercury originally wrote it about a classy whore, I had my own interpretation of it.\n\r\nI thought it was about this beautiful, intelligent, glamorous lady that the Queen boys were basically all over, but their was something absolutely odd about her - she drove them crazy. Yes, they really had to get to the bottom of that.\n\r\nAnd so Killer Queen is devised.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nEven if this song weren't as popular, I would love it.  \t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nThis song is about cocaine. And how it makes you feel on top of the world and greater than thou~ \r\n\"Blow your mind, recommended at the price.\" it makes you feel very high class when you're doing it.\r\nYou wanna try?\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nLOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOVE THIS SONG\r\nONE OF QUEEN'S BEST!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nIn my opinion, the song is about a high class prostitute who's met by \"customers\" pretending they are on a busneiss trip \"Met a man from China, went down to Geisha Minah\r\nThen again incidentally, if you're that way inclined\".\n\r\nShe is compared to Marie Antoinette as she has rich luxuries. \r\nShe also has drugs and pills - \"Temporarily out of gas\" - to get help her customers feel more sexually put on - \"To absolutely drive you wild, wild..\".\n\n\n\n", "comment_95": "\nSo until just now reading the other comments I actually never thought of this song as about a prostitute, but I suppose now that I hear that and reread it, that does make sense. But BEFORE I found that out like when I used to listen to this song with my Dad I always thought I would like to be a girl like the one in the song! I realize that sounds bad now! But let me explain!   \r\nSheâ\u0080\u0099s like this rich girl who drinks expensive wine, has amazing parties with famous people, and money to spare!\r\nâ\u0080\u009cCaviar and cigarettes!â\u0080\u009d They sound so high class and elegant in this song. I can see this gorgeous girl who everyone falls in love with because even though sheâ\u0080\u0099s rich sheâ\u0080\u0099s also â\u0080\u009cextraordinarily niceâ\u0080\u009d.\r\n â\u0080\u009cGunpowder-dynamiteâ\u0080\u009d Just sounded like she was a hot chick!\r\n Rereading the â\u0080\u009cguaranteed to blow your mindâ\u0080\u009d part definitely makes me think otherwise nowâ\u0080¦..\r\nTo avoid complications she never kept the same addressâ\u0080\u009d Always sounded kind of cool to me like she was just Free! Free to go wherever she wanted whenever she wanted! No need to stay in one place, nothing and no one to hold her down! That was the main reason I wanted to be Miss Killer Queen!\r\nâ\u0080\u009cPlayful as a pussycat - sheâ\u0080\u0099ll drive you wild!â\u0080\u009d Sheâ\u0080\u0099s hot and fun and playful, like just what ever guy wants but sheâ\u0080\u0099ll drive you wild because sheâ\u0080\u0099s so unobtainable! \r\nâ\u0080¦â\u0080¦ Iâ\u0080\u0099ll still think of it this way because I donâ\u0080\u0099t wanna think that I wanted to be a prostitute when I was 14! Ha-ha!\n\n\n", "comment_96": "\nIn my last comment I said the youtube video was Freddie Mercury The Untold Story. I am correcting myself the video I was talking about is under Freddie Mercurys Loves.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\n With refrences like \"remedy, for Khrushchev and Kennedy\" and  \"To avoid complications\r\nShe never kept the same address\" I always saw the song as being about a Femme fatale. Even the chorus would suggest an assasins tools  \t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nI always thought about a female drug dealer (she never keeps the same address,guaranteed to blow your mind, built in remedy, insatiable an appetite etc) thats just my thoughts\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nwell i thought it was more about like a \"mistress\" in referring to Kennedy (with Marilyn Monroe) but yah its most definitely one of my top queen songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nI love this song! i personally think Freddie was talking about himself, in a way. I mean, he was rich, and extraordinarily nice, and he probably kept Moet and Chandon in a pretty cabinet. :D I Love Freddie!!! Or maybe he was just talking about someone who was extremely hard to please. Or maybe, this is just a song without a meaning! i don't know. but Freddie is God, so we shouldn't over-analyze him. \t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nI know \"MoÃ\u0083Â«t et Chandon\" are famous luxury and champagne producers that have a royal worrant to supply champagne to Queen Elizabeth II!\r\nThe \"let them eat cake\" obviously has something to do with mocking her Marie Antoinette's stupidity...\n\r\nother than that I can't realy figure out the song-\r\nWho is the man from china?\r\nWhat is Geisha Minah?\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nCould the \"Gunpowder and gelatine, dynamite with a laser beam\" part refer to cocaine and/or champagne?  I thought it could be either that or make up, or both.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nShe is a high cless call girl. Perhaps transgender. I wouldn't go along the route of it being a critique of a decadent lifestyle as 'empty' as some have suggested, it's more likely to be a celebration of it! after all this is Freddie! Perhaps the meanings become confused after crossing the atlantic?\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nWhile it has crossed my mind, I never thought this song was about a prostitute. Oddly enough, it reminds me of Irene Adler from the Sherlock Holmes books.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nMight I suggest you google Mata Hari? You may just find your \"Killer Queen\" in her life story\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nmaybe about a very fancy prostitute\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI think LSD is the real killer queen. \"Dynamite with a laser beam\" \"guaranteed to blow your mind, anytime\" Just trip and study the song. it all makes much more sense. Same with Rock Lobster by the B-52's and just about any Hendrix or Pink Floyd song. lol\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nI think it's, at least subconciously about Elizabeth II. As well as the title of Stones album 'Their Satanic Majesty Requests'. Read David Icke, List of Famous Satanists etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nI actually think that it could be about the play Pygmalion by George Bernard Shaw. If you've read/seen it you'll get what I mean, with Liza, Mr. Higgins and such.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nIt's about a sophisticated slut.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\n\"Built in remedy for Krushchev and Kennedy\" = CIA Project Midnight Climax (using high-class hooker to interrogate and drug communists and other political enemies of the CIA)\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nWhat's all this about homos and high-class women? I thought it was just a song about a crazy queen.\n\r\nSomething about the sound of it makes me giggle.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\n\"A built in remedy, for Khrushchev and Kennedy\" (Both people of immense power and targets of killers)\r\n\"Gunpowder, gelatine\r\nDynamite with a laser beam\r\nGuaranteed to blow your mind\" (methods of killing)\n\r\n\"Let them eat cake, she says\" (this shows a major disconnect from what one would consider normal life just as it did for Marie Antoinette)\n\r\nShe has the best of the best and is not impressed with things that most men are impressed by.\r\nThis woman is an assassin, not a prostitute and possibly not even a woman (queen, as in drag queen)\r\nQueen was one of my all-time favorite groups.  Such intense harmonies! No one since has done anything like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\npublisher block -.-\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nThe \"Went down to Geisha Minah\" has the same sounding as \"Asia Minor\"...Freddie Mercury's parents were Persian, a country that borders Persia (Now Iran) is Turkey...which was once Asia Minor and it was ruled by the Persians at one point as well as Pakistan, and Mercury's Religion was Zoroastrianism, The Persians that would practice Zoroastrianism, would have a stronghold in India and be known as Parsis. And even though Freddie Mercury will be known as the best Indian-British Musician ever (sorry Jyoti Mishra and Tony Kanal) and also...Freddie Mercury has LOVED Japan when he went there in 1975, as a matter of fact he pwned many artifacts that were Japanese as well as getting his pic taken with a group of Geishas. He even has a song called \"Teo Toriatte\" which many Japanese have embraced!\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nThe name is the title Killer Queen A man with all the aspects of a woman that would drive men crazy. This is a guy who drove somebody in the band nuts. Women know how to do this but men can do this better than women because being the same sex you know what drives men wild! My cousin who is gay says men are whores I believe him. He is not looking down on them but you can see from his view a real queen would be a killer for her knowledge of how to please a man.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nFrom an interview to Freddy Mercury: â\u0080\u009cItâ\u0080\u0099s about a high class call girl. Iâ\u0080\u0099m trying to say that classy people can be whores as well. Thatâ\u0080\u0099s what the song is about, though Iâ\u0080\u0099d prefer people to put their interpretation on it.â\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nShe's a MAN, baby!\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nThe reference to Marie Antoinette is something that came out of the French Revolution, but she did not say it out of being callous. Poor Marie didn't seem to have too much going on above her chin. When she was told the peasants were revolting because they didn't have any bread, she thought that they literally were upset because they had no bread for dinner. So she suggested, \"Well, if their out of bread, have them eat cake.\" She was just plain a dolt, and thought she had solved the problem.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nI think you can interpret this song in several ways.  Obviously, the high-class prostitute is one interpretation.  \n\nI enjoy thinking of it in a little more creative fashion, a la \"La Femme Nikita.\" She's a beautiful, elegant woman who is really a covert governmental operative.  The reference to \"Kruschev and Kennedy\" certainly supports this interpretation, as do the references to various weapons.\n\nAnother similar interpretation is that this is simply a dangerous woman to get involved with.  She's irresistible but the men who fall for her end up getting hurt emotionally.  \n\nFinally, one much looser interpretation is that \"she's\" a drag queen.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nGelatinous dynamite, a mixture of nitrocellulose and nitroglycerin, was an invention of Alfred Nobel as a substitute to gunpowder, wich was too much unstable.\n\"Gunpowder, gelatin\nDynamite with a laser beam\" \nis a technical progression both for the arms industry and humankind.\nGood and Evil.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nWhy oh why do I love Paris ... because my love is here.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nMoet=Male poet\r\nChandon sexual intercourse\n\r\n_She keeps Moet et Chandon_\r\nshe keeps a poet and lover\n\r\n_In her pretty cabinet_Â \r\nVery close at hand\n\r\n_'Let them eat cake' she says_Â \r\n\"Them\" most likely refers to her husband.\n\r\n_Just like Marie Antoinette_Â \r\nShe's obviously denying sex to her husband\r\n_A built-in remedy_\r\nA built-in remedy means her lover works for her\n\r\n_For Khrushchev and Kennedy_Â \r\nHer husband's probably some old fat rich old money bastard\n\r\n_At anytime an invitation\r\nYou can't decline_Â \r\nHer poet lover obviously works for her because he cannot decline\n\r\n_Caviar and cigarettes\r\nWell versed in etiquette\r\nExtraordinarily nice_Â \n\r\nFreddie Mercury is singing as her lover and he's singing about their times together.\r\nWith all the crazy sex\n\r\n[Chorus]Â \r\nShe's a Killer Queen\r\nGunpowder, gelatine\r\nDynamite with a laser beam\r\nGuaranteed to blow your mindÂ \r\nAnytime\n\r\n[Post-Chorus]\r\n_Recommended at the price_Â \r\n_Insatiable an appetite_\r\nHers\r\nWant to try?Â \r\nObviously her lover is just in it for the fun and is apparently open to try.\n\r\n[Verse 2]\r\n_To avoid complications\r\nShe never kept the same address_Â \r\nThis is a rich woman chillin at the finest hotels but she won't stay at them twice, probably because she never knows which guys she will be with.\n\n\r\n_In conversation\r\nShe spoke just like a baroness\r\nMet a man from China_\n\r\nThe poet is talking about something him and his lover did when they met a man from China the man tells them about this geisha named minha\n\r\n_Went down to Geisha Minah_Â \r\nGeisha Minha, Minha is a Japanese girls name it means; lost.  \r\n Many people dont know the geisha use to always be male, and it's not unusual for a geisha to be male.\n\r\n(Killer, killer, she's a killer Queen)\r\n_Then again incidentally\r\nIf you're that way inclined_\n\r\nIncidentally if you're that way inclined towards male geishas\r\nApparently Freddy recommends it.\n\r\n_Perfume came naturally from Paris_ (naturally) \n\r\nokay we get it she's rich\n\r\n_For cars she couldn't care less_\n\r\nShe doesn't like cars but maybe that's where she meets her lover?\r\nFastidious and precise\r\nShe's always going to keep herself well groomed no semen stains on the clothes. She's very careful.\n\r\n[Chorus]Â \r\nShe's a Killer Queen\r\nGunpowder, gelatine\r\nDynamite with a laser beam\r\nGuaranteed to blow your mind\r\nAnytime\n\r\n[Guitar Solo]Â \n\r\n[Bridge]\r\n_Drop of a hat she's as willing as Playful as a pussy cat_\n\r\nWhat a good girl\n\r\n_Then momentarily out of action_ \n\r\ncar is parked on the side of the road\n\r\n_Temporarily out of gas_\n\r\nHere we find out her poet lover is her driver\n\r\n_To absolutely drive you wild, wild She's all out to get you_\n\n\r\n[Chorus]Â \r\nShe's a Killer Queen\r\nGunpowder, gelatine\r\nDynamite with a laser beam\r\nGuaranteed to blow your mind\r\nAnytime\n\r\n[Outro]\r\nRecommended at the price\r\nInsatiable an appetite\r\nWant to try?Â \r\nWant to try?\n\n\n\n", "comment_124": "\nThis song is about a murdererâ\u0080\u0099s imaginary friend. The murderer has a fetish for the woman hand. He only kills when it is absolutely necessary. He just wants to live a quiet life indulging in his hobbies without being troubled by anyone. His imaginary friend is a pink humanoid muscular cat person that can turn anything into a bomb, shoot out a tank that tracks heat signatures, and turn back time when someone tries to find out the murdererâ\u0080\u0099s identity. The murdererâ\u0080\u0099s name is none other than Kira Yoshikage, and his friend is called Killer Queen.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nIn fact I see this song as a high class prostitute with a \"double personality\", who both serves high class men and is a serial killer between them - so as a \"killer queen\", \"To avoid complications She never kept the same address\" as one would do.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nRedShana's interpretation above comes fairly close to what I believe this song is about. Kudos RS! Well thought out and you don't miss much. I agree the song is about a high end prostitute. The prostitute is definitely male. People please, when interpreting something try to remember WHEN it was written and performed. This was the 70s. We had to rely on inuendo and be very clandestine, especially as regards what now would be called LGBT subject matter. Often the true meanings were laid between the lines, although I agree with RedShana, Freddie was pretty clear on most of this, for anyone who was tuned in and looking for it. Killer Queen is about a man who is a seemingly delightful very high end prostitute for men. Although I love the idea of the assasin someone had, I know that isn't really what the song is about. Also, someone said something about AIDS, um no! This song was written before AIDS was on anyone's mind. That didn't come until the 80s. Also, \"killer\" was a way of saying something was extremely good/cool, etc. As in, \"did you see the new movie? It's killer, you got to see it.\" So, to sum up, KQ rocks out about a high end male prostitute for gentlemen, who is a real pleasant, playful, charming type to the lucky clients, and therefore, comes highly recommended.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nAfter some research based on the time period of the song and historical references in the lyrics I have concluded that this song is about Jacqueline Kennedy Onasis.  \n\r\nThe first verse is key.  The reference and metaphor for her French heritage -  â\u0080\u009cshe keeps MoÃ«t en Chandon in her pretty cabinetâ\u0080\u009d.   Her pretty cabinet is herself and her fashionable clothing.\n\r\nâ\u0080\u009cLet then eat cake just like Marrie Antonette â\u0080\u009c. Again refers to her French lineage and perhaps the authors perception of her callousness and ignorance at the beginning of her run as First Lady.\n\r\nâ\u0080\u009cA Built -in remedy for Krushev and Kennedy.â\u0080\u009d  Jacqueline accompanied the president on a trip to meet Krushevâ\u0080\u009d. Tellingly, Krushev made it a point to shake hands with Jacqueline before the president.  She was built-in referring to she was the First Lady and not external to the situation.\n\r\nAn Iâ\u0080\u0099mvitation  Krushev could not decline.  Nor could she decline on the handshake.  She obviously had some impact on the diplomatic resolution.  \n\n\r\nâ\u0080\u009cCaviar and cigarettes, well versed in etiquette, extraordinarily niceâ\u0080\u009d. She came from a wealthy family, went to boarding school in France. \n\n\r\nâ\u0080\u009csheâ\u0080\u0099s a Killer Queen, Gunpowder gelatine, dynamite with a laser beam, guaranteed to blow your mindâ\u0080\u009d. Refers to her power, sheâ\u0080\u0099s a queen in her own right as First Lady to JFK.    She is noted as having an erratic personality,  At times paranoid, unstable and other times as confident and effective. \n\r\nThe erratic nature of her personality is also conveyed in the bridge â\u0080\u009cdrop of a hat ......â\u0080\u009d\n\n\r\nThe  China reference â\u0080\u009cmet a man from China went down to Ghiesha Minah:  Jacqueline Kennedy after the assignation hired Chinese born I.M. Pei as architect to design the JFK Memorial Library and Museum.  She ended up on trip with him to China but that was in 1982 years after the song was written.  The went down to Geisha Minah  may be a metaphor for , well you know.\n\r\nI might be totally off base here but it was interesting analyzing these somewhat cryptic lyrics.  Love the song by the way.  \n\n\n", "comment_128": "\nThis I reckon is all about someone he couldn't have. It's nothing to do with prostitutes.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\n(Warning: Excuse my grammar errors if I have, IÂ´m hispano and have not totally domain English language)\n\nEver I've thought Killer Queen is about a high class woman -just, quoting Freddy here- that degeneres herself into a whore. She started to use drugs. And harder and harder until she turn off into a whore to earn money for drugs.\n\nBeginning with Wine, simple socialization drug:\n\"She keeps her Moet et Chandon\nIn her pretty cabinet\"\n\nThen she starts to be careless with his own alcohol consumption, without limitations. She justifies herself acting like ' it's my life, let me stay, let me consume the sweet-things that I like '. The MA reference, I supose, is an insinuation about high class people that uses his money without care:\n\"'Let them eat cake', she says\nJust like Marie Antoinette\"\n\nI think this part talks about how easier is to make a deal drinking. And yep, it includes more high class people:\n\"A built-in remedy\nFor Kruschev and Kennedy\"\n\nHere her high class life and her consumption starts to oppose:\n\"At anytime an invitation\nYou can't decline\"\n\nNow she is mixing her two styles of life, her caviar (high class) and her cigarettes (consumer life). Acting with etiquette but really she's just drugged, that felling so nice:\n\"Caviar and cigarettes\nWell versed in etiquette\nExtraordinarily nice\"\n\nI see the chorus parts like a hole in the narration, functions like a transition of years or months without importance. In this time she tests stronger things and degeneres herself.\n\nI think 'Killer Queen' not refers at the protagonist. It referes to the drugs, they can kill you, or kill your high class reputation, your queen reputation. Then the lyrics describes the drug-effects she test. Drugs that makes you feel the world like gelatine, drugs that free your mind  and makes feel like gunpowder:\n\"She's a Killer Queen\nGunpowder, gelatine\"\n\nMaybe I'm wrong about this part. In latin america, at the 60's and 70's, 'dynamite' was an euphemism for weed, Idk if that was equals in other countries outside. However, \"dynamite with a laser beam\", I think it means that she use drugs strongers than simple-weed:\n\"Dynamite with a laser beam\nGuaranteed to blow your mind\nAnytime\"\n\nStronger drugs are expensive, and make you addict:\n\"Recommended at the price\nInsatiable an appetite\nWanna try?\"\n\nI have a problem with my interpretation, the next two verses are in past, and I can't explain that.\n\nNow she run away. His high class life over:\n\"To avoid complications\nShe never kept the same address\"\n\nEventualy, she pretends to be high class with a china-guy. Maybe she is steling him, or maybe they are stealing together:\n\"In conversation\nShe spoke just like a baroness\nMet a man from China\"\n\nThis part have many possible interpretation. It's a pun with Asia Minor that include the word Geisha, so, an interpretation is: her modus operandi for steal is be a minor geisha (a whore that acts in reunions); or: she turn off into a geisha (for get money for drugs) in a region of Asia.\n\"Went down to Geisha Minah\"\n\nI think she's stealing with her geisha act 'cause it seems logic, there's not a real evidence in the lyrics. Now she continue her thefts (again, and again), knowing it's bad, but his addiction forces her (incline in that way) to do it:\n\"Then again incidentally\nIf you're that way inclined\"\n\nParis is another reference to high class style of life. Her act is requested on better sites (or more privates). Now she's more expensive and finer (like a perfumed whore) and doesn't care, she just acts for the money:\n\"Perfume came naturally from Paris (naturally)\nFor cars she couldn't care less\nFastidious and precise\"\n\nAnother chorus part. So, the time pass.\n\nNow her geisha act is over. She's totally a whore, doing the necessary for money:\n\"Drop of a hat she's as willing as\nPlayful as a pussy cat\"\n\nThis part describes her current situation, she have few and little moments un-drugged. (the first line refers she doesn't works drugged):\n\"Then momentarily out of action\nTemporarily out of gas\nTo absolutely drive you wild, wild\"\n\nThe last pre-chorus line isn't about the protagonist, it's about the 'Killer Queen', about the drugs:\n\"She's all out to get you\"\n\nLast time the chorus. The time pass.\n\nLyrics finishes with a simple not-invitacion sentence, Killer Queen story continues, never gonna over:\n\"You wanna try.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nI have no clue why, but this song just conquers you. \r\nI love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nAny ideas on what this song is about?  I'm choreographing a dance to it for my university project and I'm curious about others' opinions.  I have my own ideas, but what do you think?\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nI think he's talking about a prostitute, maybe a transvestite (= queen). Ther's some fascination and repulsion in this character. Loved the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nthis is by far my favorite Queen song... I am under the impression it is about the emtiness and loss that comes with being so rich and famous...\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nDon't know the actual meaning, but it makes me think of the women who are spies in, say for example, old James Bond movies.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nIt's about a high class prostitute. There is a tribute band called Killer Queen. Just saw their concert last week and I must say they're bloody good. The lead singer's resemblence to Freddie is spooky. It's like he's right there on stage wif sawed-off mike in hand saying \"Ok, let's do it!\" ;-)\n\n\n\n", "comment_136": "\ni've heard someone say that this song is about a gay guy with aids, thus the killer and the queen\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\ni have no idea what the song is about but it is a great song. one of my favourite queen songs. actually i think its about mary antoinette the queen of france\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\ni agree with much of what technics is saying but i also have to add that shes trying to keep her prostitution from her family\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nI think this is overall a mockery of certain high class lifestyles. The comparison to Marie Antoinette(a note to the person that thinks the entire song is about Antoinette: if so, then why is she likened to herself?) seems to suggest that she isn't very intelligent, while the 'gunpowder...laser beam' would then be metaphors for the reckless methods by which she remains popular, despite her limited intelligence.\n\r\nThen, the woman being loose ('...quaranteed to blow your mind // anytime...')  contrasts with her  classy appearance('...well versed in etiquette...'), illustrating the difference between how the high class may act, and how they actually behave.\t\t\t\t\n\t\t\t\t\n\n"}