{"comment_0": "\nIts about greed, but more than that. Simply put, people don't appreciate what they have and seek other things that they really don't need.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nPeople who devote their whole lives to earning money one day realize (\"then it all crashes down\") that all their money has gotten them nothing worthwhile and they've wasted their entire life in pursuit of money instead of being truly happy and then they realize that they have wasted their life.  (where's your crown, king nothing?)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nhow many people can say this song reminds them of there ex-girlfriend, lol, she was self destructive and thought that she owned all she had, but when she cheated on me everything she had left and her friends left with me because she made them chose between me and her, lol,  to me its not about only money, but the people you surround yourself with the people you influence and stuff, but in the end its all an illusion becuase for people like that loyalty can only be bought and squandered therefore it goes as easily as it came, heh makes me feel good to listen to it, like as my final f**k you, wheres your crown now b*tch? :P\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThe \"off to never-never land\" bit is an adlib...James making fun of how much King Nothing sounds like Enter Sandman. What I dont know is why Bob Rock left it in on the \"squeaky clean\" Load production.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI believe it isnt so much about greedy people wanting money, I believe its more about power without responsibility, when someone actually gets something without trying, (Wish I may, Wish I might)\r\nAnd then when they recieve all this power, they end up failing in the whole resposibility department.....\r\nCome to think of it, kinda like Bush.\r\nPower comes with responsibility is the general Idea, the people who screw over their own countries for themselves, and then go about blaming others. Its about corruption with power, not money. (but I guess their the same thing in some cases)\r\nThe video clip supports this\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI doubt this song was directed at anyone in particular. Rock stars, actors, politicians, lawyers....it's about people who spend their whole lives wishing and working to be the best at material pursuits and not giving anything back to others, and then when their success vanishes, they wonder why they have nothing, because they don't realize or care that they need to give in order to receive.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think that it is about greed, but not necessaily about wanting everything and trying to take all. I see it ass a reference to coporate america and the ceo's and such who see it as their life goal to ammass a great wealth. So what if they are greedy, Thats not what the song is about. Its the fact that these people although are kings in society and socially, are kings of nothing. They have no community, no family, nothing to love, and no one to love them back. They dont donate becuase they want to, if they do only becuase its social protocol. Thats what it means to me. They have everything but they don't know whats important and are kings, but kings of nothing (of actual value)\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nIt's about people who are just greedy.  They just need to have everything and they don't care how they get it.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think its about someone who is greedy and they take and take and take, then one day they lose everything because they are so damn greedy...ahh hell i agree with the both of you\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nhi, i joined this website just to post this.\n\r\nthe reference to the star is a play on the \"wishing star\" rhyme. it is on the start of Disney's pinocchio.\r\nthe exact rhyme is \"star light, star bright, first star i see tonight. i wish i may, i wish i might, have this wish i wish tonight.\"\n\r\nin this song he wishes he owned the star and wishes he had everything. he uses a wishing star for a wholly selfish reason. i reckon this is supposed to show just how greedy they are.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI heard it was about Axl Rose too. \n\r\nAnd you point your finger, but there's no one around\r\nJust want one thing\r\nJust to play the King\r\nBut the castle's crumbled and you're left with just a name\n\r\nThat's AXl Rose all over :D\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\n\"King\" Henrik Lundqvist. JOKING (Excuse The Hockey Pun :). It's obviously about arrogance and greed. I mean just read this line: \"...I want that star, I want it now. I want it all and I don't care how.\" Then you hear the classic phrase: \"Be careful what you wish, Be careful what you say, Be careful what you wish you may regret it, be careful what you wish, 'cause you just might get it.\" Then the chorus line, yatta, yatta, yatta. You get the point. And then at the end you hear James Hetfield say: \"...Off to never never land...\" That is just a joke by Hetfield because of how similar King Nothing and Enter Sandman sound alike.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nwheres your crown king nothing?  this song is about greedy people who need everything. this song ROCKS!!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think that this song is more than a greedy person's tale.  The song probably refers to a person with sophomoric view on life; he thinks he is in charge.  He doesn't respect authority.  He's pathetic\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI think that this song is more than a greedy person's tale.  The song probably refers to a person with sophomoric view on life; he thinks he is in charge.  He doesn't respect authority.  He's pathetic\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ndamn king nothing....u think with yer name and everything u would be more precise...am i gonna spend my life correcting u!?!? jus joking around man\r\nIt is about somebodies who are obssessed of the struggle to own everything. \n\n\n", "comment_16": "\n\"King Nothing\" to me is a song about someone who is greedy.  All the material posessions in the world and all the things that person wants to control mean nothing.  \t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nwhat do thay say \"off to never never land\" at the end?\r\njust wondering\n\n\n", "comment_18": "\nYes they do Drumminggurl, it's a reference to \"Enter Sandman\" I assume.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nwow, did you bleep your self?  Cause they fucking don't do it for you, i think....\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nIrony.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI think what everybody has said makes sense. the part about the wanting of the star could mean that some people do want everything, even the unattainable, such as stars. But because many stars have died and all we see is light left over from many thousands of years, if not millions of years. So thinking of this \"star\" as a tangible substance is false, and then you discover that what you thought was real was fake and that you wasted time and your life on a mission to obtain nothing.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni think they add the off to never never land at the end.. because the song enter sandman is about people's worst fears and whatnot.. i think that in this song the guy's realization that he has nothing is his worst fear\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nIt's about political officers more specifically.\n\r\n\"dig for gold, dig for fame, dig to make your name\"\r\nthey struggle to make themselves famous\n\r\n\"just want one thing, just to play the king\"\n\r\nthis means they only want one thing, to become president(play the king, since the president isn't really a king, but holds power), and then the latter parts of the song are about their pasts catching up to them, causing a scandal, and causing their downfall, and all that's left of them is a name.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nthis song kicks ass!!! one of my favorite tallica songs. gotta love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is ace.Not Metallica standard,but still one of the best songs ever written.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\n\"Careful what you wish - you may regret it \r\nCareful what you wish - you just might get it\"\n\r\n- Well I think these lines says it all. The song is about being careful what you wish, 'cause the grass isn't always greener on the other side. There will always be complications, no matter how perfect a life can seem.\n\r\n\"I want it all, and I don't care how\"\n\r\n- If you say these words, it's bound to go wrong. You have to settle with what you've got, and make the best of it, 'cause things aren't always what they seem.\n\r\nA great song! I simply love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\ni think its basically been said by the people above me but i think its about trying to have it all and build it up to the future, instead of enjoying life. its an awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI think it may be directed towards Axl Rose.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\n\"he thinks he is in charge. He doesn't respect authority. He's pathetic\" aren't those all positive qualities? I mean, everybody should be aware that they are in charge of their own lives and confident about it. And why should anyone respect authority? No person is any better than the next, so I don't see why authority should deserve special respect. It's not pathetic, it's ... liberating. I think you're wrong about the song though. It is about greed and selfishness.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nthe songs about richard fucking nixon\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nForthelove sounds right about what he said. And the most sensible opinion goes to........ MrMojoRisin.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThis song is definitley about the Greek Mythology story King Midus(not Mitus). All he wished for is gold and thats all he wanted, he soon got a wish that everything he touched turned to gold. One morning he woke up and went to eat breakfest his food turned to gold and tasted like metal in his mouth. Although his arogance clouded him he continued on to say good morning to his daughter. When he gave her a hug she too turned to gold ceasing her life. His heart was shattered and his life ruined. He soon staved to death because everything he put in his mouth turned to gold.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThis song is definitley about the Greek Mythology story King Midus(not Mitus). All he wished for is gold and thats all he wanted, he soon got a wish that everything he touched turned to gold. One morning he woke up and went to eat breakfest his food turned to gold and tasted like metal in his mouth. Although his arogance clouded him he continued on to say good morning to his daughter. When he gave her a hug she too turned to gold ceasing her life. His heart was shattered and his life ruined. He soon staved to death because everything he put in his mouth turned to gold.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThis song is definitley about the Greek Mythology story King Midus(not Mitus). All he wished for is gold and thats all he wanted, he soon got a wish that everything he touched turned to gold. One morning he woke up and went to eat breakfest his food turned to gold and tasted like metal in his mouth. Although his arogance clouded him he continued on to say good morning to his daughter. When he gave her a hug she too turned to gold ceasing her life. His heart was shattered and his life ruined. He soon staved to death because everything he put in his mouth turned to gold.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nSelling your soul, only to be left full of emptiness.\n\r\nNow you wonder why you're left alone, with nothing.\n\r\nYou are nothing.\n\r\nMe likes Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\ni think the \"off to never never land\" is added because the similarity to enter sandman.. it sounds almost the same.. even when you play king nothing you might in a few seconds be playing enter sandman or vice versa..\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nhmm this reminds me of salomo or who was that greedy king ? from the past .. anyway> its says for me loud and clear that.. (not needed to be a king) it can be anyone every human: who only wants what he sees. blinded by it.. taking and no giving..and at the end ending up with nothing..they took the example of a king..but it can be you or me as wel\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nthis is one of my favorite metallica songs. It just sounds really cool when JH sings, \"where's your crown king nothing\"\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThank God figuroa got the King Midus reference in the song.  Yes this song is about greed and how it can destroy us and basically everone has figured this one out.\r\nHOWEVER!  ANYONE SURPRISED THAT THIS SONG IS WRITTEN BY THE GROUP WHO SUED NAPSTER BECAUSE THEY WERE NOT GETTING ENOUGH MONEY???  \"ARE YOU SATISFIED?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nim not sure if JeffGodofBiscuits has heard about what metallica took on napster over. it turned out that napster was selling metallica songs/albums over the internet and pocketing the money, and giving a few radio stations songs that had not been released on any metallica album/single. Ulrich now admits he took the whole thing too far, but i believe that he was within his rights to take on napster for theft of rightful income\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis song might also might be talking about a king that people create in their minds to worship, but when something bad happens, they call him greedy and evil, and strip him of his title, along with everything he's worth...  I kinda got a mix of both the meanings the first time I heard this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nMakes me think of Macbeth\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nanother song about the jews...\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nto smalltownpyro, u got a good point with what ur sayin.  its seems pretty much like what the lyrics really mean.  good job :)\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThis song is anout all these things previously commented... \n\r\nHaving built up his wealth and power he realises that upon his death there will be nothing to comfort him, no loving arms, or comforting gazes... wasted life... the castle will decay, the jewels pillaged and those who he pushed away regard his position with scorn... \"wher's your crown?\"\n\r\nany one who strives for power and wealth should ber force fed this song (in fact evry 1 shud cos it rox my sox!!!!!!!!!!!) and hear the consequences of their actions... materialism is doom...\n\r\npeace xxxxxxxxxxxxxxxxxxx\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nWhen I was in high school, I heard this song for the first time while I was reading Macbeth, and sometimes I still feel like this song is perfect for Macbeth...it's weird I know. It is a great song though, regardless.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nIts a kinda warning FOR me\r\n\"CAREFUL WHAT..................JUST MIGHT GET IT\"\r\nGREATEST WORDS WRITTEN BY METALLICA\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nActually this song, doens't only fit to greedy persons in history or some jews, or who ever, but it exactly fits you out there !\r\nWhat are you chasing ? In the end you are only a name, of to never never land !\r\nDon't waste your live to whishes, chasing things, building your castle, since it will crash finally.  This is nearly exactly that what Jesus said about where you should build your house and where you should collect your wealth.  Read the new testament and the meaning of this song will be perfectly revealed.  Or you will be off to never never land at last. \r\nAre you the king of your live, King Nothing, or who is it ?  Well, happy guy, you are not alone with King Jesus with you.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nin my opinion, best metallica song i've heard, and i'm not just talking about the stuff you hear on radio. i Love it!! its about people who live lies behind luxuries. if you take it all away they are a piece of shit. and when things do go wrong, they have nobody to blame but themselves.  anyway, all the superficial things have put them in a false sense of security and wealth. and its still not enough. they want more\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThis song is definately the best song on Load. It is about the greedy, and how money or fame do not buy happiness.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\ncoz king nothing is about, im my opinion, gaining material wealth and not appreciating what you have- always striving for more, the 'off to never never land' as a kint to enter sandman, is like saying...your king nothing. you have done this to yourself...and now your going to have nightmares over it...thats my opinion newho\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nTHE BEST METALLICA SONG EVER i heard it when i was like 6 or 7 and loved it but i did'nt know who played it then\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nits about a rich guy who has everything,than does something wrong and blames it on someone else\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nMetallica's best song overall.......In my opinion. many say its Enter Sandman or Puppets but King crushes them meaning wise..... One is a close second though.....\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nbtw, whitepride, this song IS NOT about the jews, fuck. how the hell did you get that idea?\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\n\"what does it profit a man to gain the whole world, only to forfeit his soul.\" mark 8:36\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThis song is about selfish greedy a**hole who at the end comes to realize that despite always getting what they want  dies miserable, due to always wishing the wrong things in life.  Sort of like a self prophecy for James hetfield and lars Ulrich.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nthis song is not so much about greedy, its more about power-drunk people that have no reason to be like that...\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nI think this song is about somebody who was greedy and got to the top. and everything went south. and he tried to put the blame on somebody but theres nobody to blame but himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nIn the beginning of the song. it sounds like a star falling to earth or comet, torch ect. The lyrics i want that star i want it now i want it all and dont care how. this meaning has to do with the falling star. the masonic star, the eastern star...read revelation ch8 verse 10-11...disney did know what he was creating in the wish upon a star verse...he is or was a mason of the highest order...these men after all do get all they wish for... power, wealth,fame... but for what price!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI left this band and the guys in the band are nothing but greedy fuckers I hope they fuck off and die because they all want to be king.......so glad to leave em in the dust so Torran, Mitch and Craig fuck off and die and get some VD while you at it!\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nWell I think this song is about AXL ROSE!\r\nThis opinion is mostly based on the line about the castle crumbling and being left with just a name- methinks a reference to Axl legally securing the rights to the name \"Guns n roses\" just as they were falling apart.\n\r\nA tenuous interpretation I know, but the Load album did follow that huge tour Metallica did with GnR when Axl was sacking band members left, right and centre so the timing is historically sound!\n\r\nWhat do y'alls think? It makes sense to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nIts about when his brother rises,the seventh son of the seventh son,the chosen one,the guardian,Jesus tries  to destroy him,the kingdoms have been searching for him for century's,the star referres  to the star of david,a series of planets used to control man.Jesus lost,and was cast to the earth,Jesus has to full fill a contract for the children he killed,\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nIts about a band betting against God\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nthis song could possibly be about dave mustaine claiming to make a band better than metallica after dave getting kicked then it turned out megadeath wasn't better than metallica so metallica is basically saying that dave accomplished nothing he wanted to do\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nIt's about greed, in essence. This song, in the context of James' life, is introspective, in this song James is \"King Nothing.\" James, essentially, is stating that he always wants what he doesn't have, and in the end, this means he has nothing. \n\"Wish I may wish I might,\nHave this I wish tonight\"\nJames is wishing for something\n\"Are you satisfied?\"\nJames questioning himself, saying \"how much is enough\" to himself\nthe next verse does much the same thing\n\"Dig for gold, dig for fame,\nYou dig to make your name\"\nJames saying he wants money, he wants power, he wants to be famous, he craves media attention, this probably was why he was so arrogant during black album era\nThe chorus does the same thing, but one emphasized line\n\"Where's your crown king nothing?\"\nJames king where his greed is rooted, or what he's gained, he also says \"off to never never land\" at the end, this is a reference to this occurring because of the hit success that is the black album, and the song's intentional similarity in order to drive home the point that the black album made him greedy\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nIt's about axl rose.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nthis song is saying that u should know what u are wishing for b/c it might come back to stab you in the back...\"careful of what you wish you just might get it\"...\"and it all crashes down and you break your crown\". i can relate to this meaning b/c i have hoped and wished for things and then when it comes...it doesn't come how i wanted it. (not meant to be a greedy saying...b/c we all wish for things for ourselves).\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\ninspired by the materialistic King Midas? a song about greedy people?\n\r\nyes....\t\t\t\t\n\t\t\t\t\n\n"}