{"comment_0": "\nA kitchen sink -- I feel like he's expressing that everyone has their own way of dealing with things and feeling some way.\n\nIn his inner circle, or his world, a kitchen sink means something specific...its his thing, and he believes everyone should have their own thing.   (I personally feel like a kitchen sink, for him, relates to the saying, \"everything but the kitchen sink.\" Referencing the kitchen sink being 'left out' and alone. So when he references that he is the kitchen sink, hes referencing that he is unique)\n\nClearly, the rest of the song is motivating.  A pick me up for other 'kitchen sinks.'  \n\n'leave me alone,\nDon't leave me alone'\n\nWhen youre in a spot like this you might confuse yourself and say you don't need people.  But youre really just screaming for people to see you and appreciate you.\n\nFind purpose in whatever you can.  Don't worry whether youre good or bad at it, just do it, and like he says, 'you'll see purpose start to surface'\n\nThats my take anyhow.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nTyler once said in an interview about this song that it is about thinking about what the point in life is and why we are all here and the reason why \"a kitchen sink to you is not a kitchen sink to me\" is, Tyler said, something happened to him at a kitchen sink, like he realized something very important in that moment at a kitchen sink. he did not specify what happened but i feel like it was something personal, for example, the point for his life.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nReally? No one has commented on this song? Kitchen Sink is one of my most favorite songs.\r\nI wish people would listen more to these words than the meaningless crap that is poured into their ears everyday, by people that claim to artists. Anyways, I think it is pretty self explanatory, only I wonder what event may have taken place at his kitchen sink. A game of monopoly to you, is not the same to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nYou are unique and nobody knows what you know or can do what you do, and for that reason, you should stay alive.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIn the interviews 'twenty one pilots in 21 minutes' Tyler tells us that a kitching sink can be anything. Something personal that only you understand. For example an object that symbolises something. For Tyler that object is a kitching sink. \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nBasically everyone is unique no matter what people say. \n\nTyler then says that if you're searching for purpose, you need to do something with your life: whether it be drawing, making music or whatever. It can get rid of your bad thoughts and depression.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nWell... what I think is that when he says the words \"leave me alone.. don't leave me alone\" is like when you want everyone out of your life, but you want that one person to notice when you say your \"fine\". It's like when you want to be left alone when you say \"im fine\" but you want that one person to notice you're lying. \r\n     Something else I noticed, when he says \"a kitchen sink to you is not a kitchen sink to me\" is that we find our own meaning in things. We all have different ways of solving things.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nWhat I originally thought of with this song that brings me to tears is the people I know and knew who struggled  with suicide and their inner demons.  When they would push me away when they needed help the most. This song is so powerful to me about finding purpose in life.  \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nSometimes when I'm feeling trapped in a rut or overwhelmed with responsibility or especially feeling loneliness, with no one I feel comfortable opening up to, I just feel the desire to create something to express myself. Whether it's writing my thoughts down, painting, etc., I find that that piece of expression becomes a meaningful part of coming to terms with my personal trials, even though my work is nothing I'd be comfortable with even showing to others.  \n\nWhat I really appreciate about this song is that Tyler is saying that he had a personal experience with a kitchen sink, and though that might mean nothing to us, it means something to him, and that's what's important. He's saying that we should find something to express ourselves, have personal experiences on our own that we can hold sacred to only ourselves. \nWe're living in an age where it's easy to be on screens all the time, but instead of spending all our time consuming media, it's much more fulfilling to create and find meaning in those things.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nConsidering the song was written for suicide squad...\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nTyler joseph seems to be stating what i agree with,and that nobody can ever say that they understand. \"...they will play a game and say they know what you're going through...\" because we all have different perspectives because no two people are the same.  He also stresses the importance of finding purpose, because purpose gives you a reason to go on, and purpose is found by creating something that only you can understand. (Tyler explains this in an interview, witch you can find on YouTube. ) this song inspires me to create new things everyday,whether it is art or a poem,and to help others find purpose. Stay alive friends l-/\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think that the kitchen sink represents the songs of twenty one pilots. \"You don't know what that means. Because a kitchen sink to you is not a kitchen sink to me, okay friend?\" Their songs can be interpreted in so many ways, they help people cope with depression or any struggles in life. I think that Tyler chooses a kitchen sink because it is quite a random item, representing the diversity of the lyrics in their songs. \"Are you searching for purpose? Then write something, yeah, it might be worthless. Then paint something, yeah it might be wordless.\" This represents what Tyler did. He wrote songs and he says it gives him purpose. \"No one else is dealing with your demons meaning maybe defeating them could be the beginning of your meaning, friend.\" This again explains how you can interpret their songs in different ways. He says that his song a might help you through certain situations and you can find your \"meaning.\" This is how I interpret the first part of this song. Thnx!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThere's a bit of a debate between fans about what the lyric actually is,\n\n\"I'm a kitchen sink\"\n\nor \n\n\"At my kitchen sink\"\n\nHe said something significant happened to him at a kitchen sink, and from the way I hear it, I honestly used to think it's \"at my kitchen sink\". But then what he said about it being something that only he knows the meaning of, how everyone kind of has something like that, it could also be \"I'm a kitchen sink\". Either way, nobody knows what it means, regardless of which it actually is. The best part is that nobody can actually tell what he is actually saying. So many people say they hear one of the lyrics or the other. I personally always sing \"at my kitchen sink\", and that's just what I hear and what it means to me. But to others it's something else. And I think that's really beautiful and clever, whether he meant to do it that way or not. Knowing him... he might have. He's real clever.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI believe this song is about bein. Different from everyone else and feeling left out. And it seems you're left out and nobody cares what you think or do and because of that you want to be left alone to deal with your own demons, but at the same time you have to embrace your differences and love what makes you unique from the whole world and at the last verse \"don't leave me alone\" well it's self explanatory you don't want to be alone and you don't and shouldn't be pushing others away because of your inner demons.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\na kitchen sink is an average household item. no one thinks much into it. no one cares about it unless they're in need to use it. so i think by \"kitchen sink\" tyler is reffering to something he cares about that others may find useless. such as the lyric \"a kitchen sink to you, is not a kitchen sink to me\" meaning that item means something to him but others couldn't care less about it. possibly a person because it says \"don't leave me alone\" and he sort of sounds like he's talking about a person but i'm not sure. \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI think we can easily understand that this song is about the fact that everyone is unique by his thoughts and his way to intepret his environment.\n\nBut the story of the kitchen sink, we can precisely only interpret it on our way, but, as he says \"a kitchen sink to you is not a kitchen sink to me\", never on his way, so all these attempts to interpret his song arent very useless.\nMoreover, as no one can understand well what he meant, maybe he don't even really knows what he wanted to say deeply by \"I'm a kitchen sink\", because his inconscient has certainly helped him writting these lyrics, because they are hard and on a way, abstract, because everyone can understand it differently.\n\nI don't know if I express myself clearly, but I hope you understood some things and I hope I could help you...\n\nThis song is both simple and extremely difficult to understand ; it his brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nso basically when tyler was younger (its rumored) that he tried to hang himself, and one of the ways to hang yourself is from a kicthen sink, so that is why i think this song hhas a special meaning to him because thats when he realized his life has purpose\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nOk ok I think kitchen sink...well atlest to me it means that only people who self harmed before will truly understand this song. When you self harm you out your arm over or in a sink. I guess when tyler was speaking of that \"special\" thing happening to him maybe it was the last time he harmed himself and he was very proud of himself. I know this is probably wrong but I'm in my point of view this means A lot to me...\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ni read something on instagram saying that tyler suffers from anxiety, depression, suicidal thoughts/actions, etc. he said one time when he was younger, he tried to hang himself using his kitchen sink, by tying a rope to it and leaning forward. | is the sink - is the rope / is tyler |-/ is associated with this song\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nHe said something happened to him at the kitchen sink. If you look at the bands logo |-/ in color. It makes since to see that he is washing blood from his arm down the kitchen sink. The blue is for water. The red is for his blood. \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nSo, this may get pretty deep. The other day, my friend told me that this song and the bands logo are related. She had put together the pieces and found out that you can actually hang yourself from a kitchen sink, hence the name of the song. Its obvious that Tyler has gone through depression and probably thought about this way of suicide. If you look at the logo, it kind of looks like a pole and the slanted line is tyler or someone else. The line in the middle is a rope. So the logo looks like someone hanging themselves from a kitchen sink. She and I may be way off but it seems pretty plausible.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nTyler said in an interview that something important happened to him at a kitchen sink, and I think what he was talking about was he tried to kill himself at a kitchen sink. There is a way to kill yourself by rather hanging yourself from the ceiling, you tie a noose to the kitchen sink and lean forward and choke yourself. In the kitchen sink logo(|-/), the | symbolizes the sink, the - symbolizes the noose, and the / is Tyler attempting suicide.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nyoutu.be/…\n\nOnly Tyler knows what happened at that kitchen sink, so if he weren't here anymore, no one in the world would know. He created this song, his artwork that only he understands, to help himself find purpose, a reason to exist. The song is about creating that for yourself, finding something you and you alone understand to help you find the beginning of purpose and a reason to stick around. \"Are you searching for purpose? Then write something, yeah it might be worthless. Then paint something, yeah it might be wordless, pointless curses, nonsense verses you'll see purpose start to surface, no one else is dealing with your demons meaning may be defeating them could be the beginning of your meaning, friend.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\n<3 Everyone is unique, no matter what people say ... Clearly he asks us to accept each other without restraint, just love.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nkitchen sink. one of vessels best songs. Tyler talks about how a kitchen sink has a significant meaning to hi,. How a kitchen\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nsink to us is not a kitchen sink to him. the line \"empathy might be on the brink of extinction\" is brilliant. I've always found empathy to be a really difficult feeling. trying to think and feel how someone else does is almost impossible. tyler is saying that it's hard to think and feel like someone else. we all have different feelings and reactions. we all deal with stress, heartbreak and sadness differently. we are all different. and that's what tyler is saying here when referring to his kitchen sink. the kitchen sink resembles his experiences and when he says our is different, it means we all experience different experiences, no one is the same.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nKinda funny, but a kitchen sink is a symbol for me too. I almost died at a kitchen sink. I was bleeding out of the inside of my throat, and my best friend was there yelling at God to please have mercy on me and save my life. My parents were gone somewhere, and didn't answer the phone. So my best friend called my older brother, who answered and got a hold of the police. I barely survived, but I always have flashbacks when I look at a kitchen sink, or hear this song.\n\n\n"}