{"comment_0": "\nThis song and video exemplifies a coping strategy to emotional abuse. \n\r\nParticularly child emotional abuse, where the caregiver who is actually supposed to be responsible for the child's development and growth, will instead \"spit venom\" \"hiss and preach\" and is also a hypocrite (\"when your words mean nothing\"), the child needs to find a healthy way to get away. This is seen in the music video: youtube.com/…\n\r\n\"I'm gonna drown you out before I lose my mind\"\n\r\nChildren who grow into adults while holding on to the abuse as true (e.g. thinking they deserve the venom and hissing, and the caregiver's hypocrisy is somehow correct), will indeed become crazy. \n\r\n\"If my heart can't stop it, I find a way to block it\"\n\r\nIf the child can't stop the pain coming from this abuse, they will drown it out with a simple ritual. What's so sad about this song is how inane and childish the \"la la la\" sounds--when I first heard this song, I only heard those words, and thought it was so silly and clanging. It was only after I saw the music video and researched the lyrics that the pain and beauty of this composition reached me. Indeed, the blocking and fighting back towards this abuse with the child's singing, is what stops the cycle of abuse.\n\r\nBelow adapted from the Wikipedia article on the music video (en.wikipedia.org/wiki/…:\r\nAccording to Jewell (the director of the video), the video is about a Bolivian oral legend... a boy he discovers he has a talent for perceiving the problems of people whom he can heal by giving powerful screams like an earthquake or a tornado... he found a disfigured man who was abused and discriminated against by society. This man reveals that he is a prophet cursed by a demon, El Tio, because he stopped adoring him and left the community because it was inhabited by this demon. El Tio is considered the lord of the underworld, to whom mortals give offerings for protection or to soothe his anger. The prophet said that anyone who listens to the devil would fall under his control and that he lives in the desert, where once there was a city that adored him and received a curse, which caused everyone to commit suicide. Together the boy and the old man head towards the residence of the demon, until they reach a mine. There, only the child must deal with the devil, because anyone with intact hearing could be cursed. With his cries he could stop the spirit from cursing other people. The story in the video is unresolved, since the child is left facing the demon, while his companions have gone away.\n\n\n\n"}