{"comment_0": "\nTo me this song seems to be about the loss of a loved one and how nothings the same without them, but that feeling is hard to explain. It also seems like the death might have been expected and discussed since smith says, \"you told me not to cry when you were gone\".\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think this song is about the heartache that comes with losing a loved one and just missing their presence in your life. It may have been a foreseeable departure in this case. I think he's portraying that you can mentally prepare for it but emotions aren't so easy to control.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\n6 months ago I had to leave the country and also leave my boyfriend. When we started dating we knew that I was leaving but we said that we would be prepared when the moment came and we would just break up and be friends. But it was not that simple, I just miss him so much, we talk everyday but we know that I'm not coming soon, we would have to wait 6 o 7 years to be together again and being in a relationship with so little hopes is too hard. He said that he didn't want a long distance relationship because he had one before and it turned out wrong. But we're having a long distance relationship despite that fact, even when we haven't said so. It's terribly hard to leave behind the person you love. And I hope that one day I'll be there, where I was, right next to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nTo me, this song does seem to be about the loss of a loved one, but not a literal death. The music video provides more insight to the writer's meaning. The death and funeral symbolize the end of the relationship, which can often feel like a death.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nAt first I thought this song was about a breakup and then once I actually listened to the lyrics I realised its about losing someone in general. Some songs on Smith's album are really great with having ulterior meanings.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song relates to me when I was in a long distance relationship. I missed him so much and not being able to be by his side was torture. I waited for the day when I could be with him in the same town but we realized that was probably never going to happen.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nWhat's in my mind when I listen to this song,\n\nBaby,\n\nYou seem so close even tho you're so far away, it's like I can touch you but really all it was just a shadow. You're gone, I know that I have to accept the fact of not being able to be with you. How much I miss you say 'I love you' near my ears, you're breathing so close, your heart pound so close that I can feel you - feel you close and closer.\n\nI'm screaming, baby, I'm kicking myself remembering how much time I have wasted not being with you. I'm crying, louder and louder, can you hear me when I call to you? How can you when you're so far away.\n\nAre you alright? Are you taking good care of yourself when I'm not there with you. You're like an angel that I can feel your presence but I can't see you, how I wish I could see you.\n\nRemember when I lay down beside you and how you would hold me tighter and tighter? If I could and I would, do whatever I can to see you.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song is about a relationship that ended. It could be that the woman was not ready to be in a committed relationship or she had to leave him for x reason. He believes that one day they will be back together. When she broke up with him, she told him not to cry when she was gone. Life doesn't make sense without her and he misses her. He wants to let her know how hurt he is from her decision of leaving him and how he wishes he could be back together.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nGah! I commented on the wrong song. THIS is a great song, not the one I previously commented on..\t\t\t\t\n\t\t\t\t\n\n"}