{"comment_0": "\nThe first time I read the lyrics to this song I thought they were condemning Christianity and religion in general, now that I reread them, however, they seem to be talking solely about corrupt churches with corrupt ministers, and not condemning Christianity as a whole. I'm suddenly reminded of hearing a story about how sometime in the 80s there was a preacher saying that God told him he would die if he didn't get one million dollars from his church. Ozzy Osbourne then sent the preacher a gun.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe song, according to an interview with Metallica in the 80s, was written as a direct outcome of the televangelism scandal, where millions were given to two ministers who used it for their own personal gain rather than that of the church. The song reflects the control that religion, in specific, the Christian Church, has upon millions of people. They blindly follow their preachers and the story of a man who lived two thousand years ago, doing whatever their abstract lord says. I could go on with this for hours, but I won't, as this is not the place to do so. I was a member of the brainwashed elite for quite some time, but I've been questioning for quite awhile. A year or so ago, I left the Church and all organized religion behind and became agnostic. It remains as the best decision I've made in my life. This song reminds me of the chains I left behind.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nActually, according to one site I visited, It was about all these \"other\" so-called \"religions\" that make you think that you will be \"saved\" and you have to pay them to join and it's really all bullshit 'cuz they money is all there after.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nTraditionally, a leper messiah was someone who was brave enough to preach to the lepers. Leprosy was feared greatly and lepers were ostracized and sent to live by themselves. Most priests feared these colonies and refused to have anything to do with them.\n\r\nIn context of these lyrics, the phrase takes on a slightly different meaning. Metallica, specifically, uses the phrase to refer priests and preachers who use religion to appeal to those who feel disenfranchised and alone. However, they don't use religion to make these people feel better, instead they guilt them into donating money. The term is not used with fondness in the lyrics. Most people see these fly by night preachers as little better than con artists. \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nMetallica is my favourite band, even though I am a Christian, which some people may find hard to believe. When I heard this song and \"The God That Failed\", I wanted to know why these songs were written, whether they had meaning or were just sticking their finger up at God. When I found out what the song \"The God That Failed\" meant, I felt quite bad as I felt I wrongly judged them. The same with this song, I thought it was taking the pee out of Jesus, saying that he was wrongly healing the lepers, now I know that it was about the       false prophets, I feel better about the band.  \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIf you are an atheist, or agnotic, please read this and honestly give it some thought...\n\r\nYour belief that there is no God, or belief that there is nothing, is just as much of an act of faith as a Christian's belief IN God.  Just as a christian cannot \"prove\" the exitence of God, an atheist cannot prove that there is NO God.  Are you 100% sure beyond a shadow of a doubt that there is no heaven, hell, or afterlife when you die?  Have you been dead?  You belive whatever you believe based on faith.  Faith that you are right.  Faith that whatever knowledge and facts you used to ascertain your conclusion is correct.  So there is no need to call anyone \"mindless\", or \"morons\" for practicing their faith, when that is exactly the same thing that the atheist is doing. Do you know everything there is to know?  If so, you would know the intimate details of the sex life of Napolian's great-grandmother's black cat's fleas.  With that as a baseline, would you say you maybe knew 1% of everthing there is to know? or even 1% of 1%?  I'm just saying it would be good that you be pretty knowledgeable before you go betting your eternity on what you know, or worse, what you don't know.\n\r\nIf you're a logical thinker and an atheist, I challenge you to read, \"God doesn't believe in Atheists\".  It's filled with logical examples like this. Atheists are nothing if not logical thinkers, and this book really appeals to that kind of reader.  In fact, if you are not quite sure what you are sure of regarding your belief in God and would like a copy of that book, email me at gsjones1234@gmail.com with your address or po box or whatever, and I will buy a copy from Amazon and have it sent to you, no questions asked.  If only one person receives the greatest gift God ever gave us through this, then it will have been worth the money. \n\r\nFor the record guys, Christianity is not about thinking you're better than anyone, or judging anyone for their sins, or trying to gather up $ from mindless masses.  PEOPLE do that.  Jesus did not like organized religeon for this very reason.  It's not God's fault when humans do evil in the name of God.  Don't condemn yourself to an eternal life away from God because you associate Him with the evil that men have done in the name of religion. \n\r\nWe're all sinners. It's human.  You can't be a good enough person to just go to heaven because you're a good guy.  It doesn't work like that.  That is not a good \"fall-back\" plan if you happen to be wrong about the whole atheism thing.  Have you ever been wrong about anything?  As much as heaven is a real place, so if hell. You need to be right about this.\n\r\nThe good news is that it doesn't cost a thing.  No payments to the \"Leper Messiah\" lol.  You just have to repent, and believe.  That's it.  Free as the air you breathe. Pretty good deal, especially when you consider the alternative.  It's all in the book mentioned above.  I was serious about that offer if anyone is still reading this board.  Maybe you're reading this for a reason.  I did not plan to come here to write all this.  Just seemed like there was a surprisingly large atheist majority here to speak to I guess.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song is not anti-god.  It's just about the corruption of religion.  God is a personal thing that some people choose to have faith in.  Metallica is talking about evil people who exploit the concept of god for personal profit, turning it into a business and a way to control people.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthis song is about fake priests that preach fuckin shit and just want your munay\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nAwsome song, i disagree with some of you guys ranting ^ , i think religion can be a good thing as it hides the truth from people and, as we all know, ignorance is bliss. (you never see a sad fish)\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni agree with you friskitty. you are right about the fact that these 'holy wars' were fought for greed for money and power, but religion has been used as the 'motivator' for all the wars i mentioned. thats why i mentioned them.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI really thought this entire album was about drugs.  The Master of Puppets being drugs.\n\r\nI feel that this song's comparing the drug industry with religion.\n\r\nI don't know, just my view of it.  Maybe it's because I'm Catholic and don't like to be viewed as a greedy false-worshipping fool.\n\r\n:D\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nItÃ\u0082Â´s \"Join the endless chain, taken by his glamour\" not \"taken by this leper\".\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nLeper Messiah speaks of the way \"sheep\" follow religion, well, religiously. And, apparently it's \"rotting their brain, with blind devotion\"\r\nLook deeper into the lyrics. There is very powerful, symbolic references you can decipher yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nA local minister is an unwitting part of the Christian juggernaut.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthis is about the church controlling everything and taking you for everything you have by scaring you with eternal damnation if you dont follow their mindless slavery\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni agree with King Nothing on this one\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI donÂ´t think itÂ´s about fake priests, but fake religions whose principals just ask for money, they are the lepper messiahs!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI'm with King Nothing. This song brings to mind those Televangelists who \"heal\" people, yet they charge you tons of money to go to their show. And if any of you want to defend thme by saying \"it's God's work,\" did Jesus take a dime when he healed people, back in the day? \t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ni think he's making fun of hour of power hahaha\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nWow.  He's making a direct joke at the religions which make you pay for healing.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni am an athiest; i have no religion but i think anyone who goes to church or reads a bible and actually believes all that bullshit is crazy. If you stop and think about it, religion is bullshit. we are born, we live, and then we die. the end. Hetfield is totally right, you don't need to pay anyone. you don't even need to listen to anyone, is what i think. why should you believe what someone says just cuz they are called a priest and think they talk to \"the lord\", who doesn't even exist ? I don't get it at all. well there is my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nim in the same boat as u TheExile and feel the same but now metallica is my religion.peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni think of this song as describing the popular bastards at high school.  worship them and you'll be taken down into a miserable future\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nGood song. I never really knew it had such a meaning, but I as well have to go w/ King nothing\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ni think this is about the time of corruption in the catholic church, around i think it was the 1600s where they would actually sell places in heaven.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nOn what the song is about, I'm 100% with TheExile. It's about televangelists and there promises of a life in heaven if you make large contrabutions to there bank account and buy all their merchandice. I'm a christian and I still think it's a great song. It's the song (Next to master of puppets) that made a part of the metal militia.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ni myself am a catholic, however im not particularly proud of it. the history behind us is too corrupt. i think this song has a great meaning, i mean even the most strict of catholics would have to agree that the church back then was incredibly corrupt and greedy. top song, third fave on the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\ni think this song is talking about false leaders who con their followers into giving them money.  they get them to give them money by bribing them with heaven.  i'm not too sure about religion in general.  if someone could prove it to me i'd believe it but until then i think its a load of shit\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nWOW!  RawCore, buddy, what put all that hatred into your heart?you couldn't have always been this bitter.tell me, is it just christianity that you hate or all religion in general?  You are aware aren't you (what with your superior intellegence and all)  that atheism is actually a form of psychological repression. I pity you. it can't be easy to live with such hatred.\n\r\nNow on to the song- I feel that this is a great song (hell they all are. Metalllica rox!!) i have to agreee that this song is about televangelsits whose only god is money and whose only \"jesus\" is themselves.  That they lead ppl astray in their quest for fame, power and greed is unforgivable. Ultimately however, the joke will be on them. No God -from anybodies religion- will condone their evil acts.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI just have to say im with King Of Shit. (and also you never see a fish sad because they have like no memorie span, they can't be sad over something they dont no)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song is about the televangelist scandal in the 80's, mainly the Bakker's, it's one of my favorites off of 'Master...'\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThis song is about the televangelist scandal in the 80's, mainly the Bakker's, it's one of my favorites off of 'Master...'\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nthe line 'need your Sunday fix' is the give away that this song is an attack on the money-for-religious-bullshit-preaching. i was approached by one of these people. i told him to go rip off someone who will believe his bullshit and donate to the 'charity' of the catholic church.\n\r\nit's also amusing that jesus, and the bible preaches about love, co-operation, peace and happiness in the world...but the catholic church can be held responsible for a huge number of deaths since its formation. all roman conquests, the crusades, the witchcraft debacle, the spanish inquistion...and the list goes on.\n\r\nanyways, great song, ROCK ON METALLICA!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nto venu rm1286:\r\ntechnically every so called \"holy war\" that has ever been fought has been fought for greed of money and greed for power. God has had nothing to do with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThis song might be about the King of Jerusalem during the Crusades.  I don't recall his name...but something makes me think it was King Baldwin.  He had Leprosy.  Just a theory....\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nHave any of you ever heard of indulgence...? The date is around 1000-1200 a.C., Southern Europe and the Italian peninsula, the Curch is an emerging power and is the awaited solution the the power gap created by the dark age invasions in the centralized monarchies of the old world. What happens is that the Ecclesia or church shifts from moral guide to a political power, and this implies the creation of a pontificial fiscus... Taking advantage of the fact that Faith is an essential component of the medieval mentality and behaviour, the church spread the concept of indulgence, or the ability of \"bailing\" someone out of purgatory, directly to heaven, thanks to a sum of money donated to the pope... here begins the process known as the fusion of pure religion end fate with the teachings of a church lead to growing corruption...\r\nI'm sorry i went through all the history, but in order to understand the meaning of leper messiah, some things must be specified.\r\nthe song is beautiful and the subject treated is serious and brings us to examine our own personal conscience.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI agree with UnforgivenII.\r\nBad-ass song.\r\nMustaine claims they stole this song from him when he was in MetallicA, but I think that's bullshit, considering Mustaine had plenty of time to use this great song before MetallicA released Master of Puppets.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nto venu_rm1286: \r\n\"religion has been used as the 'motivator' for all the wars i mentioned. thats why i mentioned them.\"\r\ni'll give you that. \r\nalso were you referencing th current iraq war as well?\r\njust curious\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nto friskitty:\r\nthe iraq war is not part of the list because religion was not used to 'justify' the war. bush gained support for the war by inciting a fear of saddam hussein in the american people. here's evidence: after 9/11 3% of americans believed saddam was linked to the hijackers. by the end of 2002, following the case made by bush for the war, more than 50% believed that saddam was personally responsible. i read this from the book 'imperial ambitions', a series of interviews with noam chomsky, a guy who says that all US presidents, including george washington, can be charged with war crimes\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nRawCore, what is your problem? Whining like a twelve year old girl \"religion is BAD, it's STUPID...\"?? Do you really think that people who are religious will change their minds and stop being religious just because of your stupid whining?\r\nIf you know how to be religious it is something that fills your life, it is something that gives your life a value. My religion has prevented me from killing me about 10 times the last ten days of my life. So it really pisses me off when people talk like that about things they don't even understand.\n\r\nAnyway, I like this song, especially the very originative beat. And the lyrics are very cool as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nFriskitty first off believing in religion is all so a psychological defense mechanism more so than not believing.  I am not forcing anyone to agree with me nor do i wish that you change your religion but i can't seem to understand how people can so blindly follow a compilation of documents that are misinterpreted and can so easily b e fabricated.  Not  to mention church and the seperation of them is the most unchristian thing i have heard of.  Is Christianity not about unity and no judgement?  There are hierarchies within churches and everyone judges each other it's horrible.  Christianity teaches great things but i believe that there is a better way to spread an idea than scaring the shit out of people just so that they will follow your brain washing.  I highly suggest that you read the bible yourself and interpret it yourself and fear not whether you are going to hell or heaven.  If you can seperate yourself from the blinding incompetence and hypocricy of church i think that you will find that you are a better christian for it.  Hmm and what the hell is the bible to judge other religions and decide that they are inferior.  Sorry just a little rant:)  But this song is so obviously about televangelists and that dumbshit on the 700 club that called for the killing of someone.  Ha ha ha stupid hypocritical bastards.  Hippies had the right idea!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nOh yeah and  in the words of the wisest man,  Is it true that even god himself can heat a burrito to a temperature that even he himself cannot eat it?  Ask your damn bible that!!\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nHere's something else the song could be talking about: chaim.org/… \n\r\nRead it. Interesting.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\n\"Atheism is actually a form of psychological repression\"\n\r\nThat has go to be one fo the most ignorant statements I've ever heard.  It's typical of those types or follow religion or other peoples ideas blindly because they can't think for themselves.  Try to find a psychologist or psychiatrist out there that separates religion from his or her work (aka a real psycologist or psychiatrist) that actually believes a ridiculous statement like.\n\r\nThis is good song. It's hard to tell what Hetfield was acutally thinking when he wrote this, but it goes with the whole theme of the album.  Almost every song on the album talks about letting others (people, religion, society, etc.) dictate your life and beliefs for you and doing everything in your power not to let them.  It's a good way to live life.  We all have a mind and heart that has allows you to think and feel for ourselves and it feels great to do so.  It's the key to a happy life without living on the crutches of others around you.  \n\r\nThe real psychological repression is being afraid to make your own decisions about your own heart and mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nJaymz's dedication:\r\nOnce on tour James sarcastically dedicated the song to Jim and Tammy Fey Baker, two TV evangelists who embezzled millions of dollars of charity money. \n\r\nThe subject matter:\r\nIt is about so called messiahs who make a good profit on other people's faith. \n\r\n\"Send me money, send me green\"\r\n\"Heaven you will meet\"\r\n\"Make a contribution\"\r\n\"And you'll get a better seat\"\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nthe steryotype of a christian... someone who is always up at 6:00 ready to go to church. B.S.!. Many people think you have to go to church to be a christian, or never sin, which is impossible. All God wants is you accepting Jesus Christ as mankinds saviour. You dont really have to do anything... except get martyred. Just kidding. Basically this song is about all the \"churches\" making you pay for your salvation.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI feel that this song is condeming religion in general. I used to be a Christian until I began to understand a lot of what is being discussed in this sont. I feel that religion can help a lot of people, but that it is a control mechanism. \n\r\noh and a great song in meaning and sound, my favorite metallica song.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nHey, Wasnt this the song Megadeth's Dave Mustaine claimed was stolen from their \"The Hills Ran Red\" or summat?\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\n*COUGH* Scientology *COUGH*\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nHaha!!\n\r\nGood one, YourNameHere117\n\r\nThat one didn't occur to me, but it makes good sense\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nkinda reminds me of second baptist church here in houston.\n\r\nthey would make you pay to go like God was some sort of corporation.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nIts about Tele-Evangilists that say that salvation is an easy payment away, when really it is obviously a scam to get your money. It is believed the death of Jame's mother, like The God That Failed, had an influence on this song. In that case, this maybe be a reflection of Jame's failing faith because of his mother death and the fact her religion discouraged medical treatment.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nDavid Bowie - Ziggy Stardust\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nMnementh - in two sentences you manage to protect your beleif and condemn other's using the exact same technique... something doesn't work out there. \n\r\nthe king of shit, you have no idea what being christian or catholic is about. money donated by followers is from their heart; attending church is free, sacraments are free (all that is payed is hire for the time used in the church). if someone says that my god \"told them to collect money\" they're lying and going to hell for manipulating a religion.\n\r\nAthiest, or any religion, is fine as long as you're not saying to other people \"your religion is a lie!!\".\n\r\nThe solo and the interlude before is one fo the best i've ever heard, palm mute works perfectly.\r\n(sweep picking looks so cool!)\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nits about dictatorship\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nHetfield hates religion in general after his mom died of cancer (his parents were believers in Christian science) and he thought medication might have helped her.  This song is stating what is wrong with the whole concept, and more specifically corruption in the church systems.  My least favorite song on MoP, but MoP is my favorite album ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\ni think there are 2 possibilities for the meaning of this song. \r\n1. it could be about the whole scandal with james bakker in the 1980's. (he was a tv evangelist, go to wikipedia)\r\n2. the belief that a christian has to go to church every sunday to go to heaven, which james might think is just so the church can collect some cash. and the \"leper\" may be the widespread belief of that.\r\n\"spineless from the start, sucked into the part\"- being introduced to this belief, before u knew any better.which may apply to james.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nthe meaning is right in their, its bout all this televangelism bullshit and how gulible people can get when they touch the topic of faith and the matter of if you go to heavEN or hell etc,\n\r\nTHIS SONG FKN ROCKS\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThis song is about Televangalists who say they can get you into heaven if you pay them.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nSOMEBODY ANSWER THIS! : What is the soft-spoken phrase that isn't in the lyrics, but can be heard towards the end of the song?\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nStill answer this please ^^^. Anyway, your all dumb, lol. This song is about someone (in the literal example an evangilist) who tricks foolish people into giving him what he wants. That's the meaning of the song and I know that for a fact. It is not an anti-religion song. That said, a minister could enjoy this song without feeling guilt. And BTW, The God That Failed is not directly anti-religion either. So enjoy you nice little church boyz. Anyway, will someone intelligent please answer my question if they know the answer?\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\n\"your all dumb\" - hmm. ironic. \n\r\nAgain, answer my Q please ^^^\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nPersonally, I think this song is about everything that's wrong with Christianity. The church doesnn't care about saving your soul, only about sucking as much money out of you as possible (Send me money, send me green/Heaven you will meet/Make your contribution/and you'll get a better seat).\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nu can hear someone say something at six seconds before the song ends does anyone know anything about this?\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nyer but think guys im against religion but christianity and other religions have inspired people to help others. i may sound preachy but u know.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI told gotthelife about the whisper. True strory too. And also, I have a larger penis than George Cornwallus ever did.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nI think you are all missing something important.  The fact the religious leaders milk their flock's for money is pretty patently obvious, but I think there is more to this song then this.  I think it is also about Iconic musicians/clebrities who use their charismatic pulpit to do the same thing.  The reason i suspect this is the fact that the name of the song comes from one of the last lines in the David Bowie song \"Ziggy Stardust.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI think it's pretty obvious if you just look at the lyrics. The song is not attacking Christ or his followers, but any body or entity that uses his story/name for their own personal gain. Yes all religions threaten you with Hell and reward you with some sort of Heaven, but not all of them do so for the personal gain (specifically \"money\" and \"green\" in the song) of the leaders. As \"TheExile\" said, they told us in an interview that it was written in direct reaction to evangelists who used money for their own interests.\n\r\nYou could state your own opinion of religion if you rly want, but if you dissect the lyrics and consider the interview it's not rly necessary.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\n\"it's also amusing that jesus, and the bible preaches about love, co-operation, peace and happiness in the world...but the catholic church can be held responsible for a huge number of deaths since its formation. all roman conquests, the crusades, the witchcraft debacle, the spanish inquistion...and the list goes on.\"\n\r\nYou haven't realized that EVERYONE does this?  I freaking hate people who blame this on religion.  You're just proving the fact that EVERYONE NEEDS A SCAPEGOAT.\n\r\nAll throughout history, with or without relevance to religion, everyone's blamed everyone on a minority.  It's not religion.  It's mankind.\n\r\nSorry to rant.  Anyways, now I'm pretty sure this song's about the televangelist scandal.  The lyrics make perfect sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nThis is my exact feeling towared the church. \t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nits actually about scientology, and im not wrong this is what it really is, but ive read your stuff and its interesting what you all think of this song\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nIt's about TV 'messiahs', preaching religion, performing 'miracles' and demanding money and more money from their unsuspecting audience.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nThis song is way too epic to be about something lame as religion. It MUST have a second, deeper meaning. \t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nObama is the leper messiah.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI agree about how the song reminds us of when the Church sold indulgences to cover penances for sins.\r\nAlso, remember, Jesus threw the Money-Changers out of the Temple.  (Also that Temple is Synagogue).\r\nAlso, that Martin Luther was a Catholic priest who \"reformed\" the Church to get rid of this.\r\nHowever, Luther condemned Jews to hell for not believing that Jesus was the only Son of God.\r\nIn Judaism, Every man is a Son of God, and every woman is a Daughter of God.\r\nDuring the 1930s and '40s, the Nazis used Christianity, Luther's book on Jews and the fact that Marx was anti-semitic, although he wrote the Communist Manifesto, to persecute Jews.  Nietzsche says that Christians think that if you don't believe you are going to Heaven for believing in the Resurrection and return of the \"Messiah\", then you are making an error \"in psychologicis\".  Nietzsche also says that all priests are parasites.  Christians, in general, I have found, think that they are \"better\" than other people.  In particular, the Nazis thought that the Aryan race was superior to all other races.\r\n  In a funny, strange, reverse twist, the anti-christians nowadays, like metallica, think that they are \"better\" for not being christians.\r\n  Actually, Nietzsche talked about the \"re-evaluation of all values\", where the Jews, by resenting the Nobles, who held them as slaves, wanted to destroy the Nobility, so they decided to destroy the Noble's value system.  What the nobles valued was called Good, whereas crucifixion was considered the most ignoble way to die.  You couldn't even be crucified if you were a Roman citizen. (Note: the Romans did not consider it a good thing to die for your country.  Death, in general, was not Good.  Death was Bad.)\r\n In any case, Nietzsche says that the \"Resurrection is the biggest lie ever told in history.\"  And that Paul needed the death on the Cross, and something else, (implying Life After Death).\r\nNietzsche says to never forget that Christianity exploits Death.  (It also says that life after death is a Promise!  But Jesus never talked about life after death.  He was basically talking about Life Before Death, how you treat your enemies, by loving them, not resisting them, so as not to create more evil.)\r\n(Hatred does not cease by hatred.  Only by love does hatred cease).\r\n  Nietzsche says (in The Anti-Christ), \"What did Christ deny?  Christ denied three things: the established church of his day, the Pharisees, and the Hypocrites.  Precisely everything that today is called Christian.  \r\n  Everything that today is called Christian, is, in reality, anti-Christian.  In fact, There Are No Christians Alive Today.)\r\n  Specifically, regarding so-called Tele-Evangelists: Nietzsche says that \"There was only One Evangel, , Bringer of Good-Tidings, and he DIED on the Cross, ALL the rest are Dysangels, (Bringers of Bad Tidings).\"  So, the word for the tv preachers should be \"tele-dysangelists\".   In that sense, Metallica is telling the truth, they are liars, liars, liars.\r\n  First of all, they are lying about the Resurrection.  Then the \"promise\" that if you Believe Jesus is Coming back that you will be \"redeemed\" or \"saved\".\r\n  Jethro Tull started this by saying, in Aqualung, \"If Jesus saves, then he better save himself.\"\r\nOne philosopher, Dr. Ben Mijuskovic, has a paper on Loneliness where he says that Christians are people who feel alone, or lonely, and their idea of God is a way of compensating for this.\r\n  In that sense, it is correct that preachers are preaching to the disenfranchised and the loners.\r\nIf you watch Michael Murdock, you see him talking about sowing seed and harvesting.  He talks about you sending him a thousand dollar seed.  And it will come back multiplied to you as a \"harvest\" of faith.\r\n  Faith is a mere belief that something will happen.  In philosophy, reason is the handmaiden of faith.\r\nTrying to prove a mere belief is really an uphill battle, as belief, for Plato, was like water in a river, it had no solid basis at all, like appearances.  Knowledge, for him, was solid, based on fact.\r\n  Language is like a knife in that it cuts up reality into \"facts\".  \n\r\nTraditionally, a leper messiah was someone who was brave enough to preach to the lepers. Leprosy was feared greatly and lepers were ostracized and sent to live by themselves. Most priests feared these colonies and refused to have anything to do with them.  There is a place in Hawaii for lepers.\n\r\nIn context of these lyrics, the phrase takes on a slightly different meaning. Metallica, specifically, uses the phrase to refer priests and preachers who use religion to appeal to those who feel disenfranchised and alone. However, they don't use religion to make these people feel better, instead they guilt them into donating money. The term is not used with fondness in the lyrics. Most people see these fly by night preachers as little better than con artists. \r\n  Nietzsche also mentions that Christianity is based on lies.  All of its premises are lies, the virgin birth, the Resurrection, the Ascension into Heaven (for Jesus, Mary and Mohammed!) are all lies.\r\n  It also Falls with the disproof of any one of these lies!  He also says that even sin and guilt are lies.  There is no real sin and no real guilt.\r\n Nevertheless, he mentions, that did not prevent the Salam witchhunters from killing women for being witches and women confessing to be witches.  (Actually, this was a landgrab by the men, from women who had land.)  He also mentions there is no such thing as \"motive\".  As in, Police are still hunting for the motive.  (Why? Because there is none, so they will never find it.)\n\n\n", "comment_75": "\nit's \"taken by his glamour\" not \"taken by this leper\"\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nIt's not about spirituality, it's about organized religion and the cult-like aspects that suck people in and make them give their wealth and their selves over to a fake Christ, a \"Leper Messiah.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nthese are good theories, but lepper messiah is virgil hetfield, james' pops. apparently he was quite the dick, though he seemed pretty tight in 'a year and a half in the life of metallica'\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nIt is obvious that this is about evangelist preachers and their ilk asking for money etc..  \n\r\n     On a side note \n\r\n     Someone commented that atheism was a form of repression or perhaps that it was a hatred of religion.  certainly it is not the hatred of any religion, but the complete and total lack of a belief in any religion.  Without the belief in intellectual superiority over others that happen to be religious, but perhaps the wish to see all of us work to focus on ourselves and on each other rather than any imaginary god or creature. \n\r\n     I am an atheist and I am don't hate anyone.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nwhat does leper mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nwhat i think the song is talking about is the christian church selling indulgences in the protestant reformation\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nsatans hypnotising, trapping people into conformity, and giving glory to him by suffering, the laying down of their lives, ignorantly, while enticed into this trap by energy (heaven)delivered via the power of music, like a circus, and the sheep gather there, jesus came into the world to save the lost sheep and not to condem, read matthew luke and john with an open mind and decide for yourself, or listen to satans lies and remain ignorant\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nIt is about religious people trying to save others when they themselves need healing. They trick you into believing that religion will get them into heaven, and are obliged to contribute. Truth is Jesus only hated religious types too. He sat and drank with sinners, and promised a murderer eternity in paradise, but cursed the Pharisees.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nJesus had the same thoughts about organized religion that Metallica talks about in this song, Leper Messiah.  He said men have corrupted religion to exploit people.  Ironically, as Jesus predicted, his own murder would be used to create another corrupt religion by twisting his own teachings about the corruption of religion. Thus, the Catholic church and other Christian denominations were subsequently born and are alive today.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nAs for the comments by Blackouti3 and I quote: \"If your god is so great then why is he so fucking stupid that he can't see how people will disbelieve in him by his lack of proof of himself?\"\n\nGod doesn't care if you beleive or not, it's called giving us humans free will.That is where faith comes into play. As for being \"so fucking stupid\", I beleive that will be what we will be calling ourselves when we finally punch out of this life and realise there was even a grain of truth to God/Jesus and his teachings. It will be too late then tho... I think I'll play it safe, hell, like stepout says, it doesn't cost anything and it's benefits far outweigh the risks.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nI am fully aware that everyone is entitled to their own opinions. And you are all pretty much right. I remember when Metallica first came out and being only 14 I didn't care what the words meant I just knew I was angry at the world back then . When I got older and decided to listen to what they were actually singing about I realized that's pretty much how I felt about everything. I was told my grandmother when I was 13 that I was born into a family of witches. Imagine my surprise. I hate labels. My point is there is no such thing as agnostic. atheist or any of these other words you are labeling yourself as. We were all born to be free thinkers.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nThis song reminds me of the catholic schism that separated Catholics and Protestants. The Roman Catholic Church control almost all of Europe in the Middle Ages. The church had a system that if you pay a ton of money to the church, you had a free \"ticket\" into heaven. What the church was actually doing was taking the money and spending it on the priests personal wants and needs. When this was happening, the church grew more power. That might be where the leper messiah part kicks in. Like leperosy, Christianity was getting more and more powerful in a bad way; by lying. Then Martin Luther started realizing these flaws. He eventually created his own religion that had none of those flaws known as Lutheran. It eventually had a schism and turned into Protestant. Nowadays the Roman Catholic Church is starting to follow more of a Lutheran path. That's the history lesson of the day!\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nThe Leper Messiah could be anyone who claims they get messages from Mohammed, Jesus, The Popes, Televangelists , Rabbis Another Metallica song attacking religion is The God That Failed\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nHi everyone. Can you explain this section in the 1st line please?\n\n\"... sucked into the part\"\n\nDoes it mean \"you have become a follower of this false belief.\"  ???  -  or else?\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nThe term \"leper Messiah\" is about the Messiah who has leprosy not in his skin but in his preaching. But the \"indulgentia\" meaning the papers for forgiveness is not in Jesus preaching but in the practice of Catholic Church. So this song confuses the real preaching of Christ and the wrong practice of Catholic Heresy. The real preaching of Christ and the ancient Church is being saved in Orthodox Church in which never was established the practice of \"indulgentia\". So in the ears of real Christians the term of â\u0080\u0098Leper Messiahâ\u0080\u0099 is atrocious and Horrible because Jesus preaching and Glory and story is fresh, powerful, pure has nothing to do with the sins of man and Heretic churches.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI know this thread is old but, thought I'd just point out that as a Metallica fan you should know Lars & James identify as Christians themselves & still perform these songs, so even if they didn't have a great relationship with the Christian God at the time the song was written, I don't see them writing it as \"against\" God either. \t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nI think it describes a man, referred to as Leper Messiah, using some thought-up religion to get the money and devotion of gullible lepers that believe he can cure them if they give him what he wants. I see no connection between this song and Christianity, besides it being about a religion. Why do you think they used the line \"Circus come to town. You play the lead part?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nkinda reminds me of a President, i dont think i need to say his name.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nThis song can SO EASILY be used to refer to, and automaticly by default DOES refer to *ALL* 'christianity' as a WHOLE, ('christianity' Intentionally spelled in all lower-case to reflect it's incidiously SH__TTY value, what little value there is), as well as ANY and ALL other religions of it's CULT-ISH type which are followed ONLY by *COMPLETE FU__-UPS* and *LOSERS* who do so because they can't handle REALITY, and need to feed off of the *****FANTASY****** of their religious beliefs to get their 'high' like a LOWLY drug addict sucking on a crack pipe to get their \"sunday fix\"), because of the *OBVIOUS* FACT that almost EVERY SINGLE LYRIC in MetallicA's song \"Leper Messiah\" refers both directly, and indirectly to *EXACTLY* what *ALL* these LOONEY-TOON, NUT-CASE religious *MORONS* talk about and end up doing every day of their **BRAIN-WASHED** lives!!!!! There's a CULT-ISH 'christian' *PUPPET* named Dr. Gene Scott, for example, who a few years back when he was on the UHF station channel 56, *CONSTANTLY* refered to people getting more from 'god' when they go to heaven if they gave money to his ministry, in a desperate and pathetic attempt to save his little PERVERSE 'T.V. ministry' just before they threw his *LAME ASS* off the air!! I mean, this guy was so *PERVERSELY AND BLATANTLY MANIPULATIVE* that he would sit in his little chair, suckin' on his pipe and taunt everyone that believed that \"no decent true chrsitian would ever do such a thing as smoke a pipe......\" by lighting up the tobacco inside and puffing heavily on it as a defiant gesture towards traditional 'christian' values, talking about how, \"if you don't give generously to 'the lord' before you die, (Not missing the opportunity to inclusively splice himself into the mix as well as 'god' as someone you should \"give generously to \"or else\"), then you won't have many \"riches, etc\" when you get to heaven, while at the same time, having his little 'band of merry puppets' standing nearby frequently singing songs that also insinuated the same *****BULL__IT***** CONCEPT!!!!! Now, I can understand the fact that he wanted money to keep himself on the air at the TV station, OK? But when you STOOP SO *LOW* and to use *LIE-BASED MANIPULATION* to try and get it like this PUNK did, (And still does to this day, I will add), that is the point when you, as ANYONE with ANY DECENT DEGREE of intelligence and moral decency can *PLAINLY* see, have gone **TOO FAR**!!!!! And to make matters Worse, this *FOOL* actually BELIEVES that what he is saying is true!! (Sounds familiar, eh 'christian' *LOSERS*!?!? Like when your butt-buddy Oral Roberts threatened to KILL HIMSELF if people didn't send HIM money for HIS *LAME-ASSED* little T.V. program!? Do you see a pattern here, folks!? I KNOW I DO, *****AND IT SICKENS ME TO THE RAW CORE*****!!!!!) (To be continued.....)\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nI'm going to agree that you all make good points on the religion thing.. but do you guys even know what Leper means? Leper is a term given to people with Leprosy. It's a skin disease causing victims to look... wierd.. to say the least. A long time ago, in the middle ages, people with Leprosy, Lepers they called them, were treated badly, like people with curses. They thought that Leprosy was very, very contagious.. even though we now know it's not. They had to abide special restrictions, such as not touching anyone, or anything in public unless it was their spouse. Whenever they walked the streets they had to ring bells or make loud noises to warn people. Later, Lepers would be round up and put into special towns, or camps, called Leprosaria, full of Lepers, and only Lepers. Huge quarantine camps is what they were. They were usually headed by religous leaders. Also, the more money you had, the better colony you got into.\n\r\nRefrence to money=Buying your way into a better camp.\n\r\nRefrence to circus \"cricus come to town\"=Again, people treated them pretty bad. Almost like they belonged in a circus.\n\r\nThe words \"Leper Messiah\"=The camp leaders are, like I said, usually religous leaders.\n\r\n\"Make your contribution\r\nand you'll get a better seat\"=Fits perfectly. Buy your better camp.\n\n\n\r\nIt could mean that they had no choice, they were born with it from the start.\n\n\r\n\"circus comes to town\"\n\r\nOnce again, Lepers were treated very cruely. Like they belonged in a circus.\n\r\n\"Lies, lies\"=I'm not quite sure. Maybe it's because Leprosy really wasn't contagious, and the people back then new it. Not sure.\n\r\nI'm not saying I'm right, because the saw does look like it could be about religion, those TV guys, etc. But the song revolves around... LEPERS. The only religion refrence is Messiah. You all make very good points, but I think you are all very wrong.\n\r\nJust think about it. It all fits.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nMetallica hates Christians and all their bogus crap!\t\t\t\t\n\t\t\t\t\n\n"}