{"comment_0": "\nMcCartney: One night during this tense time I had a dream I saw my mum, whoâ\u0080\u0099d been dead 10 years or so. And it was so great to see her because thatâ\u0080\u0099s a wonderful ting about dreams: you actually are reunited with that person for a second; there they are and you appear to both be physically together again. It was so wonderful for me and she was very reassuring. In the dream she said, â\u0080\u0098Itâ\u0080\u0099ll be all right.â\u0080\u0099 Iâ\u0080\u0099m not sure if she used the words â\u0080\u0098Let it beâ\u0080\u0099 but that was the gist of her advice, it was, â\u0080\u0098Donâ\u0080\u0099t worry too much, it will turn out OK.â\u0080\u0099 It was such a sweet dream I woke up thinking, Oh, it was really great to visit with her again. I felt very blessed to have that dream. So that got me writing the song â\u0080\u009cLet It Be.â\u0080\u009d I literally started off â\u0080\u0098Mother Maryâ\u0080\u0099, which was her name, â\u0080\u0098When I find myself in times of troubleâ\u0080\u0099, which I certainly found myself in. The song was based on that dream.\n\r\nMcCartney: Mother Mary makes it a quasi-religious thing, so you can take it that way. I donâ\u0080\u0099t mind. Iâ\u0080\u0099m quite happy if people want to use it to shore up their faith. I have no problem with that. I think itâ\u0080\u0099s a great thing to have faith of any sort, particularly in the world we live in.\n\r\nLennon: Thatâ\u0080\u0099s Paul. What can you say? Nothing to do with the Beatles. It couldâ\u0080\u0099ve been Wings. I donâ\u0080\u0099t know what heâ\u0080\u0099s thinking when he writes â\u0080\u009cLet It Be.â\u0080\u009d I think it was inspired by â\u0080\u009cBridge Over Troubled Water.â\u0080\u009d Thatâ\u0080\u0099s my feeling, although I have nothing to go on. I know he wanted to write a â\u0080\u009cBridge Over Troubled Water.â\u0080\u009d\n\r\n(It should be noted that John was way off here because â\u0080\u009cLet It Beâ\u0080\u009d was actually recorded well before â\u0080\u009cBridge Over Troubled Waterâ\u0080\u009d was released. Also I think Georgeâ\u0080\u0099s beautiful guitar solo is an important part of the song. I sense jealousy in this quote.)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nif there is a song that \r\ntells you how to solve \r\nbasically anything, this\r\n is it...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nMy interpretation is that you can't control people or situations, even if you desperately want to, and for what may feel very good reason. In relationships we may want to fix or change things, but no matter how much love and communication is given, you cannot change people or control their sometimes shitty and weak choices.\n\n After struggling to hold everything together for too long, you finally realise, you actually have no control and that you just have to 'let it be\". It's out of your hands.\n\nFaith gets you through these times ~knowing that you can and will be okay whatever outcome.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis is a beautiful song. about paul's mum.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nhow the hell is this song about weed.????\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nSomeone said it is about finding \"light in darkness\" and that sounds sooo nice.  Yay-yuh.\n\r\nBut, I have a skewed perspective on this one!  My friend \"Donut Boy\" once threatened me with this song.  Did he used to be a COP?   I hope so.  I mean, who doesn't love a man in a uniform?   But, don't forget to BE KIND Mr. Donut!   I will be too!\n\r\nA personal break-up.  The Beatles break-up.  The death of a grandmother, weed, a donut loving man......  Art can mean WHATEVER the hell we WANT it to mean.  EVERYTHING is relevant.  AND I JUST LOOOOOOOOOOOOVE THAT ABOUT IT!  That's why I'll NEVER \"Let It Be\".   And besides....  I was INVITED here after all!   Don't be inhospitable!  \n\r\nArt for art's sake.   No right or wrong answers here on Song Meanings.  Just be true to yourself.  I hate Lady Gaga.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis is one of the most beautiful and peacful songs ever ritten. It has a very deep, yet simple meaning. I lissen to ths song when im having a bad day or going thru something bad..basicially when im depressed. This song to me means that whatever is going to happen..will happen and that all the problems in ur life ..u shud jes let them be. let the situation be..let the people be. dont get urself worked up.  And when the night is cloudy(When u are going thru something..when everythign just seems rong), There is still a light that shines on me, shine on till tommorow..(If ulook hard enuff u'll find something good...the light is always shinning on u..even during the darkest times), \r\nLET IT BE!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song got me through the death of my Grandmother last summer and it still makes me cry everytime I hear it! \n\r\nThe lyrics are just phenomenal!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nin my opinion this song talks about how you're always gonna go through hard times but you have to let it be and it'll get better as you go on and i love this song to death it describes my life i my opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI think like all music, poetry, or art, this song has different meanings to different people. That's the real purpose of any art, I think, is to connect with others. McCartney may very well have meant his mother, or he may have meant Mother Mary, but I think he probably meant both. It is a simple, beautiful song. Nothing really fancy about it. That's what makes is such a great song........and it IS a GREAT song.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ni love this song.i play it when im depressed and it always helps me to see that there is a way out and there is always someone there during your darkest hour, even if it doesnt look like there is\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nfuckin amazin song about just leting things go and letting things happen. the best beatles song!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nummmm... im a bit relentless on posting this cause of all the arguments about wether or not this song is about drugs but one of my music teachers who is beatles crazy said this:\n\r\nthis song is about paul Mc Cartneys relationship with Marijuana, he is saying when he's down or needs inspiration he can use Marijuana and come up with answers or motivation \r\nPaul also make a statement about the legality of Marijuana in the second verse \r\nthe lyric \"Let it be\" is a statement to his band members and the people in his life not to worry about him and his use of Marijuana, they all need to let him be.\n\r\nas i said this is my music teacher view not mine and if it is the true meaning i think it spoils a beautilful song\n\r\nif u want to hear another nice version of the song try listening to Joe Cockers version - i found it really beautiful\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nMy friend's Parents weren't allowed to play this at their wedding because the priest said It was about Weed/pot.  Mother Mary= Mary Jane.   Or at least it did to this priest !\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nok  ino  what  everyones gonna say when they read this post \" not every song is about drugs\" but i have a theory to how this  song relates so  hear me out.  Ok.... we all know the beatles were  huge potheads. Now  think of this line \"when i find myself in times of trouble, mother marry comes to me\" Marry(marryjane=marijuana) ok   so when  hes in trouble he turns to pot.  \"speaking words of wisdom, let it be\"  So  now  speakingwords of wisdom  is referring to    hullucinating  and let it be  is like to be calm and care free(the sensation marrijuanna  gives you\" If u read the rest of the lyrics..... it all refers to a problem and ends with a solution\"let it be\"   so  just read the lyrics and think about  it  and  tell me what u think  ...... ill read ur posts.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nShortly after my own mother's passing, I was reading a book about coping with loss.  Several \"famous\" folks shared their own stories about their battles with grief.  Paul McCartney explained that when he was going through a particularly troubling time in his life, one night, his departed mother came to him, clear as can be, and said to him, \"Let it be.\"  He explained that afterward, he was filled with a peaceful, almost blissful sense of well-being.  He wrote the song about his mother, Mary, coming to him and the rest is history.\n\r\nIndependent of this, other people have told me of lost loved ones coming to them during the night, very clear and present, and of having a more settled, peaceful sense of being afterwards.  Although I still wait and hope for some sign from my own mother, Paul's sharing of this experience, and recording it in song is emotional yet helpful.  The beautiful song was inspired by something no longer of this world.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nthey played this song at my friends funeral, it's beautiful. It will always bring a tear to my eye. \n\r\n\"And in my hour of darkness she is standing right in front of me, \r\nspeaking words of wisdom, let it be...\r\n...And when the night is cloudy, there is still a light, that shines on me, \r\nshine until tomorrow, let it be.\"\n\r\nShe's still shining and helping us through the hardest times.\n\r\nRIP Taylor\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI played this song at my late partner's funeral.  I used the gospel version from the Across the Universe soundtrack.  To me, it resonated because losing him was the most difficult thing I've ever had to go through, and the process of coming to accept his death continues to be extremely difficult, especially considering he took his own life.  So it reminded me that the purpose behind his death is beyond my capacity to understand, and that I can make peace with it only by knowing that it was God's will, and I should just let it be.  It makes me cry every time I hear it.  It's a beautiful lyric, and it also speaks to me of a mother's wisdom and ability to comfort her grieving child.  Whether you see that mother as your own mother or the Virgin Mary, or both, is up to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nTotally bout Paul's mom in a dream.her name was friggin mary. i dont wanna hear no pot explanation. the solo kicks ass.... :)\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nReminds me of the guy who stalked me.  He told me that regarding this website I should \"Let It Be\".  \n\r\nHe likes to threaten women.  What a spooky sunuvabitch.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nHow can anyone believe this song is not about the blessed Mother Mary.  I pray for those of you who don't believe in Jesus.  The lyrics \"there will be an answer\" says it all.  My mom recently passed at the age of 60, and I know Mother Mary came to her, she talked about her a lot.  I bet she came to John too and told him there would be an answer.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nHonestly, I never really understood this song. For all these years I just simply couldn't understand what the great deal about it was. But I'd recently lost a friend and it really messed me up. I happened to be watching The Beatles tribute on TV one night and I think they performed this song. When I heard them sing it as I was thinking of my friend, everything clicked in my head. Suddenly in that moment, this song made PERFECT sense to me. \n\nWhen we lose someone, often we find ourselves constantly asking \"why?\" and trying to understand all the reasons for their death. When I find myself falling into this abyss, I go and put on this song and it brings me peace. It just brings me peace. It tells me \"let it be.... there will be an answer....but don't worry about it, just let it be the way it is. Leave it.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nStuff you can't control or if the circumstances are to hard to overcome,please be positive and \"Let It Be\"  to a higher power rather than rely on us, talented but flawed humans. If you show compassion to people\n\r\n and yourself there will be an answer to your sorrows,\r\nhopefully sooner than later. If you are a positive person there will be a positive answer. Have patience, stay calm, and pray for real love.\n\n\n", "comment_23": "\nLet It Be was written after Paul had a dream about his late mother, during a particularly stressful time in his life, telling him that it would be ok, that there will be  a way out of this predicament soon, which later inspired Paul to write this song.\nI for one, look at it from a religious perspective, as it resonates with my own life. There are certain situations that I cannot handle, and I remember having an emotional breakdown, bordering on a mental one, when this song played in the supermarket. A coincidence? Maybe, but it helped.\nUltimately, it is a song that tells its listeners to just leave the problems to the universe or higher being, that things will eventually fall in to place, and you shouldn't  give up just yet on your dreams.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI never knew it was about Paul's mum.  To me, I always thought it was about the Beatles breaking up and moving in different directions, considering it was around the same time when they called it quits.  Anyone seen the film clip to it?  It's really sad, after what I just wrote, I always though that in the film clip, Paul seemed to be pleading with John sort of.  \r\nWell, that's what I got from it\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\noh i love this song. when im confused i listen to this. lol. i just end up letting everything fall into place and its a lot better than trying to change all the \"circumstances\" and stuff like that. sure, sometimes you need to do what you need to do, but dont get so serious about everything, just do like the frickin song says and let it be.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis song is about pot. mary? they aren't catholic. mary jane is the mother mary. the cloudy night with the light shining on him. let it be... when on pot one lets things flow, they stop caring and things seem to just happen.\n\r\nthis is just a joke, me and my friends came up with this explication one night about 2 in the morning\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nthe song is a monument, but mr ICE did a very POOR job!! so i did another let it be lyric!\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThe stress wasnt about beatles breakin up it was about during a rest periode the other beatles went and did things with their familes and significant others, at the time paul had no wife or girlfriend and his mom visited him in the dream saying let it be, and it will all be ok. His mothers name was mary she died when paul was 14.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\noh my gosh the beetles rock who ever doesn't like the beetles doesn't like music\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nFor those of you that dont know, Let It Be was NOT The Beatles's last album. Abbey Road was the true last album by The Beatles, they just released it before Let It Be was released. Actually on the Let It Be movie, the four are shown rehearsing Abbey Road. So Let It Be, the song, is not about The Beatles breaking up. \n\r\nThis is such a meaningful song. Just listen to the chorus and all your troubles will be washed down the drain\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nBTW has anyone ever noticed the missed piano chord during the line\n\r\n\"Wake up to the sound of music\"?\r\nListen for it and it is plain as day.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nas someone who is not into organized religion, i have to say this is without a doubt the most thought-provoking spiritual song i have ever heard.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nOrko, Exeventu, and weezer have it right.   It's about Paul's mother visiting him in a dream.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\ni love this song soo much. i think the music break is the most beautiful thing ive ever heard....\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\ni think this song is about optimism, which is good in a way, but a song about realism would have better. in john lennon's 'beautiful boy' there's a line which says 'life is what happens when your busy making other plans' which contradicts this song, althought paul wrote let it be. so maybe its another saga in their little battle. bo!!!!!!!!!!!! i smashed it.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nTHIS SONG IS SO SWEET,IT'S A TWILLINGATE SONG DUDE!!!!! IT ROCKS!! I FIRST HEARD IT IN JULY 02 AND I LOVED IT\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nthis song was written when paul was going through a lot of hard things. He was drinking a lot and had gotton intoa  fight with his girlfriend. One nihgt he had a dream and his mother was in it, she told him that if he just let it be, it would all work out, and things did work out, or at least get a lot better, after he took the advice.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThis song is really beautiful and to me it means that everything has a solution.  When I am worried, I listen to this song and it inspires me to think positively.  Good Song!\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nFor those arguing about \"Mother Mary\" being either his mom or the virgin, I think its a pun.  I nicely done one, too :)  Anyway, I think this song is about finding the light in the darkness.  Yep :)  It can help you let it be XD\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nMy favorite song of all time, I cry when I hear it. During black history month a couple of year agoon MTV, they played a clip of this song along with all the segregation and violence that happened in the 60's. I know that's not what the song's about, but I thought the clip and the song played together was very appropriate.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nIn this song, when Paul is saying \"Mother Marry\", it's not about some nun, but it is about his mother.\r\nJust thought you should know\r\n-supermanman67\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\na song about Paul's mom, and Let It Be could be another way of saying \"fuck it, why bother\" \r\nPaul is the only one who sings on this song\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nwell.... the lyrics are better than the last one\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI love this tune. It's like the best beatles song ever! This is one of those songs that says, just relax and let it go, lose yourself in your mind, free yourself....ok i'm weirding myself out now.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThis song is about how during the Beatles rough times, Paul had a dream in which his mother (Mary) came to him and told him that everything is gonna be fine, just let it be, things will go as they are gonna go, stop worrying about things you cant help.  I love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nsupermanman67, the religous Mother Mary isn't \"some nun.\"  Just thought you should know that.  Paul wrote it about his mom, but he's a smart guy, I'm sure he intended that to be left to interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI like the version on the original Let it Be album. I don't care too much for the version on Let it Be Naked.  supermanman67 Mother Mary is not some nun, she is the Mother of God.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nThe confusion in that passage does add to the mystique of the song itself doesn't it? Having a song that can be interpreted many ways isn't a bad thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nSgtPepperLHCB I am no music theory major (although I am planning to study music in college) the chord is not a missed chord, but simply a minor...or augmented...or something :P\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nYou know i find it almost impossible to chose a favorite song with a band as great as the beatles. But all i'll say is that this song comes pretty damn close.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI think this is one of the best songs of all time.\r\nI always thought it was about optimism and not trying to fight against fate.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThis song isn't really about his mother, although I do think it is a pun, more of a sign of respect for her. BUT... this song is about death and dying, and how Paul is able to accept this by turning to someone he knows who will be there for him.\n\r\nWhen he's in trouble... he turns to Mary for guidence and help\n\r\nIn his hour of darkness, it's the moments before he dies, here he sees Mary, waiting and watching him.\n\r\nWhen the night is cloudy refers to him unable to solve his problems until the light is shined on him from God.\n\r\nAs he wakes up, he's in a perfect world, away from his problems. He has Mary there to comfort him. Her voice is perfect, what she says is perfect, that is why it sounds like music to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\ni dunno whether this song is abt Paul's mom or not but as far as i've heard from everyone around me, he's talkin abt marajuana. but whether abt pot or his mum or abt the beatles breakup, it is by far one of their greatest songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\ni honestly am really sorry for being rude, but whoever says this song is about marjuana should be shot.  This is one of the most beautiful songs ever written.  As a matter of fact it was about pauls mom.  Just because paul writes a meaningful song doesnt mean hes on drugs.  Pauls mom died when he was 14.  she came to him in a dream when he was having money troubles.  learn your fucking facts before you open your mouth...all of you\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nRegardless of whether you are a garage fan, a roacker (like me) or anything in between, if you  do not apreciate the sheer brilliance of this song, you are a twat and I will chin you, I swear to God...\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nPaul wrote this song about his mother who was called Mary. But he also had Jesus' mother mary in mind too. Paul played it for John in the studio. Saying hey listen to this it will blow your socks off. And john replying, are we supposed to giggle in the chorus? At the end john says, i quite like that i think i will take one home with me, and then realising the connection between Pauls mum mary, and how the public would see it has christian Jesus' mom he cried, you bounder you cheat.\n\r\nHe thought it up, because when he used to have a problem, his mother would say to him , let it be Paul. Don't worry. It will be ok.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nme 2\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nCertainly the religious aspect is intentional:  the church bell and church organ riffs are pretty blatant.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nLet it be is a VERY unique song in that let it be is both the question and answer. He is telling both to let it be; for the answer will come...and that let it be IS the answer. Beautiful, amazing song.\n\r\nI had no idea it's about pauls mom...thats pretty cool...\n\r\nPete R.: nice explination\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nthis is such a beautiful song..\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nyeah\n\r\nso i'll say it again: \"this is such a beautiful song..\"\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nWhen you write what you think the meaning of this song is it is not supposed to be the meaning that they had when making the song artists write music in order for you to have your own thoughts on it. (at this moment i am still trying to find out what i made of it)\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nActually let me better put what i said. You are not supposed to explain why the song was written but rather what they meant by the words in the song because just because the song is written for or about something doesn't mean that they are not going to throw in some of their beleifs or ideas so when making your conclusion about what the song means i think that you should try to interperet what they mean by the song but not why it was written. (I know I contradicted myself)\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nthis song is just soo perfect to listen to, whenever things aren't right, beatles are always there. the beatles are my comfort music. anytime i'm sad, i just pop in a beatles album, and i'm good\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nLet it be -- mother mary is NOT a mary jane, but is Paul's mother and the virgin mary. It has a religious symbolism and a general symbolism that when things are going badly, let it be and relax and it'll all work out. I'm not saying it's true that if you don't do anything everything will work out, but that's what Paul meant.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nMr.Snow, I would like to point out that Socialism is NOT between Capitalism and Communism.  Communism is a subsection of Socialism with a dictatorship government.  Anyway, I think this is one of the most comforting songs EVER!  I listen to this, Hey Jude, and Blackbird whenever I'm depressed.  I didn't know about Paul's mom either, but it doesn't surprise me a bit.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nthis is in my top three favorate songs. it's awsome. it shows how if u can not do anything about something then just\"let it be\"\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nthe most meaningful song of all. it is the beatles at there best.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nits about pauls mom, she died and he turns to her when he needs help\n\r\nps if you want to hear a neat version done by another band, go to wwwpi.8k.com and you can hear it\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\ni adore this song. it's by far the best beatle song ever. and, as a matter of fact, \"mother mary\" is reffering to his mother, not the virgin mary.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nphil spector is a shitty producer. that's all i have to say about this song and this album.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nSounds like something C.C.R. would sing...\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nOK, to clear up a bit of confusion. It was not a missed chord during the line \"I wake up to the sound of music.\" The artist messed up and played a wrong note. The chord was a G Major, and he meant to follow it with a note a Major 7th above G to make the chord become a GM7, but he accidentally played a note a semitone under to make the interval a minor 7th, changing the chord to a G7.\r\nOh. and I'm a music theory major!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nAnyone know where I can get hold of a recording of the video version of the song, with the part about \"...there will be no sorrow...\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nEveryone who said this song is about Paul's mother Mary is correct. Paul wrote this about his mother who comes to him in his dreams and tells him that everything is going to be ok. Basically, because Paul lost his mother at such young age, he still seeks out her encouragement through hard times. Basiacally, it relates to everyone's need to be told that \"everything is going to get better, just relax.\" \n\r\nThis song is my favorite Beatle song, only because of the message that it provokes in me. My friend and I had a huge discussion about how it's a very discouraging song because he says \"There will be an answer, Let It Be\" and she says that this is like we have no control over our situations in life so we can't do anything to change them. I see that interpretation, however, I sense a more optimistic message in the song. Despite the melancoly music. I think it's saying, things get tough, yes, and sometimes you can't do much to change them, yes, but don't get worked up over things, Let It Be. The answers will come to u eventually. There is a answer if you search for it and maybe, when you least expect it, you will find it. \n\r\nPaul left this song up to much interpretation, as he does for most of his songs, sort of an auto-biographical song that isn't. That's what's amazing about it. A lot of ppl see religious ties into this song. Of course, ever since I was young I thought MOther Mary was the virgin mary and even now, I feel like it's not necessarily catholic based religious but it's definitely faith based and believing in something higher than yourself. It reminds me of the Serenity Prayer a little. I love it and it really is my \"motto\" for a lot of things in life. Let It Be.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nRichardWard: \" WHAT!!!!!!!!!!! the beatles broke up when did that happen oh well at least John still has his solo career\"\n\r\nUm, I don't like being the bearer of bad news, but I don't think John's been writing much music since, oh, say, 1980. You mean Paul?\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nhow exactly does his mother come to him and tell him to let things be if she has been dead for over 40 years? I wasnt aware you could do that maybe I should try it sometime...but really its a good song but people seem to be confusing meanings here and theres obviously not 1 clear message except of course to let it be\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\ni never knew about paul's mom.. but its a great song, so as some of u already say... let the lyrics b....! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nNot the best album and because of that fact, the most important â\u0080\u0093 the best band in the world was fallible.  Through the album you can hear the greatest band that ever lived crumbling and imploding.  \n\r\nThey were lazy with the content of this music, hence, the name of the album â\u0080\u0093 Ce La Vie\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nIt is what it is..., Just\r\nLet It Be\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nAnyone ever heard of LET IT BLEED? Now that's a song that defines the era of that time.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nohh okay\r\nso, this easily the most meaningful Beatles song to me...the first time i ever heard it, i was lying on my bedroom floor, sulking, being all \"emo\" and then, with my cd player on shuffle, this song came on. i had never really listened to it before. then, when this song came on, i lifted myself up off my floor, prayed (because i knew god put that song on my cd player for a reason) whiped my tears, and just left my room.  Just that one song helped me through. The Beatles are one of the best, and most influential bands in rock music to ever let their music ring. They're my fav. band EVER!!\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI just read The Beatles Anthology. I think Paul wrote this song when he was young. But I'm not sure. :)\n\r\nBut this really is about his mom. At first, I thought he was referring to The Virgin Mary, but then I read this Little Book of The Beatles, and I found out that \"Mother Mary\" was his mom who died when he was young. :):)\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\ngreatest song of the whole 1970s, no argument i think.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nI think \"Mother Mary\" is referring to Jesus' mother...I don't know, but I do know that Catholics often pray to Mother Mary. I'm not sure if McCartney is Catholic or not but yeah.\r\nMy interpretation of this song is about world peace...you know, anti-war and stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nPaul wrote this song about his mother. She died when he was in his late teens, and, shortly before the song was written in 1970, he had a dream in which he saw his mother, and in the dream she told him something like, \"I'm not alive, but just Let it Be.\" That's how he got the idea of the song. I'm 100% sure that's what it's about, because in an issue of\" Reader's Digest\", he said that's what it's about. His mother's name was Mary, so in the song, he said, \"Mother Mary comes to me\", but he was not talking about the Virgin Mary at all. One of their last singles ever released, this song is the most incredible Beatles song I've heard, and anyone who thinks otherwise should go to hell.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nThis song is about Paul's mom. One night, he dreamt that he saw his mother's face, clear as day, and she said \"let it be\", and it was the perfect remedy to a lot of the trouble he was going through.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI think that Paul specifically meant his mother, but intentionally left the reference ambiguous to make it more universal.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\ni love this song. it's so positive, about letting go & letting what happens happen. extremely reassuring, especially if you're feeling a bit down.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nAnd this song will always remind me of drivers ed, because two of the times I was driving with the instructor, what do you know, this song came on.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nI \"think\" the original lyrics are \"There will be no sorrow.\" Instead of \"Speaking words of wisdom\".\n\r\nI really like it. Mary was Paul's mother. Paul got the idea from a dream that he had.\n\r\nWow, I really like it when Paul is sleeping and dreaming. Yesterday and Let It Be came from a dream. And it turned out to be the most beloved song of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\njedi17, I couldn't agree with you more. I know that it's weird, but I love 'I Wanna Hold Your Hand' more than 'Let It Be'. I don't know wny. Maybe because I remember the \"early\" Beatles whenever I hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nIt was written durring a hard time in Pauls life when he was drinking and going to many partys while the rest of the beatles seemd to be settling down. He was unhappy. One night he had a dream of his mother who died when he was very young and he had almost forgotten what she looked like. In the dream he could see her perfecty. The only thing she said was \"Let It Be\". He woke up, got out of bed and wrote most of the song that night. It just came out very easy and seemed to mean a lot to him. After that he found his first wife who helped him out a lot, she even sang in the song and if you listen closely you can hear it near the end and in the course, she's one of the voices in the background.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nthis song is just beautiful. everything about is amazing. the lyrics the singing and the music!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nthis is one of the few songs in the world that has the power to move a person to tears, not that its moved ME but u can see wot i mean\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nwell, one of our good friends were depressed due to personal reasons, and me and my friends started singing this (really off-key too).  But, it worked nonetheless, got him to smile. =)\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nlove\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nthis reminds me so much of rod gozzett. not sure if anyone saw but there was an interview on abc news with keith richards saying this guy is gonna be the next john lennon. can't see it myself but he's good ... rodsound.com\n\n\n", "comment_99": "\nI think it is about love that helps to go through problems and hard things. Mother Mary could be PaulÂ´s mother comforting him on a dream (such a big motherÂ´s love!!!) or could be the Virgin Mary (anglicans believe on Virgin Mary as a holy, sacred, saint person just like in catholic religion) but the important thing is the song is beautiful and meaningful.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nOMG!!!i love this song , it helps you get through fights and shit  like that, i always listen to it...btw, email me if anyone wants to talk --> happybunnybay@hotmail.com                                                                                                            :D i can asure u, i'm awsome!!!and i only have 78 ppl:'( kk byee xox!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nThis is one of the few songs that can get me choked up from the very first words. Very emotional, very beautiful song. The fact that my mother - like Paul's - is named Mary makes it even more personal, especially since she (my mother) was ill for a year and we didn't think she would make it. She's healthy now, but I've moved on to college, so I'm 3,000 miles away from a woman I love and respect more than anyone else. I don't usually admit it, but I really miss her.\n\r\nAgain, a very beautiful and wonderful song, but a bit hard for me to listen to.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nIf you haven't heard it already, listen to Aretha Franklin's version. It's fantastic.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nThe lyrics from this song include \"I wake up to the sound of music, Mother Mary comes to me\". This has been interpreted by believers to signify Paul meeting his mother Mary, who died when he was 14, in heaven.\n\r\nA more obscure clue is that when the words \"Let it be\" are played backwards, they become \"He is dead\".\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nI swear to the fucking lord this song is amazing! I love it so so much =D. And it can actually help you surprisingly when shit aint going right.\r\n                            -xx.Grace.xx-\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\ndoes anyone know the form of this song? i'm doing a report on it and i have to learn all this stuff about it. i thought it was ABACA, does anyone agree or disagree?\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nthies is one of the best songs ever i always that it was about the blessed mother till i read it was about puals mom. its a realy betufel story he sead she came to him in a dreme the night befor he wrote the song\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI'm not sure how John could have dismissed this song in good faith-- it is one of Paul's best, beautifully arranged, great guitar solo, I'm not aware of many songs previous to 1969 that were this powerful. Everyone waited for Paul to top this song as a solo artist and he never was able to.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nUm....no. Look up Phil Spector on Wikipedia. Really, just look.\r\nA shitty producer wouldn't have so many hits.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nisnt this the same as the normal one?\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\ni get goosebumps when i hear the guitar solo in this song\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nit's the same... but better\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nThis is a really beautiful song, i love it. Paul McCarney has a great voice!\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nI love this song. I used it as part of a slidshow for a retiring teacher,and it was so perfect.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\n:o :o :o :o AAAAAAGGGHHHHHh what a song :o :o :o\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\ni love this song.\r\nwhen things go wrong for me, i listen to this song and say to myself \"Let it be.\"\r\nit helps A LOT.\r\n:]\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\ni think this song is about how the beatles are coming to an end and how it was gonna happen at some point and they should let it happen/let it be\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nthis is probalby my fave song by them it so great. And when the broken hearted people\r\nLiving in the world agree,\r\nThere will be an answer, let it be.\n\r\nbeautful lyrics to\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nI really have no idea, what meaning this song held while it was being written. But to me this song just means 'yeah sometimes life slaps you across the face but things will get better'.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\n\"Amen\" translates into \"So be it\" or \"Let it be\". I thought that was interesting. Any thoughts?\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nStop worrying about the future, there is no point in wondering how things will be. In hours of darkness, just relax and let it be.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nI'm sorry for the silly question, but English is not my native language and I can't understand what exactly \"Let it be\" MEANS!!!!! That's because on Bulgarian (my native language) \"let\" have a meaning similar to \"permit\" and another which I can't explain (an example for the econd meaning: Let's go!). Can you tell me in which meaning \"Let\" is used in the title of the song? Once again I beg you to forgive me for the silly question, and if you have a wish, to answer to my question!\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nHeidegger.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\ni do not think that one of the best songwriters of all time would write this beautiful song about pot. you can surely take that out of this do to the title, but i highly doubt those were his intentions. i think paul came to peace with what was happening with the collapse of the beatles, he knew it wouldnt last forever. so he just let it be.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI know this song was written by Paul about his mother, Mary. But, there is clearly a religious interpretation as well. I see this song as clearly being about the Mary, mother of Christ. If you look at the opening chapters of Luke's gospel, it tells the story of the angel Gabriel's visit to Mary. And depending on which interpretation you look at, Mary responds to the angel's request by saying \"let it be\".\n\r\nSo, for me, this song is about letting things be, because God knows best. This lyric tells the story of a person's struggling in the world, and Mother Mary coming to them and saying \"let it be\", because everything will be alright in the end. \"Let your will be done,\" as it as the Our Father puts it.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI know he says its not about the Virgin Mary, but the lyrics are so obviously about her. The only thing Mary said in the Bible was \"Let it be on to me\" to the angel Gabriel when he told he she was about to be the mother of the Christ child. I find it a little too coincidental that he would use the term Mother Mary and the line Let it be for it not to be about the Virgin Mary. I think he is just too shy to say that its actually about her because he doesn't want his music labeled as Christian rock. Nonetheless, its a beautiful song\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nSimilarities to the words let it be:  1. leave it alone  2. don't bother it  3. allow it to exist 4. leave it as it is\n\r\nDeeper meanings:  1. peace  2. stop interfering  3. relax and let things happen, you duffus.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\ni just pooed a little.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nsometimes i just want to let everything be and like nature take it's course, like i'ed like to be able to just walk around naked or even just semi-naked\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\ni like being naked\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\ni like being naked\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nLet me start off by saying that VERY few songs make me cry. But this is one of them. I cry because it's so positive, and so simple; I cry because we had to sing this song for music class at school, and it brings back so many memories.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nI think Paul Mc\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\naccidents happen...\r\nIthink Paul McCartney showed who he really serves when he did a pro-war  propaganda song after 9-11. I would be very wary about what kind of ideas and distractions the MEDIA is planting in our heads. The Catholicism in this song cannot be denied, no matter what kind of personal \"interpretation\" one chooses to construct.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nThe song has absolutely nothing to do with drugs. it says that when he gets into a deep state of depression a higher power helps him to crawl out by saying let it be meaning just let whatever happens happen. dont contribute to a fight. just watch it progress and keep alll thoughts and feelings to yourself and everything will work itself out in the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nthis song is so beautiful\r\nits so beautiful because its meaning is so simple\r\nits about accepting what you can't change moving on & hoping for a better future \n\r\ni really don't think its any more complex than that :)\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nI like to imagine that when Paul wrote \"there will be an answer\", that was his reference/response to \"I Know There's An Answer\" by The Beach Boys, whom Paul was very fond of.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nthis song is about paul mccartney's mom.and in a way i believe it is about peace.not only world peace but the peace you find within yourself.that serenity you have buried deep inside of you.and if things were left alone or \"let be\" the world would go on as it should without any interupptions or war. i suggest watccing the movie \"across the universe\" it sets a great meaning to all of the beatles hits =]\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nI LOVE this song more than I can describe.\n\r\nPaul is amazing. \n\r\nWhen I feel down and out, this gives me comfort.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nThis is probably my favorite song ever.\n\r\nIt always makes me feel at peace when problems are stressing me out. \t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nmy favorite song!!! \t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nI think this song is about how one should not force things and chill and let things fall into place\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nI think everything has already been said about this song, but I always hear this short soft whisper after the line \"For though they may be parted\". It's most prominent on a Cd like No.1s but still on the album too.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nit's about them breaking up\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nFrom what i've seen most, i haven't seen anything i agree with... From what i saw, and this came straight from Paul, this song is about a drug trip he had once, where his mother came to him and said let it be... that's about all it is, really.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nThis song reminds me of a bunch of my friends part their ways like the Beatles. I always think about them and the great times we had but we've all moved on and there's no going back. It's such a great song too. It almost brings tears to my eyes when I hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nDefinitely the most peaceful and moving song I've ever heard. I always listen to it when I'm going through hard times. I totally agree with it. No matter what life throws at you, there will be an answer. \t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nThis song strikes me every time I hear it.  I lost my mother on a crystal clear sky illuminated by a full moon.  And when it's full, every month I think of her, and \"And when the night is cloudy, there is a light that shines on me, shine until tomorrow, let it beâ\u0080¦\"  I miss her so, but in my hour of darkness, she is standing right in front of me.  This is an incredibly powerful songâ\u0080¦the writing is simply amazing.  Paul McCartney wrote itâ\u0080¦inspired by the loss of his mother to cancer (that's what took my momma).  I thank God for this beautiful song, for the ability to visit my mother with it.\n\n\n", "comment_148": "\nIt's about to go with the flow or about dying at the age of 40.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nthis is the best song to listen to when you are lost or confuzed. i think its about coming to terms with reality, even if reality sucks; it gets better\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nThe moment one claims ownership or views anything personal the delusion of control is assumed and reality is lost in the veil of maya...LET IT BE...for clarity.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nthis song is amazing when i feel depressed i listen to this and lupe fiasco's sho goes on i know they have nothing to do with each other but in my eyes they teach the same lesson when you fall down get back up in you darkest hour there is always away out\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nWhatever reason Paul McCartney wrote this it has deep meanings for us all.  To me it's very personal because I have strayed from my faith because of things that have happened in my life and to my family.  I had begun to question my Catholic upbringing because of the confusion and pain that I've endured my whole life and now in my children's lives with the recent loss of their dad, a young man of 46 who fought harder for his life than any person I'll ever know.  \n\nFor some reason though this song comforts me and brings me back to my faith.  \n\nAnd when the broken hearted people living in the world agree\nThere will be an answer, let it be\nFor though they may be parted, there is still a chance that they will see\nThere will be an answer, let it be\n\nI do believe that at the end, in our hour of darkness we will have all the answers, but for now, just believe.\n\nLike it; don't like it', I'm not trying to create a debate forum. This is what the song says to me.  My 12 year old daughter heard it for the first time today on the way to school and upon listening very intently to the words the first comment she told me was that this song reminded her of her Daddy, who passed away this past March from cancer and our beloved Uncle who passed away last week.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nPaul McCartney's mother died when he was a  boy.  Her name was Mary. This song is about how he saw her in a dream which is very common  when a person looses a loved one. There is no deep meaning re church and/or Catholicism. It's about a boy trying to be comforted by the mother he has lot.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\npauls beliefs lret help come to himin this way lucky man but with one parent each dside ofthe irish war it must have comehard to start with but its given him a solid religious foundastion to grow from and hios songs are the greatest result i am glad he isa singer song wrihhter not a paperback wrighter hios songs an singinging are a greater contribution to world srt than any book could be so good lucknpaul may gods light shimne on you\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nI also love that Lennon puts You Know My Name (Look Up the Number) on the B-side or to say in so many words if Paul says Let it Be, I'll say hey call me & the Paul music is becoming Muzak albeit Be is one of the best songs ever and an amazing universal self-help plus John is the biggest hypocrite ever because he became super Muzak and finally admitted all his songs after a point were Dog**** and then stayed at home and chained smoked pot while staring at the TV with the sound off until he went to bed.  Paul went out and conquered the world albeit in his Wings deal Denny Lane is falling over in the footage like he is decibel ten hammered so you know.  But at least he moved from point a to b in a pretty cool way..  But the B side in response to the =idea break-up was inevitable is very cool to me.  & you get many beautiful songs like Elizabet these days, great rockers with great production that are not just boring classic rock style but whatever you want to say about the Beatles who is that consistent in making music.  And #9 is the final war like Vietnam in the themes from that album about divorce and break-up with Yoko part of the rebellion from John.  And then Good Night is the peace after the storm- returning home to your child and the white cover represents that peace.  Very cool if if the Beatles are outdated now.  .  You also have to hear the '68 Christmas record where they are ripping on Mc.Cartney, Ob-La and other stuff and then George also gets in an all-time classic shot at John...\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nThere are few peoples who search for the Real origin and meanings of a song, therefore most of peoples dont know he wrote the song for his mother and they take It as a religious song like what I did at first\nso dont get angry at them\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nVery few songs \"speak\" to me the way this one does.  Very calming, a voice of hope in a world of darkness.  McCartney is a musical and lyrical mastermind.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nIf you believe the urban legend that Paul died in 1966, then the person who took Paul's place said this about \"Let It Be\":\nâ\u0080\u009cLet go, and let God.â\u0080\u009d It is an attitude of total acceptance. It is like the phrase, â\u0080\u009cWhatever will be, will be.â\u0080\u009d Let God worry about it. The real message, no matter what you go through, is simply to accept it. Let everything go according to the divine plan. That is a key to happiness. It is a choice. We can each trust the universe, or God, or angels, to make our lives turn out for the best. This core belief is empowering and self-fulfilling. If we truly believe that everything works out for our own benefit, we align with the universe to make it so. â\u0080\u009cLet It Beâ\u0080\u009d is written to accept everything we experience, but is particularly about accepting death. Everyone dies. Most of us live long enough that we must accept the death of loved ones . Itâ\u0080\u0099s never easy. One time in an interview I said that the song was about that loss. I lied. Â  Since that time, I have had to deal with the loss of Linda. Â That was in 1998. It is frowned on by some for me to still miss her, but I did not stop living when she did. Â  Part of me is with her; but others loves have been great too. I enjoy marvelous relationships. However they are not replacements. People are not replaceable. Â  Each loved one is unique and wonderful. We can replace possessions, but not relationships. They continue. Everything in life must be allowed to be. â\u0080\u009cLet It Beâ\u0080\u009d was about the end of The Beatles, but was about the death of Paul more so. Â  This song has some of our best Paul clues. In a dream, my mother told me it will be all right. She wisely told me not to worry, and that everything would turn out as it should. It would be all right. The gist of her message was to â\u0080\u009cLet it be.â\u0080\u009d Like Bob Marleyâ\u0080\u0099s 1977 song, â\u0080\u009cThree Little Birds,â\u0080\u009d the message was â\u0080\u009cDonâ\u0080\u0099t worry about a thing, â\u0080\u0098Cause every little thing gonna be all right.â\u0080\u009d In â\u0080\u009cLet It Be,â\u0080\u009d I sing of â\u0080\u009cbroken hearted people.â\u0080\u009d Who are these people? What broke their hearts? These are people who are still â\u0080\u009cliving in the world,â\u0080\u009d but grieve for those who are not, for those who â\u0080\u009cmay be parted.â\u0080\u009d They grieve for those who have crossed over. Losing a loved one is like having part of oneâ\u0080\u0099s own heart cut out. It hurts physically and emotionally, but can eventually be healed by accepting what i. Why fight it? Â  Fretting about it, disagreeing with it, eating ourselves up over it, cannot change it. Â  It is not the way to peace. â\u0080\u009cLet It Beâ\u0080\u009d teaches acceptance of Paulâ\u0080\u0099s death. Between the familiar words, I whispered messages. Â I sing, â\u0080\u009cWhisper words of wisdom.â\u0080\u009d Â  Have you ever wondered what words of wisdom are whispered in that song? Â  The subconsciously heard truth to let be is hidden in that song after the words, â\u0080\u009cthough they may be parted.â\u0080\u009d Â  Listen carefully, and maybe even turn that space up louder, to hear the whispered words of wisdom: â\u0080\u009cPaul is dead.â\u0080\u009dHear any other whispered words of wisdom? Â  Do you really want to? Â  Play it backwards. Â  Once, as I entered the studio, not long before writing, â\u0080\u009cLet It Be,â\u0080\u009d I wondered what the words â\u0080\u009cHeâ\u0080\u0099s deadâ\u0080\u009d would sound like played backward. Â  I recorded it, played it backward, and heard something that was, to my Â  delight, compatible enough with, â\u0080\u009cLet it be.â\u0080\u009d Â  Its wisdom, when put together, evoked much of the enlightenment of that hit song. Â  The message is, â\u0080\u009cHeâ\u0080\u0099s dead; let it be.â\u0080\u009d Â  It is time to accept his death and move on. Â  After recording a vocal track forward, I played it backward through my headphones, and dubbed over those words of truth and wisdom: â\u0080\u009cHeâ\u0080\u0099s dead. Â  Heâ\u0080\u0099s dead. Â  Heâ\u0080\u0099s dead. Â  Heâ\u0080\u0099s dead.â\u0080\u009d When you hear me sing â\u0080\u009cLet it be. Â  Let it be. Â  Let it be. Â  Let it be,â\u0080\u009d in the forward direction, I am equally loudly singing â\u0080\u009cHeâ\u0080\u0099s dead. Â  Heâ\u0080\u0099s dead. Â  Heâ\u0080\u0099s dead. Â  Heâ\u0080\u0099s dead,â\u0080\u009d going backward. Â  In this way, I let your mind consciously take in â\u0080\u009cLet it beâ\u0080\u009d at the same time that you all subconsciously heard me express what it is that you should let be: â\u0080\u009cHeâ\u0080\u0099s dead.â\u0080\u009d Â  Paul is dead. Â  Let it be.\n\nUharriet, Thomas E.. Beatles Enlightenment: Spiritually Transformative Selections from The Memoirs of Billy Shears (Kindle Locations 199-207). Peppers Press (a subsidiary of MACCA Corp.). Kindle Edition.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nthis song is about Paul's dealing w/ the Beatles breaking up, it sorta just came to him. this song often helps me deal with situations that seem hopeless. its simple and reminds people that sometimes you just have to let things be and the answer will come out of it\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nThe Song is about how Paul's deceased mother comforts him spiritually in times of extreme stress (breakup of band, personal problems). He said himself that she was a devout Catholic woman.  He also said that he intentionally left the term \"Mother Mary\" ambiguous because of Catholic devotions to the Virgin Mary.  It is NOT about weed.  People who think this song is about weed are probably the same people who think Puff the Magic Dragon is also about weed.  \t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nThere was no religous connection. Mary was his mom. He wasn't a devout catholic either. ANd also its NOT ABOUT WEED!\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nWHAT!!!!!!!!!!! the beatles broke up when did that happen oh well at least John still has his solo career\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nThis song is about the struggle of Capitilism versus Communism. At the time, England was attempting to find its economic identity, being Socialist and therefore in between Capitlist and Communist. There were radicals on either side pushing it both ways. Paul was a Capitlitst, and is singing about the triumphs of Capitlism and how one day Communism will collapse and the world will live in Capitlist Utopia (\"when all the broken hearted people in the world agree, there will be an answer: Let it be). Let it be is a translation of the French idiom Laissez-faire.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nLuke 1:38- And Mary said, â\u0080\u009cBehold, I am the handmaid of the Lord; let it be done to me according to your word.â\u0080\u009d And the angel departed from her.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nIt doesn't have anything to do with Paul's' mom, it was when John and Yoko were trying to conceive a child and she kept having miscarriages, and she was losing her health so they believed it wasn't meant to be. So Let it be, but they finally had Sean.\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nRevelation 22:11\n\n\"Let him who does wrong continue to do wrong; let him who is vile continue to be vile; let him who does right continue to do right; and let him who is holy continue to be holy.\"\n\nPsalm 1:1-6\n\n\"Blessed is the man who does not walk in the counsel of the wicked or stand in the way of sinners or sit in the seat of mockers.   2 But his delight is in the law of the LORD, and on his law he meditates day and night.  3 He is like a tree planted by streams of water, which yields its fruit in season and whose leaf does not wither.  Whatever he does prospers.  4 Not so the wicked!  They are like chaff that the wind blows away.  5 Therefore the wicked will not stand in the judgment, nor sinners in the assembly of the righteous.  6 For the LORD watches over the way of the righteous, but the way of the wicked will perish.\"\t\t\t\t\n\t\t\t\t\n\n"}