{"comment_0": "\nThe song is basically about the rap wars and how much the danger of being hurt or killed by your rivals is highly possible. Eminem sings a little about most of his feuds with multiple artists and the video is just what could possibly happen to someone from his crew due to all of the fighting between the groups. The person that dies in the video actually dies 2 years later after the song was made. He was shot in a bar after shooting someone over a game of pool.\n\r\nThere are some people that he has named, I will try to clarify the situation.\n\r\nBenzino is an older rapper, whom had control over Source magazine for a while and used it to bash on Eminem and even made a new album with a lot of songs directed to Eminem and I'm assuming that Eminem believed Benzino was irrelevant to everything that was going on and decided to try to be on top of the rap game by starting drama with him.\n\r\n50 Cent's feud is said to be started in his words that Ja Rule was robbed out of his jewelry and Ja Rule thought 50 Cent had something to do with it and Ja Rule said that 50 Cent was jealous over the fact that when he was making videos in his 'hood, he got a lot of love from the people there. That's when they started to make diss song at each other with Ja Rule and Murder Inc artists and 50 Cent with his G-Unit. 50 Cent was nearly killed after being shot 9 times. It's said that a local drug kingpin sent the hit after 50 Cent made an album that exposed Murder Inc's illegal activties with the said drug dealer. It's also believed that the same drug dealer killed Jam Master Jay for helping out 50 Cent make and send the album and pretty much taught 50 Cent how to actually make music. 50 Cent later joined in Eminem's record label and Ja Rule threatened Eminem and Dre to not make any diss songs about him and they didn't until Dre produced a 50 Cent song that pretty much destroyed Ja Rule and his family and that's when Ja Rule came out with ''Loose Change'' and it was directed to Dre and Eminem and people from their labels and that's when Eminem/D12, Dr. Dre, 50 Cent/G-Unit battled Ja Rule/Murder Inc and other artists for a while. There was a time where Dre and Eminem talked with 50 Cent to try kill the drama with Ja Rule, but Ja Rule was talking and joking about how he was the one that stabbed 50 Cent in a club and that continued the fued. It was actually Black Child from Murder Inc that stabbed 50 Cent because he thought he was pulling out a gun.\n\r\nNow to the Suge Knight thing. Eminem wasn't afraid of Suge Knight, he just didn't attack Suge Knight out of respect for his friend Dr. Dre who told him to stay out of it because it wasn't his beef and wanted to do things by himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI don't usually listen to Eminem, but these lyrics are so raw and real I just had to comment. He talks about trying to be the responsible person in a world of immature rappers. He doesn't want to lose his temper but when the people he cherishes the most are involved then it's war. He just sounds so mature, and I like how with this song he basically says how he knows what's right from wrong but he will fight to the end for his loved ones. Good job, E!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\neminem is right... ja is a tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\n2 comments above say it all! Great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI love how angry he sounds in this song. This song is simply amazing. Amazing. I bet he felt so much looser after writing this song, he let out alot of his rage and thoughts in this. Congrats Eminem, this is just another song that proves you're the best rapper the world has ever seen.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIncredible. Incredible.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nJa Rule's song that said that stuff about Hailie was called Loose Change (a freestyle).\n\r\nThe line was \"\"Em, you claim your mother is a crackhead and Kim is a known slut/So what's Hailie gonna be when she grows up?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ncool song....i like the way eminem is rapping faster on this cd\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nTHIS IS ONE OF EM'S BEST SONGS,LOVE IT!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nto can u keep up \r\nwhy do you hate eminem so much? He is making something of his life. He is trying to create something good out of something that was bad. How can you rank on someone for that? A lot of people like his music so he is good for something. He is not out there shooting people or throwing away his life. He's speaking out against it. Some communities are not in very good condition and we need people like eminem to inspire people and have something to hang on to. What we don't need is blind hate. You look completely one sided. Maybe you should open up your mind. I am not saying you have to like it but at least respect it. Its art don't trash it.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI just started reading comments--Wondering why people act illiterate when making comments about hip-hop music.  This is not what Hip-Hop is-- stay in school people. It is real hard to read reviews that are not english.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nUNless he is writing from the heart, eminems raps suck, this is one of very few songs on this album i like, before this one most of his songs were fromthe heart ergo good.  This is by far his best song to date, and clearly if any one has any doubt , he said \"Suge\" .\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n3 words : I LOVE IT\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni got a question did ja die or something ? what song was it that ja said about halie? weird so many but yah this is a sad and great song and i respect that\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nHum i didn't know the line, thanx for sharing Theo Reo ! AWWWWsssuuummm one\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nBest song on his new album\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nHe keeps talking about a coffin - did anyone in his/another's crew die?\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nHe doesn't want it to resort to the 2Pac-Biggie level, because it could easily head that way with how personal the whole feud is.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nAMAZING song. I'm not even a huge Eminem fan, but this song blows me away.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis song is awesome. Definitely one of my favorites. I absolutely love the new CD\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song is bigger than a beef between him and Ja... this is out to everyone he fought with. Particularly ICP, for any that don't know ICP, Eminem, and Kid Rock used to be little homies back in the day... then they got into a fight and split up and ICP and Em have been fighting for 11 years and now this song is his apologie to everyone\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\n\"It wasn't my intentions, my intentions was good/\r\nI went through my whole career without ever mentionin' (?)\" \n\r\nI'm pretty sure the (?) is \"Suge\", referring to Suge Knight. \n\r\nEncore is pretty weak, but this song is amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni was wondering about that (?)\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\n(?) = Suge\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nHe's talking about how out of respect for Dre, he will stay out of Dre's business with Suge, and he hasnt mentioned it his entire career.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nya thats why the ? is there cuz dre dosnt want him to get into it the ? is there for effict so he dosnt say the suge\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nand yes someone in jas crew was killed\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\n\"It wasn't my intentions, my intentions was good \r\nI went through my whole career without ever mentionin' (?)\"\r\nthe (?) is definitely for suge, since he talks about it being dre's beef, and suge is the only logical thing that rhymes with \"good\"\n\r\ndamn, eminem amazes me with every new song like this, i personally think he is the greatest lyricist of ALL TIME.  all respect to 2pac, but i think EM is catchin up to that legacy, while they are both completely separate sides of the genre:  pac was gangsta while em is pretty much a white-pac who has learned from pac not to get involved that deeply in the game, as he shows even more in this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\n...also, another thing that amazes me with em is how he can do a song like this one, then come up with 'Ass like that' next.  goin from deeply serious to kiddishly hilarious without anyone thinkin any different is awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthis song is  amazin em iz so cool and hiz ryt ja is a prick bring hailie in2 it is really really other steppin the mark\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nIn the video, Proof has been shot and the doctors are trying to save his life while Eminem is in the waiting room.\n\r\nHas Proof had any beef with anyone that might've gotten him shot? I don't understand.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nAwesome video...complex and I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nIncredible Song!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nim as bad as v1cious... lol no offense or nething v1cious, but y r dey showing proof being shot? and halie... is she eminem's daughter? and hu is eminem's wife? i mean de 1 dat got him halie...o and the (?) is niggers. Trust me, he never said dat before, and he also blocks it out in  dis video cuz he never wants 2 say that...ppl plz answer my questions...PLZ!!\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nzion, please don't talk like that...It annoys the hell out of people.\n\r\nHalie Jade Mathers is Em's daughter, by Kim.  Kim is Em's ex wife.  They had Halie the year they were married, and after a while got a divorce...He got joint custody of Halie.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nHere I was thinkin' Eminem started all the mess with Ja...I guess he started thinkin' about how people he cares about could get hurt, and he's tryin' to stop that from ever happening.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\n\"my bum is on your lips\" was a quote from a tom green song anyway... I think this song is pretty general, but i was wondering what was 50's beef?\r\nwhen i sing the chorus of this song in my head, it always turns into \"nancy boy\" by placebo, which is rather unfortunate.\r\nalso, is suge the same suge that owned tupacs record company, and who some say shot him?\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nActually mosh is a shitty song and is an obvious ploy to cash in on the anti-bush fad\n\r\nand just lose it is awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\njust lose it sucks ecspecially the \"argh argh argh argh\" I agree with crimsonlotus, Like Toy Soldiers and Mosh are the best songs on Encore.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI don't even like this song that much.  My favorites are Puke, My First Single, and Rain Man.\n\r\nYou assholes quit looking for meaningful music in hip-hop.  What, you think he was gonna' inspire you to write a best-selling novel?  Shit, God knows I don't listen to rap for the lyrics, and if you do, you are a homomuffin.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\ngood song, love the snare\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nif you all listend close em and ja didnt have bef untell a lil it was benzeno who talked about halie in one of his songs and when it show proof in da hospitol it a medafore sayin he dont want no one in his crew to get killed and the (?) is suge because he refers to every ones beef (50 vs ja),(em vs benzino) except fp dre and dre beff of course is suge because suge tried to have dre killed and tryed to take control of his lable ext.and em is not hip-hop he is rap they are to diffrent things (no affinse em) if you want toknow what hip-hop is download or buy a mos def cd or atmosphere ext. and this is a really good song but u have to listen carefully to fully understand it and jinx mosh is a great song it is truly about bringing the amrican troops back from fighting a pointless war but maybe you dont like it because you like bush ionno but that what the song about and one more thing about toy soilders in the middle of the song you can hear him refer to source magazine co owner and that is benzino and the (?) could not be nigers because benzino latino and why would it be that when his whole crew black? yall need to  think before yall say something!! and when zion said he never said niggers you wrong do you remember when benzino and em beff started it was because he was talking about a black girl and he calls her a stupied nigger and some other shit and he reers to that in yellow brick road so it cant be niggers so there fore it is suge ^_^ well im out  1 love dis grayzie azn nikka out pesh\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI'm not gonna let someone elses coffin rest on my conscience \n\r\ni would say this line means that he dnt wna feel responsable 4 wa appens 2 uva peps.\r\naka if he was to say wa the ? means he cud cause a deaf e.g. a coffin cus sum1 tha dnt no bout it cud be pissed n kill hu eva ? is. \r\ni love dis sng almost as much as i love mocking bird i think that these 2 sngs show hes real side not the side that he shows in public but the side his family c e.g. hailey n lainey \r\nn i tink that u do afta listen 2 d lyrics in rap spesh eminems cus he sed tha his music helps him deal wi his past n sort his head out. n by readin d lyrics u learn the shit tha he wnt thru as a kid n the shit he is still goin thru lyk the way i am he dnt wnt peps cumin up 2 im in d street he wnts a norm life were he cn provide 4 his family n not live fearin his life at d same tyme. or atleast thats wa i tink i may b rong!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nBest Song on the new album \n\r\nalright for every who is confused about the (?) and thinks its \"n*ggers\" hopefully this wont be too far over your heads ...... try to fit \"n*ggers\" into the verse an ask yourself .... DOES THIS RHME RIGHT?? .... answer --- NO   then plug in SUGE into where it says (?)   WOW its rhymes ... well i guess we got that figured out\n\r\n-----------------PEaCE\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nNo Eminem is really good at his songs & his lastest one is good and all his other ones aswel\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\ni noticed Em didnt make refrence to the Cage beef at all\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI just heard this song for the first time and saw the video. It explains a lot, some guy on em's crew got shot for something em said or did and died. Sad wonderful song and I usually don't say that about em\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI love this song, I would also like to add thanks to hiphop is mylife for clearing up most of the lyrics\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nGood song, but I find it hard to take him seriously about not wanting to start beef with anyone. That's how he got so damn famous. He beefs with anyone and is usually unapologetic about it. This certainly isn't how he's always felt.\n\r\nAlso I think the ? is Suge, and whoever said that this is his apology to ICP and other artist he's beefed with, what the hell are you thinking? How do you make that out. Even if he and ICP were suddenly cool with each other I don't think they'd let on to anyone. They both just made more money off each other and their beef. Why would they change that. Shit, every Juggalo in the world would probably just spontaneously combust. Who would they mindlessly follow then?\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\ni love this song...love em 2 bits!!\r\nbut im confused.....>>>did sum1 die?? wt happened between em and benzino....?? and who said that line abt hailie?? benzino or ja rule?\r\nalso/....what does it have to do wiht proof dying? why is that in the video??\r\ncan someone pleaaaase let me no????\n\r\nand guys this song is really good...encore is his best album yet..i love puke, evil deeds, asss like that and likr toy soldiers.....no1 can do rap like em can!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\ndee mandy, rule was the one who dissed on hailie, and proof was threatened that someone was going to shoot him and it almost happened so they decided to put it in the video or sumthin like that i dont really remember how it went. \n\n\r\nANYWAYS.....\r\nTHIS IS THE BEST SONG EVER MY BOYFRIEND PLAYED THIS SONGHIS BROTHERS FUNERAL, THIS SONG IS REALLY STRONG AND I LOVE LOVE LOVE EMINEMS ALBUM ENCORE ITS REALLY INTENSE AND IT LOOKS LIKE HE PUT ALOT OF WORK INTO IT, (NOT SAYING HE DIDN'T PUT ALOT OF WORK INTO HIS OTHER ALBUMS, BUT YOU KNOW WHAT I MEAN).. TO ME ALL OF SHADYS ALBUMS MEAN ALOT TO ME, I DONT MEAN TO START DRAMA BUT I CAN REALLY RELATE AND I KNOW LOTS OF OTHER PEOPLE CAN RELATE TO, EMS MUSIC IS WAS TIGHTER THEN MOST OF THESE RAP ARTISTS OUT THERE.. ALOT OF THEM LIE IN THERE LYRICS AND EM JUST GOES ALL OUT AND SAYS THE TRURTH BECAUSE HE LIVED(S) IT!! i LOVE EM!!\n\r\n~!natty!~\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis cd is good and Eminem is proving that he is one of the best rappers (and lyricist) of all time. His style and passion separates him from all of the weak ass bitches that call themselves rap artists. I like the meaning of this song because it is serious and shows that he is smart and does respect others. \n\r\nReverand TM \"Only a bunch of ignorant rappers go about doing this sort of thing. Importance to music and culture in the future: zero.\"\r\nReverand you obviously live underneath a rock or inside of a fucking cave because rap is important to our culture and to music. It is people like you and other lame critics that try to \"ban\" his songs or try to keep kids from listening to or buying his music. Rap Haters and critics are just scared that we (the listeners) will actually listen to what the rappers are telling us to do. Rap is portrayed as being a terrible, malicious thing, but in reality it is just an honest way of expressing thoughts. We listen to people like Eminem because we can relate to him because he isn't fake and uses language that normal Americans can understand. (We don't have to be talked down to, but in order to associate and relate with people of high power we need to understand where they are coming from and what message they are giving, and that is what Eminem does)...Edited by random_monkey on January 29 2006, at 08:52AM\n\n\n", "comment_52": "\nthanks north*star*babe!!!\r\nsorry RonArtest 91....i will try and write in correct english.....\r\nthis song is one of the best on the album according to me.!!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nfuck u ronartest 91 the \"gibberish\" we rite is just a faster way of riting things dont u just luv the way i misspeled stuff:) (im not really that stupid)\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nIm an asshole.Hence,my name.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nProof does play the person being shot in this video but it not supposed to be proof It is supposed to be the original 6th member of d12 BUGZ .. what surprises me is that no one knew that. True proof did almost get shot .. but bugz was the one who DID get shot and died thats why they have the funeral scene.. come one now people\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nRonArnest Jesus your full of urself lol this website  isnt about u being an asshole!!\r\nAnyway really enjoyed listening to dis tune he is an inspiring writer :) \n\r\n(gwon pinkpony u knows da score lol)\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nman... 3 words... MAD AS!!! \r\ndude!... 2 words... this song roks!\r\nyeh... this song is pretty kool yeh?\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\npeople who hate eminem..dont know what hes been through...his songs are powerfull and meaningfull....\r\nso...yeah....hes saying what he believes in and we should all respect that..its not easy doing what he does...there are so many people who hate him and criticize him...but i love him..and i know there are so many otheres thta do....we love ya em!!\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\ni have a question, maybe this was already answered- and if it was, im sorry, but what does he mean by \"Some receptionist at The Source who answers phones at his desk \r\nHas an erection for me and thinks that I'll be his ressurection\" what is he saying with that?\n\r\ngreat song by the way!\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\ni luv dis sng heaps!! its nw my fav!! luv em!! hes nt afraid 2 spk out abt wot he finks i fink ppl shud look up 2 hm. i agre wit ronarnest. dis sng reali means sumthing its veri strong. em dsnt make up al dat shit abt hs life & wot hes bn through, lyk sum otha artists, & ppl cnt c dat wot hes saein is meaninful in a gd wae. ppl shud respect hm mre 4 wot he belives in. ntha fing -rap is thought of as bd in society, its jus ntha wae of exprezin urself, & there r so mny ppl out there hu luv it. stp tryna ban his musik.frankly i luv hip-hop, r&b & rap i dnt c anyfink rong wif it? keep da musik plaein!! i wud lyk 2 no mre abt dis sng i dnt reali understand it, & i luv da chorus!! its such a strng meanin in depth. by da wae is dis an american site? woz wonderin -is em reali rivals wit ja in real life? em ddnt reali kil ja? wot r these wars wit rappin? alot of dis sng i dnt understnd. da sng is so sad, bt its reali kool i luv it heaps!! i luv eminem u rock!! u amaze me wit how u can cum up wit  such a brilliant sng!! and da meanin woz wot reali inspired me, keep rappin u ROCK!!\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\neminem is great ja rule shouldjt say that stuff\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nwat hes saying is people are messin around with innocent things and makin stuff worse ...i think\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nyea, ja shudnt sae shit bout hallie. wen u gt famli involved its jst goin 2 far.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nReverendTM on 12-30-2004 @ 09:01:57 PM\r\nStupid email, reverend.\r\nYou must think you're really funny.  But wait.  Your email lacks creativity and the thing about mediocrity is taken from Maddox.  Based on that fact, I doubt that anything else you write is your own either;  I'm sure most of your writing is based on something someone else wrote.  Good job, you can plagarize!  Take a class in creative writing and learn to develop your own style.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nWhy does everyone seem so bent on dissing EM? Lay off the guy people. He sings from his heart in this song. So, does anyone know what the lines: Step by step heart to heart left right left, we all fall down like toy soldiers, Bit by bit torn apart, we never win, but the battle wages on for toy soldiers means?\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nI, too, hate when people write horribly, just to make the trasition from brain to computer faster. Anyways...\n\r\nThis is a good song, very sad though. I have read a lot of theory's here, but I really don't understand what is going on with Eminem, and others, and who was the man in the video dying...\n\r\nBut it is a good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nStop dissing him.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nJinx-I loved Mosh and I am a Bush fan. I am glad Em knows how to speak his mind instead of rapping just about sex and drugs. And Like Toy Soldiers was the koolest song that I think he has ever done!! I LOVE Em and hope he continues with his work. Great album Encore is!!!\r\n-Aj\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\ni still dont understand what the songs about who died what happened email me at chattyjaxs@yahoo.co.uk and tell me what happened\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nhots song tho\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nWhat does toy soldiers mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nEminem was dissed by Ja Rule in Loose Change. I posted the lyrics on here check them out I think they're right :-s\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nEminem was dissed by Ja Rule in Loose Change. I posted the lyrics on here check them out I think they're right :-s\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nTHat still doesn't tel me what toy soldiers means.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\neminem can never back out of his beefs. i love the song called \"shit hits the fan\" cuz almost every rapper could kick eminems ass. and snoop dogg is a little weakling too. DMX can take all of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nWhat does toy soldiers mean?!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nWhat does toy soldiers mean?!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\n********ReverendTM ********\r\nThis comment is specifically aimed towards you, no point in replying back on the message board because firstly i couldn't give a shit, i only wanted to know what Eminem's song Toy Soldiers was about instead i found alot of people writing a load of bollox unrelated totally to the message board. \n\r\nUnfortunately i'm going to have to do the same to get my opinion & point across TO YOU!!!\n\r\nI personally couldn't give two shits if you slagged off Eminem's musical talent, or anything else he has talent in, however i will pick up on a few points you seem to be making on this message board.\n\n\r\nThe first would be\r\n1) \"Tupac, BIG, and everyone else died not because they are martyrs, but because they were a bunch of idiots who thought the only way to resolve a conflict is to kill the opposition with lead bullets\"\n\r\nFirstly 2pac didn't shoot Biggie neither did Biggie shoot 2pac so that little comment you made was err whats the word you use \"zero\" \r\nSecondly the fued between 2pac & Biggie was escalated particularly threw the media Oooo hence freedom of speech threw the Media Industry. *Tuts* Funny when the EXACT same things you mention to other users on this message board are thrown directly back at ya. <\n\r\nAnother point is that 2pac & Biggie are legends even if you choose not to believe this. 2pac & Biggie are legends to the Rap Industry, no-1 can replace them as they DIED for what they believed in. (See Various Religions such as Islam, Hinduism, Sikhism, Christianity) ;)\n\r\nSecond Point is\r\n2)\"but it doesnâ\u0080\u0099t necessarily mean what they have to say is significant. For clarity, my argument is that a significant portion of â\u0080\u0098rapâ\u0080\u0099 music is detestable.\"\n\r\nThat rap music is detestable?? \r\nOK firstly if you dont like rap music why the fuck are you writing a review on an artist who is a RAPPER, if you find the genre, rap detestable. \r\nAnother point i picked up on you was when you type your reviews, whats the deal with you adding things like (see US Supreme Court) bla bla bla bla.\r\nWHO GIVES A FUCK, you think your reference to backing your answer is making you text sense? \r\nHELL NO....NO-1 GIVES A SHIT!!!!! & BTW we aint in a fucking court case, your opinions your opinion. \n\r\n3) & Finally my last point\r\n\"As a civilised person, I don't see how settling verbal disputes (or â\u0080\u0098beefâ\u0080\u0099 as you people call it) must always end in violence.\"\n\r\nPlease define the word \"Civilized Person\" & \"Ordinary\"\r\nSomeone who has an \"Ordinary\" house and works in an \"Ordinary\" job, works 9-5 has a wife and kids & the family is in perfect harmony\n\r\nIs that a \"Normal\" & \"Civilised\" person??? \r\nAlso wtf do you mean \"BEEF as YOU people call it\"\n\r\nWould you like to explain what that means \"YOU PEOPLE\" \r\nAre we less \"civilised\" than you as you count yourself \"Ordinary\"??\n\r\nPersonally my OPINION (as i am allowed to give one unless im libel) is this, your opinion on this song is not needed. If you have nothing good to say and do not listen to Rap or Hip-Hop dont bother commenting on something you know nothing or very little about.\n\r\nKind Regards \r\nX-T-C\n\r\n>8D\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nAnyways, I was wondering if any of you know the significance of the comments regarding the receptionist at the source? I understand the rest of the song (and its definitely suge... pronounced 'shug' for those of you still questioning it) but I am still lost at the source reference. If anyone could help that'd be great.Edited by random_monkey on January 29 2006, at 09:06AM\n\n\n", "comment_80": "\nthis song rox and the lyrics are so good. its a song that deserves respect\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nWHAT THE HELL DOES TOY SOLDIERS MEAN????????!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nSaragirl, its a metaphor you dumb broad.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nHey Guys,\r\nI'm new to these forums, but I do have something to say. I use to hate Eminem I didn't get him but the more I listen to him and his songs the more I started appreciating his lyrics ( not all the time) but still he does have some great songs and this is one of them! \r\nIt really touched me, and for those that say that because itâ\u0080\u0099s rap that there isnâ\u0080\u0099t a meaning behind it, what does the kind of music have anything to do with lyrics! \r\nLyrics and lyrics, theyâ\u0080\u0099re soul purpose are for the meaning, especially in Eminemâ\u0080\u0099s case! \n\r\nAs for the meaning behind it I think that everyone that knows about the war between West and East coast that has been going on for ever is what this song refers too. Heâ\u0080\u0099s coming back to the Biggy and 2Pac tragic story! As for a few of you that seem to have problems spelling, my problem isn't with the spelling mistakes, I mean come on it's not because you have a 5th grade education that that means you can't make mistakes so quit thinking that you are perfect! \r\nBut honestly it is not because hip hop is your life that this means you have to take the \"rapping lingo\" into your own writing it makes us not want to read what you have to say since we can't really understand it.\n\r\nLast comment I have to make does any one else find it ironic that we are discussing a song that talks about rivals, beefs and hate and about being the bigger man and a lot of whatâ\u0080\u0099s on here is exactly what heâ\u0080\u0099s talking about! Freedom of speech is something that we are lucky enough to have but itâ\u0080\u0099s up to our common logic and respect to put that to good use. We should not use it for evil but for good   \n\r\nNo one is better than anyone else and those who feel they need to put people down to feel better about themselves usually have a self esteem problem and itâ\u0080\u0099s not Ok when I was in 5th grade my mother taught me if you have nothing good to say donâ\u0080\u0099t say anything at all, so all these comments about education and I am better than you all is really uncalled for! \n\r\nI am waiting your comments for Iâ\u0080\u0099m sure Iâ\u0080\u0099ll get some donâ\u0080\u0099t worry I can take it but I just find all this name calling and swearing isnâ\u0080\u0099t worth it!!\n\r\nAll in all I loved this song and this side of Eminem I love! Thanks for the listen everyone! \r\n:)\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nthe sorce is a hip hop magazine which benzino is always said to be a founder of (he wasnt) and id say from the lines \"some receptionist at the source who has an erection for me and thinks that ill be his resurection decideds to blow the dust of his mic and make a new record\" theres an ex hip hop artist, (retired whatever) that is no longer ex (retired) because hes made a new record, and fucked the game up -correct me if im wrong. spelling mistakes, in correct grammer, typos, lack of punctuation, etc. dont mean someones not smart, (in my case just lazy) no respect to anyone who disagrees, and anyone who doesnt like em, just dont post a message, save ur time and everyone elses\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\ni love eminem so much, i cried when i saw this music video. em is the best thing that ever happened to rap, anyone who cant see that is just plain stupid. this guy is brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\ni love eminem so much, i cried when i saw this music video. em is the best thing that ever happened to rap, anyone who cant see that is just plain stupid. this guy is brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\njust for those of you who dont know. The chorus \" Toy Soldiers\" is a smaple from a popular 1980's song called \"Toy Soldiers by Martika. It is not original. I think what the whole toy soldeirs thing in this song means is that they are all toy soldeirs, or pawns, in the music game and are somewhat told where to move and what to do next as it is best for sales, publicity or whatever\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nand I think that perhaps eminem has enough foresight to see where it gets people and is trying to stop it before it gets out of hand once again since labels could give a rats ass about musicans\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nHEY SARAHGIRL\r\nthe original song is about  drug addiction. Toy Soldeirs cant think and move only when theyre told to, and the lyrics state that they never win and they all fall down. Take it for whatever you like\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nem did not make up the chorus himself, it was taken from a different song because it relates to what he is singing about. i still love him and i think that this is by far the best song on enecore and possibly his best song he has ever done in his entire career.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nRonArtest91-  i couldnt agree with you more\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\ni love this song so much - its fantastic snd his new album kicks ass. everyone keeps asking if someone died or summit - am i right in thinking that in this song eminem is saying enough is enough and i dont ant anyone to get hurt or killed? - he says tht he's willing to bethe bigger man and there is no wy he would let it get as far as anyone being killed am i worng or what????\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nyour right fairy dust\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nThanks to Vu Ki Na To R 32 for sorting out the blatant (?) thing.\n\r\nAmazing music video, I didn't know any of the people in his crew, any arguments or anything, and still felt drawn into the situation. Snare drum/chorus/main lyrics are amazing, takes some listening to, but you'll get it in the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nomg if u like eminem you have problems. even more so if you stress about wat the hell his stupid songs mean. honestly it sounds more like eminem trying to convince himself that it wasnt his fault that any of this shit happened. you should try some slipknot of marilyn manson or lamb of god. they are the shit\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\n1st off - this song is incredible..most meaningful joint em eva put up\r\n2nd - the (?) is Suge Knight, the managing director of Death Row records who dre has huge beef w/...it is not anything to do w. n****...if u think it is get over it\r\nand to the person rite above me (phermone cult)\r\nu like slipknot and marilyn manson and hate eminem....y r u on em's page then...go cut urself thats always a good time rite?\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nRather than reply to what you wrote specifically to me, I just have a question. If you are so sure of yourself and so proud, why did you feel the need to write a 2000 word essay on how you're right so you could win an argument on a website dedicated to songmeanings? I mean, you don't really listen to what people have to say and are stuck in your own stubborn definitions of things. I mean, you feel the need to supposedly keep score for yourself in these meaningless arguments. All I can say is, your repressed anger may or may not be from homosexual encounters (although the derogatory terms you use to attack both people of different races and homosexuals alike suggests that you are likely not only homophobic but also racist, or possibly afflicted by homosexuality and a racial inferiority complex) but your anger clearly stems from a massive inferiority complex of some sort which requires you to attempt to force your views on the world on other users of the \"Like Toy Soldiers\" section of songmeanings.net.\r\nKeep racking those points up for 'winning' the arguments that you are supposedly having, and I hope that those points help you make up for the fact that you have no life.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nAlso....I am still dumbfounded by the fact that you attempted to construct an argument around generalizations such as \"Africans are good athletes\". \n\r\nI'm pretty sure that one is right up there with \"Italians all love meatballs\" and \"Everyone in Tennesee lives in a mobile home\".\n\r\nYou talk like a condescending prick, but your arguments hold little or no water and you often make yourself look stupid.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nim only on this cause i have to do some supid project for school. my teacher like this song but he also listens to the beatles religiously and watches notre dame football reruns. so what does that say about the rest of you weenies listening to eminem. who calls himself fuckin slim shady. hes jusss a white guy ripping off blakc people and makinga shitload of money. secondly, juss cause i listen to slipknot and mm dont mean ima cutter. cutting is a stupid thing to do, even for ppl  so stupid  ass yourself, dyn4sty. your juss a person who like stereotypes. weenies such as you should ditch this widey-tidey and get sume fuckin slipknot. they are the shit n u noe it. unless you are not willing to admit it. then juss keep listening to this piece of fuckin shit. thanks for playing\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nI think this song is awesome, aong with mockingbird, two great songs!!!\r\nAnd i'd just like to sat to that ReverendTM person that you keep going on about how other people spell and stuff, and how you never spell wrong, \"why every for years, at the Olympics\", when your refering to the number 4 you actually spell it FOUR, not FOR lol fool.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nreverend u really need to get a life and get overself most importantly. i didnt read your whole post because i have a life, unlike some ppl, and i don't have the fucking time to sit here all day reading shit that was written by some dumbass who has no clue what hes talking about. all im gona tell u is that, just becuz we are on here not writin in complete sentances and spelling wrong does not give u a reason to diss eminem. if u dont like him, get off this motherfucking page. its meant to discuss the meaning of his songs, and if u dont like him u shouldnt have even come here. get the hell out and shut ur fucking face up, for all we know u are probably not even some sophisticated business person like u say u are, not that anyone gives a flying fuck if you are or not. so im gonna keep makin spellin errors and write in incomplete shorthand sentances just to piss u off, cuz this is a message bord online, not a damn classroom. get over yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nover urself**\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\n'try to proff read you paragraph before you send it... '\n\r\nWas that supposed to be funny? Or are you actually that dumb? \n\n\r\nAs for ReverendTM....honestly...I don't feel the need to give you a counter-argument. As a law student it would be easy and probably productive. As a university student though I am dismayed at the amount of time you've spent writing on this board. Regardless of where and when you wrote it, I am going to spare you a counter-argument so you can spend some of that time going out and seeing what the world is like outside of your own ignorance and ego. Go see if you can find some girl who is dumb enough to get with you for a bit and prove to us all that your repressed homosexuality is just a myth...\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nhi this song is hot and me and em met once wen i won a competition my mate was so jelous\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nI logged in to this site originally because I felt unclear on some of the issues that were referenced in the song.  I originally thought that the sampling of Toy Soldiers by Martika, being someone whom is old enough to actually remember the original song,  was created, although at times there were somewhat disjointed transitions.  I've always been a fan of Em's lyrical ability.  That's not to say I've always been a fan of the specific lyrics or their content, implied or otherwise.  I believe that he is one of the most talented lyricists in any musical genre to have come along in quite some time.  Ability and talent are present regardless of how they are used.  It could be said that some of the more comedic songs squandered his lyrical talent with meaningless tyrades, but it could also be said that he just wanted to have a good time with his abilities.Edited by random_monkey on January 29 2006, at 09:16AM\n\n\n", "comment_106": "\nit's a good song but.... did he try to tell us to not go to war. jimmy[eminem] was telling u not 2 go 2 war and he is reaching out 2 all rap and gangstas and just normal people not 2 go 2 war.people loose family every year and he lost a family member in war he is telling u not 2 go 2 war so listen all people and dont go 2 war.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI am 18 and graduating from high school this year, and I have visited ten countries. Just thought I'd add that in to show Reverend what a close-minded idiot he is for assuming that he is better because he is in college, knows how to spell, and claims that he has travelled the world already. Sorry, kid, but we are all created equal- if you're so smart then how come you make the mistake of thinking that you are better than everyone else? A person who really was as smart as you say you are would at least have the decency not to claim they are better than other people they don't even know.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nYou still didn't answer his/her question. 'if you're so smart then how come you make the mistake of thinking that you are better than everyone else?'\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nTHAT is just more proof that you arent as smart as you say you are. you say that I didn't pay for my travels to other countries, that my mommy and daddy paid for them. when i travelled to most of these places, i was under age 16 and not able to get a job. even so, i worked my butt off to get the money for it and i won't have you tell me who i am or what i have done in my life. most of the money i raised singlehandedly without anyone's help. i raised this money by doing tasks as car washes, garage sales, and auctions. after school every day i presented to businesses in town and requested cash donations from them. i raised $4000 for my 3-week long trip to Britain last year. I raised this myself.\r\nAnd just because someone has travelled to \"more diverse\" countries does not make them a better person.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nthe chorus of this sounds like a toyota commercial i seen..\r\n\"toy soldiers\"\r\n\"Toyota\"\r\nit fits when you hear it hahah\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nI'd just like to say that i'm not a fan of Eminem's music but he is really talented at writing lyrics. And please stop arguing, all of you, lol\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nDunno if its beenmentioned but its definitely Suge, the blank bit refers to, as he sung it live.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nomg u ol stupid, eminem has produced nothing but shit with the exception of lose urself. this song sux balls. there is a diference between \"the shit\" and \"shit\" and this wangsta is the latter\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nI have been a fan of Eminem's music since I was in grade school. He is an awesome lyricist and truly has talent. The reason he is so popular is not solely because of his persona or lyrics, it is because he made something out of nothing. Growing up in Detroit may not have been the easiest lifestyle for Eminem when he was a child. This is what inspired him to become what he is today. He doesn't make music to please people, he makes music to vent his emotions, speak his opinion, and/or just have fun with his musical talent. I stumbled across this site because I was curious as to what word was edited from the explicit version of Like Toy Soldiers, but I didn't expect to find so much controversy. Take Eminem for what he is worth to YOU, for everyone is entitled to their own opinion.\n\r\nI'm sure Eminem's music serves as a motivating/comforting factor for many underprivileged youths who know exactly what it was like to grow up in similar households. For others, it may just be entertainment, however, to those that it truly means something to, don't let so-called \"educated people\" dictate what is good or bad music. Often times these critics have never felt what it was like to come from nothing and become something.\n\r\n...and that's all I have to say about that.Edited by random_monkey on January 29 2006, at 09:24AM\n\n\n", "comment_115": "\ni agree\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nim not a big eminem fan but after hearing the song \"like toy soldiers\" its opened my eyes about how talented eminem really is. i thought the whole biggie vs tupacfued was fucked up and i for one was devastated when they died over something so small. i thank eminem for bringing out this song and reminding people today what namecalling can lead to. i think ja needs to wake up and realise exactly what is going on. and to reverendtm. IF YOU DONT APPRECIATE RAP MUSIC THEN FUCK OFF OUTTA THIS FORUM!!! NO ONE WANTS TO HEAR YOUR SHIT!!!!! top song eminem job well done\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\n\"The loyalty to us is worth more than any award is.\"\n\n\r\nI think everyone needs to think about that line, in relation to their friends.\r\nStay true.\r\nXO,\r\nJamie\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nAight yall...here's tha truth...coming from a Juggalo...I personally Hate Eminem....but when i heard this song on the radio I was like Damn this mother fucker finally made a song i can bump....and I wanna let yall in on some shit...Eminem disses Ja and Tha Benzino about what like 40% of his songs?....and about 45% of his songs are meant to them and the press...BUT...how many times have you heard Em rip on ICP...If yall didnt know Back in the day Eminem used ICP to gain a fan base....rememebr the Flyers that read *ICP may appear*...so all you Haters Can Ryd on Muh Nizuts\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nReverendTM,\r\nThere are a few mistakes you made, that I thought you would like to know about.\n\r\n\"Anyways, he tries to take this seriously, so can be respected, and rake in the cash.\"\n\r\nIn this sentence you forgot the word, \"he\". It should be written as follows, \"Anyways, he tries to take this seriously, so HE can be respected...\" (Emphasis added).\n\r\nIn this next sentence,\n\r\n\"Too bad the the only song that sell are his songs with lyrics \"my bum is on your lips\". \n\r\nThe word \"the\" was written down twice. You wrote \r\n\"... the only song that sell...\" it should be \"songs\".\n\r\nFinally, in this last sentence that I will quote you on,\n\r\n\"Plus, even if this was a serious song, what kind of people go about off-ing one another as a result of a verbal dispute.\"\n\r\nThe word \"Plus\" is not necessary and you forgot to use a question mark at the end of your question.\n\r\nWell,\r\nI certainly hope you find my critique helpful.\n\r\nNicole.\n\r\nPS If you are perfect, then why did you make so many mistakes?\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nReverendTM,\n\r\nPlease do not take my critique the wrong way. I am not trying to say that I am better than you or anyone else. I was simply trying to remind you that you are a human being, imperfect as the rest of us are. I know I made some mistakes in my critique. If you should point them out to me like you do to everyone else, I am not going to give you the satisfaction of seeing me get upset over it. I will take your response and learn from it. That is how we become better people, we take our mistakes and learn from them.\n\r\nOn a different note, I like this song. I think that this song is one of his better songs.\n\r\nNicole.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nI am a big Eminem fan since before he was famous, I used to go to his underground shows, back in the ICP and Kid Rock days.\n\r\nEm's feud with ICP is more a comical thing, ICP poses no threat to Eminem and vise versa. They simply had a fallout and cannot work together, so they chose to work against eachother. Suge is the (?). But you want to know something, it's actually quite obvious? Eminem doesn't want to be another victim himself especially, and Suge is not somebody to mess with, Suge is a murderer and a bully. That's why Eminem won't mention him, despite Eminem hates the guy and is afraid of him.\n\r\nEminem has always had a very dark sense of humour, most of his rhymes about other people were indirect blows, usually funny ones...he made a whole track of ICP giving oral to eachother...that doesn't mean he's apologizing for it, they wouldn't kill him over it, they probably laughed and got a little pissed off.\n\r\nThe Ja / 50 thing is obviously a big focus. Ja had the audacity to throw in verses about Em's kid, what kind of punk is Ja? I would knowck him out myself if he wasn't surrounded by protection all the time. He basically said \"Your girl will be a whore and an addict\", despite the fact that Em is a great father and she will grow up to be just fine. Possibly with minor troubles as all famous people's kids get, but she will not be like her mother unless Em loses his custody (which will never happen). Even still, Kim is recovering from her issues, Eminem saying the things he has about her doesn't help, but in a way she deserves it.\n\r\nAnyway, I'm getting off topic. Let's talk about 50 for a minute. 50 had two major attempts on his life just because he was good at his game. He has good reason for his ways of calling out wannabe gangstas, they hired someone to kill him because they couldn't do it themselves. 50's beef is a very serious one. Em's beefs are because he isn't afraid to tease people who deserve to be teased, and now some of them are taking it overboard, by threatning and even killing his people. Now he's caught up in the 50 thing for producing \"Get Rich Or Die Tryin'\" and letting it hit the stores. But Ja deserves what was said about him, 50 had to defend himself, or he would become a punk just like those he calls out in his raps.\n\r\nThis song is about all of the feuds, not just the ones mentioned specifically. There are problems we don't even hear about, and for good reason. The people involved are just way too vicious. I'm surprised Em even wrote the Suge thing, obviously Suge has said something about Em, now that he is so close to Dre. Although it's comical in a way, Suge even hung Vanilla Ice out a window once and was about to drop him to his death, all in an attempt to extort money (note - Suge and extort used in the same verse, definately coincidental, though). That is the type of person Suge is. Em and 50 have no problem going after the wannabes. But Em won't dare mention Suge. Suge's methods of running a business is pretty much ike the mob used to run the garbage business in New York.\n\r\nEm didn't use ICP for fanbase, yes the flyers exist, I know because I actually have one on my wall. The thing is, though, Em didn't make the flyers, and ICP would say they would be there a couple times, and sometimes whoever made the flyers would be told to put that information on them but the promoters.\n\r\nOne thing I am wondering, is that the Vibe Award incident hapened mid November, and the Encore album was released mid-December. The song was probably already written and all before the incident, which makes the song somewhat of a prediction of something that could have been worse than it was. Put a few things together, you may have a conspiracy theory. Em is about to release something mentioning Suge, Suge already hates Dre, Suge hires someone to go after Dre for allowing Em to put the song out. Last minute decision of censoring Suge's name would make sense, wouldn't it?\n\r\nThe rap game is full of this stuff and has been since the early 90s. The song is a very forward attempt to get these wannabes, and true gangstas to stop what they are doing, because enough has happened already. You get all the talkers and all the doers not knowing who's who anymore and people get attacked or killed over things like money or label issues and the like.\n\r\nGood job, Em...never drop out, unless a life depends on it, just like you said!Edited by random_monkey on January 29 2006, at 09:25AM\n\n\n", "comment_122": "\nBadder Santa,\r\nI agree that this song is about all the feuds, and I agree with your last sentence.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nphermone_cult: I just read your post again, I doubt I read it the first time because I had such a headache from everyone else...\r\nEMINEM DOES NOT RIP OFF ANYBODY!!!\n\r\nIf you knew your history of music, rap has it's roots burried deep many cultures. Aerosmith comes close to rap often times. Elvis took black music and introduced it to white people. Reggae is often a form of rap, and white people taught the Jamaicans to speak english, just not in a favorable way. Eric Clapton did a lot of blues, I wouldn't call him a rip-off.\n\r\nA bit off topic...but a challenge in another area...\r\nBlack gangs try to follow the old methods of the mob, who were Italan. Italians didn't rap, but does that mean the Crip/Blood rivalry is a rip-off of the old crime families' disputes? I dare you to call a Blood a rip-off...\n\r\nAs for people who knock different forms of music, open your eyes. Music was once very segregated hundreds of years ago. As time progressed and cultures intertwined, diferent forms of music evolved. By the 1900s with the inventions of different recording media, we saw the evolution of blues, jazz, rock, metal, etc. Now look at the past 20 years, we are seeing Aerosmith and Run DMC together, Jay-Z and Linkin Park collaberating, DMX and Marilyn Manson doing a rap, Gwen Steffani and Mobi, Gwen and Eve, Kid Rock and Eminem, Kid Rock and Sherryl Crow, Sum 41 doing metal, rap, and alternative all in one song...I could go on there are dozens of songs where the rap/rock lines are being blurred. If these people can all get along in the music world, why can't people like pheramone_cult see the light?\n\r\nLook out for your future, more of this will come, and Eminem is just another major breakthrough in the world of tossing out the steretypes and mixing the styles.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI reall ylike Martika: Toy Soldiers, and i think this song kinda spoils it . However, the song in itself is quite good, there are some good lines in it, and the video was cool when i first watched it.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nWould you idiots SHUT THE FUCK UP and talk about the song?  I came here to learn about why Eminem made this song and instead see a bunch of bickering and arguing.  \n\r\nReverend go pray or something, quit investing this website with your 200 word essays.  Work on getting a life...\n\r\nNOW can we please talk about the FUCKING SONG!?\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nReverendTM-\n\r\nFirst of all, while your grammar might be impeccable, you are in no way any better than anyone else. Your beliefs might be that class is contingent upon what you accomplish in life, however the beliefs of others may differ and very well be right in his/her own case. No one is any better than anyone else in this world. What university you attend in no way effects how people will rank and/or classify you. I'd say, with your egotistical tendencies, you'd rank pretty low on most lists. I'm in no way impressed by you, nor am I intimidated (which I've concluded must be one of your motives, what with your constant babble of \"top 20 universities\" and \"additional jobs\", I'm certain you must have these people SHAKING IN THEIR BOOTS). \n\r\nIf one believes that Eminem is a fit role model for standing up in a gangster's world and being the first bigger man, their reasons as to having Eminem as a role model are entirely suitable. You might find that whoever found the cure for polio is a fit role model for yourself, and that's fine. However, I would definitely say that you're not the one to decide who is fit and who isn't, considering how well you've managed to come off to most people in here.\n\r\nNow, if your only intention from the beginning was to leave a message stating your impression of the song, then do so and be done. There's no need for you to leave long, pointless messages most people wouldn't even waste their time reading. You should feel lucky that even I took time to read half of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nAll im going to say is this:\r\nFor all you people that don't like this song, or em, then why the hell listen to his songs? You don't like him? Then stop wasting your time moaning about him and go listen to something your actually interested in. I personally think that em is the greatest rapper out, and his lyrics obviously mean alot to him if you read them properly.\r\nOh my god some of you people are pathetic!!! \"Em is such a loser\" \"Em just making things worse\" blah blah blah!!!! Get a grip people, and loosen up. Its easy for us to sit back and watch all of this bullshit going on in the music industry, but we aint out there living it for real. We don't know what its like. So think before you go writing in here about everything but the song.\r\nAWESOME SONG!!!!!!! lUV IT!!\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nDon't you people know anything else than to fight? Give your arguments without attacking eachother. As for the song, I think It's great. I've visited many websites to find out  what was the beef between him and Murder Inc., and I was kinda dissapointed to see that people atack eachother on a site where they should post their opinion. And for people like ReverendTM i have one question: why did you made it a little bit shorter by just saing you didn't like the song instead of filing half of this page with your comments? That was neither constructive nor useful for anyone visiting this page.\r\nanyway, thanks for reading my post\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nJUST to let you all know, Eminem's daughter's name is Hailie Jade Scott, not Mathers.  You would know this if you have \"The Slim Shady LP,\" which is dedicated to his daughter.  JUUUUUST to clear everyone up on that :)\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nok all i can see is people doin me head in arguing!\r\ncan someone jst tell me wot the song is actually about please?\n\r\nme eyes are hurting from staring at the screen trying to find what its about but i cant find cos theres so much writing - mostly off people arguin.............\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nEminem is a typical 'pop' generated muppet who is liked by fools all over the world. These fool have nothing better to do with their time apart from listen to some guy who talks the talk yet can not walk the walk... and should be working in KFC!\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nI agree with Windy, although not KFC maybe BK... its time the world of music revolted against the likes of Eminem and stopped buying their records... maybe then Eminem could be what he 'would like to be' a 'gangster'... although something tells me he would not last a second in the 'hood'... 'gheto' whatever you morons call it!!\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nJelous much boys and girls? \r\nPerhaps you should learn to leave each to their own? \n\r\nx\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\noh my god\r\ni have never read anything so sad in all my fucking life\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nWell, this was an eye opener!! To be quite frank, I sincerely hope none of the people who have posted rather violent comments do not live in Australia.\n\r\nThe majority of eminem fans in my home town have the opinion that to enjoy his music you have to become like him - that is in dress and speak. Being a fan of eminem also excludes you from liking music in genres that attract less tabloid headlines, eg classical music, opera et al.\n\r\nThe other day a new friend of mine was going through my music collection and made a somewhat rude remark about the fact that I had The Marriage of Figaro sitting next to Encore. Why do some many people make assumptions about a persons character based on the music they like??\n\r\nReverend, any time you wish to come to Australia, feel free to look me up. I find your comments well thought out, and agree with most of them. \n\r\nEverybody else - Music is supposed to be about self expression and  joy, not anger. Try to remember that.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nDarn it, I should have proof read. My first comment was intended to be read as \"I sincerely hope none of the people who have posted rather violent comments live in Australia. \" Apologies.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nAnd it should have been speech, not speak\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\ni dont really like rap, but im not here to start a turf war, just to ask questions. please tell me what makes a rap song good? i know that people say how good the song is, but isnt it quite easy just to compose a song on a computer? please dont bombard me with hatred im just curious. i must give him credit for lyrics though, its not the most graceful poetry i have ever seen, but the rhyme just falls off his tongue perfectly in sync with his compositions...\r\ni respect everything here, im just curious, i hope you can answer my questions.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nThat Rev guy needs to start studying more and concentrate on his career not writing rubbish in here,  the Rev claims to be intelligent... 'whoopee well done you are intelligent does that make a difference in life? .. I myself have no A levels although I own a rather large house, drive a very nice car and have a stunning yet intelligent girlfriend and more than likely earn more money then he ever will in your life... now that is clever to me!!! I don't have to critise people on their spelling, punctuality as you will read in this posting I am rather bad at English... I have made my money not by going to Uni and getting good grades but by working hard and utilizing my skills and pure determination to make the best out of my life!  The Rev will no doubt respond to this with some intellectual bull*hit but hey... who cares I am richer and doing better in life than him and always will do/be... keep on replying to people on this site mate, you entertain me.... Loser!\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nThe song is about Ems beef with Ja and even though it wasn't mentioned ICP's huge beef with Eminem. he's trying to say that he will walk away from rap for his daughter at any time (exact words from Eminem) and the lyrics are wrong at this part\r\n\"It wasn't my intentions, my intentions was good \r\nI went through my whole career without ever mentionin' suge\" there is no suge theres nothing there no word no nothing its just mentionin' and nothing else i have the exact lyrics in the cd jacket, know ur Eminem Minya\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nI really like this song, but i have to say what is our world coming to when we have to sing about this stuff. Murder, fights, threats did we learn nothing from September 11, columbine, War? I'm not just talking about Eminem either, i just can't understand how these guys can put these things in the public. If i were their children i would be sickened to know this is how they act. When are they going to grow up? There are death and suffering happening around the world all the time but to these guys it has to be all about them and their petty bitch fights....it's actually really sad. Look i'm not trying to make people mad with this comment i like eminems songs he's very talented and same goes for all the other rappers but there are no good intentions in any of their songs about this stuff, it is all done to rile each other up and have the last words. Get over it boys and stick to making good music.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nDespite fear of aggressive redress I would like to firstly assert my concurrence with ReverendTM's comments on this forum. \n\r\nThose who choose to idolize gangsters are intellectually and morally bereft and merely exacerbate their preconceived stupidity by preparing ill-structured, unintelligent and illegible arguments that not only lower my intelligence when I read them, but lead me to want to visit these people and promptly beat them with a dictionary.\n\r\nFor those who adulate and admire scrawny white men with lucrative financial agendas, continue to be swept away in Eminem's overrun, and tired charade. Marshall Mathers is intelligent and savvy, granted, but only at removing dollars and cents from your pockets at the record store. \n\r\nAdditionally, if you do not understand ReverendTM's position in this foray read the preceding posts.\n\r\nIm Out.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nJa is such a dumass 4 startn wif Em, 50 n Dre hu r 3 of de most powerful men in rap culture, hu dus Ja fink he is?\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nwow, this is an A-W-E-S-O-M-E song! one of my fav parts is \"That was never my object for someone to get killed, Why would I wanna destroy something I help build\" this to me is a DEEP song, and f*ck i would flip to if someone mentioned my family in their song, especially in a disrespectful way like Ja did!\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\n'Clarity'... again we have a guy here who like the Rev guy comes on with some big words that mean nothing to me and starts trying to sound all intelligent and sophisticated and making an argument.  as i said before I am not intelligent in the slightest but I currently earn more money than you and have more money than you ever will... hence that makes me clever!  You can read your dictionaries and come up with your 'nice sounding words'... take note here\n\r\n1) 'Those who choose to idolize gangsters are intellectually and morally bereft and merely exacerbate their preconceived stupidity by preparing ill-structured, unintelligent and illegible arguments that not only lower my intelligence when I read them, but lead me to want to visit these people and promptly beat them with a dictionary.' \n\r\nWhy not to save time just write... 'those who like rappers are thick and need to stop arguing about crap.. oh and by the way you all need a good slap!'\n\r\nLess words but to the point Clarity!\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nWho is the guy who got shot in the video?? Did that really happen?? Who took him out??\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nMr. Rev.... you refer to 'people who agree with me seem to be intelligent'... can you not understand English language Mr. clever-clogs.. go and read my earlier posting... you are far more intelligent than me and probably can recite the whole English Oxford dictionary ... and you can write really nice 'excellent grammar's postings... but I am better than you because I earn more money than you... and have more money then you ever will have. You go to Uni to study and get good grades yeah?  You do that so you can get a good job and earn good money...  yeah?... I dont need to do that....  I have a better job than you will ever have... I earn more money then you will ever earn and I have a lifestyle you will never have... so again you are very intelligent... you do have excellent grammar.. and you could probably recite a whole Shakespeare play... but I am more successful than you. Live the dream Revy boy!\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nRev, you say people with the same opinion as you seem to be intelligent, yet u seem to struggle with text speech and text is not a sign of a lack of intelligence it is merely a faster more efficient way of communicating. I reccomend that you get a mobile, msn, or a life.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nI didn't relise I'd made a mistake, I meant recommend.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nHey ya'll :) Was just looking to find out more about the meaning of this song. I wasn't a great fan of Em at the start but after \"Sing for the Moment\" and \"Cleaning Out My Closet\" I realised there's some real depth to the guy and have to admit I've fallen head over hills for his music.\r\nThanx to a lot of people for helping me figure out the bits i'm not sure on. The song is pretty self-explanatory but i didn't know about Suge and Bugz etc. I enjoyed reading alot of what people had to say untill half way down the page I came across the arguement with rev. After a while I got bored and just stopped reading, so apologies if I cross over anything previously mentioned.\r\nAs far as I am personally aware this was more a site to help understand the lyrics of the song and what it means personally and widely, not a gathering to slate each other. Why do you have to argue so much? You have different opinions so what! Lets get back to the song and lyrics.\r\nThis song totally blew me away, Em once again shows there's more to him than what alot of people may see, and not to mention that he does actually give a shit :) Thanx Em!\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nIt was nice of Songmeanings to remove my posts.  This sounds like something that would happen in Soviet Russia.  Instead of promoting possibly conflicting ideas, they act like Pravda and removing anything that could be against the status quo.  Hooray for America right?  I mean, without the first amendment, many artists wouldnâ\u0080\u0099t even be able to make some songs.  Thus, Songmeanings may not have been so big.  So the same thing that protects the content Songmeanings is based on is denied to me?  Way to go.  You guys are real Americans [the owners, like myself are American].\r\nFor everyone who was looking for my old posts, I may have a way to resurrect them. \n\n\r\n-It really is inconvenient being so goddamn right.  When Galileo said that the earth revolves around the sun and not visa versa, he was labeled a heretic and places under house arrest.  I just get my posts removed.  Fancy that. \n\r\n-R\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nfuck yea eminems da bigger man yo. fuck ja for writin that shit bout halie. murder inc. is goin DOOOWN!\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nabout the part between suge and dre, it goes back into the chronic 2001 album.  many people were dissing him because he was out of the spotlight when he was really just setting up his producer role thsat he is today\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\ni dont really like this song i dont really like eminem but you can't escape him claws, but i'd like to know where the chorus is from it sounds like belinda carlisle, some one who knows stuff about stuff inform me, I WANT ANSWERES NOW...... OR......... I WANT THEM EVENTUALLY!\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nThe original is called Toy Soldiers by Martika it's an old 80's song. Hope that helps :)\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nI don't really like rap/hip-hop, but I thought this song was really really good, and I came here to find out what the references in the song were about. Can I say thanks to everyone who helped me on that count? On the other hand, I had to trawl through thousands of pointless posts criticising other people's grammar and spelling. Why was this the case? If the most important thing you can think of posting is an attack on someone's grammar, at least have the common decency to make sure your own grammar is acceptable. I happen to agree that some posts were illegible, but most were not, and so just miss out the posts you don't understand!\n\r\nJoe\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nLook, the (?) is Suge.  He says throughout the song that he promised Dre is wouldn't get into it because it's not his beef and he knows nothing about it....so he doesn't say the name SUGE in the song because he would have then said SUGE like he just promised Dre he wouldn't.   It is for effect!  The chorus \"Toy Soldiers\" is supposed to mean that Eminem does not want to foght this ridiculous war that essentially means nothing in the end.  It is a war that should not be happening and blood could be shed for such a ridiculous battle.  He doesn't believe that they should continue to fight \"LIKE TOY SOLDIERS\" because toy soldiers aren't real soldiers.  Toy soldiers fight a toy (play) war, while real soldiers fight real wars.  He considers this a play war in that it is not worth the bloodshed.  Next, Proof is the one that is shown being killed in the video and he is being shot by Benzino (not really shown, but implied).  This is what Eminem sees happening in the future if the beef is not squashed now.  I truly feel this is one of the greatest songs Eminem has ever witten.  I just can't help but replaying it over and over, it has so much meaning and hits you on a separate level completely.  I was masterfully written and performed......BUT as we all know, beef does not go away just like that.  The opposition doesn't care if Eminem wants to call it quits because he sill takes a few stabs on his way out. Benzino came out with his retaliation to 'Like Toy Soldiers'...it's called 'Look Into My Eyes' and shows Eminem calling the hit on Benzino for the murder of Proof.   We shall see how this will end......Can Eminem stay away from a retaliation to a retaliation even though he wants to squash the beef?  We'll see.\r\n-J\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\n4 words. This.Song.Is.Awsome\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\ni dont like eminem at all but i like this song\r\ndidnt want to add anymore as to what its about because i think enough has been said!\r\nsplendid goodbye then\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nAlright... i love the song... i think its great... but why do i get the impression that it has something to do with tupac shakur? i dont know why i would think that but wasnt he shot by Suge? ayh any ways let me know\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nSome think that Suge might have had something to do with Tupac's death, but who knows for sure.  The only thing this song and Tupac's death have in common is that Eminem understands what can happen if the wars continue.  He doesn't want to see anyone else die because of some rap beef\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nI personally love the song and own all of his albums. I think he is very talented! \n\r\nFor fuck sake... Could everyone stop entertaining this asshole?  I've been a Songmeanings user for over 2 years and I've never seen anything as stupid as this.       \r\nTHIS SITE IS TO DISCUSS THE SONG - If you are not an Eminem fan, that's fine. Everyone has their opinion and I have no problem with that. However, attacking each other based on how he or she feels about this or any song is ridiculous. CHOOSE A DIFFERENT FORUM - NOT SONGMEANINGS! \n\r\nI, thankfully, never had the opportunity to read Reverend TMâ\u0080\u0099s previous postings. But for those who feel that they missed out and wish to read both his previous and future comments, please e-mail him directly to receive them. (Thanks).  Reverend TM, can you send THOSE individuals, your email address? This way, you can cease all attacks on anyone's grammar, viewpoint or intellectualism because only those individuals who respond to you will be of your caliber. (Thanks)\n\n\n\r\nÃ¸Â¤ÂºÂ°ÂºChina MoonÂ°Â°ÂºÂ¤Ã¸\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nyeah ok granted that eminems lil wars are going on but there all about nothin, compare his to the real wars going on in america, bloods n cribs, let alone overseas, iraq, ireland,bosnia..... compared to other songs of his ' just lose it' this songs a lot more relevant to the real world and could be used a double meaning for real wars going on. great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nthe origianal (i can't spell) song is good by Martika. it's pretty tight. this version is also very cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\ncheers laiken, i figured the 80's-ness but was unsure about who it was\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nHey everybody,\r\nI am thinking about using this song in a junior high unit about violence and the \"us and them\" mentality.  Does anyone have any ideas for discussions and assignments that 13-14 year old kids could do in class using this song and the video?\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nmake posrts or somthin how bullying,war,murder.. just isn't right and aint 'cool' which may relate to them\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nEvery one now days seems to be turning their attention towards the on going feud between rap superstars 50 cent and Ja Rule but when will it end ?\r\nThe rap war between Ja Rule, Fat Joe, Jadakiss, Jaz-Z, Nas and 5O cent, Eminem, Dr. dre, and Busta Ryhmes is unknown as to where the root of the problem began but rumors have been spreading through out the online gossip industry dusscussing the issue that G-Unit, Shady/Interscope records last days are growning closer and closer after rumors of Murder Squad, and Ja Rule posssibly buying out G-Unit and working there way to Shady/Interscope records if 50 releases diss tracks towards Fat Joe and Jadakiss and if so after the track's are released  Terror Squad and Jadakiss will release tracks similar to Ja Rules \"loose change\" freestyle, but becoming more severe and will feature Murder Squad, Ja Rule, Jadakiss, Jaz-Z, and Nas, and when confronted about the idea Ja Rule had this to say, \"yeah its true ( puffs on cigar) and if so i might sign 50 if i feel like, I think I'll call the recoed label Murder-Unit\"\r\n-mtv news\n\r\nsorry kind of off the subject but just wanted to hear peoples opinions on the subject and if your interested in the battle watch the wrap:Ja Rule vs 50 Cent under Mtv video at mtv.com/bands/az/ja_rule/…\n\n\n", "comment_169": "\nyeah ok this rap war' going on but eminem puts it relvantto the real world. Jus like ne war/argument/ misunderstanding this rap war jus aint a good thing which eminem puts across in this song magnificently. all of his songs hav unbelieveable double meanings n his album rox,\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nhmm..\n\r\nnot a huge rap fan but this song has a strong meaning. it really caught my attention.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nEminem is quite the humanitarian for his role on this song. \n\r\nRight. \n\r\nI was amazed at the number of comments on here that were in support of what a great message this song is sending and how amazing Eminem is. I'm not here to disrespect anyone's opinion. And if you find some greatness in this man's work, then good for you. Personally though, I have no sympathy for Eminem based on the issues presented in the song (or any other song, for that matter). This was touched on in an earlier post, but it's pretty ironic how one can trump themselves up to be such a \"bigger man\" when they've caused so much unprovoked drama to start with. And no, I don't really care if you can name instances where Eminem was 'victimized' into \"drag them in battles that...he absolutely [has] to\" participate in. And if this whole song is about stepping up and letting drama go, does Eminem \"absolutely have to\" battle anyone? Maybe I'm lacking the logic that undertakes a vengeance as such. \n\r\nRegardless, I just can't be swayed into agreeing with anything Eminem writes. Moby summed it up well in an interview responding to his diss from \"Without Me\": he basically said that he couldn't take Eminem's new approach seriously when just a few videos back, he was running around in a Bin Laden costume. \n\r\nI'm also really sick of the whole playing up the \"Hailie\" deal. Criticizing Ja Rule for mentioning his daughter's name on a track is understandable. However, with lyrics like \"bitch I'ma kill you\" and \"you gonna hate me more when you find out you can't escape me, whore\", I again, have trouble empathizing with his so-called morality and maturity, especially as a parent. \n\r\n\"em is the best thing that happened to rap, anyone who cant see that is just plain stupid\" \n\r\nThis poster (and many others) may be right about plain, but not stupid. If you think songs like \"Kill You\" and \"Shit On You\" are epitomes of the greatness in hip hop culture, you sure are missing out. Have some pride in what you listen to and represent. It's crazy how an artist like this is idolized while lyrical geniuses (with TRUE messages) like Talib Kweli and Common are left ignored. \n\r\nOpen your eyes, people.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nUh-oh.  Someone agrees with my earlier posts [the ones that were conveniently lost and deleted because they didnâ\u0080\u0099t agree with the status quo].  You guys better start calling her names.  Just play the cards you played last time.  Make sure you call her a person with repressed homosexual feelings and other things to falsely deface and discredit her character.  Basically, just do the same tasteless, primitive, and childish routine you people used against me.  \n\r\nBeach Boys, The Who, Jimi Hendrix, and Bob Marley: What do these names have in common?  They donâ\u0080\u0099t have Grammys.  Eminem has at least 3.  Does this strike anyone else as odd?  Does he deserve even one Grammy?  Think about it.  \n\n\n\n\r\n-R\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\ni love this song!! like i saw the clip and i like almost cried it was so sad hey :Panyways EMINEM RULZ!! lol i think he deserves a grammy!!!\r\nGO  EMMIE!!\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nI notice that 'Rev' logged on and wrote his posting at 04:12am... you my friend are what I would refer to as a geek... or in better terms Billy no mates!  \"The Rev... wants to have friends but cant find any\"  L...O...S...E...R!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nsome people are in different countrys so it would be a different time there.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nfuck rap\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nThis song is SO cool!! \r\nCurrently Number One in the UK!!!\r\n:D\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nwell the same can be said about alot of things rev, i mean look at who the oscars have gone to in the past, did titanic deserve more awards than Lawrence of Arabia? the same goes for music awards- not everyone is going to be satisfied that the award-winning artist is truly worthy of the award...\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\n?\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\ndunno\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nwho is suge?\n\r\n\"I went through my whole career without ever mentionin' suge\"\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\ni agree the video to the song was the best!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nrap sux\n\r\n(runs away screaming)\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nbigmanoncampus asked-\n\r\n\"Who is Suge\"\n\r\nSuge (pronounced 'Shoog') is Marion Knight, the founder of Death Row Records, who Dr. Dre used to work for.\n\r\nDre wanted out of his Death Row contact because he saw that the company, which was engaging in numerous illegal activities besides producing rap music and had known gang members working for it, was about to take a fall.\n\r\nSuge let Dre out of his contract but brought a bunch of gang bangers to his house with bats and said that all Dre's master recordings belong to Death Row, not him. That included I beleive unreleased stuff that Death Row had not laid claim to yet.\n\r\nDre left Death Row and started Aftermath Records. Soon after, Tupac Shakur was murdered in Las Vegas with Suge in the car. Many have long thought Suge had something to do with the Tupac hit, as he was about to leave Death Row as well and audit them for some $10 million they owed him.\n\r\nEm says this line because Suge has had his other rappers and himself diss Dre for being fake and for deserting Death Row. Dre has tried to let it go, but Suge keeps trying to push his buttons.\n\r\nEm never knew Suge and wasn't there for their falling out, thus he would be \"talkin' about something, I knew nothing about\". However, Suge was \"all over TV, down talkin a man (Dre), who literally saved my life\" and Em felt he now had to answer somewhat to Suge because of how loyal he is to Dre.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nI Luv It..N I Really Hate Ja..I Like..*Fuck It 50 Smash Em Mash Em N let Him Have It*\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nhey guys! can you please look up RANE &  post some thoughts about a song or two.  i'd really appreciate it.  THANKS! :)  God Bless!\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nhey guys!  can you please look up RANE & post sum thoughts on their lyrics.  i'd really appreciate it...thanks!! God bless!\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nim not a big fan of eminem but this song is good a long with \"stan\"\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nhey guys! can you please look up RANE & post sum thoughts on their lyrics. i'd really appreciate it...thanks!! God bless!\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nAlright, I know it's been said at least once, but I'd like to return to the idea that thing site is called SONGMEANINGS, not \"Let's bicker about how important the artist is\" Obviously if you're on this page you have an opinion about the song. Everyone is entitled to their opinions, but how about doing that in the forums? This is for talking about what the song means. I just read through 8 pages of mostly bickering. And I did read through each and every comment, and if you were to do the same you'd see how childish it all is. Bickering over spelling and grammar and how much money you all make? Frankly, I don't care what you do for a living or how much money you make or what have you. Also, as long as what you are writing is legible and understand able, I'm sorry, it doesn't make you any less intelligent if you mispell a word or create a grammatically incorrect sentence. I'm sure we all understand what is written, and if we don't, oh well, move on to something else. Or ask for clarification. \n\r\nAlso, people that don't like Eminem? you're entitled to your opinion. But by coming to this page and saying you don't like eminem, and that you can say that because you're entitled to your opinion, you're very plainly looking to start trouble. Honestly, can you tell me that if someone went to your favorite song or band's site and said they sucked, wouldn't you defend them? I'm sure you would, and if you wouldn't, then I suppose they aren't really your favorite, are they?\n\r\nFinally, why do people continuously ask the same questions over and over? If, instead of going to the end of the comments and asking a question that's clearly been answered forty times and getting angry when it's not answered again, why not read the comments before you send one, and perhaps your answer will be there? I realize that's a lot to ask on a page like this where there's pointless crap in between every meaningful addition, but skim. do your best. Don't post the same question forty times. \n\r\nSorry, had to get that off my chest. \n\r\nI do like Eminem, and I feel this is a powerful song in that it really is a message to his fans NOT to be stupid. A lot of problems with \"beefs\" between artists stem from media hype and fans getting angry at one another. Eminem doesn't want that. Yes, he stirs up his fair share of trouble, and I won't say I respect every one of his songs, but a song like this one DOES send a powerful message, and I think that's hard to disagree with.\n\r\nAlso, an artists lyrics are his/her personal business. They create them from themselves, their experiences, and their views.  So, if you don't agree with what they say, that's fine, because you're not them. get over it.\n\r\nAnd, with that I'm going to apologize for my billion word entry to an already overflowing comment page. \n\r\n-Z\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nThe MAIN message of this song really has to be that he's tired of all the shit he has got his \"crew\"(as we can all tell im white) into and now he has decided to let it all go so he doesn't go and get one of his \"hommies\" shot.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nWell, everyone sems to ask over and over \"What does toy soldiers mean. Well, firstly, I'm here to dispell the thought that Eminem wrote the chorus to his song. He didnt. It (like a few other songs he has) was taken from another song. The chorus came from \"Toy Soldiers\" by Martika, an 80s singer. \n\r\nThe lyrics for that song are as follows:\n\r\nIt wasn't my intention to mislead you\r\nIt never should have been this way\r\nWhat can I say\r\nIt's true I did extent the invitation\r\nI never knew how long you'd stay\r\nWhen you hear temptation call\r\nIt's your heart that takes, takes a fall\r\nWon't you come out and play with me\r\nStep by step, \r\nheart to heart, \r\nleft right left\r\nWe all fall down like toy soldiers\r\nBit by bit torn apart \r\nWe never win\r\nBut the battle wages \r\non for toy soldiers\r\nIt's getting hard to wake up in the morning\r\nMy head is spinning constantly\r\nHow can it be\r\nHow could I be \r\nso blind to this addiction\r\nIf I don't stop the next one's gonna be me\r\nOnly emptiness remains\r\nIt replaces all, \r\nall the pain\r\nWon't you come out and play with me\r\nStep by step, \r\nheart to heart, \r\nleft right left ... \n\r\nAnd also, I'm not here to say Eminem is the best rapper, or that rap is the worst genre of music.\n\r\nIn my personal opinion, he's a great rapper. He sings from the heart in many of his songs. He raps to a different beat (ah-hah-hah, pun fully intended) than most rappers. However, the last part is my opinion, so of course, you can take it for face value.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\ni think hes saying that u could just say a ryme and no one could get hurt:like, no fight about hos better etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\ndis song explains bout da beef between shady records n Murder ink...yea em is right ja is a tool!\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nEminem has lost something, his songs are just the same old thing now, he's fading quickly ...\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\ni like the words of this song. i am from latvia. i think this is the best song from all eminem songs. if here is some, who also is fan eminem _ my e-mile is ainaaars_msg@inbox.lv\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\n\"run ya nav and who sulked us\" should be \"Runyon Avenue soldiers\"\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nthis song is one of his best\r\nthe way he raps it makes you think?\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nwot makes a good rap song like this?\r\nis it your feelings or wot??\r\nor wot happened to you ??\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nthank you NINJA for pointing this out..  I got really mad when one of my favorite 80's songs got shredded by a wannabe rapper, and then the gangsta kids think he's awesome for coming up with it.\r\nI'm disappointed that this song isn't as funny as a lot of his other ones.\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\n\"It was nice of Songmeanings to remove my posts. This sounds like something that would happen in Soviet Russia. Instead of promoting possibly conflicting ideas, they act like Pravda and removing anything that could be against the status quo. Hooray for America right? I mean, without the first amendment, many artists wouldnâ\u0080\u0099t even be able to make some songs. Thus, Songmeanings may not have been so big. So the same thing that protects the content Songmeanings is based on is denied to me? Way to go. You guys are real Americans [the owners, like myself are American]. \r\nFor everyone who was looking for my old posts, I may have a way to resurrect them. \n\n\r\n-It really is inconvenient being so goddamn right. When Galileo said that the earth revolves around the sun and not visa versa, he was labeled a heretic and places under house arrest. I just get my posts removed. Fancy that. \n\r\n-R\"\n\n\r\nYes, you have a First Amendment Right to say basicaly whatever the hell you want, no matter how pointless, irrelevant, and generally stupid it is. This does not, however, mean that Songmeanings is obligated to waste their bandwidth by keeping it up. To compare Songmeanings' decision to remove your posts to KGB-esque actions is almost as hilariously wrong as your attempt to portray yourself as a Galileo-esque martyr. \n\r\nBelieve it or not, I actually agree with some of your points about the general childishness of the whole rap culture. By and large, as a result, I avoid the whole genre. However, I'm not so narrowminded as to immediately write off every song that is produced by a rapper, as from time to time a song like this one, or Tupac's \"Unconditional Love\", comes along. \"Like Toy Soldiers\" is a song that I heard once, and felt compelled to come here to get the backstory on it. It tells a story, and a pretty fascinating one at that.\n\r\nAs for the people who say that they have a hard time buying Eminem's whole act when he himself instigated so many of his feuds, I can definitely see where you're coming from, but my personal take is that the man is simply growing up. He's at the right age to be doing it, and I bet a lot of his priorities are starting to shift. There's nothing wrong with that, and who he was 5 or 10 years ago shouldn't disallow him from it.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nthis song is OK, but it sickens me to the depths of my soul how this got 4x as many comments as 'come together' by the beatles. the world is getting stupider\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nok, I hope this hasn't been covered, I tried to read all the posts but there is a lot of meaningless crap on here that has nothing to do with the song...anyway here we go....\n\r\nIn two places Em mentions Halie........that another rapper or someone has used her Name specifically in a song...then he say's \"But now it's elevated cuz once you put someone's kids in it The shit gets escalated, it ain't just words no more is it?\"\n\r\nI get that he wants this all to stop, but at the same time is he saying that it's not over yet????? What do you think?\n\r\nI do not listen to Rap for the most part, frankly I think the majority of what is produced is crap, not music, not art, just plain violent, useless crap that friends of friends help get produced...nothing to do with TALENT! . Our society would be much better off without most of the rap crap out there...that being said, I do believe in free speach, I do like Em...he is different than the others no matter what anyone says. I'm 33 years old, a father, and let my son listen to EM, there are many others he will never hear, but at least EM's songs have a meaning or like previously stated are just plain silly....\n\r\nwould like to hear about the Halie comment.\n\r\n\"Quebec want's out.....will you take them?...PLEASE!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\ngreat song Em's lyrics are amazing and good hip hop not like any of this nelly R&B shit\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nit isn't necessarily that the world is getting stupider. Come together is an old song, and the internet and this site weren't around then. Seeing as how this is a new song, it's obviously going to get many comments as opposed to a newer song that is constantly being played on the radio.\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nZeke, he isn't saying that it isn't over when he mentions that things got escalated when Ja used Hailie's name. He's saying that's what caused things to get worse. And that that was a low blow and it wasn't right, there was no need to get his daughter involved in something that was between adults.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nI like this song. When Martika had this song it was kind of a \"whooz-song\" people run from it like thypus\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nSorry, Ms Trivial Suicide. I'll go to detention immediately\n\r\nSee you at the punk show\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nNo, I really am sorry to have offended you. This isn't sarcastic.\n\r\nSee you at the punk show\r\n^\r\n^\r\n(Okay, I probably won't, seeing as you guys like rap and I like rock, but that's okay. So... Who wants cookies?)\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nhey every1.. i used to really like em but then got over it.. now that he has brought out this song i luv him again bcause it really shows wot he is capable of.. i have 2 use this song in an english assignment so can anyone tell me exactly wot the song is about please?!!! thanx!\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nlol asshole...\r\nAnyway about this song... is it what happened or what will happen?\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nHow difficult is it to understand. This song isn't as good as rock because, although i admit that rap songs have tunes, it has a limited number of notes and is repeated about 30 times throughout this song. The lyrics don't make up for it either, they're hardly kipling and they rarely rhyme. The best part (tune and words) is the chorus which eminem had to sample from martika 'cos he can't write a whole album himself. I'm not labelling myself as anti-rap, or pro-rock, i liked the rap songs written by rhcp and of course nu-metal bands contain some rap, i just can't help noticing that of all types of music rap is the worst and it seems to be only listened to for the sake of it being rap, or else the melodies being so simple that people with no prior interest in music can 'get' them.\r\nAs open-minded as I try to be I can't shake the feeling that this is just a load of nonsense, that doesn't say anything interesting or new, and will be forgotten in a few years time. Unlike rock which as this song demonstrates will be constantly plundered for tunes and inspiration.\r\nI'm not trying to be annoying but if you listen to a foo fighters song and then listen to this and then think about which song you enjoyed the experience of listening to the most, it won't be this dull repetitive one. I can only blame the fact that in america at least, there aren't any easily accessible rock bands and maybe this is the best there is for a lot of people who don't listen to much music. But even so its insulting and sad to think that eminem is the best selling artist in the world, and he makes fun of people like moby who have more talent, it's an unjust state of affairs and we need a really good rock band to put everything right.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nI agree with choclate.\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\n*chocolate\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nI love Eminem! Great song!!! :D\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nwhat happened to pac and is mureder inc jas label wut does Some receptionist at The Source who answers phones at his desk \r\nHas an erection for me and thinks that I'll be his ressurection mean \n\r\nthis website has pretty much tuned into a war i have read alot of the posts on here the last couple days and all people r doin is arguin and hatin on errybody elses grammer\n\r\nshady is the bes lyrisoligist 2 ever touch a mic and the way he says it makes the rymes twice as good\n\r\ni have no idea y ther r people talkin on here that really dont like em\n\r\nholla\r\nkyootipp\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\n\"i have no idea y ther r people talkin on here that really dont like em \"\n\r\nmaybe if you read my comment you would see a reason why people who can see how average this is would want to encourage people to listen to a wider range of music and not buy what the trend setters tell them to. i don't see how you can enjoy this more than any old rock n roll band, i used to like eminem until i became more interested in music and realised that there was much better stuff available, buy this and you're harming the work of better artists. Listen to coldplay or rhcp before you make another comment, i promise you'll soon forget about the supposed merits of eminem.(at least this happened to me, and going by the reasonable logic that ears don't contain taste buds that are specific to each person, the same should be true for you)\n\r\neminem is not the best lyricist noel gallager clearly is.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\ni  love that eminem put this out there...they really give black folks a bad wrap with all this gangsta mess. mad props to em for this song, and just for being a cool white dude rapper\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nChocolate:  I've had this discussion about whether rock requires more skill, or is better than rap.  I think their very two different animals.  I love rock.  My favorite bands include Hendrix, Zepplin, Beatles, Nirvana, Coldplay, and Radiohead.  I also love Bob Marley, Lester Young, Luis Armstrong, Miles Davis, oh, and yeah Eminem.  Every type of music has it's strong points.  Rap/hip-hop is based more on improvising with a good beat in the background.  Remember, though, that just because anyone can make a beat doesn't mean it's a good beat.  Eminem is a great producer, and an increadible story teller.  There may be more poetic artists out there, but Eminem is great at telling an intriguing story, as is proven by all these people posting on this forum.  Also, have you heard the covers of Jin and Juice(originally made by Snoop), and Boyz in the Hood?  They're both covers of rap songs by rock artists.  I don't like most rap, but then again, I don't like most rock either....there're just many more artists to choose from since rock's been around for so long.  \n\r\nAll in all, everybody does have their own taste, and there's nothing wrong with that.  If you have a suggestion of a good group that you think people will like, please let us know.  Just allow us to decide we don't like it afterwards.  Art is about expression, and that's what em does so well.  If you don't like his form of expression that's cool.  \n\r\nOh, and hey, does anyone else find it amazing that these types of discussions are arising from a rapper?  It's undeniable that Eminem has brought rap into the mainstream and caused a whole lot of discussion of it's place in our culture.  That can only be a good thing!\n\r\nPeace Y'all\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nNo no no, its not a good thing. Go to in da club and also wanksta on the 50 cent section to see a detailed breakdown on why rap is a bad influence and is clearly only given such a high position in culture because there are a lot of people who think that ak47s, hardcore drugs and -shudder- pimping are cool. people don't have tastes, music isn't genetic, everyone can like all kinds of music (notice how tastes differ between social groups and generations rather than familys) there is no way you can say this song is worth listening to once you hear enough music, or even if you can there is no way its worth the ridiculous amount of attention it gets. people listen to rap because they are stubborn, narrow minded, simple minded, like repetition rather than change, and try to be cool and glorify this crap. i won't go overboard because my fav comedian and hero frank skinner likes eminem but this is only because he doesn't like music much and refuses to be open minded, i think this is a mistake on his part and is inhibiting his own enjoyment of life but eminem is probably the least immoral rapper there is he's just not that good\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nThis song in particular is unique because it's talking ABOUT THE NEGATIVES OF RAP.  Fine, critisize the rest of Eminem's material that talks about ho's, sluts, mushrooms, and killing his ex-wife.  Even all of that is tong in cheek.  With the exception of his first major record, he makes it clear in each record that he's not serious about any of it.  Ignoring that fact though, I'm simply pointing out that this ONE song is good.  On the subject of all of rap, I do agree with you that rap has some serious shortcomings.  90% of it IS shit.  I'm just trying to point out the positives in an industry that is riddles with negative comments, because good hip-hop does exist!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nit may be riddled with negative comments but the fact is you DON'T need to defend it. It defends itself with its emphasis on being cool and trendy. Its the most overrated genre there is and ever has been (actually metal might be challenging that recently). If you buy this song, you're endorsing not just eminem but all rappers, this is a song about all rap, eminem is the clean cut figurehead of rap. If kids are encouraged to buy this then they'll get into 50 cent and stuff. I know it sounds harsh to boycott this semi-crappy song just because hundreds of other very-crappy songs have been allowed to run amok but i'm advising this for anyone and everyones good. I replied to your wanksta post by the way (wanksta, how mature - i feel sorry for everyone in the world now)\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nnot even a clown would be retarded enough to include this in his act (a weak link)\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nI loved how eminem used toy soldier's by martika in the beginning of the song\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\ni think in this song he is trying to say that if he could he would like to kill all other rappers so that he would rule the rap world.... that what i got from it...\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\ngud song gud song. one of eminems best songs ever. my opinion is htat eminems the best rapper ever. yes, even better than tupac. i hav respect to tupac, i like tupac, but wen eminem put out encore i was just like tupacs in second. eminem is definatly the best just think about how much meanin is in his songs and how easily it flows over the beat. this isnt sum cheap 50 cent bullshit this is real rap. Eminem, then Pac, then Dre\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nHe stole the chorus from here: \n\n80smusiclyrics.com/artists/…\n\r\nHe sucks.\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nMan!! he hasnt stole it he just used it and that made the song gr8, wats the beef between him and ja rule? and wats the name of the song that he uses haile's name and pisses off em?! som1 plz tell me\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nFucking hell.\n\r\nRight, back in the day, when Pac & Biggie were still alive.. Dre & Pac were signed to Suge Knight's record label : Death Row records. Dre was also the co-founder of this company. After some sort of disagreement Dre left to build Aftermath records, and went on to sign Busta Rhymes, Eve and Eminem.\n\r\n50 and JA rule were raised in the same 'hood and apparently disliked each other.. Ja went on to be signed by Suge Knight and 50 was signed by dre & Em to Shady-Aftermath. There are many refrences in both 50 & Ja's albums showing their hatred towards one another. Last year at the Vibe music awards, Dr Dre was assaulted which was rumoured to be at the behest of Suge Knight, 50 cent intervened, stopping the fight and Young Buck, a member of 50's Gunit clique, stabbed the assailant. It's 50 who has the beef with Ja and apparently em with Benzino.\n\r\nNot sure what the Ja song in which he mentions haile is called but the Obie Trice, Em & Gunit assault on it is called \"Halie's Revenge\" or also \"Doe ray me\" and you can hear the ja clip at the start of it.\n\r\nI know this isnt really the issue no this particular page but I though I would clear it up before anyone starts bullshitting about Benzino & Ja.\n\r\nHave to agree this is an excellent song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nAlso, In the video when Proof gets shot I believe it's supposed to be about Bugz, who was an original member of D12 and was shot, also listen to \"Good die young\" on \"D12 World\" which is basically a tribute to Bugz. He also appears at the end of the video along with Pac, Biggie & Big L. Furthering the idea that he doesnt want to be in the rap game for the beef's and is the bigger man who can walk away. And basically these are prople who died because of beef's they had with other rappers.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\n\"Eminem\" is short for \"Cock-Eating Retard\"\n\r\ncus I sed so,\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\n\"like toy soilders\"  what is that??\r\neminem has seriously fucked up another song\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nIf some shit ever just pop off, I'm supposed to be beside 'em\r\nNow Ja said \"I tried to squash it, it was too late to stop it\" \n\r\nNow Ja said really says...That Ja shit, i tried to squash it...and idiot, people like you piss me off so much, and shoe...fucked up another song?  what the hell are you talking about?  this is one of the best songs that i have ever heard.  there is so much truth and meaning to this\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nI guess Bentzino [sic] is going down now, when he doesnâ\u0080\u0099t have any hooks on other rappers. I am referring to his previously semi secret co-ownership of The Source, which made some other rappers to give him respect just to get some good reviews back. Lets see how he fares now with that lame weapon wrested from his claws.\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\ndoes anyone know em's email address\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nThis song sucks. What more to say? Oh yeah, every rap, hip-hop etc song sucks too!!! The only good music is rock and roll. In bands like Guns N' Roses and Pink Floyd, the music actually means something, it makes you cry, it make you think, it has true emotion. The lyrics are powerfull as they are thoughtful. Here, Eminem (the guy who thinks he rules the world 'cause he has a chainsaw) has took a classic pop song (which I don't like, I'm just saying..) and has killed it. End of story. To put straight how crap this song is, Eminem dosen't even sing in the chorus!!! Need I say more about that? Most of his songs are just a bunch of swear words put together and a couple of crappy beats and there. That makes him a star? My ass!!! It's time some artist who actually knows about songs and how to write them came into the world. Modern day music is so bad. I just can't explain it on this page. Because it's the only music out today, people listen to it on the radio and think \"whoa... good song!\" But if they were living 10/20 years ago, they would know true music. This is to anyone who reads this... Download a song by Guns N' Roses, it's called \"Estranged\". Sit in a room alone and close your eyes...Listen to every word, every note. Listen to the emotion, the sadness. Just do it....There, you will find REAL music...\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nIn our opinion, music portraies the sadness of the Eminem singer in having that to finish with a movement that it helped to create, as the Hip-Hop and the gangs, that before were of the good, and that today it comes if becoming something kept out of society.\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nthe musica is very interesting, therefore it portraies that the people are used as parts of a game or a toy to go pra war. Eo Eminen tambem uses to advantage this musica to offend its rivals. Tambem speaks that it has that to be to lider and that the people follow its positive example.\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nthe musica is very interesting, therefore it portraies that the people are used as parts of a game or a toy to go pra war. Eo Eminen tambem uses to advantage this musica to offend its rivals. Tambem speaks that it has that to be to lider and that the people follow its positive example.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nthe musica is very interesting, therefore it portraies that the people are used as parts of a game or a toy to go pra war. Eo Eminen tambem uses to advantage this musica to offend its rivals. Tambem speaks that it has that to be to lider and that the people follow its positive example.\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nmusic says on the fight in hip hop, and as they eminem it if it feels sad for having that to be fighting with others rappers\n\r\nMauro\r\nRoberto\r\nAntonio\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nMusic uses the War as metaphor for the battle of the Hip-hop in the life of the Eminem.. \r\nAll its idea defended initially, is not perceived in its real form, all criticizes it without the o less to verify its true intention. \r\nIt always defended the Hip-hop and today the people use it to destroy. \r\nThe group in which it \"defended\", started to go for a total different side that it wanted, in which was if detruindo to the few. \r\nAs it says in music: \r\n\"Why I would destroy a thing that I helped to construct\". \r\nNow it is tired of being crucificado by the \"errors\" of the others, for the choices of the people in which it walked previously.\n\r\nAlessandra\r\nVinicius\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nWe love the raps of eminem and his latters ..!\r\nthis music compered the real war and what happined in hip-hop world.\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nmusic makes type a metaphor of the war with the battle of hip hop. sample that always eminem defended it hip-hop and that it fights for it.\n\r\nEdison\r\nPaolo\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\n1. Alright, i've seen enough people on here who have only come to talk about how rap sucks, and how other things rule, f*ckers, this board is about Eminem, not pink flyde, or Guns n roses, or any other things that have nothin to do with rap and R&B\r\n2. Why can't we all play nice? Ever hear this: If you have nothin nice to say, don't say it at all?\r\n3. Why do all you have to be hateing on Eminem? What did he do to you? I understand everyone has there opinion, but seriously, you should'nt hate someone you don't even know enough to suggest he get hit by a bus or get shot up on a block.\r\n4. Please do not post that rap/R&B/ pop/ hip hop/ jazz/ rock/ country/ etc sucks, its cllogging up good space\r\n          Kayla Marie Collins\r\n   AKA mad_elibber\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nPink Floyd rule!!!!!! \n\r\nMad Elibber cant spell and should proof read her posts!\n\r\nWhy dont you try listening to some other music? you may just like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nWell said MercsI55amg!\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nthis song is fuken amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nAnd even though the battle was won, I feel like we lost it \r\nI spent too much energy on it, honestly I'm exhausted...\n\r\ni guess this is 1 of the reason eminem wants 2 retire or wateva...\r\nanyway love this song...it grows on me man!\r\nthe most amazing rapper on earth...\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nOh good god no. How desperate can you get? In some ways I pity eminem, taking original songs and rapping over them/making them sound shit. This was once a good song until Eminem once woke up and decided he couldn't be naffed to write another song and he'll just nick another song and commentate on it.  So congratualtions eminem on sucesfully fucking up another song!\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nGood song before!? Ok, now you have officially claimed bad taste regarding music. Go away and sin no more. \n\r\nMad Elibber is right, of course, it really should be no ned for writing what she wrote though (btw I like MM, PF and GR, all mentioned above - and I am still sane as anyone at Bedlam) .\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\ni like this song and the video for it too.\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\ngreat song. i remeber the first time i heard it i was at a pre-christmas party thing and i immediately asked my cousins if they knew what the song was called bc i loved it so much. me and my friend nick listen 2 this song on the bus ALL the time. he loves the cymbol crash in the beginning. me 2. its great. i abs. love it. eminem is great. his lyrics always impact people in one way or another...\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nthis song is about when feminem was a little boy his mom would put foriegn objects in his ass. his favorite were the toy soldiers. he would normally perfer the male toys. because he loves the cock. he would cry and weap while laughing at the thought of what was happening to him. he will now pass on this generation of his toys onto his doughter. he hates his mother for introducing him into this sick morbid infactuation of his. but he cant escape his gayness. he likes to dress up as an armiy man while watching huge black men fuck his doughter. he is a sick mannn. but he likes it this way.\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nGood one! You know, Eminem is only the best rapper out there, so you feel the need to go make fun of him for that. What is so feminen about him? Does he have a high-pitched voice? Does he cry often? I don't think so. When you make up nicknames meant to insult someone or something, make sure that they are at least somewhat true. Just go listen to you crappy Maroon 5 and U2.\n\r\nBy the way, GREAT song. One of em's best IMO.\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\ntrue very true i love this song it has so much meaning\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nApril 11th 2006.  Proof shot dead in a Nightclub in Detroit.  Eerily prophetic...\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nAgreed. Very spookily prophetic. This was the first thing I thought of when I heard Proof had been killed.\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nR.I.P. Proof\n\r\nIt's so strange how this happened..I bet Eminem is going to dedicate this song to him now.\n\nmtv.com/news/articles/1528386/20060411/…\n\nnytimes.com/2006/04/12/arts/music/…\n\n\n", "comment_260": "\noh, you were there? You saw Proof shoot that guy first? Awesome, man!\r\nno.\n\r\nPeople said the other guy fired the first shot, some said Proof fired the first shot. he said, she said.\n\r\neither way, RIP Proof.\n\r\nby the way,\r\n\"The man who allegedly shot and took the life of D12 artist Proof was charged Friday (April 14) with weapons violations according to the Wayne County prosecutor's office.\n\r\nMario Etheridge, 28, of Detroit, has been charged with carrying a concealed weapon and discharging a firearm in a building.\"\nrapgodfathers.com/content/view/637/30/\n\n\n", "comment_261": "\nHey Butneveroutgunned...Are you retarded?  First off, you're from the UK.  You have no right telling anybody what is and isn't rap.  Second, this is one of Eminem's least \"pop\" songs.  A sparse drumrolling beat and personal/emotional lyrics is pop?  Yea right.  Third, Eminem didn't lose any hunger.  He says quite plainly, \"But don't get it twisted, it's not a plea that I'm coppin'\r\nI'm just willin' to be the bigger man \".  Keep your retarded comments to yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\n\"You know what the tragedy is going to be? It's that the music industry is going to Cannonize and Lionize this Proof guy. There will be Made for TV movies, Eminem will write a song and dedicate it to him, There will be a moment of silence at next years grammys and a short biopic of the kid that came up and made it on \"8-mile (tm)\" How he stayed true to the \"313\", and helped Granny's and Poor kids alike. What won't be mentioned is that he was the one that fired the first shot... What won't be mentioned is how he shot Keith Bender in the head over some stupid Billards arguement. Now Bender, probably will either die, or live the rest of his life in a vegitative state. No Tributes and Candle vigilles for that guy.. He was just a normal guy like us, not a popstar.. He was an Army medic and veteran from \"desert storm\". But he wasn't an overpaid pop star so fuck him... all he gets is an obituary if he dies on page 10 of a newspaper. \n\r\nSo here's my tribute to Army Veteran Keith Bender. Get well soon... \"\n\r\nAgree with everything thats up there...\r\nAll this pointless violence...\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\n1) I don't care.\n\r\n2) How in sweet fucking hell can you claim that your I.Q. is higher than mine?\n\r\n3) You're a dipshit.\n\r\nP.S.  Don't come on here saying you're going to educate all the white kids about what is and isn't rap.  First, you don't know who is and isn't white here.  Second, just because you are black (I'm assuming you're saying you are black) doesn't you mean you know more than other people, regardless of race.  Third, Eminem is white. I'd love to see you try to tell him what is and isn't rap.\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nsmurphy6. shut the fuck up you cunt\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nWow, now that Proof just died in a shoot-out, it's almost as if some sort of prophecy was fulfilled.  If you watch the video, it has Proof dying and now it's actually happening - I can't believe it.  Anyway, I think it goes without saying what this song is about.  In my opinion, it's like a more serious and a more slow version of D-12's \"When the Music Stops.\"  Brilliant song, classic Eminem.\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nhey fight the war.  go die in a fire.\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nP.S.  Hey neveroutgunned...thanks for enlightening us white folk about hip hop.  Now please go back to your Sytem of a Down page.  Oh, and then go fall in a volcano.\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nHey, I fell in a volcano once. \r\nFuck you, I don't need a feminem fan-boy to remind me of that.\n\r\nAnd NeverOutgunned is damn right, this poppy BS can't touch shit like Bad Meets Evil, Still Don't Give A Fuck, etc.\r\nEminem sucked the devil's cock, accept it or shut the fuck up, we have enough ignorance thrown our way (and I'm talking about people who is not like you, people who is smart and can open their fucking eyes and mind).\n\r\nAnd I agree with og_tool about the whole Proof thing. It's good to see the people who are actually capable are still thinking aloud.\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nHAHAHA Oh good Lord...Thanks for the laugh Elimination.  I'm not even going to bother responding to your entire post due to one fact...In the process of attempting to insult my intelligence you wrote  \"...people who is not like you, people who is smart...\"  HAHAHAHAHA! Holy shit! That's hilarious.\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nHoly hell this just keeps getting funnier.  So you're claiming to be \"Near Genius\", correct?  Well then you should probably know that your IQ will not improve if you go to college.  Your IQ is a measurement of your cognitive ability, not your overall knowledge.  Your cognitive ability will not be enhanced by college courses, it will be utilized IN your college courses.\n\r\nNice try Stephen Hawking.\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nWay to avoid my claims.\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nLike Toy Soldiers is a good song. One of the best on the album. Mosh is also good. neway, I liked the song b4 I started listening to alot of rap.\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nthis song is about Ja Fool mouthin off about Eminem and Hayley... shadey was tryin 2 set apart there differences and move on but Ja Foll wouldnt move on...\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nthis song is about Ja Fool mouthin off about Eminem and Hayley... shadey was tryin 2 set apart there differences and move on but Ja Fool wouldnt move on...\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\namazing song\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nI'm not much of a rap fan, but I actually like this song. It's really heart-felt, and not wat u normally expect from Eminem. \r\nHe's not -just- a hardcase, and all that. 'Tis cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nI dont know much about what the \" proper \" ( if there even is a proper ) way of writing rap music and i dont listen to much, but i do know that this is a great song and it really spoke to me and has a lot simularities to present time and all of the stuff that goes on in this world. Even though Eminem is a little, wierd, I still respect him and think that he is a great music writer.\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nYou're welcome, Smurphy.\n\r\nSeriously, though, ther is more to music than Eminem... even Eminem has better shit than this.\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nI've got over 100 songs in my mp3 player and over 30 different artists, but this song is in the top 10.\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nThe song is very meaningful basically saying beef even tho it starts out verbal can basically turn itself into a war\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\noh just too tell u this song is about proof dieing (sorry if some1 already said that i just read the first page and skiped to the 7th so i dont know)and thx for the imput bout ja rule.. i dind't know\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nit's kinda funny that em says he went thriugh his whole career without ever mentioning suge. That's actually not true, he does mention him in the song 'Bully', about how he's somehow controlling Irv Gotti through fear. Don't know if anyone else said anything about it, but i'm surely not going to read seven pages of shit to find out!\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nOne of shady's best song that doesnt involve kim or his mother. Shady is sho' the best rapper..i mean look at those lyrics. C'mon..cant be mad.\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nIm pretty sure this song is talking about the \"gang wars\" between all the different groups. splitting, backstabbing, mentioning things they shouldnt etc. Whether there is a reference in their songs or they said something in an interview.\r\nMany rappers got fuming mad and it started a whole mafia thing, people started just dissapearing and dying, and there were these huge things between all the record companies and rappers.\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nPlease have some respect. That is my first and biggest thing. Have respect for Eminem, Proof, Keith Bender, everyone posting on this song.\n\r\nThis song is lyrical genious. It is not about Proof's death, as it was written and was released 2 years before Proof was killed. This song is about the rap wars that are ruining the genre of rap. Rap wars have been around for almost 20 years, it's nothing new. Now some of you are starting the same shit that Em is saying. Just stop the bashing of everyone. Eminem released this song for a reason. If your a fan of this song and of Em, respect his wishes.\n\r\nLike many people, when I heard that Proof was killed I instantly thought of this video and how scary it is. It foreshadowed Proof's death, and reminds me of one of the closing scenes in the movie Stand By Me when River Phoenix's character is murdered and fades into the background. Years later he suffered a drug-induced heart failure. I can't imagine how hard it is for Em, D12, and Proof's family and friends to watch the video to this song and see their loved one like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nAs I see it then there are some really cold-hearted people in here! I don't believe for a sec. that Eminem will hold a grouch again someone for the sake of money. The way I see it Eminem is a good person of heart that NO MATTER WHAT wishes to see anyone killed like it happened to biggi and 2pac. In top of that I read the text as Eminem has groaned up, and thereby has become more scared for losing anyone close to him, Especially I think that he is afraid that there will happen something with Hailie! \r\nSo the way I read the text it is more like a father who tries to put the street behind him, and thereby make the life more safe for his Daughter and his crew.\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nim confused, in the video it shows two kids reading a book is that eminem and the guy in the hospital???\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nEminem said that this was about his friend who died...\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\ni love this song. \r\ni never knew about that line about Hallie.\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nThis song... wow. It's just amazing. I mean, just the mixing of innocence (the children singing the chorus) and then the dark verses. Yeah man, Ja should have never brought Hailie into this stuff. Amazing song.\n\r\nDoes anyone listen to the music in the background?\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\ni have always heard that the guy that was shot in the song/music video was proof, and i know proof was killed, but proof was helping em do concerts after encore came out, which is thealbum that like toy soldiers is on. does anyone know who the one is that is killed?\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\namazing cover. and great sad remade lyrics, breaks my heart :(\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nwhen theres tht pause n the song its Suge.he doesnt say it cuz it has 2 do with problems wit dre and suge n the 90's.(4 ppl who didnt know tht)p.s Marion Hugh Knight, Jr. is bttr known as Suge Knight or suge 4 ppl who didnt know tht.i may b a 13 yr old white blond girl but i know my EM's shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nthis song is about his fued with rival gangs and how his crew suffered. I think he had a right to have a go at jas for bringin his family into this cuz it isn't fair on them so no one shud of sed anythin about his reply to jas's rap \t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nsad irony...\n\r\nProof plays the victim in the video and then is murdered a few years later.\n\r\nI wonder if Em looks back on this song since Proof's death and feels guilty.  And for that matter, I wonder how he feels about Michael Jackson's death after he wrote the song \"Just Lose It\"....\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nFrankly i was suprised at the lyrical content of this song the first few times i heard it but the chorus makes up for it. well done song!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nThis song is about all the different wars/arguements/beef whatever you wanna call it between all of the rappers. The guy on the table is Tupac. Its representing that because of beef in the 'rap game' somone has been killed. Tupac was very close to Eminem, not many people know that, Hense why Eminem is co-producer of Amaru Shakur Records alongside Tupacs mum Afeni. Eminem is pretty much explaining what happened between 50 and Ja and Eminem and how Dre's business is Dre's business with Suge. Hense the (?) 50 and Jar Rules beef come from the fact that 50 released his album the same time Ja did and it topped it. Def Jam records then tried to get Suge Knight to release his single on the album to try and boost sales but failed and never did so. 50 and Ja have had beef since. Eminem doesnt want beef between 50 and Ja, Hense the line \"We actually tried to stop the 50 and Ja beef from happenin' \r\nMe and Dre had sat with him, kicked it and had a chat with him \r\nAnd asked him not to start it he wasn't gonna go after him \r\nUntil Ja started yappin' in magazines how we stabbed him \r\nFuck it 50 smash 'em, mash 'em and let him have it\" - Ja used to rap about muggin R&B stars and rappers etc. Which is one of the main reasons aswell why him and 50 never got on. Eminem made this song to try and end the beef in the rap game. At the end of the video you see \"Enough is Enough\" with Eminem sitting next to it on a news screen. He illustrates that he got in the game to do somethign he loved, rap. Not fight. Then at the end you see 4 rappers come up, Big L, Tupac, Biggie and the other dude but i forgot who. 4 Rappers who had lost there lives because of stupid beef because of rapping and how fame got to their heads. its an awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\nShouldn't this title have a question mark? But in response, yes Eminem i do like toy soldiers.\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\ntrash\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nOne of the only two good songs on Encore. (The other one is Mosh.) Encore has been saturated with pointless crap like Just Lose It.\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\ni think in no way shape or form can Shady/interscope and G-Unit take on Murder Inc. cuz first of all Irv Gotti is one of the most well known producers out there i mean if it wasnt for him we wouldnt have Jay-Z or DMX and second of all 50 cent keeps bringing more artists into the whole battle so now at this point after looking into it its now down to G-Unit /Shady/Interscope/violator/busta rymes.dj whoo vs. Murder Inc./Bad Boy/rockafella/death row/Ill Will/terror squad/jadakiss/scarface and at this point eminem has lost the battle between Murder Inc./Ja Rule as he confesses in his song \"like toy soldiers\". so im sorry to inform all you pussy G-Unit fans out there but the end of G-Unit is coming and to think feminems little pussy white boy ass could take Ja is a joke just like his music i mean ive never taken feminem seriousley i mean all of his songs are jokes its like this . Here comes world famous rap star Jay-Z... heres NAS... and heres that wacky white bot feminem (clown music) cuz im slim shady yes im the real shady... and heres T.I.\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\ndeez\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nThis is to all of you guys who wrote things like \"Eminem is the greatest\" or \"Eminem is the best\":\n\r\nI personally think Eminem is the worst singer/song writer ever.  He is a whiny asshole and should stop trying to sing and just start doing drugs.  That's all he's good for.  I don't see why he has to cram so many stupid lyrics into one shitty song.\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\n\"Eminem\" is short for \"Cock-eating Retard\"\n\r\ncuz I sed so, PIMP HOE CRACKA HOE PIMP DAWG HOE PIMP CRACKA DAWG HOE CRACKA!\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nHi, I would like my I.Q. points and 5 minutes of my life back, please.\t\t\t\t\n\t\t\t\t\n\n"}