{"comment_0": "\nif you don't like it asshole, don't listen to it\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nTrue... maybe not the greatest music out there... but then again, what is? It all depends on your mood, I'm Dominican and have been listening to reggaetton since the old days when only underground stuff used to come out, nobody thought it was going to make this big a boom, and I myself was reluctant at first to accept the transition of the genre, but u know what... I really enjoy it, and it's not really the artists fault that the genre has reached such high levels of acceptance between communities, enjoy the music, dance to it. if you don't like it then don't waste your time posting here or hearing it! do yourselves a favor... :)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\npitty post\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nBetter than that mexican regional and texmex crap you guys come up with lol\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nyankee is from Puerto Rico and so am I.. we dont really care about the lyrics or what it means as long as if its catchy and fun and sexy to dance with. i think people hate yankee because the media over-exposed him and also because they think he is a poser or a fake or whatever but we here know what he is all about and he is one of the greatest to us. and its a fashion so i know its not forever but as long as reggaeton is IN.. well, he will be remembered.\r\n and this song is not about sex...is about a guy saying to his exgirlfriend 'hey, we are through , face it . its over. you cheated and im not gonna take it etc\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nbooo dont bash on daddy yankee. He's sexy.\n\r\nand yeah. this song is about \"its over, blablabla\"\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nhaving latino friends and working at a place where the majority of employees are latin doesn't make it that easy. i can put up with it, but it's not the greatest music out there.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nnot all reggeaton is about sex! most of it is though lol\n\r\nI like reggeaton is the best music to dance and like it or not Daddy Yankee is now one of the greatest most important musicians out there, he's known world wide and has had a lot of success in Europe and the States.\n\r\nReggeaton may not be the greatest music, but it's not the worst either.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nGod, could somebody keep this guy from making more music? Here in mexico iÂ´m surrounded! Arghh!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nReggaeton sucks. I'm from mexico too, and it's true, we're surrounded. People only like this music because it's danceable, but ALL lyrics with no exception talk about sex. I mean, sex is cool, but... all songs like this one are substituted by another song, and that one by another and so on. So... what is it you find interesting about this music?\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nif you don't like it asshole, don't listen to it\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\n133:\n\r\nUGH\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nso many haters lol shiiiiit\n\n\n", "comment_13": "\nlatin music as a whole is the worst, well possibly not the worst but it is damn near intolerable. you can't take latin culture seriously when you listen to some of their \"ranchero\" music like Vincente Fernandez and whanot and especially reggeaton and all that puro paisa shit. Reggae is for the Jamaicans, okay.\t\t\t\t\n\t\t\t\t\n\n"}