{"comment_0": "\nat the beginning of Busta's verse its not HAIL, its actually Ayo.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nin weezies part it is not my daddys dead you faggots scared it is my daddys gay you faggots gay duh\n\n\n", "comment_2": "\nOkay, just, one thing:\n\r\nEvery lyric site/youtube video posts incorrectly, \"Shudder\" during Busta's verse. Sersiouly, people- \"shudder\"? Are you all just retarded? It's quite clearly \"show that.\" \n\r\nEvery time I come, a nigga gotta set it then I gotta go in and I gotta get it\r\nThen I gotta blow it and I gotta SHOW THAT any little thing the nigga think he be doin'\r\n'Cause it doesn't matter 'cause I'm gonna da-da-da-da-da\n\n\r\nThat is all.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nBusta's verse is SO. FUCKING. AWESOME. And fast. :P \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ndamn i this song is fuckn bad ass but its a bitch to remember busta's verse lol \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nsome small corrections in Lil' Wayne and Busta's verese:\n\n\r\nI don't see how you can hate from outside of the club\r\nYou can't even get in!\r\nHa... LEGGO\n\r\nYellow model chick, yellow bottle sippin'\r\nYellow Lamborghini, yellow top missin'\r\nYeah yeah, that shit look like a toupee\r\nI get what you get in ten years in two days\r\nLadies love me, I'm on my Cool J\r\nIf you get what I get, what would you say?\r\nShe wax it all off, Mr. Miyagi\r\nAnd them suicide doors, Hari Kari\n\r\nLook at me now\r\nLook at me now\r\nOh\r\nI'm gettin' paper\r\nLook at me now (OH)\r\nLook at me now (YEAH)\r\nFresher than a muh-fuck\n\r\nLil' nigga bigger than gorilla\r\n'Cause I'm killin' every nigga that can try to be on my shit\r\nBetter cuff your chick\r\nIf you with her, I can get her\r\nAnd she accidentally slipped and fell on my dick\r\nOops, I said on my dick\r\nI didn't really mean to say on my dick\r\nBut since we talking about my dick\r\nAll of you haters say hi to it\r\nI'm done\n\r\n(BUSTA)\r\nL Breezy!\r\nLemme show you how to keep the dice rollin' when you doin' that thing over there, homie\r\nLESSS GO!\n\r\n'Cause I feelin' like I'm runnin'\r\nAnd I'm feelin' like I gotta get away, get away, get away\r\nBetter know that I don't and I won't ever stop\r\n'Cause you know I gotta win every day, day (GO)\r\nSee they don't really wanna pop me\r\nJust know that you will never flop me\r\nAnd I know that I can be a little cocky (NO)\r\nYou ain't never gonna stop me\r\nEvery time I come, a nigga gotta set it then I gotta go in and I gotta get it\r\nThen I gotta blow it and I gotta shudder any little thing the nigga think he be doin'\r\n'Cause it doesn't matter 'cause I'm gonna da-da-da-da-da\r\nThen I'm gonna murder everything and anything, a-bada boom, a-bada bing\r\nI gotta do a lot of things, and make it clearer to a couple niggas\r\nThat I'm always winning and I gotta get it again and again and again\r\nAnd I be doin' it to death, and now I move a little foul\r\nA nigga better call a ref, and everybody know my style\r\nAnd niggas know that I'm the best when it come to doin' this\r\nAnd I be bangin' on my chest, and I bang in the East\r\nAnd I bang in the West, and I come to give you more\r\nAnd I will never give you less, you will hear it in the street\r\nAnd you can read it in the press, do you really wanna know what's next? (Less go)\r\nSee, the way we on, we be all up in the race\r\nAnd you know we gotta go, don't try to keep up with the pace\r\nAnd we strugglin' and hustlin' and sendin' in and gettin' in\r\nAnd we always gotta do it, take it to another place\r\nI gotta taste it, and I gotta grab it\r\nAnd I gotta cut through all this traffic\r\nJust to be at the top of the throne, better know I gotta have it (have it)\n\r\nLook at me now\r\nLook at me now\r\nOh\r\nI'm gettin' paper\r\nLook at me now (OH)\r\nLook at me now (YEAH)\r\nFresher than a muh-fuck\n\r\n(WEEZY)\r\nMan, fuck these bitch-ass niggas\r\nHow y'all doin'? I'm Lil Tunechi\r\nI'm a nuisance, I go stupid\r\nI go dumb like the Three Stooges\r\nI don't eat sushi, I'm the shit\r\nNo, I'm pollution, no substitution\r\nGot a bitch that playinâ\u0080\u0099 movies\r\nAnd my jacuzzi pussy juicy, I\r\nNever give a fuck about a hater\r\nGot money on my radar\r\nDressed like a skater\r\nGot a big house, came with an elevator\r\nYou niggas ain't eatin', fuckin' tell a waiter\r\nMarley said shoot 'em and I said OK\r\nIf you on that bullshit, then I'm like OLE\r\nI don't care what you say\r\nSo don't even speak\r\nYour girlfriend a freak like Cirque du Soleil\r\nThat's word to my flag\r\nAnd my flag red\r\nI'm outta my head, bitch, I'm outta my mind\r\nFrom the bottom I climb\r\nYou ain't hotter than mine\r\nNope, not on my time\r\nAnd I'm not even tryin'\r\nwhat's poppin' Slime?\r\nNothin', Five\r\nAnd if they trippin', fuck them five\r\nI ain't got no time to shuck and jive\r\nThese niggas is sweet as pumpkin pie\r\nCiroc and Sprite on a private flight\r\nBitch, I've been tight since guiding light\r\nAnd my pockets white and my diamonds white\r\nAnd my momma's nice and my daddy's dead\r\nYou faggots scared 'cause I'm too wild\r\nBeen here for a while, I was like FUCK TRIAL\r\nI puts it down, I'm so Young Money\r\nIf you got eyes, look at me now, bitch!\n\r\nLook at me now\r\nLook at me now\r\nOh\r\nI'm gettin' paper\r\nLook at me now (OH)\r\nLook at me now (YEAH)\r\nI'm fresher than a muh-fuck\n\r\nOK\r\nOK\r\nIs that right?\r\nI'm fresher than a muh-fuck!\n\n\n", "comment_6": "\nI think this song is about Rihanna, these lines:\n\r\nYeah, Yeah, That **** Look like a toupee (Dissing rihanna's hairstyle)\r\nI Get what you get in 10 years, in two days. (Chris is really more successful than Rihanna)\n\n\n", "comment_7": "\nWhy would he call his dad gay? it could be dead or geek but gay? do you have any source to this? Also, what does \"my pockets white\" mean? I thought it was \"wide\" before seeing the lyric\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nOops I said, on my dick.  I didn't really mean to say, on my dick.  But since we're talking bout my dick--all you haters say hi to it.  <3  Gotta love 'em.  \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nit was more right before, but some idiot had corrections done to my lyrics, and now i can't edit it myself\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nMan shut up guyz ur just jealous cuz you cant do it jk!:)\t\t\t\t\n\t\t\t\t\n\n"}