{"comment_0": "\nEminem is very talented in what he does and how he sings. He gets his message accross to the people the best way he knows how. All music is, is art...and you shouldn't criticize someone for their art work. It's all talent regardless. He is very talented in his way of showing his artistic talents.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nPretty sure several lines are wrong here. This transcription on Lyriki.com seems closer: lyriki.com/… \n\r\nOnly one line in that version seems possibly wrong to me: \"But I kept rhymin and stepped right in the next cypher\" vs. the line here: \"But I kept rhymin and stepwritin the next cypher\" \n\r\nHonestly neither sound correct. It's the only line that doesn't seem right somehow. Maybe it's \"But I kept rhymin in step, writing the next cypher\" \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nUhm,\r\nto the person who wrote the quote which said\r\n\"people who can't sing do rap\"-\r\nhave you heard his singing voice? it's brilliant\r\nhe's great.\r\nMy favorite bit in this song is\n\r\n\" This world is mine for the taking\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song really means alot to me because its about how Eminem went through life and rose to stardom only to realize thats its not all he ever wanted.\nThese next lines are the most important lines in the song I believe\n\nToo much for me to want to\nStay in one spot, another jam or not\nHas gotten me to the point, I'm like a snail\nI've got to formulate a plot fore I end up in jail or shot\n\nThese lines are saying that he is realizing that he is becoming stuck in his position and he doesn't like where he is at. He goes through his motions in an attempt to break out of the system in which he is becoming trapped. Any plan that he would make has to be a safe plan because he does not want to be killed or go to jail over it so he is thinking on what options are out there to get away from everything and go back to the old times. He is saying that he is a snail because he doesn't enjoy what he is doing and feels like his life is going by to slow for his liking.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nim not a big fan of eminem but this is a really good song.  and this is the first eminem song that i actually like\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThe soul's escaping, through this hole that it's gaping\r\nThis world is mine for the taking\r\nMake me king, as we move toward a, new world order\r\nA normal life is borin', but superstardom's close to post-mortem\n\n\r\nAnyone else find these lyrics creepy and out of the ordinary?\r\nHes talking about selling his soul for the music industry saying superstars are practically dead because they have no souls.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song is so damn true. Stage fright gets you your first few times in front of the underground crowd....it's fuckin crazy too, because you think you aren't nervous....\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthis is a kickass song i heard it on the radio yesterday im buying the 8mile osundtrack...but when i try to dl this song it loops everytime...help guys?\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nheh how sweet is this two em albums in one year!!!!!!!!!! Lose yourself describes how people sort of get a \"High\" off of rapping and freestyling all the shit that bothers you everyday is gone and your in the zone but afterwards you feel like shit again\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nwohwho DeadAngelicHeart, you are awesome.  Exactly what I would have said!  This song is AWESOME!  I can't stop playing it, and I can't help but get into it.  It's great!  I love the beat.  \"Da da dum da dum da da\"\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI am NOT a rap fan at all,\r\ninfact I am probably the last person you would think listens to Eminem.\r\nBut, all of his songs make me want to get up and move,\r\nand despite how rediculous the song is, if you pay attention, all of his songs have a meaning.\r\nYou just have to have a mind that is capable of figuring it out.\n\r\nAnd for the people saying, \"nobody cared about what happened to you as a kid!\"\r\nWhatthehell? Seriously.\r\nYou are only able to sing about what you know.\r\nYou can't write a love song if you've ever experienced love, not a good one anyways.\r\nTHIS is what Eminem knows, THIS is his motivation, THIS is what moves people.\n\r\nGetoveryourselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nwhen he says \"New World Order\" he's hinting at something so much bigger than this song and him, and he knows it. but generally the song is about the hardships he went through to get where he is in the hip-hop world.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ni luv this song its great and i like eminem he's like the best\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nPrefer his Eminem Show songs, a lot more political and like the fact that he's not afraid to piss off the powers that be.  I like it when musicians aren't fearful and held by the balls, the powers of speech are divine, best to express the freedoms you have.Edited by random_monkey on January 29 2006, at 10:30AM\n\n\n", "comment_14": "\ngreat tune....always wanted this song since i saw the trailer for 8 mile\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nseriously fellaz and ladies, how can you diss someone with so much talent??? Look at his words look at how he uses them, it flows so smoothly, words just mesh and shit when he uses them. He's awesome and talented as hell!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nman, this song is so amazing. one of em's best...\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\neminem is a great rapper!!!  not my favorite but he is awesome and i like dis song alot, i just love the way his lyrics flow and some of the stuff he says i dont agree w/ his lyrics r the most honest i've ever heard, he has guts 2 do all that.\r\npeace peeps\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nthis is clearly one of em's best songs.  His lyrical skills surpasses any other MC out there.  He rhyming scheme, and his flow largely surpasses that of NAS and Canibus.  There is no way that one can beat this guy.  His lyrics cannot be touched.  \n\r\nEm knows what is controversy and will sing about it, he doesnt sing about the \"bling bling\" or about \"hoes\".  He speaks of his life experiences, which is so much better....\n\r\npeace\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nyou sometimes might think you have to quite and when you think that you are losing yourself, you have to keep on tryin as in the words\"I been chewed up and spit out and booed off stage \r\nBut I kept rhymin and stepwritin the next cypher \" you have to keep tryin, believe in yourself, Be All That You Can Be!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nTo me this is Eminems best song yet,  I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni think this is one of eminems best songs ever..it is very inspiring!\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ncool song.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nGreg Cooper you cant say that Eminem largely surpasses Nasâ\u0080¦ Eminem is rated highly by meâ\u0080¦ but Nas canâ\u0080\u0099t just be surpassed so easilyâ\u0080¦ Im not saying that Nas is the bestâ\u0080¦ but Eminem would have a hard time knocking Nas out the ringâ\u0080¦ take time to look at all the facts before you dish out your opinions â\u0080¦  Great song...  one of his best\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nive d/l the 8 mile sdtk and its fucking too good....\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is freakin tight!  And that should mean alot because i really don't like Eminem,  Finally he comes up with a good song about just loving music.  But I think at the end of the hook he says this opportunity comes once in a lifetime, don't let it go.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nYou got the lyrics wrong.\n\r\n\"Stay in one spot, another jam or not / Has gotten me to the point, I'm like snail\"\n\r\nis\n\r\n\"Stay in one spot, another day of monotony's / Gotten me to the point, I'm like snail\"\n\r\nDamn Good song though.  Definitely his best.\n\n\n", "comment_27": "\neminem has the quality of rappers such as biggie or jay-z in that every single he releases is a hit, and not just top 40 radio. love him or hate him, he's got the talent. (i love him)\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis song means TWO things to me: \r\n#1. It just kicks ass. Listen to it and you're hooked.\r\n#2. It's my connection to someone. Finally, something we agree on: This song kicks ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni respect eminem as a rapper...i usually don't care for him that much, but he's damn talented. this song really exemplifies it...and it is a really motivating song. it was hella awesome when he performed it with the roots at the grammys.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nGood song...I saw the movie. Eminem is a very talented person. He's got potential.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\neminem was a poor excuse for a musician, until he wrote this song. this song is awesome! finally a damn eminem song that can get his message across without offending everybody. if he keeps writing music like this, i might actually begin to respect this guy...\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nGreat song!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nYeah. Black people get no attention in hip hop.\n\r\nTry choosing words better. \"hes onli good coz hes white...there r soo many fucking rappers better den him\" makes no sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nseriously, love or hate eminem, he is definatley talented, and so talented it doesnt matter if hes balck or white thank you llkool v , but hes also a fucking awesome business man, and knows how to capture the spotlight and keep it\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nQuentin Tarrintino has the Palm D'Or for Pulp Fiction. Emminem has an Oscar for Lose Yourself. Evidence that talent is recognised and rewarded despite all the politics. Isin't this just the greatest fuck you Emminem could ever wave at his crittics.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis song is sooooo tyte!!! And when he is singing it on the music video, he looks sooooo freaking HOTT or SEXY!!!! MMMMM mmmmmm good!!! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\ni don't like rap, i dont like eminem but i think this guy is very talented.. u might be asking then what the f*ck am i doing here if i dont like eminem, hehe just cheking lyrics cuz i just heard this song in the radio and wanted to know its exakt kontent... he's very sincere and talented... good for him.. \r\npeace ..punk rlz\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThis song is the highligh of Eminem's career. Eminem is exremely talanted and has gone a long way\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nthis song is very eye of the tiger. i like it for that.\r\nlosing yourself in music is crucial sometimes.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI don't know what i'm gonna say right here !! i can't Eminem is best of the best in US , but sometimes he deserves to win over something . I also agree there some blacks are talented in rapping like 2pac , he's the one i appreciate . Does anyone would like to comment \"\" Snoopdogg \"\" .....thanks\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThe first time I hear this song, I already like it. I think the lyrics of this song tells about his life and how he overcomes those obstacles.the song wants us to know that if their is a chance given to us,we should waste our time to grab it.co,z chances comes only once in a lifetime\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nnormally, emenem is so small-minded that he pisses me off. but here, as in \"sing for the moment\" he has his instances of brilliance. great song, with a great message\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nEminem has no talent. This song is bad and the meaning is just stupid.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nHey mung bean, brush up your own grammar before criticizing others.  And maddox, you're even dumber than the other guy.  Yes I know what reiterate means and I also know how to spell it correctly!\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nHah, mung bean (who is a major jackass, for anyone who hasn't noticed) says that eminem fans need to learn to master the english language, then maddox (another fool) agrees with him and posts a comment featuring the word 'gay' 122 times in succession. Stupid people make irony fun.\n\r\nAnd no, i'm not an Eminem fan.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\ni'm not much of an eminem fan either but he is talented, even though he does have a screwed life. anyway, sure dr. dre helped him but it's not like many people out of the millions in this country could become another eminem w/ the help of an experienced rapper.  and hey maddox, don't you know most people who call other people gay are just doing that to hide things about their own lives?\r\ni can't stand people who use the word 'gay' so loosely, it's like they don't have anything else to do or say and can't think of a great come-back.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nWell firstly Maddox  sucks massive balls \r\nHe is gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, and GAY.... \n\n\n\n\n\n\r\nOh, did i mention that MADDOX IS AN OVERRATED POOFTER WHO TAKES IT IN THE BUM.... \n\n\r\nThis is probably my favourite eminem song the beat and lyrics are just genius. No matter what anyone says em is the best rapper in there ever has been or will be.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI like this song lols colin ur gay.Eminem's sexy i bet ur just a fuckin dork.Anywayz luv ya em.You suck colin1313\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nBest song ever to get the adrenaline pumping though your veins in an effort to crush all the naysayers when in preperation for the biggest, most dynamic, epicly important job interview of your entire fuckin' life.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThis song is based on the 8 mile picture\r\ni don't care about rap, and never did either about eminem until i heard this song.\r\nThis song is about someone who lost some fight, some duel, some thing that he proposed to do or become\r\nAnd he's trying to get back in the road, he only have on shot! And all the beat makes you pumping, makes you wanna try again! It's great! you feel like you're b. rabbit, you feel you've got to get back to the fight, either literal or metaphorical, of life!\r\nIf you skip the hate for eminem, you'll all love the song as i do\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\ni kno how it is to get up in front of a whole bunch of people and i see where he comes from. ive been booed off stage and its sucks but im up there the next week doin it all again to me one time getting booed isnt goin to ruin what ive worked hard for\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nYou're gonna lose yourself, Eminem!\r\n2 Bad!\r\nAll Of Your Songs Sucks!\r\nYou Hear Me?!\r\nAll of your songs SUCKS!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nhey man wats rong with being gay? and this site is called songmeanings.net not lets tell other people how much their chosen genre of music sucks.net i mean we dont go 2 maddox or colin1313's boyzone post and dis them\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nwow this song was great its inspiring and meaningful. Stage fright is a problem with me and this song helps.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nLook i am an Eminem fan and have nearly every Em song going it pisses me off when people cum onto Rap lyrics just to tell everyone how much they hate them. PISS OFF\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\ni luv eminem his music is th best.. but for sum reason this song just gets to me, i think its the beat and the lyrics dont seem to flow to well... also wots with the 30seconds piano intro...\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nInteresting fact about this song - auto insurance companies say that this song is responsible for more accidents than any other song out there.  People just go nuts when listening to this song in their cars.  How can you sit still listening to this?\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nits all about life,if he runs for president,ill be his first voter.world is round!\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nI like this song so much the beat is really cool i dont really like him but its pretty cool song\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nMake a mistake, so you don't make it next time... that's what i get from \"Loose yourGoose (in the music)\"\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI'm not a rap fan.  however, i will give credit where its due and, despite aprehension at first, im starting to like eminem more and more.  Especially this song.\n\r\nJust thought id point out that the meaning is obvious in this song, but people overlook the fact that Eminem isnt just referring to stage fright.  He's delivering a message about life in general.... You've only got one shot, do not miss your chance... basically, take lifes oppurtunities when they come to you.  They might never arise again!\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nfirst of all, this is my absolute favorite song...ever. this song is incredibly deep for eminem, and i think it reaches just about everyone, because everyone is struggling to make at least one aspect of their life better....and it could remind us of work, a relationship, money, something material....anything.\r\nand rather than bemoaning what he DOESNT have, this song says that you need to fight for what you want right now...a very upbeat message.\n\r\nmy absolute favorite song to run to...the best line has got to be\r\n\"another day the monotonies gotten me to the point where im like a snail i got to formulate a plot success is my only mothafuckin option, failures not...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nMaddox u r my hero! All the other f##kin conformists loving this little fag who's a smart ass, coz he's too queer to fight. He's as gay as those punk fags!\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI'm pretty sure that people who overuse gay, queer, fag or whatever as insults are secretly torn up inside because they sneak looks at other guys' dicks in the locker room and can't face themselves for it.  \n\r\nAnd by the way, this song is amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nFrankly, it's inspiring to me. That carpe diem mentality, it's really something to live by, 'cause we're all dying at some point. If half a chance is all I have, then it's all I need.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nhmmm this is good man as far as i am concerned another good song is mocking bird i was amazed that he rapped his whole life in a song man koolzzzzzzzz\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI usually can't listen to rap without feeling the need to kill whoever wrote such a piece of crap. This artist is a rare exception. To those of you who would like to call him gay: Freudian projection. If you don't know what it is, look it up.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nIt is really amazing that people actually _choose_ to affront Eminem's passion for rapping and making songs. This song is one of many that inspire people. I mean, if you edit out the cuss words and such, parents would like it, too! The intro and outro teach people to reach for the stars and that life's goals are limitless. The song goes well with the movie, also building up suspense in the trailer. The music video is basically excerpts from the movie, but intervals show him standing there. He is a lot like a preacher who encourages you to set your mind to what you want, no matter the obstacles. Except most preachers don't use swear words. O_O\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nThis is one song that has come out of the rap world that I not only can tolerate but I also enjoy to some extent because of the pure message.... Never give up, never surrender, fight for your dreams......\n\r\nI simply can not deny the integrity of this song and that in of itself makes me like it.... or it could be the rip of an old rock guitar riff for the intro but i dont care......\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nNo more games, I'ma change what you call rage\r\nTear this mothafuckin roof off like 2 dogs caged\r\nI was playin in the beginnin, the mood all changed \r\n=======================================\n\r\nthis line always makes me think of when a friend just fucked you over and your sick of the shit so you go out and just snap on there ass, beating the shit outta them\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\neminem is so shit how can anyone listen to this music i mean its just so crap id much prefur rock music at least it has meaning this is just someone talking really can he actually sing???\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nFreakyshe Freakyme..u r shit!!! i listen 2 rock music but i listen 2 eminem 2.he the only hip hop rapper i would listen 2 n the \r\nonly rapper that made me found respect of the whole hip hop \r\nthing...eminem jus amazing...love him.love his music...\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\noh yup whatever\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI don't really listen to rap hardly at all, mostly just rock (disturbed, slipknot, sum 41, offspring, etc.), but this song totally kicks ass.  I heard it on one of those ipod commercials on tv, and i knew i had to get it.  I dunno about any of his other stuff or any other rappers, but this song is kick ass all the way!\n\r\nAnd I'm pretty sure it's \"post-mortum\" (check my spelling), not post mortar.  Post mortum means that fame come after you're already dead (like tupac).  post mortar would mean.................................................................................................................................................after you get hit with a mortar, I guess.  ;-)\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThis song's about your opportunity to shine, in an activity or for just in life. I always listen to this song when I'm about to play an important baseball game or do anything that is important to me in general. One life, one shot to come out on top. Capture the moment and run with it, see where it takes you. A very motivational song.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nHe won't have it , he knows his whole back city's ropes\n\r\nThis line sounds to me like it says\n\r\n\"He wont have it, he knows his whole backs to the ropes\" or something like being against the ropes in a boxing match sort of... I don't know the meaning behind city's ropes... I think hes saying that his back is either being held back by ropes, you know, like he's chained... or that he's losing a fight but he knows he can come back... let me know what you think this lyric truely is, and if the poster of these lyrics was correct.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nlol zeppelinrules, that made me laugh.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThis is easily eminem's best song. nice tune, good lyrics and a different video to boot. if only this kind of rap music had more promenence as opposed to those 'bling' bastards. for more good rap, look for Scribe\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\ni know a lot of people won't really care  but this song has the power to make me cry baecause it is the song that one of my best friends loved and played a lot before i moved away without saying good bye to any one..if you think i'm laing then think not because this is soo true.. mainly the first verse:\r\n\"His palms are sweaty, knees weak, arms are heavy \r\nThere's vomit on his sweater already, mom's spaghetti\r\nHe's nervous, but on the surface he looks calm and ready \r\nTo drop bombs, but he keeps on forgettin \r\nWhat he wrote down, the whole crowd goes so loud \r\nHe opens his mouth, but the words won't come out\r\nHe's chokin, how everybody's jokin now\r\nThe clock's run out, time's up over, bloah!\"\r\nthat first part is the whole key of the song! it makes it what it is..if you hate him ohh well! i just want you to know that if you hate eminem or love him it doesn't matter one song can change a persons life for ever like it did mine...\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nThis song for me means no matter where you come from you can still do great things. You can move from the bottom all the way to the top. Gotta love Eminem!\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nI really don't like Eminem as a person, but as a rapper, he puts that much emotion into his voice... almost makes u feel that ur there... crazy stuff\r\nThis song is one of his best...\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nsong is shit, just like all of his crap\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI honestly don't like rap at all but this song is written so beautifully that I love it. It gives me courage to do whatever I want and to fuck what other people think.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nok so someone at the beginning said eminem ripped the beat for this song off another song-- yeah i've heard this before-- what song did he use?\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nok theres a part of this song that really makes it brilliant.\n\r\n\"And it's no movie, there's no Mekhi Phifer, this is my life\".....\n\r\nI mean its like the song changes at this point and becomes what he really wants to say, I mean this is Eminem at his creative best :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nThis is one of the only rap songs I like... The lyrics are easy to relate to. Even if it isn't going up on stage, everybody at some point in their life has to face challenges, and this song puts into words perfectly the thoughts and feelings one runs into at those points in our lives.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\ni like rap, although i don't listen to it very much, because it's just not my thing. but i reeally like eminems music! this song is one of my favourites, because it's not as negative as some of the other songs out there. it rocks!!\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nThough it said\n\r\ntitter-totter caught up bein a father and a prima donna\n\r\nnot\n\r\ndishonor caught up bein a father and a prima donna\n\r\nand \n\r\nThese whoes don't want him no more, he's cold product\n\r\nnot \n\r\nThese bosses don't want him no more, he's cold product\n\r\nAlso fuckin sick song, his best IMO\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\ncurtain call kicks ass and this song does to\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nThis song is good, even though i'm not all into rap and stuff. More alternative to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\n\"people who can't sing do rap\"- John Entwistle\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nthe fact that eminem was so successful with this song, which is a straight up hip hop song about (in essence) making hip hop music, about just getting up and rhyming....no scantily clad women in the video, no R&B chick on the hook, no pop instrumental for the beat, and nothing but densely layered assonance-heavy multisyllabic rhymes...is something that he will always, always, always deserve respect for.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\ni think this song is about what he did to get to where he is and how. i dont know if im close but i think it makes sense.\n\r\ngood song!\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nim not eminems hugest fan but this song is pretty awesome. Way better than alot of the crap out there. atleast its about life experiences and has a good measage. i agree. dont just give up bcos something goes wrong. i also like the fact that yuo can relate it not just to a love of music and performing but to alot of things in life\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nPossibly about either stagefright or fighting to become a rapper.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nidc if u hate or love em, this song is amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\ndude, thank you CuRiOuS for saying all that cuz i would have had to type it in but now it's already there!  I totally agree with you on everything and have nothing to add.  You read my mind, dude! (or dudette LOL)\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\ni am NOT A FAN OF RAP, but this is one of my favorite songs. Eminem has talent, and thats me saying it i quiet musc picky. This song is about going, and going n just keep on u know and the beat behind it says that to. its a really great song its been of my favorites for like 5ish years\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nI've seen many ppl agree that rap was not their fav genre until they heard this song. I definately agree. After hearing this song (and Mockingbird) Eminem is my fav rapper. His life is pretty messed up and he sings bout it. I love it!! He's so full of anger and passion. Well, some of his songs are like that...\n\r\nMy fav part is the last verse, where he goes \r\n\"No more games, I'ma change what you call rage \r\nTear this mothafuckin roof off like 2 dogs caged \r\nI was playin in the beginnin, the mood all changed \r\nI been chewed up and spit out and booed off stage\" \n\r\nAmazing. so full of anger....\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nThe song was made in the movie 8 mile (which eminem said wasn't exactly a documentary of his life but it did represent growing up in Detroit) at the start of the movie he chokes while free style rapping and doesnt manage to spit one line in his 45 seconds time. The start of this song(on the music video) shows the same footage as the start of the video with him hurling in the toliet and then when he gets on stage not saying anything. As do the lyrics of the start of this song say.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nbest.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI dont look at the song as one that represents only music or being on stage. It is a great motivator for anything you try and want to succeed in.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nI hate Eminem.\n\r\nBut I must say, This song kicks friggin ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\ni really like eminem.. its weird bc mostly i hate rap this song is my most favorite outta n e song ever!  hes just a very talented writer\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nI still find Stan better. This is a great song and both Marshall Mathers and The Eminem show were great albums, but everything he realeses after Lose Yourself really sucks. Encore? Yea, well, it's better than 50 Cent, but it's still just crap.\n\r\nI used to love Eminem, Mobb Deep, Dr. Dre and all the others but hip-hop has changed. It's all about girls, sex and drugs. What's the fucking point? I listen to alternative rock now, because that's the only genre really moving and innovative.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\noh my god, Marshall is LEGEND. all his lyrics are mind blowing, its like wow.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nThis song really is about Dedication. Dedication to what you're doing (and passion for it); dedication that regardless of your circumstances, your personal weaknesses, that you're set on your goals; giving it everything you've got.\n\r\nThe song is so true: our lives are short, yet EVERYONE receives at least some opportunities in life - but not everyone captures it or makes the most of it... and of course some of these opportunities are really those \"once-in-a-lifetime\" events, those key moments that define the course of the rest of your life.\n\r\nWhat Eminem suggests as the way to \"success\" is so true... one literally needs to lose themselves in what they're doing, in order to become the best/succeed at it. I'm sure those of you who have been part of \"successful\" endeavours would know that when you're in the middle of it all, you must literally \"lose yourself\" - you're so completely focused on the task at hand, not allowing your mind wander - to the extent that you begin to lose selfawareness of yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nI'm not one for rap anything, and some of Eminem's stuff is kinda sketchy, but man, I cannot deny that he's very good at writing, at least in this song.  You read it out loud if you don't know the song and you get some of the rhyming and the way the words fit together, but hearing him rap it and how he uses the sounds and cuts words in half to rhyme and everything...it's amazing.  Wish I could write near half as well as he can, ha.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nI hate rap. I listen to metal mostly, favourite bands include but are not limited to Cradle of Filth and Iced Earth etc. - but! I love this song. I first heard it when I was young, my brother, who is older than me, used to listen to rap and metal both, and he made me listen to some of the bands he liked.\n\r\nEminem is the only rapper I will ever respect. Lose Yourself, When I'm Gone and Mockingbird are my favourites.\n\r\nOnce I decide to listen this song, I can't stop.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nThere are a lot of music elitists who bash on rap and other music that they believe to be mainstream because they're pretty much close-minded idiots that just hate something for no reason. \n\r\nThough, there's people here who don't like the song, but don't sound like idiots like the other people. If you don't like the song and you express yourself in a decent manner, then I'd respect your opinion. But, the people that might've heard one song by an artist and say that they hate everything by them when they haven't heard most of their music are just idiots to me.\n\r\nAnyway.\n\r\nThis song is pretty catchy and can get you pumped up.\n\r\nTo me this song is about taking a leap from your comfort zone and try to get what you really want. To put yourself out there where you could fall and be mocked or stand up and pass the obstacle.\n\r\nTo just go all out for it if you really want it.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nthis song is autobiographic, its raw, and its honest. and its like some of his later songs which are so bitter. its just truth. theres no denying how talented this guy is. he changed the whole rap scene eventually but obviously he there were sacrifices along the way... \n\r\ni have a sligtly different take on this. being a new student nurse in my first year and having just started my first placement on a hospital ward i uses this song (the lve lounge version) to overcome difficult time and situations i face with patients. because this songs all about wanting to better yourself with your career. and its hard. people are going to be with you helping you acheive it whilst others are going to against you waiting for you to slip up. and no matter how hard you try your going to make mistakes. but whats important is that you dont let them ruin your dreams.. you learn from them and cary on striving. at all sorts of costs. eminem is or was a multi millionaire but look at how hard it was for him. but now hes sort of backed down from his career and i presume hes doing to spend time with his childeren. he acheived what he wanted in life you know? \r\nbasically, its scary having to do something new especially when its not in your comfort zone be it stage fright or doing something like giving yur first injection.. two very different situations but relatively the same kind of adrenaline inducing event\n\r\ndeep stuff i know but still..\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nThis is the lyrics that made him\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nLook. If You Had One Shot.. or One Oportunity to seize everything you've ever wanted. In One Moment. Would You Capture it. Or Just Let it slip. YO!\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\none of eminems best\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nSeriously. It's just about taking a chance\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nI hated this song when it 1st came out, only cause it was CONSTANTLY played on the radio and at my school dances, just EVERYWHERE I would hear it!! But lately I was watching FUSE Eminem Takeover and they showed the video to this. I listened closely to every line and I have to say Em killed the ENTIRE SONG. My favorite lines:\r\nSuccess is my only mothafuckin option, failure's not!!!!!!!! \r\nMom, I love you, but this trail has got to go \r\nI cannot grow old in Salem's lot.\r\n Whenever I feel stuck I think of that, it just inspires me to persevere. Recovery is sick too\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nthis song ...simply great eminem is awsome and he tells the truth and ir a real person no lies \t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nyoutu.be/…\n\r\nwhen Eminem is talking about new world order, could he possibly be reffering to Illimati? the link above talks about \"the new world order.\" Wether you believe it to be true or not, there is a possibility that it is true. Only the rich and powerful will have a chance when this new world order comes around and i would consider Eminem to be rich. Could he of had known of this? maybe he couldn't get it out of his head and he wrote about it in one of his songs. Lose Yourself is talking about having one chance to get rich and all... it kinda makes sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nThis is one of the best songs ever made. It symbolizes the race from complete poverty to uncontested stardom. It has a simple meaning that will never be rendered 'meaningless', for its something a large group of people will always have to deal with.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nthe he gets nerves when he starts a new song thats why one of the line says the everyone is choking\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nThis song is part of the movie 8 Mile, this song is when the character Rabbit loses the rap battle because he chokes up when he's about to sing: His palms are sweaty, knees weak, arms are heavy\nThere's vomit on his sweater already, mom's spaghetti\nHe's nervous, but on the surface he looks calm and ready\nTo drop bombs, but he keeps on forgettin'\nWhat he wrote down, the whole crowd goes so loud\nHe opens his mouth, but the words won't come out\nHe's chokin', how, everybody's jokin' now\nThe clocks run out, times up, over, blaow!\nSnap back to reality, oh there goes gravity\nOh, there goes Rabbit, he choked\n\nTHe rest of hte song is self-explanatory, imo\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nthis songs so damn good. gets me pumped up. woo first to post on it suckas.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nson of a bitch i was about to add these lyrics :D\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI really hate doing speeches for my Public Speaking class at college. So, I listen to this song before I do my speech and it gives me a lot of motivation to get up in front of everyone and not be scared.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nstage fright is a bitch! whether it's being in front if a crowd or a single person.... sometimes the words just won't come out... anyone got some advice on that?\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nThis song means ONE thing to me:\r\nIt sucks ass. \r\nAnd so does Eminem.\r\nok so thats 2\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nhe is definitely not talented..\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\na shit song and in general,  hes a shit rapper...hes onli good coz hes white...there r soo many fucking rappers better den him but unfortunately they were born black and dont get as much attention as eminem\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nto: Any living being who can stand in a room whilst an eminem song is playing,\r\nYOU SUCK MAJOR DONKEY SCHLONG!!!\r\nand anyone else who likes EMINEM, EMINEM IS AN OVERRATED, OVERPAID GAYBO WITH AN UNDERSIZED DICK!!!\r\nseriously, try to master the english language before you try to engage in a conversation about how good you think he is.  There wouldn't be an Eminem without Dr. Dre.  But that isn't the point, All rappers are gay.  You can make CRAP without (C)RAP.\r\nGet a fuckin life or something cos' anyone who thinks they will become another Eminem is a retard.  He was extremely lucky.  I bet Dre even thnks he is a wanker.\r\nHE should change his name to Gaminmen.  Cos' he is a fuckin pissweak excuse for musical talent.\r\nAnyone who thinks otherwise can \"BLOW ME\"\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nI would like to reitterate \"Mung Bean's\" comment:\r\n(FOR THOSE OF YOU WHO DONT UNDERSTAND WHAT REITTERATE MEANS, LOOK IT UP IN THE FUCKIN DICTIONARY)\r\neminem sucks massive balls\r\nHe is gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, gay, and GAY....\n\n\n\n\n\n\r\nOh, did i mention that EMINEM IS AN OVERRATED POOFTER WHO TAKES IT IN THE BUM....\n\n\n\n\n\n\n\r\n...and he is GAY!\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nas i read a few of these responses, i noticed that some of them said things such as... no one cares about ur god damn childhood, or how ur father left you, and this so called \"crappy shit\" that is called music. Well I on the other hand have to say that this is one of the strongest and most powerfullest \"rap\" songs i have EVER heard. I am personally not a fan of rap becuase in my opinion mnay times it gives off bad messages, however I am a fan of eminem becuase he sings with so much passion. His songs are like a work of art, and what makes them wonderful is that he sings about what has happened to him. He owns his songs. I mean, compare this song to something like \"candy shop\" by 50 cent. What do u get from taht song? A song about sex. well thats just great... isnt it. Many rap songs send messages about profanity. This song sounds so great from the surface. \"It all flows\" some may notice how everything rhymes. But when you dig deeper to find the meaning, which you can't do to all rap songs, you find the meaning. So powerfully written. \n\r\nYou only get one shot, do not miss your chance to blow \r\nThis opportunity comes once in a lifetime yo \n\r\nthat verse is so true. Im the music world, when it comes you have to decide will u take this, leave everything else behind. or will you give up a one-in-a lifetime chance?\n\r\nCoast to coast shows, he's know as the globetrotter\r\nLonely roads, God only knows\r\nHe's grown farther from home, he's no father\r\nHe goes home and barely knows his own daughter\n\r\nI love how this verse describes how someone can look like they have it all... fame, stardom. But what about the person underneath? He knows he's \"the it guy\" but only God knows of his lonely roads. How lonely his soul is. \n\r\nI been chewed up and spit out and booed off stage \n\r\nOne line, yet so much meaning. This line tells how much he has struggled through. OF what a challenge his life has been. \n\r\nAnd these times are so hard and it's getting even harder \r\nTryin to feed and water my seed,\n\r\nThis verse helps the listener understand of just how hard it was for Eminem to get where he is today, and that it still is a struggle for him. he's trying to feed himself and his family, and he's also trying to continue his growth of his fame. \n\r\nSuccess is my only mothafuckin option, failure's not \r\nSo here I go is my shot.\r\nYou can do anything you set your mind to, man \n\r\nGreat song. Makes you want to go on..no matter what.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nThe song is basically the plot of the 8 Mile (the film Eminem starred in). Its about his transcendence from poverty in Salem's Lot (a trailer park in Detroit, Michigan) to success and fame. The first verse of the song is the opening scene of the movie. Great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nThe song is basically the plot of the 8 Mile (the film Eminem starred in). Its about his transcendence from poverty in Salem's Lot (a trailer park in Detroit, Michigan) to success and fame. The first verse of the song is the opening scene of the movie. Great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nEminem can best be summed up in ten words: NO TALENT LOSER. SOMEONE POP A CAP IN THIS CRACKA.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nbest song ever\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nsure\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nthats why\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\neminem's a goddamn wigger......suckerrrrrrrr. and your lyrics suck...i dont give a flying fuck about your fuckin pappa who beat up your momma and then left your asses....dude...nobody gives a shit about your crap anymore. get a life dude....youre loaded but still make crapy shit 'rap' that you call 'music' and have nothing better to write about than how your childhood was fucked up over and over again... LOOSER\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nLove this song....  excuse me if I'm wrong but I think part of the lyrics is not correct\n\r\n\"Stay in one spot, another day of monotony's\r\nGotten me to the point, I'm like a snail \r\nI've got to formulate a plot fore I end up in jail or shot\"\n\r\nI think that the correct lyrics are\n\r\n\"Stay in one spot, another damn or not and he's \r\nGotten me to the piont, I'm like a snail \r\nI've got to formulate a plot, or end up in jail or shot\"\t\t\t\t\n\t\t\t\t\n\n"}