{"comment_0": "\nthis song is so good. I loved it from the first time i herd it. Great original Michael B! ♥ ☺\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nthis song is beautiful...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni absolutely love this song.. \r\ni'm going to his concert in january and i KNOW i'll cry during this song.. he is purely amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\n\"And I never saw the right man was on the wall\"\n\r\n\"And I never saw the writing was on the wall\"\n\r\nAmazing Buble :)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI sing this song to myself all the time.\r\nI broke up with an my boyfriend of 10months and he's moved on and i'm stuck in a rut. I used to be such a happy person but now i feel lost. However i'm determined to change and get the old Bex back & i sing this to myself to remind me that no matter how lonely i feel i'm not alone because i have all my friends that love me lots.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n\"If i dont land\" should be \"If i'd only knew\"\n\r\n\"And you can't bear to fall\" should be \"And you can't bear the thought\"\n\r\n:)\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThe first time I heard this song I loved it,I think people can relate to this song.I know I sure can.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nisn't the lyric \r\n'When your worlds crashing down\r\nAnd you can't bear the cross\r\nI said, babe, you're not lost'?\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI loved this song from the moment i heard it... it came out 4 months after my dad passed away and i cried the first time i heard it because it made me think of him... anytime I'm missing my dad, I listen to this song... it makes me feel like he's watching over me... great job Michael!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni can completely relate to this song. its almost like there are two people who were in love once, and it just didnt work out at the time. but now, they are past their troubles and are just promising to be there for each other.\n\r\n\"I can't believe it's over\r\nI watched the whole thing fall\r\nAnd I never saw the right man was on the wall\r\nIf I don't land\r\nDays were slipping past\r\nThat the good things never last\r\nThat you were crying\"\r\nthey broke up, and he didn't do anything. he didnt see how she was hurting, he just let it slip by and didn't step up and become the man he should have been\n\r\nhe says \"I hardly recognized the girl you are today\r\nAnd god I hope it's not too late\"\r\nand i think it means that she is different than when they were together, but he still wants to be friends and be there for her, like when he sings\r\n\"'Cause you are not alone\r\nAnd I am there with you\r\nAnd we'll get lost together\"\r\nhe's offering her that escape again, offering to be there whether its as a friend or something more\n\r\ni absolutely love this song, it completely relates to me and his voice is just amazing. it makes me cry\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI feel that this is him telling this girl that even though it seems like there's no hope for her and that she's done trying to find her way, she isn't lost.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThx for posting the lyrics.   One minor correction.  It's \"writing on the wall\" not \"right man on the wall\".   \n\r\nBeautiful song :)\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nA original beautiful song that you just gotta love :)\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nIt sounds like the bright, happy woman he fell in love with has fallen into a serious depression... maybe an even more serious mental struggle, the signs of which he feels he should have recognized... it seems to have just to overtaken her and transformed her into someone he no longer recognizes... and she feels like she's crazy... maybe even slips into actually insanity sometimes... it's beyond her control, and she can't pull herself out of this darkness that has decsended upon her... it breaks his heart to see this happening to her, and he wishes he could get through to help her... this is his desperate attempt to convince her that he still loves her and knows that she's still in there, that she needs to be strong and fight it... and that she's not alone in this fight that seems so impossible to her... because he's not giving up on her, and he'll follow her to whatever depths are necessary to help her come through it...\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis song is perfect for rainy days, disappointments, and time of loneliness. It never fails to make me feel better.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song can be interpretted in so many ways.\n\r\nFor me it's about people who are no longer IN love, but his love for her will always stay even if it is in a purely platonic sense.\n\r\nI split up with my long-term boyfriend in March 2007; and I'm beginning to see the light now, though I have had a fair few months of being down. This song helped me through it; the words made me see there would be a light at the end of the tunnel - The light I'm beginning to see now.\n\r\nAbsolutely amazing song that's open to so much intepretation.\n\r\nI know people who believe it's about a loved one dying and how even though they're physically not there anymore, they'll always be with the person spiritually.\n\r\nAs I've said before; amazing song.\n\r\nWell done, Mr Bublé.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nhis voice...it is..ohh...\r\nit is really something...that soothes someone's soul\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\n\r\nThe girl he loves was once happy, loved life. Life broke her heart, leaving her feeling sad, broken, lonely. He is trying to tell her that she isn't alone, and through these bad times, he's right there with her.\n\r\nI think this meaning is pretty obvious. This song means a lot to me.. :\\\n\r\nx ThreeCheersForFiveYears\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis song will be interpretted differently with each persons experiences,\r\nit can mean any of the above.\n\r\nI personally feel its about that first proper love. everythings new, neither have experience in how its meant to be or how to make it work and last, all they knew was they truly loved one another. and they didnt see it breaking for whatever strain was apon them, it makes me think.....Life is cruel, sometimes we can never understand why things happen or why we carry on to love people after its \"over\"\n\n\r\nI think he thought with time he would stop loving her, but the love grew and remained. perhaps in the future it would work out etc. having that soulmate i believe. where your love never dies for them, \n\r\nbeautiful song.\n\n\n\n", "comment_19": "\none of my favorite songs ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nNot my typical cup of tea, but what a sweet song!! He sounds like a catch. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThis song made me cry and it helped when I was feeling alone. I know this sounds dumb but I felt like I wasn't alone and Michael buble was there with me.\t\t\t\t\n\t\t\t\t\n\n"}