{"comment_0": "\nwhy does he say \"oh how you do me\"? \r\nit sounds like he is talking about sex.\n\r\nbut i love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nJust so you guys know, the chorus is adapted from The Cardigans' \"Love Fool\".\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nHave any of you thought that when he says \"oh how you do me\" that maybe it means do me as in do my head in? Like, make me crazy? After all he does hang out with \"gangsters\" and they use a lot of slang. \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\njust to say, the \"oh how you do me\" bit isn't from the cardigans' lovefool. the lovefool lyrics go:\n\r\nLove me, love me\r\nSay that you love me\r\nFool me, fool me\r\nGo on and fool me\n\r\nso, no idea where that comes from or what it implies. great song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ni absolutely love this song. i heard it for this first time the other day when my sister got the cd. & i've absolutely loved it ever since!! \r\nI love Justin Bieber. he's a cutie ;)\r\nplus, great song in the first place.. \r\nwhen he did it, it was very well done.\r\nGood job!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nOk, i was listening to the song for the hundreth and if u listen carefully, maybe he isnt saying 'oh, how u do me' maybe he's saying 'oh, how you duel me' i dunno, just a though. cause 'oh how u do me' does sound a bit weird. \n\r\nI LOVE JUSTIN xx!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nlol reminds me of Brittany Spears, but he obviously loves this girl and he's 15 i dont think he is going to talk about sex in his songs and ruin what he has goin for him\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nIt could also mean nothing at all and was just thrown in there like the rest of the lyrics because it sounded \"catchy\". \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n\"oh how you do me\" is from the song hes used in this song. so really i dont think it has anything to do with him and sex. its just part of the Love Fool song.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthis is one of my fav songs of justin bieber. Im pretty sure oh how u do is just part of love fool.\r\nThis is song is soooooooooo awesome.\r\nIts really catchy.\n\r\nGo BIEBER!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI doubt Bieber will be singing about sex.he didnt write the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthis is one song i like of JB's but i dont really like him that much hes just another pretty face.I use to be friends with him on facebook then he deleted me... how creul and rude.so then on I loss my love for JB!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nReally, how much different is it from almost any song made by Led Zeppelin. I mean Robert Plant sings baby three times more than Bieber does. Not saying I am a Belieber or anything. But change the melody and throw in a couple of guitar solos and you wouldn't be able to tell the difference from a Led Zeppelin song and this crap\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis dooshebag ruined a classic song!\r\nthe song being: \"Love Fool\".\n\r\nwhat is wrong with the world today when people actuali like a pre-pubecent nobody who is singing about how\r\nhe love girls doing him?!\r\ntrue who doesn't like this?\r\nbut how old is this kid?!\r\nits sick and wrong.\n\r\n\"Justin Bieber doesn't love girls, he loves crayons and silly string!\"\n\n\n"}