{"comment_0": "\nNick Cave has specifically stated that he didn't use characters when writing the songs on this album (with the exception of Jangling Jack) and that all of them are written from his personal perspective. That having been said, unless Mr. Cave has been able to lead a secret life of pedophilia, I find it highly improbable that this song is about a child molester.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nOh come on. Paedophilia and child molestation - I think not. Demonic love, demonic hate and lust, far better fill the words and the performance of the song. Listen to the song and not just the lyrics, it is about rage and a man (or demon) who feels he has been stripped of what is rightfully is (R is for render unto me baby, M is for that which is MINE) The whole thing just creeps with an ancient malevolence including whispered echoes of the main lyrics (demon talking in many voices). The scope of the narrative (seeing empires fall etc.) is far beyond the imagination and deviations of the human kind.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthis song is simply about LUST.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI agree with the last poster (partenopei)  This song is about lust, plain and simple.  There is nothing creepy about it, unless you consider all men creepy.  By this I mean that I see the lyrics as describing the darkside of all men when they hunger for sex.  It's exaggerated and it is not meant to be taken literally that he's a devil or that he is possessive of her.  It's about a simple guy whose brilliant master plan is to get his girl's dress off.  He can't help himself, he wants sex, and he will say or do whatever he needs to in order to get it.  And in his lust induced haze, he gets all territorial (even some mild mannered men get like in the bedroom) but there is no violence in the song.  \n\r\nThe song is basically about the male need for sex. He is a typical pig of a man but one whom I find sort of endearing because he makes at least the effort to profess undying love.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nAlright, take a load of this: what if this is an answer to Billie Holiday's Lover Man?\nsongmeanings.net/songs/view/3530822107858529289/\n\r\nLinks:\r\n-She's asking where her lover man might be, he starts every verse with his location(outside, on the floor, by her side(which she asks for as well).\r\n-She's praying for a lover, he's coming down, saying Amen.\r\n\"A is for ANSWERING all of my prayers \r\nN is for KNOWING your loverman's going to \r\nbe the answer to all of yours \"\r\n-She asks to be whispered in her ear, while throughout the song whispers can be heard on the back.\r\n-And of course, the fact he's a Devil and she says to give her soul for a loverman.\n\r\nThis might be odd, but Cave is know to make adaption on older Blues/Jazz tunes and refer to them.\n\r\nNow, of course, this would add a curtain \"Be careful what for you wish, you just might get it\" feel to it.\r\nThat combined with the obvious masculine, low, urging need of sex theme this might be a message of precaution.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIt's about mans intense lust and love for a woman who sees his desire and uses it to have power over him. She makes him wait outside her door and then crawl over the floor before she will let him have her. He is willing to do anything or say anything to have her. She makes him feel unworthy, weak, evil, stupid and old but she finally gives him what he wants and it makes him want her more. His lust is temporarily satisfied but he is infatuated and wants her to be his bride.\n\n\n", "comment_6": "\nThis is simple:  A song about child molestors. Ironic lyrics about how good they think they are,  when it's really saying how stupid and unhuman they are.\n\r\n\"E is for EVEN if you want me to\"\r\nShows the very dark humor of Cave.\n\r\nOne of my favorites songs and lyrics. Absoloutly brilliant,  like most of Cave's songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nExplain your reasoning for it being about paedophilia? It kinda makes sense when you say it, but I'd never have jumped to that conclusion... Why do think it's not just a desperate, slightly depraved, perhaps still quite predatory man after a woman?\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ni think if it was about a peado it would be 100 times more chilling then it already is. then again i re-read the lyrics. would a paedo really 'lie by your side' ...thankfully i dont know but i do query that reading..although it could easily fit. eugh it makes me sick to even think about it. i really like this song, very powerful, nicks rasps are truly TERRIFYING!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI know \"Do You Love Me (part 2)\" actually *is* about child molestation, having read an interview with Cave that said just that. \n\r\nOn the other hand, I don't think I agree it applies to this one, I don't think it's sinister enough. I think the self-deprecating stuff is aimed at a lifelong partner who knows the flaws of the hero but who accepts him all the same.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nOh my god... molestation? paedophilia? Another trying to find something, what's not here. Well, I must accept, that Nick's lyrics are sometimes very difficult and rarely impossible to understand and then you need to find your own explanations. From your mind or heart or whatever you wish. And this fact makes that, people seek unnecessarilly too much explanations. Like in this case of Loverman. This song is simply about strong and as Nick says \"fiendish\" desire and posession connected with love in maybe \"lower\" and human ways. It' some kind of opposite of \"Into My Arms\", for which I have written a comment in last ten minutes. And it's always makes me mad and chills. Simple... strong... wonderful... sometimes it's better try to simplify your meanings and thinking... ;-)\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI kind of got the impression this one was about heroin addiction perhaps.  I thought that the devil is somehow personified into the craving, and a few verses in there \"Give him more\" and \"How much longer.\"  Sounds like someone trapped in a room going through withdraw trying to wait out the immense craving and pain that follows.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthe idea of Nick Cave as a child molesterer makes me want to cry.\n\n\n", "comment_13": "\nThis is a song with many possible interpretations.  I think of it as the antithesis of the love story of the film \"Wings of Desire\" in which Nick Cave's music was heavily featured, an angel falling in love with a mortal woman and becoming human - instead, this song flips it around and is about demon falling in love with a woman and becoming human\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nNot a song about paedophilia!  Nick Cave( nor anyone would hope) would not deliver a song of that nature in a way that sympathises with the predator and boasts so much bravado. He is also a father several times over and speaks with love and respect about his family. Listen to the sheer evil, dread, and sombreness  depicted in Do You Love Me part 2, he is really driving home the point of how much pain and damage the abuse causes.                                       \nLoverman is very simply an animalistic story of love and lust and extremely sexy. \nMizchiff I have no idea where you got that from , you are reading way too far into this.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nMetallica covered this song on the Garage Inc.\t\t\t\t\n\t\t\t\t\n\n"}