{"comment_0": "\nDefinitely about Mary Austin.\n\r\nIt's such a sweet song, really. The lines \"When I grow older, I will be there by your side to remind you, How I still love you -I still love you\" are perhaps the most incredible lyrics he ever wrote because he made the promise, and kept it through to the end.\n\r\nMary was so lucky to have such a dedicated man who reminded her of the truth at the end of his life. It really takes someone to do that.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nyou are all wrong wrong wrong!!! This song is about Freddie's real love of his life, Mary Austin; the woman all lovers in Freddie's life had to measure up to, but couldn't. Nice try tough, all you thinkers out there.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI watched a documentary about Queen, and Brian May said this song was about Freddie's love for Mary Austin. Wheter it was about being best friends or lovers really doesn't matter (can anyone define the difference anyway?), because Freddie have stated several times that she was the love of his life and his only true friend. She stayed with him till the end. Beautiful song anyway. \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis is a great ballad!!  Expression great pain...waves of sadness..... and accompanied with fantastic melody. I was blown away when I heard this song for the first time (and it wasn't Queen, but a Scorpions cover, ref: Acoustica CD, track #12).  I think the song is about a strong, but broken relationship....and going through the emotional hardship in repairing the damage that she has caused.....and as you approach completing the reconciliation process.....but, at the end of the day, she abandons him anyway!  .....The feeling of abandonment comes with great sorrow and pain...wouldn't you agree?\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nWow what a romantic song. Only Freddie Mercury could conceive something as grand as this. I think that the world more and more realizes just how incredible Queen and Freddie Mercury were.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI have always assumed this song was about Freddie's relationship with Mary Austin.  Yes, I know he was gay, but he lived with Mary for several years, and in interviews said she was the \"love of his life.\"  Mary said she felt they had a marriage, that they were always there for each other till the end.  She cared for him when he was dying.  He left her the bulk of his estate in his will.  She is the first person he lists in his dedications for the album \"Barcelona\" which he did without Queen.\n\r\nThis is a magnificent song and a great backstory.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nthis song is written for mary austin, from her point of view, if that makes any sense\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nWow, i thought there would of been more posts on this song! Anyway, a beautiful and amazing song!Love singing along to this one, especially the live version. The live version gives you a real feel of what it might of been like to be at a queen gig (I was born a year before freddie died, so kinda difficult to go to see queen before my 1st birthday!!)!! Truly great song!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nabsolutly beautiful song!!!! what an incredible voice!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song is so much fun! Its soo great... I love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI respect the perosn in this song for still loving the person, after they hurt them!  I wonder if i could do that\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThen you respect one FREDDIE MERCURY!!! Long live the King of Classic Rock!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ncould this be about friendship?\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is SO amazing live! Granted you don't get the beautifully layered vocals of the studio recording, it's still wonderful. The emotion of Freddie is unbelievable. The song is accompianied by Brian on the simple stressed accoustic guitar, the silence of the stadium and emotion put forth by both performers makes it beautiful! I only regret that i was not alive during their touring years (and Freddie's life) to see it in person but the DVD is the next best thing\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ngreat great song.  perfect for sappy moments with your significant other.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nDead-- I'venever heard that, and I've seen and read almost every Queen/ FM interview ever. Can you cite the source?\n\r\nAlso-- LOVE the \"cello\" Bri did on the guitar.\r\nAnd learning to play the harp that well in such a short amount of time. Brian is a God.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nOf course he can. He's one of those guys who think every song is about drugs, and will say anything to make others believe that.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis is easily their best live song they performed. On live killers it's great and also at wembley.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nProbagly about his confrontation on his love between the one lady in his life...\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nFirst of all this is my FAVORITE FAVORITE Queen song. My  dad, brother and i were in the car on the way back home and i think it was 'we will rock you' came on and when we got back home he  had me listen to 'Love of my Life' since then i've been hooked on Queen!!\n\r\nNow, whenever i hear this song i just think of someone being in love, still, with somebody else even though they broke their heart.  Most Beautiful song eva'!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI've always wondered whether this song was written about Freddie's girlfriend Mary Austen.  I've no idea why - just an hunch.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nthis is a fantastic and truly beautiful song. i can't decide which is better: the studio or concert versions. they both leave me with chills. the live in japan one is pretty cool - freddie had a rapport with audiences that was unique and unmatched.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nSki actually has a point. When Freddie revealed he was gay, of course his girlfriend would be hurt. I'd feel hurt if my girlfriend told me she was a lesbian. What would that make me?\n\r\nBut then, he probably told her she was gay anyway, and she probably would've accepted it anyway.\n\r\nIf you've ever heard this song live, you have experienced true awesomeness. If you have ever BEEN there to hear it, you are an official Queen fan. Here's what Brian said on April 1st, 2006, in San Diego, CA, during Queen Tour '06.\n\r\n\"Now, we can do this song in one of two ways. I can sing it to you all quietly and you can sit there quietly and listen. Or, I can play, and we can all sing it together.\" That's what makes this song so awesome. It's so passionate in the studio version, but in concert, everyone always sang it together, because it's so easy to learn, and so irresistible to sing along with. A definite classic that any rock fan can point out, almost comparing to BoRhap.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nOh, also, I love how the guitar seems to be singing along in this son. If you don't understand that vague point, start listening at 3:16. It doesn't play like a guitar, but kind of like a violin, as though moving across the strings in a certain pattern, but seeing as how it's an electric guitar (probably Red Special), it almost sounds like the guitar is singing along. There are other instances of this in the song, but that's the most noticeable one to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI agree\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI, like glacion, experienced Brian May playing his 12 string while the others were takin a break.  That was the only time I have ever heard it to tell you the truth.  But hearing everyone singing it with Brian May, you just get this warm feeling inside you, I was absolutely blown away.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis is such a beautiful song, Queen is awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\neverytime i hear the \"When I grow older\r\nI will be there by your side to remind you\r\nHow I still love you\" in this song i think of these are the days of our lives, and how at the very end, he whispers, \"i still love you\" and i wonder it really makes me sad because he kept his promise til the end. :(\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nBeautiful song. In a way, it's a lot different from Mercury's other compositions. Unlike songs such as \"March of the Black Queen\" and \"Lily of the Valley\", which often employ eloquent but borderline-nonsensical flights of fancy, Love of My Life is just a pure confession of feelings. It's straight from the heart. \n\r\nI often listen to A Night At The Opera while doing my homework; however, with this song especially, I end up forgetting the homework entirely and spacing out, drinking in the grandeur of the music....and getting an F in Algebra the next day. XD I also invariably play this song at least four times. Swooning repeatedly over Freddie's so-beautiful-that-in-all-honesty-it's-kind-of-scary falsetto. In fact, as soon as I add this comment I'm going to pull out my MP3 player and listen to this song yet again...\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni agree with \"thenewscene\" and on the live at wembley version of this song he says \"i still love you\" in the same way :(\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nWritten for his longtime friend Mary Austin, Freddie shows another point of struggle in this album.  I might be wrong (don't think I am, however) but this was around the time that Mary figured everything out with Freddie's orientation being bisexual and that he was choosing inside himself to choose either one way or another - for his best friend's sake.  Note: that contention is recorded within another song near the end of the album. ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nWho hears that from his partner who know that his partner REALLY loves him\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nsuch a really great sing that will last until the end of time, heard Brian May's version at Brixton Academy...it is awesome as the orginal.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nGod I love this song, Freddie Mercury is my true hero. He has the most amazing voice and writes the most amazing lyrics. For real. Not to mention, her was absolutley gorgeous. Rest in peace, Freddie. \t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nIf I had to choose between having a relationship like the one between Freddie and Mary OR a relationship between Freddie and his lovers I would choose the relationship between Freddie and Mary.   The bond between these two was amazing.  Most of the time sex becomes second or third or nonexistant in a relationship.  As we get older it's emotional bonding that matters.   That's what Freddie & Mary had.  Mary was very lucky.  Wow, to have a love song written for you, I get chills just thinking about it.  And then she gets one written for her by one of the greatest songwriters ever who also happened to be a musical genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nthis song is sooo beautiful.\n\r\nthis song is about loving someone even though they just hurt you. its about loving someone even though they broke your heart, you still love them with all your pieces. and that youll always love them no matter what.\n\r\namazing song.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nLove of my life, \r\nYou hurt me, \r\nYou broken my heart, \r\nNow you leave me \n\r\nLove of my life can't you see, \r\nBring it back bring it back, \r\nDon't take it away from me, \r\nBecause you don't know what it means to me \n\r\nLove of my life don't leave me, \r\nYou've stolen my love you now desert me, \n\r\nLove of my life can't you see, \r\nBring it back bring it back, \r\nDon't take it away from me, \r\nBecause you don't know what it means to me \n\r\nYou will remember when this is blown over, \r\nAnd everything's all by the way, \r\nWhen I grow older, \r\nI will be there at your side, \r\nTo remind how I still love you \r\nI still love you \r\nI still love you \n\r\nHurry back hurry back, \r\nDon't take it away from me, \r\nBecause you don't know what it means to me \n\r\nLove of my life, \r\nLove of my life\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nWhat does that phrase mean? \n\r\n\"And everything's all by the way\"\n\r\nWhat does \"everything's all\" mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nWhat an unbelievably sweet and poignant song.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nFreddy Mercury wrote this song as he realized that he may be losing his one true love, Mary Austin, after they had divorced. When Freddy felt as if he was losing her in his life, he wrote this song to let her know that if they ever stop keeping in contact he will support and love her no matter where she is in life.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nIt is about Mary Austin when she moved out of the flat, telling Freddie he was not bi sexual as he had just told her and that he was gay.  This is Freddie afterwards thinking about her.  It is a sad fact that people with different sexualities can love each other all their lives.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nOf course I CAN? Mmmmmhh... I think you're too stupid to make yourself clear, freedomBono. Anyway, I don't have the source, I don't remember where I read it. And maybe it was a lie of the press, but if you do a little review of any biography of Mercury, you'll see that the guy wasn't a saint. He was gay, he used lot of diferent drugs and alcohol and made some parties like orgies (How do you think he gets AIDS?). After all he was a Rock Star. But the point is that I don't give a fuck if Freddie wrote his lyrics about drugs, gay love, religions, puppies, flowers or radios. I like his voice and the way he used to sing. The person and the artist are two diferent ones.\r\nArtists can create beautiful things like this song from horrible things like drugs. So wake up! (Oh... and by the way, Santa doesn't exist, your parents leave the presents when you're sleeping)\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\numm... girlfriend, freddie mercury was gay, maybe one of those people that changed to gay, but i don't know about that.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThis song is not about Mary, when it was written Freddie hadn't come out. Freddie wrote this song very early on in his queen career, it was concidered to be too light to put on the early albums then after the success of 'lily of the valley' on the sheer heart atack album it made its way onto night at the opera and became a favorite live track.. the meaning.. no idea, freddie was a talented songwriter, wouldnt have needed to experience such a thing to write about it. Dont agree with the drugs comment because freddie famously did drugs in the 80's and this was written well before this.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nFreddie said once that this song was about the cocaine. It's a metaphorical song about a junky (maybe Freddie himself) and his adiction. He love the drug even when that hurt him.\t\t\t\t\n\t\t\t\t\n\n"}