{"comment_0": "\nNothing is more damaging to your confidence and self-esteem than being in an emotionally abusive relationship.\r\nUnlike physical abuse which rears its ugly head in dramatic outbursts, emotional abuse can be more insidious and elusive. In some cases, neither the abuser nor the victim are fully aware itâ\u0080\u0099s happening.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think  it's a song about grief, disgust, anger and humiliation.  Telling her to \"Love Yourself\" is a way of saying: go f--k yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI really think that this song is about a failed relationship with a modern American girl.\n\nSocial media has conditioned some women to believe that they can do no wrong and that the the world revolves their existence. This has led to a lot of women taking up a narcissistic, materialistic view on life. The Bieb basically is dating a girl that is caught up in all that trash and simply calls her out on it. If she's obsessed with herself THAT much that she refuses give an inch in a her relationship, then she should just go date, or, love herself. \n\nA snobby, self-centered, stuck-up product of our quixotic society.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nHe's answering Hailee Steinfeld's song \"Love Myself\". (\"Cause if you like the way you look that much/Oh baby, you should go and love yourself\").\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI believe it's about being in a verbal abusive relationship.She was all about her and wanted to control him.She was jealous about how he had friends and living life she wishes she had.I believe her tongue was sharp as a sword...words she said was harsh and out of jealousy.I believe he and his family had enough and had to move on... but not her.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is so obvious to me. Reverse it and that's the truth. They are singing from different hymn sheets within their relationship. He is the one with the downer- if you like the way YOU look that much then you should go and love yourself. It's him who is narcissistic, shifting the blame. Yet all the lesson/ loss he will realise in his future.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI don't think this song is based on a relationship with a girl, but with a relationship with oneself. Early in his Career Justin Bieber made bad decisions and wants to move on but can't because the past keeps on haunting him. He's just telling his former self to leave and go away. Either Bieber is a very thoughtful person or he is a great songwriter and doesn't know it.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nit's about Selena !!! duh!!!!!!! the stuck up chick can go love herself if she's gonna be so heartless!\t\t\t\t\n\t\t\t\t\n\n"}