{"comment_0": "\ni think honstly she just liked the way it sounded and thought other people could relate it doesnt have to be about some1 special but if it is...\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis actually makes me think of my own boyfriend. I adore music, more than anything on this earth, because it makes me feel good inside. No matter the tune, the melody, the mood, a song can put me in a good mood and mindset. Music's helped me through thick and thin, pulled me out of writer's block, and urged me when I was stuck deep in my writing ruts. It reminds me of good times and old song bring up memories from when I was a kid. Music's just always been there for me.\n\r\nSo far, nothing else has ever made me feel this way. Besides him. Yeah, this sounds REALLY sappy, but it's true. He's my music, my love song. <3 He's the first guy to actually get to me like this. I wouldn't call it love, not yet, but it's definitely getting there. :)\n\r\nI love this song more than ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIt sounds to me like whoever wrote it just slapped a bunch of words generally related to love together into a rhyming mess, without real attention or focus.\r\n\"I am hypnotized by your destiny\" doesn't make sense. Really? She's hypnotized by his *destiny*? Sure, it sounds nice at first. But really. REALLY.\n\r\n\"And I guess right now here's another one\r\nSo your melody will play on and on\r\nWith the best of them\"\r\nSo *your melody* will play on and on *with the best of them*.\r\nSelena (or whoever the writer is) seems to be struggling to come up with lyrics that have any coherence to them at all. Yeah, they sound pleasant and yeah, it's a catchy song (although the music accompaniment sounds awful). But the lyrics don't have \"meaning\" other than superficial words imposed on a superficial song to try and portray Selena Gomez as deeper than she really is. \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni think its about justin bieber\r\nhe came to her life and changed it\r\nnow they are falling in love\r\nshe want to he know that she loves him like a love song\r\njust this\r\nbut i think selena gomez was better with taylor lautner\r\njustin is too young for selena\n\n\n", "comment_4": "\nI love this song and a bunch more. But really and truley who is this song about.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is about commitment issues. The chorus says says that they \"love you like a love song\". Selena Gomez or (the narrator of the song) fails to attach a specific meaning to the love that they have to the individual. Compared to another song such as \"Sweet Caroline\" or another song where the person who is loved's name is sung in the song, showing their complete love and devotion to the individual. Yet, Gomez can't attach this significance and rather simply says \"they love them like a love song\". This is also suggested in the first lines of the song \"It's been said and done Every beautiful thought's been already sung\nAnd I guess right now here's another one\". Gomez seems to be bored with the thought of loving someone, and can not find any uniqueness in the love that she feels for the person she loves.\n\nThe song suggests commitment issues by the fact that she keeps hitting \"repeat\". This means that she has been in several relationships before, playing the same love song only to fall in love with another person, repeating the process. If she truly loved only one person, then she would of chosen the words \"and I don't want this song to end\" or something to that effect. \n\nThe song does have evidence showing she is in love with the unknown person. However, one of the final lines, \"You stand alone, to every record I own\" suggests that although she loves the person as an individual, she still has other records that she loves or has loved. Reinforcing the repeating nature of the love, and the fact that she probably will add new records to her collection. Overall, showing that she does not have the ability to truly connect to only one love and keeps repeating because of her boredom or the fact that she truly hasn't found the right one to write a real love song about.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\naccording to the video:\nIt's about meeting a girl and dreaming after that.\nand It seems she is agreed with everybody, because she said:\nIt's been said and done\nEvery beautiful thought's been already sung\nAnd I guess right now here's another one\n.\n.\n\n.\n\nI believed selena loves herself too much.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\naccording to the video:\nIt's about meeting a girl and dreaming after that.\nand It seems she is agreed with everybody, because she said:\nIt's been said and done\nEvery beautiful thought's been already sung\nAnd I guess right now here's another one\n.\n.\n\n.\n\nI believed selena loves herself too much.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\naccording to the video:\nIt's about meeting a girl and dreaming after that.\nand It seems she is agreed with everybody, because she said:\nIt's been said and done\nEvery beautiful thought's been already sung\nAnd I guess right now here's another one\n.\n.\n\n.\n\nI believed selena loves herself too much.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nHonestly, this is dumbest simile ever: \"love you like a love song.\"  How can you have a comparison between two subjects when both subjects contain the same word in them?  In other words, you can't understand the word \"love\" better through the phrase \"love song.\" \n\nThis is just another example of the music industry making a catchy song with horrible lyrics in order to attract its listeners (which it does pretty well because of its beat).\n\nWhatever meaning this song has, it is clouded by the horrible repetitive simile that makes absolutely no coherent sense.\t\t\t\t\n\t\t\t\t\n\n"}