{"comment_0": "\nIt's about two people who meet and fall in love, however, as time goes on, they start to resent each other and the man becomes physically abusive. The woman takes it at first, but then she tries to leave him. He promises her that he'll never hurt her again and he'll try to control his temper, but he's lying. He says that if she ever tried to leave again, he'd kill her. The woman knows that this is all just a lie, but she keeps going back to him because she loves him.\n\r\nI think this song is especially powerful since Rihanna knows exactly what she is singing, due to her relationship with Chris Brown.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nNot only does Rihanna know what she's singing about here, but does no one remember Eminem and Kim? This is as much about them as it is Rihanna and Chris. Apt people for this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nGreat song, obviously about a both verbal and physically abusive relationship and how it seems the guy will say anything to keep his girl with him even though he's just spewing lies. Eminem is one of the few rappers I have strong respect for, he keeps it real. I adore the last set of verses the most, awesome lyrics and it makes the song even better with Rihanna singing the chorus considering her experience with abuse. \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThere is domestic violence where the abuser who has no remorse and the victim, who at 1st thinks it is love but later realizes the other person is just abusive & really wants to leave the other but is afraid of what the other will do to them or their children if they do leave.. then there is the other.. \n\r\nand to me this is what Eminem is addressing, the dynamic of a relationship when 2 people have the most TOXIC LOVE imaginable for one another. They victimize the other person as well as themselves. They are both victims as well as guilty of being literally crazy for one another. I hope people dont have to experience this type of relationship but if you do I believe you go through it once. It's hard to truly understand unless you have been through it but the song as well as the video paints the picture of the turmoil that the extremity of emotions and how it is handled effect the people in these relationships. What they go through and what happens when they have no control of those emotions. You see what they are willing to endure for one another because no matter how bad it gets nothing seems worst then leaving each other. Their destructive relationship is a contradiction of what love should be but they truly are madly in love, Its heartbreaking...\n\n\r\n- \"And I love it the more that I suffer. I suffocate and right before I'm about to drown she resuscitates me. She fucking hates me and I love it.\" \r\n- \"Just gonna stand there and watch me burn. But that's alright because I like the way it hurts\"\r\n- \"It's so insane 'cause when it's going good, it's going great... But when it's bad, it's awful. I feel so ashamed\"\r\n- \"You're the same as me. When it comes to love you're just as blinded. Maybe our relationship isn't as crazy as it seems, maybe that's what happens when a tornado meets a volcano. All I know is I love you too much to walk away though\"\n\r\nthose are the verses that really hit home when I hear this song. \r\nI have to say the hardest thing about being in that relationship was realizing that even though we wanted to to be together we needed to be apart. He showed me how much he loved me by leaving me. I knew it was killing him just as much as it was killing me.. Maybe years from now we can try again or maybe not but, one thing is for certain I dont ever doubt the depth of his love for me. \n\n\n\n\n\n\n", "comment_4": "\nI think this song works on two different levels and perspectives.\n\r\nOne one hand, the song reads like a realtime story. It is unfolding with every verse Eminem sings. His lines are describing what's happening right now, and Rihanna recaps the theme of the song with her chorus. It's an abusive relationship that she is unable/unwilling to get out of. Their relationship is spiralling downwards, and at the end he makes a threat of what will happen if she leaves again.\r\nAnd we're left to wonder what DOES happen.\n\r\nBut if you look at it another way, we find out what happens. All of Eminem's verses are a flashback of the events leading up to that threat, which is the last thing that happens before the song starts. This is what's happening right now:\n\r\n\"Just gonna stand there and watch me burn\r\nBut that's alright because I like the way it hurts\r\nJust gonna stand there and hear me cry\r\nBut that's alright because I love the way you lie\"\n\r\nHe is literally standing there, watching her burn and hearing her cry, and thinking about everything that happened leading up to this. Rihanna's lines become the present. \n\r\nListen to the song back to back. The first time picture Eminem's verses as the present. The second time, picture his verses as the past. And in between imagine that she tried to leave again and he acted out his threat. This perspective certainly makes the song a lot darker.\n\r\nNot sure if that makes sense to anyone, it looks a little confusing when I put it in writing...\n\n\n\n", "comment_5": "\nNot Eminems' best song, but it's okay.\n\r\nI think it's basically about a troubled relationship. Saying things you don't mean when you're mad, doing things you don't mean to because you're mad beacause it's in the heat of the moment. You love the person so much so you say whatever you can to make them come back, to make them stay. You say that it'll never happen again, but deep down you know it will but you just want to say whatever you can to prevent them from leaving. Then the cycle continues... \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI can't stop listening to this. I personally think this is Em's greatest song yet.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nbest song ever so much love and sadness\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think your all wrong.  I think its about a disfunctional relationship, but they both live for it.  They have so much passion whether its with love or when they fight.  but they cant leave each other because they feed off it.  SO they just sit back and watch them destroy each other.  And regardless of how much they both hurt each other, they both keep coming back for more, cause like he said when its good its great, but when its bad its awful.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThere is no hidden meaning here, it's straightforward, upfront, raw and powerful. What makes it so great is the sheer rawness of emotion in both Eminems lyrics and Rihannas voice. What I find scary about this song is that I've been on both sides of a relationship similar to this and I think most people have. It's not as simple as walking away and leaving this shit behind and outsiders can never understand that, because deep inside is still that person, that spirit, that that soul that attracted you to them in the first place and you live in hope that soon the storm, the rage and the anger will pass and everything will be as it was in the beginning. \n\r\nLife isn't simple and neither are modern relationships. Violence is never cool in any form, but the video for this supports the theory that there is more at play that has possibly brought on the violence. Socio-Economic circumstance, booze, possibly drugs, petty crime, unemployment etc etc. \n\r\nI've always taken the line \"I love the way you lie\" more as a smartass comment to ones self about denying what is really going on here. Tricking yourself into believing that this is the person for you, that this behaviour is normal and that people will change, knowing full well that you shouldn't.\n\r\nI respect Rihanna so much more for doing this song, she copped so much criticism in Australia for this but NOT ONCE did the mainstream media who were slamming her sit down and actually listen to what this song is conveying.\n\r\nEvery word that comes out of Eminems mouth in this song sends chills up my spine. I've never related so much to a song in my life and when it's up loud this song just takes me away someplace else. \n\r\nFavourite lines \n\r\n- I can't tell you what it really is, I can only tell you what it feels like.\r\n- Right before I'm about to drown she resuscitates me\r\nShe fucking hates me and I love it, wait.\r\n- You meet and neither one of you even know what hit 'em, Got that warm fuzzy feeling, Yeah, them chills, used to get 'em, Now you're getting fucking sick of looking at 'em\n\n\n\n", "comment_10": "\nThis song is absolutely incredible. Easily the best song from the new album and definitely one of the best songs he's created. Nobody could have done as perfect of a job as Rihanna, she and Eminem combine for a perfect duo on this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nwow,Eminem is really the best rapper alive.\n\r\nSo I think this song's about 2 people who are crazily in love,but the guy has a raging temper and abuses her whenever they aren't getting along.the guy DOES love her,but he can't control his anger and he seems to always direct his anger at the girl.we all know about the Rihanna-Chris Brown thing,so it's perfect for Rihanna to sing this.then the guy calms down and realises what he's done,and they just fight all over again but the girl won't truly leave him because she still loves him even after all the shit he did to her.\r\ngreat song,lyrics are as good as Not Afraid,but I like this song's tune more :)\n\r\nand why's everyone comparing eminem to drake?\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song is a powerful reality of what many women go through.  It is a viscous cycle of violence that often originated with trauma in childhood (but doesn't have to).  I counsel women who have been abused and they often will pick out men who will abuse them again.  There are many factors to it, but one major aspect is if they have not worked through and grieved the pain of the abuse they are destined to repeat it.  They have no respect for themselves, thus seek out the creeps who will confirm their low self concept.  Their tolerance for taking compliments is often amazingly low, where their tolerance for taking criticism is amazingly high.  I had one client save voicemails of her ex-boyfriend cussing her out and calling her names, whereas when she got a nice card from a friend she would quickly throw it away.     \n\r\nIf you are finding yourself in this cycle, I plead with you to find some help.  Someone who can gently lead you through what you are doing to yourself.  You are worth so much more, and there really is help.  \t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song has pure emotion. i think eminem rapping and rihanna singing in this song is the perfect combination.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nits blatently about Eminem and Kim. Like the bit about: I snapped\r\nWho's that dude\r\nI don't even know his name\n\r\nDidnt Eminem get arrested a few years ago for beating up some guy talking to Kim? Also they were really on and off going their sepaerate ways etc. I love it because Eminem is being so raw and honest. The song doesn't just reflect relationships between lovers but the chorour really moved me because my mum used to physically abuse me and the Rihanna part reminded me of how she would see the pain she caused, and she hurt me alot but I still loved her and only recently could I properly break free. \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song is about two people who fall in love but then it changes into an abusive relationship...both physically and emotionally. He does love her, enough he could hurt her. It's sick and twisted but things like this actually happen. She loves him back even though they both are hurting eachother. As much as it pains the woman, she tries to leave. He gets upset and says \"If she ever tries to fucking leave again\r\nI'mma tie her to the bed and set the house on fire\". What he means, is that if she ever tries to leave him again he will kill her. The sad part is, is that they both know he is lying when he says he's sorry and that it wont happen again. Each time I listen to this song it makes me cry. I give props for Rihanna for being able to sing this song after what happened between her and Chris Brown. Shady is also one of my favorite rappers for keeping things real. Good job to both of them and let us all realize how tragic abusive relationships really are.\n\n\n", "comment_16": "\nTo me it sounds like it begins at the end. \n\r\nHe says: \"If she ever tries to fucking leave again\r\nI'm a tie her to the bed and set the house on fire\" \n\r\nThe cycle almost always continues and she would \"try to leave\" again. \n\r\nIt just goes with the beginning of the chorus.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nOkay, Eminem introduces the song by saying:\n\r\na) \"I can't tell you what it really is I can only tell you what it feels like\"\n\r\nI think it's a 'gut' feeling Eminem is introducing here, of course this phrase will relate to subsequent lyrics.\n\r\nb) \"And right now there's a steel knife in my windpipe I can't breathe, but I still fight while I can fight\"\n\r\nThough indirect, it does relate to the first phrase. Not only is he suggesting a 'gut' feeling, but he is obviously inhibited in one way or another - anger would be the most probable scenario. He is foreshadowing the fact that he will not give up (no matter what).\n\r\nc) \"As long as the wrong feels right it's like I'm in flight\"\n\r\nAgain, further proving he will not give up - even if what he is doing is wrong, he forces himself to believe its right, and if he does that, he's fine with doing it.\n\r\nd) \"High off of love, drunk from her hate\"\n\r\nThere can be two different meanings to this phrase. If taken literally, this is an excuse as to why he abuses alcohol and drugs. However, it may not be about substances at all, he may be referring to his behavior. Perhaps she is the reason (or at least what he thinks is the reason) for his bad temper and his life problems. \n\r\ne) â\u0080\u009cIt's like I'm huffing paint and I love it the more that I suffer I suffocate and right before I'm about to drown she resuscitates me she fucking hates me and I love itâ\u0080\u009d\n\r\nOkay this part is fairly confusing, however, I think he purposely wrote it this way. The whole purpose of this phrase is to identify that it is a confusing relationship. Heâ\u0080\u0099s mentioning that heâ\u0080\u0099s hurting emotionally, but right before he hits his low, she makes him feel great, and the sentence ends with a double negative. The whole sentence is: Hate, Love, Hate, Love, Hate, Love. \n\r\nf) â\u0080\u009cWait, where you going I'm leaving you No you ain't, come back We're running right back Here we go again It's so insaneâ\u0080\u009d\n\r\nThis is an example of a pretty basic routine they have: She tries to leave, he says no. Push the repeat button.\n\r\ng) â\u0080\u009c'cause when it's going good, it's going great I'm Superman with the wind in his back She's Lois Laneâ\u0080\u009d\n\r\nWhen the relationship is going good, itâ\u0080\u0099s perfect. He even relates to Superman and Lois Lane. I think he didnâ\u0080\u0099t pick any random â\u0080\u0098true loveâ\u0080\u0099 couple here. He didnâ\u0080\u0099t just mention the couple, he also mentioned the â\u0080\u0098wind in his backâ\u0080\u0099 (flying). This could suggest the fact that he has the power and/or control in the relationship.\n\r\nh) â\u0080\u009cBut when it's bad, it's awful I feel so ashamed I snapped Who's that dude I don't even know his name I laid hands on her I'll never stoop so low again I guess I don't know my own strengthâ\u0080\u009d\n\r\nThis part is important. Basically, he got angry at something she did (although he mentions another man, it could be more subtle. I think he just used this as a blind example). He says that he physically abused her while angry, told her he was sorry and he wonâ\u0080\u0099t do it again. Also told her it was an accident saying â\u0080\u0098I donâ\u0080\u0099t know my own strengthâ\u0080\u0099.\n\n\n", "comment_18": "\npeople are saying this song is so moving because Rihanna knows from experience what she's singing about, and i agree it IS very emotional but honestly it's so upsetting i instantly have to change the radio whenever it comes on.  what kind of message is this sending to women?? that it's noble and beautiful to stand there and burn and enjoy the pain??  i'm so angry at everyone involved in producing this song. the female voice in the song never gets angry or condemns the violent male, and this is simply an unacceptable message to send to victims of domestic violence, no matter how true to life it is.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nMen who abuse are sick people, they seriously need therapy.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni think that this song is about a girl who loves this guy a lot, but the guy doesn't realy love her back and hurts/treats her realy bad, but she loves him enough to love his bad parts \"... but it's alright because i love the way you lie\" and tries to stay with him through all that he puts her trough because she loves him so much. but when he snaps her hurts her and she  can't take it and she snaps back, that makes him mad and he hurts her \"... i laid hands on her\" but in the end they love each other\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nDamn genius. Obviously no one here is wrong, but more specifically I think it's about the posion of rage and anger that turns love into hate. The love never really goes away but it's masked by psychological debilitation behind animosity. And rihanna ruined it for me, she's too superficial, emotion didn't quite drive her quite like it did for eminem.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nTotally love the emotion that Rihanna and Eminem put into this song. I could feel chills up my spine when i heard it for the first time. People that have not been in this situation could say that its an exageration. but indeed this relationships exist. \n\r\nI lived one myself, it was just insane and the worst part is that i was aware of it. basically same story relationship full of passion since day one.he had his flaws i know i have flaws myself we humans are not perfect but we loved each other either ways. and as passionate as our relationship was as well were our fights as intense!verbally intense! and after all the fighting then came the flashbacks of the few good times to together, then flashbacks turned into desire and finally there were both of us desperate to reach for each other again and believing all the \"white lies\" and the cycle continues. i knew it was a sick relationship as i said before i was aware of it the only difference is that the day that it turned physically i was strong enough to realize that sometimes its better to forget how you feel and remember what you deserve.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThe domestic abuse meaning is something you could scrape off of the top of this song pretty easily, but I do not see it purely in this sense.\n\r\nIf you watch the video it pretty much nails the meaning to me:  Two people who are very much in love, but who allow their extreme jealously and anger slowly burn away at their relationship.  In the video you witness them both hitting and being physical with each other, both are caught talking to other people, and yet both are shown to be completely enamored for each other.\n\r\nWe have all been there right?  When the person you love does something to hurt you very bad and all you want to do is hurt them back as retribution.  Yet in all of this effort, you are focusing all of your energy on this one person and they occupy 100% of your thought process.  One could say this is a testament in and of itself for the love you have for them.  At some point you make up though and the complete rush that comes with this over takes you both with the power of a drug.  But as all highs go, it wears off and the cycle repeats.  On to the next fix.  This song is about that vicious cycle and how it repeats it's self until both people's emotions are callused over and the relationship is cold and dead.\n\n\n", "comment_24": "\nI can completely understand the song, the violence in the song is because that situation I believe is close to an understanding and reality between both Eminem and Rihanna, one on one side of the situation and the other one on the other side, but it is in the past for both of them...a lesson they both had to learn...Eminem not to be the agressor and Rihanna not to be the victim.....but...many people are in or have been in this situation...the relationship where you both argue and fight on and off...some periods of time are great and calm while others are like World War III....with or without the violence....it happens to most....you just love each other so much that you deal through the war parts to hold on to the peaceful parts and the calm happy parts...I'm particularly fond of the \"when a tornado meets a volcano..\" line...\r\nI think this is a fabulous healing song for both Eminem and Rihanna to work through their past. Fact is all people make mistakes...not that it is ever okay for violence!!! Great song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nSince I am a survivor of physical, mental, emotional and spiritual abuse I can so relate with this song.  My sixteen year old son (who is a rapper) has ironically asked me to sing the female part of this song. When I sing it I can feel it deep in my soul. \n\r\nI believe when the lyrics say \"I like\" and \"I love\" the way you lie...it is a mocking comment.  No woman, man or child likes or loves to be abused.  But most of the time the abuser is trapped into thinking or believing that she/he desires it.  We believe that it is our fault, that we are not able to stand without a partner, that nobody will love us again if we leave. Maybe we don't have a place to go so we stay with the abuser.  There are so many lies that I told myself when I was on the abusive cycle.  It is very hard to get off and I truly have a heart and much compassion for those who fall victim to this tragedy.  I also believe the victim has issues from the past.  Maybe there was abuse in the home and the victim has learned this behavior from childhood.\n\r\nWhat ever the reasons, what ever the case... there is NO excuse for abuse.  We can and we must have healthy boundaries and say NO to violence of any kind. IT is simply NOT ACCEPTABLE. It causes so much pain, trauma and sometimes even death to the victim.  It is a sometimes silent killer especially if the abuse is mental, emotional or spiritual.  It is silent because there are oftentimes no bruises and the victim appears to be alright...But he/she suffers silently.  \n\r\nPLEASE if you know or suspect a loved one or a friend that is going through this....HELP THEM!! Offer a place for them to stay and get involved.  Do not let someone you know or love suffer needlessly and helplessly.\n\r\nGod Bless and peace to all of you...love yourselves, you are worth it \t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nChris Brown's undefeated!\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThe music video definitely shows what the song is about, too many people listen to this song and say it's just the guy being abuse. That is just wrong. Both parties are at fault, their love brings them together but their mistrust/jealousy pushes them apart. I've also noticed that no one has fully described the meaning to the song so I will do so below.\n\r\nI can't tell you what it really is\r\nI can only tell you what it feels like\r\n(Eminem is describing the relationship. He can't describe how the relationship really is because the love/hate aspect would make anyone think that they're both crazy, but if he describes how they can love each other so passionately and yet intensely hate each other at the same time maybe people will understand the relationship better)\r\nAnd right now there's a steel knife in my windpipe\r\nI can't breathe, but I still fight while I can fight\r\nAs long as the wrong feels right\r\nIt's like I'm in flight\r\n(This is right after they have an argument. He feels horrible about what he said and did to her but part of him gets a rush out of the fights they have and as long as he still gets the rush he knows it's still going to happen.)\r\nHigh off of love, drunk from her hate\r\nIt's like I'm huffing paint\r\nAnd I love it the more that I suffer\r\nI suffocate\r\nAnd right before I'm about to drown she resuscitates me\r\nShe fucking hates me and I love it\r\n(Again, he loves and hates her at the same time, the first line says that it's mutual though and she loves/hates him right back and he loves it. She starts the arguments too but right before he decides to  leave her she knows just what to do to bring the relationship back but still shows that she hates him at the same time.)\r\nWait, where you going\r\nI'm leaving you\r\nNo you ain't, come back\r\n(Obviously a conversation between the two. I get the feeling that the lines really could alternate either way with either the guy having the first line or the girl. It could be the guy from the previous phrase getting ready to leave the girl, or it could be the girl deciding to leave the guy. either way it's happened before and will happen again.)\r\nWe're running right back\r\nHere we go again\r\nIt's so insane\r\n'cause when it's going good, it's going great\r\nI'm Superman with the wind in his back\r\nShe's Lois Lane\r\nBut when it's bad, it's awful\r\n(This is the proof that the previous lines have happened before \"Here we go again\", but before that it also says that they're going to get back together again. He tries to describe again just how the relationship is, when it's good it's amazing, it could never be better. I like how he understates how it is when it's bad, but he does it to prove a point. The point is that they love each other more than they hate each other and that's why they keep running back to each other despite the constant fights.)\r\nI feel so ashamed\r\nI snapped\r\nWho's that dude\r\nI don't even know his name\r\nI laid hands on her\r\nI'll never stoop so low again\r\nI guess I don't know my own strength\r\n(Pretty self-explanatory IMHO, She was talking to another guy and he got jealous and snapped. I feel that the fact he didn't know the other guy's name is irrelevant, he probably would've snapped anyway. The point here is that it's not just his fault. She was almost egging him on because she knew just how jealous he was but was with that other guy anyway.)\n\r\nJust gonna stand there and watch me burn\r\nBut that's alright because I like the way it hurts\r\nJust gonna stand there and hear me cry\r\nBut that's alright because I love the way you lie\r\nI love the way you lie\r\nI love the way you lie\r\n(This describes the love hate relationship they have and how no matter what he does she'll always come right back to him. She's in love with the pain both physical and emotional because of the intensity and rush of emotions that come with it. When she says she loves the way he lies it means that she loves the way he lies to her about how he'll change and it will never happen again even though she knows better and they'll continue to fight)\n\r\nYou ever love somebody so much\r\nYou can barely breathe when you're with 'em\r\nYou meet and neither one of you even know what hit 'em\r\nGot that warm fuzzy feeling\r\nYeah, them chills, used to get 'em\r\nNow you're getting fucking sick of looking at 'em\r\n(I think we've all been here at some point. You meet somebody and it's complete head over heels love at first sight. You don't eat, sleep, or anything else much anymore. All you want is to be with that other person. When you think of them you're instantly warm and happy, and you get chills looking at them and realizing how perfect that they are (at least in your own eyes). Then all of a sudden, one day after seeing them forever it's like a wake up call. You suddenly see all of their little imperfections and it makes you almost physically sick. You feel like you never want to see them again, you get angry at them with the hopes that they will leave you alone.)\r\nYou swore you've never hit 'em\r\nNever do nothing to hurt 'em\r\nNow you're in each other's face\r\nSpewing venom in your words when you spit 'em\r\n(In the beginning of a relationship you swear you'll treat them like a king/queen, never do anything to hurt them either physically or emotionally. Later on though after things change like above, you start to argue, it starts off small then it gets bigger and bigger.)\r\nYou push, pull each other's hair\r\nScratch, claw, bit 'em\r\nThrow 'em down, pin 'em\r\nSo lost in the moments when you're in 'em\r\nIt's the rage that took over\r\nIt controls you both\r\nSo they say it best to go your separate ways\r\nGuess that they don't know ya\r\n'cause today, that was yesterday\r\nYesterday is over\r\nIt's a different day\r\n(The first half describes the fights that they have. It started off verbally above but after a while they built up a tolerance to the verbal fights so it had to get bigger, they started fighting physically. Notice again that Eminem doesn't blame one side or the other, he says that they're both to blame for the fighting because of the emotional rush that they both get from the fights. When they're in either they're good or their bad moments it's like they never want it to end because of the emotional rush both the good and the bad gives them. Again, he says that the rage isn't just him or just her, it's them both. It controls both them and the relationship. The fighting is actually what they have in common, they both need it and it's what keeps them together. They're friends tell them that they're crazy for acting how they do and they need to break up. They both agree that they're friends don't know what they're talking about and don't know them well enough. He lies and promises it won't happen again and that's why they say that today is different than yesterday, even though they both know it's not and they're destined to fight again.)\n\r\nSound like broken records playin' over\r\nBut you promised her next time you'll show restraint\r\nYou don't get another chance\r\nLife is no Nintendo game\r\nBut you lied again\r\nNow you get to watch her leave out the window\r\nGuess that's why they call it window pane\r\n(Eminem breaks the forth wall here and talks directly to the listener that's in a normal relationship. In a normal relationship couples often break up after large fights. Eminem tells the listener not to be like the couple in the song and to learn to control themselves because \"life is no nintendo game\", if a person messes up big odds are that they deserve to be broken up with. I love the play on words he uses at the end with window pane (pain).)\n\r\nNow I know we said things, did things that we didn't mean\r\nAnd we fall back into the same patterns, same routine\r\nBut your temper's just as bad as mine is\r\nYou're the same as me\r\nWhen it comes to love you're just as blinded\r\nBaby, please come back\r\nIt wasn't you, baby it was me\r\nMaybe our relationship isn't as crazy as it seems\r\nMaybe that's what happens when a tornado meets a volcano\r\nAll I know is I love you too much to walk away though\r\nCome inside, pick up your bags off the sidewalk\r\nDon't you hear sincerity in my voice when I talk\r\nTold you this is my fault\r\nLook me in the eyeball\r\nNext time I'm pissed I'll aim my fist at the drywall\n\r\n(I look at this as the guy talking to the girl. The guy says he knows that they didn't really mean what they said when they fought but he also admits that the fighting has now become routine for them. They both expect and accept it. He tries to appeal to her by making her realize that they're the exact same. They both have really bad tempers and so they fight constantly, however neither one of them can see it because of how \"love is blind\" and they love each other to the fine line of love and hate. He begs her to come back. Once again appeals to how their relationship isn't crazy, it's just how it is because of how they both are and they both love to hate each other. The fact that he uses a tornado and a volcano, two very destructive forces again shows how it's not just one or the other's fault, they both are too jealous, controlling, loving, all at the same time. He takes the blame for this fight though because he knows it will make her come back. He says next time he'll take his anger out on the wall instead of her.)\n\r\nNext time, there won't be no next time\r\n(I see this as the girls reply, she's starting another fight here. She knows that saying no will make him angry again and start another fight, she knows it's going to happen, but she hates and loves it at the same time.\r\nI apologize even though I know it's lies\r\n(His reply to hers to once again try to get her back. He apologizes for his temper but he knows it's a lie and that they will eventually fight again.)\r\nI'm tired of the games\r\nI just want her back\r\nI know I'm a liar\r\nIf she ever tries to fucking leave again\r\nI'mma tie her to the bed and set the house on fire\r\n(this ending is him talking to himself. He's personally starting to get tired of the fights because he knows that they push her away from him. He knows he's lying to himself though and that he knows that he'll start another fight. His jealousy/controlling temper decides that he won't let her leave and he decides what he'll do if she ever actually does leave. I think though that according to the music video that the next time that she tries to leave he does get mad and sets the house on fire, but they both survive as they can be seen outside of the burning building at the end. The fact that they're both on fire is not literal, it's the burning of their relationship, how they both love each other but the fighting is destroying them both. I also think they survive as i believe that they're both kissing in front of the burning house at the end, showing that even though he took such drastic measures, they're both still very much in love.)\r\nthis ends my analysis for part 1. Look up \"Love The Way You Lie (Part II) [featuring Eminem]\" for the next part of my analysis.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI think this song is about when chris brown abbused rihanna and how much pain he caused her\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nher song is sad and you can hear her every emmotion.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis is about how she will chose satan and will not care of the consequences, e.g \"Just gonna stand there and watch me burn But that's alright because I like the way it hurts\r\nJust gonna stand there and hear me cry But that's alright because I love the way you lie\"\r\nSo, i dont think she will change, showing that satan has her around his little finger, as he is a liar and a thing indescribable\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI doubt anyone caught the Modest Mouse reference.  Spewing venom, spitting words, etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThis song's meaning is very clear: toxic relationship.\n\nI do want to say that whatever your opinion is of Rhianna or Eminem you can't help but admit how important of a song this for our culture. Domestic violence plagues our culture, and this song unabashedly expresses this conflict in a unique way. They use the medium to make you almost FEEL your in the relationship. There's been songs about domestic violence before, but none that makes you experience the temptations so strongly through the music. It's a melody made to make us want to feel romance and emotion, and yet the words are so brash. Very powerful. It's a daring song that doesn't solely victimize either person, nor create a villain out of either person. They are two people incredibly attached to each other who also happen to be in an incredibly toxic relationship. The woman just can't get herself to leave the man because she admits to herself this is what she wants, and the man can't handle the intense emotions he has for the woman. Very strong reflection of those involved in domestic violence. I am sure Rhianna had a stronger understanding, due to her unfortunate experiences.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\ni used to really hate this song, because i felt it was condoning abusive relationships, and i felt the woman was idiot for staying and saying that she loved it and him, and the whole relationship in general. that is until recently..... i'am literally living this relationship as i type this, i agree with most people, very raw and alot of emotion in this song that pretty much sums it up. every word in this lyric is how my ex-boyfriend (i guess that is what we are at the moment) and i feel. we both want to stop hurting each other, but it seems like we really need each other and the cycle continues. We both believe that one day it will get better, but im starting to think it never does...... reality will hit one day, and i'am afraid of what will happen to me or him..... its very hard to break from a relationship like this but its doable, this is the millionth time we try to break up, after a huge fight like this, but we shall see how it goes in the next couple of days... either way this song has new meaning and i see it very different from what i used to think of it. and Its a sad unfortunate situation but very really and difficult to give up.... and some people dont understand and cant understand, but theres a lot including myself that do and can relate to the lyrics of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI'm not really a fan of either artist (I do respect Eminem though, he's a talented guy) but I do like this song. It does what a lot of songs about domestic abuse do not, which is show the abuse in this relationship comes from both sides. Neither person in this situation can call themselves the victim, because they've both played a hand in what has happened between them. Usually, a song addressing this topic paints one particular person as the abuser, so it's nice to see someone take this in a different direction. Also, I don't think this song is justifying abuse as much as it's giving the listener some insight into what the singers relationship is like. It's painful, volatile, addicting, and destructive during the bad times, but passionate, loving, and supportive when things are good. Basically it's like a roller coaster. The assent it fun an exciting, but the drop is terrifying. Don't take this the wrong way though, these relationships are unhealthy and the people in them should part their ways as soon as they can to prevent any further (and sometimes irreversible) damage. It's an all around good song, and it's part 2 is not far behind... although I think Eminem's verse is the best part of that particular song. Cheer!\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThis is a abusive song\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nGenius.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\n^ i agree. this song is so powerful, i can hear the every emotion in every note.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI thought Eminem couldn't come back better, or stronger than he had... I guess I was wrong after hearing this song, I knew Shady was back for good that he means what he says in his song not afriad. and I love it! Keep spittin the truth and the right, and real ppl will love you for it Em. Keep it up!:)\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nPowerful, true, and sad!  Lots of insight!  Rihanna puts her heart into it!\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI love this song. I keep playing it on repeat. I think its very meaningful and is about how crazy relationships can get. When they are going good, there great- and alot of times we try and hold on to those moments. and when there bad- they are horrible. Especially in the songs situation. The boyfriend becomes abusive and hits the girl, and then feels terrible after and promises never to do it again. The girl is probably just as crazy mentally at times because of all the emotions that run through their heads when they fight- they are both not thinking clearly. Alot of girls beleive this and stay with the guy because they because they love him so much. The guy in the song knows if he gets angry again he will most likely hit her but he promises lies about not ever touching her again. When i hread the ending of the song, at first i was like what a terrible ending- he basically says hes going to kill her if she ever tried to leave him. But then i thought, that completely fits. Its basically saying, when in an abusive realtionship you need to get out, because if a man can hit you, then he is capable of doing worse things as well. I think its awesome that rihanna is singing the chorus because she has delt with this frist hand. also having eminem rap is perfect.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nPretty sure 'torn nail' is 'tornado'.\n\r\nI love the chorus in this song. The rest of it, not so impressed with. But the way they blend their vocals in parts is pretty amazing, where the chorus and main lyrics meet.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nMan, this song hit me so fuckin' hard it put me in tears. Shit reminds me of my mom n' dad and how damn scary it was when he'd get in one of his bipolar freakouts, threatnin' me, threatenin' my mom and puttin' holes in the walls... but I know he didn't really mean the shit, it was just his anger takin' over but I still held so much anger back at him, but now I see his behavior comin' out in me in my own relationship. It's so easy for us both to get in fights cuz we both have the same temper and tendency to get upset over the littlest shit. I love that line \"You don't get a second chance / Life is no Nintendo game.\" Even though I always wish there was one, there ain't no reset button or a Save State file to go back to when you fuck shit up or hurt someone. \n\r\n\"Next time I'm pissed, I'll aim my fist at the dry wall,\r\nNext time, there won't be no next time.\r\nI apologize, even though I know it's lies.\r\nI'm tired of the games, I just want her back.\r\nI know I'm a liar.\r\nIf she ever tries to fucking leave again.\r\nI'mma tie her to the bed and set the house on fire.\"\n\r\n\"But you promised her; Next time you'll show restraint.\r\nYou don't get another chance, life is no Nintendo game.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nwhat if it's not about a relationship with somebody, but his relationship with the rap game?\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nthe song is good but sad :( eminem came back better then relapse did with recovery\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThis song really hit home for me. I have been in a crazy relationship for over a year just like this one in the song. I love my man more than life itself, but when Rhianna says \"Just gonna stand there and watch me burn\r\nBut that's alright because I like the way it hurts\r\nJust gonna stand there and hear me cry\r\nBut that's alright because I love the way you lie\r\nI love the way you lie\r\nI love the way you lie \"\r\nI think that she is saying that her man watches her life desinigrate in flames from all the damage he causes from his drug abuse. He is controlling and lies constantly... one reason is probably from the drugs he lies to get what he wants. The relationship is on fire from the passion they have for eachother, but they both have tempers. She will keep believing his lies because she loves him too much and the torment from the lies is what she thrives on... By him lying it shows her that he loves her enough to try and keep her around with all his lies and she takes it. He convinces himself that he will change, but it is true that the routine will keep returning unless she leaves him, but she will always go back because she loves him so much, so she learns to love his faults. These kind of guys will say whatever they can to keep you, but just remember they will watch you cry and let you burn in flames to get what they want out of you.... whatever it my be...  They love you but do they love the drugs more?\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI love this song so much. It shook me. So powerful. So real. So raw. Eminem, you are the writer that makes me appreciate and realize why these tears exist. \t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI think this song is about the complexity of domestic violence... It doesn't matter whether its a guy against a girl vice versa or same sex couples so don't focus too much on that. Anyone who has been in an abusive relationship will be able to relate to this song.\r\n\"So lost in the moments when you're in 'em\r\nIt's the rage that took over\r\nIt controls you both\"\r\nI think this line sum's up quiet well what abusers say happens to them when they start beating their partner... they talk about losing control and a \"red mist\".\r\nRhianna puts the emotion into this song. Her lines to me seem like the victim is pleading with the abuser to stop, but it doesn't matter what they say or do the abuser doesn't care, he's just going to keep going.\r\nEm' goes on to apologies for his actions he'll never do it again etc... and thats pretty much the cycle of domestic violence... they say they wont do it again, and you love them/you believe them they cry and your right back in the cycle. \n\n\n", "comment_48": "\nI think this song is about the complexity of domestic violence... It doesn't matter whether its a guy against a girl vice versa or same sex couples so don't focus too much on that. Anyone who has been in an abusive relationship will be able to relate to this song.\r\n\"So lost in the moments when you're in 'em\r\nIt's the rage that took over\r\nIt controls you both\"\r\nI think this line sum's up quiet well what abusers say happens to them when they start beating their partner... they talk about losing control and a \"red mist\".\r\nRhianna puts the emotion into this song. Her lines to me seem like the victim is pleading with the abuser to stop, but it doesn't matter what they say or do the abuser doesn't care, he's just going to keep going.\r\nEm' goes on to apologies for his actions he'll never do it again etc... and thats pretty much the cycle of domestic violence... they say they wont do it again, and you love them/you believe them they cry and your right back in the cycle. \n\n\n", "comment_49": "\nSo I know this probably really isn't the place for this, but I am truly curious what the argument is FOR Jay-Z. I've heard many talk of how wonderful he is, but I listened to his latest CD (sorry, didn't listen to rap 3+ years ago, didn't like it yet), and the lyrical content was A) stupid bullshit, and B) about how wonderful he is.\r\n??? \r\nAlso, if anyone wants to recommend me some new rap, I am a fan of Eminem, Mos Def, and MF Doom.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI definitely agree with most of these posts. This song is about an abusive relationship and the vicious cycle it always takes. I would also like to add that in the chorus it's the woman trying to justify the abuse bcuz she loves her partner.\r\n\"Just gonna stand there and watch me burn.\" JUSTIFICATION \"but that's alright bcuz i like the way it hurts\" she is also saying that she loves the way he lies bcuz he always promises nvr to hurt her again. both of them know it will happen again but love eachother to much to just walk away and end the cycle. In the end you can hear the man's dark side come out. he is sick of her trying to leave, he knows what he is capable of and is rdy to kill her if she tries to leave.\r\nSo many ppl go thro this situation evry day. eminem and rihanna nailed evry sing emotion and part of the cycle. It is amazing bcuz they have both gone thro it... \t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nwow, powerfully emootional :')\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThis song is so sad. They're both lying to each other; her by saying that she will leave, even though she never does, and him by saying that there will be no next time, but there always is.\r\nHer weakness is emphasised in his final verse when he says \"I just want her back, i know I'm a liar\" after she spends the entire song declaring that she loves this feature; this is what is making her stay with him. \r\nThe fact that she knows he is lying every single time he says he won't hit her and yet she still stays with him is so upsetting :( \r\nI think it's really great that Rihanna is singing on this because she was stronger than the woman in the song; she managed to get out of the relationship. \t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nthank goodness someone else is doing the singing in the chorus. Sorry Em, but your singing is average at best. Stick to rapping dude!\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI think its about a really strong relationship that slowly got worse. And they became sick of each other. Lies and cheating came into the picture. And he started beating her from the fights. And then her trying to leave and him lying about things are gonna be different, when in reality they wont change and the next time she tries to leave, he was gonna kill her.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nAs I type this, the #1 song in America is \"California Gurls\" by Katy Perry (featuring Snoop Dogg). Sitting right behind them at #2, with the \"Airplay Gainer\" bullet for the week: \"Love The Way You Lie\" by Eminem (featuring Rihanna). Mark my words: This will be the next #1 song in America, and I hope it stays there for a long time.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI love this song! I knew he would make an awesome comeback because his last cd was crap. I love it. \t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI am absolutely amazed that Rhianna managed to get through these lyrics without crying.\r\nHaving been in a relationship exactly like that, it makes me tear up listening to it every time.\r\nThough I do have to interject and say that I don't think the female in the story loves  that he lies, so much as she has so much hope that his lies are going to be the truth this time (and she loves him so much to believe that it will be the truth, yet rationally she knows its a lie), or that him apologizing is always so sweet it gives her hope that it'll be different this time around...difficult to explain, but having been there before in my past (I got out eventually), it all makes perfect sense since logic does not prevail in a relationship like that...awesome song!\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI disagree that the last few lines imply that he's going to kill her - I think it's a little more metaphorical than that, and I think he's supposed to be in the house with her when he burns it down... meaning the next time this happens it'll destroy them and their relationship completely. \t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nBeen in this kind of relationship. The lyrics are exactly how they are spoken by both of em...\r\nsad but true.  They've been through it, diff situations but still abuse.  I'm 30, still dealing, took 1 person...emotionally, physically, mentally....abuse is abuse!\r\nHard to leave an abusive relationship once ur in it.  You love eachother too much tho there's always a next time...always!  \r\nProps to Em & Rihanna <3\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\n\"Don't you hear sincerity in my voice when I talk\"\n\r\ndefinitely. eminem has a way of really making you believe what he's saying\r\nand rihanna is perfect for this song, it's amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nThe song is about Marshall's relationship with Kim, and about him \"taking responsibility\" for the abuse he inflicted on his on again off again wife.\n\r\nWhy the hell would Rhianna agree to sing this??? As a victim of domestic violence herself, I cannot fathom why she's agree to take part in this project. There is no redemptive quality in the lyrics, no lesson to be learned from them. What was she thinking? \t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nEminem along with Dre have moved on from rapping about bitches and guns. His whole CD follows his mistakes with his career, and why he needs to finish. Kim worked for a while for him but im glad he realized to motion towards other problems in life.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nThis song is very accurate in capturing the raw emotions of what happens in an abusive relationship. When I first listened to the lyrics I noticed how disturbing it is but later realised this is actually what happens when a relationship gets abusive. I think the aim of the song is too capture the raw emotions that each party feels when enacting the abuse. It is sad but true many people are in this kind of relationships. The women can't leave because they are too emotionally involved with the men and the abuse further lowers their self esteem and this makes it harder for them to leave. And the men get a high from the power and the control. It is a sick vicious cycle. \t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nIt's easy to see why Rihanna would agree to sing this song. This song is about both of an abusive relationships. Eminem (the abusive party) describes his rocky relationship with Kim obviously, and Rihanna (the abused one)shows her reasoning of why she stayed with Chris. Eminem is obviously rapping about how he feels about Kim. She makes him made and he does horrible things, but he loves her. He is saying why he behaves that way with her. It doesn't matter if it is right or wrong, it is about what he is feeling when it happens.\r\nRihanna isn't going for redemption or to be a role model. She is saying this is why she stayed. In the end she loved him and she believed the lies of how it wouldn't happen again because she liked the lie. she wanted to believe things would get better. A lot of abused women stay because the guy continually lies and says they won't do it again. The women want to believe that it won't. Rihanna doesn't need to send a message to redeem herself or justify what happened, but she can say why she stayed. This song is about both sides of an abusive relationship and it makes sense why these two artists would collaborate on it. \t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nAmazing song! An epic album!!\n\r\nI think that it is not a random chance that it is Rihanna featuring on this song rather than any other female artist with a good voice. I think Eminem chose her purposely, to emphasise the song that bit better, considering everything Rihanna went through with Chris Brown. Oh and she does the job perfect! What a perfect song!\n\r\nI just came back from a holiday in Greece where they even played this song in nightclubs! And it worked, people loved it!!\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nnot a huge Em fan but i really love him in this he sings it so scary and passionatly and Rhi Rhi sounds great also im sure this hit home making it which is y she sounds so great aswell\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI agree this song is about an abusive relationship, but abuse comes in many forms.  It can just as easily mean the emotional abuse that people suffer when they are in love and circumstance prevents them from being together.  I am a pure country kinda girl and very rarely step out of this box, but I have listened to this song on repeat since I downloaded.  It is awesome and can fit different circumstances outside of a physically abusive situation.  I wish there was more of her singing in this, but I think it is a good mix of soft vs. hard as far as composition is concerned.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nthis entire song is incredible on its own, yes.\r\nbut eminem's injection of wit into some parts was what REALLY got my attention.\n\r\n' now you get to watch her leave out the window,\r\nguess thats why they call it window \"pane\" '\n\r\nhis composition with volume, tone, words and how they flow together truly truly is remarkable. so much respect for this man.\n\n\n", "comment_69": "\nThere are a few errors in these lyrics\n\r\nVerse 1-\n\r\nI still fight while I can fight, not all I can fight\n\r\nHigh off my love, not on love\n\r\nVerse 2-\n\r\nI'm pretty sure the line is yeah those chills used to get them\n\r\nLife is no nintendo game\n\r\nVerse 3-\n\r\nAnd we fall back into the same patterns, same routine, not team\n\r\nMaybe that's what happens when a Tornado meets a volcano \n\n\n", "comment_70": "\nThe thing that I find most disturbing is the line where Eminem says, \"If she ever tries to fucking leave again, Imma tie her to the bed and set the house on fire.\" In the video, Rihanna and Eminem are singing in front of a burning house. It keeps making me wonder the fate of the woman in the video...\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nSo this time Eminem is beating a woman because he loves her, and it's totally ok as long as she hits him back.\n\r\nAlso, women like being beaten by Eminem.  Thanks, Rhianna.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nWhat I love about his song is how it acknowledges that they both have serious mental issues. Usually if a man hits a woman, the song is all about what a sick man he is, how dare you hit a woman, etc. And it is VERY wrong. But there is something just as sick and distrubing about a woman who stays in a relationship like that. I'm NOT saying she deserves it, I'm just saying that the woman is as screwed up as he is in the head, and I'm glad this song seems to acknowledge it, when most of the time the victim's emotional instabily is glossed over or overlooked completely.\n\r\nLeave it to Eminem to speak the truth. :D I also love the ending. How he admits he's lying, he know he won't change. He's lying and he thinks he might kill her if she tries to leave him again. I love how the end of the song he talks about how he'll \"set this place on fire\" and then suddenly Rihanna's lyrics that have been symbolic (burn meaning hurt) becomes literal, as in kind of hinting that he's so sick he would watch her burn if she did leave him. The song goes from sad to kinda morbid and shocking at the end- very much Eminiem's style. I love it.\n\r\nI think it's interesting Rihanna did this song based on her own life experience of being an abuse victim. Good for her to face what happened and not be afraid to use it in her songs. Most of the songs I've heard from her on the radio are pretty shallow, just dance songs to listen to in the club really. I'm glad she did something much deeper.\n\r\nGreat song overall. Many touching parts. Music video is pretty good too.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI believe that this song is about a couple who fell in love , but as time goes on , the husband starts to get abusive and it brings out the worst in the wife . So after a while the wife tries to leave the abusive relationship . And when she does he threatens to kill her if she ever tries to again , so in her mind she has to tell herself that the pain is not that bad . She tells herself she likes it because she has no other choice but to like it . She can't leave so she has to endure what he does to her , no matter how painful it is . She tells herself its not as bad as it seems . She constantly lies to herself . Eminem tells her it won't happen again but he is lying , he does love her , but he lets his anger get the best of himself time and time again . \t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\ni can relate to this song with the relationship im in. \n\r\nno matter how much me and my girlfriend piss each other off, we just love each other too much to stay away from each other\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\ni'm in this kind of relationship. i left him before. but now i'm with him. we fight a lot. every time we meet there will be something to fight about. he's a very jealous type of guy. i can't even look at the another guy. he'll be furious. in the end, i end up lying to him. telling him i didn't look at the other guys even actually i did look. i lied a lot. this is because he always control me. i can't do this. i can't do that. i just have to follow what he said. and i have my own mind. i want to do what i want to do. so i chose to lie. i know it's wrong. but i can't stop lying. caused everything i do is wrong to him. and i don't know if he is the one abusing me or both of us are abusing each other. because i slap him when i'm mad. he yells at me. always calling me bad names. says im stupid. and he always says he want to kill himself and all. so in the end i'll be crying and apologizing and begging him to stay. it's a toxic relationship but i love him too much to leave.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nI think this song is about the destructiveness of addiction. Addition to alcohol, to destructive relationships, to emotional anger misinterpreted as love. Some people are just not good for each other, however much attraction there is.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nyet another great combo of eminem wid rihanna like wid dido in stan, though dis 1 is better.the chorus part is so intensely emotional dat not only those who had been in such violent relationship, but also anyone can can relate 2 it. when u r in love wid someone u r ready to forget every time he hurt you as soon as he apologises bcoz it is impossible to continue the  fight  for so long..\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\ni like how eminem emphasizes the lines, \"Maybe that's what happens when a tornado meets a volcano\r\nAll I know is I love you too much to walk away though\". he kindof sounds like he strays from rapping and starts singing. i like that style\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nthis is how his verses actually go.\n\n\r\nI can't tell you what it really is\r\nI can only tell you what it feels like\r\nAnd right now there's a steel knife in my windpipe\r\nI can't breathe but I still fight all I can fight\r\nAs long as the wrong feels right it's like I'm in flight\n\r\nHigh off her love, drunk from her hate\r\nIt's like I'm huffin' paint and I love it\r\nThe more I suffer, I suffocate\r\nRight before I'm about to drown, she resuscitates\r\nMe, she fuckin' hates me, and I love it, Wait!\r\nWhere you going? I'm leaving you.\r\nNo you ain't. Come back. We're running right back\n\r\nHere we go again, it's so insane\r\nCuz when it's going good, it's going great\r\nI'm Superman with the wind in his bag\r\nShe's Lois Lane and it's bad, it's awful\r\nI feel so ashamed, I snap \"Who's that dude?\"\r\nI don't even know his name\r\nI laid hands on him, I'll never stoop so low again\r\nI guess I don't know my own strength\n\n\r\n[Verse 2 - Eminem]\r\nYou ever love somebody so much,\r\nyou could barely breathe when you with 'em?\r\nYou meet, and neither one of you even know it hit 'em\r\nGot that warm fuzzy feeling, yeah them chills used to get 'em\r\nNow you gettin' fuckin' sick of lookin' at 'em\r\nYou swore you'd never hit 'em, never do nothing to hurt 'em\r\nNow you're in each other's face spewing venom in your words when you spit 'em\r\nYou push, pull each other's hair, scratch, claw, bit 'em\r\nThrow 'em down, pin 'em, so lost in the moments when you're in 'em\n\r\nit's the rage that took over that controls you both so they say, you'd best to go your separate ways\r\nGuess that they don't know ya cuz today,\r\nThat was yesterday, yesterday is over and it's a different day\r\nSound like broken records playing over\r\nBut you promised her, next time you'd show restraint\r\nYou don't get another chance\r\nLife is no nintendo game but you lied again\r\nNow you get to watch her leave out the window\r\nGuess that's why they call it \"window pane\"\n\n\r\n[Verse 3 - Eminem]\r\nNow I know we said things, did things that we didn't mean\r\nAnd we fall back into the same patterns, same routine\r\nBut your temper's just as bad as mine is\r\nYou're the same as me\r\nWhen it comes to love you're just as blinded\n\r\nBaby please come back, it wasn't you. Baby it was me.\r\nMaybe our relationship isn't as crazy as it seems\r\nMaybe that's what happens when a tornado meets a volcano\r\nAll I know is I love you too much, to walk away though\r\nCome inside, pick up your bags off the sidewalk\r\nDon't you hear sincerity in my voice when I talk?\r\nI told you this is my fault, look me in the eyeball\r\nNext time I'm pissed, I'll aim my fist at the drywall\r\nNext time? There won't be no next time\r\nI apologize, even though I know it's lies\r\nI'm tired of the games, I just want her back. I know I'm a liar\r\nIf she ever tries to fuckin' leave again,\r\nIma tie her to the bed and set this house on fire\n\n\n", "comment_80": "\nI hate this song because it hits too close to home. \t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nwell this song really has a lot of meaning.. when i was a freshmen in College i met this nice man.. he was 26 and i was 19.. he said all the right things and did all the right things.. i fell for him hard and figured he was my soulmate were interested in the same things.. we playes sports together, basically did everything together.. we decided too move in together after at year of dating. we were fine for the first month.. and then his moods started to change.. he was getting mad cuz i wasnt cooking the right foods. having girlfrens over. the kitchen was clean the towel werent done.. many numerous things that would get him mad.. Then i started changing who i was as a person. Would always make sure when he got off work everything was cleaned.. starting buying food he likes. he wouldnt let my call me parents or family.. i was living 12 hours away from where my family lives..so i get  fed up leave him numerous times. but like the song she keeps going back because u love em.. not for what or who they are.. you love them for the potential u see in them as a person.. i seen only the guy i met. i didnt see this monster who threw fits of rage..then the rages started getting worse.. he start out with pintching me and biting me.. then as the arguments got worse and more consistent. he started hitting me.. but not in places where people could see but where i knew they were.. i was a young gurl trapped with a mind game playing adult man. he knew how to control me and say all the right things.. told me he wouldnt do it ne more. used tears too the fullest.. telling me he would kill himself if i would leave him.. I heard all these different promises and lies from him.. then i started fighting back it got worse.. like how eminem says Maybe our relationship isn't as crazy as it seems\r\nMaybe that's what happens when a tornado meets a volcano. this is how i was starting too feel and think.. but i so know the chorus of rihannas lyrics.\r\nJust gonna stand there and watch me burn\r\nBut that's alright because I like the way it hurts\r\nJust gonna stand there and hear me cry\r\nBut that's alright because I love the way you lie\r\nI love the way you lie\r\nI love the way you lie\r\nbecausee thats what i went through until i got up the nerve and left him started telling my self i deserved better and that this wasnt normail. and i missed the old me. know that i will never be the same  mentally but atleast i learned and can help other women with this experience.i went through 6 years of pain! but i thank god for my life. worse could have been done.. \t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nThis song is a story about two people who are deeply in love.  Both of them seem to thrive off the adrenaline of the fight and the addictive calm that follows it.  He becomes addicted to the power, to that desire to hurt her, make her want to kill him.  This is proof, in a way, that he is important to her, important enough to make her break down.  Eventually, it goes too far and he does what he never thought he would:  begins to throw her around and hit her.\n\r\nHe tells her that he loves her, swears he will never do it again.  The tragic part of it is that he really DOES love her and he really DOESN'T want to do it again.  He treats her like a queen and for awhile life is blissful for the two of them.  There is this beautiful delusion that everything has changed, that such deeply ingrained behavior patterns will just disappear if both parties try hard enough.  Unfortunately, trying so hard becomes a strain on the relationship, partly because his need for power has been gnawing at him this whole time, partners fall short of expectations, and the abusive relationship starts all over again. \n\r\nThey both love each other, need each other, can't imagine living without each other.  Neither of them really want to leave because of this, especially since the good times are so AMAZING, make them feel it CAN work, that it WILL work just one of these times, even though secretly both of them know the abuse will just keep happening.   \n\n\n\n", "comment_83": "\nThis to me is about being in a destructive relationship with both parties being fully content to let the cycles of abuse continue. I think that many take Eminem's lyrics too seriously and judge them too quickly...for me this is brilliant poetry, written from the heart and a place of 'knowing'. Takes balls to bust your own chops!\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nThis song is so powerful!\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nEminem didn't even write this song.  He bought it from someone who stalked me and tormented me.  (The Illuminati.)\n\r\nThe world could use some RECOVERY from bullies, stalkers, liars and manipulators.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nP.S.  This song is all about my realationship (not a typo) with an old friend.  The one who abused me.\n\n\n\n", "comment_87": "\n-Now you get to watch her leave out the window \r\n-Guess that's why they call it \"window pane\"\n\r\nI noticed most lyrics use the spelling \"window pane\" in reference to \"it.\" I always thought it could have been \"window pain\" in either intended spelling or meaning. It sounded off, but plausible.\n\r\nGelatin LSD is often known as \"windowpane.\" LSD can induce delusions and depression, mostly in people prone to mental illness. Would be an interesting lyric in that case.\n\r\nOr am I missing something that's right in front of me?\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nIt's a song about how they're in an abusive relationship but they still love each other. He always promises that he won't hurt her anymore but they know it's a lie. \n\r\n\"Who's that dude\r\nI don't even know his name\r\nI laid hands on her\r\nI'll never stoop so low again\r\nI guess I don't know my own strength\"\n\r\nHe's basically really ashamed that he hurt her and he's thinking about how it was like he was someone else when he hurt her because he didn't realize that he would do something like that. He knows he was wrong and he swears he'll never do it again, but he always ends up hurting her. \n\r\n\"Now you get to watch her leave out the window\r\nGuess that's why they call it window pane\" \n\r\nSo now he's watching her leave and he realizes that he loves her so much and he didn't know how much it would hurt when she left until it was too late. \n\n\n", "comment_89": "\nI'm just thinking..maybe Eminem, who is a human, fell in love to this lady. but after saying love to each other, they become 'in each other's face, Spewing venom in your words when you spit 'em'.\r\nE knows that's happened because 'Maybe that's what happens when a tornado meets a volcano'\r\nUsually, we'll feeling of losing after it gone right.. so E is feeling regret and losing her after her gone for another 'Who's that dude, I don't even know his name'\n\r\nyou know who I'm talking about, dont you?\n\r\nanyway, this is just my interpretation :p\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nThis song hits me in a very vulnerable place. I was in a relationship that devolved into a self-hating frenzy of love, hate, and dependence on my significant other. I never struck my ex wife, but this track speaks to my inner feelings during the worst parts of my relationship with my ex. \t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nrambonajong... no seriously who are you talking about? what do you mean???\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nrambonajong...please please tell me.. its important to me...please i really have to know\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nThis is my song. I was in a relationship similiar to this and it was horrible. Yet, you do stay with that person because of those few little moments that make the abuse worth it (when it's really not). I cried my eyes out when I heard this song. People never change, even if they say they do. \r\nBest line:\r\n\"You don't get no second chance, life is no Nintendo game.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nMy mom's the 'bad guy' in this song, and the 'teddy bears' don't help any more. I'm scared of her, just like my dad. In about three years I can leave my house. this wil probably sounds fake, but if you don't believe me: just imagine it then, because it happens enough. I don't like pop music, and I just decided to look up the lyrics today, and now the song's on repeat the whole evening. Weird, because I don't have the 'I love the way you lie' part with my mom, but everything's still ripping me apart, like the persons in the song. What's more important, the death threads or the blood band? She's still my mom after 16 years. I don't know to love or to hate her. Why am I even posting this?\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nokt this part is stupid but funny if u think bout it, \"feels like a steel knife in my wind pipe\" how da f**k does he know wat that feels like lol\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThis song is about a couple who as much as they love at times they can hate each other at the same time, they have a love hate relationship. There both as bad as each other they both love the violence but at the same time they love the passion they share. thats why they argue then make love. he hurts her, she hurts him but yet neither are strong enough to leave. when rhianna sings \"But that's alright because I love the way you lie\r\nI love the way you lie\r\nshe doesnt actually mean she loves it when he tells lies, what she means is she lovs the way he is, and who he is. she hates him when he cheats but she loves the drama at the same time, when listen to the song it makes you wonder and wish that you had the passion they share. but at what cost? and how long would it last? but i love this song for the simple passion and connect they share \t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nA LOVE STORY SHARE - BROKEN. =(\n\r\nThis song really hits me, she said that she do really loves me, she also has this \"stick to one.\" I do really believe in her!, the way we hold hands!, we smile together, I sit besides her almost everyday of the school days, we always talk, and by the end of the 1st semester, she just gave this letter, with her face so gentle, for me, it's like, what's this, she do really loves me, and night comes, I'm in home now, I read it, everything was so heartfelt, my sweetness on her, she really admits it, she likes it, she also admits that she do really has a crush on me, but there's a really 1 line that destroys my dreams for her.\r\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\"Were not meant to be.\"<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<\n\r\nDid she lied on me?, Well, yes I think, what about all she said unto me, and everything.\n\r\nJust gonna stand there and watch me burn\r\nBut that's alright because I like the way it hurts\r\nJust gonna stand there and hear me cry\r\nBut that's alright because I love the way you lie\r\nI love the way you lie\r\nI love the way you lie\n\r\n:(\r\nI'm gonna find another for my lovelife, maybe... Still cracks my heartly emotions for her, still broken this days, can't move on, actually, I also have friends who gives supports on me, a big thanks for them.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nThe thing to note is that eminem seems to be singing from -both- perspectives... It's not about an \"abusive husband\" its about an abusive relationship... Both parties are equally guilty, of violence and harsh words. Some people crave intensity above all else... My parents have a relationship somewhat like this. They've been giving one another hell for nearly thirty years, and I've done my best to avoid this sort of relationship. They cooled down a bit with age, no one's died. But love and hate are actually very closely related emotions, as I sometimes say \"you can't hate someone, if you didn't really love them to begin with.\" Otherwise its a different kind of feeling, a distant, impersonal one. [Only those you allow to come close enough to actually hurt you can garner real hatred.] In my opinion, its about how some people [a lot of people more than likely], himself included, get caught in the \"love-hate\" relationship; and it rarely ends well. But, they're too blinded by the love aspects to understand that the relationship is self-destructive for both people involved... and that the best thing you can do is -really- just walk away.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nyeah, one of his best and Rhianna's voice is insanely beautiful.  Both their lives are damaged from his  abusive behavior, yet she loves him so unconditionally that he knows no one else will ever replace her.  They have that passion that only comes around rarely in a lifetime and they don't want to give it up.  It's the cost they pay for their experience; obviously one they feel is worth every penny. \r\nPost Reply\n\n\n", "comment_100": "\n*opinion*\r\nAbsolutely superbly acted out by Megan Fox and Dominic Monaghan in the video clip, sung beautifully and meaningfully by Eminem and Rihanna and I'm not sure who wrote the song but the lyrics were very clear and emotional for many people.\n\r\nI absolutely adolre this song, as many people do. Rihanna has copped some criticism, especially because of the well-known history of domestic abuse, however it was exceptionally brave and  artistically creative for Rihanna to contribute to this song and the power which it demonstrates between the two artists from the turmoil and love-driven angst of Eminems rap which divulges into the deepest psyche of his part of the relationship (that he woulld rather literally burn everything, including her, than give it all up) which goes into great detail, then switches to Rihannas complementary simple and melodic chorus in which she confesses that she understands her situation in the relationship ('Just gonna stand there and watch me burn/ Well thats alright because I like the way it hurts) and the danger of this, but loves him and will stay with him anyway.\n\r\nThis is my own personal interpretation of the song, which can also be interpretted as a story of violent domestic abuse or modern-age love, leave comments if you want to lave your own opinion :)\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nI don't know if this song is really about Marshal and Kim anymore than his other songs depict what he does, however, he describes so well why many people stay in abusive relationships. Itâ\u0080\u0099s not the pain inflicted by the abuser that the victim loves, but the affection they receive after a violent outburst. The victim believes the promises that \"it wonâ\u0080\u0099t happen again\" and believe the may harm themselves if the victim leaves. It is textbook that the victim senses the abuser's irritability rising before they go into a violent rage. The victim may do or say something to trigger the rage to â\u0080\u009cget it over withâ\u0080\u009d so that they can return to the making up phase, also called the â\u0080\u009choneymoon phaseâ\u0080\u009d. Eventually the honeymoon phase becomes shorter until non-existent as the abuser has more control over the victim, and the abuse becomes more lengthy and lethal. The promises to stop and threats to harm themselves become threats to harm or kill the victim if they leave, â\u0080\u009cIf I canâ\u0080\u0099t have you, no one will,â\u0080\u009d so the saying goes.\n\r\nIf you are experiencing any of this in your current relationship, get help and get out! There are hotlines and centers that offer services for your situation, even if you're a man (it happens more than you think). The longer you stay in an abusive relationship, the more dangerous it becomes. \t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\ni love this song, eminem's a genius with his lyrics, and rihanna sings it so well.\n\r\nbut i can't help but hate the message. abuse isn't \"a loss of control\". it's a pattern. it's about power, and control. it's the same as rape isn't about sex, but about dominating another person. this song is all about blaming the victim and making it seem okay and oh, it's fine, he just doesn't know his own strength, he loves me really.. \n\r\ni don't know, i'm conflicted :(\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\ni actually in kind this relationship 5mos ago its really hard because i still believe that he will change..until i chose to left him but are relationship is still there.. :( i chose to go far in him..to give him a lesson..he loves me.. but.. he hurt me physically,emotionally but we still have communication...i can really put my self in this song..i still keep going in this relatonship.. because i love him... im hoping that when i come back everything is change.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nI couldn't have said or written it better myself! There is a fine line between love and hate, passion and rage. For some of us \t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nThis song gives me goosebumps.\n\r\nI can so relate, I was in this relationship, except the roles where reversed.\r\nMy ex was abusive and violent. She lied and cheated on me.\r\nAnd for a while I was blind and I Loved the way she lied, because I just wanted to be with her, regardless.\r\nEventually I realized that the relationship was destroying me from the inside and she knew it but kept doing her things.\r\nIt took me a long time to get strong enough to break it off, but when I did I felt such relief and didn't understand why I hadn't done it a lot sooner. But I guess thats what love will do to you. It will make you suffer the worst of pains in the hope that there is a better tomorrow.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nI was in a relationship that this song reminds me of. He wasn't outright physically or mentally abusive, he was very manipulative though. He would push me to my breaking point and then convince me to stay, only for him to push me further away. After three years of constant stress I finally got away from him. I can relate to this song...it's being in a relationship where you love the person so much that it's addictive. It's an incredible feeling when things are going good but it's always a roller coaster because as soon as that person gets slightly upset you fall apart. \n\r\nIt's a dangerous feeling.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI don't understand why everyone thinks Eminem is the best rapper alive. His old stuff was good, his verse on Forever killed, but usually all he does is just scream in every song.  He doesn't even have a flow and a lot of times he doesnt even rhyme. His lyrics aren't clever enough to stand on their own without a good flow so I don't see what he has going for him.\r\n\"Now you get to watch her leave out the window\r\nGuess that's why they call it window pane\"\r\nReally?? That's a terrible line.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nThis is about some ill-tempered dude,who says that he'll never hurt his girl again,but keeps doing it. The girl tries to leave him,but she can't cause she loves him.Awesome composition ^^.Eminem rocks \\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nThis is about some ill-tempered dude,who says that he'll never hurt his girl again,but keeps doing it. The girl tries to leave him,but she can't cause she loves him.Awesome composition ^^.Eminem rocks \\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nAll right, let's get this thing started.\n\r\n(chorus)Just gonna stand there and watch me burn\r\nBut that's alright because I like the way it hurts\r\nJust gonna stand there and hear me cry\r\nBut that's alright because I love the way you lie\r\nI love the way you lie\r\nI love the way you lie\n\r\n- Basically what the girl is talking about is justification for this abusive relationship, how she is burning and crying but she covers it up with \"I like it, OR I deserve it, OR I know he loves me\". This is a typical feeling and thought for women in abusive relationships to experience, and Rihanna \"gets\" that so well.\n\r\n(verse1)I can't tell you what it really is\r\nI can only tell you what it feels like\r\nAnd right now there's a steel knife in my windpipe\r\nI can't breathe, but I still fight while I can fight\n\r\n- I have a feeling these are the feelings after a fight between the two, how he's upset but tries to cover it up with feeling angry about the whole thing and tries to hide his feelings.\n\r\nAs long as the wrong feels right\r\nIt's like I'm in flight\r\nHigh off of love, drunk from her hate\r\nIt's like I'm huffing paint\r\nAnd I love it the more that I suffer\r\nI suffocate\n\r\n- He loves fighting with her at the time, it's a \"high\", he feels when it's happening, he likes destroying himself as well as her.\n\r\nAnd right before I'm about to drown she resuscitates me\r\nShe fucking hates me and I love it\n\r\n- He knows she still loves him, underneath all the hate she has for him, and he enjoys manipulating that knowledge.\n\r\nWait, where you going\r\nI'm leaving you\r\nNo you ain't, come back\r\nWe're running right back\r\nHere we go again\n\r\n- The girl repeatedly tries to leave him, but he knows she'll always come running to him, to all the abuse.\n\n\r\nIt's so insane\r\n'cause when it's going good, it's going great\r\nI'm Superman with the wind in his back\r\nShe's Lois Lane\n\r\n- During the \"good times\" in their relationship, he enjoys being with her and loves her.\n\r\nBut when it's bad, it's awful\r\nI feel so ashamed\r\nI snapped\n\r\n- Likely they get into more brawls when they try to talk to each other about the past ones. So he feels ashamed but he covers it up again with anger, just like the first few lines, and takes it out on her.\n\r\nWho's that dude\r\nI don't even know his name\r\nI laid hands on her\r\nI'll never stoop so low again\r\nI guess I don't know my own strength\n\r\n- These are probably the things he says to her all the time, his \"apologies\" to her, and how he'll never hit her again though he KNOWS he will.\n\n\r\n(verse2)You ever love somebody so much\r\nYou can barely breathe when you're with 'em\r\nYou meet and neither one of you even know what hit 'em\r\nGot that warm fuzzy feeling\r\nYeah, them chills, used to get 'em\r\nNow you're getting fucking sick of looking at 'em\n\r\n- He loved her a lot at first but then something went wrong. He still remembers how great their relationship was at first.\n\r\nYou swore you've never hit 'em\r\nNever do nothing to hurt 'em\r\nNow you're in each other's face\r\nSpewing venom in your words when you spit 'em\r\nYou push, pull each other's hair\r\nScratch, claw, bit 'em\r\nThrow 'em down, pin 'em\n\r\n- He remembers how he said he'd never hurt her.\n\r\nSo lost in the moments when you're in 'em\r\nIt's the rage that took over\r\nIt controls you both\r\nSo they say it best to go your separate ways\r\nGuess that they don't know ya\r\n'cause today, that was yesterday\r\nYesterday is over\r\nIt's a different day\n\r\n- People (friends, therapists, ect) tell the girl often to leave this man, and tell the man to stop what he is doing. But he just says that the next day will be different and he doesn't see a reason for their relationship to end.\n\r\nSound like broken records playin' over\r\nBut you promised her next time you'll show restraint\r\nYou don't get another chance\r\nLife is no Nintendo game\r\nBut you lied again\n\r\n- He keeps telling her that he'll stop but he never does, and he's running out of chances.\n\r\nNow you get to watch her leave out the window\r\nGuess that's why they call it window pane\n\r\n- She leaves sometimes. He doesn't like watching her go.\n\n\r\nNow I know we said things, did things that we didn't mean\r\nAnd we fall back into the same patterns, same routine\r\nBut your temper's just as bad as mine is\r\nYou're the same as me\n\r\n- He blames her in part for everything, saying \"she's just like him\" and that he shouldn't be so much at fault for the state between them. She comes back all the time and they keep fighting even though they both try to stop.\n\r\nWhen it comes to love you're just as blinded\n\r\n- Acting really creepy now, he thinks that the reason they don't get along is because of \"love\".\n\r\nBaby, please come back\r\nIt wasn't you, baby it was me\r\nMaybe our relationship isn't as crazy as it seems\r\nMaybe that's what happens when a tornado meets a volcano\n\r\n- She's left him and he wants her back, so he throws more excuses at her, again blaming her for everything.\n\r\nAll I know is I love you too much to walk away though\r\nCome inside, pick up your bags off the sidewalk\r\nDon't you hear sincerity in my voice when I talk\r\nTold you this is my fault\r\nLook me in the eyeball\r\nNext time I'm pissed I'll aim my fist at the drywall\n\r\n- More excuses from him as he tries to get her to come back, and this time takes the blame, showing how desperate he is. He tells her that he'll never hit her again.\n\r\nNext time, there won't be no next time\r\nI apologize even though I know it's lies\r\nI'm tired of the games\r\nI just want her back\r\nI know I'm a liar\r\nIf she ever tries to fucking leave again\r\nI'mma tie her to the bed and set the house on fire\n\r\n- She goes back to him, and the first line is probably her talking, telling him that he should never be so pissed at her to hit something. The next lines as well, her saying she's \"sorry\" but when really she knows that it's all his fault, so defeated, she comes back to him. In the next lines he admits that he's lying and he'll keep manipulating her, and he realizes what he does to her but he enjoys it too much for her to leave him.\n\n\n\n", "comment_111": "\nThis song i believe is trying to saw the two sides of a same coin. The abuser and the abused girlfriend.The fact that Eminem and Rihanna are signing, which both of them have same experience in the pat makes it more close to reality. If someone listen carefully to the words would think twice before get into this kind of a relationship in which both of them are heart emotionally (regrets and feeling awful for your actions) and physicaly!\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nthey get it!  i am living this right now.  it is complex.  you want to believe him, but know deep down you can't.  the chilling ending is motivating me to get out.  \t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nok , is eminem saying he loves her, or wants to kill her??\r\n-S Breezy:)\r\nToday and tomorrow night!\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nI think this song is about eminems relationship with his rap career.\r\n 'I cant tell you what it REALLY is, I can only tell you what it feels like.  He cant tell us, that this song is REALLY about his love/hate relationship with his career of music because we might think of him as weak.(how one might feel domestically abusing their girlfriend)\r\n right now there's a steel knife in my windpipe - its like hes getting writers block with all these crazy trash artists taking over the music industry\r\nI can't breathe, but I still fight while I can fight- But hes still going to try because he knows he loves it and the fight is still left in him.\r\nAs long as the wrong feels right- as long as the people accept his provacative and condeming lyrics.\r\nIt's like I'm in flight- Hes getting such a high of his outrageous lyrics, becuase people get a high of his truth.\r\nHigh off of love, drunk from her hate- The 'hate' is ehat his career is doing to his personality and inner self.\r\nIt's like I'm huffing paint\r\nAnd I love it the more that I suffer- But he cant stop, his fans are wanting more but  its hurting home that he has to go through so much suffering in his personal life.\n\n\n", "comment_115": "\ncontinued.\r\nI suffocate- all of a sudden. Hes broken. The high paced drug driven musci industy has taken over and he thinks his career is finished\r\nAnd right before I'm about to drown she resuscitates me- but just before everyone forgets eminem, his career bounces back\r\nShe fucking hates me and I love it- and hes back to being in the spotlight with no personal space.He suffers again but hes addicted\r\nWait, where you going- these next few lines, he demostartes how he felt as his career fell to pieces\r\nI'm leaving you\r\nNo you ain't, come back- But he cant live without her)his career and fans)\r\nWe're running right back- Were gona start again.. when we were amazing\r\nHere we go again\r\nIt's so insane- That he keeps running back to being this crazy person with such outrageous views of the world\r\n'cause when it's going good, it's going great- but when hes in the charts and people are loving him, he cant help but be in love with the rap/music industry\r\nI'm Superman with the wind in his back- Nothing can stop him.Hes so powerful\r\nShe's Lois Lane- And whos helpin him, but his ability to rap by his side\r\nBut when it's bad, it's awful- But when it all gets too much and he fits a writing low, he cant stand it\r\nI feel so ashamed-that these 'other' artists are taking the spotlight while he falls back and lets the rapstar lifestly take over\n\n\n\n", "comment_116": "\nI snapped-hes so jealous of all the other powerful artists, that he just loses him. In his song 'Takin 2 my myself' he says Hatred was flowing through my veins,On the verge of going insane,I almost made a song dissin Lil Wayne,It's like I was jealous of him cause the attention he was gettin'I felt horrible about myself,He was spittin and I wasn't,Anyone who was buzzin back then coulda got itAlmost went at Kanye too\r\nWhos that dude- He cant belive he would have done such an awful thing, dissin' these people he thinks are amzing just so he could he look good,\r\nI don't even know his name- its not something he would do, people would have hated him for it\r\nI laid hands on her- He almost killed his rap career\r\nI'll never stoop so low again- But he would never do something like that again-he loves her too much\r\nI guess I don't know my own strength- he didnt realize how powerful he was among the music industry\n\n\n\n", "comment_117": "\nHe feels embarrassed because he saw his partner innocently with another man and hit her. He claims he will never do it again and says he didnâ\u0080\u0099t mean to do it.\n\r\nHave you ever loved someone so much you can barely breathe when youâ\u0080\u0099re with them. You meet and neither one of you even know what hit them\r\nGet that warm fuzzy feeling, yeah them chills used to get them\r\nNow youâ\u0080\u0099re getting fucking sick of looking at them.\n\r\nHe explains that at the start of their relationship they were madly in love but now all of their feelings of infatuation have now disappeared because theyâ\u0080\u0099re bored of being with each other.\n\r\nYou swore youâ\u0080\u0099d never hit them, Never do anything to hurt them\r\nNow youâ\u0080\u0099re in each others face spewing venom in these words when you spit them, You push, pull each otherâ\u0080\u0099s hair,Scratch claw bit them, pin them down, so lost in these moments when youâ\u0080\u0099re in them\n\r\nEminem claims that at the start of their relationship he would have done anything for his partner but now he claims that he gets too carried away by the moment sometimes which makes him be violent.\n\r\nItâ\u0080\u0099s the rage thatâ\u0080\u0099s the culprit, it controls you both. So they say its best to go your sepearte ways. I guess that they donâ\u0080\u0099t know you because today that was yesterday. Yesterday is over, itâ\u0080\u0099s a different day. Sounds like broken records playing over. \n\r\nEveryone around them is saying that they should split up but he thinks that they both know that they should stay together because he has promised that he wonâ\u0080\u0099t do it today because itâ\u0080\u0099s a new day- a promise he makes often.\n\r\nBut you promised her, next time youâ\u0080\u0099ll show restraint\r\nYou donâ\u0080\u0099tâ\u0080\u0099 get another chance, life is no Nintendo game\r\nBut you lied again so you get to watch her leave out the window\r\nGuess thatâ\u0080\u0099s why they call it window pain?\n\r\nEven though he promised he wouldnâ\u0080\u0099tâ\u0080\u0099 hit her again he did and has realised that he has blown his last chance so she has left him but sneaked away through the window.\n\r\nNow I know we said things, did things that we didnâ\u0080\u0099t mean\r\nNow we fall back into same patterns, same routines\r\nBut your tempers just as bad as mine-youâ\u0080\u0099re the same as me\r\nBut when it comes to love youâ\u0080\u0099re just as blinded\n\r\nHe admits that both of them have done things that they regret and shoudlntâ\u0080\u0099 have done. Even though he always says he wonâ\u0080\u0099t abuse her anymore he always ends up doing it again. He claims that they are both as bad as each other because they both get angry easily however, they both are madly in love with each other too. \n\r\nBaby please come back, it wasnâ\u0080\u0099t you, baby it was me\r\nMaybe our relationship isnâ\u0080\u0099t as crazy as it seems?\r\nMaybe thatâ\u0080\u0099s what happens when a tornado meets a volcano\r\nAll I know is that I love you too much to walk way though\n\r\nHe starts to plea with her to stay with him and admiths that it was all of his fault. He tries to persuade her that they belong together and that the violence is just because of their two fiery personalities. He knows that he needs her and canâ\u0080\u0099t let her go.\n\r\nCome back inside, pick up your bags off the sidewalk\r\nDonâ\u0080\u0099t you hear sincerity in my voice, when I talk?\r\nTold you this is my fault, look me in the eyeball\r\nNext time Iâ\u0080\u0099m pissed Iâ\u0080\u0099ll aim my fist at the dry wall.\n\r\nHe continues to beg for her to un-pack all of her stuff. He tries to show her that he truly does mean everything that he has said and promises that he wonâ\u0080\u0099t take his anger out on her anymore.\n\r\nNext time? There will be no next time. \r\nI apologise even though I know its lies\r\nIâ\u0080\u0099m tired of the games, I just want her back\r\nI know Iâ\u0080\u0099m a liar, and if she ever tries to fucking leave again Imma tie her to the bed and set this house on fire. \n\r\nShe has told him that his promise isnâ\u0080\u0099t relevant as sheâ\u0080\u0099s not going to stay with him. He continues to promise not to abuse her again even though he knows that he will. He ends the song by saying that if she ever tries to leave again that he will tie her to the bed and set the house on fire thus killing her. \n\n\n", "comment_118": "\nA great song with lyrics that have something to do with real life.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nits telling that you can try 2 do anythin but u cant hurt me\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nI think its a couple who both get angry and hurt each other and they promise not to do it again but they keep on hurting each other and lying thats why the title is 'love the way you lie'!\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nthe song is about how they love you you lie\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nTo me this song is about two people who are in love but hate eachother, She wants to leave him but cant because she loves him too much. Hes abusive and knows that he is and tells her he will stop but he never does. When she finaly gets the strength to try and leave he drags her back and promises he wont hurt her anymore, she knows he lies but she loves him anyway. People are trying to force them apart but they need eachother and people dont see it. \t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nRated 0            All right, let's get this thing started.\n\r\n(chorus)Just gonna stand there and watch me burn\r\nBut that's alright because I like the way it hurts\r\nJust gonna stand there and hear me cry\r\nBut that's alright because I love the way you lie\r\nI love the way you lie\r\nI love the way you lie\n\r\n- Basically what the girl is talking about is justification for this abusive relationship, how she is burning and crying but she covers it up with \"I like it, OR I deserve it, OR I know he loves me\". This is a typical feeling and thought for women in abusive relationships to experience, and Rihanna \"gets\" that so well.\n\r\n(verse1)I can't tell you what it really is\r\nI can only tell you what it feels like\r\nAnd right now there's a steel knife in my windpipe\r\nI can't breathe, but I still fight while I can fight\n\r\n- I have a feeling these are the feelings after a fight between the two, how he's upset but tries to cover it up with feeling angry about the whole thing and tries to hide his feelings.\n\r\nAs long as the wrong feels right\r\nIt's like I'm in flight\r\nHigh off of love, drunk from her hate\r\nIt's like I'm huffing paint\r\nAnd I love it the more that I suffer\r\nI suffocate\n\r\n- He loves fighting with her at the time, it's a \"high\", he feels when it's happening, he likes destroying himself as well as her.\n\r\nAnd right before I'm about to drown she resuscitates me\r\nShe fucking hates me and I love it\n\r\n- He knows she still loves him, underneath all the hate she has for him, and he enjoys manipulating that knowledge.\n\r\nWait, where you going\r\nI'm leaving you\r\nNo you ain't, come back\r\nWe're running right back\r\nHere we go again\n\r\n- The girl repeatedly tries to leave him, but he knows she'll always come running to him, to all the abuse.\n\n\r\nIt's so insane\r\n'cause when it's going good, it's going great\r\nI'm Superman with the wind in his back\r\nShe's Lois Lane\n\r\n- During the \"good times\" in their relationship, he enjoys being with her and loves her.\n\r\nBut when it's bad, it's awful\r\nI feel so ashamed\r\nI snapped\n\r\n- Likely they get into more brawls when they try to talk to each other about the past ones. So he feels ashamed but he covers it up again with anger, just like the first few lines, and takes it out on her.\n\r\nWho's that dude\r\nI don't even know his name\r\nI laid hands on her\r\nI'll never stoop so low again\r\nI guess I don't know my own strength\n\r\n- These are probably the things he says to her all the time, his \"apologies\" to her, and how he'll never hit her again though he KNOWS he will.\n\n\r\n(verse2)You ever love somebody so much\r\nYou can barely breathe when you're with 'em\r\nYou meet and neither one of you even know what hit 'em\r\nGot that warm fuzzy feeling\r\nYeah, them chills, used to get 'em\r\nNow you're getting fucking sick of looking at 'em\n\r\n- He loved her a lot at first but then something went wrong. He still remembers how great their relationship was at first.\n\r\nYou swore you've never hit 'em\r\nNever do nothing to hurt 'em\r\nNow you're in each other's face\r\nSpewing venom in your words when you spit 'em\r\nYou push, pull each other's hair\r\nScratch, claw, bit 'em\r\nThrow 'em down, pin 'em\n\r\n- He remembers how he said he'd never hurt her.\n\r\nSo lost in the moments when you're in 'em\r\nIt's the rage that took over\r\nIt controls you both\r\nSo they say it best to go your separate ways\r\nGuess that they don't know ya\r\n'cause today, that was yesterday\r\nYesterday is over\r\nIt's a different day\n\r\n- People (friends, therapists, ect) tell the girl often to leave this man, and tell the man to stop what he is doing. But he just says that the next day will be different and he doesn't see a reason for their relationship to end.\n\r\nSound like broken records playin' over\r\nBut you promised her next time you'll show restraint\r\nYou don't get another chance\r\nLife is no Nintendo game\r\nBut you lied again\n\r\n- He keeps telling her that he'll stop but he never does, and he's running out of chances.\n\r\nNow you get to watch her leave out the window\r\nGuess that's why they call it window pane\n\r\n- She leaves sometimes. He doesn't like watching her go.\n\n\r\nNow I know we said things, did things that we didn't mean\r\nAnd we fall back into the same patterns, same routine\r\nBut your temper's just as bad as mine is\r\nYou're the same as me\n\r\n- He blames her in part for everything, saying \"she's just like him\" and that he shouldn't be so much at fault for the state between them. She comes back all the time and they keep fighting even though they both try to stop.\n\r\nWhen it comes to love you're just as blinded\n\r\n- Acting really creepy now, he thinks that the reason they don't get along is because of \"love\".\n\r\nBaby, please come back\r\nIt wasn't you, baby it was me\r\nMaybe our relationship isn't as crazy as it seems\r\nMaybe that's what happens when a tornado meets a volcano\n\r\n- She's left him and he wants her back, so he throws more excuses at her, again blaming her for everything.\n\r\nAll I know is I love you too much to walk away though\r\nCome inside, pick up your bags off the sidewalk\r\nDon't you hear sincerity in my voice when I talk\r\nTold you this is my fault\r\nLook me in the eyeball\r\nNext time I'm pissed I'll aim my fist at the drywall\n\r\n- More excuses from him as he tries to get her to come back, and this time takes the blame, showing how desperate he is. He tells her that he'll never hit her again.\n\r\nNext time, there won't be no next time\r\nI apologize even though I know it's lies\r\nI'm tired of the games\r\nI just want her back\r\nI know I'm a liar\r\nIf she ever tries to fucking leave again\r\nI'mma tie her to the bed and set the house on fire\n\r\n- She goes back to him, and the first line is probably her talking, telling him that he should never be so pissed at her to hit something. The next lines as well, her saying she's \"sorry\" but when really she knows that it's all his fault, so defeated, she comes back to him. In the next lines he admits that he's lying and he'll keep manipulating her, and he realizes what he does to her but he enjoys it too much for her to leave him.\n\n\n", "comment_124": "\nThis song is Kinda sad, it's like the two people are in love but grow apart as time goes on..in the song eminem says: Got that warm fuzzy feeling\r\nYeah, them chills, used to get 'em\r\nNow you're getting f**ing sick of looking at 'em\r\nYou swore you've never hit 'em\r\nNever do nothing to hurt 'em\r\nNow you're in each other's face\r\nSpewing venom in your words when you spit 'em\n\r\nthis shows how much he loves her but.. they just argue+Lie tO Each other..\r\nBefore this, they couldn't stay away from each other..\r\nbut now they can't bare to see each other, even though inside, they both still have love for each other!\r\n'BLESS ;) xoxox\n\n\n", "comment_125": "\nTo me this song is about two people who are in love but hate eachother, She wants to leave him but cant because she loves him too much. Hes abusive and knows that he is and tells her he will stop but he never does. When she finaly gets the strength to try and leave he drags her back and promises he wont hurt her anymore, she knows he lies but she loves him anyway. People are trying to force them apart but they need eachother and people dont see it. \t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nTo me this song is about two people who are in love but hate eachother, She wants to leave him but cant because she loves him too much. Hes abusive and knows that he is and tells her he will stop but he never does. When she finaly gets the strength to try and leave he drags her back and promises he wont hurt her anymore, she knows he lies but she loves him anyway. People are trying to force them apart but they need eachother and people dont see it. \t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nTo me this song is about two people who are in love but hate eachother, She wants to leave him but cant because she loves him too much. Hes abusive and knows that he is and tells her he will stop but he never does. When she finaly gets the strength to try and leave he drags her back and promises he wont hurt her anymore, she knows he lies but she loves him anyway. People are trying to force them apart but they need eachother and people dont see it. \t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nthis song is really...WOW!! when i heard it for the first time i wanted to cry,,,,,i agree with all of you,,its a very powerful song....\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nIt's about two dumb asses that don't know what love is.\n\r\nOne of them is an adult infant who can't keep his hands to himself and should probably be incarcerated, and the other is a jockey for her pain that probably didn't deserve it the first 2 times she went back to the loser, but the next 5 were entirely her own fault for not allowing enough neurons to fire to get out of the situation.\n\r\nThe fact that this song is being Haralded as something that needed saying is  testament to the teeming masses of human filth that are breeding across the planet as we speak.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nLUV the song. Very catchy track. Eminem, as usual, has the voice backed by raw emotion and his excellent timing. The song is obviously about a dysfunctional relationship. The guy is emotionally and sometimes physcially abusive and the woman, for whatever reason, stays with him. In essence, they feel they need each other. He gives the typical \"I won't do it again\" sad song all the while he knows he will because he cannot control his rage. The \"I love the way you lie\" is her knowing the truth... he will feel fear again and explode. She will be his punching bag again and again. She loves him (although he will never fully believe that due to his own personal demons), and she doesn't see a way out. And her looking for that way out is always in the back of his mind. It plays into his insecurities which fuel his rage.  \t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\n When my mother left my father, he started stalking her and ended up killing my younger sister and himself. This song came out not too long after her death. For me this song is clearly about an abusive relationship, the lyrics remind me of my father and how he was towards everyone in the family. It is truly creepy because some of the lyrics are strikingly similar to things I heard my father say throughout my life.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\n\"Not the best video for my 6 year old to watch\" , \"exposing her to that type of violence\" . Well ,kiss my ass and take the mother of the year award back because I sit with her and watch it 5 times in a row. She says, \" I love this song and I hate this song \". \r\n The woman in this video is just as abusive as the man. Sure he puts a hole in the wall and burns down the house but she hits him, spit on him, played her \"get him jealous\" games.\r\n Toying with a man like that is just as hurtful as a slap across the face.\" Hearts are delicate and love is powerful, so play nice and always play fair \" Is what I explained to my little one.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nI used to be in the exact same relationship until he fell in love with someone else. Telling me things like \"we didn't mean anything\". Wonder what to make of that!\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\ni always thought of \"now you get to watch her leave out the window\" as her jumping out the window and committing suicide\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nShe is such a masochist.  Loves the pain.  Well, Loves to hate the pain, really.  Keeps going back to it.  \"I love the way you lie\".  \"love the way it burns\".  \"I like the way it hurts\".\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nThis song is about a poisonous relationship that is addictive on both sides.   I have been in a relationship like this, when this song came out actually I was getting into the relationship and I could tell it was going to turn into this, but still continued.   It is odd how this happens, you dont understand until you are in one.   I am out now, but I understand how people get drawn in\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nA lot of people criticize this song for justifying abuse.\n\nI think this song is about what happens when a person justifies abuse.\n\nI think it is a very powerful message to people who are being abused, that if they keep deluding themselves and don't get out, the ending isn't that the abuser eventually changes. It's that the victim ends up in the hospital or worse.\n\nIn a sea of rap music that glamorizes violence and treating women like ****, I wanted to come here and give Eminem credit for telling the truth.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nIndeed, the song is pretty clear.  Its about a toxic relationship where the man beats his woman.  And she suffers, and in his own way of course, he suffers.  But she stays, or come back.  And he loves her truly in his own way.\n\nYes, this happens a lot in our society. \n\nMan can abuse his woman  and also woman can abuse her man.\n\nThis is not just a one way fact of life. \n\nIts not alright.  \n\nIts not ok.  \n\nIndeed, it is not tolerable.\n\nIn a perfect societey it does not exist.\n\nBut its here.  \n\nMany others are hurt most of the time.  The kids.  The close families.  The friends.\n\nWhy? \n\nHow?\n\nIndeed these are questions most of us can't comprehend.  \n\nOh, we can understand the hate, the anger, the frustrations sometimes... but most of us are able to control ourselves.\n\nWhat is most hard to comprehend, though, is why the violated ones remains with the violators, yes?\n\nIs it even comprehensible?\n\nSometimes I guess it is.  \n\nIs there a lesson here?  Is it karma?  Is it something else?  Is the man truly evil?  Is the woman truly evil? \n\nWhat can we do?\n\nFight?\n\nFight against what?\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nEminem really nails the emotions surrounding violent relationships in a way that I've never heard in a song before. I've lived this type of relationship personally and it's frightening how close his lyrics sound to my husband's reasoning. When I left after he shoved me through a wall, this song came out. He listened to it a lot while we were separated. I've also acted violently mostly in self defense. Also, when you're abused, you often end up with a huge well of anger inside of you. I was never a violent person until he started hitting me. Never. \nHere's my take: both people in a relationship like this are acting out their dysfunctional childhoods on each other. Love means pain, control, dysfunction. They find someone who shares compatible demons and it's off to the races. \nIf you're in this type of relationship, take a step back and realize that this can't be healthy or good. If you truly love your partner, you'll leave them before you both destroy each other. Sometimes the kindest thing is to leave.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nThis song is sad and yet very good, But why would you want to burn someone you love?\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nTERRIFIC SONG!!!! Rihanna is the best! This song is so amazing, I can just listen to it all the time\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nAll is said \r\nBeen in a relationship like this before\r\nThe high is so good when you are together it beats any relationship you can ever have with a man \r\nBut a man like that can make even a docile soft woman scratch him now and then. \r\nHis TORNADO will touch the VOLCANO. \r\nGuess what happens \r\nYou literally tear each other apart\r\nI think she leaves him that makes him mad also he canâ\u0080\u0099t stand it even if she talks to someone. \n\r\nWhat trips him off is her leaving him \r\nHeâ\u0080\u0099s going set her on fire \r\nEven though itâ\u0080\u0099s love ... way too destructive. \r\nI guess I can relate to the tornado part\r\nStill gives me the shivers. \n\r\nItâ\u0080\u0099s no love song . Women canâ\u0080\u0099t take a mans abuse. \r\nThey have a large foul vocabulary and physical strength you just can match. \r\nIf he loses it he can cause real damage. \r\nAll thatâ\u0080\u0099s left is pain. \r\nI still have my head tied up where I was hit. \r\nI donâ\u0080\u0099t like this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nthe 4 paragraf reminds me of some1 i really <3ed\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nYou know, if Rihanna really liked the way it hurt , she'd still be with Chris Brown. I mean , I LOVE this song don't get me wrong , but I just think Rihanna shouldn't be the one singing it , Because of what happened with Chris .\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nDefinately the best song of 2010, no doubting!\n\r\nJust gonna stand there and watch me burn. Well thatâ\u0080\u0099s alright because I like the way it hurts. Just gonna stand there and hear me cry. Well thatâ\u0080\u0099s alright because I love the way you lie, I love the way you lie\n\r\nThis is rhianna playing the part of a woman in an abusive relationship who just cannot seem to leave her abusive partner. She claims that she likes getting messed around by her boyfriend and doesnâ\u0080\u0099t mind been treated so badly because sheâ\u0080\u0099s so in love with him. \n\r\nI cant tell you what this really is, I can only tell you what it feels like\r\nAnd right now thereâ\u0080\u0099s a steel knife in my windpipe, I canâ\u0080\u0099t breathe, I still fight while I can fight, As long as the wrong feels right itâ\u0080\u0099s like Iâ\u0080\u0099m in flight.\r\nHe canâ\u0080\u0099t explain why he does these things to her although he knows its wrong he will continue to abuse her so he feels like heâ\u0080\u0099s in control of the relationship.\n\r\nHigh off of the love, drunk from my hate, Itâ\u0080\u0099s like Iâ\u0080\u0099m huffing paint and I love it the more I suffer, I suffocate, and right before Iâ\u0080\u0099m about to drown, She resuscitates me, she fucking hates me and I love it.\n\r\nHe canâ\u0080\u0099t decide if heâ\u0080\u0099s in love with the girl or hates her. He feels trapped in the relationship but gets a cheap thrill from knowing that his partner canâ\u0080\u0099t stand him. \n\r\nWait, â\u0080\u009cIâ\u0080\u0099m leaving youâ\u0080\u009d â\u0080\u009cno you ainâ\u0080\u0099t, come backâ\u0080\u009d Weâ\u0080\u0099re running right back here we go again, Its so insane cause when itâ\u0080\u0099s going its going great\r\nIâ\u0080\u0099m superman with the wind in his back, sheâ\u0080\u0099s Lois Lane\n\r\nThe girl often claims that sheâ\u0080\u0099ll leave him but never does. Itâ\u0080\u0099s like a vicious circle. He claims that when the relationship is running smoothly they are great together and compares them to superman and lois lane\n\r\nBut when its bad, its awful. I feel so ashamed, I snapped, whos that dude? I donâ\u0080\u0099t even know his name, I laid hands on her, Iâ\u0080\u0099ll never stoop so low again, I guess I donâ\u0080\u0099t know my own strength.\n\n\n", "comment_146": "\nthe lyrics should be \"its the rage thats the culprit\"\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nthis song is about rihanna getting fucked in the butt hole -e - o and liking it :)\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nrihanna gets fucked in the butt.\t\t\t\t\n\t\t\t\t\n\n"}