{"comment_0": "\nI've been waiting for months to tell you guys, that the line \"and my fingers seek my veins\" doesn't mean he was taking drugs or trying to kill himself.  Its like checking to see if he is alive, if there is a pulse\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song is about accepting one's true nature. It combats the popular religious belief that you can be forgiven by confessing your sins. You can apologize to others for who you are, but that's not the same as forgiving yourself. You'll always be tied to what you've done and at the end of the day if you feel like you're not a good person, then the only resolution is to attempt to change your nature. Yet, you're trapped forever in your own mind with the memories of what you've done in your life. If you have corrupted and harmed other human beings, then it's difficult to feel like you really deserve forgiveness. If you can't look at yourself and say that you've lived your life the right way or treated people well, then how will you ever feel like you're deserving of the good that life has to offer?\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThere is definately alot of feeling in this song. This song (to me) is about death, suicide as a matter of fact. \n\r\nThis guy who's about to kill himself is writing to a loved one asking for forgiveness (\"Please Forgive Me...Maybe you'll understand And won't cry for this man\")  for the fact that he can't change whatever is wrong with him, possibly a drug addiction(\"So, you bring this poor dog in from the rain Though he just wants right back out again\") It's about sorrow, the guy is torn and depressed. He cries in the alleyway and confesses all to the rain, but then he lies to the mirror. He's Definately Got Issues.\n\r\nThe Song Is Open To Miles Of Interpretation But That's How I Saw It Off The Top Of My Head, Defintely One Of My Favorite Metallica Songs\n\n\n", "comment_3": "\nSo as I write to you, yeah \r\nWhat is dawning to do, yeah? \r\nMaybe you'll understand \r\nAnd won't cry for this man \r\n'cause low man is due \r\nPlease forgive me \r\nPlease forgive me \n\n\r\nto me..it sounds like he sings \"what is done and to do\" instead of dawning. Which makes more sense..particularly with the suicide theme.\n\r\nBut I could be wrong, english is not my second language after all :)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt should be \"Net below has ROT away\" not right away.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is about a man who is writing a suicide note. The trash fire is the little bit of hope that this person offered him, but the storm is the inevitability that he will kill himself, as he knows that the net has rotted away, but still chooses to give up and let go of his life. Itâ\u0080\u0099s a suicide note because it says, â\u0080\u009cWhatâ\u0080\u0099s done and to doâ\u0080\u009d, which means by the time he/she reads the note, he will be dead, but it hasnâ\u0080\u0099t yet happened. And as heâ\u0080\u0099s writing, he is feeling like heâ\u0080\u0099s already dead (being so low the sky is all he can see, like in a grave), which is why heâ\u0080\u0099s figuratively feeling for a pulse and is so far gone in his depression, that he sees nothing but that looming cloud of death in the distance. He also sees himself as this worthless person who doesnâ\u0080\u0099t deserve to live. He tried to feel better about himself, but it was only on an outward notion, as it says that heâ\u0080\u0099s lying to himself. Heâ\u0080\u0099s asking forgiveness because even though he may not feel like he deserves it, the person will be hurt that he killed himself. The note he is writing is to give some kind of clarity as to why he is killing himself, so the person he is writing it to will understand. Heâ\u0080\u0099s sorry because this person has already saved him from committing suicide before, but he just wants to put himself out of his misery and save the world from himself. When he says that heâ\u0080\u0099s touching the clean to the waste, itâ\u0080\u0099s actually him who is the waste and is comparing the person who saved him as clean and heâ\u0080\u0099s tainted the person with the burden of trying to save this man.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nOne of the deepest songs Het has ever written. It's a bit long of a description but please give me a chance to explain and I promise, if you love this song as well, you will feel very inspired. \n\r\nThis song is about addiction. Plain and simple. It's a letter being written to a loved one from a moment of clarity or a time when sober, such as being in rehab. If you read EVERYTHING together, not just \"my fingers seek my veins\", you'll see it. I'll just use \"her\" for simplicity's sake to refer to the person he cares for since it's Hetfield speaking to this person... \n\r\nThe first verse is stating his intentions. His heart wants sobriety/reality, but his body keeps going back to the drug. He wants another chance with her, wanting to come back to his life/out of the \"rain\". \n\r\nSecond verse, he \"fell\"/relapsed because he \"gave up\" and his chances had been used up/net below has rot away. \n\r\nChorus.. He's lost everything so he's \"keeping warm with the trash fire\" but he still craves/nowhere safe from the \"storm\" of addiction in his mind. And he can't bear to acknowledge/look at what he's become. \n\r\nHe's literally writing to her (again, most likely from rehab or place of sobriety), coming to terms with what he's done and the path he must take to sobriety, and asking her not to feel pity since he accepts he's made these decisions, but instead asking for forgiveness.\n\r\nThird... with sobriety, comes a feeling of being extremely \"low\" and depressed with what you've done, and craving forgiveness from those you've hurt. (And possibly the most important line of the song) \"you bring this poor dog in from the rain/and he just wants right back out again\"... the endless cycle of addiction, you beg for help, receive it, but just end up relapsing/into addiction, wanting to or involuntarily.\n\r\nAt a time when he lost everything, he would \"cry to the alleyway/confess all to the rain\" because addiction stripped him of a home and everyone he cared about... no one left to listen, nowhere left to live. And as every addict does, he \"lies straight to the mirror\" (we lie to ourselves about everything... being in control, still having a life, \"going to quit tomorrow\"); the one he's \"broken to match his face\" (hating what he sees when he looks at himself because deep down he knows the truth).\r\n**********\r\nI see many differing opinions of this brilliant song and Metallica songs have always been open to the listener's interpretation. But one thing I've noticed about Hetfield's songs about addiction, many of them are very difficult to pinpoint as being ABOUT addiction until you yourself have fallen into the abyss of addiction. There were a good 5 or 6 songs (Sad But True, House Jack Built, Bleeding Me, Trapped Under Ice, etc) I never had any idea dealt with this until you start coming face to face with everything he's saying. That's the sign of a true artist.. once you live thru it, you feel what he's saying.\n\r\nThank you if you've stuck with me to the end here, and I hope this helped bring the feeling and depth of this work of art into your heart and soul. And for those of you that suffer addiction like me, I hope this song brings solace and a tiny bit of serenity into your life as so many of James Hetfield's songs have done for me. \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI interpret this song to be about a homeless man who once had a family, but drugs messed up his life and now he's out on the streets. \n\r\nHe just wants his family to forgive him and no matter how they try to help him, he keeps ending up back \"out in the rain\", and on the street.\n\r\nThe trash fire symbolizes the place where he feels safest. It's warm and comforting, but not safe from the storm that is his drug use.\n\r\nHe's writing this letter to his family to tell them to forgive him and and not to worry about him because he did it to himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nwell, my favorite lines are\r\n\"and i can't bear to see\r\nwhat i've let me be\r\nso wicked and worn\"\r\n  and the verse \r\n\"And I cry, to the alley way \r\nConfess all to the rain \r\nBut I lie, lie straight to the mirror \r\nOne I've broken, to match my face\"\n\r\nthey are just..........dammit i cant express myself too good.  i feel this song though, particularly those lines.  bleh.  *hides back into shell*\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nYou guys are all being way too specific. The purpose of these lyrics are so that everybody can relate. It doesn't necessarilly have anything to do with an addiction, or a homeless person. The song is about coming to terms with your mistakes. He or she has made a major mistake somewhere along the line and a friend has tried to help them out but were pushed away (So you bring this poor dog in from the rain Though he just wants right back out again).\r\nNow he or she wishes that they had taken the help and are ashamed of what they have become (and i can't bare to see, what i've let me be). And now is asking to be forgiven for the stubborness.\r\nThe effect that i think is supposed to be felt by us (the fans) is this, If you are in any trouble, don't deny help because it will only get worse and life isn't meant to be lived alone.\r\nI can see how drugs would be brought into this (my fingers seek my veins) but consider this:\r\nIt says My eyes seek reality - He or she is coming to terms that this is reality, this is the persons life. Maybe they're seeking veins to check that he/she is alive. Whether or not they are really living their life.\r\nThis song is full of metaphors and a million meanings could be thought up about it. It means whatever it means to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nYou'll find the correct lyrics here:\n\r\nMy eyes seek reality\r\nMy fingers seek my veins\r\nThere's a dog at your back step\r\nHe must come in from the rain\r\nI fall cause I've let go\r\nThe net below has rot away\r\nSo my eyes seek reality\r\nAnd my fingers seek my veins\n\r\nThe trash fire is warm\r\nBut nowhere safe from the storm\r\nAnd I can't bear to see\r\nWhat I've let me be\r\nSo wicked and worn\r\nSo as I write to you\r\nOf what is done and to do\r\nMaybe you'll understand\r\nAnd won't cry for this man\r\nCause low man is due\r\nPlease forgive me\n\r\nMy eyes seek reality\r\nMy fingers feel for faith\r\nTouch clean with a dirty hand\r\nI touch the clean to the waste\n\r\nThe trash fire is warm\r\nBut nowhere safe from the storm\r\nAnd I can't bear to see\r\nWhat I've let me be\r\nSo wicked and worn\r\nSo as I write to you\r\nOf what is done and to do\r\nMaybe you'll understand\r\nAnd won't cry for this man\r\nCause low man is due\r\nPlease forgive me\n\r\nPlease forgive me\r\nPlease forgive me\n\r\nSo low the sky is all I see\r\nAll I want from you is forgive me\r\nSo you bring this poor dog in from the rain\r\nThough he just wants right back out again\n\r\nAnd I cry to alleyway\r\nConfess all to the rain\r\nBut I lie, lie straight to the mirror\r\nThe one I've broken, to match my face\n\r\nThe trash fire is warm\r\nBut nowhere safe from the storm\r\nAnd I can't bear to see\r\nWhat I've let me be\r\nSo wicked and worn\r\nSo as I write to you, yeah\r\nOf what is done and to do, yeah\r\nMaybe you'll understand\r\nAnd won't cry for this man\r\nCause low man is due\r\nPlease forgive me\n\r\nPlease forgive me\n\r\nSo low the sky is all I see\r\nAll I want from you is forgive me\r\nSo you bring this poor dog in from the rain\r\nThough he just wants right back out again\n\r\nMy eyes seek reality\r\nMy fingers seek my veins\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think the line \"I touched the clean to the waste\" is \"I touched the clean through the waste\", meaning despite all this wrong-doing he's reached through and had good moments.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song is about a homeless man who is seeking redemption for his acts\r\nbefore his death. \n\n\n", "comment_13": "\nThis song is all about feeling. If you have read any of my other comments, I always put somethign about feeling in them somewhere. Music is feeling, and the way Hetfield sings this song is solely based upon feeling. The deep and dark sensation one gets from this alters reality and sends one flying into anothers dispair. Live like we are equal, because we are.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nFEELING! DEFINATELY\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis a song asking for forgiveness that doesn't ignore that people are human and often times need help when they don't want it.  It's very sad and humble.  At first I thought it was like bleeding me, in that it was about one member's AA problems.\n\n\n", "comment_16": "\ni hope you guys won't kill me :P but i always thought it's about taking drugs .. beause of \"And my fingers seek my veins \" and mh .. does anyone get what i mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\ni think maybe it could be about drugs but i doubt it i think this song is more about asking for forgivness from one that is loved and close to someone and they hurt them by a act or acts they have commited against this loved one. thats what this song means to me and yes i do agree alot with the others who say its alot with feeling thats what music is its all feeling.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nTo me, its about hitting buttom of society and of yourself. \n\r\nThe realization of what you have fallen to, and the desire to end it. \t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nyeah weaselfierce i believe you are correct on the lyric there.\n\r\nI always thought this song was about someone trying to pull the writer out of the hole that was his life, but everytime he kept on pushing the helper away...and now he regrets it.....could just be me thouhg....definatley yhas something to do with past mistakes etc\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni feel that this song is about wanting to reach the end...how hopeless life can be,because james was an alcoholic.how he wanted to kick his addiction but couldnt cause it had control of his life,and how he sees where he is heading and he feels helpless...i dont think anyone agrees with me but you know,everyone has there own interpretation of things.....\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nLike a bunch of people said, he knows he's made some mistakes, but he accepts what he has to do to pay for them \"I fall 'cause I let go\"      and he doesn't want people to suffer for what he's done \"All I want from you is forget me \" or to feel bad for him\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nIts about a man who made alot of mistakes in his life (obviously) and feels that nobody wants him anymore\n\r\n\"Bring this poor dog in from the rain\"\n\r\nBut he keeps going back to the drugs\n\r\n\"Though he just wants right back out again\"\n\r\nAnd... he's thinking of suicide \r\n\"Of what is dawning to do, \r\nMaybe you'll understand\r\nand dont cry for this man\r\n'Cuz low man is due\"\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ni think what fingers seek my veins, is that this man is trying to kill himself but cutting himself open or something. So much could be read into this song, so its really hard to tell what the true meaning of it is. Anyways, its still a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI believe this song is about someone who is at a low point in there life and they want to turn there life around, but they are too involved wiith there drugs to do so. \n\r\nThis person lies to themselves as they lie into the mirror. They want thereselves to believe that everything is alright, when they are really caught in a storm in there life. \n\r\nI believe that the trash fire represents the drugs since it's warm and makes them feel good.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIt's a story about a bum who put himself there despite the best efforts of those around him who tried to help.  Frankly you can't fall much lower than that, short of death on the street.  Heck you're already halfway there.\n\r\nA \"trash fire\" isn't symbolic of very much other than a trash fire, and makes more sense when you see homeless on the street huddled around 55 gallon oil drums burning garbage during the winter.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthe person in the song seems to be admitting his patterns to whomever he's talking to.  also, i like what mo0stah said.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nfirst of i am a music major at cal state san bernardino, and music philosophy is a big part in my studies. secondly im am a hugh metallica fan. alot of you are right about the meaning of this song, however you have to realize that with any song the true meaning revolves around the wrighter, when people wright lyrics for music it is mainly about what they are felling at the moment. for instance james might have been felling very depressed when he wrote this song or he might have seen a homeless person that inspired him. nevertheless the meaning that most people get out of it is about a homeless person at his lowest in life not ask for forgiveness but asking for his loved ones to except the fact that this is the way it must be. that he has brought himself to it, now he must live with his choices. to sum it all up; life is what you make of it, so make it happen.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nfirst of i am a music major at cal state san bernardino, and music philosophy is a big part in my studies. secondly im am a hugh metallica fan. alot of you are right about the meaning of this song, however you have to realize that with any song the true meaning revolves around the wrighter, when people wright lyrics for music it is mainly about what they are felling at the moment. for instance james might have been felling very depressed when he wrote this song or he might have seen a homeless person that inspired him. nevertheless the meaning that most people get out of it is about a homeless person at his lowest in life not ask for forgiveness but asking for his loved ones to except the fact that this is the way it must be. that he has brought himself to it, now he must live with his choices. to sum it all up; life is what you make of it, so make it happen.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nAll I hafta say is this song is bad ass!!!! All of yalls thoughts r great. It is really hard to get one interpretation from it.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI don't know whoever posted this but it has critical mistakes......\r\nNO ONE'S SAFE ->should've been NO WHERE's SAFE\r\n..and there is no such thing as WHAT IS DAWNING TO DO (mygod how the heck do you listen to songs!!) -> should've been OF WHAT IS DONE AND TO DO .... and lastly the word isn't BARE -> it is BEAR\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nalso \"my fingers feel for FAITH\" not flames :-(\r\nalso \"all i want from you is FORGIVE me\" !! not forget\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nshouldnt \"all i want from you is to forget me\" be \"all i want from from you is fuckin' money\"\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\n*all i want from you is fuckin' money\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI think it's about a suicidal hobo\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nthis is the worst metallica song ever. it is fucking terrible. i dont care what it means, it sounds so bad. it sound like a drunk irish retard playing a bagpipe.\r\nif you idiots think this song is some of metallicas good work, then you are fucking retarded, and you definately need to listen to master of puppets, kill em all, ride the lightning, or ...and justice for all. and forget the god damn black album. i hate sell outs.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\n\"And I cry, to the alley way\r\nConfess all to the rain\r\nBut I lie, lie straight to the mirror\r\nOne I've broken, to match my face\"\n\r\n\"My fingers seek my veins\"\n\r\nSeems to me its a homeless dude looking to kill himself\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nOh man...I was listenin to AOL Radio's All Metallica while on this site.. and this song comes on. NO ONE CAN FIGURE IT OUT! Which is cool cuz I cant do any better but I think, its about this guy trying to get in thouch with reality because, everything that happens in a dream is fake: My eyes seek reality\r\nAnd he wants to check if hes alive: my fingers seek my veins. No thats not drugs, its checking if he has a pulse. But i am new at  this so I dont no wut im talkin about.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI have to agree with all of you who say that this song is about forgiveness. Personally, I have always related to it. If i didn't know better I would think they were writing about me LOL. Its about someone who has realized that he has hurt those he loves and although he tries to change and be a better person he just can't. I don't think its about suicide, or homelessness necesarily, but about someone who wants to change who he is. and he wants others to forgive him for everything he's done to hurt them even if it was unintentional. \"so you bring this poor dog in from the rain, thought he just wants back out again\" about people giving him a second chance but he still can't help but go back to his previous actions.\n\r\ni really love the songs on load and reload (i know, its unpopular to admit that) because although they dont have the energy of the early albums they have such raw emotional power that it hits a chord deep inside. \n\r\nby the way i have the guitar book for this album and they have the lyrics as:\r\n-\"the net below has rot away\"  instead of right away\r\n-\"but nowhere safe from the storm\" rather than no one's\r\n-\"so as I write to you, of what is done and to do\" istead of dawning to do\r\n-\"my eyes seek reality, my fingers feel for faith\" not flame\r\n-\"so low the sky is all I see, all I want from you is forgive me\" rather than forget me\r\nAt any rate, thats what the lyrics in the book say, i think it makes sense if you listen to the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThis song, as most everyone else has said, is about forgiveness and about farewell. A man has ruined his life (not necesarily through drugs, some people can see a relation to drugs in a dyeper advert) and almost ruined the life of someone very close to him (his wife, I like to think). He is living on the streets as a beggar, and wishes forgiveness from this person before he says farewell to life. I think he actually does find forgiveness and not only that, but also desire on the other part to make a new start (so you bring this poor dog in from the rain). He, however, feels it's to late for him and he \"just wants right back out again\". \r\nIt's one of my favourite metallica songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\ni alwayz thought dis song was about drugs and alot of the sentances cxan relete to drugs but after readin all ur stuff i can see how it can mean drugs and alot of other things- excellent lyrics- good on ya jimmy!\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nWhoever the person from Cal State San Bernandino is, thanks...I will remember to not take music philosophy classes there in the future.\n\r\nAnyhow, what I think needs to be remembered about James' writing style is that a lot of what he has written about has come from his own personal experiences/demons.  Especially Low Man's Lyric (not Lyrics) and Mama Said.  I think it has a much deeper meaning than what has been mentioned here.  Also, a lot of what James has written has been put on paper merely because it sounds good with the song.  Watch the documentary \"Some Kind Of Monster,\" and you'll see what I mean.\n\r\nBut I definitely agree that it is about someone seeking forgiveness from someone.  Who?  Who knows.  Why?  Who knows.  Ignoring much of the benign first paragraph resembling lyrics from a hobo, the lyrics \"And I can't bare to see, What I've let me be\" define the rest of the song.  Whoever he wrote about, a definite \"something\" is missing from a life they would envision as being better.\n\r\nI will be perfectly honest, much of the song remains a mystery to me.  I think a lot of what he wrote into this song was written purely because it conveyed a sense of unhappiness and darkness to define the song.  Otherwise, it sounds like a homeless person who keeps reverting back to their wayward ways despite help from others.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nAll I can say is that i am nearly brought to tears whenever i listen to this song... Hetfield's interpretation of another man's pain is astounding, and he knows well how to communicate sorrow and depression. It's the same deal with Ulrich, who really pounds on those drums, as he were letting out all his passion and anger... this song cannot be interpreted without putting some soul in it, first due to the sad subject it treats, then as is suggested by the tone of the singer's voice, this song is liberatory and causes a particular effect, if heard when feeling down. Low mans lyric really touches your heart... as do many songs in Metallica's later albums, such as Mama Said or Unforgiven....\r\nIt seems that The evolution of Metallica's timeline, has lead the band to turn much of the early energy, anger and passion into the emotion, introspection and pain that their newer work bears.\r\nHowever i do not find this a song to seek out any particular meaning or message, as much as a song to be felt and appreciated. this is because if we are limited to the litteral meaning of the lyrics, and do not utterly taste the music's beauty, low man's lyric remains banalized... thanks for reading my humble opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\na FUCKING hard question?\r\nwhat's the best metallica song? if someone ask me i would tell without any doubt LOW MAN'S LYRIC\r\nits not Apotheosis, cause \"my eyes seek reality\"\r\ni think its fade in RELOAD. \r\nthanks for havin' comments about it\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nAccording to an article I read, the lyrics of the song describe a homeless man's thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\ni love this song. old metallica rocks but the new stuff sucks.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nAs always, I love this site; whenever I feel poetic or something I come on here to discuss what my favorite songs mean to them..wonderful...\r\nBut, not this time...\r\nDoes anyone else notice the dog barking, or cat meowing, in the background? I have the original CD, and it is there, I tell you...\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI always wonder what James' \"trash fire\" was when he wrote this song.  Just the random, rock star bullshit he's covered up his alcoholism with?  Something to help forget the past?  Yet not enough.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nfirts off james is a genius... when james says. my eyes seek reality... what the fuck is he saying.. well shit man maybe hes saying whats really going on is this real... my fingers seek my veins... am i alive is this a dream... a dog at your back step... a dog is a mans best friend... he will always be there for you... he must come in from the rain... hes always been loyal to you.. maybe james has always been loyal to some one and wants them to let him back into there life... \r\n thats just a little what i think....\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nwat i think...the song is abt a man...who has gone through some incident in his life whch must hve hit him emotionally....in turn he turnd to drugs....whch has messed up his life....And... he's thinking of suicide \n\n\r\n\"My eyes seek reality\r\nMy fingers seek my veins\"\n\r\nclearly states he is in need for drugs\n\r\n\"There's a dog at your back step\r\nHe must come in from the rain\"\n\r\nhe cant let go of the addiction\n\r\n\"I fall cause I let go\r\nThe net below has rot away\"\n\r\nhe has gven up on life\n\r\n\"The trash fire is warm\r\nBut nowhere safe from the storm\r\nAnd I can't bear to see\r\nWhat I've let me be\r\nSo wicked and worn\"\n\r\nthis is where he cries abt his life...\n\r\n\"So as I write to you\r\nOf what is done and to do\r\nMaybe you'll understand\r\nAnd won't cry for this man\r\ncause low man is due\r\nPlease forgive me\"\n\n\r\nAnd won't cry for this man\r\ncause low man is due   = suicide\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nAnd won't cry for this man\r\ncause low man is due = suicide note\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nalso to add a point the reason for his death is drugs again\n\r\n\"so you bring this poor dog in from the rain\r\nThough he just wants right back out again\"\n\n\r\nwhere he cant quit drugs\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThe lyrics are wrong. It's not \"what is dawning to do\", it's \"what is done and to do.\"\n\r\nThis is one of my favorite Metallica songs of all time. It's very emotional.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nHe sing's with great feeling about a heroin addict. \"My eyes seek reality. My fingers seek my veins.\" Every now and then he returns to his exlover's doorstep after a long run. \"There's a dog at your back step. He must come in from the rain.\r\nThe trash fire is warm. No one's safe from the storm.\" The rain and storm that he's reffering to is his addiction and his bitter life. \"The trash fire is warm\" is about the warmth he hopes to get from her heart to help deal with his pain. But because addiction is a vicious cycle, his forced to go right back out again. \"Though he just wants right back out again.\" He continues, \"So as I write to you, yeah What is dawning to do, yeah? Maybe you'll understand and won't cry for this man 'cause low man is due. Please forgive me.\" This is when he feels that it's the end for him in this world. He's in a never ending cycle that he can't break out of. \"I can't bare to see. What I've let me be. So wicked and worn.\" He does not see another way and want's to let her know that it's not her fault and to forgive him. \"Please forgive me.\" Absolutely fucking amazing!\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\njamz talkin to him self...and ask to him self forgivness...for wath is done to him...and demons still remain inside...........................from whiplash to sad but true to low man's lyrics...its so intense evry second of each fuckin songs gives me goose bumps...and im fuckin happy that metallica try somtin else cuz its not fuckin slayer will change on fuckin minutes....slayer same fuckin shit different years....yu fuck !!!\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\ni just bouht reload its one of the best songs on the album\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nyeah your guys interpretations are amazing!\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI am positive I know what this song is about and I will back it up. Thereâ\u0080\u0099s only one other review(Yisroel) that agrees plain and simple its about a homeless guy struggling with heroin addiction.\r\n\"My eyes seek reality, My fingers seek my veins\"\r\n-Some people think that people use drugs to escape reality, which is pretty much true, so this guy sees that his own reality is that of a drug-addicted hobo and needless to say heâ\u0080\u0099s not content. Next line he seeks his veins so he can alter his reality with dope.\r\nâ\u0080\u009cThereâ\u0080\u0099s a dog at your back stepâ\u0080\u009d\r\nWith reference to the dog, Iâ\u0080\u0099m certain thatâ\u0080¦dog = heroin. For one thing â\u0080\u0098dogâ\u0080\u0099 is a slang term for heroin(anyone can look that up). â\u0080\u0098dog at your back stepâ\u0080\u0099 = thoughts of getting high stay in the back of his mind, and he constantly â\u0080\u009cfallsâ\u0080\u009d = â\u0080\u0098gives into addictionâ\u0080\u0099 b/c â\u0080\u009che lets goâ\u0080\u009d = cant fight addiction anymore. His â\u0080\u009cnetâ\u0080\u009d = â\u0080\u0098whatever he used to keep himself from usingâ\u0080\u0099 â\u0080\u009chas rot awayâ\u0080\u009d = self explanatory. Next two lines as if he had just explain his situation says â\u0080\u009csoâ\u0080\u009d and then repeats first two linesâ\u0080¦meaning heâ\u0080\u0099s going to get high.\r\n-â\u0080\u009cThe Trash Fire is warmâ\u0080\u009d Iâ\u0080\u0099m certain â\u0080\u0098trash fireâ\u0080\u0099 refers to the â\u0080\u0098rushâ\u0080\u0099 one gets from mainlining smack. â\u0080\u0098Trashâ\u0080\u0099 b/c heroin is a dirty drug and trash is appropriate. â\u0080\u0098Fireâ\u0080\u0099 b/c fire can either kill you or keep you warm, just like heroin. Any junkie will tell you heroin, esp. the â\u0080\u0098rushâ\u0080\u0099, gives one a warm fuzzy feeling but too much can easily kill you just like fire.  \r\n-When he â\u0080\u009ctouches clean with a dirty handâ\u0080\u009d he takes a clean needle with a hand that intends to dirty it up with dope. â\u0080\u009cTouch the clean to the wasteâ\u0080\u009d =  touching needle to the â\u0080\u0098wasteâ\u0080\u0099 or heroin and sucks it up. Now if you notice when he says this line his vocal tone and back music is rather intense and next line when he says â\u0080\u009ctrash fire is warmâ\u0080\u009d his tone and back music abruptly changes to a more subtle tone, meaning he just got high. \r\nâ\u0080\u009cNo whereâ\u0080\u0099s safe from the stormâ\u0080\u009d = he cant go anywhere without thinking about getting high. \r\nâ\u0080\u009cWhat is done and to doâ\u0080\u009d = all the repugnant things his addiction made him do and the things to he probably will end up doing.\r\n â\u0080\u009cYou let this dog in from the rain, though it just wants right back out againâ\u0080\u009d = he keeps using like it will solve his problems, when really he knows no matter how much he uses the high is only temporary and when its gone heâ\u0080\u0099ll go right back to his sorrow filled reality. \r\nI am so positive about this b/c I used to be a heroin addict and this guy hit a lot of nerves close to home. Now I donâ\u0080\u0099t see any other review that backs up their interpretation with that much detail.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nAnyone please feel free to disprove my view point of this song\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nits about an old homeless dude, that has given his family and friends plenty of reason to hate him. he is laying there, pleeding to god for forgiveness. this could be becuase of drugs taken, which seems to be the feeling. \n\r\nthis is my favorite metallica song. it sounds nothing like their otehr stuff, but this hits a spot for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\njayzee had a point about the drugs but so did the rest of you with the feelings. i feel there both related cause its def about hitting bottom and dispare not much i given on how it came to pass. i feel its about usage and  the very end when all is done theres a momnet of clareity at the realization of whats been done and no matter how hard one try they just can't stop and begs for release\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nthis song is about characters from a series of stephen king novels called the dark tower series and other books that go with it.  low men control very talented people who help to break the worlds true power supply and some low men feel remorse for doing it but can't get away from the power above them.  \"And won't cry for this man\r\n'cause low man is due\r\nPlease forgive me.\"  the low men chases these talented people known as breakers and they know they are coming by looking for signs and no one will help the breakers or they will be killed.  also the remorseful low man asked also for forgiveness....or it could be about a homeless guy\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nthis is my fav. metallica song ever..and one of my fav altime songs... the meaning to me was always obvious so I am more looking at the album at whole...reload... I thinkthe music is very tecnicle in this entire album...not so raw..more than just a bunch of power chords and heavy solos...more musical...and then in this song the is a violen playing alongand in my opinion I think this is probobly the most musical song metallica has done to date...\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI think everyone can interpret the song differently and be right. Its a very philosophical song. \r\nas usual the hero of this metallica song just like of many other songs is an outcast. S/he's a very humane or 'good-natured' person who cannot addapt to stark reality, society and it's material values. It doesn't necceserilly mean the hero is a hobo or an addict. Sometimes everyone can feel like a low man, especially in the presence of an illness, death or any other despeate situation that you haven't control of. So this song may be about any eldery, disabled or simply depressed person who has a lot of regrets about wasted time, opportunities. 'Veins' may imply the flow of life, past time. 'The storm' may imply any accident or disaster. As to 'i fall cause i let go': many of us promise ourselves to 'give up smoking' or 'having junk food' or 'start spending more time with the ones we love' but eventually a rare delivers the promise and...one day regrets. If today was the last day, i'm sure everyone (maybe except 'the lost generation') had some regrets  and wanted somebody to forgive us. As to 'the trashfire is warm': the working class or even christian values may be hidden under the phrase because a rare can boast about possesing posh mansions and limousines yet meets the basic  needs of food and home. Finally, every man is due because everyone of us is mortal. It is one of my favourite metallica songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nThis song is the only song I have encountered that sounds like it is being performed in the same depressed state that it describes. It really is just...low.\n\r\nI think it is among their best songs. Without a shadow of a doubt. And I like all the interpretations, but I prefer to just focus on the raw emotion than the lyrics for this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nSorry, I meant\n\r\nAnd I cry to the alleyway\r\nConfess all to the rain\r\nBut I lie, lie straight to the mirror\r\nThe one I've broken, to match my face*\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nit's a beautiful song aout forgiveness, this song brought a tear to my eyes a few times, so sad. :(\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nbefore I thought the lyrics were,\r\n\"Baby you understand and won't cry for this man cause no man is doomed\", weird. XP\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nit's obviously about a junkie/addict living on the streets and in a very bad condition, (maybe withdrawal) and he's asking for forgiveness.\n\r\nBTW what a para this was and james sung it so good:\n\r\n\"So low the sky is all I see\r\nAll I want from you is forget me\r\nSo you bring this poor dog in from the rain\r\nThough he just wants right back out again\"\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\n\"\"And I cry, to the alley way\r\nConfess all to the rain\r\nBut I lie, lie straight to the mirror\r\nOne I've broken, to match my face\"\"\n\r\nand I just luv the way James sings these\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\ni hear this song when i feel really sad -like shit- , when i feel like saying fuck this... i am going to live to tumbuktu.. and it helps me to chill\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nthis song is about a homeless who is writing to his family to forgive him for the drug use and redemption for his acts\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI think this song is about someone james new who got into drugs. \t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nsomeone wanting forgiveness.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI think this song is about sin and asking for forgiveness. He says himself, \r\nSo, you bring this poor dog in from the rain\r\nThough he just wants right back out again\r\nMeaning he wants forgiveness despite the fact he'll do it again.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI hate to do this to everyone but this is about an IRA bomber - James has sympathies & even puts on a bit of a irish accent \"And I cry, to the alley way, Confess all to the rain\"\r\nBy writing, he's arranging another attack because its in his veins but he now feels sorry for all the death he's caused.\n\r\n...or it could be about a remorseful old tramp!\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nthis is a heroin addict's suicide note.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nAll i know is that i am not a metallica fan, far from it, but there is a handful of songs i like and i can safely say this is the best of them, it simply strikes a tone with me and i can relate to alot of what sort of feelings are being expressed, but also to parts of the text.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nScholar my ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\ni feel like the part \"\"trash fire is worm but nowhere safe from the storm\"\" may refer to joy of this world or even alcohol,that is good,but it can easily be ruined\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nWith all the references to veins and looking worn, seems like he's talking from a IV user's POV. Likely, a heroine user, but other drugs would have the same long-term effects. The dog references may be a depreciation of self and a metaphor for \"you can't teach an old dog new tricks.\" Basically, rehab isn't on the radar and the person keeps searching for the next high.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nChaseKenderes,     that is what is says.   it says ,  the net has rot away\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nUnless Metallica themselves come out with the meaning, it's all interpretation. I want to offer something different from the \"drug\" or \"suicide\" angle.  What if it's just about a guy that's an asshole.  Hear me out.  You also have to assume, because of the lyrics later, that there is a woman in his life.\n\nThe first verse that repeats.  \"His eyes seek reality, his fingers feel for veins.\"  Could this be to mean he seeks his meaning and life, veins are the conduit for blood that is the life of the body.  In the context of the first verse, \"there's a dog at your back step, he must come in from the rain\" He could be an asshole, hence dog, and come in from the rain could mean to change his life.  Seeking reality of a new life, fingers feel the veins, checking the pulse to see if it's there.  The woman eluded in lyrics ahead is giving this asshole a chance.\n\n\"I fall â\u0080\u0098cause Iâ\u0080\u0099ve let go\" simply, this guy doesn't care about anyone or anything.\n\"The net below has rot away\"  what caring there was in the past is no longer there.\n\"So my eyes seek reality, And my fingers seek my veins\" again his eyes might \"want\" this new life, but there might not be a \"pulse\" there, hence no life.\n\nThe whole \"trash fire is warm\" part of the song I attribute to just this guys life roaming around, each place is warm in his comfort zone, but he causes problems everywhere he goes \"no where's safe from the storm\".  He could be an older man now who is starting to get tired of it and tries to change \"can't bear to see what I've let me be, so wicked and worn\".   \n\nThe next part we assume \"so as I write to you\" he's writing a Dear John letter to the woman that took a chance.  Like he's done in the past, he probably used her for his benefit, \"what is done and to do\" and is moving on.  He hopes that she'll understand that in the end, sometimes you simply just can't change people, and she won't \"cry for this man\"  I struggle with \"because Low man is due\" because in any context, what is he due, other than failure.\n\nThen we have \"Touch clean with a dirty hand, I touch the clean to the waste\"  I interprete this, in the context that this is just about some asshole man, that in his new life, he's cleaned up, stable, but his past \"dirty hand\" is still there.  Again, \"my eyes seek reality, my fingers feel for faith\" His eyes still seek this new life, but with no pulse previously, he looks to faith to help change him, which ultimately fails.\n\n\"So low the sky is all I see.\" This person he is with was a really great person, and he feels especially bad for causing the pain that he did, he's at his lowest point.  \"All I want for you is forgive me\"  speaks for itself, but then he does a complete 180 with \"so you bring this poor dog in from the rain\" she gave the man a chance, \"though he just wants right back out again\" but in the end, he just wants to continue being an asshole.\n\n\"And I cry to the alleyway, Confess all to the rain, But I lie, lie straight to the mirror, The one Iâ\u0080\u0099ve broken to match my face.\"  I see this as actually triumph on the Low man's part.  Think of it like the ending of Shawshank Redemption when Andy breaks through and he's crying in happiness in the rain. Low man confesses what he is unapologetically.  The mirror is what he was trying to be, but he breaks it because he can't be that man, thus the broken mirror is who he really is.\n\nThat's my take, it may not be as deep as other people or as dramatic, maybe it's just not as deep as it's made out to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nThis song touches on multiple subjects including addiction, homelessness and forgiveness but primarily conveys a sense of regret. The protagonist desires forgiveness not only for what he has done but what he knows he will continue to do.\n\n\r\nSorry this will be pretty long...\n\r\nMy eyes seek reality (He tries to see the truth)\r\nMy fingers seek my veins (He feels for his veins, so he can stick himself with a needle)\r\nThere's a dog at your back step, He must come in from the rain (He tries to find shelter from the harsh conditions he finds himself in\r\nI fall 'cause I let go (He gives up)\r\nThe net below has rot away (Nothing/no-one is there to catch him as he falls, all his chances are up)\n\r\nThe trash fire is warm (The only comfort he has is that of a trash fire giving him heat and light)\r\nNo one's safe from the storm (No-one is safe from the effects of drugs)\r\nAnd I can't bare to see, What I've let me be, So wicked and worn (He himself does not know who he has become and shows fatigue from the abuse of drugs)\n\r\nSo as I write to you (He is writing the suicide note/letter)\r\nWhat is done and to do (What he has done in his life, and what he is going to do to end it)\r\nMaybe you'll understand (Understand all the pain he has been through)\r\nAnd won't cry for this man, 'cause low man is due (He is not worth your tears)\r\nPlease forgive me (Self explanatory really, he wants forgiveness)\n\r\nTouch clean with a dirty hand (He is cleaning the needle)\r\nI touched the clean to the waste (Injects the â\u0080\u009ccleanâ\u0080\u009d needle into his â\u0080\u009cwastedâ\u0080\u009d skin)\n\r\nSo low the sky is all I see (He is in his grave looking up)\n\r\nSo you bring this poor dog in from the rain,\r\nThough he just wants right back out again (You can give him shelter and put him in rehab, but he just wants to get back out there and look for his next fix)\n\r\nAnd I cry, to the alley way, Confess all to the rain (With no other shelter, he rests in an alleyway and confesses his sins in the form of the note/letter)\r\nBut I lie, lie straight to the mirror (He even lies to himself that everything will be alright)\r\nOne I've broken, to match my face (His abuse of drugs has taken its toll physically)\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nI first hear a demo of this and it was just instrumental. It sounded awesome. But when i heard the album version with lryics, it but a whole new spin on it. Hetfield's \"Tourted soul\" lyrics are always full of emotion, but in the one especially. I agree with weaselfierce about the song meaning about a guy who's trying to be helped and regretting not taking the help later in life. \t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nthis song fuckin sucks\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nman this shit is so fuckin gay he sounds like a fuckin queer\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nU R ALL WRONG!!!!! THIS SONG IS ABOUT A GUY WHO JUST BOUGHT A DOG BUT HIS DOG DOESNT LOVE HIM COS JAMES HETFIELD CHEATED ON HIS DOG WITH THE DOG ACROSS THE ROAD!!!!!!! LMFAO!!! NAH JK THS SONG ROCKS!!! METALLICA ROCK!!!!YH ITS ABOUT A HOMELESS GUY RIGHT ON TEH EDGE AND THE DOG IS A METAPHOR OF HIM!!\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nOk, what this song is really about is free spirited speed freak, someone that sees beyond what others see, someone who's mind is open and sees what is real. he is a powerful spiritual being, and a healer (touch clean with a dirty hand) he has a girlfriend and a place to live, he is not some bum on the streets! but he chooses to go out, run away and go on meth runs because he feels it empowers him, but there is always a price to pay, and he always feels guilty afterwards, so he is asking his lover for forgiveness, he writes her letters before he comes home. she brings him back home and gives him another chance (you bring this poor dog in from the rain, but he just wants back out again) , but eventually he goes back out to using, shooting meth (my fingers seek my veins), he buys his dope from some dude in an alley (i cry to the alleyway), he loves rain because he feels like it cleanses him, (confess all to the rain), he is an addict that is in denial, but he has so many gifts! (i lie straight to the mirror, the one i've broken to match my face), him going on a run means he doesn't come home, but he is ok, he just wanders, (the trash fire warm - a metaphor for that he is warm, alive, and ok) and (nowhere safe from the storm - the storm is himself, his addiction) no matter where he goes, he is not safe from his own addiction... why would someone think this about some fucking bum! that song would include a cardboard box and a bottle of gin! This song is beautiful and very real! I personally know JH and he explained this all to me... Hope this helps!\t\t\t\t\n\t\t\t\t\n\n"}