{"comment_0": "\n\"this song is not about LSD. it's about a picture john's son brought home that he drew of his school friend lucy. it was lucy, in the sky, with diamonds. john didn't realize it was an acronym for LSD until *after* he wrote it\"\n\r\nHeh.  Sure.  I believe that.  These guys were known for BSing... I've seen some videotaped interviews them where some of the comments they made were just hysterical.  That line is typical of Lennon's creations.  This song is all about drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIf you've ever done LSD. You would know that this song, is not about drawing, or some girl named Lucy. Its about fucking acid.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nis it really that big of a deal if it is about drugs?\r\nstill a good song.\r\nabout lsd or not\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nwell after tripping yesterday and having john sing this song directly to me, i can safely say its about a picture john drew in his head...while tripping on lsd.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI was told it's about drugs and being high LUCY in the SKY with DIAMONDS=LSD of course there's other interpretations, but drug use is just too obvious to not be one.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nyeah, what a posted before was probably something like \"this song is not about LSD. it's about a picture john's son brought home that he drew of his school friend lucy. it was lucy, in the sky, with diamonds. john didn't realize it was an acronym for LSD until *after* he wrote it.\" okay. now everyone knows.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\none thing about this song is maybe it is a painting that his son made, but jon did do lsd and this song is very LSD sounding its up there with tommorrow never knows, the picture didnt show girls with kaleidoscope eyes or tangerine trees and dripping past flowers so eiether hes got one hell of an imagination or he was trippin. And second who cares if he did write it on LSD, do you like the song? then it dosent matter he made it, its amazing and people loved it. so dont fret...\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nand yeah the beatles always fucked around during interviews. they got a kick out of fucking with the media and their reactions.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nOh god there are so many either idiotic adults who grew up in the 70s/80s or really naive people who are in their 20s or younger (which I'm only 21).. Most here get it the meaning behind this song halfway, actually everyone here get's the full truth exactly halfway but the ones who say it is about LSD are the only ones who actually listen to it for themselves and interpert it correctly, rather than say its not about LSD (where did I see someone say defending the beatles by denying their drug use?) Listen to all their songs, from their first album listen to the lyrics hard, keep listening to the albums notice the progression of their music, or drop some acid or some type of psychedelic (no drug, psychedelic, big difference between an intoxicant and a psychedelic BIG DIFFERENCE) The Beatles dropped acid, all four of them, there wasn't denying it amongst them. 1965 began the entire explosion in musical creativity the beatles are well known to have made the first psychedelic rock album (mainstream among millions of fans, just as LSD was reaching millions of people).. They may not be saying outloud on their songs LSD LSD LSD, but take one damn listen to half their songs during that 5 year period. \"Tomorrow Never Knows\" prime example is probably the most obvious song about the psychedelic experience.\n\r\nAnd when I say your all HALF-RIGHT.\n\r\nJohn Lennon's story is true, that was what sparked the idea, however they spun it into a song purely about LSD from that picture since the picture was of Lucy in the Sky with Diamonds, that shoots out of the page from the combination of words. Lennon wasn't lying when he said that was how the song was made, and what it was about, because his son really did. However look at the damn lyrics.. \n\r\n\"NEWSPAPER TAXIS APPEAR ON THE SHORE\r\nWAITING TO TAKE YOU AWAY.\r\nCLIMB IN THE BACK WITH YOUR HEAD IN THE CLOUDS\r\nAND YOU'RE GONE.\"\n\r\nIf you cannot realize the clear connection that that phrase is about taking a hit of lsd, than you i feel sorry for you all who really are missing out on the beatles, even mcartney and ringo stated the song was obviously about lsd publicly, this one is probably one of their most obviously about psychedelic use, not their only one there are subliminal's in so many of their songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nIt was a well known fact that Lennon was a user of LSD, and I think that the song was written about one of his trips.\nI also think the drawing theory was a way for them to say it wasn't about LSD because drugs were a bit more taboo at the time. In recent years, drugs have become more accepted, so McCartney probably felt that telling people it's about LSD wouldn't get as negative a reaction it might've gotten back in the '60s and '70s.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nSteve Turner, author of the book â\u0080\u009ca Hard Dayâ\u0080\u0099s Nightâ\u0080\u009d, the songâ\u0080\u0099s producer said that\n\nâ\u0080\u009cThe imagery in the song is partly a reflection of Johnâ\u0080\u0099s drug experiences, and partly his love of `Alice in Wonderland,â\u0080\u0098â\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nYou guys are all reading way too much into it. Who cares what this song is about? In my opinion it's still a good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI don't care what they were on. These lyrics put a massive smile on face everytime. And the music is amazing as well. Reminds me of the only the finest dreams. Instead of analyzing and looking for hidden meanings, i'm just reading it straight up, and visualising this magical and magnificent place. ahhhh take me away............\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nWhether or not John intended to write a song about the LSD experience or not, the lyrics and music are full of references.\n\r\nIt is a song about the LSD experience I am afraid.\n\r\nIt wouldn't be beyond John to throw out a red herring or two (Norwegian wood, Walrus.\n\r\nJohn may have started writing a song about a child's colourful view of the world inspired by his son's painting, but that wasn't where he ended up.\n\r\nI am no big fan of Macca and I think it's typically naive of him to believe that this songs has no references to LSD in it.  \t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI'm getting sick of these hardcore Beatles fans saying that none of their lyrics are about drugs. most rock & roll bands did this back in the 60's make songs about their drug usage and experiences These lyrics are clearly about taking a 'trip' and could describe the visuals u get when u take LSD and then all of the sudden it's a coincidence that LSD is in the title of the song  come one get real. what u gonna say next that the line 'i get high with a little help from my friends' is about climbing a mountain ? and 'fixing a hole' is about fixing a roof ? lol  There were others but those are definitely the most obvious ones . and if u believe that story john said about the drawing it's just a cover up story cause back then it wasn't OK to spread those kind of things in music for the public  and what did u expect john to say  oh yea it was all about LSD big deal  u know he couldn't just admitted it without getting away with it back then they would have trown everything at him in the news and stuff  like when the jesus incident happend\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI have looked occasionally at these lyric meaning sites, curious about how people interpret Beatles music.  I am somewhat amused at how clueless most people seem to be.  Not that I am anybody special but I came of age at the peak of the Beatles' popularity.  \nThe Beatles were trying to turn people on to great esoteric truths, things which cannot always be taught directly.  The Sargent Pepper Album was very much about that.\nI do not think Lennon was lying when he said the song was inspired by his son's drawing, but the song was certainly about more than that.  \nSomething that commonly occurred when using psychedelic drugs, especially with  groups of people who were close was a certain flowing together of personalities and a sort of \"ego loss' where the oneness of existence is perceived.  This may sound like gibberish, but if it ever happened to you it would be clear to what I am referring.\nNow let me relate what I have just said to the lyrics of \"Lucy in the Sky\"\n\"the girl with kaleidoscope eyes\" - the nature of a kaleidoscope is a tube with many mirrors.  You look in and the mirrors cause the bits of colored glass or plastic to form brilliant patterns.  The word eye sounds the same as the word I.  Kaleidoscope \"I's\" could refer to perceiving the world as a million reflections of yourself.\nPicture yourself in a train in a station with plasticine porters with looking glass ties.\nIt seems the picture being painted is of railway porters with neckties with mirrors on them (looking-glasses).  But the word tie has more than one meaning; it can also mean the ties between people, that which connects them.  Porters conduct people from one place to another.  In other words when you perceive the tie between yourself and another it is like looking into a mirror.\nIf you think I am off the track just look at how much of the Beatles music returns to this theme.\nJust some thoughts on this subject.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nSorry to shatter the dreams of people who think that the beatles would never write a song about LSD (i joke) but Sir Paul admitted himself that this wang was about LSD. news.bbc.co.uk/2/hi/…\n\n\n", "comment_17": "\nObviously, the song is about some girl named Lucy Uchiha, who has the Mangekyou Sharingan.\n\nI mean, she has kaleidoscope eyes. Obviously Mangekyou.\n\nCellophane flowers of yellow and green\nTowering over your head\n\nThose lines are the Susanno. Cellophane is a type of wrapping material that it thin. Like chakra. The susanno is a giant chakra construct that wraps around you and towers above everything.\n\n\nThe sun in her eyes? Obviously Amateratsu, which is a fire from your eyes named after the Sun goddess.\n\nAnd then she's gone. She must have used kamui, which teleports the user.\n\n\nOver all, it shows that the girl is an Uchiha with the Mangekyou Sharingan.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nYes, it is ALSO about lsd..but what all of you have forgotten  is the following...Lucy in the sky is a ,metaphore for lucifer.Diamonds are also used to refer to lucifer..you can all look it  up....So..this song is also abut luciferianism...luciferians believe that they should work their way towards godhead...aknowledge their own godly state...to shine like a diamond or rise like a Phoenix..all phrases used a lot lately..look at the music industry...lol see what rihanna sings...shine bright like a dimanond..she is also referring to lucifer.....\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\n\"Lucy in the Sky with Diamonds\" Take a closer look at the 3 capitised letters in the song's title... (Psst It spells out LSD)\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\n\"Rocking horse people eat marshmallow pies\"? God, that drug he was on must have been so powerful! But if they're embarrassed of where the song is inspired from -the drugs- they wouldn't have released it, would they? Maybe a drawing set off the images, and some drugs made it more surreal...\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI was listening to Phantogram's \"When I'm Small\" on iTunes radio today, and I was guessing it had something to do with drug withdrawal based on the word \"Lucy\" alone, so I came back to look at these lyrics. \n\nFirst of all, how funny that there are Beatles drug deniers on here! I mean, come on! I don't like drugs either, but can't pretend it doesn't exist. It is amazing what people will do to facts...\n\nBut actually, I just wanted some quick clarification on this:\n\n\"Newspaper taxis appear on the shore\nWaiting to take you away\"\n\nI recall hearing LSD was served up on little paper strips, I assume that's the newspaper taxi? Was it ever on newspaper strips? And is the shore something specific? Or just more imagery? Not critical, am just musing.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni prefer the elton john version\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nTo be honest I prefer Elton John's version.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nabout drugs? a picture Lennon's son painted? Correct me if I'm wrong guys but my reading of it is a woman, lucy, in the sky, with diamonds. this fits in with a newspaper taxi that always appears on the shore of a lake and everyone smiling at you i think alex fuckrod got it right when he named himself and everyone else doesnt fuck ing LSD don't make me laugh pounds shillings and pence and that stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nwell said weezerific, I was going to post that just now.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis was the first Beatle song i heard. it is still one of my favorites.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThe day somebody writes a song as good and well crafted as this John Lennon will come back to be his slave!\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nIt is NOT about LSD.  John even said so in the last interview he gave to Playboy in December of 1979.  Sorry folks, it just isnt so...\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nwho cares if it's not?  it's not like it's any big secret that they all were heavy drug users.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nhaha I know!  All you need to do is watch the videos Magical Mystery Tour or Yellow Submarine\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nMy point was that John said that a number of his songs were drug related (Cold Turkey, Happiness is a Warm Gun, Tomorrow Never Knows etc.).  Why would he lie on this one song.  He always seemed like a fairly truthful person in life...maybe this is his 'joke' to Beatle fans...\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nBite Me quit posting your incoherent, drug-obsessed ramblings you leathery, slack-titted gorgon.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nBite Me...Calm.  Down.  Calm.  Down.  Deep.  Breaths.  \n\r\nYeah.  They weren't open about it around the time of LHCB.  Sure they weren't open about drugs.  Yeah, okay, right.  They were pretty damn open about it...\n\r\nBut to anyone who says that this song has no drug-related or -enforced imagery...they also claim full innocence in the Paul is Dead hoax.  Hmm. \t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nthis is one of these songs that can be interpreted in different ways.  maybe john lennon was thinking about LSD in the back of his head.  WHO KNOWS!?!?!?\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\njohn's son julian came home from school one day with a watercolor. his sons had drew a picture of his friend lucy flying through the night sky. the diamonds are stars and lucy is literally in the sky with the diamonds. now the rest of the lyrics might have been written ON lsd but not ABOUT lsd. \"plasticine porters with looking glass ties\", \"rockinghorse people eat marshmallow pies\", \"tangerine trees and marmalade skies\", etc. not inspired by lsd but may have been written on lsd\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nretsyn may be right guys.  it doesn't seem to me that lennon had any reason to keep drug use in the dark.  i've gotta blieve that maybe this song was written when on lsd and not (wholeheartedly) about lsd.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\na good reason to keep it in the dark would be that drug use wasnt socially accepted in the 60s, just like it isnt now. he prolly just wanted people who could connect with him to get it. to everyone else... they didnt need to know. so if any of the conservative americans made a fuss, what could they do?? there's no proof, just press comments that wrap around eachother and lead to nothing.  BiteMe, i guess i'd have to say i agree with you... and by the way, nice try at inspiring an uprising... yea... that backfired. So basically this is an AWESOME SONG, whether you take it to be about drugs or not. personally i think it would be wonderful if you could get to a world like this without drugs... i guess john kinda does that with this song. ok said to much, later\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\njohns up in heaven laughing his ass off because some schmucks actually believed his lame story about how its not about lsd.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nhmmm.....i'm gonna drop some acid and watch yellow submarine right now...\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nhah, this songs great, i love it!  but yea, its about lsd, i mean, look at the lyrics.  but its still a cool song\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nIt sad how everyone needs to relate this Beatles song to drugs when it's clear this is just describing John's son's painting of his friend Lucy in the sky with diamonds.  What if I took you kid's drawing and found all the unitentional drug references in it? \t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nthis song has no unintentional drug references in it.  i agree with pj10...anyone who honestly believes lennon wrote this song because of a painting his son did is a shmuck.  all four of the guys were constantly giving bs interviews and were labled in the rock world as compulsive liers.  im not saying all their songs have drug references in them, if they did, they wouldnt be my favorite band.  not even more than a few have drugs in them.  but, this one does, you shmucks!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nNo offense to you guys, but a lot of you are idiots!  John Lennon clearly stated that he wrote this song because of his son's picture, and I don't see why anyone should doubt what he said.  Yes, he did drugs, but he was open about, and he wouldn't secretly write a song about LSD.  Don't you guys remember that Paul McCartney got himself in a mess because he stated that he had done LSD before?  They did it, but they didn't lie about it. While John may have come up with some songs while being high, none of his songs are directly related to drugs.  He didn't advertise drugs. Yes it is obvious that they were high while filming Magical Mystery Tour, but that doesn't mean that the movie is about drugs.  Why can't people focus on the music instead of the fact that they had drugs.  If any of their songs were written while they were high, who cares!  That doesn't make any of their songs less genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nretsyn has the best opinion on this.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nTonyRo2, there not saying that his sons drawing was all druggy and shit but the other parts of the song, WHENS THE LAST TIME YOU SAW NEWSPAPER TAXI'S APPEARING ON THE SHORE.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\neveryone reads too much into this song... just accept its an amazing song with beautiful lyrics. who cares if it really is about lsd or not?? its still great \t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThis is the first Beatles song I ever heard and it is my favourite one! It is kinda cool that it spells out LSD, even if it doesn't have anything to do with it. The lyrics are cool. I think I'll name my daugher Lucy:)\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI don't know guys, why isn't John Lennon allowed to have a vivid imagination? Before LSD was around people were writing abouu fanciful images like this.  It kind of reminds of Lewis Carrol and Alice in Wonderland and Through the Looking Glass in its imagery.  Maybe its just me.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nhas anyone seen 'I Am Sam'?  They sort of explain this song in it, and they go with the kid's picture theory.  maybe it's because they didn't want to use the LSD theory, but i thought it was kinda cool when i heard it,  since i had always figured it was about acid.  well i'm rambling...\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nLucy in the Sky With Diamonds was indeed inspired by Julian Lennon's picture of his classmate Lucy in the sky with diamonds.  Even the drug theory was debunked at snopes, one of the best urban legends sites out there.  Not to mention the fact that even in 1980, when Lennon did the Playboy interview, John was still adament in his statement that Lucy in the Sky with Diamonds came from his son's picture.  They even have the picture at snopes.com if you want to see it for yourself.  Even a childhood and lifelong friend of Lennon, Pete Shotton, has backed up Lennon's explanation.  Whether the song lyrics in the song itself were what John saw on an acid trip or whether he was just writing another imaginative nonsensical song, that is your interpratation.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nwhy does everyone think this is about lsd-the man was brilliant with out drugs and how any time it comes to the beatles-with most of their songs-people always say drugs as their first guess or comment,ya they took alot of drugs,but they were still musical geniuses,they wrote revolutionary music and changed it(music,didnt want to use it again,said it to many times already) forever.the beatles rock and their music and lyrics will live on forever!\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\n            - EVERY SONG IS NOT ABOUT DRUGS!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nhaha beatlesfan1 you are an idiot! your idiotic comment made me fall down laughing!! of course they covered up doing drugs!! its just like strwberryf1ld said it wasnt socially acceptable. the beatles were the most popular group at the time it wasnt \"right\" for \"role models\" to be open about drugs. and i totally agree with pj10 johns laughing at all of you who believe in the theory about his sons pic. thats sooo lame you really think john lennon (a drug user) would write a song with so many \"coincidental\" drug remarks. i seriously doubt its all one big concidence... ohh i didnt know lucy in the sky with diamonds had the letters LSD in it and i also dont use lsd its all lies lies and more lies. please dont be schmucks and believe lennon about the pic. unless you also want to believe pamela anderson got hepatis from a \"tatoo\" needle and britney spears boobs are real... get it through your head celebrities and musicans lie all the time and theres nothing wrong with it!! oh ps. notice everyone who thinks this song is about lennons sons pic. are the people who were born when drugs were socially unacceptable just something to ponder hmm....\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nfelissa, i hate to pop your bubble, but the writer of alice in wonderland was an lsd addict\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nTHANK YOU an outcast slug! I was laughing so hard when she wrote that! Carrol was constantly tripping in fact one the people he tripped with was C.S. Lewis I think.... Okay and all the people who say this song is not about drugs or at least wasn't influenced by drugs are dumb. Maybe you know it wasn't about drugs but he definetely had to be on drugs to see all this from his son's picture....\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nlol, i'm one of the ones who think it's about lsd.so sue me.no, wait,don't, i'm like minus 25 bucks coz my mum bought my last cd....and they were openly on drugs but let's face it, there's prejuduce against what kind of drugs you use- like pot v. herion, the pot head's gonna get off easier(socially) than the herion junkie.and with the picture thing, this is probly way off base, but he could've been being even slyer because , you know, lsd and blotting paper?ahh well, just don't flame me on that, only speculation.it's just a cool song. \t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nBottom line is, and read the Beatles Anthology if you don't believe the story, they are quite open about when and how and how much they used drugs, and what drugs they used. The title Lucy in the Sky with Diamonds IS a coincedence, however. The whole story about his son Julian is where he came up with the title. The rest of it..is probably anyones guess, though John did trip a couple of times in the studio while recording. My guess is, though, they were all pretty wacky, with or without the LSD. Anyone who says Lucy in the Sky with Diamonds was MEANT to stand for LSD would be very wrong. \t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nwhoever doesn't like this should be smack upside the head. now lets hear it everyone...\r\nyaaaay!\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nLewis Carrol never used LSD. Mushrooms, perhaps, but never LSD. LSD didn't even exist when he wrote Alice in Wonderland. Mushroom use wasn't even common back then, especially not in the area where he lived. Lewis Carrol may have smoked some opium in his day, whether or not he ever did cannot be proved that I am aware of... However, it is fact that he never had LSD, and all signs point to him never having used mushrooms or any other psychedelic drug. Plus, he couldn't be an LSD addict, because LSD is not an addictive drug. :P\n\r\nHowever, Lucy in the Sky with Diamonds... whether or not it was directly and originally inspired by LSD... was definitely touched up by LSD somewhere along the lines. Listen to the Beatles pre-psychedelia, and post-psychedlia... there's a world of difference. The drugs didn't make them creative, they had that already... but the drugs did help them make their creativity more visionary. To say drugs didn't effect their music at all would be ignorance.\n\r\nAnd perhaps his openness about the topic being drugs in other songs is because those songs paint a more negative picture of drug use, as they deal with more serious drugs... LSD is a recreational and fun substance with no extreme ill-effects aside from making people a little weird when they use it a bit too frequently, and schizophrenics who haven't shown symptoms yet tend to begin showing their symptoms after dropping acid.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nConsidering their history for liking tripping and how trippy this song is, it's about LSD.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nhaha thank you misDKfits!!! you are so right!\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nWhy does it matter so much what it's about?\r\nIt's a cool song, why can't it just be left at that? \r\nTake it how you like. Music should be a personal experiance. It has its own meaning for the writter and its own meaning for those who listen and enjoy.\r\nListen, enjoy and take away from it what you will. LSD or not...\n\n\n", "comment_63": "\nyer this is definatly about lsd and it has no other meaning, like in those days they werent aloud to sing about drugs, so they had to make up codes and thats what theyve done here \"Lucy in the Sky with Diamonds\" just gives it away from the start\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI think maybe the 'Julian's Picture' story is true but that doesn't mean the song isn't about LSD, it just means that's where he got the name from. The lyrics are so trippy, it's got to be drugs-related in meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nRead what Duckfetus said, it's so true.\n\r\nAnd I think it's funny when people say \"Who cares what the song is about?\" lmao.  This is Songmeanings.net, not MTV.com.  It's good that people argue, and have different opinions about peoples songs.\n\r\nAnyways, great song, I think you're deaf, and blind if you don't think it has something to do with drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nThis song cannot be about LSD. Have any of you ever taken LSD? You don't experience full-blown out-of-reality hallucinations such as what this song presents (if they are even hallucinations at all). My guess is that it is either induced by another drug, or inspired by a child's picture as \"John\" proposed.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI can understand what a lot of people are saying about this song and some excellent points have been made. First of all i believe that the song was about LSD and that because it wasn't socially acceptable for the Beatles to be open about this Lennon invented the story about the picture. Secondly i agree that it is irrelevant anyway. People should gather their own interperatations from music and see the song through their own expeiriences.\r\nBy the way-The guy who wrote about Pamelas Hepititis and Britneys boobs, i salute you...that was a great point.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nWhen I think of comparing celebrities, I definitely think of comparing John Lennon to Britney Spears or Pamela Anderson.  Bottom line is, I still don't think that Lennon wrote it about LSD (I have never taken drugs in my life and I've written some really weird shit because it amused me), but I won't rule out the possibility that that is what it's about.  Kinda reminds me though of how people are saying that the Wizard of Oz (the book version) was written as a political tract, when there's nothing to substantiate that that was Baum's intention, and when in fact Baum himself said it was a children's story in one of his forewords and wasn't meant to be deeply analyzed.  My whole point is, you can take any song or piece of work and twist it into anything you want by just pointing out a few parralels (like how my friend is trying to convince me that Hobbits are potheads--they smoke all the time, they eat all the time, and they hate travelling.)\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\njohn lennon may have been on LSD during the course of the beatles era, but this song definitely isnt about that. it is about a picture john's son drew that had skies with diamonds in it.  this is definitely my favorite song ever, it seems to just take you away when the first \"lucy in the sky with diamonds\" is sung.  it is one of those songs where it has no exact meaning, but anyway you interpret it is right.  i am a huge beatles fan and this song turned me into an even bigger one.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\ni say it does not matter..maybe it has no meaning..maybe it was a pic julian drew..maybe it was about LSD..we could argue for years..why cant we just all agree on one thing..its a good song\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI love you DuckFetus...you're a very smart person. But if anyone here has ever tripped they would know Alice in Wonderland would have to have been written under the influence of something! You dont come up with some of that stuff unless youre messed up trust me\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nHow could this not be about LSD, when he says \"LOOK FOR THE GIRL WITH THE SUN IN HER EYES AND SHE'S GONE.â\u0080\u009d she wouldn't disappear is she was drawn. When you are tripping its very typical that things appear and disappear. \r\nIt's known that they were on LSD at times, what kind of coincidence it would be that LUCY in the SKY with DIAMONDS could stand for LSD. \r\n-michele\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\ni've been told a lot of things about this song.  my dad told me that it was about drugs, so that was my first perception of the song.  Some of my friend's dad's told me that it isn't, it's about a painting.  I've seen pictures of the painting, and i've heard a lot of comments about the song (i read this forum, for one) and i still think it's about drugs.  I don't want to sound like a drug-obsessed lunatic, but it makes a lot of since for it to be about drugs.  The whole part about kaleidescope eyes and the girl dissappearing.  All of the little images you conjure up when you hear the song seem to have to be about drugs.  Also, LSD is a hallucenogenic (please pardon the spelling) drug, and it sounds to me that a lot of the stuff in the song is stuff you might see.  \r\nok, that was just my little bit on this song.  Thanks for listening.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nyea maybe the son that drew it, drew it about lsd, solve that one\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI went to a Grateful Dead show in Chicago in 1994, and they opened the second set with this! John is my favorite Beatle, and it was so cool to hear the Dead play this song. They had a big video screen, and did a close up of Jerry Garcia singing the verses.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nlsd\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI think this song is definetly about lsd.The lyrics are too weird.I could understand that people nowadays write lyrics that are way wacked out without actually experiencing a situation like that,because I myself write weird crap and have never taken drugs.But I have been brought up in a society that has weird stuff like that in public.Back in that era,you normally didn't hear that.So you would definetly have to experience it.\r\n         But besides it being about drugs,I have another theory about it. I think the girl with kaleidescope eyes is a drug dealer of some sort.Maybe shes a friend that they got lsd from,or just an acquaintance.The song talks about how he first sees her.Then later on as he drifts down the river,or maybe he drifts in and out of conscienceness?(I don't know what exactly takes place while using lsd),he sees her again.He get more acid from her.Then the taxis,police or friends trying to get him to stop,come and takes him away.When he is at the train station,he notices her again.And them he starts the chorus again,kinda taking you back to lsd.Just a theory.But I love this song.The imagery is incredible,it would be like a dream world.And the way the song is sung goes hand in hand with the lyrics.The music adds to the effect,and it kind of reminds me of Willy Wonka's Chocolate Factory.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nits about LSD there is no fucking way it isn't....no one in their right mind would ever right those lyrics even if they had seen a picture their son had painted...he was on acid just accept it\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nLusy in the sky with diamonds does not mean LSD. It's about a picture john's sone Julion's picture that he made for him\r\n-Supermanman37\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nits definately about LSD. but my opinion always is that songs are made to be interpreted different ways. maybe one person has a totally way off idea on this song, but they love it because of their meaning for it. if you try hard enough you can relate yourself to nearly every song even if its just one line that you love.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nAlthough the title and lyrics suggest LSD, that is not what it is about. The picture story is correct. However, that's not to say that they weren't on LSD when they wrote this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\n\"answer quite slowly\" and \"grow so incredibly high\" could be about drugs, if it is about a drawing those lyrics don't really fit\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nHow could this song NOT be about LSD? The Beatles were too creative to say \"This song is about drugs\".  It annoys me how rappers get so much credit and money, and how people marvel on their \"creativity\", when their lyrics consist of them ranting about how famous they are, and how they love doing drugs.  The Beatles liked singing about their drug use in a number of their songs, but would hide them so you would really have to listen to the song to know what they're singing about.  And to those who think that it's about his son's picture, that must have been a pretty big picture, considering he wrote a whole song about it.  I mean come on, the title of the damn song is Lucy in the Sky with Diamonds! It says LSD in the friggin' title!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nlysergic acid diethylamide=tangerine trees, marmelade skies, rocking horse people....selah.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nWhen these guys were on drugs though, man some of the organs in their music sounds like trippy shit, they must have been on drugs when they wrote some of their music. Some people really do write their art while in complete blackouts before lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI like pie... mmmm pie\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nI like drugs... i mean pie, but this song came about in an interesting way.  His son was on LSD and drew a picture of a girl named lucy in the sky with diamonds. The drawing was on the back of a shopping list which had marshmellows, tangerines, and marmalade on it. Pretty interesting, I think I heard an interview with that in it, maybe martin. Just thought Id shed some light on the song for guys...\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\ngood times\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nwow this is an awesome song, who cares if it's about drugs or a painting doesn't change how the song is, it seems like sumthing sum1 would sing when they're high, lol well anywho, i can just see what's happenin in it, i think i might do it for an airband, lol when anywho, AWESOME!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nThe song is CLEARLY about LSD, they only said it wasn't so it'd be allowed to be released. Look at the lyrics \"PICTURE YOURSELF IN A BOAT ON A RIVER \r\nWITH TANGERINE TREES AND MARMALADE SKIES\" Its about the hallucinations the guys got when experimenting with LSD. The Beatles WERE drugs in their latter years, face it! \n\r\nAnd it meant they embraced new, more experimental music rather than the drab, five verse, two-line chorus formula they were beginning to get stuck to. LSD!\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nFor the record. Amanita muscaria (the red and white mushroom) is known for  causing macrosomatognosia and microsomatognosia (perceived changes in size, shrinking and growing). This mushroom has been used for shamanic purposes for millenia. It is likely that Lewis Carroll used it.\r\nAnd hobbits are definitely stoners.... Probably trippers too (the mushroom foraging in LOTR).\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nit means-to moi- Lacey in the Sky with Diamonds. LSD....ironic? lol i think not. I luv it. \r\nXxRawRxX\r\n-+-Â¿?what makes one a homegirl?Â¿-+-\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nWhat's wrong with you guys. This song is not about LSD.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nTHIS SONG IS ABOUT AN ACID TRIP. END OF STORY. i can't believe this shit im reading. his son drew a picture, yeah we know and we've all heard that story thousands of times. listen to the lyrics of the song, its john describing an experience with lsd, and NO, THE TITLE IS NOT A COINCIDENCE. \r\npeople are so stupid\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nthe song is awesome, by the way\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\npeople ALWAYS claim songs are about drugs, but this time they're right. this one is.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nPaul McCartney recently said in an interview that this song is infact about drugs. You can argue whether or not he should have contradicted the deceased John Lennon, but you cannot argue whether or not the song is about drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nPaul McCartney recently said in an interview that this song is infact about drugs. You can argue whether or not he should have contradicted the deceased John Lennon, but you cannot argue whether or not the song is about drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nOk, I have discussed this with friends and parents alike...and since I have been a beatles fan and knew what drugs were (beatles came first) I have known this song was about lsd.  Whether John Lennon got inspiration from the picture or not, there is no denying that the nonsensicle lyrics point toward drug usage.\n\r\nAnd, whether this painting exists or not (I have never seen it) the song has not only the acronym to suggest it, but the overall feel that the song is aboug being stoned...remember guys, the beatles did a few drugs in their day...\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\ndid any of you people who say that the song wasnt about LSD think that maybe the whole picture thing was just something they used instead of admitting it?  but the song is obviously about LSD and the title no matter what anyone says its completly obvious\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nbrethen35, did you ever think it could be about both? Maybe John saw the picture and thought of an acid trip. That could totally explain it.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nIT'S ABOUT DRUGS\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nI'm sorry but Lucy In The Sky With Diamonds does not spell LSD it spells LITSWD and I'm pretty sure that is no kind of drug.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nok i have an IQ of 160, people who believe the what he said about the picture is true, needs to die, so that society isnt being dumbed down by you. It is about LSD.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nWell if you actually have a 160 IQ you probably wouldn't have such poor grammer and use of non-existant words like \"dumbed\".\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nigotmadsteez, can you rephrase what you said in a way that makes some sense?  you know the way someone with an IQ of 160 might phrase it.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nWe all know you don't have a 160 IQ\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nGive it up, and it's not about drugs. just go with what John said.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nDRUGS\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nThe song was inspired by Julian's drawing, but John took it so much further.  When Julian told John what he had named the picture, how could John not get the big cosmic joke? Lucy Sky Diamonds=LSD. It had to be too funny to pass up. The Beatles were experimenting with drugs at the time and were being criticized for promoting drug use. So John had it both ways-yeah, his son's fanciful drawing, and yeah, a great big wink to the drug culture.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nWritten on LSD.. ah brilliant. I love this song, it's trippy.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\ni agree with gurlmom. the song was probably inspired by julian's drawing but john was probably totally high when he wrote it. of course, he was probably high when he wrote all the songs during this period. anyway, whether abt LSD or not, this is one of the beatles' greatest songs and john voice is sooooo mesmerising!!\n\r\noh, btw, has anybody esle noticed that the fight (abt whether this song is abt LSD or not) is a trifle funny?? ^_^\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nthis song is so cool it's the only beatles song i can play on guitar...and the only one i've tried!! : )\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nWhy don't you try more. You should be able to play more than 1 Beatles song. I can play every one of them I've tried.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nreally? which songs are the easiest?\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nthis goes back aways\r\nVAST334 \"WHENS THE LAST TIME YOU SAW NEWSPAPER TAXI'S APPEARING ON THE SHORE\"\r\num...how do you think orders of foreign papers get to the US? we aren;t the center of the universe...think laterally...\n\r\nRHCPROX, try some of the really eary stuff, like pre-invasion\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nhmmmm... thanks i will try those!!\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nThe Beatle's stood up for peace...and if you are a true fan, then you would respect everyone's opinion and not argue.  And paul and john both agreed that they would confuse people, paul would say it was about the picture, and john would say its about killer clear (lsd).  My grandfather knew lennon quite well, I he had his yellow circular glasses, so I know these things.  (please note I'm not flaunting)\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nno one should argue over a beatles song...just take it how it is...there all freakin hippy songs but they still kick ass\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nof COURSE it's about an acid trip!! and if that wasn't their original intention, they must have made SOME sort of connection to it...and who cares anyway...people get so worked up about \"hidden meanings\" especially when it has something to do with drugs..i mean, whatever floats your boat man!\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\ngod you guys are idiots!\r\nthe first words THE FIRST are Picture Yourself right? well thats basically saying think about this, the song is about a girl named lucy and everything around her is beautiful right? well then think that a man is either telling a freind about his first acid trip OR hes telling his friend about how it feels when youre in love! maybe it has to do with both? maybe it has to do with the picture? no matter what no body here is even reading the lyrics! so now lets see music whore said it was Paul-picture and Lennon-lsd well then maybe lennon saw the picture when he was on lsd? or maybe he wrote the lyrics after about lsd who knows all i know is no one here is reading the lyrics, its like saying because i song might be called i hate you, but the lyrics have to do with a rat eating cheese?!?!?!?!??!?!?!?!?!?!?!??!?!?!?!?!?!?!??!?!?!?!?!?!??!?!?!?!?!?!?!??!?!?!?!?!?!?!??!?!?!?!?!??!?!?!?!?!?!? is it that you cant read or is it that youre too lazy?\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nby rhink on 04-14-2002 @ 07:59:08 AM  \r\n\"this song is not about LSD. it's about a picture john's son brought home that he drew of his school friend lucy. it was lucy, in the sky, with diamonds. john didn't realize it was an acronym for LSD until *after* he wrote it\" \n\r\nHeh. Sure. I believe that. These guys were known for BSing... I've seen some videotaped interviews them where some of the comments they made were just hysterical. That line is typical of Lennon's creations. This song is all about drugs.  \n\n\r\nby Jaspin Demothenese on 04-18-2002 @ 01:21:58 AM  \r\nFace it. The song is about LSD.  \n\n\r\nby wiseone on 04-25-2002 @ 01:30:27 AM  \r\nLSD  \n\n\n\n\r\nhah.  ive got news for you, dumbasses.  its NOT about lsd.  it IS about a drawing that julian brought. home.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nDude, I don't think John would lie. I mean The Beatles have done alot of crazy things in music (like the Paul is dead hoax) but there is no reason for them to lie about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\n\"If politicians would use LSD, there would be no more war, poverty or famine.\" -Paul McCartney\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nEveryone! - Just lighten up! Is it about drugs? Or isn't it? Look, drugs, especially lsd, mushrooms, peyote and other visionary \"drugs\" are brain candy, plain and simple. This song, whether intentional or not is perfectly constructed for a trip into your inner space. I know, all of you \"I have never touched\" drugs, holier than thou people will get all uptight, but you ARE ingesting millions of toxic chemicals a day, thousands of pounds of fatty foods, containing billions of harmful 'drugs' (or chemicals, or mind-altering (no matter how small) substances, i.e. sugar, caffeine, etc..) a year - and for what? A roll of fat around your waist? A momentary fix of coffee in the morning? A social drink with your buddies? This song, along with most of their songs reminds us of the beauty of our existence - do you NEED drugs to get there - of course not, can you enjoy this song without them - of course, .. but music, and especially their music, takes on completely different dimensions when you choose to take a trip. Whether or not it was about drugs is NOT the point. The point is, rather, the meaning of it is simply the beauty of existence when you take a moment to contemplate it.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nThe avrage American will handle cocaine on the everyday basis. There is typically a trace of cocaine on most US dollar bills. And Coca-Cola doseb't use coke anymore right? Wrong. They inport Coca leaves every year for flavoring, so there is still \"Coke\" in your \"Coke\". No matter what you learned in DARE most drugs are not harmful. The drug deaths are of a MINORITY. Just like driving, I could say you shouldn't drive and explain to you in a specific car accident as evidence. Those chances are 1 in a million, just like drugs. The overdose is all that needs to be worried about.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nHaha, everyone was doing drugs but you couldn't mention it in them days. \n\r\nPICTURE YOURSELF ON A TRAIN IN A STATION \r\nWITH PLASTICINE PORTERS WITH LOOKING GLASS TIES. \r\nSUDDENLY SOMEONE IS THERE AT THE TURNSTILE, \r\nTHE GIRL WITH KALEIDOSCOPE EYES.\n\r\nThink about them lines. You think John Lennon could get away with telling the truth about the song being about LSD?\n\r\nLook what happened when he said the beatles was more popular than Jesus. Christians went on the rampage and burnt their beatles records.\n\r\nSeriously, some of you guys don't use your brains.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nthis is incedentaly a really popular song\r\ni acually really do like it though...\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nby sqrt144 on 05-13-2002 @ 01:24:28 AM  \r\nBite Me quit posting your incoherent, drug-obsessed ramblings you leathery, slack-titted gorgon.  \n\n\r\nHAHAHAHAHAHAHAHAHA\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nThis song is about LSD, big fucking deal, everyone knows the Beatles were using LSD. No use denying it.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\ni was named after this song\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nGood song, and I had never heard about the picture that inspired it. I agree with Tikka when she said earlier (very early) that it was inspired by the picture, and touched up with LSD. But just think about how good the song is, not whether drugs or pictures or Alice in Wonderland had anything to do with it! Listen to it, those are people with great imaginations, on drugs or not!\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nit's not LSD, its a picture Julian drew of a friend of his in school, and he called it \"lucy in the sky with diamonds.\" He showed it to his daddy and WHAM *beatlemagic* ! A hit. But anyways, I read in anthology I think it was, that they didnt even notice the initials of the sog until people started pounting it out. (L.ucy in the S.ky with D.iamonds.) \r\nAnywhoo... I love this song so much, and I think it's totally sweet that John got the inspiration from his son.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nIt might have been about LSD, it might have been a picture. Everyone knows they were using LSD, no big secret there, they might have just said that bit about Julian to cover it up. But then again, it might really have been that innocent. Or maybe a mix of the two? Either way, the song is fantastic.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nIts definitely LSD.. Trust me, I know.. For those who say you don't experience full-blown hallucinations that all depends on how much blotter sheets you take. With enough acid in your system everything around you becomes a dream. Hence the saying LSD-its LikeaSweetDream (another play on the beginning of words) But yes the song is amazing regardless.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\ni thought i read in the newspaper that paul finally admitted it was about LSD. can anyone confirm this?\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nI don't think there's a definite answer to whether it is or isn't about acid. \n\r\nTheory #1: John wrote it about his son's picture. I've seen a picture that is supposedly the original drawing (67.19.222.106/music/graphics/…). However, even if the chorus was about the picture, it doesn't explain the verses. If Theory #1 is true, then the verses are just Lennon expanding on the fantastical child's imagination world. The song does have a childlike sound to it.\n\r\nTheory #2:\r\nThe song is about the LSD experience. Lennon was lying to protect his reputation. I have a friend who's done acid and we were discussing the idea that \"Lucy in the Sky with Diamonds\" is not about drugs and he said \"If you've ever done psychedelics, you know it is.\" Additionally, the references to kaleidoscopes suggest it is about the effects of acid. There are numerous (possible) references to drug use-- \"Climb in the back with your head in the clouds and you're gone\" (the clouds probably describe the feeling, not clouds of smoke--different drug) and \"the flowers/that grow so incredibly high\". The \"high\" at the end of the line is one of the trippiest sounds I've ever heard in any Beatles song or song by another psychedelic artist. The song has a very trippy sound.\n\r\nI personally believe that Theory #2 is correct, although I think Lennon got the original idea from the drawing and added in the drug-use references.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nwho cares if its about drugs or not? \r\nITS A GREAT FREAKING SONG!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nOk, I'm sure his son actually drew the picture \"Lucy in the Sky with Diamonds\", but they were probably laughing their heads off at the obvious L.S.D and wrote a song about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nany one who thinks the song is about LSD is Flippin retard John has said on many different occasions that the song is about Julians friend Lucy LSD probably had something to do with the music video of it but not the song or any of the lyrics and if you believe that it is about LSD because of \r\nLucy in the Sky with Diamonds then your just stupid and cant see the real meaning you think just because it was the 60s and the beatles were known for doing drugs like that i mean it sounds like a good meaning for the song but dont argue with me ive done ALOT almost a whole year of research on the beatles i know all the sh...stuff there is to know about them so take that BIA!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\n1.  John and the other Beatles (but mainly John) were doing a LOT of acid at the time.\r\n2.  Rock stars were getting busted a LOT around this time for possessing drugs.\r\n3.  Society was starting to pay a lot of attention to the decadence of the drug culture that was coming into being at the time.\r\n4.  Brian Epstein was still alive.\r\n5.  John was a savvy capitalist and the financial success of the Beatles was very important to him.\r\n6.  John was still smarting from the financial and professional damage done to the Beatles by his \"bigger than Jesus\" comment.\n\r\nOkay, lets combine the elements into this stew:\n\r\nJohn was very excited about the pleasurable and mind expanding effects of LSD and wanted to write about it to a) spread the word and b)write a song that would be great to trip to (as most of the songs on Sgt Pepper were).  Plus, the Beatles would have had a great laugh over the LSD initials in the title.  After having written and recorded this masterpiece, they played it for Brian Epstein, their manager, who promptly flipped out told them that they must never never never admit that this song has anything to do with drugs or LSD, else another shitstorm of controversy would fall on them similar to the one caused by John's \"bigger than Jesus\" statement.  Or even worse, it could draw the attention of Scotland Yard who were busting pop stars left and right at the time in response to conservative British society's outcry over blatant drug use and endorsement by the youth movement and their spokesmen, pop stars.  \n\r\nThe \"admit nothing\" strategy worked very well and the Beatles continued their incredible commercial success.  John DID get busted for drugs, but let off with a slap on the wrist.  \"Society\" moved on to easier targets \n\r\nThe origin of the name of the song may or may not be factual, but one thing is for sure...you can NOT trust John's statements that it wasn't about acid.  John knew it was about acid and the people he was writing to knew it was about acid.  Everybody else had to be content with the \"Julian's drawing\" story.\n\r\nJohn was a genius, and this event proves it...he writes the best song ever for (and about) acid tripping and is smart enough to know that to admit what it is really about would be a financial and professional disaster, so he concocts and maintains the big lie that keeps everybody happy.  The song was great and the lie was great and everybody got out their wallets.  Lennon smiles.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nHere's what a friend of mine named John Lennon, coincidentally, the man who wrote the song, said:\n\r\n\"I saw Mel Torme intruducing a Lennon-McCartney show, saying how 'Lucy in the Sky with Diamonds' was about LSD. It never was, and nobody believes me. I swear to God, or swear to Mao, or to anybody you like, I had no idea it spelt LSD. This is the truth: My son came home with a drawing and showed me this strange looking woman flying around. I said 'What is it?' and he said 'It's Lucy in the sky with diamonds,' and I thought, 'that's beautiful.' I immediately wrote a song about it. And the song had gone out, the whole album had been published, and somebody noticed that the letters spelt out LSD. It wasn't about that at all. The images were from Alice in Wonderland. It was Alice in the boat. She is buying an egg and it turns into Humpty Dumpty. It's not an acid song.\"\n\r\nThat about clears it all up for me. And, knowing that they had been open about drug influences in past songs previous to this one, he had NO reason to deny it. Believe it, or not. That's it.\n\r\nThanks.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nThe Beatles are freakin brilliant; if it isn't about LSD, and it is about the kid's picture of the sky with diamonds and lucy, then why didn't they change the order of the words so that it didn't spell LSD? Obviously they knew that it would spark lots of controversy (and also its kinda funny to have all those straight-laced teeny bopper beatlemaniacs singing about LSD), so that's why they did it. Regardless of whether the did acid or not they knew that it would evoke some type of response from the masses and it did. And oh by the way--it's my favorite beatles song.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nThey did do LSD, but that is the direct quote from Julian, who said, \"It's Lucy in the sky with diamonds,\" and that's why they he didn't change the order. The acronym is coincidental. A big coincidence, yeah, but a coincidence still.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nBeatles the all time greatest band ever to me they started everyting god bless the Beatles and all they have done and this song is definitely the top on my list a must listen to song great lyrics\n\r\nLSD hahaha you guys are great\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nEverything I could have possibly said here has already been said. o_O\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nLennon wrote this song in full knowledge that it conjures up images of drug use and childhood innocence.That's kinda the point.\n\r\nI love this song so much because it recreates the dreams of my childhood. Drug use doesn't really come into it for me, it's not where i'm coming from.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nEven if the sons picture story is true, theres no way Lennon didnt notice it.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nThis song is actually about a british band called Lucy's Sky, who the beatles loved, with their hit song \"Diamonds\" you can check them out at Lucy'sSky.com Lucy's Sky was a band that influenced the Beatles to become a band. In fact, before hearing them play, Paul actually was quoted saying \" I hate music, nothing interests me anymore\" Then he heard this band and decided to form his own, but now he is dead.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI don't know really, I mean the LSD thing is strong in this song, and having also done LSD I know what some are saying, but then again, he could have been telling th truth, the man is dead and shit well will never know..\n\r\nThough about what was said and LSD, not sure when Alice in Woderland was written, But LSD was discovered near the end of the 1800's early 1900's, two Chemists or Pharmacists created it by accident and gave away the formula, tehy were working on a medicine to help with mental illness if I remember the story right. \n\r\nAnd as far as John and being a Capitalist, he may have been as far as money, and well all know the people who called him a Hypocrite after he did Imagine, saying that his video showed him in a Big house with a big piano and talking about having \" no possessions\", so that might be true, but I think, and it was stated that he was a socialist, and I believe he trully believed in the Socialist Idea...and it's not a bad thing really, but all in all, John was a total genius,cut down by a loon...\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nnope, im right\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI just think about a girl named Lucy who is flying around with diamonds around her neck.  It could just be that simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nLSD :-D\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nAlthough I do not consider myself a rabid Beatles fan, nor have I watched any interviews or anything (I love them, don't get me wrong, but it's not an obsession of mine, sorry!) So I won't pretend to know everything about them.\n\r\nBut really...mere coincidence? I think that would be fairly hard. It is a beautiful song, but many songs have a meaning to the person writing it (Otherwise, why bother?) And what is so bad about it being about LSD? It's not like he's saying DO LSD KIDS!!! So what? We know that they were druggies, no need to make a dramatic production over it. And as for his son drawing a picture? Maybe there is a chance if he didn't make the connection, but why would the song be so...well, the only word I can think of is \"trippy.\" For those of you who have not had to endure the onerous burden of health class (Oh, you lucky few!) I shall endulge this following information to you.\n\r\nWhat LSD does is it creates bubbles in your brain. Your brain, in response, produces hallucinations which can be merely a distortion of reality or a creation of reality--sight, sound, etc. In 'street terms' this is called a trip (among other things) and so, the wild images in the Beatles' \"Lucy in the Sky with Diamonds\" could be considered a song written, perhaps, from the experience of the writer's 'trip', perhaps even to be tied in with the son: perhaps some of his hallucinations were affected by his son's mentioning of a friend named Lucy. Who knows?\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nThe Beatles were so high on drugs they even let Ringo sing a few songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\ndan0311, I think you know what you are talking about. Though there is no way we can ever really know what this song is about, it's still great fun to bicker over it, isn't it? We are doing just what Lennon wanted, reading too deeply into his songs. I must say, not all songs have to be about drugs, but this one probably is. The only way to really know would be to ask Mr. Lennon (god rest him), and we can't do that, and he probably wouldn't tell the truth anyway. \r\nMy theory on this song is that the picture story might be true, and when John realised it could stand for LSD, he wrote the song. When you are on acid, for a little while things will seem normal, then everything goes mad. In the song, there is the slow bit and then it says \"and you're gone...\" then it goes louder into the chorus. \r\nNone of us could ever really know whether it is about drugs or not, and as for myself, I am not sure. I think it is definately possible that it is, but it is also possible that it is not.\r\nListen to it while you are stoned, it's fantastic.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nfucking sweet ass song, every beatles song is, but this one just kicks total ass\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nI am definitely for the LSD theory. I mean all that psychadellic descriptions and shit man, besides the fact that everyone knows the beatles were into acid, then agian, who wasn't. People make a big deal about this like if it were admitted it was about acid it would make any less great of a song, it is the same song regardless of the meaning. but yeah it was the 60's, most stars, and even most non-stars were fucking around with psychadellics in the 60's man, who cares, its a great song. I myself only did acid once but it was pretty bunk, so i didnt completely lose it, mostly i just mess with shrooms, pot, and pills. \r\nBut woscow, i totally agree with your point, it is by far one of the greatest songs ever to listen to when your high.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nWhen I first heard the title \"Lucy in the Sky with Diamonds\" meant LSD, it made a lot of sense.  Most people know The Beatles used drugs, including acid.\n\r\nLater, I heard the story about his son's picture. \r\nHere is the picture: \n\nsnopes.com/music/graphics/…\n\r\nSo it's clear to me that the picture was real.  John Lennon may have seen Lucy Sky Diamonds and realized LSD, or he may have not.\n\r\nA songs title isn't always what a song is about, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nThis song is def. sweet as hell.What great opening lyrics to a song \r\n\"PICTURE YOURSELF IN A BOAT ON A RIVER \r\nWITH TANGERINE TREES AND MARMALADE SKIES. \r\nSOMEBODY CALLS YOU, YOU ANSWER QUITE SLOWLY, \r\nA GIRL WITH KALEIDOSCOPE EYES\"\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nThere is nothing else this song can be about but what people like George Harrison and Jimi hendrix do in their spare time......God...Someone should declare John Lennon Day as a national holiday.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nI should paint a mural about this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nok in case u guys dont read the news, paul just recently came out and said that a whole bnch of their songs were about drugs and specifically named this one as one o them and said john was just bs'in everyone,\r\n2nd of all, john was a communist, so y cant people b equal at the top of the spectrum\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nthey were prolly high when they said that. o well. the song is awesome and to me that's all that matters.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nJohn never denied that the song was about any of his LSD trips.\n\r\nWhat he did deny, consistantly, is that the song title was chosen to spell out LSD.  The title does in fact come from a watercolour that his son did, titled Lucy in the Sky with Diamonds.\n\r\nSo, long story short:\n\r\nSong = about LSD\r\nSong title = taken from a watercolour\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nhow the hell were they not high when the wrote this song.. KALIDASCOPE EYES.. it def. sounds like they were high\r\nand listen how they sing i mean seriously...\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nAre there really ppl who dont think this song is about drugs?? READ THE LYRICS PEOPLE!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nhonestly kids, of course this song is all about an LSD trip. the title may have not intentionally meant to be an acroynm, but the song is defintly about tripping, or being on a trip.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\ni just love this song, a lot. I probably love it so much cuz my names lucy, but other than that, you can't not like this song. Its such a feel good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\ni think this song is about an LSD trip....but thats just from reading the lyrics... its deff. got to do with drugs somehow whether it is about an LSD trip or was sung by John Lennon while he was on a LSD trip it doesnt matter. this song is relevant to LSD. but no matter how the song was made/what drug its about the song is still pure genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nIT IS NOT ABOUT LSD. in fact john lennon got the inspriation for the song from his 7 year old sun when he came home from school with a picture he drew, john asked what do u call that, and julian (his son) said i dont know, someone called it lucy in the sky with dimonds at school.  i swear to god its not about LSD..just look in the beatles lyrics illustrated.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\notherwise its the best song i nteh world\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nthey say he wrote this song about LCD, but he claims it was about his daughters picture she drew. i personally believe him.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\ni think that the whole lsd thing kinda ruins this songs potential depth. i mean, john did say it was about his son's picture as opossed ot lsd. i just dont understand why he would lie becuase it wasnt like, a big secret that they used drugs.\n\r\nwhatever the case is, it doesnt seem to have much to do with a boy's grade school crush except for the line LUCY IN THE SKY WITH DIAMONDS [because as we all know, suposedly his son juian had a crush on a girl named lucy and drew her in the sky with diamonds].\n\r\nbut did anyone ever think that it could have been a little of both? who knows. its still a bueatiful song that leaves a beautiful picture in your head.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\ndudes!! \n\r\nthis song is clearly about child molestation!!\n\r\neveryone knows all communists are child molesters and ringo was a card carrying commy.\n\r\nword.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nof course hes not going to admit that he wrote a song that implies that LSD a \"tabboo\" to ALOT of people back then, and still today is a beatiful thing.\r\nWould you?\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nsorry, im posting about an early post- i agree with beatles fan one when they said that weather it is about lsd or any drugs, it should be about the musical aspect of it. i think its good to think about the music and stuff but if you pry apart the song then it kind of ruins it doesnt it? i find it better to just listen and come to your own conclusion. \n\r\nno one probably wants my opinion but o well.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nIt is truly about LSD. Just look at the initials and the words on the song, things like that are only seen when you are high. Great song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nI was stoned when I was listening to this Beatles song, and I thought myself to be a genius when I found these lyrics to be an exploration of a womans body. This may come off as extremely perverse, but in a Very complicated and psychedellic metaphorical lense, you may definatly see it 'works.' I cannot explain it in the enthusiasm that I would like to, however, I was so amazed at my \"finding\" that I immeadiatly went to this site to see if others found the same thing, and to my surprise nobody else came near. \n\r\nto briefly summerize what i saw, in hopes not being to lewd on this forum, it starts off with a man peering at a girls orifice, and moving up slowly to her eye's, and soo back down, and in a very vivid colorful light, he changes his position to where he's soon to begin oral sex- \n\r\nyeah, i was really stoned and i mean, to write out what i saw, i could go for pages, and draw diagrams to show it all - anyway, i think its about a sexual experience.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nuhh solidben3, maybe you were a little too stoned!  (not that there is any such thing wink wink)  Perhaps  it is about sex, but i think that it's mostly about LSD i mean, Lucy Sky Dimonds. but anyway, Missing 808 is right, the listener should come to their own conclusion about any song.  Oh and for solidben3, Listen to I am the Wlarus by the Beatles while stoned it will blow you away!\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nwe will never know the ral meaning cause lennon is dead :'(\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nok to everyone who said this song is all about drugs u completly ruined an excellent and dreamy song for me!!i am nearly 13 years old and even tho i amnot from the 60s i am a big beatles fan,now i never knew they were involved with drugs but u completly ruined it for me!lol,yeah this seems like some lottle whiny kid..im going to see what LSD stands for..i read the lyrics just to double check if this song actually may imply that it is about drugs and i can see why thats what people think cus it seems like it may be drug-related..i would like to stick to the theory that it is a unique,imaginative and breathtaking song as i have always thought it to be.Thankyou\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nok i checke dit is not LSD!!my gosh..it really is from an idea by julian john's son,i checked on a beatles website!\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nIT IS NOT ABOUT SEX U LOSER cooldude..ur not cool ur perverted!!this is not at all about sex..ok i can agree with the whole drugs thing even tho i found info that it wasnt drug relayed\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nif you honestly believe that this song is not about drugs you yourself are on crack, when it was written by a man who was frequently taking lsd at the time, and the beatles had just released sgt peppers and had gained a vast amount of scrutiny for supposedly influencing youngsters to do drugs, john wasn't going to go and say yeah i wrote a lovely song about the wonders of lsd was he, and that his son really did do a picture of a girl randomly in the sky with diamonds seems far less believable to me, especially with johns well known ability to get out of awkward questions with clever responses in interviews, and its just too perfect a depiction of lsd to not be about it\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nApparently this song is about LSD due to the words Lucy Sky and Diamonds\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nApparently this song is about LSD due to the words Lucy Sky and Diamonds\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nas you can see from my username, i love this song to death! its also my screenname for aim. when i first made it, one of my friends was like \"nice LSD screenname\" i hate when arrogant people like this just say what they want without thinking. so i had to go to this website to find out the real meaning to prove him wrong! thanks\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nJohn Lennon was about music not drugs. Yeah john and all the beatles did alot of drugs but drugs were not really that big of an influence. Some of you need to relax. It seems you're trying to glorify your personal views by irrationally clinging to the idea that a musical genius wrote a terrific song that may or may not be about acid. It's all about the music.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nLucyyNtheSkyy - This song was thought-of, wrote, sung, and performed while under the beautiful light of LSD25.\n\r\nThere is no disscussion. This is a beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nI agree with both viewpoints.  The idea for this song definitely originated from John's son Julian's drawing (which I have seen), but I do agree that John was probably on drugs when he wrote it.  How else could he come up with such incredible imagery, even with the brilliant mind he had?  However, I do think that the initials \"LSD\" in the song's title are a complete coincidence.  Even if there are possible references to drugs in the song itself, the title has nothing to do with that (when John asked his son what the drawing was, HIS SON SAID, \"Lucy in the sky with diamonds\".  Besides, the whole \"initials in the title argument\" is so vague.  Shouldn't it be \"LITSWD\"?  Or at least \"LSWD\".  So, was John on drugs?  Probably.  Is the title a reference?  No way.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nIT IS NOT ABOUT LSD!!!\r\nLucy in the Sky with Diamonds came from a picture his son drew.  He asked what the picture is and the kid said \"Lucy in the Sky with Diamonds\" He decided to write a song about it and make a imaginary, Alice-in-Wonderland-ish world.\r\nIt is just a coincidence that it spells LSD\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\noh yeah, and... The girl with looking glass eyes iss there to be the person he wanted to \"save\" him.  Something like that, I don't remember it too clearly.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nTYL3R - umm do u kno this for sure?? were you there with him when he wrote this song?? how can you sit there and argue about this?? why does it even matter?? its a beautiful song and we shouldnt be discussing whether or not he was on drugs when he wrote it.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nis it just me or has anyone else noticed that if you listen closely to to chorus, it sounds like they're saying: LUCY IN THE SKY HIGH WITH DIAMONDS, in stead of LUCY IN THE SKY WITH DIAMONDS.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\n\". How else could he come up with such incredible imagery, \"?- have u ever seen a child's picture??? Colours all wrong, things that shouldn't be? it could be literal u know, what Julian actually drew it as. Also John Lennon did not need LSD  tocreate great imagery or music. He was brilliant regardless\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nThe meaning of this song is so simple. His son drew the picture and t5hen john took LSD and wenet into the picture in his head!\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\njossey 384;\n\r\n\"How else could he of come up with such incredible imagery?- have you ever seen a child's picture??\"\n\r\nLAL, what the hell are you on about!!! I can think of a way that he could of come up with the imagery. Maybe acid or shrooms????????\n\r\nSniff the soda, taste butane, assclown!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nManson does it better.\n\r\nLucy in the sky with demons...\n\r\nTrue.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nFornicate your self up the ass you Jackass goth!!\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nThe song is obviously LSD-inspired. If you drop a tab and listen to it, it is undeniable. I think it is about Lucifer in the Sky with Demons, Lennon's devilish dreams of usurping heaven - tying in with his blasphemous earlier remarks about Jesus.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\ngeez the song is clearly about lsd. i know the beatles were before my time. im only 17. i have done acid. of course beatles would try to cover up the real meaning to the song.who wouldnt? i dont think i have ever met anyone that creative who wasnt on drugs. and you guys talk about alice in the wonderland. the creator of that movie was addicted to lsd. and dr. suess how do you think he came up with all those \"different\" kind of stories. one answer. drugs. but this is only one persons opinion. it makes complete since to me that the song would be about lsd.\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nLSD. Enough said\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nthis discussion is just turned into an argument about whether or not Beatles relied on LSD to write songs, instead of their talents.\n\r\ni just hope someone explains the MEANING of this song, instead of just coming up with insults .\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nI love the beatles i mean the whole LSD thing may be true but this is a hilarios song i mean are they trees with tangerines or tangerine coloured tress? who even knows but i just can't gte tired of listening to this song its so awsome!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nLSD or not...this song is AMAZING no matter how you look at it...\r\nI'm not sure is the LSD thing is true....but nobody can deny that The Beatles were drug addicts...\n\r\nI love the imagery in this song and do think he was on drugs when he came up with the lyrics to this song...no matter how you look at it there are drug references in this song \n\r\nBut drugs or not this song is one of my favorites by The Beatles...the beat is sooo good...and his voice is soo damn good...I think the song is very calming and relaxing especially the very beginning of the song!\n\r\nTo me this song is about getting high....whether it be off of drugs or something different, like a natural high...I do not do drugs....but in ways music is my natural high....music allows me to drift in another world where there are no worries..no anything... certain songs do that to me...if that makes sense\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nWow. This song is amazing.\n\r\nI was first introduced to this song as a piece I was required to play for a concert. I immediately fell in love with the upbeat melody. When I read the lyrics and researched the meaning, I was honestly surprised.\n\r\nI guess I just never realized that the Beatles were so dark in their music. Dark in a sense, at least. I assume because I hadn't heard all of thier songs and was only familiar with the most well known tracks.\n\r\nI truthfully haven't read all of the comments, but from the jist of things, I understand that most of the commenters assumed it was about LSD. While it really doesn't matter, because it's their personal life and is a well written song, it is interesting to discover the true meaning, origin and basis of the song.\n\r\nI found this website concerning the LSD claim. I'm not sure if everything included is factual, but I thought the source was pretty reliable. The site is: snopes.com/music/hidden/…\n\r\nPretty much, it says that the entire LSD \"hidden meaning\" is coincidental, and that John Lennon didn't realize the initials of the son until after it was released; completely unintentional. Apparently his four-year old son, Julian, had drawn a picture titled \"Lucy in the Sky with Diamonds\" or something of the sort, and it inspired him to create the song.\n\r\nAgain, while it really doesn't matter whether the song was about drugs or ot, I thought that I would provide another perspective of the situation.\n\r\nYou make what you want out of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\ncould i point out that it would be pretty much impossible to write any half decent song whilst on any half decent drug. so this song and lsd both being rather top notch, the 'written on drugs' theory just doesn't cut it for me. also, lsd is not an acronym since an acronym has to make a new word like s.w.a.l.k or whatever.\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nswatch\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nseveral drug references. \"thedaytheMUSIC died\" I think it would be naive to believe what lennon said about his own song.\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nHmmm, I don't think I clarified myself in my last comment.\n\r\nI did not intend to state the song was not about drugs. Because it may be, and there is a lot of evidence that supports that it is. I'm not denying it.\n\r\nNeither am I denying the fact that the Beatles were involved in drugs. I recognize that they were.\n\r\nI was just trying to provide another perspective.\n\r\nThat's why I included the website, saying that I wasn't sure whether it was factual or not.\n\r\nIt was more of the perspective of the author of the website than my own. I just found it interesting.\n\r\nTo reiterate, no one knows for sure what this song means or why it was written. It's unclear. But it's an amazing song, and to me, it doesn't matter much :)\n\r\nI truely respect the Beatles for the music they've created. . . and for whatever reason it was written, I'm glad, because it's a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nI LIKE DRUGS, AND DRUG INFLUENCED SONGS LIKE THIS ONE IMPERTICULAR I LIKE THAT WORD TOO. WOW THE BEATLES ARE LIKE HOT!!! LIKE LOOKING ALL THE SAME WITH WIRD HAIR CUTS IS LIKE HOOOOOOOOT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nBy the time they had come out with this song, they had already admitted to using LSD.  If everyone already knew, why would they lie about it?  Every Psychedelic song ever written involved LSD, but thats not why he wrote it.  You can look at the picture yourself here: heyjules.com/images/bio/…\n\n\n", "comment_214": "\n......it takes only thre words to explain on what lennon is trying to say:\n\n\r\n.-.-.-.-.-.-.-.-.-.-.-.-.I AM HIGH.-.-.-.-.-.-.-.-.-.-.-.-.-.-.\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nIs it all about drugs? Is it not?\r\nSeems to me that it depends on how intelligent and creative the artists are, no?\r\nI mean, really, either they could only have come up with such imagery if they were on acid or they could have actually used their imaginations of their own volitions. \r\nIn the end no one will ever REALLY know.\r\nWhat I see, though, is a lyricist influeneced heavily by Lewis Carroll writing yet another song in that vein. A lyricist who was taken to poking fun at those who would interperate the lyrics. Much like Carroll with regards his writings, by the way.\r\nYES, there's the easy parallel with Carroll and his alleged LSD use but, it's way too easy.\r\nPersonally I think it's a bit of tongue-in-cheek fun mixed with the child-like imagination most of us forget when trying to grow up. \r\nTo me it's a song that speaks with the perspective of the wonder, beauty, fantasy, and perfection of youth. \r\nI'd think it an insult to The Beatles to assume they were so unable to think imaginatively without the use of drugs. \r\nBut so long as it supports your rationalizations...\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nI Just Don't Get It.\n\r\nLet me loose in the 60's, I would've been a legend.\n\r\nI guess all you had to do back then to be famous was do acid, and smoke pot. I do that know, and can come up with way better stuff than \"tangerine dreams and marmalade skies\" stupid. sOrry, Beatles are overrated IMO\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\njust to shut everyone up and clear up the question about whether this song is inspired by LSD it is:\n\nnews.bbc.co.uk/2/hi/entertainment/…\n\r\nIn an interview published in this month's Uncut, Sir Paul admitted drugs \"informed\" much of the Beatles' music.\n\r\n He added it was \"pretty obvious\" that Lucy in the Sky with Diamonds was inspired by LSD, and other songs made \"subtle hints\" about narcotics.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nThe lyrics stink of being on drugs.  It might be LSD, just because of the Lucy...Sky...Diamonds, but if you think about the song, it has no plot.  It's a fantasy.  I don't see how any of the verses come together to form a plot or story.  What does Lucy have to do with any of the verses?  I don't get it.  It sounds like something someone would think up while on drugs.  The only consistent meaning I get out of it is that John is trying to describe some weird fantasy.  Notice he talks about being on a boat, then taxi, then train.  Why does he mention these modes of transportation?   Who is Lucy and why does she keep showing up?  Head in the clouds sounds like being high.  Lucy keeps showing up...  Could go on and on.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nweeklystandard.com/Content/Public/Articles/000/000/004/…\n\r\nread and decide for yourselves\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nOkay, I didn't read the nine pages of comments (because even I have better things to do) so I am probably just reiterating what everyone else has already said but the song was based on a picture John's son Julian drew of his friend Lucy. John saw it and was inspired. He later said that Lucy was sybolic of his perfect women he hadn't yet met and that that women turned out to be Yoko Ono. I bet he noticed the 'LSD' in the title before releasing it but the drawing actually does exist (I think Julian Lennon owns it now, but I'm not sure). I think John also said that some of the lyrics were inspired by 'Alice in Wonderland' but I don't remember. Maybe it was some other Lewis Carroll story.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nThis is not an LSD influenced song.\r\nPaul and John exchanged lyrics\r\nwhich they thought were psychedelic.\r\nLike..\"kaleidoscope eyes\" was John's idea.\r\nand so and so forth. \r\nI mean..The Beatles admit if a song is drug influenced or not..\r\nlike..Ringo Starr and everyone else admitted that \"Day Tripper\" was about drugs.\r\nSo I don't think\r\nthey will be \"lying\" about this one..,\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nTo add my previous comment,\r\nas we all know,\r\nthe original inspiration came from\r\nlittle Julian's \"watery and blurry\" painting.\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nits the ninth page for christ's sake drop the LSD stuff\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nwhy dont all of you that want to believe the song isnt about drugs get off the drugs you are on and realize that it is. it would make absolutely no sense whatsoever for a band practically notorious for drug use to make a song that has completely (off the wall) lyrics just so containing the letters LSD that isnt about drugs.  Its an awesome song about drugs and theres nothing wrong with that so whats the big deal.\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\ni like this song because i like LSD\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nLooking glass ties? Cellophane Flowers? Newpaper Taxis?\n\r\nWhat fucking kid draws that?\n\r\nWell someone was doing Acid, whether it's LEnnon or his son. hahahha\n\r\nPretty good for a beatles song\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nOf course it's about LSD.\r\nAnd yes the Beatles said it wasn't... well guess what, they lied.\r\nYou have to be an idiot to think that its about some little girl floating in the sky.\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nThe song is abou LSD prove is in the lyrics: LSD= LUCY...SKY...DIAOMDS.\r\nThe fact that 'licy is flying high in the sky is enough evidence to prove what this song is morally about. I love this song it is by far the best beatles song.\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nit is about lsd johns son wasnt born yet when they did the sgt peppers album so ha\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nHow in the world could this song be about LSD hallucinations when John Lennon didnâ\u0080\u0099t take LSD until 1965 (which he was not aware of since a friend of a friend slipped it in his drink)? This song is NOT of something immoral, but the complete opposite. Itâ\u0080\u0099s of a childâ\u0080\u0099s innocent, beautiful, surreal imagination; and not just any child, but HIS child, Julian. So of course he would shine this topic in the brightest of lights. Itâ\u0080\u0099s a shame that people misunderstand and just jump to conclusions. But of course this wasnâ\u0080\u0099t anything new to John Lennon since he was misunderstood throughout his whole life. \n\r\nJohn Lennon is my idol.\n\r\nLucy in the Sky with Diamonds is my favorite song.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nthis song sucks.....ha just kidding! um i heard that it might have to do with LSD. either way i really like it.\r\ndum dum dum...LUCY IN THE SKY WITH DIAMONDS!!\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nIt's not about LSD. They didn't realize the acronym until afterwards.\n\r\nThe song's very dream-like to me...tangerine trees, kaleidoscope eyes...\n\r\nI like it very much, as you can probably tell by my user name. It's signifigance was given to me by \"I Am Sam\" with Sean Penn and Dakota Fanning. An amazing film.\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nanother word to describe it: whimsical\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nOk, for baby_blue, it was his son Julian who was born April 8, 1963, and Julian came home with the picture of Lucy-in the sky with diamonds in 1966.  She was a girl at nursery school he knew... All the beatles, and Julian, back up the story.  The rest of the psychadelic parts in the song go back to Lewis Carroll and \"Through the Looking Glass.\"  I usually don't like covers of Beatles songs, but I think I like the Elton John and \"Dr. Winston O'Boogie\" version better than the beatles one... check it out!  Also, look up Lucy in the Sky with Diamonds on Wikipedia and you'll get more of the story...\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nIt's based on a passage in \"Through the Looking Glass.\", which John found to resemble an LSD trip. I doubt the title was a deliberate reference to the drug, though- you can find various photos of Julian Lennon's picture which inspired it, around the internet.\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nI hate those people who are saying that this is a drug song. It is NOT a drug song. Face it.\n\r\nIt is from Julian's painting.\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nSee how Lucy in the SKy With Diamonds was viewed by The Beatles themselves.\n\r\nRingo Starr: Lucy in The Sky With Diamonds and all the madness that went on around it was absolutely bonkers. I was actually with John when Julian came in with this little kid's painting, a crazy little painting, and John (as the dad) said, \"Oh, what's that?\" and Julian said \"It's Lucy in the sky with diamonds.\" And then John got busy.\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nPaul McCartney: I showed up at John's house and he had a drawing that Julian had done at school with the title \"Lucy in The Sky With Diamonds\" above it. \n\r\n   Then we went up to his music room and wrote the song, swapping psychedelic suggestions as we went. I remember coming up with \"cellophane flowers\" and \"newspaper taxis\" and John answered with things like \"kaleidescope eyes\" and \"looking glass ties\". WE NEVER NOTICED THE LSD INITIAL UNTIL IT WAS POINTED OUT LATER- BY WHICH PEOPLE DIDN'T BELIEVE US.\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nJOHN LENNON: I saw Mel Torme introducing a Lennon/McCartney show, saying how \"Lucy In The Sky With Diamonds\" was about LSD. IT NEVER WAS, AND NOBODY BELIEVES ME. I SWEAR TO GOD, OR SWEAR TO MAO, OR TO ANYBODY YOU LIKE, I HAD NO IDEA IT SPELT LSD. This is the truth: my son showed me this strange-looking woman flying around. I said, \"What is it?\" and he said, \"It's Lucy in the sky with diamonds.\" and I thought, \"That's beautiful.\" I immediately wrote a song about it. And the song had gone out, the whole album had been published, and somebody noriced that the letters spelt out LSD. I had no idea, and of course after that I was checking all the songs to see what the letters spelt out. They didn't spell out anything, none of the others. IT WASN'T ABOUT THAT AT ALL.\n\r\n     The images were from Alice in Wonderland. It was Alice in the boat. She is buying an egg and it turns into Humpty-Dumpty. The woman serving in the shop turns into a sheep, and the next minute they are rowing in a rowing boat somewhere- and I was visualizing that. There was also the image of the female who would someday come save me- ' a girl with kaleidescope eyes' who wouls come out of the sky. IT'S NOT AN ACID SONG.\n\r\n*Taken From The Beatles Anthology.*\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nJohn and Paul admitted that some of their songs are about drugs (e.g. Got To GEt You Into My Life etc.) so why lie about this one?\n\r\nAnd really, the words on this song are very descriptive and beautiful. For me, that's what matters. And his son inspired him! That's really nice. So please, drop the LSD thing. I get depressed when someone is saying that this is an acid song. Because it is not. I feel sad because some people doesn't know the truth.\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nLOL @ D4MVP. Tangerine dreams? Yeah, and you call yourself better???\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nIf anyone doesn't know what Lucy in the Sky with Diamionds stands for, that's kinda wierd. The lyrics are all about LSD, because he sees random things like newspaper taxis and cellophane flowers. The change of mood from the verse to the chorus is just like LSD, because it apparently makes you get mood swings. GREAT SONG\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nYeah John looked at Julian's picture and decided, just out of the blue, no drugs involved, that it must have something to do with tangerine trees, marmalade skies, rocking horse people, and yes marshmellow pies.. riiight\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nLed to this song... :P pretty sweet song Gandalf\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nOoh, I can FEEL the sarcasm, jake69. You're \"riiight\". I don't know what to make of that.\r\nWhatever. You thoughts aren't my thought. But still, they were not on drugs with this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nI personally don't think that john was lying when he said this song was not about LSD. I mean, yes many of their songs were, but I don't think this one was. It was probably a consiouce decision, the whole acronym thing, but the song wasn't written about it.\r\nThis is one of the themesongs for \"I am sam\"\r\nGreat movie. A bit off topic there x]\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\n\"...rockinghorse people eat marshmallow pies ... as they grow so incredibly high\" 'Marshmallow pies' sounds like there saying 'mush...' anyone know what that means? hopefully you do\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nok, i realize some of you really wanted this song to be just about the julian's picture but...paul did an interview this year where he admited that this song was another one talking about drug use. sorry guys that are anti drug and don't want to think of this song that way. but its true, so get over it.\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nlook its about lsd...and it's not that big a deal. get over it.\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nsnopes.com/music/hidden/…\r\nread this ^\r\nit even has the picture that julian lennon painted.\r\nalthough i kinda of believe that the song was written while on lsd, i'm going to assume it wasn't.\r\ni think that the song might be about how children see the world completly differently than we do. so something like lucy floating through the sky with diamonds is completely possible and so are all of the other things described in this song. it could be like how kids live in this trippy fairytale land and how growing up makes your perspective change.\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\njust to add to my last comment.\r\nthe whole song sound like a story you would be telling a child.\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nThis is probably a stupid question but I'm not big into the beatles but uh, where is Julian now? is he still alive or what.. anyone every interview him?\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nlucy, sky, diamond = lsd...\n\r\nthis song is so great, it doesnt need a meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nthe real interpetation of this song is not related to lsd, his sons drawing or anything anyone has so far said. it is in fact, and i know this is true as the blue sky that John, the genuis himself wrote this song while heavily under the sedation of nitrous-oxyide, more commonly known as laughing gas. now i know it seems evident that it is in fact LSD, but if you look at the lyrics you can cleary see the truth. Picture yourself in a boat on a river...As you slip into the \"funk\" your put in under this drug you feel just that(reminding you he was sitting in a dentist chair)\r\nsomebody calls you you answer quite slowly...(the dentist and assistant were asking him questions, obviously) and girl with kelidoscope eyes (his dental hygienist is recalled to of had blue eyes and when the light hit the glasses it reflected to him almost like a kelidoscope) all the descriptions of his surroundings are relevant to a heavy dosage of n20.\r\nand your gone. you just fall completely out of knowing. the rest is self explanitory.\n\r\nthats the truth, theres nothing else to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nthe real interpetation of this song is not related to lsd, his sons drawing or anything anyone has so far said. it is in fact, and i know this is true as the blue sky that John, the genuis himself wrote this song while heavily under the sedation of nitrous-oxyide, more commonly known as laughing gas. now i know it seems evident that it is in fact LSD, but if you look at the lyrics you can cleary see the truth. Picture yourself in a boat on a river...As you slip into the \"funk\" your put in under this drug you feel just that(reminding you he was sitting in a dentist chair)\r\nsomebody calls you you answer quite slowly...(the dentist and assistant were asking him questions, obviously) and girl with kelidoscope eyes (his dental hygienist is recalled to of had blue eyes and when the light hit the glasses it reflected to him almost like a kelidoscope) all the descriptions of his surroundings are relevant to a heavy dosage of n20.\r\nand your gone. you just fall completely out of knowing. the rest is self explanitory.\n\r\nthats the truth, theres nothing else to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nthe real interpetation of this song is not related to lsd, his sons drawing or anything anyone has so far said. it is in fact, and i know this is true as the blue sky that John, the genuis himself wrote this song while heavily under the sedation of nitrous-oxyide, more commonly known as laughing gas. now i know it seems evident that it is in fact LSD, but if you look at the lyrics you can cleary see the truth. Picture yourself in a boat on a river...As you slip into the \"funk\" your put in under this drug you feel just that(reminding you he was sitting in a dentist chair)\r\nsomebody calls you you answer quite slowly...(the dentist and assistant were asking him questions, obviously) and girl with kelidoscope eyes (his dental hygienist is recalled to of had blue eyes and when the light hit the glasses it reflected to him almost like a kelidoscope) all the descriptions of his surroundings are relevant to a heavy dosage of n20.\r\nand your gone. you just fall completely out of knowing. the rest is self explanitory.\n\r\nthats the truth, theres nothing else to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nthe real interpetation of this song is not related to lsd, his sons drawing or anything anyone has so far said. it is in fact, and i know this is true as the blue sky that John, the genuis himself wrote this song while heavily under the sedation of nitrous-oxyide, more commonly known as laughing gas. now i know it seems evident that it is in fact LSD, but if you look at the lyrics you can cleary see the truth. Picture yourself in a boat on a river...As you slip into the \"funk\" your put in under this drug you feel just that(reminding you he was sitting in a dentist chair)\r\nsomebody calls you you answer quite slowly...(the dentist and assistant were asking him questions, obviously) and girl with kelidoscope eyes (his dental hygienist is recalled to of had blue eyes and when the light hit the glasses it reflected to him almost like a kelidoscope) all the descriptions of his surroundings are relevant to a heavy dosage of n20.\r\nand your gone. you just fall completely out of knowing. the rest is self explanitory.\n\r\nthats the truth, theres nothing else to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nthe real interpetation of this song is not related to lsd, his sons drawing or anything anyone has so far said. it is in fact, and i know this is true as the blue sky that John, the genuis himself wrote this song while heavily under the sedation of nitrous-oxyide, more commonly known as laughing gas. now i know it seems evident that it is in fact LSD, but if you look at the lyrics you can cleary see the truth. Picture yourself in a boat on a river...As you slip into the \"funk\" your put in under this drug you feel just that(reminding you he was sitting in a dentist chair)\r\nsomebody calls you you answer quite slowly...(the dentist and assistant were asking him questions, obviously) and girl with kelidoscope eyes (his dental hygienist is recalled to of had blue eyes and when the light hit the glasses it reflected to him almost like a kelidoscope) all the descriptions of his surroundings are relevant to a heavy dosage of n20.\r\nand your gone. you just fall completely out of knowing. the rest is self explanitory.\n\r\nthats the truth, theres nothing else to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nthe real interpetation of this song is not related to lsd, his sons drawing or anything anyone has so far said. it is in fact, and i know this is true as the blue sky that John, the genuis himself wrote this song while heavily under the sedation of nitrous-oxyide, more commonly known as laughing gas. now i know it seems evident that it is in fact LSD, but if you look at the lyrics you can cleary see the truth. Picture yourself in a boat on a river...As you slip into the \"funk\" your put in under this drug you feel just that(reminding you he was sitting in a dentist chair)\r\nsomebody calls you you answer quite slowly...(the dentist and assistant were asking him questions, obviously) and girl with kelidoscope eyes (his dental hygienist is recalled to of had blue eyes and when the light hit the glasses it reflected to him almost like a kelidoscope) all the descriptions of his surroundings are relevant to a heavy dosage of n20.\r\nand your gone. you just fall completely out of knowing. the rest is self explanitory.\n\r\nthats the truth, theres nothing else to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nthis song is so obviously about acid. do acid, and listen to this song then tell me it isnt. kaleidescope eyes.. you have to be kidding me that is the absolute description of lsd right there in itself.\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nAlright, anyone who says this song is not about drugs obviously knows nothing about drugs or the beatles. This is about LSD. What are the chances that John had a friend named Lucy and drew a picture of her in the sky with diamonds when that is exactly what acid is. That's like saying Jim Morrison wasn't talking about drugs in his music.\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nPlus Kronikk guy is right. If you ever do acid [one of the best drugs ever, I recommend it to everyone] then listen to this song and if you still think it's not about acid then your fuckin' stupid.\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nOk so the song is about acid, that's easy enough to understand. But as for the title being about LSD due to the initals is wrong.\n\r\nUp until his death John said consistanly that Julian, his son, brought home a picture of a girl named Lucy who is in the sky with diamonds, and therfore called it that. Now what child do you know would not call the title of a picture this? It's an easy this to imagine.\n\r\nJohn took this as the title and obviously lyrics to the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nI hate to rule out anyone's translation of this song.  I think that it was INSPIRED by the drawing; however it was largely about LSD...\n\nnews.bbc.co.uk/2/hi/entertainment/…\n\r\nPaul even said it was obvious. I'm sorry. He was in the group...he was closer to Lennon than you guys using wikipedia or say yer grandaddy had tea with him.  \n\r\nSo why do people try so hard to say it isn't about LSD?\n\r\n1) LSD is a drugs? Drugs are sooooooo bad. Omg..  Umm I bet these same people will get drunk and take perscription meds which are 10x as harmful for them.  \r\nAlchoholism is the most common addiction.  yet because it's legal it's good. heh. If this song were said to be written by Lennon after having a drink it'd be cool huh? \n\r\n2) Drugs inspire \"creativity\". This is true to some extent. So I guess people don't like to believe that some1 had an aid. They did it naturally.  Sorry to burst your bubble, but plenty of hippies did LSD and could never write a song that details the exerpeicne in such beauty and never did.  \n\r\nThe man has a gift of imagery and language and could translate an LSD experience into words and images.  Even doctors can't do that shit.  \n\r\nStop with the \"Omg oh noes drugs\" and do some research.  LSD/Mushrooms are nowhere near as harmful as your prescious alchohol.  \n\r\nThere's my rant\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nIf its not been said before, George Martin (who produced alot of Beatles stuff) said that this song was NOT about LSD. It's on the anthology, check it out.\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nPaul= closer than some producer. Paul said it was obvious.  Continue on in your denial.\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nmaybe it really is about LSD, so what? what's wrong about that? the song is great!\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\n\"climb in the back with your head in the clouds\" ... yeah, i'd refer that to LSD. ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\ndon't get me wrong - i have no problem with that; i like the song; it's haunting in that the vocals seem so dreamy but there's so much speculation and whatnot surrounding the song that creates a fear of the unknown ... and what is simply a dreamy voice is made by all these theorists to be something more; something too different ... it makes me nervous ...\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nIf it isn't about LSD, why is the video all trippy?\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nOn the one side there's the painting theory but at the same time the fact that lucy in the sky with diamonds spells out LSD is rather convenient!\n\r\nMaybe it's a coincidence or maybe it was intentional. At the end of the day I don't really think it matters if the title of the song is a reference to LSD or not. It's still a good song.\n\r\nOh and TheXFactor22, George Martin was not just \"some producer\", he pretty much produced all the Beatles stuff and was very close to the members of the band. He even played piano on some of the tracks. He's even been known as 'the fifth Beatle'! Just because he wasn't an official member of the band doesn't mean he wasn't instremental in the Beatles' success ergo, his comments should not be discounted so quickly.\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nit IS about LSD of course they denied it and said it it was bout johns son that drew a picture of his frind or wutever.-bottom line- Great song\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\ni also saw on \"The Drug Years\" on vh1 where it was talking bout LSD and then they mentioned this song and how it was bout acid\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nfor all u naive ppl who believe everything u read it is about LSD even if lennon or the producer said it wasnt,they arnt gonna come out and say it in an interview(even tho i have seen the dead admit that alot of their stuff was drug influenced)but any way its kinda of an unspoken thing we all know its LSD.get real guys everyone was stoned then(not sayin it was bad thing)\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nI didn't think the Beatles would be shy about just admitting it is about LSD especially as Paul McCartney famously admitted to taking LSD to the media in June of '67. That's what made me think that maybe Lucy in the Sky wasn't about LSD (didn't think they'd be shy about admitting it if it was). But that was before i found this article on the BBC website (news.bbc.co.uk/1/hi/entertainment/music/…).\n\r\nIn it, McCartney is quoted as saying it's \"pretty obvious\" that Lucy in the Sky with Diamonds was inspired by LSD...\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nwell bottom line it IS about LSD\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nit is about LSD hello? r u peeps retarded colidoscope eyes do u think she was in the for a long time? But even so i love this song and anyone who is a real beatles fan should love this song regardless or not its about drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nHave to say that Elton John's version IS better.  Both are great though.\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nJEEEESE OF COURSE LUDY IN THE SKY WAS ABOUT LSD...HAVE ANY OF U EVEN DONE LSD? THATS EXACTLY HOW IT IS....ITS NOT ABOUT NO STUPI PAINTING....pssh fucking retards...thats not even debate-able\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nThis song IS actually about acid.\n\r\nThe Beatles (and other bands) were coming under alot of scrutiny for their drug content in their songs (as more became known about drug abuse) which unlike today when you can have Eminem rapping about killing people etc was very frowned upon and record companys often wouldnt sign artists and places wouldn't allow bands to play that kind of music, so to cover themselves they fabricated a story of how the song was about a drawing Johns son made, therefore the real fans of their music would know what it was truely about while the facist conserative record companies were left in the dark.\n\r\nI believe Paul admitted recently that the song was indeed about LSD.\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nThis was at a time when being controversial actually took balls, The Velvet Underground for instance, they made several great songs during the 60s but since they were about Heroin, Prostitution and S&M, they recieved very little mainstream recognition.\n\r\nIf you enjoyed this song I really recommend checking out The Velvet Underground. Start with the song \"Heroin\"\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\npenthouserocks:\r\nAlright, anyone who says this song is not about drugs obviously knows nothing about drugs or the beatles. This is about LSD. What are the chances that John had a friend named Lucy and drew a picture of her in the sky with diamonds  \n\n\r\nerm... he claims his son drew the pic. not him.\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nAnyone who has ever had good acid would agree, the song is CLEARLY about a particularly amusing LSD trip.  \"Kaleidescope eyes\", \"Cellophane flowers\" \"tangerine trees\"....come on people, John was making up a cover story with the whole \"my daughter drew a picture\" bit.  get some acid and see for yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nthere is no denying that the song is about a good trip, but his son DID draw the picture hence the name of the song, the lyrics followed afterwards\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nJohns son drew a picture of a girl, and john asked what it was. And his son said it was Lucy in the Sky with Diamonds, so John wrote a song about it. \r\nthis song.\r\nBut then a small uproar came, because  if you look at the major words in the title its \"LSD\"  LUCY in the SKY with DIAMONDS.\n\n\r\nyeah, ironic.\n\r\ni think john noticed, the whole title/LSD thing and ran with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nyeah i agree with the comment above. i dont doubt the story about johns son drawing a picture, but the song is still about lsd.\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nthis  song isnt about LSD. The intrepration of the song in \"Love by Cirque Du Soleil\" showd a small John with a picture then the song began.\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nthis song is about when johns son julian drew him a picture and thats what it looked like it is not about drugsss!\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nThis song started about the picture that Julian brought home but, it is about LSD\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nthis song was obviously written on acid.  \"CLIMB IN THE BACK WITH YOUR HEAD IN THE CLOUDS\r\nAND YOU'RE GONE.\"   this entire cd is very trippy throughout\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nWRITTEN on acid, maybe.\n\r\nABOUT acid?  NO WAY.\n\r\nIf anyone else claims that it is actually about acid, I'm pretty sure John Lennon will come back from the dead and beat the crap out of you.\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nI'm looking for directions to Paul's grave\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nI personally believe it has some references to drugs. Think about it... its probably about some crazy trip where he saw rockinghorse people eating marshmallow pies. another thing, the kaleidoscope eyes... thats definitely a psychedelic reference right there. kaleidoscopes are probably insane while high.\n\r\nand also, think about all the times the word \"high\" comes to play. first of all, the word is used, and second of all, the whole cloud reference.\n\n\r\nbut i mean, it may not be about LSD, but everytime i listen to it i think of drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nWell, I am a true Beatles fan and even I know that this song screams LCD. And--trust  me, it wasn't an accident. Lyrics like this don't happen \"by accident\".\n\r\nSo, uhh, know you know.\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nLennon's son, Julian, drew a picture about a girl, Lucy, who sat next to him in class. Julian gave his father and picture and described it as \"Lucy in the Sky with Diamonds\".\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nEven if you believe Lennon's story about the picture, how do you explain the line, \"Climb in the back with your head in the clouds/and your gone\"? How can you argue that someone as intelligent and self-conscious as Lennon did not mean that as a drug reference? (To compare, recall that Lennon suggested the line \"A mind can blow those clouds away\" for Harrison's All Things Must Pass to give that song \"a little bit of psychadelia\").\n\r\nLennon intentionally included psychadelic imagery and references on his songs beginning with \"Tomorrow Never Knows\" (nobody disputes that Lennon took that lyric from a book by LSD guru Timothy Leary). So whether the drug reference in the song title is intentional or not, this is a psychadelic song.\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nThis is my favorite Beatle song. It was written about a picture John's son drew. He drew a picture of a classmate named Lucy and John came up with the song. awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\ni first heard this song in i am sam. i didnt hear it soon enough. i think ill always have the image of Lucy, the girl in the movie. as really sweet, cute, beautiful girl. yes, movies fuck up minds.\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\n\"FOLLOW HER DOWN TO A BRIDGE BY A FOUNTAIN,\r\nWHERE ROCKING HORSE PEOPLE EAT MARSHMALLOW PIES.\r\nEVÂ´RYONE SMILES AS YOU DRIFT PAST THE FLOWERS\r\nTHAT GROW SO INCREDIBLY HIGH.\n\r\nNEWSPAPER TAXIS APPEAR ON THE SHORE\r\nWAITING TO TAKE YOU AWAY.\r\nCLIMB IN THE BACK WITH YOUR HEAD IN THE CLOUDS\r\nAND YOU'RE GONE \"\n\n\n\r\nno way that verse is written about a picture his song drew is about his ACID trip. and its all about LSD\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\ndumbassessss. this is definently about LSD they definently were under the influence during their dayys\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nyou people are stupid, just because they were on LSD at the time doesn't mean this song has to be about it. which it really isn't. this is just the sort of psychedelic stuff a lot of people were writing at the time. sure, this song and, um, EVERYTHING ELSE was INFLUENCED by LSD, but this song is just some stuff that John thought he'd write about a picture his son drew in art class. and i've seen the picture. so shut up.\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\nDuuuuudes. Its so about LSD. the lyrics are about examples of such experencies while on LSD, and the chorus \"Lucy in the Sky with Diamonds\", \n\r\n\"Lucy\", \r\n\"Sky\" and \r\n\"Diamonds\" \n\r\nBeing with L,S, and D. Quite simple if you look at it.\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nI am referencing wikipedia here but I've seen it written elsewhere so it is accurate\n\r\n'In a 2004 interview, Paul McCartney spoke openly about his Beatles-era drug use, revealing that songs such as \"Day Tripper\" and \"Got To Get You Into My Life\" were written directly about LSD and marijuana. When questioned about \"Lucy in the Sky with Diamonds,\" he noted that Julian's painting had inspired the song, but that it was \"pretty obvious\" that the song was about an acid trip.'\n\r\nI don't think anyone could have honestly really believed it wasn't about an acid trip. Those who say that are clearly very anti-drug and do not want to believe that such a good band were writting about drugs with no references to squalor, addiction and death. Or maybe you are just as stupid as that.\n\r\n'Today a young man on acid realised that all matter is just energy condensed to a slow vibration. We are all one consciousness experiencing itself subjectively. There is no such thing as death, life is only an illusion and we are all the immagination of ourselves. Here's Tom with the weather' - Bill Hicks 'Positive drugs story'\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nOkay. Anyone who's EVER watched ANYTHING about the Beatles knows that thins song is about LSD. Yes, his son did bring home a picture of Lucy, in the Sky, with Diamonds. Matter of fact, the actual picture is one display in the Beatles Memorial Museum in London. But He did realize the Lucy Sky Diamonds was an acronym for LSD. That's why he wrote the song. And what kinda of a moron do you have to be to think normal, sober people imagine rocking horse people eating marshmallow pies? I mean come one people, lets be real.\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nWho is singing this ? John or Paul ?\t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\nIts quite obviously about LSD during acid trips you experience things like seeing rocking horse people. Stop acting like the beatles are innocent musicians. They were druggies tryin to make a few bucks\t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nawesome song. first its john signing. second yes they did do drugs, im pretty sure everyone is aware of this, but this song is about a picture julian (john's first son) drew in nursery about a girl he liked, lucy, in the sky with diamonds, thus the song began. acid may have had a slight influence on some of the verses, but the main thing is that it began with the picture\t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\nThe concept album \"Sgt Pepper's\" dealt with contemporary, urban problems.  In this way, I'd go with Lucy in the Sky with Diamonds, with its psychedelic lyrics, talking about LSD\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\n*L*ucy in the *S*ky with *D*iamonds            *LSD*              genius\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\n\"CELLOPHANE FLOWERS OF YELLOW AND GREEN\r\nTOWERING OVER YOUR HEAD.\"\n\r\nThe Beach Boys/Brian Wilson released \"Pet Sounds\" in 1966, with the famous green and yellow cover.  On Brian Wilson's website, the above lyric is posted as a quote from Lennon pertaining to that album. \n\r\nAlso on the website, Sir George Martin says the following:\n\r\n\"If there is one person that I have to select as a living genius of pop music, I would choose Brian Wilson. Without Pet Sounds, Sgt. Pepper wouldn't have happened... Pepper was an attempt to equal Pet Sounds.\"\n\r\nOf course that's just one line, but if it's any indicator, nothing about Lucy in the Sky is about LSD.  That is the simple man's interpretation.  The true genius uses seemingly drug-induced images to commend fellow geniuses of the art!\n\r\nJohn got us good!\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\nI have the book. I've seen the picture of Lucy. I don't believe it's about LSD. Yes, The Beatles were druggies but they didn't exactly keep that a secret did they? I agree with GRNTOM, written while on LSD? obviously. written about it? not entirely. Oh and this song rules!\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nthis song is about LSD.\r\n'kaleidoscope eyes'\r\n'marmalade skies'\r\nOBVIOUSLY references to hallucinations and trips from LSD use\r\nsorry but you don't have to be a genius.\r\nanyway\r\nthis song is a total beauty\r\nits very close to my heart as it means a lot to somebody very close to me\r\nand i'll always love it\r\nThe last chorus of 'lucy in the sky..' makes me cry EVERY TIME\n\n\n", "comment_313": "\nthis song is about LSD.\r\n'kaleidoscope eyes'\r\n'marmalade skies'\r\nOBVIOUSLY references to hallucinations and trips from LSD use\r\nsorry but you don't have to be a genius.\r\nanyway\r\nthis song is a total beauty\r\nits very close to my heart as it means a lot to somebody very close to me\r\nand i'll always love it\r\nThe last chorus of 'lucy in the sky..' makes me cry EVERY TIME\n\n\n", "comment_314": "\nPaul wrote this song he said that he showed up at John's house and he had a drawing that Julian had done at school with the title 'Lucy in the Sky with Diamonds' above it. Then he and John went up to John's music room and wrote the song. ... Paul remembers coming up with 'cellophane flowers' and 'newspaper taxis' and John answered with things like 'kalleidoscope eyes' and 'looking glass ties.' they never noticed the LSD initials until it was pointed out later- by which point people didn't believe them.\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\ndear faggots, otherwise known as xhattyx and squidgey.\n\r\ncrawl out of your asses for at least 5 minutes, you are going to run out of air. John Lennon, and Paul McCartney have said repeatedly when asked that the titles a coincidence. Contrary to ignorant shite heads like yourselves, the song is written about a picture john's son, julian, brought home. when asked what the picture was, he replied \"lucy in the sky with diamonds\". The Beatles only realized the \"LSD\" abbreviation after an interviewer asked them about it. \r\nyou can see the picture here: beatlesagain.com/bpix/…\n\r\nand the trippy lyrics don't bloody mean that the songs about drugs. they were inspired by the chapter \"wool and water\" from \"through the looking glass\" by lewis caroll. \n\r\nI don't even know why I bother with you arses.\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nyeah i'm sure you did shite-for-brains. crawl out of your arse for more than 3 seconds you'd realize that your arguing for no reason. don't talk about shite you know nothing about you ignorant fuckhead.\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\nand fucking go ahead and read the chapter \"wool and water\" in the book \"through the looking glass\" you'll know where they got the trippy lyrics from.\n\r\nand again, julian's picture:\nbeatlesagain.com/bpix/…\n\r\ndon't be an stubborn jackass if you have no proof, faggot.\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nyeah, good luck with that, faggot. your whole, 15 year old self is welcome to try anytime. and again, i've shown proof, you haven't. in conclusion you are an ignorant fuck.\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nnothing gets me more pissed off than faggots such as yourself who need to swear and make empty vulgar threats. how the fuck do you expect anyone to believe that you talked to sir paul fucking mccartney? and sure you can threaten me with all 2 inches of your puny excuse for a dick, but it won't change the fact that your a stupid little faggot, born in 1992, that knows nothing. \r\n      and thats the thing about proof, \"aunt faggot\", if you have it, you can win an argument, if you don't you lose. and your lack of proof and increasingly vulgar posts \"prove\" that you are arguing for the sake of arguing. \r\n         Paul McCartney would do better than discuss his song interpretations with a little bitch of a 15 year old such as yourself. Do me a favor, quit it with the fucking horny threats and argue me like a fucking man, with facts or points rather than insults.\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nand I don't live with my parents dumbshit. nice try with that one, we aren't all little bitches who cry to mommy when the other kids argue with us.\t\t\t\t\n\t\t\t\t\n\n", "comment_321": "\new...he fucks his grandpa.\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nTaking things out of context I see? \n\r\n      \"nothing gets me more pissed off than faggots such as yourself who need to swear and make empty vulgar threats.\"\n\r\nI repeat the last part: \"who need to swear AND MAKE EMPTY VULGAR THREATS.\"\n\r\nfind one vulgar threat that i made, i dare you, i double dare you motherfucker.\n\r\nand i'll bet those few fucking words with paul were about Lucy in the sky. thats rich. and i never asked you to get proof. i merely said DON'T TALK IF YOU DON'T HAVE PROOF. and you shouldn't. you can call my proof invalid all you want, but i can back it up with interviews.\n\r\nand what kind of douchebag sets there birthdate to make them look 14? I doubt if someone could track you down by your birthdate. \n\r\nI almost had a newfound respect for you there, i thought you'd get through a whole post without talking about licking your uncles balls, or fucking a baby. but i guess once again your vulgar, childish, had to put in that last sentence.\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\nfinal proof that this song is in fact about LSD\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\nnews.bbc.co.uk/2/hi/entertainment/…\n\n\n", "comment_325": "\nWell okay you all say the song is about drugs,\r\nothers say its about some painting that his son made,\r\nboth very logical ideas.\n\r\nBut really hasnt anyone thought that he was using imagery that appealed to the public,\r\nSeriously its poetic,\r\nespcially to someone that is tripping of LSD.\n\r\nThe song it self may not be about LSD but they knew that it would appeal to those people,\r\nBottom line The Beatles did do drugs,\r\nbut so did almost every band during this period.\n\r\nI love this song because its visionary, if you take the time to listen to it youll see it every last bit of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\nWell okay you all say the song is about drugs,\r\nothers say its about some painting that his son made,\r\nboth very logical ideas.\n\r\nBut really hasnt anyone thought that he was using imagery that appealed to the public,\r\nSeriously its poetic,\r\nespcially to someone that is tripping of LSD.\n\r\nThe song it self may not be about LSD but they knew that it would appeal to those people,\r\nBottom line The Beatles did do drugs,\r\nbut so did almost every band during this period.\n\r\nI love this song because its visionary, if you take the time to listen to it youll see it every last bit of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nhallucigenics\t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nalrighttt im sorry for completely secluding myself from this uhhh.. lets see.. 13 page ridiculous quarrel about whether or not this great song is about lsd or whatever..\n\r\nbut to me, this song is a love story.\r\ni think this song is about a boy who meets a girl.\r\nand it seems like this song is like in some time frame.\r\nhe's recalling the moment or the time he meets the girl..\n\n\r\n\"picture yourself in a boat on a river with tangerine trees and marmalade skies, somebody calls you, you answer quite slowly, a girl with kaleidoscope eyes.\"\n\r\nand the both of them shared something, a love maybe, or atleast she has had some sort of effect on him, and for some reason something goes wrong, and the both of them part, or maybe she leaves him..\n\r\n\"look for the girl with the sun in her eyes and she's gone\"\n\n\r\nand so this boy is haunted by this girl who has left him. he cant seem to let her go. i dont know, maybe he sees her in the night time sky.. in the stars maybe..\n\r\n\"lucy in the sky with diamonds\r\n lucy in the sky with diamonds\r\n lucy in the sky with diamonds..\n\r\nand the repetition of these words emphasizes his longing for her.\r\nhe follows her and tries to go out and look for her\n\r\n\"follow her down to a bridge by a fountain..\"\r\n\"newspaper taxis appear on the shore waiting to take you away\"\r\nclimb in the back with your head in the clouds  and you're gone\"\n\r\nso the boy goes after this girl, and he has his head up in the clouds cause hes just so in love with her.\n\n\r\n\"picture yourself on a train in a station\r\nwith plasticine porters with looking glass ties\r\nsuddenly someone is there at the turnstyle, the girl with kaleidoscope eyes.\"\n\n\r\nso the boy goes off on a train to go out and look for her and oh look shes right there, lovers reunited atlast...well yeahhh you get the point.\n\r\nso yupp, thats what i think this song is about\r\nbut yeah, whoever made that comment was right; i dont understand why the lyrics are written in caps.. it totally ruins the whole purpose of the song for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nKid, i was just voicing my opinion on what i think this song is about. Notice how the caption above the comment box says  \"What does this song mean to you?\" ?\r\nGet that stick out of your asshole and chill.\n\n\n\r\nOh and by the way..\n\r\n\"foxtrot41 I want to apologize for arguing with you before, but only in the hope that you will have hot passionate pity sex with me in the childrens toys section of WalMart.\"\n\r\ni like how you made that real mature comment about someone and then logged on the very next day just to see a reaction, except you were disappointed to see that there was no reaction from foxtrot41, only a comment about the song by me instead. You know, that is what this whole site is for, to share opinions on a song. You amuse me.\t\t\t\t\n\t\t\t\t\n\n", "comment_330": "\nI just like the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\nthis song reminds me of alice in wonderland\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nthats too much of a coincidence. its clearly about LSD\t\t\t\t\n\t\t\t\t\n\n", "comment_333": "\nDude, John Lennon was an excellent songwriter.  Why can't all the songs that \"supposedly\" have to do with drugs have double meanings?  The references are just way too much.  So maybe the meaning he gives to the press and the mothers of the little children who listen to his music are right, and the drug related meanings are right, too.  When you're a great songwriter like john lennon, you don't have to think either/or.  You can think both/and.\t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nsure it could be simply about a particular LSD trip, but it could also have some meaning...\r\n\"NEWSPAPER TAXIS APPEAR ON THE SHORE\r\nWAITING TO TAKE YOU AWAY.\r\nCLIMB IN THE BACK WITH YOUR HEAD IN THE CLOUDS\r\nAND YOU'RE GONE.\"\r\nThat could mean that where ever they went there were repoters and photographers and once you answer one question, they don't let you stop.\r\njust a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_335": "\nI think its a bit of both...he probably saw his son's picture than did LSD and hallucinated about it and wrote this song. Honestly I don't think the Beatles wrote with extreme seriousness on every song and expected people to find meaningful metaphors and life lessons. and Like every band back then was on drugs and wrote while on them,  its not a big secret. Yes, the song is trippy as with many of their songs. Just think of it this way: \"Lucy in the sky with diamonds\" is what John was feeling at the time whether it be drugs or not and face it it does make a catchy song. But point is Lennon is gone and we'll never know what its truly about so just enjoy the musicality of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\nokay forget what i said, i just read the song over twice again and came to the conclusion that Lennon was definately on drugs when he wrote it: \"where rocking horse people eat marshmallow pies\" WTF?!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\nHere is the URL of an image of Julian Lennon's picture of his classmate Lucy.\n67.19.222.106/music/graphics/…\n\n\n", "comment_338": "\nFirst of all who cares if it was about LSD or not. We all know they used drugs, so it probably was about LSD. Even if his son said \"daddy, its a picture of LUCY in the SKY with DIAMONDS\" im sure his son didnt say \" daddy, i also have another picture im working on with marmalade skies, kaleidascope eyes, head in clouds, and newpaper taxis\"  so lets assume its about drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_339": "\nits definatley got very acid-related images....really strong beautiful ones, of course....\n\r\nbut anyone who's read/watched the beatles anthology knows that julien made john a picture and when john asked who the girl in the picture was, julien replied by saying \"thats lucy in the sky!\"\n\r\n....like father like son?\n\r\nbut hands down one of the best songs ever written.\t\t\t\t\n\t\t\t\t\n\n", "comment_340": "\nCan't it be both? I mean the whole point of a song is to have a message, but everyone brings their own message to it. Personally, I had never thought of it in the way brwnEyedgal put it, but that makes a lot of sense.\n\r\nI personally find the song somewhat haunting. Sure there's a lot of childlike wonderment in it, but it's also a very strange environment being described. For some reason, \"a girl with kaleidoscope eyes\" always makes me shiver.\t\t\t\t\n\t\t\t\t\n\n", "comment_341": "\nSuch a dreamy song, love it. Can anyone recommend me more of such songs?\t\t\t\t\n\t\t\t\t\n\n", "comment_342": "\nYet another overrated song from an overrated band, the lyrics are meaningless crap, I don't care if it's about drugs or not (though it seems painfully obvious it is).  I guess I'm among the few who actually like lyrics to mean something.  (Though I hate the music as well.  Yes, I know I am a heretic.  Proceed with the stoning.)\t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nFIRST OF ALL strwberryf1ds you are so ignorant obviously you know nothing about the 60's. LSD was one of the most common drugs. hello woodstock ...who wasnt tripping face?! \r\nand as for pj10 and rockstar001...i agree with both of you\t\t\t\t\n\t\t\t\t\n\n", "comment_344": "\nAND ANOTHER THING...anyone who says this song was not based on a trip obviously has never tripped. and Julian was 4 years old when this song came out and to figure it must have been a year before it even came out they started working on it. so say that julian was about 3 or 4...how well do u think his drawings turned out..seriously fucking think about it\t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nI loveeeeeeee this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_346": "\nYES the song is about lsd, if you've ever tripped be fore you'd know by the lyrics (kaleidoscope eyes, flowers growing high) that it was describing a  psychedelic experience.   And that doesnt necessarily mean that the acronym was on purpose...  it could be,it could not...we'll probably never know for sure.\t\t\t\t\n\t\t\t\t\n\n", "comment_347": "\nhorsefabio is right. i've never tripped, but people have descibed it to me, and this sounds so much like everything they've said.\n\r\ni bet john wrote the verses about acid and the refrain about his sons picture, and named it and didn't even realise the acronym in the title until someone pointed it out to him. he probably then thought it the most hilarious thing and left it that way just to be funny and confuse people like us.\r\neither way, it's a good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_348": "\nI dislike it when people think they're so smart by saying things like \"IT'S ALL BOUT LSD! YOUR ALL WRONG! IM RIGHT! GET OVER IT!\"\n\r\nFirst of all, don't think you're \"enlightened\" or \"unique\" for believing it's about LSD, many before have reached the same conclusion. Second, it's not a question or right or wrong. You can make your own interpretations of songs. And finally, not every musician in the 60s was into drugs, and not every musician who was into drugs only wrote songs about drugs.\n\r\nSo I don't think this song is about LSD (I think it is about the drawing), and anyone's free to disagree with me. Just don't act as if I'm an unenlightened idiot for thinking that.\t\t\t\t\n\t\t\t\t\n\n", "comment_349": "\nI'm guessing sean13 probably likes Blink182 and Greenday.\t\t\t\t\n\t\t\t\t\n\n", "comment_350": "\nI heard it was a symbol of the drug L.S.D. That's why it's [L]ucy in the [S]ky with [D]iamonds. Just saying...\t\t\t\t\n\t\t\t\t\n\n", "comment_351": "\nI would just like to point out that, contrary to popular belief, John Lennon did NOT write this song about LSD. He based this song off of a drawing his son brought home depicting his son's friend Lucy in the sky, surrounded with what appeared to be diamonds, and about the world that this one drawing created in Lennon's head. Just to clear that up. I think it's funny that people are so quick to believe a band of paparazzi nobodies, but not a brilliant aritst telling his fans where he found his inspiration for this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_352": "\nI would just like to point out that, contrary to popular belief, John Lennon did NOT write this song about LSD. Lennon based this song off of a drawing that his son brought home of a girl named Lucy, in the sky, surrounded with what appeared to be diamonds. The song depicts the fantastic world that unfolded in John's mind following when he saw the picture - he was inspired, not high. I think it's funny how people are so quick to believe a band of paparazzi nobodies, but not a brilliant artist telling his fans about how he was inspired. \n\r\nThis is my favorite Beatles song and always will be. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_353": "\nActually yes it is...and please  read the other comments before you post.  I  already addressed this...yes it's about the picture and yes it's about lsd.\n\r\nLennon admitted to doing lsd hundreds of times and this album has the most obvious references (btw, those who've done  acid numerous times, especially in a close period, know that it becomes hard to seperate the lsd experience from everything else in your life.. )- which shows in their music.\n\r\nAnd of  course they would  deny it...they had to.   What would the DEA do if they admitted that any song was about acid??  that would just be stupid on their part.\t\t\t\t\n\t\t\t\t\n\n", "comment_354": "\nIt is actually about Alice in Wonderland if you search it on google it will give you the exact words from John Lennon talking about it\t\t\t\t\n\t\t\t\t\n\n", "comment_355": "\nthis song may have been LSD induced but its not about LSD...i do cocain\t\t\t\t\n\t\t\t\t\n\n", "comment_356": "\nI like how this song is posted all in caps.  Forget about what this song meant to John.  What does it mean to you?  That's the most important thing of all.  To me, this song is about a glorious acid trip.\t\t\t\t\n\t\t\t\t\n\n", "comment_357": "\nTHIS SONG IS ABSOLUTELY ABOUT LSD!!!\n\r\nWatch the fucking music video!!  If you can say you really aren't convinced... you are probably borderline mentally retarded.  hehehe, they're all walking around in some cartoon fantasy land blowing rainbows out of their asses and having rivers of motley-colored flowers erupting out of their heads.  \"Tangerine trees and marmalade skies\" ?  Gheesus... that is a drug trip, my friends.  This is WITHOUT A DOUBT a drug-influenced song.  Take LSD for yourselves, or mushrooms or mescalline, and you will admit your mistake.  I have done so, and I can tell you the imagery both in the song and in the video perfectly describes the criss-crossing sensations and emotions of a psychedelic mind trip.  \"Kaleidescope eyes\" - check out a trippers pupils, and ask them to describe the visual pattern manifestations when looking at a light source/textured surface/wood grain.  It can look as though things are waving, or breathing, or forming insane mathematically-founded patterns, very much like those seen when looking through a kaleidescope.  I'm not making this\n\r\nThey denied it probably for two reasons:\n\r\n(1) As a joke, because it's so damn obvious that it IS about dropping acid and they knew some people would be dumb and gullible enough to believe anything they say without looking at the content of the lyrics and making up their own minds.    And:\n\r\n(2) They got a lot of heat in the media when paul and john admitted they had taken acid, and they didn't want to cause any more of a shit storm than was necessary, and admitting that they dedicated an entire ballad to singing the drug's praises would have indeed caused such a media shit storm.  Hell, they're literally shouting \"LSD!!! LSD!!! LSD!!!\" for the entire duration of the song.\n\r\nIf you truly believe that this song is about a picture john's son drew... hahaha my god.... you are either very stupid, very ignorant, very gullible, very much in denial, or some combination of the four.  Sorry, i don't mean to offend anyone, but it is ABSOLUTELY about taking acid.  Disregard for moment that the name of the song itself is an acronym for LSD and just look at the damn lyrics.  \n\r\nIT IS ABOUT DROPPING ACID.  100% certain.  Absolutely no doubt in my mind.  Don't kid yourselves, the Beatles loved their practical jokes, especially John.\t\t\t\t\n\t\t\t\t\n\n", "comment_358": "\nThe post above me is exactly what I was talking about in my other post. Believe it's about LSD if you want, but don't act as if other people are idiots for thinking it isn't. Because that makes you the idiot.\t\t\t\t\n\t\t\t\t\n\n", "comment_359": "\nThis thread has thoroughly amused me and prompted me to create an account here after months of reading others' comments. I find it funny that so many people keep saying 'who cares if it's about drugs, who cares if it's about the picture, can't we all just agree it's a great song and be happy and hug one another, blah blah'. This is a place for discussing .. song meanings, which would suggest that what it's about is actually important, not just the fact that it's a great song. Which it is. The Beatles were amazing.\n\r\nI can't claim with any real authority that it is about a drug trip, since I didn't write it, but that's my own personal belief. I won't repeat things that have already been said (and as this thread's extremely long, that leaves little left to say), but I do agree with those who've said that songs have different meanings for different people. That's the whole point of music. Where one person sees a song about a trip, another sees a fun, carefree Alice in Wonderland type song with no hidden meaning. I personally don't buy the picture explanation, or at least I don't believe that's the whole story, but I also agree with the person who said that they don't like it when people claim that their opinion is absolutely the right one and anyone who disagrees is obviously a naive idiot. Even in the box where I'm typing this unnecessarily rambly comment it says: 'What does this song mean to you?' It doesn't say: 'What is the exact, irrefutably correct interpretation of this song?'\n\r\nAlmost done, I swear. Last thing. Not that I think the title was actually meant to spel out LSD, but it's been said several times that it couldn't have been intentional because the letters are actually LITSWD. When making acronyms like that, words like \"in' and \"the\" and \"With\" are usually left out, so it very well could be. Just sayin'.\t\t\t\t\n\t\t\t\t\n\n", "comment_360": "\nJust thought i'd say, I haven't read all of the comments posted before. And I take it someone made the L.S.D link. Just thought i'd say, there have been alot of Beatles songs apparently about drugs which have all been denied. JUST READ THE LYRICS!\r\nIts just all about hallucinations! Since when have there been girls with kaleidoscope eyes? or tangerine trees? I have to admit, its genious lyrics. Then again, thats just the Beatles for you.\t\t\t\t\n\t\t\t\t\n\n", "comment_361": "\nThe beatles were good at putting subliminal sht in their songs and this song is no exception, though its not very subliminal because the lyrics describe a psychedelic experience, but nowhere in the song do they mension its about lsd, they're just describing a psychedelic experience which obviously means they have experienced the power of psychedelics.\r\nBack to the subliminal thing, look at the paul is dead hoax, all over their songs are references pointing to his death. for example, the song \" A day in life\" on the sgt. peppers album, theres a line in their that says \"he blew his mind out in a car.\" paul had supposedly died in a tragic car crash. Another reference is \"all you need is love\" at the end, lennon repeats the same line - \"We loved you yeah, yeah, yeah\" saying that paul is no longer around. Also theres proof on the front of album covers. I know it was just a hoax, but the question is: did they purposely put them lyrics in to create a hoax so that they would sell more albums? or did conspiracy theorists make it all up?\r\nIn my eyes, the beatles made this hoax themselves and lennon is a genious for doing so.\n\r\nhmmm... i might have gone a bit off track in this post but the bottom line is, this song was made and written about LSD in every possible way\t\t\t\t\n\t\t\t\t\n\n", "comment_362": "\nThe lyrics in this song were definately directly influenced by lsd. Whether or not lucy in the sky with diamonds is an abreviation or if its the name of a little girl doesnt matter. There is no way he wrote these lyrics without doing lsd. Your not gonna understand lsd unless you try it, people that make assumptions about it are mostly wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_363": "\nDo you honestly think he is gonna tell you every reason behind the lyrics of his songs. This song IS about lsd, it is so far out there it can not be anything else. Why do you think he says to picture yourself? besides the fact that this song is an abbreviation for lsd, the lryics in the song pretty much explain themselves. I'm sorry if you dont believe in doing drugs, but its a known fact they did lsd, and if any song is about lsd this one is\t\t\t\t\n\t\t\t\t\n\n", "comment_364": "\nit is about LSD hands down4e\t\t\t\t\n\t\t\t\t\n\n", "comment_365": "\nI meant \"down\" for fuck's sake\t\t\t\t\n\t\t\t\t\n\n", "comment_366": "\nYou're a fool if you don't think this song is about LSD.\t\t\t\t\n\t\t\t\t\n\n", "comment_367": "\nGenius.\t\t\t\t\n\t\t\t\t\n\n", "comment_368": "\ni think it's about doin acid. and even if the kids painting thing is true. john was probably like \"oh, lucy in the sky with diamonds?\" and then was like....hmmm.. that sounds awesome.. then made the lsd connection himself and wrote a song called lucy in the sky with diamonds. about lsd. lol.... or maybe its just a joke by john cause...well... its funny to confuse masses of ppl.. lol\t\t\t\t\n\t\t\t\t\n\n", "comment_369": "\nLol not about drugs \"the girls so incredably high\"\n\n\r\nlucy in the sky with diamonds  - in the with = lucy sky diamonds -_ucy _ky _iamonds =lsd\t\t\t\t\n\t\t\t\t\n\n", "comment_370": "\nYou people are idiots, John NEVER lied or denied what any of his songs were truly about whether it was heroin abuse, suicidal thoughts, or even beating his wife, so why would he lie and say this song was not about LSD if it is?? \n\r\nIt's NOT NOT NOT ABOUT LSD. It's based off Julian's picture and John, George, Paul, Ringo, George Martin, and JUILIAN HIMSELF have ALL said it and still have the picture to prove it. It's purely coincidence that the song spells out lsd!!\t\t\t\t\n\t\t\t\t\n\n", "comment_371": "\nYou people are idiots, John NEVER lied or denied what any of his songs were truly about whether it was heroin abuse, suicidal thoughts, or even beating his wife, so why would he lie and say this song was not about LSD if it is??\n\r\nIt's NOT NOT NOT ABOUT LSD. It's based off Julian's picture and John, George, Paul, Ringo, George Martin, and JUILIAN HIMSELF have ALL said it and still have the picture to prove it. It's purely coincidence that the song spells out lsd!!\t\t\t\t\n\t\t\t\t\n\n", "comment_372": "\nWe all know the beatles took drugs. However i thought this was song meanings?\n\r\nThe song was clearly about LSD, as his son coming home with a picture as mental as this is very unlikely.\n\r\nThroughout all of the lyrics he uses metaphors as to how he interprets things while he is on acid.\n\r\n\"PICTURE YOURSELF IN A BOAT ON A RIVER\r\nWITH TANGERINE TREES AND MARMALADE SKIES\"\n\r\nThis sentence is clearly reffering to the drug, as he wants the listener to imagine themselves in a 'boat' meaning to feel in there 'zone'. The place he describes is calm, also 'tangerines' and 'marmalade' are both orange/red, two colours which we link to acid trips.\n\r\n\"SOMEBODY CALLS YOU, YOU ANSWER QUITE SLOWLY,\r\nA GIRL WITH KALEIDOSCOPE EYES.\"\n\r\nThis sentence is clear also as while on LSD you feel heightened, or 'spaced out' which is why you answer slowly. Kaleidoscope eyes could either mean this is how he see's her eyes, or infact that she is also on LSD.\n\r\nIf anyone has ever taken acid they would know that a trip on LSD nowadays isnt as delirious as this, the LSD back then however was much stronger. The song was meant for people taking LSD, as at the time alot of the beatles fans took it. I personally have listened to this song and sat and laughed as i imagined all of these things as have alot of people. \n\r\nAll songs are produced to be listened to when you feel in a certain mood.  Sad songs are for when you feel down and need a good cry. Pop songs are for when your happy and feel like singing along. This song, as well as many other beatles songs, is similar to the reasons why people listen to trance, to make the individual feel 'in there zone'.\n\r\nThanx :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_373": "\nSo pretty much you're calling John Lennon, the man who wrote this song, a liar??\n\r\nLook any body can take acid and see double meanings in songs but just because the song has imagery to it doesn't mean it's about LSD. Imagery is used all the time in POETRY! \n\r\nJohn even stated that the \"Lucy\" was in the picture his son drew and he revamped her in his MIND of his \"perfect woman with kaleidescope eyes\" because at the time he did who she was. But at the time he stated that, he said \"Lucy\" was Yoko before he actually met her.\n\r\nJohn Lennon is probably rolling in his grave because people keep souring his name by making all his songs drug related.\t\t\t\t\n\t\t\t\t\n\n", "comment_374": "\nI totally agree wth Mr. Stormy lol. He probably saw the kids drawing and went after hearing the \"title\", he went....Lucy...sky....diamonds...? *GASP* lol. How convenient. These things do happen. it's totally about lsd AND his boys drawing.\t\t\t\t\n\t\t\t\t\n\n", "comment_375": "\nsnopes.com/music/hidden/…\n\r\nI just read the first few pages, so I have no idea what has been said recently...\n\r\nI think that the name was actually inspired by Julian Lennons picture,\r\nbut the song wasn't written about it... John Lennon probably liked the name \"Lucy in the Sky with Diamonds\" and planned to incorporate it into a song, and then did some drugs and wrote the rest of the song...\n\r\nI mean come on, type in the title in google images and you can find the original drawing; the name was inspired by that. However, I don't think the song was written about that; moreso just describing hallucinations, with the idea of his sons drawing in mind.\n\r\nTa.\t\t\t\t\n\t\t\t\t\n\n", "comment_376": "\nnah, this is definitely about LSD. the acronym is no coincidence. cmon people!\t\t\t\t\n\t\t\t\t\n\n", "comment_377": "\nI don't care what anyone says. LSD trip everywhere. Whats this about it being a picture his son brought home XD. Don't be mad. Im sure if I was getin abuse of the media about writing a song based on a funky trip. Id like to palm it off on me kids picture and save my carrier.\t\t\t\t\n\t\t\t\t\n\n", "comment_378": "\nTHIS SONG IS NOT ABOUT LSD!!!!!\n\r\nThis is an excerpt from an interview John Lennon had with Playboy in 1980 i believe it was.\n\n\r\nPLAYBOY: Did it trouble you when the interpretations of your songs were destructive, such as when Charles Manson claimed that your lyrics were messages to him?\n\r\nLENNON: No. It has nothing to do with me. It's like that guy, Son of Sam, who was having these talks with the dog. Manson was just an extreme version of the people who came up with the \"Paul is dead\" thing or who figured out that the initials to \"Lucy in the Sky with Diamonds\" were LSD and concluded I was writing about acid.\n\r\nPLAYBOY: Where did \"Lucy in the Sky\" come from?\n\r\nLENNON: My son Julian came in one day with a picture he painted about a school friend of his named Lucy. He had sketched in some stars in the sky and called it \"Lucy in the Sky with Diamonds,\" Simple.\n\r\nPLAYBOY: The other images in the song weren't drug-inspired?\n\r\nLENNON: The images were from \"Alice in Wonderland.\" It was Alice in the boat. She is buying an egg and it turns into Humpty Dumpty. The woman serving in the shop turns into a sheep and the next minute they are rowing in a rowing boat somewhere and I was visualizing that. There was also the image of the female who would someday come save me -- a \"girl with kaleidoscope eyes\" who would come out of the sky. It turned out to be Yoko, though I hadn't met Yoko yet. So maybe it should be \"Yoko in the Sky with Diamonds.\"\n\r\nClearly all the proof you need..... This and other interviews and misc. things about John Lennon including a petition to usher in John Lennon Day @ John-Lennon(.)com\t\t\t\t\n\t\t\t\t\n\n", "comment_379": "\nFace it this song is about LSD.  For those of you that think it was inspired by a picture by John's son did you ever once think that maybe it is a song about LSD that John got from a picture his son drew. Why can't it be both. But it is def about LSD.\t\t\t\t\n\t\t\t\t\n\n", "comment_380": "\nhave any of you people actually done hallucinogenic drugs? well if you have, then you will all know that this song describes what it's like to be on them perfectly. \" a girl with kaleidoscope eyes,\" is EXACTLY what it looks like,  \"answer quite slowly\" happens too. so if you think that this song is just about some painting, that's fine. it probably was inspired by a painting, but it was most likely not entirely about some picture. it sounds like he was recalling one of his trips and incorporated it in to a song. if you want to see whether it is about drugs or not, just do some shrooms or LSD and you will see.\t\t\t\t\n\t\t\t\t\n\n", "comment_381": "\nall these interpretations of this song inspired me to make an account.  Ok this is the meaning I see out of this song,  before i even knew there was a picture made by his son I always thought that the song was a drug reference AND had a strange tie to a childs imagination.  Most people that automaticly rail on the \"drug users\"  (which is usualy the funloving peaceful people that usualy listen to beatles.)  dismiss them with the picture.  sorry one more thing i noticed is nobody made the tie of the part of the song mentioning \"the sun\"  and an acid trip.  which is something that i heard happens to a lot of people on acid where a glowing yellow tone takes over their vision.  \r\nBut this is what i got out of the song...\n\r\nIf you keep the picture in mind i think when lennon got the picture he thought it could be a good song.  I think when he threw it across the band they realized the acronym and I think thats why the song seems to be pieced together at latter times.  but the meaning that i got out of it is how acid is similar to a childs imagination of bright colors and optimistic visuals.  it shows how so much of the visuals tie into the overemotional feeling on the drug (ex: the tone of the song after the line 'and your gone')  It could show irony in how LSD users are like children or trying to be children again.  or it could show how no drug can replace the feelings felt as a child.  thats just some things off the top of my head.  but the main thing that i have always gotten out of it is that it is a comparison of LSD and the raw imagination of a child.\t\t\t\t\n\t\t\t\t\n\n", "comment_382": "\nthis board is perpetually trolled by 13 year olds who don't know shit about drugs and thus refuse to believe that one of the greatest bands in rock history would EVER write \r\nsongs about LSD or pot.\r\nnay, not the Beatles.  never.\t\t\t\t\n\t\t\t\t\n\n", "comment_383": "\nLook, people. The Beatles were heavy drug users, theres no question about that. And, they wrote several songs about drugs, like Happiness Is A Warm Gun, Tommorrow Never Knows, and Rain just to name a few. So , just to set the record straight, I'm not some Beatles purist who claims The Beatles never took drugs or any of that bull. However, with that being said, \"Lucy in the Sky With Diamonds\" is most certainly not a drug song. Now let me explain:\n\r\nJulian Lennon, John Lennon's son, came home from school one day and showed his father a picture he drew of a girl in his class named Lucy. According to John, it was literally a picture of a girl, supposedly named Lucy, who was in the clothing of an angel, with bright colors for eyes (hence the \"kaleidoscope eyes part). She was in the sky, surrounded by diamond shaped stars. When John asked Julian what the picture was, Julian said, \"It's Lucy in the Sky, and with diamonds.\" John Lennon, being so inspired by his sons beautiful picture and imagination, got the idea for a song that would later become \"Lucy in the Sky With Diamonds\".\n\r\nNow, I'm sure all of you have heard that story. Now, where did the supposedly \"LSD inspired lyrics\" that had nothing to do with the picture come from? At this time, John Lennon was extremely interested in the writings of Lewis Carrol, who was a renowned poet and short story writer. He wrote mostly tales for children, such as Alice in Wonderland. If any of you are familiar with Carroll's works, you can see a great resemblance between his writings and this song. Lennon was inspired by him, and used his style of writing (vivid imagery) as the basis for some of his songs. That's where the trippy lyrics come from.\n\r\nAs a matter of fact, no one really considered \"Lucy In The Sky With Diamonds\" to be a drug song until Paul McCartney suggested it given the acronym \"LSD\". Then it became the accepted view of the song.\n\r\nSo, hopefully this has shed some light on the real meaning of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_384": "\nNow the lyrics were probably influenced by LSD, but not directly about LSD.\t\t\t\t\n\t\t\t\t\n\n", "comment_385": "\nHow about reading what I said\t\t\t\t\n\t\t\t\t\n\n", "comment_386": "\nif it's about drugs it wouldn't surprise me. the beatles always pulled publicity stunts like that.. just let it go and let the beatles songs be open to interpretation. there isn't a DIRECT meaning to it. chillll.\t\t\t\t\n\t\t\t\t\n\n", "comment_387": "\nDRUGSSSSSSSSSSSSSSSSSS\t\t\t\t\n\t\t\t\t\n\n", "comment_388": "\n(L)ucy in the (S)ky with (D)iamonds\n\r\nL.S.D  simple enough really\t\t\t\t\n\t\t\t\t\n\n", "comment_389": "\nwell.......he could have seen the picture his son drew of his friend and been inspired to write a fantasy song and of course the lsd helped the imagination run free...\r\nand are we not all glad it did!\t\t\t\t\n\t\t\t\t\n\n", "comment_390": "\nif one has a strong mind with the capacity to think and deal with abstractions, the use of 'drugs' can open doors and free you into the quantum unified field.\t\t\t\t\n\t\t\t\t\n\n", "comment_391": "\nOkay, clearly, I don't actually know the true answer to the meaning of this song, but I am getting a little annoyed with the way people so blindly trust every word john Lennon said.\n\r\nI mean, face it. He did do drugs. Not necessarily LSD, but I wouldn't count it out completely, especially not with this song.\n\r\nAnd I mean, if people are accusing him of doing drugs, then he's going to deny it, whether it's the truth or not. Why would he just come right out and say. \"Yes, it is about LSD!\"? I mean, does that really sound like a sensible move? Not to me.\n\r\nSo, just because he said it was about his kid's drawing, doesn't necessarily mean it was. And just because it spells out LSD, doesn't mean it was on purpose.\t\t\t\t\n\t\t\t\t\n\n", "comment_392": "\nhaha john galt you're the man.\t\t\t\t\n\t\t\t\t\n\n", "comment_393": "\nyeah, johns son did draw a picture that he called lucy in the sky with diamonds, john did know that it was an acronym for LSD and of course intentionally made it the title as (L).ucy in the (S).ky with (D).iamonds\r\n*listen to this song on acid*\t\t\t\t\n\t\t\t\t\n\n", "comment_394": "\nto me this song will always be about LSD or the way the world seems when your doing it.. all of the illogical phrases.. the acronym... plus it is not a bad song to listen to when you are smoking.. and i'd assume tripping\t\t\t\t\n\t\t\t\t\n\n", "comment_395": "\nWhen I first heard this song as a very young man of say 12, I didn't have a clue what this song meant.  But what it meant to me was that songs can sound like fairy tales.  That somewhere someone could write music and lyrics that transported me to places only The Beatles could take me.  It meant that I didn't have to take things too seriously.  That my imagination was important.  That someone knew a girl named Lucy who had priceless gems and must have been an angel who lived in the sky.  Maybe she was real or just make believe.  It didnâ\u0080\u0099t matter.  It meant that sometimes lyrics donâ\u0080\u0099t have to make sense and I could enjoy them for their sound alone and not necessarily have to understand them.\t\t\t\t\n\t\t\t\t\n\n", "comment_396": "\nLSD is/was a chemical 'nudge' for mind expansion and or exploration, GOD's radio dial? ...Society and this 'reality' we reside within leads us to believe we need help in discovering ourselves, a pill, a drink, a religion, a political party, near death experience, labels over labels, etc.\n\r\nin John's 'Lucy', he was able to 'go there' without the nudge. Our minds can go places drugs cannot touch, open your mind, 'picture yourself', and you're there...or, as the observer beside you sees it, you're 'gone'. \n\r\nThe 'coincidence' of L.S.D. and Lucy in the Sky with Diamonds? Coincidences are all around us, 24/7/365/infinity/beyond...it's just the same 'dumbed down' minds do not recognize it all.\n\r\nJohn dreamed up beautiful worlds just like somebody dreamt the 'reality' we're living in today. Don't let the world tell you what to dream. Step into the boat, climb aboard the Crystal Ship. Everybody's here, and we're gone......Jim Morrison tried to lead us to, into and through the 'Doors of Perception', but everybody was too pre-occuppied by war and cursing the 'powers that be' while the boat floated down the river behind us...and it's gone?\n\r\nMUCH LIKE TODAY...\t\t\t\t\n\t\t\t\t\n\n", "comment_397": "\nI love how people think it has to be either \"The picture Julian drew\" or \"LSD.\"  Why couldn't it have been inspired by both?\r\nYou know, primary inspiration from the drawing, maybe a little push from drugs?\n\r\nI really don't know.\r\nBut I do love this song, no matter the inspiration. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_398": "\neven though it is easy to think this song is about drugs to the ignorant people who know nothing.obviously the beatles did do drugs.but john lennon's son did draw him a picture of his friend lucy from school floating in the sky with diamonds. it just so happend the acronyms for the first letter of each word are lsd. so he wrote a song about the picture with great imagination like the of a child.there you go idiots.\t\t\t\t\n\t\t\t\t\n\n", "comment_399": "\nI think those people who are getting all defensive and saying the Beatles had deeper meanings to their songs etc etc and that \"Lucy In The Sky With Diamonds\" is not about an LSD trip have clearly never done LSD.\r\nHonestly, they were good. But they are not gods. Just because people suggest this song's about LSD doesn't make it any less good. I've listened to this song a million times, and every time, all I get out of it is a massive trip. I have no doubt that the song could well have been inspired by Julian's drawing. Sure, makes sense. But Lennon was a nut. There's no way he just left it with his kid's drawing.\r\nI get drugs outta this song, but the inspiration for it makes sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_400": "\ni love this song. i love The Beatles. All of their songs are amazing and they just blow my mind. And anyone that says that their songs werent influenced by or referring to drugs is retarded. IM not saying they all are, but from \"HELP\" on every album has some kind of drug references.\t\t\t\t\n\t\t\t\t\n\n", "comment_401": "\nWhy is it that everytime John writes a great poetic song, people start about drugs?\r\nShould we do that with everyband nowadays? Is animal collective using drugs for creating such songs? Is Dark side of the moon about drugs? C'mon... grow up.... lyrics are just open for interpretation... and i think there was no special meaning behind songs like these, just funny words and sentences put together.\n\r\nWill everybody stop acting like babies and boo the beatles for drug use?\t\t\t\t\n\t\t\t\t\n\n", "comment_402": "\nyour all fucking retarded. its named after a picture John Lennons son drew. read the books? its not about LSD. John didnt even relize that until people started pointing it out\t\t\t\t\n\t\t\t\t\n\n", "comment_403": "\ni listened to this song after one of my friends mentioned it- she said i have \"kaleidoscope eyes\" because they change colors and have been every concievable color at some poing in time. anyhoo, so i listened to it to figure out what she was talking about and i love it. it's amazing, and i really don't care if the inspiration was lsd or a kid's drawing or both. what i wanna know is how everyone managed to drag this out over seven years. just get over it already!\n\r\nalso, has anyone ever noticed that lucy was also mentioned in \"i am the walrus\" in the line \"see how they fly/ LIKE LUCY IN THE SKY\"? who is this lucy chick and why is she so important? that's what i wanna know.\t\t\t\t\n\t\t\t\t\n\n", "comment_404": "\nok, maybe, the picture was made into a song by john, and it just so happend  that john was on acid while writing the song....And fucking back off you stupid maggots , who the hell cares if its about lsd or not, just sit back relax and enjoy the fucking song.\t\t\t\t\n\t\t\t\t\n\n", "comment_405": "\ndrugs the same old baby boomer story.\t\t\t\t\n\t\t\t\t\n\n", "comment_406": "\nJust because it's so vivid and bright doesn't mean it's about LSD.  When you fall in love, or have a child, or see the most beautiful girl you've ever seen...in your own mind there are fields of daisies and everything is so bright..the world is a game at your fingertips. You don't have to be on drugs for the world to be so colourful... just sayin'.\t\t\t\t\n\t\t\t\t\n\n", "comment_407": "\nthis is definitely about LSD..\r\nlisten to what they're saying \t\t\t\t\n\t\t\t\t\n\n", "comment_408": "\nthis song is so wow. who cares if it is about lsd? \t\t\t\t\n\t\t\t\t\n\n", "comment_409": "\nYou heard it many times, but yes, this song is about the drug, LSD. To be 'in the skies' it means that you are high. Plain and simple. And plus, who the hell sings a song about 'tangerine trees and marmalade skies' ?\n\r\nAnother of the great beatle hits ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_410": "\n100% about LSD not somestory read the lyrics definately about Lsd\t\t\t\t\n\t\t\t\t\n\n", "comment_411": "\nI flicked through a few pages and most of the comments seem to just argue whether the song is about LSD or some fucking watercolour. But \"it's an incoherent ramble about drugs! It doesn't make any sense!\" Surely some have some input about the lyrics?\n\r\nThe girl with the kaleidoscope eyes? What beautiful imagery.\t\t\t\t\n\t\t\t\t\n\n", "comment_412": "\nJohn said this song was about a crayon drawing his kid drew with a girl on a broomstick flying in the sky, and the stars were shaped like diamonds, but I strongly belive that it is an acronym for LSD, talking about cellophane flowers and rocking horse people eating marshmallow pies....it's a little obvious I would think\t\t\t\t\n\t\t\t\t\n\n", "comment_413": "\nIt's very much about LSD, or a different hallucinogen. The incredible descriptive writing is Lennon being Lennon but the way the situation changes in this song from being randomly on a boat in a river to being on a train in a station is representative of a hallucinogenic trip. You think you're one place and you come in and out of reality and find yourself in other places, but don't think anything of it. What's being  described also an effect of the drugs because sober people don't really see giant flowers and tangerine skies. I doubt that this song is inspired by Julian Lennon because John never really liked Julian for one and probably wouldn't release a single that he wrote about him. Although Hey Jude is about Julian, John didn't write that, McCartney did.\t\t\t\t\n\t\t\t\t\n\n", "comment_414": "\nit may have LSD connections.but he got the inspiration when his son Julian(age 4 at the time)came home with a drawing and said \"Thats Lucy in the sky with diamonds\".\n\r\nJulian lost complete contact with Lucy.but sent her flowers when he found out she was extremely sick.they still remain close friends.Lucy however is still extremely sick\t\t\t\t\n\t\t\t\t\n\n", "comment_415": "\nI agree with both interpretations of the song. If you just read the lyrics and think about an acid trip, it's totally compatible. But at the same time, I just read a story about the real \"Lucy\" who has Lupus, and that news story clarified the whole Julian Lennon's picture theory. So I think that Lennon got his inspiration from the picture, and decided to turn it into something he knew, LSD.\t\t\t\t\n\t\t\t\t\n\n", "comment_416": "\nI agree with both interpretations of the song. If you just read the lyrics and think about an acid trip, it's totally compatible. But at the same time, I just read a story about the real \"Lucy\" who has Lupus, and that news story clarified the whole Julian Lennon's picture theory. So I think that Lennon got his inspiration from the picture, and decided to turn it into something he knew, LSD.\t\t\t\t\n\t\t\t\t\n\n", "comment_417": "\nAs mentioned, John claimed it wasn't about LSD, it was about the picture that Julien drew in school. What John didn't mention, is that Julian was on LSD when he drew it. \t\t\t\t\n\t\t\t\t\n\n", "comment_418": "\nThis song is OBVIOUSLY about LSD.  Sir Paul McCartney himself told me that it is, and anyone who says otherwise is mentally retarded and needs to be forcefully raped by an entire homeless shelter.\t\t\t\t\n\t\t\t\t\n\n", "comment_419": "\ni see it as a song about imagination, about illogical things. everything in the world has to have logic but this song just puts it in a different perspective. similar to when you are on sid or like any halucinogen but i dont think its about drugs. just things you think when your on them\t\t\t\t\n\t\t\t\t\n\n", "comment_420": "\nJohn got the title 'Lucy in the Sky with Diamonds' from his son's drawing, but the actual lyrics are about Alice in Wonderland and somewhat about his dream girl who ended up to be Yoko.\n\n\r\nJOHN 1980: \"My son Julian came in one day with a picture he painted about a school friend of his named Lucy. He had sketched in some stars in the sky and called it 'Lucy in the Sky with Diamonds,' Simple. The images were from 'Alice in Wonderland.' It was Alice in the boat. She is buying an egg and it turns into Humpty Dumpty. The woman serving in the shop turns into a sheep and the next minute they are rowing in a rowing boat somewhere and I was visualizing that. There was also the image of the female who would someday come save me... a 'girl with kaleidoscope eyes' who would come out of the sky. It turned out to be Yoko, though I hadn't met Yoko yet. So maybe it should be 'Yoko in the Sky with Diamonds.' It was purely unconscious that it came out to be LSD. Until somebody pointed it out, I never even thought it, I mean, who would ever bother to look at initials of a title? It's NOT an acid song. The imagery was Alice in the boat and also the image of this female who would come and save me-- this secret love that was going to come one day. So it turned out to be Yoko... and I hadn't met Yoko then. But she was my imaginary girl that we all have.\" \t\t\t\t\n\t\t\t\t\n\n", "comment_421": "\nto each person a song takes on a different meaning, everyone is entitled to their own interpretation of the song. don't let others persuade you, but don't be thick headed about what you believe either.\n\r\nwhether or not its about lsd or a drawing, to lennon, it might mean one of these two things, but also, it might not. we don't know. nor will anyone ever be able to define that for him. \n\r\njust enjoy the song, the way you want it to be enjoyed. \n\r\npeace.\n\n\n", "comment_422": "\nForget The LSD Shit\r\nOne day, Julian Lennon (John's son) came home from school and showed John his drawing that he drew in class. The drawing was about a girl that Julian liked in his class, and her name was Lucy. Julian called his drawing \"Lucy in the Sky with Diamonds\". That is what inspired John Lennon to write this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_423": "\ni love this song so much!!!\n\n\n", "comment_424": "\nI've been listening to this non-stop since I heard the news about poor Lucy.\r\nRIP Lucy\t\t\t\t\n\t\t\t\t\n\n", "comment_425": "\nMaybe it's about a picture that was drawn by his son, but it's also a hidden reference to drugs.  Everyone seems to pick up on the Lucy in the Sky with Diamonds as an LSD reference.  There are also a couple of other drug references in the song, mainly about acid.  A lot of the imagery in the song is something you might see on an acid trip, if the dose is good, but I'm talking specifically about the girl with kaleidoscope eyes reference.  Anyone who has ever dosed or really knows about acid will tell you, kaleidoscope is a type of acid, like purple haze or black pyramid.  Purple haze formula is lost, BTW.  Also, a couple of more subtle references: EVERYONE SMILES AS YOU DRIFT PAST THE FLOWERS, if you've ever been on an acid trip, you know, you can't stop smiling.  Your facial muscles are sore the next day from smiling so much.  Somebody calls you, you answer quite slowly...You can't answer any other way, because your perceptions are slowed down, and sounds can seem drawn out, particularly speech. Also, the and you're gone...When on acid, your mind IS gone.  They don't call it a trip for nothing, and on a more generic note, that grow so incredibly high....Don't need to explain that one. \n\r\nThis song must be about drugs, I could see him missing the LSD acronym in Lucy in the Sky with Diamonds, but the rest of it?  It fits to neatly, it has to be deliberate. \n\n\n", "comment_426": "\nAll that being said, I guess it depends a lot on your life experience.  No one will ever convince me that this song is not about drugs, but I can definitely see inspiration for it coming from a kids picture.  Kids are naturally on acid anyway\t\t\t\t\n\t\t\t\t\n\n", "comment_427": "\nOk, anyone who says this song isnt about LSD, I have one question for you. Have you ever taken LSD? And actually TRIPPED? If so, and you still miss the meaning of this song, then your a silly person who needs to learn more about drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_428": "\nThey Be Trippen On  LSD \t\t\t\t\n\t\t\t\t\n\n", "comment_429": "\nAre you guys kidding?  You think this song is about a picture John's son drew in school.  Ok, think about this.... How many pictures do kids draw in school?  Where in the song does it mention anything about this picture... How naive do you have to be to believe that this trippy, crazy, nonsensical song is about an elementary school drawing?  If you wrote a song about tripping out on drugs, (while the lyrics are as innocent as they are in this song), are you going to tell the press; \"Oh yeah, we love LSD...and we decided that we were gonna trip out and go write a song.\"?  Probably not, you make up a story about what the song is about. You need straight-edge listeners, too. By the way: \n\r\nDuring a newspaper interview in 2004, McCartney was quoted as saying:\r\nâ\u0080\u009c \t\"Lucy in the Sky\", that's pretty obvious. There's others that make subtle hints about drugs, but, you know, it's easy to overestimate the influence of drugs on the Beatles' music. Just about everyone was doing drugs in one form or another and we were no different, but the writing was too important for us to mess it up by getting off our heads all the time.\n\r\nThe only reason he made up the story about the picture was because the beatles started loosing airplay in England because of drug-references.\n\nmsnbc.msn.com/id/…\n\n\n", "comment_430": "\nwhy argue about it being about lsd. i knew this is what all the comments would be :|\r\nittttttt is an epic song, i love the imagery\t\t\t\t\n\t\t\t\t\n\n", "comment_431": "\nthis is about the picture, but i think its also DEFINATELY inspired by an lsd experience, there is too many things he is singing about.\t\t\t\t\n\t\t\t\t\n\n", "comment_432": "\ncmon john, \r\nyou really expect us to believe that story about your sons drawing?\r\nits ok we all know what you were up to :D\t\t\t\t\n\t\t\t\t\n\n", "comment_433": "\nOkay. \n\r\nFirst off, I think /L/ucy in the /S/ky with /D/iamonds was influenced by LSD - I'm not convinced that it's just a mere coincidence that the nouns in the title spell out the acronym 'LSD'.\n\r\nHowever, I also think it's ridiculous that people are saying \"UGH he couldn't have written this without LSD\" because that's insulting. All you need is an imagination, and John Lennon had one. And Lewis Carroll had one. It's not SUPER hard to think creatively \"like a child\", even when given whatever conservative era.\n\r\nI sound like I'm contradicting myself, but I tried my best to communicate what I believe about this song.\n\r\nSpeaking of Lewis Carroll, there is no fucking way he was an LSD user. Carroll, aka REVEREND Charles Dodgson, was born in 1832 - LSD usage was obviously very rare during his time seeing as it was NOT synthesized until the 1930s which came 40 years after his death in 1898. Carroll was just trying to write a fun childrens' story.\n\r\n(I know that stating he's a reverend does not dismiss his 'odd' relationship with Alice Liddell, but weren't relationships of that nature fairly normal in that era? For example, I think Poe married his 13 year old cousin when he was 26, or something.)\t\t\t\t\n\t\t\t\t\n\n", "comment_434": "\nI can't believe it. John Lennon is still releasing songs long after his death.\r\nApparently he was working on a song but never finished it and recently someone has released a very similar song.\r\nPaul McCartney, who has parts of the original song recognised it and is trying to sue the artist that released the copied song!\r\nYoko Ono is helping but is already trying to claim rights to the song!\nyoutube.com/…\n\n\n", "comment_435": "\nArguments could be made on both sides.  But the strongest argument to me is that Julian and Lucy remember the drawing.  Julian even reached out to Lucy, when he heard she was ill.  John was a very sentimental (albeit complicated) soul. Give credit to John - he said it was about the picture.  The kids are real and remember the picture. There was no reason for fabrications.\t\t\t\t\n\t\t\t\t\n\n", "comment_436": "\nThis song is about a girl with lupus. Lucy died due to the disease.  If you don't believe me, here is my proof that you all need to shut up and acctually know something before you open your mouth!\n\nlupus.webmd.com/features/…\n\n\n", "comment_437": "\nIt is NOT about LSD. They said it wasn't and I believe the Beatles, seeing as they mentioned \"Yellow Submarine\" and such were about drugs. However, I read that a lot of the scenes came from \"Alice In Wonderland\" and didn't Lewis Carroll do drugs? So it STILL relates back to that.\t\t\t\t\n\t\t\t\t\n\n", "comment_438": "\nActually, the song wasn't about LSD. However, I read that Lennon took some of the images from \"Alice In Wonderland\" and Lewis Carroll took drugs. So one way or another, this song connects to drugs, even if unintentionally.\t\t\t\t\n\t\t\t\t\n\n", "comment_439": "\nDoes it really even matter if drugs were involved? Honestly, everyone has a different interpretation and it's been FORTY-THREE YEARS. I don't think it's about drugs, but for those people who do,let's forgive him.\t\t\t\t\n\t\t\t\t\n\n", "comment_440": "\nFavorite Beatles Song ^.^\t\t\t\t\n\t\t\t\t\n\n", "comment_441": "\nCould be both\r\nThe picture could be an LSD creation. Or, the acronym might have been a coincidence, the picture might have been an LSD creation, and the rest was LSD.\t\t\t\t\n\t\t\t\t\n\n", "comment_442": "\nThough it is pretty obvious Lennon was high when he wrote this song, it is just a coincidence that the title is an acronym for LSD. Hereâ\u0080\u0099s an excerpt from this great link explaining it all: snopes.com/music/hidden/…\n\n\r\nâ\u0080\u009cPete Shotton (Lennonâ\u0080\u0099s good friend) , who was a frequent guest at the Lennon home, verifies that John's son Julian actually did produce and name the painting that John claimed was the inspiration for the song's title: \n\r\nI also happened to be there the day Julian came home from school with a pastel painting of his classmate Lucy's face against a backdrop of exploding, multi-colored stars. Unusually impressed with his son's handiwork, John asked what the drawing was called. 'It's Lucy in the Sky with Diamonds, Daddy,' Julian replied. \n\r\n\"Fantastic!\" said John â\u0080\u0093 and promptly incorporated that memorable phrase into a new song. \n\r\nThough John was certainly ingesting inordinate amounts of acid around the time he wrote \"Lucy in the Sky with Diamonds,\" the pun was indeed sheer coincidence.â\u0080\u009d\n\n\n\n", "comment_443": "\nIf you've ever taken LSD it is completely and totally obvious that this song is about the drug. \t\t\t\t\n\t\t\t\t\n\n", "comment_444": "\ni find it funny when people make statements like : 'John Lennon clearly stated that he wrote this song because of his son's picture, and I don't see why anyone should doubt what he said' and 'Dude, I don't think John would lie'   lol u people act like he's holy or something he was a freaking rockstar  oh yea that's right famous people don't lie right 0_0 ?  loool\t\t\t\t\n\t\t\t\t\n\n", "comment_445": "\nthis song is definatley about LSD,\r\n1. have you seen the video? it's just like tripping out\r\n2. anyone who says the beatls were not on drugs is a twat, they were rock stars drugs was their lives and it is hinted in so many other songs\r\n3. they are obviosly gonna say that it was some picture that influenced it cos they dont want people knowing they are on drugs\r\n4. it's not just the fact that LSD is in the chorus, just listen too the lyrics in the verses, it pretty much describes what he saw when he was trippin out!\n\r\nbut still an amazing song one of my favourates\t\t\t\t\n\t\t\t\t\n\n", "comment_446": "\nwether its about drugs or a drawing, it still reminds me of that one girl that makes the beautiful scenery that much better\t\t\t\t\n\t\t\t\t\n\n", "comment_447": "\nNO CLUE what the song means, and not a big fan of it. However, some bozo wrote a Songmeanings journal entry entitled \"Lucy,\" and now I can't get this song out of my head! Thanks A LOT!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_448": "\nThis song is distinctly not about acid:  You don't meet Lucy until you come through the turnstyle at the end.\n\r\nIt is about the imaginings you've been fed about what LSD is like, actually, and as the larger meaning, it is about the media feeding the masses exaggerations and illusions (about anything).\r\nIt's not about what acid is, but about what acid is not.\t\t\t\t\n\t\t\t\t\n\n", "comment_449": "\nMost people think this song is based on LSD and the beatles were well known for using this however its really about a drawing johns son did of his friend lucy in the sky with diamonds and john added parts from poems from his childhood\t\t\t\t\n\t\t\t\t\n\n", "comment_450": "\nLove this song. The version on \"Yellow Submarine Songbook\" is the best. Has the best drum sound!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_451": "\nSorry if this has been mentioned before (I tried searching the comments but there are just too many!).  \n\nBut if you haven't heard it, you must imeediately go and listen to William Shatner's \"interpretation\" of this song.\n\nThe guy is such a self-parody, if you tried to parody him doing this song you could never match the over-the-top awfulness of it.\n\nFinding it on YouTube or wherever is left as an excersise for the reader.  ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_452": "\nUh, yeah - it is obvious what this song is really about - LSD!!!  What is so hard to believe about that?  A drawing?  That is a cute cover-up for the truth!!!  Listen to the lyrics, people!  Of course they would not admit the truth - too embarrassing!\t\t\t\t\n\t\t\t\t\n\n", "comment_453": "\nAll of you are right about that! This song is about LSD... John Fogerty did the same on his \" Lookin' out my back door\"\t\t\t\t\n\t\t\t\t\n\n", "comment_454": "\nThe Facts: This song was about acid. Even Paul said decades later why he stayed on the child's drawing story was beyond him. John had said (bragging if you will), that Paul did the whole concept thing by himself, and of course, the others came into the studio, not even at the same time, and filled in songs. But Paul did all this work and that John came in after all this work and very simply came up with the 3 biggest songs on the album in no time flat. Lucy, Benefit, and A Day in Life.. Of course, George got his standard 2 songs in.\t\t\t\t\n\t\t\t\t\n\n", "comment_455": "\nA lot of people are saying the song is about LSD and I was thinking about it... LUCY in the SKY with DIAMONDS\t\t\t\t\n\t\t\t\t\n\n", "comment_456": "\nIt's about LSD no ifs ands or buts about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_457": "\nIt was a ruse John saying it's not about lsd. Anyone who has taken it and listened to this knows otherwise. \r\nHe insisted though, stating 'she said she said' was his acid song. One of his acid songs more like. \t\t\t\t\n\t\t\t\t\n\n", "comment_458": "\nThis song is about a freaking drawing, and White Rabbit is about Peter-freaking-cottontail.....Yea  \t\t\t\t\n\t\t\t\t\n\n", "comment_459": "\nL ucy in The S ky With D iamonds......... too simple for a simpleton to unravel. Sir Elton John's studio engineers (Wizards on the order of The Transcendentally Great Alan Parsons, a Beatles auxiliary and ageless Master of British Rock Music Production ) muster up all of the space-age audio technology available for his production to make the SYNESTHESIA INHERENT IN THE SONG supernaturally vivid. They actually orchestrate the sound effects with the lyrics in real-time to emphasize dimensionality and textures to depict cerebral and somatic states of consciousness. And remember the Beatles ain't great for nothin'.\t\t\t\t\n\t\t\t\t\n\n", "comment_460": "\nLucy in the Sky with Diamonds = LSD\t\t\t\t\n\t\t\t\t\n\n", "comment_461": "\nAnyone who thinks John's not clever enough to come up with an alibi like this must not be a true fan or in denial. Anyway, I think this song was made before they were ready to be open about their drug experimentation. Think about the psychadelic imagery in the damn song and the L.S.D. initials become a pretty BIG coincidence! P.S. To song4julia and strwberryf1ds: If that's all you have to say, STAY THE HELL OFF THIS SITE! Who's with me?\t\t\t\t\n\t\t\t\t\n\n", "comment_462": "\nHuh? YOU'RE incoherent!\t\t\t\t\n\t\t\t\t\n\n", "comment_463": "\nI've heard both versions, and does it really matter?  It's still a good song.  (I, however, favor the non-drug involved explanation.  My choice.)\t\t\t\t\n\t\t\t\t\n\n", "comment_464": "\nYes, for all who are still uniformed, the argument about whether LSD played a role in this song was put to rest by Paul in 2004.  Why was it lied about for so long?  Well, I imagine it was probably a huge joke to watch how the discussion continued on and on about it for 40 years.  I don't know that there needed to be much more reason than that.\n\r\nBut here are the facts:  You can see the picture purported to be THE PICTURE by Julian.  If you haven't seen it already, go to slopes.com, type in Lucy in the Sky with Diamonds into the search bar, and voila!  And as you are looking at the picture, notice there are NO NEWSPAPER TAXIS, NO KALEIDESCOPE EYES ON \"LUCY\", NO ROCKING HORSE PEOPLE, NO TOWERING FLOWERS, NO LOOKING GLASS TIES OR PLASTICINE PORTERS, NO CELLOPHANE FLOWERS, NO BOAT, NO RIVER, AND NO TURNSTILE.\n\r\nTO SUM IT ALL UP, the only role the picture could have played ends up being ONE LINE of the song.  \"Lucy in the sky with Diamonds\".  Thats it.  So, while the picture may have been the inspiration for the title and one line, there is the entire rest of the song which remains unnaccounted for.  Now, be rational here:  If you were unaware of any details of who wrote this song, didn't know it was by the Beatles, but knew that the writer frequently dropped acid, what rational conclusion does that bring you to?  On a scale of 1-10, 1 being absolutely clear that LSD played no role whatsoever in this song, 10 being absolutely clear it did, anyone who ranks a 1 is so hopelessly, ignoratnly ignoring the facts (and the lyrics) that there is no point discussing it with them.  But with Paul 2004 statement, the picture being readily available to look at and compare to the song itself (which demonstrates the picture has very little to do with the actual song lyrics) and the fact that it is on an album filled with drug references, \n\n\r\nDO WE REALLY NEED TO DISCUSS THIS ANYMORE?  ANYONE WHO STILL...... STILL IS ADAMANTLY REFUSING TO BELIEVE THIS SONG IS FILLED WITH DRUG REFERENCES, DO US A FAVOR, JUST DON'T POST ANYMORE, OK?  DO YOURSELF A FAVOR, STOP MAKING YOURSELF LOOK LIKE A FOOL!\t\t\t\t\n\t\t\t\t\n\n", "comment_465": "\na realy bad song from one of the worst groups ever. the beatles suck. lyricly all they do is repeat previous lyrics. for no amount of money would i ever listen to this song again, i coulnt even finish the first time. if you like this song you need a life, and should start listening to other music. i hope i helped your dull life in the long run!\t\t\t\t\n\t\t\t\t\n\n", "comment_466": "\nIt's about LSD for any idiots out there! Lucy (L) Sky (S) Diamonds (D)\t\t\t\t\n\t\t\t\t\n\n", "comment_467": "\nA little less than a month ago, it was on YahooNews! that \"Lucy in the Sky with Diamonds\" ISN'T about LSD. It is about a girl named Lucy that John Lennon's son met. He drew a picture of her, in the sky with diamonds. When he showed his dad, and said \"Look, Dad. It's Lucy in the sky with diamonds.\" Or something along the lines of that. John Lennon's son was only in like kindergarten or 1st grade when he drew this picture, and I doubt he knew about LSD then, and I doubt he was on LSD when he drew it, sydbarrett5. Anyways, it is about a girl not LSD. \t\t\t\t\n\t\t\t\t\n\n", "comment_468": "\nso can anyone else see how this site is completely useless   every single song  especially this one  (being it has damn near 300 more posts then every other tune on here) when u check the meanings posted by users its splits right down the middle 50/50  its about \"this\" and then the others say no its about \"that\" and it seems they all got articles or interviews backing both sides up so if that's the case how am i ever gonna know the true meaning  WHEN YOU DON'T KNOW WHO TO BELIEVE    THIS SITE IS A WASTE OF TIME  THEY SHOULD HAVE  the guy who put this site up give his opinions on every song since he gots em on the site and then have everybody bicker about what the song really means\t\t\t\t\n\t\t\t\t\n\n", "comment_469": "\nHORRIBLE!! LSD?!\t\t\t\t\n\t\t\t\t\n\n", "comment_470": "\nYesterday, after more than twenty  years after I first listened to Sargent Pepper album I realised that all the songs are about Paul MacCartney's death and  Tha Beatles being forced to go on with a fake replacement called Billy Sheers. This song is about Paul dying after the car crash and his visions of a heavenly place. And probably he was on acid when he crashed. Sargent Pepper is Billy Sheers who was trained to replace Paul and became an inside enemy of the other Beatles so they called him Sargent because he was trying to take control over them.\t\t\t\t\n\t\t\t\t\n\n", "comment_471": "\nLucy in the sky with diamonds is about a ufo encounter that John Lennon had.\t\t\t\t\n\t\t\t\t\n\n", "comment_472": "\nFace it.  The song is about LSD.\t\t\t\t\n\t\t\t\t\n\n", "comment_473": "\nI will never understand the eternal popularity of the beatles , they got lucky and got famous . Lucky because they got the right deal from a big record company , famous because of lots of PR. Musically and Lyrically nothing very original or talented . Just overated pop , the first pop band that's all. Listen to their stuff now and it seems dated , bland and dull . \t\t\t\t\n\t\t\t\t\n\n", "comment_474": "\nKiddies, please, stop your bickering!\n\r\n\"Lucy In The Sky With Diamonds\" is NOT, I repeat, NOT about LSD. Please take the time to Google \"Julian Lennon\" and \"Lucy O'Donnell\". Lucy O'Donnell was THE Lucy from the song. She and Julian were friends from nursery school. They both vouched that the title of the song came from Julian in his attempt to tell John what was in his drawing. John freely admitted over the years that he DID write songs that were drug related, even going so far as to name some of them. Why in the world would he feel the need to deny the LSD connection to this song from 1967 through 1980? Having said all that, John's imagery in his lyrics were indeed very strong and \"trippy\", and his new found writing style may very well have emerged after he began taking acid. But the song was not intentionally written about drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_475": "\nthe beatles suck bob dylan and neil young are 10 times the songwriters lennon and mccartney are and they were only so big because there was no other big bands at the time in america and jfk had just got shot and american kids needed idols to look up to there success was due more to timing than to good music you want to listen to real gods? pick up Led Zeppelin II\t\t\t\t\n\t\t\t\t\n\n", "comment_476": "\nbeatles suck\t\t\t\t\n\t\t\t\t\n\n"}