{"comment_0": "\nIt sounds like a son who after loses his mother acts like its no big deal, and then later in life he realizes just how important she was to him. He tells the story out of order for dramatic effect so timeline-wise the story really starts with these lines:\n\r\nâ\u0080\u0098Rebel, my new last name\r\nWild blood in my veins\r\nApron strings around my neck\r\nThe mark that still remainsâ\u0080\u0099\n\r\n â\u0080\u0098Cutting the apron stringsâ\u0080\u0099 is a saying which means going off and being physically and emotionally independent from your mum, so he may have initially perceived her as a limiting force when he says things like â\u0080\u0098apron strings around my neckâ\u0080\u0099. With this verse he communicates his need to rebel at that point in life and to reject domestic life which was the domain of his mother. He has â\u0080\u0098wild bloodâ\u0080\u0099 in his veins and he wanted to get out and be independent. When he says â\u0080\u0098the mark that still remainsâ\u0080\u0099 it could mean a few things, either that up until this point he always remembered his mother in the negative light of someone he wanted to escape or alternatively it could mean that this negative relationship that he had with mother when she was dying has scarred him for life. \n\r\nHe then goes on to say that he left home young and that might be wrong but he knows that leaving home after she died isnâ\u0080\u0099t the problem here, it was his relationship with her. I think he puts this line in there about leaving home to say that he was always going to leave and go do big things anyway, heâ\u0080\u0099s not just leaving her specifically.\n\r\nIâ\u0080\u0099ll come to the chorus later, now we go back to the first verse where he is an adult looking back and he viewing his mother more fondly:\n\r\nâ\u0080\u0098Mama, she has taught me well\r\nTold me when I was young\r\n\"Son, your life's an open book\r\nDon't close it 'fore it's done\"\n\r\n\"The brightest flame burns quickest\"\r\nThat's what I heard her say\r\nA son's heart sowed to mother\r\nBut I must find my wayâ\u0080\u0099\n\r\nHere it looks like heâ\u0080\u0099s realized that she was wise in her own way and itâ\u0080\u0099s only as an adult can he understand that wisdom. The â\u0080\u0098brightest flameâ\u0080\u0099 line is interesting because it shows that he sees that she really did understand him and his extreme creation/destruction tendencies. For those who were wondering there is a line in Blade Runner where they say that â\u0080\u0098a star that burns twice as bright burns twice as fastâ\u0080\u0099 so the â\u0080\u0098brightest flame burns quickestâ\u0080\u0099 is a similar concept, ie being spent up by your lifestyle. Iâ\u0080\u0099m not surprised to hear James use fire metaphors after his pyrotechnics accident!\n\r\nNow the next verse:\n\r\nâ\u0080\u0098Mama, now I'm coming home\r\nI'm not all you wished of me\r\nA mother's love for her son\r\nUnspoken, help me be\n\r\nYeah, I took your love for granted\r\nNot a thing you said to me\r\nI need your arms to welcome me\r\nBut a cold stone's all I seeâ\u0080\u0099\n\r\nSo now heâ\u0080\u0099s ready to come back to that relationship with his mum after all the growing that he has done away from her. Heâ\u0080\u0099s a successful musician and he wants her to be proud but it sounds like he might not think that he was the best person. He wants her to help him and comfort him, heâ\u0080\u0099s ready for that guidance and love again. However, the sorrow at the heart of the song is that she died. He wants her to hold him in her arms but all he has got to embrace is her tombstone.\n\r\nPersonally I see the verses as being there to tell the story and I see the chorus and bridge as direct expressions of this sorrow:\n\r\nâ\u0080\u0098Let my heart go\r\nLet your son grow\r\nMama, let my heart go\r\nOh, let this heart be still\n\r\nLet my heart go\r\nMama, let my heart go\r\nYou never let my heart go\r\nSo, let this heart be stillâ\u0080\u0099\n\r\nThese chorus lines are far more ambiguous than the verses, so they could mean a lot of things. The pain he feels is pretty clear, in light of the story in the verses I think heâ\u0080\u0099s never been able to escape the pain of losing her, heâ\u0080\u0099s never been able to move on from that pain or be free of that pain. His motherâ\u0080\u0099s got his heart, ie he still feels extraordinary love for her and it pains him. So he seems to be asking to be free of that pain or at least to â\u0080\u0098let this heart be stillâ\u0080\u0099, which might mean he wants peace from this emotional turmoil.  You could interpret it literally that he wanted her to let him go when he was a teenager but it doesnâ\u0080\u0099t really fit in with the rest of the emotion. And the bridge part:\n\r\nâ\u0080\u0098Never I ask of you\r\nBut never I gave\r\nBut you gave me your emptiness\r\nI now take to my graveâ\u0080\u0099\n\r\nâ\u0080\u0098Emptinessâ\u0080\u0099 is another ambiguous word, he could be saying a lot of things here. I think not having her has left an emptiness in his life, and that canâ\u0080\u0099t be filled. \n\r\nItâ\u0080\u0099s a pretty revealing song, we never really saw this side of James before Nothing Else Matters so its great that he started to become comfortable in expressing his deeper emotional stuff! Anyway this was my interpretation, itâ\u0080\u0099s alarmingly long but it think the song has got a lot in it!\n\n\n", "comment_1": "\n\"Never I ask of you\r\nBut never I gave\r\nBut you gave me your emptiness\r\nI now take to my grave\" \n\r\nRead that and imagine the mother saying those lines. I think it would fit. The son left his home. After he returns its too late. Shes dead and tooks the emptiness HE gave her in her grave.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni just lost my mother and so this song has a lot of meaning for me.basically it expresses how we all try to get distance from our mothers but its only when they die when we realise how much we they meant to us and how we took their love for granted.its one of those songs that you can only truly understand if you have been through the same experience.its hard for our hearts to let go of the memory and love for our mothers and it will only truly happen when our hearts are still, that is, when we are dead ,but if we dont try and let go of the pain and move on we may as well just die right now(closing an open book before its done)its easy for the pain of losing her to keep us in one place(let your son go/grow).in the end we all wish to do our mothers proud(i'm not all you wished of me)and we wish we could just see her one more time but know we cant(need your arms...cold stone is all i see).no matter what we will always remember what she gave us(apron strings...the mark still remains)and we will forever miss her(gave me your emptiness and i take to my grave) \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nHe wrote this song for his mother, who passed away.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthis is a song about james' regrets in never being what he shouldve been and what he shouldve done to be closer and to make his mother proud. she gave him everything she had even that which was bad and he can't except the fact that his mother is gone and he can't make up and appologize for everything him and his mom never had. so he wants peace but has none because of what he never did.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think it talks about how his mother tried to bring him up as best she could with what she had, she tried to teach him wrong from right but he needs to find his own way and live life his own way, he makes mistakes but doesn't ask for forgivness and when he realises that he took her love for granted thinking it would always be there it was too late because she had passed away. The chorus is about asking his mother to let go and let him live.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ndamn, i love this song. its simply he ran away from home, n the years passed and when he finally returned 'a cold stones all he sees' its reli depressing but i love it so much\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\n3084: Maybe you should come back and post when your balls drop, junior.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nHahaha. Kids.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nTo me, personally, this song respresents a meaningful interpretation of a son who is trying to leave home because his mother is just not giving him the kind of love and understanding he needs and he is torn, because he loves his mother even though he never showed it to her but neither did she to him. She is trying to cause him guilt for leaving and is trying to use her so-called love (apron strings around his neck), which she was empty of in the first place, to keep him home. And now that he has finally decided to leave, he is heartbroken because, even though he knows its for his own good, his mother wouldnt let him go for her own selfish need of trying to fulfill her emotional emptyness through him, which she was never satisfied with in the first place even when he showed his love to her.\n\r\nWhoa, I took this to a whole new level didnt I, lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nits doubtful that James was smothered with love - just look at some other lyrics relating to his family. Seems like he had a strict but inconsistent upbringing. If his dad was mean then he'd want his mum to confort him but maybe she was too scared to protect him. He would leave home at an early age with a head full of hate & rebellion then later on in life would see that his mother did her best under the circumstances. Too late to make amends as the words suggest \"a cold stone's all I see\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nIf you watch the video clip and read the lyrics to me it looks like he wants to live his life and be free but his mother tell him everything he need to do, so he leaves home to get a true life but he doesnt want to hurt his mom. He is  leaving home and being rebel for his own good so he ask his mother to leave him on peace \"let my heart go, let your son grow\" and everything that his mom tough him was based on her truths and not his truths on the verse \"what ive heard was wrong\" and in the end of the clip he leaves his car which is not a car that pretty much means that he was living a lie (society) he gets his horse and go live his free life  \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI think this song is about a mother which cant accept that her son wants to live his own life/be free. She wants to tell him what he has to do but he has his own ideas of life. Also, his relationship to his mother isnt that good. (-> \"A mother's love for her son\r\nUnspoken, help me be\" and \"But a cold stone's all I see,I need your arms to welcome me\")\r\n-\r\n\"Never I ask of you\r\nBut never I gave\r\nBut you gave me your emptiness\r\nI now take to my grave\"\n\r\nNormaly, even if you dont ask for your mother and never give her anything, she still loves you/gives your love. In this case, she just gives emptiness.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song seems to personify the prodigle son.  The only difference is that the older brother was in charge, if you will.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI've said it once, and I'll say it again; Load and Reload are Metallica's best lyrically. \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nQuite possibly the most beautiful Metallica song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nA very melancholy and touching song. Coming from a traditional Chinese background i can certainly relate, having had a distant mother (and father). There is nothing in the lyrics that has too deep and subtle a meaning, because it conveys all the emotion it needs to. Bitchin riffs also make it a song to remember\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI always thought it was about a mother who dosn't love her son\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis song really can relate to the regrets I have builded up with the relationship with my mother. She is not dead but, I, over the years, have not looked deep into the things she has done for me and everyone else. This song really has made me see the other side of the things I have taken for granted. The vocals, the riffs, the mood, and the spirt of the song really capture the emotion that I now carry with the things that I never looked back on those many years past. And, what can I say, this really is Metallica's best piece of craft yet. Nothing can beat this by any means. To Metallica!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nluv this song. his singing voice is sexy. luv it.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song sounds kinda country to me, but cool all the same.   Metallica are greater\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI always thought it was about an over protective mother. The narrator is saying that he needs to live his own life, make his own mistakes, etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nthis song is about Hetfield's regret that he did not make the most of the time his mother was around, as shown by the line 'I took your love for granted, All the things you said to me'. I rate this 4th amongst Metallica's ballads behind Nothing Else Matters (3), Sanitarium (2) and Fade to Black (1).\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nits about james' regrets of what he didnt do for/with his mom. he wants a way of putting himself at ease, and hes asking his mom for this.\r\nMETALLICE ARE THOUASANDS OF TIMES BETTER THAN NIRVANA.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nWhat does this mean?\n\r\nApron strings around my neck\r\nThe mark that still remains\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nthis is a very deep song, the lyrics are great.... for those few people comparing nirvana to metallica, it is just dump the two bands are too different to compare.... metallica and nirvana are my 2 favourite bands, nirvana are just trashy and messy but still alright, and metallica somewhat cleaner in comparison, but musically metallica are better but i like cobain as a lyricist... i dunno most people like one or the other...\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nMost of the people here say that this song is about james who regrets how he treated his mother. But what does this line mean then?\r\n\"But you gave me your emptiness\r\nI now take to my grave\"\r\nI dont understand it. If this song puts james' mother in a positive light then what do those lines mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nIt's one of the best songs from Metallica, yet full of sorrow.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nPhilgood, those lyrics mean that his mother had nothing yet still tired to give to him, even if it was nothing.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nbest metallica song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song reminds me my mother.\r\nI like this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI think \"The brightest flame burns quickest\" and the lines \"I left home at an early age of what I heard was wrong\" are connected meaning she told him that being in the spotlight, as it were, will only lead to disappointment, but he's still in the greatest band ever.  At least, that's how I would interpret it if, in fact, the song is about James's mother in general.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nthis song is the most beautiful and touching of all their songs...makes me wanna cry everytime I hear it.\r\nMy mum is alive and well, luckily but in a way I can relate and if you leave out that James' mother died he's basically singing about what everyone wants, make their own life, go their own way. And I'm sure most mums try to hang on and influence their children as long as they can.\r\nI know my mother still trys to have a say, she means well but I'm stubborn and just wanna make my own mistakes.\n\r\nAnyway, I love this song like no other.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI think that you are mistaken...actually, it's about his mother, but she was the one that make him suffer, never let his heart go, but still she was his mother so couldn't do anything else but to love her...it's a feeling of hating but loving the same person just cause that person raised you up..........Never I ask of you\r\nBut never I gave\r\nBut you gave me your emptiness(even if I had asked you would give me your emptiness- you gave it when I didn't ask for something..!!!-)\r\nI now take to my grave..........................never I ask of you ( there must be a reason..!!)  But he's sad cause she's dead....he has to love er it's his mom after all\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nWell, as a mother here is the way I understand it:\r\nLeft home at an early age\r\nOf what I heard was wrong\r\nIt's his mother who left home, not him...\r\nI need your arms to welcome me\r\nBut a cold stone's all I see\r\nHe wishes she was still alive...\r\nBut you gave me your emptiness\r\nI now take to my grave\r\nemptiness: she is dead and not there anymore and he will be without her until he dies\r\nLet my heart go: he wishes he could forgive her and not think of her with so many disturbing feelings such as hate, regrets, guilt, I guess this is a way of him letting her go too. Also, he is not having the kind of life she would have dreamt of for his son and that makes him somehow guilty.\r\nI think everybody can understand this song the way they feel. This is the magic of Hetfield's lyrics. Made me realise lots of things.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nSomehow this song just reminds me of my mom, it just does for some reason ?\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nthe wolf is more boring then any porcupine i ever saw... who gives a shit about big foot anyway\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nIt just made me cry, it's so full of sorrow. Best song on Load.\n\r\n3084, I feel really sorry for you; if you need to react like that to emotions, you must feel like in a cage. It's really sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\n3084 man this is what Metallica is all about...good lyrics. So fuck off.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI love Metallica ballads! Their lyrics are so emotional and meaningful!\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nOne of Metallica's saddest songs, you can hear the sadness in his voice when he sings it.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nto 'm' lol I think apron around my neck means his mom had him dress nicely like in suit and tie...and you know how james dresses haha tank top and jeans. I'm a huge tallica fan and I've heard of this song but never lisented to it till now. I watched an unplugged version of it on youtube where james was playing acoustic by himself and when it got to the part where he comes home and all he sees is a cold stone....tear haha I know I know i'm a sissy but I was an asshole to my mom through my adolesence and I semi relate to his pain :'(\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nIf you watch the video clip and read the lyrics to me it looks like he wants to live his life and be free but his mother tell him everything he need to do, so he leaves home to get a true life but he doesnt want to hurt his mom. He is  leaving home and being rebel for his own good so he ask his mother to leave him on peace \"let my heart go\"   \t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nIf you watch the video clip and read the lyrics to me it looks like he wants to live his life and be free but his mother tell him everything he need to do, so he leaves home to get a true life but he doesnt want to hurt his mom. He is  leaving home and being rebel for his own good so he ask his mother to leave him on peace \"let my heart go, let your son grow\" and everything that his mom tough him was based on her truths and not his truths on the verse \"what ive heard was wrong\"   \t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nMama she has taught me well\nTold me when I was young\nSon your life's an open book\nDon't close it 'fore its done\n\nThe brightest flame burns quickest\nThat's what I heard her say\nA son's heart's owed to mother\nBut I must find my way\n------------------------------------\n\nMy Interpretation of what this song means is a bit complex, but they are of my own thoughts based on my experience and what this song means to me.\n\nIn the beginning it explains that his mother is teaching him that he has plenty of opportunity to make something of himself and he should shouldn't try so hard to grow up so fast. Her explaining \"The brightest flame burns quickest\" is her way of telling him if he tries to rush through life he will skip through childhood and never really enjoy his life. He needs to slow down and take his time, rather than rush through life and dim out.\n\nUnfortunately he refuses to listen like many of us have done. We tried so hard to get out crap together and move on. We didn't want to live under a matriarch or someone else's rules so we just moved out without a plan. \n\nHe is explaining that he needs to get out and figure it out himself.\n-----------------------------------\n\nLet my heart go\nLet your son grow\nMama, let my heart go\nOr let this heart be still\nYeah, still\n--------------------------------\n\nIn this it is merely explaining that he is telling his mother to let him go, let him experience life, let him grow up the rest of the way on his own because he has big plans. He needs to get out.\n-------------------------------------------------\n\nRebel, my new last name\nWild blood in my veins\nApron strings around my neck\n\nThe mark that still remains\nLeft home at an early age\nOf what I heard was wrong\nI never asked forgiveness\nBut what is said is done\n------------------------------------------\n\nWhen he first realized he was free he started doing all types of stuff a typical kid would do without supervision. He was trying to say that in the beginning it was touch and go, trying to find his place in the world... living life in the fast lane, his music career taking off and him and the band lived without any sense of responsibility. They drank and partied, went on tour, They were wild in the beginning. The band was also known as Alcoholica because of the wild parties they had, as well as the drinking... But during this he when the party stopped and he was alone he reflected on the how he grew up. He kind of missed the domestic life and he misses it by saying the mark that still remains from having Apron Strings around his neck.\n\nHe also reflects on how he left home, it seems like there were some words between him and his mother and he left on bad terms. He may have explained how he left to one of the band members and they told him he screwed up. His guilt is thick in the last lines... I never asked forgiveness, but what I said is done. He may have had the last words, and those words broke his mothers heart, and he can't take it back. He is too proud to ever admit to his mother that he was wrong, and he was sorry.\n----------------------------------------\n\nNever I ask of you\nBut never I gave\nBut you gave me your emptiness that I'll take to my grave\n-------------------------------------------\n\nHe has even more guilt in these lyrics because he never asked for forgiveness... and he will also never give her forgiveness in return.\nThe animosity between the two still remains, and he will take that empty feeling, and sadness with him to his grave\n---------------------------------------------\n\nMama, now I'm coming home\nI'm not all you wished of me\nA mother's love for her son\nUnspoken, and maybe\nYeah, I took your love for granted\nAnd all the things you said to me\nI need your arms to welcome me\nBut, a cold stone's all I see\n---------------------------------------\n\nOn the road he heard of his mother's passing. He is coming home for to bury her... He explains that she was disappointed in him for his life choices, but he feels like she should have loved him anyways. He regrets the same thing many of us do when a family member dies. He figured she would be around forever. So he realizes that he took it for granted and he wished to reconcile their differences, but it was too late as he stood over her grave..\n\n\nThis might sound too literal, but I can relate. I moved away from my mother on terrible terms. I moved 2000 miles away and recently she died in a house fire. I went up to participate in the services and it was too late. I couldn't take anything back, and every day now... I wish I could have called her up and said I am sorry.\n\nThis song really resonates with me now that I understand his pain in a very similar manner.\n\nReally eye opening song. Always squash your differences with a family member. Things happen, and it might be too late to take things back.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nI think there's something here that rings with every guy. Our mothers are the first person that influences our lives, more for guys than girls, but mothers are just people and they don't always make the best decisions. I loved my mum but she did things and made certain decisions for me that I now hate about myself, she cared about me more than life itself but now she's gone I can't talk to her about any of it. There's parts of this resonate with me more now my mum has passed away. Nice personal song that really shows Hetdields talent for a great song. \t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI love those lyrics\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI have to say along with Dyers Eve, The Unnamed Feeling, Battery and Blackened: Mama Said is Metallica's Greatest work, so much emotion, so much pain and sorrow yet so beautiful. Words just dont do it justice. Metallica ARE The Masters of Their Craft!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\ni love this song. great song and love the lyrics.\r\nkirk hammett is the best guitar player!!\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\n''so much emotion, so much pain and sorrow yet so beautiful\" couldn't of said it better worker ant\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\ngreat song but they did kind of stray from their metal roots just a bit with the twangy guitar and the fact that in the music video he wore a cowboy hat\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI never thought I'd say this, but Mama Said is their best ballad. Fade To Black now ranks in at second place. Although my mom isn't dead, I can relate to these lyrics so well. And the tune, james' voice, and what not almost made me cry. Their best. Period.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nCharlie the man, can you really call Fade to Black a ballad??  I dunno, when I think ballads, I think of \"Nothing Else Matters,\" but hey, to each his own.  And I agree with EvilLawyer, Load and Reload are really great lyrically, even though some would say their music on those albums was terrible....whatever\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nonly 15 comments about this great song?!!!!!!!.......\r\nwithout a fucking doubt this song is their best job!\n\r\ni'm taking a poll.maybe this is not the right place. but i have no choice.anyhow! i hope you guys dont blame me for this.\n\r\ndo you guys think that Metallica is greater or Nirvana?\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nfor me nirvana is greater.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nthis is a sad song.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nJust get a 2nd opinion, what was meant by \"The brightest flame burns quickest\"?   I think this could mean a couple different things.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nfreebird11 - i think it means only the good die young but perhaps im reading it out of context\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nclamum: Maybe i hould cut your fuckin face off in your sleep fucktard\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nany one who lkes this song is fuckin dumb, for one it sounds al country and shit metallica were one of the best thrash metal bands, what the hell is this shit, two all hes doing is crying about his dead mom\r\nman what happend to metallica\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nFUCKIN GAY!! this is not a metallica song it is so fuckin weak. at least fade to black had a solo in it\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nclamum: Maybe i hould cut your fuckin face off in your sleep fucktard\t\t\t\t\n\t\t\t\t\n\n"}