{"comment_0": "\nAll of humanity is blindly following, heading straight towards death. People have even gotten tired of trying to find anything better (\"No one looks up anymore\") for fear that it will make them see the truth, despair, and be vulnerable. God comes in the form of a spaceship, offering salvation. However, his own doubt fights back, saying that the hopeless march is the only way. \n\r\nHe is sick of the march and decides to follow God's way instead. Still, he must continue on earth with the rest of the marchers.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nWhen I listen to this song, I hear that he's on the path to suicide and that he's mindlessly \"marching to the sea\" when he hears a voice telling him to follow them instead, to live, and that he's fighting his \"counterparts\", like later to be introduced Blurryface. I think the meaning that most people have submitted is very interesting.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI could be a little bit biased, as I naturally would find a meaning in the lyrics I can connect with. Everyone finds their own meaning in art, or in this case music, so I may be interpreting the song wrong. I think this song is a very, very dark song. I think that it is about suicide, and I find it to have a pretty accurate description of what struggling with suicide is like. \"The march to the sea\" I think refers to everything that happens once someone's made up their mind leading up to their death. \"We're dying with every step we take\" \"we're dying with every breath we make\" shows how painful it is to keep going through the motions of life while struggling with suicide. And I think that the line he talks about shows how common it is for someone to be struggling with depression and having thoughts of ending their life, \"heaven forbid they see you cry\" people in this place tend to bottle up their feelings which almost always makes the problem worse and this silent suffering is often what causes people to get to the point where they feel they have no other option. \"And as we near the end of land, and our ocean graves are just beyond the sand, I ask myself the question, why, I fall in line\" is that moment just before acting on your thoughts where you stop for a second and reflect and ask yourself if this is really what you want. The spaceship that says \"follow me instead\" isn't necessarily any one specific thing, it is, rather, anything that might temporarily save us from ending our own lives. The most powerful lyrics, in my opinion, \"then the wages of war will start inside my head with my counterpart and the emotionless marchers will chant the phrase 'this lines the only way'\" I think the marchers in this case aren't actual people, they're the voices in your head that tell you that you're worthless or that you're better off dead or that you don't deserve life or that you can't handle it anymore, and the war in his head is because now there's another voice that might see one reason to stay alive among millions of reasons to give up. At this point you're fighting a battle in your head because part of you wants nothing more than to give up, but another part sees a reason to keep going. This war inside your head is one that will keep you up at night and distract you from everything going on around you and it's one that will have you laying on your bathroom floor with the door locked trying make a decision or even just somehow make the voices stop. It's a war that you can never win, no matter which side you pick. \"Take me up, seal the door, I don't want to march here anymore, I realize that this line is dead, so I'll follow you instead\" is when you've decided that maybe today won't be your last day, but then the song takes what may be an unexpected turn; \"so then you put me back in my place, so I might start another day, and once again I will be in a March to the sea\" means that just because you chose not to end your life today doesn't mean the battle is over, because every single day for what may even be the rest of your life you will find yourself again fighting the urge and thoughts of ending your life. Like I said I may be wrong, but that is what I felt. Like I said this song is very dark, and I found a connection with everything he says.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nAlong with what everyone else has said, I believe this is an amazing allusion referring to \"Sherman's March to the Sea\". This is the name most commonly used for the Savannah Campaign during the American Civil War. I won't bore you with details, but they basically tore through the southern enemy terretory, like badasses, without supply lines. It was considered one of the most revolutional acts in American history. \n\nVery strong lyrics, but what's new?... These guys are genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI am positive song is based off Matthew 4:18 As Jesus was walking beside the Sea of Galilee, he saw two brothers, Simon called Peter and his brother Andrew. They were casting a net into the lake, for they were fishermen. 19 â\u0080\u009cCome, follow me,â\u0080\u009d Jesus said, â\u0080\u009cand I will send you out to fish for people.â\u0080\u009d\nI know people interpret it different but it is sad that such a beautiful song is interpreted to mean suicide when it actually has a hopeful undertone.\nIt is not just \"religious\" - it is about the calling, the push, any person who knows Jesus has - life gets you down, you go other ways, but in the end, God tells you He has a bigger purpose for your life, and that is to \"fish for men\" - tell people they are loved by God, and the good news of Jesus.\n\nTyler is on the \"wide path\" which leads to death and destruction instead of the \"narrow path\" of salvation.\n\nThe UFO is God.\n\nstay alive frens\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song really helped me see that it was okay to follow a different path than everyone else. I was stuck in this cult religion, and sure some people might see the space ship as God, but for me I don't believe in a god. The spaceship was just someone who had helped me see the truth and told me that it's okay. Marching in a line is not going to do you any good in the end. You're going to die like everyone else, but you don't have to live like everyone else. \"Death does not distinguish between the sinners and the saints. It takes and it takes and it takes, and we keep on living.\" So the message I go was really to not follow the flow of society. Or that religion isn't the only way. Of course that is just my opinion and what I thought of when I listened to this. So thank you.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think that the meaning to every song is different to a lot of people. Personally I don't believe in God. This song to me is about suicide. When it says heaven forbid they see you cry the person might be getting bullied and hides their sadness. Then the spaceship is someone appearing into their life and saving them. When people say this way is the only way they might be saying it's the only way that I might actually be happy. This is some of the meaning of this song to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthe line of people marching- to me- is of all the people surrendering themselves to the mainstream music and fashion. Tyler, or whoever the character is in this song, wants to stop marching and go their/ his own way. but he/ they has a fear that he/they will get beaten up by the others or whoever is in charge. he / they hears' hear a voice- the unknown, emo (to outsiders), meaningful and underground music- and it's telling him to follow their unknown and amazing ways. the spaceship is the bands and people within it. but one day the character/ tyler will fall back into the \"normal\" music sound, or in this case march to the sea.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song I think has a much deeper meaning than what I used to think it was. At first, I thought it was where he was an ordinary guy who fell in love but got his heart broken cause of the lyrics, \"but then you put me back in my place, so I might just start another day\" for the part of where he got his heart broken but learned it has a much deeper meaning than that. What I think it means is how he is on the walk to suicide. And how there's so many other people who are trying to kill themselves as well. I say this because of the lyrics, \"And our ocean graves are just beyond the sand\" and \"A strangers back is all I see, and he's only a few feet in front of me.\" Saying there's other people who are making the same decision as him. But I think he is still deciding if he really wants to commit suicide from the lyrics \"i ask myself the question why, I fall in line.\" As if he is asking him the question if he really wants to kill himself. So the song talks about how he is trying to decide to kill himself. Cause of the lyrics \"I see a spaceship in the sky and hear a voice inside my head, follow me instead.\" As if the spaceship is his other voice saying, don't do this, you have so much to do still in your life, follow me instead. And to prove this is inside his mind. \"Then the wages of war will start, inside my head with my counterpart.\" The counterpart being the spaceship that's inside his mind. And wages war as in he is debating what will come out of this and what wont. But at the end \"Once again I will be in a march to the sea.\" Is where they decide at the end, to really commit suicide.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nLike many of twenty one pilots songs, there are two very different stories being told here. (In my opinion, at least)\r\nThe first story us one of someone struggling with depression. The cycle of the depressed marching to their deaths reminds me of Chopin's \"The Awakening\". Edna drowned herself in the ocean, believing that death is the only way to be free. So he's stopped... By a space ship? Yes. It takes something that will sound absurd to everyone else to draw someone out of this death march. He found freedom from everything in his life that was marching towards death through another voice- someone who stuck out from the crowd, a strange new hobby, a weird event. Because depression requires something crazy to break the monotony of life.\n\r\nThe second is a more religious take. Obviously not the only message this song offers, but I first heard this song in 2009 before twenty-one pilots released their first album (they performed at my church), so I can personally attest to the depth of Tyler's faith when he wrote March to the Sea. \n\r\nThis second story is the slow march towards death. There's obviously no way to escape it, so everyone is marching towards it mindlessly. The narrator doesn't even consider himself to be hopeless- the idea of hope is entirely off his radar. He doesn't even look up because he doesn't want anyone to see him looking to the sky. Yet he does look up. We know this because he sees something there that is entirely foreign- something from an entirely different world. Something that tells him there's another way. Confused by this space ship, he ignores it and continues in the familiar path he's always walked down, but this \"alien\" offers him the chance to never die. His counterparts are confused, telling him he's being irrational, and he KNOWS he's being irrational. But he chooses to trust this alien. But then this alien puts him back where he started... With the knowledge that he doesn't have to die. The next step, then, would be to walk alongside those marching towards death and show them that they don't have to march- that there is hope of a life that will never end. \n\r\nThat's my take on it. It's neither a Christian song nor a secular song... it's a song about how there's always another way. There is always hope... You just have to look up.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI strongly believe that this song is about the authorâ\u0080\u0099s salvation and how he follows the world and everything that â\u0080\u009cfulfillsâ\u0080\u009d what the world says we need. He then realized that it was not getting him anywhere and he was just headed to his death (â\u0080\u009cour ocean graves are just beyond the sandâ\u0080\u009d) then God showed up (the spaceship) and offered his salvation. (â\u0080\u009cFollow me insteadâ\u0080\u009d) but the people of the world do not understand why he would not want to follow their pointless pleasures that get them nowhere but hell, so they think that â\u0080\u009cthis lineâ\u0080\u0099s the only wayâ\u0080\u009d. â\u0080\u009cThen the wages of war will start inside my head with my counterpartâ\u0080\u009d means that he is considering the risks of leaving the line. He finally decides itâ\u0080\u0099s worth it so he leaves the line to follow God instead. At the end where heâ\u0080\u0099s talking about how God will put him back in his place so that he can start another day â\u0080\u009cand once again I will be in a march to the seaâ\u0080\u009d symbolizes that no matter how many times we fail, God will always forgive us and put us back in our place. And no matter how many times God does that, we will always keep failing. It is a beautiful picture of how we can only get to heaven by Christ alone, not my our works and not my worldly concepts.  \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThe first time I listened to this song, I just assumed it was maybe about soldiers going off to war. I didn't really pay attention. Every time the song came on I just half listened and then skipped it. Well, I finally started to pay attention and I realized finally what he was saying to this half listener. I myself am on the same journey. Its a battle. I want to listen to that voice inside my head that calls out to me, but just like I was with this song, I'm still half listening. The space ship and voice is God, we are all on a march to our ends and its the same end for everyone, except for those who choose to follow that voice. He may keep us here on earth and in the same houses with others going the wrong direction, but he stays with us till the end. In the end we won't drown, we will rise to join Him.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI see this as saying that there is so much more to life, and we're wasting it. We get so comfortable with where we are, and are afraid of pursuing something because heaven forbid it not turn out. So we just keep on walking along with everyone else right until we die. Then, he sees God (as the spaceship) and He is saying to follow Him instead. Deciding to do this, the war starts as either he fights to get out of the line, or as others fight him for not staying with the line, but ending up not getting/staying out of the line. Then he hears God telling him again to follow Him, and he accepts. But then, he sees all this stuff that there could be for everyone... and all that is wrong... so he asks to be taken up.. but he has to stay here on earth until it's God's time. \nAt least that is how I see it.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think this song is about how we all are heading towards death and we all are going to die at some point and everyone is \"falling in line\" as if, doing the same old boring things, when we should explore \"I see a space ship in the sky\" as if his escape from the same old thing. But when he tries to go 'He' puts him back in line, so he can't  escape\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI am not seeing the Sherman's march to the sea reference here, but instead see the title referring to lemmings which have been said to follow one another right off a cliff and plunge to their deaths in the sea.  \nBut what is interesting is that he seems to have a profound moment where he is called by a divine force to follow Him instead of all of the other lemmings, but then God seems to put him right back into the line which is marching to the sea and to their deaths (which makes sense since the author is still mortal after all).  So I think this probably refers to dealing with the fact that even though the author has accepted God's call to follow him, the author wakes up the next morning after his conversion only to realize that he is still going to have to live this mortal life and continue the march to his death.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI actually thought it was quite opposite. I thought of the people marching to the sea as people walking the path to heaven and the voice/spaceship was the devil telling him to follow him instead, but the marchers are telling him this line is the only way to God. \"Then the wages of war will start\" to me sounds like his battle with the devil because he then gets back in line. Towards the end after he follows the voice again it says, \"so then you put me back in my place, so I might start another day\" I thought of that as God forgiving him for leaving the path to heaven and let him start anew. The way everyone else says it makes sense but that is how I interpreted it.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nPersonally, not being religious, I see this song in a completely different way, ever since I've first listened to it I haven't ever interpreted it as religious.  Of course I do see the same general meaning as everyone else...  He is in a line of \"conformity\" as they all march to their death.  It is looked down on to show any emotion, \"heaven forbid they see you cry\".  And he is beginning to wonder, why does he fall into this line of conformity?  It is all he (we) have ever known, and all anyone else ever does.  Then he sees the \"spaceship\".  Maybe he wrote it about god, and others who are religious interpret it this way as well.  For someone who's not religious, the \"spaceship\" to me is any person (for me, my musical idols) who doesn't conform, a pillar of something you can do to make a decision to not fall in line any more.  Tyler is a \"spaceship\" for me, as he's influenced me not to \"fall in line\" any longer and pursue my dreams, because I've seen him do it.  I would wonder if Tyler wrote this about any other human he knows, who's inspired him not to \"fall in line\" any longer.  And so after hearing the voice saying \"follow me instead\" which is his own free will, he is in a deep struggle between following what he wants or continuing in the blind march to the sea.  And then, as we know, he is denied access to this \"Spaceship\" he's decided to follow.  Why?  It could be about not making it to where your dreams lie.  You avoided conformity, and you failed.  You're NOT a famous musician, a pro sports player, whatever you wanted to be.  And so you're put back in your place, in the line, and you're stuck conforming again until you die because you realize that in order to live you have no other choice.  Pretty bleak ending, but that's what it says to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI feel as though this song tells the story of how humanity blindly follows laws and rules and lives a \"normal\" life until they die. Occasionally people question how we live, but we all end up following the same path eventually. However, the main character in the song questions their participation in this \"line\" and looks up, which reveals another path for them to follow outside of the march. And so they rebel, much to the detest of the members of the line, (but they don't really care) and by the end of the song they are free from the line and following a new path, which symbolizes how a person can choose to live differently from others and still be happy.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ni think this song has to do with the civil war battle they called the march to the sea. At school we were talking about it and i couldn't stop thinking about this song and the lyrics. You'd have to know about the battle to understand what i think. so i don't know. lol. look it up i guess, if u want.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI see a lot of reference to a suicidal interpretation. It is a common trend in their song so that is possible but maybe because this is what's heavy in the world now I got a political reference from it. \r\n\"And all look left and right sometimes but all fall in line\"- we all choose a side. The left being democratic and right republican obviously but then to say that regardless of your side we all fall in line with what each side believes and blindly follow what we are fed. Following the right or left he then says \"No one looks up anymore\" obviously referencing a higher power. \r\n\" And about this time of every year\"- a political campaign \r\n\"Then we fall asleep\"- referring to the end of the political campaign when everyone takes a back seat again and become sleeping sheep feeding on what is fed to them. \r\n\"And emotionless marchers will chant the phrase 'This lines the only way' \"- is a clear nod to the way people can get with their political views. \n\r\nI like to believe any song can be interpreted the way that means the most to the listener. I see this song as a reminder not to get caught up in earthly battels that can kill us inside. God is calling us to follow Him instead and live eternally. \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nTo me it means that Tyler is falling away, maybe thinking of suicide, but instead someone (likely God, as Tyler Joseph is a Christian) is saying follow me instead, leave that behind.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nto me, this song lets people know how troubled he was. â\u0080\u009cweâ\u0080\u0099re dying with every step we take / weâ\u0080\u0099re dying with every breath we make.â\u0080\u009d he doesnâ\u0080\u0099t only express his pain, but others too. and that helps me so much. you just get in that position where youâ\u0080\u0099re alone. then you listen to josh and tyler. and this song. and you realize it means he made it through even though all his pain was still there. and thatâ\u0080\u0099s a great thing to survive.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nIn my opinion is always thought that this song was about world war one (British Perspective)  and how that people were blind to the fact that they were basically marching off into the sea to die rain was prevalent in world war one so the \"raindrop in your eye\" line makes a lot of sense, and the spaceship telling you to follow them instead was taken away as part of the propaganda and the person would still be marching off into death after the conscription act on 1916 came into effect, sealing the door was basically the boat off to France taking place and now he realises that he doesn't want to fight in a war and all of the propaganda was lying to him but again he is too late and now he is on a separate march to the sea in France where he will inevitably die, the \"counterpart\" line was his own feelings and doubt of what the war is because t the time in 1914 war was romanticized as a heroic thing to do and knowledge of trench warfare was unknown as most of the letters sent back were heavily censored, so him finally getting on the boat and seeing injured people or just seeing France or hearing stories of what actually happens there will make him know that his march to the sea is unavoidable no matter ho hard he tries to follow his own thoughts and doubts\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI really think that this is religious song with subtle hints. Like at the very end it says, \"So I'll follow you instead\" \nI have seen people say he could be talking about going to happiness instead of finding life boring, but I don't think that makes sense with this line. \nI think the sea that he is talking about is Hell and the voice inside his head is God telling to follow Him instead of lining up to go to Hell after Death. \nThe part where it says no one looks up anymore, I think that means today we tend to put God aside and ignore or put down things about him because we are too afraid to show our faith. The place they are marching is the worldly mind\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI think that March To The Sea could possibly be about peer pressure.\"This line's the only way.\" They are pressuring Tyler into doing what they are doing. He also mentions them being emotionless. It could also be about some kind of hypnosis. This is only my guess.\t\t\t\t\n\t\t\t\t\n\n"}