{"comment_0": "\n\"End of passion play, crumbling away\" \r\n\"I'm your source of self-destruction\" \r\n- I = drug will kill you \r\n\"Veins that pump with fear, sucking darkest clear\" \r\n- The darkest = heroin \r\n\"Leading on your death's construction\" \r\n- It is determining your fate \r\n\"Taste me you will see\" \r\n\"More is all you need\" \r\n- Become addicted \r\n\"You're dedicated to\" \r\n\"How I'm killing you\" \n\r\n\"Come crawling faster\" \r\n\"Obey your master\" \r\n- Master = drug \r\n\"Your life burns faster\" \r\n\"Obey your master\" \r\n\"Master\" \n\r\n\"Master of puppets I'm pulling your strings\" \r\n- The drug is now controlling you \r\n\"Twisting your mind and smashing your dreams\" \r\n- The impact of the drug \r\n\"Blinded by me, you can't see a thing\" \r\n- Can't see that it's killing you \r\n\"Just call my name, 'cause I'll hear you scream\" \r\n\"Master\" \r\n\"Master\" \r\n\"Just call my name, 'cause I'll hear you scream\" \r\n\"Master\" \r\n\"Master\" \n\r\n\"Needlework the way, never you betray\" \r\n- Needlework = fixing \r\n\"Life of death becoming clearer\" \r\n\"Pain monopoly, ritual misery\" \r\n- You're playing with your life \r\n\"Chop your breakfast on a mirror\" \r\n- Breakfast = taking cocaine on a mirror; or heroin if mirror = spoon \r\n\"Taste me you will see\" \r\n\"(...)\" \n\r\n\"Come crawling faster\" \r\n\"(...)\" \n\r\n\"Master of puppets I'm pulling your strings\" \r\n\"(...)\" \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nFirst off, the one lyric on this page is wrong. When James shouts before the guitar solo, he says \"FACE ME,\" not \"fix me.\"  Second, no offense to anyone, but why argue over whether or not it is specifically about a herione or a cocaine addiction? Really, people. For me, the song isn't even about drugs or a drug addict. Yes, that is what it is saying on the surface, but for me it is saying that we are all being pulled by the strings of fate (or being toyed around with by god), with absolutely no power over ourselves. As humans, we enjoy our destructive behavior, no matter how much it makes us suffer, and in a way our dark nature is like a drug that we simply cannot get enough of, or come to terms with and overcome. Anyone else with intelligent ideas to offer on this song, I'd love to chat.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nBattery has ended.A slight whisper of the silent tape mars the perfect silence .A lethal guitar sound starts.I had resolved to resist it this time.It's no use.The right finger moves towards the volume wheel of the Walkman steadily, as if under the command of a spell.The sound output increases to a maximum.My headphones pump the music inches from my soft,pink brain.The eyes are wide,slightly tearful as the brain reels under  the assault of heavy metal music at its best and fiercest.I am carried through music sweet and bitter till a million heads laugh in my head.I manage to gather myself together, just sufficiently to push stop.\r\nI am as if stoned.That'll keep me going for a few days,I guess\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nSure the main theme is about drugs but it is really about any controlling force over you that you want to break away from but are too weak to do so.  And thats how the song should be viewed.  Openly.  Ulrich even said so in an interview.  The message is \"fuck your master!\" It could be drugs, another person, another addiction, or whatever.  It's the best thrash song ever.  Head-bang already!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nQuite obviously this song is about how drug addiction takes over somebody, and eventually ruins their life. The 'Master' being the drug, and the 'Puppet' being the user.\n\nEnd of passion play, crumbling away\nI'm your source of self-destruction\n\nPerson is starting to experience the negative effects of drugs, the addiction. It's no longer to feel good, but to stop feeling bad.\n\nVeins that pump with fear, sucking darkest clear\nLeading on your death's construction\n\nAfraid to lose the 'good' feeling drugs give, but also constructing their own death.\n\nTaste me you will see\nMore is all you need\nDedicated to\nHow I'm killing you\n\nCome crawling faster\nObey your Master\nYour life burns faster\nObey your Master\nMaster\n\nThe craving for the next high is symbolised here, how you'll crawl faster and die faster by 'Obeying' the 'Master'; giving in to your next dosage.\n\nMaster of Puppets I'm pulling your strings\nTwisting your mind, smashing your dreams\nBlinded by me, you can't see a thing\nJust call my name, 'cause I'll hear you scream\nMaster\nMaster\nJust call my name, 'cause I'll hear you scream\nMaster\nMaster\n\nChorus is pretty straight-forward, drugs ruin one's life, totally blinded and screaming for more. 'Master, master!', the puppet screams.\n\nNeedlework the way, never you betray\nLife of death becoming clearer\nPain monopoly, ritual misery\nChop your breakfast on a mirror\n\nYou'll find yourself doing drugs for breakfast, 'chopping' one's breakfast on a mirror symbolises the way cocaine is taken in, being 'chopped' up into a line using a straight razor and then inhaled through the nose. Doing so on a mirror is to symbolise how one watches his own destruction, due to this.\n\nHere the song breaks down, going into a calm, instrumental bit until it builds up to a fierce guitar solo. You can assume here that the Puppet has tried to free himself from his Master's reign, by no longer using the drugs. But because the craving for another high rises, the song speeds up and becomes more aggressive, showing the Puppet has been tied by his Master's strings again.\n\nMaster, Master, where's the dreams that I've been after?\nMaster, Master, you promised only lies\nLaughter, laughter, all I hear or see is laughter\nLaughter, laughter, laughing at my cries\nFix me!\n\n\"Fix me!\", kinda shows the user was feeling broken without his daily dose, and therefore gives in again to the Master.\n\nHell is worth all that, natural habitat\nJust a rhyme without a reason\n\nHere the Master soothes its Puppet into believing his addiction is a good thing.\n\nNeverending maze, drift on numbered days\nNow your life is out of season\nI will occupy\nI will help you die\nI will run through you\nNow I rule you too\n\nAddicted again, the Puppet is assumed to be dead at the end of the song as we hear laughter, mocking the Puppet for ever giving in to the Master of Puppets.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nSong about drug addiction\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nA Metal Metaphor:                                                                                 Drug Addiction as Enslavement                        \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nOK, first of, \"oldschoolpunker,\" why don't you cut the crap and take your negative comments elsewhere.  Second, metallica themselves have never done drugs, or have never done it to the point of addiction. To quote them from Behind the Music, they never wanted to get high, they just wanted to get drunk.  They've always been ones to tackle social issues, and drugs is without a doubt one of them.  Here are a few other topics they've sung about that they themselves have not personally experienced:  Nuclear War, Death Penalty, War, Corruption of Government, blah blah blah.  Basically, you dont have to do drugs to sing about them.  Oh, and another thing....lets see....old school punk bands...lets say the Sex Pistols? Johnny Rotten, their lead singer...what did he die of? HERION OVERDOSE! So i guess he was a poser, huh? Then the Beatles would be posers too, huh?, since pretty much all of Seargent Peppers was made while they were doing drugs, as well as a lot of their other albums.  I am in no way supporting drugs.....but with your close mindedness, and \"FUCKING\" metallica becuase you think they do drugs, well, then we'd have to fuck quite a lot of artists, now wouldn't we?\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI honestly only think this is about drugs and addictions and how bad they're for you and why you shouldnt do em.\n\r\n\"Taste me you will see, more is all you need\"\n\r\nIts like the drug is talking to you. \n\r\n\"Master, master, where's the dreams that I've been after?\r\nMaster, master, you promised only lies\"\n\r\nThats were Metallica is telling you not to do drugs. When you do drugs and you get high, you feel really good about your self, and you feel that you can accomplish anything (well i think that, i havent done drugs though, and dont plan on it, so im only talking with other peoples experience,), but in the end, the drugs was making you think all these things that weren't true, or you could just say the drug was making you think \"lies\" to your self.\n\n\n\n", "comment_9": "\nTo me it is clear. The song is about drugs and how they control you.\n\r\nThe song starts with a junkie on some sort of drugs. During the song the junkie has had enough. He silences the voice in his head(the master) by refusing to do drugs any longer and because he is now clean his life becomes silent and peacefull(the silent part of the song). \n\r\nUnfortunately the beautifull part doesn't last forever. \r\nAs time goes on he becomes more and more desperate and he calls out for the master\r\n\"Master, master, where's the dreams that I've been after?\r\nMaster, master, you promised only lies\r\nLaughter, laughter, all I hear and see is laughter\r\nLaughter, laughter, laughing at my cries\"\n\r\nHe is not completely free from the master's grasp and he is once again captured when he shouts:\r\n\"Fix me\"\n\r\nThe we have the fast solo. It is faster and harder than the other parts of the song because he has been clean for some time now and he has gotten used to being clean.\n\r\nAfter the solo he is addicted once again and he eventually dies at the hands of the master(thus the laughter at the end).\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nwell the song is about drugs but mainly cocane very good song\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthis song is about me\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nCOCAINE and heroin \r\n\"Needlework the way, never you betray \r\nlife of death becoming clearer \r\nPain monopoly, ritual misery \r\nchop your breakfast on a mirror\"\n\r\nI've heard this song is about Dave Mustaine\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song is about MetallicA's drug addictive habits, i've also read that it was somewhat of a tribute to the previous member, Dave Mustaine\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nclearly its about herione (and maybe cocaine)\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nIt is about both heroin (sucking darkest clear) and cocaine (chop your breakfast on a mirror) as well as what SSJVegeto said about the enslavement due to the addiction.  Metallica has never been a drug band, but no doubt while touring they probably encountered the mad stoners, hence probably received a little inspiration from watching others.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI like the way that they use this as a metaphor they do this wiv a lot of songs which is gr8 it's not my fav song but it's stil good. I do love metallica best band in the world in my opinion obviuosly there r loadz people who disagree but this is my view box so tough shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nTHANK U AMCHRIS!!! IT IS ABOUT COCAINE!! NOT HEROINE SO EVERYONE STOP SAYING THAT FOR CHRIST SAKE!!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ni know! for fucks sake! like for instance 2 weeks ago i brought a gram of coke... i saved me a line for the next day... i took it in the morning and then spent the rest of the day desperately trying to get some more... it sux! hence...\r\n\"taste me you will see,\r\nmore is all you need\"\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nnicole? is nicole from marbella here?\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nReading the lyrics here, Master of Puppets is clearly about herion addiction.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI have lsitened to both versions of Master of Puppets, I personally like the S&M version beter the solos in that kick ASS!!!!!\n\n\n", "comment_22": "\nwow u guys are all wrong. seriously look at it here. its about the devil. selling your sole for false promises when u get your ass screwed in the end. read it its not hard to understand it\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nwow u guys are all wrong. seriously look at it here. its about the devil. selling your sole for false promises when u get your ass screwed in the end. read it its not hard to understand it\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nsocken you are so wrong\r\nChoping your breakfast on a mirror.....\r\nDedicated to....\r\nMaster of Puppets which is an excpresion for drugs...\r\nWhy do people always connect songs with the devil?\n\n\n", "comment_25": "\ndrugs\n\n\n", "comment_26": "\nJohn Lydon AKA Johnny Rotten is still alive and kicking.\njohn-lydon.com/\n\r\nAnd does it really matter what drug the song is about?\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nthis shit is about x dawg. hammit's mom had an x addiction when hammit was still a little kid ( i think he was 9). anyway she'd leave and disco all night and come home and breast feed little hammit and he eventually became addicted to x as well. hetfeild wrote this song as a joke about hammit because he breast fed until he was 13. you welcome homies, peace ya'lls.\ngeocities.com/… \r\nthis site has a great review of toxicity  by system of a down \r\ncontributed by yours truly, teddy bugwell\n\n\n", "comment_28": "\ngeocities.com/…\r\nthere ya' go folks, for all you peeps who clicked on that one above, here's one that works. fell free to hack it and write hate mail and shit like that\n\n\n", "comment_29": "\nIf you dont like the fact that people do drugs, do me a favour, go home and take all ur cds and all ur records and burn them, because the people that wrote all this beautiful music; real fucking high on drugs!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nCOCAINE...\r\nbreakfast on a mirror wooooooooooohooooooooooo!!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nFizzleFry is correct, what does it matter which particular song this drug is about? It's plainly about drug addiction, and how it becomes your master. From my own knowledge about the band, I don't think they were the drug-addict type, but this doesn't matter particularly. Even though he's an idiot, daycare bwoi three posts up might be right, altho I've never heard that. Still, a song about drug addiction.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\ni cant get this line.....PAIN MONOPLY,RITUAL MISERY!....and in S & M....it seems like he says PAIN MONOPLY...COVERED BY RITUAL MISERY!anywyas....this song can be about drugs....as well as the u.s government forces the youth to fight wars! its a fantastic song anyways!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nIt's about being addicted to the cock. \t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\n#1: to Nimrod, Johnny Rotten is still alive, it's Sid Vicious that died of an OD.\r\n#2: This song is most certainly about drugs. The band themselves said it in an interview I read or saw, I don't remember. Ah, what a great song. An 8-minute speed metal masterpiece. And it's 100% true, that's what fuckin' happens when you do that shit. All the losers in my school do it, so it's my song for them. Plus, they're all a bunch of assholes so I take great pride in singing it. This song is the #1 reason I never did, don't do, and never will do drugs. Enough said.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nPreach it, Slayer!\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\n\"Taste me you will see, \r\nmore is all you need\" \n\r\nIf this is indeed a song about using youth as \"cannon fodder,\" the above line may be a reference to a government allowing youth to unleash the animosity that the government itself has buried.  The crave for violence then becomes so great that they become slaves to the act, and if they are not supplied with the act soon enough, they will become reckless and eventually meet there demise on the battlefeild...\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nits about alcohol there nickname was Alcoholica they were slaves to the drink needed it thats y hetfield was in alcohol rehab not drugs\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nits about alcohol there nickname was Alcoholica they were slaves to the drink needed it thats y hetfield was in alcohol rehab not drugs unless u consider alcohol a drug which if improperly used like that is a drug\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nHonestly maybe the song is talking about BOTH the drug addiction and the idea of the government controlling soliders to be lead to their death.\r\nI mean the song CAN go either way, besides, after the guitar solo, notice the words shift from an addiction to something else \"Hell is worth all that, natural habitat \r\njust a rhyme without a reason\" that could be interpreted as how soliders die and fight all for nothing, and hell or war is worth almost nothing\r\nsee what I mean?\r\nGreat song, one of the best in the world!\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nUnForgiven is right on this one\n\r\nThe song itself is about drugs, the various lines like \"taste me you will see, more thats all you need\" - refering to an addiction\r\n\"chop your breakfast on a mirror\" - cocaine\r\n\"dedicated to how im killing you\" - addicted\n\r\nBut as UnForGiven said, its also about soldiers in the war - the chorus - master of puppets im pulling your strings can be refered to as generals pulling the strings of the soliders they are sending to die. This links in with the album cover with the stirings commring from the hands down to the graves of the soldiers, they are controling them.\n\r\nOne of my favourite metallica songs this is too\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI think the first person persepctive in this (the \"I\"s and \"me\"s) switches between the dealer and the drug itself. I've always seen \"The Master Of Puppets\" being the drug dealer himself, and puppets being the addicts.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nWhat the FUCK is worng with you guyz?! Some of you are right, while others are way off! This song is sinply about drug addiction and how drugs become the \"master\" of someone. Of course, the song could represent the album cover, although I think it works better for \"Disposable Heros.\" The album cover represents the goverment and the soldiers. The Government stands for the hands with strings which are connected to the white crosses on the ground. The hands are maybe in the sky because \r\nin the figurative sense the government stands above everything, and The government controls/pulls the strings. The Soldiers stand for the white crosses which are used for the burial of deceased soldiers of war. At the cross on the left of the cover there is an army helmet and at the cross in middle of the cover there is an army \r\nidentification tag hanging on. The high grown grass could maybe hint at that the graves are old or that the nameless soldiers are falling into oblivion. Either way, I agree with both opinions. One of my favorite songs!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI think which drug the song is about is immaterial, its basicly just describing the enslaving element of taking hardcore drugs like coke / H.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nYeah I always saw this as a song about war, not cocaine addiction, and the masses of graves on the cover  just clicked. Like the Satan guy said, The government is pulling the strings in a war and leading the soldiers to death, just like they are their puppets.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nits about metallica's first guitarist, cause they all were alcoholics but he was a drug addict and they kicked him out. but he went and made this killer band megadeth... if you like metallica a lot you should get countdown to extinction by megadeth its so rad\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI guess I am a poser. I smoke ganja all the time. I should die for my poseryness. Some people wanna do it to be cool, but many people do it because it IS. And marijuana is not addictive like coke and herion, don't get confused there.\n\r\nBut yeah, this is about drugs. Plain and simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\ngod this song is incredible,the s&m version is so powerful.just for the record and seeing as its a comments thingamajig its cocaine not any other shit anyway there all bollocks bar marijuana.the riffs are fucking amazing.dontcha just love james' meaty rhythm guitar.mmm.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nhonestly i dont see the big deal in arguing about what it means or is about, cant we just all get along and fucken love the song? well whatever, if you all wana go and spend your days debating on what it's about why dont you just ask the band?\r\n-P\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nMy favorite Metallica song.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nIt is true, this song is not about cocaine, but it is about heroin. True, cocaine is snorted and heroin is injected, but studies have shown that users are snorting heroin due to an increase in purity, thus making it more potent. The song is definitely not about the government leading soldiers to death or controlling the soldiers. When a heroin user becomes more and more addicted, thw withdrawl symptoms after 24-48 hours are extreme, making the abuser severely sick. Thus, \"come crawling faster\". The abuser is pretty much crawling to the dealer and the drug. Further, while using the drug the body is damaged physically, ending the life quicker and quicker. Additionally, the verse after James says FACE ME, is talking about the effects of perpettual heroin use. The heroin stays in the body, leaving the mind in an awake, yet drozy trance. Hence the \"never ending maze, drift on numbered days\". Lastly, the heroin gets into the body, its highly addictive, occupying, then killing the user. A kick ass song none-the-less.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI agree with everyone who doesnt care about whether or not the song is about coke or heroin. That doesnt matter cause everyone posting for this song knows that its one of the most kick-ass metal songs of all tiem. Ever since the first time any of us heard the crunching riff in the beginning or the solos later on, we were hooked cause this is probably one of the first metiallica songs that most people have ever heard. Best track from one of the greatest albums ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI'm your source of self-destruction \r\nThey keep comnig back to the drug even though it's killing them, it controls them\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nwhy   do  you    crackasses   think    you   need    to    put    the    lyrics   on here    somebody     clearly     beet     you    to     it, and the song is clearly about the increasing rise in sour milk in the bottle\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nHello everyone, this is my first post on this whole site...there are a lot of ignorant assholes on here but loads of intelligent people too :)\n\r\nAfter reading the opinions here, I don't doubt for one second that the song is about drug abuse.  But before I read all this, I was sure that the song was about religion. \r\nI don't know (and don't care) if the band are religious at all, but I always assumed the song was about how the whole idea of there being a God was a lie, to make people think a certain way.\r\nGod is the master, and humans are his puppets.\n\r\nI got that idea not only from the lyrics, but from the album cover - it clearly shows a pair of hands in the sky (God) toying with his puppets (gravestones in the shape of the Christian cross) as if he's in complete control over them.\n\r\nWhat else....oh yeah, this line in particular struck me - \"you're dedicated to how I'm killing you\".\r\nThat gave me the impression of how believers in God are dedicated to the cause of living righteously so that they can join God in heaven.  Their lives are dedicated to what will be decided upon their death.\n\r\nAlso this, \"Master, Master, Where's the dreams that I've been after? Master, Master, You promised only lies\".\r\nThat made me think that James was trying to get the idea across that even though a person would live righteously, when they die, God's promises (of eternal happiness in Heaven) would not be true. Just one sin would be enough for God to disallow the person.\n\r\nBut then again, I now do agree with the whole drugs thing - the second verse of the song just doesn't make sense with the religion theory.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nMy pal is a metallica whore, and knows all these songs on guitar.  We were sitting in sixth period when he started playing it and stopped and said, \"This sounds like Eric Clapton's song, Cocaine\".  I've never heard it the Eric Clapton song, but he is praising himself for \"figuring out the true meaning of MoP.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nfucking awesomes song. pretty much telling about the power drugs have over people when they are addicted. i said it before and i'll say it again, to all the idiots that think metal songs have bad messages, read the lyrics to this song. don't be so ignorant, metal bands can have good things to say.\n\r\nthe song itself combines sheer power with an incredible sense of melody, including two awesome melodic guitar solos. it's a shame to see what sellouts they've become, now we've got 13 year olds that listen to Good Charlotte and Avril Lavigne thinking that just because they own St. Anger that they're metalheads. try stomaching this song you fucking posers.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\ni had just read every single message, comment, statement, and meaning typed on this page. and the one i most agreed with was masterofpuppets80's thoughts, the one right above me. Right up until the crack about them being sell outs. fact is bands evolve and change their sound as time progresses music changes. i get tired of hearing people shouting sell out or bitch about the whole napster thing, which by the way they had every right to protect their livelyhood, but thats beside the point. why do people care so much about a band selling out? i dont get it. what makes them think that metallica has sold out? is it becuz their music changed a little from the black album to load? hell it was several years since their last album and as the times change so does music, music is constantly changing and if u wanna stay in the game you gotta change with em. but if you think that becuz it sounds a little different and its not as good as the old shit, then all i can say is yeah u r right, i dont think anyone, even metallica can top that old shit, master...black album...justice...kill em all...how could you? there is nothing better.  but my take on the song is yes its obviously about cocaine use. it's just simply explaining what its like for an addict. maybe a warning and a message. maybe just their outlook on the whole thing. i mean if u read the lyrics, altho its such a great song u should know most of it by heart, but if u read em u will see that every line has to do with drugs, cocaine specifically, just in a poetic and metaphoric sort of way. oh and to end this....whoever thought that this song had absolutely anything to do with god or religion is a complete bonehead and should not be allowed to listen to metallica. should be off limits to them. you wanna song about god and religion, see \"The God That Failed\".\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\ni had just read every single message, comment, statement, and meaning typed on this page. and the one i most agreed with was masterofpuppets80's thoughts, the one right above me. Right up until the crack about them being sell outs. fact is bands evolve and change their sound as time progresses music changes. i get tired of hearing people shouting sell out or bitch about the whole napster thing, which by the way they had every right to protect their livelyhood, but thats beside the point. why do people care so much about a band selling out? i dont get it. what makes them think that metallica has sold out? is it becuz their music changed a little from the black album to load? hell it was several years since their last album and as the times change so does music, music is constantly changing and if u wanna stay in the game you gotta change with em. but if you think that becuz it sounds a little different and its not as good as the old shit, then all i can say is yeah u r right, i dont think anyone, even metallica can top that old shit, master...black album...justice...kill em all...how could you? there is nothing better.  but my take on the song is yes its obviously about cocaine use. it's just simply explaining what its like for an addict. maybe a warning and a message. maybe just their outlook on the whole thing. i mean if u read the lyrics, altho its such a great song u should know most of it by heart, but if u read em u will see that every line has to do with drugs, cocaine specifically, just in a poetic and metaphoric sort of way. oh and to end this....whoever thought that this song had absolutely anything to do with god or religion is a complete bonehead and should not be allowed to listen to metallica. should be off limits to them. you wanna song about god and religion, see \"The God That Failed\".\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nI don't think it's fair to pin it on just cocaine.  \"Needlework\" makes a strong case for heroine, for example.  Far as I can recall, you snort powder and you smoke rock but you don't generaly inject it; that's reserved for the big H.  Except for maybe \"black tar\" heroine which is also smoked but I don't think made as big a splash.  ANYWAY...\n\r\nThe song is certainly about drug abuse and not about politics or being controlled by society or religion although there are some obvious parallels.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nAfter reading countless magazines and interviews etc... I can safely say that this song is just about drug addiction in general, no one type of drug but just the perills of drugs and what they can do to people.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nyea, luck jim, but what about the line \"Chop your breakfast on a mirror\" ?\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nyea, and what about the line \"NEEDLEWORK the way\" an obvious reference to heroin? \"crumbling away\" could be a double meaning refering to the way in which certain drugs crumble when heated. \"deaths construction\"- a reference to elaborate drug preparations perhaps?\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nall i have to say is that this song kicks ass!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nthis song is any metallica fans anthem. after i heard enter sandman and st anger, (yes i am a newbie) i looked metallica up and this song shook my world! go kirk you legend! and i love the lyrics jaymz!\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\ni agree with necronius the most on this page i think it cud b about both heroin n coke as many have already said from lookin at the lyrics but hey whu cares the song is fucken awesum and drugs r awesum so quit with the hasslin coz if u heard metallica straight then u shud hear dat shit when u high as a mutha fucka.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nor, it could be about Pinochio kickin Gepeto's ass!!\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\none of my favorite metallica songs\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nmasterofpuppets80 - wow you're a dick.\r\nLet people listen to what they want to.  And you calling these kids posers because they don't listen to your idea of good music?  Well what does that make you eh?  Hypocrite, anyone?  Go drown yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI think its about cocaine adiction but Â¿needlework? heroin maybe too.the god pulling our strings thing makes also lot of sense for example in the part ``where are the dreams that ive been after``\r\nenormous song the interlude mekes me cry!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nYeah maybe the song shows an inkling of drug addiction but i think thats just the surface the song has a darker meaning , ie either the ''System'' or god screws us all and were all helpless sowetur to little things and get addicted and the controller being the master.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI AGREE WITH MASTER OF PUPPETS COMMENT ABOVE AHAHAHAHAHAHAHAH HE'S TOTALLY RIGHT....\r\nAVRIL LAVIGNE IS NOT GOOD MUSIC! \n\r\np.s. this song helped me realize that i had a substance abuse problem, and i broke down and cried when i first heard the interlude...\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nand no, disliking somebody else's taste in music does not make him a hypocrite\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI think Metallica was basically talking about any type drug addiction. Anyone who feels a serious connection with that song and a particular drug, has probably some sort of connection with that drug. I know that I truely believe it is a crystal meth song, because that was my master. There lies the genious of it. THis song has helped me many times in my recovery by reminding me what all addicts become.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nthis song is hella cool\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nyup definatly bout drugs.its so obvious, please all those who think otherwise, jump off a bridge. brilliant song, the interlude is awesome. now go listen to some Iron Maiden too, for anyone who hasn't been enlightned that way yet haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nyummers...good song. I love it. MASTER MASTER!:) Good times with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nok - out of 79 posts im the only one that's suggesting this, which probably says somehting but hey, whatever:\n\r\nfor me personally this song screams anorexia. But hey thats my opinion and no doubt i'm gnna be picked apart for it!\n\r\nbut yeah, before you all kill me i can see the drug thing so i'm not saying it's wrong.\n\r\ni also like the religion idea - seems also a bit like it's about the idea that it might be about communism, and i can see lines to support both those interpretations. And whoever called the guy that suggested it a bonehead for saying they USED to think it was about religion can go screw a dog for being so fucking narrowminded.\n\r\nTo me, although its been drilled into me that it;s about drugs, which i can accept, the song is still about anorexia.\n\r\nfucking great song though whatever its about\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nTHIS SONG IS VERY SIMPLE:\r\nMASTER= DRUG.\r\nPUPPETS:THE PERSON WHO TAKES THE DRUG.\r\nAND IT CAN BE REFERRED TO ANY DRUG!!\r\nIT DOESN'T MIND,COCAINE OR HEROIN OR EVEN CIGARRETTES!!!!\r\nANY DRUG WILL KILL YOU!!!\r\nANY DOUBT???\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThis is a good song song but it is overrated. It isn't metallicas best song and to many people play it. It's the next Stairway to Heaven\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nit is metallica's best song. it really is.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nWell, according to the movie Some Kind Of Monster, I think both Lars and Kirk specifically stated that Master of Puppets was written about people with controlling personalities.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nThis song totally rocks. I always thought is was about religion because of stuff like \"ritual misery\". I'm not really sure though.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nFor fuks sake its about alcohol, and how it ruled him, and his battle with it.  Simple as that. 100% true\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nu guys are all retards. its about satan and how he can control u. Sad But True is also about satan.\r\nis it true that this whole song is a satanic message if u play it backwards? i played it backwards but diddnt hear anything. someone plz get back to me on that.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nhey nirvananerd, poor point, have none of you seen the metallica icon doco.  James himself explains how the song was about his alcoholism, and how he was stuck in a snowed in russian hut for 7 days writing it, whilst consuming crazy amounts of vodka.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\no well i think u can see y i thought it wuz about satan. u can sort of relate. well thx for the info.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nin the lines \r\n\"Master of Puppets I'm pulling your strings\r\ntwisting your mind and smashing your dreams \"\n\r\ni always thought he said \"twisting your mind as fast as your tits\"   funnier my way\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI say that if anyone who doesn't love metallica can go rot in hell....WHO'S WITH ME??????\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nI'm not. Metallica turned out to be the Ã\u009cbergheyband with a stocknotation.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nMoP is about drugs, that\\'s quit obvious, though you could give it other meanings for yourself but it was written about drugs. I think the cover of the album MoP is referring to the song Disposeble Heroes which is much more about that.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nI think instead of drugs its about a struggle with god, and the helpless feeling you have and how you cant really help whats going around you, and how god is supposed to be there for you if you follow him, but instead you get nothing...\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nSo I get nothing from my God huh? Hmmmm. Well it seems like someone doesn't understand the concept. Too many of you asses think God is something we should be able to pray to and obtain immediate satisfaction, kind of like a wish-machine. Well little do you know that He gave us the greatest gift of all time in free will which allows little cocks like yourselves to run around and defy the life which you could lead if you would only just believe. You don't have to go to church every Sunday, you don't have to go to school and get good grades, you even have to follow the law if you choose not to but know this. God is always with you. No matter how big of a jackass you are to Him.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nWow, i never even thought of this song being about drugs. of course i had some of the lyrics mixed up anyways\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\n\"Well little do you know that He gave us the greatest gift of all time in free will which allows little cocks like yourselves to run around and defy the life which you could lead if you would only just believe\"\n\r\nwow it just sounds like something straight out of the bible\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nNever thgouht that it could be takling abotu drugs, thgouht it was tlaking about God or somehting like that , until a friend of mine told me about it\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\neven the band itself doesn't know what it's about -- in SKOM, ulrich joked that when hetfield wrote it he was looking ahead to the future about whatsisname -- the psychaiatrist guy\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nAll you fucks are wrong its about Jame's bad drinking habits!\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\n\"wow u guys are all wrong. seriously look at it here. its about the devil. selling your sole for false promises when u get your ass screwed in the end. read it its not hard to understand it \"\n\n\r\nyoure an idiot\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\n'Needlework the way'. It's about drugs. \n\r\nPLUS THE BEST SONG EVER RECORDED.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nokay its about dictatorship like hitler or something\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nFuck me sideways. Silly fuckers arguing passionately about the same fucking thing. Loosing your soul to the devil. Losing it to drugs. Same fuckin thing.\n\r\n\"chop your breakfast on a mirror\"\n\r\nIf you can't guess the main themes of this song from that line then you probably should stop listening to Metallica.\n\r\nbeastieboy: I realise your probably about 15 given the average age of most people on this fucking site and the fact that you called yourself beastiboy, so I won't rip on you like I would if you said that shit to my face, but i'm pretty sure you're mistaken in the last comment.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI think this song is about religion, and a man dying just to find that what he believed was wrong.  The man dies, and everything he was promised in the afterlife is not there.  So he's pissed.  The song's about that guy.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nDrugs, Religion, Someone controlling you damn guys its all the same thing the person feels like he is controlled enough said\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nI definataly think this song is about Drug addiction and how it can control you.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nI'd like to report a mistake in the lyrics, the like \"FACE ME\" is wrong, this lyric is heard just before the main solo after the interlude.\n\r\nThis is line is indeed \"FIX ME, BABY\"\r\nProof? read the lyrics book that comes with the record\r\nMORE PROOF.. when performed live, and i have seen metallica many times since 1992 on about 5 occasions, when performed live James yell's \"FIX ME, ****\"\r\nwhere the **** is, he simply yells out the town name of where Metallica are performing to excite the crowd, rarely does he say baby live where **** is, and sometime's he yells \"fuckers\" where the **** is.\n\r\nMetallica have been interviewed about the lyrical content of this song, and they say that they dont even know what the song is about, and that it is not specifically about drugs. This song is obviously about drugs, and too anyone cultured as the scene of 1980's America, would know that Cocaine was the drug of choice for high profiles, rock stars etc.\n\r\nEven the lyrics on metallica.com , the official website site say \"FIX ME, BABY\"\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nI have the book METALLICA \"the meaning of it all\"\r\nit has the lyrics of the songs and then a description of what that song means from interviews with the band, and Master of puppets is about COCAINE.\r\nnothing more nothing less.\r\nnot heroin or the meaning of life.\r\ncocaine. they are singing it like I am cocaine and this is what i will do to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nIf Satan himself ever spoke any clearer through a song it's this one. He loves to see people destroy themselves and he loves to make puppets out of us. He loves it when we allow ourselves to fall into his clutches and become such. He laughs in the end because we can be so gullible and useable by him.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nListen up cuz you're all wrong, and I'm going to tell you what the song stands means exactly. First the name Master comes from the word Lord, which comes from canaan, a land of Elohim worshippers or God worshippers, also a people the chosen ones were to enter into and anialate utterly, sparing nothing alive or inanimate, nor picking up any of the accursed objects the canaanites used in their rituals. They were warned that if they left anyone alive that eventually these people would enter into marriage with the hebrews and a time would come when the one would ask the canaanite, \"How was it that you worshipped your Elohim (singular word refers to all the creation as one, or God). And So you have Master a word used by satan worshippers which means lord and both come from the words el and elohim, or baal. Now juxtapose this in contrast to the fact that the christian churches use this Title Lord to refer to either a Husband, Jesus or Zeus (once the greeks got ahold of the texts) or the Heavenly Father who commanded the Hebrews through Mosheh (moses) only to refer to him as father, or Yahweh which is his only name. So you have to remember that James was somehow privy to info that his preacher dad wasn't and he's making a very wide and bold statement to all, and all of the above is included, but if you leave these facts out you aren't worthy. Now the only lyrics I saw that reference drugs or could is the mirror thing. But remember, this song is broke into two totally seperate pieces from a musicians point of view, and the second have is what man thinks he would say to the one he called master. But Yahweh would simply say, get away from me, I never knew you. without saying it of course cuz he owes no one that stupid anything, and the laughter you hear is judgement without anything more need be said. The song is basically prophetic in that it described well before these last days what would take place. now let me break it down for you\n\r\n\"End of passion play...mel gibsons movie\r\ncrumbling away\" ....The lies of democracy\r\n\"I'm your source of self-destruction\"...well when you sing it out loud it's clear isn't it?,you no one else\n\r\n\"Veins that pump with fear...the media fear machine\r\nsucking darkest clear\" should say\" sucking dark is clear\"....it's pulling you, and you know it!!\n\r\n\"Leading on your death's construction\" ...well if it's leading, then you must be following\n\r\n\"Taste me you will see\" ...eating unclean foods, you know forbidden as in the garden and adam and eve and the opening of the eyes,,come on people this stuff is so plainly clear!\n\r\n\"More is all you need\" ..24/7 someone is trying to sell you something you don't need!\n\r\n\"You're dedicated to\" \r\n\"How I'm killing you\"...recent survey says today you're actually dying from something totally different than we told you yesterday, and tommorrow holds the same prospect.\n\r\n\"Come crawling faster\" ..well instead of standing for Yahweh, and coming out of her, so as not to partake in her sins, or obeying the law, not to bow down to gods or idols, or knowing their is only one who can kill the body, and cast the soul into a lake of fire,,,people are on their knees groveling and begging, and like an epidemic it's spreading fast.\n\r\n\"Your life burns faster\" ..the state of the earth today all together.\r\n\"Obey your master\" \r\n\"Master\"....I believe this is a statement from the creator in different words for a different age, that you can't partake of the table of demons, and the table of Yahweh, to him whom ye serve, ye belong!\n\r\nOkay well if anyone wants to know the rest, and you really think I'm a nut, just know this, you were all wrong, for all these years, and so that means I've always been the number 1 Fan, and I have loved Metallica more than you for 17 years now..Ha!\n\r\nany comments please feel free to email me, or go to yahweh.com and read some of the online booklets and you will learn just how amazing our Heavenly Father really is.\r\n\"When they proclaim Peace, True Peace, then Destruction will come swiftly\"\r\n\"when they say Peace, True peace, then you will know the the Great and Dreadful day of Yahweh is at hand\"\n\r\nsizzlean\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nI guess this song could be interpreted as being about religion or war or whatever but I think it's specifically about drug addiction and how the drug addicts become \"puppets\" of the drug dealers.\n\r\n\"Needlework the way, never you betray\r\nlife of death becoming clearer\r\nPain monopoly, ritual misery\r\nchop your breakfast on a mirror\"\n\r\nThe \"Needlework\" is most likely referring to the use of heroin.\n\r\n\"Taste me you will see\r\nmore is all you need\r\nyou're dedicated to\r\nhow I'm killing you\"\n\r\nthe \"more is all you need\" line refers to how people get addicted to the drug and all they want is more. \"Your dedicated to how I'm killing you\" refers to how the drug addict's addiction is makes them \"dedicated\" to they way that the drug dealer is killing them by selling them drugs because they are addicted to it and cannot stop.\n\r\nEither way, what most people would agree on is that a major theme of this song and the whole \"Master of Puppets\" album is many people being controlled by someone without realising it (puppets) and this theme also comes up in many other songs in the album such as Welcome Home (Sanitarium), Disposable Heroes and Leper Messiah.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nProbably the most well written metallica song. One of their only songs which has meaningful lyrics, this and a few others. Its about heroin and how much James portrays himself to be an addict when he is really just a cheese ball.\n\r\n Mistake in the lyrics - Clearly says \"Fix me\" not \"face me\".  For one, face me doesnt have any relevance whereas \"fix me\", does. Secondly check out any live recording and he says \"fix me\". S and M for example.\n\r\nMetallica Burn In Hell\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nthis song is an anti-drug statement. Metallica have said so themselves. it is also, in my useless opinion, metallica's best song. nuff said\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nI don't think I should have to say this but, this song is about drugs people. Seriously it's pretty obvious. The others said it before. This is not about government, you stupid anarchists.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nthis is a retarted song  its all about RAP BEYOTCHES\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nI heard from james himself on tv that it was about alcholism. That's also the reason why he wasn't with the band for a year or so because he was getting help with it. \"Taste me you will see\", it could be one or the other but this is definitaly about alcohol.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nits about fucking cocaine people. it was said at the beginning i dont know why you bother to keep making other shit up. raidaz can go to hell by the way\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nThis is truly one of the best songs I've ever heard! It's about...well, I don't know. Maybe it was made to be about drugs, but to me it has a more symbolic meaning. About believing something you don't like, just to feel secure in knowing something. Then that thought multiplies and you obsess over it, and you go insane. That is what it means to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nthis is on of my fave metallica song, definately my favon on master of puppets\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nO.k. This is the best Metallica song ever. Obviously about drug addiction.\n\r\nP.S. I dont know what xxraidazxx was smoking when he wrote his retarded review... Cocaine maybe?\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nI love this song also It symbolizes drug addiction in first hand of cocaine and a KICK ASS SOLO!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\ngreatest friggin metallica song ever, no comparison to any other.\n\r\nits all about addiction destroying you\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nIt's \"Fix Me\" not \"Face Me\".\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nYeah, it's generally about drugs. Does it make difference what damn drug it is about? This is my favourite Metallica song, and maybe best I've heard. main riff is heavy enough, and middle section is beautiful, great guitar solos. Kick ass song, sry about bad english.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nAm I the only one who thinks the intro to the song was based for, or on, the opening song for DOOM (The Video Game)? Play them next to each-other, they sound toooo similar to be just conicidences.\n\r\nBut onto the song meaning:\r\nI think its about Alchohol addiction, or probably drugs of some kind. The lyrics personifiy whatever addition it is the singer has an addiction to with lyrics such as \"Master of Puppets - Pullin your strings\", meaning that the alchohol, or drugs or whatever are controllng you, robbing you of making your own decisions.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI think all u guys are wrong.  this song is definetly about the governement controlling soldiers.  If you look on the album cover you'll notice the soldiers graves with the hands in the sky with the puppet strings.\n\r\nAnyways thats what i get from this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nlol you guys are all assholes. Anyone that said its about anything else but drugs is on drugs. It never mentions once the government or religeon. Your reading to deep into it. While there other songs may talk bout those topics this one doesn't. Most likely this song was directed at Mustaine but i can't say that for sure and I'm sure they would never admit that now anyway. Anyways this songs about drugs and addiction and how it controls and destroys you.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nWell u all surprised me with the drugs thing my take was from the controlling and sucking of life and also the abreviation of master of pupets to MP yes thats right the government that controls us as pupets but anyway thats my take just thaught you might find it interesting\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nok...it is about drugs..plain and simple. the cover with the hands and crosses is a mix between master and disposable heroes. i see hints of both heroin and cocaine in the song...so who cares ..it is about drug addiction in general\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nDrugs. \n\r\nMy friend thought it was about kinky sex...\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nHere's a more detailed lyrical analysis of the song that I drew up. Some aspects are, perhaps, slightly off, but it is based on my personal interpretation, after all. Hope it helps.\n\nburntoast.net/mop/\n\n\n", "comment_130": "\n\"chop your breakfast on a mirror\"\n\r\nI haven't read through all of the comments, but this line clinches the 'cocaine' theme. I don't think it's about heroine at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nI must say, I am very disappointed with all you people who come here and bash people for having a different interpretation of this song than yourselves. Everyone has their own interpretation of each song. There is no right or wrong interpretation. When someone explains the meaning of a song they are explaining what it means to THEM, not others. Each person's interpretation often reflects on their personality and life experiences so people may have different interpretations.\n\r\nNow, James Hetfield may have had a particular meaning in mind when he wrote it but that's what the lyrics mean to HIM. Song lyrics are just a bunch of words and sentences arranged in a meaninful way and therefore could mean very different things to the author and the reader. Just because those lyrics mean a particular thing to the author of them, doesn't mean that's the \"right\" interpretation. Lyrics by themselves mean nothing, they require people to add meaning to them. The meaning of a song only exists as people interpret it and therefore there are many different meanings for each song of which none are wrong.\n\r\nSo stop bashing people because they disagree with your interpretation or the popular interpretation.\n\r\nBesides, the text above the comment box says \"What does this song mean to YOU?\". So by sharing their interpretation of the song, people are only answering the question they were asked in the first place. After all, that's the whole point of this site, to discuss and express what a song means to YOU so people can find out about a wide variety of interpretations. Bashing people just because they disagree with your interpretation or the popular interpretation just discourages discussion.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\ni think that kookkie is right on the dot on this song. i know you all think there songs are about drugs but.....this one actually is\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nI don't think this song is completely about drugs.  everyone in life has their own addiction and passion for something.  this song is about practicing control because if you don't than a master will reign over you, moving everything in you're life, and in the end all what you had chased turns out to be a mere fantasy.  therefore losing yourself and objectives in life.\r\n'I will help you die'  aswsome words. very strong.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nI think its about a guy who called James Hetfield who took a shot in the mouth from a hairy russian roadie named Stanislav on September 28, 1991\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nMaster of Puppets was released on 1986. Moron.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\ni think this song is really about adiction, most probably drugs considering that it will destroy you and reference to needles and so. I don't really think that this has anything to do with politics or beliefs it's simply about drugs, and not any specific drug. some songs have a very deep meaning and are not what they might seem, but I don't think that's the case here.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nok..first of all id like to say i think its sad that you bash each others opinions so much. opinion is just that your own PERSONAL interpretattion..but anyway\n\r\nsecond of all, to that guy with the religious ramblings and his comment bout the line 'end of passion play' tieing into the mel gibson movie 'the passion of the christ'...now lets think hmm metallica..master of puppets..1986!!! Pasion of the christ? 2004.  CLEARLY no link\n\r\nthird of all, to the guy that commented about how its similar to dOOm, i agree with that, my brother even mistook it for the dOOm theme when i was playing it, but there is NO POSSIBLE WAY Metallica ripped it off, once again MoP '86: dOOm mid '90's\n\r\nfourth of all it can be about any kind of adiction, 'chop your breakfast on a mirror' indicates cocain\n\r\n'needlwork away' indicates heroin\n\r\nalso in the MTV icon special James said that it he later relised AFTER writing it that it tied into his alcoholism\n\r\nanyways i dont understand why we need to argue over EXACTLY what it is about, any way it is and always will be a metalheads anthem\n\r\nps. to the guy who questioned the 'ritual misery' line, i interpret that as the ritual of taking your drug, which is a misery to the adict..or an adict thats aware of his\\her problem anyway\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nHe probably confused the title of the movie with the defintion of \"passion play,\" which is \"a dramatic performance, of medieval origin, that represents the events associated with the Passion of Jesus.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nwell, obviously its about drugs, but it can be applied to anything that is addictive and ruins ur life..alcohol or even cigarrets....only if it wasent for the line \"Chop ur breakfst on a mirror\"\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nok, so a lot of people thing this song is about drugs, and within that they argue with each other over which drug, some people think its about religion or government, one person up there even said to them its about anorexia.  The thing is, songs are kinda like poems, and the great thing with a lot of poems and a lot of songs, is that while it may have one meaning to one person, it could have a tottally different meaning to another person, it all depends on what the song says to each person, how they interpret it.  There are lines that give clues to specific meanings, but if 95% of the lyrics are telling you one meaning, while a few lines dont fit, oh well, the majority of the lyrics are giving you that meaning.  Lets say that when metallica wrote the song, they wrote it specifically about drugs or alchohol, thats fine, that doesnt mean that the song wont mean something else for another person.\r\nIn my own opinion, its about some controlling element, whether its addiction, religion, a type of government, or any other controlling element.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nIts about drugs and drug abuse anyone who doesnt see this is an idiot\r\np.s. my favorite song ever love the intro\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nThis song is about Satan and how he pulls you down. Just think about it. It's not about drugs.\r\nOBEY YOUR MASTER = SATAN.\r\nFace me, hell is worth all that. Natural habitat. \n\r\nIt's obvious that's what it's about.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nits about coke...i mean..heroin is able to be done in line form..but not many did it in line form those days..so you gotta rememebr what year this shit came out...ITS ABOUT COCAIN..same time the movie blow was taking place...same drug...CHOP UP YOUR BREAKFAST ON A MIRROR..common..people are fucing stupid...!\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nBest Metallica song ever.\n\r\nIt's about drugs... period.\r\nNot any specific drug... just the ones that will mess you up. \"Chop your breakfast on a mirror\" is most likely cocaine. The line about needlework is about heroin. Any previous lines are nuetral to pretty much all drugs. .... Look at any live performances  as well for proof it's about coke and heroin. During the line \"Fix me\" or \"Face me\" or whatever he makes a hand gesture and injects himself in the arm.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nThis song's awesome! Master master! \n\r\nAnd who cares what drug it's about? what defference does it make?\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nThis song's awesome! Master master! \n\r\nAnd who cares what drug it's about? what defference does it make?\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nI think this song is about drugs, but I know alot of you are saying \"Metallica was never on drugs\" well, they weren't, In my opinion they're pretty much saying why you SHOULDN'T do drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nThis is an excellent song but I don't see why everyone says \"ITS THE BEST METALLICA SONG\". I truly don't believe in the \"Best\" of songs because every song is different (unless a band is cheap and duplicates its songs lol). I mean, comparing Of Wolf And Man and Master Of Puppets, I would chose Wolf because I prefer its sounds and shortness to Puppets length. Great song though and superb album.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nSorry man, but superb doesn't do this album justice.  It is without a doubt in my mind the greatest album ever released.  It's so sad and pathetic that the rest of the world doesn't realize that...  With almost 2000 posts on American Idiot and 150+ on Master of Puppets...  Where is the justice of God?\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nlook again TheKorean2908. see how many of those comments are praising and how many are paying them out. \r\nand the real story is in record sales. Metallica has sold twice as many albums as green day.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nVery true, and I'm glad it is so.  I'm just pissed that Green Day's American Idiot has 20x the comments this 8 and a half minute epic masterpiece does compared to a two and a half minute piece of shit.\n\r\nBlistering solo by Hammet, Guitar World rated it somewhere in their top 100, can't remember where though...\n\r\nLet's get some opinions: what was your favorite song on this album?\n\r\nI loved Orion, Battery, and Damage Inc. but I guess the real debate for me was between Sanitarium and Master of Puppets, and I gotta give it to Sanitarium, I just love the solos, not the hardest to play, but Kirk sends chills down your spine with them, amazing creativity...\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nThis song features a riff of david bowies from his song Andy Warhol and this album also features the song Leper Messiah, which is a lyric in the song Ziggy Stardust, coincidence? \r\nMy favorite songs on this album right now are Battery, Master, Sanitarium, disp heroes, leper,  orion and damage inc. The only song I think doesn't compare with the rest is The Thing that should not be even though it is decent\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nI think this song is about how god toys with us and experiments with our lives... i agree with \"Nimrod18037\"\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nIt's about how drugs control you.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nThis song is awesome...MEtallica is my favorite band of all time........YOU SHALL ALL BOW DOWN TO THE KINGS OF METAL!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nthe reason why you all have different opinions about what this song means is because metallica dont want it to have a specific meaning they want u to create your own thoughts in your mind about what the song is about i am a massive metallica fan and this is by far 1 of there best songs ever\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nMy theory is a bit the same, a bit different.  I think that maybe to them it mean drugs, drinking or whatever THEY were thinking at the time.  I think that in general we should take it as addictions in general... I'll explain\n\r\nEnd of passion play, crumbling away\r\nI'm your source of self-destruction\r\n-an addiction slowly eats you away or wares you out.  could be self harm, alcohol, drugs, cigarettes-\r\nVeins that pump with fear, sucking darkest clear\r\nLeading on your deaths construction\r\n-any substance or behavior that is harmful is justgoing to give you an adrenaline rush and possibly a black out or even the lead into death-\r\nTaste me you will see\r\nmore is all you need\r\n-its doesnt even have to be about physically tasting something its more mentally the way i see it.  adrennaline rushes can do crazy things to you and you just always need a little more... a little more-\r\nyou're dedicated to\r\nhow I'm killing you\r\n-this part twists it.  it says \"youre\" instead of \"I'm dedicated to\" so this could be one of two things.  the addiction talking to the person or the person trying to over come this all-\n\r\nCome crawling faster (faster)\r\nobey your Master (master)\r\n-the addiction begins to take its toll on you and it just wants you to keep giving in.-\r\nyour life burns faster (faster)\r\nobey your Master (Master)\r\n-the time may go by quicker while you are in the state of being drunk, high, or just plain adrenaline rushes from a cut to your arm or something.  but your \"master\" is the addiction.  its somehow calling out to you-\r\nMaster Master\r\nMaster of Puppets I'm pulling your strings\r\n-this to me is another one of the flip things.  I feel like the person is trying to flip things around.  i begin to stop believing that the addiction is using reverse psychology on the person. or is talking for you.  You're trying to pull the strings to switch the control and fight the addiction-\r\ntwisting your mind and smashing your dreams\r\nBlinded by me, you can't see a thing\r\n-although here i start to wonder if the person is being controlled completely by the addiction.  or if the person is \"smashing the dreams\" of the addiction and blinding the addictions way from continuing to control the situation.  trying to fight it.-\n\n\r\nthats all i'm going to put now but if you somehow disagree with me, then i'm willing to hear your opinion.\n\n\n\r\n...and i MUST add i have always looked up to Cliff burton as a bass hero.  Although he must have been absolutely whacked out when he wrote the bass part for this song.  he said to himself something along the lines of \"hmmm lets play exactly what the guitar plays... thats a good idea because i'm fucking amazing and anyone who ever tries to play this will die over it\" my bass teacher has been progressively working on teaching me master but he's really good at it so i'm like \"whaa?\" yeah its a TOUGH song especially to play up to speed.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nwho cares if it's heroine or cocaine ? personnally I can't tell the difference cos I haven't been stupid enough to try them.\n\r\nNeedlework = ecstasy\r\nchop your breakfast on a mirror = cocaine\n\r\nnow stop fighting\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\ni think its about being a low level soldier in an army and how you can no longer make your own choices\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nIt is not necessarily about drugs, or anything else. It is about any puppet master and the people he/she controls so anybody can relate to it, because everyone has been controled by a master at one point in their lives.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\ni love this song. and its just  a song, guys and dolls. dont fight over it, please.it's ridiculous. i say it in a friendly way. dont get me wrong....:)\r\nMETALLICA ROCK :)\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nwell, it really talks about drugs. :P not about devil. it'll be too much and too obvious. this song is written to make us think...\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nThis song is, without doubt, about the Muppets\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nBest Fuckin song in the world. No question.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nit's about heroine abuse and the outcomes of it.\r\nand the solo is freakin' amazing and metalfloyd's a dumbass because anybody w/ eyes and ears can see it's about drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\ni'm sorry metalfloyd, i didn't see what u actually meant, your words made sence. it's therockingloser that's the dunce. i don't know where he got the \"low level soldier\". and by the way metallica's the best band to ever enter the heavy metal scene.\n\n\n\r\nrock on\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\n\"rock on\"?....Dumbass.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nBEST SONG EVER!!!  Metallica is the best band ever, and this is their best song.  Amazing guitar playing and lyrics.  Metallica rulez!!!  The song is about drugs and their devastating effects.  Specifically about cocaine and heroin.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nThe addiction of Drugs and how obivious people are that it is acually killing them. It is a true about this song being the reason Dave Mustaine is not in metallica anymore. I do agree with nimrod18037 about the deeper meaning. Metallica is my favorite band.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\ni didn't read all the comments but i agree with most of you...how drug addiction fucks you up\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nwhat i love about this song is the way it seems like a dialoug between the addicted person's brain, and the drug..\n\r\nStarts with the drug tempatation saying :come to me..\r\n\"Obey your master, master of puppets pulling your strings, just call my name, dedicated to how im killing you\", and so on...\n\r\nand then comes the solo smoothly...this is where u take in the drug, and now ur high, and ur brain starts to flow around and then starts clearing out a bit...\r\nppl start having pity for ur sad condition, and they make fun of u cuz ur a slave to that drug \n\r\nso ur brain sez (after ur body stabilizes back again): \"y do i do this shit\", \"none of my problems are solved\"\r\n\"master, master, where is those dreams that ive been after?\"\r\n\"Laughter, laughter, all i see and hear is laughter\"\n\r\nand finally, The moral of the story...i feel this is the part where metallica speaks...its sez fuck all that,is that how u want ur life to be? u deserve a lot better..\n\r\n\"Hell is worth all that, natural habitat\r\njust a rhyme without a reason\r\nNever-ending maze, drift on numbered days\r\nnow your life is out of season\"\n\r\nwell, thats y i love it, thats y i love Metallica, they rule...i love the S&M version alot better..has more emotion than the album version..\n\r\nMetallica RULEZ...\r\nRescpet...\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nAnything that is to be said about this brilliant song has already been said so I'm just commenting to say that all of you are right in some ways about the true meaning of this song, I personally am yet to decide how I interperate it. I'd also like to mention that as good as the melody of the lyrics may be and how brilliantly James sings it, the guitar parts are much better and I suggest you listen more to the music, dont get me wrong I love the lyrics and there must be some sort of meaning but That, in my opinion, is the greates guitar riff ever made. James's tone of voice in the first 3 metallica albums, kill, ride and master is perfect in every single way, just thought i should mention that....\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nDUH it's just about cocaine... this song is a pretty good portrayl of using it...By the way, it is definately not about heroin, considering you dont really taste heroin/ it doesnt taste very good and no one who does it puts it in their mouth and if you do taste it its only from the drips of snorting it which would have to mean not shooting up thus that kids vein idea is completely blown, yet while using blow, everyone is always rubbin it on their lips and gums cause it makes em numb and shit AND you taste it from the drip.  Also by saying tasting they could just mean trying it, not literally tasting it, and it is true for most that once you try coke your always wanting more...but when its there your so sick of it, yet when the bag is gone you always want more.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nAnd heroin doesnt twist your mind, it pretty much just makes you mellow and maybe more liable to steal whereas cocaine and meth actually fuck up the structure of your brain.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nthis song can be taken anyway u want...\r\ndrugs.. of all types.. i've never done most of that shit so i wouldn no. also government..\r\nive also heard that this is about hetfields (i think) ex wife, n how she was so overpowing etc. even tho i dont no if he had another wife than Francesca (his current wife) so yeah.. many things... more importantly is the music.. the fuckin insane riffs n the fuckin solos....\r\nas some1 else said,, the s&m version is crazy. the first 3-4 mins of htat i rekon is the most intence few mins of music ever written\r\nbtw b4 the solo does james yell \"fix me baby?\" soudns like it.. but iv read other shit so?\r\nmetallica fuckin rule!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nWhy is cocaine chopped on a mirror, I have never understood this. Anyway I can't remember where it was but they said it was about the cocaine addiction but again it was about being in a situation you couldn't control.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nTHIS SONG RAPES ALL OTHER METAL IN THE ASS\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nxMaYnArDx, u need to get ur facts straight... MetallicA wasn't a drug band... they just drank their asses off, not that it's much better, but it's legal... \n\r\nsong's about cocaine, heroin, and being slave to the addiction\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nyou know what hate? when i ask someone what their favorite metallica song is and they say master of puppets! It pisses me off because its like the only song everyone knows by them, its so overated.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nHe says Fix Me in the middle part, and it is about James Hetfeilds addiction and about being under the influence of alchohol and drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nIt's definitely about the Cocaine.\n\r\nNeedlework the way, never you betray\r\nlife of death becoming clearer\r\nPain monopoly, ritual misery\r\nchop your breakfast on a mirror\r\nTaste me you will see\r\nmore is all you need\r\nyou're dedicated to\r\nhow I'm killing you\n\r\nIt could also be about heroin, based on the line with needle work, because of the needles involved with that.\r\nAnd the chopping your breakfast on a mirror, about how coke is chopped into little piles on something smooth, usually a mirror or something.\n\r\nAnd the angle of disposable heroes could fit in here as well.\n\r\nSo perhaps its about how different things control us, and we become dependent and vulnerable.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nI donno, I thought it was about war ey?\r\nCould Be About Drugs, Imma Finish Reading Ur Comments Now An Keep Thinking\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nAlright, I've heard that this one is all about a kind of force that is controlling someone in some way and the popular subject matter has always been drugs and I agree with that when I read the lyrics. \n\r\nI've also heard that the song could be about how troops die in war and the \"master\" is their country's leader.\n\r\nWhen I was younger, I always thought of this song an applied it to the adults at my private school.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nA masterpiece.  Better than Motzart.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nI think thi song is about a cocaine addiction\n\n\r\nBy the way Love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nIts about jim henson\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nUm.\r\nMetallica aren't heavy metal, their Thrash metal.\r\nJust wanted to make that clear.\n\r\nAnd heroin does fuck you up. Bad.\r\nSo does cocaine.\r\nMaybe the songs about both? Metallica has duel meanings in more than just one of their songs, their actually intelligent poets not idiot gangsta 'Yeah got my girls in my crib and I'm hungry for some fish' bullshit.\n\r\nAnd they are poets, poet doesn't mean fag. Just clearing that up too.\n\r\nLive FASTER everyone.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nYea dispite all te arguements against this... im still in favour of the song being about war.. it fits in with so many other songs past and future of this song...\n\r\nmy justification for this...\r\nMaster... the superior officers etc whom soldiers (puppets) take mindless orders from\r\nBlinded by me.. propaganda\r\nthe crawling is obvious... through mud.. shell going off around u etc.\n\r\nAnd like its been mentiond brfore, it fits in with the album art too, the puppet stings coming down into war graves...\n\r\nbut anyway.. im gonna take this time to piss you guys off.. see how many reactions i get.. maybe start a bit of band to band hatred...\n\r\nThe thing i hate about the metallica fans (most of them anyway) is how 99.9% of the posts are saying the same thing as some person before him or just saying somthing like yea metallica is awesome.. not all that of a valuble comment.. \r\nI am a tool fan myself, dont get me wrong 'tellica are ok... but only that. If you guys beefore u send off your abuse, care to check out the tool comments and interpretations on this site. You will find them deep, meaningful and for more of a point origanal.. Its very thought provoking looking though the analysis of songs such as Third Eye, Lateralus, Parabol and Jambi. \r\ncheck it out somtine.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nkk how about every1 stops bitching at each other and lets just go with its about people can be maninpulated whether its drugs or the government or a bunch of boys huddeled over a victoria's secret bra magazine. the master of puppets is wat ever is manipulating the person (or group of impure thinking boys)\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\noh and Live FASTER thrash metal is a sub genre u fuckin dip shit \"Just wanted to make that clear\" and for my closing statement best metal song ever\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nlook, bottom line, the song is about JAMES's addiction to heroine and coke, thats what they wrote the song for, but the great thing about music is it can mean anything to anyone, to me the song is about my exes addictions and how i wasnt able to help her, shes getting better now but were not together\n\r\nso basicaly this song, and no song is about any single one thing, hell this song can mean ur addiction to cake, or even something compleataly unrelated to addiction, it all depends on whats in ur head\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nthank u satanic dave\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nagain-- Rule #1- Music is magic and speacial, it has a different meaning for each indiviual...\n\r\nI mean, for me, it's about somebody who's lived life in the roughs, and they are coming to relization that they haven't really had a choice in how they lived, that before, they were promised something beautiful, close to the happily ever after, fairy tale ending, then they relise that, 'oh shit, I am dumped, I am alone, everyone else is laughing, I want to know why, yet I already know,' and in this the person thinks that with all the happiness and laughter of others, they are kind of mocking his loneliness, he wants something, he's reaching for it, he has it in his grasp, and then in a quick flash, it's taken by someone, to be loved by someone else, and everyone else is laughing at him, calling a dick, that he's not good enough for this, that he's not good enough for her, that he's only choice to live life miserble and alone... that all he has is his guitar and a recorder, that he can do is fade into his music, his addiction, his one and only true friend, or so he thinks...\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nand if any of you dare challenge me, go right on ahead, I will beat you down, for this is my fav. song by Metallica, and I know more than just this song, I love Metallica, I love this song, and the meaning I placed is a true situation and that's what this means to me, so you fuck-heads believe whatever the fucking hell you want, but I know this fucking song isn't about no fucking drug, no fucking herion, no fucking cocain, and you can get your fucking asses off that shit... you don't understand it, you only understand what he made you THINK it was about, but that's not it, no fucking drugs are involved, I don't know who said it, but Metallica wasn't a drug band, sure they were an 80's bands but they weren't a drug band... and so, if you fucking idiots want to believe that Metallica strictly wrote this on fucking drugs, go right on ahead and believe that, and be wrong...\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nHonestly guys, its a song. It is a powerful song, yes, but none the less, its a song. You really shouldnt waste time argueing about a bloody song. And whoever said Johnny Rotten Died oh Heroin OD is a fucking retard. Sid vicious didnt even die of Heroin od it was the withdrawls that killed him while he was in jail... bla bla bla so forth so on. But seriously guys. Can we all just agree that this is a fucking masterpeice?\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nBottom line, it's all about control.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nDRUG ADDICTION\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nyea its about a drug addiction, i love the third comment by \"master of puppets\" lolololol. yea this song kicks metall ASS!\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nMetallica has already said it a million times. They just wrote whatever cool stuff they could think of for this, and other songs. Lyrics aren't their thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nCliff said that he thought the master was fate..\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nthis is my favorite metallica song. i dont care wat drug it is, it an illeagel one. this song is about wat happens to you wen u take the drug. not actualy the act of tacing the drug. end\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nwats wit the laghing at the end\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nthe sadistic master\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nto dontobay:and u noitice how he was saying \"all i hear or see is laughter, laughter, laughter lauging at my cries. that bacally soms it up\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\ni love the version with the orchestra ... too strong!!\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nthis song rules!! it talks about how if you let drugs in your life, they can take over and become your master.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nThis song is about Metallica sounding badass, pretty much. It can be interptreted like 10 different ways.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\ndrugs is the devil\r\nthe devil drugs you\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nit could be related to slavery, i agree about the drug part but hear me out.\r\nMaster of Puppets I'm pulling your strings\r\ntwisting your mind and smashing your dreams\r\nBlinded by me, you can't see a thing\r\nThe master of the slave is twisting his mind and depriving him of his dreams, by having to work the fields all day.\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nWell personally i think..even though its not about this..i make it into my own meaning of about an eating disorder. An ED can be a lot like drug abuse. SOmething is controling you..you have to have that certain fix..whether it be a drug or a high from lack of food or so called control. The voice of self destruction could be the voice inside your head telling you not to eat..to be strong. The song also says blinded by me..you can't see a thing..an ED can blind you too..make you anitsocial..blind to the fact your dying. ONce you get a taste of the control of and ED you want to push it more. Its sad really.\n\r\nI like this part\r\nMaster, Master, Where's the dreams that I've been after?\r\nMaster, Master, You promised only lies\r\nLaughter, Laughter, All I hear and see is laughter\r\nLaughter, Laughter, laughing at my cries\n\r\nBoth drugs and ED's promise lies..and trick and decieve you. \n\r\nSorry if this seems odd but this is just my own meaning for it..even though its not about this.\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\ni think its about a heroin addict mainly kus it says \r\n\"Veins that pump with fear\"\r\n&\r\n\"Needlework the way, never you betray\"\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\ni hate metallica with a flaming hot passion. but u expect me to say i like this song tho.... i dont i hate eery song from metallica. they plainly suck. there a disgrace to metal.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nA DISGRACE TO METAL?!?!?!!?!?!?! YOU SICK LILTTLE BASTARD!! METALLICA ARE THE ONES THAT SET THE STANDARD FOR HEAVY METAL! IF THEY HADNT MADE ANY RECORDS, HEAVY WOULDNT BE THE SAME!! SO GO CRAWL IN A HOLE AND DIE!!\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\ndude, zinger dont get too excited and shit urself. kirk hammett is a disgrace to guitar players i couldnt tell one song from another if i were to just hear the guitar its just the same thing over and over and over again. If they would've kept Dave Mustaine instead of abandoning him they could be decent.(not to mention they wouldnt be constantly owned by Megadeth!)\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\no by the way on a side note: WHAT?!?! METALLICA SET THE STANDARD FOR BLAND POSER METAL! bands like Deep Purple and Balck Sabbath pionerered heavy metal and even way before them i dont care wat u say but there wouldnt be ANY heavy rock or metal without beethoven, johann sebastian bach, or nikolo paginini. ask any metal experts dark classical music is wat influenced all of the original heavy metal guitarists. even kirk hammett said so *pukes*\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nWHAT IS YOUR PROBLEM? Kirk Hammet is a way better guitar player than Dave. And the only reason there is a Megadeath is because Dave was kicked out. Ok so black sabbath and Deep Purple may have founded metal, But Metallica turned it into Heavy Metal.\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nOh, Side note: Without Metallica there wouldnt even be a Megadeath.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nnooooooo not necesarily true, Dave Mustaine could've made his own band wothout Metallica, but Metallica's asshole-ness did kind of drive him to kick there asses like he did tho i'll give u that. but metallica cant make an original song, they sound like every other 80s metal band. if u played me metallica, Ted Nugent, and motorhead side by side i probably couldnt tell which one was Metallica. But once i hear Dave Mustaine sing/play one line i'll instantly know its Megadeth. besides, metallica's songs have no deep meanings and all have the same sound(i couldnt point out which song was which either!). and Kirk Hammett is a terrible guitarist i literally laugh when i hear one of his \"solos\". Dave is absolutely insanely good if i could be even sumwhere near his talent id be happy. and Dave was kicked out for like NO reason dude if they would've kept him they would probably rock more than any classic metal band but...... THEY DONT!\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nnooooooo not necesarily true, Dave Mustaine could've made his own band wothout Metallica, but Metallica's asshole-ness did kind of drive him to kick there asses like he did tho i'll give u that. but metallica cant make an original song, they sound like every other 80s metal band. if u played me metallica, Ted Nugent, and motorhead side by side i probably couldnt tell which one was Metallica. But once i hear Dave Mustaine sing/play one line i'll instantly know its Megadeth. besides, metallica's songs have no deep meanings and all have the same sound(i couldnt point out which song was which either!). and Kirk Hammett is a terrible guitarist i literally laugh when i hear one of his \"solos\". Dave is absolutely insanely good if i could be even sumwhere near his talent id be happy. and Dave was kicked out for like NO reason dude if they would've kept him they would probably rock more than any classic metal band but...... THEY DONT!\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nnooooooo not necesarily true, Dave Mustaine could've made his own band wothout Metallica, but Metallica's asshole-ness did kind of drive him to kick there asses like he did tho i'll give u that. but metallica cant make an original song, they sound like every other 80s metal band. if u played me metallica, Ted Nugent, and motorhead side by side i probably couldnt tell which one was Metallica. But once i hear Dave Mustaine sing/play one line i'll instantly know its Megadeth. besides, metallica's songs have no deep meanings and all have the same sound(i couldnt point out which song was which either!). and Kirk Hammett is a terrible guitarist i literally laugh when i hear one of his \"solos\". Dave is absolutely insanely good if i could be even sumwhere near his talent id be happy. and Dave was kicked out for like NO reason dude if they would've kept him they would probably rock more than any classic metal band but...... THEY DONT!\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nDude, the reason they kicked him out was because when ever they would stay at a friends house, instead of beieng courtieous he would go and trash the place. Also Metallica is the most original band ever, and Kirk IS A AWSOME GUITAR PLAYER!! He would easily Kick Daves ASS!! And yes More than likely Megadeath wouldnt have been formed if Dave hadnt been kicked out of Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nok sure keep telling yourslef Kirk is better than Dave and be a \"hard rocker\" because u like the most cliche band in the world. Metallica should just stop and we'll all pretend IT never happenned.\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nthe most cliche band in the world? wow you do have a twisted mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nI bet that the only reason for Megadeaths being is to TRYand out sell and TRY to out preform Metallica. but the cold hard truth is that it will never happen. even in your sick little fantasy world. METALLICA FOR EVER!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nummmmm actually Megadeth altogether has been more successful than metallica... :-P\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nlmao i just did a bit of research (on torture methods) and i just found out that US soldier people used Metallica as sound torture for interrogation of suspected terrorists! lol not even freaking kidding! \"no not another solo please! Allah save me!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\noh my lantern u read tabloids? thats pathetic.\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\ntabloids? noooooo those r for girls and gays (no offense to anyone) i get my info from CREDIBLE sources. and were here to talk about music not my life\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\ni would like to know where you get your \"credible Information\" from. Just to see How legitamate this stuff really is\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\ndude, i use fucking google. it was an agents webpage. he described how they handle captured terrorists.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\ndude, i use fucking google. it was an agents webpage. he described how they handle captured terrorists.\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nmaddest guitar solo ever!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nIm not talkin about how you found it. dipshit. i want to know the link to the site. retard\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\n(will u 2 stop fighting)       google       isnt exactly a credible source no offence but for all we know u could hav gotten it off of weekly world news .com\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nand the agent could hav just been some1 making up stories\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nand because he was an \"agent\" wouldnt he hav 2 be kept queit\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nfuck u zinger cant u have a civil arguement?!?! well, not exactly it was like i guess an interview thingy and they asked how they handled th terrorists. (and i dont remember what fucking link i followed asshead look it up urself!)(and thank u spooner at least u aren't acting like its not a SITE BASED ON PERSONAL OPINION)\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nim not even going 2 get into the megadeth vs metallica debate. their both good. \r\npeace (sells)\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nu welcome by the way.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nI don't care what it's about, it still kicks ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nthis song is about any kind of addiction, though more specificaly cocaine and heroine. and can also be about control. either way, this song RULEZ!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nClearly written about the muppets.\n\r\nBut seriously, good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nu think its about jim henson.nice!\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nYeah, I think the song was originally written about drug abuse, and how it controls your life, but I think the song has come to mean any inner demon that keeps you from being all that you can be\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\n\"chop your breakfast on the mirror\" - if you look into the mirror what do you see? yourself, rite. so it means \"chop and eat yourself\" @ \"destroy yourself\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nHow about try to relate the lyrics to the picture on the album cover?\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\namen for Uncle fe fe!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nits about someone being controlled by drugs and the story is from the perspective of the drug\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nBAD ASS SONG.  Metallica fucking rules\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nSoldiers are the puppets and the government is the master. adn how the master would send the puppets to die.\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\ni think the addiction is alcohol but i dont kno mabe its ment for any addiction if it heroin,cokcaine,pillz,ect.\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nIt can be interpreted as about any kind of addiction, or \"Master\" taking over your body causing you to need it. It is mostly about heroin or cocaine use because of the lyrics in the 2nd verse. Also, after \"laughing at my cries...\" and before the solo, James screams, \"Fix me!\", NOT \"Face me!\" (Source: lyrics on metallica.com). Nevertheless, one of their best songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nkick ass song...reminds me of the whole bdsm dominate submissive thing.....and in a way its kinda like that\r\nsomeone has the power to control u and make u do everything they want u to do...it can either be a person or something like drugs or liquor or anything like that\r\nbut i still believe that BDSM stuff\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nFor the def. go to my comment on pg. 8.\n\r\nAnd the word is \"fix\" not \"face.\" Please change it. If you don't believe me, just listen to a live version. And it's not about drugs, it's about control. I know their is a drug ref. in the song... Drugs are the subject focused on, but the theme is control. NOT DRUGS! Also, I believe the drug is heroin. Just enjoy.\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nThe only thing that makes me lean towards the drug of choice being cocaine is the line \"Chop your breakfast on a mirror.\" There is a clear image of cocaine being trailed by a razor blade on a mirror.\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\ni think its about cocaine breakfast on a mirror, people cut their coke on a peice of glass or heroine\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nwell it obviously refers to cocaine and herion \"chop your breakfast on a mirror\" and how it controls you \"obey your master\" but it can mean to anyone an obbsession or addiction to anything and too much of anything can kill you it also could refer to literally slavery master meaning white man and how they would control the black man and their life and in gereral whether they would live or die. even hitler it could refer to him being the master. an abusive relationship, the government,god and could be examples as well. when i think about this song i think mostly about drugs but it i could mean any of these and many more\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nThis song, as commented by the great Kirk Hammett himself, is about pure manipulation, in any thinkable form - In this case, primarily drugs. First of all, imagine the title - \"Master of Puppets\". The master is, of course, the relentless, manipulative individual, with the puppets acting as the victims under it's control. \n\r\nNow, try to imagine a metaphorical meaning for this. Drug using is a source of mass killing of millions of people around the world, addicting them to it while slowly erasing their \"loyal\" minds and controlling them just as - Yeah, you get the point - puppets. Veins pumping with fear as heroin is slowly injected into them, twisting the victim's mind and smashing his or her dreams with it's merciless force. Still, the victim loves the master that is blinding his or her visions, forcing him or her only to see the master itself. I believe you're understanding the whole meaning now, do you? As previously said, the whole meaning isn't completely about drugs, but manipulation in it's wholeness, but PRIMARILY about drugs.\n\r\nOtherwise, this song kicks ****ing ass. Hetfield's \"FACE ME!\" scream just before the second solo nearly blasts me off the chair before the computer screen every time I hear it, and... yeah, that's it. Absolute metal awesomeness.\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nI think its about crystal meth\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nThis song is about some form of addiction most likely cocaine cause he is talking of needlework, and breakfast on a mirror. \r\nwhatever the case this is the greatest speed metal track of all time and it kicks ass. It also has some of the coolest solos and riffs you will ever hear. When these boys play their instruments its art and this was one of their masterpieces.\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nDefintly drug addiction, stuck on the drugs it becomes your master and turns you into a puppet.\r\nbut the most importent thing is;\r\nMETALLICA FUCKING RULES!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nI think it's about God trying to pull our strings. IDK. I love metallica, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nWhat a great song. I feel it's not just about drugs, but just anything that takes over your life and completely takes over becoming your master. I guess I'd relate Master of Puppets simply to any addiction. \"Taste me you will see, more is all you need.\" I imagine the rush someone gets from gambling for instance. Hard to believe but that is a serious addiction people have and many even wager everything they have and end up losing their homes.\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nIts about how drugs can control you and how you cannot control yourself once you are addicted. It pulls your strings.\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nI love the song and it is indeed about drugs.\r\nI just learnt to play it on the bass guitar.\r\nCliff Burton is incredible!\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nI reckon this song is about hierarchy throughout the world not only with drugs but with all aspects of life.\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nYeah it's definitely about some kind of drugs, probably cocaine because of the mirror thing.  I think it's about other things that control you though too, not just drugs.  It's just about control and enslavement.\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nWhoever said it was about meth must've grown up in the 90s. It's all about BLOW. The master of puppets.\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nIt's a song about self control,and who's controling you dumb asses.\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nwhat cocaine? i thought it was a love song!\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nOne of the best guitar riffs ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nThis song is legandary =)\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nI think its about addiction there are very clear verses referring to drugs as a main addiction but I think the song can also be related to any other addiction/control a matter(drugs,liquor,cigs,,,) or person(gover, authority,boss,) has on people....\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\n11 pages of clueless n00bs\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nThis song is about heroin and cocaine, and their effect on people. The drug becomes the master of the person that takes it because the person needs it. Even though the drug isn't alive, it is, in a sense, controlling the addict.\n\n\r\nOn an unrelated note, the title reminds me of the 1980's horror movie Puppet Master about marionettes with human souls in them that usually kill people. This has nothing to do with the song, I know.\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nIt's about addiction to heroin (\"Needlework the way\") and cocaine (\"Chop your breakfast on a mirror\"). The drugs basically beome your masters, as it's almost impossible to ignore the cravings. I always think of this song as a low blow at Dave Mustaine.\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nthank u nimrod... u are so rite... perhaps metallica meant many things by this song... no one but them can no... and truly wat if they bought the song then they wouldnt even no... but i agree with ur thoughts\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nits obvious that people think this is about drugs, others think its about satan, or god, or the government, or a controlling person, or...\r\nthere are so many things people can relate this song to, and its just a matter of personal opinion.\r\nwhat are you addicted to? what consumes you?\r\ni don't think this can be one thing, but it can be anything that consumes someone, that one is addicted to.\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nthis song is about a cocaine or heroine addiction (i dont fucking know which one) cant you read the  lyrics \"chop your breakfast on a mirror\"\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nis it super hard to believe that four of the most rocking alcohalics in history wrote a thinly veiled song about addiction. its muh-fucking-tallica, they don't need to write in complicated shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nthis is about a game the members of metallica used to play (mainly james and lars) where they would all get naked and close their eyes. a tour manager would tap one of them on the head and the chosen one would jerk off the other band members, it was aptly named because the jerk-ees would have to guess which one of their bandmates was the \"master of puppets\"\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nHangar 18s the Master.\r\nHetfields Anger around his neck is the puppet.\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nDoes anybody know who says master in that weird voice just before the solo in the middle of the song?\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nevery one is wrong, Lars said its about something controlling something or something thats controlling you.\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nit's quite obvious that this song was made with no intentional meaning. Basically you only need a couple words to sum it up Metallica likes crack, booze etc... hey why not write a song about our bad habits and tack a badass title onto it and play a bunch of power cords to accompany them with straight forward lyrics that clearly imply where addicted to this shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nI think the heavy beginning and its lyrics represents the urges a drug addict feels. The sudden transition to the slow calm part with no lyrics represents the return to \"normalcy\" once the urges are given in to and the addict uses the drug. The slow fade to the even faster and heavier ending, especially including the solo, represents a mix of the high ending and guilt for giving in to the cravings. There's more interpretation to this song than just the lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nI need to get more of there albums.\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nMaster of Puppets is about something controlling something. It can be related to a lot of things (such as drug addicts) but it's most likely war related - how soldiers blindly serve the army and many die at the hands of the men at the top (politicians, generals etc.). This is evident on the album cover - a graveyard with puppet strings - soldiers that have fallen as a result of serving as puppets to greater powers. This song ties together with 'Disposable Heroes'. Give it a good listen, you'll see...\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nOur govt/big brother is the one who runs the drug cartell! They want us killing ourselves. Yeah, I lost someone through cocaine, more than one person actually. I still think about them. Glad I got out while I was ahead. Different association now. \r\nGoogle Prison Planet tv and see the reality of what big brother is doing to you and to me, to our children and future generations! Make a choice not to fall into that trap. Unforgiven, yeah, they screwed with us from birth knowing we'd need to self-medicate. Get knowledge, let the fuel you crave be the fuel of action, action toward knowing the truth and exposing the real demons. We are only victims who need to make the claim of survivors!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nIts about manipulation, promising everything then giving nothing but they still follow you in hopes of gaining what was promised\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nhe is singing from the drug's point of view.\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nThis song is clearly about drugs, its saying that drugs destroy your dreams, but you are dedicated to them because you can't stop, you will always more ect. you get it. and everyone who thinks that it is about war or that metallica does drugs is absolutley wrong. \t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nThe Het do drugs ha no. It's just a song. One sick ass one if you ask me. \r\nAlso if you think he says Face Me before Kirk's solo you're are deaf as hell. It's clearly FIX ME! \r\nOne awesome song lots of riffage the slow parts make me tear up it's so awesome especially if you learn how to play it. \t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nPeople... James said in an interview that this song is about all drugs and how it controls u.\n\n\n", "comment_295": "\noh my god its obviously about drugs. \"chop your breakfast on a mirror\" some people chop up and snort cocaine on a mirror. \"veins that pump with fear\" when you do cocaine for the first time your gonna be afraid. and when you do drugs they go to your veins.\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nnoisicus  if i lived by u ud be my FUCKING BEST FRIEND!!!!  HELL YA ROCK ON MAN!\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nnirvana, some good insight, however, I've done quite a bit of cocaine when I was younger, and, yes, it definitely \"pumps\" your \"veins\" however, dear is the last thing it pumps you up with. (even the first time)\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\n(1st post so be nice) i think this song is definitely about a drug addiction. although no one mentioned the drug im thinking of. money. it keeps people wanting more and more. i find it makes sense throughout the whole song.\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nin my opinion this song is about the soldiers being controlled by the government because the album cove is one of the most famous naval burial sights.\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nno its not about the devil you fucking pendejo\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nits about your mom pendejo\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\nlook oldschoolpunker23 first of all your gay second of all metallica is awesome 3rd of all your gay and 4th of all fuck you pendejo\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nlook twizly bitch stop protecting oldschoolpunker you fucking bitch\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nlook xxstrawxx fuck you talking about money\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nIt's not just about drug addiction, it's about the madness that you get when being dominated, in this case, by the drugs\t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\nThis song is about a drug addiction in the point of view of the drug. \"Come crawling faster. obey your master\" Its saying that the drug will run and ruin an addicts life.\t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nThis song is definitely about drug addiction and what happens once you take the drug.\t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\nI think he wrote this song about his wife\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nIt's about how drugs can control a person and how it's killing them.\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\nOk I am a big metallica fun and I came up with this little story based on the titles of metallica songs. the titles are in capital letters.\n\n\r\nI park my 2*4 and step out, home at last but Iâ\u0080\u0099m in a FRANTC state thinking about my narrow ESCAPE. I get into the house and I drink some of my WHISKEY in a JAR but that doesnâ\u0080\u0099t ease the pain clearly caused by the THORN WITHIN. At this point even i know the only solutions to deal with the STRUGGLE WITHIN. In the SMALL HOURS of the morning I stare into the dark night and see ORION, but now is not the time to think about ASTRONOMY the pain is too much it feels like I'm TRAPPED UNDER ICE yet I cant seem to convince myself that its my fault, betrayed by who i thought was a friend and betrayed by THE JUDAS KISS now I go towards my bed in this old rugged house, how am I supposed to sleep in THE HOUSE THAT JACK BUILT after I shot him between the eyes and left him STONE DEAD FOREVER and at that point it felt like NOTHING ELSE MATTERS. I close my eyes and try to sleep hoping it will all just FADE to BLACK but THE MEMORY REMAINS clear to me that I will always be UNFORGIVEN and it worries me because the things i just did make me wonder AM I EVIL. This cant be I was raised right how did I turn to this BAD SEED I know what I did was wrong but I canâ\u0080\u0099t feel it, itâ\u0080\u0099s like I am on ANESTHESIA.\n\r\nI had lost my mind when I decided it was KILLING TIME, I ran around taking them all out high on drugs I believed I was the INVISIBLE KID and the opponents I took out one by one where DISPOSABLE HEROES. I canâ\u0080\u0099t sleep so I stay up looking at the DIRTY WINDOW and start to think maybe its time I DISAPPEAR because right now I am CREEPING DEATH at any point the cops and feds will be all over looking for me. For so long I looked forward to exerting my revenge but that day seemed to be THE DAY THAT NEVER COMES nothing hurts more than taking the life of your BROTHERS IN ARMS. The pain was too much yet still I feel like the HERO OF THE DAY and I decided not to think about what others thought of me after all to the one who I was revenging I would always be the perfect PRINCE CHARMING her LOVERMAN as was the case when she lived and everyone else called me KING NOTHING. As my nerves began to calm I remember what MAMA SAID about salvation forgiveness trusting in God and THE FOUR HORSEMEN but I will not pray to THE GOD THAT FAILED seeing as he let my loved one die she truly was MY FRIEND OF MISERY so I decide to live the rest of my life with NO REMORSE.\n\r\nKnowing my fate as I step into the bathroom that bottle of CYANIDE seems appealing but I will not give up I will FIGHT FIRE WITH FIRE. Arrested I find myself locked in a SANATARIUM because the cops couldnâ\u0080\u0099t believe any normal person could do what I did. The DEVILS DANCE is what they called it and maybe this is where I would spend the rest of my days on THE FRAYED ENDS OF SANITY. A brilliant mind I donâ\u0080\u0099t deserve to be here but what i did deserves to be punished and that is SAD BUT TRUE. At this rate I donâ\u0080\u0099t think even a priest can PURIFY my soul. I think of to myself POOR TWISTED ME but I decide to not have self pity because when it comes to who killed those men I will always be the ONE. From a motherâ\u0080\u0099s boy RONNIE went on to become a killer and sometimes I would think SO WHAT right until the judge decided i would RIDE the LIGHTENING. I know I am SOME KIND of MONSTER but do I really deserve to die. The judge is not letting me off easy as he proclaims THAT WAS JUST YOUR LIFE and now youâ\u0080\u0099ve reached THE END OF THE LINE. Alone in my cell I think it seems I have become THE OUTLAW TORN thinking about SUICIDE AND REDEMPTION what to do I cant let them kill me oh the STRUGGLE WITHIN talk about THE THING THAT SHOULD NOT BE. After a nights sleep I think maybe its fine after all TO LIVE IS TO DIE what is this THE UNNAMED FEELING maybe its time to TURN THE PAGE. \t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\nI think it is about Satan, after all he doesn't care, wants to destroy your life, and toys with mankind although they're puppets. He and everything associated with him is hypnotising and draws you in, and leads to death.\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nThe song is definately about drugs, but the lyrics are a little wrong....its not \"Veins that pump with fear, sucking darkest clear\" that sounds stupid...its \"Veins that pump with fear, sudden dark is clear\"\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nand if i didnt know so much about metallica, id think it was about an addiction, but since the only thing they were addicted to was alcohol, exluding Dave Mustaine, im pretty sure those are just uncanny coincidences...i know for a fact...that lars and james were not addicted to anything but alcohol...hence the name \"Alcohollica\" thats like being a guy and writing a song about giving birth\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nI'm hearing that it's about addiction to cocaine. I suppose that's probably the intended meaning.\n\r\nBut to me it's about addiction to thinking, about how the person's mind takes over the real person underneath. It's because I've been reading The Power Of Now by Eckhart Tolle that I interpret it this way.\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nthis song is about addiction,but i see it(also judging from the album cover) as adolf hitler being able to command germany to make war and to kill. and in the end the nazis fell apart,a lot of soldiers and inoccent people died,because hitler had such great hypnotic power to influence the germans. hitler was a real master of puppets.\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nthis song is about addiction,but i see it(also judging from the album cover) as adolf hitler being able to command germany to make war and to kill. and in the end the nazis fell apart,a lot of soldiers and inoccent people died,because hitler had such great hypnotic power to influence the germans. hitler was a real master of puppets.\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\nIts about Kirk Hammets cocaine addiction and how it was his \"master\" \t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nat least I heard it was about Kirk Hammetts addiction, but it could be about cocaine addiction in general\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nI get the main message of the song, but the last verse is a bit confusing to meâ\u0080¦\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nI created an account just so I could say this...whatever idiot said that the lyric is \"Face Me!\" is not a real metallica fan or hasn't listened to this song enough. I've heard many different versions of this song...and they all say \"FIX ME\" not \"Face Me\"\n\r\nFIX ME!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_321": "\nI think Master of Puppets is about drug use and addiction. However, the drug itself is not a master of anything. The drug is a means to an end. Compulsions are the life-sucking thoughts. The drug gives the compulsion a mask to wear, in blame, because the real thing looks like wicked shit.\n\r\nDrug addiction feels really alone, lost and helplessly pulled along. I think that drugs don't kill people but people kill themselves whenever they choose to allow social participation to devolve into unwinding obsession and desperation.\n\r\nWhether Metallica meant anything else lurking below the drug-laiden theme of the song...it is in there; a tranquil looking pool you'd not want to jump into. I'm sure some survivors can attest.\n\r\nDrugs are just drugs - the biting teeth of a worst nightmare. \n\r\nUnless it's pot - that just makes one unaccomplished, but not dead. Undead, yeah maybe a zombie.\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nI agree on the many coments over that this song is about drug abuse, more is all you need...\r\nthere's a lot that hint's twords that in this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\nhonestly ppl have different feelings and perceptions about things, especially politics religion (no brainer there..) and music. to me this song is about drugs and drug addiction and honestly I could care less about what specific drug it's refering to...it also makes me think of drug dealers -(\"I'm pulling your strings\"...\"I will help you die\"..\"just call my name\"....etc.)-and way back in the dark ages (lol) I actually knew a few who sang that song constantly it seemed.....I only read the 1st bit of comments, so someone may've mad this point already...addiction is addiction ppl,it matters not what one's drug ( or whatever) of choice is...this song is a wake up call to those who listen in my humble opinion. -L\r\np.s. pls excuse typos. and as 4 the comment about satan, ppl should take accountability for their actions/choices in life. u should check out crossroad blues (robert j if i remember right).\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\nThis part of the song really spoke to me:\n\nNeedlework the way, never you betray\nlife of death becoming clearer\nPain monopoly, ritual misery\nchop your breakfast on a mirror\n\nThe first line is about working your way to the devil through a series of sins, and the next line is realizing the fact that you are going to hell, or a \"life of death.\" The third line struck me as playing a game with pain and your parents, and repeatedly causing them pain. Chopping your breakfast on a mirror is obviously a sign of drugs, most likely cocaine, and signifies rock bottom, which could mean hell. So basically this is a four step process to hell.\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\nThis is one of thee greatest songs of all time . Its very clear that this song is about \"ADDICTION\" and I say this with experience. I believe this song to be about COCAINE. It may start off as harmless fun but it eventually controls you and you live for it as it strips you of everything... \"dreams\" including, eventually your life. Just listening to this song gets me pumped! The taste of cocaine has that \"metallic\" taste to it.  \n\"Needlework the way, never you betray\nlife of death becoming clearer\nPain monopoly, ritual misery\nchop your breakfast on a mirror\"\n         Yes cocaine can be injected and you'll never turn your back on it or say no\n          And as you begin to realize that you can't go without, its too late...you're addicted\n          As your LOW (coming down) increases, you feed your appetite taking more\n          the cycle continues through until you find yourself snorting a line for breakfast.\n\n\nTaste me you will see\nMore is all you need\nYou're dedicated to\nHow I'm killing you\n\nCome crawling faster (faster)\nObey your master (master)\nYour life burns faster (faster)\nObey your master (master)\nMaster, master\nMaster of puppets, I'm pulling your strings\nTwisting your mind and smashing your dreams\nBlinded by me, you can't see a thing\nJust call my name, 'cause I'll hear you scream\nMaster, master\nIts pretty cut and dry and easily desyferred if you're any type of addict.\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\nDefinitely about addiction. \"Chop your breakfast on a mirror\"...basically saying waking up and starting the day with some coke. I agree with the other comments when it comes to Master=Drug, Puppet=the addict.\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nI know a lot of you have said that you think this song is about a drug addiction. I'm not here to tell you otherwise-a song has many levels and addiction is certainly one of the themes. To me, however, this song is about BDSM, specifically the Dominance/submission side of it. \nDominance/submission is a form of (sexual) power play between two or more partners. In this power play, the Dom is often referred to as the 'Master' and the sub as the 'slave'. Basically, the sub's purpose is to give the Dom pleasure, and because often the sub is masochistic and the Dom sadistic or sado-masochistic, this is achieved partially by the Dom hurting the sub. It's easy to imagine, however, that this could lead to the Dom hurting the sub beyond the boundaries of pleasure if things get out of hand. That's what I think this song is about.\nI'm not going to analyse the whole song, I simply ask that you keep D/s (and abuse of D/s) in mind when reading the lyrics. It started making a lot more sense to me when I did. \nSo-to me this song is about D/s, how it can turn into an addiction (and it can, I know from experience) and how it can turn from consentual power play into abuse.\t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nIts about drugs, James explained it in an interview.\t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nListen in HD here youtube.com/…\n\n\n", "comment_330": "\nThere are some awesome interpretations on here, I've been doing a lot of research on this song in particular, and according to an interview in Rocks Backpages, Ulrich describes Master of Puppets, for example, as being about the dangers of \"drugs, manipulation, anything that takes you over\". It is strongly focused primarily on drug abuse from what I hear in the lyrics!\t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\nWell, I usually think about Adolf Hitler and the second world war when hearing this song. But I think it's generally about dictatorship.\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nIt's about ego.  Just change the word drug for ego.  Ego in its many faces is the master.  Ego is a constant so pervasive we don't even know it is there, like air.\nThe egos trips get confused with reality.  We are all puppets of our own egos which keep us from our true selves and it laughs.  Drugs are just a symptom of ego to fog its ways, which are endless, a shape shifter supreme.\t\t\t\t\n\t\t\t\t\n\n", "comment_333": "\nI wonder if, among other things, this song includes the message that drug addiction is passed on through generations or peer groups? I'm thinking of the lyric \"Now I rule you too.\" I don't see how that could be about the \"puppet\" specifically because he's already addicted. Instead, it seems like it's implying that the \"master\" has managed to take control of someone else. To me that's trying to make the point that if you do drugs, your friends or family are more at risk of copying you and doing them as well, which creates more victims for the \"master of puppets.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nUpon further consideration, I wonder if this song couldn't work as a metaphor for anxiety disorders, such as OCD? Consider:\n\n\"Veins that pump with fear\nSucking darkest clear\"\n\nThis could be taken to represent an extreme anxiety/panic attack.\n\n\"Come crawling faster\nObey your master\"\n\nAccording to patients and professionals working with OCD, it feels like having a demon on your shoulder, urging you to do something or face consequences, and if you ignore the demon it'll keep nagging at you but if you do what it wants it'll control you all the more.\n\n\"Master of Puppets I'm pulling your strings\nTwisting your mind and smashing your dreams\nBlinded by me you can't see a thing\nJust call my  name 'cause I'll hear you scream Master, Master\"\n\nWhen anxiety rules your life, you'll do anything to make it go away, even structuring your life around it.\n\n\"Pain monopoly, ritual misery\nChop your breakfast on a mirror\"\n\nCould be taken as a metaphor for OCD compulsions, where you feel you have to perform rituals or face consequences. The second line could be one example of a compulsion, where everything has to be prepared perfectly or the victim can't even eat breakfast in the morning.\n\n\"Master, Master, where's the dreams that I've been after?\"\n\nAgain, how anxiety can rule your life and leave you with no time or energy for any of your goals or aspirations.\n\n\"Master, Master, you promised only lies.\"\n\nCould be a statement about how OCD \"promises\" that bad things will happen if rituals, etc. are not performed, even though a moment's rational thought will tell you that it isn't true.\n\n\"Laughter, laughter, all I hear or see is laughter\nLaughter, laughter, laughing at my cries\"\n\nCould symbolize the people who don't understand sufferers of anxiety disorders, and so laugh at or otherwise make light of their plight, since anxiety disorders may force you to do degrading or humiliating things in an attempt to make the anxiety stop.\n\n\"Hell is worth all that\nNatural habitat\nJust a rhyme without a reason\"\n\nThis could be from the perspective of a person with OCD, giving into his compulsions despite knowing they don't make sense, because they've become a habit.\n\n\"I will occupy\nI will help you die\nI will run through you\nNow I rule you too\"\n\nIf anxiety disorders go untreated they'll eventually get worse and worse until they consume your entire life--and ultimately could even shorten your lifespan (because you're harming/not taking good care of yourself, or from suicide...).\n\nI apologize if this offends anyone. I suffer from anxiety myself, and based a lot of my comments on mental-health resources and a book my therapist recommended to me about OCD.\t\t\t\t\n\t\t\t\t\n\n", "comment_335": "\nI think it is about the state killing their armies sending them into war, because on the album sleeve there are crosses which look like war graves (all the same, without a name or RIP or anything). \n\"You're dedicated to how I'm killing you.\"\nMaybe it is stupid, but this was the very first thing I was thinking about when I heard this.\n\n(Sorry if my grammar is bad. I'm not English)\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\nMaster of Puppets was Russell Hantz on Survivor according to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\nFor me, this song has many aspects, but the strongest one for me is the time that is spent in an asylum or psychiatric hospital.\n\nBUT,  Author Ryan Moore thought the lyrics depicted \"ominous yet unnamed forces of power wielding total control over helpless human subjects \n\nWhich still fits, because, whether you like it or not, all of America really truly is an asylum filled with utterly crazy people who only want to hurt and yell and scream and tear at each other and who refuse to respect each other over vain and petty differences. \n\nBecause it's fun and trendy.\n\nI love this song, but i have to be in a specific mood to get into it.\t\t\t\t\n\t\t\t\t\n\n", "comment_338": "\nIt was about the crack epidemic and how it was engineered by bad government agencies who can do whatever they want, you can guess. Also applies to social control and eugenics.\t\t\t\t\n\t\t\t\t\n\n", "comment_339": "\nsddada\t\t\t\t\n\t\t\t\t\n\n", "comment_340": "\ndasdasdas\t\t\t\t\n\t\t\t\t\n\n", "comment_341": "\nWhy are all my favorite songs about either drugs or politics? After all, those are the two things I hate the most in society.\t\t\t\t\n\t\t\t\t\n\n", "comment_342": "\nI see many comments that this song is about drugs, but curiously, I never saw it that way.  If anyone from the band says that is what the song is about, that's fine, its their song,  But for me, it is the quintessential heavy metal tune, about the complete lack of control we have over our lives, the sense of being controlled by powers beyond our reach.  And musically a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nDUDE IT'S ABOUT CRYSTAL METH!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_344": "\nbands that do drugs are posers and i don't care what drug or who it i about man thay made a bad desison and should pay the price FUCK metallica\t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nWhen I hear this song it makes me thing about how religion controls people and everyone are just puppets they are controlling\t\t\t\t\n\t\t\t\t\n\n", "comment_346": "\nhey noisicus, what can i say but FUCK YA!!!!!!!!!! \n\n\n", "comment_347": "\nwell yer all wrong about the cocaine thing!...its about heroine and thats jus one thing. The meaning of the song also falls along the same line as Disposable Heroes, where the goverment who is \"pulling the strings\" of soldiers and sending them to their deaths\t\t\t\t\n\t\t\t\t\n\n", "comment_348": "\nYou guys are actually so stupid, it's clearly about bruised bananas!\t\t\t\t\n\t\t\t\t\n\n", "comment_349": "\nBullshit! its 100% about cocaine... i know... and if anyone thinks any different they can suck my balls...\n\n\n"}