{"comment_0": "\nThis song is so great. I can't believe nobody has posted on it yet. It's so amazingly beautiful! Words don't describe it! \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI agree. It was my cousin's wedding song, and it fits perfectly.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nTo my fiance and I, this is \"our song.\"  Whenever problems arise or we think that work and other stresses are too much, we listen to this song.  \"Ordinary?  No, I really don't think so.  Just a precious few ever make it last, get as luck as, me and you...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song goes out to my would-be boyfriend, if he was actually single. LOL. I think it's the sweetest song.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nTo Tara, the most amazing woman in this world...\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ni want this song played at my wedding. it's so beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nWow, this song is too beautiful for words. *wipes away tears* This guy that I'm talking to played this song tonight and told me to listen to the words.. I love it when he sings, 'Every day I live, I try my best to give, All I have to you'\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthis song will be played at my wedding i guarantee it. thanks for the great song kenny and gang\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthis is such a sweet song!! thank god my bf downloaded this song 4 me to hear!! this will definetly b a couples dance @ my wedding (even though that's a long way off!!) but yeah, sweet song, and i owe my sweet bf 4 it!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\n(dedicated to bumbi, the prettiest most incredible girl sent to me from heaven ever...)\n\r\nit's an honestly sweet not overdone with words or imagery song, just the way i like it... simple and sweet...\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI love this song soo much.. Reminds me of me and my ex.. we still love each other but she doesn't know if we will get back together or not cause of personal reasons.. but i dedicate this song to her.\r\nStephanie, even though we are not together right now.. You are the GREATEST thing that has ever happened to me and you still have my heart.. please take care of it.. i left it with you..\n\r\ni love you Stephanie Alise\t\t\t\t\n\t\t\t\t\n\n"}