{"comment_0": "\nI feel like he's looking at himself and all the things he's done, and he's so caught up in mental illness or addiction or whatever, he doesn't even feel it anymore. The drug addiction or the eating disorder or the alcoholism or intense depression, (Maybe all of the above) that he's stopping to ask himself \"don't you mind that you're hurting everyone you love.\" \n\r\n\"I gave you something you can never give back, don't you mind.\" The first time he tried drugs, that was it. He was hooked. He can never take that back.\n\r\n\"You've seen your face like a heart attack, don't you mind.\" He looked in the mirror and didn't even recognize himself anymore. \n\r\n\"I'm sorry I'd rather be high than watching the family die.\" To cope with what's going on his family, (Possibly because of his issues) he's doing drugs. \n\r\nHe's so unhappy and lifeless, he wants to end his life. He's asking himself, \"don't you care that you're about to end your life forever?\" And at the same time asking the world if it would care.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nTo me it's about a young male who is crying out for help. He has derailed, as often many people do, to both escape the pain of living and 'watching [his] family die', as well as to try and get attention. He is in a dark place and desperately wants someone to give him some love and attention, and thus sets about destroying himself as a call for people to care. Whilst it is said in a matter of fact way, you can hear the frustration in the 'don't you mind?'\nHe eventually begins to try and illicit any reaction from those whom he loves, for he is searching for any kind of attention, and thus starts to attack his girlfriend's family ('I put your mother through hell') and his girlfriend herself ('I think I did something terrible to your body). He even considers killing himself to try and provoke a response, for then those around would realise how troubled he is and how much help he needs. Finally, he breaks down and says that he loves her even through this, and that she doesn't realise this. He feels no-one truly understands him, nor seems to feel anything towards him, be it hate, fear or love.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nMy view of this song is that it's the speaker's internal dialect, the main voice being the \"bad\" side of himself or a side representing his actions or feelings that aren't great. It's the side of him that gets high (got a plane in the middle of the night), the side of him that is violent (i nearly killed somebody), the side of him that doesn't care for his health maybe through drinking or smoking (i gave you something [bad health] you can never give back), the side of him that doesn't want to see his family, the side of him that is depressed (i was thinking about killing myself) and etc you get the drift.\n\n\"Don't you mind, don't you mind\" is his bad side saying to his good side \"Don't worry, I got this. I'm gonna keep doing my shit\" even though he knows it's not good for him.\n\nIt's an incredibly powerful song when you look at it through this perspective. It's painfully truthful and jarring. One of my favourite lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think it's about the speaker having got a young girl, too young to be a mum, pregnant, and can't deal with the consequences of her having to have an abortion.\n\n'I gave you something you can never give back' - a child\n'Seen your face like a heart attack' - her shock at realising she's pregnant\n'I think I did something terrible to your body' - got her pregnant and she had to have an abortion\n'I put your mother through hell, I hurt your brother as well' - her family hate him for it\n\n'I got on a plane in the middle of the night' - he left her without really telling her \n'I'm sorry but I'd rather be getting high than watching my family die' - I think this is explaining why he left, he couldn't face seeing his child be killed\n\n'I nearly killed somebody' - I think this line is referring to the girl, not that he literally nearly killed her but having to look after a small child would've meant the end of the life she knew\n\nAnd the repeated 'don't you mind, don't you mind' - he's saying that you doesn't need to worry, you'll be okay, and don't worry about us because it's over now\nLike the last line, 'I love you, don't you mind, don't you mind.' He loves her but it makes no odds now that their relationship is over.\n\nThat's just my interpretation.\nBut this whole song is incredibly beautiful and sad, whatever way you look at the lyrics. And the last line just about breaks my heart :'(\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI read that his mother had an abortion and tried to kill herself after he was born which makes me think this song could be written partially to the child she didn't have. If it is, I'm not sure I appreciate the anti-abortion sentiment but I digress. \n\nPost-partum depression is very common after child birth and I think the first half of the song could be written to the writer's mother. The line about doing something terrible to her body could be physically true but also mentally. \"I'm sorry but I'd rather be getting high than watching the family die\" the writer hides in drugs instead of facing the divorce and separation of their family.\n\nThe second half could be written to the child she didn't have. \"I put your mother through hell\" he blames himself for what she is feeling \"I hate your brother as well\" could be a mutually shared brother or the writer himself. and then saying \"I was thinking about killing myself\" is sort of a weird twisted apology and \"I love you\" continuing that guilt.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis is my favorite song by the 1975. I saw them live a few days ago and they played this and I nearly started crying because of the raw emotion in this song. When I heard it for the first time, I put in one repeat because I love it so much. \n\nFirstly, I don't think he's saying \"I hate your brother\" it sounds more like \"I hurt your brother\". \n\nAnyway, my interpretation is that this song is about his addiction and his family. I also think it's about relationships. Not about a relationship with a girl, but his relationship with his family. \n\nIf you didn't know, Matty used to be addicted to cocaine. I believe this song could be a letter he wrote to himself or someone (or at least aspects of it) early on during drug treatment or just something he wrote while overcoming his addiction. I think he sees himself as a different person after overcoming his addiction, which is why it seems like he's writing it to someone else. He's telling his old self that he's hurt people, his family in particular. \n\nHowever, in relation to the previous, I believe it could also be a letter to his brother, Louis. Or perhaps a mix of both a letter to his brother and himself. \n\nBut the title of the song (\"Me\") supports the idea that this is a letter he wrote for himself, in my opinion. \n\nRecovering from drug addiction and going through the withdrawal brings out a lot of bad feelings, which is why so many people relapse despite wanting to quit. That is one reason/theory why this song has such a depressing tone to it (also that recalling why one became an addict in the first place is also very depressing). \n\nThe line \"I'd rather be getting high than watching my family die\" is possibly about his addiction to cope with his parents and other family problems.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think it's about addiction. He touches on damaging his relationships with his family, putting his mom through hell, damaging his body, being suicidal etc. he straight up says that he'd rather get high than watching it kill his family. It's written as if he's speaking to someone else but I think the song title makes it fairly clear that he's speaking to himself. \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI actually suspect this may be Matt commenting on his mothers history and a working through of his feelings towards her. She had an abortion, and also attempted to commit suicide following his birth. en.wikipedia.org/wiki/…. If thats the case, this song is heartbreaking and poignant.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI've heard so many different interpretations and meanings of this song but every time I hear this song I can't help but cry. I feel like this is a song he wrote about an abortion of one of his past lovers he got pregnant and how she had an abortion and the whole song and the lyrics are kind of a relay between the pregnant girl and the unborn child.\n\nI see it as how once he found out that he had impregnated this girl he frightened himself at the sheer thought and fled- \"I caught a plane in the middle of the night\"\n\nand the references after almost every single verse \"don't you mind?\", I took in a way where he was looking at himself and asking how could he be so stupid and selfish at this time when she was actually experiencing it first hand.\n\n\"I nearly killed somebody, don't you mind, don't you mind?\" Kind of registers with me as if after she had the abortion he tries to contact her and speak with her about it but she's kind too traumatised to even be near him and I saw it as a cry for help to her to speak to him but she's so hurt by him that she shuts him out completely.\n\n\"I gave you something you can never give back\"- referring to the child\n\n\"You've seen your face like a heart attack\"- meaning they've both looked in the mirror and not recognised themselves through what they've become and just had a full on breakdown from everything they're going through.\n\n\"I was late, but I arrived\" Now, I took this two ways.\n- meaning that maybe she wanted him to be there when she got it done but he was too frightened to go near her for a fear that he might hurt her even more.\n- coming back after fleeing out of fear ((first line))\n\n\"Sorry but I'd rather be getting high than watching my family die\"- talking as an explanation for why he was late ^^\n\n\"Exaggerate, and you and I\"- Meaning the child, being unborn but such a big deal and impact on their lives, her and him.\n\n\"I think I did something terrible to your body\"- getting her pregnant\n\nNow I think is where he turns in the song and is talking to the unborn child:::\n\n\"I put your mother through hell,\" from the pregnancy and stress and drugs and her getting caught up and having to deal with everything he put her through, hell.\n\n\"I hurt your brother as well\" OK THIS GOT ME, I started thinking maybe it wasn't the FIRST time he had got a girl pregnant or that exact same girl for example. Its like he's saying sorry for being such a fuckup and doing this again to yet another girl creating another baby.\n\n\"Oh I was thinking about killing myself\"- I saw this in a few aspects also;;\n- He's thinking future wise, about if he had the child, \"would it be just like me?\" and how he would see himself in them everyday- seeing himself as the child and considering the abortion.\n- He's too overwhelmed and upset that above all of his mess ups in life he had done something so stupid as to get a girl pregnant yet AGAIN ((see reasons for above^^)) that he just wants to make sure he won't do it again and he wants to stop himself from messing things up even more in his life and he just wants to end it (his life).\n- maybe he wants to just escape and be with the child in a happy place away from all of him problems in his life.\n\nthe next line \"I love you\" gets me every time as you can hear how sincere he is and almost full of apologies in those three words as if he's trying to say \"Im sorry for ending you before you even started but i love you and its not safe for you to be in my presence, you were a beautiful mistake and I love you beyond words\" its almost like  perhaps he wanted to keep the child but knew as a fact he wasn't fit to ever hold her like she deserved.\n\nAnd then the last verse just pretty much punches you right in the guts again with the most powerful lines in the whole song.\n\nThat's my interpretation of 'Me' By The 1975 and I think I might go cry now.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nOkay I could be so off, but here I go. I think this song is about a girl and a guy. He's going through some kind of addiction. And he's bad for her, like he keeps hurting her but she keeps coming back to him because he loves him no matter what. Like he doesn't like her family, and he'll do all these bad things and constantly break her heart but she doesn't mind because she's in love. And more on his part I don't think he means to hurt her but he's depressed and suicidal and just can't help it so that's why he says I love you at the end because he really does and idk but I love this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nMe-I feel like this song is overall, about internal battle of something the author wants to tell another or feels another should say to him. It's complicated to decipher the true meaning when only the author knows the complete reason behind this song, but I think that's why he made this song. So his fans can see he's been hurting too. I see it as a relationship gone wrong. Possibly first love?? **WINK**\n\n\"I got a plane in the middle of the night, don't you mind?\" I think this line means he's been fighting for something he wants or needs.\n\n\"I nearly killed somebody, don't you mind? Don't you mind?\" He has probably been feeling as though he isn't enough anymore because of his mistakes. If he 'nearly killed somebody' that's probably the reason for the plane flight.\n\n\"I gave you something you can never give back, don't you mind?\" This line probably means he gave his heart to someone. I'll be honest I thought that it meant virginity, but that might be part of the story.\n\n\"I see your face like a heart attack, don't you mind? Don't you mind?\" Memories of someone who hurt him, or they got hurt by him.\n\n\"I was late, but I arrived.\" He wants someone to forgive him for being absent when they needed him.\n\n\"I'm sorry, but I'd rather be getting high than watching my family die.\" He wants to escape his hurting. For obviously, watching things either fall apart in the house or the passing of a family member. \n\n\"Exaggerate, and you and I.\" This probably refers to everything the couple/ people went through together. All their fights seem unreasonable to him, including the one this song might be referring to.\n\n\"Oh, I think I did something terrible to your body, don't you mind?\" Probably taking someone's innocence away. Something he wishes he could give back to the person possibly if they're already hurting enough.\n\n\"I put your mother through hell, don't you mind?\" The mom probably didn't accept them as a couple.\n\n\"I hurt your brother as well, don't you mind? Don't you mind?\" The brother of the person/significant other possibly got into a fight with him, being a protective brother. \n\n\"Oh, I've been thinking 'bout killing myself. Don't you mind?\" He's been going through things too, possibly dealing with things at home or in his head.\n\n\"I love you.. don't you mind? Don't you mind?\" He wants the person/significant other to forgive him and know how much they mean to them. A possible plea. \n\n*PAUSE for response, but they still don't understand and it hurts, plea again! XD*\n\n\"I put your mother through hell, don't you mind?\" SHE WANTS HER INNOCENT BABY!\n\"I hate your brother as well, don't you mind? Don't you mind?\" HE DOESN'T WANT HER TO GET HURT.\n\"Oh, I've been thinking 'bout killing myself. Don't you mind?\" HE ALSO DOESN'T WANT HER TO HURT, BUT HE'S HURTING TOO :'(\n\"I love you.. don't you mind? Don't you mind?\" PLEASEEEEEEEEEEEEE ACCEPT MY LOVEEE\n**Tear, tear.** :'(\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nWow, what a great song:deep, poignant, and personal.  The first thoughts I have is it may be about abortion?..he is flying back to be with her after he found out she is preg or is having or had the abortion.  Im thinking after the fact.  That is why the brother hates him and the mom has been through hell and her body has been through hell. He was pretty upset about it and just wanted to be with her......and maybe he was already upset/depressed because a family member of his is dying...\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n\"Got on a plane in the middle of the night,\" as well as \"I nearly killed somebody,\" both lend evidence toward the song being based around a failed relationship in which the speaker feels upset and inadequate near the point of outrage. The speaker has to get away from his failures in the relationship.\n\"I gave you something you can never give back\" sounds almost undeniably like the speaker's virginity. This line also gives the sense that the speaker sustains unresolved vitriolity and contempt for his lover.\n\"You've seen your face like a heart attack,\" is an intense, descriptive, and highly intriguing line that may be quite variable in interpretation. My best guess for this line lands toward the speaker's belief that his lover is surprised at her sudden regard for herself and/or her fatality or, more likely, transgression.\n\nAs for the repetitive \"Don't you mind, don't you mind,\" I can only believe that it has two meanings: First of all, especially when used singularly, the phrase is passive and almost self-pitying; it is as if the speaker means to say that his lover no longer cares to be with him or amend the relationship, so he acknowledges that position and retaliates with it; The second connotation, especially present in the doubled phrase, signifies a question: \"Don't you mind?\" as in, \"Don't you care?\"\n\nA couple phrases oppose the regular meter of the song, such as \"I came late, but I arrived,\" \"I'm sorry, I'd rather be getting high than watching my family die\" (which appears as both a witticism, if not a comeback from a past argument, and the apparent root effect or cause of the song), and \"Exaggerate and you and I,\" a line which looks to be an addition to the standard \"you and I\" of a relationship along with a personified flaw in the relationship: exaggeration, a possible effect of a strong affection lacking proper timing.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song is deep and passionate, even without a direct meaning of its lyrics. although, i believe this song depicts the narrative of an abusive, inconsistently present father conversing with his now older child.\n\n\"i got a plane in the middle of the night\"\n-because it is the first line of the song, i believe it to be almost like an excuse for his leave once again, almost like a start to him trying to reason with his child.\n\n\"i nearly killed somebody\"\n-seems rather straightforward, but could suggest him confessing to his reckless behavior and admitting its wrong nature; it shows that he is trying to reconcile with his kid.\n\n\"i gave you something you can never give back\"\n-references his abuse or the loneliness he inflicted on the listener\n\n\"you've seen your face like a heart attack'\n-refers, again, to the marks the father would have caused.\n\n\"i was late, but i arrived\"\n-although he had admitted to his poor attitude in the second line, this seems almost like a concession and refutation. because he is still somewhat a selfish man, this line could be as an attempt to say, \"yeah, okay, i was late, but at least i even showed up back home at all.\"\n\n\"i'm sorry, but i'd rather be getting high than watching my family die\"\n-also like line two, he is admitting to his rage and poor manner, acknowledging that he gets high to suppress the idea that he is actually the one hurting his family and therefore, doesn't know how to control it besides getting intoxicated.\n\n\"exaggerate and you and i\"\n-he is trying to collect himself. he has confessed to being at fault for their pain and believes that because he is composed enough to have this discussion, he may have exaggerated on coming close to actually ending their lives; the \"you and i\" line just refers to the actual conversing itself. \n\n\"oh, i think i did something terrible to your body\"\n-again, references his abuse. the repetitive admission could also contribute to the idea that his guilt is catching up with him and he is starting to become disturbed by how aware he's become of his damage.\n\n\"i put your mother through hell... i hurt your brother as well\"\n-broadens his admission to their family as well, showing that he is apologetic for not only the ruining of the child's composure, but the family dynamic as a whole.\n\n\"i was thinking about killing myself\"\n-this shows the drastic choice he was willing to make because of his mistakes, proving that the guilt had indeed settled with him and was excruciating.\n\n\"i love you\"\n-shows, again, that he is sobering up to the fact that he tainted their lives. he wants to say that he loves the listener because he is accepting that he hasn't done even a slightly good job at parenting, a paternal task that includes making your child feel loved without even saying the words. because he knows this, he has to say the words out loud to prove himself.\n\n\"don't you mind(, don't you mind)\"\n-because this line is repeated through the entire song, it would suggest a stone-cold numbness the child has. the father uses the line after nearly every phrase because the child may be showing no emotion, requiring the father to probe at their lack of response. this constant probing may also depict the father's desperation, showing his sincere desire to try and make amends, while the child is blank-faced and unmoved by his attempts.\n\nalthough it is obviously not in the lyrics, the long, intensifying instrumental break between the first and second chorus could be a clever approach on the band's part to show a silence in the conversation as the father waits for his child to just say something. the build-up towards the end of this instrumental could portray the father's deep realization that he can't sway their standpoint on the father-child relationship, the harmonic movements conveying rushing emotions. he then repeats the chorus a second time, almost as a last, halfhearted, clearly pointless attempt to change the child's mind again.\n\ni believe the title \"me\" could show the 1975's desire for listeners to relate. many people identify with songs according to their meaning and hold these songs closely to them, almost as an anthem of their lives. the title \"me\" would be an obvious way of resonating with a listener who relates all too well, providing them with a song that essentially makes up \"me\" (the listener).\n\nbut who really knows anything besides the band, right?\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nSimilarly to previous comments, I think this song is about the narrator telling the story about how he is going through a dark time in his life. How he is addicted to drugs and this has made him a person he doesn't want to be, and this has affected a girl. 'I'm sorry but I'd rathe be getting high than watching my family die' showing the outcome of this addiction and that he cares more about drugs than anything else in the world. However he also cares about the things he did to this girl, whether it be getting her pregnant or just hurt her in some way shape or form. Also combining with his addiction and guilt from doing something to a girl to the point where he wants to kill himself, 'I was thinking about killing myself' but then he remembered how much he loved her and couldn't put himself through the pain of living without her.\n\nJust my interpretation, but this is one of my favourite songs by the 1975.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nFirst, aren't the lyrics \"I HURT your brother as well\" not I hate??? Anyway I think this song could be about his mother. She's struggled with depression and this song could be from her point of view? Like her talking to Matty? Apologizing.\n \"I put your mother through hell, don't you mind\" she also had alcoholism and drug abuse problems and stuff so that's what she could mean\n\nAlso she tried to commit suicide by attempting to jump out of the window of her flat \"I was thinking  about killing myself\" idk this song really makes me think of him mum.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nIt's a reflection of himself, it's true. He once said that in a interview.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI see this as a song from the point of a manipulative abuser. Something I've gone through personally. The father is recognizing his faults when the wife divorces him (I put your mother through hell) so he resorts to drugs to not see what he's doing to his family. (In my case he resorted to alcohol). And then while he's intoxicated wether it be with drugs like in this song or like alcohol in my case, he either sexually assaulted or physically was abusive to his child who I assume this is directed towards (both were done to me, I'm kinda using my story to interpret this song). And maybe he did the same to the brother, \"I hurt your brother as well\", because it's awful watching your little brother get hurt when you can't do anything to stop it. And then the manipulation starts. \"You're my child, if you don't love me I have no reason to live\", aka the I've been thinking about killing myself, and then he smothers them in I love you's. The don't you mind is to make the child out as the bad guy for not loving him back since he's their father and he loves them despite all the awful things he's done\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\n'I was late but I arrived\nI'm sorry but I'd rather be getting high than watching my family die'\n\nMatty said in an interview that when his grandma was dying in hospital the family drove to see her and instead of going with them in the car he drove on his own so he could get high\n\nKnowing that seriously gives me the feels 3 You can see how much he cares about his family throughout their music such as in Is There Somebody Who Can Watch You, She Lays Down, Nana...\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI have another interpretation. I also feel like this might have been a letter he wrote to himself through trying to deal with his cocaine addiction he once had.\n\n\"I gave you something you can never give back\" perhaps meaning that once he had that first experience with that type of drug he couldn't let it go, or \"give it back\"\n\nAlso I kind of tied the lines \"I was thinking about killing myself\" and \"I nearly killed somebody\" as if he was drawing in and out of himself back in the day of his addiction when he was having withdrawal symptoms trying to quit on the drug and he was thinking suicidally and then he went back and referred to that certain \"somebody\" he killed as himself.\n\nThe lines where he explains he thought he hurt \"your\" brother and mother. I feel like he's talking to his past self through the realisation of how severe his addiction had been hence \"I'm sorry but I'd rather be getting high than watching my family die,\" being proof of how infatuated he found himself with the drug.\n\n\nso yeah, just one more of my interpretations of the beyond emotional song\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI used to think this song was about a girl he was in love with, but no i kind of think that this song is about his mum. \nI read that his mum had post natal depression 'i gave you something you could never give back'. He also wrote a song about his grandmother so maybe he was kind of shuffled onto his grandmother who took care of him 'i put your mother through hell'\nand 'don't you mind' is kind of why doesn't my mum care about me and the things i do, i heard in another song of his that she was also a cocaine addict\nalso 'i was late but i arrived' i kind of thought was like when he was born he was late\njust an interpretation\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI personally agree with the pregnancy theory and pherhaps also the depression. But the biggest thing I feel when hearing the song is he can't fathom how someone loves him after all of this; as she clearly does.\n\nHe asks her over, 'don't you mind' because after all of this he figures she would have left and yet she hasn't.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nMy thoughts on what I visualize it could be about is from the dadâ\u0080\u0099s perspective after something life changing events or situations couldâ\u0080\u0099ve happened. Things were going downhill with possible drug and or alcohol addiction because if youâ\u0080\u0099re driving under the influence it could be very deadly. As well as it can mentally mess with someoneâ\u0080\u0099s mind. But Maybe the father/son  relationship wasn't always the best or the dad betrayed the son somehow. Hurting both the mom and brother because of tearing the family apart. The father lost everything and felt super hopeless. So itâ\u0080\u0099s like the father is having the conversation with the older son thatâ\u0080\u0099s still kind young at the time in why he might not be around as much anymore. He canâ\u0080\u0099t face what he put his family through. This is so disrespect to anyone just how I interpret the song.\t\t\t\t\n\t\t\t\t\n\n"}