{"comment_0": "\nAnd I quote:\r\nMESSAGE TO HARRY MANBACK\r\nHotsy Menshot from Green Jelly (a jokemetal\r\nband in which Maynard debuted as\r\none of the Three Little Pigs explains:\r\nâ\u0080\u009cThe voice on Message to Harry Manback\r\nis my old friend Francesco, (from Rome,\r\nItaly) who would come and live with me and\r\nmy old roommate Jerry, off and on. I kicked\r\nhim out after he stole some possessions\r\nfrom Jerry, and he called that night on the\r\nanswering machine because he was afraid\r\nof me, and couldnâ\u0080\u0099t threaten me to my face.\r\nHe was 6â\u0080\u00992â\u0080\u009d but only weighed 130 pounds\r\nand looked like Ichabod Crane from Sleepy\r\nHollow. I couldâ\u0080\u0099ve broken him like a twig.\r\nHe called back again the next morning, and\r\nthat message was finally heard on Message\r\nto Harry Manback II on Salival. Anyway,\r\neveryone used to imitate it from my impression,\r\neven though they have never heard it.\r\nYears later, I found the tape and played it for\r\nFiglio di puttana, sai che tu sei un pezzo di\r\nmerda?* Hm? You think youâ\u0080\u0099re cool, right?\r\nHm? When you kicked out people [out\r\nof] your house? I tell you this, one of three\r\nAmericans die of cancer, you know? Asshole.\r\nYouâ\u0080\u0099re gonna be one of those.\r\nI donâ\u0080\u0099t have the courage to kick your ass\r\ndirectly. Donâ\u0080\u0099t have enough courage for\r\nthat, I could, you know. You know youâ\u0080\u0099re\r\ngonna have another accident? You know Iâ\u0080\u0099m\r\ninvolved with black magic? Fuck you! Die.\r\nBastard!\r\nYou think youâ\u0080\u0099re so cool, hm? Asshole. And\r\nif I ever see your fucking face around, In\r\nEurope or Italy, Well Iâ\u0080\u0099ll â\u0080\u0094 That time Iâ\u0080\u0099m\r\ngonna kick your ass.\r\nFuck you! Fucking Americans, Yankee.\r\nYouâ\u0080\u0099re gonna die outta cancer, I promise.\r\nDeep pain... No one does what you did to\r\nme. You wanna know something? Fuck you!\r\nI want your balls smashed, eat shit! Bastard!\r\nPezzo di merda, figlio di puttana.** I hope\r\nsomebody in your family dies soon. Crepa,\r\npezzo di merda, e vai a sucare cazzi su un\r\naereo!***\r\n* Son of a bitch, do you know youâ\u0080\u0099re a\r\npiece of shit?\r\n** Piece of shit, son of a bitch.\r\n*** Die, piece of shit, and go suck dicks on a\r\nplane!\r\nMaynard, who by this point, was my roommate.\r\nNext thing I knew, a few edits, some\r\npiano ... viola! ... â\u0080\u009cHarry Manbackâ\u0080\u009d is a joke\r\nname from the famous comedian, Bill Hicks\r\n(deceased)â\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nTracy, God damn you're a dipshit, good job reading.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song is in collaboration with the other song on the album Die Eier Von Satan. It is trying to tell you to read in between the lines. In Message to Harry Manbeck, the man is very angry and is saying bad things, but to a person who did not know Italian, it would sound very romantic, even though the lyrics are vicious. Now in Die Eier Von Satan, the lyrics are merely are cookie recipe. But since it is in German, a very dark sounding language, the message sounds very satanic. The song is showing the difference between the two, and telling you to look deeper into the song, instead of just reading the lyrics and saying, â\u0080\u009c ohh, that is such a bad song!â\u0080\u009d \n\n\n", "comment_3": "\nDoes anyone know who the FUCK Harry is! I mean, damn he sounds like a politician or something, and they even wrote a sequel to this song, so he's probably still around.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI have no idea what it means.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nHello! I'm Harry Manback :p\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nHey bob, did you look at that site at all? Do you realize that perhaps the \"to\" is just an aknowalgement  to \"Harry\"?  I doubt  that I'm a god, but I'm pretty sure that you're a retard  nevertheless...\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nhey AN512 Maynard doesn't have cancer you dick-wad\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think its just somthing they put on the record for kicks. maybe?? Well at least I think its kinda funny!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nokay, I went to the sight that is posted above, and it makes sense, if anyone else thinks they know please post, or send me a message.\n\n\n", "comment_10": "\nI just looked deeper into that sight that SoBER-Stinkfist mentioned. It is VERY informative. If you have an interest in magic, I highly recomend that sight.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nOK, so who was that message for? Who is Harry Manback? \r\nDanny had this to say about it in some interview:\r\n\"Message to Harry Manback is a recording of the words of an uninvited Italian guest who came to Maynard's house one day. A so-called friend of a friend of a friend of Harry's .... Before we finally managed to figure out that nobody really knew him, he had already emptied the fridge and run up a huge phone bill. He got kicked out of the house.\"\n\r\nHarry Manback is a pseudonym for the real recipient of the message, presumably a past roommate of Maynard's: Hotsy Menshot of Green Jello. \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\npart of the way through it he sounds like hes about to start laughing when he says \"i want your balls smashed, eat shit bastard\"\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is about the Harry Manback who posts at this site. Really.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nHarry Manback isn't real\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nAh, I got an interesting story...My friend let his dad listen to this song and then a year later he died of guess what? cancer! Very messed up XD\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nemo bah lol lol lol lol lol lol lol yeah hey everyone I'm really Harry Manback...for a start...I'm a girl! :-D emo bah you're a dude!! Your post cracked me up! melodramatic.com/users/…\n\n\n", "comment_17": "\nUhh I cant get the innuendocornicopria site to work..ive been trying to go to it for like a week now and i cant...but yall can go to my brothers website condonethis.com and I saw APC in concert yesterday!! at the woodlands ampitheater and maynard is so fucking sex and i want to do him hard! >Billy too<\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\noh yeah if anyone can help me can you e-mail me? cos im not all about this going to the same site cos im just not idk but please its finger_deep_within_the_boarder_line@hotmail.com and i know boarder is spelt wrong i dont know if im just stupid and did that out of stupidity or if i wasnt paying attention... >feels smart<\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nAHHH It's not \"BANG BANG\" and it never HAS been. Its \"DEEP PAIN\", you know like dying of cancer.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song is definately a pissed Italian leaving a message on one of Maynard's friend's answering machines, because he was kicked out of a party after emptying the fridge and running up the phone bill... and the piano music is added(ofcoarse..)\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThis site would be great if there werent a bunch of kids wasting space name calling each other.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nwtf this song is odd\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI think they threw the track in there to prove how disgusting people are to each other, and to make a shit load of fun of him.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI don't care what the real explanation is for this \"song\"......all I know is a song about an Italian man named Harry (hairy) Manback is fucking hilarious! But maybe that's because I have the sad misfortune of knowing too many Italian men that shave their backs!\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\ni reckon that this is a song about a message left on an answering machine by an angry drunk italian....*coughs up blood*\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis is a neat recording.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI don't know how anybody got \"bang bang\" out of the recording. It dosen't make any sense. It has to be \"deep pain\". I can even hear an \"e\" sound in the first word.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nif only he new how to write songs....\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\n*knew  (er...woops)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nWell harry manback may be a women that maynard knew but then she was a bitch so he put in a good word for her heh..heh...\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nOUSAEL...its not just a cookie recipe..its a hash brownie recipie. \n\r\nthis songs probly just bout some guy who pissed maynard off. or someone pissed off at maynard..\r\neither way, who cares. its kool but its not their most interesting of songs. go listen to something deeper and try to figure that out.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nOk. it is a message left on Gary Helsinger's (A.K.A. Hotsy Menshot of Green Jell&yuml) answering machine form a pissed off Italian who was kicked out of his house for stealing shit, and as for Harry Manback it is a refernce to Bill Hick's routine.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nwhat more to say really?\r\nwonderful. simply wonderful :)\r\ni bet the guy who left this feels pretty damn special now.\r\nprobably feel happier if maynard had died of cancer though.\r\nthankfully, no such luck for him.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI've always thought this song is just a representation of hate. The hate one human can have for another. Perhaps I'm just blowing smoke out of my arse.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nwhat your all crazy this song is about fish and how the taste like fish...\r\nin other words this song needs no explaining cause\r\n1 it is not a song harry manback was in one of maynards old bands green jelly i think was the one and\r\n2 it says what it says no meaning some guy was pissed off\r\nand the one who said harry manback isn't a real person haha lol @ you\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThe music to this track has always reminded me of Resident Evil: Code Veronica. Don't know why... The seagulls, maybe?\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nThe first time I heard this song, it scared the pants off of me. But it's not too bad. A drunk Italian, right? :O\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThe first time I heard this track, I couldn't stop laughing. Sounds like something one of my friends would leave on my voicemail as a joke.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nIt's crazy he swore that he would die of canccer, and maynard has just been diagnosed with throat cancer, wow\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nYou people really have no clue do you?\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nWhat language is the first statement in Italian i assume, does anyone know what it means?\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nR.E\r\nIt's crazy he swore that he would die of canccer, and maynard has just been diagnosed with throat cancer, wow \n\r\nNOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO! Not Maynard! I don't want him to lose voice! \n\n\n", "comment_43": "\ni just thought that guy could barely speak english,but drunk...i didn't think of that.and i have to agree 100%.that guy was definatly drunk\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThe drunk Italian obviously is upset. He for some reason hates Maynard, or someone that Maynard knows (how would he randomly get the message). He came to Maynard's house because he didn't like him/someone there, emptied out the fridge, racked up the phone bill, and later made a phone call to express his hate. But not only are the words here vicious, they have symbolism. Even if TOOL didn't purposefully put meaning in for this particular song, you still have to look deeper then insults and treats to find something more.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nMAYNARD is Harry Manback. We can all agree it was a message left to Maynard. He always self deprecates. I wouldn't put it past him to call himself that. I mean he did come up with Puscifer. LOL\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nWhat I've heard is that this guy that they used to flat with suddenly disappeared one day, and this is the message that was left on their answer machine. Pretty strange.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThis is a real phonecall sent to Maynards answering machine\n\r\nthis site explains it all -> innuendocornecopria.com/…\n\n\n", "comment_48": "\nThis wasn't sent to Maynard's answering machine, it was a close friend of his after they got an obnoxious Italian guest drunk and then left him in a park.  The name Harry Manback is an acronym for his friend's name which I cannot remember right now.\n\n\n", "comment_49": "\nDAMN THIS IS A VIOLENT SONG!!! WHO SINGS IT?\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nHmm, both of you have good explanations.\r\nI reckon they both sound alright.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\ndoesn' the fact that song is named message TO Harry Manback, observe the TO part kinda proves that your explanations are bullshit? and your're all a bunch of idiots tryin' to grasp what's obvious is to deep for your undeveloped minds, ouff or I don't maybe not it could be that I'm a fuckin' retard and you guys are fricken' gods or sumthing\t\t\t\t\n\t\t\t\t\n\n"}