{"comment_0": "\nThis song truly resonates with me personally. As someone who has suffered from major depression since I was 14 (28 now) It is so ironic... \"Am i the only one...?\" is quite literally a thought I would have years before this song came out and I instantly fell in love with the tune from the very first verse. It is so ironic because clearly others out there are having mental struggles, as well.\n\r\nSO much of this song is a perfect reflection of what true depression is like... it is paired with its lover: anxiety. When he discusses how his mind is fighting this constant battle against the 'lion' and it won't let him sleep, so he has sought a permanent fix: permanent 'sleep' in the form of suicide: \"It will not let me sleep I guess I'll sleep when I'm dead.\" \n\r\nWith depression and the accompanying anxiety one finds him/herself trying to use the depression sleep for abnormally long periods of time, seeking reprieve from through the form of unconsciousness in between times when the anxiety causes abnormally grueling insomnia. One can easily have those thoughts of defeating the 'lion' aka depressed and violent thoughts through suicide. For the sufferer, it doesn't seem like a cowardly act and can, in fact, seem like a very logical solution: \"you- depression/anxiety- are killing me anyway, as I do not feel truly alive but rather like a walking zombie pretending to be normal:\n\r\n (\"I am not as fine as I seem.\r\nPardon, me for yelling and telling you green gardens\r\nAre not what's growing in my psyche, it's a different me\r\nA difficult beast feasting on burnt down trees.\")\n\r\nSo the suicidal thoughts are warped into a form of bravery: \"If you're taking me down, I'm taking you down with me.\"\n\r\nI've been there, and when I first came across this song it totally hit home. It seems several of their tunes deal with the issue of suicide/suicidal ideations. They seem to always end the songs with a hopeful stanza, so I'm curious as to whether they are speaking from personal experience in overcoming depression and transforming that negative energy into hope and optimism- anyone know?\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI thought the part where he goes \"waging my wars behind my face and above my throat\" that sounds like the feeling you get right before you cry. Where it hurts right above your theoat\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWell, in my opinion this song is about thoughts. We can take the lyrics to a song and apply them in any way to our own lives, and this one to me is a reminder that I am not the only one who has had to deal with an attack on the mind, or maybe it was just me all along. All I know is that the mind is a battlefield and we can choose to win or lose. I believe that the lion in the song is Satan, cause he loves to use our mind as a garbage dump. We can choose to listen and dwell on his roaring lies, or we can choose to reject it.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song is great. Its about thinking too much and not being able to control it. Its about feeling alone even when there's people around who say they understand. But no one can really truly understand the fights we have with ourselves. \"behind my face and above my throat.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song is about thinking too much and wanting to stop. When it says \"Am I the only one I know, waging my wars behind my face and above my throat\", I'm pretty sure it's referring to your brain. Because, if you think about it quite literally, your brain is behind your face and above your throat. And I think the lion in the song is your thoughts. So, you're fighting wars against your thoughts, and they're trying to kill you, and that's where \"Full of tidal waves, suicidal crazed lions.They're trying to eat me, blood running down their chin And I know that I can fight, or I can let the lion win. I begin to assemble what weapons I can find Cause sometimes to stay alive you gotta kill your mind.\" comes in because he calls the lions suicidal. So the lions are suicidal thoughts he's having and he has to kill his mind before those thoughts make him destroy himself. And \"And I will say that we should take a day to break away  From all the pain our brain has made, the game is not played alone. And I will say that we should take a moment and hold it And keep it frozen and know that life has a hopeful undertone.\" says that you need breaks from the self hating and suicidal thoughts in your head.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nthis song is definitely about depression, no doubt about it. the \"war\" is in his head. his brain is where the depression is. it attacks you constantly, hence all the pain references. the migraine represents thoughts because when you have depression your brain constantly produces sad thoughts and even if they don't make sense they make you feel like you're suffocating or drowning and you just want it to end.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\"Am I the only one I know waging my wars behind my face and above my throat?\"\nmy favorite part of this song. tyler is asking \"am i the only one i know...\" as referring to his depression and he feels that he is alone with this and that there is no one there to help him. and \"waging my wars behind my face and above my throat.\" is keeping all his thoughts and wars (his problems from the past) in his mind and his 'throat' is getting the feeling thinking about all this is the feeling right before someone starts to cry\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nalrighty so this is my favorite song. top is not my favorite band, one of, but this song is something I understand on so many levels. so lemme explain.\n\nAm I the only one I know\nWaging my wars behind my face and above my throat.\nShadows will scream that I'm alone.\n\nI-I-I I've got a migraine.\nAnd my pain will range from up, down, and sideways.\nThank God it's Friday cause Fridays will always be better than Sundays\n'Cause Sundays are my suicide days.\n\nthis part is honestly easy. essentially tyler is admiting to extreme depressive feelings (Am I the only one i know, ...shadows will scream that im alone)  and is forced to deal with them on his own, and is not necessarily winning (Waging my wars behind my face and above my throat)\nThe depressive feelings essentially surround you, hence (my pain will come from up down and sideways) He has gotten to the point where he honestly debats suicide with (thank god its friday cause fridays will always be better than sundays cause sunday is my suicide day)\nI don't know why they always seem so dismal.- doesnt know why he feels hopeless\nThunderstorms, clouds, snow and a slight drizzle.-trying to guess why\nWhether it's the weather or the letters by my bed- suicide notes\nSometimes death seems better than the migraine in my head.-wants all the shit to stop\nLet it be said what the headache represents - an attempt to explain the depressing thoughts\nIt's me defending in suspense - trying and failing to ignore the thoughts\nIt's me suspended in a defenseless test - acknowledges there is nothing he can do\nBeing tested by a ruthless examiner - the examiner is depressive thoughts\nThat's represented best by my depressing thoughts.\nI do not have writer's block my writer just hates the clock. - one of the few parts I dont have a reason for \nIt will not let me sleep I guess I'll sleep when I'm dead\nAnd sometimes death seems better than the migraine in my head.\nTyler is trying to remain hopeful with (but i know we've made it this far, kid.)\n\n\nI am not as fine as I seem. - pretty straight forward\nPardon, me for yelling I'm telling you green gardens\nAre not what's growing in my psyche, it's a different me - admiting his thoughts are not happy or healthy\nA difficult beast feasting on burnt down trees. - describing his thoughts as a barren wasteland\nFreeze frame, please let me paint a mental picture portrait. - still attempting to explain to the listener\nSomething you avoid yet it's all about my forehead\nAnd how it is a door that hold's back contents\nThat makes Pandora's box contents look non-violent. - an attempt to convey how not okay he is (yes that was a mcr refrence)\nBehind my eyelids are islands of violence - his mind is full of horrible thoughts\nMy mind ship-wrecked this is the only land my mind could find - almost no wear in his head is safe from these thoughts\nI did not know it was such a violent island - tyler didnt want these thoughts but he has no choice\nFull of tidal waves, suicidal crazed lions. - extremly violent and unstable thoughts\nThey're trying to eat me, blood running down their chin - the thoughts want him to die\nAnd I know that I can fight, or I can let the lion win. - he can live or give in to the thoughts\nI begin to assemble what weapons I can find - sturdying himself to stand against his thoughts\n'Cause sometimes to stay alive you gotta kill your mind. - I want a tattoo of this line.  to stay alive, you have to fight and defeat the suicidal thoughts\n\nAnd I will say that we should take a day to break away\nFrom all the pain our brain has made, the game is not played alone. - the game (life) is something that you dont go through alone and people can help you\nAnd I will say that we should take a moment and hold it\nAnd keep it frozen and know that life has a hopeful undertone. - to quote zombieland, enjoy the little things.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n\"Am I the only one I know\"\nThey're questioning whether they're the only people to have ever thought these thoughts or felt these feelings.\n\n\"Waging my wars behind my face and above my throat\"\nTheir mind is stuck in a continuous war against themselves, where they're constantly battling against depression and trying to function normally, but this war isn't ever a simple one. This war is all hidden away in their brain, whilst their face is smiling. \n\n\"Shadows will scream that I'm alone\"\nThey feel as if they're alone, and that nobody else feels like this. \"Shadows\" may be referencing to the depression itself, where it tells you that you're alone.\n\n\n\"I-I-I I've got a migraine\"\nThe migraine is a reference to their depression. The fact it's described as a migraine suggests that they felt a need to describe the depression in a form of physical pain, because mental pain is seen as many people by something people can just \"get over it\", rather than a serious issue. It puts emphasis on how much pain this is causing for them, and how it's almost impossible to ignore. \n\"And my pain will range from up, down, and sideways\"\nThe pain isn't only mental, it causes pain in their body, and they feel as if they've been trapped by this pain, and can't escape. \n\n\"Thank God it's Friday cause Fridays will always be better than Sundays\n'Cause Sundays are my suicide days\"\nThis suggests that their life is a constant repeat of days, where they spend the weekdays at their worst, and then spend the weekend worrying about going back to the weekdays. \n\n\"I don't know why they always seem so dismal\nThunderstorms, clouds, snow and a slight drizzle\"\nEverything around them now feels depressing, they see sadness in everything around them. \n\n\"Whether it's the weather or the letters by my bed\"\nThey don't even know what's making them sad anymore. \"letters by my bed\" may be suicide notes.\n\n\"Sometimes death seems better than the migraine in my head\"\nTo them, death is a more inviting option than having to deal with all the pain. Death seems like the only way to get out of it, and it seems as if it'll get rid of all the pain. \n\n\"Let it be said what the headache represents\nIt's me defending in suspense\nIt's me suspended in a defenseless test\nBeing tested by a ruthless examiner\nThat's represented best by my depressing thoughts\"\nThey feel as if this is a test, and it's \"ruthless\", whilst they're left there not knowing what to do, being \"defenseless\". They feel as if their thoughts will never leave them alone, and that they're incredibly harsh on them. \n\n\"I do not have writer's block my writer just hates the clock\nIt will not let me sleep I guess I'll sleep when I'm dead\"\nThey lose a lot of sleep because of the depression, and it means that they're constantly tired. There's another mention of death, which suggests it's on their mind a lot and that they see positives in death, that they'll finally be able to rest when dead.\n\n\"And sometimes death seems better than the migraine in my head\"\nThe fact it's repeated shows that it's not a one off thought, that it's something that often goes through their mind. \n\n\n\"But I know, we've made it this far, kid\"\nThey've managed to live through life so far.\n\n\n\"I am not as fine as I seem\"\nThey look as if they're fine, however a world of depression hides within them. \n\n\"Pardon, me for yelling and telling you green gardens\nAre not what's growing in my psyche, it's a different me\nA difficult beast feasting on burnt down trees\"\nThey feel as if they have to apologize for being depressed, and that it's their fault. They feel as if it makes them a burden to people and that they annoy people and disappoint people when they decide to talk about it. \n\n\"Freeze frame, please let me paint a mental picture portrait\nSomething you won't forget, it's all about my forehead\nAnd how it is a door that hold's back contents\nThat makes Pandora's box contents look non-violent\"\nThey suggest that the things going on in their minds are unforgettable, and that it's an experience you never truly forget. They suggest that it's filled with terrible things, things that are worse than something that's said to contain all the evils in the world. This comparison emphasises how it feels like it's the end of the world to the person, and how much pain it causes. \n\n\"Behind my eyelids are islands of violence\nMy mind ship-wrecked this is the only land my mind could find\nI did not know it was such a violent island\nFull of tidal waves, suicidal crazed lions\nThey're trying to eat me, blood running down their chin\nAnd I know that I can fight, or I can let the lion win\nI begin to assemble what weapons I can find\n'Cause sometimes to stay alive you gotta kill your mind\"\nIn this part, he creates a metaphor for how his depression feels. They say that their mind is \"ship-wrecked\", which conveys that they never meant to end up there, and that they can't escape now and they're lost. The fact it's the \"only land my mind could find\" suggests that they see no other way other than this land, and it's the only way they can currently be. \"Full of tidal waves\" suggests that it feels overwhelming, something that totally engulfs them. \"suicidal crazed lions\" is the thoughts that are telling them to kill themselves, and the fact they're lions suggests they're deadly, and that they're terrifying. \"I know that I can fight, or I can let the lion win\" conveys that the battle against suicidal thoughts isn't an easy one, but it's one you have to do to survive. \"'Cause sometimes to stay alive you gotta kill your mind\" suggests that the only away to get away from the island is to get away from all your thoughts and feelings, and that the only think you need to kill is your mind, not you. \n\n\"And I will say that we should take a day to break away\nFrom all the pain our brain has made, the game is not played alone\nAnd I will say that we should take a moment and hold it\nAnd keep it frozen and know that life has a hopeful undertone\"\nHere, they convey that everyone needs a break, and it's important to reach out to other people. It may suggest that we need to savor the good moments, and with the bad ones we just need to know that it will get better. \n\n\"Made it this far\nMade it this..f..\"\nThe fact they don't quite finish the last \"far\" suggests that the fact they've made it doesn't mean they will always, and that it's an ongoing struggle to make it that far for them. \n\n\nOverall, the song describes a persons experience with depression. In my opinion, it's a very good picture of what the experience is like.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni think the \"I begin to assemble what weapons I can find 'Cause sometimes to stay alive you gotta kill your mind\" part is about antidepressants because many people believe they make your mind \"numb\" so choose not to take them however Tyler is saying that taking them \"weapons\" will save you and that you should take them tto save yourself\n\n\n\n", "comment_10": "\nBasically the song is about depression. He compares it to a migraine. Hes in constant turmoil with his mind and his thoughts. Its giving him a hard time to sit and write a song plus sleep etc. It seems to be getting worse according to the 3rd verse. Hes putting on an act like so many of us do when we are down in the dumps. He also keeps throwing in references to \"suicide\". So I think hes been having those kinds of thoughts. But seems to be fighting it and trying to take a break plus stay hopeful.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nMy favorite part is:\n\nI am not as fine as I seem.\nPardon, me for yelling and telling you \nGreen gardens (good things) are not what's growing in my psyche, it's a different me (different from the face we show to the world)\nA difficult beast feasting on burnt down trees.\nFreeze frame, please let me paint a mental picture portrait.\nSomething you won't forget, it's all about my forehead\nAnd how it (my mind) is a door that hold's back contents (all jealousy, lust, envy, aggressiveness and negative thoughts)\nThat makes Pandora's box contents look non-violent.\nBehind my eyelids (inside my head) are islands (tons) of violence \nMy mind ship-wrecked this is the only land (way) my mind could find\nI did not know it was such a violent island\nFull of tidal waves, suicidal crazed lions. (those lions are all the negativity thoughts and human feelings eating your persona)\nThey're trying to eat me, blood running down their chin\nAnd I know that I can fight, or I can let the lion win.\nI begin to assemble what weapons I can find\n'Cause sometimes to stay alive you gotta kill your mind.(the crazy negative lions-negativity) **** <3\n\nAm I the only one I know - everything we think other people think might be wrong.. because after all we only know ourselves(we are locked in the walls of our brain)... however, because of fear of not knowing other's people real thought.. we grow up with some aggression (or passive aggression- suicidal crazed lions)\n\nThis negativity (lions) actually pushes you away from people.. (the lions kill u)\nthat's why sometimes to stay alive you gotta kill your mind.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis is how I see it. \n\"Am I the only one I know waging my wars behind my face and above my throat?\"\nAm I the only one who's at war with myself? I feel like I might be sometimes, for the sole reason that everyone acts like they're totally fine and when they don't, they're judged horribly. I feel like Tyler is trying to express his feelings that this is one thing about modern society that just isn't right.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nSo this song is clearly about an overactive mind which thinks depressing thoughts that make life seem so hard. My interpretation, and its something I have struggled with myself is the idea of solipsism.\n\nAm I the only one I know,\nWaging my wars behind my face and above my throat.\nShadows will scream that I'm alone.\nBut I know, we've made it this far, kid.\n\nthe only thing I can know is myself. confined by my senses, It is impossible to justify that anything but my minds existence and I am alone in a dream I created myself that I call life.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nYou know, everyone always relates this to depression. Honestly, I think it's anxiety, which does like to accompany depression, but this is definitely anxiety.\n\nAnxiety is thoughts racing everywhere and you can't stop. Anxiety is being afraid of coming outside your room. Anxiety is having 'shadows screaming [at you] that you're alone.' Depression is awful, don't get me wrong, but I feel this is more anxiety than depression.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nTyler is referring to the migraine as a form of depression, basically the migraine is representing the depression that doesn't seem to ever go away. He's saying death might be better than living with the migraine [depression]. \"I'm not as fine as I seem\" He acts like he's okay and everything's fine but in reality he's really not. The lyrics \"Full of tidal waves, suicidal crazed lions.They're trying to eat me, blood running down their chin And I know that I can fight, or I can let the lion win. I begin to assemble what weapons I can find Cause sometimes to stay alive you gotta kill your mind.\" mean that you're fighting this battle in your mind against your thoughts and you're trying to keep fighting and \"stay strong\".\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nAs a lifelong sufferer of migraines I can honestly say that this song is literally about migraines. The pain you feel when you get a migraine makes you feel like your brain is turning against you, that your thoughts are constantly at battle with each other. Migraines can make it so any form of light/sound/smell becomes painful, the pain makes it so you can't eat without vomiting, can barely have a conversation, can't even look at the screen of your phone or focus on words on a page. No amount of ibruprofen or Advil or any form of standard non-over the counter pain meds can take away the edge, I know this, I went through it. \"Waging my wars behind my face and about my throat\": there are no noticeable outward signs of a migraine, but they can make you irritable, angry, sad. So many people nowadays say they have migraines when they actually don't, migraines aren't just something you can get rid of with some Advil. Migraines aren't a simple headache as so many people pass them off for, they are debilitating, you can even be hospitalized for some of the bad ones, they make it feel like your body is turning against you. They cause you more pain than just an ache in your head; they make it hard to move, control your fingers, even talk. When you get them they affect your work, your ability to think. Migraine sufferers have to go to neurologists, get MIR scans just to figure out how to treat the pain, or at least I did. \"Behind my eyelids are islands of violence\" never have I heard truer words to how I feel when I get a migraine. \t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nTo me the song is about dealing with some serious problems, that keep buzzing in your head like a migraine, and you think the only way to get rid of it is by killing yourself, but you've \"made it this far, kid.\" And brighter days will come. That's what I got from the song, it helped me through a lot. \t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI think Tyler Joseph wanted to to write about the everyday battles people with depression face.I think migraine is an extended metaphor for an underlying problem. Its about the wars people face inside their heads. Wars outsiders are unaware of. \"Waging my wars behind my face and above my throat.\" That's his head, right? Whilst the outside world sees a person who seems to be doing okay. Hence the, \"I am not as fine as I seem.\" And then goes on to explain what he's really experiencing.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\ni think the song means that he thinks that suicide is the answer to his thoughts going on inside his head but understanding that he made it so far so why give up now? And also saying that you aren't the only person going through this so don't feel alone. idk\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nall the song is clearly stating is that he has such a bad migrain he is thinking about commiting suicide by hanging him self\t\t\t\t\n\t\t\t\t\n\n"}