{"comment_0": "\nI hope I can listen to this song 10 years from now and realize that I'll do anything for my child.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nYo, this shit is Em's fuckin real shit, just like back in the day. All about the shit from the heart. I'm saying some of Encores new shit is aight, But this song, this shit is the real Shady. From the heart ya'll, This is the shit that makes him wake up every mornin and see that lifes worth livin. Hailee's got a smile on her face. And daddy brought her to a better place.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthis song is beautiful\n\r\ni've never heard such a great melody from a rapper\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song is so deep i fuckin luv it. He has really cooled off\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nStiffen that ?limb up? little lady, i told ya \r\nanyone has a clue what it is?\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nit should be:\n\r\nstiffen that UPPER LIP up, little lady, i told ya\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nwho's laney?\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nYea, i dont know who laney is either, anyfan of Eminem knows who Hailie is, but that was the first time I heard about laney.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nLainey (Alaina) is Kim's sister's daughter that Eminem adopted.\n\r\n\"Laney uncles crazy, aint he?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nLainey (Alaina) is Kim's sister's daughter that Eminem adopted.\n\r\n\"Laney uncles crazy, aint he?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nLainey (Alaina) is Kim's sister's daughter that Eminem adopted.\n\r\n\"Laney uncles crazy, aint he?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nYeah he adopted his neice.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\njust luvin the new album but it gettin alot of stick\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\n\"And make him eat every carat don't fuck with dad (haha)\"\n\r\nThat lines bothers me.\r\nWouldn't it have been nice to just have a completely clean Eminem song?  It would have been one, without that worthless line he stuck in.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI Think Saying That He Would Break The Bird's Neck Isn't Very Clean Either.  But I Still Think The Song Is Amazing!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThe break the birds neck line does sound out of place and unnecessary but i like the last line.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nhe's so cute about his daughter, does he have a son though aswell?\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nno but his brother Nathan lives with him\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nin one eminem song he says  to his mother \"nathans growin up so quick hes gonna know your a phony\" every song is makin sense now! and he has mentioned laney before in another song.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI love this song.\r\nThis might sound lame but I weeped on it\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song is absolutely amazing. It's is whole REAL life struggles in a nutshell. And about \"He Would Break The Bird's Neck\" He's just expressing that he would do ANYTHING for his daughter. She's his world and if anyone does her wrong, he'll make sure they'll get what's coming to them.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni thought it was obvious that nathan is his brother...well you see him in a video...\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nyeah i DEFINITELY agree with the first post....\n\r\nthis song is reminiscent of eminem's Lose Yourself and 8 Mile and Superman and Sing for the Moment...all are AWESOME songs and Mockingbird is definitely in their league...\n\r\nI have to agree with the first post, most of the new stuff from ENCORE sucks....I hate to say it, and I am a big eminem fan, but mockingbird has brought me back to lovin the old shady....\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ngood song sounds like the old shady.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nthis song is stuck on my brain! and i'm not complaining cause this song Rules... \r\nbtw this song reminds me of Hailey's song...\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nOH i think this song rocks! it really is brilliant and really deep, i actually cried at this song (dont think i'm sad) spesh wen he says \"daddys with you in your prayers\" that is so sweet....i love his songs about hailey i think they got so much more soul in than his other stuff..more meaning\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nwe think that it is a good song. what other song has he mentioned laney in?\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\n\"i thought it was obvious that nathan is his brother...you see him in a video...\"\n\r\nNot everybody has become a sad sorry slave to MTV.\n\r\nI felt Eminem crossed the line with the comedy act on Encore, and sort of killed the intensity that his other albums had(especially the masterpiece The Eminem Show), but this is one of the standout tracks by far.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nYea I agree w/ the last post.... Some of the songs are kinda dumb.. all that funny shit just doesnt go well w/ Eminem... I'm not sayin there bad songs its just not Eminem..... n before this song I never realized Eminem had a soft spot lol. This is one of the best songs on the new album\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni love this song, its one of my favorites on the new album... :)\n\r\ni agree with Lurker and Manderz\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nomg dude i cried aswell the first time i heard this song i just kept playing it and playing it and cryin and cryin! he shud bring out more songs like this.. halies song and mockingbird were gr8!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI think this song gives us a peek into the real person behind the music. And to those who commented on the \"dont fuck with dad\" part, thats just who he is. If he didnt add that part into the song, people would wonder what happened to Slim Shady. :o)\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nAnd if that mockingbird don't sing and that ring don't shine I'mma break that birdies neck I'd go back to the jewler who sold it to ya And make him eat every carat don't fuck with dad - i agree thats just em, thats what he does. if ur a real em fan ur not gunna complain about a few lines, added 2 the end of a song. i agree with the last post, if he didnt say that, thered be people here complain em had gone soft..\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nwhich video do u c nathan in? is it without me? cuz i remember 1 person telling me dat the kid in wothout me is nathan\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nyea i agree with neurotic_chic..i mean if you truly are a fan..then you kno this is jus who eminem is..get over tha fact that he said he was \"gonna break that birdies neck\" & \"dont fuck with dad\"..lol..thats what he would do for hailie.. & i think that is jus as deep & sweet as tha other parts of tha song..its jus in his own way which may be different than yours..i love this song & i love tha las 2 lines\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\ni luv this song. future wwe is right the last to lines give it character\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\ni agree with turtle in the fact that without the last two lines people would think em went soft, even if for just one song. i didnt notice anything out of the ordinary, and i think the last two lines are my fav part. i guess i still expect the Em who sang  just dont give a fuck, and kill you. Mockingbird is an awsome real-life song.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI was never a rap fan before, but this song was just...breathtaking. Hard to believe it was by Eminem...but I love this song!\r\nCan anyone tell me how old Laney is?\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI was never a rap fan before, but this song was just...breathtaking. Hard to believe it was by Eminem...but I love this song!\r\nCan anyone tell me how old Laney is?\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nyeah this song is def. amazing, the very last line i agree doesnt fit but the birdies neck definitly fits yall\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nsweet eminem rules\n\r\ni thot i was just crazy but it turns out that this song makes other ppl cry too! \n\r\nthis is such an amazing song.\n\r\neminem rules.\n\r\nhe has a brother??? i thot i knew EVERYTHING about eminem. omg i cant believe he has a bro. \n\r\nhes so nice to Hailie.  i agree that the last line gives the song character.  the break the birdies neck fits in.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\noow this song is so sweet! it shows how much Eminem loves Hailey (and Laney)\r\nI cried too when I heard it the first time\r\nespecially at the part;\r\n\"Hailie I know you miss your mom and I know you miss your dad \r\nWell I'm gone but I'm trying to give you the life that I never had \r\nI can see you're sad, even when you smile, even when you laugh \r\nI can see it in your eyes, deep inside you want to cry \" \r\n...Eminem totally rulz...\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nomg could this song be any better!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nit is an awesome, shows the side of eminem which rarely comes out... its a great song from the heart, nice beat and good lyrics, one of the best on encore\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nthis is one of his best songs on the album. it's deep, and it's kept real.. 'cept that part 'bout that karat diamond eatin, and the breakin' the bird's neck.. it would be quite nice to see Eminem put out at least one clean song. though, it is eminem, and the song doesn't lose it meaning because he put it there.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nwhy so much crap about the alst to lines? its em com on ppl...he would kill (not just a bird) but a person im sure for his daughter if someone did something bad to her...i mean who woulden't for their kids? and the dimond thing is saying basically the same thing only in a diff. expression but this song kicks ass it really comes from his heart which tells you em is for real and he aint just rappin to make some $$$ he really means what he says. great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nits stiffen that upper lip up, not Stiffen that ?limb up?.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThis song is so touching, He loves Hailie-Jade and his niece so bad.\r\nI love the lines... \"I can see you're sad, even when you smile, even when you laugh \r\nI can see it in your eyes, deep inside you want to cry \"\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\ni would say this is the most deep song eminem has ever made....i think that when he says \"Cuz you're scared, I ain't there? \r\nDaddy's with you in your prayers \r\nNo more crying, wipe them tears \r\nDaddy's here, no more nightmares \r\nWe gon' pull together through it, we gon' do it \"\r\nis the best cuz it is basically telling his daughter that she shouldnt be afradi cuz he is there and always will be...i love that song!\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI think everyone has pretty much said it for me...Awesome song! its the old skool Shady and i love it!  2 thumbs up for Mr Mathers!\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThis song is tha shit. I think this is his deepest song.  Tha first time i heard this i was with my cuz and lil sis and i was like fuck. It's an addicting song fo real. Tha whole song is great, but tha end kinda screwed it up. THere's nothing wrong with tha last couple of lines, but he coulda used somin else.. lol but thats just tha way EM is\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nem is a fuckin genius...enough said\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThe song is great... i love eminem... this song never gets old... i think he is a wonderful dad and good person... i think that its cool that he has his brother and his neice living with him along with his daughter, to me that shows that he is a family person.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nomigosh, i love this song!! it's soooo cute!! i love how he gets when he's talking about his daughter, he's so protective! it's so cute, it shows his sensetive side!\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nthis song is pretty good but he sort of rambles on too much. \"Hailie's Song\" from the previous album is a lot better\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\noh yeah, and I really respect how Eminem is supposed to be so evil and mean while keeping his daughter at the center of his heart\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI love this song... I love when he sings to Hailie 'cause you know that it's so real and he means it. Yeah, I respect that too- that everyone thinks hes such a bad evil person but he loves his daughter and hes not ashamed to sing about it or talk about it. It's like he's not trying to pretend that he's this big tough guy 'cause he knows that Hailie is his soft spot.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThis song is really emotional, and it's the fact that he can make these kinds of songs and put real emotion behind his music that makes him the awesome artist that he is.  Also, I think those last few lines are not only appropriate but vital to the song. Yes, it's a sweet song, but the song is about hardships the family has had to deal with, and Eminem is basically saying, look kids, I love you, I know things have been rough, but I will ALWAYS be there for you. and I will ALWAYS do ANYTHING for you. And if you look at the things he has done in real life for his daughter, you'll see it's true.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nto me, well, this song really means alot, this is my firs time logging in and already I love it!\r\nthis song is only my favorite! ofcourse, after \"ignition\" the remix by r-kelly!\r\nbut, I still love this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nthis song really touched me and I think it is the sweetes song I've heared yet because even though he is a hard core rapper, he shows his true feelings for the people he loves and cares about, I really loved this song, and I hope everybody can learn something from it, I know I did, that is, that no matter how strong and tough you are, you have feelings and you try your best to show them to the ones you love and care so much about. I will keep listening to this song whenever I can! also, I know that em wants to tell everybody to be there for your family and friends whenever is needed. This song almost made me cry when I first heard it. I couldn't think of any other way to express my self in such a way as em did.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nHey!\r\njust wanted 2 say i lovveeeee this song n nething 2 do w/ eminem. hes my fav artist ever he ROCKS! lol. and for those people who asked, the video nathan was in was \"without me\" and he is eminems half brother. ems mom had him in 1986 with a man named fred samara junior. as for all the stuff about the last few lines, thats just em, he cant have a song with no swearing in it lol! love him!\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nIs he saying, mommy's not here.. what does he mean by that? \r\nHailie is eight right?? \r\nHow old is Laney?\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nThis song is so touching and that last bit didnt wreck it coz thats the way eminem is and it shows that he would do anything for hailie or laney and that hes protective, this a such a great song....\r\nand yeah i cried too!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nmommys not here is in regards to the joint custody thing and divorce.. and the fact that Kim is a drug addict. She's not a mother to them. I believe Laney is 11.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\ni loved this song form the first time i heard it,and now i just saw the world premier of the music video of it on trl. i wont deny it,it made me cry and then i saw eminem cryin afterwords, it really showed how much he loves his daughter and niece.\n\n\r\nfor all you people out there who think eminem is a horible and cruel person you can go back to suckin your dick becuz once again he has showed he's not all that bad and that he does have a heart.and its bigger then yours will ever be.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI think the deepest part of the song is where he says \"i remember back one year when daddy had no money, mommy wrapped the Christmas presents up and stuck them under the tree and said that some of them were from me, cuz daddy couldn't buy them, i'll never forget that christmas i sat up the whole night cryin\", it just shows what eminem has really gone through to get to where he is at.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nEminem Didnt adopt laney he jus haz full custody of her n kim is in prison from posession of cocaine.....hez so lucky have 2 gr8 daughters.....\" its almost like ur sisters now\" buh they are actually cousins but are known as sisters more....\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI agree with the very first post..this is the old Shady.\r\nOld Shady is so much better.  Eminem is awesome, but I thought some of his newer songs seemed to be off track than the first two albums.  But this song and Like Toy Soldiers is the good shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\ni love this song i aint a huge eminem fan at all but the 1st time i heard this song it touched me....*wipes away tear*  \"shh momma's only gone 4 the moment\" gr8 song......\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nwen you here this song it just makes you sit and think it great!\r\nnot all his songs like this have meaning,they are good but i find they arent as gd\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nok ok .. what does this song mean? .. well laney is kims sisters daughter right? ell why did he adopt her? and then she talkes about how  he let and flew them out to see him  is he talking about him . or i dunnoo this song confuses me but i like it .. pleasee help lol\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nThe song was so sweet. I actually cried which is so lame. but i love the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nTHis song rocks i love tune and i did not know eminem cared about his daughter so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\n^^^^he mentions haliee in like every one of his songs (mostly) its kim he cant stand. anywho, i totally love this song. did you all see him cry when is first aired on tv? so sweeet and beautiful. making me start to love him again.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI cried the first time I heard this. It just shows how much he loves his daughter and Laney, its so deep and shows what he really thinks and feels.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI LOV THIS SONG COZ IT IS RAP AND I LOV RAP\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nOKay, I usually hate Eminem. Hell, I hate all rap singers/songs for that matter. But, this song is the one and only exception to my usual feelings.\n\r\nI love this song. It is really deep and filled with emotion. Plus I love the rythym(sp?) to it as well.\n\r\nIf only more rap songs were like this I might actually begin to like that kind of music... Oo *shrugs*\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI love this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nfor all you tards who think the last part is wrecking it because u wanna leave the song wanting to feel like u had some horrible life like he did...its supposed to be funny and it is so get over it\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nI loved this song.\r\nIt nearly made me cry when I first heard it. It was the first Eminem song I heard, of actually listened to. He seems so sweet. My judge of his singing voice: he can hit notes for the most part, but I'm a pretty humble person and I still say I'm a better singer.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI love this song, and the video is so bitter-sweet. Laney and Hailie are beautiful. They're obviously huge, huge parts of his life.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\n*i love this song*\r\nIt is so powerful!\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nIn my opinion, songs written with 'ur heart n soul' have the effect of evoking the deepest emotions within a person. The first time i heard it, i thought nothing of it. When i actually paid attention to the lyrics, i could feel all of Em's emotions. He almost mad me cry. The sadness, anguish, disappointment of Em and the will to protect his child were all evident in this song. The comments on 'break that birdie's neck....dun fuck with dad\" is totally redundant. This song is practically a masterpiece, oh yah, and could be used in literature. Oh, kim is in rehab as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI THINK THIS SONG ROCKS IF HE DIDN' T HAVE SOME TYPE OF RAW SHIT TO SAY IT JUST WOULDNT BE EMINEM\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nEm's someone no one can replace..\r\nhes such a good rapper..\r\n1 thing hes talented\r\nbut hes rap r so fuckin popular bcoz it all comes from deep down in his heart..\r\nevery rap he makes.. he realli comes from him\r\nhe doesnt juz make raps dat rhymes n goes wid the music..\r\nhes able to tell so much bout his life..\r\nhes lived a life so ver much exciting\r\nhes got so ver much to rap about..\r\nunlike other rapper\r\nhu grows up like all normal kids\r\nthey sometimes run out of stuff to rap abt n the lyrics starts to crap up wid onli meaningless rhymes\n\r\nbut other artist still haf ver nice creativity n cool side of their own\r\nrespect for all rappers..\r\nits ez to come out wid rhymes n lines\r\nbut it isnt ez to make it touch ppl's heart n mind\n\r\nany idea if em's back wid his wife?\r\ncoz hailie sure would b ver happy.\r\nn hows em's mother?\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nEm's someone no one can replace..\r\nhes such a good rapper..\r\n1 thing hes talented\r\nbut hes rap r so fuckin popular bcoz it all comes from deep down in his heart..\r\nevery rap he makes.. he realli comes from him\r\nhe doesnt juz make raps dat rhymes n goes wid the music..\r\nhes able to tell so much bout his life..\r\nhes lived a life so ver much exciting\r\nhes got so ver much to rap about..\r\nunlike other rapper\r\nhu grows up like all normal kids\r\nthey sometimes run out of stuff to rap abt n the lyrics starts to crap up wid onli meaningless rhymes\n\r\nbut other artist still haf ver nice creativity n cool side of their own\r\nrespect for all rappers..\r\nits ez to come out wid rhymes n lines\r\nbut it isnt ez to make it touch ppl's heart n mind\n\r\nany idea if em's back wid his wife?\r\ncoz hailie sure would b ver happy.\r\nn hows em's mother?\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\ni sooo love this song it is so so so beautiful. i think this is the one of the best songs he has done for a while. i cried when i first heard it. i love encore i think it is brill and this song is just the best! i am an enormous eminem fan i love u eminem!\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nthis is like, a very personal for em, he should be very proud of his gurls and of himself, he needs to be like this a lil more, i love eminem !!! he rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI love this song... but I think it is hypocritical that he sings this song about saying sorry about everything, and then he goes and sings a song like \"Spew\" on his album, that is bagging out Kim. By the way..  I neva knew Eminem adopted Lainey.  Thanx guys 4 tellin me. Lol\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nThis song is absolutely amazing, as lame as it sounds, I literally bawled like a baby when I first heard it. I thought it was beautiful the way he expresses how much he loves Hailie and Laney. The video for this song is pretty good too. The way the song seems to be written from his soul, is the most touching part, and that he loves his daughter so much that he'd do anything for her. It's amazing. This is truely one of his best songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI loved this song when I heard it, even the last 2 lines. I really don't see why some people think that those lines should have not been there. I mean if you are graping about the lines then don't listen to the song I like, cuase those lines makes the song good. Like some of yall said he said that cuase he loves his daughters and would do anything for them, that is what he is saying the whole song, and telling then he will always care, love, and be the for them.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\ni fuccing love this song.... eminem is so sweet to his daughter\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nAnd if you ask me too \r\nDaddy's gonna buy you a mockingbird \r\nI'mma give you the world \r\nI'mma buy a diamond ring for you \r\nI'mma sing for you \r\nI'll do anything for you to see you smile \r\nAnd if that mockingbird don't sing and that ring don't shine \r\nI'mma break that birdies neck \r\nI'd go back to the jewler who sold it to ya \r\nAnd make him eat every carat don't fuck with dad (haha) \n\n\n\n\r\ni agree lol\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nI LOV IT\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nthis song means alot 2 me my best friends dad cryed when he listened 2 this and i asked him what was the matter and he said it was just like what he had to go through juring his life\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nThis is probably the best song he's ever done.  It's not the Eminem that I've seen for the past 3-4 years, it's much better.  When he stops talking shit and talkes from the heart we get songs like this...this is a sad, true-life song.  I heard it on MTV and I could not stop watching/listening.  Really amazing that his daughter will have a song like this from her dad forever.  Makes me sad listening to it..\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nWow. I hate Eminem, but this song is just...wow. When I say I hate Eminem, I mean I hate every single song except this one. \"don't fuck with dad\" was really unnecessary, though... I understand why it's there, but the whole song had no language up until that point. It could have been left out. -_- Still very nice, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\ncan i just say this\n\r\nWHAT THE HELL IS WRONG WITH YOU PEOPLE!!\n\r\ni was flipping through the channels, and heard the very end of this song\n\r\n\"im gonna break that birds neck, and im gonna go back to the jeweler and make him eat every karat\"\n\r\nthat is horrible!\n\r\nits bad enough he exploits his daughter to make more money by writing songs about her\n\r\nbut now, hes taken an old song that was used for calming children down, and parents would sing to their kids because they loved them, and hes turned it into shit!\n\r\ni thought rap sucked before but this takes the cake\n\r\nits a bad influence on society\n\r\nplus it sounds like shit\n\r\nso dont give me crap like, i dont know what im talking about, or im a moron\n\r\nactually im bet someone is gonna call me gay for this, because people use the word gay all the time now, without any concent about who their hurting by saying it\n\r\nand also people who say they dress \"ghetto\" if you reaally wanna look ghetto, through on a few rags, smelling like shit, starving, and with a few bullet holes in your arm, thats what ghetto is\n\r\ni know exactly what im talking about here, i know music, music is my life, and this stuff is not music\n\r\nso do yourselves a favor, throw out all your rap shit, go to the store and buy youselves a Beatles cd\n\r\nlisten to some real music\n\r\nour generation sucks so much, because of fuckers like eminem\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nomg this is a good song!haha who the he!! is laney\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nthe last couple lines kind of kill the song for me but... to \"nirvana rules\" or whatever...    you say you know music yet you have the most overly commercialized, not worth it band, of our time as your name... give me a break.       i dont normally listen to rap but this is a good song from any angle regardless of musical taste\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nomg I am so offended! 'nirvana rules' I have alot to say to you. First off, Eminem does NOT exploit hailie at all. He raps, meaning he pours out his heart into everything he says which obviously means hailie's gonna be mentioned somewhere. He tells it like it is unlike some rubbishy bands who go on about killing themselves and how crap life is. \n\r\nIn my opinion Eminem is so much better than Nirvana and at least he takes what life throws at him instead of topping himself. So if anyone is a bad influence on society it is Nirvana.\n\r\nYou do realise what a hypocrite you are? you go on about how ppl dnt care hu they offend by saying 'gay' yet here you are offending alot ppl by dissing ppl hu wear 'ghetto' dress!! \n\r\nI have encountered ppl like you before hu claim the type of music they listen to is the best and the lyrics they listen to are so much more meaningful BLAH BLAH BLAH! It is only better in YOUR OPINION so you shouldn't down talk ppl who like rap. I'm not saying rap is the best type of music because it only is in my opinion.\n\r\n Dnt claim you 'know music' because that is practically impossible unless you are an expert in EVERY time of music which I seriously doubt you are because if you were you wouldn't be making pathetic comments like you have. \n\r\nAnd you say 'listen to the Beatles'? They sang alot about taking drugs, much like some rappers today. Yeah ok some rappers do go on about getting high and getting girls but eminem isn't one of them. So I think you should sit down and listen to the whole song and some of his other songs before you come out with comments like that. \n\r\nto everone else: sorry for going on but I got very fired up!!\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\neminem is living proof that you do not need special effects and \"hoes\" and \"sluts\" and lyrics about the \"hood and being gangsta\" in order to make a good song and video to go with it.\n\r\nto nirvana rules. \n\r\nshut up. get over the beatles. its over. move on with your life. quit living in the past. and what makes you think he exploits his daughter??? he does whatever he can to protect her. he doesnt go around like other celebrities like \"HEY HERES MY KID LOOK!!!\" if you didnt notice, hailie is about 9 years old now. look at her in the video. those are obviously all years old. laney is about 12 now and i know because shes three years younger than me she. she turns twelve sometime this month. and look at her in the video.  what was the oldest you saw laney in the video like seven eight years old??? exactly those are OLD as hell. did you NOT see how her face was blurred out? obviously he doesnt want people knowing what his daughter currently looks like. thats what hes BEEN doing. thats why he thought it was okay to put those old home vids out now. he didnt want people knowing what she currently looks like. had he been so called \"exploiting\" hailie, he would have released mocking bird 4 years ago when she was 5 and laney was 8.  she must look different now or else marshall would have NEVER put her old stuff in the video. do YOU look the same way you did when you were 5 and 8 years old?? i hope you dont. cuz there have been leaked pictures of laney and  hailie on the internet and let me tell you they do look older. \r\nher most recent pictures havent been released  purposely by eminem. so how is he exploiting his daughter?? people always see eminem as this evil monster. hes trying to show that hes a dad and that hes always going to be by her side. does that eminem in the real slim shady video look like the same DADDY in mockingbird?? no  he doesnt.eminem has always said that hes always daddy before hes eminem. so if rap makes you cringe so much, you might want to crawl in a hole cuz rap is going to be around for a long time to come. there are worse cases of exploitation by celebrities. of their own kids. i saw one thing on the \"fabulous life of celebrity children\" and some parents actually let people take pictures of their kids (basically invade their childrens privacy) for MONEY!!! how sick is that. they actually ALLOW people to take snapshots of their kids for money. so dont come on here and bitch about eminem \"exploiting\" his kid. he doesnt. he does whatever he can to protect her privacy. if you want exploitation, see madonna, angelina jolie, and all those other fuckers.  and by the way..... how many videos has hailie appeared in besides this one????\n\r\nNONE thats how many. if any of you ever believed that those hailies in other videos were really hailie, your wrong. they are look alike actress hailies. so take that and shove it. he doesnt want everyone in his daughters business. if anyone was ready to exploit hailie its kim. she wanted to get hailie an agent so she could be an actor. but what happened?? marshall said NO WAY JOSE!!! he wants his daughter to have a childhood. not a career. he knows what its like and he doesnt want  to put her through that. he says maybe when shes older but not right now. he wants her to have a childhood thats as normal as possible and he has admitted that its hard to do that because of his fame but hes not going to put hailie into it on purpose. so take that and SHOVE IT okay??\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nok look...Nirvana Rules...get ur head out of ur ass and realize what your trying to say here. Em puts out a song STRAIGHT FROM THE HEART about Hailey and Laney and about how much he loves his kids and you're sittin here crappin all over it. you saying that hes using Hailey to exploit her and further his own career, then thats say to EVERY artist that every writes a song about family or a loved one or anything, that their feelings are shit and they're just trying to make money. everyone knows how much of a fuckin idiot you are, so just take some advice and dont talk anymore. ur views are by far insane and u have absolutely no room to say stupid shit like that. this is an amazing song. no doubt about it. im not much of an eminem fan anymore, but this song hits hard. its straight from the heart and thats what makes it a great song. u dont hear too much like that anymore and what Em has to say chokes me up. its hard time shit and u gotta respect him for still fuckin living through everything and keepin 2 little kids goin through all of it too.....\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nWords can't describe how much I loathe this song entirely... and I usually kinda like eminem...\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nall of you saying the ending kinda ruins it with the killing of the mockingbird, and the carat eating... kinda don't get it...\n\r\nThe reason I see to put something like that, is to show EXACTLY what you would do for your child... if you wouldn't 'kill' in the illiteral sense for your child, you deserve not to have one... hell, I would beat some guys ass who messed with my little sister because I love her so much... wait till i get a daughter, it's gonna be hell until she turns 18 and moves out... ;)\n\r\noh, and the part about christmas I just broke down... literally, that hit me like a ton of bricks, because something similiar happened last christmas... just didn't have the money, so my gf put my name on a few presents and said they were from me...\n\r\nI have no children btw, because I am poor and cannot afford them, so most of em's songs about his daughter's really hits me, because I would love to raise and care for a child, but I don't want to bring them into a world where they won't be able to get what they need...  THAT is what this song says to me... the part about the money jar for college... \r\n\"Shh, momma's only gone for the moment\"\r\nand mostly this part...\r\n\"But then of course everything always happens for a reason\r\nI guess it was never meant to be\r\nBut it's just something we have no control over and that's what destiny is\r\nBut no more worries, rest your head and go to sleep\r\nMaybe one day we'll wake up and this will all just be a dream\"\n\r\nalong with good die young by d12 and I ain't mad atcha\\dear mama by tupac this song is standing pretty on the podium for my favorite hip-hop song\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nHi. I don't know if this Q has been asked before, but does anyone know what's happened to Kim's kid with another man? I read somewhere that eminem wanted to bring her/him up as his own and that the real father had some trouble with visitation rights.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nP/S Has there been any mention about the kid in any of eminem's songs?\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\none da only songs dat wood make me cry\r\nit dosnt get much beta\r\neminem is amazing if i did hav any criticism 4 marshall it wood b 2 stop talkin so much bout his own life\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nEminem shows more of his personal life than most other people in the world, and he does it to everyone on earth. I think it's amazing that Eminem is putting himself through this torture. Marshall's childhood sucked, but he still knows how to have fun (looks over to see him dancin' like Michael Jackson). He is one of the most different artists out there...this song is awesome. ^_^\n\r\nAnd the last line fits the song perfectly. Eminem is going to do ANYTHING for Hailey and Laney, and if you make either of 'em sad, HE IS GOING TO KILL YOU!!!!!!!!!!!!!!!! :O\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nthis song made me cry when i first heard it and still chokes me up a bit now\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\none of the best by eminem but, too over played on the radio. they need to play more of his shit on the radio. theres alot of good ones no one hears.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nThis song makes me cry wheneve it comes on mtv, particulary when Eminem mentions the christmas presents thing and when Hayley's money were stolen. Btw, who is the other little girl in the vid?\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nthis song is about eminem's daughter and specialy hailie it's about not being with them \r\nand hailie is sad even when she smile even when she laugh and the video clip is so realistic and I love that it's just so amazing I love hailie when she was a kid in the video she is so adorable\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nI'm loving this song, Eminem is at his best, it's so sweet how you can clearly see how much he loves his daughter Hailie and would do anything for her.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nI'm loving this song, Eminem is at his best, it's so sweet how you can clearly see how much he loves his daughter Hailie and would do anything for her.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nI'm loving this song, Eminem is at his best, it's so sweet how you can clearly see how much he loves his daughter Hailie and would do anything for her.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nthe song relli shdnt make u cry.\r\nit is v good though\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nwow this is a bad song. he really cant sing and this is coming from someone who listens to fugazi (all u people who listen to good music will know what i mean).\r\neminem is really, really, really bad. he doesn't even play his own instruments and all his songs sound the same. he has sung about the same thing for years and its just boring. how can you say \"eminem is so deep bro\" wen he has songs like \"ass like that\"\r\nthis shit is tired and pathetic. sorry to all u rap fans, enjoy ur music but in my opinion, this is really bad.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nii hate it wen ppl diss eminem just coz they dont like him doesnt mean he is shit or anything...it just means they suk..lol jk..but reali everyone has there ow opinions...i rekon this song rox and i dont kare about the end bit..it just shows that eminem can still be rude as well as loving and carin and shit\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nFinally a rapper with a proper meaning to their songs. There's very few of his songs I actually like coz I feel one is just a replication of the other, mouthing off etc but he has seriously out done himself dis time. powerful lyrics & music. major achievement. oh n who cares about d last couple of lines like hello..... wake up people it's eminem!\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nIt should be:\n\r\n\"We fear how we feel inside\"\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nThis song is amazing.\r\nThe end\r\n(And if that mockingbird don't sing and that ring don't shine \r\nI'mma break that birdies neck \r\nI'd go back to the jewler who sold it to ya \r\nAnd make him eat every carat don't fuck with dad)\r\nwas hilarious.  It just seems sad that he writes all these songs for poor lil Hailee.  Doesn't she have a sister?\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nThis has gotta be Eminems most personal song yet.  its about his daughter hailey.  I guess he wanted to explain everything to her through song.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\n*About previous comment*\r\nI did know that she isn't actually Eminem's daughter, but he's raising her.  She deserves at least one song!\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nwow, what a great song i mean this song was sung by eminem about his painful divorce and how he would try n fix things between his wife kim and his daughter hailie. I think this is one of em's best song and nearly cried the first time i heard it lol. Oh and by the way who cares about the last two lines of the song i mean he sung those things because that's his style\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nWhy does he always complain?  I mean its an ok song butwhy is he complaining?\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nwhen i got the album i listened to this song about 20 times over and when i'd memorised the words, i started rapping it to my friends and pissing them off. still am.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nTo ihatemondayz:\r\nHow is he complaining geez i mean i know that he complains in some of his songs but not in mockingbird. And it's clearly stated that this song was sung to hailey and how sorry em was with things going on with Kim and all.  So before you go saying stupid things like why does he always complain listen to the song and read the lyrics. dumbass!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nwait, so the other little girl in the videos is em's adopted daughter .. ?\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\neminem sucks, i agree with ihatemondayz.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nwhich makes you a loser\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nhow does he suck ? are you saying he sucks or his music does ? honestly i think he's one of the few good rappers out there, cause he sings about his life even though it's through a small keyhole. his music has meaning and feeling and you can feel that. when you think of eminem you probably just think of him as \"angry\" yes he went through this phase but look how much he's grown through his music.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nhow does he suck ? are you saying he sucks or his music does ? honestly i think he's one of the few good rappers out there, cause he sings about his life even though it's through a small keyhole. his music has meaning and feeling and you can feel that. when you think of eminem you probably just think of him as \"angry\" yes he went through this phase but look how much he's grown through his music.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nto \"pink ink,\" i'm sorry but this song is 99.99999999 percnt perfect; had eminem said \"screw\" instead of \"fuck\"(for the edited/clean versions) this song would've been perfect\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nthis song is awsome if you dont like it than you just plain suk! eminem has 2 lil girls without a daddy to grow up with and i dont know bout you guys but i love my daddy and i cant imagine not ahving him at home , thay would be sooo sad :( so i admire haily and laney and feel really bad for them!\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nlove this song, great video too! haha! it ironic that he got back with kim\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nI love this song, its really meaningful. It shows the world how much Eminem loves Halie and Laney and what he would do for them.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\ni was given a tape with twenty songs on it that i had never heard before. i was supposed to guess who was singing. mockingbird was one of the songs. i do not listen to rap nor had i ever heard a song by eminem before. i thought the song was excellent and i guessed it was eminem simply because i had heard he was top dog in the rap world and  figured there was a good reason why . i'm in my early fifties and hendrix is the man. (for me that is)\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nThis is the first song that has ever had an emotional effect on me. And you people saying that the lines that arent so \"clean\", i think it just makes the song more realistic. Shady is a clean guy, if you listen to just about anything about him. so he is just adding his signature to the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nI love this song! Lol its old now but i just remembered about it =D this song is the shiiiiiit!\r\nPeople who dont know! Laney is the adopted daughter kim's sister didnt want! Hayli (howveer you spell it) as must of you know is his daughter and nathan is his brother that lives with him. there you go people =D lol sorry but alot of peeeepppoooll made comments on whose this and that just wnated to mkae it clear otheriwse i like some of eminems song it actully shows that rappers does have good lyrics instead of singing of girls ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nIm so sad though just when everything goes good with him stuff come back. His best friend? died He remarried? im not so sure if their together thoufh.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nOMFG HOW XCAN YOU PEOPLE THINK H EIS COMPLANIN! \r\ntry to go through what he went through. \r\ni doubt you wouldn't have any effect!\r\nfucker this is one rapper that you cant mess with or i ll bite you all!! lol\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nwow this is such a deep song. i like relate to this song with my own dad.wow i luv it\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nI was the only person last year in my class that could rap this whole song correctly. This year, I'm not sure, but this song is deep. True story, personal experience.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\none of the most meaningful songs by eminem\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nMy favorite out of all of eminem along with like toy soldiers\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nthis song wouldve been perfect except for the last line.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nthis is one of the realest songs ever written...em stays speaking real SHIT!!! \r\n\"It's funny \r\nI remember back one year when daddy had no money \r\nMommy wrapped the Christmas presents up \r\nAnd stuck 'em under the tree and said some of 'em were from me \r\nCuz daddy couldn't buy 'em \r\nI'll never forget that Christmas I sat up the whole night crying \r\nCuz daddy felt like a bum, see daddy had a job \r\nBut his job was to keep the food on the table for you and mom\" thats real i shed a tear everytime i hear it...its powerful music shows white people are broke as shit. Shows we're in this struggle with the blacks spanish and everyone else struggling to better there family...and would die right then and there to give there family a better life...instead we're left with busting our asses to try to keep everyone smiling....for the working/loving fathers and mothers out there......you are appreciated......\n\r\nYOU ARE APPRECIATED...............\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nthis is a good song. enough said. clearly about eminem's daughters.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nthe whole \"And if that mockingbird don't sing and that ring don't shine I'mma break that birdies neck I'd go back to the jeweler who sold it to ya And make him eat every carat don't fuck with dad\" is just showing how much he would do for Hailie and Laney. He doesn't care what he has to do as long as it will makes the 2 happy and give them a better life and if anyone gets in his way well screw them\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nLife is complicated and he's explaining how things are and were with him and her mother. He's sorry for the way things turned out, he'll do whatever he can to make it up to her.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nI love that no matter what is going on in his life his kids are right there beside him and he is always there for them\r\nThis song shows that even if every other word in your Rap is a swear that you love you kids even more than life in its self and you just do all that BS to put food on thte table\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nThis is a pretty good song and all...but he got very sloppy on some of the lines....had to really force a few, and it was kinda pushing it. Overally not bad though.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\ni dont think the swearing at the end ruins it at all, i guess that just shows that no matter how much of a nice dad he is he's still eminem and hes still foulmouthed, it kind of shows that hes still the same person i think? i dunno...\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\ni fucking cried my eyes out listening to this song.\r\ni can really relate to this.\r\nwhen i listen to this, i think back to when my daddy loved me. \r\nHe always told me that he would do anything for me, but i guess he lied.\r\nThe part of the chorus when it says \"I know mommy's not here right now and we don't know why\", I can really relate to this. \r\nBecause even though my mom is here physically, she's not mentally.\r\nI can honestly say that my parents dont really give a flying fuck about their only kid.\r\nI know that most of the people who read this will reply to this saying something like \"We don't care about your problems\" but incase you haven't noticed, the comment box says \"What does this song mean to you\" and this song happens to mean something to me.\r\nSo fuck off.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nit about his daughter and how he trying to make up for missing out a lot in her life when she was a child.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\neven though i hate rap i absolutely love this song and i can really relate to it. even though my dad was very abusive towards my mom and when they divorced i rarely saw him i always knew i was his princess and i knew that as long as daddy was alive nothing was gonna harm me. i know what its like to live in a neighborhood where every other house is getting robbed and i really admire Eminem for getting himself and his daughter out of that situation but still being able to admit he has problems and being willing to work on them (like my dad) perhaps what i love most about Eminem though is how seemingly effortless he can tell the story of millions of people and how easy it is to relate\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nthis song teaches me how much of a father means to him\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nI love this song!!!! this is one of eminem's best songs ever!!!! he wants a better lyfe for his little Haylie!!\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nTo the people that feel like the last part ruined the song...I personally liked it because through the whole song you have the other side of Eminem and he throws a little of his other side on the last part. Basically saying that he'd do anything and everything for his girls.\n\r\nFor me, this song is meant to explain to his daughter and his niece about what is currently going on in their lives and with their mother Kim and Eminem's relationship and reassuring the both of them that he will always be there for the both of them and he'll never leave them under any circumstances.\n\r\nHe knows that his daughter is sad that her mother isn't there and Eminem is just trying to comfort her.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nGod this song is beautiful.  I never thought I'd say that about a rap song, but it really is just deep, and sad, and beautiful.  My heart aches every time I listen to it.\n\r\nI do agree that I wish the last line, \"don't fuck with dad\" wasn't there, just to make an Eminem song totally completely clean, for once.  Even so, it's a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nI hate rap music so much, but this song made me cry.\r\nThis is the one rap song that I like.\n\r\nI just hate that last linee!\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\ndamn I actually crie when I hear this song, \t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nDamn I actually crie when I hear this song, it is so damn good. And I can relate to it so much, my parents are divorced too when I was just a little girl, and I wish some one said somthing like this to me back then. It is a good song, like all the others of Eminem.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nthis is the best song. i know every word. and it is deffiantly one of the best songs. even non em fans love it. Lany is Alaina,his ex sister in laws daughter. He adopted her because his sister in law was arrested or somehitng.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nto the people saying the last line was \"unclean\" and \"unecessary\"\r\nit wouldn't be eminem if he didn't make it a little of both :)\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nthis is right next to when im gone\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nthis song is really good and touches EVERYBODIES heart, its really emotional, and really sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nGod, this song makes me cry sometime, it's so touching.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nit's about it's hard for a kid whose parents are going through a divorce, but everything is going to be alright.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nEminem is a powerful artist. He can wrap any song, but the songs he writes have th most meaning...\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\n:( this song refers to my life but i aint got my moma or my daddy and i was 9 when i got took form em and now im 16 and still aint  seen em\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nmy parents are goin through a divorse and i cant see em because they was on drugs and didnt stop even for me and my bor i was 9 when i got took and now they aint got nothin to do with me\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nI'm like a mother to my little brother Charles. When I was living out east in Trenton Ontario, I would cry every time I listened to this song. he was very angry at me when I  moved out because he thought that I didn't love him anymore. I can relate to what Eminem is saying because I left my brother when he was young after six years of living with him. I still hold myself responsible for his anger.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nI can't relate to these exact lyrics..I'm a rocker I listen to rock and metal mostly..but I love eminem..spit on me if you must..but this song to me..for the past 5 years is about reminiscing...reflecting on your past, regrets and happy moments, things you wish that could be different\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nAll these people saying the last two lines; \"And if that mockingbird don't sing, and that ring don't shine, I'ma break that birdies neck. I'll go back to the jeweler who sold it to ya', I'ma make him eat every carat. Don't fuck with dad.\" ruined the song. To be honest, those are two of my favorite lines from any song Eminem's done... Maybe get used to the fact that Eminem has an amazingly fucked up mind? Heh, maybe that's why I love him so much..\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\n\"And if that mockingbird don't sing and that ring don't shine I'mma break that birdies neck I'd go back to the jewler who sold it to ya And make him eat every carat don't fuck with dad\"... those are the lines that wrecked this song.. its so deep and swwet and then he goes and wrecks it all by this! any way... this song is so sweet and shows his love and detication to hailie and layney...\t\t\t\t\n\t\t\t\t\n\n"}