{"comment_0": "\nThis song is about someone (Dan Reynolds) who probably has a mental illness like depression or OCD.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI see this song as a person being abnormal and being so terrified to show it to society that it builds up inside and creates a hate-filled... well, monster. They become so isolated that it just keeps growing and they're too scared to tell anyone because they think they'd be labeled as a freak so they try to be normal and fake it  but they hated being 'a pretender' and having to act as someone so very different than what they truly are. They begin to think it's their fault. It seems like a horrible trait to them so they're afraid to show people the real, true, flawed but somehow perfect person they really are.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWell, here's my opinion:\n\nEver since I could remember,\nEverything inside of me,\nJust wanted to fit in (Oh oh oh oh)\n\nIt is about a guy, who since he was a kid just does not fit in his society. Example: all the people liked soccer, he liked basketball.\n\nI was never one for pretenders,\nEverything I tried to be,\nJust wouldn't settle in (Oh oh oh oh)\n\nHe never had no one who really wanted him, and he tried to do different activities but they just didn't fit in him.\n\nIf I told you what I was,\nWould you turn your back on me?\n\nAfter all I said before, he was normal, but there was onte thing that changed him, I don't know, maybe a strange disease, etc.\n\nAnd if I seem dangerous,\nWould you be scared?\n\nThe thing that changed in him makes him seem different that how he really is.\n\nI'm only a man with a chamber who's got me,\nI'm taking a stand to escape what's inside me.\nA monster, a monster,\nI've turned into a monster,\nA monster, a monster,\nAnd it keeps getting stronger.\n\nHe just don't want to be criticized by people anymore, and he accepts his condition and leave \"the monster to escape\".\n\nCan I clear my conscience,\nIf I'm different from the rest,\nDo I have to run and hide? (Oh oh oh oh)\n\nI think this part is self-explanatory.\n\nI never said that I want this,\nThis burden came to me,\nAnd it's made it's home inside (Oh oh oh oh)\n\nHe continues being criticized by people, and he wants they to understand that he didn't wanted what happened, it only happened. \n\nWell, thatÂ´s all my opinion, sorry if I have a mistake I'm not anglophone.\nI came to these conclusions beacause I have acne, but not the normal acne, and all the people believe that I don't clean my face (Actually I clean my face third times a day), and I've been bullied in some occasions (I really don't care being bullied). Also, as the people doesn't like my acne I neither, and it's so much to you when not even you like your face as for all the people keep saying the same thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nHere is my look on this, but I think this song can be understood in a number of ways.\n\r\nIt tells about this guy who just wants to fit in. In some way, he's different and if he showed his true colors, people wouldn't accept him. He has taken on a role, being someone he isn't. Now, he don't like this role, not at all. He sees himself as a monster, this new him being forced onto him. He wants to escape this new role, as he sees that it isn't him.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song expresses what it feels like to be  \"awake\" in this world.  It explains what a person goes through inside when you \"wake up\" to the harsh reality that everything we were taught about life and what we know about ourselves, is a lie.  The person in the song understands that he isn't who he thought he was in life anymore, and he knows deep down that he's been living a lie his entire life.  He wanted to learn the truth at the moment, but he never asked for the burden that it carry's by knowing it.  He's is trying to fight the awakening process that one goes through when you learn who we are on the deepest level. He's trying to forget the things that he understands the most about himself, because it makes him feel disconnected from the rest of society.  He used to naturally just \"want\" to fit in, but the truth that he learned has awoken a side of him that can't live in the reality of the old person he used to be.  That side of him is the monster that wants to be set free, but he is scared to leg go of the old him, because of the way people might judge him.  He's not ready for the world to see who he truly is just yet, and the more he trys to hide it the more the monster inside of him wants to come out.  \n\nIts hard for people to learn about the truth and then just go about their lives like nothing ever happened.  Once you become spiritually awake, its hard to look at life from the same perspective that you used to.  Your soul wants to be set free at this point, and the more you keep it trapped inside, then the more it begs to come out.  Most people subconsciously keep that monster inside because they've never met that side of them yet.  But if when you are consciously aware of that monster inside of you, then its hard to fight it.  The key to letting that monster out is to let go of everything that limits you from expressing what your true beliefs are.  Accept losing everything you ever knew, and begin to grow into your true Divine self.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song reminds me of Divergent, my opinion so if you don't agree I'm sorry but I just think the story and this song have a lot of similarities.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni m gonna agree with chainta, this song describe perfectly how you feel when your developping a mental disorder ( i feeled like that when i developed some psychosis)\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe thing about songs is that people can relate to them with their different experiences. Some other people who have commented have suggested this song being related to people with mental disorders, which I find understandable. But as someone who has never experienced this, I cannot personally relate to this. \n\nMy interpretation is that this is about an internal conflict. I hope that you all feel that a need for belonging is inherent to all humans; humans are not solitary creatures. They build societies where they belong to, are conditioned to belong to that society, and if that fails, find a society in which they do belong. The conflict is between the need to belong and the need to be true to yourself. \n\nAs a child who has been rejected by society, or on a lower scale, by his/her peers; a child who does not fit in this society, and cannot move away, you'd want to change yourself. This works if you're close to what is expected of you... but if you're very different, it feels unnatural. You try and try, but the habits, the values, just don't settle. \n\nI keep on lying to myself, and to the rest of society, who am I really? I know that this is not who I am, but you don't. If I told you that this is not who I really am, would you not like me anymore? If you think the real me is (a dangerous person?), would you be scared? I feel like everyone around me is being true to themselves, and I'm the only one with the problem, that perhaps something is wrong with me. \n\nI only have a candle to guide me; in this dark place, I don't know which way to go. Should I find myself? Should I find my way out? I'm losing myself, I don't know who I really am. This lie that I've been acting out all this time, is growing stronger, that it's becoming the real me. I've turned into this lie... and I don't want to. \n\nCan I ever find the right thing to do? If I show you all who I really am, will you all hate me? Do I have to run and hide? I never said that I wanted this, I just wanted to be myself and fit in at the same time. But now there's a problem, and it won't leave me. \n\nWill you leave me if I tell you who I really am? Would you be scared of me if I'm not who you think I am? I get the feeling that everything around me is normal, and I'm the only one with this problem.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nIt's about a person who discovers that he's turned into someone or something he's not because of something he said or did or failed to say or do, and he wants to escape it. I know it because I feel like I am turning into a monster every time I start yelling at people.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis definitely has everything to do with mental illness.\r\nTake it from someone whose taken so much verbal and emotional abuse as a kid and then years later, diagnosed with severe anxiety.\n\r\nIt almost to the point where I feel like im going crazy or in this instance, turning into a \"monster\" something other than myself.\r\nAnxiety is no joke and people who take it lightly or as someone's is just paranoid or worried, that they need to calm down, no.. It goes deeper than that. \r\nExtremely deep.\n\r\nI get so frustrated with my anxiety and I feel as if its taken over everything in my life. \r\nMakes me hesitant to do alot of things and tasks, that a \"normal\" person would see as \"not a big deal.\"\n\r\nFinding someone to accept you for a mental illness (anxiety) can be beyond challenging.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI am a very honest person, and as we all know, the truth can be brutal. Sometimes it hurts to hear the truth. If I'm comfortable around someone then I'm not afraid of saying my opinion, even if it's a strong opinion. I can sound very rude with what I say, which I assume is why I don't really have any friends. My mom keeps telling me to think twice before I speak, but what she doesn't seem to understand is that I do and I can't help it, the words just comes out. Before I meet some of my boyfriends friends or relatives, he always says \"be nice\". It's like he thinks that I am not capable of being nice to people.\n\nMy dad is a lot like me. Well, correction, I'm a lot like him. But he lives like 6h away from me, so I don't get to be with him so much. Last week I was, and It was amazing. I was finally with someone who actually understood me, and my way of thinking. Someone who understood that I didn't mean to be mean with what I said whenever I said something that might sound mean/rude. \n\nI feel like this song could be a little about that. Being yourself and wanting to fit in with other people (friends and family), feeling like everyone else is looking at you like you're the bad guy (the monster) because you tell the truth no matter how brutal it might be. Feeling like the fantasy life you have is way better then the life you actually have. \n\nSorry if it doesn't make much sense, I'm not so good with putting words together so they make sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nAnyone who's watched Fringe by J.J Abrams would totally understand this: Season six when Walter gets his brain tissue fixed and then wants to get it removed but no one is letting him, and he's slowly losing love for those around him.  It'd also apply to when peter uses the Observer tech... sorry for the rant, but anyone whos watched Fringe would be get it\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nIf anybody has watched Arrow, it seems like this song would be playing at the end of season 1.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThe song is about someone who simply doesn't fit in with most. The lyrics 'if I told you what I was, would you turn your back on me? And if I seemed dangerous, would you be scared?' states how he's afraid that if someone were to discover his reputation, they would neglect him like everyone else.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis could also apply to Darren Shan from Cirque du Freak when he became an assistant to Larten Crepsley, a vampire. He and Steve Leonard (\"Leopard\" as he's also known as) went to see this freak show where they saw this vampire. Steve noticed that he saw Larten in a book and wanted to become a vampire. Larten said that his blood was evil so he couldn't become a vampire. Darren then steals Madam Octa, Larten's pet spider who is poisonous. He shows Steve her, Steve freaks out and says \"You stole a vampire's spider? Do you know how much trouble you're in?\" Madam Octa then bites Steve and paralyzes him. Darren fears that he will be accused of murder and go to jail. His family rushes Steve to the hospital and his parents call Steve's mother. Larten finds that Darren has stolen his spider and comes for him. Larten promises to find an antidote for his spider's poison, and then Steve comes out of his coma. Larten then tells Darren that in order to save Steve's life, he would have to become a half-human, half-vampire creature. To do this, Darren fakes his \"death\" by having Larten break his neck and throw him out a window. Now, Darren isn't used to the idea of drinking human blood and thinks he's turning into a monster. This could have been on the soundtrack to the movie \"Cirque du Freak: The Vampire's Assistant\" if the song had been written then.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nDarren might also ask Debbie this in case she believes all the myths we're told about vampires (garlic and crosses get rid of them, they kill when they drink from humans) and he asks her if she would turn her back on him if he has to keep his vampire side secret so her family won't think too harshly of him.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis is basically about accepting yourself even if others don't. But when all you know is being the outcast you begin to think your a monster. The monster could be a metaphor for strong emotions of hate that he harbours for humans so he feels he's not human.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI have both a short story and my own meaning here.\nToday I was at lunch and was listening to various songs by Bastille and Imagine Dragons when I clicked on a lyric video to this song. I've heard it 50+ times and never once did i actually look at them. I used to think that this song had only a little meaning and no story behind it, but reading the words i realized that this song did have a story. My Life Story. This is a mix of my personal meaning and a general one.\n\nEver since I could remember\nEverything inside of me\nJust wanted to fit in\n(I was always a weird kid, and if any of you have read my post on Odd One by Sick Puppies I think I make that pretty clear. But my point here is I spent a whole section of my early life trying to fit and be \"normal\" but it never worked.)\n\nI was never one for pretenders\nEverything I tried to be\nJust wouldn't settle in\n(I really think that most people miss interpreter these. The \"Pretenders\" isn't a Ex-Girlfriend, or fake friends. I think he's talking about himself. In that context the first line here is saying \"I don't like trying to be something that isn't me\" and the second is \"It just never feels right.\" The third is saying that 'whatever he's pretending the be' just doesn't and never has felt right. I used to know this feeling so well.)\n\nIf I told you what I was\nWould you turn your back on me?\nAnd if I seem dangerous\nWould you be scared?\n(This is him thinking about someone he either likes, wants to tell his secret, or just the first person who wants to know him. (Maybe he's really taking to said person but I doubt it from my personal experience.) He wants to knew if the person would want to be his friend if they knew all his secrets. He wants to tell them but is too worried they wouldn't want to know him anymore, so he just thinks about it. Trying to get the courage. I've both seen and done this before, and it saddens me to even think about.)\n\nI get the feeling just because\nEverything I touch isn't dark enough\nIf this problem lies in me\n(The first 2 lines are loose so I have no solid meaning. What is the \"Feeling\". The fear of rejection in the last four lines? The feeling of Rejection itself? Or is he referring to the next line/lines? The next line could be implying depression, or he ruins anything he tries? He could be saying he think that he's such a bad person that he? I really don't know. But the third is self explanatory, 'is he the problem?' But when added to the last two lines it is more 'I can't do anything right, am I the problem.\" Like I said though, No solid meaning.)\n\nI'm only a man with a candle to guide me\nI'm taking a stand to escape what's inside me\n(This is interesting, the first line is a feeling of unknown, 'what to do?', and 'I'm lost', but the second is a complete 180 on the whole song, saying \"I'll fight because that's not who I want to be.\" I think this is saying \"I don't know what to do but I want to change who I am.\")\n\nA monster, a monster\nI've turned into a monster\nA monster, a monster\nAnd it keeps getting stronger\n(This confirms the he at least thinks he's a bad person, but not why. Maybe he hates pretending to be someone he's not? Maybe he's so concerned that he's \"Dangerous\" be cause he has seriously hurt or killed somebody? But this could just be as simple as he's afraid he'll break a girls heart. This fact can be taking as you wish because their are no specifics. But why he thinks himself a bad person is what really makes the meaning of this song. And since you can decide that yourself this is really a 'Choose your own meaning' song. For me and my life, it's that I'm not good with people skills, and my compliments usually end up angering or confusing people. The one relationship I had failed because I can't say the right thing.)\n\nCan I clear my conscience,\nIf I'm different from the rest\nDo I have to run and hide?\n(This is straight forward. It melts down to, \"Can I be OK with myself without fitting in.\" I myself have forgive myself and stopped caring about other peoples opinions. I don't try to fit in. But for a long while I hated being different and avoided talking to anyone. I'd transferred school in their somewhere and didn't let myself make any friends for 2 whole months.)\n\nI never said that I want this\nThis burden came to me\nAnd it's made it's home inside\n(Once again, simple. \"I don't want this. I didn't ask for this. Now it's something I'll have to live with forever.\" Those are words I once used to describe my own problem. I like how the lack of details lets you make your own interpretations, but this one is better then the last because you can project yourself here and it won't change the meaning of the song. But that may not make sense to anyone expect me.)\n\nIf I told you what I was\nWould you turn your back on me?\nAnd if I seem dangerous\nWould you be scared?\nI get the feeling just because\nEverything I touch isn't dark enough\nIf this problem lies in me\n(This is just a repeat to emphasize that this song is about wanting to tell all this to someone, or maybe anyone. But I still think the true meaning is what you make of it.)\n\nI'm only a man with a chamber who's got me\nI'm taking a stand to escape what's inside me\n(This part sounds the same as the part with the candle but the first line has a mostly different meaning. Instead of \"I can't see\", this first line says \"I'm trapped.\" The second line doesn't change meanings. So it's saying \"I need to get out of this. I have to change.\")\n\nAnd the rest is all repeats to say something like \"This is who I am and I'm gonna change that.\"\n\nSo the abbreviated meanings are \"I never fit in. No matter how hard I tried. I always though it was my fault. I'm a horrible person. I hate myself. I found I have a problem. Can I live with that? What should I do? I want to change. Can you still love/be friends with me?\"\n\nSo with everything i have here. It's a person wanting to change themselves for someone(s) else, or trying to explain why they are who they are. \nBut for the 3rd time this song complete lack of detail makes it whatever you make it. It certainly sounds like someone with a mental disorder. But more emotional and mental then nitsemc's comment, and I really like the first sentence of crystallia's comment. But like BetterThanYuu said, \"The thing about songs is that people can relate to them with their different experiences.\" I find different meanings then the most of songmeanings.com, so maybe I'm just crazy or maybe \"A Monster\"\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nIt's about siris coming to terms with everything he did as Ausar the Vile\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nIf you have NOT read all of the books in the maze runner series, do not read this. I feel like this song describes newt and what his thoughts are like while he has the flare.  The flare is practically a monster that eats away his brain. And the flare just keeps getting stronger, so it may have something to do with that. When they make the death cure movie and they use this song, I called it. \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nPeople are using the word monster to describe a lot of things about their personality. I think that this song is about anxiety. The singer knows all the stereotypes about his problem. The moment he'll tell someone about the way the shadows moves or how only a simple sound he can't recognize freaks hin out, his whole life will be destroyed. He has to ask himself \"will this monster get stronger? can it take over me? can I stop being aware of it and she'll do everything she wants?\". He doesn't know what to do so he uses a \"candle\"-research to light his way so he can undersstand what to do. Obviously, the candle just makes him much more anxious.At the end, he just ignores it when he let's it stay.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nWhen I listen to this song, what comes to my mind is someone who's struggling with their sexuality. They're scared that if they show who they truly are, they won't be accepted.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nfor me it reminds me about how I feel about telling my friends about my depression... like im a monster and they will be scared of me and not accept me..\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nHere's my interpretation: \n\r\nEver since I could remember\r\nEverything inside of me\r\nJust wanted to fit in (oh oh oh oh)\n\r\n(He always stood out for a reason we can't be sure of ever since he was little and all he wanted to do was be like the rest of his peers)\n\r\nI was never one for pretenders\r\nEverything I tried to be\r\nJust wouldn't settle in (oh oh oh oh)\n\r\n(He tried to manipulate himself to be like them more and change his personality but it \"wouldn't settle in\", it didn't fit him)\n\r\nIf I told you what I was\r\nWould you turn your back on me?\n\r\n(He's different from them and he's scared that if he tells them exactly how he's like and what he is, they wouldn't like him anymore) \n\r\nAnd if I seem dangerous\r\nWould you be scared?\n\r\n(Self explanatory) \n\r\nI get the feeling just because\r\nEverything I touch isn't dark enough\r\nIf this problem lies in me\n\r\n(He feels that wherever he goes he ruins it more even if it is already pretty ruined, it's \"not dark enough\"... he's sick of always seeming to make things worse) \n\r\nI'm only a man with a candle to guide me\n\r\n(This to me has two meanings: first of all, a candle only has limited light and it can only let you see a couple feet around you, you cannot see everything. A candle can only show you where you're going and the rest of the world is in the dark and you can't see it. Bad source of guidance. Secondly, a candle is made of wax and eventually the wax melts. Candles only have a fixed certain amount of time that they're useful. When it's gone then it's gone and you won't be able to use it as light anymore.)\n\r\nI'm taking a stand to escape what's inside me\n\r\n(He thinks it's time that he finally tries to do something about the thing he's become) \n\r\nA monster, a monster\r\nI've turned into a monster\r\nA monster, a monster\r\nAnd it keeps getting stronger\n\r\n(Self explanatory)\n\r\nCan I clear my conscience,\r\nIf I'm different from the rest\r\nDo I have to run and hide? (oh oh oh oh)\r\nI never said that I want this\r\nThis burden came to me\r\nAnd it's made it's home inside (oh oh oh oh)\n\r\n(Self explanatory but I do want to add that the burden making its home inside implicated that its tough to get it out)\n\r\n Overall this song is about a very conflicted man, we don't really know the reason but we do know that all this is happening inside him and it sets him apart, and he knows the consequences of everything but he still tries to belong. I think he's scared to be himself because everyone around him will hate him, and he also doesn't want to destroy anyone. However this is difficult for him because he wants to be with people but he doesn't want to destroy those people. \t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI often link this song to sexuality. I myself am bisexual and the opinion of others tend to make me feel like I'm abnormal. The singer is trying to suppress his desire for the same sex or whatever it is he desires.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nMy Opinion on this song is one that not everyone is going to aghree with me on. My opinion is he's talking about becoming a person who he knows isn't who he truly is that he's not supposed to be the way he is at that moment in time and i think he's talking about christianity and becoming a christian or wanting to become one  especially when he says \"Can I clear my conscience, if i'm different than the rest?\" And then he talks about this thing has made its home inside of him and i think he's reffering to darkness and how it takes over you and changes you into someone you aren't and \"Can i clear my conscience, if i'm different from the rest\" could also mean that he's asking if since he didn't realise this isn't who he truly is as a person the same way as other people do/did can he still be saved. also to back up this theory i have his next song or another one of his songs is \"Believer\" whoch talks about him becoming a Believer in someone or something and him spreading a message to the crowds of people and i think he's meaning he's sharing the story of how he became a Christian or Is becoming one and how he wished at one time that the feleings of wanting to be a christian and wanting to be who he's supposed to be would go away but they wouldn't. Like i said this is just my opinion on the song and i could be completely wrong but this is just MY opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI think that the song is about mental illnesses, and how if someone has an evident one, they most likely wonâ\u0080\u0099t fit in very well(socially). As a person gets older, the mental illness could get worse as they lose hope, and donâ\u0080\u0099t want to fight it any more so they are turning into a â\u0080\u009cmonsterâ\u0080\u009d that â\u0080\u009ckeeps getting strongerâ\u0080\u009d. It could also be about a drug addiction or alcoholism that was born from never fitting in and being a social outcast.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nAnytime you are listening to them you have to remember he comes from a very religious (Mormon I believe) family and they do not approve of his genre of music.  Coming from a religious background myself, I hear bible references in most of his songs.  Your regular joe-blow singer off the street wouldnâ\u0080\u0099t say stuff like \"this is my kingdom come, this is my kingdom come\" and \"water to wine and the finest of sands\" and \"on the mouth of the river...live the life of the faithful one\" and so on and so on, etc etc.  You get the point.\n\nThese are all bible situations and references.  If you have been versed in the bible you will get these references right away.  \n\nIt's well known his family (especially his mom) have been resistant to him being a rock star.  So when I hear the monster song, I hear a lot of what ppl are posting here -- torn about being yourself.  And what is inside of him he's been told his whole life that it is not okay.  Being a rock star is a \"monster\" but he can't help it, he just wants to make music.\n\nSo there's my 2 cents lol.  Listen a little closer to the lyrics and you will find all the religious undertones â\u0080\u0093 they are everywhere!  And they make his music and lyrics that more interesting than most.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThe song was written for the 3rd installment of the game infinity blade. If you play the games and read the books, you understand refers to the main character of the game Siris. \n\r\nSiris is a warrior who has been trained his whole life to defeat certain enemies known as the deathless. During the course of the game Siris discovers that he himself is a deathless and was once a vile warlord known as Ausar. \n\r\nSo this song explains the internal conflict in his mind wondering if he is a monster cause he is one of the enemy whom he has spent his whole life training to kill. He just never knew it. Monster here refers to Sirisâ\u0080\u0099 identity before he lost his memory as the vile warlord Ausar.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nHaving sociopathic tendencies fits quite well. Not being a sociopath mind you. But tendencies.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song perfectly describes how a mentally ill person feels like. Dan Reynolds suffered with depression... I am sure that is how one feels like when in depression or terminal mental illness. I know because this is how I feel.\t\t\t\t\n\t\t\t\t\n\n"}