{"comment_0": "\nThis song represents a very classic drama, that of people who leave home, which is typically a small place, to search for fame, fortune and happiness in bigger places, to never be able to return or ever feel at home anywhere. Holly herself is a tragic character, so beautiful and glamorous, surrounded by reach people and celebrities, drifting in and out of her life, always fascinated with her, never loving her. In the book she actually doesn't end up with the poor writer, they are just friends and she sends him a postcard from buenos aires one day, so basically she keeps drifting in these strange circles to never find home again. \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nOk so... Henry Mancini wrote the music... Johnny Mercer wrote the lyrics... and many people including Audrey Hepburn in Breakfast at Tiffany's, Louis Armstrong, and Frank Sinatra sang it... Now that that's settled... I absolutely love this song and the movie of course... I like the version in the movie the best just because Hepburn has such a pretty soft voice but it's just a beautiful song in general and it definitely makes me cry too...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni loved when Audrey Hepburn sung this in Breakfast at Tiffany's, how amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nMy favorite song when I was about nine years old - nearly 40 yeas ago! - and still absolutely beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nyay for breakfast at tiffany's\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ni love this song! and i thought audrey hepburn sang it beautifully in Breakfast at Tiffanys \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ndo you know there was a critic who said that the film would be a lot better if they got rid of \"that damn song\"? well, it just so happens that \"that damn song\" is right on this page. the critic? well...\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI'm crossing you in style\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI love Audrey Hepburn singing it! It's ironic because my mom loved Audrey Hepburn and she named me after her, and I totally love Audrey too!!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nLyrics correction:\r\n\"Oh, dream maker\" should be\r\n\"Old dream maker\".\n\r\nAlso, I don't get the exclamation mark at the end, but that's a matter of taste I guess.\n\r\nBeautiful lyrics, so you gotta be careful with them!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI'm a Gen Y (28 yrs old) and yet I'm deeply touched with this song. \r\nI wish there are more music like this, today's music scene is so superficial, which is sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI gather every possible artists that sing this song from Frank Sinatra to scene from movie on my own website dancecase.com/…  check thet : )\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI found a gorgeous version of this standard sung by Aoi Teshima.  It's a vocal + guitar arrangement and it's very lovely <3\n\nyoutube.com/…\n\n\n", "comment_13": "\nThis song made me cry.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis actually isn't by Frank Sinatra. It's by Henry Mancini, along with the rest of the Breakfast at Tiffany's soundtrack.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song is so special to me.This song is me and my Mom's song since I have been a little girl.And I always knew the song and the sort of the lyrics but now when I hear it its sort makes more sense to me;Because my Mom was a single Mother ANd now I am a single mom and it seems to be fit in well with me and my son also.When the world is against us we are together crossing the river in style...where ever we is going I am going the same way two driffters off to see the world....its an amazing song doenst matter who sings it....\t\t\t\t\n\t\t\t\t\n\n"}