{"comment_0": "\nTo me this song is about a girl who has gotten out of a tough relationship.\n\r\nThen she met a guy, who was in the same position as her, but through meeting the girl, he ralized that what he had before was great.\n\r\nAnd the guy leaves her to go back to the original girl and the girl who is singing the song basically is critizing both herself and the guy.\n\r\nOr at least that's how I see it.\n\r\nIts kind of like a song where you never feel good enough to have that something special.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI was wishing someone else would have wrote something about this song cuz i'd really like to know what everyone else thinks!\r\nThis song is EXACTLY what just happened to me.. well the way that i interpreted it.\r\nI started dating this guy who had just gotten outta a serious relationship and was still talking to her kinda and i had been hurt really bad in the past and we dated for about a month and everything was going fine and then he decided to get back together with his ex gf.. \r\nDoes anyone else interpret it that way?\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think for me this song represents the side of the other woman in an affair that went bad.\r\n\"Guess I should have been More like her\" is in reference to the wife in this song. She believes if she had those qualities the wife has that he would have stayed.\r\n\"You took a chance on a bruised and beaten heart, and then you realized you wanted what you had\"\r\nI think the man in this song played both sides of the fence. The other woman knowing about the wife, while the wife was unaware. When the guy gets caught he chose the woman he had been with all along. \r\n\"I should have held on to my pride, I should have never let you lie\" I think here she's saying that she should have believed in her intuition that he was lying about how his marriage really was and she let him fill her head with lies about a future together. \r\n\" forgiving you, she's stronger than I am.\" And  \"It's plain to see, desperation showed it's truth, you love her, she loves you with all she has\" when it came down to the affair and all the lies, she learns it was never a question of him leaving his wife because that was never his intention and the wife forgives him for the affair but the other woman can not get past what he's done to her.\n\r\nThat's how I see this song. As a scorned lover who realizes the guy she thought was going to choose her in the end is really a douche bag who never deserved her in the first place!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nMaybe she is speaking from the wife's perspective....maybe her husband cheated on her and when she realized it, took him back, and as they were trying to rebuild their marriage, he (unfortunately) realized he \"wanted what he had\".  So he leaves to go back to her. Therefore, she wishes she was more like her.\n\r\nI was the \"wife\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nreally good song. gets right to your heart.\n\r\ni think this song is about a guy who already has a girlfriend but is cheating on her with another girl whom maybe he used to be with, so they already have history and once deeply cared about each other. the other girl obviously knows what he's doing is wrong, but she loves him so she's willing to do whatever with him. so their fling goes on for awhile and obviously his girlfriend doesn't find out, but then one day he just ends it and stops talking to her. of coarse she's upset about that because she really cares about him,\n\r\n\"I should have held on to my pride\r\nI should have never let you lie\"\n\r\nand now she thinks that she should have been more like his girlfriend and maybe he would've kept going.\n\n\r\ni'm not sure if that's right, but i also agree with lollipop.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nMy interpretation of this song is that he was dating a new girl and then went back to his ex.\n\r\nI've read that this song is especially personal to Miranda.  I sincerely hope she wasn't dating a man who was cheating on his girlfriend/wife.  I like her too much as a songwriter and singer to think she'd do something like that!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nthis song is one of my favorite songs, period.\r\nit related to my entire life a month ago.\r\nI was talking to a guy for over a year who kept on telling me I'll break up with my girlfriend over and over, but he never would and I was giving up and to me it means\r\nthat the \"other girl\" is wanting to be with him but she's realizing that he won't leave her.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI have always loved this song, but unfortunately recently I was in a situation just like this. It was heartbreaking, and this song has been on repeat since.\n\r\nI interpret the song as a guy who is in a serious relationship with someone, yet he has another woman. This woman is the one singing the song. He eventually breaks up with his girlfriend, and chooses to finally be with the other woman. After awhile, he realizes he wants what he had, and leaves her. The other woman is heartbroken and thinks that if she had only been better, more like his last girlfriend, she could have still had him.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI do agree that this song could be about a guy dating a girl and realizing he wanted what he has/had before. To me personally, however, it has a different meaning. To me, the two girls are the same person. My boyfriend and I broke up about a week ago because of many reasons, but one reason is that we have both changed and he wants the girl I was when we started going out a year and a half ago. \r\n\"You had it all for a pretty little while\r\nAnd somehow you made me smile when i was sad\"\r\nHe liked me independent and able to handle my own problems and do everything on my own, but then I got used to him being there for me and was probably too dependent on him for everything. Then he realized he liked me better the way I was, not the way I am now. We're currently on a break but planning on getting back together.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthe first time i heard this song it was a profile song of a girl that my boyfriend had had a fling with while we were broken up.\r\nand i kind of interpreted it like this:\r\nthe girl singing the song had a fling with a guy who was on a break with his girlfriend and she knows what she did was wrong and she regrets it because she know that he will never have any respect for her again.  and the guy and his exgirlfriend get back together which makes the girl who had the fling with him envious of the way the his girlfriend carries herself, or in the songs words \"She's beautiful in her simple little way\r\nShe don't have too much to say when she gets mad\r\nShe understands she don't let go of anything\r\nEven when the pain gets really bad\r\nGuess I should've been more like that\".  and the fling regrets everything...saying yes to the boy, helping him lie, allowing him to hurt his ex, and the fact that the girl the boy was dating will never forgive the girl he had the fling with but she's forgiven him.\r\nand i think that the boy and the girlfriend don't stay together because of this lyric \"I guess you got what you deserverd\" and in the end, the girlfriend walks away with her pride, the fling is envy of the girlfriend, and the boy loses everything.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI'm not real sure of the exact meaning, but I can remember 2 times in particular that I felt like I should've been more like her... and the 1st time it was my husband, but the more I think about that situation... I really wouldn't want to be more like her... I have an outgoing personality, many friends, and believe that beauty is only skin deep... she is nothing like me, so maybe his desire was for something totally different. The second time, I really shouldn't count due to the fact of there was NO 1 woman... there were many, I guess I just wasn't like all of them instead of just like her. \n\r\nAnyway, I love this song, but for me... I wanna be me, I have no desire to be like anyone else... God made me exactly the way he wanted me to be and if that is not good enough for a man, well, he'll have to find someone more like her.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nIâ\u0080\u0099ve been visiting this site now for years to read peoples opinions about the deeper meaning of songs and I have never felt strongly enough to actually sign up and express my opinion-  HOWEVER, I feel I owe it to the girls of the world to share my view of this song.\n\r\nI think the deeper meaning of this song is about being a strong woman.  One who respects herself and will not settle/put up with betrayal from the man she loves.\n\r\nâ\u0080\u009cShe's beautiful in her simple little wayâ\u0080\u009d â\u0080\u0093 She is not a supermodel, but pretty for effortless reasons.\n\r\nâ\u0080\u009cShe don't have too much to say when she gets madâ\u0080\u009d â\u0080\u0093 She wonâ\u0080\u0099t argue with her man in such a situation bc he IS DEAD WRONG and they both know this.\n\r\nâ\u0080\u009cShe understands she don't let go of anythingâ\u0080\u009d \r\nEven when the pain gets really badâ\u0080\u009dâ\u0080\u0093 Girls are often convinced of their guys silly excuses and will forgive them bc they love them and want to move on from the pain and forget about it all.  Also bc guys who cheat try to manipulate woman and she wonâ\u0080\u0099t let him do this to her.\n\r\nâ\u0080\u009cGuess I should've been more like thatâ\u0080\u009d â\u0080\u0093 When you let a guy get away with cheating once, why wouldnâ\u0080\u0099t he do it again? (thatâ\u0080\u0099s just a comment, not set in stone)  Even if neither one of you are able to admit it, there is a loss of respect in this relationship after this occurs.\n\r\nâ\u0080\u009cYou had it all for a pretty little whileâ\u0080\u009d â\u0080\u0093He was able to get away with being with 2 women at the same time.\n\r\nâ\u0080\u009cAnd some how you made me smile when I was sadâ\u0080\u009d- The other girl liked his attention and maybe the thrill of having another womanâ\u0080\u0099s man\n\r\nâ\u0080\u009cYou took a chance on a bruised and beaten heartâ\u0080\u009d â\u0080\u0093 The other girl made him feel â\u0080\u009cneededâ\u0080\u009d. Everyone likes to help people, it makes us feel good.\n\r\nâ\u0080\u009cThen you realized you wanted what you hadâ\u0080\u009d â\u0080\u0093 His main woman found out and obviously didnâ\u0080\u0099t put up with it.  But bc she was so strong and demanded respect from him, these qualities made him want her back.\n\r\nI guess I should've been more like thatâ\u0080\u009d â\u0080\u0093 Now since the other woman is losing him, shes feels as if she had been stronger and demanding of his respect- maybe she would have gotten him to really love her.\n\r\nâ\u0080\u009cI should have held on to my pride\r\nI should have never let you lie\r\nI guess you got what you deserved\r\nI guess I should've been more like herâ\u0080\u009d  \n\r\nSelf explanatory- The other woman is left without her pride, feels dumb for being used, feels remorse for the guy bc she sees how he yearned for the other girl, but he deserves to be alone for what he did, and again if she had been strong she wouldnâ\u0080\u0099t be feeling so small.\n\n\r\nâ\u0080\u009cForgiving you, she's stronger than I amâ\u0080\u009d â\u0080\u0093The girl stood her ground and wouldnâ\u0080\u0099t forgive without a fight!\n\r\nâ\u0080\u009cYou don't look much like a man from where I'm atâ\u0080\u009d â\u0080\u0093 He cheated, now heâ\u0080\u0099s begging for her to love him again.\n\r\nâ\u0080\u009cIt's plain to see desperation showed it's truth\r\nYou love her and she loves you with all she hasâ\u0080\u009d â\u0080\u0093He was so desperate to get his girl back, he fought for her, begged her, (whatever he did).  But she made him work really hard to prove his love for her. And their love for one another is obvious to others because he did whatever he had to do to get back with her, and she loved him too much to let him lie to her and treat her badly because she knew their love would be ruined if she was a weak woman and believed and forgave his lies.\n\r\nâ\u0080\u009cI guess I should've been more like thatâ\u0080\u009d\n\r\nGIRLS, be strong! Donâ\u0080\u0099t let men use you!  And yes they sometimes make mistakes (they are humans, and MEN for that matter) but if you really love him and he loves you, you need to handle the situation in a manner that will teach him a lesson and open his eyes.\n\r\nAnd for the â\u0080\u009cother girlâ\u0080\u009d, when youâ\u0080\u0099re disrespectful of others, you will have a hard time gaining respect from anyone.\n\n\n", "comment_12": "\ni love this song. and unfortunately, i have been on both sides of the 'fling'. the first time i was the fling. i know it was a huge mistake, but it was a freshman year accident. i have definitely learned better. and the second time i wasnt actually seeing anyone, but was unbearably jealous of someone who my crush was interested in. she was beautiful and perfect in every way, or so it seemed. well, she used him and after several years he realized she was not right for him, and got with me. for a little over a month, everything was perfect. i think it was like mizliz860509 said. he liked me being more independent and carefree before we started dating. it was short but painful, because i had liked him for so long. i am actually still working on getting over it. he was perfect to me, and in my mind i didnt even hold a candle to the other girls who seem to be perfect just like him. stay strong ladies and dont let men use you! you a smarter than that [and them for that fact haha jk] and we deserve better!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song confused me when I first heard it because the verses conflict with the chorus. Then, on a second-run, I realized that there is a tone of sarcasm in the song. She's describing the other girl as basically being a push-over, and Miranda is saying, sarcastically, \"well I guess I should have been more like that\". This \"man\" (read: immature boy) needs a girl who will put up with his crap.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nGuy and Girl. They date up, or maybe they don't, but they have a rough patch. \r\nGuy has a fling with Girl2 [the one who's singing]\r\nAnd then the guy and the girl get back together. And the girl forgives the guy. And girl2 wishes she could be as forgiving/strong as the original girl is. More like her. \n\r\nThat's my interpertation. \r\nThis song is so, ... , perfect. <3\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song was written by Miranda from the perspective of her boyfriend Blake Shelton's ex-wife.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI think it is about, A guy, who just took a break from his girlfriend\r\n& another girl meets that same guy and they start to like eachother.\r\nbut one day outta nowhere, he starts dating his ex and leaves the other girl behind.\n\r\nbecause of the quotes in the song\r\n\"You took a chance on a bruised and beaten heart\r\nThen you realized you wanted what you had\"\r\nshe is saying that you said all the right stuff\r\nthen you thought he had alot of feelings and he was gonna date you\r\nbut then he turned his back on you.\n\r\nand the other\r\n\"It's plain to see desperation showed it's truth\r\nYou love her and she loves you with all she has\"\r\nwhen they started dating again, you can tell they were happy.\r\nand you were hiding your emotions from him, saying your fine, \r\nits a silly little thing, just go and be happy.\n\r\nthis is the exact situation im going through, and its not easy.\r\nhe is still with his girlfriend and im turning down everyone else and waiting on him.\r\ni broke up with my boyfriend for him. and then he goes and turns around to her again.\r\nso i hope yalll understand. thanks, tatorbean\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI believe she was in love and ended it, he found someone new that he's in love with, She was strong and beautiful, and the girl felt like she should have understood more and related more to his problems and never gave up. This is also the same thing I'm going through and have for about a year now. This boy has my heart and I try giving him everything,but it wasnt enough anymore, and after all this other girl puts him through, he goes back to her. Little does she know he calls every once in a while and cries to me and wants to work things out when he's high, then he sobers up and wont give me the chance of time\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nto me, I interpret this song very sarcastically. I think she was with a guy who went back to his ex, and she's mocking the other girl. \"I guess you got what you deserverd\", saying the other girl is all he deserves.\n\n\r\n\"Forgiving you, she's stronger than I am. You don't look much like a man from where I'm at. It's plain to see desperation showed it's truth, you love her and she loves you with all she has\"\r\nsaying they're both pathetic, and desperate and that he's basically a peice.\n\n\n\n", "comment_19": "\nAnyone else agree that alot of Miranda's songs seem like she's seeing a married guy or at least one that is attached in one way, shape or form?? Perhaps Blake? ;-)\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI was sitting in the car with my best friend and i realized this is her song. \n\r\nWe have been in this dumb love triangle for about a year now, and the guy is so sweet and really does care...for both her and myself. \n\n\r\nShe's beautiful in her simple little way\r\nShe don't have too much to say when she gets mad\r\nShe understands she don't let go of anything\r\nEven when the pain gets really bad\r\nGuess I should've been more like that\n\r\nMy friend is very simple doesn't try to hard, but she is so beautiful \r\nShe is so mellow and calm she never seams angry or hurt no one can see it. \r\nShe has sat and taken so much from this guy, but she wont walk away. \r\nand i know it kills her when he cuddles with me....\r\nbut the thing is he says he loves me, but loves her more\n\n\r\nidk everything is so complicated\n\n\n\n", "comment_21": "\nI love this song, about a year and a half ago my dad cheated on my mom and they got divorced and when I heard this song it reminded me of what my mom was going through not because she needed to be like the woman he is now with but just how she can't forgive him and other parts of the lyrics. Great Song!\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI've read a lot of the comment here, and I have to agree with those who say that the song is written from the point of view of the \"other woman\" singing about a man who cheated but ultimately decided to stay with his girlfriend.\n\r\nThe lines \"She don't let go of anything, Even when the pain gets really bad,\" makes me think that the girlfriend never \"let go\" of the man, that they were not broken up.  The line \"You had it all for a pretty little while,\" also indicates that he was probably seeing both women at the same time, and \"I should have never let you lie,\" indicates to me that the other woman knew that the man was still with his girlfriend, she knew that he was lying, both to the girlfriend by seeing someone behind her back and probably to the other woman by telling her that he would eventually leave his girlfriend.\n\r\nHowever, I can see how the argument could be made that the man and his girlfriend were either broken up or on a break because of the the line \"Then you realized you wanted what you had,\" since \"had\" is in the past tense, but that entire part of the song is in the past tense, so it wouldn't have made sense to say \"Then you realized you wanted what you have.\"\n\r\nI still have a great deal of respect for Miranda Lambert as a strong woman and an artist, but I think that if this song was autobiographical, she was someone's \"other woman\" for a time.  However, most artists take a great deal of liberty when they create, so it's possible that she was only in a similar situation to the woman in the song, not an identical situation.\n\n\n\n", "comment_23": "\nSee this is why I hate cheaters. When they cheat they make one girl feel like shit and wish she was prettier, had a better personality, and wish they were like the other girl.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nMy take is totally different.  What if she (the one singing) was involved with another woman that decided to chose a man over her. Maybe decided that she wasn't gay after all......the love birds and the letter and the move sort of give that credence.\n\r\nThats my thoughts. Great song though.\n\n\n", "comment_25": "\nI agree with mysweetoctober.\n\r\nIn my eyes it discusses a guy who starts to lean towards this one girl, while she is obviously broken but it all seemed so perfect with him but he still does have a girlfriend. But soon this happens \"Then you realized you wanted what you had\". So he decides he wants to end this relationship with this girl who he's had past with, and she obviously has deep feelings for and continue the one with his girlfriend.\n\r\nReally liking this guy she lets him just leave her and lets him continue to lie to his girlfriend about the entire situation.\n\r\nAnd as she looks back on it she wishes that she would've stood up for herself more and than begins to wonder if she was more like his girlfriend, if he would've chosen her instead.\n\r\nThis is how i see it and maybe it's because I was in a relationship JUST like this. So when i heard the song for the first time I was estactic that I found something to connect with. I know how she feels.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThere was a devastating thing that happened to me and this is how I interpret the song. I was in an on and off relationship with a guy for 4 1/2 yrs and recently found out that he got married. He had been dating another girl for 8 yrs and we had no idea about each other. I loved this man soooo much, I thought he was going to marry me someday because that's what we talked about. After I found out, I told her what was going on and he supposedly finally told me the truth. At first, I felt like how come he chose her instead of me and then i realized that I lost less than her and him, they got married...so I had to be strong and let him go.\n\r\nShe's beautiful in her simple little way - I DONT KNOW THIS GIRL BUT IM SURE SHE'S HAS HER GOOD QUALITIES\r\nShe don't have too much to say when she gets mad - SHE SUBMISIVE AND IM NOT\r\nShe understands she don't let go of anything - SHE IS WILLING TO FORGIVE HIM THROUGH EVERYTHING THAT HE PUTS HER THROUGH\r\nEven when the pain gets really bad - SHE FORGIVES HIM NO MATTER WHAT AND HOW MUCH HE HURTS HER\r\nGuess I should've been more like that - IF I WAS MAYBE MORE LIKE THAT HE WOULD HAVE CHOSEN ME INSTEAD OF HER...BUT IM BETTER OFF\n\r\nYou had it all for a pretty little while - YOU HAD IT GREAT WITH 2 WOMEN AND NEITHER KNEW ABOUT EACH OTHER\r\nAnd somehow you made me smile when I was sad - HE WAS SUPPOSEDLY THE MAN OF MY DREAMS AND HE MADE ME SO HAPPY\r\nYou took a chance on a bruised and beaten heart â\u0080\u0094 THE OTHER GIRL AND I HAD BEEN HURT, SHE EVEN HAS A CHILD FROM ANOTHER MAN. \r\nThen you realized you wanted what you had â\u0080\u0094 HE REALIZED THAT HE LOVED HER (WELL HE LOVED HIMSELF MORE) AND HE TOLD ME THAT HE WASNâ\u0080\u0099T IN LOVE ME JUST TOLD ME WHAT I WANTED TO HEAR BC WE WERE FRIENDS BEFORE AND HE LOVED ME LIKE THAT.\r\nI guess I should've been more like that â\u0080\u0094 IF I WAS MAYBE MORE LIKE THAT HE WOULD HAVE CHOSEN ME INSTEAD OF HER...BUT IM BETTER OFF\n\r\nI should have held on to my pride â\u0080\u0094 I SHOULDNâ\u0080\u0099T HAVE TOLD HIM THAT I LOVE HIM AND CRIED IN FRONT OF HIM AFTER I FOUND OUT. HE ASKED FOR FORGIVENES AND TO SAY FRIENDS BUT I CANâ\u0080\u0099T!\r\nI should have never let you lie â\u0080\u0094 I SHOULD HAVE QUESTIONED HIM MORE WHEN I KNEW HE WAS LYING TO ME\r\nI guess you got what you deserved â\u0080\u0094 HE CAME LOOKING FOR ME 2 WEEKS LATER TO TELL ME WHAT HAPPENED TO HIM AND THAT HES MISERABLE BECAUSE SHE BRINGS IT UP A LOT AND AFTER FORGIVING HIM AT FIRST NOW SHEâ\u0080\u0099S NOT SURE IF SHE CAN. AND THAT HE LOVES US BOTH\r\nI guess I should've been more like her \n\r\nForgiving you, she's stronger than I am â\u0080\u0094 I DONâ\u0080\u0099T FORGIVE INFEDELITY, ITâ\u0080\u0099S NOT THE FIRST TIME I DEAL WITH THAT AND I DONâ\u0080\u0099T KNOW HOW SHE COULD FORGIVE HIM\r\nYou don't look much like a man from where I'm at â\u0080\u0094 AFTER HE CAME LOOKING FOR ME 2 WEEKS LATER, I TOLD HIM THAT HE WAS A PIECE OF CRAP. NOT THE TYPE OF MAN THAT DESERVES MY RESPECT\r\nIt's plain to see desperation showed it's truth â\u0080\u0094 HE ALWAYS GOT SICK AND LOOKED MISERABLE AND WHEN THE TRUTH WAS OUT HE ALMOST LOOKED RELIEVEDâ\u0080¦HE COULDNâ\u0080\u0099T KEEP UP THE LIE ANYMORE\r\nYou love her and she loves you with all she has â\u0080\u0094 THEY SUPPOSEDLY LOVE EACH OTHERâ\u0080¦THEY DIDN GET MARRIED\r\nI guess I should've been more like that â\u0080\u0094 I GUESS IF I WOULD HAVE BEEN MORE LIKE HER I WOULD PROBABLY BE IN HER SHOESâ\u0080¦SHEâ\u0080\u0099S MISERABLE AFTER 2 WEEKS OF MARRIAGE TO FIND OUT IT WAS A LIE\n\r\ni'm doing much better I really do feel like I got out of it the easiest...no need for divorce. I pray that God will bless me with a good man and I came out with a great leason...ALWAYS BE A STRONG WOMAN AND DON' TAKE ANY GUYS CRAP. \t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI'm gonna do the same thing as fullofhope, post a line by line interpretation of the lyrics as they apply to me. Why? Because I can.\n\r\nShe's beautiful in her simple little way - I mocked her looks because I was jealous, but really, she is beautiful.\r\nShe don't have too much to say when she gets mad - Don't know her.\r\nShe understands she don't let go of anything\r\nEven when the pain gets really bad - Even though she knows his history, she's willing to give him another chance because she knows he regrets it.\r\nGuess I should've been more like that - Yeah.\n\r\nYou had it all for a pretty little while - You had what seemed to me like the perfect life. You had everything I wanted.\r\nAnd somehow you made me smile when I was sad - I felt bad about myself and got put down, but you made me feel pretty.\r\nYou took a chance on a bruised and beaten heart â\u0080\u0094 I think you actually cared for a while.\r\nThen you realized you wanted what you had â\u0080\u0094 You realized you had what you wanted right there.\r\nI guess I should've been more like that â\u0080\u0094 Yep.\n\r\nI should have held on to my pride â\u0080\u0094 I shouldn't have done everything he wanted me to do, and said yes when I didn't feel ready.\r\nI should have never let you lie â\u0080\u0094 I should have called you on your stupid lies, then maybe you would have seen that I'm smarter than you think.\r\nI guess you got what you deserved â\u0080\u0094 You've changed and I can see it. Somehow, she's made you a better person and you deserve her. :)\r\nI guess I should've been more like her\n\r\nForgiving you, she's stronger than I am\r\nYou don't look much like a man from where I'm at â\u0080\u0094 After all your sleeping around, she's forgiven you and decided to trust you.\r\nIt's plain to see desperation showed it's truth\r\nYou love her and she loves you with all she has â\u0080\u0094 You guys clearly love each other.\r\nI guess I should've been more like that â\u0080\u0094 But if I had, I wouldn't have learned what I did. You and I weren't meant to be, and that's okay.\n\n\n\n", "comment_28": "\nI think this song can be interpreted in so many ways? Like he already has a g/f and is cheating or he went back to his old g/f and dumping a new girl? Or how I see it that he is still in love with his EX and maybe wishing she was more like his EX? That's just how I see things....\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthis song is great. miranda lambert is awesome, period, as a singer, songwriter, and a woman. but anyway, i'm starting to question the meaning. when i first heard it, i thought it was from the perspective of her being the one cheated on by this guy rather than her being the other woman, but now that i really look at the lyrics and read others' interpretation, it makes more since the other way. i'm just curious as to what the inspiration for this song was. definitely gotta google that one! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nShe's beautiful in her simple little way\r\nthe other girl's jealousy shows\n\r\nShe don't have too much to say when she gets mad\r\nthe other girl controls her anger and doesn't say anything in the heat of the moment\n\r\nShe understands\r\nthe other girl is an understanding/ non-judgmental person\n\r\nShe don't let go of anything even when the pain gets really bad\r\neven when the other girl is hurt she still stays around and doesn't just get rid of whatever is hurting her\n\r\nGuess I should've been more like that\r\ngirl singing is saying she should've had these qualities\n\r\nYou had it all for a pretty little while\r\nboth girls\n\r\nAnd some how you made me smile when I was sad\r\nknew she wasn't the only girl and it upset her but he still made her happy\n\r\nYou took a chance on a bruised and beaten heart\r\nhe tried a relationship with her though she wasn't easy to be with because of her hurts from the past\n\r\nThen you realized you wanted what you had\r\nit became too much for him and wanted an honest relationship with just one girl back\n\r\nI guess I should've been more like that\r\nonce again jealous and wishing she was like the other girl\n\r\nI should have held on to my pride\r\nshould have not accepted being second best\n\r\nI should have never let you lie\r\nprobably about his love for her or the other girl\n\r\nI guess you got what you deserved\r\nthe other girl (i dont think this is insulting to the other girl cause she seemed to want to be all the things that the other girl was)\n\r\nI guess I should've been more like her\r\n(same as before)\n\r\nForgiving you, she's stronger than I am\r\nthe other girl found out or he told her he was cheating but she forgave him anyway. and shes saying if she was in her place she would not have been able to do that\n\r\nYou don't look much like a man from where I'm at\r\nshes lost respect for him\n\r\nIt's plain to see desperation showed it's truth\r\nhe was desperate to get the other girl back it showed who he really cared for the most\n\r\nYou love her and she loves you with all she has\r\nsimply saying him and the other girl have a stronger love that she and him did not\n\r\nI guess I should've been more like that\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nIm not sure if she wrote this, about Her, Blake, and his ex wife. \r\nMaybe she did, i dont know, hahaXD\n\r\nBut it reminds me alot of things my friends have been through. I love this song<3\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI might be totally wrong about this, but here is my take on the song. \"More Like Her\" is about a girl whose boyfriend/husband/whatever has been envisioning the perfect woman and the girl has to live up to that vision.\n\r\n\"She's beautiful in her simple little way\" - The person you want me to be is beautiful.\r\n\"She don't have too much to say when she gets mad\" - She is tolerant and remains calm even when she's upset.\r\n\"She understands she don't let go of anything\r\nEven when the pain gets really bad\" - She is understanding to the extreme and continues to forgive when the pain eats her up inside.\r\n\"Guess I should've been more like that\" - I should have worked harder to have been what you wanted me to be.\n\r\n\"You had it all for a pretty little while\" - I was able to keep up the perfect pretense for some time.\r\n\"And somehow you made me smile when I was sad\" - And when I missed being me, your love made it worth it.\r\n\"You took a chance on a bruised and beaten heart\" â\u0080\u0094 I was hurt and lost when you found me.\r\n\"Then you realized you wanted what you had\" â\u0080\u0094 You realized you didn't want broken heart living up to a perfect image anymore and went back to a woman who was perfect enough without pretending.\r\n\"I guess I should've been more like that\" â\u0080\u0094 I should have tried harder to be what you wanted.\n\r\n\"I should have held on to my pride\" â\u0080\u0094 I know deep inside that I never should have wanted to be anyone other than me.\r\n\"I should have never let you lie\" â\u0080\u0094 I now know that I shouldn't have let you tell me who to be.\r\n\"I guess you got what you deserved\" â\u0080\u0094 You got a fake relationship to make your fake girl.\r\n\"I guess I should've been more like her\" - still I love you and I wish I had done a better job.\n\r\n\"Forgiving you, she's stronger than I am\" - The girl you want is stronger than I am; she would forgive you.\r\n\"You don't look much like a man from where I'm at\" â\u0080\u0094 I now see what you've done as cowardly.\r\n\"It's plain to see desperation showed it's truth\" - Your desperation for perfection finally showed you that I wasn't perfect.\r\n\"You love her and she loves you with all she has\" â\u0080\u0094 You love the girl in your imagination and she loves you back.\r\n\"I guess I should've been more like that\" â\u0080\u0094 Your imaginary girl loves you more than I can, but now it doesn't matter because I'm gone.\n\r\nThis one strikes a little close to home.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThis song explains exactly what I'm going through. I've liked my best friend for years, but about 2 years ago exactly, I turned him down when he tried to take his chance with me. I turned him down because I was still really hurt from a past relationship. Eventually, he started dating one of my best friends. Well, until this year when I told him how I felt and he dumped her for me because he said he'd always liked me, too. Anyway, every relationship I'd been in had hurt me so much. They cheat on me. Dump me for no reason. Stupid stuff. And I'm completely different from my (ex)friend. When I'm angry, I let it all out and I don't hold back. He would hide things from me, but when I'd ask about it, he'd say I was paranoid and that I needed to trust him. I didn't. It's hard to trust someone when everyone else you've trusted has let you down. When he would say something that hurt me, I'd let it go. I loved him, and I didn't like to cause fights over stupid stuff, so when it hurt, I just brushed it off. She is nothing like that. When she's mad, she'll say her piece of mind, but then she can easily let go of it. I can't. When she was hurt, she wasn't afraid to tell him. I was. He took his chance on me. I was that girl he thought he could fix. But I was too much for him, I guess. He realized with her, it was easier. Now to the chorus part. I let him walk all over me. That is not me keeping my pride. He knew he could do whatever he wanted, knowing I wouldn't say anything about it. He lied about hanging out with his ex. He lied about where he was. And I let him. I knew what he was doing, but I \"loved\" him. He broke up with me, and within two weeks they were back together. For that, I think she's strong. Stupid, but strong. She loved him enough to take him back after what he and I put her through. I could never forgive him for that, and he looks like a complete jerk. He doesn't look like the man I knew anymore. He'll never look the same to me. But I keep thinking.... If I was more like her.. I'd still have him.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nWhen Miranda and Blake first began to fall in love Blake was married. While Blake was going through his divorce Miranda was there for him for emotional support. As Miranda his back bone Im sure he told her many things that he loved about his wife and why he would still be with her or such. Miranda just seen as if she would have been more like his wife she would have a better chance with him.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\n\"She's beautiful in her simple little way\r\nShe don't have too much to say when she gets mad\r\nShe understands she don't let go of anything\r\nEven when the pain gets really bad\r\nGuess I should've been more like that\"\r\nThat paragraph alone sounds like he's having an affair, the \"She don't let go of anything\" sounds like he's cheating on his wife who won't divorce him when he tells her he's having an affair and he realizes he is really in love with his wife and he leaves his mistress. That's my interpretation anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nIn this song she is being sarcastic.. shes saying \"i guess you got what you deserve, i guess i shoulda been more like her\" \t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\n\n\n\n", "comment_38": "\nHere is my interpretation of this song: This woman is speaking about her ex and his new girlfriend. Referencing what she could of done or should of done to keep him but truthfully in her eyes she see's him as a less of a man and see's his ex basically as a doormat that put's up with his bad behavior. He would rather sacrifice a strong woman who stands their ground for someone who has little backbone to stand up for themselves. It lasted a little while with her, but then he returns to his ways and what he is used to: a battered woman.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nIt's about one person... the girl he met who he loved and the girl she eventually turned out to be as a result of her bruised and battered heart. When you meet and start a new relatonship, everything is wonderful... but he didn't accept the bad in her once the giddy love was gone.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI think the song is from the point of view of a girl who fell for a guy that already had a girlfriend. It seems like she knew about the girlfriend (\"I should have never let you lie\"), but she obviously had real feelings for the guy and he fixed her and was there for her (\"and somehow you made me smile when I was sad. You took the chance on a bruised and beaten heart.\")but she couldn't help but be jealous of everything this girlfriend was that she wasn't. \nSo the guy juggles them for a while, hence, \"you had it all for a pretty little while.\" But he ultimately chooses to stay with his girlfriend or she tells the girlfriend what's been going on and the girlfriend forgives him, and she is heart broken and angry, yet she still wishes that she could be passive, perfect and forgiving like the girlfriend, since that's obviously what the guy wanted her to be. \nThis song is so interesting-it's not meant to be sad because this guy cheated on his girlfriend or because the girl's point of view doesn't seem remorseful for helping him cheat. It's sad that she really fell for him, and is jealous of his girlfriend and wishes she could be more like her. It's also sad that the girlfriend forgives him. Slime ball.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nY'all, come on!\nRead the lyrics and imagine it were a fast paced song: It would be a \"F you, I win, she loses\" song.\nSeriously?\nIt is 100% sarcasm. \n\"She's beautiful in her SIMPLE LITTLE way, she don't have too much to say when she gets mad\"\nShe's does pretty, in a simple, plain way, and she doesn't defend herself. (She lets him walk all over her)\n\nYou had it all for a pretty little while\n And somehow you made me smile when I was sad\n You took a chance on a bruised and beaten heart\n And then you realized you wanted what you had\n I guess I should've been more like that\n\nThis guy, had it good with her, but he was lying (though she was unaware)\nShe was going through some kind of hard time but he made her smile, made her feel good. Whether it was a break up or a death, or anything else bad, he made her smile, therefore temporarily blinding her to what was really going on behind her back.\nThen for one reason or another (maybe a confrontation between her and the other girl)\nhe chose the first \"simple\" girl who let him walk all over her, it was easy for him.\nThe \"simple girl\" probably knew about the other one (perspective narrator/singer) but forgave him because she didn't have enough respect for herself and he's all she has/or she needs him for other reasons (financially... ew)\n\nI should have held on to my pride\n I should have never let you lie\n I guess you got what you deserved\n\nShe's been describing this pathetic \"other woman\"\nand then says \"guess you got what you deserved\"\n\n... come on y'all\nshe's Shit, he deserves shit.\n\nForgiving you, well, she's stronger than I am\n You don't look much like a man from where I'm at\n It's plain to see desperation showed it's truth\n You love her, and she loves you with all she has\n I guess I should've been more like that\n\nShe (simple girl) forgives him every time, no matter what he does *lets him walk on her*\n(perspective narrator/singer) would not and will not forgive him.\nObviously, from the lyrics\n\"You don't look much like a man from where I'm at\n\nand\n\n It's plain to see desperation showed it's truth\n You love her, and she loves you with all she has\"\n\nDESPERATION=simple girl.\nDESPERATION=shitty guy who chooses the easy girl who lets him walk all over her rather than the girl who is stronger, and wouldn't stand for it.\n\nBasically, imagine the line \"guess I should've been more like her\" with a \"HA!\" at the end. \nas in EFF THAT. GOOD RIDDANCE.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI think the guy is cheating on his wife with the narrator. He ultimately goes back to his wife. When he first comes to the narrator, she thinks I'm different from his wife and that's why he wants me; when he goes back to the wife, narrator thinks guess I should have been more like her, as now she's fallen for him. I think that \"in her simple little way\" is a dig at the wife, implying that she's stupid and that's why she took him back and that's also why he went back, 'cause he could get away with anything with wife.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThis song is about someone like myself...\n\nFor 6 years I have been in an on again off again relationship. Seems as though every time my significant other and I are on break he finds someone else to occupy his time with, a 2 week fling. This song, in my opinion, is one of these 2 week flings singing about someone like myself. \n\nShe's beautiful in her simple little way/ Not necessarily a literal term, but kind hearted and naive in her own crazy way\n\nShe don't have too much to say when she gets mad/ she knows the type of man she has and has been here before so she doesn't react the way a woman should\n\nShe understands, she don't let go of anything\nEven when the pain gets really bad\nI guess I should've been more like that/ she stays for the good, bad, and the ugly...\n\nYou had it all for a pretty little while/ The fling believing she was everything for him\n\nAnd somehow you made me smile when I was sad\nYou took a chance on a bruised and beaten heart/ the fling was obviously looking for comfort after a bad relationship, and thought this was the best choice for her\n\nAnd then you realized you wanted what you had/ the man never intented on staying \n\nI guess I should've been more like that/ kind hearted, naive, blind, forgiving...etc. like the woman\n\nI should have held on to my pride\nI should have never let you lie/ the fling realizes that she should've known better than to believe the sweet words of a smooth talker\n\nI guess you got what you deserved\nI guess I should've been more like her/ The fling is done, but facetiously stating to the man...I guess you want your cake and eat it too \n\nForgiving you, well, she's stronger than I am\nYou don't look much like a man from where I'm at/ the fling stating that he's worthless and seems like she is throwing a jab at the woman for forgiving him\n\nIt's plain to see desperation showed it's truth\nYou love her, and she loves you with all she has/ another jab thrown here intending that the woman has forgiven him out of desperation for him to love her as she does him\nI guess I should've been more like that\n\nIt really seems as though the \"fling\" is singing about a naive woman blinded by love. this woman knows the kinda of man she has and still forgives each time trust is broken. The fling doesn't really wish to be More Like Her, just telling the man if i were like her then you would keep me around as you do her because then I too would be spineless.\n\nJust my opinion...\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nSheâ\u0080\u0099s speaking of this new relationship as it goes sour. This new guy took a chance on her after she just got out of a relationship in which the husband or boyfriend cheated on her. If she just wouldâ\u0080\u0099ve been more like the girl that stole this brand new guy away. Well they were a couple then he left to be with the girl writing the song. If so she wouldâ\u0080\u0099ve been able to keep her husband. Both stories have a guy that cheated or left the girl. The girl telling the story felt so bad about her self that if she wouldâ\u0080\u0099ve just swallowed her pride and went with it she couldâ\u0080\u0099ve kept the husband (old relationship). What she found out in the long run is she was better off exposing him and walking away.\n\r\nMiranda Lambert your beautiful, you won. If the story is about you you found out your self worth is right where it needs to be!\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThat is what I thought SammyJ777, it sounded like the same love triangle that Blake, Kaynette and Miranda were in. I just don't understand why Miranda would write a song that basically portrays her and Blake in the wrong? I like this song and I like both Miranda and Blake; I just don't understand why she would want a negative portrayal of herself...I guess the song is doing great...but still, If I were Kaynette I would be very angry that Miranda is cashing in on her pain.\t\t\t\t\n\t\t\t\t\n\n"}