{"comment_0": "\nHawrtbrayker: Bush contributed $87 billion dollars and several hundred thousand US troops to Iraq, a country with no association to the groups that attacked our country, and he's the one that is the only person who is willing to do something about terrorism? That is a ridiculous statement. Bush has done more to keep Bin Laden alive than anyone else. If he had spent that money and used those troops in Afghanistan and Pakistan, we'd have Bin Laden already. But we don't. And we won't, for a long time. President Bush drove us into a ditch. Do you really want to let him sit and spin the tires, or do you want to admit you were wrong and call a tow truck?\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI just saw the music video for this.  I don't like the way the song sounds too much musically, but I couldn't agree more with the lyrics.\n\r\nAnd guys please don't get into yet another bush arguement, this site already has plenty of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nDope song, great video.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nFuck Bush...this song tells it how it is...\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI don't know what the fuck the guy above me is trying to say, Eminem is obviously very anti-Bush.\n\r\nAs am I, I think this is one of his best songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIs eminem just trying to sell records by once again being controversial, or is he really making a song about his political views?\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nHaahhaa...This song is cool. I basicaly love anything Anti-Bush.....Yay!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song doesn't make sense at all....oh wait, we're talking about Emininem who has never made sense in his life.  He talks about pumping his fist against Bin Laden and that maybe his speach will reach Al Queda, but yet he's against the only person who seems to want to do anything about Al Queda...aka President Bush!  \n\r\nIf Eminem really thinks his stupid little rhymes will influence Al Queda, his is just as naive as the rest of those left wing, hollywood types.  Yeah, lets use our words to get to Bin Laden and Al Queda...lets just talk with them about it.  Yeah, I'd like to see Eminem talk to Bin Laden....he'd be the next person on their home made videos getting his bleach-ass head cut off and then I won't have to listen to this crap any more.\n\r\nAnyone who is ANTI-TERRORISM must be PRO-BUSH...I guess I mean anyone who is ant-terrorism and has a functioning brain....Eminem obviously doesn't.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nObviously you guy's don't get it that Eminem dosn't give a f*ck about what others think. Him being controversial is what he does, thats how he gets HIS money. Just becase half of the stuff he says he dosn't actually do, dosn't mean he might not actually feel what he means behind all it.\n\r\nHe is just angry, like alot of other people in this country. He's just lucky he gets paid to vent his anger.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nFunny thing, what he says doesn't matter.  He rants, he raves and we both can do it really.  I agree with tarnok, here.  I just saw the video on the GNN website, it is a slick infusion of rhymes and animation but it only goes so far.  This imagery of young people donning black hoodies and rampaging a state building to sign up to vote is completely and wholly unrealistic.  Gore Vidal said it best, he voiced that Democrats and Republicans are really two wings of the same party.  If the above scenarios were realistic, every black-hooded person would write Eminem in on the ballot and neither candidate would be elected.  Even if you crowd up all the young people to vote in Eminem, you could never amass the popular voting power of their elders (parents and grandparents) because they outnumber my generation twofold.  Bush and Kerry would still win the presidency.  The ones who are truly in charge, the ones who are truly threatened, would make sure every bit zealotry that is taken as truth by the masses would be vanquished before its taken on as an axiom in the arena of common sense.  It's common sense that anybody who is elevated to a position of popularity will surely turn out like their successors.  Absolute power corrupts absolutely and with human nature being what it is (social for survival unless egged on into conflict), I guarantee you Eminem would make a fabulous addition to that long list of political failures much like Ronald Reagan, Bill Clinton, Jimmy Carter, Jesse Ventura, Harry Truman, Elizabeth I, etc.  I foresee Schwarzenegger and Affleck becoming additions to that list.\n\r\nThe point is this:  songs like this bring out false hope and this is another song that falls on that false hope list.  They are unrealistic and only for the moment.  They don't offer a method for curing human nature.  If you want a truthful song about politics, \"Won't Get Fooled Again\" by The Who is maybe the best example that comes to mind about the perpetual state of politics and human nature.  That's true mood music if you want my opinion on the subject.  Eminem's deceiving himself, there is no way around the power-hungry aspect of human nature.  I am liberal in my heart but I'm both a realist and a liberal in my head, I'm torn like that.  \n\r\nIf this essay is removed from the boards, I sincerely apologize for torquing anybody off but I think it had to be said.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI am a big Eminem fan, but I am also voting for Bush. As for this song, obviously I dont agree with everything he says, but he is a master or words and writing these songs and no one can deny that. As for politics mixing with entertainment, I am not a big fan of celebrities going out and using their status to try and persuade voters. Obviously everyone has the right to say what they want, but when it comes down to voting I hope everyone looks at the issues and not what Eminem or Ben Affleck or Leonardo Dicaprio say.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI can kind of see how voting for either Kerry or a third-party candidate might vaguely do some modicum of good, I cannot for the life of me figure out why so many people would want to vote for Bush.\n\r\nWell, actually, I can figure it out easily; they've been heavily propagandized. But I can't figure out how anyone who's taken the time and effort to dispassionately examine the issues and the candidates could possibly want to vote Bush, with the exceptions of religious fundamentalists and cultural/social conservatives. And I pride myself on being a person who tries to see things from perspectives opposed to my own. Maybe I just haven't done that well enough, which is why I don't understand. I don't know.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nWhy do u come onto the Eminem lyrics just to say how much you hate them. How can anyone say that they don't agree with this song. Do you not want Americas troops brought home. The video to this song is one of the best i've ever seen and it helps you understand the song. Eminem is the only one with the balls to say what everyone else thinks.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI love this song.\n\r\n\"Strap him with an Ak-47, let him go, fight his own war, let him impress daddy that way\" - I couldn't agree more.\n\r\nBush is a Nazi ass dick-head and I lover Eminem even more for having the balls to say this shit. \n\r\nIt kind of sounds like a follow up to White America.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nMan, I'm sure glad some of you guys weren't around during the Revolutionary War period or World War I or II.....I hope your views are of the minority or we are in big trouble!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI gotta tell you I can not stand Eminem or rap period for that matter and I have never heard this or seen the video.  But I love these lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThe $87 billion was also to get our troops better armour and weapons and things of that nature so that they would be better protected and stronger....Kerry voted against all of this for out troops.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThat $87 billion could have been put to so many uses like schools, playing fields etc. \r\nFACT: Several weeks Before America declared war on Iraq GEORGE BUSH bought hundreds of thousends of shares in a weapons dealership and is said to have made $40 million through America buying weapons from this dealership.How can this be justified the corrupt bastards.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\n...owned.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI never could stand Eminem before, but how can you watch this (or even read it) and think he is only chasing dollars?  Any artist who goes political knows upfront they are risking alienating a lot of people.\n\r\nThis is a brilliant song.  I didn't know Eminem had it in him.\n\r\nhawrt, WW1 and WW2 were despicable wastes of American lives and resources too.  Every single American foreign war has been based on good solid lies.  Try reading some decent history books, start with \"A Republic, Not An Empire\" and \"Day of Deceit.\"\n\r\nWar has only one benefit--it allows the gung-ho redneck imbeciles to remove themselves from the gene pool.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThe only reason bush put so much money into iraq is because he thought he would get twice as much back in the form of oil.\n\r\noh but whoops.. Al Quieda are burning oil fields.. whoops..Fucking Idiot.\n\r\nAnd saying Eminem is only saying this for moeny. WTF lol. You think he's gonna ditch 50% of his fucking fans to make money? You do the math.\n\r\nEminems saying it how it is. You're too brain washed to know what the fuck you doing voting for bush. You're crazy. Your voting a man that makes Palestine/Isreal look civil.\n\r\nAs for the song. At first I didnt really like it, but after listening through it a few times, I've gotten to quite like it, I must admit, not one of his best, by a long shot, but great lyrics. I hope it gets through to just enough of the idiots thinking of voting bush.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nDJacques75 you are an idiot...how can you say the world wars were wastes? we got attacked!!!! do you not remember pearl harbor? yeah they came after us...we dont need to sit back like a bunch of cowards and take shit from ANYONE! before you start bashing previous wars look and see what people did to us to cause us to enter....maybe you are a person that backs down and takes crap but ill tell you this the US isnt gonna sit back and LOSE AMERICAN LIVES for no reason when we get attacked just out of the blue...the world wars we entered because of ish that happened to us....yeah we shoulda gone after Bin Laden in this war...but we didnt get the fuck over it....kerry is gonna back down like a little coward and let them walk all over us and anybody that wants to kill off thousands of people at a time can do so if kerry wins as president because there will be no retaliation from that little pussy....we need to make people pay for the lives we lost when it was unecessary....but we do need to go after the right people...but terrorism needs to end...stupid democrats sit back and just let innocent americans die for no reason and reduce our military to nothing! how can we defend ourselves?? hmm gotta think about that because ill guaruntee someone else is gonna come after us especially if kerry does to our military what clinton did....we need a military or well get walked all over.....\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nWell what can I say I'm not exactly a big fan of Eminem but this song is really good. The video is even better. Bush is a dumbass! He is by far the worst President I've ever seen take power in the US. How can you  put someone like that in power? Have you Pro-Bush people seen Farhienheit 911 if not I suggest you watch it and learn from it. Bush Fucked Up. Are you guys going to let him do it again? Eminem speaks the truth this time. Bush is a Dick\n\r\n\"Strap him with an Ak-47, let him go, fight his own war. Let him impress daddy that way\"\n\r\nBest Lyric in the song, and best of all it's true!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ni like this song\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ni hate eminem. we're all intitled to our own opinions but really nice way to have respect for someone who has power over you. takke a second to look at good things bush might have done over the things he did wrong. amazing how people have such disrespect.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nyou do know, you're sticking up for a man who believes that if you accuse someone of being a terrorist, they are guilty until proven innocent? i don't know about you, but I don't want to live in a country where that happens, it's unconstitutional. not only that, we've spent billions of OUR dollars fighting a war that didn't need to be fought, yea schools in the US are getting none of the tax money. None of it. what a great president...\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nfuck bush, cant you people take any artists seriously, if i were one, it would be my biggest fear, you think everything is for money, well almost everything but don't be so narrow-minded, as far as bush fuck bush \r\nand his pro-life issues\r\nHA! Pro-Life is terrible! It's not a choice, most\r\npeople who talk about Pro-Life don't see the implications of why people would\r\ntake abortions in the beginning. You don't look at the economic situation, the\r\ncultural situation or the social environment and why people are forced into\r\ndoing it. I'm pretty sure that no woman in the world wants to have an abortion,\r\nbut we live in a world that's SO FUCKED UP that a lot of people can't support\r\nkids, and I think there has to be a choice about how you want to survive, like\r\n\"I don't want a kid cause itâ\u0080\u0099s gunna fuck my life up, and fuck the kids life\r\nup\". I'm totally against the whole Pro Life idea, I think it's really narrow\r\nminded and it doesn't take into consideration the individuals who are in that\r\nsituation. The people supporting the abortion are mostly white (male) middle\r\nclass kids who will never be in that situation. I think we need a bigger view\r\non the whole subject. \n\r\nand as far as people who think they shouldnt have committed the acts of sex in the first place and take responsibility,  i say if people are gunna pass that Lutheran-type Christian morals in\r\nmy face I'm just gunna tell them to fuck off! i love having sex so fuck pro-life\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nyou are a fucking dumb ass...abortion is murder...so what? have the fucking baby and put the kid up for adoption dont kill it...i can tell you grew up in a great home...poor poor son of a bitch...think about life you are killing someone you idiot...by the way....bush is president once again so i dont give a fuck how much more bs is gonna be said on here hes the president for another 4 years so fucking get over it you liberal POS's. Kerry did. Cuz hes not worthy enough to do the job Bush can...and obviously over half of the US population thinks the same....\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nwow...i can sense the maturity with you dude..i hope you get drafted. seriously, i'd hate to wish that on anyone, but i really wish you get drafted..and die fighting a pointless war..\n\r\nhave a good life hun, although I do agree with the Pro-Life, this is a free country where one's relgious beliefs should not be forced onto other people. it's what we fought for, and we should be able to keep it that way.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nbringitinyeah, uhhh... if no woman wants to have an abortion, and doesn't want a kid, then maybe they shouldn't be having sex.  If you have sex for fun, be prepared to suffer the consequences, as if bearing children was such a harsh consequence.  Everything fun has consequences.  And to everybody else who thinks that eminem isn't writing this song for the money because he would alienate 50% of his fans is ridiculous, he alienates fans all the time by insulting large numbers of people and thus selling records by the millions.  Maybe its a ploy, maybe not.  But to rule that out is dumb.  My friend told me to listen to this song and I did and I'm repulsed by the fact that Eminem would fall into such a typical celebrity left-wing stereotype.  I'm also repulsed by these immature lyrics, but oh wait, he's just venting nonsense.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ntrag, of course it's impossible that Eminem actually thinks for himself, right?  And possibly is even aware of some things about this country you've chose not to notice:\n\r\nLC, ha ha ha....I'm the last person on earth to whom you need to give a history lesson.  I have been eating, speaking and breathing history since I could talk.  It's been well established for many years that FDR desperately wanted a war with Germany and did his best to drag us in via a Pearl Harbor-type incident.  As Herbert Hoover said privately at the time, we were sticking pins in rattlesnakes and we got bit.  But, as always, most American imbeciles, pinheads and semi-literate rednecks (that's most of the population) fell into lockstep with the whole patriotic line.  Things really haven't changed much!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nhaha...ok DJ...anyways...EMO KIM or w/e your name is....i am in the military...wish what you want upon me i went into the service for a reason....i knew there would be a chance i could be deployed to war...thank you for wishing i can go fight for my country yeah i wish i could too....whether i like him or not...kerry or not....i would follow my leader into the fires of hell so hope i die....hope i get \"drafted\" in your sense or deployed...i knew the risk of the military....thanks anyways....umm yeah dont have sex if you dont want a baby then you slut....keep yourself out of those situations and everyone else should too...abortion is murder and anyone who is pregnant needs to have the baby and put it up for adoption if they dont want to care for it.....lol if i wasnt military i wouldnt get drafted anyway....im the only male child in my family left to carry on sooo....the draft wouldnt work either my dear....ok here we go....put yourself in iraq...living there...what terrible conditions right? then a country like the united states can enter and hopefully restore order in your country.....take a look at the harsh living conditions of the people living in iraq....put yourself in their shoes and watch some news casts on how grateful some of the citizens are and how much it means to them that we are there to help them i know for damn sure if i had NOTHING living on the streets day in and day out, living in mud houses living in conditions you dont even know could exist because they are so nasty and gruesome....put yourself over there think about it....we are doing a good deed and its one everybody in iraq will appreciate when we are done...we needed to do this and hopefully it changes some peoples lives forever and maybe iraq can turn out to be a thriving country in the near future because the united states stepped in to restore order in that country and help the helpless get their lives together and be happy people...a world filled with happiness? or a world filled with hatred, harsh living conditions, diseases and death on a daily basis which is what occured in iraq daily....the hatred from that country towards the US is now gone in a sense as well....no more saddam...only real threat now is bin laden if hes even around still....c'mon now iraq needed our help....think about it and out your self in their situation if you can even fathom what it was like there..........\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nwhat if you get raped LCDood, or whatever your name is. being in the military on your own will is completely different, i do have complete respect for you and for the leader of this country, i respect my parents and my teachers but do i always agree with them? no. so why should the leader of my country be any different? this is a democracy right? i do have freedom of speech right? and i know you didn't call me a slut after i AGREED with you about the abortion thing, but to each their own. and i don't know about you but forcing our lives onto other people isn't what we are here to do. I don't know if you heard this but George Bush had some pretty good fucking advice back in the day. Make no Allies. Make no enemys. They only cause problems, that's not a direct quote because i never memorized it. \n\r\np.s. if i lived in iraq i sure as hell wouldnt want anybody bombing my fucking home and killing my fucking family and then being told that i am being freed. thank you very much.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nLC DJ. What the fuck. I really cant see why anyone can dislike this song. Forget who sings it and listen to the words, u hate the song coz u hate him. Even though he is one of the most talented artists on the planet. Why do you still vote for bush when he is making America the most dangerous place on earth.\r\nThere are people in the world much worse  than Saddam such as Robert Magabe in Africa, so why attack Iraq. Then look at the lyrics.  \n\r\n(NO MORE BLOOD FOR OIL)\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI HAATE BUSH AMERICA IS WORSE SINCE HE IS PRESIDENT  I CANT BELIVE KERRY CONCEDED\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nok i haven't read all of the coments but one comment that has stood out so far is one by hardrocker. First off this election sucked, neither kerry or bush is compitent for the presidency. BUT i support kerrys views much more then bush's first off you cant mix religion with government, how many Americans or i should say US citezens are not Christian? Why must Bush force his religious belief upon the enire country? first off Bush believes that Sex Education should not teach of contraceptives because he believes its a Christians Duty to save themselves until marrige, but, hear me out, what about people who are not christian or are and just dont follow the religion so strictly and hey if a teens gonna have sex then THEY ARE GONNA HAVE SEX! and if they are only taught about Abstinence and they decide to have sex they wont no of contraceptives thus leading to outbreaks of many infectious sexually transmitted diseases plus unwanted pregnancies which leads to the next issue, Abortion, if bush bands abortion then there will be a lot of young mothers or mothers period that will be getting back alley abortions which will kill the mother. Plus what if a girl gets raped and gets pregnant? or what if the baby, if it were born would come out and be in so much pain it would be just about unbearable for the new born? About the rape, my best friends cousin got raped by some mental patient at Spring grove and got pregnant with quads. and all 4 of them are metally disabled, they are all 21 and have the mentality of 2 year olds. Getting onto another thing about bushes campains, i've notice people holding up signs stating \"kerry will raise taxes\" but where do taxes go? back into the country such as for road repair, EDUCATION! so in my opinion TAXES HAVE TO BE PAID! I go to a school in the county keep in mind im not talking about a city school, and i have no heat in my school, nor do i have air conditioning, plus i have text books that are from the 60's its rediculous, im 17 years old and am a tax paying United States citezen and this is what my moneys going towards? NOTHING! And all Bush wants to do is keep the rich rich and the poor poor, thus the tax cuts for the rich and the poor people having to pay them in what way does that make any sence? im sorry but thats just how i feel, you know what a potatoe could be in office and the country would be ran fine, but aparently bush's IQ is less then that of a potatoe especially with this so called \"War on Terror\" talkin about one of the most vaguest wars i've ever heard of i mean thats as bad as fighting a \"War on ugliness\" which would have our President bush the first to be taken out\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nw00t to Crimson Wrists\n\r\nand about abortion, for every person that mentions it being murder, i'm going to kill 17 babies in the maternity ward. Now THAT is murdering babies. Either shut the hell up about the removal of a non thinking non-feeling fetus. Or i'll e-mail you pics of REAL dead babies, none of that fetus shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nthanks, i feel that if the fetus is dependant upon its mother such as if it cant live outside of the womb then its not murder\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI think it's a great song.\r\nIf I was a music artist I would want to express my anger towards the government too.\r\nI love this line: \"Let the president answer a higher anarchy \r\nStrap him with an Ak-47, let him go, fight his own war \"\n\r\nI think the best way his daughters could show they support their father would be to join the army. I'm not surprised that none of those politicians have their sons/daughters enlisted.\n\r\nIf I got drafted, I'd spit at Bush's feet and tell him to finish his own fucking war himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\ngreat song. great video. i don't take songs to serious..they r entertainment....dam people\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nNever mind that the nasty, gruesome conditions in Iraq are partly a result of our 12-year-embargo that killed a million Iraqis.  We usually leave out that little detail.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nOkay, first off, it doesn't even matter what Enimen had to rap cuz apparently George Bush won the election. \r\n  Besides, Eminem probably didn't have much of an influence on voters, because most of the adults I know think he's crazy, and that his rapping is indecent, he has more of an influence on young people. \r\n    Also, all Eminem normally raps about it how good he is and how he's all that and everything, if he really cared about our nation he'd take a second look at how his rapping is exploiting on the young peoples mind. He really can't be rapping against George Bush, and the whole black and white thing, because it's a fact that George Bush has many people in his office both black and white, and Kerry has none that I know of. Kerry bragged about being all for blacks and everything, but that wasn't until after someone pointed out he went to a black church, and than he was all for blacks, but I didn't see him having any in office. George Bush doesn't brag about doing good things, but he does them, Kerry bragged about doing good things, but he never did them. \r\n   Eminem also raps about how God is maybe trying to point out that George Bush is full of lies and deciet and everything, and that God's sending a sign or something, and yet than Eminem goes on to say follow him, he's right and everything. I definitley wouldn't follow someone who's rapping is against so many things, and than it's for them. I really think Eminem is confusing because in one song he'll be against something, and another he'll be for it. I also don't think it'll kill us to have George Bush be president.  I also don't think we should mosh or die. And Eminem is saying bring down all of the things George Bush has been trying to bring down, and yet Eminem is saying vote against him. But once it again it doesn't matter, because George Bush won.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nhawrtbraykr on 10-29-2004 @ 07:37:17 PM  \r\nHe talks about pumping his fist against Bin Laden and that maybe his speach will reach Al Queda, but yet he's against the only person who seems to want to do anything about Al Queda...aka President Bush! \n\r\nHA.\r\nHA HA HA HA.\n\r\nPresident Bush really seems to care a lot about Al Queda, I'm guessing that's why OSAMA IS STILL MAKING VIDEO TAPES!!! Keep up the great work Dubya!\n\r\nUgh. ANYway.... this song is alright, but if I'm being honest, I just love it for the fact that it says shit about Bush. I think it's great Eminem made this song, all the more power to him if he wants to make a political statement. Especially if it's anti-Bush.  ;)  And, well, I can't post after reading all these comments and not be expected to say something back.\n\r\nIt's great that the entire world hates us and over half of America is stupid enough to vote for Bush, despite having 4 years of evidence and reasons why we shouldn't. In 2008 I am going to laugh my ass off at the people who are optimistic that Bush is going to do something positive for our country. That is just INSANE, and trust me I will be the first to say \"I told you so\" when we look back and our country has gone to shit.\n\r\nIt's fucking sad that people are more concerned about being anti-gay than about wasting billions of dollars on a bullshit war. OH MY GOD... we can't let men and women have happiness in America if it means we have to see 2 guys kiss! What the hell do we think this is, the land of the free??? EWWwww I am so personally affected it's tragic. And yes, I guess killing all these women and children in Iraq means nothing as long as we aren't \"killing\" an unborn fetus which can't even THINK or FEEL. But all women in America are dirty sluts, God forbid they get raped or something, well then I guess it's just their own fault.\n\r\nI am convinced that as of November 2nd our country is royally screwed. So much for my having faith in Americans.. I am now proud to say I am living amongst millions of stupid, uninformed, close-minded pricks who fucked our country over by voting for Mr. Dipshit himself.\n\r\nWAY TO GO AMERICA!!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nJillian04 THANK YOU!!! *hugs* finally someone gets it! what bush is doing isn't only fucking up all the adults lives its fuckin up the children. in 2 years ill be off to college, but the cost of college is how much now thanks to bush. nothin like raising tuition costs so smart kids in lower class families cant afford to go to college LONG LIVE STUPIDITY! which is what bush is enforcing\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nshut the hell up ur all wrong and so is Eminem this song sucks big time!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nWell, that was profound.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nhaha yeah that's me....especially when people talk about the President of The United States like he is a piece of crap and they have no respect for him even as a human being...its a touchy subject for me....\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nYou're right. I don't have respect for a man who lies and manipulates his country, who is continuing to run America into the ground, who tries to force his beliefs on others simply because he believes he has the power to do so.\n\r\nBut hey.. I guess you could say the fact that I am ashamed in half of my country right now is a \"touchy subject\" for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nUr ashamed of half ur country and so am I...the half that has no morals, no values and no respect for anything...the half that wants abortion to be legal...the half that puts their own slefish wants before that of others but at the same time supports laziness and needs it all to be handed to them on a silver platter...I guess because we didn't have to fight for our freedom we take it for granted and use it as an excuse for all the stupid things we do...I'm ashamed that half my country can look at the shape the entire world is and say that our country is going into the groun...amybe for a reality check of what \"going into the ground\" is like...go to one of these countries that can't even afford to feed 1/10 of it's population wnd where the death rate has by far surpassed the birth rate.....\"It is the soldier who salutes the flag, serves beneath the flag, whose coffin is draped by the flag who gives that protester the freedom to abuse and burn that flag.\" \r\nSen. Zell Miller \r\nAnd I am ashamed of the half of the country who will not support the troops in their time of need my dad fought in the war and he always told me that no matter if u supported the war or not u have those men in our U.S. military who are willing to stand up for our country to show that we will not be didvided but be united and that when they went to the actual battle grounds not one person would speak of an ill feelings toward the U.S. sure we may not be the best or most well liked country but we got  a rep. for not taking any crap and everyone knows that u hurt one of us ur messing with the whole country...but on the issue for respect that's ur deal...I was hoping u would be a bigger person and say something like \"sure I respect him like i would any other guy but i don't support him\" because hey that's how i feel but i know i'm wrong...right?\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nGeorge Bush has done a lot of positive things, and will do a lot of good things in the years to come. Great things come at a price, and it takes patience.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nAnd i strongly agree with rhcprox that was really powerful. And the only ones who are against the war are those who are looking at the now, instead of the later. If we don't try to to stop something directly to where it started, it will grow. Freedom came at a high price to many, and the people of today are very lucky to have what we have. We should do our best to make it a better nation for the next genaration. If we don't start to set moral standards, things will get out of hand. Maybe not imediatly, but the reaction to what we've started will take effect in the future. We shouldn't take for granted the freedoms we have, at least because there's others who have died and fought for our freedom, and theres other nations and countries who have near to nothing.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThanks but I do have morals and values. But since you know me oh-so-well, I guess it's your call to judge me anyway.\n\r\nI support our troops. I just don't support the reasons we went to war, since they were BS in the first place. Bush couldn't even tell the men and women who were going over to risk their lives the REAL reason for the war. He just blamed it on WMD's. Ok.\n\r\nAnd I'm sorry but I really just have no respect for the man. Tough luck. Well, whatever. You know where I stand, I am done posting. Hopefully I'm wrong and you're right and America will turn into some glorious country over the next 4 years where we don't have to worry about health care or education or being attacked by terrorists. I only wish I could believe it.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nfine u can't change me i can't change u...Bush won wether u like it or not and he will be serving our country for four more years...u can choose  to live with it or u can leave...it's ur call\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nY does everyone beleive that you have to be PRO-BUSH if ur against terrorism. Im from canada and i think bush is an absolute retard, doesnt mean i want to see bin laden run around bombing places. This is one of eminems best songs becasue it makes sense. it shows how f**king retarded bush is and explains how u dont have to be pro bush to be agianst terrorism.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nOh by the way i knnow im going to take heat for my last comment so whatever you say i know its comming\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nhaha or not bc im bigger than that...and people who say shit like that are so cliche and just want an argument....whatever thats all u dude...haha u knew that was coming right?\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nbut i do love canadian boys so much!!! haha ; ) well cuz most of the ones I know skate!! lol any ways nah im past being pissed at everyone opposing Bush...they are usually ignorant to the real facts...but hey thats cool...i guess\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nim not cliche tho.. i lived in the USA in wisconsin when Clinton was in the white house. I also keep up with the american news mostly because we get alot of american channels.. but yeah bush may have done some good things. but some of the stuff he does is just so dumb, not idiot dumb but more of a y would he ever do that kind of dumb. W/E maybe Americans see it different from us up here but about 90% of the ppl i hang out with think bush is a retard. maybe it is just a bias we get because we arnt under him.. but n e ways this is a bomb ass song\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\ni guess so...idk maybe u guys just don't know as much about him as i do...i mean u can't honestly say that he is a bad president unless you have experienced him as a president...but who knows...I just think this song is stupid and I mean idk i just don't like it...maybe he is just troubled...he was just looking for this next person to ditch on i think...he should skate!lol then he would be awesome....\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nWell, canadianboy... 90% of the people I hang out with agree too.\n\r\n(not trying to start anything up again, I'm just saying)\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nhaha u so are trying to start something up...any time someone says that they are just drawing more attention to what ever it is they are saying they don't want attention brought to...get it?\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nNo. I was being 110% honest. I just wanted to let him know he wasn't alone. The end.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nyeah im sure he was scared because he thought he was the only one...this is only the beggining...\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nWell its good we arnt alone.. and we arnt tryin to start up shit.. all im saying is that i from what ive seen, do not like bushs ideals.. i cant say i like our prime minester as well.. hes a pretty dumb mother f**ker as well.. i think that bush would make a fine president if he took the time to realize what he is saying. if u dont beleive me go to bushisms.com. N E WAYS KICK A$$ SONG\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nyeah what a stupid website...how mature...make fun of the president\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nOMG i heard this song again today and i just don't get it...why he is so angry?!?! he needs help....\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nThe better part of this song is the video.\r\nThe way everyone looks like they're going to start trouble, when they're going to vote.\r\nIf you don't like the way things are run, vote against it. If you like how they are, vote the keep them that way. And then everyone can quit their bitching.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nyeah i think the video is so stupid...plus i like to have the last post so i am posting that u despise this song again!\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nYea... Eminem.\r\n*sigh* i wish i could add 3 1/2 pages worth of commentary good enough for CNN but sadly i don't. The last person i want talking to me about politics is Eminem. I know my own facts people, and it looks like 4 more years of hell.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nlol, whys he angry\r\n1) why do you think hes even angry?\r\n2) hes 'angry' cause america is fighting a pointless war\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\noh u are one of them...so did you like kerry? do you want to die? do you support terrorists? do you believe preemption is crap? why is this a pointless war?\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nyea four more years of hell is right...this is gonna fuck us up! you know i was talking to one of my friends and i was like 'you are so lucky you are a senior' and she was like 'why? yea i might get out of my house and away from my parents but then i have to go to collage  and try to work but then i would have tried to get a job but i wouldnt have a chance because i would have been fucking drafted for the war and get killed and all my work will go to waste!!' you knjow she is right...deal with it...this country is going to hell and if it doesnt it is gonna be pretty godamn close. sorry but face the fact em is right and he isnt doing this for money and how would you like it if you were him and you tried to stand up for what you believed in but a bunch of people think you are doing it for money...so go fuck yourselves...he has an opinion and i have an opinion and you have an opinion but it doesnt mean that just because he has a different opinion from you that he is doing it for money...\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nyou guys are so negative about bush what has this world gone too? you know it kerry won we would be in alot of trouble and if the democrat when bush won if the other guy one well i dont even want to think about it you guys shood though....\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nCan everyone just please grow up and stop posting ridiculous comments? And maybe, just maybe, could we try typing in actual LEGIBLE English??\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nIt's terrifying, even in an undereducated country like this, when someone like Eminem has more on the ball intellectually then 51% of the country.\n\r\nThe next time we get hit like we did on 9/11, all the nations who used to be our allies when we had the pretense of being a civilized country, are going to say \"well, they asked for it!\"  And they will be right.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nrhcprox, or whatever, and any other right-winged conservatist pig on here needs to realize the facts... \r\n1. YOU will be paying for your parents health care and medications when it's time for them to retire because there will be no Social Security or Medicare for them. \r\n2. YOU will be paying a ridicuolous amount of money to go to college (hell, I know I am right now) because this fine government of ours decides to raise tuition costs every year, in turn making the school raise book costs, rooming costs, etc.\r\n3. YOU will be drafted when the draft starts. Yes, I'm looking at all your 16-20 year old kids who are not going to college or not currently attending college. I hope you all realize this.\r\n4. YOU voted for a president who's only issue near the end of the election was \"morality\". So, in order to be moral, you have to believe in the almighty G.O.D. and be a Christian? Shove your religion straight up your asses along with your morality. When religion and morality take a forefront to a war over nothing and helping out the middle-class who are struggling right now, that's some pretty fucked up shit right there.\r\n5. YOU will be working at Wal-Mart when you graduate college with that major in Education or Biology because THERE WILL BE NO JOBS! The expected unemployment rate as of right now, according to CNN, is going to be 40% worse, and 78% worse for just graduated college seniors. Hope you can somehow pay for that pHD, cause I know I sure as fuck can't.\r\n6. When YOU are rapped (this only accounts for the girls) or your mother or sister or aunt or girlfriend or wife is rapped, and this glorious government of ours, lead by mostly republicans now, bans abortion and they can't get rid of the FETUS (you do realize that until a baby is in it's last trimester, or at least 7 months into the pregnancy that it FEELS NOTHING, SEES NOTHING, HEARS NOTHING, CAUSE IT'S ONLY IN DEVELOPMENT!), then don't come crying to ANYONE. \n\r\nI'm done ranting. Reply how you like, you're just going to make yourself look like an even bigger idiot. You're 17, you have a lot to learn in life. Stop preaching your parents political views and get some for yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nI'm 16...I don't talk to my parents....Ur the idiot... you feel the need to bring up things that are moral while saying pretty much that you don't like Bush's morals ok\r\n1) every generation pays for those ahead of them and actually because of the population growth and the number of kids there will be no one to pay for us...not our parents dumbass\r\n2)The government pays $10000 per year per student to keep books lower and tutition as low as possible....everything gets more expensive with time then will be cheap again...it's all how you look at it proportionally(bigger economy=increase in prices)\r\n3)There is NO fucking draft\r\n4)yeah you'll get over it...Kerry is a christian too\r\n5)There will be jobs!!hello people quit, die, retire and get fired everyday!!! There will ALWAYS be jobs..but hey start by telling  all these foreigners to stop coming over illegaly then taking the jobs...I mean yeah they are Wal-Mart jobs but hey money is money..\r\n6) Thats a moral issue isn't it? one in which yes does involve christianity and which you didn't want our president to speak on so why should you?\n\r\nAnd just so all of you know Kerry was going to continue the war and we have the support of Britain (our greatest ally) because Tony Blair even said that this war was bound to happen why not fight it now? yeah i've said this before....it's PREEMPTION!!! we're not going to die because he is our president...\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\ni thought this was a site where people talk about the songs ......not there fucking perants like i care? no .and another thing put your fucking heads back on you idiots and talk about the song not the policitcs i dont care what yall say just talk about the music no one cares.....\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nOk, you're fucking 16 years old there Mr. or Ms. Scholar. You have no idea what you are talking about. I'll run them down in order as you seem to like to copy people...\n\r\n1. No, you dumb shit. Go look up how much money was taken out of Social Security in the last 3 years to try and help pay for this war. Your glorious president has drained it. There isn't much left. MY parents (me being 22) are NOT GOING TO HAVE SOCIAL SECURITY BECAUSE THERE WILL NOT BE A PENNY IN IT. Everytime it's taken out of your paycheck, that is, if you even work yet, it's going straight to the war. The facts are there, look them up.\n\r\n2. The government pays every college student $10000 a year to go to college?!? Well, where the fuck is my $35000 for the last 3 and a half years I've been in college? I haven't recieved SHIT from the government, only my own state. I get a $250 grant every semester, that's it. Everything else is either financial aid, which I pay back in full, or loans, which occur interest ontop of me paying them back right now, but getting burried under more and more debt every semester. And, how is the government going to help me out when I graduate and all these debters want their money ASAP? It's not. So, before you go shooting your mouth off, you need to get some facts straight. \n\r\n3. Where the fuck have you been? Bush and his adminstration have been hinting and talking about reinstating the draft for the last 2 years. Now that has 4 more in front of him, you better be clutching your ankles right now in preperation in case you get caught as a POW over there, you know, when you're drafted.\n\r\n4. What the fuck does Kerry being Christian have to do with anything that I wrote? He isn't the one trying to force religion and politices together. I, for one, don't appreciate it at all. First off, it's against everything this country was founded on. Second, it's against the constitution. So, once again, learn some facts.\n\r\n5. How will there be jobs when the proposed deficit in the next 4 years is going to be almost 500 BILLION DOLLARS? I know I'm not going to be getting a job for at least a few years out of college, be it that I'm in a tough major to get jobs right out of college, but now I have to wait even longer... \n\r\n6. Why should I ask about abortion? You're the dumbass who brought it up saying it's \"murder\". How is it murder? Go take a genetics or pretty much any biology course and learn about the reproductive and birth cycle. Then, you'll come to understand that it's not murder. A woman should have the choice whether or not to bear a child, plain and simple. Restricting her from doing so is taking away her freedom, plain and simple. Shove your religious jaunder right back down your throat, cause religion has nothing to do with this issue. If your god didn't want abortions, he wouldn't allow unwanted births, look at it that way. \n\r\nI'm done. Retalliate as you wish, you're going to make yourself look like a bigger idiot. You're only 16, you have a lot to learn in life before you start flying off the handle like that again. Grow up, learn your facts before spitting false accuasations and false facts in the air.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nFuck you...you just said the same thing twice....I really don't care because you are wrong and I don't feel like arguing with someone who is completely ignorant to what is the truth...when you're burning in hell I guess you'll wish you would have listened to me....bye\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nHahaha... Once again with the religious bullshit. See, you hide behind that, you think it's this impenitrable wall that will always protect you. It's not. Religion is made up bullshit to make you follow some cause that isn't even a reality. Prove to me a god exists. Prove to me that if I lead a \"moral and fullfilling live, free of sin\" that I'll go to some Heaven when I die. There isnt' a heave, there isn't an afterlife. Until the day that I see God staring me in the eyes, be it a he, she, or it, I will not belive in something that isn't there. \n\r\nAnd, I didn't repeat shit. I clarified what I said before because you seemed to not understand. And, since you have no viable response to any of my responses, it shows that I am right and that you were wrong. Get back to me in 2 years when you're going to college and you're paying almost $20k a semester just to go to a State University. A\n\r\nAs I have said, you are only 16. You have much to learn young grasshopper. And, as I have said over and over, all those facts are out there for you to find. Go look for them and see that I'm right. \n\r\nThis, for real, is my last retort unless this kid lashes out again. And, I'm sorry to bring this politcal and religious BS into this song, but it is about politics, and this is how I feel right now about our current state of this country. So, on that note, I'm outty.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nburning in hell?  LMAO!  What a fucking fruitcake!\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nI don't hide behind my religion but atleast unlike you I have something I stand for and am not trying to be against everything...I mean if you don't like our country then leave! this world is a huge place and no one wants you here anyway if all you are going to do is complain...there are things you shouldn't have to see to believe, things that science can't even explain and I can't wait until the day when you see God face to face and I can say \"I told you so\" ...and I am actually quite a smart student and almost have a free ride to school so in two years I'll get back to you and show you how everyhting you said was a BS lie that people make up because there has always been this damn division in politics. I think we a re living in  a new era and poltical parties are going to start redifing themselves....I think we are experience one of the greatest changes we will ever have...Everything is changing..And I don't want to argue with you any more, I really don't any more so I won't but look I can't change you and you can't change me....I mean if anything it's really awesome that the younger crowd is becoming more interested in politics right? I mean wether what we believe is right or wrong atleast we are excersing our right to disagree and just live in freedom....Let's just end this on a positive note and know that we just disagree ( again one of the great freedoms of this country)....I mean we are wasting space just going back and forth.....later\n\r\nBut one last hting to DJacques75- Where the hell did you come from? Well I'm glad I made you laugh....only cool people would say fucking and fruitcake in the same sentence...\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nwow I think ALL of you are very uneducated on this....Rhcprox I can see where you are coming from though But here's how it is \n\r\nAre you for paying for more federal programs and paying the debt? How does that help the deficit?  Big deficit under Reagan, big economy too.  Our debt is very low compared to our GNP.  Here's an analogy:  If you are on a teacher's salary 20, 000 is a big debt.  If you are on a doctor's salary 20,000 is nothing.  WE have a big deficit with an even bigger economy, not a huge deal.  I'm guessing you think that if we stop the war in Iraq and tax everyone more we can fund federal entitlements and pay of the deficit.  That only works if the economy doesn't come to a standstill as a result.\n\r\nThere was a 40% increase in education spending under Bush and no it may not be tangible to you personally but hey like rhcprox said you shouldn't have to see everything to believe it\n\r\nDo you know what happend in the 7 day war? Look it up....\n\r\nAny ways answer those....\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nok ok ok first of all its the democrats who voted to raid the social security fund to finance the war. and second of all bush has made a statement that he will not reinstitute the draft and rhcprox couldnt be drafted cuz shes a grl and grls dont register for the draft. and for goodness sake dont use cnn for ne thing thats just abunch of liberal comunists. and the reason college is so expensive is because the states drive the tuition up due to the democrats voting against the bill to let the federal government regulate tuition and i no im only 17 but im taking night courses so yes i too am paying for college. and all you fuckers complaining about bush get the hell out of america we dont want you and we dont need ur comunist asses in the great land led by the greatest leader in the world today.\n\n\n\r\nhedgemon\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nohh and i no that im gonna take alot of heat for that comment but if ne one out there wants to back me up id appreciate it\n\n\r\nhedge\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nThe funny thing is... all you assholes who tell us to get out of America because we don't like Bush... I can just see you doing the same exact thing if Kerry won! Too bad we have the freedom in America to have our own opinions, and last time I checked that doesn't make us communists, but hey you seem like a really (cough) intelligent person so I should probably just listen to you anyway.\n\r\n\"dont use for ne thing thats just abunch of liberal comunists\"\r\nYou're right... I think I will start watching FOX news.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nsorry that was supposed to say \"dont use CNN for ne thing\"\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nok well fox news would be better. and as far as me being intelligent i actually am. you no they dont let just ne one into prelaw. and i would have supported kerry if he had one i wouldnt sit there and call him an ahole and say america is goin to shit because of it. hes a great leader, hes made mistakes but at least he nos what he stands fore and doesnt change his mind on a weekly basis\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nYou do mean Bush doesn't change his mind on a weekly basis right? bc Kerry does....And Jillian04 yeah we do have the freedom to have our own opinions but our point is that there is also the freedom to leave when you don't like something....so we were just trying to offer a suggestion....haha there YOU go judging someone's intellect and you have never met them I'm sure....but hey if that's what you have to do to feel better about yourself well you have that right too... and for the love of God the economy has very little to do with government money in a market system!!! It's all indiviual profits...sheesh .....yeah I will back u up hedgemon because atleast you don't have some BS about someone's intelligence based on their opinions....\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nthx rhcprox andyeah i meant bush dont change his mind sry for not making that clear. and just a question was all that stuff bout me cuz i couldnt tell.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\n\"as far as me being intelligent i actually am. you no they dont let just ne one into prelaw\" ....... \"at least he nos what he stands fore\"\n\r\nHaha, do I really even need to comment?\n\r\nAnd rhcprox... last time I checked \"get the hell out of america we dont want you and we dont need ur comunist asses\" was not a suggestion. You're not backing up hedgemon because he doesn't judge people, you're backing him up because he supports Bush and agrees with you. I apologize for assuming that people who type like 5 year olds don't have the highest IQ's in America... I know that is a real stretch... what was I thinking?\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nyou need to comment. im using shorthand because right now i am in school and if i get caught on a website i will get 3 weeks of detention. and shorthand typing makes it quite faster than typing all the words out.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nseriously are you basing your opinion on someones intelligence on the way they type because that is THE stupidest thing I've ever heard (next to the lame ass comments you TRY and argue with)!! And I don't think I ever said those words....And oh ofcourse YOU know why I'm backing up hedgemon...I forgot you live in my head and make decisions for me....yeah I didn't think so, shut the hell up\n\r\nhedgemon-all that stuff was about jillian04 not you...except for the question, but no I agree with you.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nwhy don't people comment like this on more meaningful songs? this is a waste of f*cking space!!\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nwhat would commenting on a more meaningful song change...\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\n\"what would commenting on a more meaningful song change?... \" \r\nI'll answer this since no one else has. The song lyrics would change. Who's wants to argue over a song like this. It's worth getting worked over.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nhuh...I still don't get it! haha\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nIt's not worth getting worked over.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nohh and one more thing eminem needs to get his facts strait the american military uses m16's p60's and p90's not ak47's\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nohh and one more thing eminem needs to get his facts strait the american military uses m16's p60's and p90's not ak47's\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nMan, if Bush didn't take action after 9/11 We would still be getting hit  with terrorist attacks...we would have had to deal with iraq eventually....and all you tree huggers who wine about the world hating us, makevelli said it best \" It's better to be feared than to be loved\"  thank you\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nhaha yeah i agree betales4ever...thats a Machiavellian principle...haha yeah Eminem doesn't ever know what he is talking about...\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\neminem has no real values.\n\r\nwow that's a lot of commentary in less than a month!\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nI am amending my previous statement on the thread here.\n\r\nI just viewed the updated Mosh video and it just proves how unrealistic propaganda truly is.  The ending was updated post-election and it shows the blackshirts of Eminem storming the Senate with peace signs and banners claiming bring the troops home.  I am sorry, but that is mob mentality simple and plain.  The cops would have opened fire on that group without provocation.  I remember a Simpsons episode where Homer got a daisy got shot into his head because he put in it into a cop's rifle.  Granted, all these people were unarmed in the video, it's amazing what adrenaline and bare hands can do to a few people.  There would be blood running through the streets of DC and I am sure the federal government would not take any of the blame for it.  If you live on a farm in the rocky hinterland known as north-central North Dakota, you will see it on TV, mourn for five seconds, and then go back to playing Sisyphus with a tractor and harrow.  My point here is that nobody gives a flying fuck about what Eminem has to say.  His prose and imagery give a false hope that can never happen.  Since 9/11, security in DC is so tight is could be compared to a nun front's entry.  There would be security boys called in from Quantico, Langley, and even the nearby armed forces bases outside the Beltway.  I like the idea of radicals blocking the Beltway and moving on DC but Tom Morello thought of it just five years ago and he could never muster anybody to make such a move.  Eminem might have a larger fanbase but they have minds of their own.  Considering the firepower just between the 50-mile mark and the center of DC, those hoodies would never make it past Front Royal, Virginia on I-66.  Eminem is a full-blown idealistic liar who probably has never used an ounce of logic in his entire discourse on American politics.  If you are going to march on DC and storm the senate, you better be armed to the teeth and beyond because the DCPD and the American military will destroy you and make it look like a cakewalk in Central Park.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nI may have my beliefs now but they would change when I go into the military.  I may have a liberal mindset but it would crumble under the weight of a screaming drill sergeant.  In that world, I understand it to be somewhat dog-eat-dog.  To survive, you mind your P's and Q's and don't piss in anybody else's cornflakes.  I don't ever want to serve because I love my life as is but if a draft is instituted, they would take me so fast that it would turn my head into a globe.  Considering I live below the poverty line, I am a prime target for the draft.  They go after college people and college graduates.  If you are under age 35 and you don't have significant health problems, you are a prime choice.  They will take recent high school grads before they would take me but I will be taken.  When your country calls on you, your right to volunteer becomes suspended.  You fight regardless of your beliefs on the war.  My choice would be not to fight if the volunteer basis stays where it is.  Otherwise, I would have to.  I have served in jury duty and I vote and I speak my mind routinely.  If the volunteer army is ever suspended, I will wait until they call my number.  Better to wait until then, but for now my choice is here to finish school and get married.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nhmmmm...interesting...probably the MOST interesting thing i've read so far on this site!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nThanks, I guess.  I still believe Bush and Kerry are both morons and I refused to pick between the lesser of two morons.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nOk I'm just saying what you said was interesting...just because I thought it was interesting doesn;t mean I agree with all of it...I just thought it was very thought provoking and well written...\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nwht dus he mean \"rebel wit a rebel yell\"?  \r\nthat line is similar to the lyrics in a rage against the machine song\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\ni could careless what eminem sings, whether or not he means what he says.  but man, i can't believe how immature we're all acting just because bush won - no need to cuss or what not.  bush won, so what?  there's nothing that can be done about it.  and fyi, kerry did say that he wanted to start a war elsewhere.  also, one of the reasons why bush won was because he is not a flip flop like kerry.  how can you vote for someone who you don't even know is going to act on what he actually says??    and, sure, bush isn't quite the \"perfect\" president, but he'll let us know ahead of time of his goals/mistakes because he is dedicated.  he's not a flip flop like kerry. if kerry was a president, he may lay a mistake on us quick - there would be no time to adjust.  i'm not exactly for bush, and i'm definitely not for kerry, but we need a president who is HONEST and who is DEDICATED.  those two traits are what bush had, and not what kerry had.  furthermore, that is why kerry lost and bush won.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nYou guys, as far as political white rappers go, you're better off listening to Sage Francis. He's wickedly funny and talented. I love Eminem, but Sage Francis annihilates him on every level. Give Sage Francis' \"Makeshift Patriot\" song a listen for a real politically minded song. It's a song that critcizes the actions of our country after 9/11, but always remains respectful to those who lost their lives in the tragedy.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nyeah thats stupid why would someone critize the country after a national tragedy that we are still, 3 years later, recovering from??what an idiot, but yeah I agree with you electicSOUL...\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\ni've never seen so many people feed into so much political rhetoric...i hate bush...i think he's a fuck up and now that colin powell is gone groupthink anyone? but regardless, more of the people in the country want that religious nut (who hasn't ever done anything for the religious right btw so i wonder why they like him so much) so the rest of us with actual intelligence who think that a war on a fucking concept is pointless and is only making the al queda recruiting pool that much larger just have to deal...or leave the country. no use whining about it now.\n\n\n\n\r\nthese red states...yeah these are stupid. - al franken\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\noh...one more thing. i guess being a christian means you invade other countries eh? did he like miss the whole love  one another part of that bullshit you born agains live off of?  saddam may have been a horrible dictator...but he was secular. and thats a whole lot better then the fundumentalist governments that will eventually form in iraq and afghanistan.\n\r\nactually...two things. the whole abortion thing. i love how being christian and restricting civil rights go hand in hand now...if you dont like abortions dont get them. but dont attempt to legally ban that or gay marriage...who are you to tell someone else what they can or can not do because you love jesus. how about if i propose a constitutional amendment to prevent all christians from going to church. just christians...no church. would you be happy? would you cry foul?\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nI love this song....Hes so right, Bush sucks!\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nI had added my two cents so far now that's its almost a dime's worth.  I love arguing about politics as much as the next person but that has gone on long enough.  Bush won and he sucks, that many of us can agree on.  Do we still need to repeat the same unoriginal stuff over and over again?  This ranting and raving hasn't lead anywhere.  Eminem barely changed any minds and I don't think he will ever change many minds.  He has supported momentarily on the left but they will distance themselves from him the next time he makes a gay bashing video.  He's hated by everybody and he wanted to do it from the start.  We know that, let's stop chatting about it.  This is what fuels his fire and I don't think we should anymore.  His time in the limelight is deserved but he should retire and let a few other good rappers take the spotlight.  As the boys from Incubus said, step down come on and step down.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nAight, as far as anybody with a brain being anti terrorism has to be pro-bush, I have to say Hell NO!!!  All our troops are doing anymore is babysitting oil wells and dieing everyday.  AS for his video, i just think it needed to be released sooner, cuz i didn't see it till election morning.  I'm just glad that he finally made a video that required people to admit that he isn't just another rapper who don't give a f***, but that he does actually have some views on politics.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nIt will never end, will it?\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nOk people, lets not let this become a political diatribe, it's a site for commenting on music. I very much enjoy political debate, but perhaps this is not the best place for it. But just while everyone else is throwing in their two cents, allow me to comment.\n\r\nThe fact of the matter is, if you ask absolutely anyone that hasn't bought into the Bush administration's jingoistic bullsh*t, they'll tell you Bush, whether he's well-meaning or not, has done nothing but help ruin America, put it even more at risk of attack and has massively increased anti-American sentiment. It's really disturbing how anyone that realises this and speaks it is branded \"anti-American\". Eminem clearly realises this and is attempting to target his audience; young voters, students and the black minorities. As we can see from the huge rise in voting in 2004 from these minorities, politically-inspired music does make an impact, and that includes Eminem.\n\r\nHave none of you pro-Bush people realised that never in modern history has a sane major recording artist released pro-establishment music? Music is a big medium for dissent, and Eminem is very much one of the more outspoken examples of this (though even I admit I'm not a huge Eminem fan, though he still has a lot of correct things to say).\n\r\nPeace.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\n\"Strap him with an Ak-47, let him go, fight his own war\r\nLet him impress daddy that way\"\n\r\nThats the best line ever, and it is very true, let that son-of-a-bitch that we call our president fight over in Iraq, so he can see what he has caused, how stupid it is to be fighting for Oil and Terrorism, you can win the War on Terror it is impossible.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nspoken like a true liberal\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nHeh, I was planning on reading all of these comments, but there are just way too many pointless ones.\n\r\nTo philly: I remember a story when I was a kid about a boy who was throwing starfish back into the ocean as the tide went back down. He was approached by a man who asked why he was even trying, there were millions of star fish on the beach, how could you possibly make a difference. The boy threw another starfish into the water and responded \"I made a difference for that one\". I hope this is self-explanatory.\n\r\nI thought the video was interesting, I liked the style. I didn't like how (because of the time it was released) it was basically another political commercial. Maybe if it had been released a couple months after the election I'd honor it (though that would kind of make less sense on the video). \r\nAlso, what's up with MTV lately? I never remember them being so radical when it came to politics. It started out with the \"Choose or Lose\" but soon became \"Choose Kerry or Lose\". I especially enjoyed the \"Gay Doughnut\" commercial, as I call it; I could not stop laughing. Using doughnuts was probably a bad idea, as I interpreted them as representing something else... \r\nAnyway...\n\r\nPerhaps what led to my more conservative ideals was the fact that every mindless angsty teen was an extreme liberal. I know that more than half of the kids at my school didn't even know what was going on but were running around yelling \"Fuck Bush!\". This is how I see Eminem with this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nAlso, can everyone PLEASE stop using the prefixes \"pro\" and \"anti\" wherever the hell they feel it should be? It is really starting to get on my nerves.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nDont u see that eminem is right tho?\r\nAll you who support bush i have three words to say to ya YOU ARE THICK.\r\nSay if someone started a terrorist attack on america, bush would be like \" I dont want no violence, lets go blow the whole country up killing thousands of innocent children because of like 50 ppl. But who cares, cos i rule over america and what i say goes\"\r\neminem may be an asshole, but hes got bush 100% right.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nok yall evidently no nothing of politics for the united states to go to war u have to have a 2/3 majority vote in congress so without congress we would have never gone to war so if ur gonna point out the goin to war crap u can blame it on bush but blame it on congress too\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\npersonally i blame americans for the war, you were all two scared after 9/11 which is to be expected but come on you shouldnt have been that scared that long. then you put a republican whose father failed in iraq. then you go back to iraq ues little countries like ireland(come on the irish) to refuel then dont ofer them status as allies in the rebuilding yet somehow three of our cirtizens working for american componies get there head chopped off\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nhis father did not fail the object was to get iraq from kuwait which we accomplished so our work was done and we left\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\ni really hope hardrocker was being sarcastic. [shudder]\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nhawrtbraykr needs to be publicly executed. we need to start making examples.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\n\"abortion is murder...so what? have the fucking baby and put the kid up for adoption dont kill it...i can tell you grew up in a great home...poor poor son of a bitch...think about life you are killing someone you idiot\"\n\r\ngrow the fuck up. if it weren't for abortion even MORE children would be raised in unfit homes then there are already. these children who only grow up to hurt themselves &or others. child welfare is already WAY over their heads. i fully support population control. i was adopted & my parents fucked my shit up.\r\nif only i could kill you for being an idiot. social darwinism at it's finest.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\n\"abortion is murder...so what? have the fucking baby and put the kid up for adoption dont kill it...i can tell you grew up in a great home...poor poor son of a bitch...think about life you are killing someone you idiot\"\n\r\ngrow the fuck up. if it weren't for abortion even MORE children would be raised in unfit homes then there are already. these children who only grow up to hurt themselves &or others. child welfare is already WAY over their heads. i fully support population control. i was adopted & my parents fucked my shit up.\r\nif only i could kill you for being an idiot. social darwinism at it's finest.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\n\"if no woman wants to have an abortion, and doesn't want a kid, then maybe they shouldn't be having sex. If you have sex for fun, be prepared to suffer the consequences, as if bearing children was such a harsh consequence.\"\n\r\nyou ever hear of an ACCIDENT? condoms break, you know. what about rape, eh? i'd rather a child not be born than be born into an unfit situation that will only further harm it. look at the bigger picture, you fool.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nrhcprox & jesusfreak (HA!)...you should've been aborted.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\n\"It's terrifying, even in an undereducated country like this, when someone like Eminem has more on the ball intellectually then 51% of the country.\"\n\r\nHA! That killed me DJ. <33\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nrhcprox makes us look bad. I swear to Conan, not all of us teenagers are brain dead.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\n\"only cool people would say fucking and fruitcake in the same sentence...\"\n\r\n& only someone with an IQ lower than a moldy potato would say something like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nhey all u fucking dumb asss its a song dont get me rong i hate bush to but u all are being really stupid being like this this song rocks its all true and em dosnt think hes gonna stop the war with this song hes just trying to open peoples eyes to wahts going on and how we have the power to stop it an dpick whos in charge. oh btw i head that em voted for bush\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nI think this song is pretty cool, not the best, you know? But he made many good points in his song, he is expressing himself like all artists. I was hoping he reached more young voters, but oh well, i guess. i didnt really like the video. those cartoon people kind of bothered me. did you see the shady national convention? I dont know, but he didn't seem to have an agenda. I guess it was a concert? not sure. but yea, mosh is a good song, but like i stated, not the best..but very very anti bush and oh so right, lol (at least for me, of course everyone is different)\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nI think the tune is pretty good, word's right, some of the rhyme's smart.\r\nyea, it's a good song.\n\r\nstatement or not, it's a song, let's just enjoy it per se.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nok well ive seen a few words bounced around about alot of wars... let me clear up a few things here.\n\r\nWWI was a waste of everyones lives, the war started cause of the assasination of one person and then became an alli war. one country calle din its friend the other country called in its friends, then those caountries called in their friends.\n\n\n\r\nWW2 certainly was worht the time, we shoudl ahve gotteh into it before peal harbor. it was rediculus that we were so late to join. think of all the damage that was done to people while we sat and jerked off. there were NAZIs killiing everyone. i mean these are the people that set the definision for fashism.\n\n\n\n\n\r\nand to go back to music, it was originaly a distraction from suffering, war and opression. somthing to forget about the woes in life or tell a story. \n\n\r\nsince then starting in england it bacame a tool for the rich cause well only rich people could afford the instruments. how cheep do you think a harp was then. \n\r\nbut mroe to the point since the invent of radio its been a tool of the rich against the poor, all the way through the 50s it was a way for the mass spread of propaganda, dont worry about us killing people, being good to your man, or your woman being good to you in more important.. so it was only fitting that people that realised that ti was a tool picked up intruments to rant against how people were being blinded from what was realy important, this was alittle more cryptic in the 60s cause of the heavy drug use, but it was a start. then punk came around im not tlaking about the pussy ass fuckin emo rock like blink 182, i will get back to bands like them in a min. \n\r\npunk started in the underground in the late 60s early 70s, it was made popular in the late 70s by bands like the ramons and  the dead kennedys. the first fake punk band was the sex pistols so if anyone has anything to say about them just look at the producer for Bow Wow Wow, the name might look familiar from the producer of the sex pistols, thats because much like he assembled the 80s band he assembled the sex pistols. cause tyhe guy that produced the sex piustols was realy good at beating trend befor the real bands could make it popular he would place pupets in the spot light. \n\r\nbut back to the point of punk. it was peoiple REALY rebelling against the talented sheep that were sent to lead the flock of music fans that were tought that love and relationships in your life were the most important thing in the world. punk was telling people that there were people dying that had never heard a radio pluged in making radios for people that would just cruis through lift thinking the bitch on their arm or the jerkoff they were clinging to was what life wqas all about.\n\r\npunk was information, listen to any dead kenneys album, they dont have one song about bad relationships, thats real punk. not these makerting tools on TV. the sum 41s, blink 182s, any od that shit.\n\r\nnow how this all connects to eminem... has he sold out alittle... yes he has sold out quite a bit. but he signed when he was blinded by famebut unlike most  it seems he has learned form it.  most of his albums has been mostly syterical with one pop song and a few political points. \n\r\nguess what binds him. A CONTRACT. when you strike a record deal you sign an unreversable contract. thast why peal jam released 3-4 live albums, simply to get out of a binding contract. \n\r\neminem has to release a predetermined number of albums  and untill that  contract is up he is the record companies bitch.  just like south park as a show isnt respocible for the merchendise its comady central that makes it all. the record label is respocible for marketing not eminem\n\n\r\nso songs like white amerixa where in the video he clearly calls his mainstreem fans sheep for the most part. and lets see, the way i am, square dance, and now mosh. yeah those are real manstreem ideas that sell records\n\n\r\ndo i belive he is sincere in this song, yes, do i think he is trying to say he is a revolutionary , no. do i think he is tryign to let people know there is more to the word fight then kicking ass, yes. but i also belive that if he did a video about full out revolution he would disapear, or at the least not be on a label any more and probly be involed in a lawsuit for some dumb reason that would remove all his money.  and then he would go underground but no one would care, cause he wasnt doing the pop hits that his label forced him to put out.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nI don't know where to begin with this, so let me just say this off the top.  Rhcprox or whatever, you are a waste of my, and all of our collective time.  If YOU get a free ride to college, I want to know where so I can petition AGAINST it and give it to college students who have an OUNCE of intelligence.  You have no free thoughts for yourself, you just ride the coattails of what everyone else says.  You made a bunch of BS points towards the middle of this that got COMPLETELY shut down.  You were proven wrong by FACT.  So you went and hit behind anyone who would somehow side with you in any way.  Case in point, opinionhead.  You called one of his first posts \"the most INTERESTING thing you had heard on this site\".  Clearly you thought he shared a lot of the same view as you.  Your tune quickly changed when he explained that (like me) he did not like Bush or Kerry.  You use religion as Bush has to fuel the fire.  I am Christian but I am also rational.  Anyone who says you can't be Catholic and support a woman's right to choose is totally bull.  I AM Catholic and I DO support a woman's right to choose cause of all the good points that have been made about rape and not being able to support a child.  I don't feel like spending my life here like you do.  However, you need to realize  one thing.  BUSH FUCKED UP.  He needs to understand it before we as a nation can move on.  I respect what all of our troops are doing.  They signed on for their duty and they are carrying through.  Kudos to them, and I support THEM for that.  I honestly don't understand how you can support the DECISION to send them there.  This is the reason the world hates us.  ... Actually I am sorry, the world doesn't hate our people for the most part.  They hate our GOVERNMENT.  Then again, it is a representation of the people because government is elected for the people, by the people.  A lot of people really don't have much of a clue whats going on.  An estimated (by cnn.com) 1 quarter of the voting population voted based on moral/religious views.  Of course NINETY percent of fthem voted for Bush.  Does that not seem odd to anyone?  In a society where we must keep such strict separation of church and state, that the state is chosen essentially by the church?  The southern states are SO hypocritical.  The children aren't allowed to learn the theories of Darwinism and evolution because it conflicts with the Bible.  I know not all religious people are irrational.  It just seems like everyone who was irrational turned out for the election.  Oh well, here's to another four years which I will probably end up being drafted by the end of.  Able bodied and 19, see ya guys later.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nWoah, so much for the whole no Bush arguement thing. I live in Canada, I dont need to put up with the Bush bullshit. But for whoever is pro-Bush....watch Farhenhiet 9/11 hahaha.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\ny'know... we would have to deal with iraq some time or another... and saddam could have had WMD's, we didn't know. but helping iraq, or any other middle-eastern country for that matter, is a lost cause. jesus of nazareth himself could not help those people. and yeah, we can't be push-overs and allow an attack like that to happen, but we should carefully consider our actions. the point is that war could have been the right course action if it was planned right, but we just angered them. and now we're stuck in this situation. now, i'm NOT saying that kerry would have helped, but it was worth a shot...still...in the end, no matter who was elected... this country will eventually sink into a deep hell-hole...\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nThis song owns... eminem is telling his point of view on Bush and Iraq and  i agree with him FUCK BUSH!\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nThree Words:  Victor Davis Hanson\r\nTwo More Words:  Noam Chomsky\n\r\nFour More Words:  Fucking stop it already!\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\ndark eternal i live in the southern states of america and we do learn the therories of darwinsim and rhcprox's comments were not shut down by anything thats been proven just opinions. and the reason 1/4 voted on religions shows that america is not run by the church because 3/4 did not vote based on religion and 90% of those who did voted for bush because he doesnt change his mind on a daily basis\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nI know not everyone down in the south doesn't learn that stuff, but some of the more deeply religious areas refuse to allow it to be learned.  That point aside, yes I respect that Bush didn't decide to be a wimp and pull away.  Yeah he made a decision, he stuck with it.  Good for him.  However, it wasn't the best way to go about it.  If he could just admit that I would have so much more respect for him.  I mean exactly what obeof said was right on.  Yeah war could have been correct if we planned it right.  Instead we just went tearing through.  Not right at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nI don't understand why the fuck ppl saying that bush is gangster?Bush kills soooooooooo many kids and moms,dads familys and ppl still vote for him.I think instead of killing pit bullsthey should kill bush he is noting but a murdur I hate him to death.The thing that would make me happy be 4 i die is seeing him die.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nIm agree with Canadiangirl & guiffporn...\r\n\"Strap him with an Ak-47, let him go, fight his own war, let him impress daddy that way\" excellent...\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nWow...see, this is sorta funny...I've just been scrolling up, glancing at the odd word...every other one is \"abortion\"...what's been going on here?!\n\r\nThis song is so much better, in my opinion, than Just Lose It. Ever noticed the 2 sides of Eminem? (if not, where ya been?!) There's Funny Eminem (eg Without Me, Just Lose It) and Serious Eminem (eg Stan, Cleaning Out My Closet). I find Funny Eminem r-e-a-l-l-y annoying...so hands up if you prefer Serious Eminem *raises hand* lol\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nWow...see, this is sorta funny...I've just been scrolling up, glancing at the odd word...every other one is \"abortion\"...what's been going on here?!\n\r\nThis song is so much better, in my opinion, than Just Lose It. Ever noticed the 2 sides of Eminem? (if not, where ya been?!) There's Funny Eminem (eg Without Me, Just Lose It) and Serious Eminem (eg Stan, Cleaning Out My Closet). I find Funny Eminem r-e-a-l-l-y annoying...so hands up if you prefer Serious Eminem *raises hand* lol\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nthe songs ok, but eminem gets repetitive after a while, and none of the new album is as good as his old stuff.\n\r\nhardrocker...i'v always wanted a bush fan to talk to...back up some of the things that youre sayin about bush and kerry...\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\n\"It's terrifying, even in an undereducated country like this, when someone like Eminem has more on the ball intellectually then 51% of the country.\" \r\n\"HA! That killed me DJ. <33\"\r\nDID IT REALLY BECAUSE CLEARLY YOU ARE ALL FOR THAT SO SUPPORT WHAT YOU BELIEVE RIGHT?!\r\nSo I haven't been on for a while...but I  must say the ignorance continues...so what if we support Bush, so what if Bush screwed up....like Kerry never has...you don't state facts you give your judgements upon people, and you're not God so you are not perfect so you are too very hypocritical...I'm not arguing for Bush any more I'm arguing for logic and that precious 1st ammendment. Logically speaking lets look at the people who are \"anti-Bush\" here they say Bush is killing people, innocent people are dying because of him blah blah blah then those same people are  USUALLYthe  ones who say support abortion, women should choose right?! Well in my opionion the people being killed in this war are not just some innocent people off the street who were ripped out of their synagogues and shot, they were people who agreed to fight for their leader and his opinions which America and any one loves freedom could look at and see that those opinions are very harmful and dictator like. And in my opinion babies who have not had the chance to use their natural right as a human being (LIFE, liberty, and the pursuit of happiness) are innocent people being killed. No I am not totally against it for cases that are deemed neccessary to use abortion but as a method of birth control seems wrong to me. And another thing I would like to say (not as a fact but as observation I found ironical) John Kerry once mad a speech in an attempt to convice the people that he too found Christianity important (not to say he does not) but as a christian I found it sort of ironic that Kerry said his favorite Bible verse was John 16:3 (when he meant to say the well known verse of John 3:16) well for those of you who might have read the Bible or are chrisitians you too may find it interesting that John 16:3 says \"they will do sucht hings because they have not known the father or me\"....thought it was weird that the verse he refered to was that....again I'm not trying to PROVE any thing but as a Christian I thought it was interesting. But on topic, you fight for John Kerry and you stand up for  drug-addicted, public offender like Eminem (who is only in it for the money any ways becasue he knows he doesn't make a difference if he sang the song or not except he got a 2 digit raise) and I will stand up for what I believe..I guess we will find out who his right in the end, but for now be logical and \"open-minded\" (i mean that is  supposed to be a liberal thing any ways) accept what others are saying wether you LIKE it or not. Ok go ahead cuss me out and say that I'm stupid and should have been aborted...maturity comes with intelligence too.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nexactly once again i must say i agree with rhcprox she makes another logical statement without bashing the other side as for the abortion topic, if someone kills a pregnant woman they are charged with 2 counts of murder one for the woman and one for the baby but if a woman has an abortion she isnt charged with murder. does ne one else find that fucked up. just checkin, but as for eminem being more politically correct than 51% of the country OMG thats some bs he didnt even know what kind of weapons america uses for war its not the ak47.and bush isnt killing innocent people if its him its congress and john kerry cuz he voted to go to war too.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nI'm not a fan of Eminem, but I think this song is great.  Although its not utterly difficult to make anti-bush lyrics..they probably come to most quite easily.  I've been reading all of your comments about war, relgion, aborition and gay marriage.  If you dont belive in an Abortion..dont have one!  I agree with those who say that one has no right to force their religious beliefs on others.  In my opinion evangelicals like Jerry Farwell are complete hypocrats anyhow because they act as if they follow the bible, but they're morbidly obese. Obviously they belive in selective sin.  You think Gay Marriage should be banned.  Well if it really affects you that much than DONT HAVE ONE.  I'm lucky to be in a school where I know a few homosexual couples and it opens you to different lifestyles and to say that they are grose is disgusting in itself.  They are still people and thats pure ignorance.  Also about the War in Iraq you think its solving for terrorism?  It's causing more terrorists to flow into the country so that is purely false.  Why are we spending our hard earned money on this war that should have never been fought.  If some people are so pro-life then why are they so pro-war.  We went into Iraq not even with a sufficient exit plan.  I think the best thing that kerry has said about the war is this \"what is the point of winning a war if you lose a peace\".  That is what we are doing.  Wake up and face reality with Bush in office their is a much greater threat against this country not only a threat of another massive terrorist attack, but a threat of the citizens of this country losing the rights that this country was suppose to stand for.  Also it doesn't matter whether you live in Canada or Europe what the president of america does affects the rest of the world largely.  Just because someone lives in another country doesn't mean that they don't know as much as americans do about our president.  I also believe that celebrities just as ordinary citizens have the same rights to express their political views and shouldn't be shun upon because they do so.  I finally have to ask how many innocent people should have to die for the hell of September 11th?  I'm anticipating the day that this country realizes what a huge mistake they made.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nwe made no mistake it will take as many lives as needs be to rid the world of terrorists and people like them. and american citizens are loosing no rights if ne thing were sharing are rights with the rest of the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nFor God's sake...so much bloody politics and morality and, er, stuff...how did this entire thing get on to abortion anyway? Politics I understand, with Mosh and all...\r\nWell, I don't want to get into a whole big thing. For one thing, I'm not American, so I don't really get all of what's going on there anyway. But this is all a little over. So you think abortion is murder and soldiers aren't innocent people - who cares?! No one here cares. It's songmeanings.net, not bigmassivedebatesaboutstuff.net. Go find someone who does care.\r\nGonna pick a fight with me now, aren't you? Well go ahead, if you like. It doesn't bother me. If anything, it's sort of funny.\n\r\nBy the way, hedgemon, I don't think he was trying to be perfectly and politically correct with the AK47 stuff. It's a rap, not an election speech. :P\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\n\"Gonna pick a fight with me now, aren't you? Well go ahead, if you like.\"\n\r\nhaha yeah clearly you WANT someone to do that...it's obvious... but if any of you read the American Idiot post I put up you will find that it is the same here too...you're doing what they want...but hey thannks hedgemon!\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nYeah, if I'm honest, I DID want someone to...but only coz I like to win :P \n\r\nI didn't actually get all of your American Idiot post. I don't know much about American politics, or anything. All I know is this is one of Eminem's best songs for a while now, even if it is a little too long. It's just really catchy\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nHedgemon,\r\nwith all do respect, we have no right to take away \"as many lives as we have to\" when we should not have been in this illigetimate war in the first place.  We will never rid the war of terrorists because they are always going to exist.  That is purely naive at large. Also about losing rights, we are essentialy losing rights as citizens of this country when our president wants to ban things like abortion and gay marriage just because it goes against his own religious beliefs.  He mine as well ban lieing and obesity and everything that is considered a sin in his precious bible.  It is purely selective sin which is thus wrong especially in the case that it is a president of a country who is exercising it.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nwith all do u respect I Heart Indie, it is not only against the christian religion to be gay and have abortions, but its against the constitution which our country is built upon  murder (which in my opinion along with about 55% of the country abortion is) and hes not trying to ban gay marriage like 2/3 of the country is.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nYeah the president alone cannot ban anything...he has to have a popular vote among congress, pass the bill through the house etc... I mean didn't just say yeah the bible is right i'm going to ban gay marriage he wanted to ban it yes but so did alot of others...he don't work alone...any-hoo he's not just doing it for religion...he's a man with values and a \"majority rules\" mind-set...\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nValues.  What would those \"values\" be.  And i know that it has to get passed by others other than the president.  I never said it didn't but that doesnt mean he doesnt propose it.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\noh and also.  Bush did win because of his beliefs.  It turns out that the number one issue at the polls was social issues like aborition, marriage, and also stem cell reasearch.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nbush sux he should go home\r\nLuv *Roxy* mwa mwa\r\nxxoo\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nthe ignorance is boundless\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nThis talk about rights is all well and good but i wonder what this country would be like if we talked less about rights and more about responsibility?\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nyou guys are so dumb.....\r\nyour not even talking about the song your fighting ovr the dumbest things ... \r\nstop doing it .\r\nthis is a website to TALK about MUSIC not POLITICS you can go to a different website for that god just fuck off and talk about the damn song bitches\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nthey are talking about music.. they're talking about what Eminem said in his song..  some people just went overboard, and i don't think it'll ever stop.  don't waste your time telling everyone to stop, because they won't... =P  just leave them be...let them make a fool out of themselves...\n\r\nOpinionHead: i don't think it will ever stop.  what a sad thing.  oh well!  let's move on, shall we?! =P\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nEminem obviously knows what he's talking about. He is a very well educated man who seems to know alot about the world and politics. He also knows how the country works and I'm sure he could make it better...o wait a second...thats right, this song makes no fucking sense whatsoever and proves that eminem is a retard who cant even identify political problems correctly! Here's a list why!\n\r\n1. \"Come along follow me as I lead through the darkness \r\nAs I provide just enough spark that we need to proceed \r\nCarry on, give me hope, give me strength \r\nCome with me and I won't steer you wrong \"\n\r\nOk, so emeinem is saying that he needs to lead the revolution against our government. How can a trailor trash guy like that \"lead\" people? How can he possibly talk about a revolution in government when he shoould be starting a revolution for more white people to wear South Pole?\n\r\n2. \"We gonna fight, we gonna charge, we gonna stomp, we gonna march \"\n\r\nAlright man, fight. I dare you. Put your angry mob against all of the people who want to fight for this country. Lets see who wins.\n\r\n3. Rebel with a rebel yell, raise hell we gonna let em know \r\nStomp, push, shove, mush, Fuck Bush, until they bring our troops home \n\r\nNow what exactly is he trying to get across here? Is he saying that if you bitch about the troops in Iraq then we'll bring them home? First off, NO WE WONT. Second of all, ask anyone who is home from Iraq what they want to do. About 99% Say that they want to go back there and help as much as possible. They have seen the true poverty in Iraq, and as human beings who wish to protect other human beings and their rights, the troops want to go back and help. Tell an Iraqi baby being held by a terrorist with an AK47 in one hand and the baby in the other that \"sory, kiddo, we're bringing your protectors home and I'm sure this guy with the gun will give you a life without poverty or violence.\" P.S. way to quote Billy Idol you fucking retard.\n\r\n4. \"Strap him with an Ak-47, let him go, fight his own war\"\n\r\nThis fucking IDIOT!!!! An AK-47 isnt even an American gun. At least make some sense.\n\r\n5. \"To disarm this Weapon of Mass Destruction \r\nThat we call our President, for the present\"\n\r\nSorry, Em. But that's just you, micheal moore, and the lesbians of the free world.\n\r\nThere's alot more thats wrong with this song, so i'm offering anyone else the opportunity to take over where I left off.\n\r\nP.S. Dont reply with \"hey mann bush is gay!!!\" If ur gonna say that. Explain why hes so \"gay\"\n\r\nP.S.S. \"He cant talk!!\" isnt an explaination.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\n1. \"Ok, so emeinem is saying that he needs to lead the revolution against our government. How can a trailor trash guy like that \"lead\" people? How can he possibly talk about a revolution in government when he shoould be starting a revolution for more white people to wear South Pole?\"\n\r\nyou can't disregard someone because they are \"trailor trash\". he's as capable as anyone else in the world. if bush can do it, so can he.\n\r\n2. \"Alright man, fight. I dare you. Put your angry mob against all of the people who want to fight for this country. Lets see who wins.\"\n\r\nfight for this country? we quit fighting for this country quite some time ago. now we're just arbitrarily fighting iraq.\n\r\n3. Now what exactly is he trying to get across here? Is he saying that if you bitch about the troops in Iraq then we'll bring them home? First off, NO WE WONT. Second of all, ask anyone who is home from Iraq what they want to do. About 99% Say that they want to go back there and help as much as possible. They have seen the true poverty in Iraq, and as human beings who wish to protect other human beings and their rights, the troops want to go back and help. Tell an Iraqi baby being held by a terrorist with an AK47 in one hand and the baby in the other that \"sory, kiddo, we're bringing your protectors home and I'm sure this guy with the gun will give you a life without poverty or violence.\" P.S. way to quote Billy Idol you fucking retard.\n\r\nas much as we want to help, we can't. especially not the way we chose to do it. we didn't even have a plan. and bush didn't send our troops to iraq to help them. all he said was that they had weapons that threatened the american people, and they didn't. had he said that we were going in to help the people in iraq, i might of supported the war.\n\r\n4. \"This fucking IDIOT!!!! An AK-47 isnt even an American gun. At least make some sense.\"\n\r\nokay, it doesn't actually say that an AK-47 is an American gun, so i don't see where you're getting this.\n\r\n5. \"Sorry, Em. But that's just you, micheal moore, and the lesbians of the free world.\"\n\r\n......anyway, just thought i'd analyze your analysis. as you see, i didn't agree with it very much.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nbtw, it's P.P.S. not P.S.S.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nIts hard to enjoy music when you are a conservative/republican. Most musicians are democratic and its something we have to live with. I just think Eminem, like many bands are jumping on the bandwagon of political music. And to make it worse, he released the song after President Bush won the election, so....yea. I would have thought eminem would like the president, he is giving him tax breaks.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nMan Politics can surely raise a controversy lol...i enjoy reading debates learning about both sides is interesting, there is just so much grey for me\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nyeah FUCK BUSH!!!!!! BUSH/SATAN 2004 BITCH\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nWow, hippiechick, I admire your carpet munching and cunt diving policies.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nBeing from OHIO incase anybody was wondering how GWB won the election, it was this. \"I don't want no democrat taking away my gun, yee ha\"  Nadar said it best when he stated \"People need to start doing there homework\" With a little more self education to the hill jacks in my great, but stupid fucking country.  Bush never would have gotten a point.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nAnother decent song by M however.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nM needs to step his game up and get out of the formula he uses. He releases one catchy pop/rap song, then releases something serious. Then he just tries so hard to piss off gay people and the government with the other tracks that it is starting to seem fake. Its all the same crap we have heard on Slim Shady and Marshall LP.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nHoly smegma on a stick... I read about half of the posts and couldn't take any more. Did it really take everyone 183 posts to realise that YOU WILL NOT AGREE!!?? \n\r\nAnti Bush people: Why try and reason with supporters of a man who executed 160 people (8 of which were physically or mentally handicaped) in a 4 year term (as govenor of Texas)? \n\r\nPro Bush people: I reeeeaally don't agree with you but why wind yourselves reading comments by ignorant-'fashion politics'-nambi-pambi-far-lefties???\n\r\nI'm from the UK and from across the atlantic it seems that America is a country run by three groups; the media, the church and the rich. I wasn't surprised that Bush was re-elected, if you base your politics on macho charisma rather than competence and wit what do you expect to happen (hahaha do I sound like a pompus limey or what?). The whole world seems to be being taken over by dull, selfish, uneducated antagonisers of  the free-thinking.  What do you get if you exchange fun and quality of life for constant hard work and oppertunism? A country that has over 5000 MacDonald's Restaurantes but no Department of Culture. Man, I hate to preach but with the amount of crap that was spouted in this discussion I felt I had to comment.\n\r\nOn the subject of Eminem, he is the greatest rapper of all time, both lyrically and musically. Anyone who thinks he is just trying to be 'in' with the lefty-celebrity crowd has clearly missed the point. He may be trying to stir things up... but if he is, good on him, he is making a brilliant song and intellegant argument whilst doing it.\n\r\nNow try to agree to disagree...\n\n\r\nP.S. hahahahaha Progrocker - \n\r\n\"Its hard to enjoy music when you are a conservative/republican. Most musicians are democratic\" \n\r\nRepublicans preach of nothing but hard work and quashing individuality and you wonder why they lack creativity, you don't cool guitar riffs in stock-broaking - muppet.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nbeautifully said unihill\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\neminem is full of shit. If Bush could fight this war he would, but he needs to stay alive to run our country...Bush is 1000 times better than Kerry could ever be. Eminem doesn't know shit. He needs to research stuff before making false accusations to MY president.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nfucken hell are you screwed in the head boycottfrance?! BUSH is a fucken ASSHOLE who should burn in hell forever! how can you think for one minute, actually one second that he is better?bush is a mass murderer and a dipshit\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nkerry is a frickin comi and needs to die with all the other liberal pinkos\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nand its obvious that bush is better i mean come on kerry couldnt even decide where he stood on issues, couldnt come up with ne thing bad about bush except the national guard thing (all the economic crap is left over from clinton its a fact that it takes about 8 years for the effects of a presidents economic plan to take effect)  so yes bush is better\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nthe only thing bad anyone could come up with for kerry was that he was a flip-flopper. there are so many more complaints about bush. i don't know anything about the 8 year delay in clinton's economic plan, so i can't comment on that. but why is there an 8 year delay?\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nthe delay is ne where from 4 to 8 years because the way the american economy works for it to make all the other major countries change theirs to compete it gets back to ours sucking in about 4 to 8 years after the plans are inacted the once that time passes we redue or economy and are on top for bout 4 to 8 years as best as my economic teacher described it hoped it helped a lil\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nExcuse me but the reason America has a 4 billion dollar deficit is because of Bush's top level taxation and millitary budget. The economy was booming during Clinton's presidency due to his trade policys that Bush has now revoked. The notion that Kerry was a 'flip-flopper' is completely generated by the predominatly right-wing media in the states. \n\r\nAlso America should be ashamed by the amount of aid they have allocated for the Tsunami. Britain have pledged over 100 million pounds whereas America, whom are around 150 times richer than Britain have allocated a pittyful 50 million dollars. A report recently showed that that is the amount they spend in ONE NIGHT occupying Iraq.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nthis song is brilliant- I couldn't agree more with his political views- so all u eminem-haters, back off of the guy, read the lyrics of the song which HE WROTE HIMSELF- America is a free country, so if you can post your opinion on a public message board for the world to read, Eminem can write and rap about his opinion for the whole world to listen to. which is what he does, and look at how successful he is in doing it- no one could do it better, and you know it. He is the only rapper who does more than use his voice to entertain- he uses his powerful lyrics and his opinions to entertain. Let the guy do what he wants, he lives in a free country just like you do, and he is entitled to his own opinion.\n\r\nAs for the Tsunami, many countries feel that America has not provided enough aid in this matter. However, I'd just like to say that, granted we are a lot richer than Britain, we are located about twice the miles away from Asia than Britain is. We can't help them as fast as closer countries are able to. We are doing the best we can over here. Not to sound selfish, but we need to support our own country as well in times of war. Although I don't agree with the war we are fighting right now. Just because America is richer than other countries doesn't mean that money grows on trees over here.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\ni luv this song i agree it wit fully, bush is an idiot. and also the beats the shit\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nno unihill im sry but the great economy from clintons administration was a result of Bush seniors economic policy read the ecnomic books from the time of clintons administration it says so or just take a basic college economic course and ull learn about that\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nI love this song...the video is awesome...wish they could have played on mtv or something before the election...oh well\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nThis video was playing before the election.\n\r\nThe ending was altered after the election.\n\r\nIt's a good song that raises some good points, it's too bad most people that listen to Eminem are 14 year old boys with little to no political influence.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nit means that bush lyes about everything he says cuz he can rule the middle east . i guess.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nI thought this was the best song off his new album. He seems to be running on autopilot though. Maybe he's just spread himself too thin.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nok the first post i read on this said lets not get into an argument about pr. Bush ok people? Well hardly any of you listened to this. The name of this website is \"SONGMEANINGS\" if u haven't realised, not \"LETS-ALL-HAVE-OUR-OPINIONS-AND-GET-INTO-ARGUMENTS-WITH-EACH-OTHER\" people come to this site to see what the song they are looking for is about. Not to see people arguing over stupid little things. so if your going to write in here, write about the song not about your views and morals and all that.\r\n\"Let the president answer a higher anarchy \r\nStrap him with an Ak-47, let him go, fight his own war \r\nLet him impress daddy that way \"----best lyrics in the song. Really gets to the point of what this song is about, let Bush fight his own war instead of putting innocent peoples lives at risk.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nLook, '05, don't roll up in here telling the veterans what to do.\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nheres one to think about\r\n(in direct reference to the MEANING OF THIS SONG)\r\nin my little town of about 400000 folks there were 7 fancy electric voting machines at my precinct.  at the neighboring precinct, which is predominantly black, there were two.  what the fucking fuck is that fucking shit the fuck about?  its fucking about a fucking inelective motherfucking election.  thats what the fuck its about.  \r\nflipflopper?!?!?!?  what the fucking fuck does that fucking mean?   do you fuckers have fucking bill oreilly jammed down your throats, acting as a surrogate motherfucking larynx?\r\njesus christ, dubya has kidnapped jesus christ, changed the meanings of words like freedom, morality, democracy etc\r\nwhich is how fascists opperate, whether they know it or not, and i got a sneaking suspicion he aint exactly in the know.\n\r\nheres a little couplet i wrote a couple years back:\r\nneoconservatism is sadomasochistic pedafelia demagogeurry*/ john ashcroft jerks off to the delia's catalogue, b\n\r\n*i dont know if this was a word before, but it is now\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nps fucking hedgemon....you ever hear of the war powers act????    it takes a 0 thirds majority of congress to go to war, and it has for forty years. congress hasnt declared war in quite a long time.    but just recently our retard-headed congress eliminated the sunset provision to that retardheaded act and now we're totally fucked.  robert byrd was the only senator to vote against that or the Patriot Act For The Oppression of All Descent Which Will Eventually Lead to Mass Murder and Possibly the Collapse of Western Democracy Altogether.  also hes a pretty good banjo player\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nps fucking hedgemon....you ever hear of the war powers act????    it takes a 0 thirds majority of congress to go to war, and it has for forty years. congress hasnt declared war in quite a long time.    but just recently our retard-headed congress eliminated the sunset provision to that retardheaded act and now we're totally fucked.  robert byrd was the only senator to vote against that or the Patriot Act For The Oppression of All Descent Which Will Eventually Lead to Mass Murder and Possibly the Collapse of Western Democracy Altogether.  also hes a pretty good banjo player\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nI am just glad the election is over finally...but shall this shit be rehashed in four years?  I am guessing yes...then it will be Jeb Bush vs Hilary Clinton.  If Howard Dean has any balls, he will run again.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\n87 billion dollars could have bought a whoooooole shit load of anti terrorist counter measures. Several times over. \r\nAND we wouldnt have lost thousands of OUR troops in the war against terrorism. \r\nThat 87 BILLION, dollars could have bought, and updated the best counter terrorist systems in the whole of the US.  Are you really going to tell me now that 87 billions dollars would not have protected the US from ANY future large scale terrorist attacks? \n\r\nWTF\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nI love the line\"....Strap him with an AK-47 let him go fight his own war let him impress daddy that way...\"  cause that's what this is all about impressing daddy and making daddy proud!  We don't need to be in Iraq!!  there was no need to go.  All it's done is divided us as a nation, make the rest of the world hate us, and kill innocent sodiers who don't need to be over there in the 1st place.\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nPowers of war, let them be damned\r\nWith a river of blood, let them be slammed\r\nThe power in the halls may run the joint\r\nBut the powers that be will make a point\r\nOur nations like others will be judged on its deeds\r\nShall we be in Heaven without wants or needs?\r\nShall we be in Hell for the longest spell?\r\nI don't have the answer, I can never tell\r\nIt's hard to trust anyone over my head\r\nThere's a battle there I really, severely dread\r\nElite against mass, the cycle just goes\r\nI can't define it, it's only empty prose\r\nOrwell did it best and so did some others\r\nI consider those dissenters my brothers\r\nThose who fight on the field deserve praise\r\nOn a pedestal they'll be seen and raised\r\nI hate war, it's a cycle that brings sorrow\r\nI guess without it, we might not see tomorrow\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nOk\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nClue 5:  The number in this clue is drowning slowly. What is sinking much faster?\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nhuh??\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nfucking  mooofagot or whatever yes ive heard of the war powers act and if u read alll my posts ive clairfied it takes congress to give the money for war so without congress no war dumb ass. and god bless 4 more years of the great GEORGE W BUSH because american and the world are saved\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nYeah right u stupid fuck!!!  What the hell is wrong with you?!?!  We have no reason to be at war w/ iraq, we can't make abortion illegal is just gonna casue chaos, and same-sex marrages go under the equal rights thing.  Why do u like that stupid ass-fuck anyway??  He's just stupid!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nwe have every reason to be at war with iraq u stupid bitch. they broke a UN resolution (checking on the number and designation will post when i have it) when they developed balistic missiles and no that is not a WMD mearly a rocket to fire one on. so therefore since the pussy UN wouldnt do ne thing we decided to one of many reasons we invaded not to mention protecting america. if u havnt noticed abortion will be made illegal and its causing much more chaos being legal if u havnt noticed the abortion clinic bombings. and samesex union not marriage dont go under equal rights read the fucking constitution. same sex UNIONS will be outlawed and thats a good thing. and dang last time i checked the great GEORGE W BUSH was considered pretty dang smart they dont let just anyone into yale ya know not to mention his perfect standardized test scores. next time u want to debate get some fucking facts you asswipe. roe is filing to overturn the courts decission to make abortion legal it was her who made it legal in the first place. and all states without same sex unions have stated they will not make them legal all states with it will follow or force the concervative supreme court to decie what will that outcome be u stupid fuck america is about to be right again strait marriages living babies and our military and great president protecting us. now if u want to continue try and get some facts.\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nOk, First, before you start suggesting that I don't support our military let me just say I DO!!  What I don't support is what they are being forced to do.  \n\r\nAbortion should be legal because its gonna happen whether its Legal or not.  The only difference is if abortion is illegal its gonna happen in alleys, garages, ppls houses, and other unsafe places!  \n\r\nU know what, U know who gave Iraq their weapons??  US!!  THE UNITED STATES OF AMERICA!!!  And they haven't found any of them left so why are we in there still??  \n\r\nAs far as same sex marriges go, WHO CARES WHO OTHER PPL MARRY???  WHATS THE BIG DEAL???  If someones happy why take it away from them??  Isn't that what our CONSTITUTION says??  The 1st amendment:  Everyone has the right to LIFE LIBERTY and the PERSUIT OF HAPPINESS!!  Or are you too stuck on ur so called \"president\" that u don't remember that??\n\r\nAnd as far as Bush getting into Yale and Harvard:  I never said he was stupid before he started drinking and doing drugs.\n\r\nAnd if Bush can't even remember he owns a timber company what makes you think he can remember what he wants to do for our country??\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nOk, First, before you start suggesting that I don't support our military let me just say I DO!!  What I don't support is what they are being forced to do.  \n\r\nAbortion should be legal because its gonna happen whether its Legal or not.  The only difference is if abortion is illegal its gonna happen in alleys, garages, ppls houses, and other unsafe places!  \n\r\nU know what, U know who gave Iraq their weapons??  US!!  THE UNITED STATES OF AMERICA!!!  And they haven't found any of them left so why are we in there still??  \n\r\nAs far as same sex marriges go, WHO CARES WHO OTHER PPL MARRY???  WHATS THE BIG DEAL???  If someones happy why take it away from them??  Isn't that what our CONSTITUTION says??  The 1st amendment:  Everyone has the right to LIFE LIBERTY and the PERSUIT OF HAPPINESS!!  Or are you too stuck on ur so called \"president\" that u don't remember that??\n\r\nAnd as far as Bush getting into Yale and Harvard:  I never said he was stupid before he started drinking and doing drugs.\n\r\nAnd if Bush can't even remember he owns a timber company what makes you think he can remember what he wants to do for our country??\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nOk, First, before you start suggesting that I don't support our military let me just say I DO!!  What I don't support is what they are being forced to do.  \n\r\nAbortion should be legal because its gonna happen whether its Legal or not.  The only difference is if abortion is illegal its gonna happen in alleys, garages, ppls houses, and other unsafe places!  \n\r\nU know what, U know who gave Iraq their weapons??  US!!  THE UNITED STATES OF AMERICA!!!  And they haven't found any of them left so why are we in there still??  \n\r\nAs far as same sex marriges go, WHO CARES WHO OTHER PPL MARRY???  WHATS THE BIG DEAL???  If someones happy why take it away from them??  Isn't that what our CONSTITUTION says??  The 1st amendment:  Everyone has the right to LIFE LIBERTY and the PERSUIT OF HAPPINESS!!  Or are you too stuck on ur so called \"president\" that u don't remember that??\n\r\nAnd as far as Bush getting into Yale and Harvard:  I never said he was stupid before he started drinking and doing drugs.\n\r\nAnd if Bush can't even remember he owns a timber company what makes you think he can remember what he wants to do for our country??\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nbush doesnt own a timber company  \n\r\nyes we gave iraq weapons tanks and guns from the 50's nothing else\n\r\nabortion is murder if scott peterson is being tried for two murders the ladies and the unborn baby then all abortions ARE MURDER \n\r\nhes ur president too\n\r\nwere still in iraq to finish the job they would be in horrible shape if we left there in quite good shape now exporting more this year than the past 3 years combined and making a gdp about twice as large\n\r\nno soldier is being forced to do ne thing they can request a transfer and they knew it could happened when they joined up.\n\r\nthats not the first amendment the first is Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances\n\r\nand im pretty sure he remembers what he wants to do for the country he didnt change his mind every stop of the campaign like john *french* kerry\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nYeah, bush DOES own a timber company go to factcheck.org(the one Dick Cheney got wrong at the VP Debate)\n\r\nJohn Kerry didn't change his mind every step of the way and at least he knew what he was talking about. \n\r\nSadly, Bush is the President of the United States.  But I don't think of hom as president.  I think of Chaney as president..  After all, he is the one running the show here.\n\r\nActually, soldiers can't ask to be transfered.\n\r\nWE SHOULDN'T HAVE IN IRAQ TO BEGIN WITH!!!  IF WE WEREN'T THERE WE WOULDN'T HAVE TO BUILD IT BACK UP AGAIN!!!!  DUH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\r\nWhat Scott did was murder.  He killed Laci cause he's a psycopath.  Connor(the baby) died because he was dependent of the mother.  If you followed the trial he was chareged 1st degree for his wife and 2nd for his baby.  Like I said if you go to that song abortion is murder by POD you'll see I disagree with abortion but I support keeping it legal cause it's gonna cause even more chaos if it's illegal.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nOk just to show you how dumb this guy(the U.S.A.'s so called \"president\") really is here's some of his quotes(he actually said these)\n\r\nThis one cracks me up:\r\n     \"The United States has no right, no desire, and no intention to impose our form of government on anyone else. That is one of the main differences between us and our enemies.\" \r\n                                         - 2005 State of the Union address, Washington, D.C., Feb. 2, 2005\n\r\nThis is another one:\r\n    \"We are in Iraq to achieve a result. A country that is democratic\"\r\n                                          -(See above...) 2005 State of the Union address, Washington, D.C., Feb. 2, 2005\n\r\n     \"One of the most amazing events of my life, at least as the presidency, was to go to the NASCAR Race here at the Daytona 500.\"\r\n                                            -Daytona Beach, Florida, Oct. 16, 2004\n\r\nThis one scares me a little, if what we're doing in Iraq is peaceful what's not peaceful to him:\r\n        \"The world is more peaceful and more free under my leadership.\"\r\n                                           -White House, Oct. 28, 2003\n\r\nHe hit the nail on the head this time:\r\n        \"I'm the master of low expectations.\"\r\n                                         -aboard Air Force One, Jun. 4, 2003\n\r\nfor more go to dubyaspeak.com/  its great!!\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nHey hedgemon, I read what you said about Kerry on the American Idiot page, HOW DARE YOU CALL HIM A TRAITOR!!!  HE IS NO TRAITOR!!  I DIDN'T SEE BUSH RISKING HIS LIFE IN VEITNAM!!!!!(another war we shouldn't have been in)  BUSH HAS NO MEDALS OF WAR, NO BRONZE STAR, NO PURPLE HEARTS!!!  SO DON'T YOU DARE CALL HIM A TRAITOR!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nkerry is a traitor it is common fact. after he left combat prematurely do to a lupol in the armed forces laws he recieved orders from comunist north vietnam and the veitkong and act of treachery. we should have been in iraq to begin with it was needed sadam needed to be taken out of office it was neccesary for the survival of the world. dont try arguing that point cuz we didnt leave him in office long enough to see the consequences which is a good thing\n\r\nsoldiers can ask to be transfered after all kerry did it in vietnam.\n\r\nbush DOESNT own a timber company he merely sold timber to a friend and filled the $80 on his income tax like your soposed to.\n\r\nand if u do a lil fact checking ull see that kerrys medals were all shams his commanding officers and subordinates all said it was self inflicted wounds from neglection and stupidity watch swift vets for truth ads it will show you. and he wasnt deserving to of the wounds he got purple hearts for were fixed with a band-aid.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nwhy don't ppl like u accept the truth??  Seriously!!  \n\r\nSo tell me what would Sadam have done if we left him in office??  I mean he didn't have any nuclear wepons.\n\r\nKerry's medals weren't shams.  Maybe you should get ur info from a resource that isn't so conservative.  Maybe you should get it from an UNBIASED source\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nswift vets for truth are predominatly regestered democrats. unbiased like who the media is liberaly biased. swift vets was just stating the truth.\n\r\nsadam would have developed nuclear and bio weapons. \n\r\nhis medals were shams read up on how he said he got them and then the truth from the commanding officers and subordinates who witnissed it. \n\r\nwhy dont u accept the truth george bush being elected is a good thing. iraq was neccesary.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nSadly I do accept the truth that he was elected**sigh**  but that doesn't mean I have to like it.  How would sadam have developed nuclear weapons??  U know what I don't really care anymore.  If ur calling me unbiased ur wrong.  and where did you get the idea that his medals were shams??  Do u think we should go into iran too cause if we do there's gonna be nuclear war, cause they DO have nuclear weapons(as we do too)  and then the world is basically gonna turn to a living hell cuz our \"president\" is making stupid decisions.  and technically we're not even at war cause it didn't go through congress.\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nAnd it wasn't necissary to go to Iraq cuz there wasn't isn't and won't be any weapons of mass distruction there.  And even if Sadam was still in Iraq htere wouldn't be(he's not THAT stupid)  And the only reason we were there is cause Bush got scared cause of sept 11.  I was too and I think every american was but going into Iraq shouldn't have happened cause Bush got scared\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\n**theory**\r\nWe have liberal/democratic media. Eminem was paid to say these things about president Bush in order to influence the 18years+ fan's vote in the November election. It is like Puff Daddy with his \"vote or die campaign\" (whatever the fuck that means). Do you think Marshall or Puffy want you to give a rat's ass about politics.?\r\nMTV wants you to vote... for Kerry.\n\r\ngee wiz,\r\naren't puppet shows fun?\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nw/e.  Thats all I have to say W/E\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nI have a theory for all of you\r\nIt's very shiny and very new\r\nWe are fighting and it's so fun\r\nTake me away to Room 101\r\nConvince me that two and two make five\r\nIf I accept it  then I will leave here alive\r\nI feel compressed by all this angry chatter\r\nLet's just face it, all of it does not matter\r\nFrom the conspiracy theory nuts\r\nto those who make the budget cuts\r\nThey don't know an inked asshole\r\nfrom a forty-foot telephone pole\r\nI feel that I'm the only sane one left\r\nI am at a loss for being really deft\r\nI am on the inside trying to run out\r\nAgainst this stupidity, I will shout\r\nBut I'm trapped and can't escape\r\nI will dry out like a withered grape\r\nClearly lacking a strong, sound mind\r\nI will be truly and duly maligned\n\r\nAnyway, I think everybody on this thread needs to go outside and breathe some fresh air.  Politics is a retarded subject...Bush and Kerry are members of two different wings of the same aristocratic party.  If you support either one of them, you should be ashamed of yourselves.  Think independently from the mainstream, stand on the edge.  Those who chose the mainstream are stuck in a rut, a fitting socket.  When you are on the edge, you get the right to mock it.  Fuck the Republicrats, go your own way!  Go your own way away from the mainstream candidates!  You can vote for your own man as long as you vote for somebody who isn't Democrat or Republican!\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nok what the hell was that all about??\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nI am a zealot for political apathy, what can I say?  I want the debate to cease...but nobody will ever listen...I know that much.  That's why I write weird shit like that, so I get people to stop debating over dead topics.  The war is over, so let the sleeping dogs lie.\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\ngood point, but if someone wants to push me, I'll push back, if ya catch my drift\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nUnihill is talking a lot of sense and therefore is just about the only message worth reading. There seems to be an awful lot of crap people are talking about. Why any country as powerful and supposedly educated as America would want Bush as President to me is astonishing BUT fair enough. At the end of the day he is not the fascist most people seem to be caiming although he is a money grabbing, suprisingly intelligent (occassionally) person. Howevr, those retards calling Kerry a communist need to get a grip of reality. Just because he is not a fundamental, christian redneck does not make him a hater of capitalism as you appear to be claiming. \n\r\nAnyway the song is average, good video, decent lyrics over the top.\n\r\nP.s From abroad it appears that America has somewhat lost the plot in recent years and wondering what Americans feel about the negative opinion there country faces especially from European countries. Just wondering if they feel bothered or not or there views on the negative opinion they face from abroad???\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nnot bad...for a WHITE RAPPER...political rap is good, stuff about slapping bitches around is just plain fucking boring and sadistic, and when they aint saying, im the best worship me blah blah blah...to be frank tho, i don't think whites were ever all that great rappers...the few rappers, who care about the music, and not money, and slapping hoes are good, and Eminem just aint it...go try some of Ice-T's shit, or his rock group Body Count's stuff they did some political shit\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nLet's not get all racist cause there's no point.\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nThis song makes me so mad but then again Eminem has freedom of speech and also no matter what he says about Bush someone will be mad. Personally I think music and politics need to be seperate but freedom of speech is important.\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\num if ur saying EminEm is black.....HE'S NOT!!!!! And obviously Bush isn't black.  So, where the HELL did that come from??\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nF*** BUSH THIS SONG IS GREAT BUSH IS A LIAR AND MANIPULATOR. HE BENDS SMALLER COUNTRIES INTO FOLLOWING HIS PHSYCHOTIC URGES. BUSH IS INSANE AND DESERVES TO DIE. HE HAS AN I.Q OF LIKE 50 WHICH IS LIKE RETARD AND HE SENT PPL TO WAR IN IRAQ FOR ALL THE WRONG REASONS. DOWN WITH BUSH EMINEM WAS RIGHT \"Come along follow me as I lead through the darkness \r\nAs I provide just enough spark that we need to proceed \r\nCarry on, give me hope, give me strength \r\nCome with me and I won't steer you wrong \r\nPut your faith and your trust as I guide us through the fog \r\nTo the light at the end of the tunnel \r\nWe gonna fight, we gonna charge, we gonna stomp, we gonna march \r\nThrough the swamp, we gonna mosh through the marsh \r\nTake us right through the doors (c'mon) \"\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nYo VirtualFactor u is bein a bit of a racist prick so do us a favour and shut the F*CK up asshole\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nHey TJ....Kerry's a loser...get over it....there's always suicide, cowboy.\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nMartin, what the hell does that have to do with what TJ said?\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\n\"um if ur saying EminEm is black.....HE'S NOT!!!!! And obviously Bush isn't black. So, where the HELL did that come from?? \"\n\r\nWhat a fucking stupid comment greendaybaby, if I hear you say \"what the hell are you talking about...\" one more time to people who are far wiser and more interesting than you then I'll fucking come over and kill you you braindead hedgemon research monkey slave.\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nIts not EminEm its eminem and unlike you i realise that he's fairly mediocre and that green day aren't the best band in the world, and hedgemon's blatantly homophobic and apparently racist views are nothing to be defended.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nchocolate resorting to threatening higher inteligence now are you? his/her comments are far wiser and superior than any comment i have seen you post on any board.\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nshe fucking thinks its EminEm, she takes offence at everything, she isn't cleverer than virtualfactor. Read through virtualfactor's posts and you'll find he's one of the best and most original contributors on the board. I never said I was smarter than green day baby but I never claimed I was.\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nOk forst, I take back what I said to you on the american idiot page chocolate.  Hedgemon doesn't seem to be racist so where do you get that?  And MY OPINION is that Green Day is one of the best bands.  You don't have to agree with me.\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\ni'm so impressed by your lack of reaction to what i said to your comments green day that i take back all of those insults, sorry. It just annoyed me that you were having a go at virtualfactor who has been nothing short of brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\ni suppose people tend to go over the top when they're defending someone else because you feel that you're no longer accountable for what you say\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nDUDES!!\n\r\nthis song is not about politics at all. that is just a cover to hide the truth. eminem is a child molester and this is his way of expressing it.\n\r\nword.\n\r\nps eminem rules, canada drools lol\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nYou know nothing coolguy, this song was written 'because eminem is black'. What virtualfactor says is always right.\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nYeah ok coolguy, and Micheal Jackson isn't.....\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nsorry green day, i agree with you, eminem isn't a child molester\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nNo he didn't and what does that have to do with child molestation??\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nquiffporn has everything to do with child molestation, i think he may have invented it.\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nDUDES!!\n\r\n\"All the people up top on the side and the middle \r\nCome together \" \n\r\nWTF THAT IS TOTAL CHILD MOLESTATION!!\n\r\n\"Imagine it pouring, it's raining down on us \r\nMosh pits outside the oval office\"\n\r\nOVAL OFFICE IS THE ANUS OF AN INFANT!! DUDES!!\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\ni think you may be right, but i think virtualfactors right too\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nI still don't believe it\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\non judgement day, all non-believers will be sentenced to eternal destruction where they will be tortured incessantly for no reason\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nhuh?\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nand another thing just cos i hate bush doesn't mean I like Kerry. in fact i agree Kerry is a twat abortion is murder and gays are wrong both of which he supports but wat I'm sayin is think outside the box elect in a independent electorit instead of Bush the bastard or Kerry the nancy murderer puffta boy.\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nWOW!!!  BACK UP!!!  ABORTION MAY BE WRONG IN YOUR EYES(MINE TOO) BUT THAT DOESN'T MEAN IT'S OUR DECISION TO TO TAKE IT AWAY FROM EVERYONE ELSE.  AS FAR AS BEING GAY IS WRONG, IT'S NOT LIKE THEY CHOSE TO BE GAY.  IT'S NOT LIKE THEY WOKE UP ONE MORNIG AND SAID \"  I THINK I'M GONNA BE GAY\"  AND IT'S NOT LIKE THEY PRAYED TO GOD TO BE GAY!!!  BESIDES, IT'S NOBODIES BUSINESS WHO'S GAY AND WHO'S NOT  UNLESS THAT PERSON WANTS U TO KNOW.  SO WJY MAKE A BIG DEAL OVER SOMEONES LIFESTYLE?!?\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nGuys I am from iraq and we can fell it over here the war had two sides , the posetive side was destroying that asshole saddam- thats the only posetive side,but he destroyed everythin n iraq same as saddam did, so i agree with eminem when he says_Strap him with an Ak-47, let him go, fight his own war, let him impress daddy that way''\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\ni agree with eminem on this fuck bush he sucks but w/e great song very political\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nJust another half assed attempt to get people to vote Kerry. Kerry would sell this country to the highest bidder, the little prick. If you were persuaded to vote Kerry because of this, hang yourself now and save the world of your stupidity. Red neck? That is some stupid term used by idiot comedians trying to be funny. People from the South are actually intelegent enough to relise that Kerry wasn't fit to run this country let alone an entire state!\n\r\nI want the American troops back home, but it is either they attack us or we attack them. Obviously you are too busy sucking Kerry's dick to realise any of that.\n\r\nYou people are just being stupid right now saying all this crap. SOME Americans realised that we needed a strong leader. You obviously didn't.\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nok after reading a few of these, i have a few things to say...\n\r\n1. abortion - IT SHOULD BE LEGAL (like if a woman was raped or something along those lines) being a female, i find it all unjust because it's taking away one of our rights\n\r\n2. gay rights - they have every fricking right to get married! nothing is wrong with them! as green day baby said, they didn't just wake up one day and said \"i think i'm gonna be gay\"!\n\r\ni totally respect eminem for writing this song, bush is such an asshole, he shouldn't have become our president...i actually feel ashamed that i'm from the US sometimes with our dickhead of a president. i want our troups to come home more than anything! he threw us into this retarded war, we shouldn't have gone to iraq in the first place! \"Strap him with an Ak-47, let him go, fight his own war Let him impress daddy that way\"\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nYes, let's make abortion illegal again. So women can go back to having back alley abortions and then go on to die because of complications or unsterilized equipment. Yes, that's a GREAT idea, It's not like those that are determined to get an abortion won't find a way if it is illegal. \n\r\nOh, and gay people? WOW, I hate them... You know, even though the only thing different from you or me is who they're sleeping with. But, hey, we should judge EVERYONE by who they sleep with. It's not like sexuality is a private thing that has nothing to do with who someone is as a person. \n\r\n----\n\r\nI love this song. It figures Eminem would be the only artist not afraid to say it how it is. Well, besides a few of the more undergroud punk bands middle america is too dense to understand and Green Day. \n\r\nImagine it pouring, it's raining down on us\r\nMosh pits outside the oval office\r\nSomeone's tryina tell us something,\r\nMaybe this is god just sayin' we're responsible\r\nFor this monster, this coward,\r\nThat we have empowered\r\nThis is Bin Laden, look at his head noddin'\r\nHow could we allow something like this without pumping our fists\r\nNow this is our final hour\n\r\nI love that part of the song. I wish we could storm the oval office. I agree that we're responsible for Bush's actions. If we don't do something he'll destroy everything that's good about this country. I'm with you take it 2 the limit, only I feel ashamed nearly ALL the time.\n\r\nReally powerful song and I respect Eminem for doing it.\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nIt seems that Dubbya and Eminem finally agrees, from the presidental ass's mouth: \"They never stop thinking of ways to harm America, and neither do we\". /G. W. Bush\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nNo Parachute, I totally agree with u. U know its a amazing what this world is getting to. ANy rational and moral person would understand that the policies of presidents don't necassarilly distinguish them as a \"better\" candidate. Elections are all games. Two kids arguing about who can do things better but in reality its not them that make the decisions its their cabinets. Dont tell me i dont know shit. My sister is an economist. She meets these people on a regular basis. And for the Abortion issue, that has nothing to do with the freakin song(athough i highly disagree with abortion. And any moral person would do the same\r\n). We're not here to argue about public and foreign policies, and politicians, we're here to discuss what we think Mr. Eminem means in his songs. In my eyes the average American is very ignorant and blinded by the media's eyes. Take a trip around the world. Look at how other people live in this world and what they are going through, dont just sit on ur asses and beleive the fox 11 10 o clock news. My point is, Everyone has opinions, but learn the facts before u develop an opinion. Go on the interent and do such research. Ever wonder why we're really in IRAQ? If u still think we're liberating a country and ridding them of W.M.D's and of a tyrant then u are absolutley the stupidest person on earth. America could care fuckin less if a place is run by a dictator. The point is we are their for a different reason. Wars are not just started for no reason. They are entire reasons behind them.  Well im gonna go, cuz like the average politician i;m a little hungry for oil. Time to go bomb a country and use 9/11 as an excuse to do it. Bye.\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\ni rekon this song is awesome..eminem is wicked\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nI'm not much for rap, but this song KICKS ASS!!!\n\r\nOh and thanks take it 2 the limit\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\n\"Let us beg to differ\r\nAs we set aside our differences\r\nAnd assemble our own army\r\nTo disarm this Weapon of Mass Destruction\r\nThat we call our President\"\n\r\nLove that!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nExcuse me to all you lame-ass low-lifes who think that this song is just eminems attempt at yet another controversial issue, simply to gain publicity through politics and the Anti-bush scene........you can go kiss my ass. I mean if you dont agree with the lyrics, in a political sense...I TOTALLY RESPECT THAT. everyone has his/her own opinion. But to go out and say that eminem is just trying to cash in on the anti-bush scene is just WRONG. \r\nLET ME GET SOMETHING STRAIGHT....simply the fact that he IS eminem...will give him shitload of money on ABSOLUTELY ANYTHING HE MAKES/PRODUCES. And besides, he's just stating his opinion once again- and if you dont agree....\"that's life\" in eminem's words.\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nHey I have to hand it to [v]@JOR_InDi, I like their last comment!!  Most of it anyway\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nI cant get enough Bush bashing songs!!! I totally agree with the words and lyrics. This war we are fighting now is F@$%ing rediculous. There is no reason we should be over there!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nI agree with you too  [v]@JOR_InDi\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nOkay... Let me start off by saying a lot of people don't like Eminem. That's fine, but this song isn't written about him, just by him. Listen to the lyrics. He's saying FUCK YOU BUSH and he's not afraid to say it. Not only that but he's a genious when it comes to writing. He's the only rap/hip hop I'll EVER listen to.\n\r\nCiao,\r\nNessa\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\n**applauds** great song!!!! two thumbs up!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nWhen i was out last week i saw eminem sucking a bit of dick and i thought hahahaha  man that reminds me of all his music it sucks major willy and should be thrown away or crapped on so should he\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nAt least he's not afraid to say what he wants\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nBUSH BUSH BUSH BLOWS\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nThis song is gay.\n\r\nMusic + Politics = Ghey\n\r\nMatta Fact:\n\r\nAnything + Politics = Ghey\n\r\nEminem was way too late on the whole make money off of george bush.\n\n\n\r\nIm sick of bush haters whining, i dont pay any attention to junkie politics, but I know I already know more about it than ha;f the clowns who act like they know anything about politics, people dont even remember why they hate him, the just hate him to hate him because its the trendy thing to do.\n\r\nAll Presidents are rich lying douchebags, GWB was no different than the last motherfucker in the white house.\n\r\nBut since it gets on everyone's nerves......\n\r\nI LOVE BUSH HE IS SO GREAT, BUSH KICKS ASS w00t, ME AND BUSH ARE BUDDIES WE GO GOLFING, I LET HIM WIN BECAUSE HE IS SO COOl, HE CARES SOMEWHAT ABOUT BLACK PEOPLE\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nThe reason we're being as some put it \"immature\" about Bush winning is cos as Em says \r\n\"For this monster, this coward,\r\nThat we have empowered\"\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\noh and green_day_baby i was referring to the fact tht kerry believes gays are wrong not tht i do\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nAs the only exception of someone who sounds like a 'gangster rapper', I like this song.  He masters the words and keeps going.  I like that.\n\r\nJohn Kerry would not have been worse than Bush.  He was not the best candidate, no, but if it was between him and Bush, it's rather obvious.  Al Gore was better.  And Howard Dean was better than the two of them + Clinton put together.\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nMosh is AWESOME!!! Em really tells it how it is. like the song says F Bush\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nDamn, Father Time...you are clearly correct.\n\r\nDid you write Howard Dean on the ticket under president when you voted back in 2004?\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nOh, great message in the song..\r\nnot em's best song musically.. but lyrically one of his best!\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nI gotta say, Eminem is a genious.  \n\r\nApparently he is a rebel just like me and does believe in God and is saying to mosh against everyone else and assemble together as one army with mass strength and faith against the darkness and evil.  \n\r\nBasically hes very subtly hinting to follow God without scaring a lot.  Genious, pure genious.\n\r\nand also hes saying hes just a voice, a messenger like as i.\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\ni have been an eminem fan for ages, and i refused to listen to him for a while now coz i am a goth\n\r\nBUT i listened to this song for the first time in a year and a bit, and it fukkin rocks out loud!!!!!!\n\r\nobviously em. wants money from songs, but dont all song people????\r\nand if he didnt mean it, why would he write it??\r\ni dont like other rappers, but i like eminem coz he writes about real topics in the world and what they mean to him...THIS SONG HINT HINT!!!!\r\ni dont know what i eman coz i sukk at these sorta things, but hay, who really gives a fuck??\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nI kind of hate this song for being so patriotic and anti-bush - yeah, who doesn't hate him? no need to go the fuck on about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nPeople who dont like this song dnt search it and rite bad stuff this song is ace!\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nI h8 george bush so duz em and he isnt jus sayin it to get money\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nSome1 talk im bored\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nShut thd hell up dod\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nhalf you guys saying that your anti-bush cant even give a reason, besides being in iraq, for hating him\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nok ok, i set it strait for all of you, and if u wanna disagree, go ahead, i dont giv a shit (sue me) Eminem is one of the only real rappers, he raps about real shit, not money, not cars, not about all the shit he has and how gangster and pimp he iz, if u dont listen to him and u say u hate him, well, ur an ignorant piece of shit. he wrote dis song (obviously) about the election, hes not jus tryin 2 make money, lik sum of u dip shits think, he speaks what he believs, he dosnt lik bush n was tryin to convince ppl to vote kerry or nader (haha) so they pull our troops outa the hellhole of death that they call a country. \r\nnow election is comin up again, \r\nVOTE OR DIE\r\nhaha\r\npeace\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nEminem is talkin about the new world order. we need to unite and riot and stand up against it. he says \"if i get sniped tonight you know why, cuz i told you to fight\". he is educating people about what is really going on\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nDoes everyone honestly think Eminem's trying to make money off of this?  That he just randomly decided to enter rapping about politics?  Majority of his audience probably doesn't care at all about politics and only listen to him for the beat/flow.  Also, majority of all his songs are political (Slim Shady LP was extremely political, I was surprised that some of his stuff connected directly to theories from an author during the Renaissance).  \n\r\nIn this song, he's just giving his opinion on something like he always does.  Just the same as when he's dissing ICP, Christina Aguilera, or Britney Spears or something.  And seriously, he could hardly care about what you think of him.\n\r\nBy the way, I'm pretty sure we provoked those terrorists to do what they do.  What's a country to do when big America is bullying them with much more resources than they could ever imagine?  Scare the piss out of everyone through suicide bombing.  I'm not saying it's right but terrorism is one of the only methods they can use as defense.\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nI LOVE THIS SONG!! its so true especially the bin laden part in the video as well\r\nhe's showing that bin laden is a show made by the governement to screw around with our heads\r\nand ppl need to understand that not everything u hear on the news is true!\r\nit would take me a rlly long time to expand on this but this song has so many meanings!\r\nlike no matter what race u are just join together to fight this monster we created!!\r\nand in the video with the black hoodies to show equality! great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nLISTEN HES SAYING THAT BUSH ITSNT DOING SHIT ABOUT TERRORISM BESIDES SAYING HE'LL HANDLE IT. YOU WANNA HANDLE IT?! BOMB THE FUCK OUTTA THEM. AND  THAT MABYE MY WORDS WILL REACH THEM?! ITS MEDOPHORICAL! Saying that mabye they'd understand better if Bush and and geneva convention hadnt made america a buncha fucking pussies. cuz we could kill those fuckers with a couple good bomb blasts. I hate Bush but I hate Terrorism. Same how I hate that fucking terrorist supporting muslim feltcher ass sucking punk ass bitch Obama. But I also hate Terrorism and think we should bring our troops home and quit buying oil from those terrorist pigs. NO MORE BLOOD FOR OIL!\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nI can see a few lyrics that are wrong in this:\n\n1) \"shows no difficulty multi-task \nAnd in juggling\"\n\nShould be \"no difficulty multi-tasking and juggling\"\n\n2) \"Mr. kisses ass crack\"\n\nSurely it's \"Mr. Kiss-his-ass crack\"\n\n3) \"Try to amplify the times it, and multiply by six\"\n\nactually \"Try to amplify it, times it, and multiply by six\"\n\nOther than that they seem alright, and the song is brilliant, i rap-along to it whenever i hear it\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\nThere mere fact that Eminem is anti-Bush should make any rational person pro-Bush. Seriously.\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nHAH.....Eminem is just trying to make money, do you think he really means half the shit he says? I think not. Heâ\u0080\u0099s not even a gangster rapper; heâ\u0080\u0099s a satirical rapper on social commentary.  People should not fear what he says, they should embrace it.\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nthis is one of the worst songs em has ever had. bush is a way better president then Kerry could ever be. hes for gays there f****** nasty. and even worse he belives in abortion and thats murder\n\r\nGO BUSH!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n"}