{"comment_0": "\nMost emotional performance of a song I have ever heard.  I am a man but not afraid to say this can make me cry!   I almost lost my love once and this brings it all back!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nabsolutey beautiful, i pulled out the old butterfly cd and went right to this song.  i definately have to sing with it, because i agree, mariah expresses such longing, it's just absolutely wonderful\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthis one is for you my greek love, id give my all to have just one more night with you... i wishing on you distant star, visualizing you so clearly yet so far away from me.. dont forget me dear\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song is so sad....you can feel the longing in mariahs voice...u kno?\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ndefinetly silverpuppiez. its such a beautiful song and it describes a situation so many of us can relate to.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ni love this song-it describes where im at sometimes\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIt's about remembering...desiring and longing for someone that is not in our lives anymore :(\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nit says how much you're willing to do everything to be with that someone.. \r\ngreat vocals!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nMariah is a great, and very underrated lyricist. She can paint a picture so well in the listeners mind. And I personally think it's great she writes her own song, i mean, not many solo female artists do. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nit's super what you can do to have the one you love next to you...\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nFirst time I hear this, I loved it. Still do. It's always abused on my iTunes, l0l. I agree about Mariah's voice, you can hear so much emotion. I especially love how from the second chorus, how the song's such with so much more power. It's like the longing's become too much. Anyways, it's beautiful (=\r\n\"I can see you clearly, emblazoned in the memory of my mind\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nAn incredible song. What a heart-breaking song. I can definitely relate to the words so much. The tune is beautiful as well. I love the way she sings it. Mariah always puts so much emotion into her songs. Yeah, you can definitely hear the longing in her voice, the desperation, passion, desire etc. What an unforgettable song. I'll always love it so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nto me this song means thinking back on your old relationship and thinking what you could have done to make it better and how now you miss the person so much that your ready to give your all to have them back.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nUgh I hate when people take a heart wrenching, beautiful, sad, emotional song and turn it into a damn dance mix! \t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI LOVE THIS SONG.  ITS A REALLY GOOD SONG!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nii loveee this song ;; i listen to it allll the time..\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nshe has the most beautiful voice i have ever herd.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nIt's an okay song, but it works better as an epic dance mix. Same goes for Through The Rain.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI\n\r\nl\r\no\r\nv\r\ne\n\r\ni\r\nt\r\n.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nSimple and Beautiful ...\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nIt seems like you can give all to your love one... but you think your not enough..and even you know need to take a risk and you still willing to  love him... if i heard this song make me cry because i cant imaging how foolish i am.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI think this song is the first part of a trilogy. Mariah tells a story between three songs on three completely different albums. First, MY ALL (from BUTTERFLY) describes how much she needs and wants to be with a past love. AFTER TONIGHT (from RAINBOW) describes getting her wish and hoping that when the sunrises, he'll still want to be with her and that it wasn't a one-night stand. Finally, I ONLY WANTED (from CHARMBRACELET) describes how the man left her and abandoned her. \n\r\nMariah has never mentioned that these three songs go together, but I think it's perfect. They all have that same sense of longing and yearning with the spanish-influenced melody and guitar. Absolutely brilliant and gorgeous.\t\t\t\t\n\t\t\t\t\n\n"}