{"comment_0": "\nThis song is so powerful. And to me, it has a huge message that the video definitely embodied. \n ----------------------------------\nThis is my take on the story the song tells:\n\nShe starts off having stars in her eyes for this rich and famous big shot guy who is taking here to parties and introducing her to this crazy luxurious lifestyle. He tells her to \"be cool\" and she's nervous because she's never been in this niche.\n\nIn the next verse, she gives an amazing metaphor for having sex. But this time, she says \"i'm already the coolest\" when he tells her to \"be cool\". she has figured out the lifestyle now and she has become a part of that world. now she isn't just asking to go to parties, she wants him to buy diamonds.\n\nIn the end of the song she has blended completely into this crazy lifestyle of guys, money, drugs, alcohol, fame, etc. She is no longer that naive girl that was first introduced at the beginning of the song. She has lost to herself to the fake world of \"fame\". She is the \"queen of Saigon\" or.. the queen of the fallen.\n\n\n\n------------------------------\n\nLana tells this story and then towards the end talks about it being a \"love story of the new age\". Like, this is what the world has come to... People are obsessed with pop culture and these \"celebrities\" and \"socialites\". This crazed world of the famous is glamorized and the people in the spotlight often forget what's real and in the end all they have done is ruined their own lives, just as the girl in the story did.\n\nMoney HAS become the anthem of success. They are considered one in the same in modern times.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIt's Bugatti Veyron NOT Bacardi [?]. Omigod!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis is about equating money and love. He is loaded and worships money, she presents herself to him like his property, a money equivalent. She wants to be worshipped by this money worshipping clown just as much as he worships money. If money is the anthem of success, then she wants to be his National anthem, his most important possession. She wants him to owned and worshipped at the same time, like money is.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nFor all the questions out there:\n\n-Bugatti Veyron: Sick car alfonsofigares.com/blog/wp-content/uploads/2012/04/…\n\n-Upper echelon: Echelon meaning a \"A level or rank in an organization, profession, or society\" She's talking about money, being cool and all. Like the upper class.\n\n-King of Chevron: I think she's talking about the American multinational energy corporation, \"one of the world's six \"supermajor\" oil companies\" it makes sense since she's singing about money and power through the whole song.\n\n-Queen of Saigon: \"Ho Chi Minh City, formerly named Saigon; is the largest city in Vietnam.\" \"South Vietnam, as an anti-communist republic, fought against the communist North Vietnamese and Viet Cong during the Vietnam War\" \"Saigon fell when it was captured by the communists on 30 April 1975, bringing an end to the War with its enemy's victory. Vietnam was then turned into a communist state with the South overtaken\"\n\nSource: WIKIPEDIA\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nWhat the fucking fuck? Bacardi pharaoh?\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nCORRECTIONS:\n-----------------------------------\n\nit's \"Bugatti Veyron\" instead of \"Bacardi pharaoh\"\n\n\nit's \"or your pants ON\" instead of \"or your pants OFF\"\n\nit's \"UMM.. do you think you'll buy me lots of diamonds?\" instead of \"LOVE.. do you think...\"\n\nit's \"HE will do very well\" instead of \"WE will do very well\"\n\nit's \"in his BELL TOWER HOTEL\" instead of \"in his spell tower, hotel\"\n\nthat's just the ones i noticed.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song should be a single right before Summer starts. It would be HUUGE! I LOOOVE this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think that since the music video is about John Kennedy, that the first verse she is singing as Jackie Kennedy and the second verse she is singing as Marilyn Monroe. Maybe? Kinda?\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI actually don't think this song is about gold-digging as much as selling out to money, as a way to justify staying with her cheating lover/Kennedy because \"money is the reason we exist.\" Obviously this is a twisted version of \"love is the reason we exist\", which I think would be the general consensus. But because she is somewhat starved of it, she's resigned herself to staying in an extremely unhealthy relationship because of the money. I don't think she ever intended to be a gold-digger at all initially, which is emphasised in her monologue in the extended video for the song. That isn't included here, but at the end of it she repeatedly states \"I loved him. I love him.\" This is more evidence to suggest she was never in it for the money. I think this song has a very similar tone to Video Games actually, she's trying to convince herself he loves her like he should but isn't fooling anyone. There are very brief glimpses of her insecurity and desperation to be loved more than anything else, for example this is hinted at in the line \"I need somebody to hold me.\" But on the exterior, and for most of the song, she tries to stay \"cool\" and pretend that she only cares about the money. I definitely think there's more to it than her simply staying in a relationship for the riches.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI think it's \"dark and lonely\" not \"god can only\".\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nIts about how the money equals power, and she wants to be loved by him, like how he loves money. The video was about JFK and his Wife but of a new generation White/Black, so maybe that's what the song was about too.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nSocial commentary on how men are exploited by success, and women by sex. She is an anthem, aka an object.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n\"Bugatti Veyron\" and NOT \"Bacardi pharaoh\".\n\r\nAnd I'm pretty sure it's \"Making me so wild now\", which makes a heck of a lot more since and is less trashy than \"Making me so wow wow\".\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\npmci26 you wrote; Give me Chevron?\n\r\nThis is only one of the most amazing lyrics written ionto the songs of the album.\r\nThis shows the fascinating knowledge Lana must have --in the English language.\n\r\nAs a writer she has given us all an interesting first public album.\n\r\nYou wonder about the term --Give me Chevron\" \n\r\nAs written the lyrics are as follows;\n\r\nI sing the National Anthem\r\nWhile I'm standing over your body\r\nHold you like a python\r\nAnd you can't keep your hands off me\r\nOr your pants on\r\nSee what you've done to me\r\nGive me Chevron\r\n-----------------------------------------------------\r\nThis is where it gets quite intesesting.\n\r\nThe term Chevron in the English language has many meanings some of which are----\r\nChevron may refer to:\n\r\nChevron (insignia), --a decoration \r\nChevron (anatomy), ---a bone \r\nChevron (geology), ---a fold in rock layers \r\nChevron (land form), -a sediment deposit across the earth's surface \r\nThe Chevron, ---------a newspaper \r\nChevron Corporation, -an oil company \r\nChevron Cars Ltd, ----a British racing car constructor \r\nChevron Engineering Ltd, -a New Zealand car maker \r\nHebron, --------------a city in the West Bank \r\nEulithis testata, ----a moth \r\nGuillemets, ----------a type of quotation mark \r\nA type of bracket \r\nA plot element in the Stargate fictional universe\r\n---------------------------------------------------------------\r\nSo if we look again at the lyrics --below---\n\r\nWhile I'm standing over your body\r\nHold you like a python\r\nAnd you can't keep your hands off me\r\nOr your pants on\r\nSee what you've done to me\r\nGive me Chevron\n\r\nThe statement --Hold you like you like a python -- seems obvious whenh taken with --and you can't keep your hands off me --and--Or your pants on, --and-- Give me Chevron.\n\r\nI believe after interpreting the lyrics as a whole and the sexual innuendo within the lyrics we have to take the --second meaning -- of the term Chevron.\n\r\nSo -- Chevron in the song is---\n\r\nGive me Chevron-\r\n= \"Give me a bone\"\r\nor\r\n= \"Give me the bone\".\n\r\nAgain this is a well written album not to mention the wonderful range she sings on the album.\n\r\nI would encourage anyone that is interested in music--to go out, purchase the album.\r\nHaul out the lyrics sheet and lay back and enjoy one of the most interesting albums out now.\n\r\n2 million album sales and climbing and the singles sales figuresSomeone must like her music. Personally I find it refreshing and a welcome change to the mass marketing of other certain artists.\n\r\nRegards\r\nTerryinVcitoria\r\nBritish Columbia\r\nCANADA\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI didn't really get the whole meaning but to me, a lot of the song is revolved around money, wealth, and power. Not only that, but just like this idyllic kind of life. The image of a perfect family, a perfect life.  I agree with yhtrownu about the whole she wants to be his national anthem part because money is the anthem of success, so she wants to mean the world to him. But after seeing the music video, I kinda also concluded that it's not just about the excessive life really, she sees this man, and he is everything; fascinating, intelligent, charming. And it's not that he doesn't love her, but it's not exactly the healthiest relationship. She defers to him, he brings to her all this glamour. In the music video, she's a loving mother, but when she's not with her kids, you can see that she can sense that her life isn't all that it's cracked up to be, especially when she is singing \"Dark and lonely, I need somebody to hold me.\" and when she is saying \"he will do very well, I can tell, I can tell\" It's because she can acknowledge that this man is extraordinary. I also got the sense that, she feels that no matter how much this man may love her, or how glamorous their life is, he's always being held back from his full potential, not by her per se, but just in general. His heart isn't wholly in their relationship. And when she asks \"Want a quick, sick rampage?\" I feel like this means that their love, it's not really lasting or healthy, but it's explosive and energetic, and the kind of love that burns brighter than any flame but then burns out, and it burns both of them out, because its so all-consuming and glamorous. I really don't know what i'm talking about, because I haven't really pieced together what I think it REALLY means, but this is what I've gotten so far...\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI thought the whole song was more of like a big poke at the way fame is publicized, and Lana stands as an image of this fame--in the song, of course.\n\nShe's running after this rich guy who she only loves for the money and fame, and you can kinda assume he probably just wants her for her looks, trying to keep her happy, (\"I asked, 'Can we party later on?' He says 'Yes'\")\n\nI don't know.  I just figured she was trying to show the listener how wrong things are in fame today, and how it's what everyone does, hence NATIONAL ANTHEM.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI always thought of this song as a sort of defense for \"gold-digging\" (being in a relationship for money, for the five people in the world who don't know that term). It suggests that money is the most important thing in the world, and anything done to get it is justifiable. I think all the \"romantic\" lines are jaded, she's just telling him what he wants to hear to get what she wants.\n\nI love the transition from innocence to experience - from \"I don't know how to be cool\" to \"I'm already coolest.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nIt's: Dark and lonely I need somebody to hold me\nnot: God can only\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nA national anthem is a song of devotion to one's country, and I think she uses it as a metaphor to show her devotion to and love for this twisted man. But in general, as we all know, the song is about the rich, superficial lives of the upper class. Constantly through the song she refers to various places, objects, and concepts associated with the rich. Lana loves talking about the privileged, upper class in her music.\nI think the song is very sexual for a number of reasons: (1) Chanting \"Red, White, Blue, is in the sky. Summer's in the air, and, baby, heaven's in your eyes. I'm your national anthem\" seems very sexual, like an orgasm to me (think about it!); (2) \"Can't keep your pants on\" or \"Put your hands up\" or \"Give me a standing ovation\" (erection); (3) \"Standing over your body, hold you like a python\", which sounds like a penis to me, but also snakes are obviously very dangerous. She shows more confidence in this song than any other (sans Radio) on the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\n\"Give me Chevron\"???\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI think this song is about a working class girl being in a relationship with an American politician.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nand i remember when i met him, it was so clear that he was the only one for me.  we both knew it, right away.  and as the years went on, things got more difficult and we were faced with more challenges.  i begged him to stay. i tried to to remember what we had in the beginning. he was charismatic, magnetic, electric. and everybody knew him. when he walked in, everyone's head turned. everyone stood up to talk to him. he was like this hybrid, this mix, of a man who couldn't contain himself.  i always got the sense that he became torn between being a good person and missing out on all the opportunities that life could offer a man as magnificent as him.  and in that way, i, understood him. and i loved him. i loved him, i loved him, i loved him.  and i still love him. i love him.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI really like this song, i think this is about Lana being/falling in love with a very rich guy but she's kinda afraid she's not cool enough for him.\nthe second verse is definitely really sexual!\nand she wants to be his national anthem like, for example, the national anthem is one of the most important things for a nation, the most important thing for him is money and she wants to be as important as money for him.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nNational Anthem is the song that really got me into Lana and i love it.It sound like nothing I've heard on the radio not for a long time-not since Amy whinehouse.Her sound,voice and songwriting is unique.My favorite verse are :\n\nIt's a love story for the new age,\nFor the six page\nWant a quick sick rampage?\nWinin' and dinin',\nDrinkin' and drivin',\nExcessive buyin',\nOverdose and dyin'\nI'm in drugs and in love\nIn my dreams and a rage,\nBlurrin' the lines between real and the fake\nGod can only, I need somebody to hold me\nWe will do very well,\nI can tell, I can tell\nKeep my safe in his spell\nTower, hotel\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI have no idea about the meaning - I do however LOVE the video\n\nThis amalgam of John F Kennedy and Rap Superstar.\n\nLana as this rappified Jacqueline Bouvier.\n\nI think she's making a point about the attraction to and tragedies that course through the stories of the rich and powerful..\n\n\"Money is the reason we exist\"\nSure ain't sugarcoating the gold-digger persona here...\n\nWhich is a persona - 'blurring the lines between real and fake.'\n\nThe ambiguity of the song is discomforting...\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI like everything in the song and video but I cant realize is it a sad or a happy song, cause in the same its so happy and sometimes sad again in a few moments is twisted... I love the instrumental too...\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI believe that Lana is referencing the \"man\" to money.\n\nMany of the things she does can relate to money, as it buys everything.\n\n\"Take me to the Hamptons Bugatti Veyron\" \n\"Winin' and dinin', drinkin' and drivin', excessive buyin', \n\nI also believe that she is referencing the beauty of him, to money too.\n\"Money is the anthem, God, you're so handsome, money is the anthem,\"\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI have a question. she sings \"take your body downtown\" a lot in her songs. What does it mean? Is it slang?\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI think this song is talking about the similarities between JFK's two women in his life.  In the music video she is playing Marilyn Monroe and then plays Jackie Kennedy.  She is trying to say that both of the women had some type of thirst to be his only lover.. I think in the end she is trying to communicate that both wanted his money and fame but that Jackie was the one meant to be with him.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThis song is about the American Dream, and the balance between money and love in both a personal and global/national perspective. That's what makes this song so deep and complex.\n\nThe phrase \"money is the anthem of success\" basically puts the capitalist ideology into a single sentence. \"Red, white, blue's in the skies\" makes it obvious we're talking about the US and its role in the world here. How fantastic the American dream is for those who succees and can go party all the time. \"Overdose and dyin' on our drugs and our love and our dreams and our rage\" asks the question \"is this American dream actually healthy? Is it possible to love each other when all we dream of is economic success?\".\n\nThe fantastic and complex thing about this song is that it can also be interpreted in a personal/relationship way, if you take the words more literally and try not to read too much out of them. And it still makes sense.\n\nMoney is definitely the US' national anthem, and Lana Del Rey is asking a critic and important question in today's global and national society.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis song is probably how money ruled Lana's thoughts on a man. She wasn't really in love with him more his money and looks. She goes through her phases as first, being nervous when introduced to his lifestyle, second: she's slightly used to her lover's lifestyle and it doesn't phase her and her lover starts to get concerned because he can see her falling into a lifestyle she was not ready for. Lastly, Lana considers herself as more powerful than the man she was with. She calls herself \"Queen of Saigon\" or queen of the fallen making her realize the fast and money ruled lifestyle ruined her life and she should've listened to her lover when he told her to be cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThis song is metaphorical of the corporate control of government. The puppet show of politics. Division of citizens over social issues to dictate economic policy and screw over their voluntary slaves. It is mixed with delusions of success in green paper that can not buy happiness. It is a paradigm of deception even the leaders are part of. It is what happens with the rise of monopolies by antitrust violations to create godlike entities. Ironically, the slaves have power and are the strength but not alone. Yet they don't know and believe they are loved and special. They are deceived. Everyone is because money is paper. The song is a lie. Lana is a genius. \t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nthis reminds me of a fic i read once\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nMoney is the anthem\r\nOf success\r\nSo before we go out\r\nWhat's your address?\n\r\nI'm your National Anthem\r\nGod, you're so handsome\r\nTake me to the Hamptons\r\nBacardi (â\u0080¦)\n\r\nHe loves to romance them\r\nReckless abandon\r\nHoldin' me for ransom\r\nUpper echelon\n\r\nHe says to \"be cool\" but\r\nI don't know how yet\r\nWind in my hair\r\nHand on the back of my neck\r\nI said, \"Can we party later on?\"\r\nHe said, \"Yes, yes\"\n\r\nTell me I'm your National Anthem\r\nOoh, yeah, baby, bow down\r\nMaking me so wow, wow\r\nTell me I'm your National Anthem\r\nSugar, sugar, how now\r\nTake your body down town\r\nRed, white, blue's in the skies\r\nSummer's in the air and\r\nBaby, heaven's in your eyes\r\nI'm your National Anthem\n\r\nMoney is the reason\r\nWe exist\r\nEverybody knows it, it's a fact\r\nKiss, kiss\n\r\nI sing the National Anthem\r\nWhile I'm standing over your body\r\nHold you like a python\r\nAnd you can't keep your hands off me\r\nOr your pants on\r\nSee what you've done to me\r\nGive me Chevron\n\r\nYou said to \"be cool\" but\r\nI'm already coolest\r\nYou said to \"get real\"\r\nDon't you know who you're dealing with?\r\nUm, do you think you'll buy me lots of diamonds?\r\n(Yes, also a gun)\n\r\nTell me I'm your National Anthem\r\nOoh, yeah, baby, bow down\r\nMaking me so wow, wow\r\nTell me I'm your National Anthem\r\nSugar, sugar, how now\r\nTake your body down town\r\nRed, white, blue's in the skies\r\nSummer's in the air and\r\nBaby, heaven's in your eyes\r\nI'm your National Anthem\n\r\nIt's a love story for the new age\r\nFor the six page\r\nWant a quick sick rampage?\r\nWining and dining\r\nDrinking and driving\r\nExcessive buying\r\nOverdosin', dyin'\r\nOn our drugs and our love\r\nand our dreams and our rage\r\nBlurring the lines between real and the fake\r\nLove again, lonely\r\nI need somebody to hold me\r\nWe will do very well\r\nI can tell, I can tell\r\nKeep my safe in his bell tower, hotel\n\r\nMoney is the anthem of success\r\nSo put on mascara, and your party dress\n\r\nI'm your National Anthem\r\nBoy, put your hands up\r\nGive me a standing ovation\r\nBoy, you is landin'\r\nBabe, in the land of\r\nSweetness and Angel\r\nQueen of Saigon\n\r\nTell me I'm your National Anthem\r\nOoh, yeah, baby, bow down\r\nMaking me so wow, wow\r\nTell me I'm your National Anthem\r\nSugar, sugar, how now\r\nTake your body down town\r\nRed, white, blue's in the skies\r\nSummer's in the air and\r\nBaby, heaven's in your eyes\r\nI'm your National Anthem\n\r\nMoney is the anthem\r\nGod, you're so handsome\r\nMoney is the anthem\r\nOf success\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nAnd I dont know if this something to do with illluminati.... Maybe...\t\t\t\t\n\t\t\t\t\n\n"}