{"comment_0": "\nThe thing that I love most about Imagine Dragons is that all of their songs sound like a battle cry. Sure they're not always angry battle cries, but they're always songs that make you want to yell them at the top of your lungs, and \"Natural\" is no different. Maintaining intensity throughout the entire song, it begins slow, but you can tell that something is going down. It suddenly turns into a battle cry about being strong in a world that's hard and cold. You listen and it makes you feel like you can run through a wall and throw that knockout punch. This song does an excellent job of making you feel exactly how the Imagine Dragons intended you to feel -- strong and hard and ready to take on the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nMost people already know that Imagine Dragons are a Mormon Band and most of their songs have metaphorical religious meaning. Finding the religious meaning in this song is pretty black and white easy so that's likely why there are so little posts here, everyone already knows. But for the few of you who don't or just want to read an opinion. I'll write a simple explanation.\n\nâ\u0080\u009cWill you hold the line? When every one of them is giving up or giving in, tell me\nIn this house of mine? Nothing ever comes without a consequence or cost, tell me\nWill the stars align? Will heaven step in? Will it save us from our sin? Will it? Cause this house of mine stands strongâ\u0080\u009d\n\n(The song is directed to the next generation, or the millennials. The line they are referring to is the line of tolerance. Moral values, and being a good person. There is a lot of hate and judgment coming from society and the world is filled with selfishness. In my opinion, the term â\u0080\u009cthis house of mineâ\u0080\u009d is referring to his people or his generation or his society. In today's society, the next generation is not upholding the values like we used to and are lowering the line. Things that were once considered wrong and immoral are being labeled as acceptable. This generation is giving up on trying to uphold those good things. The singer then asks God if He will save us.)\n\nâ\u0080\u009cThat's the price you pay Leave behind your heartache, cast away Just another product of today\nRather be the hunter than the prey And you're standing on the edge, face up 'cause you're a... Natural A beating heart of stone. You gotta be so cold To make it in this world. Yeah, you're a natural\nLiving your life cutthroat. You gotta be so cold Yeah, you're a naturalâ\u0080\u009d\n\n(This verse and chorus are regarding the fact that people feel that in order to be accepted in todayâ\u0080\u0099s society, they have to be ok with everything that's wrong. In their heart, they know that these things are wrong but they have to cast those feelings away in order to fit in and be accepted. They would rather be mean and hateful and judgmental than receive it from others.)\n\n( the rest of the song follows the same theme. Imagine dragons use a lot of metaphors in their writing so it's up to interpretation but this is definitely the general tone and meaning of the song. How you interpret the individual lines and words is up to you. And I'm pretty sure they want it that way. They want people to be able to interpret the song in their own way and tie to their own life.)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWell, I don't know what the song was actually written about. But personally the feeling I got when I listened to this song for the first time, is like. This man is in love with this woman. But this woman is keeping her distance, she's not loving him the way he wants her to love him(if that makes any sense). And the chorus is basically him justifying or describing her. On how she's so cold with him, maybe because she had to be that way to protect herself.\n\n 'Will you hold the line?When every one of them is giving up or giving in, tell me In this house of mine?'. (He's saying like with all of the men that have tried to break your wall, will you let me in? will you make an exception for me?)\n''Nothing ever comes without a consequence or cost, tell me will the stars align? will heaven step in? Will it save us from our sin? Will it? Cause this house of mine stands strong'' ( He's saying on how she keeps making him prove that he's worth it. He's asking her on when will it end that endless battle and when he says; 'this house of mine stands strong' , like saying that he's not going to give her up.\nâ\u0080\u0098â\u0080\u0099That's the price you pay, leave behind your heartache, cast away. just another product of today\nRather be the hunter than the preyâ\u0080\u0099â\u0080\u0099. ( Heâ\u0080\u0099s explaining why she is like that, she leave â\u0080\u0098feelingsâ\u0080\u0099 on second term, to stay focus on things that wonâ\u0080\u0099t hurt her (like usually love does). And that she prefers to be selfish and rather be the one to hurt him, before he hurts her.)\nâ\u0080\u0098â\u0080\u0099And you're standing on the edge, face up 'cause you're a Natural. A beating heart of stone, you gotta be so cold to make it in this world . Yeah, you're a natural. Living your life cutthroat, You gotta be so cold Yeah, you're a natural. â\u0080\u0098â\u0080\u0099( Heâ\u0080\u0099s saying on how she has that wall that wonâ\u0080\u0099t let anybody in, maybe because sheâ\u0080\u0099s scared to get hurt)\n\nâ\u0080\u0098â\u0080\u0099Will somebody let me see the light within the dark trees' shadows and What's happenin'?\nLookin' through the glass find the wrong within the past knowin'\nWe are the youth\nCall out to the beast, not a word without the peace, facing\nA bit of the truth, the truthâ\u0080\u0099â\u0080\u0099 (Heâ\u0080\u0099s asking on when will it end, when will she let go of the past and start living in the present with him)\n\nâ\u0080\u0098â\u0080\u0099Deep inside me, I'm fading to black, I'm fading\nTook an oath by the blood of my hand, won't break it\nI can taste it, the end is upon us, I swear\nGonna make it\nI'm gonna make itâ\u0080\u0099â\u0080\u0099 ( Heâ\u0080\u0099s saying on how this situation is making him miserable, but that heâ\u0080\u0099s determined to be with her)\n\nThis is my interpretation of this song. Maybe it has nothing to with it, maybe Iâ\u0080\u0099m relating with a similar  personal situation. And this is the way that this lyrics spoke to me because I felt like Iâ\u0080\u0099m relating to this situation.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nHave you ever heard a song and fell in love with someoneâ\u0080\u0099s voice? Yeah, thatâ\u0080\u0099s what happened to me here. I love how this song has such a catchy tune and when the beat drops â\u0080\u0093 forget about it â\u0080\u0093 itâ\u0080\u0099s almost impossible to sit still and not sing along. What I love so much about this song is that it shows off the pure vocals and talent from lead-singer Dan Reynolds. I like how throughout the song his voice really fluctuates, the beginning of the song is him singing very naturally and as the chorus builds you can really hear the emotion grow in his voice and then the chorus crushes it and his voice is amazing.   \n\nWhen you first listen to this song, you donâ\u0080\u0099t really pay much attention to the lyrics because the sound itself is very catchy but when you actually pay attention to the lyrics you realize that this song actually has a very strong meaning. Part of the chorus is â\u0080\u009cA beating heart so stone, you gotta be so cold to make it in this world. Yeah, youâ\u0080\u0099re a natural.â\u0080\u009d To me, this song stands for the fact that we live in such a dog-eat-dog world and to survive and make it in this world you have to be a little stone cold. Life throws a lot of crazy things at us that we donâ\u0080\u0099t necessarily expect so to be able to build a thick skin in this world is important. We can only guess that Dan Reynolds has gone through a lot of hardships in his life and this song is a reflection on how he feels about the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThe singer divorced his wife not long before writing this song. He has said that the meaning of this song is about empowerment. In a sense thatâ\u0080\u0099s true, because itâ\u0080\u0099s clear that she left him and this song enpowers him to continue on. \n\r\nThis song is absolutely calling his ex wife a naturally cold person who is going to do well in this cold world. The breakdown references an â\u0080\u009coath,â\u0080\u009d which I take to mean marriage, which he said he wonâ\u0080\u0099t break. But she did. So this song is an aggressive letter to his ex-wife. \t\t\t\t\n\t\t\t\t\n\n"}