{"comment_0": "\n\"The song is about two people who have a connection with each other so they don't really have to force the feelings - they're just there.\"\n\r\nby Selena Gomez\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nWow not a single comment? I adore this song. I love the album!! Basically about two people or a couple that get along so well nothing is forced, there's no awkward silences, they just \"click\" perfectly together, everything is \"natural\" between them. \n\r\n\"You are the thunder and I am the lightning\"\n\r\nI love that line, that describes their chemistry, they create a storm when they're together, they're electric. She admires his confidence, or his self confidence rather, pretty much in admiration of him and their compatibility. She's pretty damn attracted to and smitten with this guy. :) x\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nin addition to that.. this guy just knows who he is. Things between them seem effortless. And their friendship and chemistry comes so naturally when they're together. \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni agree to. nothings forced between the couple and everything comes \"naturally\" and they are always together...thus the line \"you are the thunder and i am the lightning\"...lightning always follows thunder and are always associated with the other. this song pretty much explains itself:)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nwow, I mean I was speechless when I heard this. You go, Selena!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nHow cool would it be if Selena was one of the people who commented in disguise, you never know when you've said something to a celebrity lol. Course, I am not Selena, just me :)\r\nI LOVE this song, listen to it for hours on end!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nits a really great song! yaehhhh its the best song that i never hear like it.i love selena\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nher singing is definitely not the best i've heard, and she's a much better actress. however, she even said herself that singing was just for fun. this song is cute and fun to sing to. and i agree with what's already been said.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ncan someone explain the sparks part?\n\nwhen we collide sparks fly\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nits a great song \r\ngreat emotion\t\t\t\t\n\t\t\t\t\n\n"}