{"comment_0": "\nAfter watching the video I have to say this song is about a couple that broke up they both feel the regrets of the break up but for some reason can't get back together, both feeling the lonliness and so they settle for the next best thing an imitation of the lost loved in the form of a stranger. \"Id rather hurt then feel nothing at all.\" We all know after a break up how vulnerable we feel and in the video it shows just that. \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song is so beautiful! I love the whole sound and flow of it! The first time I heard it was when they performed it at the CMA Awards...and I fell in love with it right away. My favorite line is \"I'd rather hurt than feel nothing at all.\" So true. I can't get enough of this song! \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIt's too true to be ignored.\n\r\nLady Antebellum initially struck me as an Alternative band, since I never heard any of their songs before, but after listening to 'Need You Now', I know they're not your average band. They're Country (best genre imo, also the genre of my favourite performer, Taylor Swift), and it took just one song to get me attracted to it.\n\r\nI wow at the high level of truth inside one particular song, and I grow to like the song. Excluding Taylor's other 'true songs', NYN was one that struck me oh-so clearly. The lyrics were true. The tone was true. Everything was true.\n\r\nSometimes, songs like this scare me. Because they're so true, it's hard to believe it's just a song and not an autobiography.\n\r\nOne current situation like this is happening around me. Trust me, the lyrics are scarily true. I just hope things will improve.\n\r\nYou rock, Lady A. Continue shinin'. Love is with 'ya.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nGreat song. I think this how we all feel about a lost relationship after we have had a few drinks. I cried the first time I heard it.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n\"Reaching for the phone 'cause I can't fight it anymore\r\nAnd I wonder if I ever cross your mind?\r\nFor me it happens all the time\"\n\r\nShe needs to talk to him and is trying to resist but after a few drinks she doesn't have the self control anymore. She just needs to know if he ever thinks about her.\n\r\n\"Another shot of whiskey can't stop looking at the door\r\nWishing you'd come sweeping in the way you did before\"\n\r\nGREAT lines.\n\r\n\"Guess I'd rather hurt than feel nothing at all\"\n\r\nCouldn't agree more with this line - It's a live and learn type experience. You learn from the hurt.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIt's pretty obvious that this is about drinking a little and remembering an old flame you still want.\n\r\nGreat song :)\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI heard this song last night, my friend and i dancd to it. My favorite line is,\n\r\n\"Its a quarter after 1 i'm a little drunk and i need you now.\"\n\r\nI've been there before!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song reminds me of how me and my ex would feel after an aurgument.\r\n\"Reaching for the phone 'cause I can't fight it anymore\r\nAnd I wonder if I ever cross your mind?\r\nFor me it happens all the time\"\r\nThese lines make me realize how alot of couples feel.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n\"picture perfect memories scattered all around the floor\"\r\nshe is going through old pictures and having memories come back to her.\r\n\"reaching for the phone cause i can't fight it anymore\r\nand i wonder if i ever cross your mind??\r\nfor me it happens all the time.\"\r\nshe has been fighting her need to call and talk to him and ask if she ever crosses his mind.\n\n\r\ni effing love this sone it reminds me of my most recent ex.\r\nfor whom i still have bookoo feelings for!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthis song is so amazing! i absolutely love it and want to dance every time i hear it! it has such a great beat and is so sad yet true. my favorite part is after the bridge when Hillary sings the chorous with no backup singing. so pretty\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song is wonderful! i LOVE the part that says \"Guess I'd rather hurt than feel nothing at all\"\r\nIn order to really love its gonna hurt a little, its better to feel the good and the bad then be numb to it all. I love this song! Well done Lady A, I am not a big country fan but you have won my heart.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nMost people would interpret this as a song after a breakup, but it really reminds me of the way I feel when I start missing my best friend. I lost the best thing that has ever happened to me almost two years ago to a gun accident, and there are nights when I just need him there. This song perfectly describes that sick hopeless feeling I get when I start missing him, usually after I've got a few drinks in me. \n\r\nI always try to convince myself I can make it on my own, but I do need him. I find myself drunk and calling his old number all the time.\n\r\nThis is an amazing song.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nAbsolutely amazing! Lady Antebellum expresses what so few music artists can these days; those raw emotions that are hard to put into words. Life goes on, but when you try to go to bed alone when she's no longer laying next to you can be just as painful as the day the relationship ended. \"I'd rather hurt than feel nothing at all\". The pain only means that what you had was real.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nMy Best Friend/boyfriend sent me the lyrics to the chorus of the song last night and said that it reminded him of me, and how he tried to leave but he couldn't handle being away from me because he has such strong feelings for me. \n\r\nBasically I think this song talks about how you try to leave someone but no matter how hard you try and no matter how much the hurt you, you can't get them off of your mind so you are sitting around thinking about that person, trying to find things to cope and take your mind off of the situation, and in this case she results to drinking whiskey and watching the door hoping that they would come back like they always do, but not this time so you try to not pick up the phone and call but you have lost all control due to your thoughts about that person.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI'm really digging this song. And it's hitting home...trying so hard not to call my ex.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\n\"Picture perfect memories scattered all around the floor\"\r\nShe thinks about how the \"perfect\" the relationship was but now that its over, all she can remember are bits and pieces of the relationship. \n\r\n\"Said I wouldn't call but I lost all control and I need you now\"\r\nThey are both hurt by the relationship and to keep things easier, they have agreed to leave each other alone but she thinks \"I'd rather hurt than feel nothing at all.\" She knows that calling will only leave them hurt in the end but his comfort out weights her cost later. Its like undoing stitches before the wound has healed. \n\r\nAll in all, its the difficult end to a relationship between co-dependent people. All the tug and pull in search of some comfort. \n\n\n", "comment_16": "\nwow...was this song wrote for me?\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI'm wondering what she is trying to portray in the video by having the two different guys she seems to end up with at the end of the video. There has to be a hidden message there, or inside message unless I just missed something. As a writer my self, I do stuff like that a lot and people sometimes catch it and ask me, and sometimes you would have to be the individual I'm writing about to understand what I'm saying. \n\r\nDoes anyone here know what she's trying to say by winding up with two different guys at the end????? \t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThe song to me is about a relationship that went terribly wrong.  Neither person can make it back to the place they once were and make the relationship right.  It can be a parent and child, siblings, friends or a pair of lovers.  I cry about my son each time I hear it.  Everyone has a relationship that went terribly wrong and no one knows how to fix it.  That is why this particular song holds meaning for everyone.  \t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nwell last night i had a dream where my friend was explaining 2 me y this song is about a cat being stuck in a hole and a puppy coming 2 rescue her... forgive me if this sounds somewhat ridiculous\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI doubt that I'm the only one interpreting this as a booty call song. While it sounds great, and the lyrics flow beautifully, to me it sounds like a song about a drunken booty call.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nDrunken booty call?  This song sure is about that.  But it's a about the most perfect song that I've heard on the subject.  And can't so many of us relate to this?\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nRemember Kid Rock/Sheryl Crow's duet \"Picture\" from about 2005?  Well this is the 2010 analogue of that song.  Get you vocal cords warmed up for your karaoke part!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis is a song about a man and a woman who has had a affair and they are missing each other. And every time they drink they get each other on there mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nIma keep it real at least from my experience. This song is about me or anyone else thats horny from a night of drinking or coming back from an outing with friends. Drunk dial an ex or fwb...lol most times u regret these calls.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is about a love lost relationship. They loved the person and can't be with them so they get drunk and go find someone that comes close an imitation. They rather hurt then feel nothing at all. Living a lie is sometimes easier then dealing with the pain.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI love this song, it means a lot to me..\r\nI discovered this song just after my ex broke up with me. I still love him, and i always think of him/ I went through bad times when i started drinking a little, so this song always reminds me of that...\r\nI still love this song, but yeah, i dont drink! :D\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI totally agree this is a booty call song! And a great one at that!\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\ni think its about someone that she or he is in a bad situation\r\nshe is thinking what should she do?leave or stay?\r\ndo you know sometimes we fall in a road that it has two way\r\nin one way our heart say stay with him or her but maby its not the true way in reality just in our heart\r\nand in the other way you must thing about what are you doing?sometimes leaving is better and someone in our head says do the right work\r\nin this time maby we confused but we shouldent lose our self\r\nbut im always in these two ways and im waiting for somebodys help\r\nthis is the time that i need my love to say me what should i do?\r\ni just need you now\r\noh baby i need you now\n\n\n", "comment_29": "\nThey broke up.  But their connection was strong and they still need each other.  It's an internal struggle to NOT jump back into a screwed up relationship in a time of weakness.  They aren't in a booty call or getting back together.  They are feeling the loss of the other and are resisting the urge to jump back in.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThe story of my life...I reconnected with an ex that I dated 4 years ago, and we both still have feelings for each other, but the timing is wrong. Three days before she contacted me...I had been thinking, I wonder what she is up to and I almost sent her an email, but stopped my self because I didn't know if she would even remember me...needless to say...she and I talk daily now.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nAs far as I see is about a person suffering from alcoholism. Although the song is very beautiful it is about a person that is an alcoholic. When going to town that person usually gets wasted and if she cannot catch a date she usually starts calling people, old friends, ex lovers, etc. Although there are cases when someone that is not an alcoholic get so wasted that they start calling people in most cases is a sign of alcoholism.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nAs far as I see is about a person suffering from alcoholism. Although the song is very beautiful it is about a person that is an alcoholic. When going to town that person usually gets wasted and if she cannot catch a date she usually starts calling people, old friends, ex lovers, etc. Although there are cases when someone that is not an alcoholic get so wasted that they start calling people in most cases is a sign of alcoholism.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nMy favorite line is \" 'cause I can't fight it any more \", sometimes being drunk can make you be closer to your real feelings but also be too blunt compared to what you expected yourself to be. I'm not considering it positive.. to be unable to deal  with some situation without it.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nwhat would the rhyme scheme be?\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nSeen this song used ouit often and emailed to tell someone how they feel anout them.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis song to me, right now reminds me of my best friend. We're in a REALLY bad fight and this songs making me cry right now because its making me wanna call her but I know she wont pick up. I wouldnt wanna lose my dignity either, she crossed the line.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nThis song is about  you hurting and you need  that person to comfort you. Your telling that person that you need them now.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nthis song is about  the fact that your hurting and your telling that person that you cant  find peace unless that person is there comforting you. Helping you get through  your pain.Its that simple\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nJust what the world needs, a country pop song about drunk dialing.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI interpret it as that classic situation where one person in a relationship loves the other one more. And it becomes too much for the other person, so they break it off.  And the one is heartbroken but finally realizes they loved the other person too much, and don't need them anymore. They've moved on: something that I'm still struggling to do, as this has happened to me.\t\t\t\t\n\t\t\t\t\n\n"}