{"comment_0": "\nBieber can go die...\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIt's a song about accomplishing anything. The song says you should never say never, which means you can do anything, and nothing is immpossible. It also means you should stand up for yourself and believe in yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI ABSALOUTELY FUCKING HATE THIS, AND ANY OTHER SONG, BY JUSTIN BEIBER.\nIn my household he is known as the worlds biggest SHITPILE and ASSHOLE and deserves to ROT IN HELL\nSo, JB, do us all a favour & GO GET YOURSELF RUN OVER or something you fucked up son of a bitch.\n\n\nIf I were related to you I would probably commit suicide.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nheard this song when i went to see karate kid, its a good song. cute.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI've listened to this song a bazillion times before the movie, and when it came on in the theatre, I screamed, \"IT'S JUSTIN BIEBER!!!!!!!!\" Like a maniac... i have no idea why. LOVE THE SONG!! I <3 JB\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI LOVE JUSTIN BIEBER!!!<3\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni remember when i watch never say never movie and that's true. Justin never say never to reach the dream! and i can do same with him! and when i hear the song that song give some feel like fight and don't give up to reach everything you want even tough all of people laugh about your dream or better than you, don't give up and say 'never say never!' you can get your dream. i feel like that :)\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI turn this song off whenever it reaches Willow Smith's part. Ruins the song to be fair.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song is clearly about our lord and savior, Jesus Christ.  And all that he would do to save the world.  To me Bieber is trying to portray himself as the Messiah.  Which he is.  Roll tide\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nto me this song reminds me of when i took this huge dump the other day, it was gross, beside the point i shaved my pubes today and unfortunately i farted in the process; this in turn startled me which resulted in me cutting my penis, it bled a lot but then i had my boyfriend suck the blood off of my sexual organ, we proceeded to have gay sex, i ejaculated on his butt. \t\t\t\t\n\t\t\t\t\n\n"}