{"comment_0": "\nI think this song is about New York\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe jazz! The sax, the drums, Franks AMAZING voice... all comes together to make THE best song in the world... EVER!\n\r\nYou can feel the swing as it plays.. cant help tapping my feet and swaying my body with the soulful rhythem.\n\r\nWell done Frank!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song makes sense to Frank because himself he was so desperate to make a fresh start out of Hoboken (The place where he grew up). Ive never been to NY before but if i get the chance, I'll be playing this song in a taxi or something...looking at all the scenery...\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI worship this song\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI've always felt that this is like an infomercial for New York and that some corrupt Italian-American politicians put a gun to his head and forced him to make a propaganda song like this. Maybe it's just me.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nlast call at the bars back home in ct. when i was a kid growing up, yankee statium with my grandfather.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nthis song rocks my world.  i sing for a broadway dance group.  and this is one of my fav's that we sing\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthis song rocks everyone's world. New York City is stronger than ever, juts wish the chairman could have seen it now.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nok, so i love this song. when my brother was in the fifthe grade  (5 years or some odd ago...), his class put on a lip sync and it was right around the time Frank Sinatra died. my big brother was frank sinatra, and it was awesome. every time i hear this song, i think of how great that was, and how great new york, new york really, truly is.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\na timeless classic reminiscent of a past era that never dies\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI like this song. It's one of the few songs that I admit to trying to create my own choreography to...although I usually don't remember all of the steps the next time I try and dance to it. I'm from New York State, and even though I've never been to NYC, I still think it goes for ny state as well as ny city.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nAbout a guy thats living in a small town, somewhere in the U.S. that no one knows about in a smaller city  and he wants to get away and start a new life at the place to be, at  modern day rome itself,  NY! (Manhattan of course). :) \n\r\nIn the song he losing his love for his little town, and wants to start a brand new start at NY, cause he feels power, and he wants to feel the power, cause he knows when he is on top in NY, he is on top of the world! The feeling of power, and being in the best city in the world thats the center of it all!\n\r\nGod I love this song! :D\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ni love thies song it plays after every Yankees game i love going to the stadum waching mareano Ravra finish the game and then they play the song when ever i hear the song i think of Yankee stadem\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song is for people who want to make something big of themself.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nA great song about New York but there is no mistaking the sexual imagery all the way through.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI think this song is about making it in a big city. Ny city is really symbolism for Clearwater Beach Fl. When he says 'These vagabound shoes are longing to stray', he is talking about walking the beach. When he says ' I'm king of the hill, top of the heap'. Most people realize that Florida has the lowest sea level of any state. He is adding humor and irony to the song. Another point of irony is when he says, 'I'm gonna make a brand new start of it in old N.Y.' The word old is perhaps the biggest clue . Most people retire on Clearwater Beach. Being older, hence retirement. The brand new start is simply retirement.  \t\t\t\t\n\t\t\t\t\n\n"}