{"comment_0": "\nI actually think that the lyric is 'Viral mess, turned dreams into an empire' - the idea that nowadays someone can post a video of them singing, or a piece of their art or fiction or whatever and turn their 'dream' into a massive career to make money- 'an empire' and then now the success that she (not necessarily Halsey but the generation of person that she's singing about) has found has allowed her to 'roll with the Rockerfellas'  - the most powerful, the richest people...\n\nThe song itself is definitely about this new generation of people who are growing up now who are becoming more liberal and accepting of social and economic differences ('Hamptons-bound but we don't feel like outsiders at all'), sexuality (second verse), diverse music tastes (?)('Raised on Biggie and Nirvana) etc etc. \n\nBut I also feel like there's an air of sarcasm or maybe even a challenge in the song - if we finally do claim the fallen city and spread these 'new and improved' attitudes will we really be making a difference? Will we really be the New Americana or will we simply be a new generation of the idiots before us? ('What kind of bubblegum have you been blowing lately?') - what kind of dreams have you been exercising lately, your more interested in being a consumerist a follower of trends rather than a leader ( 'so we hold it down when summer starts' )- but can you hold down the city, these new ideologies once the summer ends? Can we BE the New Americana? \n\nMaybe I'm being too philosophical? Great political song, no wonder Halsey said that radios across America are 'terrified of playing it'.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nCigarettes and tiny liquor bottles,\nJust what you'd expect inside her new Balenciaga.\n{Someone's hiding something in their expensive purse, maybe saying that rich people are not as happy as they seem?}\nBad romance, turned dreams into an empire.\n{1. Maybe name dropping without name dropping Lady Gaga who made a fortune, of course, with Bad Romance or 2. Someone taking their heartbreak and turning it into self-made success as we see in the next line}\nSelf-made success now she rolls with Rockefellers.\n{Rags to riches, now in the same league as a historically rich and famous family}\n\nSurvival of the richest,\n {Making commentary on how in America, \"survival\" and \"success\" are synonymous with \"fame\" and \"fortune\"}\nthe city's ours until the fall. \n{We have control until we mess up and have to rely on higher ranking individuals}\nThey're Monaco and Hamptons bound, but we don't feel like outsiders at all.\n{We are diverse, we are still Americans even though we're not millionaires}\n\nWe are the new Americana,\n{America is changing, this generation is changing it, we are the new face of America, not past stereotypes}\nHigh on legal marijuana,\n{Progress that has occurred because this generation fought for it}\nRaised on Biggie and Nirvana,\n{1.These people grew up listening to diverse genres of music, metaphor for acceptance, also confirms that the \"New Americana\" are 90's and early 2000's kids.}\nWe are the new Americana.\n\nYoung James Dean, some say he looks just like his father,\nBut he could never love somebody's daughter.\n{James Dean in the 50's was a model for greasers/hoods, probably someone a parent would not want with their daughter}\nFootball team loved more than just the game\nSo he vowed to be his husband at the altar.\n{Football players (i.e. people in the eye of the media) love other football players, homosexuality is now acceptable, more progress brought about by the \"New Americana\" generation}\n\nWe know very well who we are, so we hold it down when summer starts.\n{Not sure about this one, but I'm sure it's some kind of figurative language}\nWhat kind of dough have you been spending?\n{Money, money, money}\nWhat kind of bubblegum have you been blowing lately?\n{Something about how much money you spend on everyday things?}\n\nSo these are all the thoughts that I have so far, if you have any other opinions please don't hesitate to comment!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\n\"Rockefeller\" always has connotations of blood money for me.\n\n\"The city's ours until the fall\" brings Fight Club to mind.\n\n\"We know very well who we are, so we hold it down when summer starts\" alludes IMO to how a lot of Americans deny how insecure they really are as leftists (read the unabomber manifesto). Also, how we thrive on coffee during the weekday, and beer on the weekend, and we're so hyped for friday and hungover on monday that we really only have three productive workdays a week.\n\n\"What kind of dough have you been spending/what kind of bubblegum have you been blowing lately?\" seems to be saying that spending the dough is blowing your money, i.e. bubblegum is a waste of money, a lot of our consumerism is a waste of money.\nI think hourly workers often forget that every eight dollars or so they spend is about an hour of gritting their way through work. I think they often forget to compare the quality of life lost by going to work with the effect their purchase has on their quality of life.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\n\"It's this idea of these kids who are part of a generation where pop culture is so heavily influential that diversity doesn't scare them the way it scared our parents and their parents. We're more accepting of different walks of life,\" Halsey explained to MTV News. \"So I think the New Americana is racially ambiguous, people who are proud of their culture and they own it, possibly not from a binary of gender.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI believe this song is about a new generation. I believe that this song describes a new generation that rose up to dominate the current goverment or higher power. If you watch the video, you will see that there is what I believe is a resistance. Halsey is pictured as the leader and she is taken from their base deep in the jungle. From here she is taken to a small town, where they planned on burning her at the stake. But causally, the townspeople intervene help her escape. After the climactic part of this \"story\" I inferred that the resistance is being watched because they are outliers. The lyrics, \"raised on Biggie and Nirvana\" tells that they are have a unique personality. As some people lye on the side of the punk and other the side of the rapper, this specific group of people combine to make a society in which we have now. When Halsey sings the line \"survival of the richest\", it relates to a world like we have now. The governments and higher powered organizations are ruled by rich ring leaders. And then when she sings \"until the fall\" it talks about when they run out of money to spend, their time is done. The line \"we hold it down till sommer starts\" is what I believe to be some kind of metaphor. Finally, I'll address the main idea of this song. The songs title is New Americana, which is what we live in now. Nowadays people are more excepting to sexuality, race, and religion than ever before. Our current millennials have strayed from normal tradition and they have crafted a excepting world. When someone screams out vulgar messages on social media that insult the gay community or the community that varies by different race, people stand up and don't stop fighting until they get justice. This is what I believe the meaning of the song to be, but it could be different to you. Only the writer (Halsey) could fully answer this question.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI feel like the song is about how this generation is learning to accept people for who they are. Though there is still bullying and stereotypes going on today, after hearing others stories we slowly begin to realize what weâ\u0080\u0099ve been doing to them and changing our ways. Iâ\u0080\u0099m gonna try to explain what I think each sections means:\n\r\nVerse 1: Something living their dream after being torn apart multiple times and showing others who told them they couldnâ\u0080\u0099t do it that they could\n\r\nVerse 2: How we are expecting Homosexuals and Bisexuals into our everyday life\n\r\nVerse 3: How weâ\u0080\u0099re finding out who we are and what we mean and that if you think differently about our choices, than you need to rethink them because weâ\u0080\u0099re going nothing wrong.\n\r\nChorus: Iâ\u0080\u0099m pretty sure that this part means that we need to all learn how to accept others for who they are. Like when she says â\u0080\u009cbut we donâ\u0080\u0099t feel like outsiders at allâ\u0080\u009d itâ\u0080\u0099s directing towards how we donâ\u0080\u0099t care how others act/look as long as their happy. And when she says â\u0080\u009cWe are the New Americanaâ\u0080\u009d it means that we (the new generation) not only growing in technology but as people as well. There are many people out that who are gay, lesbian, bi, depressed, have anxiety and a lot more and weâ\u0080\u0099re showing the world that we need to learn to accept others for not how they look, but for who they are. Wars and protests are going on because we never learn from our mistakes and weâ\u0080\u0099re trying to show everyone where weâ\u0080\u0099re going wrong, and when we try we get torn down and called assholes! This is why we need more singers like TÃ\u0098P, Melanie Martinez and, of course, Halsey. They all sing about loving them self and others. They bring up things like different kinds of abuse, suicide, mental dissorders and sexualities. We need more people like that or else they rest of the time we have on this world will be spent fighting each other. Also how people (mostly parents) wonder why their children cut and want to kill themself when the answer is THEM! Us (as children and teens) are growing up in this new generation where we are expressing who we really are and are finally being able to climb out of the tomb that our parents have buried us in. And with the messages that aritists like this are bringing are helping, and this is ONLY the beginning!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis is beautiful and amazingly political for such a new song. I hope to hear more from this band\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nSomeone please post the meaning...ASAP\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think this is a very important song , of pivotal importance perhaps .\nI see it difficult to find its meaning , so I 'll wait for more comments .\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nmy thoughts with the James Dean Verse is that when he was famous, and even still now, there was a lot of thoughts of him being bisexual, and never being able to stick with one girlfriend so the lyrics \"He could never love somebodies daughter\" has kinda a double meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\n\"We know very well who we are...\", that section of the song refers to the chorus of Biggie's song Juicy, which is worded differently but sung the same. Nice touch there.\n\nLove the socially conscious, intelligent societal criticism in these lyrics. It has a depth like I haven't heard in a long time for a pop song, and could only come from someone who knows what it's like to live outside of wealth taken for granted. We need more music with this kind of depth in the spotlight.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nRegarding the confusing bit for ppl here that keeps getting IDed as metaphor or \"don't know\" - it just clicked in my head, so I may as well write it down.  First I am synopsisisising the video imagery though. So warning to TL:DR people - TL:DR alert :D\n\n\nThe video bits (which help explain the lyrics) \n\nThe singer is singing from the position of a rogue group/colony leader, as Michael Hall posted -- she and her group are in no way \"rich\" with *money* - it seems in the video that no one is.  Even the soldiers are in minimal gear.   The rogue group are rich with freedom, knowledge, and in a self perceived *completely* different mindset than the generations before them.  (I'll explain, no h8 plzzz)\n\nMy impression is the â\u0080\u009cAmericanaâ\u0080\u009d is more than a snapshot of *now*, basically --this is a wider span than just Milennials, I'd say Gen X and younger â\u0080\u0093 I was listening to Nirvana when I was 16/17.  Note in the minimovie production video of the ages of the people watching her be marched to the pyre.  They are attentive, but tired, with neutral faces, and one can guesstimate the age demographic of the people in the little village (which may be a metaphor for dystopian city) is like 35-55.  That feels like my generation to me (GenX).\n\nThose older to slightly younger people looking overworked, tired, etc in their 30s/40s/50s, were just passively watching as she screamed, â\u0080\u009cHelp!  What are you doing?!  Why are you just standing there?!â\u0080\u009d.  Of course.  We're tired and old and jaded as anything,  Get off my lawn, dang kids.  Or maybe its just how a smaller fragment of our generation's subculture that was â\u0080\u009cnet connectedâ\u0080\u009d learned to handle things...  \n\nThe young faction steps out of the forest/jungle, ready to rescue their leader (who they silently ratted out when they got firing squad lined up â\u0080\u0093 I cant lipread the vid on no sleep so I don't know what the soldiers were yelling at them to make them single her out)\n\n...  However, when the smokebomb is tossed in, *all of them*, the passive watchers and the rogue faction, the â\u0080\u009cfollowersâ\u0080\u009d (as she is a leader, but didn't choose to be) leap to her rescue.  \n\nThere are things that are shared between some of  GenX and their children / neices/nephews / high school students / etc â\u0080\u0093 internet and the ability to have unfettered free flowing communication with nothing but the content of our words effecting anyone's opinions of us â\u0080\u0093 facelessly.   The internet, from baby usenet on old linux terminals in colleges and public libraries to now on every mobile phone ever, was a place where we could â\u0080\u0093 and still can choose to - share solely our written word â\u0080\u0093 no gender, no race, no age, no name â\u0080\u0093 nothing to identify us save how we *choose to be identified*.  GenXers picked it up later than millenials, but â\u0080\u009claterâ\u0080\u009d was between the ages of as young as 15, to 25, starting with dial up BBSes (old cheesy 80's movie WarGames, anyone?).  We watched an age be born. Kinda cool.  But still get off my lawn.  \n\nHowever, GenX who was online since there was an online tend to keep their heads down, or seem jaded and disinterested, because our upbringing was in some ways completely opposite.  We were latch-key kids â\u0080\u0093 I was home by myself from 13 on for three to seven hours a day because my mother was a widow, and she worked to supplement a very small widow's pension.  And those of us with computers using computers were the nerds and the outcasts, after all â\u0080\u0093 the literal 80s movie archetype of the glasses-taped skinny kid dropping his books in the hallway.  You learned to hide your heart in situations like that, back then no ones mom was going to rescue them from a bad day of bullying at school, there was no posting public to facebook and rallying a social justice response. If you got bullied, it was your fault for letting it effect you. Case in point:  Today there is a phrase â\u0080\u009cYou do not get to choose if your words hurt someone's feelingsâ\u0080\u009d.  But GenX, on the other hand, was raised with â\u0080\u009cNo one can make you feel inferior without your consent.â\u0080\u009d (Eleanor Roosevelt).  It's literally what we'd get told when we got home after getting jumped leaving schoolyard grounds.  And  the usual â\u0080\u009ctheyre just jealous of youâ\u0080\u009d â\u0080\u009cthey're afraid of you because you're smarter than themâ\u0080\u009d and the other usual bleh.\n\nBut here, in this sitation, things are going too far, even for those of us who sigh when we look fondly yet sadly at our old Doc Martens in the back of the closet.  They're are going to burn the leader alive, on a stake like a witch â\u0080\u0093 archetypically defined as a woman with the powers to change reality, and therefore a threat to the â\u0080\u009cestablishmentâ\u0080\u009d. \n\nSubtle expression changes happen on the older watcher's faces, the one man clenches his jaw, the grey haired woman's eye expression changes slightly â\u0080\u0093 and you see silouhettes in the smoke grenade cloud charge from ALL directions, not just where the leader's rogue group rescue party shows up. 3:37 â\u0080\u0093 3:48.  The â\u0080\u009colder peopleâ\u0080\u009d who obviously can't afford a vacation in the Hamptons either (thanks housing bubble â\u0080\u0093 thanks sooo much.  My credit rating was too high anyway) -- these people WILL help the young ones out when things get real, in any way they can â\u0080\u0093 but they can not follow the rogue group as they flee to another location entirely.  They are just as burdened with debt (if not worse) as the young ones in their 20s because we're the ones who got lulled into thinking it was safe.  They have assets they can not leave behind, or will not leave behind.  Switching jobs is dangerous. Losing financial stability at a later age is horrific because the corporations literally pay less for younger, and so if a GenXer loses their job, losing their family home is a very possible reality.  There are too many ties that bind then down to where they are.  They can't escape to a pristine new place, either due to physical or mental reasons. Different mindset on some things â\u0080\u0093 same mindset on others.\n\nLyric snippets here:\n\n\nVile romance, turned dreams into an empire \n(here I also hear â\u0080\u009cViral mess turned dreams into an Empireâ\u0080\u009d as moondustbaby did - think of everything that younger Gen X, then Y, Millenials, etc, have created that â\u0080\u009cgo viralâ\u0080\u009d - its a lot of things â\u0080\u0093 a â\u0080\u009cmessâ\u0080\u009d.  Think of meme culture. Then realize there is a meme culture, which is simply people putting funny words on pictures of things that eventually aquiree inherent meaning even without words:  for example if I just put up a picture of Fry from Futurama looking â\u0080\u009cthoughtfulâ\u0080\u009d without any message written across it, the â\u0080\u009csocial mediaâ\u0080\u009d generation will know the connection instantly and their head fills in â\u0080\u009cnot sure if [true thing] or [rediculously misinterpreted thing].  \n\n\nSurvival of the richest, the city's ours until the fall\n\n\nThey're Monaco and Hamptons-bound but we don't feel like outsiders at all\n\nSplit each line  in that couplet so you have a 4-line stanza:\n\nSurvival of the richest,  \n(those who give the orders to the gun-wielders who capture the leader to burn her - and also a double entendre as to who is \"rich\" - and with what)\nthe city's ours until the fall (\"ours\" is the rebellious group living outside of the \"organized\" society in their own subculture - this is not the fall as in \"falling\" -- it is the fall as in Autumn, when the rich return from vacation.  \"The city\" is likely a metaphor for being out in the open in society - able to exist as \"mainstream\")\n\nThey're Monaco and Hamptons-bound \n\n(again, this line is about the rich giving the orders - they're the one's Monaco and Hamptons bound -- flying to the Hamptons and Monaco as they are common vacation spots in summer)\n\nbut we don't feel like outsiders at all \n(The \"rebel\" subculture does not feel disempowered that they have less than those in control, and that they can't do the same sort of things as the rich.  Their happiness / self worth is created as an internal.  They are comfortable in \"the city\" where they do as they please, again \"until the fall\")\n\nWe know very well who we are,  \n(They are very aware that they are a new generation with views that are too radically misaligned with mainstream society)\nso we hold it down when summer starts\n(They hold down the city as one \"holds down\" a fortress  -- keeping possession of it .. again till autumn starts and vacation summer is over)\nWhat kind of dough have you been spending?\n(I hear \"What kind of tool have you been tuned into in here?\" (talking to the people casually watching the soldiers spilling gasoline all over her - â\u0080\u009cin hereâ\u0080\u009d might be in â\u0080\u009cthe cityâ\u0080\u009d)\nWhat kind of bubblegum have you been blowing lately?\n(Medicinal marijuana is distributed in chewing gum edible form. There *might* be a subtle reference here to the difference between those high on recreational versus government controlled distribution - state level or not. Dunno, but she's still talking to the people standing and staring, looking bored or simply neutral in the video who are not part of her rebel group.)\t\t\t\t\n\t\t\t\t\n\n"}