{"comment_0": "\nI think this song is about people having an affair and stealing moments to have sex. \n\n\"Oh, we both know the truth\nIf it were the real me and you\nThis wouldn't be the right thing to do\"\n\nThey are both leaving their identities as partnered adults for a moment and putting them aside. They both know it is wrong to have sex with each other but they are doing it anyway.\n\n\"It's too late to run away from it all\nIt's too late to get away from it all\nI'm done with running so I give it to you\"\n\nThey can't run away from their commitments but they can give their bodies to each other.\n\n\"This moment has caused a reaction\nResulting in a reattachment\nGirl, you take me to Nirvana\nI don't think this will last\n'Cause you're here in my arms\"\n\nNirvana is a state of bliss. The ecstasy of illicit lovemaking cannot last forever because the partnered woman can only be in his arms for a short time.\n\n \"Oh, baby\nOh, baby\nOh, we both feel the same\nI'm not gonna give you my name\nAnd I don't think you want that to change\"\n\nHe's not going to marry this woman and give her his surname. He knows she doesn't want a commitment, just some fun on the side with him.\n\n\"We're in this together\nWe don't know who we are\nEven if it's moving too fast\nMaybe we should take it too far\"\n\nThey are both being bad together and they don't even recognize themselves because of what they are doing. He's telling her to go ahead and cheat with him no matter what the consequences.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI actually find this song to be more about drunken and high loneliness and they really know they wouldn't be hooking up if they were sober, but the alcohol has kicked in and they're feeling it in the moment.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWhen I hear this song, the melancholy, aching strain, contrasted with the lyrics reflecting on the emptiness of a desperate physical connection... I think of it as social commentary on today's \"hookup culture\" where people seek love, get hurt somehow and also jaded by society's expectation (\"give her my name\"), despair of finding true love, and instead experience the \"nirvana\" of the present moment.\n\r\nFrom Wikipedia, \"nirvana\" means \"blown out\" (en.wikipedia.org/wiki/…):\r\n\"In the Buddhist context nirvana refers to the imperturbable stillness of mind after the fires of desire, aversion, and delusion have been finally extinguished. In Hindu philosophy, it is the union with Brahman, the divine ground of existence, and the experience of blissful egolessness\"\n\r\nThere is the heartbreaking detachment when having sex without committed desire, that has its own bittersweet beauty. \t\t\t\t\n\t\t\t\t\n\n"}