{"comment_0": "\n\"You can still get roasted because Marsh is not mellow.\"\n\r\nEminem is a lyrical genius! Amazing song, amazing album.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song, is EPIC on so many levels.\n\r\nFirst and foremost, I definitely think this song is a testament to Eminem's perseverance in the game. He has pushed his skills to a new dimension and timezone, surpassing Jay-Z and Nas (yet i feel, nas is still lyrically up there) easily. I'm not going to compare Pac or Biggie, cuz they have passed away...but in terms of rapid delivery, with lyrical creativity, EM easily pushes Twista 3x.\n\r\nHe changes up the tempo of his delivery to rhythmically create vocals that are instrumental on their own.\n\r\nThe only thing i found a little odd was his use of the word, \"fellow\" because i feel that word is dated, but when he rhymed it with \"You can still get roasted because Marsh is not mellow\", it totally is acceptable.\n\r\nThere has been some words, floating on the internet, that EM, was a bit ticked that Lil Wayne, and Kayne were getting attention, when he clearly felt that they --- for the most part were a bit over-rated.\n\r\nWell...you know how that saying goes. Keep your friends close, and your enemies closer?\r\nThat's what Eminem did. He did an Encore of Drake's Forever, and forever put lil wayne to shame, while grabbing the mic from Kayne, and sent him home, without a pen to his pad---jaws wide open, gag ball and all. Kayne is a plucked chicken.\n\r\nIn stead of stooping to Pac and Biggies level, Jay-z's and Nas's rivalry, and 50's and The Game's kiddy fest....\n\r\nEM, takes his adversaries, raps with them, and puts them to SHAME!\n\r\nSeriously, i think lil wayne is a joker, and needs to re-evaluate his style. It was cool with the Carter III, because it was \"new/edgy\" and took the world by storm, but now its repetitive, banal, and done. Lil Wayne sounds like his talking, there is no real delivery...like his technique is Juvenile compared to Em's. When Wayne speeds up his vocal delivery, it sounds like the start of Em's part.\n\r\nI love the way Em rips on Kanye, i'm sure Taylor Swift is gonna be bumping this tune in whatever car she drives.\n\r\nWhat i want? I want EM and NAS, to collaborate, and have DRE produce that shit. That's what i want to see...Not Wayne and Kanye, they both wanksta's.\n\r\nDrake, has some potential, but lyrically his subject work is cliche. 40, is a good producer for him...i feel drake can easily eclipse Wayne and Kayne, but has miles before he can touch Nas, Jay, biggie, Pac, or EM.\n\r\nEM IS ON TOP...and in the books forever. \n\r\nTOO $HORT should start taking notes.\n\n\r\nPeace out!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWhy wouldn't you want to compare Eminem, Pac, and Biggie...Here I will do it for you...Biggie is garbage and the absolute biggest piece of shit to ever get a record deal...So Eminem wins that one...2Pac is a lyrically god as Eminem...So this is where the comparison gets good, both rapped about real life...2Pac was the first of is kind, and you clearly see the influence of Pac in Eminem...We have no idea how long Pac's career would of lasted because he died young...So, we can't really continue or know for sure is better, but this is what I will say...Eminem just turned 37, which by that time most artists are retired unless they are country, and nobody likes that shit anyway, so forget about that...Eminem just released what is perhaps the greatest album of all time from any genre...Every song could easily be a number 1 single...He already has 3 songs from the album to reach number 1...If he has his next single hit number one it will tie the most singles to hit number 1 from one in history, right behind michael jacksons thriller...So Eminem may not only be the best rapper of all time...Perhaps the greatest artist of all time, the man is legend in has own right, and deserves the credibility that people get... \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI got chills the first time I heard this, knowing that Eminem is back.  Once he starts rapping 1000 words per minute, wow.  Recovery is fantastic\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n\"im alive again more alive than i have ever been\"\r\nrecovery is killen em\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song isn't a dis on lil Wayne it's weezy and em rapping about how all of the people in their past that showed them no respect (love) can kiss their ass because theyre on top of their game and now all the people that doubted them won't ever know the success they both have  \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\none of my favorites on the album :)\r\neminem is a genius \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nEm sure outshines Lil Wayne on this track. i didn't like the Lil Wayne part at all. it is so awesome to have the intense Em back.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ndont you ignorant people see gods esoteric messeges through music he wants you to listen to him be selfless because if you dont know what i mean or where im coming from then you got much to learn people i can help you find yourself\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni think this is a diss track about eminem's ex-wife kim\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nEminem is bacckkk!! no love for those who showed no love. this should be a single, excellent song.  \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nTo me, this track acts as a sequel to â\u0080\u009cDrop the Worldâ\u0080\u009d off of Lil Wayneâ\u0080\u0099s critically hated rock album, Rebirth. Instead of sounding as though these two were out with something to prove (that Wayne could create a rock album & that Eminem wasnâ\u0080\u0099t washed up); instead the two are saturated with confidence and feel as though these previous haters have already been proved wrong. The production of â\u0080\u009cNo Loveâ\u0080\u009d is solid (an interesting â\u0080\u009cemoâ\u0080\u009d sample, props to the creativity of Just Blaze) and Wayneâ\u0080\u0099s background screams sounds as though it was influenced by Drake, Wayne & Emâ\u0080\u0099s live performance at the Grammy Awards where Wayne acted as Emâ\u0080\u0099s hype man during Emâ\u0080\u0099s verse. In my opinion, Lil Wayne is essentially bowing down to Eminem (at least for this song) and his lyrical talents. Ironically, I feel as though Emâ\u0080\u0099s more abstract lyrics of songs such as â\u0080\u009cWonâ\u0080\u0099t Back Downâ\u0080\u009d are influenced by Tha Carter III.\n\r\nOn another note, with regards to the Kanye lines:\n\r\nâ\u0080\u009cMan get these whack cocksuckers off stage.\r\nWhere the fuck is Kanye when you need him?â\u0080\u009d\n\r\nEminem is referencing Kanyeâ\u0080\u0099s VMA micâ\u0080\u0099 snatch from Taylor Swift. Em slips in a pop culture reference that he is famous for â\u0080\u0094 he even adds in the hilarious â\u0080\u009cIâ\u0080\u0099mma let you finish in a minuteâ\u0080\u009d quote. In the past Eminem has stated he believed Lil Wayne to be over-hyped but after listening to his a few of his albums, came to respect â\u0080\u009cthe Martian.â\u0080\u009d Same with Kanye, with his preppy background and commercial competition with 50 Cent (Graduation vs. Curtis), Eminem probably thought about starting something back in the day when he was out of the game (at least as much as he had ever been since â\u0080\u009998).\r\nHowever, by this point in the album, Eminem has made it clear that he now respects Kanye & Wayne (see Talkinâ\u0080\u0099 2 Myself) and these lines are a clever plea for someone such as Kanye to come back into the spotlight and replace these â\u0080\u009cwhackâ\u0080\u009d less-talented rappers who are dominating the radio waves. \n\r\nOne last interesting aside, the lyrics â\u0080\u009crock fellowâ\u0080\u009d sound an awful a lot like Roc-a-fellaâ\u0080¦\n\r\nThis track is probably not the best on Recovery (I love Emâ\u0080\u0099s tribute to Proof in â\u0080\u009cYouâ\u0080\u0099re Never Overâ\u0080\u009d), but is definitely the most ambitious. Congratulations to Eminem on the comeback. I will be purchasing a copy of the LP on the day of its release to further support this recovery. \n\n\n", "comment_12": "\nthis song is great. em's verse is almost a diss of lil wayne who is on the same fucking TRACK... jesus man\n\n\n", "comment_13": "\nSick ass song!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ni think wayne makes the song go from a 10 to a 9, anyone agree?\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nLil wayne has no delivery he just talks as for em fucking brutal. best rapper ever\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI love the wit in this song, the rhymes, the similies and metaphors.  \r\nAnd just like in \"Forever\", eminem is the BEST PART of the song. \r\nHa, as usual. \n\n\n", "comment_17": "\ncompletely amazing. \t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nlil wayne,,,,, what a joke,,, drop the world, no love... eminem blows him out da water in both songs.... all i really gotta say is wayne trying to start a fight that JUVENILE is gonna finish.... BEAST MODE, G-CODE,,maybe he just trying to get more folks to buy JUVEY'S cds ... \n\r\nJUVENILES NEW CD \" BEAST MODE \" OUT IN STORES/ONLINE NOW...... LIGHTS,CAMERA,ACTION .... JUVEY PLAYING THE CHESS THING, CHECKMATE AND ERYTHING.....\n\r\nOh ill throw this in to not sure if its much of a diss but in eminems song with pink, theres line where he says \" lil wayne slurps syrup till he burps up\" 3:07 minutes into the song,, lol,,,, f!u!c!king lil baby.... piss on cash money records \n\r\nnow eminem is bad ass no doubt, but nas lol he sucks, eminem needs to hook up with the nola boy, juvey... that would be great music, both lyrically would tear the track up\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI'm in agreement...Eminem did it with this one....he deserves all the credit one can give him...for the lyrics on this song AND the album....both are genious.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nSo all this song is about how they are better than the other rappers? Seriously, who cares...why cant they write something more meaningful than how they are so freaking \"awesome\".\n\n\n", "comment_21": "\nEminem straight up disses lil Wayne right here think of this...\n\r\nEminem mentions kanye and Wayne in other songs in the album  but Wayne on multiple songs\n\r\nWhat he does here is let lil Wayne take the \"stage\" first and rap and after Wayne  rape about nothing em stakes the \"stage\" and says...\n\r\n\"look at these rappers how I treat them, so why the fuck would I join them when I beat them?\"\r\nHe is asking himself the question why is he even on stage with people who aren't as good as him. He continues...\n\r\n\"get these wack cock suckers off stage (lil Wayne), where is kanye when u need him\"\r\nGet wayne off stage now!!\n\r\nEminem \"snatches the mic from\" and will \" let him finish in a minute\" bc now eminem is gonna \"spit the greatest verse of all time\" so Wayne and all the other rappers need to \" go back to the \"lap and write new lines\" bc em is the greatest. He is so advanced and thinks of thinks and puts them in a way where you must really analyze it to see that he is dissing the same rapper he is on the track with.. What other rapper can do that????\n\n\n\n", "comment_22": "\ni think music like this is becoming a \"stereo-type\" 'cause like so many people can just look at the artist and like it because the person who raps it. but if you realllyyy listen to the lyrics you'll understand what it's about. i'm not saying this is a bad song or anything. because trust me i love it. but i'm just saying,-- look into your music. and know what it means. in my opinion, i think eminem is very talented and his lyrics are powerful, but sometimes he wastes his time rapping about the stupidest things.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nyeah i love this song im............. well im free look at me fly \r\nmom mom is that you \r\ngo fuck off god i saw you looking at eminem that way he is mine\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nEminem's voice pretty much gives me chills. Great song....he is the god of lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIt's not \"fuck what you say\", it's \"but what you say\".\n\r\nSong is made of win, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nmy ex boyfriend had me listen 2 this song while we were sitting on the couch just relaxing. it was really awkward... with all the words...and evrything was quiet inside my house...\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nor maybe these are just two very good rappers having a good time in the booth and you guys are looking into this shit to deep and just talking nonesense em and wayne have a very good relationship artist \"diss\" each other to stimulate cosumers \"us\" to buying their mixtapes and or albulms.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\n....oh damn...wait.\n\r\nhe already has.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthe lyrics are wrong.... he says \r\n\"cold hearted from the day i bogarted the game, **MY SOUL STARTED TO ROT FELLOW**\"\r\n how can so many people let this go? that think they know eminem soooo well. clowns. get a clue listen to his songs a few dozen more times and you might pick something up.\t\t\t\t\n\t\t\t\t\n\n"}