{"comment_0": "\nThe song starts out massive, sounding like something big is about to happen. It then lowers, almost as if its sneaking up but then BAM. It's there.\n\n\"And it feels right this time\nOn his crash course with the big time\"\n\nHe's basically saying that he feels good that his time to be \"big\" has arrived. Yo\nu feel his anticipation in the rhythm.\n\n\"Pay no mind to the distant thunder\nNew day fills his head with wonder, boy\"\n\nHe chooses not to focus on the risks of his decision because its distant. Instead ponders the rewards the new day is going to give him.\n\n\"Says it feels right this time\nTurned it 'round and found the right line\"\n\nHe's assuring himself that his time to be \"big\" has come. He's glad he turned his life around, and he found the \"right line\".\n\n\"â\u0080\u009cGood day to be alive, sir\nGood day to be alive,â\u0080\u009d he says\"\n\nHis excitement and assurance is palpable.\n\n\"Then it comes to be that the soothing light at the end of your tunnel\nWas just a freight train coming your way\"\n\nTunnels are like a shortcut, so instead of working hard to climb over the hill, he decided to take the shortcut and go through it. The light at the end of his tunnel wasn't the beginning of a new better life, but that of a train. The train was the risk he chose to ignore.\nThe second time this verse is repeated, the beat picks up, and he's realizing that his decision wasn't well thought out.\n\n\"Don't it feel right like this?\nAll the pieces fall to his wish\"\n\nHe comes to the realization that this was what he was asking for. He hadn't thought it through. Any shortcuts to something this big aren't going to come without risk. Everything had gone down to this moment, and now he has nothing.\n\n\"â\u0080\u009cSucker for that quick reward, boy\nSucker for that quick reward,â\u0080\u009d they say\"\n\nOther people ridicule him for not thinking.\n\n\"Then it comes to be that the soothing light at the end of your tunnel\nWas just a freight train coming your way\nThen it comes to be that the soothing light at the end of your tunnel\nWas just a freight train coming your way\nIt's coming your way\"\n\nHe knows its going to hit him, and hard.\n\n\"Then it comes to be\nThen it comes to be\"\n\nIt's happening. He losses everything.\n\nThis song is about knowing what your getting into. Any shortcut to a rich life comes with big risks. You have to think things through before you delve into them, otherwise it will come back to bite you.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI would not say \"unexpected\". See the third line:\r\n\"Pay no mind to the distant thunder\"\r\nThat means the storm is coming, he should have foreseen it, but instead, he just is too focused in another things:\r\n\"Beauty fills his head with wonder, boy...\"\r\nIt's liek some guy who has a good time, and thinks that nothing can go wrong, but because of this optimism he fails to see the signs that something bad is going to happen, so he is unprepared. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIt describes an unexpected change from good luck into bad luck. As an opposite \r\nof the good luck which represents a four leaf clover, a no leaf clover stands for \r\nhaving bad luck. \n\n\n\n\n\n", "comment_3": "\nMasterpiece\r\nMasterpiece\r\nMasterpiece\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ndo not always think that the light means good. maybe it is coming to defeat you.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nPerfect.\n\r\nA couple years ago, when I first heard this song I was getting invovled with an ex-girlfriend.\n\r\n\"Then it comes to be that the soothing light at the end of your tunnel \r\nis just a freight train coming your way\"\n\r\nThat pretty much sums it up... it was almost propehtic.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think it's about someone living life thinking it's all good & nothing could go wrong until all of the sudden it all does in fact go wrong. Don't walk through life blindly I think is the warning message here.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nit always gives me the image of a buisiness man who essentially sells his soul to get promoted. (i don't mean actually, but figuratively, say he ignores his family) his life then crashes and burns.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nto me...it seems like someone who has been down on their luck for some time, they've been traveling through a dark tunnel in their life so to speak.  this kid finally gets a break and things start to look up for him, everything is falling into place after all his pain and suffering.  he finally sees the light at the end of the tunnel.  so excited is he that he \"pay no mind to the distant thunder\". the thunder ultimatley being the sound of the frieght train coming at him.  by the time he realizes he is getting screwed again it is to late...the break he thought he had was his ruin.  this is my favorite song as it perfeclty describes my life. every time i think i see something good about to happen i crash and burn...\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThe song is about knowing what's happening next (in this case something negative) and not caring since it doesn't matter (no luck).\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nScrewation.  If that's a word, that's what it's about.  It's about getting your hopes up for something and not thinking about something else.  Then that something ends up putting you in a trance until you're screwed over and you \"crash and burn\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ni feel that this song means that he is unable to face reality and all he does is stay off in *dreamland*....\n\r\nthen it comes to be that the soothing light at the end of your tunnel\r\nis just a freight train coming your way\n\r\nthat's when he comes back to reality and realizes that it's not all peaches and creame\r\n(and i can relate to it too)\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI think that the words \"Sir\" and \"boy\" .... are very subtle references to the army ...... This kid enlists in the army with hopes of helping his country and be a good soldier and what not but then he dies.  \n\r\nI know I'm reaching kinda far but I really think thats it.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthe image that i get is lots of people fighting,in a war,good vs. evil, then good is victorious untill good goes over the hill and millions of evil is there. but, every last good fights till death agaist evil.deep huh?\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthis song is about death.  no matter what you do in your life its coming and theres nothing you can do to stop it.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI think that this song is, as allready said, about good luck and the change of it because of others and your blindness.\r\nIn the first part, the person is lucky, he lifes in dangerous, but he has fun (crash cours) He doesn't see the thinks that are coming (pay no mind to the distant thunder) The second part is about the life, he sais that the life this way is worth to live.\r\nThr refrain is the opposite to this.\r\nWhen you say, that there's a light at the end of a tunnel, you mean that it's getting better, that the dark times are ending. But the light that he sees isn't a good light, it's the light of a freight train that is comming, he will be killed.\r\nIn the 2nd verse, he is still lucky, but you allready see that this will end, because others don't like that\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThe symphonic intro reminds me of a race, or maybe something fast, moving in. Something large, powerful, could be symbolic of the \"freight train\" coming. Also if you listen before the lyrics...you can hear what sounds like train whistles. And just before the chorus comes in the music speeds up, and then halts suddenly...again signifying a quick end to something. An abrupt end. I interpret the song to be how everything is going right in your life...but instead of stopping to see the signs of trouble, you just go right along and let the beauty of life take hold of you. Then you do something to try and get ahead (\"sucker for that quick reward\") and you pay for it. But there's a light at the end of the tunnel...it won't be bad forever. But uh oh...that light was just a \"train\"...an even bigger problem then what you had before. You are royally fucked, and have very bad luck. Hence the name \"No Leaf Clover\" as opposed to a four leaf clover, which is supposed to symbolize good luck.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nwell i love this song, i heard it is already a cover, me and my mates are doing a cover for it for some demo tapes to send away.. i wanna be a rock star! for sure!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nAll of you are probably on the right track. It does seem to be about all your good luck turning around and slapping you in the face. Even in life, it seems that way. Anyone else notice it's almost like for every good thing, an equally bad thing happens to you? Oh well, anyway, I'm off on a tangent.\n\r\nMy opinion, however, is it's about being a celebrity. Everything will fall to your wish, everyone loves you, you're bathed in beautiful light. Everything's going right, and you think nothing bad can happen. Eventually, however, that beautiful light turns around; all his fortune falls, and he's royally screwed. \t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI just wanted to add that when someone is on the edge of death, they see a light at the end of the tunnel, and this song is saying, IMHO, that occationaly, life will deal you a \"No Leaf Clover\" or bad luck. In this case, its a frieght train, bringing you/him back to life in a horrible way.\r\nJust my opinion.\n\r\nNoah\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nthis song is SO about fucking.. well thats wot i've always thought.. hmm.. maybe it's just my weird and twisted mind :/ \t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nits ur weird and twisted mind\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI believe this songs all about having no luck whatsoever. Even when things start to look good they'll turn for the worst, and wind up making everything worse off than you started. I guess I feel this way because recently I was involved with a girl that I've grown to love, and when things were looking up she just basically blew me off for her old boyfriend. This is definetly my favorite Metallica song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\n\"Perfect. \n\r\nA couple years ago, when I first heard this song I was getting invovled with an ex-girlfriend. \n\r\n\"Then it comes to be that the soothing light at the end of your tunnel \r\nis just a freight train coming your way\" \n\r\nThat pretty much sums it up... it was almost propehtic. \"\n\r\nEXACT same thing happened to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis is probably my favourite song ever.\n\r\nTo me it just means everything seeming so so good and perfect you think it will stay that way forever, only for it to hit you when it's too late to fix it.\n\r\nIt's happened to me a few times, thank god I got it before it was too late last time.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI love the\r\n\"Then it comes to be that the soothing light at the end of your tunnel \r\nis just a freight train coming your way\"\r\nThat's basically what the whole song is about\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nGoing on with the war theme, have any of you ever read the book \"The Red Badge of Courage\"?  This song is almost exactly describing that book.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis song= the way my life has been since I came to college >_<\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nno matter what, life always takes away whatever little good we have, there is no good in life. thats what life is. and whatever little good there is in the world (music) keeps you hanging in there only to suffer more. the bad thing is that i am 13 and i gotta worry bout this. maybe thats a hint about the world. kids fearing of war, the cold side of the world... the only side\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nWow, that pretty much sums it up.  I've experienced a lot of these types of things too.  THat is why I'm always worried and strung out, cuz the minute I try to look up and hope things are okay, something else just ends up screwed up.  I don't think there was ever a time When I didn't worry or something.  I don't think there was ever a time when something bad didn't happen!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ni love the line...\r\nThen it comes to be that the soothing light at the end of your tunnel \r\nis just a freight train coming your way\r\n...just when u think its ganna get better and everything will be ok, u see the light at the end of the tunnel and u know ur ganna be out soon, u realize its a train...and once again your fucked\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThis song is a perfect definition of the term artistic. The song without the orchestra would be just fine, but with the element of classical touch to a hard song, it pushes it over the top and makes this a masterpiece. One of the best songs they have written, hands down.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nIt doesn't seem to me like good gone bad, but bad gone worse - everything looks alright, but you know deep down that its not.  Just then, the thing that looks like it is going to save you i.e. \"the soothing light at the end of your tunnel\" turns out to be the end of you.  Very deep.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\njust try to put yourself into him, and know that when he wrote this, it might be the same thing you feel, or have felt, its just amazing. We all have been trough it, and we know how it feels, it would be great to get james to this post, and see ppl, an read what they feel and think of his lyrics.\r\nits just a great song of meny others\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThis is one mother fucker of a song,Its lyrics are so well thought out,and probably the joint best Metallica have ever done[this and until it sleeps]\n\r\nthe preformance on S and M is amazing,The band really go for it.The whole S and M thing showed us a new side of the band,especially Hetfield.I love Jasond bass playing in this song,and the ochestra take the whole thing to another level.If you have not heard this song,find it.now.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThe take I got from the song is that it is a tribute to Cliff Burton in a way.  Since they were gaining popularity and \"riding high on the hog\", then suddenly all that was taken away from him (and them), regardless of how well things were going...\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis song always makes me feel really powerful when i hear it. Has a similar, but much greater effect than must've been running all day by glassjaw\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI think that the in the subtitles on the dvd \"S&M\"  the lyrics are different... \n\r\nmain time instead of big time\r\nhe's admired instead of pay no mind\r\nbright light instead of high lights\r\nthings respond instead of pieces fall\r\nsuffered for that great reward\n\r\ni will check....\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nbasically about not jumping the gun or taking things for granted just to get ahead of someone (all the pieces fall to his wish, sucker for that quick reward etc)\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI know I'm probably wrong, but especially since this is one of their more recent songs, I think it might be about the band itself. \"and it feels right this time\" is like James thinking maybe this time the band can put their differences aside. and \"pay no mind to the distant thunder, duty fills his head with wonder\" is like being a rockstar and enjoying it even though you're almost certain there's going to be more turbulance in your band's career. that's just my take on it. fucking AWESOME song.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\ni agree with ks7702, i think that its about how everyone dies, \"go into the light\" etc., and i also agree with that guy who said its about the army, im sure ive heard the line \"its a great day to be alive, sir\", or something very similar to it in a war film.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis song is about people pushing Christianity on him when he was younger. \"Suck up for that quick reward boy.\" But now he's mocking them saying that light you guys see at the end of the tunnel when you die is not Jesus Christ but a frieght train. He laughes at them, cause they got the no leaf clover. I am a Christian and I think that is what he is saying even though I still enjoy the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\ni expect people to disagree with this.\r\nthe child has lived in agony. but he's worked so hard for a reward he's going to get. but alas, when he thinks his light has come he sees the frieght train coming, and he's going to be heading for quite a different light.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI think that this song is largely about things that you think will be good, actually turning out to be bad. \"Then it comes to be that the soothing light at the end of your tunnel \r\nis just a freight train coming your way\". A 'soothing light' would usually be seen as something positive, but in this case, it actually turns out to be something he needs to run from. These lines are repeated over and over several times, giving a  theme of renewing despair and a feeling that this person is being constantly let down. He has no luck ('no leaf clover') and dying hope due to this.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nthis is why i bout S n M. great song. i only ponder how metallica played this song on tour last year if they didnt have the  orchestra. did they have a music boz that played it or did they just skip the orchestra. i didnt really care at the time cuz im only  14 and i was just phyced about seein metallica that close to me rockin the house\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThis song is about something unexpectedly bad happening in place of something thought to be good.  The soothing light represents the illusion of something good happening, and the freight train represents what actually happened.  What you thought would save you just ended up making shit worse.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nfully sick cus!!!!especially the s&m version!\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThere only is an S&M version retard.   This song is the best live performance. It sounds good enough to be in the studio.  This song gets me so pumped before polo games.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nGood day to be alive indeed\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\ni think it is about a relationship with a very beautiful person, and you want it to turn out perfect and you dream about it turning out perfect, but along the way you can tell it will turn out bad in the end; you really want the relationship to go well, but it just won't work... well thats one way i think it can be interpreted\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI guess you people pretty much summed this song up, especially Nacho. So i'll not elaborate. Awesome song. Nothing less.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\n\"And it feels right this time\r\nOn this crash course we're in the big time\r\nPay no mind to the distant thunder\r\nBeauty fills his head with wonder, boy....\"\n\r\nI had a big debate over the line \"beauty fills his head with wonder\", I thought these were the proper words from hearing the track, but on various websites it is \"today\" or \"new day\" instead of \"beauty\", i'm assuming this website is right!\n\r\nThat first line suggests to me someone who is steadfast in his goal, and he will see it through to the last regardless of dire ending it will bring him.\n\r\n\"Beauty fills his head with wonder, boy....\" \r\nSuggests to me that he has brain washed himself into seeing what he is about to do as a great thing, and that no force on earth can change his mind, but in the end...\n\r\n\" It comes to be that the soothing light at the end of your tunnel\r\nIs just a freight train coming your way\"\n\r\nHis dream is shattered and the duty he preformed has killed him, it could be interpreted as a soldier going to war, or any other blind fool who finds out the things he believed in were all lies....\n\r\nI actually considered this as an alternative for my collage music video \"Welcome Home\".\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nwhy aren't there more posts to this song??????\n\r\nits so awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\ni think this song can be about anthing..anything that seemed to be getting better and then out of the blues, u get screwed for some reason. Love, friendship, career, ur own life.\n\r\nAnd it feels right this time,\r\nSays it feels right this time,\r\nNew day fills his head with wonder,\r\nDon't it feel right like this...\r\nand then..\r\nIt comes to be that the soothing light at the end of your tunnel, was just a freight train coming your way..\r\nshit...jaymz is deep\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI love this song.\r\nI see it as how good luck can turn into bad luck. Hence the title. \r\nMy favourite line \"Then it comes to be that the soothing light at the end of your tunnel\r\nWas just a freight train coming your way\"\n\r\n-Queen Supreme\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\n@frijolito_ts \n\r\nDie in a chemical fire and drown in sulphuric acid you crap ass nu metal bitch!\n\r\nThat being said, I have a live version from Japan in 04, Lars does vocals great, kinda sounds like Dave Mustaine, actually.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\noops, wrong window! :D\n\r\nAnywho, I think this is a great song about a person who has something going right for once, the suddenly things turn bad. I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI love this song. It describes my life right now perfectly. I finally catch a break just to be knocked back down.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nHis life is going great and in the future he only sees great things. Then he starts thinking that maybe things aren't as good as he thinks, but he just doesn't pay any mind to that. And then all at once it hits him and everything goes wrong. He has not bad luck, but no luck.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nHis life is going great and in the future he only sees great things. Then he starts thinking that maybe things aren't as good as he thinks, but he just doesn't pay any mind to that. And then all at once it hits him and everything goes wrong. He has not bad luck, but no luck.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nby therymz on 05-10-2002 @ 01:15:39 AM  \r\nI think that the words \"Sir\" and \"boy\" .... are very subtle references to the army ...... This kid enlists in the army with hopes of helping his country and be a good soldier and what not but then he dies. \n\r\nI know I'm reaching kinda far but I really think thats it.  \n\n\r\ni could get into that the pay no mind distant thunder could be a battle in the distance that no one wants to think about and the light at the end of the tunnel being a freight train could mean something like thhey were on a convoy home and got ambushed but i have no idea maybe that dosent make any sence\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nNo Matter How Smoothly Your Life Could Go.. Let Alone Your Day... Theres Always Gonna Be Negative Consequences To Ruin It.. For Example.. The War Theme You Guys Are Talking About... You Cant Go To Battle Expecting Not To Lose Any Men... Your Going To Lose Lots.. You Have To Risk Tons To Gain Tons All In The End..\n\r\nLife Is A Vicious Cycle... Youll Wake Up One Day Eating Breakfast... The Next Day You Could Be In The Middle Of A Battle At Midnight, Wet, Tired, And Hungry.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nYou go on, doing your thing, full of optimism and all that good shit... Then, along comes fate and shovels a huge mouthful of shit in your face.\n\r\nEnd of statement.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nWell....\n\r\n1. Verses\n\r\nNote the point of view changes in the verses, as well as the progression,\n\r\nVerse 1 being from the more dominant of the 3(?) characters, as seen in using the the word \"boy\". also this voice seems somewhat jovial like someone seedy yet somewhat imposing (like a boss) trying to convince the boy into doing a job for him.\n\r\nVerse 2 is from the point of view of the \"boy\" agreeing to do whatever job this guy has for him, he is seen being less significant or dominant compared to the other character through refering to the other character as \"sir\".\n\r\nVerse 3-\"dont it feel right like this\" is in the view of the crowd or watchers or whatever, as denoted by the personal pronoun \"they\". they are talking about the boy commenting that hes trying to achieve somthing far too quickly, \"sucker for that quick reward\". however for the boy, everything seems to be going right, \"all the pieces fall to his wish\", this verse shows foreshadowing to what is going to be the downfall of this boy\n\n\r\n2. Chorus\r\nI see \"light at the the end of your tunnel\" reffering to the one big reason to be doing what your doing, such as charity workers who work to help people, the helping being their light. or the money at the end of the day for the worker. \n\r\nThe frieght train could either be the realisation (internal) or the actuality (external) of something going wrong in the boy's big plan, that completly devastates him. There is an interesting (and almost ironic) link between a frieght train being fast and unstopable and his \"soothing light\" being in the form of a *quick* reward.\n\r\n3. Futher analysis\n\r\nIn Classical Greece, it was thought that all heros had a fatal flaw that would bring their downfall.\r\n- Oedipus' urge to find the truth caused him to unknowingly kill his biological father and marry his mother and futher-more that same urge led him to discoverthe truth and for that his gouged out his eyes.\r\n-Jason's lack of concern for women led to his downbringing when his ex-wife killed his children and wife.\r\nHow does this rambling in ancient greece fit in to this story? what we witness is a very similar thing, our tragic hero (the boy) is brought down by his own fatal flaw, that being the urge to make a quick buck.\n\r\nOne could argue that it is not the boy's fault but the seedy character from verse one. To those people i ask this: Would the boy still have agreed with Mr Verse 1 if the opportunity of the quick reward wasn't there?\r\nProbably not.\n\r\n4. My message.\n\r\nChances are alot of you are thinking i may have looked too deep into this one. truth is i might have, when i started this, i just let my fingers do the walking and let myself get carried away. However there i do have one belief that i would like to share that relates to this song:\n\r\nThe greeks were right, we all do have these fatal flaws and to become a better person, it is up to us to identify these flaws, always be aware and work on either ridding ourselves of them or not allowing\r\nourselves to get into situations where , like the \"boy\", they become our downfall.\n\r\npheeew! thats about it. comments welcome\n\r\nCheers /\\.\\etallic|\\ for a great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nit's about someone who thought that the light approaching to his way is the answer to his problem.\r\nSo he was happy about it, he didnt listen to the warning of the distant thunder.\r\nHe was so preoccupied with the success.\n\r\n\"Pay no mind to the distant thunder\r\nNew day fills his head with wonder, boy\"\n\r\nbut it turned out to be his destruction.\n\r\n\"Then it comes to be that the soothing light at the end of your tunnel\r\nWas just a freight train coming your way.\"\n\r\nCool lyrics, yet heavy. =)\r\nJames is such a great lyricist.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nLet me just throw this out there, right or not...I love the song and have always wanted to know what these lyrics meant but this is what I originally thought.\n\r\nSubstance abuse:\n\r\nSays it feels right this time\r\nTurned it 'round and found the right line\r\nâ\u0080\u009cGood day to be alive, sir\r\nGood day to be alive,â\u0080\u009d he says\r\nHe finally finds something that makes his bad life feel good.\n\r\nDon't it feel right like this?\r\nAll the pieces fall to his wish\r\nâ\u0080\u009cSucker for that quick reward, boy\r\nSucker for that quick reward,â\u0080\u009d they say\r\nHeâ\u0080\u0099s a sucker for the quick high that makes his life feel good finally.\n\r\nThen the â\u0080\u009csoothing light at the end of the tunnelâ\u0080\u009d  will just end up being a freight train coming to drag him to the downfallâ\u0080\u0099s of addiction.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\ni'm big into not over analyzing songs and that a meaning is never wrong and while the whole war/bad luck thing seems to be really going for it the substance abuse part is pretty awesome.........i just don't think like that\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nIt's about a person who was too caught up in the present to notice the bad thing that was coming (\"pays no mind to the distant thunder...\").  He only cared about the \"quick reward,\" and was too busy living in the moment, and he ended up being let down.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nYeah your all right, The soft guitar intro represents or symbolizes happiness and comfort and the Heavy Verse repesents a reality check. Yeah, it's probably about some guy who thinks  he's happy and well off and then shit happens. The first two lines = Pure awesomeness, Typical James Hetfield\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nthis is just about the best song in my opinion that Metallica ever did... i can listen to this all day long.  it's really deep, and really gets you thinking.  i can't get enough.  Metal up your Ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI always had the impression this song was about fame and the entertainment industry:\n\r\n'On his crash course with the big time'\n\r\n'Sucker for that quick reward, boy'\n\r\nMaybe about someone who had it all, and just blew it.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\ni have to agree with everyone that says this song is amazing, because it definitly is. it's like... my 4th favorite song of theirs. does anyone else think that the symphony makes this song 220xs better? cause i do.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\ni think your all looking way too deep into this.  The song is obviously about a guy who thinks everythings going good and it turns out bad in the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nOk, so i haven't read all the posts on here, so forgive my ignorance; does it seem like this is a continuance of another song, or am i reading into this...\n\r\nalso, i am sorry. \"biso\" (?),\r\n it's JAMES, go back to Grammar-School, or First-Grade.\r\njust a pet-peeve of mine... like passing in a school-zone.\r\nLearn the language if you're going to post in it.\"\r\n-prerequisite.\n\r\nRock On.\r\n-me.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nfuck I love this song\r\nfirst heard it on the SnM dvd when I knew very little about metallica, but my older sister raved on about how amazing they were.\r\nyears down the track and now its probably my second favourite band...(first being nirvana)...\n\r\nlove the way they encoorporate symphony into this song, even on the original track, the intro makes it so much more powerful. \n\r\nLove love love it\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThis song could be about James, himself\r\nWith his alchohol abuse..now I'm sure he started drinking before metallica..but the bigger they got, the more he was suckered in for a quick reward..(sex,drugs, rocn n roll). they've always been down to earth guys,but im sure everyone feels invincible at some point during a famous carreer.and as soon as he saw the light at the end of the tunnel, because he's been to rehab several times..he just falls again into it alchoholism...But it cant be true about him anymore..he's really cleaned up his act. Atta boy James.\r\nGreat song\r\nLyrics are written in a way where you can make it your own\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\ni agree with no leaf clover on this one. i felt this song means something to me from the first time i heard it. my girlfriend always tells me that there is life at the end of the tunnel. then i come to this song\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nas easy as is to connect this song to sex, I think 'light at the end of your tunnel' more reflects the idea of the 'bright light' death cliche. The freight train is something that causes you to suffer even more, robbing you of a quick, painless death.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nOk, I'm gonna try this one without reading the others, so If I'm repeating, I'm sorry.  But I think it's about Trying to become famous or important and having to trust people who say they can help with that. \r\n\"It Feels Right This Time\" He wants to sighn that paper so bad that he ignores all his intuitions and other sighns that it might not exactly be smooth sailing. And Now, Looking back, he realises that he just walked into a BAD BAD situation.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nthe lyrics are wrong. its not \"sucker for that quick reward\" it`s actually \"suck up for that quick reward\" on another live video i saw of metallica doing this when james said that line he did the motion with his hand like he whas drinking something.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nIt reminds me of a old story i read abhout a man who has horrible luck and sells his soul to the devil for 7 years of increadibly good luck.  his farm turns epic and he is almost elected president, but then the devil comes to take back his dues...\n\r\nwhat the man thought was his salvation, his soothing light at the end of his tunnel, was actually going to be his demise, the freight train.\n\r\nhe knew the devil was coming for him, the thinder in the distance.  \"sucker for that quick reward\"\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nThe chorus is ironic, in that you think the light is coming at the end of a hardship (the tunnel), but in reality, your just getting screwed over again.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nI personally, fell it is talking about his life and how he should have known how his alcoholism would catch up to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nsolving one problem but being confronted with another\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nPersonally, I believe it's about being deceived.  Discovering that what you once thought was a way out was only another problem.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThis part, the light at the end of the tunnel, reminds me of the stories of near-death experiences. You wish to go to it, but if you do, you die.\r\nHere it turns out the light being that of a train, and that would kill you as well if you don't try to get away from it.\r\nThis was my first impression, so I may be getting it wrong :)\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nTo me this song deals with the unexpected, how each day we wake up thinking day will go so great, we make plans(New Day fills his head with wonder) etc...but how do we know that something sinister is not looming ahead(Never mind to the distant thunder)...Also the Soothing light is very symbolic of Life after death experiences...how that quick reward truned out for the worse...\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nIt's not just about bad luck,it's about the optimism that blind the mind and makes you forget about being careful and that you could be wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nMy interpretation is that there's this guy, who in the past has had a history of constant bad luck. Recently, however, he's had a string of successful occurences, and he's feeling on a roll, seizing the new opportunities hand over fist. Unfortunately, he gets too giddy by his success and quick reward, and he pays no mind to his surroundings, and fails to interpret the coming events correctly.\n\n\r\nBy the way, what a great song! Maybe the best song that Metallica have produced since The Black Album? I think so. Definitely has a potential to establish itself as a classic if only they played it more often live.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nA change from good luck to bad luck. That sums it up. When I first read the lyrics i thot the song was abkut a man who makes it in the big time like a musician or something. feel good. he gets popular. then the \"distant thunder\" is the music indistry about to break him down. he dont care, hes happy to be famous and kool. then he crash and burns. \t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nguys, this is obviously about a guy who was living his life doing whatever he wanted not living right then he died and went to hell \"when it comes to being the soothing light at the end of your tunnel was just a freight train coming your way\" means sin is charming and fun but its the path to hell that is. what it simbloizes.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nI think that it is about jumping into situations (\"sucker for that quick reward\") and not thinking about the potential consequences.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nI think its about someone who is using drugs.  Most likely heroin.   That will be his downfall eventually.    Sucker for that quick reward.  \t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nIt's about suicide.\n\r\nDuh.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\ngoogle murphies law... all will make sense lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nI think this song is basically centered around someone who thinks everything in his day is going great and nothing bad is gonna happen, but he ignores the message that it's not gonna go well.\n\nI can relate to this because I remember asking my friend to ask a girl that I really liked out for me, but she said no. However, my friend told me that she felt bad when she said no, so I thought I could get my way by trying to use guilt against her so she would've had to say yes. But I ignored all of the signs that told me not to do it. Back away. Just give it time. Yet my ignorance got the best of me and she rejected me cause she didn't know me that well. And before all of that I was thinking that it was gonna fall perfectly, she has to say yes. Every time I look back on that moment, I feel like an asshole for thinking I could use guilt against her.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThis songs about not relying on luck. Its the opposite of Four Leaf Clover.\nIn a nutshell its choosing your own path or destiny, either it be great or a train wreck at the end.\nYou have to live with your decisions, your luck has nothing to do with it.\n\nMy take is it's about the Band and the decisions it has made.\n\nAnd it feels right this time\nOn his crash course with the big time - This is the bands choice to go from underground metal of the 80's to their Arena Rock of the 90's trying to seek chart success.\n\nPay no mind to the distant thunder - The alienation of their original fans. \n\nNew day fills his head with wonder, boy - The pull of fame and success has them interested in what could be.\n\n Says it feels right this time\nTurned it 'round and found the right line\nâ\u0080\u009cGood day to be alive, sir\nGood day to be alive,â\u0080\u009d he says - This is the bands instant success with the change to Arena Rock music, Short term the decision/path/tunnel is \u007f\u007fworking out awesome.They have more fame and wealth than ever before. Great day to be alive\n\nDon't it feel right like this?\nAll the pieces fall to his wish - The belief they are making the right decisions and on the right track despite the accusations of selling out the metal scene.\n\nâ\u0080\u009cSucker for that quick reward, boy\nSucker for that quick reward,â\u0080\u009d they say - The metal scenes attitude towards the band and the rubbish they were putting out at the time. Selling out for the quick reward.\n\nThen it comes to be that the soothing light at the end of your tunnel\nWas just a freight train coming your way\nThen it comes to be that the soothing light at the end of your tunnel\nWas just a freight train coming your way\nIt's coming your way. \n- It's the bands decision to change their style and head into the Arena Rock Tunnel.all because of it's shiny light at the end called \"fame and fortune\". But in the long run it hasn't been the great ride the band anticipated,.it's been somewhat of a train wreck heading their way. Arena Rocks fame is fleeting like the pop fans that follow it and the pay packet it brings. That train wreck at the end of the tunnel is the bands reputation to the fans that respected them the most....the metal heads. That is the thing that would sting the worst, the fans that thought you were amazing before your fame and fortune, they now see you as a joke. \n\nBut it all comes out in the wash....In the end life is a series of tunnels and Metallica have since tried hard to get back to the metal scene and their original roots. Their original fans have returned and welcome them back with open arms while keeping a handful of pop rock fans. So it all ends well haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI think this song is about a musician who is trying to make it (become famous).  And he does.  But the fame and fortune that he always thought was the light at the end of the tunnel ends up being much less satisfying than he anticipated, and in fact he realizes it is a curse disguised as a blessing.  \n\r\nSome thoughts on the lyrics:\r\nTurned it 'round and found the right line = Switched some lyrics around and made a great song line out of it, the song that made him famous\n\n\n", "comment_98": "\nThis seems to me to be about a person who completely believes, despite warning signs to the contrary (\"the distant thunder\"), that he is on the path to great success (\"the big time\"). He has made decisions that were rash and unwise, blinded by his ambition of achieving greatness or prosperity.\n\nAt the beginning of the song, he's very optimistic. It \"feels right this time,\" he thinks (implying that he's endured failures in his past); it's a \"good day to be alive.\" However, he soon realizes that in acting carelessly and ignoring warning signs, he has set himself up for pain and failure, and other people are judging him for it. Perhaps they're his family and friends, or perhaps they're people who took advantage of his impetuousness.\n\nHe was so happy, believing that he'd finally realized his dream (\"the soothing light\"), but instead he finds himself crushed by defeat of his own making. Quite depressing, but I still love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nThis song seems to be exclusively about drugs, in my opinion. \n\n\"And it feels right this time\nOn his crash course with the big time\nPay no mind to the distant thunder\nNew day fills his head with wonder, boy\"\n\nDespite the warnings and the previous experiences with coming down off drugs, it's a new day and the addiction is overcoming his common sense.\n\n\"Says it feels right this time\nTurned it 'round and found the right line\nâ\u0080\u009cGood day to be alive, sir\nGood day to be alive,â\u0080\u009d he says\"\n\nRight line immediately makes me think of either snorting a line or finding the right vein to inject drugs into\n\n\"Then it comes to be that the soothing light at the end of your tunnel\nWas just a freight train coming your way\nThen it comes to be that the soothing light at the end of your tunnel\nWas just a freight train coming your way\n\nThe euphoric feeling from the the drug leads to coming down or an overdose\n\nDon't it feel right like this?\nAll the pieces fall to his wish\nâ\u0080\u009cSucker for that quick reward, boy\nSucker for that quick reward,â\u0080\u009d they say\n\nThe quick, fast reward that the drug gave him wears off and he is hit with the reality of what he did. Coming down off the drug leads to depression which he will want to alleviate with another hit which is only a temporary solution; a cheap fix for an underlying problem that he does not want to address.  Nothing comes easy though which is basically what the entire song is saying.\t\t\t\t\n\t\t\t\t\n\n"}