{"comment_0": "\nThe start of the song explains how Ariana is in a blissful state of mind and she doesnâ\u0080\u0099t want to change it. She has finished crying herself and hence no more tears left to cry. Breakups, deaths, relationships, life and so many other things could related to this song. But what you can do is, pick yourself up, love yourself and dust yourself and move on-as life does.\n\nDoes this mean she is cold hearted? Maybe, maybe not. But the important thing is she is in a process of healing and she loves not to be broken again.\n\n\"They point out the colors in you, I see â\u0080\u0099em too\nAnd, boy, I like â\u0080\u0099em, I like â\u0080\u0099em, I like â\u0080\u0099em\"\n\nâ\u0080\u0098Colorsâ\u0080\u0099 intend to mean the characteristics of a person. We often say no person shows their â\u0080\u0098true colorsâ\u0080\u0099 to the world, unless they are put in the spotlight. Flaws and imperfections are part of the deal in human nature. So either you learn to accept them or learn to not get involved with anything at all.\n\nQuote from JustRandomThoughs, \"We believe this is a good song with a sensible meaning by Ariana Grande. We cannot help but think â\u0080\u009cNo Tears Left to Cryâ\u0080\u009d was also inspired by the tragic bombing incident that happened at the Arianaâ\u0080\u0099s 2017 â\u0080\u0098Dangerous Womanâ\u0080\u0099 concert in Manchester in 2017.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI always love a song that allows me to sassily shout â\u0080\u009cshut your mouthâ\u0080\u009d on my commute home from work. \n\r\nThatâ\u0080\u0099s right, Ariana Grande is back to narrate your post-breakup feels and she. Is. Over. It. By the time we find Ariana, she is done grieving her old relationshipâ\u0080¦she doesnâ\u0080\u0099t have any more energy to put into being sad and sheâ\u0080\u0099s ready to start feeling herself again. She talks about being on another plane of existence...sheâ\u0080\u0099s transcended normal breakup grieving and has found her own enlightenment. In a song that mixes pop with some one-off techno, in combination with Arianaâ\u0080\u0099s naturally breathy singing voice, this song really does give you the feeling that you're in another world. You and Ariana are together on this breakup healing journey and sheâ\u0080\u0099s letting you know that you both have a bright and happy future.\t\t\t\t\n\t\t\t\t\n\n"}