{"comment_0": "\nThe meaning of this song is explained. It is credited to Lennon/McCartney although it seems Lennon wrote most lyrics.\n\n\r\n\"I came in and he had this first stanza, which was brilliant: 'I once had a girl, or should I say, she once had me.' That was all he had, no title, no nothing. I said, 'Oh yes, well, ha, we're there.' And it wrote itself. Once you've got the great idea, they do tend to write themselves, providing you know how to write songs. So I picked it up at the second verse, it's a story. It's him trying to pull a bird, it was about an affair. John told Playboy that he hadn't the faintest idea where the title came from but I do. Peter Asher had his room done out in wood, a lot of people were decorating their places in wood. Norwegian wood. It was pine really, cheap pine. But it's not as good a title, Cheap Pine, baby...\r\nSo she makes him sleep in the bath and then finally in the last verse I had this idea to set the Norwegian wood on fire as revenge, so we did it very tongue in cheek. She led him on, then said, 'You'd better sleep in the bath'. In our world the guy had to have some sort of revenge. It could have meant I lit a fire to keep myself warm, and wasn't the decor of her house wonderful? But it didn't, it meant I burned the fucking place down as an act of revenge, and then we left it there and went into the instrumental.\"\r\nPaul McCartney\r\nMany Years From Now, Barry Miles\n\n\r\nNorwegian Wood is a fake wood that was used to make cheap furniture. Lennon knew people who were using it in their homes and thought it would make a good title.\r\nThere are not many lyrics in this song, but they tell the story of a man who gets invited to a girl's house. When she won't let him into her bed, he sleeps in the tub. When she leaves the next morning, he sets the place on fire. It was one of the first songs Lennon wrote that told a complete story.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nREPORTER: \tI'd like to direct this question to messrs. Lennon and McCartney. In a recent article, Time magazine put down pop music. And they referred to \"Day Tripper\" as being about a prostitute...\n\r\nPAUL: \tOh yeah.\n\r\nREPORTER: \t...and \"Norwegian Wood\" as being about a lesbian.\n\r\nPAUL: \tOh yeah.\n\r\nREPORTER: \tI just wanted to know what your intent was when you wrote it, and what your feeling is about the Time magazine criticism of the music that is being written today.\n\r\nPAUL: \tWe were just trying to write songs about prostitutes and lesbians, that's all.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nNorwegian Wood is a type of very cheap pine. It burns quickly. Paul says it was his idea to burn the place down in the song. John says there was no one woman he was thinking about when he wrote this song, but that he was having so many affairs at the time, he wrote it in such a way as to keep his first wife Cynthia from getting suspicious. It has also been suggested that the woman in the song was the actress, Natalie Wood. As an actress, she would need to get up early to be on the movie set. John did meet a number of starlets in Hollywood during their tours, including Jayne Mansfield, but Natalie Wood has never been documented. With John's love for word play, it's plausible he would change \"Natalie\" to \"Norwegian\", but I doubt this.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis song is so vague because john was having an affair, but since he was married to cynthia at the time, he didnt want her to know.  the sitar is the best part of the song...\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis is a clever little song about revenge, which seems odd for the Beatles, but the sly twist makes it more humorous than cruel.  He sets up by saying he once 'had' a girl, meaning he had her where he wanted her, or so he thought.  In fact, it was she who 'had' him, as in yanked his chain.  She made him think he was going to get lucky, but all she really wanted was his company for a few hours.  \n\nSo, the girl invites him to her place, and he is expecting to get it on with her.  Instead she prattles on and on until 2 AM, talking about irrelevant things and trying to impress him: \"Look at this place, it's made of Norwegian wood.  Isn't it good?\"  So he's been waiting all this time for her to put out, but she instead decides it's time for bed because she has to get up early.  She does not invite him to sleep with her (thereby the song hints that they didn't do what he was there expecting to do--have sex); annoyed, he goes off to sleep in the tub, which is no doubt very uncomfortable.  \n\nWhen he wakes she's gone; she didn't even have the decency to wake him up and say goodbye.  So what does he do?  Burns down her precious Norwegian wood house. :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nReading all of these postings I became fascinated - OK obsessed -with all of the interpretations of this song.  I thought I knew what the song was about, but apparently not.  I decided to send out a poll to family and friends (ages 28 through 60) to get their opinions. I asked them 3 questions:\r\n1) Was one person seducing the other, and if so which one?\r\n2) Did they have sex>\r\n3)What does â\u0080\u009cNorwegian woodâ\u0080\u009d refer to, and how does it relate to the fire at the end?\n\r\nSuprisingly enough - with the 15 responses I got as many - maybe more - than are found here.\r\n1) 7 people thought that she was seducing him, 1 thought he was seducing her, the remainder thought it was either mutual or weren't sure.\r\n2)10 thought they did not have sex, while 5 thought they did.\r\n3) 3 people thought he burned furniture in the fireplace, 2 people thought he was smoking marijuana, 2 people though he burned the place down, 4 people thought that that Norwegian wood referred to logs in the fireplace, and 2 people thought the setting was Norway and that it referred to the forest outside.\n\r\nDespite the relatively few answers to these questions, it resulted in a myriad of combinations, so only a few peoples' interpretations of the song coincided : e.g. she seduced him, they had sex and he threw a table in the fire vs. she seduced him, they didn't have sex and he lit the fire in the morning, vs.....\r\nAnd interesting point, a couple reserached the song, were surprised by the arson theory, and flat out rejected it. \n\r\nAs for my own interpretation - - it was similar to azaudâ\u0080\u0099s.  I also feel compelled to discount the arson theories based on the meoldic nature of the tune and the tone of the lyrics. \n\r\nGreat discussion on everybody's part.  \n\n\n", "comment_6": "\nThis song reminds me of a British movie that came out in the eighties about\r\nan English college exchange student who goes to Paris,where she loses her virginity\r\nto a Norwegian boy also a student-hence-\"Noerwegian wood\". Rather cheeky that huh?\r\nAnyways...\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nTo rhink:She had no furniture left when he got there (\"there wasn't a chair\")- she'd already been using it for firewood. At the end, he burns the whole house down. Says Paul,\"It was me who decided... the house should burn down...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nhmmm....i always heard this song was about a drug addiction.  it was written just as the beatles were appraoching their \"druggy\" stage.  \"i once had a girl, or should i say, she once had me\"~~ sounds almost like an addiction, huh??? and when he wakes up and she is gone, it's like the morning after a night of getting toked up.  i'm not sure, you guys have some pretty good ideas though, i could be wrong....any ways the BEATLES rock!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nNorwegian Wood is slang for hashish...\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nIt amazes how complex some interpretations are, when to me the song's meaning is so obvious! Drugs? Lesbian? Oral sex? Arson? Come on! You're reading WAY too much into this song! Here's what it means:\r\nThe narrator goes to the girl's apartment, which is furnished with Norwegian furniture (later made famous by brands such as Ikea). This furniture showed that she was cool and modern  -- \"hip.\" The \"she once had me\" line simply means that in the end she fooled him. The fact that there wasn't a chair simply means that the apartment was sparsely furnished -- not unusual in the style of a young, student-age single woman. He goes home with her, hoping for some physical interaction, and bides his time as they drink wine. But alas, she has only been teasing him, and goes off the bed  by herself after getting his hopes up by saying, \"it's time for bed.\" She leaves him to fend for himself as far as sleeping arrangements are concerned, so he crawls off (probably half-drunk) into the bathroom -- sleeping on the floor or in the tub, I presume. The next morning he wakes up after she has gone off to work, and is angry that she led him on, that she played mind games with him, so he lights a fire (in the fireplace, I assume) using some of her nice Norwegian furniture for firewood. This gives him a little sick pleasure as a sort of revenge for her teasing him -- exactly the sort of thing that an acerbic, cynical John Lennon would do, or would think of doing.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nof course, number one lesson from this song: BUY A SITAR\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nWow. I would have thought that for a song by the Beatles SOMEBODY would have gotten it right by now.  They broke up in something like 1977, right?  Anyhoot here is my take.  \"surreal\" came closest in my opinion, somewhat informed by talking with songwriters and pro musicians.  No the guy did not burn the effing house down or go around breaking up the furniture and no, nobody got stoned and no its not a secretive coded message about somebody's marriage at the time.  \n\r\nIt's just a song, people. Its a simple song, which works because simplicity is what Lennon and McCartney were good at.  Its about a fairly common for the '70s scenario that involves a sexless would-have-been \"one-nighter\". If you went to the College of William and Mary you know this sort of thing all too well. \n\r\nThe girl toys with the guy, who probably was a bit horny, and he really does go off to sleep in a cold, comfortless place, and he wakes up alone and full of bitterness at the lack of resolution of any kind; she does not explain, she just leaves. She got her own emotional payoff, so she is done with him already. \n\r\nThe \"fire\" referenced is simply the nature of the guy's feelings relating to anger and frustration. So he makes a fire in the fireplace, probably with peat or coal, to warm himself; not exactly the best conclusion to a failed night of thwarted passion.  The last line is bitter, very bitter, sarcasm with a slight reference to the cheap faux oak furnishings lacking sincerity or depth. Not much to read into it.   There is nothing in the musical progression to suggest anything so violent as breaking up the furniture or burning the house down; the Beatles were not in that sort of space in the late 1960's and neither was pop. Its just a simple song about sexual and emotional and spiritual frustration that goes unrelieved.  \n\n\n\n", "comment_13": "\nIkea? No wait that is Swedish nevermind didn't have them back then anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthis is just assuming we took what he said literallyâ\u0080¦\n\r\n\"I once had a girl \r\nOr should I say she once had me \r\nShe showed me her room \r\nIsn't it good Norwegian wood?\"\n\r\nwould imply that he had a girl that had a hold on him, she took him back to her place and they shared a joint.\n\r\nShe asked me to stay \r\nAnd she told me to sit anywhere \r\nSo I looked around \r\nAnd I noticed there wasn't a chair \n\r\nI sat on a rug biding my time \r\nDrinking her wine \r\nWe talked until two and then she said \r\n\"It's time for bed\" \n\r\nthe first part would suppose she wanted him there, and that she was a minimalist (or a hippy i suppose i'm not sure of the difference, i'm sure you guys will inform me of it ;) )\r\nthe second part would state his intentions, to get through the small talk waiting for an invitationâ\u0080¦. open sitar *wink guess whats happening :P\n\r\nShe told me she worked \r\nIn the morning and started to laugh \r\nI told her I didn't \r\nAnd crawled off to sleep in the bath \n\r\nher telling him that she worked in the morning and laughing was her way of saying that she was in control, (just like us guys do in the morning after a one nightstand) and he crawls to the bath like he's been used and abused as one would after a long night.\n\r\nAnd when I awoke I was alone \r\nThis bird had flown \r\nSo I lit a fire \r\nIsn't it good Norwegian wood?\n\r\nand when he woke up from his nap in the bath, she was gone, so he lit up a joint and pondered the beauty of a drug that could get him into such a position...\n\r\nI'm no expert but I'd say that it sounds like he thought he had a really good night out.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI love this song.  It's just so...great.  This woman is trying to seduce him, and he just won't let her.  It's just a good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nramblingfool knows his Beatle knowledge. Well done.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nword, ramblingfool.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI just learned the meaning of this song a few weeks ago, Peter Brown mentions it in his biography of The Beatles (ramblingfool is correct)\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nFunny song.  Look at the reference to \"Norwegian Wood\".  I think she had furniture made of fine Norwegian wood.  When he woke up and she wasn't around, he was kinda pissed, so he set it on fire.\n\r\n\"So I lit a fire, \r\nIsnâ\u0080\u0099t it good? \r\nNorwegian wood\"\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni heard once that John is actually saying \"Knowing she would\" instead of \"Norwegian Wood\".  Has anyone ever heard of this rumor?\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nNot having any knowledge of the Paul statement, I have always thought that \"I lit a fire\" did not mean burning down her house, I interpreted it as ... he lit up.  My boyfriend is laughing his ass off at this idea, but to me it's more \"beatle-esque\".  So I'm passing the laugh on to you!!\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nWhen I first heard the title of this song, I thought is was about some hot Norwegian Chick, \"Norwiegen WOOD\" well you kno what I mean\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nthis is one of my favorite songs, mostly because of the sitar and the pretty lyrics.  George is my favorite beatle, and since he has a big part in this song (not saying that he doesn't in other ones) i'm pretty much guaranteed to like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ni thought he burns down the house b/c the woman led him on like they were gonna do wat the lyrics implied they did, but since they didn't he burned the place down...apparently, paul just thought that would be a fun way to end it...unless burning it down is kinda like putting it in the back of ur memory...fuck 'em and forget 'em...\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\ni always took it as she was a prostitute who had a room in a larger house-\r\nhe obviously cant have her then-\r\nso he burns down the ENTIRE house- i took it as a reaction the character has to the entire idea not just the individual\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI think you're all way off (especially 0cool). It sounds to me like this song is about a girl who plays with a guy's feelings... it starts off with the greatest line ever written \"I once had a girl, or should I say, she once had me\", which implies they were a couple, he was in love with her while she was just playing with him. The bit about the chair implies that she has no need for him, that he doesn't really have a place in her life. Sexual innuendo follows next, and I guess the guy in the song felt just like he needed to cool himself off in the bath. The reference to Norweigan Wood is there because she's a 'bird' that has many 'trees' to choose from. Litting the fire could perhaps imply suicide, or if that Paul quote is correct, that he burnt the house down.. her games having driven him insane and that's how he plots his revenge. I also think this song is definitely vague on purpose.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nalso have a look on dylan's \"4th time around\"  (songmeanings.net/…)\r\nyou clearly notice the connection when you listen to both of the songs\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nNorwegian Wood is slang for hashish...\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthis has to be one of my all time favorite beatles songs ever, its absolutely beautiful\n\r\nmy interpretation was that the girl pretty much controlled the relationship, and how it was just a brief fling that ended up not meaning anything.  the whole \"this bird has flown\" just shows the brevity of the relationship, and how he just lit up and ending with \"Isn't it good/Norwegian Wood\" kind of shows he doesn't care anymore.\n\r\nbut anyways i always thought \"So I lit a fire, \" was definitely about drugs\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ni always thought that it was i crawled off to sleep in the back......\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nnevermind, now that i listen to it, it does sound like bath.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI think the most impotant part of this song is when there are no lyrics, after \"it's time for bed\" there is an instrumental section, I thought that he went quiet because they were...well you listen and see if you think the same.  No vagueness there if you ask me.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI agree with the \"burn down the house\" theory.  I ask all my friends and they think I'm crazy!  But I know it's true...\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nthis song makes me want to buy a sitar.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI always thought it meant exactly what rhink says\n\r\n I think she had furniture made of fine Norwegian wood. When he woke up and she wasn't around, he was kinda pissed, so he set it on fire. \n\r\n\"So I lit a fire, \r\nIsnâ\u0080\u0099t it good? \r\nNorwegian wood\" \n\r\nEverythng in the song seems to fit that theory.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nits a one night stand lol\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI'm taking a course on the Music of the Beatles.  For anyone who wants to know - our text says it  is about an affair John was having.  The burning of a fire was an allusion to when he was struggling in Art School and he used to burn the furniture in his flat.  Paul tweaked it and said the house should burn down.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nhe says this girl seduced him, maybe he was having an affair, but he looked around and noticed there wasnt a chair, cuz she wasn't trying to welcome him really, so she didn't let him bang her and when he woke hes pissed so he burns her shit down. and george is kickin ass on the citar.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\ni just love the lyric, \"i once had a girl or should i say she once had me\"\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\ni agree with the whole affair thing.  \r\ni think \"i lit a fire\" is lighting a joint or some other thing... in any event, he was talking about smoking weed.  \r\nfor \"this bird has flown\" - \"bird\" is slang for a girl in england.  \r\ni didn't know that \"norwegian wood\" was slang for hashish (according to prokop), but that would at least partially fit my theory... but if that's true, then the whole song could be about drugs, since that is, obviously, the name of the song.  \r\nif that really is a slang term, then i really have no clue, i guess...\r\noh well.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nFocusing â\u0080\u009cNorwegian woodâ\u0080\u009d is misses the point.\n\r\nâ\u0080\u009cI once had a girl, \r\nOr should I say \r\nShe once had me.â\u0080\u009d\n\r\nSheâ\u0080\u0099s in controlâ\u0080¦(and the line I most like.)\n\r\nâ\u0080\u009cShe showed me her room, \r\nIsnâ\u0080\u0099t it good? \r\nNorwegian wood.â\u0080\u009d\n\r\nThey shared a connectionâ\u0080¦\n\r\nâ\u0080\u009cShe asked my to stay and told me sit anywhere, \r\nSo I looked around and I noticed there wasnâ\u0080\u0099t a chair.â\u0080\u009d\n\r\nYou can visit, however donâ\u0080\u0099t get too conformable.\n\r\nâ\u0080\u009cI sat on a rug \r\nBiding my time, \r\nDrinking her wine. \r\nWe talked until two, â\u0080\u009d\n\r\nA deeper connectionâ\u0080¦\n\r\nâ\u0080\u009cAnd then she said, \r\nâ\u0080\u0098Itâ\u0080\u0099s time for bedâ\u0080\u0099.â\u0080\u009d\n\r\nShe's still calling the shots.\n\r\nâ\u0080\u009cShe told me she worked in the morning and started to laugh,â\u0080\u009d\n\r\nIt is a fling for her, a simple prop to fill here time.\n\r\n\"I told her I didnâ\u0080\u0099t, and crawled off to sleep in the bath.â\u0080\u009d\n\r\nHe calls her bluff and takes a cold showerâ\u0080¦\n\r\nâ\u0080\u009cAnd when I awoke \r\nI was alone, \r\nThis bird has flown,â\u0080\u009d\n\r\nIt was no bluffâ\u0080¦itâ\u0080\u0099s her nature.\n\r\nâ\u0080\u009cSo I lit a fire, \r\nIsnâ\u0080\u0099t it good? \r\nNorwegian wood.â\u0080\u009d\n\r\nHe reflects on their connection and laments.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThis song may or may not be John's autobiographical account of certain bizarre exploits with original Beatles bassist Stu Sutcliffe in the early sixties club scene in Germany.\n\r\n\"I once had a girl, or should I say she once had me\"\r\nHe never had her, but he was \"had\" or led on by her.\n\r\n\"She showed me her room, isn't it good Norwegian wood?\"\r\nNorwegian wood refers to the room itself.\n\r\nAfter she says, \"It's time for bed,\" the vocals are interrupted (for the only time in the whole song) by an oddly placed and relatively lengthy musical interlude consisting of George's sitar theme played twice (also for the only time in the whole song).\n\r\nThis is a deliberately clumsy device to manipulate the listener into thinking (for about twenty seconds) that a pop song in 1965 has just made an undisguised reference to casual sex.\n\r\nThis was a time when married couples on TV slept in two beds.\n\r\nAfter John makes the same assumption as the listener, the girl rejects him and laughs in his face.\r\nHe sleeps in another room, not necessarily in a tub.\n\r\nIn the morning, the girl or \"bird\" has gone to work, assuming he will either let himself out or stick around for another chance at humiliation.\n\r\nShe is in for a smoldering surprise.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI had heard it was in response to johns experience with a lesbian. maybe he was 'had' in the fooled sense. Not 100% but im sure he wrote a track in this era about such an experience. Any thoughts???\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\n\"She asked my to stay and told me sit anywhere, \r\nSo I looked around and I noticed there wasnâ\u0080\u0099t a chair\"\n\r\nShe knows there's no reasonable place to sit, except on the bed beside her.\n\r\n\"She told me she worked in the morning and started to laugh\" \n\r\nShe's saying \"Let's hurry it along;  I haven't got all night.\"  \n\r\nShe's trying to seduce him, but he's not playing along.  \n\r\nI hadn't heard about the substitution of \"Norwegian Wood\" for \"knowing she would\" until recently, but it makes perfect sense, and reveals what his game is.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nIt's nice that everyone has an opinion but before posting things you should really have some factual info to back it up. A quick google search will show you that on an interview John says it was about one of the many affairs he was having, although he doesn't even remember who the woman was or why he used norwegian wood... it was a kind of confession but only to himself. Paul added the line about the fire and he clearly says it means that he burned the house down. Here's the link to the interview: listology.com/content_print.cfm/…\n\n\n", "comment_46": "\nWonderful song.  I have heard both that this was about burning down a house and having an affair.  Both do not make much sense to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nWe've heard what John and Paul said; we just don't believe it.  We'd like to think we're not as gullible as the reporters who they were having a little fun with. I think that's what fusionpit's story was getting at.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nPete R. is the only one on the board who had it completely right. I heard a John Lennon interview in which he said he and Paul had wanted to title it \"Knowing she would\" but the record company nixed it for being to suggestive. They decided to just change it phoenetically and were known to sing it \"correctly\" in shows. \n\r\nHe said it was simply enough about going home with a girl who was a \"sure thing.\"\n\r\nIt may have been about an affair or a prostitute, but I've never heard or read that anywhere documentable.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThere are a lot of slang words for drugs and I suspect \"Norwegian Wood\" came about after this song rather than informing the lyrics. I have always thought the lyrics strange. We have all been turned down by girls without setting the house on fire. The tone of the whole narrative is realistic up until that (implied) ending.\r\nIt is very like imagist poetry - a series of images convey a state of mind.\r\nI also think the music (and the sound of the words rather than their meaning) are better than the lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI'm norwegian.\n\r\nSo it's cool there's a song about something involved around norway. \n\r\nBut it would be cooler if it wasn't about our wood.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nYeah, it's about John having an affair with this woman.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nNorwegian Wood is a strain (type) of Marijuana.\n\r\nBut as stephenws said, it has little to do with the song.\n\r\nThe women is in control and her flirts mean nothing.\n\r\nWhen she turns him down, he lights up a spliff.\n\r\np.s. the connection is that they both enjoy the Norwegian Wood strain.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nJohn had an affair and wrote this song, but used these themes to avoid letting Cyn know.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI always thought this song was about a young man's first sexual experience being with a prostitute. I thought the second half of the song was about masterbation. \r\n\"She showed me her room, isn't it good, norwegian wood\" - she took him to her bedroom and he started getting excited.\r\n\"I was alone... so, I lit the fire, isn't it good, norwegian wood\" - He's all alone thinking of the night before, gets excited and has to jerk-off before he leaves.\r\nI see way too far into this.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nlove the sitar.. and the lyrics... probably my fav beatles song. so simple, so good.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nhnybny is right.  I've actually heard that before too.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\ni always pictured this blank house mirroring the hollowness of their affair. all there is is a fireplace and a bathroom, she sleeps on the floor, he in the tub. she left for work, he lit a fire and he's lonely like he was when the affair begun.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI'm not up on my Beatles history, but I do feel a personal kinship with all of the songs that John Lennon writes, and this was obviously a Lennon tune.  When I hear the words to this song, I simply imagine the simple but powerful feelings that correspond to each image that's put forth.  The entire song is sung in a kind of flippant and melancholy tone.  This lends emotion to the events taking place and transports me every time to being in the shoes of the man who is doing the narrating.  The emotions that I get are mostly are excitement at getting some tail, but at the same time a feeling of disgust and emptiness that they really don't mean anything to each other at all.  Also, I have the distinct feeling that I'm being used by the chic in the song, and that kind of pisses me off.  It's very significant that once he fucks her he crawls out of the bed and goes to sleep in the bathtub.  He wants to separate himself from the event after it's over, because he's not comfortable with it and really can't stand the chic because she's annoying and presumptious.  \"If anybody's going to be doing the using, it's me,\" he thinks.  I mean, accurately creating this feeling through song is a tremendous accomplishment, regardless of the trivia about who he was banging or which words he was allowed to use or not in conveying it.  Who cares about that tabloid garbage?  Certainly not me or any other intelligent person.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\none of my all time favourite , sitaring is really tuching . The lyrcs is of course, too good , just like other's Beatles song .\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI rather gathered that the Norwegian wood was the room itself - \"she\" shows him the room, he perhaps has a look of awe on his face at the beautiful room (well possibly not awe or anything that excessive) and she says \"isn't it good?\" (being the room) \"Norwegian wood!\" (being the floorboards or whatever ... Not furniture (unless it's the bed) as she didn't have a chair.\n\r\nAt the end, the lines \"isn't it good?/ Norwegian Wood\" are saying doesn't the wood from which this house was built burn well?\n\r\nAnd in terms of affairs - it obviously wasn't *quite* an affair ... as in they didn't have sex! He expected a sexual relationship but when he implied it (and the instrumental section is his hopes being up) she just laughs it off - he obviously got the wrong idea. Making the lesbian interpretation rather appropriate - he didn't realise that she was a lesbian perhaps and expected to sleep with her ... and she laughed at this expectation\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\n(as in the floorboards/whatever are actually MADE of Norwegian wood - at first it's something the quality of which to marvel but when he's burning it ...)\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nWell I agree with surreal.\n\r\nIt's just makes sense. Just look on the first page, you'll know what I mean.\n\r\npJ ;P\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI agree with pretty much everyone that George rocks on this. Here's my thoughts about the meaning.\n\r\nI once had a girl\r\nor should i say\r\nshe once had me\n\r\n-As already said just means shes dominate in the relationship. He wants her more than she wants him.\n\r\nShe showed me her room\r\nisnt it good? Norwegian Wood\n\r\n-This means what it says. She took him to her room and he knew she would\n\r\nShe asked me to stay, and she told me to sit anywhere.\r\nSo i looked around and i noticed there wasnt a chair.\n\r\n- He's in her room and she asks him to sit down so he sits on the bed bc there's nowhere else to sit.\r\nAlso thot this could imply they already had sex and she was asking him to stay for a while.\n\r\nI sat on her rug\r\nbiding my time \r\ndrinking her wine.\n\r\n-Here comes where my theory becomes different and also a huge line in the song if my theory is right.\r\nReading all the lyrics i really think this means he is giving her oral pleasure. He \"sets\" his tongue on her \"rug\". Biding my time means hes not really interested in doing this for her but hes want to do it good to please her so he takes his time. Drinking her wine just means... well do i really have to write that.\n\r\nWe talked untill two and then she said its time for bed\n\r\n-After pleasuring her he wants his in return but she makes an excuse that she has to work, which he isnt buying.\n\r\nShe told me she worked in the morning then started to laugh\n\r\n- He persisited to try and get something in return, she tlod him she really had to work and she just laughs in a flirtatious way because she knows its a lie and she used him.\n\r\nI told her i didnt it and climbed up to sleep in the bath\n\r\n-He calls her bluff that she has to work so he stays the night hoping to catch her in a lie.\n\r\nAnd when i awoke i was alone \r\nthis bird had flown\n\r\n-He overslept and she was gone. She completely bailed out on him.\n\r\nSo i lit a fire\r\nisnt it good\r\nnorwegian wood.\n\r\n-This could mean several things. To get it out of the way Norwegian wood definitely means knowing she would in both places. He knew she was going to bail on him in the morning basically.\r\n-I lit a fire could mean he just smoked some ganj to help him forget about being used\r\n-He actually lit the house on fire because he was so pissed and he had been planning this while sleeping by himself. isnt it good meaning isnt it good he knew she would leave and having a plan to burn down the house if she did.\n\r\n-Or I lit a fire could simply mean he started a fire in the fireplace and was planning on waiting for her to get something for his efforts.\n\r\nthis is my intepretation of the song i got none of this from anyone else, i just now thot of it after i read the post that said norwqegian wood meant knowing she would. i think its coolest if the song means what ive intepreted it as meaning esp. if he burnt down her house.\n\r\nlet me know what you think.peace\n\n\n\n\n\r\nI sat on her rug\r\nbiding my time\r\ndrinking her wine.\n\r\n-Think this just means what it says as well, but has anyone every thot this means hes going down on her bc he likes her and he really wants to please her.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\na girl once used me\r\nshe showed me a good time, norwegian wood meaning he was smoking and remembering the times they shared\r\nshe let it last for a while\r\nfinally i relaized there was something missing she didnt love me anymore(no chair).\r\nbut he still tried to make it work out so he just bid his time and kept loving her even tho she didnt want him anymore.\r\nIt lasted for a long time( 2 being relatively late at night) but she finally ended it.\r\nshe started making phoney excuses for why she didnt want him anymore. he wasnt buying it so he left still hoping it could work out.\r\nHe finally awoke and realized it was over for good and she was gone so he was truly alone.\r\nso he started smoking and the song goes back to the beginning where hes hi and thinking about her.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI think he assumed that since he was being invited to her place it was a sure thing. There was no chair because she was content on her own. She liked him but didn't want to sleep with him. He was cool with that so he stayed in another room.  He had no reason to leave as soon as he woke so he just stayed awhile reflecting on what happened the night before. \n\r\nI don't know if that's what he meant but that's what it means to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nits a love song it doesnt take an idiot to know\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\ni wouldnt say he didnt sleep with her, otherwise i wouldnt understand the phrase \"isnt it good, norwegian wood\" with norwegian wood meaning \"knowing she would.\" \n\r\ni think it was just a short affair that JL had and he was trying to hold onto it but the woman wasnt so she cut him loose in the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI tend to agree with what John said, that it was a song he wrote to relieve himself of some of the guilt of having multiple affairs, that it wasn't about one woman.  I always got the idea that it was wood panelling.  Wasn't that kind of thing popular back then?\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\njtucker7 says it welll... i love this song..\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI never thought about it before, but it makes sense-\n\r\nShe is trying to seduce him and he is more interested in her personality and doesn't want to compromise a friendship- \"biding my time\"- time is his authority, not her.\n\r\nBut that wouldn't fit well with burning down her house- unless he wants to completely erase the memory of her seducing him and replace it with a more horrific one.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nWow, I just read The Beatles Anthology and JL himself said that Norwegian Wood is about an affair that he was hiding from his wife, Cynthia.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI wounder if there is some more sitar playing on any other song? This one sounds good but its not so hard to play. If you listen to real sitar playin (Ravi Shankar) you'll see what I mean...\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nYour all wrong \r\nI think he just wanted to light a fire cause he was cold\r\nno just kidding\r\nanyway great song but there's no chorus\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nnorwegian wood is marijuana? not that proud about being norwegian anymore.. hahah.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThis is one of my favourite songs (I love any song that is well written and has a Sitar in it). It is actually about arson...I think we can safely say it was tongue in cheek!\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nWow, I actually hadn't thought of it as being about an affair until recently. . .I can see how it would be now, but I must say that part of me still likes to think about this song as an ode to the wasted opportunity. . .I always used to think that the line about working in the morning was the girl saying she had to go to sleep, while hinting that Lennon should come to bed with her. .and I thought that Lennon crawling off to sleep in the bath represented him not being courageous enough to accept the meaning of her innunendo. . .in that way, I always took \"this bird has flown\" to mean that the moment to connect with the girl had passed by and that his hesitation cost him the opportunity at having a relationship with her.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nYESSSS! There are actually other people that believe that he burned her house down.  Maybe something along the lines of she bailed on him so he burned her house down, but you can't really bail on someone who is in your house.  So i don't quite understand that part - but anyway, I still believe that he burned the place down\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nthis song is amazing.. and the lyrics speak for themselves: he met a girl, she tried to seduce him, it didnt work so she left, and he lit her room on fire...\r\ngreat song\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nDude, Its about smokeing teh herb, pot, weed, whatever you wana call it. The girl, reference to weed, \"Marry Jane\" slang for pot. Norwegian Wood oviously some type of weed. \"I lit a fire, isnt it good Norwegian Wood\" comon man, hes lightin up and smokein some weed.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nIt's not about pot, it's about John having an affair\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nBeautiful song. \"She once had me\" is sexual. He was married but didn't want his wife to know he slept with someone. He slept with the girl, but pretended he slept in the bath...fact\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nI have the CD version of the 1962-1966 Red Album that includes this song.  I listened very carefully several times, and it really sounds like the opening line is:\n\r\n\"I once HURT a girl\"\n\r\nThe second line hounds a little more like \"once HAD me,\" but the first line definately sounds like HURT. It's spoken in a British accent, but there is definately a T on the end instead of a D.  Can anyone else hear that on the same or different versions of the song?\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\ni think this song may be about John bein tricked by a woman(perhaps a prostitute) out of sex\n\r\n\"I once had a girl,\r\nOr should I say \r\nShe once had me.\" \n\r\nseems to show perhaps he was expecting to have sex with her and somehow she takes him for a fool(\"she once had me\")\n\r\n\"I sat on a rug\r\nBiding my time,\r\nDrinking her wine.\r\nWe talked until two\"\n\r\nshows he was waiting a long time and the fact hes sitting on a rug drinking wine shows there's an atmosphere you'd expect before sex.\n\r\n\"She told me she worked in the morning and started to laugh,\r\nI told her I didnâ\u0080\u0099t, and crawled off to sleep in the bath.\"\n\r\ni think this is her saying she wants to wait until the morning and seems to find it funny as if she knows hes been waiting ages to find out hes getting nothing, also she says she \"worked in the morning\" which would suggest to me shes a prostitute, he gets angry and goes to sleep in the bath.\n\r\n\"And when I awoke\r\nI was alone,\r\nThis bird has flown,\r\nSo I lit a fire,\r\nIsnâ\u0080\u0099t it good?\r\nNorwegian wood.\"\n\r\nhe wakes up in the morning and shes gone so heburns down the house as revenge\n\r\ni love this song and i also love the parody fo this song by by Bob Dylan, 4th Time Around, they're both fantastic\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nc'mon guys.  back away from the herb.  You're overcomplicating the song.  The Beatles themselves said the song was originally \"knowing she would\" instead of Norwegian Wood.  In British parlance, \"bird\" is a  slang for a girl that's like \"chick\".  \"And when I awoke, I was alone, this bird had flown.  so i built a fire. isn't it good, knowing she would?\"  I.e., ain't it great knowing she'd take off.  It's a provocative song about a hook up.  That's all. (which at the time was risque).  They get to her place, hook up. No chair to sit in, so he sits on the floor until it's time for the hookup (because otherwise he'd have to sit on the bed, the only other place) It's just a hook up, so he goes and sleeps in the bathroom afterwards, instead of sleeping with her, because she's going to be getting up early.  When he wakes up, she's gone already, and he's glad because then he doesn't have to deal with any of the morning after stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nJohn Lennon / Rolling Stone 1979 - \"Norwegian Wood was about an affair I was having. I was very careful and paranoid because I didn't want my wife Cyn to know that there was really something going on outside of the household. I'd always had some kind of affair going on, so I was trying to be sophisticated in writing about an affair\" \r\n  Paul McCartney / 1989 - \"I added the bit on the end about burning down the house, it was my addition to the song\"\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nIt was actually set on fire.                isn't it good, norwegian wood.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nTry this:  picture all the events (lines) as John's way of hiding his guilt.  Though he reveals the affair, he makes himself seem so innocent, and that, alone, is why i love this song.\r\n     From the very beginning he takes back his first line, turning it around to where it's like he did nothing.  And he uses everything like descriptive diversions, excuses of no chair, and a passive behavior.  I have a devious smile everytime i listen to this song.  \r\n     The best line has to be \"biding my time.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nThis song was John wrighting about an affair in a way that was too vague for his wife to realise what was up.....did somebody already say that? Ha, well if you did, you're right\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nThis song was John wrighting about an affair in a way that was too vague for his wife to realise what was up.....did somebody already say that? Ha, well if you did, you're right\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nOh...I hate you ramblingfool\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nya im pretty sure the song goes \"i wanted a girl, or should i say, she wanted me...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\ni love the sitar in this. it's very amazing.\n\r\ni think that the song is about this girl leading john on almost, she shows him her room and since she's poor the bed must be made of norwegian wood (which is fancy way of saying cheap pine). and she doesn't have a chair, again alluding to the poor thing.\n\r\nthey must've gotten pretty wasted or something \"drinking her wine\" and started to do something, but she thought about how she had work in the morning and killed it.\n\r\nso john got mad and slept in the bath. and when he woke up, she was gone, and because he was still mad, he probably burned her furniture or something.\n\r\nthe slept in the bath part really resonates with me. i remember a long time ago i was sleeping over at my thea's house. it was me, my sister, and her two other nieces.\r\nshe got mad at us and told us that if we didn't behave she's separate us and we could all sleep separately, one in one room, one in another, one in her room with her, and one in the bathtub.\n\r\ni found it incredibly funny at the time, but now it sort of symbolises a sort of estrangement. like, being separated from everything, in the cool unfeeling bathtub.\n\r\nkind of like john is complaining about how he is estranged from his wife, because he is having an affair, but it's his own fault, because he \"crawled off to sleep in the bath.\" and nobody made him go.\n\r\nand when he's alone because the girl had to work, he feels stupid and takes his anger out on her house/furniture/whatever, and also this bird has flown could be him realizing he totally screwed over his relationship with cynthia.\n\r\nbut that's just my two cents.\r\ni love this song, anyways.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nthis song, as has been well documented, was John trying to tell Cynthia (then his wife) that he had an affair but she didnt realise that he was writing about a real event.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\n\"I'm norwegian.\n\r\nSo it's cool there's a song about something involved around norway.\n\r\nBut it would be cooler if it wasn't about our wood.\"\r\nlmao!!\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nMy dad used to sing this to me when I was very little, so it's pretty much the earliest GOOD music I remember. From a child's perspective, I always saw it as a very innocent song (come on, I was like, five), and it was just a man visiting a friend, and for some strange reason that I could never fathom, she didn't have any furniture. I thought it was funny that he slept in the bath, and I thought it was mean that she left without saying goodbye. Now, eleven years on, the song makes so much more sense, knowing more about Beatles history, etc. I'll stop rambling now =P\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nhomermlb. I have also herd this rumour that he is infact saying \"Knowing she would\" And it fits in ot song fine. She wants some sexy time. He dosent. But its good knowing she would. Mabey relating to Rambelingfools comment that he was having an affiar. He dosent want to be a cheater. But this girl is going for it. So yano ... he does. \n\r\nI love the line \"She asked me to sit down anyweher\r\nI looked around and noticed there wasnt a chair\"\r\nWhey, Lucky John eh ^^\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nThis song so relates to life right nowâ\u0080¦\r\nI once had a girl\r\nOr should I say, she once had me\r\nShe showed me her room\r\nIsn't it good Norwegian wood?\n\r\n-To me this Means, the first two lines are self explanatory. I feel showing him her room means showing him who she is as a person, then him questioning if it is actually her that heâ\u0080\u0099s seeing or just a facade?\n\r\nShe asked me to stay and told me sit anywhere\r\nSo I looked around and I noticed there wasn't a chair\n\r\n-She wants him to stay in her life but she is already involved with someone or something, therefore there is no chair for him to sit down and stay to get comfortable.\n\r\nI sat on a rug, biding my time\r\nDrinking her wine\r\nWe talked until two, and then she said:\r\n\"It's time for bed,\"\n\r\n-He sat on the carpet, because he felt that she is worth sticking around for. He is waiting for when she was ready to move forward with the relationship. They talked until two because they get along well, When she says its time for bed I think this means that she wants to just sleep with him because she cant do anything that would continue the relationship further because she is already involved.\n\r\nShe told me she worked in the morning and started to laugh\r\nI told her I didn't, and crawled off to sleep in the bath\n\r\n-She told him she works in the morning as an excuse to either get him to leave or sleep with her, per say. He chooses neither and sleeps in the bath because he doesnâ\u0080\u0099t want to sleep with her and he didnâ\u0080\u0099t want to leave. He simply wanted to be with her, wherever that went he was prepared for.\n\r\nAnd when I awoke, I was alone\r\nThis bird has flown\r\nSo I lit a fire\r\nIsn't it good Norwegian wood?\n\r\n-When he woke up she was gone, nowhere to be found. She had flown the coup either for the other relationship or whatever else was going, So he lit a fire to destroy everything he felt for her to save himself the hurt, to let go of her, then he questions her motives/intentions.\n\r\nI could be wrong but thatâ\u0080\u0099s how Iâ\u0080\u0099m seeing this song as it relates to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nAs I recall, I was still in my teens when I first heard this song & as was my wont I meditated long on the meaning of the lyrics. Eventually it occured to me that John Lennon was prone to write \"nonsense\" lyrics to produce exactly that effect on the listener - to set their minds to wondering.\r\n It was also a custom of the Beatles to write \"filler\" lines while composing. just to keep the lyric flowing. A good example of this is the line \"The movement you need is on your shoulder\" in \"Hey Jude\" which McCartney intended to change but was convinced by Lennon to keep.\r\n It is entirely possible that the phrase \"Norwegian wood\" has no meaning.\r\n The song itself has the sense of being a self-satire of boy-meets-girl tunes of the early Beatle days and its being on \"Rubber Soul\", which is essentially the first of the Psychedelic period albums, tends to support this.\r\n Then again, maybe the girl played the Hardinger fiddle and he burned that. We'll never know.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nthis is about some girl trying to seduce him and hes just being oblivious and innocent, i luv this song...\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nOK..here's what I think for what it's worth:\n\r\n\"I once had a girl or should I say she once had me\"\n\r\nJohn thought that he had this girl's love or that she was attracted to him. The second part of the line is a play on words which John was really good at. She \"had\" him...he played a 'joke' on him, did some devious act. Like leading him on that she'd sleep with him when she never had any intention of doing so.\n\r\n\"...and I noticed there wasn't a chair\"\n\r\nI think this refers to that she wasn't interested in any sort of lasting relationship. She was transient/flight. She didn't put roots down in life or in relationships.\n\r\n\"I sat on her rug, biding my time, drinking her wine.\"\n\r\nHe was trying to act informal, not wanting to look 'pushy'. So he casually sit down on the rug, probably leaned back and sat drinking wine waiting until the appropriate moment to make the move to get her into bed for sex. (Sitting on the floor/rug back in the 1960's and 1970's was common amongst friends. Every weekend in the '70's I'd party with my musician friends and we'd all sit cross-legged on the floor with our guitars).\n\r\nAbout sleeping in the bath. One of two things. It could be that he was drunk and the bathtub was a handy place to crawl off to and be cool in (so the 'hots' following a night of drinking weren't so bad) or he wants to show that he was deeply disappointed in how the night turned out and that the bath represented an empty lonely cold place to have to be.\n\r\n\"So, I light up a fire....\" \r\nOK...confession time. I was 9 years old when the Beatles were on Ed Sullivan in 1964. STOP SNICKERING :)    In my childish naivity I first thought that he simply built a fire in the fireplace to warm up in the cold morning (for some reason I pictured her place as a log cabin type place made out of logs). But now I really do think that he either burnt up what little furniture she had or set fire to the whole place.\n\r\nFirst he admires the Norwegian wood as something nice to look at, when he still thinks that he has a chance with her. But in the morning faced with disappointment he now sees the wood in it's beauty as it burns.\n\r\nOh, BTW. I'm not discounting the thought that Norwegian Wood is a type of marijuana. But from experience. Back then we didn't that many choices as to types of marijuana. We were darned lucky if a bit of Acapulco Gold came our way. Next on the list was just some anonymous stuff from Mexico. But mostly, it was locally grown yucky stuff without much bang and hot as a blowtorch. But the Beatles being who they were probably could get some more exotic weed than some poor Midwestern teens could !\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\ni heard somewhere they ripped off the melody from a bob dylan song\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI once heard a John Lennon interview and he said that this song was definately about pot....\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nI liked that pun \"Knowing she would = Norwegien Wood.\" It's interesting that sum forces WOOD goe for fyr rather than lightning. (misspelling intentional). Always so tricky.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nYou're all wrong.\r\nIts about a bloody hard on!\r\nYes - its about john lennons erection.\r\nStop looking so much into it.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nwhat is this song about? he got it on with a girl, then she told him to leave, but he wouldn't, so she leaves him, and in a fit of embarassment and anger, he burns her stuff. i think the line \"or, should i say, she once had me\" refers to him embarassingly admitting that she wore the pants in the relationship and left him. plain and simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nso basically i just said what Lakeside said, but with less words.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nSome believe that \"Norwegian Wood\" is a play on the phrase \"knowing she would.\" That would put a whole new spin on things, wouldn't it?\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nTo me, there are obvious parallels between Lennon and George Costanza in this one. It's a sort of 60s equivalent of George being invited up for coffee and refusing because he doesn't srink the stuff.\n\r\nHere Lennon is basically on a promise, but completely unreceptive to  a series of obvious cues. When the belated realisation hit George, we got typical Costanzaesque anguish. Lennon obviously opted for a spot of arson instead, but they're both examples of typical subclinical male autism.   \t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\n\"She asked my to stay and told me sit anywhere\r\nSo I looked around and I noticed there wasn't a chair\"\n\r\n...that means he would have to sit on her bed. There's a woman trying to seduce him, and he's not about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nI think John was allergic to norwegian wood and\r\nwhen he woke up feeling very sick because of wine\r\nhe and this girl drank night before in an empty appartment\r\nhe just couldn't resist his arsonistic urges so he lit the fire\r\nand fled like a bird and watched his ingenious masterpiece.\n\r\nBut that's just like my opinion man.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nThis song is about a one night stand that John had. back then you couldn't just come out and say something like that so they had to be smart about it. Norwegian \"WOOD\", come on.... and he is saying he went to her house, they had sex in her room, there was no chair so he sat on HER RUG. They then talked for a couple hours and she told him she had to go to work in the morning and she was going to go to sleep, so he went to take a bath. Then when he woke up, she had already left for work, and I believe him lighting the fire means he smoked a cigarette or some pot\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nThe song is about a guy lighting a girl's house on fire for not putting out. This didn't really happen but I'd still consider it one of The Beatles' best songs. Amazing sitar and great rhythm. \t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nMaybe he is just lighting up, or he lit the house on fire. Either wayâ\u0080\u0094 life can take interesting turns. Sometimes, it helps more to push it out of your mind. Go with the flow, and forget the rest.\n\r\nlike in the song- he is... fascinated by a girl that controls him- it's she that had him, not the other way around. and a bizarre night remained unexplained from a bizarre morning. \n\r\ni like it. \t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nSo I think we've more or less established that this song revolves around one of John's affairs while still married to Cynthia. From my analysis of the last verse, I think the most revealing line is \"This bird has flown.\" To be metaphorical, I would say the bird is the relationship, and its flight was the essence of its existence. Having flown, it has seen from great heights the awe-inspiring landscapes and natural beauties of this world--all from a seemingly safe and isolated position. But upon landing, the bird terminates its existence under the weight of a gravitational force it can no longer defy; its essence disintegrating into the organic elements that initially composed it. And, who knows? maybe the bird landed on some indistinct tree in Norway which concurrently fell victim to a forest fire. \t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nIt's about John having an affair.\n\r\nHe thinks he has this girl (she's in love with him / will do whatever he wants) but she is infact just leading him on.  \n\r\nThe \"sit anywhere / there wasn't a chair\" & \"its time for bed / work in the morning / slept in the bath\" lines are both telling us the same thing - that she was leading him on with suggestion, and then dropping him and leaving him alone again.\n\r\nWhen he wakes up (in the bath haha) this girl has left him there, so, feeling pissed off, he sets the place on fire.  Walking out quite smugly thinking \"isn't it good, norweigian wood?\" (burns well).\n\r\nThe setting on fire bit is mentioned in Paul's authorised biography \"Many years from now\".  If you haven't read it, I strongly suggest you do!  Great book\n\n\n\n", "comment_116": "\nWell, \"so, I lit a fire\" is to me clearly a reference to smoking weed.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nI think that the fact that there wasn't a chair and she told him to sit down implies that she WAS trying to seduce him but he wouldn't fall for it. \r\nI love this song because it's so simple and I love the way it sounds. \r\nGenius.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nWhen I was a little girl and my sisters put on this album, this song made me feel like I to be grown up and really cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nI knew the song was about an affair that John had; however I always thought the term \"I lit a fire\" was his symbolic way of him trying to rekindle his relationship with Cynthia once the affair was over. It's interesting to hear that it was Paul's idea to \"burn the house down.\" You learn something new every day!\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nramblingfool knows his stuff. Word, yo.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nHer house was not actually made of Norwegian Wood, but that was a popular thing at the time. Paul and John wanted the character (the whole thing is loosely based on an affair John had) to have his revenge. So the \"I lit a fire\" could be interpreted in many ways, but it's meant as he burned the place down as revenge.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nOk, this is my first posting, so don't get too brutal with me.\r\nFirst off, it's a song. His wife of the time wouldn't be a consideration. It's not written in \"Code\".\r\nSecond, these guys were always giving the media a ride; so what they say isn't trustworthy (Ya, Lucy In The Sky wasn't about an acid trip...).\r\nOn to the song:\r\nWhat it's about is getting high and getting laid.\r\n\"I once had a girl, or should I say she once had me\"\r\nReflective. \"Once\" could mean a one-timer, or maybe not. But he \"HAD\" her, or she \"HAD\" him. Not hung with, or wanted. Had. End of story.\r\n\"She showed me her room. Isn't it good? Norwegian Wood.\"\r\nGreat line. Hmmm, listener thinks I'm talking about furniture...\r\n\"She asked me to stay\" means I got lucky. \"Told me to sit anywhere. So I looked around and I noticed there wasn't a chair\"\r\nThis is built into the song craftily to let you, the listener know that it ain't furniture he was talking about, 'cause there ain't none!\r\n\"She told me she worked in the morning\" is post coital conversation.\r\n\"I crawled off to sleep in the bath\"? That damn rug wasn't cutting it. Oh ya, \"crawled\"? He was WASTED.\r\nWoke up, got outa bed...\r\nSorry, wrong song.\r\nWoke up, she'd gone to work, got into her stash and reiterated the quality of the stuff.\n\n\n", "comment_123": "\nTrowheels - great theory - aside from the fact that the song was written in January 1965 and John met yoko in November 1966 (articles.absoluteelsewhere.net/Articles/…)and Rubber Soul came out in 1965.\n\n\n", "comment_124": "\nRubber Soul is one of my all-time favorite albums. I have to say that I never thought the \"I lit the fire\" line implies the singer literally set a fire. To me this song goes like this: The singer (John, who admitted to feeling very insecure and lost at this time in the Beatles career) goes home with the girl, assuming there will be sex. When she alludes to having to work in the morning and laughs, that is a clear signal that there will be no sex. My interpretation of the norwegian wood phrase is that the singer has a case of \"blue balls\", Norway being a cold country and wood a reference to an erection. The \"I lit the fire\" line to me either means that he masturbates to relieve his \"norwegian wood\", or that he is blaming himself for getting aroused over a girl who didn't want him.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI've always felt that the song revolves around a one-night encounter (\"she showed me her room\" and \"i look around and I noticed....\" both imply that the singer in unfamiliar with her apartment).\n\r\nBut ultimately I believe the song revolves around the mind games the lady is playing with the singer. \r\n*\"or should I say she once had me\"--suggests to me that the singer realied after-the-fact that the lady truly had the psychological upper-hand the entire encounter\r\n*The lady invites the singer to sit anywhere, even though there is nowhere to actually sit.\r\n*They drink wine and talk until 2am, certainly suggestive of leading up to sex\r\n*\"she told me she worked in the morning and started to laugh\"--though it's not found in the lyrics, this particular lines seems to be in responce to the singer's suggesting/implication of sex. The \"laugh\"ing part was probably even more demoralizing for our assuming singer.\r\n*\"I was alone, this bird had flown\"--the singer's ultimate realization of failure/isolation/rejection\n\r\nI am also a VERY FIRM believer that our singer did indeed light a fire lady's apartment as his ultimate revenge for the lady leading him on the entire previous night. The first time the line \"Isn't it good, Norweigen Wood\" is sung, I believe it's from the lady's perspective. She is showing the singer around her apartment and is boasting about her Norweigen Wood furniture, so in this context the lyrical line seems almost boastful and condescending (which adheres to my \"mind games\" theory\". However, the second time to lyric is sung (the final line), it's from the singer's perspective. He woke up alone and humiliated and decided to burn down her cherished furniture and ironically repeats the line \"isn't it good, norweigen wood\", in an entirely different and chilling context. It's as though the singer feels very emotionally hurt by the lady and realized that she manipulated him the only night, so he some-what childishly burns her furniture on his way out the door.\n\r\nThe song is truly amazing. One of the most perfect Beatles song recorded. Lyrically, Vocally, Instrumentally....\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nThe lyrics of this song are actually pretty clear. This is about a homosexual encounter. Lennon was famous for his word play and double meanings, and his will to shock. The banality of this encounter in a heterosexual sense is hardly something that would inspire him to write a song (I mean how many more exciting sexual encounters did The Beatles have in the glory days!!!!). As a homosexual encounter however the lyrics take on a whole new meaning. \r\nI once had a girl, or should I say she once had me - a reference to who is giving and who is getting!\r\nNorwegian Wood also is rather more pornographic than it initially seems, as is the \"she told me to sit anywhere, so I looked around and I noticed there wasnt a chair\" just Norwegian Wood to sit on apparently. Sitting on a rug, is a clear reference to pubic hair.\r\nRemember that Beatles manager Brian Epstein was actively involved in gay London at the time, and as a close friend of Lennon it shouldnt be surprising that he would write about these kinds of things in his songs. Similar references appear in other songs, eg I am the Walrus \"boy youve been a naughty girl you let your knickers down\", knickers being gay slang for a partner or boyfriend at that time. Note also the substitution of boy and girl here, similar to the gender-swapping reference in Norwegian Wood.\r\nLennons genius at work!\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nJust to clear it up, \"bird\" in Liverpool is slang for a girl. And yes I am a scouser!\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nHe makes a fire probably with peat or coal? Haha, is that bit in the lost verse that was never released? Did this encounter take place in a cave? Just read the words everybody, it is indeed a simple song, and glaringly obvious what it means unless you suffer from sexual hang ups!\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\n\"I once had a girl\r\nOr should I say, she once had me\"\r\na girl played him, he never really had her though she had him.\n\r\n\"She showed me her room\r\nIsn't it good Norwegian wood?\"\r\nin that time period norwegian wood was a popular flooring, probably a stereotypical kind.\n\r\n\"She asked my to stay and told me sit anywhere\r\nSo I looked around and I noticed there wasn't a chair\"\r\nshe offered him to stay, but he realized that their wasn't really any room in her life for him to stay a while. maybe a temporary fix.\n\r\n\"I sat on a rug, biding my time\r\nDrinking her wine\"\r\nso he held onto her as he could, soaking in her lies and sweet words.\n\r\n\"We talked until two, and then she said:\r\n\"It's time for bed,\"\"\r\nthey continued this for a while until she said it was time to give it a rest.\n\r\n\"She told me she worked in the morning and started to laugh\r\nI told her I didn't, and crawled off to sleep in the bath\"\r\nshe had other plans not involving him, so he ashamedly waited for her within reach with hopes that she'd be back soon enough.\n\r\n\"And when I awoke, I was alone\r\nThis bird has flown\"\r\nhe snapped back into reality and realized it's over.\n\r\n\"So I lit a fire\r\nIsn't it good Norwegian wood?\"\r\nso he put an end to it, and destroyed every trace or memory of the place in his mind.\n\n\r\ni don't know, somehting like that lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nI was always told to think of \"Knowing She Would\" in place of \"Norwegian Wood\". It always gave it a different meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nOMG guys, not every Beatles song is about drugs. Paul said himself it was about burning the house down.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\n*facepalm* that would be unless he couldn't get it up... thanks to the norwegian wood :P\r\nthat would give the sitar solo a different happening and would explain why she laughed and he crawled to the tub, and would make the last line very sarcastic indeed, in contrast to the first time it was used. he just can't believe his luck... good ol norwegian wood. lol. it can open so many doors, and close so many others.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nIt is about an affair John and the clue to woman's identity is the line \"She told me she worked in the morning and started to laugh.\" Implying that the woman found it funny that she had to get up in the morning to work but actually worked an evening newspaper. Cynthia possibly knew something might be going but John copped out telling her by saying he slept in the bath. John couldn't figure how to finish the song so Paul gave him the idea of setting the house on fire. Actually the only part of the song that wasn't true.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nWhen the song first came out, we all knew it had a sexual meaning.  Norwegian Wood was interpreted to be \"Knowing She Would\"\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nToo funny....I always misunderstood a couple phrases in the song giving it a bit of a different meaning. \"I told her I didn't \r\nAnd crawled off to sleep in the bath\"  I heard \"I told her I didn't feel called on to sleep in the bath\"\r\nAnd\r\n\"And when I awoke I was alone \r\nThis bird had flown \r\nSo I lit a fire \r\nIsn't it good Norwegian wood\"  I heard \"When I awoke I was alone inside her home  I'D lit her fire isn't it good Norwegian wood\"\r\n So you see all this time I thought things had turned out well for the poor bugger   LOL\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nListen to the last few seconds of the studio session (take 4, which was the final take):\n\nyoutube.com/…\n\nLennon clearly says \"I showed 'er\". That sounds like revenge to me, so I'm going with the arson theory, and \"Norwegian wood\" refers to the cheap (and flammable!) pine panelling...\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nI used to think it actually meant this Norwegian would, except this Norwegian wouldn't. Now I think she was like the Wife of Bath from the Canterbury Tales who confronts the medieval antifeminist tradition that boxed women into offensive and defeating stereotypes. So he got his Bath after all.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nI once had a girl\nOr should I say she once had me\nShe showed me her room\nIsn't it good Norwegian wood?\n\nIn the first line I think he's saying that she has a hold on him or is teasing him.\nThen he says that her room is decorated with Norwegian wood (a popular choice at the time)\n\nShe asked me to stay\nAnd she told me to sit anywhere\nSo I looked around\nAnd I noticed there wasn't a chair\n\nReiterating the fact that she was very much in charge as he was sitting on the floor for her.\n\nI sat on a rug biding my time\nDrinking her wine\nWe talked until two and then she said\n\"It's time for bed\"\n\nObviously he thought that the rug was a temporary spot as he thought she was willing to have sex. \n\nShe told me she worked\nIn the morning and started to laugh\nI told her I didn't\nAnd crawled off to sleep in the bath\n\nMaking it clear she meant sleep rather than sex and maybe laughing at him because he god the wrong idea.\nHe then sleeps in the bath, highlighting that he wasn't getting anything from her.\n\nAnd when I awoke I was alone\nThis bird had flown\nSo I lit a fire\nIsn't it good Norwegian wood?\n\nSaying that he woke up and she had left, a 'failed' one night stand\nHe set fire to her room as shown through the repetition of the line 'isn't it good, Norwegian wood' as it was the same observation he made when looking at her room decor in the first place.\n\nJust my interpretation :)\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nOk, let me admit up front that in the Barry Miles book on McCartney, Paul said he told John to finish up the song by burning the place down for revenge.  But I think John is more clever than that.  John loved word play and double meanings, Come Together with the orgasm lead out, the double meaning of please in Please Please Me, It Won't Be Long (Till I Belong), Happiness is a Warm Gun, Lucy in the Sky with Diamonds (yes, Lennon said he didn't know, but I don't believe him, that's something he would have picked up on immediately), the three puns in Because.  Norwegian Wood has been established as cheap pine wood for furniture or panelling on the walls and was trendy at the time, apparently.  Lennon gets invited to this woman's apartment that has cheap pine wood and he believes they are going to have sex.  But at two o'clock she tells him that is not going to happen and she has to work the next day.  He sleeps in the bath.  When he wakes up, she has already left to work.  The last line can be interpreted as following Paul's advice.  But I think he lights a sexual fire in the bathtub and masturbates, and the last line of Isn't it good Norwegian Wood compares cheap masturbation sex with cheap wood paneling, thus giving Norwegian Wood a double meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nThis song is extremely frustrated.\n\nWhat I mean by this is that is it essentially about being led on--yes, perhaps John intended it to take on a more sexual aspect, but either way it is true. The first sentence implies how they had interest in each other, but his was definitely more. She revealed a lot to him, including Norwegian wood. Norwegian wood is cheap wood, so right from the get-go it is revealed that whatever she felt for him was weaker than he presumed.\n\nShe had some interest in getting to know him, but it was not as much as he thought. However, he waited because she did offer him niceties. It's almost funny how relevant John was to the modern world and how people often stay up late talking and then simply go to bed like it was not a big deal. \n\nThe girl had other obligations the next day and thought it was all good fun that they had been talking. But the speaker was still willing to wait up for her and sacrifice his own priorities. He does not make a move on her (sexual or otherwise) because she has just wrecked their late-night conversation by saying how she has \"work\" the next day.\n\nWhen he woke up the next morning, she had moved on. The bird had flown and the speaker realizes he's too late (I say speaker out of respect but I have a feeling John was writing about himself). He's angry and lights a fire symbolically to the weak wood.\n\nIt astounds me how much pain and literary technique John uses in every song he writes. I feel like he understands me and my own similar experiences and it means the world to me. I wish we could have known each other because I feel like I could have understood him as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nWhen I first heard the first line, \"I once had a girl or should I say she once had me\", I thought that meant he had the girl as a girlfriend, but then waxed kind of egotistical and said she had him as a boyfriend. \n\nBut then I realized that the implication was that she no longer did, which meant he'd left her for some reason, and was about to explain why - so it wasn't just an egotistical remark. \n\nSo then she leads him on and then leaves him high and dry, and then in the morning when he realizes what's happened, he burned her norwegian wood as an act of revenge. \"So, I a lit a fire - isn't it good norwegian wood.\" \n\nIt was clearly intended as a cheeky remark; it could have meant that he lit a fire in the fireplace and enjoyed the comfy feel of her place while waiting for her to return or something, but instead obviously meant that he burned her norwegian wood - but it wasn't initially clear to me whether he was burning some of her wood in the fireplace or if he burned her whole place. But the song doesn't mention a fireplace and the thing in the song which was made of norwegian wood was her room. \"She showed me her room, wasn't it good, norwegian wood.\" So my guess was that he meant that he burned her room, which essentially meant burning the whole place down. That would turn the song into a sort of brief, simple, sing-songy snippet of prose that ends up packing quite a wallop which is a common sort of thing, and certainly seemed in character for the Beatles, so, that seemed like the mostly likely interpretation to me.\n\nBy the end it seemed that they didn't have sex, which made me question whether or not they were actually boyfriend and girlfriend, which cast doubt on my understanding of the first line. So it was a mystery to me what it meant until I read the explanation provided by Docent, on this page. The idea that \"had\" in \"I once had a girl\" referred to deceiving or tricking someone is pretty anathematic to me and would be another in a fairly long list of similar horrors that would cause me to be rather put off by likes of the Beatles, even if I enjoy their music. I would be virtually burned at the stake by a crowd of millions for admitting to such, but I've never been a conformist. \n\nBut docent's quotes don't actually explain what \"had\" meant. I think I'd prefer to think that it wasn't so much about deceiving or tricking as it was about simply being in a relationship. Maybe they hadn't had sex yet, but had been fairly clearly building up to it.\n\nThe song seems like a kind of morbidly fascinating comment on philandering. The picture I get is of a sincere fellow who is wandering a bit from his main squeeze because he fairly desperately needs more, emotionally and physically, than he's getting, and thinks maybe he's found it in this new person, but it turns out she was just intent upon punishing him for philandering. So he unleashes his completely overwhelming bitter wrath upon her for appointing herself judge and jury over him and making him think she liked him and wanted him when she really didn't.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nwake up people!!  look at the country of norway on a map.\r\nI am sure john was using a hidden sexual meaning.\r\nnorwegian wood = a hard erect penis\r\nthis is not a joke\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nwith respect to everyones personal interps, the songs about johns affair with yoko. it's got nothing to so with drugs or furniture. I know my beatles songs pretty well n some historical stuff but does anyone know what the lyrics in the song break down to actually mean?? ie- what's john mean when he refers to norwegian wood?? n stuff like that?? I've been wondering forever but idk. help please??\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nJohn is using the same songwriting trick that Bob Dylan used on \"Just Like a Woman\". The line \"We married/She's my friend\" actually refers to two different women. John similarly writes \"She said that she worked in the morning and started to laugh/ I told her I didn't and crawled off to sleep in the bath\". Again the first line refers to the woman in the song the second to wife Cynthia.\t\t\t\t\n\t\t\t\t\n\n"}