{"comment_0": "\nAnd to the fans, I'll never let you down again, I'm back\r\nI promise to never go back on that promise, in fact\r\nLet's be honest, that last Relapse CD was \"ehhhh\"\r\nPerhaps I ran them accents into the ground\r\nRelax, I ain't going back to that now\n\r\nTHANK YOU\r\neminem is the best rapper ever\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIf you will actually read ANYTHING online instead of talking out of your ass you will realize what this song is truly about.\n\r\nIt is about his journey into Recovery (hints the Albums' name) and sobriety.  He struggled with drug addiction & has been able to overcome his disease.\n\r\nAt any rate, the lyrics are easy to understand to anyone in recovery as they are based on the 12 Step/AA/NA/etc views & slogans/sayings about recovery and our disease.\n\r\nHe is Not Afraid to take a stand and face his demons and the wreckage of his past.  For myself, I continued to use because of the guilt, shame and remorse of my actions the previous day(s), weeks, months and then years; so he is willing to face those things and recover from his addiction.  If you will read his Wikipedia page and the Wikipedia page for this song it will give you some insight into his addiction and ultimately his recovery from the progressive illness he and I are afflicted with.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nmetaphors galore...  total eargasm.  love him or hate him, there is no denying that he's got talent!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThe second line of verse one\n\r\n\"You can try and read my lyrics off of this paper before I lay 'em\r\nBut you won't take this thing out these words before I say 'em\"\n\r\nInstead of \"this thing\" I was thinking it might be \"the sting\", idk that just what I thought I heard first.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n\"And all those who look down on me I'm tearing down your balcony\"\r\nlove that line; ps, this is my first comment!\n\n\n", "comment_5": "\nIn the chorus I believe that Eminem is coming back full force out of a deep depression and a dark time in his life. He is saying that he's coming back without worries of regression. He's also saying that if anyone else has the problems he had he knows what they are going through and he will lift them up. Eminem is saying that no matter how hard life gets you will have people to lift you up along the way and people have been down the road before you and you are able to come back from it because others were able to.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI'm wondering if anybody really knows what this song is about.  Some of it is just small talk but the overall message is about recovery from addiction.  In a 12 step program, our main goal is to recover & help others recover from addiction. That's why he says \"Everybody come take my hand, we'll walk this road together.\"  The whole \"not afraid to take a stand\"... in my opinion has to do with an addict's ego because when we let go of the drugs, one of the first things we have to deal with is our ego because we're always worried about what other people will think about us quitting drugs or what others will think about the fact that we even did drugs.  When he says, \"thought I had it mapped out but I guess I didn't, this f-ing black cloud still follows me around but it's time to exercise these demons, these motherf-ers are doin' jumpin' jacks now!\"  A lot of times, in recovery we try to do things our own way & we think we can.. and most of us never really understand why we are so addicted, or why even when we have stopped doing drugs or alcohol for a long period of time, we are still an addict and/or alcoholic (this f-ing black cloud still follows me around)... so we have to always work against the disease to keep it at bay (but it's time to exercise these demons). The line, \"These motherf-ers are doin' jumpin' jacks now!\".. if you haven't been in recovery, you would never know what he's talking about. Addiction/alcoholism is a progressive disease whether you're using or not and they say the whole time you're clean, your addiction is still getting stronger, doing jumping jacks in the back of your mind.\r\nMy favorite verse of the whole song is the last one, where he says, \"Cause the way I feel, I'm strong enough to go to the club or the corner pub & lift the whole liquir counter up cause I'm raising the bar, I shoot for the moon but I'm too busy gazing at stars, I feel amazing & I'm not afraid...\"  He is saying that he is strong enough in his recovery to put himself in a tempting situation without giving in. LOVE THIS SONG!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI love all the little puns that he puts in this song.  \"Quit playing with scissors and shit, and cut the crap\" is a good one.  It's so cool how he addresses all of his fans and even admits that his last album was sub-par.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n- Empowerment, courage, change and personal responsibility\r\n- Fighting to be an individual in this world\n\r\nThe first verse shows he's trying to take his message to the world. A \"call to arms\" is how it makes me feel. \n\r\nHis experience, even though likely about addiction etc, can be applied to a number of personal experiences.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nLove the verse...\n\r\nI shouldn't have to rhyme these words in the rhythm for you to know it's a rap\n\r\nBut I think he meant \n\r\nI shouldn't have to rhyme these words in the rhythm for you to know \"it's a wrap\"\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI Cannot wait for Recovery. \r\nThis song is an intro to Recovery. \r\nShady is back\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nEminem is back!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n\"Cause the way I feel, I'm strong enough to go to the club\r\nOr a corner pub and lift the whole liquor counter up\r\nCause I'm raising the bar\"\n\r\nbest line ever\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nShakespeare period. Eminem has a way of using figurative language in its most classical way to express himself.  He is a gift to English teacher!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nyoutube.com/…\n\n\n", "comment_15": "\nI understand the meaning of this song. The meaning is this: don't be afraid to make a stand for yourself against overwhelming odds don't be afraid to fight  back against those demons that lurk inside us all and that somewhere someone else is going the \"down the same road.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\ni read a lot of good comments about depression but the name of the album is recovery and the name of his last album was relapse to me he is talking about his battle with substance abuse although he very easily could have had depression also there are a lot of references to recovery in this song one in particular is\r\n Everybody (Everybody)\r\nCome take my hand come (Come take my hand)\r\nWe'll walk this road together, through the storm\r\nWhatever weather, cold or warm\r\nJust letting you know that, you're not alone\r\nHolla if you feel like you've been down the same road\n\r\nthis next line refers to what a lot of twelve step groups say about addiction while your in a meeting your addiction is in the parking lot doing jumping jacks or push-ups just waiting for you to slip up \r\nThought I had it mapped out but I guess I didn't, this fuckin' black cloud\r\nStill follows, me around but it's time to exercise these demons\r\nThese muh'fuckers are doin' jumpin' jacks now\n\r\nif this next line doesnt make you beleive that this song is about recovery please listen to it again with the concept of recovery in mind\n\r\nIt was my decision to get clean, I did it for me Admittedly,\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nthe ??? part is \"Or a corner pub\" not \"put a ???\" ;) AMAZING song AMAZING lyrics... just amazing. I will go to Walmart at midnight to buy his CD on 6/22!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ni love this song, recovery is going to be sweeet, just as long as he doesnt bring back his wining accent\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\n\"perhaps i ran them accents into the ground\" .. haha i love how he can wrap up an entire cd (relapse) in that line. I was a big fan of relapse, obviously not his best but i loved it nontheless. Looking forward to Recovery on june 22nd!! This song is pretty self explanatory, once again im sure MANY MANY people can connect with it in more than one way. I hope I can appreciate the whole cd like i do with this single, but its em and i already know i will.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nRecovery is gonna be amazing if this song is anything to base the album off of :D\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\n\"...and fuck the WHOLE* Universe\"\n\r\nThis single is exactly what Eminem needed to redeem himself from the Relapse. Sure us dedicateed fans still listened to it, but to the rest of the people it was shit. And Eminem is man enough to listen to the fans, change his Relapse 2 idea, and give us something that reminds us who Eminem really is, and that takes a shit ton of balls. \t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nMOST AMAZING SONG EVER, well all Em's songs are good.\r\nWelcome back Eminem.(:\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nGreat song and I can't wait for Recovery to come out... JUNE 18TH IN EUROPE!! 4 whole days of Recovery before North America!! \n\r\njust a couple of corrections \n\r\nTo pull his dick from the dirt and fuck the **whole** universe \n\r\nYou couldn't lift a single shingle **on it**\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nBEST song yet, Eminem... is back and he's ready... ARE YOU? haa..\r\ncause whether or not he's coming. \r\nI love you Em... \r\nThank you... \t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nactually a good song from him in a long time\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nImma be what i set out to be\r\nwithout a doubt undoubtedly!\n\n\r\nim so glad shadys back! Keep it goin Marshal!\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\n\"like a fuck you for christmas\r\nHis gift is a curse\"\n\r\nhaha. get it?\n\n\n\n", "comment_28": "\nThis is one of very few lead singles that i loved. His lyrical skill is off the chart, he fucks shit up. subject matter is good too, i love that its called recovery and on the tracks he just airs out his issues. im very impressed\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nUmmm whoos he talkin bout when he says, \r\n\"You said you was king, you lied through your teeth\r\nFor that fuck your feelings, instead of getting crowned you're getting capped\" ?????\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nim so glad i got into eminem. I used to hate him i used to think he was some bling bling twat all about killing people and raping girls. i was wrong. im so glad a advert popped up on tv with lose yourself as the track since then i realised i recognised it as a kid from some distant party. i found it on spotify loved it.\n\r\nthen i discovered his greats. id say his greats are mockingbird, when im gone, stan, hailes song and now not afraid. i love when im gone inparticualr. not only amazing rhyming like on all his songs but it had meaning and heart and emotion. something that turns any talent into something actually good. something that people even against him have to admit they like...well maybe they dont admit.\n\r\nhe has talent a great voice, meaning emotion and cleverness in his songs no other rapper has. Thats what made him the best. \n\r\ni was dissapointed with relapse because it lacked any emotion. nothing like cleaning oit the closet or mocking bird and ofcourse when im gone. its songs like them that give him the impression of bling bling twat all about killing people and raping girls. i know now hes not but songs like the ones on relapse to put people off him..alot of people.\n\r\nnot afraid is a saviour. without it id be thinking hes gone backwards in his songs, got worse less talented. but not afraid is great hes made a moving song that dosent make you sad. that a hard thing and hes done it. the feel of it is great you can picture that so fitting on some sorta film. i love it\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\n' holler at me if you been through the same road'\r\nYerp(: i love dat even ppl hu hate eminem gut to admit dey can relate 2 him; \r\nhes tlkin abou moving on from relapse. itz good that Eminem is being stong, pulling himself out of what seemed impossible to him, honestly he is my role model. whenever i feel as if im going into depression.. i think 'you know what, if he can do it through alll thaat why cant i?' \r\n'haters can make like bees with no stingers and drop dead' \r\n:D &bdw ppl who think hes a devil worshipper he aint\n\n\n", "comment_32": "\nIs eminem a masonic?\r\npeople are saying that he wrote this song to them beacause he left them and that they might come and kill him like they killed 2pac ?\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\ni love the exercise/exorcise demons play on words\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nEminemâ\u0080\u0099s poetic delivery in his song â\u0080\u009cNot Afraidâ\u0080\u009d is stunning! His explosive authenticity is what moves me to not just hearing the beats but listening to the words in the lyrics. There are metaphors that Eminem creatively uses are culturally relevant to his listeners. There is a clear cut and straight to the point that Eminem raps to not beat around the bush with admitting his responsibility in what he contributes to this world. Eminem realizes he plays a large part in life to his children, to his fans, and to this world. What Eminem knows is that at the lowest he could go, he was elevated back up by an impulse, a will, a release of fear, letting go of control, and remembering his capabilities, strengths and talents that are within him leading him to what he desires to become. \n\r\nWe can all ask ourselves who are we becoming by looking at where we are at in life. I think Eminem is inspirational and courageous and I appreciate his contributions to this world. \n\r\nOne last observation I had comes from my belief in God. I know God loves Enimem and has created his with a purpose and destiny. No matter who we are or what we are going through, God is with us and loves us non-stop. Nothing can separate us from Godâ\u0080\u0099s love and who he has created us to be, which is inspirational, creative and motivated individuals. I thank God for Eminem and the freedom we all have in Jesus Christ who took all our baggage to the cross and calms the storms in our lives!\n\n\n", "comment_35": "\neminem is back ?!!! yes omg now i have something to do this summer\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nits about him taking back control of his life and his career. he sold his soul to the Illuminati (yea you thought i was gonna say devil didnt you?). but hes taking back the control, even if the higher-ups are gonna take him down for it. this song is literally about his recovery, about how he's not gonna be a puppet to the Illuminati anymore.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nATTENTION EMINEM HATERS!!!!\n\r\ndamn i didnt kno there were so many LEGEND-quality rappers who have the balls to sit here and try to shit on him. He even said it in the song, bees with no stingers... drop dead, etc\n\r\ntruthfully, i didnt warm up to Em until recently, but this song is incomperable to maybe any song, let alone a ripoff of his previous work. I write all kinds of music, and i hear this album, it motivates me. But hey I guess if there werent so many douchebags to talk shit using media's nice big force field for safety, how would ppl like Me and Em know how fuckin great we were\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nMY OPINION of this song and album is that eminem is no longer a puppet of the ILLUMINATI. YES, the ILLUMINATI. Not afraid is saying that he is NO LONGER AFRAID (thus the name) so he is breaking out of their clutches. He says, \"It was my decision to get clean, I did it for me, Admittedly I probably did it SUBLIMINALLY for you\" means that he is no longer trapped and admits to using subliminal messages in his music which they demanded. \"So starting today, I'm breaking out of this cage\" also supports him getting free. \n\r\nPLEASE WATCH THE YOUTUBE VIDEO IVE POSTED ABOVE!! THERE IS MUCH MORE THAT NEEDS TO BE SEEN!!!\n\n\n", "comment_39": "\ni really like eminem he is my faveorite rapper   as i was growing up my mom and my sister used to talk about how horrible he was and what he sang about. but i secretly LOVED HIM!!  yes i knew he was wacko  thats the best part about him.  HE IS NOT AFRAID TO BE DIFFERENT!!!!  his song     will the real slim shady please stand up, i repeat   will the real slim shady please stand up ... were gonna have a problem           and them it starts talking about him being a white rapper lol      hes awesome   and whats up with everybody hatein on em for       everyone i know says that they dont like him anymore because they liked how he used to rap      and now hes different        i love everything about all of his raps   he is very talented and i really dont give a crap if he were to rap \"Jesus Loves Me\"    it would be awesome   haha!   Thank You.    \t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThis song is awesome!!! Eminem is by far my favorite rapper!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\neminem is by far the best rapper from this generation. he raps about real life and personal struggles. all rappers like lil wayne rap about is drugs, sex and alcohol. eminem is so much more creative. and I love this song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nit is not accents its maxims... \n\r\nmaxims - an expression of a general truth or principle \t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nthis sections as well:\n\r\nYou said you was king, you lied through your teeth\r\nFor that fuck your feelings, instead of getting crowned you're getting capped\n\r\nWhere Em says 'feelings', the way he says it sounds like \"fillings\" - a deliberate play on words, with 'lied through your teeth' in the line before and 'crowns' and 'caps' both forms of dental work.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nRecovery is such a good album. I love all the tracks and Eminem is the greatest.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nit is perhaps i ran the MAXIMS into the ground. a maxim is a short verse that tells a lot. that is the way eminem raps\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nanother amazing song by eminem...\r\nthe only thing is \"you said you was king, you lied through your teeth and for that fuck you fillings, instead of getting crowned your getting capped..\" its all part of the metaphor he's got going on those two lines\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\neminem the radio version swear words cut out u would head he's got the urge to pull his #$% from the dirt and then $#@@ the universe then after that 5 mins of &*&^*&^*&^(*&^&^&^*&^ eminem rules stiff\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\n\"No if ands or buts don't try to ask him why or how can he\r\nFrom Infinite down to the last Relapse album he's still shit'n\r\nWhether he's on salary, paid hourly\r\nUntil he bows out or he shit's his bowels out of him\r\nWhichever comes first, for better or worse\r\nHe's married to the game, like a fuck you for christmas\r\nHis gift is a curse, forget the earth he's got the urge\r\nTo pull his dick from the dirt and fuck the universe\"\n\r\nCould he be talking about Bush?! Just an idea...\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nBut you won't take the sting** out these words before I say 'em\n\n\n", "comment_50": "\nFor me, the song is about a person who is fighting his battle from all the demons in his life to take a leap into what his dream says. Away from drugs & social stigma, he is running for his dreams, he's so determined just to become the one he desires.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nHis new stuff does not even come close to how amazing his old was.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nLove this song!! sooo good to finally see someone standing up to those idiot illuminati people (i know others have before but eminem makes it really evident in his lyrics)\r\ni just hope other people catch on to what hes really raping about.. not drugs or his love life of whatever... when he says hes fighting his demons.... he means it literally!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nWhat does this part of the song mean? I need help. Thanks\r\n\"Cause I'm raising the bar, I shoot for the moon\r\nBut I'm too busy gazing at stars, I feel amazing\"\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nHES SAYING FUCK THE ILLUMINATI! thats what its about :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nThis is like my inspirational song and what I listen to when I'm depressed. I love it!!\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis is like my inspirational song and what I listen to when I'm depressed. I love it!!\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nthis song is about a few things actually. for one, it's about him finally being clean from drugs and alcohol. (which i personally am very proud of him for) because he was in and out of rehab and dealing with relapses but now he's done with all that. he's back in the game.\r\nit's also about him breaking free of the Illuminati. his whole recovery album was pretty much about that. but throughout the whole song he's pretty much telling off the Illuminati and the higher-ups and declaring his freedom. he's saying hwo he's no longer letting them control his life.\r\nhe's also saying, although subtley in parts, that he's getting his priorities straight, and he's going to be more of a father to his daughters, \"I promise to focus soley on handling my responsibilities as a father. So I solemnly swear to always treat this roof like my daughter's and raise it.\" he's saying ho he's done letting fame and drugs get in the way of his relationship with his daughters.\n\r\ni am very proud of him for getting through all of this.<3\n\n\n", "comment_58": "\nmy fave part,he's married to the game like a fuck you for christmas his gift is a curse\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis is for the people saying this is about the illuminati. This songs meaning is very simple, follow along with me: \n\r\nHe used to be an addict. he is now in recovery. he is saying he is not afraid to say enough to that life.\n\r\nreally, you people make serious anti new world order/illuminati look like kooks. it seems you people think EVERYTHING is part of some gigantic conspiracy. there IS an international group of greedy, power hungry people that would like to control as much of the world as possible. eminem is not part of that. I would put money on it that all these \"illuminati\" theories you people puppet are cointelpro plants, put in place to make people that criticize them all look insane so no one listens to them. this is just as bad as saying it's all satan's plan. people don't want to listen to you when you say that crap. they immeadiatly discount you and all you have to say. simply presenting the evidence as is is plenty. you can prove politicians deal with some shady people. the second you bring that BS religion crap (god/satan) into it, I tune out. you lose ALL credibility with me, sorry. don't matter what the subject is. \t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nThis is not about the Illuminati dammit!  It is about him getting off drugs and breaking his addiction.  I can understand thinking its about Illuminati up till the part where it goes \"No more drama from now on, I promise to focus solely on my responsibilities as a father, So I solemnly swear to always treat this roof like my daughters and raise it, You couldn't lift a single shingle on it!\" after that the people who still think this is about the Illuminati either didn't read the entire thing or are complete idiots.  What do his daughters have to do with a damn conspiracy?  Someone tell me that.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nBy looking at Eminem's recent albums, we can obviously tell what he's talking about. In the one song, he mentions how he had problems with opiates, namely vicodin, valium and methadone.\n\r\nGetting clean is the most amazing feeling I have ever experienced, I can directly relate to the lines:\r\n\"Cause the way I feel, I'm strong enough to go to the club\r\n Or a corner pub and lift the whole liquor counter up\r\n Cause I'm raising the bar\"\n\r\nThe whole song is talking about the ups and downs of addiction. \"Holla if you've been down the same road.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nthis song is about how he's was feeling depressed, but he was able to pull himself out of his slum and he's telling his story of how he did it. He know he will never have it fully figured out. \"This black cloud still follows me around\" he knows it will always follow him around, but instead of of it letting it get the better of him (him being trapped in his own hell) he's gonna fight (he's a fighter) until he get out of his slump and is feeling good and a little less insane. he's not afraid, fear is a powerfully emotion especially if you let it control you. Eminem is really married to the game, his gift is a curse as he said, but he's putting that away he lost him self and found his way back. He went through his own \"Recovery\". He's helping the people who've been down this road he went on, the people who are blessed with curses, the people who are depressed, or what ever there reason for fighting (for a loved one) he's letting you know he's on your side and that your not alone. \"Holla if you feel like you've been down the same road.\" He writes these songs for the listener,so as the listener enjoy.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nThe song is mostly about him trying to get away from the Illuminati. He is \"married to the game\" and he may never back out. He tries to tell his fans about how he is in and can't get out. Maybe people need to open their ears and actually listen for once. It's not like you can save him or anything, but if this gets close enough to higher-ups then we can help him and others out there (Michael Jackson for example. He is gone because of one particular reason... the Illuminati or industry).If you choose not to believe me, then look up The Illuminati Music Industry Parts 1-11. Show this to everyone you know and maybe the music today doesn't have to be about violence, drugs, and sex. Please understand.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nif it was played backwards, then you'd understand the real meaning to the song, he had sold his soul..and he wants his family to know he loves them and he was sorry mostly.. but yeah the link is: youtube.com/… look it up\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\ni went to see eminem in melbourene and before he sung this song he explained what it was about. he haid its about its about hi9m almost loosing a friend to drugs and hes just saying dont be afraid to say no to drug and its ok not to do drugs.\np.s he is the best live!!! :D\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nlove the song\nlove the artist\nlove the words\nlove the rhythm\ni just love everything about it\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nthis fuckin' black cloud\nStill follows, me around but it's time to exercise these demons\nThese muh'fuckers are doin' jumpin' jacks now\n\nBest part . i think\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nThis song is clearly about his recovery from addition and his (finally) finding some recovery in AA/NA or whatever he is in.\n\nThe video itself shows him standing on the ledge of a building.  This is where addiction where will bring you.  You want to jump.\n\n\"I'm strong enough to go to the club or the corner pub, \nAnd lift the whole liquor counter up 'cause I'm raising the bar\"\n\nThat should be enough to figure this song out.\n\n\"It was my decision to get clean, I did it for me\".  What else can be said?\n\n\"I'm strong enough to go to the club or the corner pub, \nAnd lift the whole liquor counter up 'cause I'm raising the bar\".\n\nThat sums it up.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nTo Shady, and to others, this song is about addiction and recovering from it. Honestly, I feel it all depends on personal experiences. It could be about depression to one person, but addiction to another. These lyrics were probably meant to pertain to everyone and not just a recovering addict. Thatâ\u0080\u0099s just my two cents.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nin my opinion this is the best motivating song I have heard from the artist, everything he said on the song applies to me,  very uplifting, I have a YouTube  channel which I share on my site, every time I am down I play the song, thank you Eminem for making this uplifting song sir.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\npremise of I'm Not Afriad - by White Rapper Eminem. He being an American History X type of character in a ghetto bg, got onto the Black Man's stage and into the White Man's heart too. So he is talking aboot, \"hey fellow crackers, don't be racist.\"\n\n1.\nThen he begins with the para that talks about, i've been a racist, don't be one, not a good place to be for your own happiness, fuck what others think, when they look up or look down, others are stupid.\n\n2.\nDespite poverty and being a minority in a White Man's Game (Rap is the White Man's High Table in the Black World) he says, i may eat beans, and i maybe gassy and still i will sing/rap to you on this stage. You opera watchers, la di dah, who sit on the balconies and high seats. Now he is switching to the poor so-called white-trash (which is nothing but something bad white rich people refer to when they call out their own employees - other bad white but-poor people). He's the average officer employee made to work on holidays and does this all his life until he quits or dies. He spends too much on sex and escapism.\n\n3.\nNow in 3rd he is trying to establish himself as a righteous hero, which if we maintain suspension of disbelief, he does a nice job of executing, being teh ANgry White Rapper Guyyy. He says i'm big, ima help u little guiiiiii.\n\n4.\ndoes not compute...maybe was time bound to an earlier verzion\n\n5.\nrepeat 3.\n\n6.\nHe says then the poor white man ultimate either quits or dies working, or some that try trying, end up being violent racists in gangs and shits. And he says all that is nonsense, if you just focus on the wellbeing of your own self by being a proud father and taking care of your son or daughter\n\nside note >>> wew the world's first songmeanings.com entry for a rap song, that itself raps, ping fucking pong!\n\nSongwriters: Matthew Raymond Burnett / Jordan D. C. Evans / Marshall Bruce Mathers / Luis Edgardo Resto / Matthew Jehu Samuels\n\nIt's good that he writes some of his own songs. It's good.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nis it me or does this song have ALOT to do with the Illuminati and freemasonry \t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI enjoy reading everyones interpretations and I believe this song does have a lot to do with overcoming addiction. I also think its his way of no longer allowing anyone or anything to have control over his life, his feelings or his decisions. He is standing his ground, he is no longer afraid. He doesn't care what anyone thinks and is going to follow his heart regardless of what anyone has to say about it. I think it is also his way of reaching out to people to let them know they are not alone in their struggles. I think it is  a message to stand up and fight when it seems the odds are against you. Instead of giving up when all seems lost, TAKE back the life that is yours and regain control.....I personally have demons I am fighting right now, and this song gets played on the daily. It is an inspiration to me, reminds me of how incredibly strong I am even when I feel defeated, and it is one of many songs that keeps me going. I also think that lyricists write their music a certain way, knowing that every listener will have a different perception of its meaning. I think that is something that makes music so incredible. One person can get something entirely different than someone else, its universal in a way.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nHe still sounds like he has no balls, and that he has to try and make up for some deficit.  He can't just be, he's to busy justifying his own existance.  You'd think he would have grown up by now.  He's not a kid anymore.\n\n\n", "comment_75": "\nOkay, fanboys.  Good job.  His dick is sufficiently sucked.\n\r\nWe all know you like it, but what's the song about (considering that's what this site is supposed to be fore)?  Did he kick just the pills?  Pills and the booze?  Pills, booze and women?  What's the deal here?\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nThis song sucks.  He made this for all you radio listeners so he could get radio play.  His rhymes suck when he is clean.  On Fire owns this song, people who disagree are a bunch of retards.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nEminem can't sing high for crap. Whenever he goes into that bridge it's like nails on a chalkboard for me. Great rapper though, and I guess he's pretty good at singing low.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nthis song is great very inspiring to end my addiction of burritos\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThis Song Is Straight \r\nGarbage. Ok First Of All I'm Sick Of Hearing it On The fucking Radio, And Second Of All Eminem Is A Bitch Anyways So Yeah This Song Really Blows.\t\t\t\t\n\t\t\t\t\n\n"}