{"comment_0": "\nSince that LyricFind thing overwrote them, here are the correct lyrics from the booklet that I originally submitted:\n\nWho knows how long\nI've been awake now?\nThe shadows on my wall don't sleep\nThey keep calling me\nBeckoning...\nWho knows what's right?\nThe lines keep getting thinner\nMy age has never made me wise\nBut I keep pushing on and on and on and on\nThere's nothing left to say now...\nI'm giving up, giving up, hey hey, giving up now...\nThere's nothing left to say now...\nI'm giving up, giving up, hey hey, giving up now...\nBelow my soul\nI feel an engine\nCollapsing as it sees the pain\nIf I could only shut it out\nI've come too far\nTo see the end now\nEven if my way is wrong\nI keep pushing on and on and on and on\nThere's nothing left to say now...\nI'm giving up, giving up, hey hey, giving up now...\nThere's nothing left to say now...\nI'm giving up, giving up, hey hey, giving up now...\nI keep falling, I keep falling down...\nIf you could only save me\nI'm drowning in the waters of my soul\nThere's nothing left to say now...\nI'm giving up, giving up, hey hey, giving up now...\nThere's nothing left to say now...\nI'm giving up, giving up, hey hey, giving up now...\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nTo me, this song seems to strongly convey someone who is struggling with something, an addiction or relationship mainly, maybe even suicidal depression. It all seems to just fit. \"Who knows how long I've been awake now? The shadows on my wall don't sleep. They keep calling me, beckoning.\" This line starts the song off, and sets the mood for it. The \"shadows\" are the temptations and whispers in the struggling person's ear that never go away, that must always be fought. \"Who knows what's right, the lines keep getting thinner. My age has never made me wise, but I keeping pushing on, and on, and on, and on.\" This line makes the point to say \"It's not black and white anymore.\" The line between right and wrong is much grayer than before. The artist goes on to say \"my age has never made me wise,\" Meaning time and experience with his struggles has made no difference. But he keeps on, he continues to fight, because he knows he has to. The chorus, however, conveys a different message. \"There's nothing left to say now. I'm giving up, yeah, giving up now.\" At this point it's mental ping pong, the struggling person wants to fight, but he just can't. He wants to give up. \"Below my soul, I feel an engine, collapsing as it sees the pain. If I could only shut it out.\" This line is a bit more cryptic, but what I think the artist means by \"engine\" is the driving force that has kept this struggling person alive. The last bit of him is collapsing as it sees his pain, and all he wants is to shut it out and give in. \"I've come too far to see the end now, even if my way is wrong. I'll keep pushing on.\" This is one of the last hurrahs, saying he's come to far in the fight to watch himself fall, even if his lifestyle and way of going about it was all wrong, he continues to push on. Then the chorus again, conveying defeat. Now comes the bridge, \"I keep falling, I keep falling down, if you could only save me, I'm drowning in the waters of myself.\" This is it, this is the end for this struggling person. He says how he keeps falling and failing, and that it's no use, because the very force and mind that keeps them alive is simultaneously killing them, that no one can save them from himself. And finally, he gives up. In the final and most dramatic chorus, he says, \"There's nothing left to say now, there's nothing left to say now. I'm giving up, giving up, yeah, giving up now.\" This giving up could be breaking off a relationship, giving into an addiction, or even suicide. All in all, this song seems to be the story of someone who wants to fight their demons, but just can't survive the process. One of my favorite Imagine Dragons songs, maybe even my favorite song.\t\t\t\t\n\t\t\t\t\n\n"}