{"comment_0": "\nI read through some of the comments before writing my own opinion of the song's meaningful nature.  Some of them were useless and a whole lot'a babble, others were religiously based, which made me want to gague and roll on the floor, and occasionally some good points were mentioned.  My interpretation of the song will probably have the same reactions to the ones I'd seen above or worse of ones.  So, here I go, I'll try and summerize as best I can!\n\nNothing Else Matters-Metallica\n\nWhen I'd first heard this song I was stumped, I didn't know what they were talking about, how could such a melody have lyrics of such dark nature, well, this is how I percieve it after replaying it to the point of having 567 plays on my Itunes:\n\n~~~~~~~~~~~~~~~~\n\n\nSo close, no matter how far\nCouldn't be much more from the heart\nForever trusting who we are\nAnd nothing else matters\n\nComment: The narrator speaks of a first love, or maybe even a true love after searching many years for him/her (perhaps also a signifacant other).  In love we need to trust, and even more so in ourselves.  The narrator says that in love trust and being true to your heart is all that matters.\n\nNever opened myself this way\nLife is ours, we live it our way\nAll these words I don't just say\nAnd nothing else matters\n\nComment: The narrator is opening himself to him/her like a book, telling secrets and sharing things he/she'd of never imagined sharing.  He/she is having a spur of reality, rebellion even, deciding that their life is their own and that he/she is determined to live it how they want no matter what people say.  Being true to you is all that matters.\n\nTrust I seek and I find in you\nEvery day for us something new\nOpen mind for a different view\nAnd nothing else matters\n\nComment:  The narrator now is finding a sense of belonging and trust in their significant other, learning new things and keeping an open mind towards what's happening.  Being open and willing to change is all that matters.\n\nNever cared for what they do\nNever cared for what they know\nBut I know\n\nComment: The narrator is accusing people of not caring enough for their actions and shaming them for not using their knoweledge.  He says he knows, something of the reality.  Perhaps a break in the trust? \n\nNever opened myself this way\nLife is ours, we live it our way\nAll these words I don't just say\n\nTrust I seek and I find in you\nEvery day for us, something new\nOpen mind for a different view\nAnd nothing else matters\n\nComment: The narrator repeats himself, obviosuly destressed from some event, telling you that he/she needs to stay true to themselves and rebuild a trust.  Again, he/she says that trust and staying true is all that matters.\n\nNever cared for what they say\nNever cared for games they play\nNever cared for what they do\nNever cared for what they know\nAnd I know\n\nComment: Now we know there has been a break somewhere between then and now.  The narrator tells us that they don't care about their actions, that they're playing games and know it.  He/she might appear oblivious to what's going on, but he/she makes it clear that they KNOW what's happening, that they have and still do.\n\nSo close, no matter how far\nCouldn't be much more from the heart\nForever trusting who we are\nNo, nothing else matters\n\nComment: The song ends with a specific cluster of lyrics, saying that you need to trust in you and not others.  He/she says that no matter how far you are, or how close you are to love or something more than what you have, always stay close and true to you, that's all that matters.\n\n\n~~~~~~~~~~~~~\n\nAnyway, that's my disection of the song, and how I interpreted it so many times over.  Feel free to agree and disagree, but that's how I see it.  A song is a song and a song holds a meaning; how we as individuals take in that meaning is how we as individuals will learn to appreciate the song as a piece of art, and even at times, a part of us.  We relate and understand things differently, hope this helped!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis is a very special song to me. My mom tells me everytime she hears it that its going to be her funeral song. She tells me because the song means that no matter what happens in life, who you meet, the things you do...remember who you are. Dont let what people think about you and what they what you to be change you. always \"true in who you are\". The person you truly are. And if you always remember exactly who you are, nothing else in life matters.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song is what you'd get if you made the poem Invictus into a beautiful love song. There are two threads to it, the first thread is the love song:\n\n\"So close, no matter how far\"\n    We're emotionally close even when we're physically apart\n\"Couldn't be much more from the heart\"\n    I love you from the bottom of my heart\n\"Never opened myself this way\"\n    I've never opened up to someone like I have with you\n\"Forever trusting who we are\"\n    We'll always believe in ourselves and each other\n\"Trust I seek and I find in you\"\n    I need someone I can trust and it's you\n\"Every day for us something new\"\n    We're not growing stale, every day of our relationship feels exciting and new\n\"And nothing else matters\"\n    Nothing matters but our love\n\"All these words I don't just say\"\n    I'm not just saying these words, I mean them\n\nThe second thread is a fierce \"declaration of independence\", a rejection of the rest of the world:\n\n\"Life is ours, we live it our way\"\n    We'll live how we want, not how others tell us to\n\"Open mind for a different view\"\n    We see the world with our own eyes and that gives us a different view.\n    We don't copy the unexamined opinions of others.\n\"Never cared for what they say\"\n    Other people gossip and disapprove but we ignore those fools\n\"Never cared for games they play\"\n    Other people play games and don't mean what they say but we ignore those fools\n\"Never cared for what they do\"\n    Other people do bad or stupid things but we ignore those fools\n\"Never cared for what they know\"\n    Other people gossip but we ignore those fools\n\"And nothing else matters\"\n    The rest of the world doesn't matter, only our love matters\n\nA couple more points:\n- The words \"nothing else matters\" tie together the two threads.\n- For me, although the melody feels dark and dramatic, which might seem out of place in a love song, that power and anger emphasize how strong the singer's love is.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis song is about the prosperity and preservation of human friendship, and that's all that matters, no matter what kind of personality you have the need for companionship is always there, lover, friend, or relative.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think its about releationships.. of any kind. Whether it be your spouse.. boyfriend or girlfriend.. your best friend.. whatever. To James I think it might have meant his band-mates. I think it'd be an excellent wedding song. If I ever do get married again, this will be the first dance.  \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nhey everyone metallica is my favorite band this song james wrote about his girlfriend. He wrote it because he was missing her he had been on the road all the tiem and didn't get to see her very much. James did not want this song on the black album but the rest of the band loved it so the put it on.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni think a lot of people miss the whole point of this album. just about every song talks about youth being lost and the struggle of finding purpose in life. and this song is basically about how you should find what you want to do in life and be happy doing it - nothing else matters. true it could be about love, but it doesn't really fit with the unforgiven or don't tread on me. which what makes this album such a political statement for me. it basically is saying - screw the educational system, we need to get back to what people want to do with their lives, and that doesn't necessarily mean moving into meaningless positions created by business people/politicians.\n\r\ncorrect me if im wrong tho \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthis song made me cry the first time i heard it it is so emotionally powerful its just telling you to be yourself and not care what people think\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nTis a love song... no doubt.. it doesn't need the word \"love\" in the lyrics to be about love... It's the straight forward feeling you get form the words, and how he sings them... You can tell that he's singing to someone who means just an incredible amount to him, someone that he misses...\n\r\nADMM85- lol... I've been trying to get my gf to accept this as \"our song\" she insists we get one... and I can't stand the poppy junk she suggests... I think I almost have her for it.... and about the wedding song... My older cousin and his bride actually had an acoutic version of the song played during their ceremony... it was funny... I was up in the balcony taping, and it started playing.... I was sittin there singin along... They also danced to it for their special dance at the reception...\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis is one of the most, if not THE most, amazing song I have ever heard in my entire life. I almost cry when I hear it, I'm just too embarrassed to. It has a very personal message to me and it'll just hurt me to try to explain it.\n\r\n\"No one important\" sucks.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nWell, im not sure about yall guys, but i think the meaning is pretty obvious...\r\nHere it is:\n\r\nI think this song is about how everyone should not care about what others think, or what others have said to you that are mean or disrespectful. It's also about not letting those words they say effect you or make you feel bad or insecure. But you still should respect everyone else, and respect their opinions. If you think differently from the rest of the crowd, then dont worry about it. Nothing Else Matters except YOUR opinion. \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nIt's about a guy who has a girlfriend and ever since he doesn't care and they live life how they want together, no matter what, and that 'nothing else matters.\n\r\nnever opened myself this way\r\nlife is ours, we live it our way\r\nall these words I don't just say\n\r\ntrust I seek and I find in you\r\nevery day for us something new\r\nopen mind for a different view\r\nand nothing else matters\n\r\nThe paragraphs means the guy is very in love with the girl and he never opened himself up or trusted someone like before, and shares his beliefs with his girl. \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nWhen bands make a song that sounds so different to their usual style, you've either got to love it or hate it. But whatever you think of it, you've got to give them credit for expanding their horizons, as Metallica have done here. \r\nNot that it's too different, but it's definitely a change from their usual violent lyrics and heavier, louder music. And in my view it's an awesome song. Very good lyrics about a love song.\n\r\nSo close no matter how far\r\ncouldn't be much more from the heart\r\nforever trusting who we are\r\nand nothing else matters\n\r\nThis sounds like he loves someone dearly and while he doesn't have this person (presumably female), in his grasp yet, he knows that these 2 are very close and he's preparing to tell her something and show a side which he's never shown before, or tell something he's never said to anyone before.\n\r\nnever opened myself this way\r\nlife is ours, we live it our way\r\nall these words I don't just say\r\nand nothing else matters\n\r\nHe's said his say and that it comes from the heart, they are no lies. The life is ours part could mean we together could be one.\n\r\ntrust I seek and I find in you\r\nevery day for us something new\r\nopen mind for a different view\r\nand nothing else matters\n\r\nWhat he has said here suggests what he has done has worked, together they are one and that this is a new beginning, a whole new perspective on life, and that with this person, there can be heaps of new things that can happen and that it looks like it's going to be a ride of a lifetime.\n\r\nnever cared for what they do\r\nnever cared for what they know\r\nbut I know\n\r\nThis could mean that people were talking about these 2, joke or not, and now he's gotten what he wants, he doesn't care what they have said or are saying and what they know or knew, but, ultimately, he knows exactly what is going on.\n\r\nnever cared for what they say\r\nnever cared for games they play\r\nnever cared for what they do\r\nnever cared for what they know\r\nand I know\r\nYE-YEAH!!!\n\r\nAgain, he does not care about what jokes, games or rumours that have been going around, and now that he's gotten what he wants, all that he's said is an outpour of emotion, an outpour of emotion he's either never shown, or has never felt.\n\r\nAll in all, to me this is a very happy song and a very pleasant song to listen to.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis is  a song james wrote to his girlfriend if i remember correctly\n\n\n", "comment_14": "\nThis song is about Hetfield having a busy life on the road and trying to keep a meaningful relationship back home with his lady.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nGood song. Mean's alot, It is totally clear what it is about though. Love.\n\r\nGood one James\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nEveryone on this site that says it has to do with anything but love, life, friendship/hard times is a fucking retard. This song isnt that difficult to figure out so when people come up with bs like \"its about jesus\" or \"i think its about losing your virginity\" like... wtf!? are you kidding me honestly thats so stupid and anyone with a brain would know it. so, thats all I have to say. peace out\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nWhat can I say this song is really beautiful.\n\r\nIts sounds like it was written for a loved one who is far away and you just letting them know that no matter how far they are they are still close to you. Its letting her know that no matter what comes along what people say and the like non of that matters its just you and her.\r\nPlus James explained something like that anyway.\n\r\nReally good song\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nso so emotional.love this song.think its about just living life not caring what anyone says\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis song is so powerful.  Metallica was my fiance's favorite band and he was so good when he would play the bass to Metallica's songs.  \n\r\nHe passed away almost 2 years ago and we played this song at his funeral. I tried to pick songs that laid out details as to what kind of guy he was... He was so full of life and nothing else ever mattered to him except living life the way HE wanted to live it no matter what ANYONE else thought or said.  We have a 3 year old little girl and she always wants me to play her 'Daddy's songs' so Metallica is ALWAYS on and my babygirl knows how to rock it!\r\nRIP Jason...you are forever missed\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis is my favourite song of all time; I never get tired of it. I was introduced to it when I was 14 by my cousin, shortly after the death of my father. While reminiscing of the good times with my dad, my cousin explained how when he was yougner, he had tought him the main solo to the song on the guitar, and that he never forgot about it. My cousin then pulled out his cell phone and played a part of the song for us.\n\r\nI fell in love with the song and decided to make a slideshow for my dad's visitation using Nothing Else Matters as the background music. Today, whenever I hear the song I feel connected to my dad once again. And I know he'll always be so close, no matter how far... and nothing else matters.\n\r\nP.S. This song is also especially important to me because it is the song that introduced me to Metallica. I can now play it on both guitar and piano.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nWe played this song as our wedding dance as it has a truth and a passion. (It is also over six minutes long and our wedding party hated us for making them dance that long). The truth of it is to work out what or who is important to you and hold on to that no matter what.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni belive it was the end of fourth grade... almost 5 years ago now, when i was just starting to actually pay attetion to alot of music. i didnt know alot of bands, but a good friend of mine reccomended metallica. i went on youtube. looked up the band, and found this masterpiece. yeah, i love their hard metal stuff too (ride the lightning just plain out rules), but this song.. it tugs at so many different emotions... i almost cried myself.... as much as id like to describe this song and try to figure out what it says, im afriad i cannot put it into words.... the solo... the vocals.. the deep meaning it carries.. its too much.. so i must simply say that metallica rules... And nothing else matters\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nOk everyone, to clear up the confusion, this song is about the brotherhood that formed between the band members as they were on tour.  It's not a love song.  IF you doubt me, then you can verify what I say by watching \"Metallica: The Black Album\" avaliable on Netflix.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI read that James wrote the song for his girlfriend at that time\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nNever been a metal fan but recently when my sister died in an accident I heard this song - what an amazing song!!  The lyrics, I felt were written for me (and my sister).  Thank God for music - what else have we got when we try to get through tough times!!!  I salute you.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis song is awesome!  its great to just listen to and just think about that one thing that just drives you, ive seriously listened to this song ten times in a row just tryin to figure things out and it helps alot.  an absolutely powerful song, the solo at the end kicks ass\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nsounds like the only metallica love song to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThe best love song ever written - and the word 'love' isn't mentioned once - Oh and I'm getting married in six weeks time and I we are having the S/M version for when we walk leave after signing the register - How cool is that!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthis song has helped me through some hard times when my friend died and when my grandmother died this was the only song i would listen to for like a week\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nwell you obviously don't feel anything at all\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nFirst of all, this is a great song.\r\nSecondly, \"no one important\", you are so fucking ignorant. Just because a guy is in tune with his feelings, and man enough to admit that, does not make him gay. And even if he is gay, what would be so wrong with that? How old are you, anyway? Twelve? Grow the fuck up, and get back to me when you do.\r\nAnd to \"hell_i_call_my_head\", I think it's cool of you to admit you cried. I did too, but according to some ignorant folk, that's probably ok because I'm a chick.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nYea I must agree wiv u there it is a soulful song and I really love this song it has so much meaning it helps me clear my head and my emtions. The S&M version of this is better than the black album he sings sooo much better live and wiv more feelin. This song means a lot 2 me so do a lot of metallica songs they r the best.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nNothing else matters other then being yourself. Donâ\u0080\u0099t care what other people do or say, you know who you are and you should say what you want, and do what you feel. Open your self up to people you trust so you can truly be happy. You can start getting the most out of life when you start living it how you want to live it. Its all about breaking on through to the other side and past your wall. Many songs talk about the same thing (Break on through â\u0080\u0093 The doors, The wall album â\u0080\u0093 Pink floyd, Jumper â\u0080\u0093 Third eye blind), because people who realise that nothing else matters other then being your self realise its the most important thing in the world and worth writing allot of songs about.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nJames has said it was about his Girlfriend which he had while touring and about their long distance relationship\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nWithout Truth, there is ignorance and blindness.  Through TRUTH, is an understanding of humble knowledge.... \"truth I seek, and nothing else matters\"  \t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nmost beatiful song by mtlca ever.makes me sad and happy at the same time.truly emotional\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nThis song is about being on the road and missing your girl.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nGuys we're all missing the point. This song is what you make of it. You as an individual. I think Metallica purposefully created a non-specific song, with such empowering yet morbid lyrics. Whether the dudes wrote this about being away from a cherished lover, or a family member going through cancer, or finding yourself among a sea of people trying to define you- it appeals to such a huge audience with such different interpretations of the song, because it could mean anything. It means whatever the listener wants it to. I honestly love this form of song writing, in a way which the audience is left to make their own judgement of a song's meaning, because then you take away what you really need from the song rather than what the song is trying to give you. Metallica really thought this song through (or maybe I'm overthinking?)\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI believe the song is about his self-belief during the initial days of metallica. \n\n\"So close no matter how far\ncouldn't be much more from the heart\nforever trusting who we are\nand nothing else matters\"\n\nThey may have come into lots criticism/rejections etc. Hence the \"so close..\" and \"forever trusting ....\" and not changing their style/music or even their prospects. \n\n\" never opened myself this way\nlife is ours, we live it our way\nall these words I don't just say\nand nothing else matters\" \n\nAgain, defiance againt criticism. \n\n\" trust I seek and I find in you\nevery day for us something new\nopen mind for a different view\nand nothing else matters\"\n\n Probably spoken to his girlfriend who is supporting him in his struggle. \n\n\" never cared for what they do\nnever cared for what they know\nbut I know\" \n\nAgain, some anti-establishment frustrations cropping up. ( Btw, these lines definately dont fit in any love song. I mean why would lovers/friends care about what anyone else knows or does ? )\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI always thought this song was about friendship, the band's dedication to the each other.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nJames said in an interview that he wrote this song while on the phone with a former gf. I think that it is for anyone that is doubting themselves..donâ\u0080\u0099t! The only thing that matters is what you think of you. Nothing else matters!! \t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nHave to agree with you there. This song really rocks, but I am not sure what he is talking about in the song. Is it a relationship or what? Someone help me out.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI'm not a huge Metallica fan.. But I do like this song quite a bit..\n\r\nDoes the beginning bit with the guitar remind anyone else of Pink Floyd?\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nthis song is great it reminds me of my best frind because i move away from him\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThat's about the coolest thing I've ever heard in my life, CaNiS mAjOr.\n\r\nThis is my favourite song.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI think this song can be a love song, and it applies very well, but not necessarily.  I think it is talking about making decisions with another person (probably love-related) and the speaker telling them to not worry about what others think because it's what they think that matters.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI like this song, but the only thing about it that confuses me is whether to think about it as a \"I won't listen to you; I'll do as I want\" thing or a love song.  Either way I still like it\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nHrm, that's odd. I read somewhere this song was about James' grandmother, and something about: \r\nso close no matter how far\r\ncouldn't be much more from the heart\r\nforever trusting who we are\r\nno nothing else matters\n\r\nwere partly her last dying words.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThis is one of the most beautiful and meaningful love songs I've ever heard. It always struck me as speaking to his love and wanting to rebel against teh rest of ther world with her. This is not sappy or anything, it just rules. I wish I could voice my emotions the way this song does.\n\r\nCmoore- your interpretation is what it sounded like to me.\n\r\nI can relate to every word of this song.\n\r\n'No one important'- You need to fuck off,. Stop trying to prove you're own superiority and find something thats important to you. Open your fuckign mind. This is a very powerful song and 'Hell I call my head' obviously understands its message. I know this song relates to experiences in my life and thats where the emotion comes from. That's what music is for. If you think tears are a sign of weakness, then what can be said about your meaningless insults? \t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThis song is a soulful love song that Jaymz wrote after a hard breakup with a girl.  Beautiful song and lyrics, James' voice is fantastic on this song.  The S&M version of this song with a full orchestra is outstanding and the best version of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nYea I must agree wiv u there it is a soulful song and I really love this song it has so much meaning it helps me clear my head and my emtions. The S&M version of this is better than the black album he sings sooo much better live and wiv more feelin. This song means a lot 2 me so do a lot of metallica songs they r the best. \t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThis song was me and my girlfriends song for two years before she was killed.  James is a lyrical God.  This song is the best ballard of all time.  The perfect song for a relationship between you and your signifigant other or a band and their fans.  This song will always have a special meaning to me.  It is a very beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nsorry to hear about your girlfriend dude, this is a VERY powerful song for me, and easily one of my favs of all time, but it have twice the impact on you\n\r\nsorry to hear it man.....\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis song rocks.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI've always liked Metallica, especially their older stuff,  but this song means so much more to me.  About a week ago a good friend of mine killed himself.  This was the last piece they played at his funeral,  as he was teaching himself to play it on his guitar shortly before his death.  This song makes me remember my friend and it will always make me tear up.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nwell what can i say? i was never a real big metallica fan until someone very special to me had sent it to me saying it had reminded him of me. Ever since then ive falling inlove with him, and this song. Unfortunatly things are over between us now but this song will always mean sumthing special to me. There was a period where i stopped listening to metallica all together bcuz it was depressing but now \"nothing else matters\" just brings back all these memories, and it makes me smile.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nYou are all so worng. It isn't a love song. It is about a the band, that they do what ever the wont, don't mind the ctitcs and that nothing else matters. I saw it in Black Album Tribute DVD.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nthis song means to me, about loosing your virginity. By so close no matter how far, and nothing else mattres at that point and time when you r with the person you r openning yourself to that way.. it makes sense uh??? It is a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nIt's such a beautiful song -- especially the S&M version with the orchestra. What more do you really need? James Hetfield is not only a lyrical god, he's got the most beautiful voice that rock could ever offer. I don't know what this song's about, maybe it's about a little about what everyone says -- a love song, and maybe about the fans or the critics. But why worry about the details when you can lose yourself in it? \t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\neasily my favorite metallica song too sing and play....just on an 2 piece acoustic arrangement (two acoustic guitars) sounds great....love the SM version too\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nyeah, I agree with everyone. this is probably the sweetest thing metallica has ever put out. it has lines that just stick in your head (for me, \"all these words I don't just say\" has always struck a chord). I would love to be able to let someone in the way that this song talks about.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nyeah, I agree with everyone. this is probably the sweetest thing metallica has ever put out. it has lines that just stick in your head (for me, \"all these words I don't just say\" has always struck a chord). I would love to be able to let someone in the way that this song talks about.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nbest metallica song, agreed, it was my song with an ex and it still means a lot to me\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nThis song rocks. I can listen to it all day and just figure out life and whats going on. Great Metallica. Greatly sung.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\ni never liked metallica until i heard  this song. it hit me so hard i cried the first time i ever heard it.i can really relate to what james is sayign in this unque love song.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nhey yo this song is prolly 1 of the best metalica songs ever written. it was written about a gf james had while he was on the road and he missed her so much.....lars insisted he put it on the album and after the first time he did it live, he got emotional in the back \t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nhey yo this song is prolly 1 of the best metalica songs ever written. it was written about a gf james had while he was on the road and he missed her so much.....lars insisted he put it on the album and after the first time he did it live, he got emotional in the back \t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nreally? i thought it was a song just for metallica's fans out there\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nHey, you guys are pretty much bang on with the meaning of this song, Turns out from a dvd I saw that Jaymez origionally wrote the song for a lady, Lars heard it, Loved it and thought it should be a metallica song. It is, like every other metallica song open for inturpretation. It may have been modified by the band to be about the fans but that is also said indirectly on the dvd too \t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\n.... the best part about this song is the harmonics that fade in before the first verse of this song and the simple guitar intro that was built into complex coolness \t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nTo me this song clearly talks about a group (or just a couple) that are different from averyone else, like maybe a couple where a 14 year old is going out with a 21 year old or something, and he is telling her that he doesnt care what the other people say, except for them nothing else matters to them..... It can relate to everone who feels different, like christians or something...\n\r\ni think it's written to speak to everyone in his own way, that makes it special.....\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\ni love this song cuz its so simple and yet so complicated.  i have no idea what it means but the ppl who claim its a love song might have something... all that matters to me is that it is a great song and the solo DOES kick serious ass.  and the very beginning sounds a little like pink floyd's \"hey you\"... a little....\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nAt first, I thought it was Pink Floyd! hahaha...anyways, as dylmeister said...it's so simple, yet so complicated. To me it's about being in a relationship because you want to be with that person, and not caring about what others say or know. It's about being one with someone who you care so much for that \"nothing else matters\". It's amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nOne of my all time favs. I loved the Black Album version, but the first time I heard the S&M version I had my radio cranked up, and it totally blew me away. This is like the only song my gf wants me to play on my guitar, and so this song will always remind of her. \t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\n\"like maybe a couple where a 14 year old is going out with a 21 year old\"\n\r\nDude, sick! That age difference is almost bigger than my penis.\n\r\nAnyhoo, fantabular song and the original meaning of the song was to James' lady, but as he's stated over teh years it's become a song between the fans and teh band and teh bond they share.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nthis song wuz intended for james girlfriend but turned out to be a song for the fans!\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nHey, my BEST friend had this as her wedding song!  It rocked!  They rock!\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nthe S&M version of this song KICKS ASS!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\ni love this song, vertigo is my favourite metallica album followed closely by in justice for all, this song is beautiful  i would like the meaning of this song to remain a mystery to me, like the ither great phenomenens in this world.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nO MY GOD, ROSE --- VERTIGO IS NOT AN ALBUM BY MTLLC IT'S A RECKORD COMPANY OR SOMETHING :-) IT'S PLAIN METALLICA --- UNTITLED --- OR --- THE BLACK ALBUM\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nthis song is perfect!!!!!!! there's nothing more to say. it is just the best song i have ever heard....\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nBeautiful song, to me it sounds like a group of maybe outcast people who appreciate life in their own way and don't care what others think.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nProbably one of my favorite Metallica songs....  This talks about how no matter what happens in life,  you just keep moving on.... everytime i put it up to my ears, I get the goosebumps....    12 outta 10  =]\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nThis song means a lot of things to me.  It inspires me, and it is a song that helps me through depressions.  You wouldn't think that a Metallica song could help through depression, but every time I hear it, I feel better about myself and my relationships.  It's a beautiful song, and it's my favorite.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nMy boyfriend first made me realise that this was a love song (my opinion as well as his) because he told me to listen to the words. It wasn't until I got home and looked at the lyrics the meaning became so obvious. \n\r\nThe song talks about how two people are close no matter how far as if saying that they can't be sepperated. It also mentions stepping out on limb for a person (never opened myself this way) and the trust people should feel in a real relationship. (trust I seek and I find in you). It also to me says that as long as I have you (or the person your with) that nothing else matters. Another brilliant Metallica masterpiece if you ask me\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nSabbraCaddabra, I feel you brother. I also lost a girlfriend, and this was her new favourite song. May she live on in the heavens...\r\nIt is obvious to see that many people have many different viewpoints, and although there is a basic meaning to the song, it is fitting for each person to take their own interpretation of the song and incorporate it in some way to their own lives. I was in the Triads for the last seven years of my life, and after seeing many brothers fall, and my life crumble before my eyes, this song was the one that inspired me to move on with my life and to exit the fruitless life of the underworld. Nothing else mattered anymore, everything was extranneous save that one faith of mine. I quote: \"Couldn't be much more from the heart\". This song, unforgiven II, and a couple others, i have requested to be played at my funeral when i am gone.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\ni dont understand what it's about? anyone wana explain?\r\n-P\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI think he said it was about having a relationship when out on the road/tour on the MTV Icon thing.  Or maybe it was something else...\r\nAnyway... this song is one of MetallicA's best.\r\nRock on!\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nAs with Dyers Eve, Mama Said, The Unnamed Feeling, Blackened and Battery, This song can't be touched by words. It IS Greatness by the Masters of Music!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\ni dnt have a clue wot this song means (i think a relationship) but depending on what mood im in this can be my fave song\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nthis song is about love , distance and staying inlove... It's a very sweet love song\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\ni think it is about a relationship. when i first heard this song it made me cry. it is emotional. my bf wants this song to be our wedding song. i want it to be too. i love the song and plus metallica is the best band in the world. there is no doubt about that.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nThis song could be the best song ever made. I just lost my dog who had bin my very best friend in many years....sins that i have only bin listening to this song and im sure it has saved my life....metallica are true heros, but even better if they could just bring back my dog :(\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nI think this is just James Hetfield's attempt at a love song! It totally works and it's really emotional! I love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\ni love this song, metallica is a very original band\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nWithout doubt, the most moving 'tallica song. Jaymz's greatest work ever. S+M version makes the hair on my neck stand on end. Amazin'!\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nit's a love song but on so many more levels than any other, and it can make me cry almost everytime i hear it :'(\r\nits about that when your in love you dont care what other people think\r\nMy favourite song\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\ni heard hetfield said this was a song about being on tour and the close friends he is with. he wrote this while on tour about being on tour.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nThe song was written over a long period of time while touring it was meant to be a love song about someone who left him but it's turned into a song dedicated to fans\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\ni would be really worried about getting \"phucked\" in the ass myself buttphucker333\n\r\nthis song is metallica's best, and your mum is my best.....HAHAHAHA she is sooooo good in bed she is making me hard right now...\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nI think this is about Jesus and false teachers:\n\r\nMatthew 23:23\r\n\"Woe to you, teachers of the law and Pharisees, you hypocrites! You give a tenth of your spicesâ\u0080\u0093mint, dill and cummin. But you have neglected the more important matters of the lawâ\u0080\u0093justice, mercy and faithfulness. You should have practiced the latter, without neglecting the former. \n\r\nPhillipians 1\r\n15It is true that some preach Christ out of envy and rivalry, but others out of goodwill. 16The latter do so in love, knowing that I am put here for the defense of the gospel. 17The former preach Christ out of selfish ambition, not sincerely, supposing that they can stir up trouble for me while I am in chains.[3] 18But what does it matter? The important thing is that in every way, whether from false motives or true, Christ is preached. And because of this I rejoice.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI meant to say, it is about getting to know Jesus for yourself and not listening to the false teachers.  A lot of people call themselves Christians but have hijacked the faith for their own selfish purposes.  \n\r\nSo don't listen to all the crap from all those religious biggots, but get to know the real Jesus and find out for yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nThis is the best song every made in my eyes.. the guitar is beautiful.. everything.. and when you add the San Fransisco symphony behind it just blows you away.. i love this song.. it means a lot to me, its me and the love of my life's song.. i told everyone i know that i want it played at both wedding and funeral.. who says its not a good wedding song.. i love it... Mad props to metallica.. the greatest band ever............... I Love You April\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\ni remember when this song was first released.  everybody talked shit about metallica because it wasn't the bands normal head banging material.  oh my god, jaymz has feelings!!  plus this song turned out to be one of their biggest hits, and one of my favorite songs of all times.  metallica rules!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nthis song is way to deep to put into words\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nthis song is my second favorite, you just cant beat one. but i love it. i'm learning the intro on guitar, and i love singing to it. it reflects feelings i have for a certain someone (not mentioning names lauren) jaymz is a genius, and the drums are simple awesom, the way they add effect.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI met an amazing guy, it was one of those right away instant great connections. We went out a few times and it was amazing, than he took me out to lunch and told me he had a girlfriend of 3 years whom he was going to leave. I didn't know what to say so i told him to take me home, later he sent me these lyrics (we both love metallica)  and highlighted\n\r\n\"so close no matter how far, couldn't be much more from the heart. Forever trust in who we are.\"\n\r\nso to me it means that even if you physically can't be with a person, that connection is still there and strong. (i know, gag! haha)\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\ndont flame me for this but IMO its saying nothing else matters but your own opinion i get it from the line \"life is ours, we live it our way  and of corse the nothign else matters\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\ngreat song... i love it! metallica fukin rocks!\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nI just saw on interview of metallica and James said the song is about \"being on the road and missing your chick at home\"\n\r\nthan he said that  \"girls come and go, so it turned into a song for the band, of us all sticking together\"\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nit's the greatest songs of the alltime\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nmy fav song, this is as good as it comes, perfect lyrics, perfect song structure, beautiful melody and one of the greatest solos in my opinion. i was just wonedering does james play the solo because he does in the film clip?\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nlets just say its a love song and its two deep for all of us to comprehend\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\ni am writing a flute part for this song. the song is beautiful and the notes just float into my head. all i have to do now is harmony for the solo. metallica helped me write my first notes on flute in a way i suppose.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\noh and theres one thing wrong with this song. you're all calm when its over, then the blaring intro of Of Wolf And Man kicks in and ruins the moment\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nNot a big fan of metallica bug huge song doubt....\r\nGreat to play it on acoustic\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nMB777's got it when it's about \"missin' your chick at home\" i saw it on the same dvd of making of the black album. James also said he was on the phone when coming up with the finger picking intro and just added little pull offs to it after and it was a personal song and the others weren't suppost to know about it until he started playing it and someone overheard.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nI'm sure this has been mentioned... But this song is about a relationship, and it's very beautiful (which isn't usually the way I describe Metallica songs... usually it's like, \"kick ass\"). If I hadn't first heard this song when I got \"The Black Album\" I wouldn't have thought it's Metallica. It shows that Metallica has two different side- and they both rock my unmatching socks! \n\r\nMetal Advocate- it's awesome that you're writing a flute part for this song. That's gonna be kick ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nthis song kicks alot of ass\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\n(puppet master I really didnt try to steal your name)\n\r\nI know this is not what its about but this song reminds me of the 9/11 atacks, and how people who didnt care about  firefighters and the military, suddenly recognized them as heros. hence the lyrics:\n\r\n\"never cared for what they do\r\nnever cared for what the know\r\nbut i know\"\n\r\n-------------------------------------------------------\r\nanother posible meaning is that its about a fat kid who tries to get candy from a machine but the machine jams. This is how you get:\n\r\nso close no matter how far...\r\n(he's so close the the candy yet so far away)\r\nNever opend myself this way...\r\n(kid starts crying)\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\n(puppet master I really didnt try to steal your name)\n\r\nI know this is not what its about but this song reminds me of the 9/11 atacks, and how people who didnt care about  firefighters and the military, suddenly recognized them as heros. hence the lyrics:\n\r\n\"never cared for what they do\r\nnever cared for what the know\r\nbut i know\"\n\r\n-------------------------------------------------------\r\nanother posible meaning is that its about a fat kid who tries to get candy from a machine but the machine jams. This is how you get:\n\r\nso close no matter how far...\r\n(he's so close the the candy yet so far away)\r\nNever opend myself this way...\r\n(kid starts crying)\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nThat is a very deep thought, Puppet Master.  I have often found sorrow in a candy machine which would not give up the reward.  Everytime I hear this song I break down into tears.  I could still taste the gumball that had never been..........\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nThis happens to be one of my favorite songs, and by far my favorite solo to play.  To me, this song is about being away from something (or someone) you love.  Also, my best friend, who's an atheist, starts crying like a baby when he hears this song.  It's just a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI THINK THAT THIS IS A LOVE SONG.YOU CAN INTERPRETE IT THE WAY YOU WANT.BUT I THINK THAT THEY WROTE IT THINKING IN THE BAND.THEY ARE ALWAYS ON THE ROAD,FAR AWAY FROM HOME,PEOPLE SAY THINGS ABOUT THEM.BUT METALLICA STAY UNITED TRUSTING IN THEMSELVES!!!\r\nAND DON'T WANT TO LISTEN ANYONE.NOTHING ELSE MATTERS.ONLY METALLICA!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI THINK THAT THIS IS A LOVE SONG.YOU CAN INTERPRETE IT THE WAY YOU WANT.BUT I THINK THAT THEY WROTE IT THINKING IN THE BAND.THEY ARE ALWAYS ON THE ROAD,FAR AWAY FROM HOME,PEOPLE SAY THINGS ABOUT THEM.BUT METALLICA STAY UNITED TRUSTING IN THEMSELVES!!!\r\nAND DON'T WANT TO LISTEN ANYONE.NOTHING ELSE MATTERS.ONLY METALLICA!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\npdf1976..... could you fix your caps lock key?\n\r\nAnyway...\n\r\nI've been thinking about using this as a wedding song myself after I read about the other people here whom have done that. Interesting idea..... I wonder what my gf would think about that.....\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nI can't listen to this song now. It reminds me of a friend who turned out to be a horrible manipulative excuse for a human being.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nאני עדיין חושב שג'יימס כוסי.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nאני עדיין חושב שג'יימס כוסי.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nthis song reminds me of Come As You Are by Nirvana, with the whole theme of just being yourself, and being loved for it. its an amazing song, and the best metallica song ive heard yet!!\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nI don't think this song is about his gf or the fans what i think is he realizes that no matter how far you think death seems it can strike you at any moment (so close no matter how far), and u should live your life w/o worrying about what people think b/c it's your life and we should live it the way we want because we're all going to die anyway so why not live everyday the way u want.  \n\r\nand that solo at the end gives me chills everytime i hear it.  Just Great!\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nthis song is so freakin deep dat it feels like i'm taking drugs listening to it..................................................\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nThe live version in S&M is awesome, better than the original one.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nI always thought this could be a fantastic song for a high school graduation.  Think about it:\n\r\n\"So close no matter how far \r\ncouldn't be much more from the heart \r\nforever trusting who we are \r\nand nothing else matters \n\r\nnever opened myself this way \r\nlife is ours, we live it our way \r\nall these words I don't just say \r\nand nothing else matters \n\r\ntrust I seek and I find in you \r\nevery day for us something new \r\nopen mind for a different view \r\nand nothing else matters\"\n\r\nThose lyrics lend themselves very well to a graduation song.  I wish it could have been my class' song instead of the garbage they elected to use instead. \t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nJames wrote it first for a girlfriend, but later more dedicated it to all of this fans, friends and family.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nthis song was about\r\nBand members James Hetfield, Lars Ulrich, and Kirk Hammett wrote this. According to James, he wrote the song about a girlfriend he once had, but when he looks back at it, he can't remember why he wrote it. Now, Metallica just considers it a song about their fans, because nothing else matters but their fans.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nI still say this,fade to black and no leaf clover are the Best METALLICA SONGS ON THE PlANET\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nwell, since im a lazy fool i only read the first page, so dont call me a retard if this was mentioned 100 times already... but the chorus \"so close, no matter how far, couldnt be much more from the start, forever trust in who we are, and nothing else matters\" were the last words james's grandfather spoke. and on a different note, i, myself have never cried to a song, but dont criticize people if they have. first of all u call them a homo, but hey they might be a chick, and they are more sensative than guys (no offense ladys). second of all songs can hace lyrics that personally touch some people, rather they realize it is a great and deep song, or the lyrics speak to them personally like a loss in the family or whatever. oh. and dont criticize my judgement im only 14.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\noh. and yes i know i screwed up the lyrics... not from the start its from the heart\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nThis song is fucking excellent it was the first Metallica song I ever heard and it is my favourite of all time. This song was written for the fans although I heard somewhere too that it was written about James' ex\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nThis song symbolizes friendship to me.  Trust i seek and i find in you, everyday for something new, open mind for a different view, and nothing else matters. Friendship and trust is the only important thing i think. It was originally a love song. But you should never care about other thoughts or actions, only the people you care about like friends and family. Spiritual song.  Amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nooooookkkk..... but the chorus wss  james's grandfather's last words\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nI find this song to be entirely addicting and haunting at the same time. What strikes me as odd is that I can think of this song as haunting when it's actually a love song, but I think this is because the love he sings about sounds so intense, so real, and so coveted that it's hard not to feel scared by it, yet comforted at the same time... amazing song\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\ni just found an acoustic version of this song at radioblogclub.com ( ita all free, you dont download it, you just listen to it) anyway i have listened to it 10 times in a row!! its still on at this moment! It is not live either. its a recording. does anyone know where i can find this??\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nI recon its about two close people in a relationship together (close in spirit even if not geographically: \"so close no matter how far\"), just travelling through life hand in hand and taking everyday as it comes \"every day for us something new\", making decisions together instead of arguing \"open mind for a different view\", and he doesnt care if people critisize them \"never cared for what they say...\". \r\nthe only line i dont understand is 'Couldn't be much more from the heart' \n\r\nit's a great, really passionate song.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nBTW i only read about one and a half pages of posts, so that mite have been said already\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nOk before my opinion i must confess that i didnt read all 125 posts so i might have a duplicated opinion. \n\r\nThis song kinda reminds of the movie 'A walk to remember'. it's like a cool guy dating a loserish girl but being so into it that he doesnt care what others say or think. just my opinion. \n\r\nBTW, this song is 20 times better after hearing all of you guys' opinions.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nand neither I didn't read all the posts..\n\r\nwhen I saw this music video few years ago, i just couldn't get it out of my head.. and from this song I became a metallica fan.. this is also the first song I learned to play with my guitar so this is really important to me.. this has so unbeliveable good lyrics and guitar parts you just never get bored to it, and the solo is so damn brilliantly made..\n\r\nwhat JAMES IV said few previous pages, that he wanted this to be played on his graduation, well it's played for us.. and I'm very glad for that.. and it really is good for wedding too, but it feels disturbing if you are walking in the altar with woman you love and in the backgroung comes the voice of hetfield.. it just doesn't feel right...... and nothing else matters\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nThis is one of the best metallica songs ever. Prolly my favorite. its mine and my x boyfriends song and he would sing it to me all the time so when we broke up this was the song i listened to all the time. we even deiced that it would be our wedding song when we got married It makes me cry and the S&M version is 100 times better then the black album version\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nlove song?  \n\r\nno.  this song is about a person or person's who care not what the \"in-crowd\" is up to.  kinda like a high school mentality song.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nThis song is amazing. If i'm ever depressed or down, i flick this song on and it reminds me of what i do have and cheers me up :D\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI really canâ\u0080\u0099t overstate how bad this band are. They deserve a whole rant to themselves but Iâ\u0080\u0099ll keep it brief. In the late eighties they are said to have rescued metal from the hair-metal bands but it isnâ\u0080\u0099t true. They played fast and hard. So what? Iron Maiden did that ten years earlier and the progsters, LedZeps and Sabbaths of this world were already doing it too. Oh it was because they wore black a lot. I see. Hey look! Itâ\u0080\u0099s the nineties and Metallica are playing ballads â\u0080\u0093 with orchestras! Isnâ\u0080\u0099t that the kind of rockâ\u0080\u0099nâ\u0080\u0099roll pomposity they originally railed against with their pared-down hard and fast sound to begin with? Oh itâ\u0080\u0099s because they wear black a lot. I see. They sure have a lot of hair donâ\u0080\u0099t they? Kind of feathery too? Whats this now? Metallica donâ\u0080\u0099t like us ignoring their music for free off the internet? Bummer. Odd though. I remember when their bootlegs were the top selling records around. Nice marketing that. I wonder if it helped you sell a million or so records when you got a proper deal with international distribution? Oh whats that? Youâ\u0080\u0099re backpedalling now? You donâ\u0080\u0099t mind people downloading for a price? Fair enough. You are so rockâ\u0080\u0099nâ\u0080\u0099roll man!\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nGREAT SONG !\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nYa know I'm not a big Metallica fan either, though this is me and my boyfriends song.  Anyways, this song to me means that basically that person he is talking about is the only thing that matters in his life. (Hence the title) But yeah, the part where he says \r\nnever cared for what they say\r\nnever cared for games they play\r\nnever cared for what they do\r\nnever cared for what they know\r\nand I know\n\r\nIs basically talking about how it doesnt matter what other people think or do or say or anything for that matter. Just that he loves her and....well nothing else matters lol\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nI think it's a beautiful song. The line, \"Couldn't be much more form the heart,\" just gets to me everytime I hear it.\n\r\nBut wait a second, No one Important, is that cool for me to say that? I'm a girlso does that mean it's all good? You're a tosser mate. Get over yourself. Did you cry when you heard it, felt like a dickhead for it, and so labelled yourself a homo? That's my interpretation, deal with it.\n\r\nLove the song, love 'Tallica, love Kirk Hammett!\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nhey hilly 2005  you piece of shit\r\nfirst of all metallica and iron maiden started around the same time in the late seventies dumbass.\r\nled zeppelin is awesome but theyre not metal. black sabbath started metal. the reason metallica was so cool in the eighties is because back then they, along with bands like slayer and anthrax, started what is now known as thrash and speed metal. yes the whole napster and all this shit is stupid and every album after the black album sucked, but from now on if yuo wanna dis a great band get your facts straight dumbass\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nI find this song very comforting. I feel so peaceful every time I hear it. \n\r\nI think this song is basically anbout trust: trusting in loved-ones, believing in the future and about self-confidence.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nthis is mine and my bfs \"song\" ^_^\n\r\nthis song is just so great... metallica is great and this is my fave, besides unforgiven\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nNo doubt it's a love song, but it also suggests some very important facts about how to go about taking life. \"Forever trusting who we are\" - trust yourself, believe in yourself. \"Life is ours we live it our way\" - It's your life, here you can relate to Pink Floyd lyrics \"Look around, choose your own ground - Breathe\". \"Open mind for a different view\" - I think this is a crucial line. It talks about stepping into the shoes of someone else and viewing any situation from that someone else's perspective, which radically changes our viewpoint and, if anything bothers you, like work related stress, brings you right down to earth when you think of lesser fortunate people, who might probably toil for the rest of their lives, and could never be able to, forget writing comments, even listening to Metallica. It also talks about not to worry about what others think or do to bring you down. It asks you to shun your detractos, more like \"Dont care what people say, just follow your own way - Return to Innocense\". I am grateful if you have come upto here. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nit sounds more like a self-belief/trust song. but if you think its a love song, then its a great love song. its simple and realistic with no annoying lost laments, no crap proposal lines, and none of the 'oh baby' at the end of every line bullshit.\n\r\nGreat song by a great band\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\ndefinatly my fav metallica song\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\ndefinatly my fav metallica song\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nThat b*tchass Lucie Silvas tried to cover the best Metallica song ever! She sucks!\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nThis song is literally my favourite song. i listen to it at least ten times a day at first i was trying not to listen to it a lot cause i thought id get sick of it but i can't.it is the most meaningful love song written. its the best song for me to get my mind off of anything thats wrong and to just think about my girlfriend. she is the most important thing in my life and always will be. hey and anyone who gets their emotions out from this song is obviously a good person. they know how to love and to show how they feel about anything that matters to them. and admitting it (even if it is anonymous) is a great thing to do. i almost cry to it everytime i listen to it because i just dont want the only thing that really matters in my life to leave. i need her forever and that will never change. love is the greatest feeling in the world and i feel sad for anyone who has never felt love. I Love You Sarah and Nothing Else Matters!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nI think this song is more about closing to death and that's the only thing that matters to him.  I really dont think this song has anything to do with love or breakup!!!\n\r\nnever cared for what they say\r\nnever cared for games they play\r\nnever cared for what they do\r\nnever cared for what they know\r\nand I know\r\n( this verse means he doesnt care about what people do in life anymore, if it's about love or breakup it wouldnt make any scene at all...)\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nit seems like it's a love song to me now somehow\r\nthen it sucks...\r\nmetal ballad love song???!!! I've never seen anything like this before!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nif this song is really about Love...its like the  song No Matter What sung by Boyzone...God how gay!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nGranted it may be how's james is feeling about his woman,,, but you have lend creedance to the fact that he never mentioned the following words,,,,\" miss you, love you. lonely, your the only one, etc,,,,,\", the point is , that he wrote was he was feeling not just about his woman, but also about other issues, and that nothing else matters. i just finished watching the icon show on them and i am so hooked as a metallica fan now, i like them ,, but i now i love them their stuff , not to mention i used to play in a band in the 70's, and believe me, if i could only turn the clock back, still play though, just recorded this song on my home recording studio,,,, really easy song to play on guitar by the way,,,,, let me know if you need any help with it, hugs Lee\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nOne of my fav. song of all time. James is an amazing song writer and his solo at the end is quite amazing as well, i wish i could play it.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nthis song is awesome i just listend to it about 10 times in a row its one of them song that i just get a wierd cold chill all up and down my spine its a masterpiece \n\r\nim going to have this and \"All Apologies\" by NIRVANA played at my funeral \n\r\nkick ass song\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nThis is my favorite Metallica song! To me, it's about finding love & not caring what anyone else thinks about it. Just being together is enough. I'm going to play it at my wedding, it's our song & NOTHING ELSE MATTERS! =)\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\namazing song!\r\none of my favorites by Metallica, I agree this song is about love, true love that you really cant explain...true love where its the two of you against the world...what other people think and say doesn't even effect your relationship b/c its just strong\n\r\nthe important thing about love is following your heart and being truthful, other than that nothing else matters.....\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nI think that this song is probably about love, but not the love that people on here are saying. It seems to me that the band is talking about a love for the music they play. \"Couldn't be much more from the heart\"- That's the way many people feel about music's message. Also, the music video is all about putting together their music. Just another thought to fuel the fire.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nit is an awesome Love song. Like someone else said and \"it never even mentions Love\" but it is so totally written from the heart one knows it's a Love song.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nIm big Metallica Fan, and I think this is the best song that hetfield had written. Damn I love this song, it just make me remind me someone very special to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nw o w.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nThis song is by far my favorite Metallica song.  I don't have many of their songs (I only have the Black Album), but I don't think this will change.  Everytime I listen to this, I think of my girlfriend (who I love so much).  She lives far away from me, and I don't get to see her very often, but everytime I here this song, I can see her face vividly.  I always imagine us dancing under a star-lit sky with no one around for miles, and just looking into each other's eyes.  Sorry bout the mooshy stuff....just this song is so special to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nhey i know that last kid!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nWas watchin mtv icon and they interviewed the band...and the lead singer said that the meaning \"nothing else matters\" is just basically the motions he goes through being away from his girl/wife while on tour and how its hard blah blah long distance ya that thing...\"So close no matter how far\" like this quote.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nWhenever I listen to this song I feel sad, \r\nI love this song and I know it's a love song but it's a cool love song that makes you feel.. alone..\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nthis was the first song i ever heard from metallica and i totally fell for them after. they are such an amazing band adn i think its awsum how one moment thyre doing a hard rock song and the next thy play this and it totally worls. Rock On!! \r\nxoxoxo\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nFor me this is a love song, and one of the best, 'cause as it was mentioned, James doesn't include the word love, but it's so clear that it's about love. but i think it may also be a relationship that is not well acepted socially, for some reason, and he's saying that he simply doesn't care. \r\nI adore this song. It's simply beautiful, and goes right to the heart.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nThink it's about not letting anything get in your way or bring you down. \n\r\n\"Trust I seek and I find in you\r\nevery day for us something new\r\nopen mind for a different view\r\nand nothing else matters\"\n\r\nThink that line is about believing in yourself, and facing every new challenge, with a smile on your face. Keep your head up and strong, And Nothing Else Matters.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nONe of the best Metallica songs, if not the best. I'm not even really a fan of the band, but this is easily one of my favorite songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nRock standards: pretty good\r\nMetal standards: snoozefest\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nthis isnt a metal song. but its still good!\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nThe most moving song ive ever heard. Was played when dad was carried from the chapel after a truck crash. Only takes a few seconds of the song to have me tearing up.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nAs mentioned..its officially written to one of James' past girlfriends, who broke up with him years before he wrote the lyrics, so i guess he really loved her, he has also said \"girlfriends come and go, but the song still means the same but for other people\" .. so its about being away from the one you really love , but it probably means something else to various people, depends on what you thought about the first time you listens to it, there you have it..\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nand sabbracaddbra, cant imagine what you felt like after your gf's passing, you're probably partly over it, but i just wanna show my respect to you, im deeply sorry, i really am\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nThis was the very first metallica song that i listened to, which got me interested in the band.\n\r\nThis song was written by James about one of his girlfriends that he had. I interpret the verse: \"So close, no matter how far, couldn't be much more from the heart\" as saying that because James was so far away from her due to tours and band comitments, he was still close to her because he had her in his heart.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nAnyone who really appreciates this song should check out the cover versions done by the following:\n\r\nApocalyptica - nothing else matters\r\nLucie Silvas - nothing else matters\r\nMarco Masini - E chi se ne frega\n\r\nThese are all fantastic!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nThis song is awesome. Very powerful. I'm going to be honest, I didn't hear this song untill Saturday. When I was at Download Festival '06. (For those of you who don't know, it's one of the biggest rock festivals held at Donnington Park in the UK formerly known as Monsters of Rock) They played it near the end of them playing. But it was great, and the emotion behind it was very powerful. I agree that it's a love song, and how they feel so strongly about their significant other, that \"nothing else matters\" But, I like it how people take songs and interpret them their own way to fit themselves. I mean, yeah artists might write lyrics and have their meaning. But every song I think is meant to be interpreted in your own way. =]\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nHave a listen to these songs\r\nApocalyptica - nothing else matters\r\nLucie Silvas - nothing else matters\r\nMarco Masini - E chi se ne frega\r\nthere awsome\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nSome artists intentionally keep the true meaning of their works secret, so that people may read into them as they please...like Henry David Thoreau.\r\nWell, Metallica didn't...as far as I remember, a member died, yes? Well, this was their tribute to him after that tradgic bus accident.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nChanged my mind since my commment; I'm a huge fan of Metallica. This is a great song, but Ride The Lightening and Master of Puppets are both just as good.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nwell im gonna be honest,the first time i heard this song i thought it was kind of..... eh...... strange shall i say as i was used to the old metallica songs ie (master of puppets,ride the lightning)but now this song is one of my faviorate it just all of a sudden touched me and i started thinking deeper within myself trying to find what this song might mean to me.But in actual fact to me it means what ever mood you are in its gonna make you feel better and what it also says is to everyone is to be urself dont change for anybody keep going the way u are.\n\r\nPS. God how in the hell did metallica get so shit and pathetic now have u heard the new song u can find it on ultimate-guitar.com go to news and type (metallica new song berlin) its utter shit none the less.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\ngosh i love this song so much ..... one of my fav songs\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nsongs like this should be considered as holy songs,man...\r\none of the best songs ever\r\none of the most beautiful songsever\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nPersonally this is one of my favorite songs. I love Metallica they're one of the greatest bands ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nthis song is mine and probably over a million other people's favorite song. i spose it means different things to different people and affects us deeply but differently to. the s&m version of it is absoultly beautiful and i cry wenever i hear it. its such an emotionally powerfull if not the most emotionally powerfull song ive ever heard and it's a song that will forever stay with me till i die, not be 'just a song' coz with it it carrys memories and ill never forget them\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nNothing matters except to whom this song was written.\n\r\nHis girlfriend, huh? I wish I could write a love song so elegant as this for my Kayci...\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nmy boyfriend moved away recently, so now this is even more \"our song\" than before... i cry everytime i hear it\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nunbelievable song, it's good to kind of unwind and have a slower song that still has the great lyrics and elements of music that only metallica can bring.\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nOk, this song was written by Jaymz well he was on tour. He wrote it over the phone with one of his x-girlfriends. It took him about 10 minutes to write. Definitly one of the 'Tallica boys best tunes...Never seen anyone write any better lyrics than Hetfield.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nThis song makes me think about my friends, no matter what I'm doing or where I am, I will be there for them and nothing really else matters but them.\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\ni personally dont think there is much of any meaning left in this song.  i believe it is more like the meaning you find is the meaning that is right kinda thing. no matter what the meaning is. like one of the songs that like fit into everything.  in fact i could prolly fit this song in one sentense with my turkey sandwhich.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nthe frist line of this song is possibly the most powerfull line ever. \"so close no matter how far\".\r\ni had 2 mates they where brother and sister. meet  them for when i was 11. i'm now MUCH older. that line to me sums us up. long story short, there was a falling out and now i've lost a mate, but i know that no matter who far apart we look, how much shit has happened if i needed them, they would be there. Its been over a year since we spoke last, but they know i love them and i'll do any thing for them, and nothing else matters.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nFor me, this song touches my heart. :-) It gives me the chills everytime. Best love song ever, imho.\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nthis is metallica's best song...\r\nI am a huge metallica song.. it reminds me of my girlfriend and how i luv her..it is like to sing it to her\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nmetallica sed it themselves on classic albums - the black album, its about how when they go ou on tour, they leave their loved ones behind, and no matter how far away they go, they always stay true to that/those people/persons, if you have not seen this dvd, i suggest u do\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nWell.. I know that James wrote this song while he was talking whit his girlfriend(at that time) on the phone when he was on tour. that is why the chords are so easy. So i think this song is a song for her. That he miss her and so on. \n\r\nNo song means so much for me as this song.. just... love it..\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nHetfield wrote this initially to a girlfriend he once had but now he cannot remember why\r\nHe considered it a very personal song and was not going to publish it, but once lead guitarist Kirk Hammett heard it he wanted it on the Black Album. Now Metallica consider it a song dedicated to all their fans. It has become a staple of their live performances.\nen.wikipedia.org/wiki/… go to there and look at it for urself\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nok. forget my previous note about it being my boyfriend and mine's song, we broke up, but i still love this song...\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\ni have always thought \"nothing else matters\" was dedicated to cliff burton....... isn't it???\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\npara1= about how truthful and close freinds and loved ones are to each other because they can be themselves to them.\r\npara2= how you can be yourself to your freinds and loved ones and how they dont keep promises they wont keep.\r\npara3= how much you trust your freinds and loved ones and how varied they make your life each day.\r\nchorus= how what other people think of you dont matter because they dont know you like the people that matter to you and so there judgements are false.\n\r\nthis could be for Cliff burton like metallijim said, did you know that Cliff died becauses he was in a bunkbed in a crash when the band coach went off a cliff- Cliff and james hetfeild fliped a coin on who would take that bunk-Cliff won...\n\r\nIts about how much those close to you really feel about each other, about the people that really wont let you down for nothing.\n\r\nI know a lot of people have this song cause it meant so much to them in times of need, I came out as gay recently, and the amount of crap i went through  in my school was truly horrid, i told my parents- they thought i was not gay because i listen to Iron Maiden and Led zeppelin and not fucking retarted pop and rnb shit (no offense), then they said they think its sick. my \"freinds\" who i now dont talk to where all using me as a fucking verbal punching bag, i did not know what to do. the only person i could really trust and really be freinds with was bisexual so everyone automatically thinks we are a couple so i got a lot more crap. I then listened to this song and realised hot much this person meant to me in this world and how you should always be careful with who you are freinds with, now all the crap has gone, i have great bunch of freinds who accept me regardless of what i am. sorry if i wrote my life story- i wanted to get it out in some way.\n\r\nP.S= if you are a person who takes the piss out of a gay, lesbain or bisexual-et me tell you now from personal expeirience, your putting them through hell so dont do it unless your a dark twisted bastard who gets kicks out of peoples misery BECAUSE ITS NOT A CHOICE AND ITS NOT DIFFERENT FROM RACISM AND SEXISM. i pray you will see your errors\n\r\nso to all those who listen to this song- think about your loved ones and freinds, because love, caring, freindship and kindness are the most important thing in this world.... and nothing else matters\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nLOOOOOVE IT!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nThis Song Is So Layered..\r\nI Cant Understand It, But It Has A Personal Message To Me. \r\nI Know Is That It Makes Me Cry.\r\nI Know Its My Favourite Song Ever, Not Some Flavour Of The Month.\r\nI Know Its The Most Amazing Song Ive Ever Heard\r\nI Know Its Helped Me Through So Many Hard Times\r\nI Know That Ill Forever Love This Song =]\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nthis song is the bomb!\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nThis was the first song my b/f and I slow-danced to... so it's our song... if you think of it that way... I have thought over it's meaning, and I think that it could mean tons of things....\n\r\n--love for a relative\r\n--love for a certain specail someone\r\n--a simple reminder of \"Hey, I love you, I found where my heart lies, even if my body is far away...I want you to keep that in mind and never forget it...I think about you everyday...I can't stop, for if I did, I would feel odd or out of place...\"\r\n--or it could be as Ancient Lorcado said... he is speaking to his love and wanting to rebel against the rest of ther world with her....\n\r\nand just like every one else, I have to agree,  no one important, you need to learn some fucking manners, This song is important to anyone who has a heart... If you don't like what someone else has to fucking say, or how they fucking feel, then my suggestion for you is keep your fucking mouth shut... or else...\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nand to hell_i_call_my_head, I know exactly what it's like to cry to this song... every fucking time, man, every fucking time... I cry when I listen to it... it's just so god damn beautiful... so don't feel upset at that moron, for he is a fucking moron, and he will always be a fucking moron...\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nand as for Psychogirl14, I only have to say, Metallica IS the best band in the world... and don't forget that...\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nHey, uh, crossed guns, I'm not bi-, gay, or les-, but I have a friend who is, well, two actually, and I know how much shit they get for it, and I have aways been there for them, and they know that, so if you ever need a friend, I am always there...\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nHi mates,\r\nI'm trying to understand the following CAP parts. Please share your opinion.\n\r\n1-\r\nNever cared for what they know\r\nBUT I KNOW\n\r\nDoes he mean \"EXCEPT FOR WHAT I KNOW\"?\r\nOR just\r\n\"BUT I KNOW... (linking)... So close no matter how far...\" ?\n\r\n2-\r\nNever cared for what they know\r\nAND I KNOW\n\r\nDeos he mean \"I DON'T EVEN CARE WHAT I KNOW, EITHER\" ?\r\nOR just \r\n\"AND I KNOW... (linking)... So close no matter how far...\" ?\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nno more words about this song!!!!!!!!!!!!!!!!!!!!!!!!!AMAZING\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nnothing else matters....\n\r\nwhat more of a \"meaning\" do you need than that?\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nI LOVE THIS SONG! it is amazing, I am having it played at my wedding^^\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nHi PrEsLeYsBiGsIsTa . If you relate to my comment above, I am translating this song into Turkish so i need to get the meaning correctly. \"The Meaning\" matters to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nthis song is amazing, the lyrics are some of the best ive eva heard, and the tune defo matches up perfectly, wow, theres a meaninglful message in evry verse, most songs just have a few lines that good, if that\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nme and sam \t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nA few years ago I asked my friend if he liked Metallica and he said no because they were too hard for him and he wasnt really into metal, so i played this song for him.  After that he gave Metallica a chance and started listening to some of their stuff.  Guess what one of his favorite bands is now..\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nWow. quite a discussion.\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nI'd say that \"but I know\" means I don't care what \"they\" think but I care what \"you\" think.  \"And\" means the same thing.  It's just variation for variety's sake.\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nThanks Letmein for your attempt to reply. If anybody else wants to add their opinion, I'm looking forward to hear it.\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nThis song does remind me of Pink Floyd in the beginning anna118k.  I was in the car one day (I'm a huge Pink Floyd fan, I can tell you all the songs in order off of every album. Seeing Roger Waters in concert this June too!! :D) and I heard this song, and my cousin asked if I like d this Pink Floyd song, and I was like no I hate Metallica and then I heard there voice and I was like what the f!! Anyways, I don't like Metallica that much, but I do like this one song. My favourite line is \"life is ours, we live it our way\". I was having a shitty day and I just heard this song on my computer and I was like, that is so true. So my friend was criticizing me one day (ex-friend I might add),  and in a cheesy way I said that to her. And she just shut up. Then she said sorry after. Try it! Anyways, I don't think its a love song. Its a life song, about your relationship with who you are. About finding comfort in who you are. \"forever trusting who we are and nothing else matters\". Basically, thats all that matters, is trusting and accepting your true self.\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\ncool song\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nnice song... not many metallica songs are like that\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nthis totally is a break-up song. if he was my boyfriend i'd think he wants to dump or that he thinks i'm going to dump him. look at the lyrics:\n\r\nSo close no matter how far - even though he dumps me, our beautiful loving memories will always be close to our hearts.\n\r\ncouldn't be much more from the heart - he is sincere, clean\n\r\nforever trusting who we are\r\nand nothing else matters - even though we're worlds apart, we must not lose faith in our entity, because it's the only thing that matters\n\r\nnever opened myself this way - you're the only one i've dumped in thi nice way.\n\r\nlife is ours, we live it our way - we can live however we want, so we are free to separate anytime i want.\n\r\nall these words I don't just say\r\nand nothing else matters - nothing else matters but what i say.\n\r\ntrust I seek and I find in you - this means that we can have sex AND I  slam shut the door behind me, because you'll feel comfortable with it.\n\r\nevery day for us something new - our sexual experience is so diverse and will hold un till death.\n\r\nopen mind for a different view\r\nand nothing else matters - i will never never judge you if you change your sexual orientation, because it's your entity.OR you'll have to get used to the fact that you don't any longer have your rockstar boyfriend\n\r\nnever cared for what they do\r\nnever cared for what they know\r\nbut I know - it's not their bussines that other couples live forever.\n\r\nso close no matter how far\r\ncouldn't be much more from the heart\r\nforever trusting who we are\r\nand nothing else matters\n\r\nnever cared for what they do\r\nnever cared for what they know\r\nbut I know\n\r\nnever opened myself this way\r\nlife is ours, we live it our way\r\nall these words I don't just say\n\r\ntrust I seek and I find in you\r\nevery day for us something new\r\nopen mind for a different view\r\nand nothing else matters--------and now it repeats---\n\r\nnever cared for what they say\r\nnever cared for games they play\r\nnever cared for what they do\r\nnever cared for what they know\r\nand I know\r\nYE-YEAH!!! - i am going to drown myself in a pond of absinthe, and nothing else matters.\n\r\nso close no matter how far\r\ncouldn't be much more from the heart\r\nforever trusting who we are\r\nno nothing else matters --- after he dies, he will always sing this song, because hell is boring.\n\r\nyou may not see the simbols that i see, but if you open your mind a bit, you will be able to appreciate this sons at it's full value, my inner eye is here to enlighten you\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nthis song always makes me so calm and mellow and lets me think all about the things I \"didn't have the time to\" before.\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nIt's some times easy to say \"I love this song\" or \"this is the most awesome song I've ever heard\". But seriously, when it comes to Nothing Else Matters, both the music and the lyrics touch - ever so sensibly - that innermost of feelings: being close to someone in that special way. Not being forced to behave or say anything but what we feel. To be totally relaxed within the love. To KNOW that you have it. Even without words.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nmetallica fucking rocks!\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nSuch a great song... And I must say to \"No One Important\" ... You're insensitive and you don't really understand anything...\n\r\nThis song makes me think about love, but also about life... For ex. when he says \"Never cared for what they do\" or \"Never cared for what they say\", to me he says that you must not listen to fools that judge you... And I love the line \"Life is ours, we live it our way\" ... Really beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\ni think its about helping people\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nThis was my dad and step moms wedding song.\n\r\nI think its about how newlyweds find joy in everything and the only thing they really care about at that point is each other. Beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nI love this song so much.  I think it means opening up, saying what is on you mind and not caring what anyone thinks of what you said.\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nTo me it sounds like having a long distance relationship but he has to hold on be he loves her so much. \"So close no matter how far\"\r\nAnd he talks of how he will take criticisim for it and not care what others think.\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nYeah, it definitely sounds like a love song....and actually, I think this would be a really good wedding song...\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\ni really don't think this is that great of a love song lyrically, but the instrumentals are superb, there's so much subtle guitar work that just really shows how masterful Metallica was/probably still could be in their music\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\ni really don't think this is that great of a love song lyrically, but the instrumentals are superb, there's so much subtle guitar work that just really shows how masterful Metallica was/probably still could be in their music\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nExcelent song, the bass doodle under the clean solo is genious bass playing and the heavy solo is perfect.  Classic Metallica style of soft to heavy.  As for the meaning i can see how james originally wrote it for a girlfriend...growing up he had to be as hard as a rock and not open himself or else he'd get hurt.  whatever the meaning its one of my favorite Metallica song.\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nI personally don't think it has anything to do with any relationships or love. This song for me has always been about excepting ones self, \"hey be yourself, don't change yourself for anyone or anything, and if you can do that, you are already doing good in life\"\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nThis song reminds me of Christians' walk with GOD.  We trust who we are in Christ and our faith in Him.  \"Trust I seek and I find in YOU\" - we find trust in Jesus.  Nothing else matters than Him and \"never care for what they do...\" - don't care about the world and what they think.\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nI think it is about song writing and it is about his guitar personally watch the video. just reread the quothe from the song thinking baout him and his guitar that would explain the \"we\" he writes from the heart, trying to write songs he has a part but is missing apart which is how he is close and far\n\r\n\"so close no matter how far\r\ncouldn't be much more from the heart\r\nforever trusting who we are\r\nand nothing else matters\"\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nOne of Metallicas best songs. This song to me is about friendships/relationships. \"Trust I seek and I find in you\" is clearly to your best friend or girlfriend. I fuckin love this song and could listen to it over and over again and find new meanings and feelings about it. Metallica is the shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nI'm 37.  My wife's 40.  My wife and I have been living apart for seven years.  We have a fairly unorthodox working relationship.  In the past two weeks we've decided to start putting it back together for all the reason that pulled us apart.  We initally got married because of what we thought we 'had' to do.  Society's rules.  This song to me is about going against the grain and doing what you feel you need to.  We have decided to move back in together despite what other people think about our relationship, 'unorthodox' or not.  Fuck you, my life, my rules...  I could give a shit less whether you like it or not.  This song perfectly describes our relationship.  \n\r\nforever trusting who we are\r\nand nothing else matters\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nEveryone knows that the Black Album was considered to be Metallica's \"sell out\" album... I am quick to disagree. They just became more accessable! And what's wrong with that? Nothing. They became much more simplistic, and even though I am a huge fan of heavy music, I love this song more than any other Metallica song I've ever heard, and I've heard the majority of them.\n\r\nI can certainly see how James was writing about missing his girlfriend, but some lines to me just don't quite.. \"go\", ya know? They just seem a bit random or unrelated... maybe its just me, maybe you had to be James to understand every single line. A great song, and NOTHING ELSE MATTERS to me, sell out or not\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nThey played this song at my friends funeral last week and it completely made me crack, i've never felt more emotion in a song before, even after hearing forever young (worst funeral song.)\n\r\nTo me this sounds like one of those I don't give a fuck what people think, i'll live my life how I want. My mate was real into the drugs, dying of an overdose at 15, and I think this was his way of being like I took drugs, I died, it was my decision and i dont care what you think about it. I think its got to do with the whole life is what you make it like \"every day for us something new\" and \"life is ours we live it our way\"\n\r\nI can't really see it being about love, but yeh.\r\nR.I.P CODY\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nI think this song is trying to say worry about yourself no matter what others say or think.\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nNever opened my self this way, life is ours we live it our way. The portion that talks about \"opening\" one self up to another leads me to think the song is refering to relationships.\r\n  Oddly this song relates to my feeling for my husband AND to my kids. We definitely live our life in an unorthodox way. This single song says it all ! I've loved it since high school.\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nI'm not sure which DVD it was exactly but James and Lars tell the story about how James wrote this song for a girlfriend and never even wanted it to be on a Metallica record.\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nBeautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nThis is by far the best Metallica song!  means alot to me as it was my uncles funeral song! he had a funeral to be proud of guns and roses - dont cry on the way in and metallica - nothing else matters on the way out! this song is f**king amazing!!\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nI think this is about a relationship he had with someone; if not a personal experience it's definately about a relationship.\n\r\nTo me, it describes a friendship I have with someone I know, which is good because it's an awesome song :D\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nI think the song is about a relationship he had with his wife during the recording of the Black album. This song has a meaning to me because I only get to c my girlfriend that I love so much only once or twice a week but when we do see eachother it's like we're alone when there are dozens of people around. I used to hate this song beacause i didn't understand it but last night me and my girlfriend were dancing to it on my waterbed and then i started to cry because i was so happy to have a girlfriend that would love me for me\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nThis is their best song ever! I love this song! I have listened to it so many times, but sometimes I still cry at the beginning! The lyrics are so deep! \n\r\nI sometimes consider it as a love song, but I like thinking of it as for the fans! \t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nThis was the song I broke up with my ex fiance to. Other than that it's my FAVORITE Metallica song, and there is nothing that can take its place. James wrote it for a girlfriend that he'd once had, and just how it was great, but in the end it just wouldn't work. Sometimes, I feel like this song was written just for me because I'm manic depressive, and just when I think I'm going to be happy, something happens and I become depressed beyond all human understanding. \"So close, no matter how far.\"\r\nMy current Myspace name is \"And Nothing Else Matters\". I've always used this song as a reference to my life. I cry every time I hear it.\n\r\nhit me up to talk about Metallica!\nmyspace.com/…\n\n\n", "comment_266": "\nlove song, this ones easy\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nI will never forget the first day I heard this song... I still love it to this day <3\n\r\nMETALLICA forever!\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nI saw Metallica in Sheffield on Saturday with my Brother and best mate. I had my phone nicked before they came on but it didnt ruin the night. It was an awesome awesome gig and when they did this i had shivers down my spine and do whenever i hear it now. We were near the front, my brother got a plectrum and they ended with seek and destroy woth all the house lights on. So good it was untrue. \t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\n   From the sentence \"never opened myself this way\"\r\n    What does \"this way\" refer to?\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nthe meaning of this song is...dont give up on your hopes and dreams (nothing else matters)\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nThis is another fantastic showing of why metallica is the worlds best metal/rock band ever. And how James is a lyrical genius. I think he is the greatest song writter ever! This song is so powerfull! I love it. Easly the best metallica song ever and probably the best song ever \t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nAmazing work. Metallica is Metallica, after all\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nWOW\r\nthats all u can say about this song - have u heard the version with the san franssico orchestra - absolutely stunning\r\nits just well well rounded song  - WOW\r\na beautiful love song\n\r\nso close no matter how far indeed\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nHaha i remember when i first heard this song, we were just smokin a blunt and drivin around and it played on the radio. After finding it was Metallica i've been hooked on metal ever since hahah and other music i listen too. Good song for sure though!\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nLove this song, one of my all time favourites . .I used to sing my girlfriend to sleep with this song, ahhh, memories:) Metallica forever. . .\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nque significa chinga? Anyway, when they were writing the black album, as seen in \"a year and a half in the life of metallica\", bob rock mentioned that this was the song james had put the most time into. The finger picking style used in this song is unmatched by any other metallica song. You can tell this is really \"James' song\" because it's the only one I know of (owning every studio album) where he's the only one who plays a solo. I'm sure hardly anyone is paying attention to the drums on this one, but its one of the better lines lars has ever laid down as well. the alternation between snare and bass is awesome. This, orion, and to live is to die are the only three songs i listen to that provoke any emotion at all. \t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nthe S&M version is even 10x better than the original\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nA sweet piano rendition of this song, found on youtube.\n\r\nEnjoy\nyoutube.com/…\n\n\n", "comment_279": "\nThe Essence of our who we really are, TRUTH, is \"so close no matter how far.\"  Truth is the only thing that will never ever\r\nbetray you.  It will never hurt you.  Hence, \"forever trusting who we are.\"  When you get in touch with that, you \r\nknow with absolute conviction that \"nothing else matters.\"  Usually, some people who experience intense pains \r\nsuffering will reach a point where the pain is so bad that they open up in a new way (never opened myself this way) thus getting in touch with TRUTH.. and knowing, or more accurately, FEELING with absolute conviction that nothing else matters but that.        \n\n\n\n", "comment_280": "\npretty sure this song is about when a bunch of their instruments were stolen...\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nThis song is beautiful, def a love song \r\nlove the line 'trust I seek and I find in you' Perfect!!\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nThis song is brilliant, and reading through some of the comments and seeing how much it means to a lot of people, it's even better.\n\r\nWhen I was first listening to the song, I thought for a while that the S&M version was better because of the way James sings in it. But I have both on my iPod and now I love to just alternate between the two for ages, because while I listen to it I can just think through anything and figure things out. And it never loses its effect like most songs do when you listen to them lots of times in a row. Each version makes me feel a bit different to the other, but both are just incredible.\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nOne of the first Metallica songs I ever heard, and one of the only metal songs that goes straight to the heart. It means so much to me, and the meaning behind it I think is about a girl, but she left the protagonist and then he feels like nothing else matters in life because he doesn't have her. I know how that feels...\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nthis may sound morbid but i chose this song to be played at my funeral. the soft mellow rythem and sad lyrics makes it a song to be burried too.\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nME TOO!!! This song is awesome, i'm going to tell my kids(when i have kids)to play it at my funeral.\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nthis song is very moving..and it is a song that means alot to me..my dad has been incarcerated all my life and this is our song..so close no matter how far\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nGiven James story with his family I think this is something he is telling God.\n\r\nIn the part he says\"\r\n\"never cared for what they do\r\nnever cared for what they know\"\r\n[This can be the to the strict religious cult home he grew upin]\r\n\"but I know\" [This is like, but I know the REAL God kind of deal]\"\n\r\nAlso, the part that says \"trust I seek and I find in you\"\r\nresemble the Bible verse from Jeremiah 29:13 \"You will seek me and find me when you seek me with all your heart\"\n\r\nIt also matches the opening verse \"So close no matter how far\r\ncouldn't be much more from the HEART\"\n\r\nIt also fits << Matthew 7:7 >> \"Ask and it will be given to you; seek and you will find; knock and the door will be opened to you.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nWell this song is about being away from family and friends.\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nThis song will mean many different things to those who hear it, but we can probably all agree that it's beautiful. I am not a fan of metal, but this song (by a band I would never otherwise have listened to) is unbelieveably gorgeous. It's about being apart from someone you love, whether it be a significant other; a loving parent; a precious child; a trusted friend; etc. The person trusts the relationship s/he has with another, and trust is a precious, beautiful yet all-too-rare aspect of the human condition. GORGEOUS song. \t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\n:-clearly state of anarhism\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nThis is what I feel, I belive this song is to be honest to your self, to save your self to be what u fukin are not what others want you to be, to try to make, who hates you, anyways you gotta be renewed bro, one is life and it's yer life be what you are what you belive into!\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nLOVE IT!!!! MASTERPIECE!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nWhen I listen to this song it reminds me of how despite what anyone else says, thinks, or hears... If you know the truth and what is best for you, that is all that matters and nothing else matters. People are always trying to tell me what is best for me, that being college, uni, relationships, friends, what I should study. But then I realise its MY life and I chose what I do with it. \n\nNever opened myself this way\nLife is ours, we live it our way\nAll these words I don't just say\nAnd nothing else matters\n\nFor me this means...\nId'e never stood up for myself before and gone against parents word, Id'e not do things because of them, and thought for once in my life I'm putting myself first this time. I'm sick of them ruling my life and soon realised I shouldn't let them do it anymore, hence my actions. I will live my life my way. I'm not doing anything wrong I'm just not going with there opinion anymore. I'm old enough to make my own decisions. I'm growing up faster then they think.\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nOH MY GOD YOU IDIOTS! Everyone knows Nothing else matters is about james hetfield's parents going through cancer\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nA funny when i was on a road trip with my friend he showed me a extremely disturbing picture and threatened to snitch unless he played this song. I think many people misinterpret this song as about love. I think its friendship about maybe cliff even considering its about loss of someone and how they felt he was more important than anyone else in the world and did things they're own like no other band of the time(motley crue,poison,warrant,whitesnake anyone)\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nThe song is about James Hetfield love of heroin.\n\n>> So close no matter how far\nHe is always in its grasp, no mater how far away his next hit, due to ... addiction\n>>couldn't be much more from the heart\nHe is taking the blood from his veins into the syringe\n>>forever trusting who we are\nHe knows its the dragon and he trusts it's nature\n>>and nothing else matters\nNothing matters when you are smacked up\n\n\n>>never opened myself this way\nSticking the needle in opening up his veins\n>>trust I seek and I find in you\nWhen Life gets you down, time to score\n>>every day for us something new\n>>open mind for a different view\nThe mind bending experience of getting high gives you a different perspective on life\n>>and nothing else matters\nBecause, High\n\n>>never cared for what they do\n>>never cared for what they know\nOnce your high you stop caring..\n>>but I know\nBut have a deluded scene of your own knowledge\n\n>>life is ours, we live it our way\nYeah F**k you all Ill live how I want F** the consequences\n\n************************\nI am not shure If this is truly the nature of the song, but i have a theory that It fits most songs. Also It kind of fits the dark melody and heavy bace of the song. Rather than it just being an unfrequented or forbiden love song.\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nTo me this is a paeon to London - when I was living away from London and thought I would never get back there - these words gave me inspiration and still do because \"nothing else matters\".\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\nEveryone sees this song as if the narrator was talking to the person they love. What if the narrator is talking to us, the listeners ? \n\nSo close, no matter how far\nCouldn't be much more from the heart\n\n\nWherever you are in life, if its in a good place or not, stay close to your heart. Follow your instinct. Never lose yourself.\n\nForever trusting who we are\nAnd nothing else matters\n\nHere, he tells us to always have trust in ourselves no matter what. If you believe in yourself, nothing can bring you down. Therefore, nothing else matters.\n\nNever opened myself this way\nLife is ours, we live it our way\n\nWhen you start believing in yourself you open yourself to the world. It seems you can attain every goal you want to achieve.Life is YOURS and you live it YOUR WAY. Again, no one can tell you what to do or how to live.\n\nAll these words I donâ\u0080\u0099t just say\nAnd nothing else matters\n\nThe narrators tells you that he truly believes what he says. He doesn't just say it, he means it. Bellieve in him, because he believes in himself. That's an example of how believing in yourself can change the perception people have of you. And nothing else matters.\n\nTrust I seek and I find in you\nEvery day for us something new\n\nThe narrators wants you to know that he believes in you. That is a very important verse because if no one has ever told you that they have trust in you, that you can do it, he is there to remind you that you have the power in you to live life the way you want it. The trust is in you.\nEvery day for us something new = Life brings something new every day. It has its ups and downs. It's the same for everyone ! Don't let that bring you down. Life is an adventure.\n\nOpen mind for a different view\nAnd nothing else matters\n\nReference to what it said in the begining, now that you believe in yourself, you have opened up your mind, you have opened yourself to a new vision of life. And nothing else matters. \n\nNever cared for what they say\nNever cared for games they play\nNever cared for what they do\nNever cared for what they know \nAnd I know\n\nThis is a reminder not to listen to what people tell you, what they do, what they think of you. It's your life, live it your way. That's basically the meaning in the whole song.\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nI got my mate to listen to the whole black album and tell me what he thinks...\n\nHis view on the album as a whole is that it's about a kid growing up with some sort of disease (unforgiven), then being taken by the \"sandman\" (enter sandman), and as they said, into never never land (through the never), and the mother realizing what has happened the following morning and exclaiming how she should've treated him better (nothing else matters) and the worst part being that it was 100% true.\n\nThis is genuinely my mates opinion of the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nJames wrote this song while on phone with his girlfriend he said it in the interview\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nI'm not interested in being the devil's advocate and neither am I interested (at the moment) in participating in any forums. But I've been a fan of music for a long time (I'm 28) and I think that this song is about me. Check out (Australian fans) my comment on 'Luv Your Life' by Silverchair. I say in it that I think that I'm Jesus.\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\nMost people can relate to this song. It can be interpeted in many ways: Is it some you love. is it about friendship or a brother in Arm's. or is it about someone who lives his live with out any regret's. That's the beauty of this song. for me personaly it's gonna be the last song.\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nLike many great pieces of literature, contrast is added in to emphasize the strength of main points.  While he is wise enough to admit he doesn't know everything, he \" knows \" that he knows more than certain people and their opinions that pale in comparison to what he shares with those he trusts and respects.  To him, Nothing Else Matters but their mutual understanding of what they hold to ultimate value.\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nWhat has James Hetfield said about the song?\nâ\u0080\u009cNothing Else Mattersâ\u0080\u009d was a song for me. It was not to be heard by the general public. It was a song written in hotel rooms on [â\u0080\u0098Justiceâ\u0080\u0099] tour about missing friends at home, being out for such a long time. That was a song that was not meant to be played for other people, it was for me. I think thatâ\u0080\u0099s importantâ\u0080\u0094to write music that makes you feel good, Iâ\u0080\u0099ve got quite a few songs that are like that. â\u0080\u009cNothing Else Mattersâ\u0080\u009d was heard by the band, they thought it was amazing. I thought, â\u0080\u0098Youâ\u0080\u0099re crazy. Thatâ\u0080\u0099s just this sappy ballady thing that makes me feel OK.â\u0080\u0099 â\u0080\u0098No, thatâ\u0080\u0099s good!â\u0080\u0099 That just goes to show I have no idea whatâ\u0080\u0099s good [Laughs]. But it eventually made its way out there. It was a vulnerable, vulnerable song for me, and a real risk at that time, being where I was at that time to let that song go and be heard. Iâ\u0080\u0099m really glad they all pushed for it. I think itâ\u0080\u0099s a vulnerable song that everyone can relate to. It doesnâ\u0080\u0099t really mean one thing, itâ\u0080\u0099s not just about relationship, Iâ\u0080\u0099ve seen that song show up for sport teamsâ\u0080¦ Itâ\u0080\u0099s a belonging, belonging song.\n\nâ\u0080\u0094James Hetfield\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nThe solo is also kick ass\t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\nAccording to allmetallica.com, Jaymz wrote this song about his girlfriend, but when he looks back he can't remember why.  Today he just thinks of it as a song about his fans.\n\r\nI can also agree on the idea of hell I call my head and Wesley 9 on how it doens't matter what other people think as long as you're what you want to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nDefinatly, I always thought this song was written just for the fans. James's song writing ability is phenominal, it's too layered to really understand what HE is thinking. \t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\nHey, my BEST friend had this as her wedding song!  It rocked!  They rock!\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nI was in a wedding last summer, and the couple had this song as their first dance together. FANTASTIC!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\nThis song is both beautiful and meaningful. & I wouldn't mind this being played at my wedding, it expresses everything, two lovers love for one another & the strength of their bond.\r\n& An acoustic version of this, is amazing too. =)\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\nHmm.. i think about  his song more now, and i think maybe they are being kinda selfish. Since they are saying 'nothing else  matters' only Metallica. \n\r\nOr...\n\r\nThis could be a love song aswell.\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nOh goodness, never ever will I get over this song! It's, in my opinion, amazing.  I love everything about it.  All the instruments work.\n\r\nSolos are sheer brilliance!\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nGreat music\r\nbt the lyrics r not the greatest by metalica\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nIt is definitely the music first and the words help round it out.\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nblack white brown green\r\ncarpenter lawyer salesman president\r\nyoung old middle aged\r\nchinese african russian canadian\n\n\r\nnever cared for what they do\r\nnever cared for what they know\n\n\r\nbut i know myself and have an open mind, so:\n\r\nnever cared for what they say\r\nnever cared for games they play\r\nnever cared for what they do\r\nnever cared for what they know\r\nand I know\r\nYE-YEAH!!!\n\r\nso close no matter how far\r\ncouldn't be much more from the heart\r\nforever trusting who we are\r\nno nothing else matters \t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nyour not a fan of metallica then chinga tu madre puta\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\ntoo damn good;this is the most wonderful love song which makes me fall in love whenever i hear it!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nI'll tell you what doesn't matter...Lars Ulrich. What a COMPLETE DOUCHE!\n\r\nSad that ALL the talent in this band died on an icy road in 1986.\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nJames wrote it for his significant other and Lars found it and they put it together..\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nSo much has been commented on this magnificent song..I agree with the many that have explained it as a love song. It emphasizes the power of love and being true to yourself. In my opinion, it is about true friendship between f.i. two persons, but more then any other song it reminds me of the eternal friendship between human and the One who created them, God. Never care for what troubled people say or do, because so many people are troubled and blinded and reflect this on others. Self-reflection or starting to recognize your own imperfection can come to surface as a result of other people's judgments. Find yourself with help of others and when you experience this, try to help other troubled people and do not be misled by those same- or other people. God does not divide us, only humans do. When we seek trust we can find it in our friends and family, but especially in God and his only son, Jesus. Everyday we get a chance to renew ourselves, and starting to accept and understand other people's different view brings us closer to our personal liberation.\t\t\t\t\n\t\t\t\t\n\n", "comment_321": "\nGrowing up I was never into metal at all. I didn't like it. I'm now 33 and I find myself listening to, liking and appreciating so many things. I finally see this song for what it is and admire it and respect it highly. As someone said before it's about brotherhood and friendship as well as love and all the relationships you have that are of substance, rather than those so-called f***ing \"Friends\" on Facebook. It's about solidarity with the people of substance and recognizing that we are of substance and we value ourselves and those people. Anyone who has a different view of us can go to hell and they don't matter nor will ever matter. This song affirms life and ourselves. Metallica are good role models. This is the opposite conclusion to what I was led to believe when I was a kid.\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nI have heard that this song was first a lullaby for small children but I might be wrong. Good comments you all other come with.\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\nSo as we know james hetfield was raised a christian scientist as they say so my interpretation is\n\n\n\r\nSo close no matter how far\r\nCouldnâ\u0080\u0099t be much more from the heart\r\nForever trusting who we are\r\nAnd nothing else matters\r\n\"God is in us but so distant forever trusting who we are meant to be. I dont feel when he says we he speaks of a couple but we as the world of individuals\"\n\r\nNever opened myself this way\r\nLife is ours, we live it our way\r\nAll these words I donâ\u0080\u0099t just say\r\nAnd nothing else matters\r\n\"Submitting to the will of god and living it as we can in this world\"\n\r\nTrust I seek and I find in you\r\nEvery day for us something new\r\nOpen mind for a different view\r\nAnd nothing else matters\r\n\"Again submitting to God through renewing of the mind daily and finding our purpose in everyday\"\n\r\nNever cared for what they do\r\nNever cared for what they know\r\nBut I know\r\n\"Not conforming to the ways of the world, being still and knowing he is God\"\n\n\n\n\n", "comment_324": "\nI was wondering the same thing, a funny thing happened the other day, my boyfriend made me listen to the song and told me to listen to the words, he then said he wanted this to be our wedding song.... can you just imagine....hahaha. it is a good song, but just not wedding material.... So what is it about???????\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\none of the best piece of art ever no matter what you think about this song mean because i know\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\nNothing Else Matters But .......\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nphuck mettalica in the ass\n\r\nmettallicca sucks\n\n\n", "comment_328": "\nI have to say to 'hell I call my head' your a fucking flamer dude, if a song can make u cry because it is 'emotionally powerful', ur a fucking homo\t\t\t\t\n\t\t\t\t\n\n"}