{"comment_0": "\nThere's just no f*cking hope, it doesn't matter how much you hold onto your infancy, you will lose what draws a line from your innocence once you reach the adulthood. And it may be a single moment when you suddenly realize you just don't care anymore about what just a second ago could make you so happy as a child... or it may be years later when you catch yourself lying to a kid exactly the way you hated so much being lied at.\n\r\nLife with all its expectations, cruelty, greed and all sh*t will come forth eventually and truly eat your heart out from your body while it still beats in hot blood. There's no other way around... it will happen at some point. Just like you as a grown up adult will start vomitting all those crappy lies onto another children, making them swallow empty promises of others being able to heal their pain, empty and false hopes of answers to their fears, luring them into a world of an illusory freedom... \n\r\n... one can easily see how much everything out there wants you to grow up as fast as you can, all that marketing for children, high-tech games and toys for creating little consumers from the earliest age, or those freaky genius kids looking so adult on tv or cinema, 6, 7 years old people acting and speaking as adults, 10 years old girls in the streets wearing clothes, sometimes even sensual ones, as mini-adults who can't barely wait to be older and make hard mistakes for real, actually already feeling older for real... 11, 12 year old kids already knowing everything about sexuality....\n\r\n... money, needs, drugs, tribal identification, all that crap that adults keep telling them like where you to belong to. As if they really could tell! As if anyone could really tell such thing to another being. As if an age difference could make you able to do so! Like f*cked up parents brainswashing kids with all kind of religion craps, trying to explaing complex philopshical concepts of God... or the complete opposite, parents simplifying everything down to right and wrong, good and evil...\n\r\nIt would be just great not having all that sort of basterds coming into our infancy door as soon as you do something wrong, scoring and cleaning your mess just to give you a sense of responsibility disguised in a forgiveness cloak to be planted in your heart just to steal you naivety.\n\r\nThen you get close to death... when you finally get tired beyond even being or simply feeling older... that's when you see how much you wronged other that are today what you were so long ago... that's when you finally open your eyes and want so hard to get yourself back there... and it crushes you, it makes your heart weigh so heavily, your chest shrinks so hard that you just need to shout out to the children not let it all repeat itself again... begging them to rejoice, to lift their voices, begging them to make themselves be heard for their real voices... imploring them to simply have fun... admitting to yourself and whispering to them that no adult can really protect a kid from the world... it is a lie that only reflects this sick desire adults have to wax and mold their kids into what is clearly an individual vision of the world that only apply to the self...\n\r\nand children are no f*cking third parts of other selves... nor a parent choice for they to correct their own mistakes... children are what they are... or at least they should be let be so...\n\r\ndamned times these now when children are less children... and go killing and shooting and growing up before even being able to really miss being... children themselves...\n\n\n", "comment_1": "\nThese comments are all really apt, but in the context of the album and its self-proclaimed adaptation of Orpheus & Eurydice, this song marks the moment after Orpheus has lost Eurydice to Hades forever, after which he pretty much wanders aimlessly into nothing until he's devoured by beasts. It's a bittersweet tragedy in which he laments his situation, but rejoices in its easy solution: death, where he can be reunited with his lost love for all eternity.\n\r\nReally beautiful stuff. Makes a great story even better.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni personally think its talking about world war two because gulags are camps and in the end its talking about hopping on the train to the kingdom so its like when they took the jews to be killed by transportation of the trains and the kingdom is obviously heaven. at one part, it explains the nazis coming and breaking into the house and taking them out and another part explains how they would line them up in the street. \r\nbut that is just my guess.\n\r\ni found this song from harry potter and i think its just so soulful and beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nQuite Marxist.  In other words, the adults love the next generation, but end up screwing it up unintentionally the way they were screwed up.  Just hand over your \"gun\", your rebelious spirit,  and let us teach you the secrets we all think we really know but we don't.  But in the end, even though we have brainwashed you into believing our ways are right, we can all still ride that same train home to a place where we will all be happy.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI see it like this - \n\r\n1. The protagonist's generation of adults have f##ked up the world and built human systems which make it a generally horrible place (the \"gulag\", which in history is the ultimate example of the horrors people inflict on one another).  They have done this to their short term profit but long term detriment.\n\r\n2. The protagonist feels he is about to die - by his own hand, perhaps, or at least unwillingly (\"pass me that lovely little gun\", \"the light is dim\" etc).  At the same time, he and his peers have had the shocking realisation that they have lived worthless lives and made the world a worse place by forgetting their original values (\"poor old Jim's white as a ghost/he's found the answer that we lost\")\n\r\n3. He is speaking to his child, trying in his way to apologise and warn the child about the world that the adults have created.\n\r\n4. He knows deep down that the message won't get through to the child (\"there ain't nothing we can do to protect you\"), and that the same type of people he once was (the \"cleaners\") will come to the child, and convince it that the ways of the world are good and correct, and that as an adult the child will subsequently participate in building and maintaining the very same system, the \"gulag\" - so \"here take these before we run away/the keys to the gulag\", i.e. the world, such as it is, is yours now.  \n\r\n5. The \"cleaners\" will make is all seem like it is the right way for things to be by hiding the blood - \"the cleaners have done their job on you/they've hosed you down, you're good as new\" - i.e., when the child makes the same choices that the protagonist did, it will be because society is structured in a way that hides the true costs of those choices until it is too late.  Consumerism, supporting corrupt governments, \"righteous\" wars, etc etc.  To me the \"cleaners\" are governments, corporations, the media, and other manipulative people/groups who profit from the current system.\n\r\n6. I find the gospel part at the end to be intentionally ironic - after selfishly wrecking the world and abandoning his child to its fate, he now has the temerity to ask God (or whoever) for salvation (getting him to \"the Kingdom\").  I think this part highlights that this is said slightly mockingly: \"we're happy Ma, we're having fun, the train ain't even left the station\", i.e., his generation have forgiven themselves and found 'salvation' and now they're back to having fun even though the \"train\" isn't necessarily going anywhere.  But there is also a real fear in there - \"have you left a seat for me? is that such a stretch of the imagination?\", i.e., after all I've done, is it even possible that I could be redeemed?\n\r\nI think this song ties together with another great line from this album: \"I went to bed last night and my moral code got jammed/I woke up this morning with a frappacino in my hand\".  There's a theme of obsession with success clouding our vision of what is really important\n\r\nAbsolutely unbelievable song.  \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI agree with the opinion that \"the cleaners\" are a personification of Time, but I think we can actually combine a few of the ideas already brought forth. The narrator is speaking to his child in regret for how he has led him/her astray from Christ, and how he and his friends have become exceedingly arrogant and materialistic through their lives to the point where they have lost sight of the true spiritual treasure they had known. A sudden realization of this fact as they approach death sends the narrator into an apologetic tailspin as he is separated from his child as he is carted toward heaven after his repentance. \n\r\nAnd I have to say, the fact that a train was used as a metaphor for the transportation into the afterlife fit VERY WELL into the Harry Potter story, and I'm glad they used it in the film; Harry is told by Dumbledore that all he would need to do to move on is board a train, which would take him into the next life. It's actually much more significant to me now than when I actually saw the film.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI'll try and make it a bit clearer what I think it's about, cause I might be wrong, but it seems to fit. \n\r\nNick's putting himself in the position of someone older, nearing death. He and the others have done things in this world (\"Gulags\"), which although left them richer (\"Lost amongst our winnings\") are morally a bit wrong and left the world a bit rubbish. The gun reference could be an allusion to regret, which the song seems to be full of...\n\r\nI think part of it is the realisation that even if they wanted to make everything right they couldn't. People will be people, and people replace other people and become in the same position and it doesn't matter how much they try to convince the young that they need to look at everything, they never will. \n\r\nThe other feeling I get from the lyrics is the realisation that Death is quite near and it's something to fear whatever age you are, so maybe people should live their lives to the fullest.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis is among the most sophisticated songs ever written; it is true literature.  \n\r\nThe verses alternate between a young person with a broken heart and old folks who are passing away.  What links them together is Time, in this song represented by \"the cleaners\".  \n\r\nTime heals all wounds, including the young person's broken heart.  But there's a paradox because the passage of time is also leading us inexorably toward death.  \n\r\nThe cleaners will clean our broken little hearts but they will also, eventually, clean every last trace of us off the Earth.\n\r\nWhat is the solution to this paradox (the \"answer to all our fears\")?  \n\r\nFor a Christian like Nick Cave, the solution is to embrace Christ, so that Time ceases to be a set of cleaners wiping us from history, and becomes a train carrying us in the direction of the Kingdom which we will reach at death. \n\r\nWe lost this answer in our pursuit of winnings (earthly possessions); the desire for earthly possessions is a trap (\"a gulag\") which keeps us from discovering the way out.\n\r\nJim rediscovered the answer (the Kingdom) at death, and then the narrator has a conversion experience (much like Nick Cave).  He \"once was blind\" but now can see, he was \"held in chains\" (in the gulag) but now is free.\n\r\nAs soon as he has this conversion experience, his experience of time changes from dread (fear of getting old) to anticipation (of meeting God at death). Instantaneously  he is free of the gulag and celebrates, even before the train of his new life starts moving.  Merely being pointed in the right direction (being born again) is a basis for happiness.\n\r\nYou might expect that having been freed of his chains and having gotten on the train, the narrator would now \"lift up his voice\" and \"rejoice\".  But here is where the song, to me, becomes literature.  If you'll note, the rejoicing comes before he gets on the train.  That is, I think, because the song is actually the means by which he will be saved.  Lifting up his voice to God in song (accepting Christ) is the act that converts his heart to God, puts him on the train and keeps him heading toward the Kingdom.  You might even say that rejoicing (ie exclaiming Christ as one's saviour) is the train itself.\n\r\nThe lesson of the song is that instead of singing our woes (our broken little hearts, poor old Jim, the light is dim) we should change our tune so to speak and lift up our voices in song to God.\n\r\nIt is a song, therefore, about song.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think everyone is over thinking the meaning to this song. School massacre, suicide and my favorite.. CONCENTRATION CAMPS?? I think not.\n\r\nTo me it's about a person who lost faith in God. They get drug down by the world and lose faith getting cought up in the hype and excitement of the world\n\r\n\"Forgive us now for what we've done\r\nIt started out as a bit of fun\"\n\r\nAs they near death unhappy they find what they needed all along, something that was right there in front of them but obscured by the temptations of the world \n\r\n\"We have the answer to all your fears\r\nIt's short, it's simple, it's crystal clear\r\nIt's round about, it's somewhere here\r\nLost amongst our winnings\"\n\r\nAfter this they find peace and live happy, waiting for the train(death) to take them to the kingdom(heaven).\n\r\nFirst I would like to say I love this song and it made HP7 that much better\r\nSecondly, anyone can pick any song apart so far it looses its meaning, JUST LISTEN and don't over think it\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nOnce I look at it closely... it seems like a song about children in camps (concentration camps that is). I looked up gulag and that's what it means, the USSR's concentration camps.\n\n\"The cleaners have done their job on you\nThey're hip to it, man, they're in the groove\nThey've hosed you down, you're good as new\nAnd they're lining up to inspect you\"\n\nI don't know about Soviet Russia, but in Germany and other Nazi camps, children were used for experiments, they cleaned them and then \"inspected them\".\n\nPrisoners were sent in trains, and during this period of time children weren't told what was really going on... \n\nEveryone has their own interpretation though\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI can't believe no one has commented on this song yet. The very first time I heard it, I got chills on the back of my neck. It's so devastating yet beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nIt is incredible and very spooky, but anyone got any ideas what it's about?\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nIt sounds like a school massacre to me. Not 100% sure, but that's the impression I get.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nNo clue..\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nmaybe about committing suicide?\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThe sins of the father and all that.\r\nThe gulags were concentration camps operated by Stalin.\n\r\nI think the general message is that people fuck other people over, as he pointed out a lot within People Ain't No Good.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nNot a native speaker I am, but seems to me a bitter song about abortion it may be.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI'd love to know what this one's about, too. There's a lot of symbols and things which don't explain everything on their own? Which I guess is the idea, considering the varied response this one's got so far.\n\r\nWhat I reckon we do get is that the person who Nick's singing to has done something really bad in their distant past, and even though they're sorry for it now, it's coming back to get them. Hence the \"we're sorry now for what we done\" and the \"we're older now and the light is dim\" as well as all the implications like in the gulag part. The main message in it seems to be that they were children back then, but it excuses nothing. The other obvious reading is that they got a lot of success from doing it, but ironically, the key to redeeming themselves got lost in it- \"lost amongst our winnings\".\n\r\nAnd the final part is obviously about death- as in, a gospel christian idea of being taken up to heaven- \"the kingdom\". So maybe- considering Nick's upbringing and that this is a GOSPEL choir, after all- the \"redemption\" was in going to heaven in the end. The whole \"I once was blind but now I see\" thing referring to them finding god? I don't reckon that's the whole meaning, though, or at least I hope it isn't.\n\r\nAnd I have NO idea what the lines about \"cleaners\" refer to. What could they be?\n\r\nUm, I've been saying \"obvious\" as in \"that's the surface meaning\", not that it's definitely the meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nWell... I'm not sure if there is/what the deeper meaning is, but I'm pretty sure that on the surface, he's saying to the next generation: \"Death is the only escape from this shitty life we've left for you.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nWell... I'm not sure if there is/what the deeper meaning is, but I'm pretty sure that on the surface, he's saying to the next generation: \"Death is the only escape from this shitty life we've left for you.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI allways thought this song was about the end of the world and the return of the messiah. As xdvr is on to, the song is full of allusions to regret but yet; \"Rejoice rejoice\"\n\r\n\"We're happy, Ma, we're having fun\r\nAnd the train ain't even left the station\"\r\nTo me this indicate a relief that we can finally \"pay\" for what we've done.\n\r\nAm I way off?\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI think the title is the key to the song, in an interview Cave said it was about his kids, and worrying what sort of world they would grow up in or something like that...\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThis is such a beautiful song on it's own, but I loved how they used it in Harry Potter.\n\r\nIt fits perfectly with the theme of children fighting a war the adults couldn't finish, because the characters really are just children. They're only 17, and they've been fighting since they were 11. The exact scene it's used in (when Harry and Hermione dance and smile and act goofy for the first time in way too long), they really get to pretend to be kids again. It still has a bittersweet feeling, because they and the viewer know they haven't been children for years, and Harry never had a childhood at all.\n\r\nAnd the idea of \"riding the train to the kingdom\" reminds me of Harry knowing he's going to die at the end.\n\r\n/nerdy fangirling\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis song made the scene in Harry Potter & The Deathly Hallows pure perfection. \t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nFirstly, ChamomileCourier... you're so correct. This was perfect in Harry Potter. The tone totally works!\n\r\nSecondly, I'd like to put in my first interpretation of the song when I first heard it. Right when I heard gulag, I thought of concentration camps, or something of the sort. And I practically cried when I heard this part, connecting it to the Holocaust immediately:\n\r\n\"Hey little train! We're all jumping on\r\nThe train that goes to the Kingdom.\"\n\r\nThe train, in my opinion, refers to those trains that brought people to and from concentration camps. \"The train that goes to the Kingdom\" meant to me as the train that would bring them to their death, to the Kingdom of Heaven.\n\r\nThe rest of the lyrics that seem to mean they're having a good time ... they make me think, kind of. I could see someone saying that they're doing great when they obviously aren't, just to not worry they're loved one -- in this case, being Ma.\n\r\nAnd another thing:\n\r\n\"Hey little train! Wait for me!\r\nI was held in chains but now I'm free\r\nI'm hanging in there, don't you see\r\nIn this process of elimination.\"\n\r\nIn this process of elimination?\n\r\nA few more examples came to mind, especially the mention of guns and gulags, but these are a few of my major ones that really stood out.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nDid none of you ever take history at school? Noone have a little knowledge of Russian history? The meaning of this song is simply about the Russian massacare of it's peoples. The gulags are a string of concentration camps, where they sent the locked up children and some adults from the ghettos. Here, they would be killed. Pretty horrible eh?\r\nIt's like The Mercy Seat, another of Nick Cave's songs. Seems so complex, and of course, both these songs are beautifully written, I personally adore them. But The Mercy Seat is simply about someone about to go to the electric chair. Like how this is simply about Russian concentration camps.\r\nYou're welcome ^.^\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI apologise, it seemed to have just ignored some of my typing. I meant:\n\r\n\"The Gulags are a government agency that ran a string of concentration camps.....\"\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThe first thing I think of is the Holocaust, deportations, and camps, maybe because it's a subject I'm incredibly interested in\n\r\n\"Pass me that lovely little gun\r\nMy dear, my darling one\r\nThe cleaners are coming, one by one\r\nYou don't even want to let them start\"\n\r\nSounds like a family in hiding, they've been discovered, but they would rather die together than be deported and separated forever.\n\r\n\"The cleaners have done their job on you\r\nThey're hip to it, man, they're in the groove\r\nThey've hosed you down, you're good as new\r\nAnd they're lining up to inspect you\"\n\r\nI picture people getting off the deporttion cars and being paraded in front of the camp guards, being inspected for work or immediate execution.\n\r\n\"We're all weeping now, weeping because\r\nThere ain't nothing we can do to protect you\"\n\r\nI see this as an adult feeling sorrowful that they could not protect the children. I know during the Holocaust, and especially in the Theresienstadt camp, the adults made it their job to keep the children alive and safe, because they were the key to the survival and future of the Jewish religion.\n\r\n\"Hey little train! We're all jumping on\r\nThe train that goes to the Kingdom\r\nWe're happy, Ma, we're having fun\r\nAnd the train ain't even left the station\"\n\r\nMost had no idea where they were going, it was almost like an adventure....\n\r\n\"I'm hanging in there, don't you see\r\nIn this process of elimination\"\n\r\nProcess of elimination...no problem for me to discern what that might mean.\n\n\n\n", "comment_28": "\nA very pretty song-- I love the chorus bit at the end :)\r\nA rather grim interpretation of the world the older generation left for us younger folks, no?  It's interesting, because in the end the world really does belong to its children.  The cleaners= time, so far as I'm concerned.\r\nWorks BEAUTIFULLY in Harry Potter-- that scene was amazing.  \t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI see it as ethnic cleansing. And the people of different religions who are persecuted going home to thier gods and becoming free. \t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI read some comments and some of them does make sense. still can not interpret the text of the song because im not good  in english, but the music itself almost made me cry. sounds like someone is dying against his will but does not want others to worry. it was the biggest hit in whole movie...\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nTo me, it's mainly about the confusion, fear, and sorrow in a child's heart during war. Specifically the Holocaust, I'm sure. \n\r\nAnd in a more modern sense, it reminds me of physical and sexual abuse (which is where it hits home with me). \n\r\nThis song evokes multiple emotions from me. Sorrow and a feeling of release. The tone of the song is incredibly melancholy, imo. The feeling of release is hard for me to explain. I feel like all the confusing emotions and experiences that I've been through due to my abuse are justified: I never did anything wrong. My abuser was in the wrong. And finally, it causes me to reminisce about my past. No flashbacks, if that makes sense. Just emotions I felt, basically. \n\r\nAnywho.. all in all, it's an excellent song. Definitely my favorite. \t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nTurn up the volume... especially when its silent\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI think all of the answers were good. But when I listened to the song I felt it was slaves, like back before the Civil war in America, crying out that for some reason they had to be put to work, and they were they bad guys here, not the white men(this is wrong, but theydont get why they are being treated like tis and it makes sence to them) . At the end (Hey little train, wait for me. I was held in chains but not I see) it is like they are now free. But (Have you left a seat for me) even though they are free no one wants to touch them. I feel like some parts of the song would but the white man singing then the slave but I think you would be able to pick out the parts. It really could be about anything (slavery, child abuse, ect) it is just how you see it. \t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI am convinced this song is a warning from an older generation to a younger generation:\n\r\nPass me that lovely little gun\r\nMy dear, my darling one\r\nThe cleaners are coming, one by one\r\nYou don't even want to let them start\n\r\nThey are knocking now upon your door\r\nThey measure the room, they know the score\r\nThey're mopping up the butcher's floor\r\nOf your broken little heart\n\r\nThe warning starts with a death, the older generation has lost a friend and realized, \"hey, we won't live forever.\" People from the funeral home are going through the motions, and the older generation is going through that realization that they aren't gonna live forever and they've made mistakes. \n\r\nO children\n\r\nForgive us now for what we've done\r\nIt started out as a bit of fun\r\nHere, take these before we run away\r\nThe keys to the gulag\n\r\nThey're asking forgiveness from the younger generation for what they've done, whatever it is they've done. \n\r\nO children\r\nLift up your voice, lift up your voice\r\nChildren\r\nRejoice, rejoice\n\r\nThey're telling the kids to ask the questions they have, speak up for what they believe in while they have the chance. \n\r\nHere comes Frank and poor old Jim\r\nThey're gathering round with all my friends\r\nWe're older now, the light is dim\r\nAnd you are only just beginning\n\r\nThey know they're getting older and regret things that have happened in their past that they can't fix that their kids/nieces/nephews/etc. are gonna pay for.\n\r\nO children\n\r\nWe have the answer to all your fears\r\nIt's short, it's simple, it's crystal clear\r\nIt's round about, it's somewhere here\r\nLost amongst our winnings\n\r\nThey know they answers to some big questions, having learned them from experience, but how do you tell someone in their twenties not to do something when you didn't listen to the same warning, and when you have the answer and, on top of that, have made a life for yourself? You've made your mistakes, too bad the younglings have to make their's now. \n\r\nO children\r\nLift up your voice, lift up your voice\r\nChildren\r\nRejoice, rejoice\n\r\nThe cleaners have done their job on you\r\nThey're hip to it, man, they're in the groove\r\nThey've hosed you down, you're good as new\r\nAnd they're lining up to inspect you\n\r\nI'll be honest, I can't help but interpret this line as having to do with the holocaust, which is a second interpretation I have of the song, and probably the more logical one. However, I'm one of those sickeningly squeamish people that can't talk about the holocaust without bursting into tears or gagging. It's just not something I can wrap my mind around. I know and believed it happened... it's just hard to believe ANYONE could be THAT cruel so... I avoid talking about it. Moving along...\n\r\nO children\n\r\nPoor old Jim's white as a ghost\r\nHe's found the answer that we lost\r\nWe're all weeping now, weeping because\r\nThere ain't nothing we can do to protect you\n\r\nAs I said above, they can't just give out all the answers to the children. These are lessons they gotta learn for themselves, no matter how much they hurt. \n\r\nO children\r\nLift up your voice, lift up your voice\r\nChildren\r\nRejoice, rejoice\n\r\nHey little train! We're all jumping on\r\nThe train that goes to the Kingdom\r\nWe're happy, Ma, we're having fun\r\nAnd the train ain't even left the station\n\r\nThey're getting ready to go. Getting ready to head out and are preparing themselves for the ultimate journey... and no, not the one to Hogwarts.\n\r\nHey, little train! Wait for me\r\nI once was blind but now I see\r\nHave you left a seat for me\r\nIs that such a stretch of the imagination\n\r\nThey've come to an understanding with the world and what they eventually have to do, and are ready to move on, in a way.\n\r\nHey little train! Wait for me!\r\nI was held in chains but now I'm free\r\nI'm hanging in there, don't you see\r\nIn this process of elimination\n\r\nHe hung in there, learning his (or her, I guess) lessons, and is free from the assumptions all we stupid teenagers make (being one... we make some doozies)\n\r\nHey little train! We're all jumping on \r\nThe train that goes to the Kingdom\r\nWe're happy, Ma, we're having fun\r\nIt's beyond my wildest expectation\n\r\nThey're moving on, probably to Heaven, given the Kingdom reference. \n\r\nHey little train! We are all jumping on\r\nThe train that goes to the Kingdom\r\nWe're happy, Ma, we're having fun\r\nAnd the train ain't even left the station\n\r\nHey little train! Don't wait for me\r\nOnce I was blind but now I see\t\n\n\r\nOr something... I think my Holocaust interpretation is probably more accurate... but I'm good with this one. Just my thoughts on the song. Not sure why we're discussing it when we could be enjoying it, but either way... \n\n\n\n\n", "comment_35": "\nI think this refers to the wars of old men (politicians) who don't see the consequences of their actions. In this poem a man is looking back and reflecting on the deaths that have resulted as a consequence of his actions. It reminds me of the poem 'The Parable of the Old Man and the Young' (poemtree.com/poems/…)\n\r\n'Pass me that lovely little gun'.\r\nThis I think could refer to either suicide - the speaker wanting to end the regret he feels. But more likely I think it refers to the fact that the war the speaker created killed so many that he may as well have held a gun to their heads.\n\r\n'The Cleaners are coming one by one'.\r\nThis could refer to the people who are trying to fix the mistakes.\r\n'But you don't want to even let them start'. \r\nThat the more people try to fix the mistakes the more wrong things become. For example it could be refer to how thanks to the past people have caused problems such as global warming but when we try to fix the mistakes such as these it's entirely possible we make things worse. War is another example of this. Take Vietnam for example.\r\nAlternatively it could be that the cleaners are people who will try to sort through the mess and find out things that the speaker doesn't want them to know.\n\r\n'Knocking now upon your door'. Like a barricade? Reminds me of an army trying to break a door down to get in. It's invasive, the person doesn't want to let the 'cleaners' in but they have no choice.\r\n'Mopping up the butcher's floor, of your broken little hearts'.  Cleaning up dead young who have died as a result of the old's mistakes (War again?). The old have caused the death of the young.\n\r\n'Forgive us now'. 'Now' suggests that they never realised how badly wrong they'd gone before.\r\n'Run Away' - Dying as an escape? Clearly the speaker seems to be dying so this suggests the suicide option. \r\n'Gulag' - This could refer to the actual Gulag but I'm choosing to think of it as a symbol for all the wars/concentration camps/general wrongdoings of people thinking they are older and wiser, and it not being a problem and as a result causing the death of the young.\n\r\n'We are older now the light is dim'. Dead souls/companions collecting him as he dies.\r\n'You are only just beginning'. - Now it's your turn to try and fix it, almost sardonic. 'I'd like to see you try better, you too will make mistakes.'\n\r\n'It's short...crystal clear' - Old men saying that they have the solution, they can fix the problem 'they'll all be home by christmas' type thing. \r\nWhen it goes on to say 'It's round about, lost amongst our winnings'. It's like the speaker has either lost sight of what he was originally seeking in his fight (a change of morals/beliefs?) or that they never knew and it was all just talk. The contradiction between 'Crystal Clear' and 'Round About' suggests the latter.\n\r\n'The cleaners have done their job on you' - Found out all your misdoings and brought them to light? Made tthe person have a change of heart? Or someone saying 'I never agreed with that, I wasn't part of it'. For example people who worked in concentration camps saying they had no choice. They've been 'cleaned'.\r\nI'm not sure about the 70s lines 'Hip to it man, in the groove'. Reference to Vietnam time?\n\r\n'Jims white as a ghost...answer that we lost'. Only after you've died or on the point of death do you see clearly/remember the point of what you're fighting for or what your purpose is.\r\nFurthermore they all realise upon death that humanity is trapped in the cycle of mistakes to be repeated over and over.\n\r\n'Happy Little Train' - Train that leads them to the kingdom of heaven. \r\n'We're happy Ma, we're having fun' Reverting to childhood upon death and being able to let go the mistakes of the past/redemption. Or possibly ironic.\n\r\n'I was once blind but now I see' - Again, realisation upon point of death.\n\r\n'Process of elimination' - Everyone dies, the old who made the mistakes finally dying. \n\r\nThis is just my interpretation of course, but I hope it might help you to come up with your own interpretation of the song.\n\n\n\n\n\n\n\n\n", "comment_36": "\nWell, we all know what gulags were, but I think that this song isnâ\u0080\u0099t about that.\r\nMaybe because Iâ\u0080\u0099m Pole, and Poland spent a lot of the history under annexation and occupation (so our poetry couldnâ\u0080\u0099t be written literally â\u0080\u0094 to slip through the net of censure), but I think that if he were writing about soviet camps, he wouldnâ\u0080\u0099t use that word. The gulag line is only kind of historical reference.\n\r\nThe speaker asks children to forgive them â\u0080\u0094 old people â\u0080\u0094 for what theyâ\u0080\u0099ve done with the world (like caitsith01, rahula and others wrote â\u0080\u0094 consumerism, wars etc). The old people know the answer, but itâ\u0080\u0099s too late to protect young, because the cleaners (who canâ\u0080\u0099t or donâ\u0080\u0099t want to reflect on world and life) had too much influence on them.\r\nAnd the answer is God â\u0080\u0094 they know the truth, so they are happy now, despite that the train to the Kingdom (His Kingdom) hasnâ\u0080\u0099t even left the station (they havenâ\u0080\u0099t died yet).\r\nThatâ\u0080\u0099s my interpretation of lyrics, in brief.\n\r\nAnd the last thing â\u0080\u0094 Cave has a bard-like style, and nowadays bards are usually trying to describe present situation â\u0080\u0094 often referring to history and art and religion, so their songs can be interpreted in many different ways, and all of them can be right.\n\n\n", "comment_37": "\nWhen I heard the song, I thought of redemption and the mystery of rejoicing in the midst of pain and fear. After I read the lyrics through closely, I thought of the Holocaust and the narrator as a regretful Nazi. It could apply to other similar situations though. Anyway, a beautiful haunting song.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\ni love this song. i don't know how old this is. but someone reblogged it on tumblr. and now i'm all over this track. timeless piece. \t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nIt's a Gunsmith or a weapon maker.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nOk...That song reminds me of an accident that happened in my town a time ago...\n\r\n2 brothers playing with a gun...and then BANG! one shot, one dead. So sad...\n\r\nI think thats about the 4 first lines.\n\r\nAbout the knocking doors, i think its about what happens next to the death. people, police, familiars, etc trying to enter the room in SLOWMOTION.\n\r\n\"fotgive us now...\" ok thats the part when the accidental-killer apologize and tries to explain the things...and he decided to drop the gun.\n\n\r\n\"Here comes Frank and poor old Jim\r\nThey're gathering round with all my friends\r\nWe're older now, the light is dim\r\nAnd you are only just beginning\"\n\r\nfrank and jim are coming...the gather around with some of the accidental-killer's friends wich are already at the funeral or in the crime scene wherever or whatever it is.\n\r\nThe Acci-Killer is still alive...but he knows he's dying from inside, he feel already beaten, dead, while his dead brother is nearly beginning to live after death...so much sorrow...in this part.\n\r\n\"The cleaners have done their job on you\r\nThey're hip to it, man, they're in the groove\r\nThey've hosed you down, you're good as new\r\nAnd they're lining up to inspect you\n\r\nO children\n\r\nPoor old Jim's white as a ghost\r\nHe's found the answer that we lost\r\nWe're all weeping now, weeping because\r\nThere ain't nothing we can do to protect you\"\n\r\nthis 2 paragraphs are about the funeral...clearly. white as a ghost, good as new, lining up to inspect, he found the answer (the meaning of life perhaps)...and other people are unable to do anything.\n\r\nThe final part about the train thing...is the dead brother goodbye. He's trying to calm their parents and brother...he's alright, it's even better than they think.\n\r\n\"I was held in chains but now I'm free\r\nI'm hanging in there, don't you see\r\nIn this process of elimination\"\n\r\nHe's free now, he's happy, without worries...as a little child. In the perfect and natural circle of life...and death (process of elimination).\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThink its about asking for forgiveness for them for the bad things they did then at least not pass the sins on to the children its asking for forgiveness that before they were blind now they can see that the time has come for judgement\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nSuch an amazing song. One of my favorite's of all time. So much feeling. So much emotion. Just everything a song should be. And, to be honest, when Harry and Hermione danced to it in Harry Potter and the Deathly Hallows Part 1... I just couldn't help a flood of emotions. Just an all around amazing tune with some real heart to it. Truly a testament to the greatness of Nick Cave.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nthe song is amazing. I've heard it first when I watched Harry Potter and I loved it. I love how the Gospel choire sings \"Rejoice\" so nice.\r\nI've read all the interpretations. before, I havent had any idea what all the allusions and stuff meant. Now, I can picture the whole situation better.\n\r\nYou guys have talked about eveything, but the \"pass me that lovely little gun\" verse wasn't mentioned so often\r\nIn my opinion it means the try to stop or slow time, as time is symbolised/personificated by the \"cleaners\".\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI think Cave is rather using the ''cleaners'', ''gulags'', etc. as metaphors.  Horrible things happening to children (imposed ideologies, violence, etc.) and then in puberty, adolescence the cleaners come in form of teachers, etc. who don't care for what has happened to them, they wipe off their backgrounds and urge them to become a functional part of society. I think the gulags may be a reference to work - you work yourself off in order to survive even though you may still suffer from what has happened to you. But no one gives a shit because your only function is to work. \nI think this is a song of strong empathy. \nAn excuse for what adults do to children because they pretend to know what life's about even though they suffer horribly, too. ''It's round about, it's somewhere here'' indicates that they cannot name the secret to lead a successful life. \nThe train may be a metaphor for our dreams, we're getting lost in them yet they often don't leave the station, they remain in our heads. Our life is as bitter as ever, just with a nicer world to escape to mentally. \n''The process of elimination'' may be the process of getting rid of hope because the last two lines say ''Hey little train! Don't wait for me// Once I was blind but now I see'' which indicates that the protagonist of the song realizes that life simply is bitter and painful and there's no way of changing that. He/she is finally coming to terms with his/her destiny.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nI don't know what Nick Cave is specifically referring to except by his use of the word \"gulag\" --GULag is the acronym for Chief Administration of Corrective Labor Camps and Colonies. If you like Harry Potter, you can liken this to the \"Ministry of Magic\" which was undertaking its own eugenics program.\n\n \"The Cleaners\"=ethnic cleansing or can also mean brainwashing.  \"The Butchers\" goes with \"the meat-grinder\" [what gulag prisoners called] the set of procedures used under that Soviet repressive political system.\n\nGenerally speaking, I think it's about  people who turn(ed) a blind eye to the cruelties perpetrated by one group on another. Or the damage we do to future generations by thinking of ourselves in the short term. You could liken all this to brainwashing. A kind of implicit collusion involving the majority of people's indifference, self-absorption and fear.\n\nI'd like to believe the train is the way out and that this is a song of hope. For Harry, it was Hogwart's, away from the repression, brainwashing and (later) ethnic cleansing surrounding it.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nof course you can use it! =)  what's your tumblr?\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI see a lot of meanings in this song- it uses suggestive language which could mean many things, and still make perfect sense.\n\nBut, in general, the song symbolises the fracture of society, the citizens, or 'children' of god turning to sin and greed as their only supposed option.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nMigrants coming from Middle-East to Europe with their children, babies. They are trying to catch trains to go to Germany, UK... (\"Kingdom\"), but the European authorities don't want to let them in, they stop the trains (\"And the train ain't even left the station\"). During the immigration travel, many tragedic accidents occure, even with children. Check out this: bbc.com/news/… or bbc.com/news/…\n\n\n", "comment_49": "\nWhile I agree that the song has much historical significance, and taken altogether, could just be a large tribute to the holocaust or numerous other instances in history that are similar, the way that I saw the song was as a metaphor for the innocence that children lose when they are exposed to war. In the context of the film in which it was used (Harry Potter and the Deathly Hallows), all 3 main characters are ultimately shouldering the weight of an army--they are refugees, and their child-like innocence has been completely removed. In the same way, I think the use of concentration camps and gulags is meant to provide a commonly understood example for an instance when children lost their innocence because of a world they could not control.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nJim Jones and The People's Temple.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI have found this song personal and I understand it \"at my way\"..\n\r\nPass me that lovely little gun\r\nMy dear, my darling one\r\nThe cleaners are coming, one by one\r\nYou don't even want to let them start\n\r\nHe's begging Justice for mercy.. Some people are coming to convict him and call him criminal.\n\r\nThey are knocking now upon your door\r\nThey measure the room, they know the score\r\nThey're mopping up the butcher's floor\r\nOf your broken little heart\n\r\nThey are judging him for defending what's most dearest to him. They are ignoring the real villain, the butcher.\n\r\nForgive us now for what we've done\r\nIt started out as a bit of fun\r\nHere, take these before we run away\r\nThe keys to the gulag\n\r\nHe's praying for forgivness, but deep in his soul he does not feeling guilty for something that he has done to save his country and people from aggresors.\n\r\nO children\r\nLift up your voice, lift up your voice\r\nChildren\r\nRejoice, rejoice\n\r\nHe wants that our new generation do something and make right this unfair judgement. He hopes for better future for us. He hopes that hurt and offence will turn into justice and proud.\n\r\nAnd so on.. \n\r\nFor all Croatian Generals. Justice sometimes has nothing to do with court, laws and other bullshits.\n\n\n\n"}