{"comment_0": "\nPaul did indeed make an error at the end, and the other three Beatles liked it enough that the kept it in.  The phrase Ob-la-di Ob-la-da means \"life goes on\".  Also, Paul actually heard the phrase from a Nigerian congo player in a group called Bad Manners named Jimmy Anonmuogharan Scott Emuakpor.  Jimmy actually tried to sue him for using that phrase, a lot of events followed, and Jimmy dropped the case after Paul payed the support money that Jimmy owed his ex-wife and they both became close friends afterward.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ni dont know how anyone can h8 this song, its so upbeat and cherpy\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\npaul screwed up in the end of the song:\r\n\"Happy ever after in the market place \r\nMolly lets the children lend a hand. \r\nDesmond stays at home and does his pretty face \r\nAnd in the evening sheâ\u0080\u0099s singer with the band.\"\n\r\nthey felt it went along with the general silliness of the choon, so they kept the take.\n\r\n...at least that's the story i heard. \n\n\n", "comment_3": "\nBad Manners? Surely not the same Bad Manners that had a string of Ska hits in the early 1980s, fronted by a huge skinhead named Buster Bloodvessel? Which coincidentally was also the name of the bus driver in Magical Mystery Tour...\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nAn error in the following comment I made:\n\nIts not the \"Desmond stays at home and does his pretty face\", which is correct, but the \"And in the evening he's a singer with the band\" line which should read \"And in the evening SHE'S a singer with the band\"\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nPaul actually wrote this song after being in Rishi Kesh (not sure if that's the spelling).  It's a very happy song, I enjoy it lots.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nwasnt this the theme song to a show?\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nRoger is right. And after Paul sings \"...lend a hand\" you can hear John shouting \"Foot!\" and George yelling \"Leg!\".\n\r\nMusically, a completely incompetent attempt at white Reggae (see also Simon & Grfunkel's \"Why Don't You Write Me?\") but a great singalong standard.\n\r\nPaul had a Jamaican friend who was a bandleader, and he was the originator of the phrase \"Ob-la-di Ob-la-da life goes on bra\". \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThe Offspring had a hit that was basically a paradoy of this, \"Why Don't You Get a Job\".  Beatles are much better.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nHa ha I was wondering where I'd heard the tune before...\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nthis song is a great song to cheer u up\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nIt wasn't a parody. It just used the same drum beat.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI dont get it. What was this mistake???\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is totally the funnest song every written!! It's awesome! I want to make a fun song like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ni was just reading a list of the worst songs ever on an article on msn and it listed this song as one... that made me mad..i cant believe that anyone could dislike this song, i think its great and its got a good message\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nyeah i was reading a similar one and it just 'happened' 2 be on there and i went off @ them... lolz :)\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI like the Anthology version rather than the White Album version, it's more upbeat with a wicked horn section. More fun I find. Thoughts?\r\n\"I like your face\"\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis song is one of those story songs. isn't it?\r\nBah humbug the beatles rock!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThe fact that Paul spend a lot of time overdubbing and the song's general sillyness annoyed John, George, and Ringo.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nJohn hated this song. It took over 40 hours to record because paul was so fucking picky and couldn't come up with an intro. So John walked over to the piano hammerd out some notes on it and they kept that as the intro. This song was recently named the worst song ever in a poll taken by the BBC. I dont really like this song either, I could understand why John hated the song as well. Just imagine listening to this song for 40 hours straight!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ngreat song\n\r\nA song by Paul, it came from the phrase, Ob-La-Di, Ob-La-Da, that means \"life goes on,\" that Paul heard by a man named Jimmy Anonmuogharan Scott Emuakpor, a Nigerian congo player who played in a group known as Bad Manners. Paul met him in the Bag o' Nails club in Solo, London. When Paul wrote the song, Jimmy Scott was annoyed, citing that he should receive some of the financial rewards for it. McCartney responded by telling him that if he had written any part of it, he would be glad to pay him, but he didn't. Scott sued, and meanwhile, was jailed for refusing to pay support to his ex-wife. Jimmy appealed to Paul to pay his rather large past support payment, which Paul did to help him out, but on the condition that Jimmy drop his case against him over the song. Jimmy did and he and Paul came to be and remained close friends over the years until Scott's death in 1986.\n\r\nPaul loved this song and made many takes of it, driving the remaining three Beatles' crazy. McCartney wanted it released also as a single, but Lennon hated it and refused to let that happen. Consequently, a Scottish group known as Marmalade recorded it and had a number one hit. There is a mistake in the song where McCartney sang that \"Desmond stayed at home and did his pretty face,\" when it should have been as the other similar line, referring to Molly. The three other Beatles liked the error, and it remained. Desmond has a barrow in the marketplace, Molly is the singer in a band, Desmond says to Molly, girl I like you face\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI love this song, sure it's silly as hell but it's really fun.  If John didn't like it then he shouldn't have been part of it.  \n\r\nIf both the BBC and Maxim's Blender have said this is one of the worst songs ever (Blender also called the Sound of Silence one of the worst songs ever) then they should get their heads outt their assholes and find some terrible music to bash. IE: teen pop and a lot of new bands.\n\r\nOffspring are also really cool and GET A JOB is dope\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThis song was originally a slow song, but while John was on drugs he came in and played twice as fast.  I can't imagine this song slow though.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nis'nt this song about getting married and having kids?\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nthis song is so much effin fun. it's all about growing up and having a good time.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nGreat song.  Love to dance to it wearing walkman at work. People think I'm crazy.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nWell obviously this song is about getting married and having a family, but its also about drugs.  Ob-la-di, ob-la-da is a drug in this song which is made obvious from the very last line.  I think it just shows how fond the culture was of drugs and how much happier they made people, or at least made them feel.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nAgain, I'm not sure about the drug thing... I really don't think there are that many Beatles songs with references to drugs.  That's just me.  Oh there are some, but not that many.  I love the happy upbeat sound of this song... it reminds me of listening to this song when I was a child!\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nwhen you first hear this song, and its about to finish, you think \"Hmm. This is a song free from drug references\"........Until you hear the last line where it says if u want some fun, \"TAKE\" obladiblada.\r\nFUN SONG!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nRishikesh is one word, not two.\n\r\nA guy has a picture of John and Paul in Rishikesh while they are playing Obla Di Obla Da on the guitar. Paul's foot is over the handwritten lyrics and all. \n\r\nIt's so memorable for me. *sniffs*\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nWell the drug thing doesn't work cause actually he sings \"SING obladiblada\".\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nSorry, must have misremembered, it is indeed \"take\".\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI used to hate this song, but I don't mind it now, it's pretty corny but it's good for a laugh, and it does have the word bra in it *g*\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI absolutely love how after \"Built a home sweet home\" and at the later Ob-La-Di choruses there are those awesome horns! It's totally SHAMAZING! Such a great beat.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI think it must have been summer time when this song came out, - probably Marmalade's version - I can remember asking my Mum what Obladi meant - I guess I was about eight years old. It makes me think of happy hot summer days.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nFor most of the song, it is just a happy upbeat song, and mostly just about having fun, until you realize that the Beatles established early in the song that indeed Molly is a girl, and that \"she is the singer in the band\". Then, at the third verse from the bottom, it says:\n\r\n\"Desmond stays at home and does HIS pretty face,\r\nAnd in the evening SHE's singer with the band.\"\n\r\nAnd since they're Desmond and Molly Jones, we can pretty much guess what this song's underlaying meaning is.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nwhaat . it was a mistake\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nvery catchy\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\ntooshea to everyone,\r\nthis is what i most recommended  listening to\r\nwhen sad, depressed or upset.\r\ni enjoy it alot.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI don't think that \"Take ob-la-di ob-la-da\" refers to a drug, I think it just means some absurd word that makes you feel happy, something like \"Hakuna Matata\" in the Lion King.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThe message at the end is that you don't need to take drugs to be happy...just take obladi oblada and you'll be fine. It's kind of like a parody of the hidden drug references in their other songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI love this song. At school I randomly start singing it to people.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nthe beatles take on ska! you gotta love it....\n\r\nSo everyone is saying that Paul messed up on the last part and the rest of the band liked it and wanted to keep it that way, BUT from what I hear, the rest of the band didnt care for the song enough to do a second take. Paul was the only one who liked it.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nHow can anyone not like this song? I love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nAnyone ever think that maybe Desmond is a drag queen?\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\ntotally! i was listening to this today with a friend and her mom, and i was like \"this is one of theirs that i never really got\" and the mom was like \"well, it's a song about a gay couple.\" it made so much more sense then... but then in some ways, less... i dunno, maybe he did just make a mistake. funny song though :P\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nworst song ever\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThis song is hilarious!\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nIn Russian, obladit' is the Ã\u0091Â\u0081Ã\u0090Â¾Ã\u0090Â²Ã\u0090ÂµÃ\u0091â\u0082¬Ã\u0091Ë\u0086Ã\u0090ÂµÃ\u0090Â½Ã\u0091â\u0080¹Ã\u0090Â¹ Ã\u0090Â²Ã\u0090Â¸Ã\u0090Â´ of \"to manage, arrange\", and obladat' is \"to own\".  So allowing for terrible Russian, the title would translate to: \"having arranged my forces, I proceeded to pwn the hell out of these people\". \t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nIt's NOT about crossdressing, that was just a sweet twist on the words. Obviously it's just about life. I have a friend called Molly, and I always sings this to her. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThe story of Paul and Linda McCartney, bra. Paul stays at home and does his pretty face (doesn't have a day job)And in the evening Linda's a singer with the band.\n\r\nAnd if you want some fun, pick Paul and Linda, not John and Yoko.\n\n\n", "comment_51": "\n\"Take ob la di la da\" doesn't necessarily mean drugs. Basically the chorus says \"Ob-la-di, ob-la-da, life goes on\". I get the feeling that by \"Ob-la-di, ob-la-da\" they mean how life pretty much happens, boy meets girl, boy and girl get married and have kids, boy and girl live happily ever after.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nMy GF absolutely luvs this song. Me, I really don't like it that much. It's okay.\r\nIt's more like a Wings song, kinda like \"Hi, Hi, Hi\".\n\r\nI like the fact that John came into the studio stoned & pissed off, then played that piano intro & said \"This is how we're gonna do it!\" Then John & George make sarcastic jabs @ it, when Paul sings \"....lend a hand\". then John & George say, \"Arm\" \"Leg\".\n\r\nI do remember being in 2nd grade @ recess when I heard a car go by blasting this song. It was the very first Beatles song I ever heard.\r\nMuch later, when the 45rpm came out, a friend of mine bought it. \"Ob-la-di...\" on the A side & \"Helter Skelter\" on the B-side. I'd ride my bike over to his house to listen to it. We listened to Helter Skelter over and over! \r\nI like the Anthology version much better!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nThis song is ABSOLUTELY about Desmond being, or becoming, a cross-dresser.  The \"Desmond stays at home and does his pretty face\" lyric in the last stanza should read: \"Desmond stays at home and does her pretty face\".  The song is about changes that often happen in marriages and how, if the couple wants to be happy, they should endure those changes positively - that life goes on.\n\nAs usual, the Beatles are being lyrically sly.\n\nBy the way, \"bra\" is an abbreviation for \"brother\" and should probably be indicated as such (bra').\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis song = life. I love Mr. Lennon with all my heart but I strongly disagree with his opinions on this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI've been listening to the White Album a lot lately, and this song in particular keeps nagging at me ~ and I think I figured out. I think Desmond is a cross-dresser! In the final verse, they've switched roles. How awesome!\n\nHappy ever after in the market place\nMolly lets the children lend a hand\nDesmond stays at home and does his pretty face\nAnd in the evening she's a singer with the band\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI never liked this song cos I didnt like bras....it came out when I was about 14 and embarrassed having to wear one when inside I was more a boy with 2 older bros (not bras!)  I always wanted to be a bare top Indian Brave not wear a stupid bra and be a girl. Maybe Im a gay man in a woman's body! After all, girls can cross dress all they like in western culture. at least around the legs...unfortunately-to hammer the point, I can't come home and take my top off like any guy can. Desmond staying at home and does his pretty face makes me think of a quiet arty type who likes to reflect on his happy face = happy face=happy life. She is an extrovert and likes getting out into the world more than he does, and they can suit themselves within a happy relationship. In the 60's EVERYTHING was changing and any lifestyle up for grabs. I now forgo the bra and feel SO much more comfortable. Burn the awful things indeed!\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThis song has been condemned as bong commonplace, doggerel, even boring. But actually it's deeply subversive.,  A friend told me that she thought the final switching places in the lyric of \"Happy ever after on the marketplace, Desmond lets the children lend a hand, Molly stays at home and does her pretty face...\" to â\u0080¦ \"Molly lets the children lend a hand.. Desmond stays at home and does his pretty face\" was an indication that Molly (the woman) did all the work...but it's weirder than that. The hint of what's to come is what Desmond says to Molly, \"Girl, I like your face\"...\n\nThe truth is that Desmond is a drag queen-- a straight drag queen (they DO exist!). He likes (that is, envies) her face... later, when Desmond is in the marketplace \"Molly stays at home and does her pretty face, and in the evening she still sings it with the band\"... but when Molly's in the marketplace, \"Desmond stays at home and does his pretty face, and in the evening she's a singer in the band\"-- and that \"she\" refers to Desmond, not Molly!  And the jaunty piano riff underlying that last line points it up his stint with the band with his pretty face done up.  Pretty subversive even today, and remarkable for the '60s, which is probably why so few people got it. Desmond and Molly are happy being who they are, however much it flies in the face of expectations.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nHey Roger, I got one word for you...WRONG!!\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nsuck it bitch above me\t\t\t\t\n\t\t\t\t\n\n"}