{"comment_0": "\nThis song is catchy but the meaning is meaningless and vain lol\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nlove this song. =)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ngod, i'm sick of this crap about sides! it's what's called PUBLICITY! notice how their little squabble starts up when their CDs come out. it's so childish to be choosing \"sides.\" especially when you don't know the people! i mean, c'mon. sides? find some real friends.\n\r\neither way. this is a really great pop song. some of the lyrics made me laugh a little bit... but other than that, it's pretty good. great beat. but yeah. the song's self explanitory. no need to comment on its meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nDUH of course it's a shot back at eminem's song haven't you seen the music video??? it's hilarious she is so stupid and eminem made a song back to this one it's called warning\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nNo one thinks that it has anything to do with Eminem's song about Mariah... how Em says they dated and stuff ... but Nick Cannon says its not a retaliation for Eminems song 'Bagpipes From Baghdad'... ya never know though.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis is definitely a diss song to Eminem for his song Bagpipes from Baghdad. I like the song a lot, but i'll take Ems side any day!  \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI love this song. its catchy and its got a good beat.\n\r\nI don't know if its a publicity stunt or whatever, but either way, the song is pretty good. i do agree with musicjunkie09 about how some of the lyrics make him laugh...\"bathing in windex\" for 1. ha. but still a pretty good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nyou should listen to eminems comeback at mariah..its hilarious. \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthis song is amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song is actually a shot a eminem if you want to haer his shot back it is called the warning\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nsuch a shitty song....\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\n\"will the real mc please step to the mic\"\n\r\nquite obvs a rip off from eminem from one of his songs years ago... will the real slim shady please stand up line\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI think it's not Mariah who started it cuz' based on Em's song from Bagpipes in Baghdad, it seemed like he started it. A strong woman wouldn't just sit around and let herself get disrespected so she fought back with the song. So, I don't get why Em's dissing her back when he started it. :\\\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\noh and i hate the song..it makes her seem like a conceited bitch.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI think she wrote this song about Eminem because he made a rumor up that they slept together. \t\t\t\t\n\t\t\t\t\n\n"}