{"comment_0": "\n\"Light of my life, fire of my loins,\" are the opening words to 'Lolita,' if you've read it you'll realise that the song is pretty much like a soundtrack to the book. The book is a classic and LDR has put a nice 'gangsta' spin on it. My favourite song of hers by far...\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAnother classic Lana love song, even more perverse than her other songs. She wants to be loved the possessive way Humbert Humbert loves Lolita, a twisted love of ownership and worship, where Lover Sugar Daddy owns her like a possession and worships her sexually. As per usual with Lana, the spending of money on her equates to love, because Lana likes the masochistic delight of being owned and bought by another person. Giving herself up to be owned by another is the declaration of the greatest possible love for Lana.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI always assumed it was about being in love with a man who really was only with her for her beauty and sex, honestly. He sounds like he's involved in some kind of illegal activity, possibly drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI have the digital booklet! :D \n\r\n\"Up Bacardi chasers\" is \"of Bacardi chasers\" (and the second chorus is \"Now we're off to the races, cases\" instead of \"Now we're off to the races, races\")\n\r\n\"Glass film\" is \"glass room\"\n\r\n\"Fume\" is \"fumes\"\n\r\n\"Tell me you want me\" is \"tell me you own me\"\n\r\n\"Your faces, shameless\" is actually \"your face is shameless\"\n\r\n\"Harlet\" is spelled \"harlot\" (sorry I had to throw that in it was just bothering me :3 )\n\r\n\"The law\" is \"the Lord\" (not literally!)\n\r\n\"I'll never leave you\" is \"I'd never leave you\"\n\r\n\"Pay us\" is actually \"chaos\"\n\r\n\"'Cause you know we'll race this\" is \"casino oasis\"\n\r\n\"Spit\" is \"spin\"\n\r\nOkay all done.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThere is such a big Lolita theme on this record, I LOVE it! :) The light of my life, fire of my lions is taken straight from the book :)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is obviously about the classic \"Lolita\", by Vladimir Nabokov as the opening line to the book is \"Lolita, light of my life, fire of my loins. My sin, my soul.\" Lana has described her style as \"Lolita got lost in The Hood,\" meaning that she has probably read the book, and based \"Off To The Races\" on it. I believe she uses the book as an overall metaphor for her own life, or it could just possible weave between the two. I think that when she sings 'And I'm off to the races, cases\r\nof Bacardi chasers, chasin' me all over town', she is using it as a metaphor. When Lana was younger she had problems with alchohol and I think she is saying that the thought of a drink follows her around, like Humbert did Lolita.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis whole song is about the book and film Lana Del Rey claims she loves: Lolita. \nIf you watch the film it will all make sense and it's a pet peeve of mine people that claim they love this song without having any idea what its about and just thinking it's another love story. It's more than that as in this song Lana sings as if she is Lolita even from her voice which she makes very child like throughout, even the words are sung from the perspective of a child such as the bit where she almost breaks down about her feelings and sings \n\n\"My old man is a thief, and\nI'm gonna stay and pray with him till the end\n But I trust in the decision of the LORD,\nTo watch over us\nTake him when he may, if he may\nI'm not afraid to say\nThat I'd die without him\nWho else is gonna put up with me this way\nI need you, I breathe you, I'D never leave you\nThey would rue the day, I was alone without you\n\nYou're lying with your gold chain on\nCigar hanging from your lips\nI said hon' you never looked so beautiful\nAs you do now my man\n\nThis bit is very childlike as if she is throwing down all her feelings like she's probbably heard about in the movies and its all very desperate like you get over your first love and you think it will never end. It also highlights how much older Lolita (Lana Del Rey) thinks she is by saying all this.\n\nAbsolutely love.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think the speaker in this song is Carmen, from that later track on her album. The songs might just have similar themes but be completely different, but my interpretation is that both Carmen and the speaker in this song are prostitutes. I think \"Carmen\" is about the difficulties of a life of prostitution from an outsider's perspective, but \"Off to the Races\" is Carmen's defense for her lifestyle...she believes (or just tells herself) that she's really living the good life and that her pimp legitimately cares about her and takes care of her.\n\r\nJust a thought :) I had been wondering about this when I heard some similarities in the two songs, ex: \"slipping on my red dress, putting on my makeup\" from this song and \"put your red dress on, put your lipstick on\" from \"Carmen.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nHate to be the annoying lyric correcting guy but: *Cipriani's basement, not 'trippy on his basement'.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nLolita.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nHey I already posted about this on Dark Paradise, but for some reason Songmeanings completely changed the lyrics I put up... Those ones up there (riddled with mistakes) are not the ones I intended to be up there, and it won't let me put mine back up :( So sorry I can't edit them for some reason but here are the ones I originally wrote up: \n\n\r\nMy old man is a bad man but\r\nI can't deny the way he holds my hand \r\nAnd he grabs me, he has me by my heart\r\nHe doesn't mind I have a Las Vegas past \r\nHe doesn't mind I have an LA crass way about me \r\nHe loves me with every beat of his cocaine heart\n\r\nSwimming pool glimmering darling\r\nWhite bikini off with my red nail polish\r\nWatch me in the swimming pool bright blue ripples\r\nYou sit sippin' on your black Cristal, yeah\n\r\nLight of my life, fire of my loins\r\nBe a good baby, do what I want\r\nLight of my life, fire of my loins\r\nGive me them gold coins, gimme them coins\n\r\nAnd I'm off to the races, cases\r\nof Bacardi chasers, chasin' me all over town\r\nCuz he knows I'm wasted, facing \r\nTime again on Riker's Island and I won't get out\r\nBecause I'm crazy, baby I need you to come here and save me\r\nI'm your little scarlet, starlet singing in the garden \r\nKiss me on my open mouth \r\nReady for you\n\r\nMy old man is a tough man but\r\nHe got a soul as sweet as blood red jam\r\nAnd he shows me, he knows me \r\nEvery inch of my tar black soul\r\nHe doesn't mind I have a flat broke down life\r\nIn fact he says he thinks it's why he might like about me\r\nAdmires me, the way I roll like a Rolling Stone\n\r\nLikes to watch me in the glass room bathroom, Chateau Marmont \r\nSlippin' on my red dress, puttin' on my makeup \r\nGlass room perfume Cognac lilac fume\r\nSays it feels like heaven to him\n\r\nLight of his life, fire of his loins\r\nKeep me forever, tell me you own me\r\nLight of your life, fire of your loins\r\nTell me you own me, gimme them coins\n\r\nAnd I'm off to the races, cases \r\nof Bacardi chasers, chasin' me all over town\r\nCuz he knows I'm wasted, facing \r\nTime again on Riker's Island and I won't get out\r\nBecause I'm crazy, baby I need you to come here and save me\r\nI'm your little scarlet, starlet singing in the garden \r\nKiss me on my open mouth \n\r\nNow I'm off to the races, laces \r\nLeather on my waist is tight and I am fallin' down\r\nI can see your face is shameless, Cipriani's basement\r\nLove you but I'm going down\r\nGod I'm so crazy, baby, I'm sorry that I'm misbehaving\r\nI'm your little harlot, starlet, Queen of Coney Island \r\nRaising hell all over town \r\nSorry 'bout it\n\r\nMy old man is a thief and I'm gonna stay and pray with him 'til the end\r\nBut I trust in the decision of the lord to watch over us\r\nTake him when he may, if he may \r\nI'm not afraid to say that I'd die without him\r\nWho else is gonna put up with me this way? \r\nI need you, I breathe you, I never leave you \r\nThey would rue the day I was alone without you\r\nYou're lying with your gold chain on, cigar hanging from your lips\r\nI said \"Hon' you never looked so beautiful as you do now, my man.\"\n\r\nAnd we're off to the races, places \r\nReady, set the gate is down and now we're goin' in\r\nto Las Vegas pay us, Casino Oasis, honey it is time to spin \r\nBoy you're so crazy, baby, I love you forever not maybe\r\nYou are my one true love, you are my one true love\n\r\nYou are my one true love\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nLana's style is described as \"Lolita lost in the hood,\" so she's obviously familiar with the book Lolita by Vladimir Nabokov... \"My old man is a bad man, but I can't deny the way he holds my hand..\" Lolita is all about a man who has a sexual relationship with his stepdaughter...\nIn the chorus: \"And I'm off to the races, cases, of Bacardi chasers, chasing me all over town-\" Lana has admitted to having an alcohol problem in school, she's written about it in songs like Carmen or This is What Makes Us Girls.. But it could also be metaphorical for the way Dolores (Lolita)'s stepfather follows her around.\n\"'Cuz he knows I'm wasted--\" in the book, Lolita's stepfather makes her fall asleep with a medicine, so he can get sexual favors...\nThis song is very much about Lolita, but the way she wrote it is so amazing, it is a metaphor for her life, basically.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nAs many people have said, this song refers to the novel, Lolita, by Nabokov. The line \"light of my life, fire of my loins\" comes directly from the book, and is actually the first line. In the novel, Lolita originally has a chidlish crush on the narrator, Humbert, and he describes her teasing him. The segment about the swimming pool is in the novel, as Humbert watches Lolita many times as she is swimming. He also calls her is starlet at times. Humbert is arrested in the end of the novel, and is referenced in this song. Lana obviously weaves in some of her own twists, and sings it from the point of view of Lolita. But it all stems from that book, and the movie.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think she uses \"the races\" as a symbol for risk and luck. People go to the races and place bets on horses; of course, any gambling or betting induces risk or chance of loss. This relates to her relationship, in which she knows there is risk of losing everything, yet she bets everything on it to \"win\" or get the \"prize\" of a successful relationship. The lyrics suggest he is a \"bad man,\" with his dark soul and tough nature and all the other one-liners that insinuate danger and an evil nature. She lists everything bad about him, and yet se still loves him clearly, which is a common theme in all of her music--loving someone completely, regardless of his obvious flaws. I LOVE the flow of this song--the rhythm, how she sings the words, how they all flow so well and rhyme and everything. Casino, races, Las Vegas etc. are all references to betting/gambling, or things that may harm her in the end. She goes for it anyway, she \"trusts in the decision of the lord.\" The song is also rather sexual, as he obviously has a very firm \"hold\" and \"grab\" on her, and the \"light of my life, fire of my loins.\" This isn't the only reference to Lolita on the album, which also describes an older, dangerous man. but as Lana has said, danger = interest. A safe love would be boring. The chorus shows a duality to her character: the innocent outward appearance (\"singing in the garden\") matched with the inward, actual dangerous/crazy/naughty personality. There are lots of references and objects so as to give the listener a clear picture in his/her mind. Throughout the song, she is never unsure of her feelings for him, and the end sums up her positivity: \"Love you forever, not maybe--you are my one true love.\" Her chances of a happy relationship may be risky and slim, but her love for him--for better or worse--is absolutely definite.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI like this song over the others on the new album because .... \n\r\nthe words and interpretation sound like a galloping horse, they move and remind me of the up and down movement of a horse running in a race. Chuck Berry used to write songs with alliteration and rhymes that create a rhythm an a beat that I am crazy for.  there is a glut of song writers out there today who suck at writing songs. Hoagy Charmichal wrote songs as well that rhymed, touched a persons heart and swang to a beat. \n\r\nThen the words in this song paint mental images of a sex kitten who is a bad girl but wants to be loved... which is very seductive, especially when she hits the \"lot\" sound in harlot ... makes an old man weak,,, \n\r\nthose things are cool but the alliteration and rhyme scheme makes this song have a hook I can't get out of my head.\n\r\nand I love a good hook\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nIt sounds like a nice and unhealthy relationship where he is probably a gangster boss with loads of money and she is a pretty young thing that is emotionally unstable - she's the only one who will put up with who he really is (a hard criminal) because she realizes nobody else would put up with her antics. \n\r\nThe \"my old man\" part obviously refers to the fact that the man is older than the girl, but I'm still a bit uncomfortable with that to be honest, as \"my old man\" is not a common reference for a partner of ANY age, it's used as an exclusive reference to a father... so it sounded incestuous to me at first. Then I realized it must also be daddy issues (beside excessive drinking, dramatic/extreme behaviors and also borderline criminal).\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis song is not about Lolita, it is about Humbert Humbert from the perspective of Delores. It's done beautifully.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThe phrase \"glimmering darling\" is also from Lolita.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis song seems to be about a young girl who is in love with a much older man (\"my old man\"- often used to refer to fathers) who abuses her, and as others have said it heavily references \"Lolita\". \nSome lines also may indicate he is pimping her out, making her stay by exploiting her feelings for him (pimps often try to claim they love the girls to stop them running away) :\n \"Gimme them gold coins\"- she has to give him money she earns from prostitution.\"\n\n\" 'Cause he knows I'm wasted,\nFacing time again at Riker's Island\"- he feeds her drug/drink habit and threatens with turning her into the police\n\n\"tell me you own me\"- she couldn't leave even if she wanted to\n\n\"Cigar lying with your gold chain on\nCigar of hanging from your lips\"- stereotypically this is what pimps/gangsters look like.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think she's comparing her romance to the of the one in the book Lolita (which by the way is a disturbing story about pedophilia and manipulation and I'd like everybody to stop romanticizing/fetishizing it), and he's a much older man, the speaker is barely 18 and the man is like 40, maybe she is in a situation where she has no parents around or a way to support herself and this dude is her sugar daddy, and anyway he's a criminal of some sort, maybe he sells drugs, and he buys her things in exchange for her affection.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nIt's not \"Krystal,\" it's \"Cristal,\" the drink.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI think this is about how she has an older boyfriend that is rich and doesn't care what she did in the past, he wants her for her looks and she knows it but she's enjoying all of the glitz and glamour that goes along with being with him. Such a great tune.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nNope. Not all done.\n\r\n\"Now I'm off to the races, laces\" is \"Yo, I'm off to the races, laces\"\n\r\nHeh :3\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\n\n\n\n", "comment_24": "\nMy old man is a bad man\nBut I can't deny the way he holds my hand\nAnd he grabs me, he has me by my heart\nHe doesn't mind I have a Las Vegas past\nHe doesn't mind I have a L.A crass way about me\nHe loves me with every beat of his cocaine heart\n\nSwimming pool\nGlimmering, darling\nWhite bikini off with my red nail polish\nWatch me in the swimming pool\nBright blue ripples, you\nSitting sipping on your black crystal, oh yeah\n\nLight of my life, fire OF my loins\nBe a good baby, do what I want\nLight of my life, fire OF my loins\nGimme them gold coins\nGimme them coins\n\nAnd I'm off to the races, CASES\nOF Bacardi CHASERS\nChasing me all over town\n'Cause he knows I'm wasted,\nFacing time again ON Reiker's Island\nAnd I won't get out\n\nBecause I'm crazy, baby\nI need you to come here and save me\nI'm your little scarlet, starlet\nSinging in the garden\nKiss me on my open mouth\nReady for you\n\nMy old man is, a tough man\nBut he got a soul as sweet as blood red jam\nAnd he shows me, he knows me every inch of my tar black soul\nHe doesn't mind I have a flat broke down life\nIn fact he says he thinks it's what he might like about me, admires me\nThe way I roll like a rolling stone\n\nLikes to watch me in the glass room, bathroom\nChateau Marmont\nSlipping on my red dress, putting on my make up\nGlass film, perfume, cognac, lilac,\nFUMES, says it feels like heaven to him\n\nLight of his life, fire of his loins\nKeep me forever, tell me you want me\nLight of your life, fire of your loins\nTell me you want me, gimme them coins\n\nAnd I'm off to the races, CASES\nOF Bacardi CHASERS\nChasing me all over town\n\n'Cause he knows i'm wasted, facing\nTime again ON Reiker's,\nIsland and I won't get out\n\nBecause I'm crazy, baby\nI need you to come here and save me\nI'm your little scarlet, starlet\nSinging in the garden,\nKiss me on my open mouth\n\nNow I'm off to the races, laces\nLeather on my waist is,\nTight and I am falling down\nI can see your faces shameless\nCipriani's basement\nLove you, but I'm going down\n\nGod I'm so crazy, baby\nI'm sorry that I'm misbehaving\nI'm your little harlot, starlet\nQueen of Coney Island\nRaising hell all over town\nSorry 'bout it\n\nMy old man is a thief, and\nI'm gonna stay and pray with him till the end\nBut I trust in the decision of the LORD,\nTo watch over us\nTake him when he may, if he may\nI'm not afraid to say\nThat I'd die without him\nWho else is gonna put up with me this way\nI need you, I breathe you, I'D never leave you\nThey would rue the day, I was alone without you\n\nYou're lying with your gold chain on\nCigar hanging from your lips\nI said hon' you never looked so beautiful\nAs you do now my man\n\nAnd we're off to the races, places\nReady set the gate is, down\nAnd I'M going in\nTo Las Vegas, CHAOS\nCASINO OASIS\nHoney it is time to SPIN\nBoy you're so crazy, baby\nI love you forever\nNot maybe\nYou are my one true love\nYou are my one true love\n\nYou are my one true love\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song to me reminds me of an abusive relationship and she can't leave.\" My old man is a bad man but I can't deny the way he holds my hand\". She knows he is bad but for some reason she just can't leave. Maybe a dysfunctional relationship like that between Dolores and Humbert in Lolita.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nQuestion:\nWhat do you think she means by \n\"In fact he says he thinks it's what he might like about me, admires me\nThe way I roll like a rolling stone\" \nI don't understand the allusion to a rolling stone. A Rock? Or The band?\nLike odes she mean that he loves her 'cause she's going down? or because she keeps on rolling even through the punches of life?\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI believe this song is actually not too cryptic. As in it is about her father, but in the way she says 'Harlet'and 'I see your face is shamless' then I have a feeling it could be slightly about child abuse?? Does anyone else have this feeling?\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI think she's actually referring to her dad..\nHe's a millionaire so it kind of fits..\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nwhite girl rap !! Yes Please ~ No need for deep thought on this one .. Just flows good\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI'm sorry, All. But Lana Del Rey is not a human being- but a mind controlled robot who has suffered IMMENSE MK -Ultra style programming. And she was born into it. Her father was a very wealthy man with ties to the global elite, who preffered young \"Lolita\" types and even little boys.MK-ULTRA is a CIA mind programming practice done for almost 100 years. They would do sick, deranged things to these children. In Lana's case, she was Elizabeth Grant, and her father used her as well as his wealthy partners. In MKUltra mindprogramming, they cause so much trauma to the person that their complete self shatters into a million pieces, then usint hypnotizing movie flicks, sound clips, quotes, and others, they re-program the victim. They can program you to be a sexualized doll who will do whatever they want without protest (Marilyn Monroe was the first and the most  famous MK slaves... MK slaves of today often pay homage to Marilyn by posing as her or referencing her.) They can program you to be violent, and carry out assassinations with precision. \nIn my opinion, this song is about what her father did to her and how in her eyes, it's love. \"Handlers\" often say they LOVE their slave, and she feels like he is her one true  love because she is so messed up now that no one could ever understand or or love the programmed robot that she was forced to become.\t\t\t\t\n\t\t\t\t\n\n"}