{"comment_0": "\nYour twisted mind is like snow on the road - her thoughts are dangerous, possibly life threatening\nYour shaking shoulders prove that it's colder/Inside your head/In the winter of dead - these say that she (possibly she is crying) thinks cold thoughts, or dark thoughts\nI will tell you I love you/But the muffs on your ears will cater your fears - Even when he tells her he loves her, she is so convinced that any compliments are lies and that no one could ever love her. The 'muffs' could possible be referring to low self esteem or depression\nThe next lines are saying how he still doesn't give up on her\nWe will walk/So much slower - to me, this is referring to making their way out of depression, saying it might take a long time, but they will support each other\nThe next verse speaks about how its foreign to them both, but together they can do it\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ni saw someone say this on youtube:\r\noh, ms believer could mean oh, misbeliever. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIt is about love, probably romantic love but nor necessarily. The girl struggles with an internal world that is far worse than cold reality, but he is dedicated to helping her survive and convincing her she is loved.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWow! And the light bulb shines! Thanks to my fellow commenters, I now have a better meaning to this song. (Misbeliever) gives the song so much more meaning, than what I thought. I never made the connection, but the rest of the lyrics fit perfectly. \n\n\"Oh, Miss Believer, my pretty sleeper\n Your twisted mind is like snow on the road\n Your shaking shoulders prove that it's colder\n Inside your head\n In the winter of dead\"\n\n-This is the picture of the unbeliever. Asleep, twisted thoughts and beliefs, without understanding, fear, cold (heart), death.\n\n(I will tell you I love you\n But the muffs on your ears will cater your fears\n My nose and feet are running as we start\n To travel through snow\n Together we go)\n\n-God, by his Holy spirit gives us opportunities galore to accept his love. To believe in his truth, but we are distracted by everything, like our car radios (down with them all!!!) :) We ignore his promptings to follow him because we would rather do things our way. We are selfish and sinful, but he offers life, for the wages of sin are death. Traveling through snow is hard, as is the journey of a believer, but the life of an unbeliever is no life at all.\n\nAnywayzzzzzz...  Yesterday this song was just a pretty sounding one about some chick. And today it is new to me. The same, but better all around. I hope \"Ruby\" is metaphorical and will change too.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI see this song as coping with uncertainty (in Tyler's case possibly religion) and misbelief. Sorting through doubt and questions with no answers is a slow and arduous process, and can feel like walking through thick snow. As you get older these fears and uncertainties don't go away, but rather increase in number. Hence, as we grow older, we get colder.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI agree with the comments above but i have noticed one thing about the title: oh, ms. believer is a pun for oh, mis-believer so it just further shows that she doesnt believe him when he says he loves her.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nit think God is talking to MIS-believer as she doesn't believes in him and he is trying to call her back to him.\n\r\n\"I will tell you i love you but the muffs on your ears would cater your fears\"\r\nthese lines perfectly explain my theory as God is telling her that he loves her but her 'muffs' which can represent the world or her sins are stopping him to do so and her fears are preventing her from coming back to God as well.\n\r\n\"Please,take my hand,we're in foreign land/As we travel through snow/Together we go\"\r\nthis is also God requesting her to come with him.And as she is a misbeliever,it would be hard for her to come back to her religion which is why it says \"As we travel through snow\" as walking in snow is pretty difficult.\n\r\nalso it says \"pretty sleeper\" and \"pretty weeper\" just to represent God's love and how God loves however his creation is.\n\r\nLastly the twisted thoughts the person is getting can be blasphemy and doubt in God -the continuation of the comment made by me \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI discovered Twenty One Pilots while streaming music and started listening to all their albums. Usually during work, so I never actually learned song titles right away. When this song came on, I originally thought he was saying \"misbeliever.\" So my thoughts on the song meaning are like what @ginnyboy posted on 05/03/2016. Not saying it can't be about a girl, BUT...from what I've read, apparently the first song he wrote about a girl is \"Tear In My Heart\", soooo...\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nTo me, this song is pretty simple. The lyrics tell the story of an elderly couple from the point of view of the husband. This couple has been together for many years, thru thick and thin. Think of your elderly grandparents, who are nearly incapable of self care. Thru the lyrics, it is apparent that the wife suffers from either dementia and/or alzheimer's. The snow and cold in this story is actually age, and its affect on our bodies...slowing us down as the years pile on. She is called both Misbeliever and Miss Believer, which describes her perfectly as she often forgets who her husband is (and sometimes remembers) as anyone who has ever had a loved one with alzheimer's would know the emotional pain involved. The words \"Inside her head, in the winter of dead\" only lead credibility to the fact that age (winter) has taken her mind (memory).\n\nThe song ends with this:\nWe get colder\nAs we grow older\nWe will walk\nSo much slower\n\nMeaning he will remain by her side, until age takes them both......\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI like to think this song is a love song about a girl who believes in something, whether it is an aspiration to become or a fantasy world. Her thoughts are unique and dark, but beautiful in her own way. He sings about how much he loves her for the way she thinks rather than her appearance. He loves her unconditionally for who she is. \t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI personally think that in this song he's talking about a girl her loves (maybe not like in a relationship, maybe just friendship) who he admires for believing. And although to most she's \"miss believer\" and she seems quite perfect because of it, he can tell how much she's hurting inside, for example when he says \"your shaking shoulders prove that it's colder inside your head than the land of the dead.\". But yet, even though she's struggling she still choses to have hope, and that to him is even more inspiring and he loves her for it. When he says \"we travel through snow, together we go\" he is referring to how he's going to stick by her side through the hard times because if they continue to stick it out, she believe they'll eventually reach the light at the end of the tunnel. However the chorus: \"we get colder, as we grow older. We will walk so much slower\" I believe refers to how as we grow up we lose sight of what we believe in often times and we become \"colder\". Also, the fact that they're walking so much slower as they grow up refers to that loss of faith and the doubt that they begin to have about there being a light at the end of the tunnel.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think that this song is very much a religious song. This is assuming that the \" miss believer\" is a misbeliever, but here it goes. Tyler, being Christian, would believe that God is always there even in the most desperate of times. However, if you don't believe then he's not real to you all of your struggles are much harder to deal with especially suicide in Tyler's case. By taking God out of your life you're putting snow on an already dangerous road which is life. Tyler will tell the misbeliever that he loves them but their fears will not be taken care of by that alone. However, no matter what you believe Tyler saying that he'll walk with you.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI want to point out one big sometimes skipped over lyrics. \"But the muffs on your ears, will cater your fears\", could be talking about how people accept parts of the Bible and not others (remember Tyler's faith), because they fear that something good can't happen twice, or that they won't be able to live how they want to.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\n\"Oh ms believer\"\nCould be oh misbeliever\n\"My pretty sleeper\"\nTyler, the songwriter, is in love with her\n\"Your twisted mind is like snow on the road\"\nHer thoughts are dark, possibly leading her to self harm or commit suicide\n\"Your shaking shoulders prove that it's colder inside your head than the winter of dead\"\nAgain, her thoughts are dark, which worries tyler. \n\"I will tell you I love you but the muffs on your ears will cater your fears\"\nHe tells her she loves her, but she thinks that he's lying and that everything is out of pity.\n\"My nose and feet are running as we start to travel through snow\"\nDespite her dark thoughts, he still loves her.\n\"We get colder as we grow older\"\nHer thoughts/depression could possibly be getting worse over time.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI agree with everything  @ginnyboy said, and I wanted to add to anyone else: the first song Tyler ever wrote about a girl was Tear in My Heart (his wife, Jenna.) He wanted to wait until he was married to write about a girl so he'd know it was forever. So this song isn't about a lover or anything. \n\n\n", "comment_15": "\nI agree with most of you but also I would like to add maybe itâ\u0080\u0099s about an ex girlfriend Iâ\u0080\u0099ve seen pictures of him high school age with another girl. Maybe she believed him at the start but then told him since nothing was happening and his band was failing that sheâ\u0080\u0099d leave him which left him in a depressive state\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nReading all of these comments baffled me, had no idea Twenty One Pilots had such religious undertones. I always thought the song was pretty sacrilegious, actually. \n\ntwisted mind -> snow on the road/ rooftops meaning the indoctrinating messages sound pretty but are actually dangerous.\n\nmuffs on your ears will cater your fears ->  indoctrination and purity culture have convinced you you're broken and undeserving, so you aren't able to accept love when it does come.\n\ncolder inside your head than the winter of dead -> again the indoctrination, piety shame and purity culture make you feel worse on the inside than the godless death they threaten.\n\ngrowing older - getting colder, take my head we're in foreign land -> religious influence is pervasive, it's colored every facet of our culture (NA), we walk through the same cold that's in your head. but we're still walking, and we're in foreign land, *we're going somewhere*. As we get older the ideas solidify, we become too cold to keep walking, to keep exploring. If we eventually realize our religious beliefs may be false, it could be too late to truly chase a genuine human experience, we may be too set in our ways to try (real talk this is happening to my grandmother right now, she's been going through the motions her whole life, maybe believing maybe not, but as she's getting old enough to genuinely consider death, she's falling into a big depression. She know's it's not real but her whole life it's given her enough comfort to never search for anything that matters to her). So please take my hand and wander through snow looking for a way out, for self esteem, freedom from the negative impacts of the doctrine, other secular values, warmth.\n\nAnyway, from the looks of it nobody here's gonna love this interpretation. I don't mean to insult anyone's faith, if I seem like I'm bluntly stating my beliefs like facts it's only because everyone here seems to be doing that already. I was just reaching out in case anyone else came here expecting a secular/anti-theist interpretation, even if it's not what Tyler Joseph intended.\t\t\t\t\n\t\t\t\t\n\n"}