{"comment_0": "\nThis is a great poetic song about something that is a part of Kenny's life  - an old blue chair in the sand, somewhere in the carribbean (or wherever). This chair is like his second home...everyone has a place where they can go, a place of inspiration, a place to get drunk, or just be alone. For him, that chair is his place. It is where he sees the world in its greatest majesty. I also like nature/outdoors...and I find places to go wherever I am at the moment to be alone...but nothing cmpares to the way you see the world from your special place. For Kenny Chesney, it's that old blue chair in the sand, and that's good enough for him.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ni feel that the song is about relaxation. that when he's in that rocking chair nothing else can even come close to the feeling he has.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI believe he actually says \"Cruzan and diet\" not Malibu.  Not a big deal b/c it's still rum but I picked up on the Cruzan reference the first time I heard this song.  I know Cruzan started sponsoring his tour a year or so ago, and while it is a really good rum, I just thought it was a bit odd than he wouldn't just say \"rum and diet.\"  I hope Kenny didn't sell out to them and now has to mention them in songs as part of a contract.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nMy bad, I didn't realize this song was originally on his previous cd and that originally it actually was \"Malibu and diet.\"  Anyone else think is a bit odd?  Anyway, this does confirm my selling out to Cruzan theory, although I'm sure there's a good chance he actually drinks the stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\noh i know for sure he drinks that stuff...he knows what's good.  anyway, this is probly the hardest song kenny has ever written.  i heard him say in an interview how every single word in this song is true about him.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n\"Looked at my life, where it's goin', where it's gone\"\r\nNo better place to do such a thing than from an old chair with so many memories attached to.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThe line that says \"watched boats sail in and out of cinnamon bay\" shows to the location of his home in st. john, usvi\r\nit looks out at peter and cinnamon bay. you can see it from cinnamon bay\r\nand he definitely drinks cruzan it is THE rum down there.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nShakerMaker....you are correct, he does say Cruzan and Diet but only in the Ocean version of the song.  Great song any way you look at it, I prefer the Ocean version, as close as a fan can get to the way he originally came up with the song.  I can vision him sitting in the chair and after tinkering with a few versions, says \"yo check this out.\" ...now get us a couple of beers.  \t\t\t\t\n\t\t\t\t\n\n"}