{"comment_0": "\nWow, how come this doesn't have any comments yet? Nevertheless, it's a really great song, one of my favourites at the moment. It has such a uplifting and feel-good tune, and the lyrics and the song never cease to make me happy.\n\nI think the lyrics are pretty clear, I think it's about being happy and feeling great about and finally appreciating your life after feeling down for a life. I think it's kind of like you don't know what you have until you've lost it, so you might as well appreciate everything you have, and also that it sometimes can be hard to feel happy and appreciate life, but you got to work for it, and get up as he sings, and it will eventually be worth it, when you finally get that feeling of being on top of the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ncan someone explain what they mean by \"paying my dues to the dirt\". Thanks!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIn my opinion the song is actually about someone who finally found the love of his/her life. \n\nOf course, I'd agree with the more general interpretations of someone who found his/her purpose in life, as well, but given the first sentence in particular, I'd say that it refers more to love in particular. (\"If you love somebody\nBetter tell them while theyâ\u0080\u0099re here â\u0080\u0099cause\").\n\nThe singer explains that he finally found the love of his life and that he is more than happy, in other words \"on top of the world\". He has been waiting for that for ages and been through some pretty tough times without any perspective of finding someone. \"Paying my dues to the dirt\", meaning in this context that he was very low, very close to the ground, in a very bad state, at some point, but then he pulled himself together again (\"it's a long way up when you hit the ground\", \"get up now\") and finally found someone whom he either already told already or still wants to tell.\n\nThis song is so cheerful and really reflects how I feel when I have (at least) a crush on someone! :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think that this song is about going after your dreams, even after you thought about giving up. The writer waited for this moment in his life and finally after much hard work, they get to live out they're dream.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthis is truly an amazing song, amazing flow to it.\n\r\ni think this song is about a kid who can escape to a place (s)he calls theirs. a place to be their self; where no one can say right from wrong.\r\n\"waiting on this for a while now,\"\r\nalso about someone who achieved what they have been shooting for. they got to where they needed to be.\n\r\n\"You'll never know until you try\" is the quote i get from this\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nDo y'all not realize the music video is them staging the moon landing?\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIt seems to me this is someone who has had a goal all their life, and now that he's fulfilling that mission he is trying to remind himself this is what he wanted, successfully I might add.  Nice inspirational piece.  I like it better with the lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song is my go to song before I take an exam. It just gets me in an amazing mood! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI love this song.  It is very inspirational in lyrics, melody and tone.\n\r\nMy interpretation of \"paying my dues to the dirt\" is organic.  This song is all about accomplishing something you have dreamed about since childhood.  Compared to a seed, which grows with soil, water, warmth and sun, when one's goals and desires are finally fulfilled, we can pay our dues to the \"dirt,\" or the circumstances, places, trials, challenges, etc. which were the soil that grew us to the point of accomplishment.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nHeres my input on this\n\r\nI think that this song is about the feeling that people get when they are at a high moment in life (not drugs), and they are extremely happy. \n\r\n'If you love somebody\r\nBetter tell them why they're here 'cause\r\nThey just may run away from you'\n\r\nI think that this is saying that if you like someone, and you know that that is the right person that you want to be with, than go for it! This song is also explaining the pure joy and excitement of being accepted.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI interpreted this wonderful song to mean that the singer has been through dark times, but now can smile and be happy. He has found joy in life again.\n\nI've been waiting to smile, 'ey\nBeen holding it in for a while, 'ey\n\nJust a thought!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI love this song, the tune always cheers me up-I love all of their music-Dan Reynolds looks so sweet!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI've only recently discovered this band. They are amazing! I knew the song radioactive, but didn't know who it was. \nI watched on youtube this one live, it's really uplifting, love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nFirst verses:\r\n(Don't hesitate to exchange true feelings with someone because they could be gone -pass away- at any moment)\n\r\n(You don't know when anyone could die and you won't know how they feel about you, or what could have been with your relationship except when you see them again in heaven after you also pass away at an unknown time.)\n\r\n(He's been in a deep depression.)\n\r\n(You can be rich or famous and have all the materialistic things in the world but it doesn't matter in the end. Your loved ones could die at any moment and your time with them is precious.)\n\r\nPre-Chorus:\r\n(He savors all the happiness he's found but doesn't dwell on the past because he's terrified of relapsing.)\n\r\nChorus:\r\n(He's finally found happiness he knew was possible but he had to strive for it. He's been paying respect to loved ones buried in the dirt and they are also the 'soil' that has provided the nourishment for him to bloom into the happy person he has become)\n\r\n(He wants to share this happiness with with anyone he can help out of their depression as well -referencing his previous lyric, the way out of the depression is not worshipping materialistic idols but rather spending time with loved ones-)\n\r\nSecond verses:\r\n(He was probably experimenting with drugs or other materialistic idols that promise happiness but they always failed him. Or it could be a little more literal as if he wanted to take the easy way out of issues but he tried to avoid them instead of dealing with them and fixing the problems in his life.)\n\r\n(He could've stopped trying to be happy maybe even commit suicide but he felt that there had to be a purpose to his life and he had worked too hard to find out what is was to give up.)\n\r\nBridge:\r\n(He's trying to help others that are also depressed, and questioning their existence. He says he knows it's horrible and it's very hard to get out of depression, but it's possible, and you have to get up and try to walk again no matter how many times you fall. Life is what you make it.)\n\r\nHope this helps! This is my first SongMeanings post! -Spencer\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI love this song! It has such meaning to me. It talks about being on top of the world...take it in but don't look down....It is a reminder that when we reach success don't look down on others who haven't been so lucky. \nI also love the \"Paying my dues to the dirt.\"means to remember where you came from...the soil that nourished you as you grew and like a mature plant bears fruit, someone with success needs to \"pay back\" and not forget what nourished their growth. I see Imagine Dragons paying back in a lot of ways, one being the Tyler Robinson Foundation. Great song that really motivates you to evaluate where you are, where you are going and to always remember to show appreciation for where you came from! LOVE IT!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI don't know if I am crazy or what but I think this song is actually about dying. If you look to lyrics from that point of view it all becomes pretty clear.When he says:Youâ\u0080\u0099ll never know quite when, well\nThen again it just depends on\nHow long of time is left for you\n\nit seems like he is talking about how it all becomes clear when you die..if someone wants me to explain this further i will.. but just read the lyrics 2,3 times and you'll se by yourself\t\t\t\t\n\t\t\t\t\n\n"}