{"comment_0": "\nThis song is about anal sex\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nnow, in these days do people really care what the lyrics are (they should) do you know how many times people reply to his youtube songs saying... he is so cute, hot, a good singer, I love him. It is good that you love him but do you love his songs, not the beat or the music videos, but the meaning of the song, if you understand the meaning of the song, not just one phase, but every world in the song then you should comment on how you love in the song he (as in Justin) is stating that he will put everything in his life to the side just for that special, number one girl!!! I am 13 and I never wrote something so touching like this before!!! :) I only went on this site to see if anyone knew what the meaning of shawty was, if it was like shorty ( as in he likes short girls), or this special girl.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI came on this site to find the meaning of the song.  All I received was a list of comments saying, \"I LOVE YOU JUSTINNNN!\" I do understand when you create a comment you have the option of Opinion, but seriously, this is a song meanings site.\n\r\nWhat does this song mean?  Why is he only saying \"I love you\" one time?  Why can't he say it more than one time?  Is he embarrassed that she's his girl, so he'll only say he loves her once?  Does it just go along with the motif of \"one\" in the other lines in the song's chorus? I've read the versus and they just contain meaningless \"be my girl\" \"I like you\" \"people say we shouldn't be together\" nonsense.  It just doesn't make sense at all.  It a another silly love song that just contains blabber. \n\r\nI also find it funny that he'll only tell her once, but repeats that he'll tell her once many times. Ha, though he's probably saying that he'll tell her once in that time frame.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song has no deeper meaning than Pre-Teen garbage.\n\r\nJ.B sucks and can't sing.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI F***ING HATE THIS SONG!!! JUSTIN BEIBER IS A LITTLE GIRL. How can guys like this kid!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nHis voice is way to high to be fifteen! And in the video, he acts some much like a black person (not to be racist, but it's true)\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nthis song might be sweet if it were sung by someone who meant it. i mean, \"Girl, i love you...\" seriously? you're 15. if it were by a 21 year old with a deeper voice who knows what love is, it might be better, except that if someone older sang it, he wouldn't have an excuse for the song to be a bit childish.\r\n\"and I'll be your one guy You'll be my number one girl\" i love this line, because it literally says I'll be your one guy, and you'll be my number one girl, as in I have others, but you'll be my number one. i think thats funny, but i know it doesn't really mean that.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nBiebs suks. Period. He says \"tell you one time\" approximately 18 times in the song. He doesn't know shit about love, and he says ayyyy too much. He also has no right to say \"shawty\" in a song. STFU Bieber, STFU!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nStrange, Has no one noticed that lyrics are incorrect.\r\nI found these lyrics, I hope it helps :)\n\r\nI was once a man before I transformed\r\n into this molester, freshly deceased children\r\n You have born, torn by my rape\r\n The dead are not safe, the lifeless child corpse\r\n I will violate\n\r\n Pleasure from the dead, complete satisfaction\r\n I open the coffin\r\n Sick thoughts run through my head as I stare\r\n At the dead, over and over, I can't escape\r\n I begin the dead sex, licking her young, rotted orifice\r\n I cum in her cold cunt, shivering with ecstasy\r\n for nine days straight I do the same\r\n She becomes by dead, decayed child sex slave\r\n her neck I hack, cutting through the back\r\n I use her mouth to eject\n\r\n Here I cum, blood gushes from\r\n bleeding black blood\r\n her head disconnected\r\n As I came, viciously I cut, through her jugular vein\r\n She's already dead, I masturbate with her severed head\r\n My lubrication, her decomposition\r\n Spending my life molesting dead children\n\r\n Intercourse with infants\r\n Curing heads on top of spikes\r\n boiling skulls\r\n Skin sliding off of bones\n\r\n Voices\r\n The voices call\r\n Voices\r\n The voices are calling me\r\n Buried dead I've spiritually infected\r\n Call to me from beyond their graves\n\r\n Bleed\r\n I now bleed pus\r\n I bleed, the blood of the dead\r\n I bleed on her livid skin\r\n Thrusting myself within\r\n Beginning to chop through her hairless crotch\r\n Beyond what we know as death\r\n It haunts me everyday\r\n I hear the voice of every child\r\n That lies next to me decayed\r\n A fresh corpse, to fill with my infection\r\n Tortured before death, no orifice left unfilled\n\r\n Violated after death\r\n Virgin hole I infest\r\n Anal pore spewing cess\r\n The sacred juice I injest\r\n Your dead child I defile\r\n Necropedophile!!!!!111!!1!!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni thought that this was a girl singing it \r\nuntil i went to look the song up and i kept researching because i didnt believe that it was by a boy.\r\nim amazed. i wouldnt sing like that if my voice sounded like that. \t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI dont understand why people are hateing on the fact he is 15. i could care less i am 18 now and dont you guys remember being 15-16 having your first boyfriend/girlfriend and thinking that you love him/her. i mean if you are saying \"this kid dosnt know what love is he wont know till he is 21, when he gets older and sings it this song might actually mean something and be true\" Just remember once you were 15-16 and you thought you found love and you never wanted to let that person go. i have been with the same guy since i was 16 and who is to say that he wont find a girl who he will be with for a long time.\n\r\nto the people who say they find it funny because he says \"let me tell you one time\" but he repeats it. i think he is saying give me the chance to tell you that i love you, and if you are ok with it i will continue to say it.\n\r\n\"even thought it's a struggle love is all we got\r\nso we gonna keep keep climbin till the mountain top\r\nyour world is my world And my fight is your fight\r\nmy breath is your breath And your heart\" this is my favorit verse. because alot of time love is a struggle but if you care for someone enough you guys will fight till it gets better and i know onece you get to the top it might be slipery but you will over come!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nHe says \"one time\" 25 times in the song...\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ni love this song , its really cute,,, i think its really sweet it just about being in love and wanting to stay together and doing anything u can to keep together...it kinda reminds me of me and my bf cuz to mantian our relationship has been a struggle but through each struggle our love has gotten stronger for it <3\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthis song is about a kid trying to tell this girl all he will do 4 her and on...he loves her and this is him trying to prove it to her.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI'm not the only one who thought it was a girl! phew! my friends teased me for ages because I didn't know who Justin Bieber (the Bieb) was. Another friend did a dance to this which was hilarious!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song is about the death of all reality. I'll dissect all the lyrics:\n\r\n\"Aye, aye, aye, aye, aye, aye, aye, aye.\"\n\r\nThis is the main protagonist in the songs life cycle. It means that his life's been going on for 8 years, hence the \"Aye,\" 8 times in a row. \n\r\n\"Me, plus you. Im'a tell you one time\r\nMe, plus you. Im'a tell you one time\r\nMe, plus you. Im'a tell you one time, one time, one time.\"\n\r\n(To himself) \"Im going to tell you one time, life, that I won't give up on you. I'll survive this tragedy,\" basically.\n\r\n\"Me, plus you,\" means \"Me, plus myself. I will deal with all this loss,\".\n\r\n\"You look so deep, You no that it humbles me\r\nYou by my side and troubles them dont trouble me\r\nMany have called but the chosen is you\r\nWhatevery you want shawty I'll give it to you\r\nyour world is my world And my fight is your fight\r\nmy breath is your breath, And your heart (and now I've got my)\"\n\r\nPretty much self explanitory after what I just said earlier.\n\r\nMy interpretation of this godawful song.\n\n\n\n\n\n\n", "comment_16": "\na guy wants to tell a girl that he loves her so much and she's the perfect girl that he only wants... and even if many girls try to catch his attention, he promises to stay faithful.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nWow, the complexity and beauty of the lyrics are amazing! Oh wait.. he just makes himself sound like a moron by saying \"one time\" 25 times, not once, and tries to be gangster by saying \"shawty\". Nevermind.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nhow old are u boy? 2 or 3?\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nhe sucks\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nAWESOME!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nhe's adorable, and this song is very cute.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nhes cute, and so is this song, obviously about young love.\n\r\nbut seriously, has he hit puberty yet? He's fifteen, and sounds like a little kid.\r\nHe's only a year older then me. All my guy friends voices have deepended.\n\n\n", "comment_23": "\nas much as i hate to admit this, this song is pretty catchy.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nyoung love. oh man. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nOkay, you listen now!\n\n\r\nI LOVE hard rock. It's a true fact. I listen to Aerosmith, Breaking Benjamin, Three Days Grace, Flyleaf- you name it. Okay. But I also like Justin Bieber. It's the commitment he puts into his music, the way he dances. It makes me feel like I wanna be like him. Young and innocent and free. Look, I've done some things that are \"not so good,\" and this brings me back to when I was younger and innocent like him. It lets me be free again.\n\r\nAnd check out his Youtube. :) He takes enough time away from his music to make videos and put them on his channel. It's cool that he understands that he's still a kid, and not some grown-up superstar. That's what I love about him. He's just a normal person like everybody else.\n\r\nSo stop dissing Justin Bieber, even if you HATE his music! I don't particularly like his style, but I love him as a role model. Kids should look up to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nOK so maybe the song is catchy and he's canadian too. MY MY GOSH HE'S CANADIAN!!!!!!!!\r\nBut i'm not saying i like the song. It's getting annoying and maybe i'll start like the kid when he's voice changes. who knows maybe he'll be sexy in the future XP.(probably not) but i'm keeping my fingers crossed.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nHaving Anger Towards Eveyone Reaching Success....his voice is much deeper now..stop hating fags\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\ncute song :DD\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nawww he's so cute.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ngross!\t\t\t\t\n\t\t\t\t\n\n"}