{"comment_0": "\nRecently a very close friend of the family died.  He was a great guy, like an uncle to me (in fact I used to call him Uncle Jack, even though his name was David).  I've him and his family longer than I've known my step-dad, they've always been there.  I was really close with them and their daughter and I used to be inseperable.  A few years ago we found out he had cancer, but he was his usual chipper self.  Never let anything hold him down.  Once I turned 16 he would tell me he was going to teach me how to drive once I got my permit.  At the end of December, '01 he got sick again, and was in the hospital.  I didn't think much of it, I guess I wasn't expecting anything to happen.  I mean, he was always there.  So New Years Eve, I went and to take my permit test, passed, and was all happy that I passed.   My parents told me that they were going to visit Uncle Jack in the hospital, but I didn't want to go.  Instead I wanted to stay and take a shower before I went to work.  The next day, they told me Uncle Jack died.  I was in such shock, it didn't really hit me at first.  Late that night I started to cry, a lot.  I thought about how I had the chance to visit him, had the chance to see him one last time.  I didn't even get to tell him about getting my permit or anything.  Then I went to the funeral and heard about all these things he did, military service, Boy Scouts, everything.  I saw his children - the people I grew up with - and how upset they were.  It was horrible.\r\nThis song fits everything perfectly.  \"Sorry I never told you/ All I wanted to say/ And now it's too late to hold you/ 'Cause you've flown away/ So far away/ Never had I imagined/ Living without your smile/ Feeling and knowing you hear me/ It keeps me alive/ Alive/ And I know you're shining down on me from Heaven/ Like so many friends we've lost along the way/ And I know eventually we'll be together/ One sweet day\"\r\nDefinitely wish I could say something to him, any one last thing, even if it is about the stupid permit and driving.\r\n*Sigh* Never take anyone for granted...\n\n\n", "comment_1": "\nEveryone has a story to tell. Haha. I lost my mom in August this year..She passed away after struggling with cancer for 5 years. I don't exactly regret not telling her things, because I was there when she left and went to heaven (:\n\r\nBut I do miss having her around, and sometimes when I'm on the way back on the bus I wish she would be at home and I could greet her. But I know that she loves me and that one day, we'll get to see each other again and spend eternity together.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI love this song. I remember when i first heard it. My uncle had taped it for my grandmother and my grandmother had lent me the tape. It was (and is) the most beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nLast November i lost a friend of mine. This is the most beautiful song and i cant help but cry each time i hear it. He was a beautiful person...I miss him so much. I dedicate this song to him constantly...I love you don.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nAt the beginning of Oct. I lost a very dear friend. His name is Gomu. Everytime I hear this song I picture his smiling face. I know that he is looking down on me right now. So I'd just like to say I love you and you my boy! I got $20!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nmy grandpa served his country and then died. he was in the special forces and this song reminds me of him:(\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nthis is one of my favorites, this song goes out 2 my mom , she passed 9 years ago  in the summer. I miss her a lot and I know she is watching me and her family that she love so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI lost my partner in a car accident in 2015 \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThe best thing Boys II Men ever did.\t\t\t\t\n\t\t\t\t\n\n"}