{"comment_0": "\nThis song was written about a movie \"Johnny get your gun\" all of the lyrics were written about the character of the movie who was a soldier in war who had his legs, arms, sight, and hearing taken away by a landmine....(if u dl or can get a copy of the rare version of the song w/ the movie clippings they explain everything)\r\n\"Landmine Has Taken My Sight \r\nTaken My Speech \r\nTaken My Hearing \r\nTaken My Arms \r\nTaken My Legs\"\n\r\nThis is single handedly one of if not the best song ever written.........it captures all points of music.....mixing differents beats, starting slow gettin heavy, switching bak, then full heavy and the lyrics are genius as they express so much emotion .....especially when played live.......and by the way SeasonS should b shot and hung upside down by his balls.....if ne1 can get there hands on his address im sure we could get him a nice nail bomb 4 christmas....\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nJames' reason for writing the lyrics was the thought of beeing cut off from the outside world just like the main character of Dalton Trumbo's book/movie \"Johnny Got His Gun\".\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nAwesome song with an awesome video.  The idea somehow came when Metallica were working on Master of Puppets about what it would be like if someone was alive but couldn't see, hear, or communicate with the world.  After hearing this idea, they were shown a movie, \"Johnny got his Gun\" and the guy was in a war and got all his limbs blown off and couldn't communicate but was still alive.  They wrote a song about this.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIt's not only the movie.James wanted to write a song about his own self...he feels as though a landmine took all he had...arms,legs,eyes,ears,etc.He wanted to show what it is to be lonely and not just literally...lonely in like u and yourself...now and forever...no way of changing the situation.This is my favorite song and i can relate to it perfectly.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThe Guy who died in the Movie communicated in Morse Code with the Medical Staff and told them \"Kill Me\" ... the best punchline from the movie is:\r\nGeneral:\" Dont you have some message for him Padre \"\r\nPriest :\" Hes a product of your Profession, not mine.\" ... just fucking awesome song and movie\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n\"One\" is about traumatic brain injuries from war. Being trapping in ones body, not being able to do anything buy lay there and think. It is a terrifying thought. \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nBased on the movie Johnny Got His Gun, and is about a man who was blown up by a landmine. He lost his Arms, Legs and all of his senses. It's a very strong song with a great build up and a thrashing solo. Metallica is trying to portray what this would be like, not knowing if your awake, sleeping, dead, or remembering. He is trapped inside of his own head, it is a concept that is very hard to imagine.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI'm much more of a classic rock guy--probably a total wimp to any real metal head. \n\r\nBut, hey, what can I say about this song?\n\r\nIts lyrics and meaning are absolutely profound and can be atken literally reflecting the \"johnny\" book or taken figuratively as others have mentioned.  I really relate as I'm finally coming out of a 3 year depression. \n\r\nAnd the music!!! The intonation, etc of the lead singer (see, I don't even know his name) is emotional and you really feel pain when you here it. \n\r\nThe way it goes form the sing song calm beat of a depressed guy plodding thru glum thoughts to the total frustration, rage, etc in the remainderis uncanny. This lead MUST have personal experience with mental illness, or he's just an incredibly insightful genius!\n\r\nThe dual guitar solo thing is just incredible thought the song does tend to sound at the end like they couldn't figure out where to cut it off, but hey no one is perfect.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nWhat this song is really describing if james realizes it or not is the real reality, or the Matrix. its about war but also a mind war. The invisable mind prison we are in. Not one person on this planet has experienced true freedom because of this system in place. \n\r\nWhen you truly question this world you will see things are not what they seem and we are all in a complete state of confusion. We have lost touch with who we really are and james heitfield describes this in this quote.\r\n'' I can't remember anything Can't tell if this is true or dream .Deep down inside I feel the scream\r\nThis terrible silence stops it there''\n\r\nNow he describes when he felt most real and it doesnt involve being in this world but wishes it was.... See More\r\n'' Back in the womb it's much too real, In pumps life that I must feel .But can't look forward to reveal . Look to the time when I'll live''\n\r\nThis describes the slave machines we have become and in the matrix film it is seen with plugs all over their body.\r\n''Fed through the tube that sticks in me, Just like a wartime novelty. Tied to machines that make me be ,Cut this life off from me''.\n\r\nNow james realizes how far out his beliefs are to most and how alone it makes him feel.\r\n'' Now the world is gone I'm just one ,Oh god, help me ''\n\r\nFinally the whole mind prison (matrix) described in what it does to people, be honest with your self. you may not even realize your confused. if your believe in this worlds system you have fallen into the trap.\r\n'' Darkness imprisoning me, All that I see Absolute horror.... See More\r\nI cannot live, I cannot die .Trapped in myself\r\nBody my holding cell'' .\n\r\nIts all a mind war in either being brainwashed and controlled or realizing truth. The battle has long ago for the robbery of your mind. They are very much winning the battle let me tell you.Release the poison they have infected you with if you have bought into this world. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni love this song, the solo in it is fuckin badass too\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nthis song tries to show a hidden unpleasant side of war to tell everyone that war isn't pretty and isn't as fun as you see in the movies. \nwar is ugly. that's where Metallica tries to tell us\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nwhat a cool song.about \"johnny got his gun\" a bloke who had his arms legs and face blown off in an accident.and cant sense anything but can only think.harsh stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song is my all time favorite song of all time.... while it was written about \" Jonny got his gun\" I think it also represents not being able to be heard and has no way to get anything out... all you can do is think about it...... because no one will listen.... I know I have been there and alot of others have too, or maybe even think no one will listen.... ya... it is an amazing song I know that for sure!!! ROCK ON!!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nIt's probably the most frightning tale I've ever heard as well. The thought of it makes me want to throw up. Excellent song.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nyeah, i read the book and it's really depressing.  metallica did a good job of interpreting the feelings of the main character of the book/movie\n\n\n", "comment_15": "\nTo me the way they conveyed the feeling of helplessness from the book without getting all high and literary on us was just incredible...\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nthis is by far one of my favorite songs its just great the lyrics are great and the music is even better\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nthis song is talking about the horrores of war and what war can do to peaple \n\n\n", "comment_18": "\ntop song, great movie too\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nYou don't need me to tell you how great this song is.The guitars are too good, especially the piece at the end, and the lyrics are self-explanatory but still thought-provoking.\r\nNow, even though it is besides the point,I think it would be interesting to ask whether this song advocates euthanasia\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song is beautiful and then powerful; it starts of sedate, but boils into a rage. It's amazing how much feeling they can convey in the music alone, very few songs these days have music that helps you feel the way someone thinking the lyrics would feel. Technically perfect, and very emotional at the same time. A hard thing to do.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThere is nothing added on after \"Left me with life in hell.\" There is no censored version of One...Dumbasses...\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThis song is amazing... everyone knows what its about so i wont touch on that... but when 4:35 hits and Metallica goes crazy, holy shit. The solo is wicked, the drumming has a cool tribal feel to it..... why can't metallica write this shit these days? oh yeah, cause they sold out.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis song is fab the S&M version is amazing but then again so is ervery song on that album fukin wicked. Metallica rule\n\n\n", "comment_24": "\nseasons, i don't think metallica sold out.  i just think they're gettin old.  i don't like their new music as much, even though that's such a fucking cliche.  it seems like everyone is listening to the \"old stuff\" lately, but still, they've gotta be at least in their late 40's by now.  you can't expect them to not have mellowed down a bit.  at least they still play songs off their old albums live though.  \t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nMetallica kicks ass and thats all I have to say!\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis song is sure in the top3 of the best songs of all time. This is not just some stupid hard-rock this is a delicat hard-rock with structure. Masterpiece!\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\n4.31 - 5.22 is my favourite part of the song but I prefer the S&M version, the songs a classic and so are Metallica, they rule, my favourite song has gotta be Wherever I May Roam\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nthe song, to me, means that alot of ppl die at war. and the people that dont die at war c there friends suffer an it tramatizes them. other wise, i think that the video is a very good explination\n\n\n", "comment_29": "\nThis is one of the best Metallica songs, hands down.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nDefinately, this song is SOOOOOOOO damn good, besides the lyrics being good, the guitar and drums in the backround perfectly match the feelings, it's so good!\r\nAnd I don't believe Metallica sold out, they just cut their hair and wrote different styled songs, which are still good! THEY WILL ALWAYS ROCK!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nMetallica kicks ass. This song especially kicks ass. Folks, it don't get any better than this. This is a classic song and I am proud to say that Metallica is my favorite band. Even though they... kind sold out if thats what you would call it... they still wrote kick ass songs, and at the end of the day, that's all that really counts... right?\n\n\n", "comment_32": "\nhold my breath as i wish for death...i feel tha metallica pretty much describes what that would be like in this mellow/adrenaline-pumping song based on the move \"Johnny Got His Gun\"... wicked song and one of metallica's best\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nIf you're an aspiring musician of any sort, this song has to truely inspire you.  Great great song.  I can listen to this every night and not get tired of it.  The video is amazing, too.  This song is musical talent at it's peak, without a doubt.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nScrew the lyrics for meaning.  Forget the words and listen to the music.  The contrast of the mellowed, almost resigned beginnings to the anger and pain as it draws to a close... Throw in the speed and madness of the solo, and the feelings are pretty much conveyed.  The lyrics just set the scene... Anyway - an amazing song that gets better every time you hear it, and one of the best solos you'll hear in a Metallica song.  Brilliant stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nFor all those who said Metallica sold out, to quote Jason:\r\n\"Yes, we sell out. Every night of every concert of every tour.\" or something close that, can't remember. But the point is, they didn't sell out. Also, staleph1sh, Jaymz just turned 39 recently, so they ain't old. (unlike the Rolling Stones who are now older than most stones.) As for mellowing out, they will never mellow out. Just cuz they don't play a thousand miles a minute through every song they right anymore doesn't mean their getting soft. The loose and raw power on Load and ReLoad is still a bit ahead of the time kinda like this song. One is and will always be one of the best damn song ever written by anybody.   \t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nIt is about getting injured in war and the hardships of that.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nthis is the coolest song ever!  Even if bulldog doesn't like it because it's too loud....YOU are going to sit and listen to it with me until you fucking appreciate the awesomeness of it.  Oh and yeah, I love you and I am so happy that we can post again :)\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThis is the BEST metallica song ever, and is one of my favorite songs ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nGraet great song, a true classic.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nprobibly one if not the the best Metallica songs ever, its like Stairway to heaven on steriods!\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nthe best song ever\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThis song is like the book.  It's calm, then it gets a little faster / Joe realizes he is in trouble, then the song gets way fast / Joe wants death and can't get the nurses and doctors to listen, then it just stops / Joe dies.  This song (like The Thing That Should Not Be) is so much better after reading the book.  But in The Thing's case, the short stories.  \"One\" just plain kicks ass...\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThis song is great. This was before they sold their souls. Metallica must sit in their mansions listening to this and thinking \"Wow, were we really that good once?\" How the Hell did they go from this to St. Anger? Metallica is a joke that just isn't funny anymore.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nAs with much of Metallica's work, this song is pure and solid and really shows that Metallica = Greatness. They really do their homework!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\ndoes anyone else get sick from sadness when watching the video, i have yet to see \"johnny got his gun\" or read it, but i want to so badly.  but still the way they take clips from the movie and fit it into their video seems to intensify the whole story.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nRead the story first, the film isn't really very good.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nMetallica kicks ass.  This is my favourite Metallica songs and one of my favourite songs ever.  The video was stunning and it was really effective when they used scenes from Johnny Got His Gun.  It's about being severly injured in war and not being able to communicate or do anything and just wanting to die.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\n\"One\" is one of the greatest songs ever written by one of the greatest bands who ever existed. This song is a great example of their talent.\n\r\nMy friend and I learned this song...I play rhythm guitar/vocals and he plays lead guitar. We're having trouble findin a drummer that we like and a bassist, too. It's the greatest song to cover ever. My favorite part is when it gets to \"darkness...\" and then \"landmine...\" and the solo after that. I fucken love playin that part. The palm-muted triplets kick my fucking ass. And so does Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThis song's beginning guitar is awesome. \r\nI think it's about an old man after war. Or it could be just about an old man and the life he lived. That could be his \"war\". Now he's all weak, and he's waiting to die. So his war was his life, which didn't serve him well. \r\nDeepness bitch.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nthis is my favorite metallica song, i love to play it on the guitar, i love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nWhen I was in High School I gave this song to a teacher as we were studying war poetry. She now uses this song in her ciriculum. She also uses wherever I may roam for the book \"Into The Wild\". She was a strick ass teacher too. I really think we opened her up to different types of poetry. Metallica poetry.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nLike Margmalactic, my history teacher loves this song.  In fact, the first time I saw the video was in his class.  (we were learning about WWI)\r\nAnyway, this song is a milestone of metal.  Absolutely incredible.  One of those songs that cannot be turned down, only up.  Headbanging glory.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nThis song is brilliant, but the solo, please, it is not the best ever.  In fact, it is quite stupid.\r\nFast does not equal good.\r\nWell done to the boys though.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis song, i cant even say it in words how awsome it is... it is by far my favorite metallica song, even though i love every fuckin metallica song, this one is my all time favorite, and i mean really anyone who doesnt understand the basic idea of this song is really deaf or stupid, the lyrics alone explain how its about a kid who goes to war and gets naded then they think his in a coma or something to that affect and all he can do is think and he wants to die etc, almost positive it was based off \"billy got his gun\" and ehh, its great. Metallica Owns.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nfour words: THIS SONG FUCKIN ROCKS!\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI think that when the song starts off, the guy that got \"blown up\" is somewut fine and as the song goes on he is started to die off a lil at a time. At the end when they r jamming out is right before he croaks out, then when the song is over just like that, so is he.\n\r\nMETALLICA IS THE FUCKING SHIT!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI heard that Kirk taps out help me in his solo...anyone else get that?\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nthis song is sooo amazing, its almost pure, i know how stupid that sounds but its really amazing and beautiful\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nlike marqmaltic, i also gave the lyrics to this song to my english teacher in high school.  he was a bastard, i hated him.  i also gave him the lyrics to the god that failed.  that son of a bitch thought i wrote it, and i let him think that for about five minutes.  he was tripping, thinking i was smart or something.  then i told him a band called metallica wrote it.  i almost got into deep shit over that.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nthis song paints a vivid pitcure in my mind about the spoils of war. I can close my eyes and listen and its almost like im the person in the song. frightning\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nthis song is my absolute favorite out of them all. over nothing else matters, fade to black, sandman, master and to live is to die, this is the one. literally. the solo is sick, and the guitar riff just before the drums change the tempo is a work of art.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nI've never seen/read \"Johnnie Got His Gun\", so I'll have to take your (those of you who have seen/read it) word for it as far as that meaning goes. But this song reminds me of World War I. With the new shit like artillery and gas, nearly all of the veterans who returned alive were completely insane. I think the \"landmine\" could be interpreted as whatever it was that made them lose their mind.\r\n Landmine Has Taken My Sight\r\nTaken My Speech\r\nTaken My Hearing\r\nTaken My Arms\r\nTaken My Legs\r\nTaken My Soul\r\nLeft Me with Life in Hell\n\r\nI think that the physical wounds left by this mine could also be interpreted as the mental wounds that these soldiers suffered as a result of shell shock.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\none of their best songs they've made\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\ncan u stop banging your head with this song?.metallica at its best the subect matter really scary just imagine it and u will understand tjis song even better.sometimes we feel that way, motion and speechless\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nThe only way u could ever understand the true mood of this song is to have battled in war and seen the grusome sights.... ofcoarse im glad i dont relate with it but its still an amazing song... lyricly and on guitar for sure!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nIt is no doubt that this song is about a war....but can anyone explain to me what the song title \"one\" is about?\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nOndjage, I believe \"One\" refers to the main character in the book, more or less forgotten and ignored by the rest of the world.  He's in his own world now, no sight, no hearing, no speech...nothing.   He is the only one.  Also if anyone remembers from the book, at the end he actually figured out a way to try to communicate with the staff at the hospital by banging his head on his pillow in morse code.  Do you think that this song could possibly be a semi tribute to the original headbanger?\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nTHIS IS THE BEST FRIGGIN METALLICA SONG IN THE WORLD!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nmetallica's second best song, but read the book, Johnny got his gun, to get a better understanding of the horrors of war and therefore, a better grip on this amazing song :)\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\n\"Johnny Got His Gun\" is possibly the most depressing movie of all time.\n\r\nI recently bought a Japanese DVD of it on eBay.\n\r\nThis song perfectly captures the horror of the subject matter.\r\nAnd it kicks ass of course.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI love this song. Its depressing, which is fun. This is Metallica's best song in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nthis song is very touching\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nThe movie is crap.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nit links to the war,if you've seen the music video it really gets to you.anyways great song and some good ass lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThe preformance music video is really good. The song IS  one of the best Metallica songs. It deserves more attention than MoP.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nI think that \"And Justice For All\" is their best album. Even though every album up to Garage, Inc. kicked serious ass, this one is my favorite.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nWell everybody has the meaning right - it's about a soledeir left with no arms or legs and no senses besides touch. I beleive the song is called \"One\" because of the following extract from the book \"Johnny got His Gun\".\n\r\nHow could a man lose as much of himself as I have and still live? When a man buys a lottery ticket you never expect him to win because it's a million to ONE shot. But if he does win, you'll beleive it because ONE in a million still leaves ONE. If I'd read about a guy like me in the paper I wouldn't beleive it, cos it's a million to ONE. But a million to ONE always leaves ONE. I'd never expect it to happen tome because the odds of it happening are a million to ONE. But a million to ONE always leaves ONE. ONE.\n\r\nI think that should clear it up for ya.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nOk i am just writing this to all the little whores who said Metallica  \"Sold Out\"  you guys just need to  shut the fuck up they will never sell out they are far from sell outs\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThey haven't sold out, but they still managed to lose all musical credibility.  \n\r\nWhile they have never changed, in order to pull in a wider audience, they do seem to have become very lazy, content to sit on their mountains of money, putting little, if any, thought into anything they have released, since their self-titled album.\n\r\nWhile they are still great, live, they now serve only as a nostalgia act and a reminder of how great they once were and will never be again...\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nAnd wat the fuck are  you smoking  they will alwayz be good and they have not lost anything and they dont sit on moutains of money yes they may have          alot but they dont sit on there money and not care about there music anymore you really need to wake the fuck up\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nI think you need to wake up.  Have you listened to 'St. Anger'? How about 'Garage Inc'? 'Load', maybe? \n\r\nIt is doubtful, because had you listened to them, you would have noticed that they are piss poor and took about 15 minutes to write.  These albums would have been looked down upon, with scorn, had they been released by some piss-ant underground rock band, but for Metalica to release this kind of garbage, after such seminal works as 'Kill em all', '...and justice for all' and 'Ride the Lightning', is unforgivable.\n\r\nMetallica simply don't care about making good music anymore.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\n(Before you point it out, I know that they didn't write the songs on 'Garage,Inc', but it also sounds like they didn't practice them either...)\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nwow I'm not one for metal, but this song truly kicks ass, and Metallica is definitely the greatest the metal band ever.  The guitars in the begining of this song is metallica's finest momment\n\r\nand the lyrics really promote the evil of what war can bring to a man.  i love the gunshot and chopper noises before the guitars as well, then how it segues into the lyrics.  its like that is when the main character lost everything was in that 15 seconds before the song, then the lyrics tell his story\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\ni know how much metallica suck now, but this spose to be about the song one. not about garage inc. and shit. so stop being fucking idiots, and let people write about the song!\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThis one of the only songs of Metallica I can appreciate. Accept for the solo. I don't like Hammet's soloing on this one.\r\nBut the thing with this song is exactly that: the solo is about the only thing off the song i don't really like; it's messy. The other songs are garbage, except for the solo's. Most of them anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nMetallica is neat.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nThrough \"One\" I (once again) discovered how great Metallicas music is. I used to listen to them when i was younger. I found the video \"One\" a few years ago and thought it was great! exspecially the 2nd part of the song when they speed up after the machine gun-like drumming. After i saw the video i started to listen to metallica again. I love the 5 first albums they made. Well the 6th album has some nice songs as well. \n\r\nIve heard somewhere that the song \"One\" is based on the movie \"Johnny got his gun\". I want to see that movie. The musicvideo \"one\" is very powerful. The combination of WW1 scenes and 80's-90's metal music works fine :-) exspecially in this very emotional song. \n\r\nThis is Metallica at its best! And James looked cooler than ever :) The musicvideo is a must-see :o)\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nThe funny thing is, im not a big fan of metallica. But this song gave me the chills the first time i heard it. Its pretty obvious what the song is about, it goes withut saying and this video gave me nitemares! What a horrible existance...\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nHow mad's this song??? Very powerful very loud and heavy it's excellent!!! Interesting story behind it too I must see \"Johnny got your gun\" one day\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nIt's about the injustices of communism, in addition to visual imagry from \"Johnny got his gun.\"  Look at the lyrics and you can almost immediately relate it to the strangling restraints of Communism.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nWhat the fuck are YOU smoking?! Listen to Kill Em' All and then listen to St. Anger and then try to say they haven't lost anything! Guiffporn's got the right idea about them man.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nallegedly Metallica never heard of \"Jonny got his gun\" -- Bullshit\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nFirst off, the guitar parts in this song are freaking awesome!  Now the meaning, this song is about a guy going to war, coming back not being able to communicate with the world.  He is on life support and he doesnt even know if he is alive or dead.  If he is alive, he wishes that God will take him.  The womb he speaks of is the life support (\"It pumps life that I cant feel\")  The reason its called \"One\" to me is because he is now cut off from the world and is now one with himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nAt first I didnâ\u0080\u0099t know about the connection to \"Johnny Get Your Gun\", but I knew it was about war.  The lines...\n\r\n[Fed Through the Tube That Sticks in Me\r\nJust like a Wartime Novelty\r\nTied to Machines That Make Me Be]\n\r\n...were incredibly saddening to me.  The first time I heard this, I could have almost cried.  You can just see a man in the hospital hooked up to the machines and singing this song.  At 4:37, all hell breaks loose in this song, and it seems very angry, how someone would feel lying in a bed with 60 years to live like this.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nsuch a brilliant song. I think i have to get the musicvideo. S&M version rocks and jesus the solo one of the best ever i feel...\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nthis song is beautifully written, hands down it is one of the best songs of theres,\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI know this song is about \"Johnny Got His Gun\", but every time I hear it I can't help but think its about depression.. He talks about having no arms or legs and no way to see, hear or speak.. I always think about feeling like nobody listens and therefore you are silent.. trapped... As in the lines \"Body my holding sell\" It sounds as if he feels trapped within his own existance..\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nI know this song is about the movie/novel \"Johnny Got His Gun\", but I think there is much more meaning behind it than just that.  I think this song is about what happens to a person (mentally or physically) who experiences a tragic event that is life changing.  The man being crippled by a landmine being the symbolic tragic event.  It can represent anything though.  The loss of a loved one, a tough breakup, any life altering event.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\n\"Amazing song. Simply...amazing. \" I Agree\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nok, what i don't get, if the landmine blew everything off, then how does he tap morse code?\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nWith his head.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\ni really hate when people say metallica sucks now, or that theyve \"sold out\". they've lasted this long, and they're still awesome. you all think you're \"musicians\" with your shitty little garage bands and distortion pedals. stop criticizing such legends that you can never compare to and go get a job you worthless douchebags.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\na great song by a great band. to ianthomas360 and guiffporn, the character blinks 'kill me' in morse code. they have the snippet in the video. i also agree with breakingthegirl. people who say metallica have 'sold out' are complete idiots who if put through the same shit that metallica have been through in the last few years, will self destruct\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nthe heavy solo is so insane. its almost impossible to play...or maybe i just suck....\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nor maybe this song is so intricate(?), that anyone should forget about trying to cover it\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nBest Guitar Solo Ever!\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nThis is the best Metallica song ever.  I like Kirks little solo after the second verse.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nNow... to me this song says that you sould make yourself heard.  It talks about a person who cant communicate with the outside world whatsoever, so to me that kind of says that u should speak up for yourself and try ur hardest to get ur important thoughts out there.  By speaking of how horrible that situation  is, we realize that we r lucky to be able to communicate among ourselves and that WE SHOULD DO IT!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\n.....uh.....ok.....actually it's WWI judging by the womens nurse dress and the equipment they used in the hospital. As for the helicopter at the beginning I have no idea by thats there.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nMy favorite song ever... It has won my heart. Careless of the reason why it was composed, the humanity outpoured into this masterpiece really spurs your passion and brings you in touch with the true meaning of pity and mercy... The drums are exemplar, textbook material. Lars' skill is here prooven and the bass drum rolls are just the perfect accompaniment to the general anger and dispair in this song.... Thank you Metallica for having composed one... It is the perfect expression of me...\r\nMetallica are and will be the best band to have walked the surface of this withered earth... They have truly understood the essence of music\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\ndamn what a fuckin bad ass song! Metallica is the shit!!! i love how their songs start out off with like 2 minutes of music then the words come in for about 3 minutes and then the last 3 or 4 minutes is fucking instrumental til the song fades.genius!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nThe music is so well structured.. the drums and guitars are in perfect harmony..I love ...and justice for all. It's their best album with Master of puppets... The band has matured musically and they're no longer kids... Their justice album is unique because it is flooding with anger and pain towards the world and system! However the world has lost a worthy soldier in those years... \r\nTo Cliff: We will always remember you.Thanks for standing up and fighting all your life! Your pain has not gone in vain! The hearts of every Fan are with you!\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nfor me this song mens that james has suffered a lot and its like being in a war like it says in the song \"just like a wartime novelty\" thats what i think.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nThis Is the best Mettalica Song next To Master of the Puppets\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nWhy dont you go lick balls their quartersack_jake... im sure you have a lot of experience.  And by the way this site is for people to put out their opinions on the meaning of a song, not for people who disagree with an opinion to whine like a little bitch and tell people to \"juss die\" or shoot themselves or jump off a bridge as you said in the and justice for all section.  But hey what should i know... im only 13.  suck a dick but not mine thats gross quartersack_jake\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nThis song is probably the best Metallica song out there.  If this song can't pump you up, there's something wrong with you.\n\r\nFrom \"Darkness imprisoning me\" to \"Left me with life in hell\" is basically audible adrenaline.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\ni'm sure you guys know what this song is all about, especially if you seen the music video. but its just about a young man who gets injured by a landmine in the (viatnam?) war. he gets taken to the hospital as he cant move, hear or see and can only think (last stanza)\n\r\ni really suggest you guys watch the music video if you havnet already. pretty emotional.\n\r\nand of course THIS GUITAR SOLO IS THE GREATEST\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\ndo you want best solos:\n\r\nNovember Rain (G.N.R)\r\nHotel california (eagles)\r\nnever again (dream theater)\r\nsweet child o'mine (g.n.r)\r\nforgotten (joe satriani)\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nThe ONLY good Metallica song...\n\r\nAnd for solos, don't turn to Metallica...\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nOOOOPS, i meant \"never enough\"\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nNow why is it that every body loves this song... Dont get me rong im not knoking it in fact i love it just as much as any of you. but for there to be so many comments on all clechÃ© metallica songs. the ones that everyone else listens to. if you call yourself a fan there has to be more than 20 of you on this site, its just you cant open your eyes to how good all the songs are\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nYes this song is THE SHIT!! I could listen to this song 100 times over and over and never get tired of it...EVER!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\ni honostly think that james and lars is writeing about the loss of cliff burton... if you notice its somewhat of a slow song representing loss or lonlyness its not about drugs or anything like like the its the album right after cliff died uhhh get a clue you retards\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nhow the fuck does this song only get 100+ comments and american idiot gets 200000?\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nmight i add that this is Metallica's masterpiece\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nTheKorean2908, I feel your pain the fact that Greenday have a total of two good songs, american idiot being one, whereas Metallic have a plethora of quality material, is the only explanation that works.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nInteressting point to Noisicus on the first page in this situation it would be considered euthanasia since he can't communicate what he wants... basically it could be saying that lots of people just want to die already but no one wants to let them off life support... oh god now im depressed\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nMaster of Puppets is right, THIS song is REAL Metallica before they sold out and started sucking.  This song actually calms me down when I'm Pissed.  the new Metallica PISSES ME OFF when i'm calm.  Imagine that.  Please get it togather Metallica and go back to your roots that made you all your money, WE MISS IT!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\ni didn't read all of the comments, but to staleph1sh, how can you not think metallica sold out? they changed their sound, eliminated solos, wrote meaningless songs, etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nColdenScence\r\nthere are greater solos... stairway to heaven from page? eruption by EVH? or how bout some dimebag darrel?\n\r\ni do agree with hotel california\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nThis is one of Metallica's best songs and its brillant.  The Green Day issue  \r\nis totally bogus, compared to Metallica, Green Day sucks ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\n3 words: Best Song Ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nI love Metallica, and if I had to choose a favorite song of theirs, than \"One\" would be my choice. I love the fact that it is about a man going into a war. I think this song should be getting alot more popularity now, because of the stupid war with Iraq. It makes sense, don't you think?\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\n'One' by Metallica is number 11 on the top 25 sad songs of all time.\n\r\nI think this song speaketh the truth, and I don't really like to point this out a lot, but.... Who really cares if a band sells-out, its part of the music industry. I don't really listen to Metallica, in fact, the only songs I've heard are One and Enter Sandman.\n\r\nBut Metallica will always be Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\ni really do love the emotion in this song. i've only recently started listening to metallica so really i've obviously the main ones i've heard have been their most popular ones. and i now appreciate that metallica are an amazing band. i know many of you have said that they are not as good now or whatever but to me its never too late to appreciate great music, even if their best or most successful period is over. i do intend on becoming aquanted with more than just the bands well known songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nman goes to war\r\nman steps on land mine\r\nman has no limbs. cant talk. just lie there and wait to die\n\r\n\"tied to machines that make me be\" \n\r\nhes a robot =O\n\r\nbeautiful song by one of the greatest and most influental songwrites of all time\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nThis goes in top5 of all metallica songs IMO, and this is also best song in justice album. I think this tells about soldier who stepped on land mine in a useless war in vietnam, as u can hear voice of helicopter at the beginning of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nSimply.\r\nBest song of all fucking times. No fucking doubt.\r\nBeats Number of the beast. Beats the gay Painkiller.\r\nBeats the Mozart's Dies Irae. Beats even the Vivaldi's Spring. This fucking song beats de Haendel's Hallelujah itself. The best song in the history of mankind.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nBesides being about War, isn't the song also about Euthanasia? the man apparently wanted to die, and the nurse put him to Euthanasia in the end \n\r\n\"Cut this Life off from Me\r\nHold My Breath as I Wish for Death\"\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nI'm listening to the really heavy part that starts at 4:35. Awesome giutar drumming. Cannibal Corpse should cover that part.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nHey first of all you fuckers who diss metallica....FUCK YOU and i hate all of you. this is an amazing song and by far one of my favorites the durm solo at the end is amazing lars is a fucking beast dont ever fuck wtih metallica there the best band ever suport them from begining to end or you can consider yourselves those who have sold out\n\r\nxFor All Lostx\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nMuch like the \"Stairway to Heaven\" of Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nthis song is amazing...they captured all the emotions and feelings in the book (which was also really good) and put them into one amzing song...i cant get enough of this song...\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nThis song is very good, it's the 4th best Metallica song.  I like how it starts out being very soft and quiet, and then goes into the furious thrash metal overdrive.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nOh, I almost forgot!  The song is about a dude who get's blown up by a landmine, and loses his limbs, and basically everything except the feeling in his skin and the abilty to think.  Now he's trapped in total darkeness.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\ni love this song...when i saw the music video for this i actually cried-its so horrible\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nTruly a anguished, powerful, and most unforgetable song. I first heard it at age 11 and it has haunted me ever since. So much so that I obtained a living will which instructs termination of life support if this happened to me. For some reason though I always thought this song was about a vietnam vet who stepped on some kind of makeshift landmine-more like an explosive booby trap. If that were the case it would serve to make this song even more tragic than it already is....\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nIt's obvious the song is based on the film and war but I'm going to go for another meaning as well.\n\r\nThis could be about a person who is also at war with himself. That he's lived a certain life for so long and now that things have changed and his way of life long forgotten things are no longer what they used to be. He is waking up and he can't see what way to go from here.\n\n\r\nSociety has condemned him for his old ways and looks and he can only feel guilt. Yet he can not conform because his past haunts him. He cannot regonize who he is in a mirror if he was to change. Therefore he is trapped in his own hell. He cannot truly live and he can't take his own life. He is trapped in his own self in a different time period. They've taken his soul and therefore everything else.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nMy personal favourite Metallica song. Love it so damn much.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nWhat I was wondering: why is it called \"One\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nHi guys. i'm writing subtitles to music videos both in English and Turkish. \"One\" is one of them. Can anyone please explain the following quote from the video:\n\r\n...... as unthinking as the dead UNTIL THE DAY HE JOINS THEM......\n\r\nwhile saying JOIN THEM does the doctor mean JOIN LIFE AGAIN or UNTIL HE DIES ?\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nthe doctor means untill he dies\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nThank you very much p_k_rooz\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nyour welcome TayfunRaider\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nthis is possibly the most depressing song ive ever heard i hav read the book and seen the movie and they both drag on forever. back on the subject of the song the  the softer solo is probably my favorite solo on any song\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nits basically about wat war can do to people\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\n\"Now the World Is Gone I'm Just One.\"\r\nI love it how the title of this song is only used once. I'd give anything to play guitar well like this.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nthis like all other metalica is garbage. just awful the worst, god damn crappy shit riddled arse toss\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nXeans.....i hate you. is MetallicA to big and bad for you to handle??. this is like the greatest MetallicA song ever. some of my friends hate MetallicA but they still love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nit sounds like \"Now, the world has gone out as One\" but w /e. i like it that way.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nHAHAHAHA Xeans is a complete tosser!\r\nman y even post if u dont like them, and im with HEAVYMETALROCKS i hate u sooooo much, if i ever meet u.......BEWARE!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nand i dont care if u report me cause i joined this site just to defend metallica, so shove ya comments and abuse reports up ur arse and go listen to george micheal ya fucken fag!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\ni think Korn did a better job of this song, and im not really a korn fan.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nmaybe that was a bit harsh the first post i made, sorry you two. i was really turned off them when i was in a band with 3 other metallica fans, aside from the fact that they were always playing metallica and i didnt enjoy their music, the other band members were really really arrogant (much like metallica) and acted like they were the only band in the world. there is better music out there if you can be bothered to find it Iron Maiden is a class metal act. then i watched some kind of monster and i wasnt at all impressed with the way they conducted themselves. theyre the absolute stereotype of rich whinny spoiled bratts. but i suppose some kind of monster was funny in a spinal tap way.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nKorn.....ripped off metallica, hahahaha what they cant make music from there own songs. and man ive seen iron maiden live and metallica live and i prefer metallica. but dont get mad at metallica because they are the one and only UNSTOPPABLE METAL MACHINE!!!!! Im not coming back to this site ever so bye!\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nUnstoppable metal machine? The lead singer comes back out of rehab... \"I feel like... my feelings.. have been hurt\". How metal is that? More like whiny pop punk. The drummer is probably the worst drummer I've ever heard in terms of creativity.. and rhythm.. hell, everything and if you have no rhythm, you shouldn't be drumming in a band, right? The only thing holding that band together now is Robert effin Trujillo.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nhahahahahahahahaha thats the biggest crock of shit ive ever heard, whats the best band u know \"My Chemical Romance\" the only that keeps them together is the major veins those fuckin emos dont cut. and for ur fucking info metallica won best metal performance for this song, so shove that up ur fucking arse ya dumbshit\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\noh im so sorry lateralus (not that ur very straight), your from delaware........i mean come on its deloware (waynes world fans u know wat im talkin bout)\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\noh dont even try to reply to me or to insult this band, but if you really want to, go up to james hetfield and Lars and tell them and there 18 awards, there ranking of third best metal band in the world and there eligitability for the Rock and Roll Hall of Fame that they *cough*  suck.\n\r\nOh about lars being the worst drummer..... its bullshit seems he won an award in 1997 for outstanding drummer.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nThis is one hell of a song.  It's one of my favorite songs of all time but thats not to say that its one of the greatest because its definitely a sloppy song and you can tell by listening to it, too but it still kicks ass.  And as for Xeans i can understand why you dont like Metallica but to say that Korns cover is better than the original is a bit, well, stupid.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nthis is among the best songs EVER MADE. I'll be damned if  another Metallica song is choosen for Guitar Hero for them.....It better not be a damn cover either, only Metallica makes this song happen............\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nim cut between for whom the bell tolls and this as my favorite metallica song\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nthe ending rage amazing. Fav song ever. Rather than feeling depressed whole song they unleash all feelings that u can rock out to.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nand lolz at Larz, 'Hi, Im in Deloware'\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nImagine stepping on a land mine, losing your limbs and senses and being nothing but your mind.....You'd have your WHOLE life ahead of you to just be your mind and think and you'd be trapped in your mind wondering what's going on and why everything is black and why you're not going anywhere....Craziest thought ever\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nDARKNESS. IMPRISONING ME\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nsince I dont have the patience to read through 170 some comments I appologise if this has been hit already\r\ndoesnt anyone feel like this was like a template for the matrix movie?\r\nI mean with all the stuff bout \"fed through a tube that sticks in me; tied to machines that make me be\r\nand all that good stuff\r\nand even in the video the whole proposition of how do we know we arent dreamin and that stuff\r\njust a thought\r\nits a sweet song though\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\ndont you just love it when a great metal band makes a song and video to scare the living daylights out of teenagers about war? - this is a classic anti-war track\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nThose that dont die in war have lost something else in war, even if it cant be seen on the outside. This song tells the story of a war veteran who has lost everything, both his limbs and (perhaps) a slight amount of his sanity. But thats just my analysis\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\ngood music video\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\ni think this song really is good talking about war and the terrors of being in a battle and your thoughts during it\n\r\nthis song is really good, one of my all time favorites\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nI didn't know at 1st when I listened to this song and watched the film clip that it was from a movie, which I haven't seen yet, but the fact that Metallica purchased parts of it which were very powerful and mixed it with the other parts of the clip made it so powerful. Brilliant song and a brilliant clip. Creepy and scary too, I must say, if I was like the poor guy who was in that state, I'd want to die too. I wonder whether James knew someone who severely injured themselves in war once and was forced to live on life support for years if not decades, when he was in pain or in a state where he had severe brain damage and considered himself useless, and the best option for him was to die, which he eventually achieved.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nThis song to me is about Vietnam..\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nYeah this is an awesome song. Even before i knew it was about johnny got his gun i knew it was to do with war. Anyway metallica rocks and this is one of their best songs plus the riff at the end kicks ass.\n\r\nMETALLICA ROCKS\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nAll his friends are dead and he's the only one left. He wants to die... Long explanation short..\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nTheir poor friend(or someone they saw and decided to write about) that went to war and came back(hence the beginning firing and helicopter) shot. All his limbs were taken from him and he wishes he could die. He feels like there is no god, or that he did something wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nthe first time i heard this song, i thought it was about the tragic demise of cliff burton. now that i take into account the whole \"johhny got his gun\" crap, i now think that the story of the cripples soldier is metaphorical of the cliff burton death or else any other tragedy that happened to the band, because i don't think \"it's just about this one dude who stepped on a landmine and got his face blown off\" is not good enough an explanation. it's unlikely of metallica to have such a great song be so \"one\" dimensional\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\never fear like u cant express urself because people around you wont respect the way you feel about something, rock to this and ul be free\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nI have a DVD where all of Metallica's songs they've released are pn one DVD. Lars Ulrich was talking about the song. He says that the song was mainly James's idea, pretty much about what it could be like to be some sort of basket case. They later found a book and then a movie of \"Johnny Got His Gun\". When listening to this song and watching the film clip, it makes me think to myself that is NOT what I ever want to turn out to be, just about more than anything else in life. It's worser than death, I'd rather be buried alive than be someone who is alive but with no arms, legs, hearing etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\none of my good friends just recently died and this was his fave song....i rely relate this song to him cuz it was a rely difficult death for everyone around him to deal with and this song kinda relates to being in so much pain that nothing else matters anymore\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\ndo not restrict this song to one person it could be abt other people in the same situation people who are in coma ......\r\ni think no one can touch metallica i never feel satisfied withany other band or kina music\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nBrilliant anti-war song.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nthe video of this song is so sad that i cried while watching it online.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nthis songs kind of creepy, but has kick ass lyrics \n\r\nGH3\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nLOVE THIS SONG!!\r\nobviously about a man who was severialy injured in combat. \"land mine, has taken my SIGHT, taken my SPEACH, taken my HEARING.. taken my ARMS taken my LEGS, taken my SOUL.. left me with life in hell.\"\n\r\n-he lost his arms and his legs.. deaf blind and dumb.\r\nand he wants to just die\n\r\nsad song but rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\ni was suprised to learn that one is alot like \"the call of ktulu\"\r\nthey got the idea for \"the call of ktulu\" from a book\r\nsimalar to one but in both books they both just lie in bed lifeless but active\r\nwith ktulu originaly cthulu it is a book about this monstorous... thing lol lying at the bottom of the pacific sea and some other stuff but maybe metallica is trying to say something maybe they feel hopeless and some how knew that some of there fans UNGREATFUL BASTARDS! would turn on them i have been a metallica fan all the way! doesn't matter how bad people think there albums are\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nidk about anyone here but i had to read a book called the road, it ended up being one of my favorite books, but its about a man and his son traveling trying to survive the end of the world this song just makes me think about it, it fits perfectly\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nA True definition of democracy and liberalism........and they both suck........Metallica Rules\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nIt's about a wounded soldier and his pain. plain and simple\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nin my opinion this song and jumpin jack flack (by the rolling stones) have the best intros ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nThis is about a soldier that lost all senses and limbs from a land mine, he wants out of the jail that has become his sad existence but can't even kill himself or tell someone to kill him to put him out of his misery. That subject was actually the main character of Dalton Trumbo's anti-war novel 'Johnny Got His Gun'.... wow, some of you got some mean imagination with your interpretations!!\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nThis song is very infulential. It also make's alot more sence if you watch the fil \"Johnny get your gun\". It is about a Guy that goes to war and get's caught in a bombing. He loses all of his main limbs. His face, Arm's and legs. They choose to keep him alive, Think about it he can't speak,Listen or smell.\r\nHe has one sence which is touch.\n\r\nAll he can do Is think, He dosen't know when he is awake or dreaming as he can't see or hear.\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nIt's based off of Johnny got his gun, when he gets his mouth, ears, eyes, and nose blown to pieces.\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\njust how it feels to be like that...\r\nI'm imagining it but couldn't take longer.\n\r\nI would just choose to die, maybe.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nJohnny Got his Gun (the book and the movie) are incredible. Dalton Trumbo heard this story of a young man who was nothing but a slab of meat so to speak (nothing but a torso and head much like the character) who was damaged in the war. The story is based on the first world war and was ready to be printed and copyrighted near the start of world war two. Only one factual error offsets the book from the song: the song mentions: \n\r\nLand mine has taken my sight\r\nTaken my speech\r\nTaken my hearing\r\nTaken my arms\r\nTaken my legs\r\nTaken my soul\r\nLeft me with life in hell \n\r\nhowever, in the story, Joe Bonham is disfigured by(I'm positively sure)a mortar shell. \r\nRegardless, the two relate well and the book and movie are both worth checking out.  \t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nWow the guitars at the beginning are just brilliant and the last solo is heavenly though its the same as the one in Ozzy Osbourne's Mr Crowley just on a different scale.\n\r\nTell you what if any other band did a song about a former soldier who got blown to bits I probably wouldn't bother listening to it cos I'm sure it would suck. When I heard this It became my favorite song on And Justice for all and the album had alot of good songs\n\r\nBasically the song is about a former soldier who has had his limbs blown off and has lost his senses like hearing eyes and all and now he is wishing he would just die. Poor Bastard if I where in his state I would wish I where dead too lol\n\r\nOnce again very good song\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nMy favorite song ever. Horribly brutal.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nThis is one of my favorite videos, but every time I watch it, it leaves me shaking.  I think it's one of the most frightening stories ever, more so than ANY horror movie.  Just think about being totally conscious and aware, but unable to communicate or reach out to anyone.  You lay there, can't see, can't hear, taste, speak, or see.  Your only stimulus is what's in your head, your thoughts and memories.  How long can a person stay sane like that, being kept alive and not allowed to die.  Horrors!!\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nthere sort of soft songs where always better then their full metal stuff(but its still awesome).my favorite Metallica song by far.\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nI like this song because it's really evil sounding, which is what Metallica was best at. The thought of being trapped in your own body really is frightening. And you think \"Oh, it'll be over soon\", but no, it goes on for the rest of your natural life. And then, when you do die, how do you know it?\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\n\"back in the room\"\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nok its not too tough to know that this song is about a soldier who gets his legs and arms blown off and he loses nearly all of his senses due to a landmine. its all there in the last verse. Landmine/Has taken my sight/Taken my speech/Taken my hearing/Taken my arms/Taken my legs. And how he wants to commit suicide because he's lliving off of machines and suffering.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nThis song reminds me of everything i fear. I listened to this song at 2 last night scared the shit out of me. Please respond\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nThis song reminds me of everything i fear. I listened to this song at 2 last night scared the shit out of me. Please respond\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nI think it's about a victim of war that lost his legs, arms, ability to see, hear and talk.\r\nIn short: A horrible way to live because you're trapped in your mind without the ability of making contact with the outside world.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nGood Ass Metal Musiq Don't Judge\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nRead the book and can't wait to see the movie of \"Johnny Got His Gun\", the book this song was made after. Metallica does a good job capturing the escence and creepiness of the novel. Just wish Joey Jordison could've done the double-bass instead of Lars, cause he woulda made it frikkin terrifying.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nI like so much this song maybe because is one of the biggest problems where I come from, landsmine is the dirtiest trap which affects thousand of people in the world specially children...\n\n\n", "comment_219": "\nI have always thought that this song is about how awfull can a persons life be after war... This song kida tells us the war isn't the awnser to every disagreement between nations.\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nK this song frikkin ruelz... & as for the meaning it was based off of the book/movie called Johnny got his gun which is about a guy who is drafted during WWI and is hit by a mortar and is injured severely and gets his arms and legs amputated and loses sight speech, and hearing (Quoting the song here) but still alive and his life sucks.  In the end he jerks up and down repeatedly and the doctors eventually find out he is saying K I L L M E in moors code.  Its super depressing but I'm reading the book now and I find quotes that are used in the song, which is pretty kool\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nI would say that this song is more metaphorical, relating to alienation. Not being able to communicate or be understood with others (maybe such as James's parents when he was a kid).\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nThis song reflects the horrors that happened during WWI and WWII. if you listen to the very opening of the track, its gun fire, people shouting and bombs exploding. just like in WWI and WWII.\n\nalso, the lyrics \"Back in the womb, its much too real. it pumps life that I must feel.\" That means the person has got shellshock and is in the hospital. and the final verse\"Landmine has taken my sight, Taken my speech, Taken my hearing, Taken my arms,Taken my legs, Taken my soul, Left me with life in hell\" Means that he just been hit by a landmine, and it has more or less made him a vegetable.\n\nand lastly, the chorus \"Hold my breath as I wish for death\n Oh please, God, wake me\" means that the peron is on his deathbed, and wants god to end the pain.... ny ending his life...\nOverall, this song is very dark, but aweome!\n\nI HOPE THAT THIS DOESNT OFFEND PEOPLE, AS I DID NOT INTEND TO. I AM A MASSIVE METALLICA FAN, AND I HOPED YOU LIKEDMY LITTLE ANALYSIS OF THE SONG\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nI don't know if this is right or not, but I had thought that instead of saying Â¨Im waking up I CANNOT seeÂ¨, that it was Â¨Im waking up I CAN NOW seeÂ¨ So could someone tell me which is right\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nI believe the whole meaning behind the song is take a look at your life and really ask yourself, can it get much worse compared to the guy in this song? The dude lost everything. How could it get much worse than that guy being alive but being trapped basically.\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nI'm not interested in being the devil's advocate and neither am I interested (at the moment) in participating in any forums. But I've been a fan of music for a long time (I'm 28) and I think that this song is about me. Check out (Australian fans) my comment on 'Luv Your Life' by Silverchair. I say in it that I think that I'm Jesus.\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nOr it could be about PTSD in general. A lot of our vets suffer in silence, not able to reconcile what was done for \"God and Country.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nThese are the lyrics to \"One\" from S&M.  They added a tiny little bit at the end to jazz up the song when they were performing with the symphony.\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nJames adds that kind of shit all the time getek20. It is not to jazz up the song with the symphony... Screw the symphony. Even though he's a jackass, Hetfield has a good way of livening up the crowd by that Hey's and Hoi's etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nWow all you guys are wrong...this song is about LOCKED-IN SYNDROME its not about a guy who lost his limbs...locked-in syndrome is where you can not move or speak its like being in a vegetable state except you're conscious. Look it up its a terrible thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nOk I am a big metallica fun and I came up with this little story based on the titles of metallica songs. the titles are in capital letters.\n\n\r\nI park my 2*4 and step out, home at last but Iâ\u0080\u0099m in a FRANTC state thinking about my narrow ESCAPE. I get into the house and I drink some of my WHISKEY in a JAR but that doesnâ\u0080\u0099t ease the pain clearly caused by the THORN WITHIN. At this point even i know the only solutions to deal with the STRUGGLE WITHIN. In the SMALL HOURS of the morning I stare into the dark night and see ORION, but now is not the time to think about ASTRONOMY the pain is too much it feels like I'm TRAPPED UNDER ICE yet I cant seem to convince myself that its my fault, betrayed by who i thought was a friend and betrayed by THE JUDAS KISS now I go towards my bed in this old rugged house, how am I supposed to sleep in THE HOUSE THAT JACK BUILT after I shot him between the eyes and left him STONE DEAD FOREVER and at that point it felt like NOTHING ELSE MATTERS. I close my eyes and try to sleep hoping it will all just FADE to BLACK but THE MEMORY REMAINS clear to me that I will always be UNFORGIVEN and it worries me because the things i just did make me wonder AM I EVIL. This cant be I was raised right how did I turn to this BAD SEED I know what I did was wrong but I canâ\u0080\u0099t feel it, itâ\u0080\u0099s like I am on ANESTHESIA.\n\r\nI had lost my mind when I decided it was KILLING TIME, I ran around taking them all out high on drugs I believed I was the INVISIBLE KID and the opponents I took out one by one where DISPOSABLE HEROES. I canâ\u0080\u0099t sleep so I stay up looking at the DIRTY WINDOW and start to think maybe its time I DISAPPEAR because right now I am CREEPING DEATH at any point the cops and feds will be all over looking for me. For so long I looked forward to exerting my revenge but that day seemed to be THE DAY THAT NEVER COMES nothing hurts more than taking the life of your BROTHERS IN ARMS. The pain was too much yet still I feel like the HERO OF THE DAY and I decided not to think about what others thought of me after all to the one who I was revenging I would always be the perfect PRINCE CHARMING her LOVERMAN as was the case when she lived and everyone else called me KING NOTHING. As my nerves began to calm I remember what MAMA SAID about salvation forgiveness trusting in God and THE FOUR HORSEMEN but I will not pray to THE GOD THAT FAILED seeing as he let my loved one die she truly was MY FRIEND OF MISERY so I decide to live the rest of my life with NO REMORSE.\n\r\nKnowing my fate as I step into the bathroom that bottle of CYANIDE seems appealing but I will not give up I will FIGHT FIRE WITH FIRE. Arrested I find myself locked in a SANATARIUM because the cops couldnâ\u0080\u0099t believe any normal person could do what I did. The DEVILS DANCE is what they called it and maybe this is where I would spend the rest of my days on THE FRAYED ENDS OF SANITY. A brilliant mind I donâ\u0080\u0099t deserve to be here but what i did deserves to be punished and that is SAD BUT TRUE. At this rate I donâ\u0080\u0099t think even a priest can PURIFY my soul. I think of to myself POOR TWISTED ME but I decide to not have self pity because when it comes to who killed those men I will always be the ONE. From a motherâ\u0080\u0099s boy RONNIE went on to become a killer and sometimes I would think SO WHAT right until the judge decided i would RIDE the LIGHTENING. I know I am SOME KIND of MONSTER but do I really deserve to die. The judge is not letting me off easy as he proclaims THAT WAS JUST YOUR LIFE and now youâ\u0080\u0099ve reached THE END OF THE LINE. Alone in my cell I think it seems I have become THE OUTLAW TORN thinking about SUICIDE AND REDEMPTION what to do I cant let them kill me oh the STRUGGLE WITHIN talk about THE THING THAT SHOULD NOT BE. After a nights sleep I think maybe its fine after all TO LIVE IS TO DIE what is this THE UNNAMED FEELING maybe its time to TURN THE PAGE. \t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\n@jugzar, I totally agree with you, but I think flamethrowers are also a very, very crude weapon of war. Whoever thought 'I wanna set those people over there on fire' to win a war, deserves the worst.\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nthis song is about self existencecy with a war theme inspired by the movie johnny got his gun. thats all \t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nthese dudes had something great going on from '83 to '91. its a crying fucking shame they lost it\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nAnd btw Metallica Ruelz until Black album then sux, Megadeth ruelz until risk, Then ruelz forever\t\t\t\t\n\t\t\t\t\n\n"}