{"comment_0": "\nHer vocals on this-you can hear her almost on the verge tears.\r\nShe wrote this after she had a conversation with her now husband\r\nBlake Shelton-he just one day told her out of the blue about his\r\nbrother who was killed in a car accident.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI absolutely love this song! I'm 25 years old and my husband passed away almost 7 months ago at the age of 25. He was in the ending stages of stomach cancer before we found out he had it. We were married for 1 year and 10 days. This song just really touches my heart and the lyrics speak what my heart feels.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\n7 months ago my FiancÃ\u0083Â©e passed away due to sudden heart failure. Looking back on our last conversation I just remember him saying how blessed he was to have found his soul mate. Only hours after we said our goodbye and said our last I love you, he went to bed and never woke up. This song really speaks out to me in so many ways. \n\r\nâ\u0080\u009cThey say Iâ\u0080\u0099ll be okay,\r\nBut Iâ\u0080\u0099m not going to ever get over you.â\u0080\u009d\n\r\n-People tell me all the time that Iâ\u0080\u0099m going to okay, but I donâ\u0080\u0099t expect them to understand. What they donâ\u0080\u0099t see, is that I wish so badly to die too. Itâ\u0080\u0099s so utterly painful to move on with life without my lover, my comforter, my home and my best friend. Itâ\u0080\u0099s so heart wrenching to think about having to start over from a shattered future and broken dreams. They say Iâ\u0080\u0099ll be okay, but my heart canâ\u0080\u0099t bring myself to ever think of getting over him. \n\r\nâ\u0080\u009cBut you went away\r\nHow dare you, I miss you.â\u0080\u009d \n\r\n-Even though his passing is not his fault, I find myself getting angry at my love for leaving me here to fend for myself. I get angry for the despair and grief he has put me in. I feel so cold and naked in such a big world. He was my rock and was always by my side. Now itâ\u0080\u0099s like Iâ\u0080\u0099m standing on this rock all alone, stranded. \n\r\nâ\u0080\u009cIt really sinks in, you know\r\nWhen I see it in stone.â\u0080\u009d\n\r\n-Because his passing was so sudden and disbelieving, it took awhile for a stone to be made for him. I try to go visit his grave often and bring roses (he loved buying me roses). The other week I went and there his name was- finally in stone. I froze and went numb all over. It was like starting all over again. I stayed there for an hour and just lied on the dirt where his body was laid and sobbed. It really does sink in when you see it stone. \n\r\nEverything else this song says I can really relate too as well. I went my first Christmas without him. I got through it with the help of my family. Last Christmas, was the best Christmas and last Christmas I had with him with so many memories that my family and I were able to look back on. Though hearing songs on the radio that we used to listen to over and over again is like getting hit by a truck, I sometimes can smile and remember the things we were doing when the song was being played. Like driving in his car on our long road trips to nowhere just blasting the music and singing at the top of our lungs. No cares in the world- Blaring the base to piss of the crabby neighbors when washing his car every Sunday...Just so many memories this song makes me think of, I wish I could just list them all here. \n\r\nThough this song is sad, I have found that it is good to cry and let it out. So I play this song, have a good cry and trudge forward and try and get through another day.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\n7 months ago my FiancÃ\u0083Â©e passed away due to sudden heart failure. Looking back on our last conversation I just remember him saying how blessed he was to have found his soul mate. Only hours after we said our goodbye and said our last I love you, he went to bed and never woke up. This song really speaks out to me in so many ways. \n\r\nâ\u0080\u009cThey say Iâ\u0080\u0099ll be okay,\r\nBut Iâ\u0080\u0099m not going to ever get over you.â\u0080\u009d \r\n-\tPeople tell me all the time that Iâ\u0080\u0099m going to okay, but I donâ\u0080\u0099t expect them to understand. What they donâ\u0080\u0099t see, is that I wish so badly to die too. Itâ\u0080\u0099s so utterly painful to move on with life without my lover, my comforter, my home and my best friend. Itâ\u0080\u0099s so heart wrenching to think about having to start over from a shattered future and broken dreams. They say Iâ\u0080\u0099ll be okay, but my heart canâ\u0080\u0099t bring myself to ever think of getting over him. \r\nâ\u0080\u009cBut you went away\r\nHow dare you, I miss you.â\u0080\u009d \r\n-\tEven though his passing is not his fault, I find myself getting angry at my love for leaving me here to fend for myself. I get angry for the despair and grief he has put me in. I feel so cold and naked in such a big world. He was my rock and was always by my side. Now itâ\u0080\u0099s like Iâ\u0080\u0099m standing on this rock all alone, stranded. I cry â\u0080\u009cHow dare you! How could you! I miss you!!!!â\u0080\u009d\r\nâ\u0080\u009cIt really sinks in, you know\r\nWhen I see it in stone.â\u0080\u009d\r\n-\tBecause his passing was so sudden and disbelieving, it took a while for a stone to be made for him. I try to go visit his grave often and bring roses (he loved buying me roses). The other week I went and there his name was- finally in stone. I froze and went numb all over. It was like starting all over again. I stayed there for an hour and just lied on the dirt where his body was laid and sobbed. It really does sink in when you see it stone. \r\n-\t\r\nEverything else this song says I can really relate too as well. I went my first Christmas without him. I got through it with the help of my family. Last Christmas, was the best Christmas and last Christmas I had with him with so many memories that my family and I were able to look back on. Though hearing songs on the radio that we used to listen to over and over again is like getting hit by a truck, I sometimes can smile and remember the things we were doing when the song was being played. Like driving in his car on our long road trips to nowhere just blasting the music and singing at the top of our lungs. No cares in the world- Blaring the base to piss of the crabby neighbors when washing his car every Sunday.,,,Just so many memories this song makes me think of, I wish I could just list them all here. \n\r\nThough this song is sad, I have found that it is good to cry and let it out. So I play this song, have a good cry and trudge forward and try and get through another day.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nMy ex-boyfriend died almost a year ago from a drug overdose. His dad got him into them when he was only thirteen or fourteen and he tried quitting so many times. He was such a beautiful person, but I couldn't do it any more and broke up with him in december. We stayed friends, but when he dropped out of high school I stopped talking to him for a long time. The last time I talked to him he asked me for money and I said no and that I couldn't talk because everyone in my house was asleep. I was kind of rude, it makes me want to cry every time I think about it. I really loved him, he died about three months after I talked to him, in June. This song reminds me of him because I will never get over this boy. He was only nineteen, would have turned twenty in February. It made me cry at work the other day, even though I should be over it...right? Rest in peace Harrison.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis is about Blake Shelton's brother dying in a car accident. Considering Miranda and Blake are a couple, Miranda wrote it for him.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nWe played this song at my 13 year old sons funeral.  He died in a tragic horrible accident.  When I hear this song it really hits home.  Nicholas died right before Christmas on 12-17-12.\nWe had the presents and the tree.  It happened at home in his older brothers room.  Now we only see him in stone.  I haven't got over this and I never will.  Thank you for such a beautiful, meaningful, and sad song.  A grieving mother\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe fact that Miranda had to sing this song because Blake couldn't bear to sing it, makes my heart hurt. RIP to all the beautiful people who were taken away too soon.\t\t\t\t\n\t\t\t\t\n\n"}