{"comment_0": "\nI feel this song is about being an enabler. It can be to an addiction, and abusive relationship, to your own personal demons, what have you. In any case, you are faced with the decision to care, which requires strength and entails a lot of emotional pain as you head down the path of rightousness. Your other choice is to plead silence, the weaker choice of accepting the status quo and doing nothing at the cost of happiness.\n\r\nSome corrections. Trust me on these:\n\r\nCan keep refusing right -----> Can't keep refusing rights.\r\nWeekends are calling --------> Weak hands are calling.\r\n(Fate)-----------------------> (Face)\n\r\nGreat song, and sentimentally powerful. One of my favs to sing at karaoke.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song is about some who has a friend who's on drugs and he's in trouble but he doesn't realize it. \"gave in again, the bastard\" he gave in to drugs again \"can't keep refusing rights\" he will never stop uding drugs \"so he'll loan the cash\" he'll say sorry and he'll promise not to do it again \"but the sin is on the hands of you\" you can do something about it \"so to care or plead silence weak hands are calling\" are you gonna do something or try to ignore it \"i can't seem end these images, hauntingly looks like hell\" you can't stop thinking about how your friend is on drugs \"to end this catastrophic scene\" to end the sad scene of how your friend is on drugs \"awake and breathe in\" this is all real its not just some dream that you hope to wake from. This is my opinion of the song it could mean anything. i just wanted to give my opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nSorry guys.......the line should say\n\r\nHe'll LOAN the cash\n\r\nand\n\r\nTo care or\r\nPlead silence\r\nWEAK HANDS are calling\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nsure....not a problem.\r\nread this paragraph from an interview with Chevelle during their first cd.\r\nCriticized by conservatives, embraced by many Christians, and supported by rock enthusiasts in all walks of life, there probably isn't a band more entrenched in the \"are they/aren't they?\" debate than Chevelle. Given the \"Christian band\" label the moment their Squint Entertainment debut Point #1 hit store shelves, the band of brothers acquired the title by default, not necessarily because they wanted to. \"It's something that's probably going to follow us around forever and that's fine,\" drummer Sam Loeffler once told Entertainment Insiders. \"It's pretty simple. We originally signed with a record company that was backed by Word [Records], so the record was in Christian bookstores. It was really an accidental thing.\"\r\nheres the interview if you want a better look:\nchristianitytoday.com/music/glimpses/2004/…\r\n;)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nWow.. reading about all the religious meaning this song might have sort of sucked the greatness out of it. Damnit.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song Is about those children we see on T.V. all the time and people are trying to get us to send In money to help them out. This could explain the \"bastard\". This Is part of an interview with Sam that explains It. \n\r\n\"KNAC.COM: I wanted to ask you about â\u0080\u009cPanic Prone.â\u0080\u009d \r\nLOEFFLER: â\u0080\u009cPanic Proneâ\u0080\u009d is an interesting song because Iâ\u0080\u0099ve just recently learned what itâ\u0080\u0099s about. Pete was watching television and one of those commercials came on, â\u0080\u0098Save the Childrenâ\u0080\u0099 commercials. That song is about making a decision whether youâ\u0080\u0099re going to sit on your couch and watch this happen or youâ\u0080\u0099re going to stand up and do something about it. That song isnâ\u0080\u0099t about if you should or shouldnâ\u0080\u0099t do it, itsâ\u0080\u0099 just about â\u0080\u0093 Are you going to do it? Is this my problem? I was really surprised that it was about that. I think one of the lines is actually about one of our friendâ\u0080\u0099s falling off the wagon, too. I think the first line might be about that.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nChevelle was NEVER a CHristian band. They were labled as that...and tried to distance themselvesfrom it from the start. Because someones songs refer to spirituality and a higher power doesnt mean they are Christian. But you CHristians would love if a band as bad ass as Chevelle backed you. ;-) SO I can see what you said this. And Kruzen you dumb shit I can explain why they are signed to the label. Because when youre nobody as a band and ANYONE asks to sign you you dont say no. Can YOU tell while this quote was posted in 2004 it is irrelevant because they had already signed to Epic. Fuck...think before speaking...but since youre a busted fucking condom read a book.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe song means this as many may disagree but this is actual fact: \n\r\nWhen we sit in front of a TV and one of those \"help the children\" commercials come on.  We all do it...we sit there thinking should we call in and help?  To end the catastrophic Scene that is unfolding in front of our eyes?  The song is not about whether or not you should or should not do it, it is about the deliberation of sitting there taking no action or to actually say f'it Im going to do somethin this time no more waiting for the next opportunity.  \"These images hauntingly look like hell\" and should we \"loan the cash\" but the sin's on the hands of you.  Its all there, read it with this in mind as being the meaning.  It makes perfect sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThere's close enough\r\nAnd there's too far\r\nIt won't change an empty stair\n\r\nCorrection: There's close enough\r\nAnd there's too far\r\nIt won't change an empty stare\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nHeck, I'm about 13 years late. But whatevs.\n\r\nThis song is about the redundancy of saying you're going to do something.\n\r\nI think Pete even said that the song wasn't about a should or shouldn't, it was about a would or wouldn't. Like, if you want to change something, are you going to? Or are you NOT going to?\n\r\nNo one ever thinks much on this, at least, I haven't.\n\r\nI think the lyrics shed a much brighter light on a darker issue. The fact that most of us complain about changes that should be made. We just don't end up DOING anything about it. That's the deeper chasm of reality we haven't quite explored, yet.\n\r\n#NewYearNewMe\n\r\nNah, jk, don't do hashtags. Too mainstream. XD\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nthey never were a christian band...thats a misconception.\r\ncheck your sources ;)\r\nthis song frickin rules, sort of one of those moments where you have to decide to care about something or move on...help those in need or look past them to the end of the line.\r\nAgain, I see so many war references to George W. Bush [makes the 'bastard' remark make sense] and Iraq...its great.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nChevelleinc2005: dictionary.reference.com/… , since when is the use of a legitimate dictionary word grounds for renouncing ones faith? \n\r\nas to whiteout: would you care to explain why chevelle is signed with a sub-label of tooth & nail, a christian rock label, and is made up of three christian brothers who make music together?\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nchristianitytoday.com/music/glimpses/2004/…\n\n\n", "comment_13": "\nofthinking.h t ml\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nthey wera a christian band...check some of their older lyrics...and according 2 my history teacher, bastard isnt really bad\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni'm not claiming to know a lot about Chevelles past, but just because a band is made up of christians, and some of their songs have some christian overtones, doesn't necessarily make them a \"Christian Band\", and if you interpret the lyrics of \"Breach Birth\" as breaking molds such as classification of music, then you'd start to wonder if Chevelle would ever consider themselves a \"Christian Band\" ... or any other type of band for that matter, they are Chevelle they write and play great music end of story\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI interpret this to mean that your duty is to be kind and honest, and not worry about the consequences. For instance, We've all seen bums out beggin' for money before, and we all know that 90% want beer or drugs. Do you not give them money, knowing that you probably are keeping them for buying more drugs or booze, or do you loan them the cash, knowing that you might be helping them out of a jam? My personal solution is to say,\"Hey, you hungry? I don't have any cash but I'll take to McDonalds and buy ya something. Jump in.\" That way, if they really want food, they'll come, if they want money to buy jumk, they won't. Of Course, being a male in good shape and having a concealed weapons permit pretty eliminates any worries about being raped or anything like that. No, I'm kidding. The point is, is it our our duty to judge others, or to just give willingly, regardless. Anyway, read through the lyrics with this frame of mind, and I'm sure you'll make the connections. If not, then I'm probably out on a limb.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nRevolution is in the right direction. This song to me is from the point of veiw of a third person looking into a relationship/friendship where one person uses the other selfishly, and the one being used is easy to be taken advantage of, because it's in his nature to be sympathetic. The Narrator is looking at this and going, do I say something, or do I not involve myself in that business. Save a person or loose a friend? The conflict is in the head of the narrator.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI doubt if this is what Chevelle meant by the song, but for me when he says\n\r\n\"There's close enough \r\nAnd there's to far\" \n\r\nit's a reference to relationships with people you used to be close to.  Especially when you have changed and these old aquaintences represent part of your old self that you're trying to leave behind.  You still care about them, but it will never be the same as it once was.  \n\r\nI love the ending with the heavy guitar rif\n\r\n\"come, enter the foreign\"\n\r\nit's like a challenge to move on, even though there's so much uncertainty.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis is a great song.  I think it's sang in third person.  Everytime I hear the song I can picture a slightly derelict man wasting his money and time on whatever fits, possibly gambling.  I got the gambling from the unceremonious hint, \"He'll loan the cash.\" Now the guy being described knows he's in a bad situation; \"Hauntingly looks like hell.\" That describes how he sees his stark raving sick sad little world.  But that's just how I view the song.\n\r\nKudos\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nthis song sorta reflects on my life becuase if you think what bastard means (fatherless son) with that in mind. think about  cant keep refusing rights (to keep refusing help) hell own the cash(dad thats not there or god)\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ngreat song, i love the opening hahaha. not expected for a slow start to a song. the chorus is amazing. good stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThis song is up there for me with my two other favs....Point #1 and Grab Thy Hand.  I don't know but I find this song to be very inspirational to me.  \n\r\n\"Gave in Again\" - Taking the easy way out\n\r\n\"Can keep refusing right So, he'll own the cash But the sin, is on the hands of you\" - Keep refusing what you know is truely good for you...you can do whatever you want because it's your choice...but all your mistakes and dissapointments all rest on you.\n\r\n\"So, to care or Plead silence Week Hands are calling\" - A cry to God...taking the time for Him or going about without Him...(Weak Hands)....Praying to God that you need his assistance to make it through.\n\r\n\"There's close enough And there's to far It won't change an empty stair\" - What you want in life....making excuse about \"settling or giving up\"....you will never get reach the top of your desires if you never go after it.\n\r\n\"But, I can't seem to end These images Hauntingly looks like hell\" - Fear of failure\n\r\n\"(come) Enter the foreign (fate) All thatâ\u0080\u0099s shameful (cheat) May the past find (out) Separating\" - Debating what to do....God telling you to come to him...but you are ashamed of what you done in the past....\"Separating\"...you going to god and going for your goals and leaving behind all that has heald you back.  \n\r\n\"To end this catastrophic scene Awake and breathe in\" - Finally making the right choice and feeling anew\"\n\r\n\"To care or (To care or) To care or (To care or)\" - Caring  about your choices and taking the time to relish in God's greatness....no other choice now that you have found what is right.\n\r\nI really don't know if that makes any sense...just how I think of the song.  I just really think the whole song is about debating and making decisions and trying to find guidance.  But hey that's just me.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\non lou brutus' hard drive radio they had chevelle on there and they said they made this song when they saw one of those commercials of poor people over in those other places.... but still it could have different meanings.... whatever it means i love this song to pieces i love chevelle they rock my socks off!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis reminds me of the repreated drug and emotional problems that a friend of mine is going through. Much like Themuse97's interpretation, but I wanna say my version anyway.\n\r\n\"Gave in again, the bastard\"\r\n(He gave in to his drug habits again.)\r\n\"Can't keep refusing rights\"\r\n(He doesn't care that he's shoving those who care for him away)\r\n\"He'll loan the cash, but the sin\r\nIs on the hands of you\"\r\n(Certain people may have introduced him to it, but it was still his choice go along with it)\n\r\nChorus:\r\n\"So, to care or plead silence\"\r\n(Should I do something, or stay out of it and let him suffer the conseqences of his own actions? Would he even listen to me anyway?)\r\n\"Weak hands are calling\"\r\n(He's just sinking deeper into his problems)\n\r\n\"There's close enough and there's too far\r\nIt won't change an empty stare\"\r\n(Whether he's high or not doesn't change the fact that he doesn't care)\r\n\"But I can't seem to end these images\r\nHauntingly looks like Hell\"\r\n(It's going to kill him if he isn't careful. The more I say I don't care about him, the more I actually worry.)\n\r\n(chorus)\n\r\n\"Come, enter the foreign\r\nFace, all that's shameful\"\r\n(The first time he got hooked)\r\n\"Cheat, may the past find\r\nOut, seperating\"\r\n(He's shoving away his family and friends that he's known all his life)\n\r\nLast Chorus:\r\n\"To end this catastrophic scene\r\nAwake and breathe in\"\r\n(I hope one day he realizes what he's doing to himself and those around him before it kills him.)\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nthis reminds me more of war than anything else \r\n\"he gave in again the bastard\" the president gave into his power hungary desires by going to war\r\n\"he'll loan the cash but the sin is on the hands of you\" he supplies the money for the war but does not actually become a soldier and fight, the \"you\" is the soldiers that are actually fighting and killing people \r\n\"to care or plead silence the weak hands are calling you\" weak hands meaning the victims of war the civilians can either take a stand and protest or help war victims or they can plead silence (just not do anything about it)\r\n\"theres close enough and theres too far it wont change an empty stare\" close enough could be the people fighting the war or people involved in it and too far is the people who just dont pay attention and dont care about it, the empty stare is all the people at home who hear about killing in a war but jst stare at the news and dont say or do anything to help\r\nthe images looking like hell are the images of killing and death and people being blown up, could be images on the news of the war going on,\r\nEnter the foreign\r\n(fate)\r\nAll thatâ\u0080\u0099s shameful\r\n(cheat)\r\nMay the past find\r\n(out)\r\nSeparating\n\r\nforeign is the foreign country we are fighting against, it is shameful because we are killing them, in the past find out separating means we should look to the past and look at the negetive effects of war and separate from the old ideas (that killing is ok)\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nto end the catastrophic scene awake and breathe in\r\nend the war and survive\r\nto care or to care or..reminding you of your choice and your respondsibility to care for people who are dying and do something about it, the or is the other option of just doing nothing and not caring\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nyep wut i said^^ :P\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nthis is what i think this song means:\n\r\nduring the riff, he says:\r\n(come)\r\nEnter the foreign\r\n(fate)\r\nAll thatâ\u0080\u0099s shameful\r\n(cheat)\r\nMay the past find\r\n(out)\r\nSeparating\n\r\ni think this lets us know that one of his friends is getting cheated on and when he says: \n\r\nThere's close enough\r\nAnd there's too far\r\nIt won't change an empty stair\n\r\nhe doesnt know if what he wants to say to his friend is none of his business, and that it may be something thats \"too far\", but hes scared of if he does say something, will it ruin the friendship?\n\r\nbut i dunno, thats just what i think\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthis is what i think this song means:\n\r\nduring the riff, he says:\r\n(come)\r\nEnter the foreign\r\n(fate)\r\nAll thatâ\u0080\u0099s shameful\r\n(cheat)\r\nMay the past find\r\n(out)\r\nSeparating\n\r\ni think this lets us know that one of his friends is getting cheated on and when he says: \n\r\nThere's close enough\r\nAnd there's too far\r\nIt won't change an empty stair\n\r\nhe doesnt know if what he wants to say to his friend is none of his business, and that it may be something thats \"too far\", but hes scared of if he does say something, will it ruin the friendship?\n\r\nbut i dunno, thats just what i think\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nthis has got to be THE BEST chevelle song, and one of the best ever made by humans\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ni agree with james.w. This is easily one of, if not the best chevelle song. I'm not sure if it's one of the best songs in the world, but it's pretty damn close!\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\n\"Manson and MJK are both perfect examples of why politics should not mix with music\" - Redline ??????\r\nYou embarrassed yourself when u said GWB was an honourable man. I wonder what his hand puppet friend will tell him what to do tomorrow...\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\n\"Manson and MJK are both perfect examples of why politics should not mix with music\"\r\nMaynard is no where near like manson.\r\nMJK is prolly one of the greatest metal (if not all music styles) writers known to man.\r\nHe doesnt reall sing about politics, yeah ok APC's latest album was about politics and war but wht do you expect... he used to be in the US army.\r\nI cba ranting on cos its pathetic how you can slag of a song writer when i very much doubt that you cld write anything better than what Maynard has writen or even Manson for that matter.\n\r\nSo before you start slaggin off a song writer get a clue on what their songs actually mean and represent. kk thnx bye\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI love this song,\r\nit hits me deeply,\r\ni love chevelle and go figure I love the car chevelle to anyways,\r\nI sing this song to my father,\r\nIt hirts so perfectly for me it hurts,\r\nSongs me different things to different people,\r\ni think it's abut someone taking advantage of someones kindness,\r\nor innocence,\r\nmaybe Im wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI love this song, its so beautiful. Its good to see that chevelle can create a beautiful song thats not like a lonely visitor or bend the bracket. Pete's voice is so amazing. i wish I had half the voice talent he has. I personally think that NONE of chevelles songs are about political things. but thats just me. they are deeper, more personal. it's not like them to just complain about stuff like that. like alot of other bands do\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nthis is my fav from chevelle.. wonder if he really is mentioning weekends are calling i.e when one goes and confesses his sins and asks for forgiveness  -\r\nforeign fate - belief in christ ...\r\nbut he could also be singing weak ends are calling meaning ones otherside ..weaker self that keeps giving in ....who knows...\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\n\"Gave in again\r\nThe bastard\r\nCan keep refusing right\r\nSo, he'll loan the cash\r\nBut the sin, is on the hands of you\"\n\r\nPossibly a girl? owes money but she can't pay it.  So another gave in, he just couldn't refuse the right way.  And the narrator of the song thinks he's a bastard for giving in and not letting the girl deal with her own problems.\n\r\n\"So, to care or\r\nPlead silence\r\nWeekends are calling\"\n\r\nThe question is, should you always help a person to show you care, of remain silent and let them deal on their own?\n\r\n\"There's close enough\r\nAnd there's too far\r\nIt won't change an empty stair\n\r\nBut, I can't seem to end\r\nThese images\r\nHauntingly looks like hell\"\n\r\nThe guy is petrified of letting people get close.  There's close enough...  But he likes having people there for him.  He doesn't want people to be too far away...\n\r\nTry as he might, the guy is tortured.  He can't seem to get the haunted images out of his head.  Undertones that the girlfriend hurt him?  Possibly something more?\n\r\n\"(come)\r\nEnter the foreign\r\n(fate)\r\nAll thatâ\u0080\u0099s shameful\r\n(cheat)\r\nMay the past find\r\n(out)\r\nSeparating\"\n\r\n\"Cheat, may the past find out...\"  The girl can cheat on him, but he wishes he had found out in the past.  \"Separating\" means he's leaving her?\n\r\n\"To end this catastrophic scene\r\nAwake and breathe in\n\r\nTo care or (To care or)\r\nTo care or (To care or)\"\n\r\nHe wants to end it.  Things are too painful.  But what else can he do but care?\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nthis song is about commercials with the starving and poverty that goes on in other countries. saying that if you care about it, its your choice to pick up the phone and donate money to them\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nWow I just heard this song for the first time and it is awesome!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nOkay, the \"Save the Children\" interpretation of this song makes sense, especially because apparently Pete designed the song that way.\n\r\nBUT- I originally thought this song was about a girl who gave in to a guy for sex, had a child, and was firced to try to raise the baby alone because the guy only gave her money and didn't give a shet. If you kinda go line by line, my interpretation could work as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nOkay, the \"Save the Children\" interpretation of this song makes sense, especially because apparently Pete designed the song that way.\n\r\nBUT- I originally thought this song was about a girl who gave in to a guy for sex, had a child, and was firced to try to raise the baby alone because the guy only gave her money and didn't give a shet. If you kinda go line by line, my interpretation could work as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nOne... it's \"weak hands\" not weekends... Which makes more since seeing this song is about those \"save the children\" commercials that are on TV; ie the weak hands of the starving kids.\n\r\nEven so... when I first heard this song... My mind saw a connection between these lyrics and the Merchant of Venice... more specifically, of the character Shylock\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nthe lyrics are not even right\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI think this song is about a woman who becomes pregnant with a mans child decides to have an abortion. \r\nShe gave in again to his sexual desires because although they are not together, she still loves him.\r\nThe cash he loans is for the proceedure but, she will have to bear the weight of actually killing the child.\r\nyada yada yada\r\n:) I too love this song \t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\ni think its about someone with a drug addiction he says \"he gave in again the bastard\"  \"so hell loan the cash\"\n\r\nmy moms given into me asking for money when i was in my addiction.\n\r\nand then hes basically saying should i care or plead silence to this because either way he goes its gonna be hard.\n\r\nthen he says theres close enough and thres too far it wont change an empty stare....basically no matter if hes there for them or staying away its not gonna change them until they r ready...\n\r\ni also agree with shattered diamond about the war but it could mean different things i guess depending on the person....\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\ni've always thought this song was about a friend who has a problem with something, maybe rape, abuse, drugs, and the friend doesn't know if he should be a friend and keep it a secret, or tell.\r\nthat was always my interpretation of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThere's close enough\r\nAnd there's too far\r\nIt won't change an empty stair\n\r\nBut, I can't seem to end \r\nThese images\r\nHauntingly looks like hell\n\r\nSo, to care or\r\nPlead silence\r\nWeekends are calling\n\r\nTo care or\r\nPlead silence\r\nWeekends are calling\n\r\ni like this part. because it reminds me of a relationship with my best friend, i used to have, that i had to break it off with.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\n(come)\r\nEnter the foreign\r\n(fate)----(face)\r\nAll thatÃ¯Â¿Â½s shameful\r\n(cheat)\r\nMay the past find\r\n(out)\r\nSeparating\n\r\nUmmm? I think it should say (face)\r\nyou never hear the T in in fate.\r\nsounds more like an S/(ce) sound.\r\ni could be wrong... no im not.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nyoutube.com/…\n\r\nCHECK OUT MY MUSIC VIDEO FOR PANIC PRONE!\r\nIt's very good, I've never gotten any bad comments on it yet.\n\r\nAnyway, yes, I'm pretty sure the song is about trying to save someone who can't be saved and has gone past their limit, whether it be from drug abuse, domestic violence, etc. \t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI always thought this was a song about him and his brother and their relationship to their own cheating father, and separation of parents. How he makes the child-payment but is a vacant father. Feels like a bastard (literally)\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nTo me, this song kinda speaks of someone who has problems, may it be an addiction or what have you, but they're alienating the people who are dependent upon or who care about them. This person apologizes and makes promises that are broken immediately afterward because of their problem, and they feel guilty about their weaknesses. Basically the other person is telling them to face their issues with dignity and to try to change. At least, that's how I see it. It may be wrong.\n\r\nMy eyes just melt when I listen to this song, it's so beautiful! I LOVE Chevelle, the geniuses!\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI look at this song differently. I think this song is about a person is too nice and hurts himself because of it, or a pushover. Reminds me a lot of my brother. \n\n-The first verse is talking about someone asking the pushover for money knowing he'll \"give in again\" and Pete's like \"the bastard\" like get it together man, you \"can't keep refusing rights\". Everyone has rights over what they're willing to do, and the pushover just gives up to others pleas too easily. Pete says \"so he'll loan the cash/ but the sin is on the hands of you\". He's talking to the person that got the money out of his friend and he's like you know you just used someone you douche.\n-In the chorus, \"weak hands are calling\" is a reference to the people who ask things from you. Pete says \"plead silence\" and don't give in basically.\n-second verse is kinda self explanatory, kind of confusing to the rest of song (unusual for Chevelle)\n-the bridge is saying stop living your life with so many rules. don't listen to what others tell you and only care about yourself and what makes you happy.\nRead more at songmeanings.net/songs/view/3530822107858509027/\n\n\n", "comment_53": "\nI think this is about someone who sees these people or a person who need help \"weak hands are calling\". \n\n\"Can't keep refusing rights, so he'll lend the cash\" - He feels he has to help them, because they are human beings and he feels they have the right as any other human being does to not have to live maybe without food, water, shelter.  Things like that.  And so, he lends them the money to get on their feet.\n\n\"But the sin is on the hands of you,\" - He is now partially responsible for whatever this person or people do with the money he lent.  Do they use it to feed a substance abuse habit? This is what I think \"sin\" refers to.\n\n\"So to care or plead silence,\" - Do you continue to care and \"help\" someone who just keeps feeding their habit or do you \"plead silence,\" meaning you do nothing?\n\n\"It won't change an empty stare,\" - To me this indicates the money won't help get the person or people on track with their life/lives because they only use the money to feed their habit.  Possibly \"an empty stare\" means someone who isn't in their right mind, they aren't completely there.  Maybe because they are taking drugs?\n\n\"These images hauntingly looks like hell,\" -  The man is obviously disturbed by what he is seeing.  People or a person addicted to drugs can really let themselves go when all they are concerned with is getting the next high or what not.  That's no life for them, and this person realizes that and is haunted by it.\n\nThe person is stuck between the decision to help or not.  If he helps, he knows the people or person will just give in to their habit.  If he doesn't, he continues to be haunted by these images.  So, he is very panicky over this and often thinks about it.  \n\nI also think this could be attributed to a larger scale interpretation.  For instance, could the main person represent the government?  Just a thought, but this could go into controversial conversations, so I'll leave it at that.  But, what a great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nGreat song musically. I think this song means if one person is panicing about the consequences it can pull out to be, that they are all handing it to you and blaming you for it. If that makes since at all.. I guess they're not a Christian band anymore.. \"the bastard\" really shocked me.. o well i still like them.. haha\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nEach of the brothers is a Christian, but dont spoonfeed me some crap about the word bastard. They could say F*ck for all i care, that doesnt change faith in the least bit. I don't see any war references at all. And besides that, Chevelle is a musical group. Sure they may kick major ass, but they are a musical group and that is all. You shouldnt let their political views form the basis of yours because they lead a completely different lifestyle. GWB is an honorable man, and Maynard keenan can go to hell for all i care, because Manson and him are both perfect examples of why politics should not mix with music.\t\t\t\t\n\t\t\t\t\n\n"}