{"comment_0": "\nThe chorus is wrong\n\r\nWhen you see yourself in a crowded room, \r\ndo your finger itch? are you pistol whipped?\r\nAnd will you step in line or release the glitch?\r\nAnd can you sleep with a panic switch?\n\r\nActually most of the song is wrong...\n\r\nTime\r\nIt's never worth my time\r\nBlue shine\r\nBleeds into my eyes\n\r\nI still\r\nSleep on the right side\r\nOf the white noise\r\nCan't leave the scene behind\n\r\nCould I be anything you want me to be\r\nIt's always meant to be seen\n\r\n[Chorus]\r\nWhen you see yourself in a crowded room\r\nDo your fingers itch, are you pistol-whipped?\r\nAnd will you step in line or release the glitch?\r\nAnd can you fall asleep with a panic switch?\n\r\nAnd when you see yourself in a crowded room\r\nDo your fingers itch, are you pistol-whipped?\r\nWill you step in line or release the glitch?\r\nDo you think she'll sleep with the panic...\n\r\nMm, I'll try\r\nTo hold on tight tonight\r\nPink slip\r\nInviting me inside\r\nWanna burn skin\r\nAnd brand what once was mine\r\nBut the red views\r\nKeep ripping the divide\n\r\nIf I go everywhere you want me to go\r\nHow will I know you'll still follow?\n\r\n[Chorus]\n\r\nI'm waiting and fading and floating away\r\nI'm waiting and fading and floating away\r\nI'm waiting and fading and floating away\r\nWaiting and fading and floating\n\r\nI'm waiting and fading and floating away\r\nWaiting and fading and floating away\r\nWaiting and fading and floating away\r\nWaiting and fading, waiting and fading\n\r\n[Chorus]\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI can't believe nobody's gotten it yet. And, hello guys, a song can have multiple meanins at once. So yes, it's about the music industry, I see that. It's ALSO definitely about an anxiety attack. But put the pieces together, and you get a song that's about a guy's anxiety towards being an individual. This song is about how everyone's becoming the same, not just the music industry, but society in general. The \"speaker\" in this song is panicking because he feels like he needs to conform, but really doesn't want to. He values his individuality and is freaking out about how to keep it.\n\r\nAND THE CHORUS IS WRONG.AH.\r\n\"Do you see yourself in a crowded room?         \r\nDo your fingers itch? Are you pistol-whipped?   \r\nDo you step in line, or release the glitch?     \r\nCan you fall asleep with a panic switch?\"\n\r\nThe meaning:\n\r\namong all of the clones, do you stand out?\r\nare you like me, dying to be allowed to be yourself?\r\nso are you going to be a clone, or release the glitch and be yourself?\r\ncan you fall asleep knowing this? (referring to his extreme anxiety)\n\n\n", "comment_2": "\nHere is my explanation i think i may have hit bulls eye with this one - let me know what you guys think\n\r\nsong is about someone that got cheated on\n\r\nTime.\r\nIt's never worth my time.\r\nMoonshine\r\nBleeds into my eyes.\n\r\n-thinking about her is never worth my time, moonshine - maybe the name of the gf\r\nbleeds into my eyes - wants to cry\n\r\nI still\r\nSleep on the right side\r\nOf the white noise;\r\nCan't leave the scene behind.\n\r\n-i still sleep on the right side of the bed we used to sleep on together\r\n-white noise = white bed\r\n-cant forget what happened\n\n\r\nDo you see yourself in a crowded room?\r\nDo you think I'll snitch? Are you pistol-whipped?\r\nDo you step in line, or release the glitch?\r\nCan you fall asleep when I panic, switch?\n\r\n-do u see youself (ex-gf) surrounded by your guilt (crowd)\r\n-do you think i'll tell anyone what u did to me\r\n-are you pistal (dick) whipped\r\n-can you fall asleep when i panic - panic as in the emotion in you waking up in a nightmare that your gf is cheating on you\n\r\nWhen you see yourself in a crowded room,\r\nDo you think I'll snitch? Are you pistol whipped?\r\nWill you step in line or release this glitch?\r\nDo you think she'll sleep with the panic?\n\r\n-when your about to fuck\r\n-do you think i'll tell anyone what u did to me\r\n-are you pistal (dick) whipped\r\n=will you stop yourself, will say fuck it and open your legs\r\n-ow you think she'll sleep with that feeling of guild\n\r\nAnd I'll try to hold on tight tonight.\r\nPink slip, inviting me inside.\r\nI want to burn skin and brand what once was mine,\r\nBut the red news came ripping in to fight.\n\r\n-i'll try to wait another day for you\r\n-that pussy (pink slip) is what im lusting for\r\n-i want to brand ur ass, because you were once mine\r\n-but i know what you did, and im angry and wont lose to your lust\n\r\nIf I go anywhere that you want me to go,\r\nHow do I know you'll still follow?\n\r\n-if i forgive you, how do i know you wont cheat again\n\r\nI'm waiting and fading and floating away\r\nI'm waiting and fading and floating away\r\nI'm waiting and fading and floating away\r\nI'm waiting and fading and floating.\n\r\n-im waiting for something, but as i waiting my feelings for you are floating away\n\r\nI'm waiting and fading and floating away\r\nWaiting and fading and floating away\r\nWaiting and fading and floating away\n\r\n-im waiting for something, but as i waiting my feelings for you are floating away\r\nWaiting and fading and flailing and fading\n\n\n", "comment_3": "\nThis song is 100% about anxiety. As someone with anxiety myself, I can sooo relate. Very very powerful song. \"Can you fall asleep with a panic switch?\" Brilliant and sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think this song is about being led on sexually by an ex with whom you're still in love. It's like the ex just came back for sex, but you're hoping that they actually want you again. With the anxiety of that situation, you're unable to connect to other people and you wonder if everybody around you can tell that you're losing it. \n\n\r\n\"Time is never worth my time \r\nBlue shine bleeds into my eyes\"\r\nI feel like this part means that it has happened before, and that it's acknowledged that it hasn't worked out well before.\n\r\n\"I still sleep on the right side \r\nBut white noise can't leave the scene behind\"\r\nYou still sleep in the bed where you both used to sleep, and there's a \"white noise\" presence of emptiness left in the ex's place.\n\r\n\"Could I be anything you want me to be \r\nIf so is it meant to be seen?\"\r\nQuestioning whether or not you're willing to do anything the ex wants in order to get them to come back emotionally.\n\r\n\"I'll try to hold on tight tonight \r\nPink slip inviting me inside\" \r\nTrying to savor the emotionless moments with the ex because you're realizing it's purely sexual.\n\r\n\"Want to burn skin and brand what once was mine \r\nBut the red views keep ripping the divide\"\r\nWanting to make 100% certain that the ex will stick around.\n\r\n\"If I go everywhere you want me to go \r\nHow will I know you'll still follow\"\r\nQuestioning yourself about whether or not it's worth your time to play along with the ex.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think its about someone fighting with themself. his alter ego is taking over and he is holding on but its overwhelming. he is dying..\n\r\ntime is never worth my time \r\nblue shine bleeds into my eyes\r\ni still sleep on the right side\r\nbut white noise can't leave the scene behind\n\r\n- everything is a blur, sleeping the day away, waking up and the sky blinds you and you are so consumed with all the chaos (white noise sound frequencies) \n\r\ncould i be anything you want me to be\r\nif so is it meant to be seen\n\r\n-shows how reliant he has become on the voice inside him/cant trust his instinct, doesnt know if its worth it anymore\n\r\nwhen you see yourself in a crowded room\r\ndo your fingers itch are you pistol whipped\r\nwill you step in line or release the glitch\r\ncan you fall asleep with a panic switch\n\r\n-he is talking to the voice/alter ego inside himself, because he is essentially just a body because he is so controlled by his alter ego, when he's surrounded by people, his fingers itch/hes so anxious, its painful because he's beginning to get that he is dying (pistol whipped), he is so weak he can fall asleep even with all that he is dealing with, hes becoming numb, he is asking his alter ego, but in a way as if to say you dont have to go through all this.\n\n\r\ni'll try to hold on tight tonight\r\npink slip inviting me inside\n\r\n-he could die anytime, he feels the termination coming on\n\r\nwant to burn skin and brand what once was mine\r\nbut the red views keep ripping the divide\n\r\n-i want to go back to myself, i want my body back, i want to live without this obsession with listening to the voices inside your head (relates back to white noise theory), but the red views (voices/alter ego overpowers you)\n\r\nif i go everywhere you want me to go\r\nhow will i know you'll still follow\n\r\n-he doesnt know if he can trust or listen to himself anymore, he doesnt know if his good intuition will follow him much longer\n\n\r\nwill you step in line or release the glitch\r\ndo you think she'll sleep with a panic...\n\n\r\n-speaking to himself again, will you let go of me when you finally see that ive had enough???\n\n\r\ni'm waiting and fading and floating...\r\ni'm waiting and fading and floating away\r\ni'm waiting and fading and floating away\r\ni'm waiting and fading and floating away\n\r\n-he thinks and does the same thing everday, just like time is not a factor, he is waiting for something, but really its just nothing, he cannot think for himself anymore.. he is dying...\n\r\n(just a thought, of course every song means something different to each person)\n\n\n\n", "comment_6": "\nI think this song is more about having trusted somebody for a long time, and suddenly they hurt you, and you don't know what to do.\n\r\n\"Panic Switch\" seems to symbolize quickly \"flipping a switch\" in your everyday life, and not being used to it.\n\r\n\"If I go anywhere you want me to go, how will I know you'll still follow?\"\r\n\"I'm waiting and fading and floating away.\"\r\n\"Could I be anything you want me to be?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe song provides a glimpse into the fragile emotional state of someone soon after their world has been flipped upside down by a major betrayal or other traumatic events. It about dealing with the unknowns, uncertainty, and doubt that follow when things you thought you knew reveal themselves to not be true. \n\nThe individual knows that to heal they need to put aside time to work through what has happened, but doing so may require them to revisit painful events and discover other things they don't want to know. So instead, the individual tries to go on living their life and stay busy with work and other activities. But the fear & hurt from the unresolved issues are always right below the surface, leaving them in a perpetual state of anxiety and panic.\n\nThe individual may have been in a very intense, but probably unhealthy, relationship with someone whome they cared for alot. Over time the relationship likely experienced increasing amounts of betrayal of trust such as infidelity and perhaps abuse. While the individual was the recipient of these betrayals early on, he was submissive and may have made excuses which justified the the actions of his partner. But as the relationship escalated his emotions eventually got the best of him and he himself ended fighting back and contributing to the toxicty of the relationship in ways he never thought were possible.\n\nNow that the relationship is over, he can't ignore the fact that the relationship has changed him. His ideas of what is \"normal\" and what is \"right or wrong\" have shifted, but not in the way he'd like. He wonders if he can still be the person he always wanted to be? Or is he now as damaged as his previous partner? Will he be able to control this newly discovered side of himself which seems to be triggered so easily now, or is he destined to repeat the cycle of toxity in his future relationships. Is he putting anyone close to him at risk?\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nBrian himself said it was about a mental/nervous break down (say maybe a panic attack?) and the lyrics all seem to point to different events and situations where they could be happening. The opening verses seem almost to be a stab at the music biz, but the choruses and prechoruses seem more like a couple trying to keep each other calm through the chaos that's around them. IDK, I love Brian's lyrics, but can't always decipher them. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nyeah, this is and There's No Secrets This Year are definetaly my favorite from Swoon.  I just submitted the lyrics for There's No Secrets This Year :D\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nDam I love this song! Can't wait for Swoon!!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think it's \"can you fall asleep with a panic switch?\"\n\r\nAmazing song. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ni cant believe i'm 5th comment. i heard this song on KROQ and its my new fav song. bought the album, this band is amazing. but more importantly this song is absolutely epic.. \n\r\ni think these are the 2 most powerful lines in the song\n\r\nIf I go anywhere that you want me to go,\r\nHow do I know you'll still follow?\n\r\npretty sure this song is about the music biz\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI want to burn skin and brand what once was mine,\r\nBut the red news came ripping in to fight.\n\r\nfirst line, pretty self explanatory\r\nred news=the news that informs that this is not likey\n\r\ncan't wait for the new album.\r\nC:\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\n\r\nI agree with chardsofglass that this song is a reference to the music biz and also with Seanek that the two most powerful lines are \n\r\n\"If I go anywhere that you want me to go,\r\nHow do I know you'll still follow?\"\n\r\nbecause it seems like they are also referring to their fans and hoping that they can understand this new sonic direction that Swoon is taking. \n\r\nIT'S GREAT! SHOEGAZE AT IT'S BEST!!! THE GUITAR SOLO AT THE END IS SOOOOOO TRIPPY! (excuse the capslock, enthusiasm for this album...)\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI agree with the theory that it's about the music industry.\r\nAlso, I've listened to this song a million times already&the \"I'm waiting and fading and floating away\" part still gives me chills. Perfect.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis song is DEFINATELY about the music industry.  The opening lines prior to the first chorus are talking about them thinking about having to sell out in the music biz but wanting to still stay true to themselves as artist.  They may have been drinking while debating about this amongst themselves or within their own head.\n\r\nThe chorus' \"crowded room\" refers to all the mainstream music and bands that have made it and sold out and now have lost their original sounds and sound all the same.\n\r\nThe \"finger itch\" is them wanting to stay true to themselves but feeling pressured to change.  The \"pistol whipped\" refers to the music industry or record label demanding something different.  The \"step in line\" refers to changing their sound and selling out and the \"or release the glitch\" refers to staying true to themselves and releasing one of their songs done their way the the mainstream record label may term a glitch.\n\r\nI am getting a lil too long-winded now with this but if you think along the lines of what I just wrote, the song will completely make sense....them vs. record industry.  Have Fun!\n\n\n\n", "comment_17": "\nI love this even more now that I know the lyrics\r\nEspecially the chorus\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nMan, I really don't understand why this is about the music biz.  Please explain other than saying \"it definitely is\".  The very first comment said that Brian said it's about a breakdown, and that fits perfectly.  Case closed.  Oh, and it's a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI LOVE the drummer in the music video. He seems so into it, you know? It's amazing, he's the only person I watch when I see the music video.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nme encanta\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThose lyrics are all wrong, here are the ones from the band website:\n\r\ntime is never worth my time\r\nblue shine bleeds into my eyes\r\ni still sleep on the right side\r\nbut white noise can't leave the scene behind\r\ncould i be anything you want me to be\r\nif so is it meant to be seen\r\nwhen you see yourself in a crowded room\r\ndo your fingers itch are you pistol whipped\r\nwill you step in line or release the glitch\r\ncan you fall asleep with a panic switch\r\nwhen you see yourself in a crowded room\r\ndo your fingers itch are you pistol whipped\r\nwill you step in line or release the glitch\r\ndo you think she'll sleep with a panic...\r\ni'll try to hold on tight tonight\r\npink slip inviting me inside\r\nwant to burn skin and brand what once was mine\r\nbut the red views keep ripping the divide\r\nif i go everywhere you want me to go\r\nhow will i know you'll still follow\r\nwhen you see yourself in a crowded room\r\ndo your fingers itch are you pistol whipped\r\nwill you step in line or release the glitch\r\ncan you fall asleep with a panic switch\r\nwhen you see yourself in a crowded room\r\ndo your fingers itch are you pistol whipped\r\nwill you step in line or release the glitch\r\ndo you think she'll sleep with a panic...\r\nmovements are made slow motion in frame\r\ni'm waiting and fading and floating away\r\nthe curtains are torn and the setting decayed\r\ni'm waiting and fading and floating...\r\ni'm waiting and fading and floating away\r\ni'm waiting and fading and floating away\r\ni'm waiting and fading and floating away\r\nwaiting and fading\r\nwaiting and fading\r\nwhen you see yourself in a crowded room\r\ndo your fingers itch are you pistol whipped\r\nwill you step in line or release the glitch\r\ncan you fall asleep with a panic switch\r\nwhen you see yourself in a crowded room\r\ndo your fingers itch are you pistol whipped\r\nwill you step in line or release the glitch\r\ndo you think she'll sleep with a panic...\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI can see this being a couple things...\n\r\nFirst, I definitely understand the music industry thing. \"Can't leave the scene behind\" is an obvious example. The \"If I go anywhere you want me to go...\" line speaks to the impermanence of the industry, as well.\n\r\nBut I think the anxiety thing makes more sense. But I'd take it a step further to say it might be about stage fright, and here's why:\n\r\n\"Moonshine bleeds in to my eyes\" - He has to drink to calm himself down before a show\r\nThe entire chorus... \"Do your fingers itch/Are you pistol-whipped?\" could mean that he's overwhelmingly nervous and he feels like he's literally being pistol-whipped, or smacked in the face.\n\r\nJust some thoughts. What do you all think?\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nDoes anyone think the part where it says \r\n\"Pink Slip\" should be \"Big Slip\"?\n\r\nAnd I'll try to hold on tight tonight.\r\n\"BIG SLIP\", inviting me inside.\r\nI want to burn skin and brand what once was mine,\r\nBut the red news came ripping in to fight.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nHmm..I'm torn right now. Is it showbiz or an anxiety-attack.\n\r\nBoth interpretations are beautiful\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nGod, I love this song. The chorus is so freaking catchy I sing it all the time to myself. Luv it!\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis song makes me think of the Matrix.  Obviously, it's not about that.  I agree with everyone else's interpretations.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis song has too many random verses\r\nfollowing each other for me to decide \r\non what I think it means.  However, I\r\nlove the song, the chorus is catchy. And I \r\nagree the drummer is so lost in the song. \r\n(In a good way) He was jammin' OUT when they \r\nplayed on \"It's On with Alexa Chung.\" \t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI THOUGHT THIS WAS A CHICK SINGING!!! I JUST SAW A STUDIO SESSION AND ITS A GUY HAHAHHA. i really had no idea i was like this female singer is awesome. but, alas, its a male\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nWhat is his panic switch? Is it suicide? Drugs? Is it quitting the music industry?\n\r\nI can't reconcile \"brand what once was mine\" with any interpretation of a breakdown but short of that, it almost has to be about a series of anxiety attacks or a mental breakdown.\n\r\nMaybe he means brand his own body because he's lost control? Maybe he means he's lost someone he loves because of his sickness.\n\r\nKiller fucking song.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nthe bass line and harmony is what makes this song killer...\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI wish people would update their songs lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThis song is great, I love it. I love honesty, its what I stand for.\n\r\nExtreme Anxiety and especially Panic Disorder are truly excruciating. He doesn't talk about panic but when extreme fear plays with your senses like a continuing nightmare because of uncontrollable anxiety, it becomes emotionally disintegrating.  That because of a 'love' is what I believe he is talking about.\n\n\r\nTime\r\nIt's never worth my time -True Depression, if you experience it you'll understand. \r\nBlue shine\r\nBleeds into my eyes      -About a love, eyes are the most compelling feature.\n\r\nI still\r\nSleep on the right side  -Losing her, being on left left side only reminds you she gone.\r\nOf the white noise\r\nCan't leave the scene behind -(White Noise = Anxiety) The memories of her are too penetrating to relieve.\n\r\nCould I be anything you want me to be\r\nIts always meant to be seen         -She doesn't like who he is. He want's her to. That's a problem     -since you can't be who you aren't.\n\r\nWhen you see yourself in a crowded room        -Again you can only understand if you've experienced \r\nDo your fingers itch, are you pistol-whipped?  extreme anxiety or panic disorder.\r\nAnd will you step in line or release the glitch?  -Will you try  conform to \"normal social behavior\" or -act yourself (in this state of panic).\r\nAnd can you fall asleep with a panic switch?     -Ambiguous. 1. Do you have the ability to turn off  -your panic at night(when it usually happens overwhelmingly)2. Or do you need something more then will -power.\n\r\nMm, I'll try\r\nTo hold on tight tonight       -Night, trying to sleep, when panic/anxiety gets its toughest.\r\nPink slip                      -The \"title\" to you, as if you didn't own your own feelings.\r\nInviting me inside             \r\nWanna burn skin                \r\nAnd brand what once was mine   -Again wishing he had enough self-control to feel free. His emotions.\r\nBut the red views\r\nKeep ripping the divide        - The constant 'nightmares' keep him down after all he tries.\n\r\nIf I go everywhere you want me to go\r\nHow will I know you'll still follow?  -For what ever reason, she doesn't want him around, but wont tell -him that.\n\r\nI'm waiting and fading and floating away -He dosent know what to do and is withering away in time from -emotional suffering.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nIts about a mental breakdown and the social anxiety that comes with the feeling of panic.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nyeh, i agree, with the person who said explain why its about the music industry.\r\ni don't think that it's about that. I mean, you can't just focus on a couple of lines, you gotta see it as a whole. No ones mentioned the line: pink slip(?) inviting me inside & do you think she'll sleep with a panic switch. It's gotta be about a relationship, say, with a cheater?\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nYep, I agree with KTTheLibra...\n\r\nThe song is most definitely about anxiety, and expressed so well! \n\r\n\"Moonshine (or blue shine) bleeds into my eyes\" I think this is actually literal! When you have anxiety and panic attacks, trying to fall asleep at night can be difficult and anxiety inducing itself, so you end up lying awake and you could literally be staring at the moon all night.... moon or blue shine fits for this since the moon can give off a blue glow.\n\r\nIn the next lines about the white noise and being what someone wants him to be, he's worrying about something, maybe conforming, and it's keeping him awake. \n\r\nThe whole part leading up to \"Can you fall asleep with a panic switch\" sort of describes a person's physical reaction to anxiety... itchy fingers, feeling beaten down, etc. \n\r\nI think the next part about the pink slip is either an extremely elaborate metaphor about trying to let the anxiety take hold (like a pink slip to let it in) while attempting to overpower it (burn skin and brand what was once mine -- maybe get myself back to where I once was, claim myself again), OR it's just another anxiety inducing dilemma and he's thinking about a girl that he tried to be with and it ended up not working out. I like to think it's about an inner struggle to get back his sanity, but you never know! He does say \"she\"...\n\r\nThe end \"waiting and fading and floating away\" sort of lends itself to either scenario. Either he or she has failed to overcome the anxiety and are just letting it rule them, OR he's giving up on the relationship that brought him to this point and that's why at the end he says do you think \"she'll\" sleep with a panic. . . \n\r\nWell, that's my analysis!! It was fun :) \n\n\n", "comment_36": "\nI think the music industry argument makes sense, but is being forced into this song.  To me, this is basic.  It's about trying to fall asleep when you can't because you have anxiety disorder (a part of which includes panic attacks).  Laying in bed, mind racing, \"waiting\" to \"fade\" and \"float away\" into sleep.  \n\r\nPeople who go through this know there is no use in checking the \"time\" because it only makes it harder to go sleep, which could even frustrate you to the point of your eyes welling up in a \"blue shine.\"\n\r\nMaybe the symptoms are worse after a night playing a show in a crowded room.  Maybe you can't stop thinking about the show. Maybe your fingers are itching...maybe to pluck the bass.\n\r\nI bet he wrote this for his bassist, who has anxiety and difficulty sleeping after shows.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\ntotally agree.  this is about trying to fall asleep.  however, i think its not him, but a female he knows or is close to...maybe the bassist.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nYou know this is a brilliant song when it inspires such discussion as to what the meaning of the song is. And when it has a wonderful melody. One of the best songs of 2010.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nTo me this song seems like it's about a soldier that has returned from combat and is suffering Post Traumatic Stress Syndrome. The soldier is paranoid about getting attacked because of his past experiences in war and feels the need to stay alert at all times. Anxiety is attacking him and he has to \"fall asleep with a panic switch\" and \"feel pistol whipped in a crowded room\" because of what hes been through. Oh well. At least thats what i think of it\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI don't know what version of the song this is, but in the one I'm listening to, he never once says \r\n\"movements are made slow motion in frame \r\ni'm waiting and fading and floating away \r\nthe curtains are torn and the setting decayed \r\ni'm waiting and fading and floating...\"\r\nHe only says \"waiting and fading and floating away\" four times.\r\nSo what the heck???\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nLike the band, although I have yet to hear every track. This one makes me think of an anxiety attack. Some people are uncomfortable in crowds, especially around strangers. And others are downright frightened to death. Cannot relate on a personal level, but I've had friends who don't do well out of their comfort zones (which includes only those they know well). Good song...creative.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI'm not sure the full meaning of the song yet, but it definitely is a criticism of politicians. The song was recently accidentally played during a Mitt Romney speech and Brian (the frontman) said that \"the irony was too good. While he is inadvertently playing a song that describes his whole campaign, we doubt that â\u0080\u0098Panic Switchâ\u0080\u0099 really sends the message he intends.â\u0080\u009d\n\nThe song makes reference to political motifs, like \"blue shine\" \"red views\" and \"sleep on the right side\". I also think \"panic switch\" references the nuclear codes. \n\nCan anyone else extrapolate further on these ideas?\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nAlthough he says \"you\" a few times I don't feel like the song is directed at anyone in particular, more maybe society in general.\nTo me this song is about feeling invisible and the anxiety that comes with that feeling. In the chorus I picture the singer, or me, standing in a room, going unnoticed. You get that itch that you just want to scream, remind everyone you're there. I'm not sure if the line is \"do you think she'll sleep with a panic switch?\" but if it is, the \"she\" may refer to the anxiety in the same way a boat or car might be referred to as a \"she\". In this case it's like the anxiety is a different person, maybe because they have to hide it from the world.\nI love the build up to the second \"i'm waiting and fading...\" It feels like this is the breaking point and he just wants to disappear and forget.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI'm glad everyone here is as confused as I am. I came here afraid that if I learned the true meaning, it might ruin the song for me. Now I'll just have to be satisfied with the vague images of mounting panic that play in my head while I listen.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nI agree with the anxiety, matrix connection, and he does include a female relationship in there. I think the music business industry connection is overrated, but I'm sure the band 'making it' into the big time and all the stress to perform that goes with, is mentioned  in the song a little. (use of the word 'scene' for example) This is why it's fitting that it's the song in Sucker Punch trailer, it's about mental desperation. \n\r\nHere is my explanation, which is tied to it's use in the Sucker Punch trailer.\nyoutube.com/…\n\r\nps\r\n'wanna burn skin and brand what once was mine\"\r\nMeans that he is losing connection to a woman, which he identifies primarily through her body, in sex. (pink slip = vagina) And he wants to 'brand' as in burn his seal of ownership on her skin so she can't escape him, like cattle.\n\r\nAnd the first verse means the following. Kevin hit the nail on head with a few of the lines.\r\nTime \r\nIt's never worth my time \r\nBlue shine \r\nBleeds into my eyes \n\r\nI still \r\nSleep on the right side \r\nOf the white noise \r\nCan't leave the scene behind \n\r\nCould I be anything you want me to be \r\nIts always meant to be seen\r\n----------------------------\n\r\nWe have 'When the levee breaks' a classic hardcore song, Led Zepelin probably gave Snyder and this film their stamp of approval because they hardly ever allow anyone to use their songs, especially for trailers. \n\r\nThis plays during Baby Doll enters the asylum. Her levee's gonna break, lol. \nyoutube.com/… \r\nRead the lyrics they're great. \n\r\nThen later Baby Doll in the trailer enters her fantasy worlds, and Silversun Pickups - Panic Switch begins to play. youtube.com/… \n\r\n\"when you see yourself in a crowded room \r\ndo your fingers itch are you pistol whipped \r\nwill you step in line or release the glitch \r\ncan you fall asleep with a panic switch\" \n\r\nThe song is about a man being assailed (pistol whipped \"fingers itch\" = anger, your fist clenching into a fist or pulling a trigger) by the world/society/others and whether he has the strength to become numb and indifferent to the world and enter ones internal fantasy world, but still possess the faith that he will still be able to wakeup, when it's time.That's what \r\n\"can you fall asleep with a panic switch\" means.\n\r\n\"do you think she'll sleep with a panic...\" \n\r\nHe is also concerned whether his lover will be doing that also. If she also becomes introverted and indiferent to protect herself, he stands the possibility of losing her. Since they would both be asleep and as such would find it more difficult to wake each other up if they are in trouble.\n\r\n\"I'll try to hold on tight tonight \r\npink slip inviting me inside \r\nwant to burn skin and brand what once was mine \r\nbut the red views keep ripping the divide \r\nif i go everywhere you want me to go \r\nhow will i know you'll still follow?\" \n\r\nActivating the 'glitch' (apt name for Baby Doll's mental illness) or trading the social/external world for the inner/fantasy world is fraught with peril. And even though his female lover holds him to the social/external world, she eggs him on to go further inside fantasy, because that's where she is now. And he fears he will lose her, as he has lost the connection through her body. \n\r\nThis presumes 'it's pink slip' and not 'big slip', which would mean the verse is referring to the record industry.\n\r\n\"movements are made slow motion in frame \r\ni'm waiting and fading and floating away \r\nthe curtains are torn and the setting decayed \r\ni'm waiting and fading and floating... \n\r\ni'm waiting and fading and floating away \r\ni'm waiting and fading and floating away \r\ni'm waiting and fading and floating away \r\nwaiting and fading \r\nwaiting and fading\" \n\r\nAnd then we have the ending, which symbolizes not only physical life, but also inner passion and feeling. The songwriter using the well known metaphor of life as a stage only here it has decayed. This could also be read as referring to his life as a artist who produces music. Something epic happens \"movements are made slow motion in frame\", in Snyder slow motion no doubt, and now awakened his world and body has decayed, and he is done/finished. When he says \"I'm waiting and fading and floating away\" it means that he has become trapped in thought/life and is waiting for his death, the 'panic switch' didn't work, his faith that he would use the panic switch at the right time, was ill founded. And the consequence is a slow physical and symbolic death. \n\r\nThis adds a tragic, desperate, Armageddon/annihilative tone to the end of the trailer. \n\n\n\n", "comment_46": "\nLove this song, it's so well written.\n\r\nI've always had the impression this song was about social anxiety, which is something I struggle with constantly. I can identify with it and that makes it all the more powerful to me. The Chorus, in particular. \t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\n. While I will admit to being new to Silversun Pickups and thereby I don't know the context for this piece, i do have a few thoguhts.\r\nThis song feels like the parioid trapped feeling that social anxiety provokes. There is a wild sense of panic when you're surrounded by a croud and cannot find the exit especaly when you're trying to keep tabs on someone else and you lose them . The panic swich is the escape drug, whatever it is makes it hard to sleep. Alternatly, this drug feels wrong to him,  and buggs his conscience, making it hard to sleep..\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nIm agree about the social anxity disorder. I've suffered from it for years and every time i hear this song it reminds me of my struggles.\n\r\n\" when you see yourself in a crowded room\r\ndo your fingers itch are you pistol whipped\r\nwill you step in line or release the glitch\r\ncan you fall asleep with a panic switch\" \n\r\n\" do your fingers itch,are you pistol whipped\" itching,is often an anxious habit. I often freeze in large crowds,for at least a moment. When you have social anxity a lot of it comes from fear of being judged..at least for me. So will you step in line and act like the rest or release your glitch the one of anxity or whatever else you fear of being judged by.\n\r\nFor many you also have an overwhelming fear of abandonment.  \"If I go everywhere you want me to go\r\nHow will I know you'll still follow?\" \n\r\nFear of social judgement falls in with this line too \"Could I be anything you want me to be \r\nIf so is it meant to be seen\"\n\r\nI dont need any scrutinization on what i post here..This is just my idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI'm leaning towards the Anxiety Attack scenario and someone trying to control their own \"fight or flight\" instincts.  I've never experienced an AA but I have enjoyed the surge of adrenalin that kicks in when it's time to take action during an emergent situation, as a Firefighter and Police Officer.\n\r\nThe bass line is hypnotic in this song and the hook is memorable enough to require it to be played several times until you're sick of it for a while.\n\r\nAs for the term \"Panic Switch\". I though that meant the feeling one gets on a occasion when you are about to drift off to sleep, only to be shocked by a sudden twitch that feels like your whole body just shook, but it leaves you just as quickly.  When working a 24 hour shift at the fire station and trying to get some rest, it was common to have to bolt straight awake and jump into action. From Zero to Chaos in a split second. \n\r\nWhat a rush!  (just like this song)\t\t\t\t\n\t\t\t\t\n\n"}