{"comment_0": "\nIt's \"Losing all my friends\" not breath\n\r\nAnd it goes \"Black and white has never been so right/Black and white has never been so bright\"\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think the first line is:\r\n\"I fucking hate myself\r\nCause my...?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIf fucking hate myself /\r\nCause my words just cut this ... like ......\n\r\nOr something. haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nfirst impression was like woah. \r\nhis voice is really different on this recording \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song is definitely better than some of the songs on Manipulator. It shows the group's progression into the sound that they have been working towards. I think that The Fall of Troy have finally mixed their songwriting skills with their skillful musicianship. This album should be the fusion of Doppelganger and Manipulator. I am stoked. \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nits definitely losing all my breath.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ntake that back it seems that every time the chorus is repeated it switches from breath to friends and back\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI hear the first line saying;\n\r\nI fucking hate myself\r\nCause my words just contrdict this,\r\nWhy do they?\n\r\nBut Im really not sure. I guess we'll just have to wait ti'll the album comes out to really know lol.\n\n\n\n", "comment_8": "\nthe first time it says \"as if to annoy you on purpose just cause i can\" and the second time it says ignore. It definitely says breath everytime and never says friends\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI hear:\n\r\nAccept you\r\nIgnore you\r\nOn purpose just cause I can\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nand maybe:\r\nHere we go again\r\nLosing all my grips\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nHere are the lyrics directly from TFOT themselves.\n\r\nI fucking hate myself,\r\nCause my words just curse, and sentence life, to death.\n\r\nHere we go again, I'm losing all my friends...\r\nDistorting the truth, to lie to you again.\r\nDisconnect from then to side with you again...\n\r\nStuck in this hole, where no one will ever go...\r\nHave to find somewhere else, with someone else's whiter fences.\n\r\nAs if to, annoy you, on purpose just cause I can...\n\r\nIf I go down, im taking the world WITH ME!!!!!!\n\r\nAs if to, ignore you, on purpose, just cause I can!\n\r\nOh, the silence guts me... It eats me alive...\r\nLooking for a ladder, to climb to her level!\n\r\nBlack and white have never been so bright. \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThehobo94 is an idiot for falsely stating shit as facts. It's definitely \"I'm losing all my friends!\" Not \"breathe.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nits about facebook (not really tho)\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\n\"This is about when you're surrounded by a lot of people and you have to take a step back and weed out a lot of them to figure out who your real friends are. The song was named 'Panic Attack' because I actually had a panic attack when we were recording the drums for it. I had to chill out for 20 minutes to recover, and then I realized, 'Well, I guess we've got the name of our song.'\"\n\n\n", "comment_15": "\nOkay I'm just speculating and this could be a misinterpretation, but I hear \"Black and white have never been so right / Black and white has never been so bright\" the first time. The second time I hear him say \"has\" both times. \r\nI'm not sure why he uses \"have\" the first line, then \"has\" the second. Maybe he's referring to \"black and white\" the first part of the stanza as two things: bad and good. While the on the next lyric, \"black and white\" is a synonym for a single thing e.g. grayscale. But this raises questions. I can understand how a grayscale could be brighter than before, but why would good and bad ever be \"right\"? And why would he change the phrasing at the end of the song?\r\nThom is an intelligent guy. I'm pretty sure as a songwriter he wrote it like this on purpose. Or perhaps he didn't. Who knows? Maybe he intentionally used incorrect grammar to see if any obsessive-compulsive scrutinizers, like myself, would waste time trying to figure it out. lol\n\n\n", "comment_16": "\nAlso, don't know if there are any tone chasers out there, but the intro is amazing. It's like a cross between Tom Morello and Mike Einziger on coke. Thom's tone has always been unique and awesome, but this is nothing short of flawless.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nWith a bit of Zakk Wylde in the mix\t\t\t\t\n\t\t\t\t\n\n"}