{"comment_0": "\nThe song was written in response to Steve Wright (Radio 1 DJ) playing Wham I'm your Man after the lunchtime \"Newsbeat\" which went out at 1230-1250 on Radio One.  I recollect it was a Monday around April 1986.  Apparently both Marr and Morrissey were appalled to hear Steve Wright report the Chernobyl disaster on the radio and then follow it by playing the Wham song and in an interview with NME in 1987, Marr says:\n\r\n\"'Panic' came about at the time of Chernobyl. Morrissey and myself were listening to a Newsbeat radio report about it. The story about this shocking disaster comes to an end and then, immediately, we're off into Wham!'s 'I'm Your Man'. I remember actually saying 'what the fuck has this got to do with peoples' lives?' We hear about Chernobyl, then, seconds later, we're expected to be jumping around to 'I'm Your Man'.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAfter listening to the news of the Chernobyl disaster on Radio 1, Wham's 'I'm Your Man' was played immediatly after. Morrissey wrote this song, criticisng the 'pop' music that was around at this time as he was disgusted in what he heard. I felt for a while that 'The music that they constantly play, it says nothing to me about my life', but you learn to let that go. I hardly listen to the radio and very few new artists interest me at the moment. The Smiths are a band that fascinate me and I don't think I will ever stop listening to their music. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIm guessing the kids singing in the background is another reference to chernobyll? Anyway, this is what I love about the Smiths. Most people think the songs are just depressing but can't see the underlying humour and wit. \n\r\nChinup hit the nail bang on the head. The song is about, as well as chernobyll, music with no soul. Music that says nothing to you about your life. Miss chainsaws thing about dance music not using real instruments is a bit of a stupid thing to say seeing as a hell of a lot of people who make dance music are clasically trained artists. Download a song like Max Graham-gone or massive attack-unfinished sympathy and tell me they say nothing to you about your life. Obviously there is poppy dance too, but dance music speaks to me. Even if its not got lyrics it can conjour up memories, evoke emotions. Its about the passion. After all a room full of hundreds of people worshipping the music and sharing a feeling, or a kid at home spending all his money on records to play on his decks working towards playing his music to other people wouldnt be possible without the passion or if the music was made purely to sell records.  \n\r\nThese days the music this song Id consider applies to would be Pop trash and same old 50cent moaning about smashing peoples legs and bitches RNB and hip hop. But then not all hip hop is like that. Grandmaster Flash and the furious five, public enemy, even NWA all had something to say that was important. I guess what Im saying is that you can't just condemn a genre of music as being not \"real music.\" The thing that defines it is if the music can speak to people about something, be it political, emotional, whatever. Music that doesnt misses the point.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nnot positive but the dj in question was steve wright i think, it wasnt tony blackburn\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt's about Steve Wright's coverage of the Chernobyl disaster, right? Or at least that sparked it off. Still, it could have applied to so many of the Radio 1 DJs. Tony Blackburn, Dave Lee Travis, so many of them. Of coursem there were the good/great ones (John Peel, of course), but then there were the ones who were basically just Smashie and Nicie personified.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n\"but you run down to the safety of the town\"\r\n...is referencing the element of music \"that says nothing about my life\"...\r\nit's not so much just talking about safe music for the masses but about the issues, the \"music\" that people are controlled by because it keeps them from paying mind to the important issues in their lives instead of the fluffy 'pop' issues.  So really, get off the song's impetus about Chernobyl and Wham and bad DJs... it's about the people that want to feel the safety and ease that comes with eating the free handouts...and doing something about those that do this as a means of obfuscation/control/etc.  \"Hang\" the man behind the Wizard's curtain; take back control, do what you will and think and wish to do.  Stop being led by other's agendas.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nAbsolutely brilliant song.\r\nThough, it's always made me laugh, because of the children singing along to the line \"Hang the D.J\"\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nUsed to hate it, now I love it. Simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI always saw this song as political. Typical of Morrissey as he was incredibly critical of Thatcher's Britain. The disco is West Minister. The DJ is Margaret Thatcher. Because the music they constantly play (Choices made by the conservative government of the 80's) means nothing to be about my life (Positively affects only the affluent of the country and is either damaging or irrelevant to the working classes.)\n\r\nI know this isn't what the song is about or why it was written but its one interpretation. =]\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nA song that defines the time it was released, but if you're thinking of downloading it, with typical internet ignorance, you'd probably be better off searching for a non-existant song called 'Hang The DJ'. Tss.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nwow, i cant believe it would be called that. The name \"Panic\" is on the best parts. This song holds a lot of memories for me and always brings back a feeling.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song was Morrissey's answer to 80's new wave dance music.  The press construed this as being anti-black music and therefore was accused of being a racist.  I quite disagree and totally relate to shallow love songs that \"say nothing to me about my life\".\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nwell i havent listen to the original yet but pete yorn did a pretty good cover of this song on his bonus cd for musicforthemorningafter.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nhey, i'd just like to point out that this song still relates so much to the british music scene. there is so much dance music and \"garage\", not to mention the mindless identikit pop bands aroung that real music with proper instruments and lyrics that mean something rarely breaks through. one of the only good songs in the top ten took a car advert to get it there. without that it would have no hope of radio play. the sentiments in this song, such as 'the music the constantly play, it says nothing to me about my life' are felt by many young people today...\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nLove this song, for some reason whenever I feel a bit down the line \"will life ever be sane again?\" comes to my head.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nWhen I first heard this song it was on MTV's Jackass while Chris Pontius was rollerskating around London with nothing but a jockstrap on.  This was a couple years ago.  I loved the song, but never heard it again until about a month ago on the radio.  So I looked it up, only to find that it's \"hang the DJ\" not \"I'm the dj\" like I had thought.  Then I read the lyrics, which make this song even better.\n\r\nEXCELLENT SONG A+++++++++ WOULD LISTEN AGAIN!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nITS CALLED PANIC NOT HANG THE DJ YA KNOW.\r\nYeh this song is great, im matthew/14/male. This song was easy to get and i knew it was about 80s music because OMG that was such a shameful era. The good bands: Talking heads\r\nThe smiths\r\nINXS\r\nRed hot chili peppers (wernt even recognised as much as today).\r\nMorrissey of course\n\r\nBAD BANDS:WHAM \r\nGeorge michael of course\r\nDuran duran\r\netc.\n\r\nThanks!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nMorrisey also once allegedley described disco as \"vile\"...\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nthis song reminds me of elvics costello's \"radio, radio\" for obvious reasons. i think it's basically about being discontent with pop music. and hey, i feel the same way. the mainstream has a bad habit of being catchy music, but not necessarily good. in response to butterfingersbeck, and other explanations of songs with specific events, it seems to me that a lot of the smiths lyrics are inspired by certain events but they apply to so many levels of life\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nMiss_Chainsaw,\r\nThere's nothing inherently wrong with dance/garage music. There's good dance music, and there's bad, just like any other genre.  I'm sure Mr. Morrissey was referring to expression, not the \"type\" of music. \n\nreal music with proper instruments and lyrics that mean something rarely breaks through\r\nFirst, what is your definition of \"real music\"?  I'd argue there's no such thing.\r\nProper instruments?  I'll assume you're referring to the electric guitar and normal \"band\" instruments.  I'd like to remind you that the electric guitar was invented in the 30's and didn't become widely popular until the 50's.  So maybe a true \"proper\" instrument should be the lyre or the oud, or how bout a harp.  My point is, again, it doesn't matter what instrument you play, but how you express yourself on it.  \n\r\nAnd stop worrying - there will be no magic morning where you will wake up to find the world has rid itself of bad music.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nwhat's wrong with duran duran!\r\ni wasnt old enough at the time, so i dont really understand this hatred against them.. i think they were fabulous, there early stuff especially.\r\nsorry, back to the smiths... i think morissey sums up the whole song in his lyrics:\r\nIT SAYS NOTHING TO ME ABOUT MY LIFE\r\nto me it's his discontentment with life firstly and then how music affects that.\r\nbut what do i know, i like duran duran...\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nPanic on the streets of london? Terrorist attack.\n\r\nPanic on the streets of Birmingham? Birmingham was evacuated on saturday.\n\r\nOdd coincidence, Leeds next\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nFuck! i was right, there wasa 'controlled explosion' in leeds today\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nFor fuck's sake, keep it quiet or they'll have Mozza down the copshop again!\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nNo doubt that this is yet another wonderfull addition to The Smiths song collection, and I cant really say anything else that hasnt been said..\r\nExcept for this.\n\r\nThis group, you guys might know of them; \r\nPANIC! AT THE DISCO\r\nTook their name from another group [forgot] homage to this song, which disgusts me becuase Panic! is perhaps the worst band I have ever heard in my entire life, and I'm appaled that I have such a close connection to them and the Smiths.\n\r\nThen again, I like Wham.\r\nAnd according to mdeaves they are bad music.\r\nHa\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI agree with This Charming Man. Please stop naming your horrid bands after The Smiths songs. \n\r\nI just freaking love this song. Even the little kids singing in the background is forgivable.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ngreat song, great song.\nbluecatstore.com/Merchant2/…\n\n\n", "comment_27": "\nPanic on the streets of Birmingham\n\r\nA reference to the Birmingham church bombing in 1963.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis song's rift is nearly identical  to T. Rex's \"Metal Guru\", still a good song however.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nwow i love this song and T. Rex, i havent noticed that actually.. i'll check that out in a sec, but playing it my head i can sort of see already how similar both riffs are.\r\ngreat song\r\nits where panic at the disco got their name from isn't it.  god i hate them.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\ntheres an event called Panic! in my home town that plays good music (the smiths even) as an alternative to the usual rnb crap or whatever, so I think this song was the inspiration for it\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI think Morrissey's line:\n\r\nBecause the music that they constantly play\r\nIT SAYS NOTHING TO ME ABOUT MY LIFE\n\r\nEspecially in a nutshell describes my entire outlook on music during my high school years.  About Morrissey being a racist. . that's fucking bullshit.  Overly liberal white people love to call other white people racists at any moment neccessary and just look for shit to call people out on.  Sometimes I think the ultra liberals are almost as bad as religious fundamentalists.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nhey umm Chinup im pretty sure what mr chainsaw meant about not having real instruments wasnt \"band instruments\" but the revolting music that is electronica... made with computers and some doss bag standing in front of two turntables apparently making music.... techno bothers me, i understand how it can say nothing about peoples lives with the pathetic lyrics that are used... yeh there is alot wrong with dance music... except gary numan lol hes rad\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nhey umm Chinup im pretty sure what mr chainsaw meant about not having real instruments wasnt \"band instruments\" but the revolting music that is electronica... made with computers and some doss bag standing in front of two turntables apparently making music.... techno bothers me, i understand how it can say nothing about peoples lives with the pathetic lyrics that are used... yeh there is alot wrong with dance music... except gary numan lol hes rad\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nhey i really didnt mean to post that twice ... i dunno how it happen but yeh.. im sorry for what i just said... i cant stand dance music, but i know some people love it... good for them.. glad they have found a wonderful genre that makes them happy, or sad, or have a range of emotions lol... yeh ill stick to my record collection :)\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThis is a lot like \"Metal Guru\" by T. Rex.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nIn my interpretation, this song is about \"AIDS\" panic/epidemic and a gay man's concern about life during and after the crisis and the \"DJ\" doesn't seem to address his concerns...subsitiute the word \"AIDS\" everytime Morrissey sings \"Panic\" in the song and you get a different prespecive on the song....and the narrator asks: \"Could life ever be sane again?\" ie: life post-AIDS. Gays and disco music were also closely linked back in the days when AIDS first appeared in the media, hence Morrissey ironically sings \"burn down the disco\".  Interestingly enough, Marr says the song is about \"Chernobyl\" but Morrissey is always coy when asked to give a \"straight\" answer to his songs...he never interprets it for the listener.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\ni don't have much to add except for that i love that way morrissey says 'provincial,' and that this song is wonderful.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nCould Panic at the Disco be a reference to this song?\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\n@bedlamight\n\r\naccording to wikipedia this song was the inspiration to their name\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nId say that it might have something to do with Manchester being awesome =]\r\nas Morrisey names loads of other British cities, but not Manchester where he is from and uses a muse for lots of his songs\r\ncould the panic refer to people being unhappy with their local music scene?\r\njust my 2 cents..\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nby 'hang the dj', i thinks he's referring to killing the messenger.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nHANGTHEDJ\r\nis the cheat for grand theft auto 1\r\non the playstation\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nAfter watching the video for this song, it occurred to me that the DJ could be the queen/Thatcher, disco the government and the music the constant political discussions which are mostly senseless.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nCould there be a reference to IRA bombings or at least bomb threats during the troubles? There were certainly attacks in \"London\" \"Birmginham\" \"Dublin\". Not too sure about  \"Dundee\", \"Leeds\" and \"Humberside\" (which is the other name for \"Hull\". Morrissey gives other references to NI in \"A rush and a push\".\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nCould there be a reference to IRA bombings or at least bomb threats during the troubles? There were certainly attacks in \"London\" \"Birmginham\" \"Dublin\". Not too sure about  \"Dundee\", \"Leeds\" and \"Humberside\" (which is the other name for \"Hull\". Morrissey gives other references to NI in \"A rush and a push\".\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI used to pronounce 'provincial' like Morrissey until my English teacher bluntly corrected me...\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\ni listen to this and its still very relevent, with all the mindless electronica music that e heads listen to at raves. its crapp\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nBecause the music that they constantly play\r\nIT SAYS NOTHING TO ME ABOUT MY LIFE\n\r\nAbsolutely spot on mozza my mancunian mate :D\n\r\nSo much crap around then and now, stuff with lyrics that just mean nothing, throwaway music.\n\r\nHang the DJ indeed.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI adore this song, it's so true.\r\nMusic today has gone to pot.\r\nViva la Smiths!\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI adore this song, it's so true.\r\nMusic today has gone to pot.\r\nViva la Smiths!\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nthe current riots in london (which have also spread to birmingham) give a whole new meaning to this song...\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\n@hoyden - it's weird you say it gives a whole new meaning to it, or weird to me, I should say. I'd always assumed it had an explicit political dimension and had no idea it was about an actual DJ. Something new every day, I guess. Even the video seems to hint at that, all the graffiti, the flame superimposed over Buckingham Palace (or is it Parliament?) and the crown jewels, all that.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nHa, as soon as I heard about the riots the first two lines of this song popped into my head. Coincidence really as I saw Morrissey playing at Brixton a few nights ago just as the riots were breaking out. Shame he didn't sing this!\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nAs others wrote it was a reaction to the non sequitur of a report on Chernobyl being followed immediately by bubble gum pop.\n\nIt criticizes music for the lack of meaning, while also recognizing it's truly limited importance with the ironic request to \"Hang the DJ\".  (Also see Rubber Ring for putting music in its proper place.)\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nLooking back, this song is clearly about reVILEd DJ Jimmy Savile, which Morrissey must have had knowledge about, some 26 years ago.\n\n'The Leeds side streets that you slip down, the provincial towns you jog 'round', it's so obvious now listening to it.\n\nThe original promo video shows the lead character smoking throughout (albeit a cigarette and not a cigar) and passionately kissing a skull at the end (a reference to one of Savile's bizarre 'interests'), and throughout has a first person view of an outstretched hand running down sidestreets in a groping fashion, whilst switching back to children playing in the playground, as the line 'Hang the DJ' is sung by youngsters.  There are also other possible references in the video.  It's funny the original promo video was remade with live footage overlaid over the original video, obscuring most of the content in the process, but both can be found on YouTube.\n\nI'm sure some of the inspiration may have come about because of the Steve Wright / Wham thing referenced earlier, and the line 'the music that they constantly play' is clearly in tune with that line of thinking, but I'm almost certain this is about Savile.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis reminds me of Ghost Town by The Specials- the striking, unemployment and turmoil of the 80s leaving everyone either panicking about what they were going to do or hiding away, the streets and the discos ('the music says nothing to me about my life') deserted.\n\nBy the way, uvlight, how on Earth would Morrissey know about Jimmy Saville?\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nOoh, I've just thought- could it also be a reference to all the nuclear war worries people had then, how Russia was supposedly going to blow us up, the shelters, the propaganda, etc?\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI always thought he was saying \" Im the dj\" and it didnt ever make much sense to me. But now I think the song is about shitty music taking over the radio.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nTo me I always saw this song being similar in meaning to \"Radio Radio\" by Elvis Costello. The music that is played on the radio isn't relatable and can insult your intelligence as well, plain and simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nThese lines:\n\nOn the Leeds side-streets that you slip down\nThe provincial towns you jog 'round\n\nHmm. Which now-dead Radio 1 jock used to jog (all for charidee), ran a nightclub in Leeds, and might prompt children to sing â\u0080\u009cHang the DJâ\u0080\u009d repeatedly?\n\nâ\u0080\u009cCould life ever be sane again?â\u0080\u009d\n\nâ\u0080\u009cBut honey pie, you're not safe hereâ\u0080\u009d\n\nJust a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nThis song doesn't just relate to the British music scene, or even just the '80s.  That's part of what makes it so great.\n\r\nEvery era has had its \"popular\" music, but this century, with the boom of technology allowing more and more people to hear an artist, has created a flood of disposable pop songs.  This was as true in the \"Roaring '20s\" as it is today.\n\r\nOn the other hand, every era has also produced counterculture music.  I mean, the bands the \"hippies\" listened to, such as Jimi Hendrix, Crosby Stills Nash & Young, Janis Joplin, the Doors, or even the Rolling Stones and later Beatles, were the \"alternative\" music of their day.  They didn't get a lot of airplay back then, either, I understand.\n\r\nAs for \"panic\", well, there's always something everybody's getting worked up over, isn't there?\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nI'm reliably informed that the \"DJ\" referred to was the superannuated tosspot Tony Blackburn, who during the mid-80s insisted on playing third-rate records that unfortunately gave soul music a bad name. Anyone remember \"Sexual Therapy\"? No, not the sublime \"Sexual Healing\" - just a bad imitation. \"We Don't Wanna Die (Keep the Missiles From the Sky)\"? A crap imitation of \"War\". \"Jazz Rap\"? An embarrassing bit of not-jazz-and-not-rap by George Melly and friends.\n\r\nHang the blessed DJ. Amen.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI sincerely believe that this song is more than a complaint about the music played at the time. It's the story of a person in search for herself, a person that cannot remain static because she doesn't feel comfortable in the environment that she is in. She is going from place to place in seek for some kind of meaning. \n\r\n\"Hang the blessed DJs... because the music that they constantly play... it says nothing to me about my life\" - I believe that there is a search for meaning. We all relate to some songs (or any art form for that matter) because they bring something that we hold deep inside. The new music however feels like they hold no feelings.\n\r\nIt's a song about being lost in a society that no longer pays attention to meaning...\t\t\t\t\n\t\t\t\t\n\n"}