{"comment_0": "\nI agree, a brilliant apocolypic song. Guitar and drums are relentless, and I love the imagery of the lyrics. Plus, Bowie follows Chekhov's dictum, that if you introduce a gun in the first act, you must fire it by the third act.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe person that \"looked a lot like Che Guevara\" was based upon a real person.\n\r\n\"I know why I associated with that character. It was somebody I used to go to school with who ended up as a very big drugs dealer down in South America and who flew to one of the shows and reintroduced himself. And I said 'I don't believe it. Is that who you are now?' \"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nSo many images brought to mind by this. Drug dealers, riots, crime, people dying in the street. And Bowie makes it all sound so cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song is great, I can listen to it all nite on repeat. and by the end I still don't have a headache and the words aren't just average mumbles as a song on repeat would usually come to my ears as.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nLike \"Five Years\", \"Fiture Legend\", \"Diamond Dogs\" another song that could've been part of the soundtrack for Omega Man.\n\r\nIt R o c k s!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nWritten in early 1970's in Detroit about the 1967 riots.  Take it from me, he saw the same burned out buildings along Grand River Ave. in Detroit as I saw in the early 70's.  Aladdin Sane has a city associated with each song (check the CD or album liner) and this one was from Detroit.  He captured the essence of the city after the riots very well.  Great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nchristian death made a great version of this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI'm FROM the Detroit area, was vacationing in Canada during the riots-which the media acted like were only on Twelfth Street. Twelfth was a slum by then anyway, Grand River a major commerical district.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI bet he was there in the winter and heard all the silent screams of the people dieing from exposure to the city its self.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThe David Live version is straight Epic!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nIt's about a young wannabe \"revolutionary.\" \n\r\n\"He looked a lot like Che Guevara/drove a diesel van./ Kept his gun in quiet seclusion, such a humble man. /The only survivor of the National People's Gang/ Panic in Detroit, I asked for an autograph/ He wanted to stay home, I wish someone would phone. /Panic in Detroit.\"\r\n-He glorifies this guy who looks like actual revolutionary Che Guevara and wants his autograph. He keeps waiting for someone to \"phone\" because he wants to be involved in something, wants to be called upon to act. The guy (judging from later lyrics) probably kept his gun in \"seclusion\" not out of humility but because he was not interested in revolution anymore.\n\r\n\"He laughed at accidental sirens that broke the evening gloom./The police had warned of repercussions./They followed none too soon\r\nA trickle of strangers were all that were left alive. Panic in Detroit, I asked for an autograph. He wanted to stay home, I wish someone would phone.Panic in Detroit.\"\r\n-He wants the guys autograph but the guy wants to stay home.\n\r\n\"Putting on some clothes I made my way to school./ And I found my teacher crouching in his overalls./ I screamed and ran to smash my favorite slot machine. /And jumped the silent cars that slept at traffic lights.\"\r\n-The kid is young (school age) and immature. Whatever is happening has his teacher scared. (And the detail about the overalls may be for irony as overalls are typically \"worker\" clothes & revolutionaries are usually trying to help \"workers.\" He then smashes a slot machine which seems like a petty act and then in next lines thinks he has a \"trillion dollars.\"\n\r\n\"Having scored a trillion dollars, made a run back home. /Found him slumped across the table a gun and me alone./ I ran to the window looked for a plane or two./\r\nPanic in Detroit he'd left me an autograph\r\nLet me collect dust I wish someone would phone. Panic in Detroit.\"\r\n-The kid returns to find the guy had committed suicide and runs to window to look for planes because he hopes something big and exiting is happening. The guy has left him an \"autograph\" in form of a suicide note requesting to be let to \"collect dust.\"  The kid is still waiting for a phone call.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\n'I ran to the window and looked for a plane or two, PANIC in New York'....David would be seen in a different light if he had picked New York as the title.\t\t\t\t\n\t\t\t\t\n\n"}