{"comment_0": "\nI found the Hysteria reference interesting because I read that the Octavarium album was heavily influenced by Muse's Absolution, which has a song called \"Hysteria\" on it. Not sure if it means anything, though. I just found it interesting.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIt seems that the song describe someone who suffers paranoia or something like that, similar to \"War inside my head\" but this time the paranoia appears to be for no reason. \n\r\nBTW great song to hear while driving (speeding) :P\n\r\n\\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIt could be about a drinking problem..And the reason why I say this is because of this line, \"overwhelmed by this complex delirium\". Now, if you look delirium up in the dictionary, it says that an episode of delirium is usually caused by the withdrawal from alchohol, which in turn, causes all of the things described in this song (delusions, dehydration, seizures..etc). This song is awesome, though, my favorite song from the Octavarium with Never Enough & The Root Of All Evil trailing close behind.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIt's about panic attacks, as the name says.  Anyone who has suffered from them will be able to tell you the lyrics describe EXACTLY what happens.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nFor me, this is the most \\m/ song on the Octavarium album, followed by The Root of All Evil and Never Enough. JR and JP yet again impress us with amazing unisons! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nYes, yes yes yes yes yes yes yes yes. Yes. \n\r\nThis song rocks like a death biscuit, but anybody who's heard the Rush song \"Driven\" has heard this style of riffing before.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nthis is the best dark song from dream theater, and also the best song from the album octavarium, the melodies are just great, another brilliant song from dream theater, hope they will make more\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI find myself singing this all the time at work. Fucking kickass song ^_^\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nwow, what a coincidence. i am listening to dream theater, which is my fav band and it is the latest commented song.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nHe doesn't really give a reason for the faer other than a fear of death and possible insanity.\n\r\nAnyway if I was to create an Octavarium Lite it would consist of this, The Root of All Evil and Octavarium.  Definatly one of the better tracks off the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song is about a panic attack! Panic attacks are REAL.  This song describes exactly what happens to me when I have a panic attack. I wish I would have heard this song a long time ago- It really makes me feel less alone in this. If there's one thing people should know about this song, its that it is NOT exaggerating what happens during a panic attack. This is exactly how it feels- In some cases it may be even worse. If you feel like this at times for what seems like no reason... You know that you have what are called \"panic attacks\" See a doctor or counselor about getting them treated. Panic disorder is the most common \"mental disorder\" in America.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\njust about panic attacks in general... \r\n by far, one of the best songs on the album, especially since the entire time, they alternate between 5/4 and 4/4 time, which is amazing...\n\r\nDream Theater is the best band out there...\r\nSystematic Chaos will be amazing, just by looking at this album, and how each album is always better than the next\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n\\m/__(^o^)__\\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni love this song, its also insanely fun on drums. i knew it was about Panic Attacks, but during health class i realized it connects most to Anxiety Disorder, and it connects directly.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nTortured insanity, a smothering hell\r\nTry to escape but to no avail\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nTortured insanity, a smothering hell\r\nTry to escape but to no avail\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nah, the song that got me into dt! while it might not be my favorite song, it holds a great importance to me. yay!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI'm pretty sure it's about someone with hysteria...\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nIt's about someone experiencing panic attacks. I had one recently and this just sums it up. Amazing song.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nBout someone having a panic attack, hence the name... Great riff :D\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nTo all of you who are STILL wondering what this song means... it's about a PANIC ATTACK. That's NOT a metaphor, it's about a panic attack. If you have them, or have had even one, you know this is exactly what it's like. I've had them for 10 years and this song sums it up almost perfectly. It's not a lack of alcohol, it's not hysteria... it's a panic attack.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nYes this describes a panic attack, only thing it left out was the apparent feeling of difficulty breathing and a heavy weight pressing on the chest. First time I had one I grabbed on to my desk and I had no idea what was happening to me. I wonder if this song was written from personal experience.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nTo AudiDriver, i'm sure it was written from personal experience, since very few who haven't experienced can even recognize a panic attack. \r\nI believe the lyrics we're written by John Petrucci. I suffer from a panic disorder aswell.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nCool - this song made it on Rock Band 2.  Not the song by DT I'd have picked, but a good choice still IMO.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nBeing someone who has, and continues to, suffer from panic attacks, the lyrics in this song make pefect sense. When you have a panic attack, your entire body is paralyzed, thoughts race, and you feel that death is certain. Listening to this song I can totally relate, panic attacks are one of the scariest things anyone can go through, and, like in the song, \"Warning signs never show.\" Whichever member of DT wrote this probably has experienced a panic attack at some point because physically and mentally, it is incredibly traumatizing and, like Dawgzy said, if you have never experienced one, you have no idea just how incredibly intense and unpredictable they are. Word of advice: Control your stress.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIt's about an Anxiety or Panic Disorder. I would know-it's lyrics fit me to a T, being someone who suffers from this 'insane' illness. \n\r\nIncase you don't know the full extent of what a panic disorder is, it's when you constantly feel like you're on the edge, you're always tense--and you're interpretations of the things around you constantly spell doom and bad news for you. \r\nYou undergo something called \"fight or flight\" which he references to. You're pumped with adrenaline when undergoing an attack. As if in a kill or be killed situation. fight for your life, or flee for it. [usually happens when nothing is wrong]\n\r\nOther symptoms include heart palpations fear of sleep. you become a horrible hypochondriac, and it literally feels impossible to break the cycle. no matter what remedy you try[minus medication, which im personally against]-it follows you like a ball and chain that's fused into your leg.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nPretty obvious. Panic attacks and anxiety disorders.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI would like to punch Blackened89 in the dome, just a little bit.\r\nObviously someone who hasn't dealt with the actual turmoil \r\nthat panic disorder/panic attacks/anxiety disorder causes. It's not something you can just\r\nturn on and off.  It's fightable but I would definitely not consider it to be a simple mundane task.   \n\r\nI enjoyed this song, the riffs are strong and the lyrics are relatable.\r\nQuite obvious what it's about, don't dig too deep.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThe song is about a panic attack, that simple. They suck and it is described perfectly by the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI also think it's interesting how the lines are chopped up words and short phrases, rather than long lyrical verses. Though I've never had a panic attack, I can imagine that you're not thinking alot about forming complete sentences when you're having one. It's crazy how they managed to capture that aspect into the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nthe name of the song basically says it all i used to massive panic attacks to the point where my psychologist thought i had schizophrenia the disease where you hear voices and hallucinate.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThis song reminds me of when I have sleep paralysis.  I can really relate to\r\n\"A stifling surge Shooting through all my veins Extreme apprehension Suddenly I'm insane\" because when I experience SP I shake uncontrollably (still unable to move) and I hear things that aren't there sometimes like people laughing.  Its really creepy!  Everything mentioned in the lyrics goes through my mind when it happens to me, which is why I love this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nthis song is pretty self explanatory...they're about having panic attacks...tripping the fuck out!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nthis song is about social anxiety disorder, it's pretty obvious, maybe moreso to me since i suffer from it. one of my favourite songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nAs many have said it describes nothing else than a panic attack, caused by anxiety disorder. I listenned to it far before i ever experienced anxiety and didn't understand it's meaning either. Funny how life changes, that you discover things, which you don't even wan't to. :) For more about this read:\nen.wikipedia.org/wiki/…\n\n\n", "comment_35": "\nTo those suffering from a panic disorder (me) it's an intense, close-to-home song of great intensity.\n\r\nTo those who've never had one, this song is just intense, wicked, cool (ad nauseam).\n\r\nVery different, depending on one's life experience.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nFirst dream theater song I've ever heard. Good times.\n\r\nAnyway, I think this song speaks for itself. It's about a panic attack.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nAs you can probably already tell from my username, I suffer from a lot of anxiety and i have recently had 2 panic attacks in the last month. After reading the lyrics and of course, the title of this masterpiece, i am 100% sure that this song is about the thoughts that go through your mind and how you feel when you suffer from an anxiety attack.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nPanic disorder can be dissolved with (rather simple) changes in though process. It's your brain, you do have control over it, you know.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI don't like this song.\t\t\t\t\n\t\t\t\t\n\n"}