{"comment_0": "\nyay im the first!! this song is awesome!! green day is an awesome band\n\n\n", "comment_1": "\nSuch a great song to listen to when you're having a shitty day\r\n(like I am)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nits a good song, but if you ask me the instrumental goes on a bit too long, but without the long instrumental, it wudnt be such a good song. im confused :S\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think it's heading for a cheap escape...but the song rocks! Mike, the bassist wrote it. He's a brilliant lyricist, really underrated in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nthe instrumental part is not too long in fact i can tell right when billie joe is about to sing. this is my favorite, also burnout is my favorite songs as for green day.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI love this song. The intro is part of what makes it so fuckin' good! Really gets me pumped before going out.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI love the intro.\r\n-----------------\nfreewebs.com/…\n\n\n", "comment_7": "\nI love this song so much, it starts off with just mike on the bass and then it builds for like 2 minutes and gets louder and more intense and its awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthe intro makes me think\" whoa this has 2 b a good song\".  we luv mike... does anyone know anything about him leaving the band?  i think i heard that on the radio or sumthig and was not happy.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthat would be such a loss....damn!!...but it's never going to happen, be sure...\n\r\nwoohoo!! i love it (the song...)\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nprobably about mike's panic attacks.. wow i feel sorry for billie and mike because panic attacks are downright frightening.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ngreat song!! iÂ´m a big insomniac fan,, about the song, i think the last chorus part is \"i wanna jump out\"  like out of the world (being it a sick machine and all) also right before the chorus i think itÂ´s \"desolate conclusion\" not confusion,nevertheless great lyrics and green day lives on!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nYeah, I read somewhere that it's about Mike's Panic Attacks. It's sad cuz they are horrible things to go through.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think this is about Mike & Billie's panic/anxiety attacks. (Billie has them too right?) this song rocks and the intro is cool, kinda long but when an intro's that long you KNOW that the song is gonna be good.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThe best part of this song IS the intro and how it builds up....Good song\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nyea..i have panic attacls and these words describe it to the T.  total confusion, uncontrolable random fear...its so evil it makes me question the integrity of god\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nBillie and Mike wrote it together, but I think Mike sings it... o well it's great I have panic attacks sometimes too. Great song... real punkish!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nIt's about Mike's panic attacks. I think Billie Joe co-wrote it, because he also has some sort of panic disorder. I feel bad for Mikey, panic attacks must be awful to go through. \r\nAnyways, I love the intro, and the lyrics, and the song in general. It's one of my favorite songs on Insomniac. \r\nWhenever I listen to it, I can imagine what it feels like to just start freaking out for no reason. It's a scary song, but very...honest? \r\nGreat song.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nPanic attacks are horrible....I've been wanting to write a song forever about mine...but havent gotten around to it, this song sums it up baiscly...\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\npeople say that panic song , armatage shanks , and basket case were all about billie joe but panic song was about mike's problem with panic attacks, basket case was about billie joe, and armatage shanks was about toilets which doesn't make sense\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI know exactly what this song means. It's about being strung out on speed. They don't care about the world, but more on their situation of being high. \"Broken glass inside my head\" refers to the ice. They panic because they don't wanna die but also  just feel like jumping out of their lives and getting it all over with. The lyric is \"I wanna jump out\". It's a great song but means more than just panic attacks.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nPretty much my exact mindsight, every day, no matter waht I do, unless I get a fix\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ndumpyerweed, there's more to it than that.  I see it more like it was written during a panic attack while being depressed and nihilistic.  He's feeling a void in his life.  It may have been induced by drugs in a way, but the feelings he talks about are not exclusive to drug users.  Plus, the motivation to even take drugs was caused by something else in his past.  Possibly the loss of his father and alienation elsewhere that he's experienced.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nyeah yeah, I totally agree with you WeNeedTheEggs. It's not all about drugs, but more about panic attacks and shit like that. I think maybe it's not about drugs at all.\n\r\nand Green Day Girl, I know it's none of my business, but panic at the disco sucks big time. why don't you start listening to music that has even remotely something to do with punk. God I hate those shitty new wave punk(?) pop bands. Why are they called punk anyways? everythink that came after GD sucked.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nnope its about speed, im pretty sure, if uve ever done speed u would certainly know, this was by far and away green days most underrated and most true to their roots album they ever made, aside from their very first, kerplunk, before they were famous.  i like how it builds up and then he spills out his words almost in speed freak nonsenseical style, its really cool,\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nnope its about speed, im pretty sure, if uve ever done speed u would certainly know, this was by far and away green days most underrated and most true to their roots album they ever made, aside from their very first, kerplunk, before they were famous.  i like how it builds up and then he spills out his words almost in speed freak nonsenseical style, its really cool, and if panic at the disco took their name from this song that is awful and a disgrace since the two bands are nothing similar to the way green day was on this album at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThe massive instrumental introduction really makes this song fantastic.\n\r\nAnd it has nothing to do with speed..\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\none of the best\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI just love the line\r\n'Fill the void with I don't care'\r\nso true for a lot of people I think......\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThis song is simply amazing.  It has to be one of the most unappreciated Green Day songs of all time.  It definitely goes in my personal top 5.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nMan...no one commenting on this one. This is one of GD's best songs musically. Mike's bass just tears it up.  \n\r\nAnd it's about a guy that's stricken with a little panic...\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\n\r\nI'll forever associate this song to my drive into work at 7am on a cold, crisp London winter morning, watching the top crescent of the sun glint out over the misty Wembley horizon as the city wakes up around me. Tre's drum work on the opening bars is phenomenal, like a heartbeat beginning to pick up. \n\r\nObviously I'm just referring to the epic instrumental intro - I've got no opinion on whether or not the lyrics deal with drugs. \t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nIt's about being on drugs (\"Ready for a cheap escape on the brink of self destruction/Fill the void with I don't care\").\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThank gosh i found this. I've been searching forever for the lyrics to \"Panic Song\" (i always look up the lyrics before i decide if i'm gonna download a song. can't help it. i'm weird). I really wanted to see the lyrics to this song because i read that this song was the inspiration to the name of the band \"Panic! at the Disco\" and i'm starting to like Panic! at the Disco. When i heard that they got their inspiration for the name from this song i freaked out because Green Day is my favorite band.\t\t\t\t\n\t\t\t\t\n\n"}