{"comment_0": "\nA November 1918 edition of The Times printed a report called Behind the Veil . A part of it says, \"Alarm gongs had already sent the guns' crews to their invisible guns and immediately after the explosion 'Panic stations' was ordered, followed in due course by 'Abandon ship.'\"\n\nThe story is about a Q-Ship called the HMS Prize . A Q-ship was a boat made to look like a slow, rusting cargo ship, but in reality was a naval ship that could do battle. They were used during WWI against German U-boats.\n\nFrom the story, the meaning of the command \"panic stations,\" seems to be that sailors need to be on alert and ready to abandon ship if necessary as it the command was followed by the command \"abandon ship.\"\n\nSo, I wonder if this song isn't about being prepared for the inevitable crash of society as we know it. With that said I'll do a line-by-line explanation as i see it.\n\n      You won't get much closer\n      Until you sacrifice it all (all)\nWe can only achieve so much without stepping out of our comfort zone. The ultimate victory isn't going to be realized until we are willing to give up our life lines (money, fame, habits, whatever they might be) for the greater prize.\n      You won't get to taste it\n      With your face against the wall (wall, wall)\nHaving your face against a wall implies that you are being put there by an authority figure or bully. Like a cop that is apprehending a suspect or someone being fought in a bar/alley fight. You won't get to taste that greater prize if you continue to let others control you.\n      Get up and commit\n      Show the power trapped within (in, in)\nCommit to taking control of your own life. You have the power to exact the change you want to see even if you have never used it before.\n      Do just what you want to\n      And now stand up and begin (uh)\nWhat do you want? What is the change that you want to see? Start on it now. Hurry up.\n\n      Ooooo 1, 2, 3, 4 fires in your eyes\nYou are burning with determination now. Your dreams are fueling the fire that you have lit in your life.\n      And this chaos, it defies imagination\nBut all of this change is creating chaos beyond your imagination.\n      Ooo 5, 6, 7, 8 minus 9 lives \n[I'm not sure about this one line.]\n      You've arrived at Panic Station\nThe point of no return. You either change or you might as well abandon ship.\n\n      Doubts will try to break you\n      Unleash your heart and soul (soul)\nYou're going to run ino some problems but if you stop holding yourself back then you will have a fighting chance\n      Trouble will surround you\n      Start taking some control-(trol!)\nYou are not a slave to anyone or anything, especially your own emotions.Control them, don't let them control you.\n      Stand up and deliver\n      Your wildest fantasy (sy, sy)\ngive yourself permission to reach for your dreams.\n      Do what the fuck you want to\n      There's no one to appease (ee, ee)\nThis can be taken 2 ways, either you don't have to please some non-existent God (if you are atheist) or even if there is a God you still don't have to please anyone on Earth but yourself. You are the person that will live with you forever. What are you going to put up with?\n\n      And I know that you will fight for the duration\nYou can do it. I believe in you.\n      And I know I'm not resisting the temptations\nThe temptation is to stay away from our comfort zones, enact changes to make the world better. I sure don't want to resist that temptation either.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI honestly don't see there being much meaning behind this song, they just tried to make a catchy diddy (hence the use of counting) and boy oh boy did they succeed. If I had to squeeze an interpretation though, I'd say it's a continuation of the entire album's chaotic theme (second law of thermodynamics/entropy) and how inciting chaos is a way to make human beings feel in control -- especially under a totalitarian regime.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI just see at as a generally uplifting and inspiring song. It's all about taking life by the horns and making the most of what you're given.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song is about putting everything on the line to achieve your biggest goals. It's saying that there will be a lot of adversity but you need to get that fire in your eyes, power through the chaos, and get it done. Only then will you \"arrive at panic station.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nyayy first comment!!!! not really sure what matt means by this YET but.. i jsut gotta say i LOVE THIS SONG!! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nAt a recent Q\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song makes me think of the various Marches On Wall Street protests, particularly in NYC.  I wouldn't be surprised if Matt listed that as an influence when he wrote this.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nFor me it is about CHAOS in mind. Feeling, when you understand that you lost your way to get the goal, the meaning of your life. You thought you're glorious, but now realized that you are piece of crap. In imagination you can be someone else, you can change everything NOW, but in reality - you are too weak to conquer temptations that control yourself and you really don't know what you want to change . This song is about fight. Imagination, glorious, ideal ME vs. real ME...\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nFavorite track off the album.\nMakes me wish I knew how to play bass :(\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI believe, even if you don't agree with me, its got something to do with opening your third eye and realizing the truth of this world and the power within you even if doubts will try to bring you back to how you were before- a sheep that has given in to the government.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nA song encouraging the listener to stand up and take control of their lives, and to not let fear and doubt cow you into submission.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\n\"Panic Station\" by \"Muse\" is for myself an attempt to prepare the listener to accept awareness of all of the terror that is natural to this human existence, but hidden by me in my/the unconscious. So that, if I do as the song suggests and assume total freedom for myself, I might accept the initial panic of meeting my entire self all at once, and thereby transcend the panic instead of being chased back into the world by it.  \nI tend to assume all muse lyrics to be about seizing personal and political freedom/enlightenment through passion and love.  It makes for some proper rock and roll.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song is about a satanic ritual. You have to reach the Panic Station to lose your soul. You give your soul to the satan, and you free energy that trapped within the struggle of black and white/ jing-jang, good and bad. Its the constatnt battle of the serpent and your higher spirit. If the serpent wins you become a psycho. And this world stand for psychopats.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nTo me, this song is about some kind of world leader figure who is abusing his power, with the lyrics almost some what sarcastically disguised as a self motivational song. There's no one to appease because you have all the power to do what you want, and get reckless with it leading to the \"chaos\" that causes the loss of life \"minus 9 lives\" Almost a pop-song take on the themes of Take a Bow or The Globalist\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nLove this song! Panic Station! :D\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nNot sure why it cut off most of my comment.  At a recent QandA session, Matt said that Panic Station was a commentary on Execution.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nLooks like the first song, where Muse uses the word \"fuck\". I don't think that this song contains some hidden meanings.\t\t\t\t\n\t\t\t\t\n\n"}