{"comment_0": "\nThis whole album deals with spiritual enlightenment(with the climax at the end of Reflection). Parabola specifically deals with the illusory nature of the self.\n\n\"We barely remember who or what came before\" -> Our memories are very limited, but they create a story of our \"selves\" despite that. It's just an illusion, the song tells us to focus on the now(a common theme in spirituality) and that our bodies are just a temporary form of being.\n\nThe other songs on Lateralus all focus on different aspects of the main spiritual truth that Reflection tries to convey.\n\nThe Grudge/Schism are about our relationships with other beings and how futile it is to separate ourselves from them. We are, after all, all one mind.\n\nThe Patient/Ticks and Leeches are about dealing with the struggles that come along the path to spritual enlightenment. The incredible amount of patience it requires, the negative influences from the outside world, etc.\n\nLateralus is about the exploration of ourselves and just the general size and scope of what there is to discover.\n\nMany people call Tool hard to understand, but they actually convey very simple messages in their music. That's part of what makes them so great, their universal applicability to almost all situations.\n\nEven looking at their discogtaphy as a whole sort of shows a cool trend. Opiate was very \"me and them\", the ideas are very typical of an individual angry at society and at himself.\n\nUndertow and Aenima show a more inward approach, especially on Aenima. Third Eye is sort of like the precursor to Lateralus, the final understanding of truth.\n\nLateralus is sort of climax of their work.\n\n10,000 Days is sort of like Opiate, in that it includes lots of societal criticism, but from a new perspective. It criticizes it in terms of \"we\", rather than \"they.\"\n\nDo I really think Tool's discography is like one big concept album? No, but the trend is definitely there.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nWe don't remember what we were before we were alive in this physical form.  We choose to stay alive in this physical form.  It is a great gift to be alive.  We can look at all the other bodies around us and see that we are obviously not alone in this world.  Other's share our pain and our joy.  Just by being born we have an effect on the lives of other people.  But this body, this physical form, is only a vessel for our \"soul\".  Our soul is what makes us different from every other person.  It is my personal belief that our soul is the same thing as our mind.  Our body gives our soul a chance to experience life and what it means to be alive.  To have memories.  To love and to hate.  To feel pain and joy.  We have to remember that we are not a collection of memories.  We are not our professions.  We are not what others see when they look at us or even the way we try to project ourselves to the world.  Inside we are a mind truly capable of anything, but limited by the body we are given.  Even so, we should embrace this chance to be alive.  Our body will die.  Our soul will live on.  Of course this is all just hope.  But we need hope.  I need hope.  This body holding me can't be all that I am.  My mind can't be just a series of synaptic connections and chemical reactions.  There is more to us than science will ever even begin to explain.  I highly recommend the Ender's Game book series by Orson Scott Card for anybody who like's this song and want to read an excellent book that gets deeper into what we are and what makes us human.  Ending thought:  Try and empathize with people.  People act a certain way because their body is imperfect.  There is a reason for everything, nomatter how irrational.  Learn to love others nomatter how much they hate you.  It is hard.  I know.  Damn do I ever know.  I am imperfect, too.  I hope you all find happiness without sacrificing the happiness of anybody else.  Good tidings and Farewell.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song is about the Spiritualist belief in the birth process; it has nothing to do with sex really.  We are spirit forms until we will ourselves into a physical form.  During the infant stage, our spirit (or second self as I call it) moves in and out of our body with ease, as it's not yet grounded in the physical world.  The lyrics demand that we are alive because we chose to be, and we should cherish this opportunity.  Pain is truly not an illusion, but can be manipulated into suck when one looks at the big picture.  Our bodies are vehicles that carry our astral minds.  We are eternal.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThat or it could possibly be relating to death by suicide. The deep depression that some of us feel. That when the walls come down and we are left alone, there are only 2 options: end it now, or find hope and place faith in overcoming our insecurities. \"Pain is an illusion\", I know that statement has kept me here in this world. The thought of that statement gives me the strength to go through one more day. I remember that all that is physical, is ill-logical. It is only a destraction. I must stay focused on what my life is about. In the song right before this one on Tool's album Maynard asks, \"Is this a Test? It has to be. Otherwise I can't go on.\" To me that is what I feel when I hear it. It is the feeling of hope and inspiration, a chance to go on. But that's me. Things have different meaning for different people. \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song, to me, is a short writing of the ultimate truth one can attain while being alive on this earth, in this vibration, and on this plane of awareness. The \"parable\" here is that \"we\", humans are an extension of our cosmic counterpart i.e. God. We are ALL one being and Life, is the experience of a divided single consciousness within human avatars. Meaning, we, all, us, god, CHOSE to \"divide\" and live! \"This body. This body holding me. Be my reminder here that I am not alone\" Not alone meaning, life is many. Consciousness of ONE is alone.\r\nThe \"illusion\" is that there is NO DEATH! But only a constant cycle of infinite existence/consciousness.  \r\nDestroy the ego side and experience \"death\" of the \"self\" only to come back \"here\" and realize we are humans and ONLY this \"reality\" will end... Our fleshy vessels will retire... mortality. \"This body holding me reminds me of my own mortality. Embrace this moment. Remember; we are eternal, all this pain is an illusion.\" The \"moment\" being when you return to the consciousness of ONE, when the ego dies.\r\nThese men have experienced \"death\" of the ego as have I. I KNOW this is exactly what they are trying to convey... I hope you will consider what I have said and pay more attention to other lyrics from other songs. Their core message, their entire mission, is to be the 'Tool' for humans to find this truth... The Philosopher's Stone, the Holy Grail...\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nOkay, Bill Hicks used to talk about how we are one with God, that life is a ride. He said we are one in the mind of God and there is no death, that we are eternal. This song is expressing just that...\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think this song talk about life .\r\nHuman have to be happy to live .\r\nThey have soul , they have body , they can do a lot of experience during them life .\r\nAnd when he says : All this pain is an illusion \" , he talks to all psycho people that feel pain and want to say : \" YOU HAVE A BODY , YOU HAVE SOUL , YOU ARE ALIVE DON'T DISTURB YOURSELF WITH PAIN, ENJOY !! \"\n\r\nThat's what i see in this song .\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nActually the song has nothing to do with suicide at all. It's a very positive song (just like most of their stuff). The song is about this miniscule moment in time that we as spirits have been actually placed into this world..onto this earth. The one thing that none of the \"gods\" have ever had the chance to do. To be mortal and eternal at the same time. In short, enjoy the ability to see, hear, smell, smile, love, etc...because it is only for a flicker in time that we get to do this. Do not be sad when something earthly seems to be troubling, it is only of this world and it isnt real, not in the grand scheme of things. It is a \"Holy\" moment, a gift, given to us by the Creator of all. Once this is realized it becomes more easily understood and appreciated. Yes,...all this pain IS an illusion.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI heard it's about a really good sandwich maynard once made\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nWhile this song obviously has deep spiritual contents and everyone seems to pick up on that, I'd just like to add that I'm almost 100% positive that this song is written about a Dimethytryptamine (DMT) trip.  DMT is a hallucinogen that occurs in the human brain, as well as in the brain of many other organisms including some plants.  The title \"Parabola\" refers to the very fast onset and consequent regression of the drug, and the lyrics \"hold on\", \"stay inside\", etc. refer to the spirit being launched out of the body during a DMT trip.  DMT usually causes intense colors and euphoria, along with meeting with spiritual beings that guide you along your journey.  If you want to know more about it I'm sure it's on the internet somewhere, and if you really want good information read \"DMT: The Spirit Molecule\" by Dr. Rick Strassman.  Truly insightful and interesting stuff especially considering that almost all trips have the same components.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis whole album is entirely comprised of therapy concepts, concepts used in counseling and therapy to help people keep from freaking out. This is not about sex, although that is what I thought it was about when I first heard it. The concept here is the practice of living RIGHT NOW, which is very hard. It is about the difficulty and the reward of not living entirely in the past and in the future. The idea is to live without your preconceptions and your hopes and projections ruining the wonder of the immediate world. Try it sometime, and you will see why it is worth writing songs about. The pain metioned is the anguish of always worrying about the past and the future. Those things are not happening right now, so any pain you are feeling from the past and the future is illusionary. It is only you. Crucify the ego, and you find that there is not much that is worrisome that is happening RIGHT NOW. Try it.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThe unconscious lives on, or possibly some sort of consciousness is moved on. The flesh is temporary. while the mind is eternal. \n\r\nIt is what I have gathered from the song, many of Maynard's lyrics coincide with this. Very spiritual, however not religious, if this makes sense to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI believe Bill HIck had the best explanation of this song, \"Today a young man on acid realised that all matter is merely energy condensed to a slow vibration. That we are all one consciousness experiencing itself subjectively. There is no such thing as death, life is only a dream and we are the imagination of ourselves. Here's Tom with the weather\". \t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think the song is talking about how life is a gift, it almost sounds like he's talking about reincarnation.  Our souls are eternal and all the pain we feel while we're alive doesn't matter because our souls go back to heaven, or where ever, when we die and we feel no more pain.  We choose to be alive and expirience life.  Maybe,  but then again, maybe not.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThe song is about the existence of life. Everybody has a soul which is held by a body. The body and the soul together are life. You feel pain and happiness in the body, if you die in the body, your soul will still be around. Life is supposed to be happy and full of new exoeriments, not taken for granted, thats what I think the song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nYou know, I think I've worked it out. I think this song is about Maynard's son, Devo. Here's the explaination:\r\n\"We barely remember who or what came before this precious moment\" MJK can't remember what life was like before his son was born.\r\n\"Feeling eternal\" Through his son, MJK will live on because he has half his DNA\r\n\"All this pain is an illusion\" MJK will ignore any pain he has and never subject it on to his son because he loves him.\r\n\"Spinning, weaving round each new experience\" It's his first child and everything he experiences with him is new\r\n\"Recognise this as a holy gift\" His son is a 'holy gift'\r\n\"Celebrate this chance to be alive and breathing\" he worships everyday he has to spend with his son.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nHarry Manback: I see where you get that conclusion, but I have to disagree.  What about \"This body holding me\" what does that have to do with his son? Not to flame on your opinion, to each his own, but I think that some of those lines are a bit out of context.  Anyway, In my opinion, It's about life in general.  About living and being alive.  Sexual experience? Maybe, that's a definite possibility, but I've always just thought of it as a song about Life.  Read the lyrics with that in mind and see watchya think.\n\r\n-That's my story and I'm stickin' to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nFor me Parabol/parabola  is realy the entire introduction to the concept Tool is presenting to us in this album and in much of their music and if you listen to some peoples thoughts on this album Parabol/Parabola is the first track.  To me this song is about several things; sex, birth, rebirth, and the concept of life as we know it is only a temporary experience for our sole which we need to cherish.  \n\r\nFolks keep mentioning the Fibonacci sequence in attempting to understand TOOLs music.  The Fibonacci sequence is just a deep pattern within anything that is organic.  We see it visually through the golden mean or Rectangle which is evident throughout nature â\u0080\u0094 it is the balance and rhythm of the universe.  In art we see what we instinctivelly find aesthetically pleaseing follows this balance and rhythm of nature â\u0080\u0094 same with music, and TOOL has just taken it to the next level â\u0080\u0094 this is why we cannot stop listening to it â\u0080\u0094 it is a hightened state of consiousness.   This all happens before you even begin to look at the lyrics and the meaning behind the songs.  \n\r\nThe human race has been going through almost a backwards evolution â\u0080\u0094 we have lost so many instincts that we only have a few instinctive aspects left and our culture and society suppress it more and more by providing us with blinders that keep us from seeing what is beyond our bodily experience.  Religion also does this, it creates a path with blinders that teaches us that we must follow their ways to become enlightened when infact it is all internal and GOD is â\u0080\u009cI Amâ\u0080\u009d is within us all.  \n\r\nTalking about instincts, the few we have left, and one of the most prominent instincts which must continue for us to experience a journey in what is this and now, is the instinct of SEX.  Our culture is continuosly attempting to suppress this instinct.  Sex for some religions is viewed as a spiritual experience and can be used for meditation and enlightenment â\u0080\u0094 Through orgasm we reach a hittened state of conciousness for a brief moment, which is also a moment in which our body is closest to death.  \n\r\nConception is a mini version of the big bang.   For anyone who has children and has experienced the birth process, male or female, you will know what Iâ\u0080\u0099m talking.   A new born baby is the closest thing to that devine state of all knowing.  It is not as if you are looking down at  a helpless ignorant creature but rather the opposite â\u0080\u0094 it is a state of the coming together of body and soul experiencing being alive.  \n\r\nThe line in the middle of Parabola where he screams â\u0080\u009cALIVEâ\u0080\u009d is the apex of that realization and is almost this climax that takes it above and beyond.  \n\r\nIâ\u0080\u0099m sure it has many other meaings as well â\u0080\u0094 that is the beauty of art, it can have a main concept which is then supported with a variety of elements which to some may appear as random but instead are finely orchestrated to highten the experience. \n\r\nThe idea of loosing our instincts I believe is also related to our inability to experience this hightened consciousness which would allow us to find our instincts.  We see this in animals that still have their instincts intact, even dogs and cats.  They have the ability to communicate at an entirely different level.   \n\r\nTo survive as a species we must regain these instincts that allow us to live in harmony with our body, earth and universe.  \n\r\nBut hey, maybe Iâ\u0080\u0099m just crazy and all of this writting is just an illusion.  \n\r\nTool Fuckinâ\u0080\u0099 Rules!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI see this song as one of true love.  With a lover one may feel jelousy, and other terrible emotions.  But, in this one moment two lovers have set those feelings aside, and are experiencing a pure form of the love. That pain is realized to be an illusion.  It can't be real, if it can be tossed away.  This love is so strong that it shows them that there must be more than this physical realm of life.  They know they can transcend into something much greater, and it must be done through an emotion as strong as pure love.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think this  song is a reference to the fact that our souls are separate from our bodies, and that the soul lives on through physical damage.  \"This pain is an Illusion\" means physical pain, meaning that pain is a bodily thing, and cannot damage the soul.  \r\nStill not quite sure how that ties in with the video clip but whatever :P\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nwhat he means by this body holding me is his physical body holding his soul.\r\nand yes pain is an illusion of the human condition, because we hold on to past experiences instead of embracing every moment as it comes. \r\npeace\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nWell, here's what I gather from this song:\r\n   Now, I don't know much about the concept, and I'm also no philosopher or math magicician, but take a look at the concept of Phi, which is considered The \"divine proportion\" -1.618. This proportion is found all over nature: In bee hives, snail shells... even the human body. Phi was derived from the Fibonacci sequence - a progression famous not only because the sum of adjacent terms = the next term, but because    the quotients of adjacent terms possessed the property of approaching 1.618.\n\r\nA few examples: \r\n  In a honey bee community the female bees always outnumber the male bees. No matter what, in any beehive in the world if you divide the number of female bees by the male bees you always get 1.618... Phi. \r\nSea shells... the ratio of each spiral's diameter to the next = Phi.\r\nPine cone petals, leaf arrangement on plant stalks, insect segmentation... the human body. Phi, phi phi, oh! and, again..........phi..\n\r\nJust something for you all to think about.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nTo me, it is about living right here right now.  On a parabola, mathematically speaking, has one \"start\" point.  From there on, every single coorodinate on that parabola exist once, and only once.  There has never been a point/coord. like that one and there never will be again...like the individual moments of our lives...\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI agree with all who have stated that this song pertains to spiritual nature. To add to the comments a title tie-in that I have yet to see, a parabola as stated is a mathematical curve that has a U-shape. I believe this has quite a bit of significance in the song in a few different ways.\n\r\nThe first significance of it is to draw a comparison between the process the song describes in its entirety, the spirit taking a physical form. A parabola serves to represent this process, i.e. our spirit descends from the heavens, takes physical form eventually reaching a most solidified physical state, before again ascending to the heavens, essentially forming a parabolic curve.\n\r\nThe other potential significance of it stems from the first line: \"We barely remember who or what came before this precious moment\".\n\r\nI believe this to be in reference to our own first recognition of consciousness that typically occurs around the age of 4-6 yrs. of age. This \"awakening\" typically seems to be spontaneous, and we usually cannot truly remember anything before it. The word \"who\" in that line probably is in reference to a previous incarnation of your spirit.\n\r\nThe parabola shows represents the relationship between our spiritual presence in the physical world. The conception of consciousness occurs and we become generally more physically grounded over time reaching an apex before the process reverses as our spirit slowly leaves our body over time. In our old age our memory fades, our cognitive processes slow, etc... and the spiritualist belief is that this is caused by the spirit becoming tired of this world and trying to move elsewhere.\n\r\nThe last possible correlation I could draw between a parabola and the meaning of this song is our perception of time. It is said that the human perception of time speeds with age, which could be represented by half of a parabola. \n\r\nThat's my take, please continue to enjoy the fantastic works of Tool, whilst maintaining the search for further meaning as I'm sure more meaning than even what's listed here can be found in their lyrics. Maynard is a literal genius, both lyrically and intellectually and is a great example of a divergent thinker capable of inspiring divergent thought in others. Don't allow his influence to be dulled by the posits of text on the internet thinking that someone \"nailed\" the meaning. There could always be something more to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nIts a tool song which means it goes far beyond love and other bullshit. If you watch the video you can see through visual interpretation that it is refering to kundalini and chakra, more important towards the end focuses on the Sahasrara (or Crown Chakra). In Hindu (or similar beliefs) The Sahasrara is the highest point of awakening, to become a \"fool of god\" as some refer to it. When this point is reached it is said that that persons mental soul is beyond the realms of reality, while the physical body remains nothing remotely psychological does. When the song says \"this body holding me\", Refers to this because he is acknowledging that the body is merely a mode of transportation for the soul and mind. This entire statement is supported by the fact that in the song it says things like \"In this holy reality, in this holy experience\" also just in case anyone wants to call bullshit. this is the explanation we got from maynard backstage at a concert....\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nSACRED GEOMETRY IS THE SALVATION...\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nTo me, this song has always been about reincarnation. 'We barely remember who or what came before' - Carl Jung theorized the existence of a collective unconscious passed from generation to generation. It's comprised of general knowledge that all people instinctively know or feel without being able to place how they learned it. When a spirit is reborn, it loses its memory of its past life. But through the collective unconscious, the memories of our past come echoing back to us.\n\n'This pain is an illusion' - in the grand scheme of things, our pain is fleeting. What is agonizing to us today is gone in the blink of an eye. But we focus on our pain and suffering and build it up into more than it needs to be. We waste our fleeting experience of this life on the things that make us unhappy.\n\n'This body holding me reminds me of my own mortality' - our bodies won't last forever, and while we're inhabiting them, we're constantly reminded of our mortality. But in the end, we last forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\na parabola is a mathematical curve, a parable is a story illustrating a moral...\n\n\n", "comment_28": "\nTo me this is a huge reminder of love...\r\nEverything in this song gives me some sort of vision of love in the future and the past......\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThis song remindes me of UK Ozzfest 2001. Tool played Parabola and I was so happy. I could feel the emotion welling up in me and when Maynard sang 'Celebrate this chance to be alive and breathing\" it felt as if I had died and gone to heaven.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThe ending!! Oh, my God!! The low rumble!! Is it a bass guitar or is it one of Adam's effects pedals? Whatever it is, when I listen to it, it shakes me and I can feel it in my chest. I love it!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nhey harry! this is my interpretation as well, \r\nthis is what i have always thought the song was about.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nTo me, this song is about how, no matter how lonely we are, we aare never alone because we have ourselves. \"This body, this body holding me, be my reminder here that i am not alone\"\r\nPain is nothing more then an emotion, and emotions can be controlled. And all emotions are are elevtrical impulses sent through our brains. \"All this pain is an illusion\"\n\n\n\r\nBut thats just what i think.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nHey HarryManback, the low rumble at the end is just the guitar with distortion, because the song uses an BEDGBE tuning it sounds like an evil rumble. Yeah this song is about sex too... \t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nfirst off i think the album lateralus has something to do with evolving into the Christ Consciousness or the 3rd level of Consciousness. this is beautifuly displayed in the new video for parabola. at the end it shows a guy with three eyes... anyways thats what i think...\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThis song is about so much more than some mere sexual encounter... it's about realizing that you are more than just a physical being, that you have a soul that is capable of reaching a higher form of enlightenment.\n\r\nOf course, that's just my $.02\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nI can really identify with Deminois.  This was the first Tool album I picked up when I was going trough some tough changes in my life.  This song was one of the many songs from various artists that gave me a reason to live when I listened to it.\n\r\nHarry Manback, I really like your interpretation.  I didn't know that Maynard had a son and now that I do, I can see that your interpretation fits in well.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nhmm...could be love, hate, out of body experiences, death, or all of it put together.  i think its about life and/or the afterlife\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nthis video is fucking crazy...specially the part where those three freaky things are puking on the table...the end is cool cause it has the chakras opening up and the energy becoming infinite...\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nAll there videos are crazy but nothing beats the stinkfist video. Adam was undoubtably tweaking when he thought up that video.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThis song is perhaps about drugs, The addict is together with the drug, they are 'one'. We barely remember who or what came before this precious moment. \n\r\nFeeling eternal, all this \r\nPain is an illusion \r\nHe can take verything on, even when it hurts, the same what happens when you are on drugs(( I know, I'm Dutch :P)) You don't feel the pain until after you are sober again,\r\nand what is becomming of this person is his own morality.\n\n\n", "comment_41": "\nThis is such a bueatifull song.  Parabola is a shape with one point of infelction (turns around once), like x^2 possible meaning that we are most alive in the middle and fading away into infinity on both ends birth, death.  \"  We barely remember who or what came before this precious moment \"  I think this line refers to the time before the big bang, and we will never know what was before that.  It also could refer to the universe cylcing over and over, big bang-30billion years-big crunch. Thus we are alive infinatly many times each time not remembering the last time we were alive.  I have said it before but I think tool is a gift from above, some thing that we should cherish, in a world full of hatred and sin, Tool is there for use to comtemplate and put things into perspective.\n\n\n", "comment_42": "\ni think the song is saying life is precious. And that we shoudlnt waste our lives dwelling on where we came from. Like for instance when people think of god questions come up like \"well who created god?\" and stuff like that and this song is saying dont worry about shit like that and dont waste your entire life living for something that probably doesn't even exist and just enjoy life.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI think this song is about the birth of a child. The pain he talks about is the pain that his wife encounters in the birth and how this is a gift (not the pain, the birth:). He is now eternal as his \"legacy\" will live on. He will be alive but not in the form or state he is in now, but as a part of his grandchildrens to come. He is also singing to his child, that he or she should be thankful for being alive and cherish this moment, moment of being alive and breathing.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nReverend chris, we are on the same wavelength my friend.  The only difference is that I believe in God, but what difference does that make really?\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nWhat the hell r u people talking about, this shit gives me a headache when I read it.  Oh and one more thing, who gives a shit how people pronounce parabola.  It's kind of like Aenima, people will say it however they want.  Let it be.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThis song is about becoming narcissistic and breaking all ties with the relevance of your actions through logic or religion, cos when you become like that pain is no longer a concern to you, emotion is no longer relevant, and its only the body thatâ\u0080\u0099s holding you back from becoming god like and immortal, so yer, to me, itâ\u0080\u0099s a call to suicide and an escape from the over whelming pressure of life, and making your self feel good about it by dressing it up as logical or of holly importantance. films like pi and maybe even fight club are coming across on similar linesâ\u0080¦and the fantastic video portrays this also, the guy smashing the cornerstone that swings about like a pendulum, smashing it and bring down the piecesâ\u0080¦this album, just ties in and is just amazing, -- wish I was in that crowd, fucking arty geniuses. \t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI believe this song means that this persons life was going to shambles whether it be drugs, alcohol, or death. The person realized that there was more to life than this and found church and realized how important home was. The person got off what was wrong and went back to what was important his/her family. This song his far from being about sex. The chorus \" This body, this body holding me be my reminder that I am not alone.\" means that someone is telling him he important and shouldn't ruin himself over something that can be fixed.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nMy interpritation- one of the 'this songs about sex' interpretations.  Sex and Parenting\n\r\nOK, first lets get in the right mind set, and wash all those nighty Pr0n pics out of your mind that we associate sex with.  That is not the intintion of the song.  Now, think of sex as what our mommies and daddies told us it is, a sign of love. Alrighty, now that that is set aside, on with the proof!\n\r\nThe first examples starts out with \"We are choosing to be here right now, hold on, stay inside\"\r\n-2 mutally loving to-be parents must want to be there.  They love eachother immensly, so they decicde to continue.\n\r\nNext- \"This holy reality \r\nThis holy experience, choosing to be here in \"\r\nThis line talks about how holy and great sex is, and how buetiful it is, and how it is only holy and wonderful if the 2 people want to do it.\n\r\n\"This body \r\nThis body holding me \r\nBe my reminder here that \r\nI am not alone \"\r\nI saw someone said that 'this body' is refering to the singer.  I beg to differ:  This body, this body holding me (the second line is very important!)  The singer is refering to his partner's body, that is holding and loving him.  This connection, this mutual acceftion reminds him that he is not alone.\n\r\n\"Feeling eternal, all this \r\nPain is an illusion \"-  That is hard for me to use on this interpritation, but i guess it might be refering to the climax?\n\r\nThen possibly, \r\nThe 2nd to last paragraph, like some other have said, refers to the child, and spending time with him/her.\n\r\nThe last one is probally refering to a hug with the child, and 'this body' this this child, and finally embrace life, and remeber that we are etrnal in memories.  \n\r\nnot a bad song, once i started to think about it, i liked it a lot more ^_^...\n\n\n", "comment_49": "\nwhat the fuck is this shit?^  Are these even real people talking?\r\nYo, kill me killroy, I think you're trying too hard to relate stuff together.  I really hope you're not suiciadal, that is definitely not what the song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nerm...no comment.          ok, the lyrics dont express the suicideee bit that much, but when you put the music and the vid to them they certaintly do portray lfting your self out of this reality through using things like religion - holly experience, logic - math and the parabolla thing, and yer even sex - and this song is definatly talking about those things in an exteme sense, and a way people follow these is through self distruction and suicde....     no? \t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nWhen has a tool song ever really had just one meaning, but i'd like to thank harry for posting about his son, that put a whole new twist on the song for me, it think it really is about him on one level, but I belive maynard was also making parrallels to the conception and birth of our own spirituality, and perhaps the birht of his own spirituality. this song is so obviusly about birth, it seems a shame that so may people have associated it with death...\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\none more thing why does a person have to go to church to frind spirtuality?, I THINK NOT!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nha. just watched the film 'pi' again, seriously, that film and this songNvid r so much on the same line, right down to the whole math spiral thing - everyone should watch it. ---right now!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nYou may be right kill me killroy, but I don't think that it's through self destruction and suicide.\r\n\"choosing to be here in \n\r\nThis body \r\nThis body holding me \r\nBe my reminder here that \r\nI am not alone in \r\nThis body \r\nThis body holding me \r\nFeeling eternal, all this \r\nPain is an illusion \n\r\nAlive!\"\r\nIt's all right there.  He's saying that he's choosing to stay here in this reality, but he knows that there's more after he dies.  Therefore any pain he experiences in his life really doesn't affect him because this pain is temporary like this body.  And I think that when he says \"This body holding me, Be my reminder here that, I am not alone in, This body\" I think he is simply saying that others are stuck here in their bodies too and many other people have thought of suicide but decided against it, so they are just like him.\n\r\n\"In this holy reality, In this holy experience\"  This is just refering to life on this planet.  It's a holy experience because a higher power or order has chosen this experience for the human mind to experience bodily sensation and emotions.  Maybe we have to live through this reality so that our mind or soul can appreciate the next step.  If you jump the gun and decide to kill yourself who knows what will happen, maybe your mind will simply dissipate because it was not ready to die, or maybe you will be reincarnated and have to start life all over.  I guess I've gotten a little off the topic but I have a tendancy to ramble when I write.  So anyway, I don't think that self destruction or suicide will answer anything in this life.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI cannot be alone, even when I desired it and did all to my reach to achieve it, but the truth is that I need to the world although be only for sour my life. \t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nhow does everyone get so many different meanings? i mean ok ill honestly admit im not a tool fan (im just waiting for the rude remarks that will follow)...but how can everyone find such deep meanings from every one of his songs? i mean theres no doubt in my mind that he must be a lyrical genius...but (i duno where im getting at)....i mean how do you get all these mathematical formulas and shit from his songs? and i could tell this was a tool song just by how long the comments from this song were...ok well i guess if anyone can give me some insight on tool explain..or something!\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\n sound like  two people are about 2 fuck but u know how maynard is he takes a moment into change and brings out  to the world  something that was nothing before\n\n\n", "comment_58": "\nin respose to you kira...Tool inspires their fans to think, i've heard Adam Jones  talk about this in an interview.\n\r\n\"the thing that I've found out, most people don't \r\nlike to think and I'm one that, I like to be stimulated, and like to think \r\nand like to get my mind open and whatever can do that, I'll do\"\n\r\nThats what Adam has to say about the matter. One of Tool's main objective (in my opinion) is to make people think, and be open minded and willing to suggestion, and they do that. When they first came out, they were very literal, and it seems, after Justin Chancellor took over on bass duties, Tool as a band got alot deeper in their music. Songs like \"H.\" and Forty-Six & 2  from the album Ã\u0086nima are incredible and mindblowing (you should read under their titles for meanings on them), Especially the closing track \"Third Eye.\" That song is the very song that inspired the rest of my life, I've changed so much since i first heard it. And now this song,Parabol(a), is to me the Third Eye of Lateralus. It really opened me up (brought me to tears a couple of times and i'm not ashamed to say it). It's just I guess their music touches a lot of people very deeply and spiritually. And its not for all people, in my opinion is over most peoples head, like the people who say Lateralus is their worst album, well to me it is their best work musically and lyrically, and i feel that it was over most of the fans heads. And the mathematical formulas come from the the fact that we want to learn what these songs are about. It's kinda hard to explain I've been rambling on for quite sometime and I probably haven't answered your question. I hope I helped give you a little insight as to why us Tool fans think so highly of their work and how we find such deep emotion in their lyrics.\n\n\n", "comment_59": "\nthank you thank you thank you! that was perfect...all i needed to hear..i just think its so interesting how their lyrics spark so much..thought! from other people\r\nthank you!\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI'd totally agree reverand...\n\r\nDuring Sept. 11th I listened to this song non-stop ... It kinda felt related in a way, I've never been too sure on all it's meaning. \r\nBut one EXTREMELY powerful thing I've found about it, is the fact that I'm not a religious person - I try not to follow anything, just live for myself. But this song always makes me feel ... almost humble, that I am a human - a beautiful creature put on this earth, and I have to look past the bad things, and I have to Celebrate this chance to be, alive and breathing .... There is always someone worse off than you in some way or another.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\n^^quickly back on to what this songs about...i know where your coming from joshthack, and i guess it comes down to your own emotions being put into it.. i still think this song is about someone elevating himself by learning, studying-ect.. into the point of removing himself from the body.. holding him. but the word \"celebrate\" from \"celebrate this chance to be alive and breathing\" does suggest otherwise i know...but eek. Like I said just goes on what your feeling. \n\r\ntool are definitely a band that invites their listeners to think, explore, find answers and more importantly questions from their songs...hence all these long postssssss. fantastic band that have been one of a few that have kept music as art, rather than product or style or i suppose as just something to have fun with. \n\r\nLateralus is by far their best album--their first was great, and then second and third just got better until they reached this level! and if you listen to them one after the other you can just hear the progression that they make both musically and lyrically. although, i dont recommend listening to them like that-----------dont think that much tool would do anyone much good..........\n\n\n", "comment_62": "\nWhy does everyone keep saying that this group sings about September 11............My take on it is that it's all because some stupid kid goes out and buys one of there cds and posts something about how they sing about September 11th. Anyone think different?\r\nFor all the true Tool fans they will understand me.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nopiatetoolfreak, no one is saying that they sing about september 11th, because this album came out before that happened\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\noh, kill me killroy, i agree with you on that point, but I think that self destruction or suicide is the complete opposite direction of Tool's message in this album.\n\r\nAnd hells yeah this is their greatest album yet\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nAt which point did I say it was about Sept the 11th ?\n\r\nIt was my fave. Song at the time, and I felt I could relate the event to some of the lyrics. But my opinion could apply to a lot of things.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nHey i actually made sense....wow. I usually confuse the hell out of people. Good thing im amongst tool fans who understand what the fuck im talking about. BTW does anyone know a website where i can download the video for Schism from? It's the only video i do not have and kazaa is being an asshole to me (so is morpheus) and i was just wondering if i can download it from somewhere else?\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nhey rev. try a programme called winmx - i got my tool vidoes from there- winmx.com - its like morpheus. but better .\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\ntry antipopvideos.com  or  nothingvideos.com\n\r\nthey rotate a bunch of videos every few days, and i've downloaded sober, schism and parabola from those sites\n\n\n\n", "comment_69": "\nI really like the video of parabola. The first part is probably about meterialism, the ending being those \"capitalists\" vommiting their money (potrayed byt sh*t) . Which is not the real way of evolving, of living, money is an illusion. Then the other part shows the way of living your life. Trying to understand, to think. When the \"little man\" gets killed, the man does an autopsy and seems to understand something, to accept his relality and acceptes to be alive. Then he goes down and takes a leaf and here comes the awesome CGI. There I think it show the man \"Opening his third eye\", pushing our thereshold to a new limit, and in the end using his mind at 100%, becoming energy, being in harmony with everyone. That's just my 2 cents. This song is simply mind-blowing, I'm still loving everysecond of it after 1 year of intense listening.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\ni dont' know if this helps but i read a interview between maynard and a college professor and maynard talks about parabola...heres some of it.....\n\r\n9. In \"Parabola\" you speak about the body as a type of vessel. And you state that we need to hold on to and stay inside this holy reality. In contrast to your attacks on Christianity, how should we interpret the use of the term 'holy', here? \r\nMK: \"Life is to be revered. Few people take the time to realize how valuable their experiences are at any given time in their lives because we can be snuffed out in the next minute\".\r\nMK: \"Life should be revered simply for the fact that we need to be thankful that we are currently able to consciously appreciate what we are going through right now. There are layers to our lives which can be appreciated at various levels. This moment that we're having right now is highly significant.\"\n\r\nFrom this, I state that the feeling of eternity and reference to pain as an illusion in 'Paraboloa' is interesting. Is this tongue-in-cheek or is the meaning here literal? \r\nMK: \"Having a background in science, anyone will tell you that everything pretty much is light. Form and frequency, quantum physics and the fact that humans are made up of bits of matter (light), at this level, particles neither come into nor go out of existence, and at that level we are eternal. And although pain operates at one level, there is no pain at the underlying level of matter. People operate at different levels. Does that make any sense? These are huge, lofty spiritual concepts. Keith Richards is still walking around, doesn't that prove something?\"\n\r\ni hope this helps in finding the meaning of parabola......\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nWell im too tired to get into how deep Tool comes across lyrically, so im just gonna say that this song kicks ass and that the guitar riff at the end is sick. \r\nThats my 2 cents \t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nAwesome song..\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nawesome song in concert!! couldnt compliment the song any better...they out did themselves on this one...amazing song\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nWhy don't we look into the music video for some answers:\n\r\nFor example, at the end of the video we see the man turning into energy and then his third eye is opened. (Remember what Bill Hicks says at the beggining of Third Eye on Ã\u0086nima about young men on acid).\r\nOther things that were in the video were that little man being torn apart by the man. And don't forget the men at the begining that cut the apple in half and there was a Star of David in the middle of the apple.\n\r\nMaybe there are good some answers or meaning that can be found in the video......\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nkroche14 has some good points. By watching the video, you'll just get more confused (as with all TOOL videos) but the video for Parabola is actually a little easier to decipher than most of the others. Well it is to me at least. \n\r\nYou see i have this theory that some TOOL songs have been inspired someway by the work of Carl Jung and other thinkers. In Jung's middle age he began reading Gnostic texts and myself being influenced/guided by Jung (some would say i have no idea what to think, so i am hearded towards Jung, Frued, Nietsche, Goethe ect. like the sheep i am) So i began to read some stuff on Gnosticism.\n\r\nThe first book i read gave a brief overview of what Gnosticism is and all that and my small understanding goes like this: \n\r\nWe are all here on this Earth not because it is God's will, but because we are God's mistake (no, i'm not a religeous freak before you ask). Inside everyone there lies two spiritual beings, one male one female. This is a reference back to Jung's work on the Anima and Animus. When we have achieved Gnosis (knowledge), our spirits emerge from our bodies (\"This body holding me\") and ascend to a higher plain of being. This belief system doesn't need a church, or a priest, or anything else that can fall victim to dogma, and that is why Gnosticism is such a little known religeon.\n\r\nSo i think the last part of the clip is a mention of Gnosticism. Two beings (the eyes, one pink one blue) travel throughout the body and reach the chest where the spirit is released. The body eventualy disintergrates and becomes a bright white glowing sphere.\n\r\nBut the rest of the clip still has me stumped. especially the Parabol start with the three guys and the black vomit. And the Star of David really throws up some new stuff in there. I don't think anyone will ever decipher any tool song/clip...except for 'hush' maybe. But the video clip can bring in another dimension of confusion for fans...thanks again Maynard, like you havn't screwed with our heads enough already\n\n\n", "comment_76": "\nI'm willing to bet large sums of cash that Harry has came listening to TOOL.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI'm willing to bet large sums of cash that Harry has came listening to TOOL.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nyou guys are all idiots this song is obviously about appreciating and acknowledging the fact that we are alive, and that we are not alone in this world, wheather you are refering to other humans, or other unknown beings. all you have to do is read the lyrics to get that\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nOn the song side of things, cherishing life and all of that that's been said already basically sums that up. You can read the posts before mine and get a good conception of what I mean.\n\r\nFor the video side of things, I didn't get a damn thing until I read something referenced at Toolband.com, which speaks of Nibiru, this celestial body deal that's supposed to smack into Earth sometime in 2003. After I looked up a website on the matter, and got to linking around, I read ALOT of things that were referenced in the video. Such as...\n\r\nThe blue apple: Read the thing about Nibiru, kinda long to explain here.\n\r\nThe star in said blue apple: Watch as they zoom up to it... it goes from five-pointed, to six, then to seven. I believe this to reference sacred geometry and numerics... like, 666 is the number of man and imperfection, 777 is perfection, etc. etc.\n\r\nSuited dudes puking: When the screen goes black, the hands grab each side of the circle and turn it inside-out... tada, seven-pointed star!\n\r\nThe two eye flames: More Nibiru referencing.\n\r\n...I really don't know if any of this stuff is really referenced like I'm stating here, but I didn't understand anything in this video at all until I read all the stuff I've mentioned here; now the video kinda serves as a warning of the Nibiru deal, and the song helps to give optimism and relief to those that understand and will be kinda spooked out... \"we are eternal, all this pain is an illusion.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nHere's the link to everything I read, by the way.\n\ncrystalinks.com/…\n\n\n", "comment_81": "\nto me its just about finding someone you truly care about and love and how it feels to just spend time with this person. when this person (body) holds you all your pain turns to illusion and you feel eternal. just my 2 cents. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nyou ready for this one??? its about and orgasm.... i know i seems crazy but think about it...\n\r\n\"this body holding me\" (meaning the orgasm) \"makes me feel eternal\"(meaning that in that split second of bliss, you are free..almost liek time stops and you are eternall, immortal even if its only for that split second..) finally \"all this pain is an illusion\" (all of this crap we must deal with is not really there.. it is a mere image and there must be somethign out there.. something worth dealing with all of this pain and bullshit...\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\n[ cdicarlo.com/… ]\n\r\nInterview with Maynard James Keenan (October 31, 2001)\n\r\nQuestioner: In \"Parabola\" you speak about the body as a type of vessel. And you state that we need to hold on to and stay inside this holy reality. In contrast to your attacks on Christianity, how should we interpret the use of the term 'holy', here? \n\r\nMaynard: \"Life is to be revered. Few people take the time to realize how valuable their experiences are at any given time in their lives because we can be snuffed out in the next minute\".\n\r\n[Although some may take this to be a paraphrase of the 'Stop and smell the flowers' bit of flaky advice from the sixties, the central message is a good one because it demands of us the discipline by which to forcibly become self-aware of what is meaningful and essential to life. We do take things for granted, without doubt. Most of the time, we are caught up in the superficial trappings of cultural inventions. But to be alive, and to know it, is one of the first great cognitive evolutionary steps in the development of human consciousness] \n\r\nMaynard: \"Life should be revered simply for the fact that we need to be thankful that we are currently able to consciously appreciate what we are going through right now. There are layers to our lives which can be appreciated at various levels. This moment that we're having right now is highly significant.\"\n\r\n[At this point I mention Albert Schweitzer's book Reverence for Life where he mentions that some things are necessary in life. There are constraints on life and we have to function within those constraints. I referred to the lyrics in 'Disgustipated' where Maynard mentions that 'Life feeds on life'. This is an obvious biological truism which creates an environment of constraints in which we must live.]\n\r\nQuestioner: From this, I state that the feeling of eternity and reference to pain as an illusion in 'Parabola' is interesting. Is this tongue-in-cheek or is the meaning here literal? \n\r\nMaynard: \"Having a background in science, anyone will tell you that everything pretty much is light. Form and frequency, quantum physics and the fact that humans are made up of bits of matter (light), at this level, particles neither come into nor go out of existence, and at that level we are eternal. And although pain operates at one level, there is no pain at the underlying level of matter. People operate at different levels. Does that make any sense? These are huge, lofty spiritual concepts...\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nManyard says its about his son somewhere. Not about things you guys are saying.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThe video has nothing to do with the lyrics. Maynard wrote the lyrics. Adam did the video.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI agree MAJD.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\ndo Tools videos ever make sense? hehe\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nMost of the time no. But, occasionaly do.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nthis song to me tells people to be happy in life and welcome the chance to be alive and breathing.life is not a punishment, it is a gift to be grateful for.and that all the pain of life will heal and be gone in the afterlife.which leads me to believe that they do have some sort of religion because atheists dont belive in the after life.nevertheless, this song is beautiful.   \n\r\noh and i think the name parabola represents a positive parabola: at first life is happy and gradually more and  more pain builds. and the bottom of the parabola is death.and everything is better in the end.                                                                                  \t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nq as to whether the circumcisors' tools make sense\nwebmagician.com/pubservice/…\r\nlooking at the #s it might seem MAJD was reimpersonating himself, an ignorant pie ce of, and will assume so sure it means nothing just since he;s an igbn korant piece of satan..  they all make infinite amounts of sense, majd is the type who would, forget ghis dreams and not know anything, to symboloize it even iof he remembered..  and then greensaint, saint you call yourself, come with statements of truth, do not ask ignornt ahits of your dumbass dsaracsascms\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nthen lateranus sais positive  parabola about pain, remember to tell them not to treat their foreskin like crap.. in the higher order of consciousness, paun being an illusions, due to good food, clean environment, healthy even featih healiong standards, hmm.. somehow that would actually be the anti of the leads to people hurting each other, therefore it all rounds about into this equation..\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nso as greensaint or who apparently, revealed maynards this tool dude's I guess that is quotes on it, saying life needs to be reversxsed..  that examples in video a, seeming dividing black ball, cells, they say divide, is need be reversed, they like to be artists hoping your adced anbgles of perspective will continue to enlughten them, this retroactive process then becomes more of the star ptretense, as needing to be reveresed, reversed as greensaint said maynards said, if that's what it said up there, now, therefore of a Universal perspective, not insane of say the first cell, if the ackowledgement of a cell divided, devoided it awareness of one cell to the next, if they would pretend foreskin a cancerlike malgrowth, of their plane it gets cancer them...  beyond judgement seperating, to say your cells uppower of the same organism, therefore tell them to pay such science aeawarfsds $ like bowie oifif I donlt attend still sending, 10k+ to Jove W., PO Box 51, Lakebay WA  98349  songmeanings.net/…\n\n\n", "comment_93": "\nhey tada123 i meant that the videos dont always go along with the songs. And yes they do make sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nHey tada123 i meant that the videos dont always go along with the songs.And most of them do make sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nTada are you sure you passed 1st grade. You can't spell his. Your igbn korant, oops i meant ignorant, my mistake thats how you spell it.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nfunny as the time flies/d/r, but now, anyhow\r\nI'm always practicing to type faster, and this place has not paid me yet, as if that was requested for me ti type cofrrectly as you thought, besides that, and typ. they make sense in goign align w/the songs.  . furthermore you don;t know, how or else, monkey cutting circumcising savagaes.. make any sense to your fucked up school system,s.,. so shut schuer stupid monkey anuds dumb ass,, later then\n\n\n", "comment_97": "\nBe my reminder here that \r\nI am not alone in \r\nThis body \r\nThis body holding me \r\nFeeling eternal, all this \r\n ~so.. how this, words associated w/video, could say these, could have drifted enough thought to say this, so the reminder word, say the cideo director,  ivideo bit you must instead, trecognize that and underrstand what the c meant, reminder what body holding, a person recognized as the black fellow working, in a cubical ina  cubical.. aside that was black ball, to black ball, upoppower well it oil not good that way, divide it nailed the white dude, the eternal was seen at the video end by ascension, atomic realization fo fsuch light bulb ideology.. if you tap into enough info,. such that is from the Universe, abouinding, then you may cpontrol the Earth.. but you m,ay need 10k 1st like Jove does.. Jove had to slightly stype slowly just sdo such and such see correctly, every lLord letter in a row, somebody;s bin quite ignorant, Jove called the fbi to hire him as  a psychic spy..   (she sounded excvited a bit, wanting more info, without the ideology how good to pay me first.. you must not be poor you must make Earth good and hire the ytoertrorist, ie criminals before they would be that..  uh oh ciurcumcisors alwayready a criminal and it be fucked, Jove will overrule hehehahhaa,..) Jov eis paraskitzo, w/a  bbb..b.b.b.b   betetr this or that but b etter think what I don;t think ius there, or bomb is in your negatie terms, ythe bomb movie, the billion dollars blockbusdter, part 1, the Gov may want it not, the Gov mnay get tio pay Jove what HJJove would will have be makin from the public... Jove is very realiosticly futuristi c..  Jove willa dvance your (w)hole economky, instead iof lee you see a key, that becomes WAVE to MIDI,, that is just omn eof the ways that of the atomic music maker.. not quite here yet hear yet uhowe...  it;s like I wernt back in time and dso gotta ghet ahead and rule over all that $, Joce did apply patently,  as so buy it all H ER will control ythe msuiic business industry..  qieiwithotu Jove;s rational on concious, governing suich inflow into the new mmusic biz industree.,., it is any devil;s thing  webmagician.com/pubservice/… the chainsaw massacre, voided by ioyour circumcison oir not, at beg,. of eveery mtv brand spanking new video, hear thgat and see brand spankin' abotu a baby why terminology.. pdrhaps voided ion your ignorance, thou will be sueworhty, physuically and/or emotionally\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\n\"you shut your mouth, hoe can you say, I go about things the wrong way..\"  songmeanings.net/… , k now after wouldjeu be so sttomp E it mushed it for me, it could get stupid on purpose more.. you like me talk fasdte rheyu id fats righo ftatdjer jheitioug ago go  gfaster trya crasher, dosnmarket circumcisive relaztivity..  you though tyiyu hadf forsigh tbaou oyur stock? jmhmh.//.. lucjkiliy Jiove weioll maniopouktaelt etiouyyoyr stock market, stalk mark it? not so ttrade Jove will act.jewelly bust up the (w)hole business, of Jove has President Jordan it will be after Jove has explained to him taking it to th ehole, songmeanings.net/… lol that is classical,  now if you can cont. your imaginat. further than trying letting forgetful, their knowledge hadf stayed stcuck awhile,. crock owe dile by the nile, all such needs an H flush, and it is not nec. such -ity, I couldn;t put it like thta unless and e, I might as wlel stick it uop E it matters to me, I liek that word, aids and E should no tbe drug and disease or backlwards.. Jove iwll refine all things to lOrd' smlemeanings agagagaagain\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nOH MY GOD. WHAT THE HELL ARE YOU GUYS TALKING ABOUT? YOU MAKE NO SENSE AND YOU CANT SPEAK ENGLISH. WHAT THE FUCK.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nok, its simply that who we are is a spirit.  unless you believe in reincarnation, it makes perfect sense.  our body carries out spirit.  we are created by god and we only get one chance to be mortal, so live life to its full extent.  spirits are enternal.  unless you've used your chance are being mortal horriblely, you will end up in heaven where there is no pain.  the longest you will suffer pain is a single lifetime so compared to eternity, a lifetime is nothing.  you only get the one chance, don't let pain stand in your way from feeling 'alive'.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\ni think the theme of this album is all about accepting life the way it is and finding positive things in it ! this song and lateralus,according to me,is maynard thinkin' about his death...so he doesn't want to waste his life over hate,envy,regret and that sorta things....hes askin' everyone to find gud rather than bad in life.......awesome song...tool rox !\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nHitler's parabolic stance you m,ight see low, low as them stranger white oil families, Jove will have tik overurel and refien all mattetr\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nDiab shut your ignorsnt vain, asking your ignorsant god who you cannot oyurself answer, and you gforgot a conttraction and puyt lal caps and forgot a question  mark at the end, politics has yet to show aspiration to such ytiyields of a potential parabola, before knowledge the imagination may need faith, then by pouring on onslaught of rewlative evidence, relative may be spelt rewlative if they are yet to behave relative, Jovcve will have to teahc much inc. decoding dyslexicised englished\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nthe thing i s those white oil families, tend to think of themselves as christian,and don't judge themselves for their polluting ways, they say CLeanliness it sais what wrote is next to Godliness, ethnic or is next to:\r\nA~ Hydrogen\r\nB~ White man's oil runs\r\nC~ Circumcision\r\n  seeing as their culty religion have no sensibility absolute for which by which is, the A can get brought down wrong on you  also, true but bad, athnicly speaking and, the suptpided american where else press uses Hitler yterms and, talks about a stupid shithole pope's travels meanign nothing webmagician.com/pubservice/… senile now but naive since, Jove, you may read the agreement that circumcision is of worst molestation, whatever romans wstill cutting anavcting as if the same shit, so that shit remains such shit for peopel to go and do that shit, so whata botuy them who thought to but didn't do it.. beheaded,.. begotten son, bewrae of the crucifiers' trickery of the worldly chsitians, as if thre execution was God's intention, actually you wreere are ot follow the $ aequatred your will in followwing masgter will rule over youy, no opposites about it exceopt for the cirvcumcisor\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nWe are evolution, airyn and in God's image\r\nThere is fusion, but they were versus\r\nThey are boring in their ignorance of interest\r\nThe truth is utterly fantastic, and ironic\r\n &Eye meant airy&*, though filthy racially mistook end\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nact, we will cons. the plur. for roman as romen, sorta like women, rath. act.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nplurraly women sounds like wimin\r\nso romen to sound rim in, whichj is a homosexual term, perhaps someone might htink they need an anel or anal circumcision, so nothign for the circumcisoopn\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nI think if you look at the curve of the parabola, this song simply shows that all that you build within your life will be what you reap.  The higher the mountain you climb, the faster and easier it will be to come down off of it.  That at the \"precious moment\" signified at the top of the parabola, all the pain, sacrifices, and sorrows in a person's life is merely an illusion.  When you are with someone you love so much, knowing that the person will be there for you, all that you have struggled for is easily forgotten in the tides of time.\n\r\nSo climb that steep hill and try your best because the day will come when you can wipe your brow and release all that pain and suffering, knowing that you have worked so hard to be the best you can... and that happiness is irreplaceable.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nHey all you tool fans come check out the band George W. Bush ii created i am sure you will like the lyrics.  Come check it out it is not a conservative propaganda board i am not praining George W. in any way they are lyrics that make u think.  Please check it out and tell everybody youll have a laugh at the least and youll think about something deeply at the most.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nto me this song tells me to look deeper than the skin, and just generally be greatful for what, and who I am no matter about my flaws.\n\r\nIt sends a message saying that our bodies are just vehicles in which our minds/spritis travel, and our minds/spirits are the real person in side us, not the clothes we wear or the good/bad looks we have.\n\r\n\"All this pain is an illusion\" i'd say that's one of the most important lines in the song, this is a great thing to think about, because if it's not our beliefs, or souls being damged, merely a scraped near, why dwell on it ? Why make a fuss ? Just live life to the full and realise that we're lucky to be alive and breathing. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nAbraxas, I also think that various Tool work has been based on the theories of Carl Jung. Harry Manback, I like your interpretation also; a lot of that could apply. But I agree with the person that said \"what does 'this body holding me' have to do with his son\" too. For me this song is about appreciating the life you are given. I read somewhere that Maynard said \"holy\" didn't mean a gift from God, just something to be respected. I take this to mean, respect life, concentrate on the moment you are in, and remember that we are mortal. We don't remember what came before this life because we were not conscious, so we should fully embrace what we are given because every experience throughout life is a gift.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nthis song means that  we choose to be in our body or \"mortal form\" and that no one remembers what it was like before life now and when people say they are hurt thats just what they're mind is telling them so that's what happens...\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nIn relation to what Vanov said about Nibiru (the celestial body) that is supposed to\"smack\" into eather next year... Well its not going to \"smack\" as such, but will come close enough to cause earths poles to shift. Meaning there will be a new North and south pole. If you reasearch this stuff, you will find all the meanings to tools songs...\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nif all you people wold like to stop gessing now, and open your third eye to see what the song is REALLY about, ill tell you. This song was written purely about Astral Projection.  It is a meditation technique used to have your soul leave your body and project itself into the astral world, and awa from the physical world. One of the pre-projection techiniques requests you to relax 100%, and feel the energy flow up through your feet, and pass all the chakra's, until it reaches your head, then you will be able to leave your physical self. The chakras are loated betwwen the genitals and the anal, right below the belly button, about 5 inches above the belly button, next to the heart, in the throat, and, the most important chakra, is the Third Eye, which is the chakra that you can actually feel open wide and feel yourself become more creative and origianal. As you feel the energy flowing through you, as it passes each chakra, you must feel the chakra open up and release more energy, to add as it flows upward through your body, when the third eye opens, all your energy is released at the final chakra, on the top of your head. This song is about wanting to be able to stay in the astral dimension, and not to return to the phyisical, by seeing that after we die, we go to astral, and we are eternal, all this pain is an illusion, i am not alone in this body holding me. pry open your third eye.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nI agree with whiteout completly.  i know everybody is entitled to their opinion but some of your opinions about sex and his son are just kinda out of it.  astral fits this song completly...and parabol too in that matter. open your third eye people and completly understand tool.\nastralvoyage.com\n\n\n", "comment_116": "\ni dont know if any of you have ever eaten shrooms. but if you do, and i mean a good bit, and you have one of those introspective trips...you're basically living in this songs. you just feel like you're existing in the time before you were born. just sitting there with your soul and the truth. eat some shrooms and you'll know what the hell im talking about, and what maynard's talking about too. and please dont yell at my post unless you've tried it.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\namazing song! as are all tool songs. i really like this song alot! one of tools best (if its even possible to pick a \"best\", since every single one of tool's songs are great) any way incase you didnt know a parabola is a math figure shall we say that is symetrical and kinda looks like a U. anyway since its symetrical both sides are equal. i think this song is about having 2 parts to your life. the life with your body, and the other life being your spiritual life. the line \"Feeling eternal, all this Pain is an illusion\" i think maynard (the king) is trying to say that in the end we are all eternal and the pain that we feel in life isnt really real because it will soon go away and we will have no pain. anyway thats just my take on the song and i know everyone has there own interpritation. so if you agree with what i just said then awsome but if you dont thats fine too. later. long live tool! \n\n\n", "comment_118": "\nAll of you may find this interesting...the origin of the song title...which we all know by now has much to do with the meaning of each TOOL song.  Think.  TOOL cleverly imposed several literary devices in the title alone.  Instead of using the word \"parable,\" they used the word \"parabol,\" which is the precursor to the fully spelled word \"parabola.\"  This is TOOL pointing to the melodic flow of the prologue, \"parabol,\" transitioning into the crux of their message \"parabola,\" demonstrating that, in fact, these are one in the same song on two different tracks.  Yet, these tracks are seperated for the reason of illustrating a radical difference in time and space, much like the process of being reborn, but not in a physical sense, of course (spiritually--and not a religious spirituality either, but rather, a spirituality which purely reflects the essence and innocence of a child, never taking for granted every precious moment that he experiences.  This, in itself, becomes a religion, the unadulterated morality and justice of a child's viewpoint, not influenced by the world and its shortcomings, but by unconditional love and respect for all things good and a naivete of those things not worthy of recognizing in the first place).  This allusion to rebirth helps us recognize that who and where we are in life right now is not so bad.  We have the ability to change for the better at all times and to look to the brighter.  We have the opportunity to never take for granted every passing moment.  We have to the chance to turn our grudges into gold, to learn from them while letting them go and being forgiving.  We can know, once again, what it's like to be like a child, light and innocent.  We need to feed our will to feel our moment, which is right now.  Now is the moment to turn things around.  Your reality is a holy reality, if only you can recognize this.  Your life is good, no matter how bad it is.  Just the fact that you're alive should be enough.  TOOL weaves this message into the song title with their choice of diction.  The full name of the complete song is parabol parabola, or \"parable parabola.\"  A parable is a fable, a short story or song meant to teach a moral or lesson, but with a twist that forces the listener think.  This twist takes something apparently obvious and turns it on its head, demonstrating that what's just, or right, is not always so obvious after all.  A parabola is half of an elipse, most commonly perceived as a U-shaped figure, or horseshoe-looking shape.  A parable parabola is a parable which illustrates that while you may think life centers itself around the lows like a U-shaped figure does, life actually centers itself around the ups and the highs (the good things) like an inverted U-shaped figure would reveal, a paramount or pinacle.  The action of turning the pabola on its head to illustrate this point perfectly demonstrates the underlying theme of the song, that life is not on the whole bad, but rather that life is wonderful on the whole.  We should, like children, put whats bad behind us and move on joyously, with arms open to embrace the random, arms open to embrace whatever may come.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nAAAAAAAAAAAAAAAAAAAH! (toolhead I'm yelling at your post, hahaha)\n\n\n", "comment_120": "\nAnyone ever notice that two opposite parabolas shapes overlapping forms a basic pentagram? I noticed it in Algebra II....I kept thinking \"This...works to make something\" and it just came up on the two crossing. Draw one opening up and one opening down and overlapping just a slight bit in the middle as is the basic case with Parabolas. Kinda neat. I feel something was leading me to that conclusion.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nrog27's post basically descrivbes this song, and how empowering and alluding it is. the reassurance that the pain is just your body, and that your soul can easily overcome it. one day, your soul will be free if you let it.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nshut up joshthack ive seen your posts and they just get gayer and gayer.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nshut up joshthack ive seen your posts and they just get gayer and gayer.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\ni love the line in this song-\"Pain is an illusion\"\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI personally think of the song in maybe a little different way.  I think:\r\n\"this body holding me\"\r\nis not referring to somebody else, but rather, his physical body holding his spirit.\n\r\nAnd not suicide, but rather a lack of suicide:\r\n\"choosing to be here in.... this body, this body holding me\"\r\nHe's CHOOSING to be alive, this is a song about life, not death.  Realizing that all the pain he experiences while he's alive is just an illusion, and life should be cherished.  \r\n\"Recognize this as a holy gift and celebrate this chance to be alive and breathing\"\n\n\r\n\"This body holding me reminds me of my own mortality\"\r\nThis, again, is pushing the idea that the body that contains \"Him\" (ie - is SPIRIT), reminds him that the body is mortal, but WE (ie - the spirit) is eternal.  All the pain in the physical body is an illusion\n\r\nThere's my 2 cents =)\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nI just saw something in this song I hadn't seen before. The way I see it, it's about a fight with someone you care about. Sure it sucks at the time, but you'll both get over it, life will go on and it'll be all good again. \n\r\n\"we are eternal, all this pain is an illusion\" - quite simply the fight hurts, but you will both go on together. \n\r\nThat's just my view of it, I'm not really a spiritual person so I'm limited to really basic meanings :P\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nthis entire album revolves around the band's deep philiosophical views on life.  this is basically talking about our human entity revolves around our consciousness.  in other words we project our senses.  the only thing separating us from a god-like status is the handicap of our body. if it wasn't for our body we would ascend to a greater consciousness.  this is also talking about being humble as a result of this. he can't forget that he is a mere human and not a god... yet\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nAAAAAAAAAAAH! (Now I'm yelling at Darktoss just because he likes it so much).\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nListern to the song.. create your own view\r\nthats the best thing about tool, the lyrics open a broad view, were so many of your ideas can slip in. hopfully we never find out what he is talking about.\r\ni can only hope.    i though it was about life in general.\r\nparabola. life to death the trip.   parabol = 1 \r\none life at the momment while your here make the best of it. parabola works off the simple term what goes up comes down some where else, or some thing liek that.\r\nbut then i read about that astral stuff and thats crazy.\r\nid say its about some sorta of voyage, thats the most general thing i can think of.    then there is re-incarnation :O\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nI don't follow tool much but i had hear this song, ironically (for me), having having one of the worst weeks of my life.  I immediately interpretted it as a referance to catholicism.  The gift of life on earth in the human body was given to us by god and, although we face hardships (the bottom of parabola) we must see it as exactly what it was meant to be; a gift.  It reminds us that god is with us, we are not alone in this body, and the pain we bare in our lives is an illusion, just part of the \"holy experience\" of mortal life on earth and then eternal life in heaven.  Re-read the lyrics and think of this, i left a lot out....\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nWhat I like the most about Tool is what they've brought together.  Now I am in no way trying to preach Christianity or some other religion.  I just think that we should all search for something deeper within ourselves.  To make that connection with our spirit.  The biggest flaw I can see in America is in our secular culture.  Because we dissect so many aspects of our lives we are so prone to \"multiple personalities.\"  I've seen it in so many others, and even myself.  One moment you're happy, the next you flip out on something.\n\r\nBut Anyway, look at mathematics.  It is a very defining subject that seems to go no where.  Okay, yeah, I know x^2 is a Parabola, but what is it for?  What does math do for you?  Even my instructors would admit that there hasn't been too many breakthroughs in math.  But it's simply because the barrier we put on ourselves by segmenting every little thing we find.\n\r\nThis is where tool comes in.  They take a simple curve, one that we all remember from our classes, and take it to new heights by applying the rule to our life.  Think about it, x^2 cannot be proven that it's anything but a parabola.  It's solid, it's a law.  Well, take that bit farther.  For the farther you climb, the more you bleed, the harder you work (all relative to you of course since everyone's opinion differs on the level of work) -- basically the higher you raise yourself the better your life will be (signified by the easy climb down on the otherside of the curve).  \n\r\nNow I am still looking for that pivotal point.  That time in my life (signified by the peak of the curve) where I think the song is mostly talking about.  When you no longer are wishy washy about the things in your life and what you believe in.  When you finally reach that point and say, \"now I know I will be truly happy.\"  I can't wait to reach that!  When your pain just washes away because of the love you find.  And all your pain and suffering, your childhood fears and fixations are released.  When you feel this holy experience and realize how eternal you are.  And how much you are truly loved.\n\r\nTo all the Tool fans out there, I love you!  And even if you aren't one, I love you anyway!  Because we all need to get back to ourselves and each other.  This has been a long generation of individuality, of searching what guides us.  Now it's time to get back and relate all of this to each other!\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nThese are all too long, but i think it's about life in general.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nI can tell you 1 thing for certain, this is NOT about any kind of sexual encounter of any kind. With this song you kinda have to try and not read into it too much Maynard has alot of hidin meanings in his lyrics and really makes you think sometimes but with this song and alot of songs on Lateralus you kind of have to read between the lines and take it for what it is which can be 1 of two things, 1.) a sarcastic play on religon or 2.) he's telling you that sometimes beliefs arent such a bad thing after all and if you look and life and after life at a wonderful but reasonable perspective you should be thankful that you are here....I'd like to add that this is one of the most unbelievable songs written in music history\n\n\r\nthank you\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\ni think that it is clear that maynard believes in reincarnation. this song seems to be a celebration of life itself. he's saying to embrace this wonderful chance to be alive. \n\r\nalso, he is saying how his body is a reminder that he is mortal and he will die eventually, but he will be reborn agian and change forever like a parabola (which is a matematical equation for a line that curves and goes on forever.)\n\r\nhe also says that though we go through hardships, we are all eternal spirits that will go on forever, and that the pain that we feel in our mortal life is just an illusion. that mortality ITSELF is only an illusion, because we will all go on forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\ni think that it is clear that maynard believes in reincarnation. this song seems to be a celebration of life itself. he's saying to embrace this wonderful chance to be alive. \n\r\nalso, he is saying how his body is a reminder that he is mortal and he will die eventually, but he will be reborn agian and change forever like a parabola (which is a matematical equation for a line that curves and goes on forever.)\n\r\nhe also says that though we go through hardships, we are all eternal spirits that will go on forever, and that the pain that we feel in our mortal life is just an illusion. that mortality ITSELF is only an illusion, because we will all go on forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nI hate parabolas.  Possibly the worst thing we EVER had to do in math class.\n\r\nThis song, however, is awesome - as is most Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nI love this song...when they played it live it was even better. Everytime i listen to it i can feel it inside me. That may sound stupid but its true. Can anyone explain to me what the bloody hell is going on in the film clip? just email me\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nThe songs (together) are about balance between logic and emotion.  The ball of spheres is logic, the little guy is emotion.  Sometimes our logic overides our emotions, but the answer to life is the balence of these i.e. the sphere in the woods (representing logic and nature (or logic and emotion).   Through the balance the main character becomes more than he was.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nthe songs make me think of plato (you know the philosopher) he believed that nothing in this life was real it was simply a shadow, an illusion. This song makes me happy as it makes me hopeful that something better is waiting. \"This body holding me\" i don't think means another person, i think it is his soul talking about his own body. Mixed with the theme of sex as he is obviously having an pleasurable experiance, which he is using to ancher himself here.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nI beieve this song explains how the present moment, the moment of now is eternal reality and the only moment in existence. It also points out that we must embrace it and live in the Now rather that be off thinking of something in the past or the future which is all that the mind does thus we muct escape that prison and live and just be in the moment coz thats the only reality and our bodies are no more than a disguise that our souls wear. Thus in reality we are eternal, we as in spirit. The song also explains how we do not remember who we really are and says that the only way to become or to re-member who we are we must live in and embrace the present moment and just be.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\n\"quit bitching about life\r\nopen up your eyes\r\nlife is beautiful\"\r\nthats what i get from this song\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nTo me, this song is about how, no matter how lonely we are, we are never alone because we have ourselves. \"This body, this body holding me, be my reminder here that i am not alone\" \n\r\nIm quoting kira midnight because this is so true!!!!!!\n\r\nCos %99 of you are so insignificant to the world.\n\r\nAll squabling to get the ATTENTION of other readers!\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nthis song i feel is about recognising our divinity and that we are all eternal beings.the song also is about how precious and holy it is to be alive as it is an enormous opportunity to move ourselves forward spritually on our paths to enlightenment.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nParabol is a play on the words Parabola and Parable. A parable is not necessarily a bible story, but any didactic short story. Didactic literature is any piece that is meant to teach people how to live their lives. Bible stories are didactic. The Bhagavad Gita is didactic. I agree with the idea that the parabola is a representation of life. I don't agree with the whole astral projection thing. I think he's just talking about holding his lover in his arms. Do you guys remember your first girlfriend? Think back on the moment you held her in your arms for the first time. Have you guys ever been in love? Existentialist philosophy, especially according to Dostoyevsky (read Crime and Punishment) elevates love as the pinnacle of human experience. The world may suck, but its okay cuz there's love. And when you hold your lover in your arms the rest of the world fades away...and you're left in nirvana. \n\r\nDon't take my word for it...I'm no English major. \n\r\nI can't reconcile this interpretation with the video...but they're supposed to be seperate entities telling seperate stories (I think....I read that on some website.) And the scene at the end-the dude achieves nirvana, or moksha, opening his \"third eye\" to universal conciounsess. His \"kundalini energy\" has been released. Go look that up. Have a field day. Its not that mystical....its more of a state of mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nDo you girls remember your first boyfriend? Thought I'd be PC. :-P\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nthis tool song, like all of their songs, can mean pretty much anything u want it to mean. it just depends on the person and their background\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nTHIS SONG IS THE BEST TOOL SONG!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!(every other tool song is close behind)\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\ntoolshed.down.net\n\r\njoin up and experience the real meaning of TooL w/ the rest of us...\n\r\nseperate your body from mind\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nIn the same way a parable is a brief story designed to convey greater meaning, a parabola is a conic section.  They are all pieces which describe part of a whole, and from which that wholeness can be inferred.\n\r\nI think that the above meanings are more than adequate to describe the idea this song shadows.  I further believe that it has even more meanings, and if one were so incllined and possessed of great enough creativity, it could be fitted to nearly every situation, human or otherwise.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nyes...yes it does.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nI think it is beautiful that everyone has their own interpretation of this song, just like everyone has their own way of expressing themselves in life. \n\r\nI am an athlete and I'm into snowboarding and downhill mountain biking. I'm also an artist and a drummer- a very physical person. I love to think and to analyze, but in the end, the most transcendent experiences I have had were when I just let go and rode, or played, or painted. I let the divine flow through my body. \n\r\nI have played this song while painting and produced some of my favorite work. This song has inspired me to go for it on my board or bike- to either fly or fall- it doesn't seem to matter when I hear this song. It makes me feel like superwoman. I'm totally in the moment. The input by Tool drege to me, is right on. When you are in the flow, creating art or performing physically, you have to be in the now. You are not thinking about the past or the future. The present moment is holy.\n\r\nTry listening to this song when your are experiencing a (goo) adrenaline rush... a good way to experience nothing but the present moment. Being on the edge of disaster and a transcendent experience cannot be just the product of brain chemicals, however. When I accomplish/create something, I feel like it is something larger than myself. I feel the boundaries of my body expand, and yes, I even feel love. \n\r\nof course, my interpretation is only part of the big picture. I just wanted to add to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI'm impressed with these interpretations.  You people really put alot of thought into this.  All I can say is that the last line of the song really speaks to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nto me this song represents the ups and downs in life. he is using the parabola as a metaphor.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nthis song, to me, is about life before and after death. we do not remember who we were before this precious moment. this precious moment being born, born as a human. \r\n'this body holding me etc reminding me i'm not alone etc' means that we are progressing through different bodies as we die and are then born again as different lifeform. however this song is stressing the importance of being born a a human and being able to be here (and listening to this song)  .\r\nall our life and pain is simply an illusion because when we die (and are supposedly born again) we will not remember our past life, or what it was like at all.\r\nswirling round each familiar parable...etc... i think is dealing with the fact that the song writer has accepted the concept of life after death and is learnig ways of living or who we have lived as, if that makes sense....\r\nfinally, the writer is celebrating his chance to be alive, as a human and to be breathing and experiencing life as (probably) the most intelligent form of life on earth.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nthis song is about feeling the comfort and compassion of another in a time of discomfort and lonliness.  ...thats what i always thought, until harry manback enlightened me with his whole \"son\" meaning\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nand the part where the 2nd guitar solo/interlude takes place, and how he continues it when maynard says \"in this holy reality..\" the notes form a parabola on the fret board...and so do the chord progressions in the one riff.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\ndamn trendy emo faggot girls who cut themselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nFor starters..I'm going to be expressing many meanings,for I think that this song has multiple meanings in each verse.\n\n\r\n..One is about Life, and  enjoying it while you can,because the end will eventually come..\"celebrate this chance to be alive and breathing\"  \n\r\n2:\"This body holding me reminds me of my own mortality\" is talking about how he knows the end of the Earth is coming soon,and to brace yourself for it..\r\nParabola is a shape with one point of infelction (turns around once) this is a major point...The big bang created the universe...and a big bang will destroy the earth....it is kind of like what goes up must come down...Except it is with the apocolypse..\r\n \"This body holding me reminds me of my own mortality\" is talking about how he knows the end of the Earth is coming soon,and to brace yourself for it..\n\r\n4:\"Choosing to be here right now\" is refering to how you have a choice on where to go,what to do,and what to say no matter what...You might get killed for it,but you can still do it...\n\r\n\"Pain is an illusiuon\" is reffering to how once you die,and go to heaven,then there will be no pain...\n\r\nI also think that this song is to release your inner self,to bring out the light inside you and to view life the way Maynard does..To use your \"Third Eye\"...\r\nand to seperate the body from the mind....\n\r\nThis is my main idea of what I think this song means..\n\r\nIt sounds like this is about a dream...\"We are enternal,this pain is an illusion\"  \"This holy experience..\" and \"This body holding me reminds me of my own mortality\" and \"This body holding me be  my reminder here that I am not alone\" is referring to the state you are in whilst you're dreaming..\"Reminds me of my own mortality\" is saying that in dreams,you see places that you cannot see whence you are awake..like...If you go to sleep and you go to Heaven in your dream,it is so beautiful and it makes you question your mortaility,but once you wake up,you get reminded of your own mortality..\"Reminds me that I am not alone...\" is saying that some dreams are night mares,and that it reminds you that your body is holding you from dying...\"This holy experience\" is,again,referring to how you travel to places in dreams in wich you couldn't travel in dreams..\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nThis is about experiencing one moment that makes you feel as if you were projected from your body, but are reminded of your physical limitations at the same time. At least that's what I got by first listening to it. Maybe I'll find something else though\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nwe chose to be here..we chose all of this suffering to learn about eternal selves...any heartache that we endure here is all for this purpose...\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nappreciating life\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nwhenever we covered parabola and all the conic sections in my alegebra II class whenever i heard the word \"parabola\" i said Tool really loud. Just like in history when reviewing text if the teacher says \"turn the page\" i'll yell out Bob Seager.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nThe video hooked me!\n\r\nThe TV presenter said \"This is the new video from Tool, in all it's 6-minute glory\"\n\r\nThe beginning started really softly - \"This body...\"\r\nThe video gave me goosebumps that I've never have felt before since I first saw 'Prison Sex'\r\nThen the three figures turned into a circle.\r\nThen the GUITARS CAME IN WITH DANNY CAREY'S THUNDEROUS DRUMS!\n\r\nOh, yes, Tool are Great.  Parabola is a great song for first release off the new album\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nThis song might be about confusion of life between Science and Religion. How can the human body, so complex as it is, not be a creation of some higher power. So, thats why our lives are a gift. Even if life isn't always pretty. Our bodies, even though they are a gift are also a curse. If you believe in christianity, our bodies where once immortal. But, we where cursed with mortality because of a mistake Adam and Eve made. Disobeying a simple commandment, the one and only commandment back then, to never eat from the tree of life. Just the thought of man thinking he could outsmart God must have angered him. But, I think the song is also suggessting that we may never know the whole story of our existance, and before it. Because time is always everlasting, and never can be stopped. I could probably pull out a whole lot more meanings behind this song, but this is only a few.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nI read this one thoug, and thought it was intersting.\n\r\nthe meaning Maynard was trying to get through with this song is alot like schism the name parabola represents the parabola from the exact time when you were born (the origin of the graph) and as you grow older (the line of symmetry goes up) the two parts of \"god\" or 40 six & 2 split apart and travel away from each other. Maynard is talking about when the parabola almost goes vertical he realizes he is immortal.The parabola colapses on it self as he reaches 40 six & 2 and froms what shape? A Perfect Circle. Music is just a TooL\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nI haven't read all of the comments, but I think the song is a reflection upon life. What's important is the title: Parabola, like in x^2. Now connect that with life: we begin in infinity, then we live, in state somewhat simple, easy to illustrate, then, after death, we again move into infinty. The song concentrates on the living stage of our existance, also giving some knowledge of infinte stages, \"before\" and \"after\". From a living, normal person, being in the minimum point of parabolic curve, what's outside of this life is unkonwn, infinite. What could better illustrate that than a parabola?\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nThese 2 songs, Parabole and Parabola seem to be about life and the experience of life and death.  Parabol is a mathematical curve that starts at the base line, arcs up, and arcs back down to base line.  It is representing life from birth (growing up to the top of the arc) to death (going back down to baseline).PARABOL  'So firmiliar and overwhelmingly warm, this one, this form i hold now'-His body is cradeling himself and brings him comfort. 'Embracing you, this reality here...so wide-eyed and hopeful'-Himself relaying his feelings about life. 'We barely remember what came before this preciouse moment'-This preciouse moment refering to life. We barely know how things were before birth, what form we took, what universe if any we were in, who we were with.  'Choosing to be here right now, hold on stay inside this body'-Making the decision to remain alive and not take your life away.  Choosing to hold on to the gift of life and stay inside the parabola and body that you are in.  'This body holding me reminding me that i am not alone, this body makes me feel eternal'-He found a companion to guide through the experience of life in the body that he is in.  PARABOLA- 'The holy reality, the holy experience'-Refering to life as a an experience and a holy gift. 'Alive!'- Being alive. 'Swirling round in this firmiliar parabol, Spinning weaving round each new experience'- He is refering to life as a parabol and speaking of all the experiences that occurs in it and how he is never giving up and always working his way around things that are in his path, good or bad.  'Recognize this as a holy gift and celebrate this chance to be alive and breathing'-Life is a holy gift that should be cherished and never wasted.  It is a gift to have the opportunity to be alive and breathing.  '\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nJust awesome.......thats it.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nWe barely remember who or what came before this precious moment. - Sounds to me like the belief about past lives. Continuing on through the song, we have given up on the past lives we have lived, surging forward in search of new experiences.\n\r\nThe song also asks others to stay by your side (be my reminder here that I am not alone), keeping us grounded and in grips with reality, realizing that the pain we feel in our daily lives is as passing as a dream.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nI think manyard get's deep w/ his music to keep us guessing.\r\nBut a lot of his songs I can understand only when I stoned.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nI think this song is about Maynard asking where we come from, existance. \"We can barely remember, who or what came before this precious moment, we are choosing to be here\" \"Swirling round with this familiar parable \r\nSpinning, weaving round each new experience \r\nRecognize this as a holy gift and \r\nCelebrate this chance to be \r\nAlive and breathing, the chance to be \r\nAlive and breathing\"\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nIts Taking Life as a gift (already mentioned several times) we are the lucky souls who have life and we live our life as one big moral or meaning, we all have problems, we face them, its random chaos, MJK sings \"Holy Reality\" like he wants it badly he emphasisizes it by holding the word it echoes wih the music, i think MJK is just warning us not to take life for granted and to be thankful and warn of our ignorance, the fact that we as humans as we know life, we feel pain but pain is not pain not real pain anyway \n\r\nanyways great song\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nhmm very interesting comments about Parabola, but i thing this song is about old people { atlants, lemurians } who lived befor we. and eyes those eyes is old civilizations eyes what is interpret on Tibetians templs walls. that is my opinion. :))\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nI don't know whether this has been said before or not but the line \"This body holding me reminds me of my own mortality\" isn't talking about some girl holding him reminding him that he's gonna die. \"This body\" is the flesh and the \"Me\" is his mind or spirit whatever you like to call it. the mind is immortal. the flesh Fails.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nOh nevermind Flying Ants explained it.... on the first page....\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\ni think this is about jesus or his son Devo haven't fully decided\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nTo me it means to take a look at your life an be grateful. Because we take alot of things for granted. That's just me though. F**K I LOVE TOOL! (band) Tata! Love, BriaR\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nThis is definitely one of their best songs (Parabol and Parabola together) and One of my goals in life is to see them play this live in concert.  I have all of their music videos, some of the live ones too, but by far, the last two minutes of this video make Tool who they are, it just makes so much sense, the guy even gets a third eye (another one of their good songs). If you haven't seen it, and you love Tool, this is worth wasting your time trying to see it.\n\r\nYes, FlyingAnts from he first page really has this down right, his definition of this song is what I'm going with, I'm even getting a hoodie made with the last 2 lines of this song and his definition on it. Kick ass.\n\r\nMaynard really does seem to be into this song, his emphasis on [Celebrate this chance to be alive and breathing] proves the definition further. It's about the difficulty and the reward of not living entirely in the past and/or the future. Making a great song to live by.\n\r\nThe last two lines have become my favorite lines out of any song I've ever heard, and the Instrumental End is great.\n\r\nThis body holding me reminds me of my own mortality\r\nEmbrace this moment, remember: we are eternal, all this pain is an illusion. \n\r\nI used to think he said immortality, and that didn't quite make sense, so I looked up the lyrics and was like \"Ooo...\" , but once I got past that, yes, there's nothing I would change about this song, I don't think anyone would change this song matter of factly.\n\r\nTake Maynard's words to heart\r\nAll this pain IS an illusion...\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nIts true that a parabola is a mathmaticle curve.But this usually refers to crystals and focusing light.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nthis song is a CELEBRATION OF LIFE. a rarity (esp for tool). \"we dont know who or want came before this precious moment\"... nor do we care! life is a celebration. those who ponder about creation, absolutism, eternalism, and the opposite... nihilism should hold their hands up and give it a rest... life is to be celebrated. (nietzsche)\n\r\nHOD\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nHey, cactus...i think i agree more with Harry...The lyric of \"this body holding me could be refering to his son...because his sons body is \"holding\" or contains maynards DNA. Through our progeny we ARE eternal...\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nTo the person who said this song was about sex, everyone has a right to their own ideas, but no. If you'll watch the music video it'll spell it out for you, I didn't even need to see it to realize that.\n\r\nWhile I can see how it'd be confused, mainly during \"This body\r\nThis body holding me\"\r\nHe is talking about his physical body holding his spirt. At least thats what i'm getting out of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\n{We barely remember who or what came before this precious moment \r\nWe are choosing to be here right now, hold on, stay inside }\n\r\nThis precious moment.. is your immediate consciousness.  What else is there in your universe!?  You can't relive a memory, you can't live the future, you are aware in this present moment\n\r\nYou are choosing to experience the way you experience.  you have a profound ability to influence the way you percieve reality\n\r\n{This holy reality \r\nThis holy experience, choosing to be here in }\n\r\nnot only are you here, but it is simply amazing that you are here.  it's so amazing, it so defies our traditional rational way of thinking, that it's divine, holy, that we are alive and feeling this present moment\n\r\n{This body \r\nThis body holding me \r\nBe my reminder here that \r\nI am not alone in \r\nThis body \r\nThis body holding me }\n\r\nhis body holds him--\"him\" being his awareness.  without his body, he has no memories, feelings/emotions, thoughts.\n\r\nhe is not alone?  i am not sure what he means by this line\n\r\n{Feeling eternal, all this \r\nPain is an illusion }\n\r\nexplained at the end\n\r\n{Swirling round with this familiar parable \r\nSpinning, weaving round each new experience}\n\r\nour mind weaves our perception.  this spinning, swirling, weaving, is making cognitive awareness seem like a spatial thing--thus, you can \"travel\" your mind\n\r\n{Recognize this as a holy gift and \r\nCelebrate this chance to be \r\nAlive and breathing, the chance to be \r\nAlive and breathing }\n\r\nagain: not only are you here, but it is simply amazing that you are here.  it's so amazing, it so defies our traditional rational way of thinking, that it's divine, holy, that we are alive and feeling this present moment\n\r\n{This body holding me reminds me of my own mortality \r\nEmbrace this moment, remember: we are eternal, all this pain is an illusion }\n\r\nThis is an interesting part.  First his body reminds him of his mortality-he will die someday.  But then we are eternal and should celebrate this moment.  This could be referring to life after death.  I prefer to think it's one of the most direct references he makes to psychedelia--a moment on a high dose of LSD (which he obviously wrote this song on--this philosophy in this song is closely tied to great LSD thinkers and their prose/poetry/narratives on philosophy) a moment on LSD can feel like an infinite amount of time.  Time can slow more and more (and speed up) and explode into an \"ocean of time\".  This goes back to the line {feeling eternal}\n\r\n{Pain is an illusion}... this sounds like some form of enlightenment (bjork's coolest line: \"i'm no fucking bhuddist, but this is..enlightenment!\"  this is also one of the most direct references to LSD\n\r\nanyway.... awsome song.  it relates exactly how i feel on my trips\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nthis song is one of the more uplifting of tools songs, it gives a more positive outlook on the world than some of their earlier tracks, by the way tool is awsome and maynard is deep..blah blah blah\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nthis song is truly magnificent and is one of the best i have ever heard. i truly recommend that anyone who enjoys this song to take it to the next level. im not sure if drug references are permitted on this site but i will say this. Magic mushrooms or LSD create the most INCREDIBLE feeling of awareness and selflessness i have ever experienced when you listen to this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nMy interpretation of this song/video is that we must discover we are enclosed withing our ego's and this limited  and material way of viewing reality.  \n\r\nThe video starts off with us watching the video throught a box.  This box represents the majority of people's boxed up and controlled view of reality.  At the beginning of the video, where we see all those clusters floating in space, this shows us the separation amongst human beings (ego-games) and society (religion, and dualism when viewing God as a separate entity).  These little clusters floating in space also look mechanically devised, because that is what America is all about, right?  Keeping it's people separate, controlled.\n\r\nLater on in the video we see a black man who is inside of this room.  Again this room represents his limited view of reality and awareness.  He only has a slight concept of nature because of the window in the room he can look out of.  He decides to enter nature, out of his ego, out of the confines of his mind.  \n\r\nHe becomes free of his mind, free of the illusion the machine created for him (I think the floating ball represents society, fear, the illusion society created for him).  When Alex Grey's art enters the video, the man experiences a kundalini awakening and enters the infinite, the oneness.  He becomes aware of everything all at once, hence the eyes everywhere.  Because we are all God, God is everything, we are everything.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nI must also add that the end shows oneness.  This video is a transition from separatism into oneness/interconnectedness of all forms of life.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\none of ther best songs if u cud posibly split them. i love the vocal harmony in the chorus when it sings \"body\". omg danny carey has such precision it's amazing; but the thing that gets me most is his innovation. on that note, I say the same thing for the rest of the band. Maynard has such amazing lyrics, also the structure of alot of ther songs is alot different to others. take this song, eulogy or aenima for a few examples, they hav a verse, chorus, verse, chorus, instrumental, then like a a different sort of verse then a different chorus it works well because for sum reason u can never get sick of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nread a book by bob frissel then watch the music video. It will all make sense\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nUpdate for me...watching it again and reading into it a bit more, I've realized that the floating ball that multiplies really IS a fertilized embryo growing before his eyes...I like the whole Devo approach, but I really do believe that Parabol is two making love and joining together (conceiving) as Parabola is the growth of the child within the woman (gestation). Though I don't find it to be the only train of thought Maynard was going along with, I do believe it is one.\n\r\nSecondly, after having read into Astral Projection and the chakras, and, yes, looking again at the video, I see the pink and blue eyes (male and female spirit of the man) coming up through him and hitting each chakra by passing one another....I also focused on the chakra in his throat, as the eyes joined, creating his third eye, using all of his mental capacity.\n\r\nNice.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nI Bought the DvD for parabola....amazing remix, absolutely amazing (its actually for parabol) but still.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nI think that his song is indeed about death or dying.\n\r\nWhen he talks about a new experience, I think he is talking about dying. And that he is -really- alive and he is one with his spirit.\n\r\nHave you seen the video to parabola? Watch the end of it? Then look at this painting by Alex Grey, titled 'Dying'.\n\nalexgrey.net/a-gallery/…\n\r\nLook familiar? =]\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nI hate these people who view Tool as this omnipotent creation of God. (ex: Fargo, page one last post). The song has nothing to do with mathematical formulas or the big bang/crunch theory, dumbass. All the song says is, your body is simply a container for your soul to experience life through. Life is a chance to expose your soul to different experiences so do not be afraid of pain or dying because this is not the final frontier in who we are.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nI don't have the patience to read all of the posts to see if anyone has mentioned this before, but the lyrics aren't \"feeling eternal\" the are \"we are eternal\". Quite a difference....\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nI think its about life..also if anyone has the cd book for lateralus..flip to the 2nd to last page..look at the brain, it hasthe words \"GOD\" writtin in it. Just thought id point that out.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nOk..didnt really give a true meaning in the last post sohere it goes. I think that this song is about life & how we get to experience different situations to prepare us for whats next in life. T he holy experience this song is referring to is life itself. But take note that this just my take on this song so don't flame me.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nI agree with a lot of what many people have said. The song is about sex on the outset, but what it leads to describing is realisations about the nature of experience and therefore, does have spiritual sort of significance as well... That said, I definately agree that it is a song primarily about realisations that have occured during a sexual encounter/spiritual connection with another person.\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nWe barely remember who or what came before this precious moment \r\nWe are choosing to be here right now, hold on, stay inside \r\nThis holy reality \r\nThis holy experience, choosing to be here in \n\r\n(here he is talking about how people do not appreciate life,and how we can into this holy reality and don't make the best of it,take it for granted.\"This holy experience,choosing to be here in this body\" we are the chosen one,we were put here for a reason,we can take this holy thing away or we can stay in it,it's all in our hands)\n\r\nThis body \r\nThis body holding me \r\nBe my reminder here that \r\nI am not alone in \r\nThis body \r\nThis body holding me \r\nFeeling eternal, all this \r\nPain is an illusion \n\r\n(I think that this part talks about how sometimes Mynard wishes to fade away,he doesn't want this body,this life any longer,but he reminds himself that he is here for a reason,and that he isn't alone.\"Feeling eternal\" since we don't know a thing about death...we do not know if this life never ends...or maybe he meant that sometimes this life lasts too long and you get tierd on the way,but than he reminds himself pain is an illusion,pain isn't worth me giving up on this great thing I was giving.)\n\r\nAlive! \n\r\n(he screams his alive,because as I said earlier we people take it for granted when we should really be thankful for this,we are alive,we get to breath,we get to explore the world,we get to feel,pinch yourself,pain isn't real but the fact that you're alive there is nothing better than this)\n\r\nIn this holy reality \r\nIn this holy experience, choosing to be here in \n\r\nThis body \r\nThis body holding me \r\nBe my reminder here that \r\nI am not alone in \r\nThis body \r\nThis body holding me \r\nFeeling eternal, all this \r\nPain is an illusion \n\r\nSwirling round with this familiar parable \r\nSpinning, weaving round each new experience \r\nRecognize this as a holy gift and \r\nCelebrate this chance to be \r\nAlive and breathing, the chance to be \r\nAlive and breathing \n\r\n(exactly as I said before,Mynard gets to realize this is a gift,all this great magnificant expirence,it's a gift given us by our god,a gift we should respect appreciate and make the best out of,\"Alive and breathing,the chance to be\"Do you earthlings even REALIZE how GREAT this is,we are all alive,we are all spinning and turning on a fun ride,fuck the pain,it aint real,make the best out of this...you might never get another chance to be)\n\r\nThis body holding me reminds me of my own mortality \r\nEmbrace this moment, remember: we are eternal, all this pain is an illusion \n\r\nI think I said enough,,,I was surprised that I could get into Mynards mind like that...I never thought I'd be able to...so if any of you ever feels pain listin to this song!\r\nYou might never get a chance to live again,don't you ever try taking it away!\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nLive as if you will live for ever.  Embrace every moment as holy.  Remember, nothing can stop us, nothing can hold us.\n\r\nYou're alive!  Live like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nAnybody see the video for this? The end is so sick.\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nim not flamming anyone, and anyone who does flame, really doesnt get why tool makes songs like this. manyard wants you to do nothing more than think. the song is vauge enough to mean many different things to many different people in many different situations. this is how i see it: the song is definatly talking about how the body holds the soul. the body is our physical form and through this physical form, we can actually see all of the other souls around us, connected in the mind lattice. it is telling us not to worry about pain we might feel in this mortal form, because it is just an illusion, and once we learn how to open chakras, we will be able to connect to the next level, thereby letting go of any mortal pain. there are so many more thoughts running through my head, but i just cant get them out. i suck at explaining my thoughts haha\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\noh, and another thing, i have heard the two zlex grey eyes at the end stand for hatha (the sun and moon  chakra energys within all of us), not the male and female thing that someone else mentioned. you need both sun(right) and moon(left) energies to open the 7 chakras, so there you have it.\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\ni got no idea wut the hell this song is about, i just dont like math so im hoping its not the math parabola\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nETERNAL LIFE\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nScrew the lyrics! Danny Carvey IS. GOD. No one, NO. ONE. Can best Danny Carvey on the drums. THIS SONG IS THE PERFECT EXAMPLE! (Sploogeness)\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nNew TOOL Album May 8th WOOO!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nSorry but I haven't read any of the other posts as there are SO MANY!!! I love the community of thought Tool provokes.  \n\r\nI see this song as being about recognising that everything we search for our entire life is actually internal, and always has been.  Think about it, all that we ever possess is in reality is only rented because once we die, it just goes to someone else.\n\r\nThat God that so many people want to meet when they die, is actually residing in our body (reminding me that I am not alone) and there for instant access, but only when we are able to recognise it as exactly that.  Our ego is the \"devil\" that challenges us and tempts us to not take up that challenge of seeking divinity within ourselves.\n\r\nYou guys should check out an amazing lady called Marion Woodman - she described an incredible experience of, after many years of hating being a woman, starving herself and all kinds of self inflicting hatred, being near death with disease and havng an OBE.  Once floating on the ceiling looking down at her pathetic body she thought \"finally, I am free of you, you stupid body\" and she actually tried to kick it in hatred!  Then she looked at this poor faithful thing lying there, hardly breathing, waiting paitently for its 'master' to return and live with it in unision, and she describes an overwhelming compassion and love that she never felt before.  It was only then that she realised that our body is a vehicle that assists in completing those necessary tasks, paths and acts that help us and humanit as a whole move towards the great unkown.  She chose to go back to it, and look after it... to respect it for what it is - a divine vehicle or \"tool\" that we should never take for granted.  God I wish I could heed my own advice!!\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\ni saw the video, the end is awesome, i have no clue what the vidoe means though, although ive only seen it acouple times, what and awesome song, fucking eh\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nprobably about eternal life and pain as just an illusion\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nlol\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nWhy do some of you people try to read so far into these songs. Yes...maynard is a ridiculius writer and some of his songs can mean different things to different people, but sometimes they are what they are. EXAMPLE: Prison Sex...is about gettin ass raped in prison, its not a metaphor for some fucked up relationship you had when you were 12. On that note....\n\r\nI think Parabol and Parabola are about the birth and death of Christ. The Lateralus album has a lot of meaning about the Christ Consciousness in it. Parabol is from \"virgin mary's\" point of view, how she has something inside of her, aka...jesus. Then Parabola is about the birth all the way up to where it says \"ALIVE!\"  The middle of the song is about his life. Then the end where it says \"Embrace this moment, remember: we are eternal, all this pain is an illusion\" is about the crucifixion.  That would explain why Parabol is called Parabol. And then the birth, life, and death would be the Parabola. Just one mans opinion. And i'm an atheist, so don't think that i'm some bible banger.\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nbut i don't know why they spelled parable as Parabol.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nFirst, Iâ\u0080\u0099d like to note that Maynardâ\u0080\u0099s song often have more than one meaning and are sometimes actually meant to trick the listener into interpreting it wrong.\n\r\nIâ\u0080\u0099m not here to debunk anyoneâ\u0080\u0099s theories about this songs meaning or significance, or to correct spelling and grammar (I myself am a horrible speller). Iâ\u0080\u0099m simply putting in my two cents so that anyone who wants to can debate over my opinions.\n\r\nMJK was often smoking DMT at the time he wrote this album and I feel that had a major impact on the album, specifically this song. Having smoked DMT myself, it seems like this song, and probably others on the album, is describing a specific thing Maynard (learned/decided/experienced/felt) on DMT. That one thing it seems has something to do with the life process: sex, life, birth, death, and afterwards.\n\r\nSo many of the theories Iâ\u0080\u0099ve read on this board could be correct for at least part of this song. When interpreting songs like this, I like to look at a very vague concept that could relate to the song and break it down until I have the broadest meaning possible that is still directly related and then look at the parts separately. While Maynard has written songs that only have one meaning and some that are a lot less convoluted than this, I feel this one and a lot of his other songs are MEANT to have a broad meaning that can be interpreted it many different ways.\n\r\nAnyway, thatâ\u0080\u0099s my two cents.\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\ni love the outro of this. it's playing with my brain. awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\ni think this song is about how our life is a sacred gift, our eternal souls have on chance to live mortal lives, to feel pain, pleasue, love and hate and all other emotions, and to learn to recognise what is good and before we die and we enter our eternal dimension in which we all live as one entity\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\ny = ax^2 + bx + c\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nWell, the other day I saw the video for the very first time. Later that night, I had an incredibly vivid dream (odd for me, I don't dream) about the video, only instead of that black guy, it was me in the video.\n\r\nAs soon as the third eye opened I woke up and instantly had a revelation: 'I am not alone in this body'. He's using 'this body' to reference those who have opened their third eyes and reveled in this ultimate truth. The band, Alex Grey, maybe a few members of the Church of Sacred Mirrors, etc. Which is why he's saying 'WE are eternal'.\n\r\nAs for the name, maybe he's using the shape as a point of reference. Those who have 'experienced' that are on one side, and everyone else is on the other. The single turn is that moment when the third eye opens. 'Swirling round...' is this part. Like they're literally turning in life. And it's eternal, meaning, there's no going back. There's not another 'turn' for your life to follow.\n\r\nHowever, 'eternal' goes both ways. One can never even know, and continue on one path, eternally. But you have to 'choose' to be there, choose to do it... They did. Now they have that holy gift.\n\r\nAll that's left is for us to open our eyes and find the gift for ourselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nno one will ever read this far in the list, but I will write this anyway as tribute to such a fine song. (Oh by the way if you do happen to read this far well done. Think yourself special for reading somthing no one else is supposed to have read. how do you know you are the only one? you will just have to take my word for it.) A parabola is, as everyone else has pointed out so far, the surface of a curvature. A skin so to say. Somthing of a container. A body maybe, if you are to read deeper into this. There is a lot of Buddist/Hindu influences to the album lateralus. \r\nThrough living, maybe once, maybe a tenthousand times, we can eventually escape from our mortal parabola, to become devine. Anyone with enough patience to watch the video of this song will see, the main character of the short, once dead, becomes the cosmic figure on the cover of the CD. He becomes a god, or at least a higher being.  The many eyes represent aquired knowledge through life, omniscience; also, as an interesting point, the eyes appear as the hindu sighn of good luck.\n\r\nLIFE= A holy expeirence, a chance to be alive and breathing, although I am reminded of my own mortality, but I remember I am eternal all this pain is an illusion. \n\r\nP.S also a nice touch that they are killed by a dividing cell, the beginnig of life brings other deaths.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nok i haven't read allnine pages of the forum or whatever but i bought the 10000 days album to see what tool was about. ive been doing reserch latly on this song and disgustipated lately, and for this what i realized was this;\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nthe man on the cover and the man in the video are the same being obviously, but (i don't know if anyone has already come up with this but) if you look on the cover there is an eye on the fore head, the cheast, the throught, and the hand, and in the video it is just on the hand and chest and fore head. now obviously the are chakras. as in buddhism. look it up. although the hands with the chakras i don.t know. but also another development, the man in the vidoe also becomes what looks like the 10000 days cover and the background in the video is the art on the cd. remember chakras. open the third eye.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nthere is a prelude to this song (parabol), and it's clearly about the idea of dealing with pain, and the lyrics are quite similar, so i believe this song too is about dealing with pain\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nI think this and Parbol together is a mix of a lot of these theories, Thinking that it is birth(Parbol), or the love making, or the life style of living in the here and now, along with the fact that a parbola is a mathematical curve i think it is Life, from birth to death and everything in between, i could explain better but i'm kind unable to word it at this moment\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nI forgot who stated this but it was in reference to an author that MJK admires highly; and includes \"beliefes\" from the other in his songs. I misplaced which song it was that other members were commenting on but it was something off lateralus i believe. \n\r\nIf anyone knows the authors name could you post it? i'd like to read a few of his books.\n\r\nThanks\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nNOT EVERY TOOL SONG IS ABOUT HIS GODDAMN SON!!! SHIT!\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\ntemper, temper. you seem very arrogant, chrystfucker. obviously anti-christian. i hate christians(and all people for that matter) who think that their way is best and refuse to see anything any other way. then i realised that by thinking this, i was doing the exact same thing as the people i hate. maybe you should wake up\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nI think about every interpretation has been made for this song. The only thing i can add is Maynard sometimes refers to different types of religions and one of which is the Jungian theory, which is what 46 and 2 is about. While reading about this theory i learned that there are 3 stages in life and i read that they go in an arch like direction, like a parabola, and so thats what i think the name of the song came from.\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nAlso, this is a great work out song. It always gets me pumped up and while listening to this song and then ticks and leaches, I can run for a long time at top speed. Also, since I play highschool baseball, we always have really hard burnouts. Like seeing how many times you can squat 145 pounds. Well after about 100 it becomes really hard. And at about 140 I was completely worn out, I felt like I could do no more, when I started to sing Parabola to myself. I kept screaming to myself: WE ARE ETERNAL ALL THIS PAIN IS AN ILLUSION! And that helped me do 60 more squats, giving me 200; which is really good considering I weigh only 130 pounds.\r\nTry it.\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nI agree its a good work out song\n\r\nIsnt parable also teachings of jesus? anyway its been covered, but to me its about 'screw addictions and infatuations' 'get in touch with the holy aspect - pain is an illusion - life is hard but hang tough'\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nI got this and Parabol on a CD that someone else burned, but without a tracklisting, is Parabola the faster one or the slower one?\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nParabol= slow\r\nParabola= fast\n\r\nGreat song\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nAs I stated for Parabol, both these songs are refering to Alex Grey's \"Birth\", with the parabol going through the child and mothers head (look at it on his website). I beleive that this song is just portraying the intensity of child birth.I would not be posting it, if I wasnt sure of this...so congates for those who came up with the birth theory, you are geniuses truelly....\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nnot really its not hard to see it was about birth... this body holding me...obviously it could be his mom. I thought of that the first time i saw the lyrics. Or maybe I'm just a genius too\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nCould be sex in a spiritual sense, could be birth, could be life in general, could be a mathematical reference, could be about death and resurrection. \r\nIt's a big mixture of everything as far as I know. Those remarks about Alex Grey, and his artwork, Buddhism etc. are very interesting to read, thank you all for that. \r\nMost memorable sentence is actually from Parabol, \"this body makes me feel eternal, all this pain is an illusion.\" We are mortal, but if you think about it, we are also eternal. Our souls could return in some other life form, or our name will be remmebered. Our body becomes one with the earth once we die, which means we live in the earth forever for the rest of time. I'm actually making this up on the spot, but I think it has some truth in it :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nwow!! years of threads in the making.. this only shows that tool have made us learn from each other(think of it like taking a 4-yr. college course), well ive finally figured it out.. before i was a fan of DREAM THEATER, because of their musical genius, but when i heard the emotion of one of maynards songs i got curious, DT is nothing compared to tool, not only it is intellectual metal but it is also what i would say \"spiritual metal\" (not in a Zappa/Hendrix way..) parabola.. i heard somwhere that the album is actually a puzzle or a \"spiral\" where the song lateralus is the middle of it, so technically the album is a divine code for the one who wants to seek wisdom, going back.. parabola is a mathemathical term for wtf i dont care, its part of the code.. reshuffle the album and remove the silent pauses at the end of each song,  god  i wish i know what kind of drugs they are taking they are mf beyond words..\r\n*who the hell would incorporate math/algebra into metal, funny but this is a way to seperate a jack-of-all-trades to a Renaissance man..\n\n\r\ntip:fibonacci sequence\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nwith all the respaect not all the songs are about sex drugs and suicide. Parabola really IS a praising song about life, after all it is about the birth of Keenan's son... obviously Parabola is tracked after Schism which expresses the disapontment of his failing marriage... \r\npeople... it's not just a song... it's a masterpiece, just beacuse the band is not very cheery and fluffy doesn't mean all their songs are about the same depressing issues...\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nREAD AND LISTEN TO THIS!!!\n\r\n7812569103411/67584131221911310/15\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nTool: The Cyclic Playlist.\r\n6,7,5,8,4,13,12,2,1,9,11,3,10 / 15 / 7,8,1,2,5,6,9,10,3,4\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nThe more research I do, the more I begin to relize these two songs may not have the same meaning. One is rather about ones soul as has already been mentioned times over. And one is about giving birth. Because the line off lateralus \"black then white are all I see in my infancy, red and yellow then came to be\" could be refering to either. When you are born the first colors you see are black and white, then (you geussed it) red and yellow. That also applies to LSD trips. Im not saying thats the full meaning behind lateralus however the spiral is refering to the \"polar unity spiral\" seen during LSD trips. Sorry for this rant however (back to THIS song) Tool is probably just showing the similarity between awakening the body, and awakening the mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nTool Synclist (complete)\r\n7,8,1,2,5,6,9,10,3,4 - 6,7,5,8,4,9,13,1,12,2,11,3,10 â\u0080\u0093 15,14 (or 14,15)\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nI dont know how people can see the subject of this song as sex. If you look at the lyrics you will see that it is most likely about our (humans) current reality, and our consciousness. I think MJK is trying to say that we as humans are choosing to be here (earth) and all the pain that we suffer here on this earth is really just an illusion. Its almost like the idea of the Matrix. We percieve the world in our own manner, unfortunately we have chosen to make this world a reality in which we suffer pain and chaos.\r\nOn another note, Maynard claims that his body is holding him and that he is not alone. His body is proof that there is something inside of him. Possibly a soul? im not sure what his beliefs are, but the body acts as a chamber. When the body dies, he will be released and will exist eternally. \r\nThe ultimate message in this song is to state that we should recognize this chance we have created on earth. The chance to be alive and to be breathing. In the song Lateralus, MJK also touches upon this towards the end of the song. This is where he gives specifics on what he enjoys most. That he embraces the moments to do many things and most importantly to be human.\r\nThats my take.\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nTHERE IS NO FREAKIN SPOON MAN!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nTHIS SONG IS ONE OUR GREATEST GIFTS, NO ETERNAL REWARD WILL FORGIVE US NOW 4 WASTING THE DAWN\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nCaps lock off, dear.\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nhell n my head, what the fuck man?\r\nthat's poetic, but what the fuck could a sentence like that mean\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nThe eternal reward won't forive us, apparently. >.>\r\nEither that or he had a spasm when he touched the keyboard and he came out with that crap.\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nPoetry is inherently cryptic as well as frequently drug induced. Nice work hell n my head. Danny Carey would love you.\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nthe music video for this song can dispel any confusion about its meaning.  it is about breaking the chains of dellusion, awakening kundalini (shakti) which rises up to the top of the head, activating the chakras as it goes, to merge with shiva, causing the thousand petaled lotus to bloom.  at the end the man has completely faded out into the infinity of the one.  \n\r\nhighly recommended song for DMT smoking.\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nThis song is about a spiritual journey and how if you learn to control your mind (we only used 10% of our brains in day to day life) you can block out pain and live forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nthis is my favorite tool song.  Its short solo in the beginning and it's repeat later on is superb.\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nALIIIIIVVVVVVVVEEEEE!!!!!!!!!! FUCK I LOVE THAT PART!!! SO STRONG AND EMOTIONAL lolz you knaw what I mean people!!!???\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nthis song is all about the mind, about how we can never prove that the world outside our mind exist.  Everything that we experience and feel like \"pain\" is all how we want to perseve it. i think the reference to this holy experience is a sarcastic reference to those who don't want to experience out of body experiences\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nOut of body experiences can be quite terrifying for some.\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nIM SURE ITS BASED UNDER BILL HICK's ONE CONSCIOUS PHILOSOPHY.\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nHMI, you said \"MJK was often smoking DMT at the time he wrote this album\".\n\r\nHow can you know that ?\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\ni think when you get down to the basics of the lyrics, and try not to stretch them, this song is definately about appreciating life, like the first line \"We barely remember who or what came before this precious moment\" i think could either mean birth or just life being a precious moment.  It's amazing when he screams \"Alive!\" best moment of the song\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nSEXXXX.\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nAye, i do think its about maynards son. The most deep lyrics to come from maynard have involved his family, jambi and parabol/parabola. And in this ong we see how overwhelmed he is to have a son, and we all feel his experince..\n\n\r\nso corny!! but thats what i think, my most favourite tool song...\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nAlright this interpretation is a bit of a stretch but I have lessened to the beginning of this CD so much and worked it way too much. Yet I think it is possible to think of the begin as a narrative (why it ends at Parabola I donâ\u0080\u0099t know). Either way the first song on the CD is the grudge This I feel is kind of an in medias res story about a relationship starting at the breakup. In this song Maynard talks about this grudge (also relatable to the 5 steps of grief this being the 2nd step). â\u0080\u009cclutch it like a corner stone, otherwise it all comes downâ\u0080\u009d He must hate, it is the only thing he has left.\r\nThe next real track the Patient. Now Maynard has gotten over the first part, anger, and now wishes any sort of connection with this person. And he is still right their giving blood keeping faith trying to keep the relationship real. Yet he knows that his effort is going to be fruitless because she doesnâ\u0080\u0099t want it any more.  By now he knows that he should have walked away a long time before he initially realized that there was nothing left.\r\nNow is schism and that is exactly what it is about, a schism. Maynard has walked away but that doesnâ\u0080\u0099t mean he does not regret it and still wants this person in his life. He knows that at one point the peaces fit and he watched them all fall down or in other words his relationship fall apart. Now he is left with nothing because he is a broken man and the peaces must fit back together, they must! It is essential for his sanity\r\nFinally Parabola this song I am the least sure of. I am going to start with the intro (Parabol) he starts about talking about how familiar the place is. I believe that that has something to do with relapsing with his ex. He feels comforted because he now is getting what he wanted for the last long period of time (warm=comforting, his ex=the reality â\u0080\u009cembracing you this realityâ\u0080\u009d). He also needs to convince himself that this is not transitory so he must see the form he holds as wide-eyed and hopeful. Also he does not know or care what came before this precious moment (all the other songs before this) because that is not important now. He has what he wants. Unfortunately he can not fool himself forever. â\u0080\u009cThis body holding me, reminding me that I am not alone inâ\u0080\u009d he knows that something is wrong he is not alone his past with this person will get him and this is only one night. But that does not stop him from feeling eternal. Then the beet picks up and we are in to Parabola. What makes me think that it is a relapse in a relationship is the line â\u0080\u009cwe are choosing to be hereâ\u0080\u009d. Why would that be important unless they were not supposed to make that choice? And he wants his ex to hold on and ignore what we have gone through and all of this is a â\u0080\u009choly experienceâ\u0080\u009d because that is what he has needed. Also he tells his ex to â\u0080\u009cCelebrate this chance to be Alive and breathingâ\u0080\u009d so a chance to be alive again in the relationship.\r\nAnd thatâ\u0080\u0099s about it, I know it is a stretch but I like narratives so just a recap\r\nThe Grudge â\u0080\u0093 Hating his ex right after the breakup\r\nThe Patient â\u0080\u0093 he still wants this relationship\r\nSchism â\u0080\u0093 A schism is forming between the two lovers\r\nParabol/ Parabola â\u0080\u0093 A relapse in the relationship\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nAlright this interpretation is a bit of a stretch but I have lessened to the beginning of this CD so much and worked it way too much. Yet I think it is possible to think of the begin as a narrative (why it ends at Parabola I donâ\u0080\u0099t know). Either way the first song on the CD is the grudge This I feel is kind of an in medias res story about a relationship starting at the breakup. In this song Maynard talks about this grudge (also relatable to the 5 steps of grief this being the 2nd step). â\u0080\u009cclutch it like a corner stone, otherwise it all comes downâ\u0080\u009d He must hate, it is the only thing he has left.\r\nThe next real track the Patient. Now Maynard has gotten over the first part, anger, and now wishes any sort of connection with this person. And he is still right their giving blood keeping faith trying to keep the relationship real. Yet he knows that his effort is going to be fruitless because she doesnâ\u0080\u0099t want it any more.  By now he knows that he should have walked away a long time before he initially realized that there was nothing left.\r\nNow is schism and that is exactly what it is about, a schism. Maynard has walked away but that doesnâ\u0080\u0099t mean he does not regret it and still wants this person in his life. He knows that at one point the peaces fit and he watched them all fall down or in other words his relationship fall apart. Now he is left with nothing because he is a broken man and the peaces must fit back together, they must! It is essential for his sanity\r\nFinally Parabola this song I am the least sure of. I am going to start with the intro (Parabol) he starts about talking about how familiar the place is. I believe that that has something to do with relapsing with his ex. He feels comforted because he now is getting what he wanted for the last long period of time (warm=comforting, his ex=the reality â\u0080\u009cembracing you this realityâ\u0080\u009d). He also needs to convince himself that this is not transitory so he must see the form he holds as wide-eyed and hopeful. Also he does not know or care what came before this precious moment (all the other songs before this) because that is not important now. He has what he wants. Unfortunately he can not fool himself forever. â\u0080\u009cThis body holding me, reminding me that I am not alone inâ\u0080\u009d he knows that something is wrong he is not alone his past with this person will get him and this is only one night. But that does not stop him from feeling eternal. Then the beet picks up and we are in to Parabola. What makes me think that it is a relapse in a relationship is the line â\u0080\u009cwe are choosing to be hereâ\u0080\u009d. Why would that be important unless they were not supposed to make that choice? And he wants his ex to hold on and ignore what we have gone through and all of this is a â\u0080\u009choly experienceâ\u0080\u009d because that is what he has needed. Also he tells his ex to â\u0080\u009cCelebrate this chance to be Alive and breathingâ\u0080\u009d so a chance to be alive again in the relationship.\r\nAnd thatâ\u0080\u0099s about it, I know it is a stretch but I like narratives so just a recap\r\nThe Grudge â\u0080\u0093 Hating his ex right after the breakup\r\nThe Patient â\u0080\u0093 he still wants this relationship\r\nSchism â\u0080\u0093 A schism is forming between the two lovers\r\nParabol/ Parabola â\u0080\u0093 A relapse in the relationship\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nEven if this song is about sex, whats wrong with that??? Sexual intercourse is a beautiful and overwhelming experience, probably a humans greatest purpose, \n\r\nI believe sex would be entirely appropriate for this song. \n\r\nYet it could possibly be a beautiful description of the miracle of life and the gift of question & consciousness we humans have been given.\n\r\nCmon people, how much more deeper could it get than that???\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nMy personal belief to the lyrics of the song is not about the process of birth, but rather spiritual and physical rebirth and the fear and pain one must endure to find it. The song Parabol centers on ideas of rebirth in my mind with lines like \"so familiar... and overwhelmingly warm\" as if he's entering the next stage in life, it is new and refreshing, yet is familiar. The lines shift into a different direction once it becomes Parabola. I feel the meaning is now life and the struggles of it all up until the final verse. He mentions that \"this pain is an illusion\"  as if it will eventually leave us all and we and the rest of the world will end. The last verse ties it all up, and he has wasted too much time on simple little Earth and is taking his descent/ascent into someplace new and beautiful, whatever his believes is beyond in Heaven or Hell or \"what came before.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nI really love this song and I really like how Parabol joins so smoothly into this. In my opinion the song is about how a persons spirit/soul is within a physical vessel of a body. Or it could also be saying that life is short and the holy experience of being alive is worth fighting for:  \r\n\"We are choosing to be here right now, hold on, stay inside \r\nThis holy reality \r\nThis holy experience, choosing to be here in \n\r\nThis body \r\nThis body holding me \"\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nseems to me he's talking about re incarnation. parabolas come back and go around again. also \"we barely remember who or what came before this precious moment\" i think refers to previous lives.  the body he's in right now reminds him that hes mortal but he will continue forever, all the pain is an illusion\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nI've always felt this song, as most of Tool's songs, is sarcastic in nature. It seems to be some mock of the religious ideology of spirits in bodies, and the need to acknowledge that it is only by the grace of God that we have the chance to be alive.\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nâ\u0080\u009cThere are diverse ways in which people can interpret art and lyrics and draw them into their own experiences. Our lyrics are heavily layered.â\u0080\u009d-MJK\n\r\nWhat I've gotten out of it is this: sex and love, being overwhelmed with feelings and emotions making you forget all your pain, forget your past.  Just as well, I agree with Infirmo as a second meaning.  As Maynard has said, he wrote his songs with multiple meanings so you as the listener can get out of it what you wish.\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nparabol and parabola my interpetation is he talking about our life we are here now in this life to celebrate and live to the fullest  being so familiar warm we are live human beings and we shoudl embrace this life now then he points to how we dont remember what came before this precious moment thats the point in which we are reborn back into this form our body our spirit was reborn into our body coming back from the spirit world where maynard plainly believes in reincarnationwe choose agoin to cvome into this form to expand on theis dimension on this plain our spirtis eager to grow and expand here thats why he say in the song Spinning, weaving round each new experience.\r\nRecognize this as a holy gift and celebrate this chance to be alive and breathing. also hwo he says we are not alone in thsi body   he pertaining to god within us when i first bought this album i di not undertand but from my expierences in life and laearning from books ive read gave me this rewvelation about his song any way enjoy this celebration of this life\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nhe's totally just mocking religious people that have these \"religious experiences, such as people that go to church camps n get saved. \"this holy experience\"\r\npeople are looking for something to hope for.\r\nhe wants to know that he is not alone, that there is more than this life, that the pain of this life is just a test, temporary, fake, and will be over soon.\n\r\none has a so-called \"religious experience\" and then decides to change their life and way of thinking.  everything is a gift from god, and their path has been chosed. they are safe in daddy's hands.\r\n\"Spinning, weaving round each new experience.\r\nRecognize this as a holy gift and celebrate this\r\nChance to be alive and breathing\"\r\nthe person ends up like \"oh thank god for everything, i'm safe with him, blah blah i'm alive yay\"\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nAll i can say is Maynard must smoke too much pot because he thinks too deep into shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nI don't know if anyone put this already, and I know Maynard isn't religious, but this song means that the person has something inside him, and he is trying to escape his body for something better, (heaven if you would like), and he feels like his body is holding him back from meeting this \"holy experience\". Although, it also seems as he wants to stay in his body too. That's my take on it.\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nI couldn't see this song in the depth. It sounds cool anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nFor the 100th time, this song ISN'T about sex.  The sexual references are symbolic to other things. Tool is deeper than singing just about fucking.  It's the same way with Stinkfist.  Stinkfist isn't about anal fisting.\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nmaynardslyrics.com\n\r\nI think Maynard's words need to be shared with the world, in their most accurate form. He is something of a lyrical genius, and we all know this. The site is very simple, but the main object of my site is not the layout, it's the lyrics. You will not find more accurate tool/apc/puscifer lyrics anywhere. So feel free to browse, peruse, if you will, maynardslyrics.com ...\n\r\nI have all the Tool albums done, minus Opiate, which will be added very soon.\n\r\nAll his APC stuff, minus emotive, which will be added very soon.\n\r\nAnd as soon as his Puscifer stuff comes out, expect it to be added as well.\n\r\nIf you see any lyric or line that you feel is not what you think it should be, please feel free to email me @ magiclessmarker@maynardslyrics.com\n\r\n-magiclessmarker.\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nOver thinking, over analyzing separates the body from the mind. Read up on Alex Grey a bit before you comment on this song, this song is a guide; use it!!\r\ncheers.\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\ni think this song is about human existance. the sensation of having a body. and the existance of souls(tho not in a christian way).it points out how we r a divine being inside a body. and the begining of the video shows matter being composed of gears. which goes along with my belief that the universe is artificial\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nThis song seems to express the enigma and the absolute incomprehensible idea of being alive,simply existing. NOTE: maynard has said he prefers listeners to feel the song before reading the lyrics. During the song he roars\"ALIVE\",i simply cannot over look this. That its not something to be taken for granted, its something we should ponder on and to\"recognise this as holy gift\". Listen to how he says\"this body holding me\",he almost cries it out, he even repeats\"this body\"emphasing existance, mortality and the sheer incredulous fact of being. I dont think there is neccesarily a profound meaning to it but more of an idea or a hope that we are divine, eternal and purposeful.\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nalright. this is my interpretation.\n\r\ni apologize if I'm blunt.\n\r\nthis song is about a guy on acid, quite possibly reading \"The Psychodelic Experience\", which was a revised version of the Tibetan Book of the Dead. Since people have said Maynard isn't a religious person, this song could quite possibly be about someone he knows. anyway, from what I know of LSD, you see illusions/hallucinations. now, im not taking that out of context of the pain is an illusion line, rather i just think this guy is tripping and he is savoring the moment. also, this could be a shaman, for he is recognizing it's a holy experience to take the drug... if it's not LSD that is. as many tool fans stumble upon shamanistic info, this may strike a realization with you guys and i hope everyone understands what the hell i mean.\n\r\njust throwing this out.\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nGod... Danny Carey is badass...\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\ni didnt really understand this song, the video and song, i never really put 2+2 together, but after reading all the comments here i fully agree on what people have said about this song being about the soul..i also kind of understand svasanvedana point but i want to read into it.. i love the eyes in the video, they make me shudder..\r\nAll this pain is an illusion,\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nThis is a good song as well but when I first listened to lateralus, I was really calmed after listing to parabol then it snappped into this song and really startled me\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nI think this is a message to Adam Jones, the band founder. Just change the spelling of the word \"body\" for \"buddy\". And all this life celebration stuff to me is more something like : we're lucky to be in this band, let's celebrate. What do you think?\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nI also think that Maynard is the type of singer that you have to convince in order to make sure he stays in your project... This buddy holding me...\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nwhat if he is saying \"this pain is an allusion\" not illusion...\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nThe holy gift is the ability for all people to be able to open there third eye. If you watch the video, it shows the third eye being opened. Your third eye is your 6th chakra and it can be opened through meditation. \n\r\n\"this body holding me\"\r\nMe, being his consciousness, inside of his physical body. \n\r\n\"feel eternal, all this pain is an illusion\"\r\nHe's saying that that he's become one with his soul, seeking answers from within, it's the real him, and the soul is eternal.\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\n\"We are choosing to be here right now, hold on, stay inside\r\nThis holy reality\r\nThis holy experience, choosing to be here in \" \n\r\nhe is talking about even though we are spiritual beings, being here in this existence is really a gift because it is an experience on its own.  it is to teach us and show us that we have a choice in how our life turns out.\n\r\n\"pain is an illusion\" he is saying that you control your reality because everything that happens is your choice so there is no real reason to experience pain because you decide whether to hurt yourself or not.  there is no reason to feel pain at all, you make up the situations in your life.  basically, you control your reality so you have to choice to not feel pain or hurt or what ever.\n\r\nalso the whole \"i am not alone\"  he is saying that consciously we are all one.   we all effect the way each other act and feel and think and our physical bodies are the only things that separate us but in the end when we all die we will all be one consciousness (all that what not that bill hicks said in the last track of aenima)  \n\r\nalso the first two lines is like saying that every moment is a gift and that one should live in the moment instead of worrying about the past or the future or what ever in order to fully experience life.\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nLook up most eastern religions, especially buddhism. You'll pretty much understand this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nWell, the part on the nature of reality. Not the idea that we should cherish the chance to be alive and breathing. That's kinda anti most religions\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nWell, the part on the nature of reality. Not the idea that we should cherish the chance to be alive and breathing. That's kinda anti most religions\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nI have been listening to Tool since I was about 12 (i'm 24 now), and their music has been with me through a lot of important and tumultuous times in my life.  Parabol/Parabola is my go-to song when I am struggling with feelings of despair, pain, self-hate, doubt, etc. -- all the suffering that comes with the depression and anxiety i have been battling for years.  It is a beautiful, therapeutic song.  It pulls from Maynard's vast vocabulary of spiritual/psychological exploration, but also speaks on a very simple, touching level.  To listen to this song is incredibly soothing for me.  It reminds me of the human touch I am so lucky to have, how good feels to touch another person, to be human.  It makes me remember to feel my breath, to focus on the holy experience that is life, and that, as impossible as it seems in the moment of suffering - all this pain is an illusion.\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nIts a song about overcoming depression.  Realizing that your life and your soul are more than your problems.  You are not alone because you always have yourself and you should cherish it.  In the Grand Scheme of things, all of your current troubles are inconsequential.\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nParabol+Parabola is not about sex or his son. It's both of those of those things and being eternal and cherishing every moment HERE. \"overthinking overanalzing separates the body from the mind\", - Lateralus. You probably knew what this song was about before you read all the lyrics, but since you liked it, you tried to figure it all out. Counterproductive dont you think?\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nThis song is clearly the basic message of one of our time's greatest free thinkers David Icke,  David has long spread the message that the universe is \"eternal Love, everything else is illusion.\"  We all exist in a vibrating energy field of which our bodies decode only a very narrow, low-vibrational bandwidth.  Like how a television picks up various frequencies depending on how it is \"tuned,\" our bodies are \"tuned\" by nature only to the realm of certain mid-frequency sounds and visible light.  All around us are x-rays, gamma rays, ultraviolet rays, infrared waves, vast innumerable examples of electromagnetic energy outside of our \"frequency range.\"\n\r\nIcke, and clearly Maynard, share the idea that life is an illusion of vibrational energy, of which our spirit or consciousness, specifically relating to the emotion or state of being \"love,\" is the only truly important component to the Universe.\n\r\nThis song, and this message, is the single most important thing anyone needs to know.\n\r\nNamaste.\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nI think that this song is much more about life and the strenght, once we are pure human beings. Than sex. Anyway, this song is wanderfull. Everybody should listen to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nTo me, this song is talking about living in the loving moments, amidst a world of pain that wants nothing but to destroy the relationships between a man and his woman. Your basic Romeo and Juliet Dilema. Here is why:\n\r\n\"We barely remember who or what came before this precious moment\" = Nothing that led up to those moments of happiness matters anymore.\n\r\n\"We are choosing to be here right now\" = Choose to enjoy that moment of happiness and do not live inside the world that threatens it.\n\r\n\"Hold on, stay inside this holy reality\"= Escape into the world that feels so wonderful, despite its frailty.\n\r\n\"This body holding me\"= Be held by each other, not the cynics that want to tear the two apart.\n\r\n\"Be my reminder here that I am not alone in this body\"= The body feels pain- pain, because the two lovers cannot be together, for whatever worldly reasons. MJK is asking to be reminded that she love him, and that he is not alone in his feelings, both good and bad.\n\r\n\"Feeling eternal, all this pain is an illusion\"= Despite the world that fights to tear the two lovers apart, in their world (each other's arms) they are eternal. That would make anything else (the pain that the world inflicts) is merely an illusion.\n\r\n\"Swirling round with this familiar parable\"= I suspect this refers to a short story which expresses a moral display.\n\r\n\"Spinning, weaving round each new experience \"= Letting the world revolve around the love, and not the persecution. Use the joy as a center pint, a point of reference.\n\r\n\"Recognize this as a holy gift\" = Appreciate what they have when they are together, instead of dwelling on the sacrifice with which it is exchanged.\n\r\n\"Celebrate this chance to be alive and breathing\" = Basically just be happy to have those few and precious moments together.\n\r\n\"Remember, we are eternal, all this pain is an illusion\" = Do NOT let the worldly issues that threaten the love that the two share tear them apart, but instead, remain eternally strong, within each others arms.\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nAs many before me have stated, this song is about experiencing an enlightenment of consciousness. \n\r\n\"We barely remember who or what came before this precious moment\" = Our eternal spirits are not bound by memories.\n\r\n\"We are choosing to be here right now\" = Choose to not live in a state of conditioned reaction. Choosing to observe your ego from an external vantage point and not let it run your life for the real \"You\".\n\r\n\"Hold on, stay inside this holy reality\"= \"This Holy Reality\" refers to \"This Moment\". \"The Now\" or \"The Present\". Past and future are only pretend places in our mind. When we dwell on past or future we are literally  surrendering our lives to the sum of our conditioned responses.\n\r\n\"This body holding me\"= This body, this \"Ego\", This \"MJK\" that people think I am is not the real me. MJK is only form.\n\r\n\"Be my reminder here that I am not alone in this body\"= He knows (or wants to believe) that \"presence\" is in every body. He knows it, but it's hard to remember because so few people ever become free of ego.\n\r\n\"Feeling eternal, all this pain is an illusion\"= He feels one with consciousness. He has realized all pain is only form, and is neither good nor bad, only part of the experience. \n\r\n\"Swirling round with this familiar parable\"= Possibly the Bill Hicks quote. Possibly referring to an observed pattern. Not sure\n\r\n\"Spinning, weaving round each new experience \"= When you experience presence, you are literally in the zone. You are not being manipulated by conditioned ego reactions and life is simply beautiful. You are aligned with the universe and you are actually happening around the unconscious folks nearby. \n\n\r\n\"Recognize this as a holy gift\" = Now is the meaning of life. \n\r\n\"Celebrate this chance to be alive and breathing\" = We are hear to experience life. Love is the best way. \n\r\n\"Embrace this moment, remember: we are eternal, all this pain is an illusion\" = \n\r\nPast and future are traps for the mind. Donâ\u0080\u0099t build you very belief structure to state peace comes in the future. There is no future. There is only now. The future can never get here (weâ\u0080\u0099ll never have peace because by its very definition it cannot. \n\r\nWikipedia â\u0080\u0093 â\u0080\u009cIn a linear conception of time, the future is the portion of the time line that has yet to occur, i.e. the place in space-time where lie all events that will occur.â\u0080\u009d\n\n\r\nI have heard people ask â\u0080\u009cwhatâ\u0080\u0099s wrong with people todayâ\u0080\u009d when discussing violence, war, politicsâ\u0080¦ everything. The true problem lies within our very belief structure. We believe that satisfaction is something you work towards and eventually acquire through suffering, sacrifice, war, diligence, wisdom, and countless other noble ideas. The problem here is that the belief IS the reality, not the means to it. Satisfaction or â\u0080\u009cpeaceâ\u0080\u009d IS NOT something you work towards. The future only exists in your head. \n\r\nAssuming you will have peace after some future event is simply a flawed thought. Shortly after the goal is reached, your engrained belief structure creates a new goal or longing for the ego to acquire. So in essence, the only way to be at peace is to never be at peace. That clever egoâ\u0080¦ Shame on it.\n\r\nThe Ego may also dominate by using pain and lack to control a person. Pain lets the Ego know that â\u0080\u009cIâ\u0080\u009d am NOT happy! This reinforces the belief that happiness can be found in the future, and thus the madness is incessant. \n\r\n  Have you ever met a person who always seems angry or is always involved in some sort of drama? Ever met someone very depressed for long periods of time? Ever been there? What is happening in those instances is the ego binging on pain. These people have developed conditioned responses that have trapped their mind in a world of make-believe.  They gain their sense of self using this belief pattern and it becomes very difficult to put it down because it works so well. â\u0080\u009cMore pain please, it helps me feel peaceful.â\u0080\u009d some people seem to be asking. â\u0080\u009cSure thingâ\u0080¦â\u0080\u009d the Universe responds. If they would only take a step back within themselves and observe their own minds reaction to the situation they might realize that they are more than the sum of their experiences. They might realize that there is something much more amazing going on here than â\u0080\u009cMe and My Storyâ\u0080\u009d and thus begin a new pattern of harmony with what is. \n\r\nBut I donâ\u0080\u0099t knowâ\u0080¦\n\r\nItâ\u0080\u0099s probably me thatâ\u0080\u0099s crazy.\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\npersonally i think its about change. Parabol is a mathematical equation, a parabola is tha visual representation of a parabol (mathematical equation) so i think this song is about when you finally decide to make a chan ge and when it shows through in the end. Either way this and parabol are probably the best tool song.\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nI agree that this song is in a sense about personal growth amongst other things but again one of the many things I love about Maynard is how every line could have a thousand different meanings. Im actually planning on walking down the aisle on my wedding day to the instrumental version of this song (yeah yeah obsesssed fan, I know). I absoluetly love the lines\r\n\"We barely remember\r\nwho or what came before this precious moment\r\nwe are choosing to be here\r\nright now\r\nhold on\r\nstay inside this holy reality\"\r\nDespite the song's actual meaning those lines also say alot about how I feel about my fiance & our wedding day. A parabola is actually 2 completely different pieces coming intersecting together to form a (mathematical) connection.\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\n\"Swirling round with this familiar parable spinning weaving round each new experience\" - I believe that he uses the word parable because this is a message about the progression of the mind in reaching a higher consciousness. And if you haven't noticed almost all of Tool's songs dance with this theme. So i think MJK is referring to his own personal journey to spiritual enlightenment and telling us via art, song, poetry. And in question as to the title of the song, As mentioned earlier by Maynards Mistress that a parabola is two different pieces intersecting to form a connection. Maybe its the conscious mind connecting the subconscious mind to become one....\r\ni might be reaching there\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\nHey disher, thanks for your input. I'm probably one of those persons you describe in the last paragraph. But, I'm trying and this album is really helpful...\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nThe song is put simply. We are alive experiencing the world from this \"parabola\" (reference point). Also we live forever (\"eternal\") and pain is simply an \"illusion\" (the brain creates pain). Embrace your life because \"it's your chance to be alive and breathing\". The music video best defines it.\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nThe song is about life experiences. Barely remembering what came before our life. And how we are choosing to remain alive. Also how the body is the only thing holding in his spirit, and how being trapped inside his body makes him feel pain that if his spirit was without a body he wouldn't feel. How life is just a cycle and every person goes through the cycle, but realizing that living is a gift and curse.\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nOut of curiosity does any one else see the dragon?\r\nMan, it would be badass if someone knew what i was talking about.\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\nthe experience he talks of kind of sounds like having a great moment of realisation, an epiphany even. Feeling connected to the whole world trough one soul that is shared, loved and abused by all. Maybe a feeling gained from tripping in a sensible and spiritual way because he can't remember anything else before this amiazing feeling? Renewal and all. I dunno, thought of that before i read everything else, it just popped into my head when i was listening to it just then. peace :)\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nthe experience he talks of kind of sounds like having a great moment of realisation, an epiphany even. Feeling connected to the whole world trough one soul that is shared, loved and abused by all. Maybe a feeling gained from tripping in a sensible and spiritual way because he can't remember anything else before this amiazing feeling? Renewal and all. I dunno, thought of that before i read everything else, it just popped into my head when i was listening to it just then. peace :)\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nPersonally I think Parabol and Parabola flow sooooo well it has to be interpreted as one song rather than 2.\n\r\nPreatty much the song is an epic on life.  Parabol is about being concieved, so basically it's about sex.  It's soft and slow, basically like making love, so it's not about rough sex.  It's about  passion.  Once the last part comes in, it's about being a fetus.  Everything's so peaceful and soft.  Than suddenly birth starts and the baby starts to panic, but eventually calms down because the \"pain is an illusion.\"  The biggest hint I have to this meaning is the titles.. their ALMOST the same, except Parabol is incomplete.  It turns into parabola when life commences and thus is complete.\n\r\nNow onto Parabola.  So the song picks up and get intense... I mean to my meaning birthgiving is intense, so it makes sense.  The first verse is ALMOST the same as the last verse, which gives me the feeling the meaning is intertwined.  It represents infancy and how every thing is a blur.  You don't remember or think about anything but the present, which can see how the two verses come together.\n\r\nNow the middle, slower part is about maturity.  Everything slows down and you begin to think everything over, which can sometimes lead to suicidal thoughts.  Yet, in the end, you appreciate life and value every day you live.  The song picks up for a little bit to represent the last rush you have before a slow, calm death in the end.\n\r\nThe song(s) overall is the best ever.  It's my second favorite song by Tool and it's amazing to listen to.  It's the only song i can ever think deeply about.  I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nThis song is about finding your inner spirit\t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\nI am getting this song tattooed on my left rib cage in like two weeks. Gonna go well with the 10,000 days eyes on my chest and the cross from the parabola music video in the center of my chest. Also thinking about getting that double helix from the video on my spine. What can I say, there are few things I love more than tool and tattoos.\t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nalright so this song in my personal opinion is about maynards spiritual experiences with God, when he mentions his \"holy experience\" and that \"pain is only an illusion\" and also that we are eternal, all of this suggests a relation with God\t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\nThe songs about a soul and it's experience as part of life. The dual nature of conciousness and dreams is given as the meaning of the parable. Every time you sleep, you wake up. Like a cycle. Rise and fall. I'm sure its like a shape.\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nThe song IMO is right along the lines of the study of Vipassana Meditation. Meditating within the body to enhance the sense of reality in the present moment, to un-condition the mind from straying into thoughts of the past or future. It was difficult to concentrate on the meditation once I figured it out just because this song and the art-work that Alex Gray mixes in with Tool's music ties in so so well with what I was in the process of learning about..\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\ni think this song is about ear muffs.\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\nIn my opinion, this song is much simpler than some of you are making it, but I'm not attacking anybody, I'm just speaking my mind.  Like it or not, this is part of a concept album by definition.  The concept being spirituality.  This song is merely a celebration of the fact that we are all wandering eternal souls who have obtained a chance to exist within a human body, and how we should savor every moment here because though we are eternal our bodies are not.\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nThis is an existential love song to the self. The choice to stay on this mortal coil is the holy experience in itself.\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nThe beginning sounds like something from the Smashing Pumpkins.\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nThis song can mean ANYTHING to anybody... thats why its so good.\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nFairly certain this song is an allusion to sex, guys. Take out every part that refers to the divine and see what you get, but he is saying it is something that is healing and holy.\n\r\n\"Choosing to be here right now, hold on, stay inside\r\nThis body holding me, reminding me that I am not alone in \r\nThis body makes me feel eternal, all this pain is an illusion\"\n\r\n\"So familiar and overwhelmingly warm \r\nThis one, this form I hold now \n\r\nEmbracing you, this reality here \r\nThis one, this form I hold now \r\nSo wide-eyed and hopeful \r\nWide-eyed and hopefully wild\" \n\r\n\"We barely remember who or what came before this precious moment \r\nWe are choosing to be here right now, hold on, stay inside\"\n\r\n\"choosing to be here in \r\nThis body \r\nThis body holding me \r\nBe my reminder here that \r\nI am not alone in\r\nThis body \r\nThis body holding me\"\n\r\nBut anyway, songs are supposed to mean what you want them to, not just what one person intended.\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nA lot of other Tool songs have subtle sexual undertones, and I don't think this one is an exception. But really, songs shouldn't mean one thing. They should mean many things to many different people. Even if it has allusions to sex, it isn't just talking about sex.\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\nThis song is definitely about the birth of Maynard's son. If you read the lyrics of \"Parabol\" which is the introduction to this song, it describes something as \"so familiar and warm,\" Something \"so bright eyed and hopeful,\" such as a child who's never experienced pain, \"familiar\" because he looks like he's family. The lyrics about himself which seem out of context for this interpretation are him opening his heart and soul to his son, praying the boy can overcome challenges that hold most people back, or maybe him experiencing the \"feelings of  eternal\" for the first time. Seeing your son being born is quite a profound experience, and makes most people get pretty philosophical about life. Maynard is brilliant at masking his meanings, and using double meanings. Another good interpretation is that this is simply about life in general, but just scratches at the surface of Maynard's motivation for writing it.\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nPlus, the song is called \"Parabola\" because a parabola is a mathematical measurement of exponential growth out of one point. The whole point of human life, according to maynard, is to be constantly growing and learning and experiencing things. If you stop growing, you cease to exist, or at least start shrinking. Nothing is at rest in our universe.\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nSorry for not just putting this all in one thread but i had another thought:\n\r\nDual-nature of parabolas (two sides growing exponentially and symetrically out of one point) relates to the dual nature of life maynard talks about. The pain is there, but its an illusion to hide to pure life force of living in the moment.\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\ni think this song could be about tripping. thats just what it brings to my mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_321": "\nI've just spent a while reading over some of the great many theories on this song. Some believe the song is about Maynard's love for his son, some think it's about the human spirit and the evolution of our consciousness, some believe, for good reason, that it's about sex or drugs.\n\r\nWhat I love about Tool is that to every one of these thoughts there is a good degree of truth. I think that it's very possible that every one of these things were sources of inspiration for Maynard in this song; all were running through his head.\n\r\nIt is well known that Maynard is a big-time mushroom user, as it is that a good lot of their songs have deep sexual innuendos -- and, though sexual they may be, not one of them is conventionally perverted, as you will see in so much modern pop culture, but rather they convey a far deeper message derived from or using sex as a metaphor, we're seeing quite possibly the same thing here.\n\r\nThe beautiful, but progressing weave of poetry in this song was clearly a derivative of Maynard tripping, which, in every way, means it comes from that much deeper within him.\n\r\nI believe that Maynard's son Davo could also play a large part in this song, his feeling 'eternal', in that he may be living on through his son. This song could just as much be about his son as it could be a deep reflection on the night of his son's conception. The act, and the emotions therein.\n\r\nThe human consciousness was the constant theme throughout this album, and this song is clearly no exception in that regard. The lyrics \"This body holding me reminds me of my own mortality\" sound as though they were spoken from the perspective of a soul, about the body holding it. The lyrics \"Feeling eternal, all this pain is an illusion\" is where I draw validity for my previous statement. In a lot of religions and in most spiritual beliefs, no matter what pain may come, once you're dead your soul lives on forever, your soul can't feel pain, and in this regard pain is an illusion. It's a physical sensation, merely brainwaves.\n\r\nThere're a lot theories out there, and Tool has always encouraged people to use their brains, so try to derive a meaning for yourself. Never be satisfied with a thought! Open up your mind and 'spiral out.'\r\nWrong song, I know.\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nSons, Sex, Drugs, Spirits... Maybe, But its A KICK ASS SONG! I think we can all agree on that.\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\n\"parable\"/\"parabola\" play on words:\r\nA parable teachs a moral and a parabola is a curve and its reflection.\r\nMost parables and sayings have another parable that tells the reverse to be true.  ex. \"haste makes waste\" and \"he who hesitates is lost\"\n\r\nMaynards Mom:\r\nMaynards mother, Judith, suffered in a moratal body full of pain but recognized it as a holy gift and was able to celebrate her chance to be alive and breathing.\n\r\nThose 2 things stated:\r\nI agree it's mostly about the birth of his son.\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\nI could break down and interpret every line in this song (one of the reasons I love Tool so much), and I agree with schism5 that any one of several different theories has some truth to it.  The best part about a well-written song is ambiguity.  To a certain extent, it is up to the listener to come up with their own idea about the meaning of the song.  To me, it's an overwhelming message that we should be thankful for our time in this life, regardless of whether there is an afterlife, and that we should make the most of what we are given.\n\r\nFucking awesome song.  Fucking awesome band.  Also worth noting is that Danny Carey is hands down one of the best drummers in rock. So, yeah.\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\nHands down one of the best songs out there.  Now add this: youtube.com/… and you get THE best song out there.\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\nDimethyltryptamine (DMT)\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nI really dno what its about to be honest, i think most of the meanings could be right, but this song always reminds me of religion, thinking that there might be something out there and that this might not be our only life, i know im probably far off :)\t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nI think Mindblow nailed it. Also strmthecitadel has a very good point everyone should try DMT it is probably the most amazing molecule in existence. Can't wait to extract some this summer =P. \t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nHoly shit. What amazing comments, especially by mindblow. I was virtually having goosebumps after each sentence you had written! The illusion of what life means, of trying to define things and forcing people to adhere to it through religion, of \"educating\" children for the first 20 years of their life and restricting them from having sex - I wonder if any God would have wanted that...\n\r\nI am just glad that Tool helps me in reminding that I shouldn't just go to my 8 to 5 job every single day, but once in a while ponder about the beauty of life and all things that surrounding me. I used to do that when I was a little teenager, now I am just another sprocket in the fucking machine - the machine that does nothing other than help other machines to work more efficiently. Thank you Tool, for making my life a little less miserable...\t\t\t\t\n\t\t\t\t\n\n", "comment_330": "\nI think the song is about dying, \r\nand what a person feels like at the moment of death. \r\nThe body as, as we all would, trying not to die and hold the soul inside. \t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\n\"this body, holding me, reminding me that i am not alone\"\r\nfor me this is my own body. holding my soul.\r\nsomething like that. \r\ni don't think that it's a sex type thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nI wonder if this song isn't about chocolate pudding. Let's break it down...\n\r\n\"We barely remember who or what came before\" - we're totally lost in the wonderful taste. \n\r\n\"this precious moment . We are choosing to be here right now\" - self-explanatory.\n\r\n\"hold on, stay inside\"  - I don't want to eat too much or I'll throw up.\n\r\n\"This holy reality. This holy experience,\" - either it means \"this is heavenly\" or perhaps it's about the holes the bubbles make.\n\r\n\"choosing to be here in This body This body holding me\" - now we are switching to the consciousness perspective of the pudding itself, as it forms in the pudding bowl from the various elements.\n\r\n\"Be my reminder here that I am not alone in This body This body holding me\" - this is just gorgeous, it's an exposition of that last point, the multiple ingredients coming together as one, it's a metaphor for the Trinity.  It just makes my spine tingle.\n\r\n\"Feeling eternal, all this Pain is an illusion. Alive!\" - the pain of being cooked in an oven to almost the point of ignition, doesn't matter now, it is an ephemeral part of the transition to oneness and  wholeness, a rite of passage to destiny.  Now this is life!\n\r\n...\n\r\n\"Swirling round with this familiar parable\" - spinning and tapping the (correction) PREP-BOWL, to settle the contents.\n\r\n\"Spinning, weaving round each new experience\" - of course you change direction regularly to get out all the lumps you experience/encounter.\n\r\n\"Recognize this as a holy gift\" - self-explanatory.\n\r\n\"and Celebrate this chance to be Alive and breathing\" - wow! Isn't that an awesome reverse metaphor for the steam rising from the pudding as it is removed from the oven?\n\r\n\"This body holding me reminds me of my own mortality. Embrace this moment, remember: we are eternal, all this pain is an illusion\" - I too, wish that this transcendental moment could last forever, forgetting tawdry reality, lost in communion with God's sweet love.\n\r\n... So there you have it.  I think it's pretty convincing.  But I admit I could be wrong.  For me though, chocolate couldn't just occur in a random universe, it proves God exists.  Same with beer.  And I think that's the point the song is making.\n\r\n(Note: I am actually Christian.  I do take God seriously, just not myself or others.)\n\n\n\n", "comment_333": "\nits\n\r\nabout\n\r\nUNITY!\n\r\n:D\n\r\nARVUT!\t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nthis song defiantly reminds me of racism.\r\nthe music video made me think of this. \r\nif you go to 8:08, around there, it totaly make me think of racism.\r\nthe ball floating around i think represent racism\r\nand at 8:23, Maynard says \"This body holding me\" and they have a black person looking depressed, like being stalked by the ball.\r\nthats what i think a bit\n\n\n", "comment_335": "\noh yeah, and then at 9:00 in the music video , its showing the inside of a person, and on the inside, were all the same\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\nMy own interpretation... If you on live in present, you barely remember who or what came before; because is sensless, you're only here and now, so whatever past or future... have no existence. Just now, and now you can't remember nothing, if you remember (or go to your future), you lose your present, it's simple.\r\nIf you have seen the videoclip, you'll notice a little \"human\" with \"nonstop moving face\", my interpretation is... that is your EGO, always moving, always with no relax... \"HE\" moves wide in your head and does whatever he wants... when you \"sit\" your head, then appears that \"ball\" I think that's wisdom, and definetely, wisdom kills your own ego, but is not \"Your\" wisdom, is wisdom, nothing more. And once killed... you're free finally you are no more yourself.\r\nThat's the meaning... kill yourself, kill you ego, crucify your EGO. And finally be free, free from yourself, free from the neverending wants of your EGO.\r\nIt's about freedom. Freedom for your selfish EGO.\t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\ni think this song is so much more insightful than most people would think.\r\nfucking powerful ass lyrics tell me that theres really something trying to get across to the listeners\t\t\t\t\n\t\t\t\t\n\n", "comment_338": "\n*Sings the normal lyrics but later*\r\nChoosing to be hearing.\r\nThis Body *voice cracks up*\r\nThis Body Holding Me.\r\nYou'll feel eternal...motherfucker\r\n*Spikes down the mike and walks off the stage*\t\t\t\t\n\t\t\t\t\n\n", "comment_339": "\nWhen I read the lyrics I thought of two things this song is about. The first is a Hindu belief that all Gods are incarnations of one God. That humans and everything else is also part of the one God. That this God manifests itself in so many forms to experience itself. And does so by the method of reincarnation and birth (the second thing). Everything the God then experiences is it's own illusion and we humans believe it to be reality. I hope that's accurate.\t\t\t\t\n\t\t\t\t\n\n", "comment_340": "\nthis has probably been said before in comments, but this song is about \"conciousness\" in the buddhist context.\n\r\nThe body is merely a shell, the conscious self (which is indeed the complete self) is everlasting and is merely held inside it temporarily. \"This body holding me reminds me of my own mortality\r\nEmbrace this moment, remember: we are eternal, all this pain is an illusion.\"  \n\r\nThe tenets of tibetan buddhism describe all parts of the human experience as being external... merely an illusion, \"all this pain is an illusion\"\n\r\n The soul is an energy which can inhabit many forms, and is reincarnated 49 days after death of its host into a new form. The new form is not always human, or even earthly. This song is celebrating the human incarnation of the \"self\".\n\n\n\n", "comment_341": "\nI'm sure someone must have mentioned it somewhere within these posts...  This song (even according to Maynard himself) has to do with the fact that we, humans, are comprised of particles - same as everything else in the universe (being 'one' with the universe - eternal, since when we die, we are STILL particles within the same universe, just no longer in the same form) - and that we have come into being as an observer (in the form of a living, conscious, human body) and we are to appreciate this form to its utmost while we are in it. \n\r\nWithin this wave of particles (the universe), we take a bodily form (containing our consciousness) for a short period of time (remembering that we are still comprised as the same material as the universe itself, hence being 'one with the universe'), having the 'holy experience' and 'holy reality' of living as an observer (with a mind to perceive experiences, held together or contained by our bodies) within this universe. \n\r\nHaving said that, then, matter is essentially intangible, if you consider all matter is comprised of the same particles within the rest of the universe. As 'observers' of the universe, we should realize that what we experience is only our perception; Therefore, we are in control of our own experiences and must consciously realize that pain is simply a perception (as an observer to the universe) and, as such, it's just an illusion (that we've perceived in this body that contains this observer of the universe of which we are one in the same). \n\r\nWhew. That was a mouthful.\n\r\nThis is the crossover between science and religion.\n\n\n", "comment_342": "\nI beleive this song refrences the spirit. The holy experience about unity with everything. Our souls are considered one, with what some would call god, or the universe and we are always apart of the cosmic force. Also, our souls never die, and choose when to leave the body when it feels it have evolved as much as possible in the present form. Living eternal, any pain we feel here is just a concept of the definition, and is an illusion. Your souls reason for joining the body is experience.Maynard is a complete genious, and while many believe him to be antigod, he is closer to true understanding than any devout Christian. He songs all reference this enlightenment. He also states \"choosing to  be here and in this body\", because we are constantly creating our own reality by what we feel think\r\nand believe. The soul chooses to occupy the body by conscious creating. The spirit or soul has complete understanding, and our our physical bodies and mind know this, and all we must do is to simply remember what we already know. \t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nAll of Tools songs can be interpreted differently, but for some reason I feel like this is about one of the members child being born. He is holding the body of his newborn child and feels such happiness that pain is an illusion. By saying \"this body holding me\" doesnt have to literally mean the other person is actually holding him, He could be holding it.\n\r\n\"This body holding me reminds me of my own mortality \r\nEmbrace this moment, remember: we are eternal, all this pain is an illusion\"\t\t\t\t\n\t\t\t\t\n\n", "comment_344": "\nTo me this song is not really about life, but instead the death of a man, the appreciation of life he had, and the ascension of his own soul.\n\r\nThe last 26 seconds of the song is pure gold. The eye captivating music video shows a man as he becomes one with everything around him. I never thought that he died until he poses as if a corpse in a coffin or sarcophagus. The endless stream of parabolas that follow this segment kind of reinforce the whole death sequence. \n\r\nThis is merely my interpretation of a great song. TOOL RULES! \t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nI now have a new perception of this song, by reading these interpretations along with that of The Grudge.\n\r\nI have come to realise that I have always been someone who turns a negative situation worse by getting into bad moods, feeling unchangeable... wearing it like a crown of negativity.\n\r\nParabola to me is the reminder that I am alive and breathing and that I should be grateful and not too perfectionistic towards life.\n\r\nThe line \"Celebrate this chance to be alive and breathing\" is getting stickered to my guitar amp to remind me of this.\t\t\t\t\n\t\t\t\t\n\n", "comment_346": "\ni think this song is about being trapped in \"this body\" or this world. maynard is trying to reach above our mortal lives to become eternal, but towards the end of the song the auditory tone becomes more angry and desperate, implying that maynard understands that this is impossible, hence the line \"This body holding me reminds me of my own mortality\". then, in the last line of this song maynard states that \"Embrace this moment, remember: we are eternal, all this pain is an illusion\", which i interpret as him believing that while out body may not be eternal the spiritual \"being\" exists for eternity in some form or another.\t\t\t\t\n\t\t\t\t\n\n", "comment_347": "\nFlyAnts said (many moons ago): \n\r\n\"Our soul is what makes us different from every other person. It is my personal belief that our soul is the same thing as our mind. Our body gives our soul a chance to experience life and what it means to be alive.\"\n\r\nI agree that the soul, the spirit (aka 'breath of life'), the mind, etc. are all names for the emergent phemomena of self-conscious cognition resulting from being embodied by our particular form. These capacities are specific to human physiology. All life is cognizant to a certain degree. We just happen to be aware of ourselves in relation to the external environment in a self-reflective sense, the highest known form of awareness. Our form is rare, complex, and robust and thus precious. We should not take our embodied form for granted. This 'body' that we have is it. It's all we have. It is everything to us. Our bodies coming into contact with the external environment beget and shape our unique minds; only then do our unique minds enable our bodies to fully experience life. Therefore, our bodies and minds/spirits/souls are actually one in the same (the phenomena of 'mind' emerges from the body's interactions with the world). The idea that they are separate, discrete, compartmental facets of existence is completely false. Being embodied as a human being is a rare, precious gift that should be treasured by anyone lucky enough to be born into this form. Experiencing life as a human being is being in heaven. It is the most holy reality and the most holy of experiences. I believe the realization and celebration of being embodied as a unique human being is what the song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_348": "\nI take the lyrics of this song quite literally in the sense that they are spelling out the basis of life in the universe. For example, my own research has lead me to believe that we truly are eternal beings inhabiting physical bodies. That there is an underlying fabric, god if you wish, that permeates through everything, this is what makes life possible, this is what gives atoms and planets sin, toque and angular momentum. Little to what is known, and this is all speculation from here on, it seams most of use chose, literally made a conscious decision to manifest at this point in time before being born. To do what you ask, to gain experience and learn. The ending lyrics explain the trials we must go through to gain experience ending with the fact that we are mortal within these bodies, yet we are all one emanating from the same source. If any of you have seen the music video, the ending art helped done by Alex Grey shows the physical body becoming one with the energetic background of life. This song blew my mind when I actually ready the lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_349": "\n@BadMonkeyFinger\n\r\nThank you...\n\r\nThis reminds me a speech made by an brain researcher Jill Bolte Taylor over her experience a brain stroke... She definately understood what was going on inside her body during the stroke...\r\nhere goes the link with around 31 subtitles available, guys...\n\nted.com/talks/…\n\n\n", "comment_350": "\nDeminois: I go right a long with your statement. Though, I believe that for a person to completely understand this song, they must undergo it's meaning. They must live it. It is a state of mind every person should grasp. It's what helps us go about life.\t\t\t\t\n\t\t\t\t\n\n", "comment_351": "\nAlthough many users before me have said this, I think that this song is about the existance we know in contrast to our true existance. The word choice indicated that the physical body is only a vessel for something grander-the soul. This life is an experience, and a great one at that. Life is magnificent and we are blessed to have the opportunity to live the lives we have. Even when we are going through tough times, we exist and that is a beautiful thing.\n\r\nTOOL is definitely my favourite band, this is my favourite song by them.\t\t\t\t\n\t\t\t\t\n\n", "comment_352": "\nThis like most Tool song is writen in a form which can be interpreted in many different ways. It can be taken litteraly as two bodies embraced making him feel alive, or, you can look deeper into the lyrics and pull out the true meaning of the song. There are many interpretations but i believe it to be a glorious realization that we are going to die and it is this knowledge that gives life its true beauty. The fact that our time is precious, and should be seen as a gift not to be squandered. We share this abstract collection of experiences called life with billions of other individuals, we just need to take a look around and embrace the moment and realize what it really means to be alive. \r\nAlthough I could be wrong :) \t\t\t\t\n\t\t\t\t\n\n", "comment_353": "\nnow call me crazy.. buts omething about this song really resonates with me.\r\ni dont kno if you all believe, but i am a STRONG believer in past lives and reincarnation.\r\ni find it so weird how many things in my every day life \"resonate\" wit me, or make me feel as if ive seen it before, done it before,...or jus plain out familiarizes itself wit my soul.\n\r\nthis song is one of those things. Every time i hear this song, its like it calls out to my soul??\r\nnd my interpritation of it is that he mite be speakin of past lives?its like EVERY word of tha song is about that.\r\nhow our soul remembers everything thing we have bin thru, even tho our minds dont.\r\nwe CHOOSE this life we are living rite nw, we CHOOSE to go thru all this temporary pain.\r\nour souls kno this, as we continue to grow spiritually andgo thru all these new experiences.\n\r\nJUST MY INTERPRITATION-BUT THATS WAT THIS SONG MEANS TO ME!\t\t\t\t\n\t\t\t\t\n\n", "comment_354": "\nThe official music video to this song is flat out WEIRD! Aliens, Floating killer ball thing, floating people with blue stuff coming out of their mouths, randomly cutting an alien with a face problem in half, a blue apple! Whoa!\t\t\t\t\n\t\t\t\t\n\n", "comment_355": "\nIf anyone has ever tried or read about DMT, you'll understand the meaning of this song. The pineal gland and why it's called the third eye; because it actually possesses a lens, cornea, and a retina; and physically sits dead center of the brain, in between ur eyebrows.\n\r\nI'll go ahead and explain to everybody just EXACTLY what this song is about but to see eye-to-eye with me on this, please jump to the bottom of this comment, and look up the search terms I provided; THEN read the rest.\n\r\nThis song indirectly references the pineal gland \"the third eye\" in regards to that being the \"seat of the soul\". We choose to stay alive and go on this \"holy experience\" he speaks of because the energy (which is YOU) chooses to be in this body that's holding you (meaning the energy). We can easily disconnect from reality. Reality is a matrix, and matrix is an illusion. Energy never dies; it's always transferred on in some other form. Therefore, when you die, your physical body dies, not the soul or energy, it carries onto some other form. Therefore, pain is an illusion because everything you see, touch, smell, taste, or hear merely does not exist.\n\r\nWe go to bed every night accepting the fact that we will have a dream and wake up the next morning to carry on with our day. However, very seldom do we ever question what a dream is and how it occurs. It's too much to explain but I will tell you the key terms to search for to read about:\n\r\nGoogle search:\r\nPineal Gland\r\nThird eye\r\nDMT\n\r\nThese three search terms will explain A LOT! Once you've learned about the pineal gland and DMT in connection with dreams, you will be so fascinated that you'll end up reading more and more. And the more you read, the more you're going to want to try DMT. And when you do try DMT, you will understand life in its purest form and what ALL THIS is about.\n\r\nEnjoy!\n\n\n\n", "comment_356": "\nParabola is the best Tool song ever!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_357": "\nI dont know much about this band, but there videos and songs are mindblowing, i think this song is about a persons liberation from the ego and ignorance and fear,(all represented by the little stick man figure ) the flying ball  could represent the world or \"Mara\". \r\nthe weaker self of ego,fear (the stick man) is literally torn apart by the flying ball (by the world) so the human suffers.\n\r\nTrying to escape from himself he runs, but sees that where ever he goes the \"demon Mara\"(the flying ball) will alway be there, theres no escape it seems. \n\r\nThe leaf is symbolic (perhaps its meant to represent the Bodhi tree?) in the forest he realizes the \"Great Awakening\" like of the Buddha, where he discovers the Middle Path. (the highest point on a Parabola)\n\r\nAfter enlightenment he is transformed and becomes invulnerable.\n\n\n\n", "comment_358": "\nThis is is talking about our souls in a physical body... that there is more to us beyond human.  We are not human beings having a spiritual experience, we are spiritual beings having a human experience.\n\r\nPain is an illusion- Our physical life is short as oppose to our spiritual life.  Our human life gets us ready for our afterlife...  our real life, eternally. \t\t\t\t\n\t\t\t\t\n\n", "comment_359": "\nOH... and its about a DMT \t\t\t\t\n\t\t\t\t\n\n", "comment_360": "\nI feel like he is talking about his son. This body holding me could be his sons embrace.We barely remember who or what came before this precious moment, When you have a child they become your whole world, the past almost is non existent. Well thats at least how i feel since my sons birth\t\t\t\t\n\t\t\t\t\n\n", "comment_361": "\nTo me, this song is about coming to terms with the truth, be it pleasant or not - \"this body holding me reminds me of my own mortality\"...mortality is a pretty scary prospect, especially one's own mortality -  then embracing it and learning to love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_362": "\nI love this song, the MV to it is so wonderfully creepy!\t\t\t\t\n\t\t\t\t\n\n", "comment_363": "\nit's cool that you can find examples for this in daily life , if anyone is an artist or a musician, you'll know that when you are asked to sketch something exactly how it is, you have to look at the object you are drawing most of the time, if you look at your drawing too much it would only look like what you have seen before or the past wich= repeat or drawing something that doesnt look like the object at all....so, in order to understand what is happening and to be shown your 'way' or 'path' that leads you to your desire, you have to be in the present , and slightly glimpse at the past or future when you are guided to do so....or else you can't create or be created through an existense that you can't understand, you can only 'feel'...but i always thought it would be the other way around, that 'I' was my mind or body and i had a soul that i would seldom be connected with, but it appears that maynard is saying we are our souls and we have to get connected to our bodies...(?) but in lateraus says the opposite.....idk...\t\t\t\t\n\t\t\t\t\n\n", "comment_364": "\nI took the video, song, and music in more of a meaning that isnt of humanity and philosophy but as a metaphor of something like the universe.\t\t\t\t\n\t\t\t\t\n\n", "comment_365": "\nIf \"Parabol\" is all about child being inside Mother's womb and act of birth, \"Parabola\" is all about life and gift of being alive and ability of breathing. \nAll the time Mother is the reminder that child forgot everything what was going on inside womb. No man can remember that part of the first nine months of their life.\n\nAct of learning and experiencing the Life: \"Twirling round with this familiar parable.\nSpinning, weaving round each new experience.\"\n\nHere child from \"Parabol\" meets other children and breeds with them. So this makes child (Life) eternal.\t\t\t\t\n\t\t\t\t\n\n", "comment_366": "\nI recently watched something on evolution and it really made me think. \"We are eternal, all this pain is an illusion\" really is true.  At this present moment you may be in pain, in despair, or depressed, but in the end it all comes to pass.  \n\nYour present body is your only awareness, you don't think about 'who or what came before' only yourself and what will happen to you. \n\nPain comes from your mind, but our mind is more complex than any other, which is our 'holy gift', we need to recognize the holy gift and celebrate the fact that we are here in this moment, and what our body is made of will be around for a long time to come.\t\t\t\t\n\t\t\t\t\n\n", "comment_367": "\nAcid.\t\t\t\t\n\t\t\t\t\n\n", "comment_368": "\nTool refers a lot to the body, but then also continues to bring up being \"eternal\" as in our mind makes us eternal. They separate body and mind because they really are. I'm not exactly sure what they mean by body... but the line \"Recognize this as a holy gift and celebrate this chance to be alive and breathing\" (one of the best tool moments imo) gives me the impression they mean it as if you should always take this into consideration. This doesn't relate to the song much but our bodies are just survival machines for our mind. Any pain you suffer in your brain that's not related to protecting your body/mind (burns, cuts) is not worth it and really is just an illusion. Focus on the now, don't get too caught up in things because from what we know life is a remarkable event that should never go to waste.\t\t\t\t\n\t\t\t\t\n\n", "comment_369": "\nIt seems to me that he's always been sneaking this sacred knowledge in our ears, as he's been discovering himself and how the universe truly works. I met him briefly in 2000. He's absolutely a full on intellectual so I'm not going to address all the frat boy logic that it's another song about sex. No, he carefully thought about the order in which he approaches each step in the direction of crossing the transcendent dimension. \n\"We are eternal, all this pain is an illusion\" In fact energy is eternal. It cannot be manufactured or destroyed. Our flesh is not immortal but the energy that drives each body is. Therefor so are we. Elkhart Tolle says death is not the opposite of life, it is the opposite of birth.\nA fair warning of the damage one can inflict on themselves emotionally and spiritually if you get wrapped up in egotistical stone throwing self righteousness. \nAll those hateful thoughts bearing down on you for someone else rot in YOUR skull because you are the one married to your pettiness and pride, ego, narcissism etc... \nMore often than not the hate we project towards those who slight or wrong us comes from within. It's practically compulsory for some. Sadly. \nIf you want to dig deeper into the subject of self realization and universal consciousness there are several authors I reccomend on both sides of the issue.\n\nE. Tolle, the power of now is a great place to start.\nThe basic fundamentals of einstiens theory of relativity is available a ton through a quick google, and anything you want to know about planetary interactions is readily available online as well. You must be specific when wording however or you'll get a boat load of horoscopes.\t\t\t\t\n\t\t\t\t\n\n", "comment_370": "\nthe proper order of this entire album is known as the holy gift. it is based upon a Fibonacci ordering of the songs. this song (parabol/parabola should be one song really) is at the beginning. it's about the gift of life and the amazing thing that is.\n\nwe kinda all KNOW we have SOMETHING of a life force in us. some won'gt admit it, but we all know. we know what some call a soul came from SOMEWHERE and we where SOMETHING. in many ancient, esoteric beliefs, our souls are contained in a body, but are NOT our body. they are the form the universe expresses in a physical manner. We are wide eyed and wild, curious, seeking to understand. this body we are in is not real and what we really are is in fact much, much more.\t\t\t\t\n\t\t\t\t\n\n", "comment_371": "\nWhile it's almost certainly unintentional, especially given Maynard's thoughts on organized religion, I just released the lyrics to this song are Mormon as hell. It appears to contain the theological concepts of premortal agency (We are choosing to be here right now), the veil (We barely remember who or what came before this precious moment), body/spirit duality (This body, this body holding me, feeling eternal), the divine purpose of life is to be happy (Recognize this as a holy gift and celebrate this chance to be alive and breathing), and eternal life (Remember. We are eternal.).\t\t\t\t\n\t\t\t\t\n\n", "comment_372": "\nI know TOOL writes songs about enlightenment and their art involves the third eye, and heavenly images and writes songs that focus on spiritual growth.  But sometimes I think people over elevate the lyrics, to believe that they only focus on a magical realm of enlightenment.  That's too simplistic.  The beauty and truth in their writing is that they are us.  They are human, and in order to elevate yourself you must do it through dealing and mastering (as much as possible) the human world.  You are thinking that their every thought has to be above this world, and in reality they are telling you that the beauty and enlightenment you seek is not in a magical fairyland, it is right here, within you, within the world.  Just open your eyes and soul and see it. I think their lives, are not alien to ours.  They eat, sleep, get annoyed by others, have done drugs, have sex and feel love, and they write about these things as well as a place of enlightenment to be found on the other side of them.  In fact, every enlightened song they write that deals with enlightenment, deals first with working through the struggles of this world.\n\nTo me, Parabol and Parabola are love songs.  They are referring to the act of making love.  Sex can be a filthy thing, if you treat it like a physical release into the first thing you find, like driving a rusty nail down another needy hole, just satisfying our physical need.  But if you realize it can be something much more, you can feed not only your physical hunger, but your spiritual needs, it can be a holy experience.  There are no magical fairy tales, there is only the truth that is available to us.  Find your holiness inside of yourself.  Love is a beautiful holiness that you must first find inside of yourself.  If you find someone who can find that same beautiful holiness inside of their self, and they share it with you, together you make more holiness in your union, than is possible by just yourselves individually.  That spiritual union of two becoming more than their separate selves, unlocking the soul from the body somehow, is a holy gift.  \n\nIf you are truly making love, you can lose yourself in it.  You would not be concerned about who or what came before that precious moment or anything else.  All of that would be the furthest thing from your mind.  The current experience is so great, you are totally enveloped by it.  How many other things can you say that about.  \n\n\"This holy REALITY.  This holy experience.\"  Again, the enlightenment you seek is within you. -  This is not a reference to some out of this world magical place.  It is real.  It is here and now, but it is holy.  They are always trying to tell you that.  They are trying to be your tool to help guide you to find your own way through this world.  The anger felt in so many of their songs is the fact that we often don't seek the holiness, we usually shit on it.  This place, earth, this existence could be so much more, but we give into being shitheads and make it a hell on earth instead.    \n\n\"Choosing to be here in this body.  This body holding me.\"  (He is speaking of his lover who is in her (or maybe his) body (not his own), that is holding (in a loving embrace) \"me\" (his own).  And she is choosing to be there (in body and spirit, to give love).  Obviously her body is there, but why he says she's choosing to be there is because she's choosing to be there totally, on a higher spiritually loving level, prepared to pull her soul out of her body to entwine with his soul.  It's amazing that in this world filled with evil you can find that.  And that's why he says a line like, \"choosing to be here\", which otherwise would be a mundane indicator of location.  But he means so much more by it.  You can see how this line relates to the other about not being aware of anything else.  You wouldn't be if you were truly \"choosing to be here\". \n\nThere's a bit of a clever play on words....like they do all the time.  This body, sometimes is referring to him and sometimes is referring to the other person's body.  That's why it repeats.  He introduces her body holding him, inside of his body holding him. \n\n\"Be my reminder that I am not alone\" Pretty self explanatory don't you think.  It goes to my point that this is something shared with somebody else, not a song of just SELF enlightenment, but finding it WITH somebody else, which is even more \"magical\" if you will.  His real self, his spiritual self, is not unreachable or untouchable locked inside of his own body.  For this holy experience somebody is truly able to touch his soul inside of his body.  He has been reached there and now realizes he is not isolated alone in there.    \n\n\"in this body.  This body holding me\" He is speaking of his own body now.  The physical vessel that is holding his real self, his spiritual self.  He speaks of it objectively because he knows he is much more than that physical shell that just holds the real him.    \n\n\"feeling eternal. All this pain is an illusion\".   While there is no magical fairyland that is going to dump magical holiness upon you, there is a holiness to be found and felt.  It is within yourself.  And somehow, for some reason, there is something holy about making love that bares your soul like nothing else does, to someone else's, and them to you.  And when you are touching souls like that, intertwining souls, it lets you know, that you can come out of that physical shell of yours, that you can be touched inside of it.  That you are not locked in there alone.  That it is possible to not just hold hands, but hold another's soul.  And when you realize that, you realize that you are not locked in your body, you are able to be reached, then you realize that you are not alone.  It is possible to escape all of this pain in the world, at least during that holy experience.  To be able to experience that is \"a holy gift\".  \n\nAnd when you experience this out of body experience, if you hadn't already known, then at that point you realize that we are more than the body, that \"we are eternal\" and once you realize that, then you realize \"all this pain is an illusion\".\n\nIt's amazing that when I refer to this as a love song, people think I'm crazy.  Then I get sad for them, because if they can't understand it, maybe they've never felt it.  \n\nI must admit that I'm in my 40s and some of what TOOL writes, must be lived to be fully felt or understood.  I don't mean to downplay a younger person's existence.  It's like they say with blues.  You have to have felt them to play them well.  Someone who's been lucky enough to never really live a hard life, truly wouldn't understand or feel the depth of the blues.  The anger they express from the frustration that others bring to their lives, must be experienced to understand.  The damage it does to you and the low places it takes to you must be felt to understand.  The realization that they have taken control of your life and made you an angry, unhappy person and the weak desperation of that, is something you must go through to feel.  Finding a path out of that, finding your own peace, growth and higher level is also something that must be experienced to understand.  It's not a moment of enlightenment and I'm there instantly \"Praise Jesus\" - LOL.  Instead, it's a tough journey of learning.  They take on the endeavor of trying to be your tool to help you get there.  I mentioned my age, because I don't think it's possible to get to the end without having gone through all of the rest of it.  So perhaps it helps to be a little more experienced to fully understand them.  It's not about age, it's about the journey. Forgive me because I know I've stepped out of and beyond just this song this comment is attached to.\n\nAs clear as this seems to be a love song to me, I realize, that's just me.  Maybe it's also Maynard, maybe not.  Maybe it's just me finding that in his words.  Maybe the truth of this song is something different to someone else, but no less of a truth.  Just thought I'd share my truth I found in these words and music.\t\t\t\t\n\t\t\t\t\n\n", "comment_373": "\nthe song that lets the cat out of the bag. everything that has followed is re-mystification of sorts. but this song requires no interpretation. we are eternalâ\u0080\u0094what more is there to know, really. ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_374": "\nInspired by Tool, if life is like y=x^2, where x is you in a specific moment of Planck time and y is your reality in that moment, the graph of the parabola exists at all times. X is an observation of specific moment on the graph. All possible states of y exist in spacetime.  \t\t\t\t\n\t\t\t\t\n\n", "comment_375": "\nGuys Iâ\u0080\u0099m baked right now so this is what this masterpiece means.\n\r\nYou should only experience this song with both songs \t\t\t\t\n\t\t\t\t\n\n", "comment_376": "\nI look at this song as a teacher teaching his student. â\u0080\u009cWe are choosing to be here, right now, hold on, stay inside.â\u0080\u009d The teacher is teaching the student how to stay inside the moment because living in the moment is where the â\u0080\u009choly reality, holy experienceâ\u0080\u009d is. â\u0080\u009cThis body holding me reminds me of my own mortality embrace this moment remember we are eternal all this pain is an illusion.â\u0080\u009d The student is being taught that the body is temporary but he is forever. Pain, or what we consider to be pain is an illusion.\r\nThis world is made of energy, we are energy, pain is just a temporary part of life because our energy transcends pain.\t\t\t\t\n\t\t\t\t\n\n", "comment_377": "\nto me the song realy sounds like its a reminder to how to love. whenever your in love. he sings: this body, this body holding me, WE live etearnal all this pain is an illusion. he clearly sings we. to me it sounds like he is in love with someone and together they can overcome anything. they will live etearnal. \t\t\t\t\n\t\t\t\t\n\n", "comment_378": "\nTo me this song is about the religion of scientology, which MJK openly rips in the song \"Ã\u0083â\u0080 nima\" with the lyric \"Fuck L. Ron Hubbard and fuck all his clones\" (L. Ron Hubbard being the founder of said religion). The main belief is that there are these immortal things called \"Thetans\", which are ultimately souls, that are trapped on this planet. They enter the bodies of humans, hence the lyric \"this body holding me, feeling eternal\". Another belief is that pain does not exist, only the negative thoughts towards pain, and with enough prayer, all illnesses and ailments can be made to disappear, which explains the lyric \"All this pain is an illusion\" rather well. One other small thing, that isn't concrete evidence, but supports my theory is the frequent use of the word \"holy\" throughout the song, which suggests a religious theme to the song. Hope this helps clear the air somewhat.\n-Reggie\t\t\t\t\n\t\t\t\t\n\n", "comment_379": "\nI think it's about sex. Not raunchy sex but actual lovemaking. They are so in the moment that they remember nothing that happened before. It's obviously a \"precious moment.\" \n\n\"Stay inside\" is pretty literal haha. It's spiritual lovemaking (Holy experience). They are literally holding each other's bodies. \n\nJust my two cents.\t\t\t\t\n\t\t\t\t\n\n", "comment_380": "\nI think it's about Scientology - \"We barely remember who or what came before this precious moment\" Pretty much forgot about the whole Xenu thing, \"I am not alone in This body\" The 'Thetans' clinging to people, \"Recognize this as a holy gift and Celebrate this chance to be Alive and breathing\" That thing you buy to get the 'Thetans' out of you(I forget what it's called), \"This body holding me reminds me of my own mortality Embrace this moment, remember: we are eternal, all this pain is an illusion\" They think your souls are immortal and are reincarnated and have been reincarnated. (I'm not a believer of this religion, I'm Atheist, it just really makes sense to me that it's talking about Scientology and didn't they play for that L. Ron Hubbard guy when they were starting out?) \n\n\n"}