{"comment_0": "\nI live in Liverpool now, and I have to drive by Penny Lane every day. At first it was quite weird, and now I'm used to it, but there is actually a barber there, and they have put photographs in their window in reference to the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nOh, Jeez, people, this is about the most sarcastic song I've ever heard, right up with \"Sultans of Swing\".\n\r\nLook, it's not straightforward at all.  Let me break it down for you:\n\r\n\"In Penny Lane there is a barber showing photographs\r\nOf evâ\u0080\u0099ry head heâ\u0080\u0099s had the pleasure to know.\"\n\r\nHe keeps a set of photos of everyone famous he's met, like an autograph book.  Not too out there, but still strange behavior.\n\r\n\"And all the people that come and go\r\nStop and say â\u0080\u0098Helloâ\u0080\u0099.\"\n\r\nThe ordinary people of Penny Lane/Liverpool want to be near greatness, so they participate in the oddity, and stop in to look at the photos of people they'll never be.\n\r\nOn the corner is a banker with a motorcar,\r\nThe little children laugh at him behind his back.\"\n\r\nA rich banker (the motorcar shows he's rich) has lots of illegitimate children, their presence is mocking him (probably because he has to pay off their mothers)\n\r\n\"And the banker never wears a mac\r\nIn the pouring rain - very strange.\"\n\r\nMack = raincoat = rubber = condom.  Even though it's likely to get him ANOTHER illegitimate child (bastard), he continues to have sex without rubbers (because he's arrogant or likes the feeling better, whichever)\n\r\n\"Penny Lane is in my ears and in my eyes,\r\nThere beneath the blue suburban skies\r\nI sitt, and meanwhile back\"\n\r\nHe's (Paul) sitting observing and listening and ferreting out what is driving the people he sees - what's beneath the surface of their daily lives\n\r\n\"In Penny Lane there is a fireman with an hourglass\r\nAnd in his pocket is a portrait of the Queen.\r\nHe likes to keep his fire engine clean,\r\nItâ\u0080\u0099s a clean machine.\"\n\r\nA man who keeps punctuality as a goal.  Very indicative of the British Condition, subverting all of one's desires to an admiration and striving for a goal that one can keep, instead.  He keeps a portrait of the Queen, another person he'll never reach or touch, but his perversion is that the Queen - a 'handsome' woman - is his masturbatory fantasy, and, like clockwork - punctually - he masturbates (keeps the fire engine clean) often - it is, after all, a clean machine, worthy of the Queen.\n\r\n\"Penny Lane is in my ears and in my eyes,\r\nA four of fish and finger pies\r\nIn summer meanwhile back\"\n\r\nIn the summer, when things are warm and free-er, boys finger women in the streets after dark...\n\r\n\"Behind the shelter in the middle of the roundabout\r\nThe pretty nurse is selling poppies from a tray.\"\n\r\nShe's selling medical morphine and other narcotics to supplement her income.  Nothing to do with war remembrance; it's a juxtaposition of the pretty nurse trafficking in stolen narcotics.\n\r\n\"And though she feels as if sheâ\u0080\u0099s in a play\r\nShe is anyway.\"\n\r\nHer actions are surreal to her, feeling justified because it's all unreal; but all the world's a stage, and she's a player doing it for Paul's benefit (his observation).\n\r\n\"In Penny Lane, the barber shaves another customer,\r\nWe see the banker sitting waiting for a trim\"\n\r\nThe Banker is waiting to see a mistress, and using the barber as a reason for being out of the office.\n\r\n\"And then the fireman rushes in\r\nFrom the pouring rain - very strange.\"\n\r\nThe fireman is afraid of women - the pouring rain symbolizes (as above) the potential for fathering children - and he rushes indoors (would rather masturbate because women terrify him).\n\r\nNow, children, THAT's what the song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nisnt it supposed to be \"back\"... cause i think the persona is in the suburbs while penny lane is in the city but i def could be wrong. I love all the songs in which the \"Beatles\" reminisce about their past. \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI live near Penny Lane, too and the \"shelter in the middle of the roundabout\" is still a bus terminus which also hosts the famous Sgt. Pepper Bistro. Gawd.\n\r\nOne of the greatest songs ever written.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n\"penny lane is in my ears and in my eyes\" great song. i compare it to johns strawberry feilds.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI grew up listening to the Beatles daily because my older sister was a HUGE fan. She was 13 when the Beatles appeared on the Ed Sullivan show. I'm Canadian, but my wife is from Liverpool and grew up just a few blocks away from Penny Lane. We went back to England on our honeymoon (20 years ago) and her grandmother walked us both down to Penny Lane. Road signs in England are usually tacked onto a corner wall at the intersections (a opposed to using a pole). The Penny Lane sign had been stolen so many times the city council finally decided to paint the name \"Penny Lane\" right on the brickwork! Yes, the street was in very nice, and yes there is in fact a roundabout! Rows of shops on both sides of the street, and many flower beds here and there. Penny Lane is a LOVELY song about truly nice place with warm, friendly people!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI live in Smithdown Road. Just next to Penny Lane, its just an ordinary street really, but thats the whole point. Its just a pretty homage to the strangeness of ordinary things when you're a child. A achingly beautifull little song really, although i admit to being biased.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nMac is short for mackintosh (somebody said it was slang for raincoat, which it is, I'm just being nitpicky :)\r\nAnyway, they were invented by some Scottish guy named Charles Macintosh in the early 1800's (1824?? Something like that.) They added the 'k' later. Also, British people call Wellingtons (which are boots) 'wellies'. British people are cool. I wish I was British.\n\r\nWow, I just realized exactly how boring I am. Oh, well. So, back on topic, Penny Lane is a good song and I had it stuck in my head for a really, really long time.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nPenny Lane was a street that Paul always used to walk passed on hs way to school... or so i've heard anyway...\n\r\nUrm... I don't wanna seem like a dumbass, but what the hell do they mean by 'Penny Lane is in my ears and in my eyes.' How can a street road be in someones eyes?!?! It doesn't make any sense! Arg! I'm over-annalysing, i know...\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nJust like it's companion piece \"Strawberry Fields Forever\", \"Penny Lane\" is a song dealing with childhood nostalgia. Or to be more precise, a now grown up man achingly trying to reach for that youthful perspective of the world, which obviously makes him happy, since he is nowadays probably stuck in a more troubled life.\n\nBecause the storyteller is not really there, you see. His \"observations\" are rather a kaleidoscopic collage of images and impressions, assembled during his childhood days (and adolescence as well, judging from the veiled sexual allegorys - the \"clean machine\" part could be a reference, the \"finger pie\" one certainly is). Instead he quite literarily sits \"behind the blue suburban skies\", not so much imaging the place as reminiscing it.\n\nWhile both \"Penny Lane\" and \"Strawberry Fields\" are essentially happy nostalgic song, there are disturbing things lurking just beneath the surface. While the latter has a slightly frightening theme underlying it, the nature of \"Penny Lane\" is more of a sad one (would Macca ever write a truly frightening song? - never mind \"Helter Skelter\"). While the refrain should count as one of the peppiest pieces of pop music ever written (exactly evocative of the feeling the storyteller is trying to get across), there are certain moments in the song where the melody, if only for a few seconds, turns moodier. The point where the mood gets most anxious coincides with the line \"she feels as if she's in a play - she is anyway\". This must be interpreted as the cynical grown up's rationalizing of the the Childhood Dreamer, even though they are the same person (or maybe the sober Paul reaching through to the high Paul - I'll leave the drug talk to others). And this is where the tragic aspects of the song (and the whole concept of nostalgia) becomes evident; the dream can never really be realized.\n\nBut we always find ourself returning to the bittersweet nursings of nostalgia, don't we? Just as we keep returning to \"Penny Lane\". This is truly one of the Beatles' very best songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nPenny Lane is now the most recognizable road (by name)in England.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI wonder..... what exactly, does nack mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nit was an honest mistake.  no need to be rude.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think anna118k was being sarcastic...strwberry was just clarifying it, and then rainbow came and bitched everyone out...\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ni think you're probably right.  bitched being the operative word.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\na \"fish-and-finger pie\" is a clever Liverpudlian reference to a sex act involving hands and female genitalia.\n\r\nmuch like Shakespeare and Prince, the Beatles were adept at throwing in vague sexual references and cryptic childhood inside jokes into their lyrics.\n\r\nlike in \"Daytripper\"...\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nhell yea! i live on penny lane :)\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI live in Liverpool now, and I have to drive by Penny Lane every day. At first it was quite weird, and now I'm used to it, but there is actually a barber there, and they have put photographs in their window in reference to the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nOops. I'm sorry.. I didn't mean to cause all that ruckus. Thanks strwberryf1ds for clearing that up about the typo.. I have one of those split keyboards.. and I didnt realize the b and the n would be right next to each other. \t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nPenny Lane, I love that song\n\n\n", "comment_20": "\nIt is the best song in the world. There are many penny lanes in every town and the call of the trumpet is the best description of the life in it. People will studying the world history by that song\r\nfor hundreds year ago.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nmany people have told me that the Penny Lane road sign is stolen every day, hey another surreal song, it's not about love or relationships\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI live in Taiwan, teaching English, and I just told a woman here that I think \"Penny Lane\" may just be the greatest song ever written in the English Language.\r\nWhat's so funny about it is the fact that, with the exception of the \"fish and finger pie\" frigging ref, there are no hidden meanings in this song.  You pretty much only have to read/hear it to know everything there is to be known.\r\nOne could posit a sort of meta-observation that the song very nicely and directly captures a kind of Jungian synchronicity.  It's sort of about how you go exploring, checking out all the back alleys and cul-de-sacs of personal experience and spritual seeking, and when you get to your goal you find yourself...where elz, dollin'?...on Penny Lane!  Back in familar territory, where the only difference is that now you have the wherewithall to write a song which is a glorious homage to this otherwise staid and everyday locale.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nHey ScouseMouse, I live in Liverpool too (just as a student though mind-sorry!) and I just walked down Penny Lane today :) we'll probably be looking at houses on there in a few days for next year. It's not the best area in the world so we'll only be looking if we have time after the other ones, but it'll still be cool to have a look I think. It's weird to think that I live so near the original Penny Lane hehe. Cool though. Sorry that has nothing to do with the lyrics...erm....nothing to say really! Must look for that barber's though...\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nit's not nack; it's mack. \n\r\n\"never wears a mack in the pouring rain\"\n\r\nmack is brittish slang for rain coat.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nUh...strike that..I just realized I was looking at the wrong part that was already noted :P\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nit is defo 'back'\r\nI sit, and meanwhile back \r\nIn Penny Lane...\r\ngud song. nice vocals on 'blue suburban sky...'\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nSuch a happy, nostalgic song\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI always found the catch line to be \"Penny Lane is in my ears and in my eyes,\" almost as if they're saying something about the nature of the world... like it's not really there or something to that extent, but it's just a really vivid illusion.\n\r\nThen again, I could just be reading in, but it does seem to fit the whole meditation and druggy state they were in.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nkate hudson used the name penny lane in \"almost famous\"\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI like how even though it at first seems very bright, cheery and naive it has a sleazy undertone with such lines as \"fish and finger pie\" and \"keeps his fire engine clean. It's a clean machine.\" Both can just be read in a literal sense but I think their conotations are clear.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\n\"And though she feels as if sheâ\u0080\u0099s in a play\r\nShe is anyway.\"  Definitely states that this is about a play they're watching, probably outside \"way beneath the blue suburban skies\".  They sometimes get a bit distracted from the play and turn their attention back in the lines like \"I sit and meanwhile back.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nalthough this is one of my favourite beatles songs, i have no idea what they mean in this song!! some songs you just can't analyse...\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\n...It just means that he can see it. That's all. He can see it and hear it even though he's not there.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nPenny Lane isnt the street he walked past that is the street he lived on.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\n\"A pretty nurse is selling poppies from a tray\" - It's Remembrance Day (11th November) when poppies are sold and worn in honour of people killed in the First World War.  This has to be an anti-war reference.\n\r\nI hear it as \"In his pocket is a portrait of A queen\" - Not THE Queen.  He's homosexual, rather than monarchistic...\n\r\nA great song, lovely mixture of nostalgia, politics and smut.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nIt's a photo of his late wife.\r\nYou can be damn sure she's proud of him, too.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\n1 word: Beatles\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nFun Fact - the street \"Penny Lane\" is named after James Penny, an 18th century slave trader.  Several other streets in Liverpool also have connotations to the era of slavery, and it was proposed in 2006 that streets named after slavers be renamed.  However, someone pointed out that this would mean that Penny Lane would have to be renamed as well, so the proposal fell through.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nno, it is nack, you know,  nack like fool around or twittling your thumbs or if you have a nack for something, like may be he has hungry for fish and finger pies. lol\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI heard that John Lennon was waiting for Paul McCartney's dad to come pick him up for band practice (or it could've been the other way around), and he was waiting on Penny Lane and just wrote down everything he saw.  Must be one hell of a street.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nthis song is about sex/masturbation.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThe first guy. \"Penny lane is the most recognised road (by name) in england.\r\nFat bloody lie. Its impossible to work that out. \r\nAlso ... Downing street clearly is.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI believe this song is about the beatles trying to catch criminals going to rob penny lanebefore James blonde ;P\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI don't know what this song means, but it's very good.\n\n\r\nI finally understand the vague sexual reference, although Shakespeare was a litle bit more obvious about it, especially with Mercutio in Romeo and Juliet.\n\r\n:)\n\r\nJust a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nI LOVED \"ummm...\"s interpretation!\r\nIdfk if its right or not... its just BA!\n\r\nAlso, i have no freakin idea where downing street is, dude\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nSure is the song talking about having sex for it is cheery and wholesome in the beginning but end up showing weird sounds at the end! Oops. Sorry. I just upset whenever I listened to the song while I was on a trip, I would unavoidably, stupidly, happy. But then, ta-da! Here comes a very naughty voices when the song's about to end :D\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI loved this song when I was little. It's really cute.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nThis song brings back memories from my childhood. I spent much time with my very english and traditional grandparents as a kid. We would sit around and listen to the Beatles on CD as they reminisced about their lives back in England. I particulary remembber this song and i get so nostalgic about all the carefree days spent with them.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nNack is a cover from the rain (like a raincoat)\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nthis one always makes me smile and feel all light inside like a little kid ^_^\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nre: a couple of the comments here: the are hidden meanings aside\nfrom the \"fish & finger pie\" reference - the fireman with an hourglass\nactually has an erection; since he's away from his woman while on\nduty often, he carries a picture of his woman while taking care of\nthis - the prtrait of the Queen means his woman, not THE QUEEN\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI listened to this when I was little and though it was just a straightforward song. However as I Grew up I caught all the damn sex references.. basically it's saying that no matter where you live there is something dirty going on.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nTo me, this is just a happy nostalgic song. A celebration of our memories of the place we grew up and knew so well as a kid. It was the world in a microscope: all those funny, but decent little people that tried to make a life for themselves, and who deserve our love & respect.\n\nIt was the place where the common people met, and exposed themselves (the barber). The place where big people (bankers) live alongside little people (children). There are people looking after us (firemen, nurses), in service of the greater good (the Queen, Memory). There are young kids dwelling around favourite places ('shelter') preparing for the next generation ('four o'fish and finger pies') :-) \n\nThere's the outside world and its threats pouring in ('rain', war), but people withstand it; by priding oneself in their job ('clean machine') ('as in a play').\n\nThere is commonness and, well, some real good music! I think Paul simply celebrated this positive vibe, and that's enough to carry this Very Good Beatles Song.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nthis song is about sex/masturbation.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nThis song is an example of the extraordinary skill of the Beatles to say terrible things\nwithout causing any scandal. Around 1967 Penny Lane was a bus stop in Liverpool UK. Was it a wonderful bus stop ? No, of course. \"Penny Lane\" sounded very similar to \"Perry Lane\", the place in Palo Alto CA where Ken Kesey lived and made his famous parties when he was at Stansford University. Ken Kesey is also famous all over the world for his magic bus named \"Further\". The Beatles wanted to celebrate Ken Kesey's bus stops ; the problem was that the lsd was declared illegal in USA in 1966, and the celebration couldn't be openly done.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\ndah its a typo! incase any of you don't have keyboards i will inform you that \"b\" is right next to \"n\" on the keyboard, so it's pretty easy to make mistakes. there's no point in getting all philosophical about something when it's a simple slip of the finger!\r\nlou\t\t\t\t\n\t\t\t\t\n\n"}