{"comment_0": "\nThe following comments are biased as I am a big Nick Cave fan. I really like this meloncolic song as it reminds me it is about the complexities of human relationships and how they can and do change. Being a person who likes to help people out and give \"people the benefit of the doubt\" can leave me exposed to people abusing my trust. I have thought of some people as friends and it turns out that they are just \"using you\". This song is about the human condition. I have to be careful not to do the above to others - I do not think I'm the type, but, I am human too.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nSeriously? Awesome. I'm going to see it next week, I can't wait.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nHehe...great movie and great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthe lyrics are just great. and true too. \"people just ain't no good\"...\r\neven better along with a depressive mood.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThese lyrics are amazingly profound. The tune is repetitive, but I think of it as a chant or a lament to make up for that.... :D\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nat the start, I think you'll find it is \"People just ain't no good/A THING that's well understood\".\n\r\nor at least, it's fairly clearly that in the version that I've been listening to.\n\r\nI think this is quite touching. I guess it's more about not being able to connect with people than people being bad as such.\n\r\n\"It ain't that in their hearts they're bad...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThese lyrics are from the CD Booklet, so...\r\nIt sounds like someone who's had enough of the world and being pissed over by people. Certainly been there. \n\r\n\"To our love send a coffin\" sounds like a relationship has gone bad and he's not doing so well. Poor bloke.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nA song with meaning... makes so much sense to me!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI have always been under the impression that the song isn't so much about people being horrible in the emotional sense, but it's Cave telling a story about how you can love someone, completely devote yourself to them and in the end they die and you're left without them.\n\r\nSo really, people ain't no good, because even if you love someone they can still die.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nan elegy to dead love, simple as that.  She's dead to him now and he's mourning not her, but the death of what had held them together.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThe song seems to get more bitter as it develops, the nostalgia in the beginning when their love was \"blossoming\" , then the seasons coming and going representing their love wearing thin.\r\nWhen he talks about \"it ain't in their hearts their bad\", it's almost like he has become so bittered by  his lost love that he no longer has faith in other people altogether. Altogether a fantastic albeit rather sad song\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI just want to say I hate this song. It's not that it is a bad song, but it accuses all people for the mistake of one. At least this is my general feeling. You say \"people just ain't no good\" when you have met all people in the world and you decided they are all bad. \n\r\nAnd saying that all are bad, you usually include yourself along with all the others - but the song does not say that. It protects the singer as a separate entity which is able to judge all others but he himself cannot be judged by anyone. \n\r\nThis feels like an arrogant depression. You are depressed and you feel that everyone betrayed you, but you cannot see your mistakes at all. You consider that all love ends because \"people just ain't no good\". So you don't even try to make things better anymore because you set for yourself this axiom which does not need proof and you stick to it. \n\r\nSorry folks, rant over.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI think the song is so brilliant, because the two meanings, which can be found here, become interwoven with each other. \nOn one hand, it's about the lover that died and the narrating protagonist is quite depressed about that. \nOn the other hand, it's the connection you want to find to other people, but often cannot. When we love people, family, friends or lovers, we always want to connect with them, but also we paint some very private, special image. We believe people are as we paint them. But very often it's not the case. The song says that, also with that line \"It ain't in their hearts they're bad\".\nSo you can say that's that. Quite depressing, if you want to say, that you'll never really can connect to someone else. But there may be the one, whether it's a lover or friend, and their death values your relationship. In some way it's also a prayer like \"Into my arms\".\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nHe's blaming himself for the break up. He describes the good times and the bad times that they had together. He refers to health and to death which reflects the marriage vows - in sickness and in health till death shall we part. \nIt's his fault that the relationship broke up and he is the person that's no good\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nListen up! This is not about the obvious love turned bitter and lost. If you have or are going through a love that everyone around you hates you will see this song differently.\nThis is the other person trying to comfort his love that other people just 'aint no good', he is forgiving in the sense that he knows people are capable of being mean hurtful and judgemental 'it aint that in their hearts they're bad'. And there is an element of highlighting that if they were not together, than everyone would most likely prefer it 'they'd stick by you if you could'.\nThe reason why the no good people aren't sticking around is that they don't like the fact that they love each other and are together. It's a us Vs them love song, romeo and Juliette etc\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nheeee i love how in shrek 2, cap. hook sings it!!!\t\t\t\t\n\t\t\t\t\n\n"}