{"comment_0": "\nIt's been rumored that the 'dandelion' is Mariah's older sister Alison, who had problems with drug abuse, got pregnant at an early age, etc.  \"Valentine\" was Tommy Mottola's old stage name when he sang (YES, he did. ha ha I have no idea if he was good in any way).  The \"boy and girl\" are harder to figure out.\n\r\nThe song is about the fact that, although Mariah loves these people, the circumstances between them have made things difficult.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI HATE MARIAH CAREY! but i love this song... so sad but so true...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song I think is about the time in her life when she was all confused about her relationship with everyone. Especially when she was getting divorced to Tommy Mottola. It is really nice but it sounds like she is going to die or something.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think Mariah wrote this about all the issues in her life, from being a bi-racial child growing up, getting teased, her parents divorcing and her family being split apart...the part about the dandelion, i think that represents her growing up and losing her innocence, like most of us do. The \"patriarch\" is her marriage to tommy mottola, and i heard that the boy and girl in the song are really tommy's kids that he already had from a previous marriage. So she's saying that she grew close to them and loved them, but she had to leave because she..\"fled to save my sanity\".  The best part in the song is the end..\"and i missed alotta life, but i'll recover, though i know you really like to see me suffer, still i wish that you and i could forgive each other, cause i miss you valentine, and really loved you...\" I find this song so true and courageous of mariah, she took very personal things from her life and shared it with her fans and the world. I love all her music and find her to be one of the greatest artists ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI thought 'Dandelion' was referring to her rocky relationship with her Mother? Are the boy and girl not referring to her brother and sister?\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThe Flower = Dandelion = Mariah's Sister\n\r\nI'm quite sure of that.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think that most of the comments above are right, I've read somewhere else that she talks about Tommy Mottola here, his children, and Mariah's sister.\r\nThis must be the song the most shockingly moving ever for me, because I used to listen to it all the time in such a painful situation that still lingers on. \r\nBack in 2000 I was having \"true\" friends for the first time (a little \"sis\" and a little \"brother\"); and then suddenly felt abandoned by them, not only that but betrayed as well...the people I loved the most were somehow the ones that turned the knife inside of me.\n\r\n\"So many I considered \r\nClosest to me \r\nTurned on a dime and sold me \r\nOut dutifully \r\nAlthough that knife was chipping \r\nAway at me \r\nThey turned their eyes away and \r\nWent home to sleep ... \"\n\r\nThey probably don't even know they hurt me so bad.\r\nAnd then I also cried at the fact that it's been so long since I've been living a life deprived of so much things...I spent so many years doing little more than studying and getting caught up in the worries of becoming a lawyer, that I simply forget to live. And I've got so many regrets about the person I became later, and the people that I lost along the way, probably because of myself...\r\n\"And I missed a lot of life \r\nBut l'II recover \r\nThough I know you really like \r\nTo see me suffer \r\nStill I wish that you and I'd \r\nForgive each other \r\n'Cause I miss you, Valentine \r\nAnd really loved you...\"\n\r\nStill, the only thing that drives me is the hope that one day I will recover...I will be the unspoiled person that I used to be...but who knows...\r\nAnd how badly I wish I could forgive them, especially the one that mistreated me the most...and how I would like him to see that I always loved him, probably more than anyone else...I need to forgive to move on, and I desperately need to feel at peace with myself for once.\n\r\n*I love Petals - thank you Mariah*\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthe boy and girl are referring to tommy mottola's kids, whom she became really close to them during her marriage to tommy, but couldn't see them anymore after the divorce.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis is such a beautiful and moving song. I think it is about (in order)\r\nBeing born into a muli-racial family\r\nHer sister\r\nCreepy Tommy Mottola\r\nHis Children\r\nHer Brother & Sister\r\nfriends who have deserted her...\r\nand creepy Mottola again\r\nso yeah, pretty much what everybody else has said. Incredible song though!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nHere's the scoop on this song:\r\nThe flower is Allison (her sister)\r\nThe patriarch is Tommy, and little sis and little brother are his son and daughter. \r\nThe people who turned on her are just referring to many ppl, like her friend Jennifer, and yea about breaking away.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI love all of the comments here. Especially the comment from 'miss opinion 101' - very thorough.\r\nThis song is just... wow. It is so very moving, so sad yet beautiful, magical, liberating, courageous, powerful, impacting.. just phenomenal.\r\nI love her vulnerability.\r\nI admire mariah so much - she has been through so much heartache in her life and a lot of the haters give her so much shit - far out!!! I hate that. She is such a beautiful woman with such a beautiful kind heart. There is something innocent about mariah.\r\nI love the rainbow album- probably underrated.\r\nThis is just an unforgettable song. It's like a rare diamond.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nOh, and \"Gabigs\" your comment is also great.. very expressive and open of you!! I'm glad this song can be a comfort to you. It's amazing when songs do that. Certain songs can just be so impacting, its great. And yes, you will recover :)\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nit's \"WITHIN\" a maze a misery... \"with\" a maze of misery just screws up the entire meaning of that line...\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\n\"So many I considered\r\nClosest to me\r\nTurned on a dime and sold me\r\nOut dutifully\r\nAlthough that knife was chipping\r\nAway at me\r\nThey turned their eyes away and\r\nWent home to sleep\"\n\r\nPretty sure she's talking about the people of SONY. We all know things start to get complicated for Mariah's side after the divorce with she staying in the same label she ex-husband (the devil Motolla) headed. I can only imagine how many people stayed on Motolla's side at the time, making Mariah feel awfully vulnerable. \t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI think the dandelion is Mariah's sister, Allison. From what I've read and seen in the media, she and Mariah have repeatedly tried to rebuild a relationship. However, Allison repeatedly goes to the media with stories to get a buck. \n\nThe 'turned on a dime' part is not only about Allison, it's also about her old friend Jennifer Colombo. Supposedly, Jennifer was part of a damaging article that came out about Mariah in the early years. \n\nI think the little sis and little brother are Tommy's children from his first marriage. I think they were subjected, and witness to, his obsession with Mariah and her fame early in her career.\n\nAnd I think, at the end of the song, the Valentine is Tommy. His stage name during his singing years was Valentine. Mariah has repeatedly said that Tommy was tender in the early phase of their love. Despite the claims of opportunism by both, I think there really was love between both of them. Ultimately, something somewhere broke down because of the fame. But it was always such a sad love story to me, I think they would have continued making such beautiful music together!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nMan it's interesting to know that she's writing about people who have turned on her. And she's basically writing a song of forgiveness.\t\t\t\t\n\t\t\t\t\n\n"}