{"comment_0": "\nPrison Sex is about child molestation and cycles of abuse. \n\nThe creaking at the beginning of the song is meant to emulate a door being gently pushed open, creaking loud among the silence.\n\nHe hadn't picked up the name Maynard yet, that came later. He was James now. Probably was referred to as 'Jimmy' around this time. He was 11. His mom had her fateful aneurysm that left her broken down and paralyzed, forever changed, her faithful devotion intensified and led her to become more and more delusional and willfully ignorant. \n\nJimmy's stepfather was caring for him at this time, he inspires the content for this song for about two years until Judith finally sends him to his fathers in Michigan.\n\nThe part that gets me is that the child molestation is only the first verse, the rest of the song is about him, the victim, becoming the perpetrator. What fucks my mind is that i cant decide whether of not this is a metaphor for him getting into sodomy as a result (4 degrees, stinkfist) or if he for real raped a dude. Or both.\n\nIn the live sessions of Prison Sex they add a set of lyrics right before the 'i have found some kind of temporary sanity..' climax, Here they are:\n\n\"Show me something (4x)\nThought I could make it end\nThought I could wash the stains away\nThought I could break the circle if I\nSlipped right into your skin\nSo sweet was your surrender\nWe have become one\nI have become my terror\nAnd you my precious lamb and martyr\"\n\nI never quite understood the 'Lamb and Martyr' part until i heard/read this, and even so i hope its only just my interpretation. he's referring to a single person. If you can't see what im getting at maybe its best i don't spell it out..\n\nBefore playing 'Jimmy' live once, Maynard addressed the crowd, announcing it as the sequel to Prison sex. Jimmy being a very personal story, the announcement of it as a 'Sequel\" to Prison Sex is kind of shocking. That gives it a light of being a personal story, just by that strong association. H is a sister piece to Prison sex, its about him struggling with the abuse he grew up with, in the face of having a child of his own. The snake hissing was his lamb and martyr. That's a beautiful song about him realizing he doesnt have to perpetuate.\n\nI have a deeper respect for Maynard than i ever have ever had for a singular artist, and the reason for that is songs like Prison sex, Jimmy, H, Judith, Passive, Orestes... he just completely opens himself up and turns his personal pain and sorrow into beautiful art as a means to move forward himself and as a tool for others to do so as well. \"Turn these leaden grudges into gold\"\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nok this song is for one about exactly what it sounds like - rape - but more importantly the psychology of a rapist.  now take it a step further i beleive he uses this example to get accross a broader point.  that point is that when horrible or traumatizing  things happen in our past especially childhood it has a certain affect on people.  one way some people deal with it is by inflicting pain on others  as an outlet.  \"you are my martyr my lamb\" means that you must suufer / be sacrificed for me to feel better or maybe to feel anything at all.  hands bound and head down obviously works as a rape visual but also as a symbol that he is a slave bound to repeat these horrors without controlle or so it seems.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nFrom the most superficial standpoint, this is a gross song about being butt-raped in prison...not very appealing, so looking deeper's necessary. The following lines are the most important, I would say:\n\r\nDo unto others what has been done to you \n\r\nDo unto you now what has been done to me \n\r\nI've come round full circle. \r\n(quoted from tool's official site's lyrics)\n\r\nI think it's more about victims turning around and victimizing others.  At first they are violated, but with time they \"come around\" to their predator's ways, and violate others themselves.\n\r\nThis is not confined to sexual predation or just to prison.  In fact, it seems more like Maynard means to draw a parallel to other froms...religious \"recruiters\" seem a good example. \r\npreying on the weak and feeble-minded, they convert somebody to their faith, and they cannot defend against these people so because of weak-mindedness they go along, and ignorantly believe what they're told.\r\nNow, they become the missionaries, and ignorantly follow orders to find \"recruits.\"  They victimize other people based on how they were originally victimized.\r\n(I'm not dogging all religious types now, just those who fit this example)\n\r\nEven a child playing an online computer game can fit it.  Someone cheats , and he loses out, so he gets angry and starts cheating, ripping off other people.\n\r\nThe concept of this song relates to many many things, we \"come around full circle\" a lot, and adopt what is handed to us, whether by a malicious enemy, or by inadvertent ignorance.  So keep your third eye open and think about this one...\n\n\n", "comment_3": "\nThe meaning of the song is pretty simple, which makes it all the more horrify. Someone has been raped, and the only way they can find catharsis, the only way they can cope with the trauma, is by raping themselves. Considering this is how the cycle of abuse actually works it's pretty heavy.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nOkay, I guess the way I see this song is a lot simpler.  To me it seems like Maynard is talking about a child who was sexually abused and then growing up and abusing their child in the same way because its all that they really knew of childhood and growing up.  \r\n      \"Do unto you now what has been done to me\"\r\nIn relation to the title of the song, the child's home became a prison because their abuser kept the child there, or if not that it could be seen as emotional imprisonment.\r\nFor me, seeing the video really made all of this come together, but that's just my interpretation, so who knows what Maynard was really thinking about this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nMaynard said in one of the rare interviews he did that it's about how he was raped as a child. End of story.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nAny ideas on what sort of metaphor could be taken from \"only this one holy medium brings me peace of mind\"?\r\nThanks..\n\n\n", "comment_7": "\nAlso, he states in one interview how it is also about the cucle of abuse, the aspects of the constantly vitimized, and the about the thought of the perpetrator. In another interview, he states how all you people who feel the need to post your own meanings and ideas are bullshit people. The band makes music so you can think about it and analyze it by yourself. They dont even put the lyrics on the album because they aim for you to listen to the music with the creative side of your brain, to express yourself, to build upon yourself. When simply reading his message instead of individually gaining your own understanduing, you do not gain the ability to expand for yourself. Their goal is to create spiritual music that helps people, not bullshit rumors and illogical ideas to misconstrew other people's individual beliefs of the messages directed towards them and only them which they discover in the music. Fuck people. Think for yourselves.\n\r\nLastly, this is just a personal note that i believe in. People keep asking bands if they are making new albums, yet they dont give them money, they steal their albums online. Fuck those people. If you people are going to download shit, then be grateful for whats out there, you are miserable fucks anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthe first line saying \"Won't you come a bit closer,\"\nis:\n\"Won't you, won't you come on up closer\"\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nAny and all songs, especially by TOOL, can be interpreted in infinite ways based solely on the listener.\nThis song is a prime example of lyrics that initially have a very evident meaning based on what you hear/read and the song title. Taking what we know about TOOL and Maynard's expressive views on organized religion(based on other TOOL/perfect circle songs) we can look at this song in a similar light and find a meaning that has little to do with molestation and rape and much more to do with forced indoctrination especially by Christianity. \n\nTaking the first few lines of this song: \n\"It took so long to remember just what happened\nI was so young and vestal then\nYou know it hurt me\nBut I'm breathing so I guess I'm still alive\"\nThis opening could draw parallels to the popular Christian practice of Baptism where an infant in bathed with \"holy water\" to symbolize purification and admission to the Christian Church when they have no say in the matter.\n\nThe lyrics: \n\"I've got my hands bound\nMy head down, my eyes closed\nAnd my throat wide open\"\nThis is a prime example of parallelism between the church and the message trying to be portrayed here. The imagery of these few lines is a perfect picture of someone praying. \"hands bound\" being a persons hands and fingers laced together. \"head down\" and \"eyes closed\" are that of a person in a typical position of one praying with \"my throat wide open\" being the actual vocalization of praising god.  \n\nLook at all the lyrics of this incredible song and find the religious meaning yourself, it doesn't take much of a stretch of the imagination to do so. Once these parallels are made the entire meaning of the song changes from a child that is forced into performing sexual acts to a child that is forced into a life of religious servitude that has been passed down from generations before. \n\nThe song starts in the point of view of the newly indoctrinated child to the point of view of presumably that same child, grown and passing their values onto the next generation with this vicious cycle repeating over and over again. This is seen in the lyrics \"my hands bound....your hands bound\"\n\"I've become my terror\" states the point that this indoctrinated being has become that in which harmed it in the beginning, that in which imbued the cycle from the start, that in which they tried so desperately to avoid becoming.\n\nJust my interpretation of this tune. Its one of my favorites and would love to know what people think!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThe \"one holy medium\" is probably the Bible's phrase \"Do unto others what has been done to you\".  It brings the speaker peace of mind because it seems to justify his vengeance.  Payback brings comfort.  The song isn't specific to any victim-victimizer relationship.  Just about turning the tables.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think that er_bear54 is thinking on the same page that I am concerning this song.\r\nI do think that Maynard is \"Interviewing\" in a sense.\r\nSpeaking from the mind of this Sodomiser. \r\nSpeaking of the mental problems and illusions that many\r\nchild molesters deal with. Their justifications if you will.\r\nLife is a cycle in many, many ways. \r\nI think his point is that hurt brings hurt, pain brings pain.\r\nWe justify the hurt and pain that we have caused others by the hurt and pain that we have experienced. Knowingly\r\nor not, this is within all of us. This is true of all relationships.\r\nWe must learn to break this...\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthis song is a about the vistim victimising his abuser.  In the song he says i need you to feel. He also says that is makes him whole.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is about Maynard's own abuse at the hands of his father. The video that accompanies this song als reinforces this idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nDear Babyeater. I understand this is a place where people can leave there opinions, but don't talk about stuff you don't understand, or aren't 100% sure about. You said \"The \"one holy medium\" is probably the Bible's phrase \"Do unto others what has been done to you\".\" If you had any idea what you're talking about, the bible says,\"Do unto others as you would have others do unto you.\" Matthew 7:12. Matthew 5:39 says \"Do not resist evil: but whosoever shall smite thee on thy right cheek, turn to him the other also.\" I cant find any verse in the bible that says, or encourages anything along the lines of \"Do unto others what has been done to you\"\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nIt means the abused becoming the abuser. That is indicated by I've come round full circle. This is not just in prison, but everywhere. Like religious \"recruiters\" preying on the weak and feeble minded. The weak eventually become missionaries and recruit more weak.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nOk first off Maynard was never abused by his father nor has he ever admitted to being abused at all.  In very early interviews he eluded to his hatred for his stepfather but would never go into detail.  Secondly if any of you are real fans you would have heard \"Prison Sex OTRM\" (if anyone needs a copy of it or any other Tool song feel free to e-mail me at \"Trentisgod50@hotmail.com\") He adds the lyrics\r\n\"Show me something\r\nThought I could make it end\r\nThought I could wash the stains away\r\nThought I could break the circle if I\r\nSlipped right into your skin\r\nSo sweet was your surrender\r\nWe have become one\r\nI have become my terror\r\nAnd you my precious lamb and martyr.\"\r\nThis is where the cirlce is completed and yet again the cycle of abuse begins.  It seems apparent that something happened to Maynard when he was young, (the song \"jimmy\" is about a young Maynard too), but all we can do is specualte.  I can tell you that this has nothing to do this rape in a prison but most likely it's called Prison Sex because the abused feels as if they are in an inescapable prison in what should be their safest place...their home.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nDamn right.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nyep\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\ni dont know what otrm stands for, the only thing i've read is over the rainbow mix, haha\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nIt's the same song except the *show me something...and you my precious lamb and martyr* is not in the original version.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nIt's the same song except the *show me something...and you my precious lamb and martyr* is not in the original version.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nKade you're correct, but his reference to the \"one holy medium\" is just a twisted version of the bibles excerpts or whatever you wanna call them. In a way babyeater is right, but its not directly from the bible. maynard twisted it his own little way\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nMaynard said at a concert that this song was about the first step in dealing with abuse: realization.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nat the toolshed it has been stated that tool claims this is not about child abuse, but you can't listen to anything that tool says. i think the religious recruiter idea works, but it is obviously open to interperatation.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nActually I think ther is more of a differnce here then people realise. I don't know what OTRM means either but the words that are added definatly change the meaning quite a bit. Prison sex is a very easily interpreted song but no matter what way you put it the song leaves itself open to a question which to most people find is very easy to answer. Prison sex ends with all of us understanding it to be that the man (in a somewhat vengeful way) seeks to take his losses of dignity back from someone who didn't take them away to begin with and he leaves it open without any mention and possibly no intention of correcting this circle of pain. But here he shows that he is questioning what he did. the words \"I thought...\" and \"Temporary\" add a real intention to break the cycle, even though he couldn't bring himself to do it. This may have been a sort of sell out change for him. He may have done it so as to keep the fans who would have trouble understanding this. Wheather he really had any intention or want to change it may never be known \t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nMaynard was accually the tall black figure in the video, so it very well could be about his childhood experiences and what he has become from it.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nyou mean Maynard actually played the black figure in the video?\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nMaynard is talking about how he was sexually abused as a child and how this type of thing takes a \"full circle\" and those that have be sexually abused wi then do the same.  Regardless of the subject though it's a kickass song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nQuote directly from Maynard James Keenan while performing this song live in Montreal Quebec(I have a video of it from kazaa)\n\r\n\"This song is about recognizing, identifying, pychological abuse inside yourself, thats the first step of the process, realization, identifying. The next step is to work through it, but this is about the first step, which is recognizing\"\n\r\nThere ya have it :)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nthis song is definatly about abuse although it is not necessarily sexual. i agree with almighty ruler when he mentioned the religious possibilty but just because maynard wrote about abuse doesnt meen that he actually had the experience. this song is about the  hopeless feeling associated with abuse. It speaks about the scar that abuse leaves and how all to often the victim does the same to another.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nYes, Maynard was accually the person in the black suit.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nWhat, the guy who gives the little guy the paintbrush and makes him pass out and has a wasp on his fingers? Na! What's that thing that comes out at the end with the baby head?\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nthe video also has a lot of clues as to what the song is about...the little doll with no legs represents a child who is powerless to defend himself against the abuser, when in the beginning the figure takes away the doll's legs, making it unable to escape\n\r\nnear the end when he is being painted he raises his hand but the figure just calmly holds it down, and then caresses the doll like a little child...its calming the doll down, saying this will be over soon\n\r\nthe whole paintbrush part, when the figure paints the doll there is no mark left meaning to the figure this is something that has little significance to, it is just another almost daily ritual...when the doll paints itself there is a black streak, meaning he is scarred for life from this\n\r\nin the end you see that the doll is kept in a box by the abuser, meaning the abuser will most likely repeat his actions again and again since he keeps the doll as a pet\n\r\nits a kick ass video, one of the best I've ever seen\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nNo, I meant that thing that has a baby's head and is on wheels and comes out near the end to inspect that little guy that was squashed by the black guy. Also, what's the deal with the caterpillar? God, I'm so stupid! I love this song and video so much and yet I'm too dense to work out what it all means. I'm sorry for asking so many questions, feel free to laugh at my stupidity. :(\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nDespite the song being called prison sex I think it has nothing to do with being ass raped in prison aside from what others have been saying. Its a metaphore for.....well just listen to the beggining of third eye salival version \t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\ndelicious\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI was just looking at the prices at Amazon.com on the right... \"Opiate\" for $23.49! What the hell?! That's about Â£16.09! I paid about Â£6.99 for my copy. That's about $10.20! Scandalous!! (Yeah, I used an online currency converter!)\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nDear Kade,\r\nI can find many verses in the bible that say and encourage things along the lines of \"Do unto others what has been done to you\". Have you not read the Old Testament?  Exodus 21:24-25 \r\n\"eye for eye, tooth for tooth, hand for hand, foot for foot,  burn for burn, wound for wound, bruise for bruise.\"  Yes I understand this verse is more like Do wrong unto the one who has done wrong unto you... but it it is still along those lines.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThe song is strictly about being molested by his stepfather when he was younger.....the title is just something that adds to the \"flavor\". Take for instance \"hooker with a penis\" and we all know that the song isnt about that......but we know its about sell outs and how ironic wouldn't it be if we saw a hooker with a penis anywho? A male jiggalow yes i can see that, but my gosh Maynard even said it himself that the song is about him being molested by his stepfather......try toolshed.down (i think thats the site) and it gives ya all (not all but figuratively all) you need to know about Tool\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\ngawd i love tool fans. all so smart and actually look at the meanings of songs unlike other types of fans. you guys are great. can't wait to go to the concert here in bako on july 11\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI really don't think the song is about being ass-raped in prison, or the lead singer being adused. thats what i like so much about tool- their lyrics are deeper than you think. there is a message in the words, but instead of using a less contriversial metaphor, maynard chose prison sex. why? think of the song die eier von satan- sounds scary, sounds satanic, almost makes you think of nazi's too. but when you translate it, its just a simple cake mix.... i believe that by filling his songs with sodomy and satan and things like that, maynard is putting up a \"scair crow\"... to scair away close minded people. i know a guy at my school who is a morman. he's a total sheep to athority, blindly following everything he is told. he refused to even listen to tool, because he thinks its all about having sex with little boys in prison or something. so there you have it. by making he music dark and gothic, maynard is scairing away all the close-minded people who are too turned off by the vail to see what is beneath. anyone see where i'm going with this?\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nnot knowing about maynard being abused and all that other shit... i thought it was about bondage, then again me and my boyfriend...bleh... nevermind i'm a tard =) songs can mean different things to different people =/ so just leave it at that... heh\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\ni kind of agree with most of whats been said here. although i have a different perspective. i think it has little to do with sex literally. i think it has more to do with someone projecting their pain (or negative feelings in general) onto someone, and in turn they project their negative feelings onto someone else. \r\nhes being raped and feels something horrible, he comes to grips with it by raping others and making someone else feel the way he once felt. \r\nof course thats just my opinon i could be wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\ni agree with er_bear54 on the meaning of this song and who ever else said it. koo song. Tool is a great band\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThe song prison sex is about Myanard and his father and how his father would abuse him. *_*\r\njeremy\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nWell, Kade, the lyric isn't an exact adaption of doctrine. \"Do unto others what you would have done unto you\" is the quote, but I'm not sure if it exists outside of Catholic doctrine (as, going to a Catholic school and otherwise being part of an athiestic family, I've had no other exposure). So, Babyeater's quote of the bible wasn't actually a quote, but rather re-quoting Maynard's adaption of the saying for his own purposes. And I can see many ways the song is applicable, both as Last Shadow says, as it's written from a first-person perspective, and I'm not sure that he'd impose his own thoughts and impressions onto such a subject. However, it can easily be construed as a conceptual usage of the rape to reinforce the point of society's many rapes and the willing rapists created by such, as stated by The Edge's religious metaphor.\n\r\nOh, and I'd like to add that I really appreciate these lyrics and their interpretations, it's help me come to understand and appreciate Tool and APC on completely new levels, and the music, while powerful before, is now so much that it leaves me shaking. Literally. I thank you all for a little intelligent discourse on a brilliant band.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nkade. eye for an eye tooth for a tooth. close enough.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nto me this song is really about how a little boy is raped by either his father or a close friend , and as a adult he grows up to be the same as the person that raped , but he only finds that hes ways are wrong , eather way this song is bad ass , it means diff things to others, what ever it really means to its the grim truth of alot of children in this world.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThis song is clearly about abuse of another defenseless person. Most likely a child, which is removing the childs sense of right and wrong. Hence the \"Do unto others, what has been done to me.\"\n\r\nAnother thing in this song I feel is crucial to it's meaning is when Maynard sings \"I have found some kind of temporary sanity in this shit blood and cum on my hands.\" This means that the child gets used to his abuse, and believe that it is the way things are supposed to be. He eventually finds a false comfort in taking abuse. \n\r\nPersonally I don't believe the rumors about Maynard beeing abused as a child, since I have never heard him say it himself before. Also this song could reflect so much more. Probably most posts under Tool here at songmeanings.net are wrong. \n\r\nFor instance: In 'Hooker with a penis' Maynard sings. \"All you know about me's what I sold you. I sold out long before you'd ever even heard my name.\" It could represent that Maynard isn't quite like people have thought him to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\ni hope this helps Kade, el scorcho9, and NickDogg, and anyone else...i think the \"Do unto others, what has been done to you\" could be a reference to the old saying \"Do unto others as you would have them do unto you\", which i think might be in the bible...or it could just be a wisdom quote.  Some of you guys have some really insightful comments on this song that im sure many people never thought of, thanx\n\n\n", "comment_51": "\ntghis song is about maynards experience when he was raped by his father in a toolshed henes the name tool hense the unoffical web site for the band toolshed jesus the ignarrce of some peoples on this page\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\ndo any of you think this song could have any link to \"maynards dick\"? I mean I know the music in Maynards Dick sounds like it would be more of a \"fun\" song but the similarities are unmistakable...\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nOK, I am pretty sure on this, and you can research this yourself. But Crackermcnacca, TOOLSHED was going to be the name of the band when they first started, or it was the name and they changed it, I cant really remember. I think you can go to the toolshed.down.net site and read the FAQs and it will state it there. I dont think Maynard was sexually abused as a child, I cant say that for a fact but its just something I dont want to believe.\r\nThis song is a great song, and someone way up in the begginning of this said it right. I think its about a child that was molested and turned around and did it him self. That is what he learned as a child and he went back and did it to his own child or someone else. Why Maynard wrote this, who knows. Maybe just to get his point accross of what kind of fucked up world we have made for ourselves! Thanks for reading!\r\n(sorry guys I cant spell)\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThe video relates very very closely to the song.\n\r\nMost of it has been covered by posts above this, but i'll just add something:\n\r\nThe setting for the video is like, a room of drawers, and at the end, you notice that the \"abuser\", guy in black, keeps the doll in the room of drawers, and the black guy lives in a room of drawers, and so on and so on to infinitum.\n\r\nThus showing the, Abused become the abuser in the continuous pattern.\n\r\nAlso, i don't understand the Brown Clay man, the Caterpillar, or the spinning baby :/\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nAlright well i didnt bother te read more than two posts about this song but what i think is this song is being narrated by a convict who is obviously got some issues and as many people have said is a child abuser. now the part \r\nIt took so long to remember just what happened. \r\nI was so young and vestal then, \r\nyou know it hurt me\r\nrefers to when he was young and was abused as a child and then \r\nbut I'm breathing so I guess I'm still alive \r\neven if signs seem to tell me otherwise. \r\nI've got my hands bound, \r\nmy head down, my eyes closed, \r\nand my throat wide open. \r\nis him basically saying that being in prison is scary and fucked up\r\nthe next verse basically retelling what he did to this child and while he was doing his acts may have said \"my lamb and martyr,you look so precious\".\r\nand as for the break and interlude where he says \"i have found some sort of temporary sanity in this shit blood and cum on my hands\" is showing just how fucked up and demented this guy is. and then the \"i've come around full circle\" is basically saying that that is happening to him now what he did to this child: a bigger and stronger person took advantage of him. but what haunts me the most is at the end when he keeps repeating \"you look so precious\" at the end. because at the end of the video the black alien type think had the baby pinned down and the baby reaches up and the black guy holds it down. its freaky....\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nAlright well i didnt bother te read more than two posts about this song but what i think is this song is being narrated by a convict who is obviously got some issues and as many people have said is a child abuser. now the part \r\nIt took so long to remember just what happened. \r\nI was so young and vestal then, \r\nyou know it hurt me\r\nrefers to when he was young and was abused as a child and then \r\nbut I'm breathing so I guess I'm still alive \r\neven if signs seem to tell me otherwise. \r\nI've got my hands bound, \r\nmy head down, my eyes closed, \r\nand my throat wide open. \r\nis him basically saying that being in prison is scary and fucked up\r\nthe next verse basically retelling what he did to this child and while he was doing his acts may have said \"my lamb and martyr,you look so precious\".\r\nand as for the break and interlude where he says \"i have found some sort of temporary sanity in this shit blood and cum on my hands\" is showing just how fucked up and demented this guy is. and then the \"i've come around full circle\" is basically saying that that is happening to him now what he did to this child: a bigger and stronger person took advantage of him. but what haunts me the most is at the end when he keeps repeating \"you look so precious\" at the end. because at the end of the video the black alien type think had the baby pinned down and the baby reaches up and the black guy holds it down. its freaky....\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nmost ppl look at this song too literally! This abuse is a metaphor! a metaphor about how we as a society treat each other and how we justify our actions! \"do unto others what has been done to u\" is an interesting twisting of the bible verse \"do unto others what u would hav them do unto u\", this is a phrase which is twisted in societies mind to mean treat others how u hav been treated! this man has been ill-treated as a child, so to get over this pain he goes out and abuses this other child to get a type of revenge! and he can justify his actions by saying it has been done to him so he can do it to others! \n\r\nlisten to OTRM version it will give a beta view of the full metaphor of the song! \"i thought i could make it end/ thoguht i could wash the stains away? thought i could break the circle by slipping into ur skin/ so sweet was ur surrender/we hav bcome 1/i hav bcome my terror and ur my preciosu lamb and matyr\" he thought by redoing his act on others he would be able to stop them from getting into the abusing cycle!\n\r\nby the line \"ive come round full circle\" it means that in his search for his inner peace by taking his revenge he has turned from the victim to the villain, thereby keeping the cycle going by creating a new victim! This man is not demented, as u so politely called him, he is just doing what he believes is right! \"do unto others what has been done to u\"\n\r\nand by the way MAYNARD was not abused sexually as a child! that is just a rumour which is completely unsubstantiated! \t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nwhere can i find the other version of this kick ass song the one with more lyrics cuz i've heard of it\n\n\n", "comment_59": "\nI love this song, and like many Tool songs, it uses a sick and crude subject matter on the surface to get across a deeper meaning. I'd say it's about the vicious cycle, that the victim can become the bully through growing up with the trauma, to put it simply.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI read somewhere that Maynard was abused as a child although this is argued by many people, its no secret that he is against child abuse though. When he says \"my lamb and martyr\" refering to the one being fucked it could be him showing partly what he thinks of people dieing for their religion, they are getting fucked. i think there is some deeper meaning to it like Almighty ruler was talking about, its a Tool song so its a wise asumption that you do need to go a bit below the surface to find the true meaning. i think the title \"prison sex\" is meant to refer to the \"cage\" that these people are locked in and it is very hard for them to escape from.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\n\"tghis song is about maynards experience when he was raped by his father in a toolshed henes the name tool hense the unoffical web site for the band toolshed jesus the ignarrce of some peoples on this page\" \r\n- crackermcnacca\r\nWell if this was in english, i could understand you calling someone ignorant, but come on, no offense, because i completely agree with you.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nWas Maynard really raped by his father, that's really fucking tragic. More power to you brother, do what you have to do to stay sane, beautiful, beautiful music.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI don't think he was raped by his father, but what do I know. I also think this song *is* about rape in the physical sense, although it can indeed be connected to everyday life and how victems become the victemizers all the time. Regardless, there are too many lines that paint images of rape for it to be merely metaphorical.\n\r\nI've got my hands bound,\r\nand my head down, my eyes closed\r\nand throat's wide open\r\n(being tied down and forced to give oral sex)\r\nRelease in this sodomy\r\n(direct refferance to actual rape)\r\nFor one sweet moment I am whole\r\n(orgasm)\r\nshit blood and cum on my hands\r\n(the aftermath of anal sex)\n\r\nThese lines can indeed be taken metaphorically as well, but I myself take this song to be about actual rape, although thinking metaphorically about the song is helpful. \r\nI was just thinking today how I don't know why the words were used that are in the line \"my lamb and martyr\", and some people have mentioned the religious connections this song could have, and now it makes sense, although I haven't the energy to type why. *-* Anyway, great song. I love it, twisted person I am.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nThank you nastynickknocker I agree with you. I know so much about the bible. (you like it or dislike it i don't mind) Evreything in the old testament is undone with the coming of jezus. I really like this song. Saw the video when I was high  :) \r\nI really think you people are all thinkin in a higher level. And that's very nice because 99% of the people I see are sooooo fuckin stupid:)  thank ya all\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nwell if you just look the other way...\r\nyou  all say that maybe he was molested and now he is molesting his own children,but what if he talks about his father-that he was molested as a child and now is molesting him,huh?     it's all messed up,like all the drawers in the video,it goes to infinity...\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nwhen it all comes down to it my friends not one of you including myself will ever be able to find the exact meaning behind any of maynards lyrics...there is madness behind all genius and obviously from reading the posts you guys put in you dont have to be a genius to appreciate it, im happy that their are some people left in the world with respect for genius and art.\r\nhappy to be a part of it...\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nSo yeah. I believe that this song uses rape as a metafore for how hatred and violence is passed on from \"rapist\" to \"victim\". I use the word rapist here metaphorically.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nThis is moreso about child molestation than prison rape. Don't base the meaning soley on the title. \n\r\nThe first verse reffers to the blocked out memories of his father abusing and molesting him. \n\r\nThe \"but I'm breathing so I guess I'm still alive \r\neven if signs seem to tell me otherwise. \" reffers to the fact that he has been damaged so badly emotionally that he is dead inside, even though he looks normal on the outside. \n\r\n\"Do unto others, what has been done to me\", now because of what his father did to him, he's doomed to repeat it to his own children.\n\r\nThe second verse goes on about how he is starting to get the same perverse urges. \n\r\n\"I need you to feel this, \r\nI can't stand to burn too long. \r\nReleased in this sodomy. \r\nFor one sweet moment I am whole.\" He needs this now, and he needs to let others feel it with him, almost thinking its a good thing at this point. He has become so familiarized with the rape and pain that he needs to bring it back to feel whole again. \"Do unto you now what has been done to me\" It's spreading along down the line, and the line \"but I'm breathing so I guess I'm still alive \" shows that he's killing this child inside just as he was when he was violated.\n\r\n\"I have found some kind of temporary sanity in this \r\nshit blood and cum on my hands\" The only way he can 'cure himself' is to reproduce what happened, and bring himself back to that more innocent time.\n\r\nThat's my opinion, and I could be wrong. Tool is good in that it allows many interpretations.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI have to disagree with AlmightyRuler on the whole missionary example. Missionaries have the intention of bringing salvation to their \"recruits\" meaing they feel they are doing good for the helpless people not for themselves. The song is certainly not about good intentions and deeds for other people, this person is filled with hate from whatever situation he has received it from,his intentions in this song are purely of revenge and self satisfaction. A lot of people are making one huge literary mistake, confusing the author with the speaker.Whether Maynard was abused in his childhood or not the song enters the mind of one who was abused and was so psychologically affected, he must abuse to keep himself together. The rewording of the Bible passage in the song, \"Do unto others what has been done to me\" displays the mindset of the speaker, he is deranged and his moral consciouness is twisted.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nwas maynard raped as a teenager?\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI see this song as another relgious song. Take this:\n\r\nI've got my hands bound, \r\nmy head down, my eyes closed, \r\nand my throat wide open.\n\r\nThis sounds like someone praying does it not? And the 'Do unto others' part is from the bible. Having read all comments and agreeing with them, I feel that it can be interpreted as following a religion and being messed around with.\n\r\nThat's what I like about TooL songs - you can make up your own mind! Thanks TooL! :-D\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nMy god people. . .i didn't read through all the posts but the whole story of maynard being molested is bullshit.  And this song is not about molestation literally.  I believe it is about \"forcing\" religion onto someone.  In the video, the \"father\" is painting the child without legs.  He's wanting him to turn out like he wants him to be turned out.  He is \"raping\" the child from personal experience and personal truths.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI'm with melenge. Maynard's lyrics are hardly ever that obvious or transparent. THis song might have some connection to H. later on.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nMelange the story about maynard being molested isnt bullshit. I know that to be an absolute truth. That being said I agree with the rest of your statement.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThis is probably the only Tool song I relate to sex at all.  The reason I relate it to sex is simply personal interpretation, and I realize this.  (I realize many of their songs are ambiguous and -can- be interpretted in very perverted ways--humour+horny fans=happy campers).\n\r\nThis song, when I watch the video actually pierces me.  It is so intense.  It is too easy to get inside this song...and it truly hurts--really hurts.  Funny that I should love it then.\n\r\nThe irony I find in this song (if I am using the term correctly) is in the fact that when I hear it, I understand the \"do unto others what has been done to you\" part, and I know that the once victim is now the villain, but if I try to put myself in the lyrics, I still feel victimized from both viewpoints.  Just something to think about.  Psychologically, I think that any serial killer or serial rapist will probably still feel like the victim.  Anyone who is hurting feels victimized in some way, I think.  And those who hurt others do so because just maybe it's the only way they can imagine not being the victim--they can become the opposite, shouldn't this feel better?  Shouldn't this bring peace?  \n\r\nTwo wrongs don't make a right though....  But unlike many of their songs, I don't focus on the point, I focus on the emotion totally and completely when I listen to this song.  I hate it and I love it.  This song is something I crave.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nYes, maynard was sexually abused as a child, not by his father but by his step father.  Why do you think he didn't attend his step fathers funeral?\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI believe this song is about someone raping a child.. then going to jail and having same thing done to him.. hence the \"I've come round full circle.\"  I don't think this is on a personal level though (him being raped or whatever), it seems to be more of the who aspect of what goes around comes around, so be careful what you do.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nSomeone said that the part where it says\n\r\nI've got my hands bound,\r\nmy head down, my eyes closed,\r\nand my throat wide open. \n\r\nsounds alot like someone praying, but there's also another way you could look at it. Speaking in a psychological sense: His hands are bound, meaning he's powerless against it, his head is down, which points towards submission, his eyes are closed, so he's blind to what's happening (I believe someone mentioned that Maynard said, during a concert, that this song was about realization of abuse, which would fit well with what I just said), and his throat is wide open, meaning he's basically open to any action done to him.\n\r\nThat's pretty much the way I see it, but obviously there's multiple ways to interpret the passage and I wouldn't be surprised if it was done on purpose that both situations are correct, giving the song a more universal theme.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\ni dont know if this means anything but when he says \"i have found some kind of temporary sanity...\" it kinda sounds like maynards saying centipede, and if you have seen the video, you see a centipede.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nSometimes when you are sexually abused as a child it takes years for it to be clear to you. As you get older the memories start coming back to you and I think that's what the first part means \"It took so long to remember just what happened.I was so young and vestal then, \"\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nThroughout this discussion, it has been assumed that \"sex\" in the title \"Prison Sex\" is referring to the verb for intercourse. What if, instead, the song is about being trapped in the wrong gender? The \"rape\" or forced item would then instead be the pressures of society to fall within the two gendered line.\n\r\n\"I have found some kind of temporary sanity in this \r\nshit blood and cum on my hands.\" \r\nIn this line, we see three products of the huamn genitals; \"cum\" (whose origin I'm sure we're all familiar with), blood (which may infact be menstrual blood, indicating femininity) and \"shit\" (the unifying \"product\" so to speak between the genders, we both shit the same way). In a way, these three elements allow the owner of the hand to assume both genders, even if only for a moment. To find some sanity, some comfort in pretending he is his chosen gender.\n\r\n\"I've got my hands bound, \r\nmy head down, my eyes closed, \r\nand my throat wide open. \"\r\nThis line, as many have previously pointed out, quite clearly illustrates repression or confinement of some kind. Hands are bound by gender stereotypes, head forced down by pressure from family and peers, eyes closed to prevent the \"prisoner\" from seeing the facade reality going up around him, and throat wide open. One's throat is wide open in basically two directions; accepting and removing. The open throat can accept the pressure of society, swallowing them down in the prostrate position you are bound in. The throat is also open when speaking. A common defence mechanism, reaction formation, could be said to be in place here. The \"prisoner\" feels all this pressure, feels the confines of his bindings, but still spouts the propoganda he's been fed for years, swearing the gender he was born with is, in fact, the one he would choose. \n\r\nI could go on, and try to analyze the entire song, but I won't. Just remember, the common usages of words aren't always the ones the artist intended. Instead of diving deeper into the superficial meaning of something, look at the words and see if there is a double entendre to be had. This may lead to a greater understanding of the lyrics than was had before.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nAll meanings could be true, Maynards original intent was to never have one sole meaning, it was actually quoted of him that he wanted his songs to take on different meanings to different people.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nIn 1997 I watched an interview with Tool and they said that if their videos trigger memories of childhood sexual abuse then they're doing their job.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nFor all of you saying the song isn't about physical abuse, and it's all just a metaphor, you need to look up the meaning of \"sodomy\".\r\nThe video is fucked up.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThis song is about recognizing, identifying, pychological abuse inside yourself, thats the first step of the process, realization, identifying. The next step is to work through it, but this is about the first step, which is recognizing\" straight from Maynard himself at a concert a attented\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\n..... wow you guys really go into the meanings, don't you think sometimes the obvious meanings are correct? I don't go into the meanings, because i think hes doing just what every other lyricist does, write lyrics. Sure they are great lyrics, but i dont think they have to have such deep meanings\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nhahaha he 'found jesus'\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nHaha, he's one of God's children now.\n\r\nAnd about the song meanings...\n\r\nPeople hear everything differently, what the obvious message might be in a song may not impact someone that way.  Plus, ciphering your own impressions is part of the fun in music.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nPersonally believe this song has nothing to do with abuse. Obviously another metaphor within the lyrics, not sure what that metaphor is but I can say this confidantly since I write songs all the time and when other people read them they say something like: Why are you so violent/homicidal? When the song was actually about a painting...... but yeah my songs are shit compared to this one.\n\r\nLove you all!\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nOh yeah and I have to agree with one of the guys (1st or 2nd page) that said this song may be used as a scarecrow Sounds like an awesome idea and something that Tool would do. forgive me if I'm wrong about this but Even though I am a great fan I haven't been listening to Tool very long due to my mother's trying to shelter me from everything \"evil\" yeah like tool's evil...... (well I don't consider it to be anyway it just encourages you to take another look at the world)\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nI think it's about prision sex.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nI cannot grasp any of that Abuse theory. I just think this song is about Anal Sex. Period. Maybe a bit of Violent Anal sex perhaps :-P. I don't think Sex in Prison would be sweet and sensual somehow lol.\n\r\nMaynard James Keenan is fucking awesome! His songs speak volums and I don't think they're written to be open to interpretation by the fans.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nCrap, I meant I think they're written to be open to interpretation! Not that they're not. Sorry about that!\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nI mean yeh like Maverick says most Tool songs are left to interpretation by the listener. Maynard has said that he always writes to the music and he uses and wishes Tool's music inspires people.\n\r\nI did hear Maynard at a concert i attended few years back he said \" this song is about the 3 phases recognizing, identifying, pychological abuse inside yourself, thats the first step of the process, realization, identifying. The next step is to work through it, but this is about the first step, which is recognizing\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nThis is a song about overcoming trauma/abuse, this isn't really about anything sexual, it can be about any kind of abuse cycle.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nyour all idiots , none of you even deserve the right to comment on tool lyrics .\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nLike all Tool songs, the ways you can interpret this are endless. Tool make music as a \"tool\" for people to use for themselves to help them get through things and to enjoy, making their songs interpretable for anyone, so they can relate to them in their own way.\n\r\nThis song reminds me of someone being abused and pushed around so much that despite not wanting to, the person has to stand up for themselves. Complete desperation comes through in Maynard's singing. Awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nok i don't get it.  why are a lot of people saying \"What this song means is...\"?  what they should be saying is \"What this song means to ME is...\".  people shouldn't just be putting words in maynard's mouth.  although some theories may be true, you'll never really know what the hell a song means because you aren't the one who wrote it.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nIn the first entry, Almighy Ruler calls evangelizing, or prosthelitizing(sorry about the spelling) \"victimizing\" and \"preying upon.\"  I highly doubt Maynard would consider bringing truth, peace, and meaning to someone's life \"victimizing.\"  No doubt, Maynard would certainly call tricking someone into some freakishly outlandish cult filled with bull-shit \"victimizin,\" however, that is not what most religious \"recruiters\" are trying to do.  Maynard, I think, is also open-minded enough to know that he is not always right about everything.  Only a bull-headed and arrogant fool would claim to be. So even if you are against any type of evangelizing or prosthelitizn, or an atheist or whatever, there is no reason to accuse an evangelizer as a criminal.  They are trying to bring peace of mind and what they believ to be truth to others.  \n\r\nMy point about this song is simple:  Though the song is certainly about abuse and abuse coming full circle, I don't think it is about religious abuse, if there even is such thing.  It is more about well... all the other kinds of abuse.  I would go into more detail, but I don't have time.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nI read an interview awhile back in which Adam Smith says \"Stink Fist\" is about how much Maynard loves sex.\n\r\nWith that as a jumping off point... Maynard is a highly intellectual and psychological lyricist. I try not to take their stuff too literally, but I believe this song is Maynard working through a Freudian explanation of his sadistic sexual fetish with anal sex.\n\r\nIt also hinges on a hot-button issue of the day, the epidemic of child-molesting priests. The abuser might be a priest. But Maynard does like to work with religious metaphors... this might simply be a symbol of abuse of the highest nature (priest as gatekeeper of the sacred)... because while Maynard seems to hate \"religion\", he does seem to hold spirituality as one of the greatest endevours in life.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nit would seem as a whole western society has adopted the 'eye for an eye' lifestyle.  i personally would argue this destroys or greatly inhibits our advancement as indivuals and a collective.\n\r\nprison sex seems to highlight this vicious circle\n\n\n\r\n-peace\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI seem to think that the song is about searching for reasons as to why behaviours ( - and + ) are perpetuated. \n\r\n\"And only this one holy medium brings me piece of mind\". Some one on the first page suggested that this is about the bible. I scanned all the pages but no one else said much about it. The holy medium is the act of sex. In this instance its been twisted into something perverted.\n\r\nthe continuous cycle of sexual abuse is the literally meaning, the deeper meaning is in how behaviour is carried on through the generations. The full circle is when the action is only understood by being at the other side of it. hence the cycle is continued\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nThis song is gross. I figure this song is also about some sorta abuse. But I don't think its the abuse that a rape-ee is getting. Its the abuse that a raper (sp?) is going through. \"Do unto others what has been done to you\" is the rapist talking to him/herself. Its their way of putting logic to their crime, like all major criminals have done.\n\r\n It seems like the rapist seems superior to his/her victim. The video brought that out to me. The legless doll was the victim to the skinny black one. The skinny black one wanted to befriend the other, so it made sure he couldn't leave, by taking off its legs. It took something away (parallels with virginity). The black doll wouldn't let the other one leave at all costs. The little doll was basically bound (parallels with rapists' actions to prey). Then while the little doll was crawling around, it saw other dolls, that look similar to it (parallels to rapists capturing people in a certain mannor). \n\r\nIt also seems to be that a lot of this is driected to the church, who may be \"raping our minds\" or what-have-you. With lines like \"Do unto others what has been done to you.\" This is what the Bible preaches against in the New Testament. Perhaps he's trying to say that the Bible is hypocritical. No one, but him, can really be sure.\n\r\n(I'm a drunk 15 year old. This is just what I think, it may not be true. Deal with it.)\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nI think this song is about the abuse that Maynard endured from his stepfather\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nMaynard never said anything about being abused or raped by his stepfather, just that he hated him. As to why, you can speculate on that.\r\nI'd honestly laugh the whole way through if I saw my stepmom get beaten to death, but she never raped me. Perhaps Maynard was \"raped\" in some other way, not necessarily by his parents.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nWhen I first watched the video, the thing that seemed to scream out to me as did the majority of people here it seems, was \"Child abuse!\". \r\nI think the reason for this is the fact that the victim looks a lot like a baby while the victimiser is more like an adult. \r\nThis could be wrong. The \"child\" could be a caricature of a victim, but then the lines \r\n\"It took so long to remember just what happened/I was so young and vestal then\" come in to play.\r\nWhen the word \"Young\" is said, the first thing that comes to mind is children, and with the video combined with the lyrics the first impression is Child abuse. \r\nAll of these stories about Maynard being raped behind the tool shed by his step father... Well, I wouldn't be jumping to conclusions as this song could be conceptual and Maynard has never admitted to being abused by his Step father.\r\nAt the same time, we must take in to account that being raped by your step father isn't something anyone would brag about, and in the song Aenema where he says \r\n\"Fuck these dysfunctional Insecure actresses\"\r\nWhich may express the anger he has towards these celebrities that never stop talking about how hard their lives are/were, this could explain his silence (assuming that the rape theory is true).\n\r\nVery few people seemed to touch upon the other little creatures inside the room with the drawers. I allways felt that when the Victimiser killed the clay man, it represented the part of the victim that is \"killed\" during the abuse (possibly the other creatures could represent diffrent aspects of the childs mind). \r\nThat's all I have to say really, most other things seem to have been allready covered.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI think that many people are taking this song waaay to superficially, c'mon this is tool, it is deep music. the lines \"Won't you come a bit closer,\r\nclose enough so I can smell you.\r\nI need you to feel this,\r\nI can't stand to burn too long.\r\nReleased in this sodomy.\r\nFor one sweet moment I am whole. \"\r\nsuggest that the narrator is in some sort of pain and wants his victimizer to feel his own pain, instead of becoming a victimizer to a new victim I think the narrator has made it so that both him and his previous victimizer are feeling pain, as if the other came cloe enough to feel the same burn\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nHonestly I think ALL tool songs have a broad spectrum of meanings. This one is no different.\n\r\nThis song for me is almost inrtropsective bc it has me thinking of what i might do to my children (when/if i have some) or other people because of what others have done to me. I have been abused twice outta my fathers own insanity towards his actions!\n\r\nWhat I think maynard is trying to express here is that Abuse of any sorts (family, sexual, religious, blackmail) always gets inflicted on other people and that its a way of revenge for the original victimisers actions.\n\r\nAs for \"this one holy medium\" its simply a metaphor. It feels apart of the victimiser and it cuts between two people. Therfore its a \"holy medium\". \n\r\nAnd when he says \"i've come round, full circle\" it means hes done the abuse and it is coming back at him in another form. For example he gets abused, so he abuses, where he gets in trouble, and goes to prison and gets raped. Its also known as the \"vicious cycle\"\n\r\nThis song to me is very clear. Its just about Child abuse. Maynard didn't want it to be seen as THAT explicit; even though corporate fags like MTV and RIAA decided to use that against them\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nthis song is about exactly what the name says, prison sex, ppl getting raped in prison and how its a big problem, simple as that\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nHave u seen the video? at the end the little guy starts painting himself  black like the black tall guy, and for a second u can see his face flashing on him, like saying how the victim becomes victimicer, becoming full circle, and when it says: youre breathing so i guess u are still alive even i signs seem to tell me otherwise, have u noticed how abused people may become shy or almost dead-like is like a part of them died, but the body remains here...breathing...\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nWhen he says \"only this one holy medium brings me piece of mind\" i think he means that the act that he is performing is, to him, an art form. Mediums, like a guitar or a blank painting canvas, are used by an artist to make them convey fealings, thoughts and ideas.  Its expressionism.\r\nBut, as to who/what is the medium, I can only speculate. Might be the act of his rape, or the feeling he gets from it. After he does it he feels whole, if not temporarily.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nYAY BUM SEX!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nThis song is about child abuse.. End of story.. All you Tool experts can shut up now\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nHey this might be a hint, I think this song is about a child being raped\n\r\nI have found some kind of temporary sanity in this\r\nshit blood and cum on my hands. cmon\n\r\nyet Maynard said its about abuse he suffered as a child, so mabey Maynards childhood was even worse than we thought...\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nDespite what I have said earlier, perhaps Maynard wasnt really \"raped\", yet felt traped, held down and under force of direction, similar in that sense, and perhaps the line \r\nI have found some kind of temporary sanity in this\r\nshit blood and cum on my hands.\r\nis a metaphor branching off from another metaphor...\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nCan anyone explain the symbolism of the paint brush in the video? That's the one thing that's been bugging me about that video that I can't seem to figure out.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nthe funny thing about music is that it is so deep and rich with symbolism that each song has its own unique meaning to each person that listens to it.  it could mean one thing to you and something totally different to the next.  but for someone to just look at the title and take it to literal meaning, doesn't know anything about music.  c'mon  so many people look at this title and say cool raping in prison...prison's honestly not even like that for real i just got out 2 months ago from a alabama prison where i stayed 2 years that really don't happen so don't always believe what you see/read, believe what you feel.  look at stp's vasoline they don't sing about lubing up with patroleum jelly do they.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nLook up Stockholm Syndrome on the net (not the muse song) I think a lot of people would agree that the line \"Do unto you now what has been done to me\"\r\nfits in well with that concept if you think of the song as being sung by a person who has been abused or maltreated in some way and has thus come to feel that it was right and okay, and so is doing it to someone else.\r\nDunno if that was the idea behind the song, but it works for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nluckycharms19 \n\r\nI always thought the paint brush was symbolic for \"leaving a mark\". But do note (especially in Tool's early days) they did alot of things that really had no meaning just smoke and mirrors. Or for shoke value\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nAnybody here mentioned the word \"Vestal\" is usually refered to the female sex? Also, the doll in the video looks gender-neutral, but to me, if you look closely, its body structure suggests this is a female character, with the smooth, flowing lines on it and such.\n\r\nAlso, WTF is up with the legs moving even though they're cetached from the doll's body? I know they struggle... Aha, I see it now. Children are encouraged and taught to kick ad their majoy defense against a bigger, more intimidating perp.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nMJK mentioned at a live performance of that this song is about recongnizing cycles of abuse within yourself. This song is aimed at abuse people recieve and turn it in within themselves or as a result lash out on an external source. Once you let the abuse you have recieved whether it be sexual, verbal, religious or whatever govern your actions or your outlook on the world you have become the victumizer. The cycle has completed itself. Instead of confronting your demons, they poccess you and you become the abuser of yourself or others. \"do unto others what has been done to you\" But you also need to understand your victumizer to overcome this. In many cases the victumizers don't realize the harm they are doing to someone. Many child molesters for instance don't believe they are hurting the child but showing them love. To inflict the abuse you have recieved can bring a \"tempoary sanity\" By completing the circle of abuse and you become the abuser you feel as if you have destroyed the fear and violation you felt when you where abused. The power you feel when the circle is completed brings an overwhelming sense of completion. When you are abused the need to feel the opposite of the hurt you feel controls you. An act of abuse is more directed to free oneself rather than hurt the victum. People who are products of abuse need to recongnize this circle forming before it is to late and you are consumed by the power of completing the cycle of abuse. They must confront this tendency of abuse that will not be cured by denial or further abuse. By turning your abuse outwards you become what you hate and fear. You have to search within yourself and confront this festering pain that is resulting in further abuse.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nWATCH THE VIDEO, SEE THE \"ABUSER\" BLACK TALL GUY, HE IS SKINNY AND BLACK, THEN AT THE END OF THE VIDEO  THE LITTLE GUY BECOMES SKINNY FOR A SECOND, AND LOOKS A LOT LIKE THE OTHER, THEN HE PAINTS HIMSELF BLACK WITH THE BRUSH THE OTHER GUY USED ON HIM, HE IS SOMEHOW BECOMING LIKE THE ABUSER, THERE IS ANOTHER PART, WHERE THE BLACK'S GUYS HEAD OPENS, AND INSIDE HIS HEAD, THE SMALL GUY IS SPINNING, LIKE TRYING TO GET OUT, HES REMEMBERING WHEN HE WAS THE ABUSED ONE, AND HE WAS JUST LIKE HIS VICTIM IS NOW, AND HE IS LIKE HIS VICTIM WILL BE\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nI saw this at the songfacts.com profile of Prison Sex, and I was curious as to what this guy is talking about.  I'm a fairly new Tool fan, so I'm not too knowledgable right now.\n\r\n\"In the cover of one their cd's shows them all watching another man plesure himself.\" \r\n- jack, colfax, NC\n\r\nWhat CD is this? O.o\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nthis is possibly my favorite song ever made by Tool... and i have no fucking clue why...\r\nanyways... yes i personally believe that any song can be interpreted in billions of meanings... and for me the song is about how people get molded by their experiences and try to make others be just like them... now i may be really wrong about it... but only the band can tell you what it really is about, so until they decide to spill the beans on the great mystery that is their songs... id say we are pretty much, left to decifer the songs in our own ways...\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI guess you can look through the 'sexual abuse' story being told in the lyrics to any kind of abuse (verbal perhaps). \n\r\nIts really more about trying to find solice or peace of mind from such a traumatic experience (in the songs case from child-hood sexual abuse). However the character in the story resorts to inflicting the same damage on his prison inmates as he suffered and finds peace from the human-to-human contact. \n\r\nWe hear stories of this kind all the time, in the news, on films and t.v and even (god forbid) in our own families. However this sort of 'reaction' to abuse is in the extreme and the tone of the character in the lyrics is very pityful.\n\r\nCheck out the video for this song if you can (try youtube.com) as its very good (done in stop motion).\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nHaha Cleveland_Steamer is a funny name, I would have gone with Cock Knocker or Cleman\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nVery good. I've heard it has to do with gay sex...but either way.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\ni really like the drumming on this one, the hi hat pattens are simple but highly original, and you know straight away this guy is a very intelligent drummer, rock on\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nThis is the first Tool song i listened too in the 7th grade...and it still kicks ass...\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nSomething I'd like to add is that to me the video has themes of... making something useful out of something regular. Much like prison rape, where the only sex available is from that of another man. this is demonstrated a lot in the video, so i think it might be adam jones's interpretation of the song\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\ni fell like life is prison sex the more i try the mor i get raped and then we do it to others just because\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\n\n\r\nNot sexual? Hello! Let me draw your attention to this line: I have found, some kind of temporary sanity in this, shit, blood and cum on my hands\"\r\nI'm inclined to think that it has something to do with someone being abused as a child, and then turning into an abuser himself...\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\ni couldnt help but laugh at the last stanza of maynard stating this whole time he fucked jesus christ.\n\r\nthe theme of the song is becoming something that you felt and hated and putting that feeling on another.  Perhaps maynards satirical lyrics are saying that God saw the shitty nature of his world and wanted some one else to feel it for him(Jesus).  Or vice versa...Jesus comes and tells all these peachy teachings that Maynard just to fuck with humanity.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nMaynard hates*\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nOKâ\u0080\u0094Thank you to everyone who has earnestly contributed hereâ\u0080\u0094you have really helped me to understand this awesome song.  Here is my best understanding of the symbolism involved in the song and video.\n\r\nFirst of all, this is a song about a person caught in a cycle of psychological abuse.  They are trying to understand what happened to them, and how they came to be an abuser themselves.  Rape (or prison sex) is a metaphor here.  The video provides more insight into the meaning of the song.\n\r\nUnderstand that everything that happens in the video is inside the mind of this abuser (the black figure) who is trying to make sense of the cycle he is caught in.  The black figure is not only the main character but also a symbol for the original abuser and a symbol for the pain and damage that lives on in the abused.\n\r\nThe childlike figure (the little broken guy) is the black figureâ\u0080\u0099s victim.  However, the little guy is perhaps also represetative of the black figure when he was younger, more innocent and was victimized by a similar (or identical) black figure.\n\r\nThe video (and the abuse) begins with the black figure cutting off the legs of the little guy and throwing him in a drawer.  The best way to hold someone in your grip is to immobilize them.  People who are abused are vulnerable in some way, feel that they cannot leave. They are trapped and they must take the abuse.  The childlike figure looks up at his legs and wonders how he got to this fucked up place.\n\r\nWhen the black figure shows up, the little guy collapsesâ\u0080\u0094playing dead to survive.  The black figure is going to fuck with him no matter what, but by being submissive, he wonâ\u0080\u0099t evoke the most violent abuse because the black figure feels a little sorry for the little guy.\n\r\nNext we see the little guy searching around in a drawer.  He pulls out a jar with a bee in it.  This is his victim that he abuses and holds captiveâ\u0080\u0094the cycle of abuse continues.\n\r\nWhen the black figure returns, the little guy collapses again.  The black figure then uses a paintbrush on him.  Here the black figure is â\u0080\u009ccaring forâ\u0080\u009d the little guy, superficially fixing him up, making himself feel better.  Later the little guy will mark himself with black paintâ\u0080\u0094expressing that he is hurt, scarred.\n\r\nâ\u0080\u009cOnly this one holy medium brings me piece of mindâ\u0080\u009dâ\u0080\u0094 the one holy medium refers to the act of abuse and control.  The reason that the little guy is a doll (with no humanity), is because this is how the black figure views his victim.  He is there to be manipulated, toyed with.  He can remove a piece or add one as he wishes.  The black figure stomps on the fleshy human figure when it emerges from a drawer.  \n\r\nWe see the black figure remove the eyeplate from little guy and look through his eyes.  Its obvious that the black figure understands the little guys plight.  He feels bad, he knows what a monster he has become, but continuing the abuse is how he escapes feeling like the victim himself.\n\r\nWhen the centipede with little guyâ\u0080\u0099s head comes and stares at little guy, I think this is little guy realizing he is becoming more alien, more like his abuser.  Eventually he will be the black figure himself.  The black figure watches on from the shadows.  The cycle continues.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nyep this song means prison sex (being the bitch anyways) is not in anyway fun at all....\n\r\nand its kinda cool i think that in a way he goes from both point of view, the bitch, and the butch\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nlet me just say this. this song is not about prison sex at all. Maynard James Keenan reproted that his step-father sexually abused him when he was a young child. and he wrote this song after the effects had taken place. and thats that\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nthis song def seems to show a transformation of someone being abused becoming someone who abuses another...  \"ive come around full cirlce\" it def illustrates the torment and pain involved in rape or prison sex, and it does it very well maynard is a good song write and thats why you can feel the pain when u listen to the song.  \r\nwhether it applies to mjk's childhood i dont know... i didnt see anything on tooshed about that...\r\nto those of you who say its about religion... i get very tired of people bashing religion every lil chance they get. its amazing how much people will stretch lyrics to say its hating on religion, which i know maynard does... but just bc he did in a couple songs doesn't mean thats the point of all of his songs... religion may be dumb but its not the most evil thing in the world like people make it out to be...\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nit's about abuse, the music video has ways that maynard was abused by his father as a child.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\n\"Do unto others what has been done to you\" \r\nand\r\n\"Do unto others what has been done to me\" \r\nThe abused becoming the abuser is what this means. Say my dad hits me, i might start hitting my child/others.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nsupposedly something to do with the relationship he had with his father. metaphorically probably relating to the infiltration, forced upon ideas, misuse of someone elses power on a child because they are much easier to manipulate.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nThis song is good but the title of the song is really really gay. (no homo)\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nuhh I thought it was about S&M sex...\n\r\n>:)\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\ni think prison sex was just a clever name the song is clearly about someone molesting another as a child and then the victims becomeing victimisors themselvs and the reason hes doing it is cause his pain is not numb until he knows someone else hurts as bad as he does\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nI read in an interview with Adam Jones, he said that it was about  child sex abuse. He said that after a concert that, someone pulled him aside, the guy was crying, and \"told him something very personal.\" The band was really happy about it, when Adam told them. \r\nIf this is about Maynard's stepfather, I don't blame Maynard for not wanting to be open about it in interview. Having your mother die, and writing a song about that is one thing. Being Sexually abused by someone who's supposed to be a parent to you, is something  much more personal.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nThis song is about being in prison getting ur asshole rammed by a guy named bubba\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nSCREW TOOL!!!! THEY SOUND THE SAME!!! THEY SUCK!! I WANT SOME BIG PRISON SEX YAEHHH HOW FRICKEN STUPID IS THIS PIECE OF CRAP SONG!!!\r\n HAHAHAH SCREWWWW TOOOL!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nIt'd be nice if you tried to be remotely intelligent if you're going to insult a band, that by the way evolves on every album, dumb ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nI thought this song was about religion catching you when you're vulnerable (as a child) and forcing itself on you. Prison sex is merely a funny but relevant metaphor for tricking the public, like Tool likes to do (see Die Eier Von Satan).\n\r\nI definitely see the child abuse interpretations, but a lot of lines jump out at me that seem pretty religious. The first verse seems to me like baptism. The second verse however, reminds me of trials by drowning. In the middle ages, people, mostly women, accused of being witches (which was a Christian accusation and crime) were thrown into lakes. If they drowned, they were human and innocent (and dead); if they floated, they were guilty of being a witch..so they were taken from the lake and burned at the stake. \"I'm treading on water, i need sleep....i can't stand to burn too long\" vaguely remind me of this. \n\r\nBut back to my original interpretation of religion raping you..\r\nFirst verse is baptism. Second verse is some kind of test or trial. Third verse is being indoctrinated or accepting what's being forced on you, in this case, religion. \n\r\n\"For I am your witness that\r\nblood and flesh can be trusted.\r\nAnd only this one holy medium brings me piece of mind. \n\r\nGot your hands bound, your head down,\r\nyour eyes closed.\r\nYou look so precious now.\"....this latter part really seems to me to be describing someone in the praying position, speaking the former part to their rapist (aka whoever is forcing their views on them).\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nJust my thoughts...\n\r\nI am of the child abuse vein of interpretation, in spite of its religious overtones.\n\r\nI read all 6 pages and i don't think anyone touched on this. The line \"my lamb and martyr\"... Lamb is in a sense a word for child, as in Jesus is the lamb (child)of god, as well as a martyr. In the song, the adult is talking to his child and knowing that the child will die (in a sense) because of the sins the adult is commiting. When he says that line coupled with, \"you look so precious\" it shows the tenderness that the abuser normally has for his child, as well as the sick twistedness of the situation, feeling the tender feelings while commiting a reprehensible act.\n\n\r\n\"only this one holy medium brings me piece of mind\" When children/people are abused, in order to deal with the trauma and the pain later in life, they a lot of times behave in ways of repeating the abuse on someone else, or seeking out similar situations that would allow for the same type of abuse to occur to them again as a way of 'owning' the act and the pain. Victims of abuse often feel helpless and out of control. If they own it, they now control it. they are taking the power back into their own hands and it has a therapeutic effect.\n\r\nThe verse changes have a clear evolution of the abused turning into the abuser. The beginning  talks of what he endured and remembered when his innocence was lost, and the later, when he is taking on the abuser role.\n\r\n\"Won't you come on a bit closer,\r\nclose enough so I can smell you.\r\nI need you to feel this.\r\nI need this to make me whole.\"\n\r\nThis part says to me his struggle with perverse want for gratification,  and desperation. He needs to inflict the same pain on someone else for him to feel healed.\n\r\n\"I am your witness that\r\nblood and flesh can be trusted\"\n\r\nHe is telling the child what he learned as a child. The people you think you trust will only hurt and betray you, just as i am doing it to you now.\n\r\njust my thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nPeople, watch the video.\r\nSeriously.\r\nAnd yes, the song is about child abuse.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nthe video for this song made me cry the last time i watched it. it is chilling\n\r\nanyone else?\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nthis song is definately about sexual abuse. The victim grows up and becomes the abuser. Having been taught that the abuse they went thru as a child is how a loving parent/child relationship is supposed to be. They continue that \"loving\" relationship with their own children, hence the line \"I need you to feel this.\"\r\nthe prison is the family. to say anything will break up the family, or the prison can be the circle of abuse that can't be broken.\r\nI don't necessarily think that Maynard had to be a victim of abuse to write this song as other songs of his take on a first person introspective but it is none the less a very well written awesome powerful song about a sad truth that is disturbing to look at\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nthis is my two cents.. two things stick out to me, first is the obvious meaning about abuse going in a circle and the victim becoming the predator, but if you think about the title of the song it could also be about how people are \"fucked\" by the court system in this country, and how usually once you get locked up you end up going in and out of jail kind of like going in a circle but in another way. this is my favorite song by tool 100%\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nsorry for my english.its not about court system or something like that,its about something that makes us unhappy in this fucking life,the things that we want to do but for some reasons we are not aloud.its about religion.about god.hole lyrics is about this if you reed carefully.I was so young and vestal then,\r\nyou know it hurt me,\r\n.YOU KNOW IT HURT ME,who knows?who can be that person?but its not a person.its something that we have in our mind.yea,its really hard to explane in english.but whole tool is about religion.\n\n\n", "comment_156": "\nAs a First Nations person, this song is pretty crazy dudes!\n\r\nBack in the day, Aboriginal kids of Canada were sent off to Residential Schools stolen from their families where priests and nuns taught them how not to be \"Indian\" anymore. In these schools the priests sexually molested a lot of the boys, and in turn, these boys grew up and went back home to the reservations and became perpetrators themselves to their children which formed a huge circle of abuse within all Native communities. \n\r\nOn top of this, Native people were placed in Reservations away from regular society, and all these abuses became a part of \"Indian\" ideology and community driven... It led to alcohol abuse which led to further sexual abuse and then drug abuse... Such as sniffing gas etc. But being practically locked in the reservations there is (seemingly to them) no way out of the circle. \"It is just how family is.\"\n\r\nBecause of legislation, Aboriginal People were not allowed to own their own land and use it as equity in banks, without equity, there were no business', and with no businesses there was no income. If a native person left the reservation they would lose any rights an \"Indian\" had in law. Those who did leave (usually Single mothers), were usually hit hard with racism and joblessness which led to prostitution and stuff like that. There is definitely more to say on the matter, but it is like 2am here. haha... \n\r\nFrom courses I've taken in Aboriginal Studies, they said that an abusive family usually doesnt report abuse because within the family there is still love. There is an odd dichotomy of love and hate and an abuser doesnt want to see that person they care for hurt, even though they've been hurt by them.\n\r\nSo, this song could hit pretty hard to a Native person who has lived this life. It is sad... \r\nThere is a novel called, Porcupines and China Dolls that really hits this subject hard.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\ni read tools biography and it said it was about molestation in a family\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nMaynard stated in a Revolver Magazine interview that the song was about child molestation by a preacher/priest/reverend.\r\n---\"And only this one holy medium brings me piece of mind.\"--- \n\n\n\n", "comment_159": "\npeople have a tendency of treating others as they've been treated. when you treat someone nicely their behavior will most likely reflect that with other people. when people are seriously wronged they have a way of getting even, maybe even taking it out years later on a completely different person who has done them no wrong. this only leads to vicious cycles of hate and pain.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nWe are trapped in a neuronal prison - the easiest method of relief is transferring the pain we have felt into other people.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nma hombeboy who is like real good wit musik told me its bout his stepfather rapin him when he was young cause when he got out of prison he was all screwed up and shit...umm who knos though wel maybe yall but not me\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nIt is totally about sexual child abuse I mean \"My lamb and martyr...\" a lamb being a baby while using that child's trust of the parent to come closer to them and eventually it happens. But it is more along the lines of someone having this pain and instead of being able to just wipe their hands clean of it they want someone to share their agony and they turn to another child telling them that it will be quick and painless not knowing what pain it is causing and it is just a vicious circle. It is like a prison of emotions that there is no washing clean of.   \t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nI actually signed up just to give my input here, I love this song but I take it a lot more generally than a lot of you guys do I think. Here's my breakdown:\n\n\r\nIt took so long to remember just what happened.\r\nI was so young and vestal then,\r\nyou know it hurt me,\n\r\n- I think this part basically introduces the idea that humanity used to be so innocent and ignorant of materialism, ideologies, or economics, and were more concerned with more holistic matters of meaning.\n\r\nbut I'm breathing so I guess I'm still alive\r\neven if signs seem to tell me otherwise.\n\r\n - and so now we perceive living as simply getting through the years, ignoring the \"signs\" that there is something much greater out there we are missing in our big picture.\n\r\nI've got my hands bound,\r\nmy head down, my eyes closed,\r\nand my throat wide open. \n\r\n- I think this is just a great way of saying we aren't even looking around us to see what's going on, swallowing anything that's given to us.\n\r\nDo unto others what has been done to you x2\n\r\n- This is the common ideology of western man, we justify our actions based on the actions of others. Quite contrary to the ideal of \"Do unto others as you would have done unto you.\"\n\r\nI'm treading water,\r\nI need to sleep a while.\n\r\n - We are simply passing the time.\n\r\nMy lamb and martyr, you look so precious.\n\r\n- I think the lamb and martyr is any person who we take advantage of in one way or another in our every day lives. This is how our society works, we wait for an opportunity to get ahead of others. Or it might just be the innocence that still exists in us?\n\r\nWon't you come a bit closer,\r\nclose enough so I can smell you.\n\r\n- Smell is one of the most profound senses, humanity has long forgotten its importance but most animals rely on it for their entire world view... you only really identify smell with the people who mean the most to you.\n\r\nI need you to feel this,\r\nI can't stand to burn too long.\r\nReleased in this sodomy.\r\nFor one sweet moment I am whole. \n\r\n- I think this is basically talking about our urning to feel passion in our everyday lives, despite the fact that our societies revolve around the fleeting pleasures we can grasp onto in life, without any actual \"creation\" - otherwise known as sodomy.\n\r\nAnd the rest has been basically said already.. I think this is one of the few Tool songs where the video actually has a lot to do with the lyrics. The black alien thing seems to represent the repressive and cunning aspect of humanity, while the little white doll is the innocent aspect just trying to figure things out. Notice how he's missing an eye, and his legs... the alien has seemingly taken away his main abilities to explore the world. The little white doll is also just another box in a big room of boxes, and the alien seems interested in figuring things out too. The little white doll is \"doing unto others what has been done to him\"\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nI've always interpreted this as someone doing S&M to get over the trauma of being molested. Being raped took their volition away, and this way they get it back.  \n\r\nJust my two cents. \t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nI'm not posting what I think this song means, I'm posting what Maynard said in an interview.\n\r\n\"On the surface of course you have a title like Prison Sex which just brings up all kinds of apprehension and far in most people because they're not looking, they're not looking any deeper than just the words. They're looking at the words and thinking about a couple hairy back men finding love in close quarters and that's not what it's about at all. It's about the cycles of abuse. It's about recogizing those cycles and it's about addressing them and noticing now whether or not you're the perputrator, whether you are continuing on this cycle in some way by victimizing yourself repeatedly or  being a victim or by being a perputrator. And that's the first step, is recognizing that cycle.\"\n\r\nHere's the interview that came from:\nyoutube.com/…\n\n\n", "comment_166": "\nAlrighty....the title: Prison sex.  Ask any sexual assault survivor what there life was like when it was happening....EXACTLY like a prison.  nuff said.  Now: The meaning here is about the relationship between predator and victim and the cycle this role takes (although not all the time).  The predetor views the victim as a \"thing\", a vessel for a specific purpose and nothing more.  For those of you offended...I laugh, this very song Maynard would use to juxtapose misrepresentation in other forms of music (i.e. gangster rap and the treatment of women), but at least there is purpose in this music.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\ni have found some kind of \r\ntemporary sanity in this \r\nshit\r\nblood\r\nand cum\r\non my hands\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nThis is about the selfish filth that accumulates in peoples hearts after they've witnessed abuse. The self proclaimed right to hurt someone else, spawning a cycle of abuse. Its about how we all at various points enjoy hurting others for no reason, whether they \"deserve\" it or not.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nMaynard was raped as a child by his biological father, that's what this song is about. after a while, he was unable to continue to perform this song live. he was trying to overcome the trauma by singing this and facing it, but couldn't.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nIt took so long to remember just what happened.\r\nI was so young and vestal then,\r\nyou know it hurt me,\r\nbut I'm breathing so I guess I'm still alive\r\neven if signs seem to tell me otherwise.\r\nI've got my hands bound,\r\nmy head down, my eyes closed,\r\nand my throat wide open. \n\r\nif you go onto youtube and click on tool prison sex lyrics\r\ntowards the end of the video, it puts a note that says \"Many don't know that Maynard was abused when he was little\".\r\nso, therefore this song is about his dad sodomising his son.\n\r\nas screweed up as it seems, the first verse has to do with how his dad must have tied Maynard's arms around his waist his wrists against his thighs (disallowing maynard to run and or grab something) his head was leveled facing towards the ground and he must have been blind folded so he can't see what is going on.\r\nthen his dad put his penis in Maynard's mouth, and made him suck on it.\r\nvery screwed up if you ask me.\n\n\n", "comment_171": "\nThis song(WHICH MEANS: ALL OF HIS OWN SONGS REALLY)...Even as sick as it is lyrically!!!!  \r\nIS 1 of The WORLDS BEST EVER (EVER!! EVER!!)  WRITTEN!!!! \r\nIf this were a Novel? It would be a masterpiece! \r\nMAYNARD JAMES KEENAN IS A LIVING POET GENIUS, MASTER ARTIST, \r\nMAYNARD IS \"THE KING OF INTELLECTUAL HEAVY METAL, HIS BANDMATES... ARE THE KNIGHTS OF HIS ROUNDTABLE, LORDS AND MASTERS OF ALL INSTRUMENTS THEY HAVE CRAFTED!!!\"\r\nEVEN IF THE SONG IS LYRICALLY SUBLIMINAL WHEN PERFORMED, IN HIS SONGS, ALL OF THEM..., \"TELL IT TO YOU... AS IT REALLY PLAYS OUT FROM BEGINNING TO THE END...ALL AWESOME SONGS!!!\" \r\n\"READ BETWEEN THESE LINES, BECAUSE IT'S HAPPENED TOO ALMOST EVERYONE IN SOME WAY OR ANOTHER, DO YOU RELATE?\"  YOU SHOULD...EVERYONE (UNLESS UNDER A ROCK YE BE BORN YE RIGHT FOUL GIT!) HAS DELT WITH EVERYTHING HE WRITES ABOUT!\r\nI THINK OF THEM AS \"A KILLER JAZZED OUT/GOTHIC/BLUES/ALTERNATIVE ROCK BAND!!!!\" OR \r\nTHE CORRECT TERM IS NOW \"PHILOSOPHICAL ALTERNATIVE METAL\"\r\nTHANKS\r\nF#!*KORNTOOLSLIPKNOTA7X$#K (READ BETWEEN THE LINES...L.O.L.) YOUR 2ND VERSE NEEDS TO BE TOOLED ;-)\n\r\n\"Tool is exactly what it sounds like: It's a big dick. It's a wrench.... we are... your tool; use us as a catalyst in your process of finding out whatever it is you need to find out, or whatever it is you're trying to achieve...\" ***MAYNARD JAMES KEENAN***\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nWhen it comes to Tool, I usually don't try to find out what Maynard was thinking when he wrote it, or what it means.  Instead, I apply it to myself because I don't know anything about child abuse, anal rape, or whatever else Maynard is trying to convey.  The words he says create strong thoughts and feelings about myself and my life, which is why Tool is so special to me.  \n\r\nAfter what I did last night I will never take others in my life for granted again.  \t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nThis song is very powerful and amazing, as every other tool song is!!!\r\nI love listening to the live version of the song that I have picked up (great quality).\r\nDid you know that when they do this song live they include extra lyrics right before the epic \"I have found some kind of temporary sanity in this\" part!\n\r\ngoes like this!\n\r\n\"Got your hands bound, your head down,\r\nyour eyes closed.\r\nYou look so precious now.\n\r\n(Show me something\r\nThought I could make it end\r\nThought I could wash the stains away\r\nThought I could break the circle if I\r\nSlipped right into your skin\r\nSo sweet was your surrender\r\nWe have become one\r\nI have become my terror\r\nAnd you my precious lamb and martyr.)\n\r\nI have found some kind of temporary sanity in this\r\nshit blood and cum on my hands.\"\n\r\nIT IS SO AMAZING TO HEAR!... I wish it was in the studio version.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nI agree that i think this song is alot deeper than its superficial medium,\r\nThe Term ''This holy medium\"\" means that in this sadists mind,he's bringing himself closer to his deity \r\nBut personally i don't see child molestation in this song ( dont get why people do as it never references a child ) you can have something done to you well after childhood that effects your life,i believe its about the overall way life does you,you have something done to you, you want to do it to others,that simple,and what symbolizes that more than being sodomized against your will ? Thanks for reading :)\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nThe beginning of this song is meant to symbolize and simulate the sound of Maynard's stepfather's toolshed door opening and then closing. This song is about Maynard being sexually abused by his stepfather in that very tool shed. The music is a TOOL for Maynard to work through the abuse and other negative experiences of his life and heal as a result(with Maynard giving a phony explanation to his fellow band members so as to obscure the true meaning of the name Tool). Just as Maynard was a tool used for his stepfather's pleasure, the band Tool is used to express the demons within Maynard himself. \n\r\nActually, I'm just full of shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\ni think this song is more about how the society we are born into normally prevents ourselves from finding our true selves\n\r\n\"\r\nIt took so long to remember just what happened.\r\nI was so young and vestal then,\r\nyou know it hurt me,\r\nbut I'm breathing so I guess I'm still alive\r\neven if signs seem to tell me otherwise.\r\nI've got my hands bound,\r\nmy head down, my eyes closed,\r\nand my throat wide open. \r\n\"\n\r\nsomething was done unto us consciously by the powers that control us, it is not immediately obvious to us that it is harmful (\"you know it hurt me\" - the ones in control know that this is harmful but we might now), still our basic vital signs are still the same. still we are born into slavery, hands bound, head down, eyes closed, but throat wide open - meaning we still talk talk talk to each other without even realizing that we are just babbling and not understanding what is really going on\n\r\n\"\r\nDo unto others what has been done to you x2\r\n\"\n\r\nthis form of society is self-perpetuating, people think how they are living is right even if they have a hollow feeling inside of them, and they structure the world in a way that the next generation is bound to end up in slavery again\n\r\n\"I'm treading water,\r\nI need to sleep a while.\"\n\r\ntreading water refers to being stuck in a meaningless job that takes away all your time to actually think and free your mind, when you get home from your job you are tired and you go straight to sleep, again not ever having any time to really think\n\r\n\"\r\nMy lamb and martyr, you look so precious.\r\nWon't you come a bit closer,\r\nclose enough so I can smell you.\r\nI need you to feel this,\r\nI can't stand to burn too long.\r\nReleased in this sodomy.\r\nFor one sweet moment I am whole.\r\n\"\n\r\nthe only temporary escape is fulfulling your bodily needs, like sex, without caring for the person you are doing it with, but only caring about your body getting what it wants. in the sweet moment of fulfillment we feel happy, but it is a hollow happyness, for it will be over soon. it is happiness that only comes from short-term fulfillment of your ego needs.\n\r\n\"\r\nYou're breathing so I guess you're still alive\r\neven if signs seem to tell me otherwise.\r\nWon't you come just a bit closer,\r\nclose enough so I can smell you.\r\nI need you to feel this.\r\nI need this to make me whole.\r\nThere's release in this sodomy.\r\nFor I am your witness that\r\nblood and flesh can be trusted.\r\nAnd only this one holy medium brings me piece of mind. \r\n\"\n\r\nfor the other person it is the same, but they both see that they are happy for a short time, and so they both assume that this is what happyness is - blood and flesh can be trusted, there is no need to try to become happy spiritually using your mind\n\n\r\nmaybe this explanation is overly elaborate, especially for such an early tool song. it might be better to just see tools lyrics as general concepts most of the time. seeing it like this, this song is definitely about the concept of vicious cycles, all the bad in the world self-perpetuating by continiusly corrupting people\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nTo me it's not necessarily about abuse or rape. Really its about how human beings are creatures of habit, or how we only know what we are taught as children in many circumstances. So we repeat what we know, what we are familiar with. He uses prison rape as an example to make the audience be able to relate to the song better and to make it more emotional. That's one reason why I love Tool because the lyrics need closer examination. They always have a literal (which usually pushes the boundaries a little) as well as a figurative meaning. There songs a like word puzzles that we all must find what it true to ourselves in. \t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nI'm pretty sure 'And my throat wide open' is 'Half-closed, wide-open'. Listen to it with those words in mind. It makes sense also, especially following 'My eyes closed'. I could be wrong, but i'd imagine more it was what i mentioned. I think the throat verse would be too 'obvious' as a line too. Eyes closed, half closed, wide open also conveys a similar message of the 'physical' aspect of the song, like describing a reaction to something certain, but slowly over that line. I shouldn't have to explain more than that.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nTunes24: Sure maybe Maynard is into sodomy. Who cares right? As far as him really raping someone, I'd have to agree with Ganondox: highly unlikely, given the fact that H. is about him overcoming those temptations, and he also made a guest appearance at a RAINN benefit concert with Tori Amos. He said at one concert that the song is about recognizing the cycles of abuse within yourself. In his case, \"Prison Sex\" was just a fantasy, of what could have happened if he gave in to those temptations. I'd imagine that this song is him venting about those feelings, and then like he said, moving on with his life. That's one of the reasons why they haven't played it in concert for at least 13 years. He implied in \"Revolver Magazine Presents Tool\" that one of the themes in Aenima was to get past the darkness of the songs on Undertow, including Prison Sex. \"I write these songs to move through some pain or work out some issues, and if I'm successful in my art/expression I shouldn't feel the same way I did when I wrote those songs any more and there should be a logical progression.\" - Maynard in Blood Into Wine\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nYes the song could be about the cycles of abuse (victims evolve to become perpetrators), but I always envisioned this song to be about direct retaliation and revenge. In other words, the victim in the song grows up to later molest his molester. It speaks to a sick sense of justice and the desire for vengeance on those who've done us harm. The line \"I've come full circle,\" I've always interpreted to mean a literal coming full circle by abusing the one who had abused him before. In this light, I see the song as more about the disturbing catharsis one receives (or wants to receive) from unsympathetic revenge. Could very well be about cycles of abuse but I like to think of the song as being on a more personal, vengeful level. A kind of \"you did it to me now I'm going to do it to you\" vibe that's actually probably more disturbing than the cycles of abuse theory. Tool has sung about vigilante justice before...\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nFor some reason, I suppose I'm in the minority, but I've never thought the song was about physical rape. \n\nWhat is the one thing as a society that we are raped by almost exclusively? Religion. \n\n\"It took so long to remember just what happened.\nI was so young and vestal then,\nYou know it hurt me,\nBut I'm breathing so I guess I'm still alive\nEven if signs seem to tell me otherwise.\nI've got my hands bound,\nMy head down, my eyes closed,\nAnd my throat wide open.\"\n\nFirst of all, we're looking at the song from a present point of view. Get rid of the title \"Prison Sex\". Get that out of your mind. When is a time you have your hands bound, head down, eyes closed and throat wide open? In church, singing or praying. \n\nMaynard - like many of us - does not believe in God and feels raped by religion. He feels it hurts him in his life. This isn't a reach. \n\n\"Do unto others what has been done to you \nI'm treading water,\nI need to sleep a while.\nMy lamb and martyr, you look so precious.\nWon't you come a bit closer,\nClose enough so I can smell you.\nI need you to feel this,\nI can't stand to burn too long.\nReleased in this sodomy.\nFor one sweet moment I am whole.\"\n\nDo unto others, what has been done to you is repeated in this song. That is straight from church. Lamb and martyr, straight from sermon. People who feel sin, people who feel the need to be closer to their God have a NEED to push that religion onto someone else. Specifically, their children. They HAVE TO HAVE IT. It makes them feel whole. The closest I ever was with much of my family was when I was going to church with them at a young age. Some of you, many of you, probably remember that feeling. How proud your parents/grandparents were. The presents, the attention, the love. Then you started to pull away in faith. Then came their agony in your opinions. That KILLS them. \n\nFor I am your witness that\nBlood and flesh can be trusted.\nAnd only this one holy medium brings me piece of mind.\n\nBlood and flesh can be trusted. Only this one HOLY medium brings me piece of mind. Again. having your children believe in your God makes you feel whole. You are complete. \n\nHe goes on to talk about coming around full circle. People have been going full circle for centuries. That is the pattern of religious rape. \n\nBlood, shit and cum on my hands is simply a metaphor. \n\nTo me, the entire song is simply about the religious raping of generation after generation and how important it is for people to make someone to believe in what they believe. \n\nI can go ahead and tie that into Maynard's life, but there is no need. I don't need to tie it in with Jimmy, or H, or Wings or any other song. \n\nI'm simply shocked this hasn't been touched on. I don't think the song has anything to do with physical rape. \n\nCould be 100% wrong though.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nPeople who write novels about songs and dissect every single lyric, like they are some kind of superior intellects or something, are fags.  I made an account just to type this.  Thanks for reading and have a great day\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\n\"It took so long to remember just what happened..\"\r\nThat's the ticket!\r\nMaybe he didn't remember the molestation at all growing up until one day, his biggest fear of what might have happened, or what could happen to anybody.. Hit him right in the face! And then he took notice to the kinds of people he hangs around and the conversations he's had with these people.. And then he finally takes a look at himself and what he has become.\r\n\"Why did I become this? Wait.. Could it be? No way! Noo...\"\r\n(We'd like to interrupt this moment with an emotional breakdown!)\r\nRecognizing where he is in his life, he took notice to a deep fear. And by allowing that fear to surface, memories/experiences rose up and he found clarity. He became aware! He understood not only himself but his friends and the rest of the world. With enough anger and rage and outstanding creativity, Maynard created Prison Sex.\r\nJust a rough idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nHe explains it here into the interview. The cycle of abuse.. \n\nyoutu.be/…\n\n\n", "comment_185": "\nI know that maybe Maynard was abused in his childhood and he wrote this song but i believe it has another meaning too. \nI think this song is about how we growing up too be religious the most of us from our family and then that's how we learn to live and we keep passing our beliefs on people. The verse saying \"I've got my hands bound, My head down, my eyes closed And my throat wide open\" it seems like someone who is praying.\nAnd then saying \"I do unto the others what's has been done to me\" is like how our parents learnt us to believe in god or any religion and when we make kids too because we learnt to live like this we will pass our beliefs to them or any other person.\nThe truth is i got that meaning from a video i watched i don't remember which one but is making perfect sense to me cause i grew up in a family like that. I guess that's the best thing about Tool their songs sometimes might have more meanings and people can see different things.\n\nMaynard is truly a lyrical genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nThe meaning of the song is pretty simple, which makes it all the more horrify. Someone has been raped, and the only way they can find catharsis, the only way they can cope with the trauma, is by raping themselves. Considering this is how the cycle of abuse actually works it's pretty heavy .bestfreehdporn.pro/category/extreme-content-sites/\n\n\n", "comment_187": "\nno this my friends.... this is a kick ass song\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nOn top of my first comments, \r\nMaynard is saying, how he fucked religion up the ass when he in turn did it to jesus. It is about reclaiming or creating a new identity. \n\r\nStill sounds so native, because that was what has to be done to stop the circle. \t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nIt's a very deep song with a hundred different meanings. Songs are composed so that the the audience can draw meaning from their own experiences... yes, if some was molested as a child, I'm sure this song/video could send them into a seizure, but that doesn't have to be the only interpretation. \r\nThe religious \"rape\" interpretation was very interesting. I never thought of it in that aspect, and it was very enlightening. \r\nAnd I'm pretty sure the only ones in the world who know if Maynard was molested as a child is, in fact, Maynard and whoever did/did not molest him... Jussayin...\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nPrison Sex is the discourse within that very idea of sexual abuse coming from an ideological state, the state of family or the state of church. This state is a prison and passes on what has been taught to each successor which is the way ideology is passed. We learn from an authoratative figure and pass on our knowledge to our children. It is the mythology/story of a family. Not everything we pass on is a good thing or beneficial. We have a tendancy to end up fucking ourselves up the ass through our beliefs.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nAnyone can interpret it as they please.  I've been attracted to a lot of women i've had my fun. \n\r\nThe problem is whenever I've had sex it leaves me unsatisfied. I'm not saying I don't enjoy it, but I end up feeling low about myself and can never fall in love. Is it common? Am I the abuser in this song?\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nOkay...\nfor me this song it's all about \"divine sadism\"\n\n\"It took so long to remember just what happened.\nI was so young and vestal then,\nYou know it hurt me,\nBut I'm breathing so I guess I'm still alive\nEven if signs seem to tell me otherwise.\"\n\nlife is pretty much a walk in the park until one day you loose your inocence and get a broken heart. you keep breathing, that doesn't mean so much.\n\n\"I've got my hands bound,\nMy head down, my eyes closed,\nAnd my throat wide open. \nDo unto others what has been done to you\" \n\nhands bound, head down, eyes closed. this is pretty much the act of praying.\nthroat wide open: you're nothing, a sacrifice, anything that god want from you. \nMatthew 7:12- \"So in everything, do unto others what you would have them do to you, for this sums up the Law and the Prophets.\"\nthis is pretty clear. I guess!\n\n\"I'm treading water,\nI need to sleep a while.\"\n\neverything is useless and there's no rest\n\n\n\"My lamb and martyr, you look so precious.\"\n\ngod mocking at you.\n\n\n\"Won't you come a bit closer,\nClose enough so I can smell you.\"\n\nYou're just a prey\n\n\"I need you to feel this,\nI can't stand to burn too long.\nReleased in this sodomy.\"\n\nyou want sympathy. a shoulder to cry on.\nit hurt's like hell and you want to put an end on it.\n\n\"For one sweet moment I am whole.\"\n\nbefore deception... there's always a sweet moment\n\n\"Do unto you now what has been done to me. \nYou're breathing so I guess you're still alive\nEven if signs seem to tell me otherwise.\"\n\nsame but by the counter part (god)\n\n\"For I am your witness that\nBlood and flesh can be trusted.\nAnd only this one holy medium brings me piece of mind.\"\n\nblood and flesh are not divine. are imperfect, but it's all we have at the end.\nwe need to trust in ourselves. to become our own saviours.\n\n\n\"Got your hands bound, your head down,\nYour eyes closed.\nYou look so precious now.\" \n(praying)\n\n\n\"Thought I could make it end\nThought I could wash the stains away\nThought I could break the circle if I\nSlipped right into your skin\"\n\nnothing in life it's how we expected, we cant escape from our destiny or what god impose us.\n\n\"So sweet was your surrender\nWe have become one\"\n\npeople in disspear sooner or later accept god as a solution. even if he is the cause of all your suffering.\n\n\n\"I have found some kind of temporary sanity in this\nShit blood and cum on my hands.\" \n\nshit, blood and cum. you can find some temporary relieaf in earthly pleasures/distractions.\n\n\"I've come round full circle.\"\n\nno matter where you go, you go nowhere\n\n\"My lamb and martyr, this will be over soon.\nYou look so precious.\"\n\nMy son... eventually you'll die and I'll be there.\n\n\nBesides... the Video it's pretty elocuent.\nwe are the little doll. without legs, crippled on this life in one way or another. we are no more that a puppet living a shitty life and we will end in our personal hell without even notice.\n\nanyway....\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nspirituality a  .basic instincts of wat people do in jail because of life sentences and so fourt\t\t\t\t\n\t\t\t\t\n\n"}