{"comment_0": "\nI can't believe everyone is obsessed with sex so much...it's true, some (very few, in fact, of maynard's TOOL songs have to do with sex...many more of his apc have to do with sex) TOOL songs have to do with sex as a metaphor or as an abuse (prison sex), etc., but most of Maynard's songs have intellectual meaning, philisophical meanings, ideological meanings...as does pushit.  Pushit simply has to do with Maynard's internal struggle with his past and that of religion (Christian Baptist in particular).  The infant mentioned in the song is in part himself in his youth and representative of the infant Jesus Christ.  The ideas and values preached to a young Maynard really confused him because of the abusive relationship his stepfather (the one who was preaching) had with him.  He associates a harmless, loving, defenseless infant with himself as a child, but he still hates himself for letting that abuse happen...he wants to get away from himself and that time in his life.  The infant haunts him...it's an image that stays with him always, partly from what was preached to him.  It's an image that tells him to love those who have wronged him (forgive them), an image that dictates the way he SHOULD (whether the right way or the wrong way) live his life but that he can't face up to because it is just to painful.  Jesus was abused in some of the most wicked ways and yet, he forgave all those who maimed him.  Maynard disagrees with this at the time this song was written.  He holds THE GRUDGE and wheres it like a crown.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nFor me this song, as with many tool songs is about breaking patterns of negative, and often abusive behaviour - whether it be towards the self, another person, or on a social level.  It says that the capacity to damage is often unintentional but inevitable if you dont actively overcome the negative aspects of yourself, whatever the cause of those traits is.\n\r\nThus pushit may be interpreted as a relationship whereby two personalities bring the worst out of each other even though they are apparently inseperable, and dependent on one another.  The only way to end the pattern is for both to die and be reborn.   \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI love the multiple ways you can interpret this song. You can see it, shallowly, about sex, wade into the waters and say it's about a complicated relationship between two lovers, or, as I prefer, you can dive deeply and say it's about the relationship between two characters within one body. These characters are fighting for control. Not necessarily two personalities as if he is a schitzo, but more so that you can't decide who you are or want to be and you change for other people and distort who you are for them, and then finally deciding to take control in the end, even if sometimes you loved your \"alternate person\" that you were pretending to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nMaynard himself said that this song is about identifying the cycle of abuse within yourself. The lyrics quite obviously show that. You may interpret the song in any way you wish, but the man himself already gave the meaning.\n\n\r\nSource: youtube.com/…\n\n\n", "comment_4": "\nI hate when people say Maynard is a god.  This sounds so stupid coming from an actual Tool fan.  He is a human being just like you or I.  Of couse he IS in the greatest band in the world, and has gone through life experiences that make him a person the we can learn from.  Although sometimes I wonder about Tool's true meaning.  never-the-less, there is some value to be seen in Tool songs, but not so much that we should follow him blindly!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nNever been a fan of conceptual art until TooL came around... Persons translate deep songs like Pushit the way it suits them, and everyone will find 'the right meaning' and 'the right way to interprete' lyrics in the right way to fit into his/her own mental 'device', due to their own preconceptions, frustrations, meanings etc.\r\nFor me, personally, this song has been the best introduction to the methods of Jung's theory of 'Reflective Cycology' :-)... which refers to 'phenomenom' of projecting your own virtues and lacks onto another person, making him/her reflection of yourself - just like Jesus said about 'thorn in someone's eye becomes a stick in your own eye' (or something like that, I'm sorry for this paraphrase). What it means is that what might bother you with one person is actually something that you might bother another person with.\r\n...like someone pointed previously about the inner struggle over/against oneself, I thought for Maynard that he addressed this song to himself : 'who am I to judge and strike you down' refers to what I previously wrote on Jung's theory... The thing is that I was the one addressing this song to myself, and if I hadn't learned important lesson on this projecting onto other persons, I quess I would become schyzophrenic, to say at least. ;-)\r\nSeriously, TooL did one hell of a job here and I'm glad that I really don't know what this song means for them... However, I recommend you all to find more on Jung, because I'm too lazy to write down here all the concepts on above mentioned, and it might be useful to someone who might, instead, post something originally on this topic.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nWhat we should all realize off the bat is that there were 2 different 'released' versions of this song.  In the live version (Salival) Maynard comments at the beginning of the track that they're going to play it differently because it means something new to them and that they want the energy of the crowd to help propel the interpretation along.\n\r\nThe original song (Aenima) can be interpreted many ways.  Yes, I agree (sometimes against my will), that it could be about anything from abuse (including self) to relationships, religion, health, etc.  I believe the song itself was crafted in such a personal and hidden way that we could all generalize until we're blue but never really touch the source of this incredible track.\n\r\nThe live version, however, is a different story (in my opinion).  Thank you F00L for transcribing this version for us (above).\n\r\nAllow me to be slightly long-winded due to the depth of the ideas I'm trying to express... hopefully you won't just scroll down to add your own opinion in haste.\n\r\nWith Maynard's declaration that they were \"trying to see this song from a different angle and under a different light\", it should be obvious that there was a breakthrough in regards to how they felt about this song in the few years they were touring after they had recorded and pressed it.  \n\r\nI guess, given the array of \"mental states\" or \"frames of mind\" (no, I'm not talking about drugs) you can be in on a tour, where you are playing similar set lists every night, it's inevitable that the songs that you have written from your deepest and/or darkest places will start to take new meaning.  Indeed, even the greatest artist will find new inspiration in his old work. (I think I'll coin that!)\n\r\nWith his plea to have the crowd grant him their collective feeling of vulnerability, I believe he had a very direct and essential message for all of us.  No, I am not saying that \"Maynard is God\" or a prophet, but I believe that if there were a band out there that could speak to that which is within usâ\u0080¦ below the surfaceâ\u0080¦ it is Tool.   \n\r\nThus, I think Maynard really gave us a glimpse into our struggle.  I also believe he said it in the simplest way possible.  For those of you that are not familiar with the evolution of the body, mind and spirit, you should check out some Buddhist literature. Try â\u0080\u0098The Tibetan book of Living and Dyingâ\u0080\u0099 â\u0080\u0093 Sogyal Rinpocheâ\u0080¦ (best source I can give while in the moment).\n\r\nI believe that this song (the live version) was written entirely about the evolution of the mind.  A lot of people have touched on topics of God in this forum, but I don't believe it's â\u0080\u0098Godâ\u0080\u0099 that he's speaking of/to... instead, it's his â\u0080\u0098higher selfâ\u0080\u0099.  There's a bit of gray between the 2 concepts that can cause confusion.\n\r\nIf you listen to this song as a message to his â\u0080\u0098higher selfâ\u0080\u0099 as it tries to pull him through to \"enlightenment\", or simply our next stage of growth, it makes a whole lot of serious sense.\n\r\nI don't know how many of you have a voice in your head that you know is your own but can't grasp how it actually sounds?  The one that speaks the words as you read to yourself, the one that you turn to when you're unsure... that little angel of good advice that you don't always take....\n\r\nI believe, as is not uncommon in spiritual circles across the world, that this is our very outlet to the divine.  Or brief reflection of ourselves in a higher consciousness.\n\r\nI believe that his song is a very direct and very focused spotlight on the struggle between the â\u0080\u0098Higher Selfâ\u0080\u0099 and the Ego (see Freud or any Buddhist literature for dynamic ideas on the function/identification of the notion).\n\r\nThe Ego itself is the dominant mental structure in our every-day lives.  The Buddhists say that it's the veil in which covers the line between the corporeal and the enlightened.  It's that which blinds us and tricks us into remaining in this evolutionary state until we literally hatch from the egg.  The Ego is our egg shell, that which protects us at a very basic level and allows us to grow without the pressures and mind-blowing intensity that is â\u0080\u0098Godâ\u0080\u0099.  \n\r\nEven though the Ego tends to hold some people back (those who grow very quickly inside the shell) it is completely essential in our evolution... as important as the brain, the heart and the lungs.  \n\r\nAs much as it is necessary, it is also very tricky.  It has the ability to fool all of the senses, to shut you down if it needs to... to direct your train of thought as you drift away.  We give full control of ourselves to this innate consciousness and handfuls of us come to realize it entirely.  \n\r\nWhen we start to wake up, it's terrifying... like being pushed from the womb.  We are about to undertake reality-shattering events that will re-construct everything we thought we knew.  \n\r\nIn order to cross through to the next layer of reality/consciousness, we have to be able to leave the womb behind... and that is one of the hardest things a human being can be asked to do.  Just look at how we react as babies when we are born and how we deal with the world as we learn and grow.  Life a we know it isnâ\u0080\u0099t always the easiest place to exist.\n\r\nThe fact of the matter is that we can't stay in the shell forever, regardless of how comfortable or familiar it becomes.  The shell (Ego) will ultimately become too small or narrow for our expanding mental/spiritual capacity as humans.  \n\r\nWe have to come to terms with the idea and ease ourselves through the passing, as not to cause ourselves any more shock than necessary.  When I hear this song and I think this way, it makes me realize that â\u0080\u009call of this pain really is an illusionâ\u0080\u009d... that we should embrace our evolution and start to 'question authority' (ego) regardless of how often this authority attempts to trick us into staying.  It is just our reflection.\n\r\nAs you can tell, I'm very passionate about this song and the truth that rings through me every time I hear it.  Hopefully there's at least one other person out there that shares the same perspective.  If not, sorry for wasting your time.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe Yin Yang sums up these lyrics pretty well. Polarity, duality, energies combing to become greater than the sum of their parts or canceling each other out, always containing some part of the other within themselves. Light and dark, self and other, being and non-being, male and female, or even just two people in a relationship regardless of gender. It's the magnetic push-pull phenomenon. This can be applied to many spectrums/polarities and interpreted in many different ways.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nIt is a song a bout Fear.\n\nConquering ones fear is like pushing it onto one self. \n\nThere is no greater feeling than conquering ones fear.\n\nSurvival is my only friend. Terrified of what may come.\n\nRemember I will always love you, as I claw your fucking throat away.\n\nIt will end no other way.\n\nFear is the only emotion that you can eliminate with destruction\n\nConquer fear and you can conquer anything.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI believe this to be about the painful schism of leaving the home of your mother. She has made you her life, But that life WILL kill you as a person. If it was up to her, she would still be wiping your asshole as a 25 year old. \"remember I will always love you, as I tear your fucking throat away,\" you love your mom, but you can't be under her thumb forever, even if it kills her.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nmy interpretation : \" grow up and push this childish , Greek tragedy , egoistic love relationship away \" .. cause thats not love\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think an important biographical detail behind this song is that Maynard's son was born the year before this album came out, and I think he was already having problems with the mother of the child.  'Pushit' is one of the songs on _AEnima_ to deal with this.  \"I saw the gap again today / while you were begging me to stay\"----he's realizing there's an emotional distance between him and his partner, and the way she's dealing with it is controlling, demeaning, and abusive, and that trying to force him to stay through intimidation or threats isn't true caring, since \"there's no love in fear\".  But the relationship has resulted in a child that he has to accept---\"choke this infant here before me / what is this but my reflection?\"  This relationship is also addressed on _AEnima_ in the song \"H.\", where he's telling his partner that he's \"too connected\" to her \"to slip/fade away,\" and that she's \"considerately killing\" him.  In that song, it's his child he's referring to when he says, \"My blood [son] before me begs me, open up my heart again.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI'd like to validate the previous comments regarding this being about an abusive relationship, however, I think the abuser is the singer\n\r\n\"What is this but my reflection?\r\nWho am I to judge or strike you down?\"\r\n...\r\n\"You still love me\r\nYou still love me but you didn't need to shit on me\"\n\r\nHe's projecting his own abusive tendencies on the likely innocent partner.\n\r\n\"If when I say I might fade like a sigh if I stay\r\nYou minimize my movement anyway\r\nI must persuade you another way\"\r\n...\r\n\"Staring down the hole again\r\nHands are on my back again\r\nSurviving is my only friend\r\nTerrified of what may come\n\r\nRemember I will always love you\r\nAs I claw your fucking throat away\"\n\r\nHe realizes that he's the one to blame, despite the partner's loving patience and forgiveness, who clings to him despite how he's wronged her, and has tried to push her away before he does more damage, but is too weak to either change or end the relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nMy favorite Tool song.  It's not piece of mind, it's peace of mind.  I interpret this to be someone trying to end a relationship or get out of something but he or she is trapped and can't get out.  This is one of themost brilliantly written songs ive ever heard.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nWhen they play this song live, I well up with emotion. And you know the long note? The \"I must persuade you another waaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaay\" he recreates that perfectly on the stage! No one alive will ever have a more original voice that MJK.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nEw! You've just ruined a fantastic song 4 me now! Every time I listen to Pushit, I'll think of Maynard having sex!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nomg... i guess.... everyone can take it however they want.... and everyone sees things differently... but, i do like the live version of this sooo much better... so much more feeling and emotion...\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nyeah true.. the salival version is great.. how come these lyrics are missing the first part though?\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nDoes anyone else find the LAMC so completly annoying. I hate having to skip through it to set to that great song, Maynard's Dick\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI interpret this song much differently, due to the experience I had involving it. I believe he loves her, but he is so afraid of being hurt and opening up. I pushed my boyfriend(now my husband) away because of the same reason. He is afraid to go inside her, meaning her heart, (not her crotch, NeverGreen!) He is choking on his emotions, he wants to run fromher, but it feels so good to be held by her. So he pushes her away, and she is pushong him away by being so loving and good to him, it scares him...I held my husband, when he was still my boyfriend, while he cried and got rid of a lotof old garbage that was tormenting his soul. It was very cleansing and it means the world to us, even though we are seperated now...\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI interpret this song much differently, due to the experience I had involving it. I believe he loves her, but he is so afraid of being hurt and opening up. I pushed my boyfriend(now my husband) away because of the same reason. He is afraid to go inside her, meaning her heart, (not her crotch, NeverGreen!) He is choking on his emotions, he wants to run fromher, but it feels so good to be held by her. So he pushes her away, and she is pushong him away by being so loving and good to him, it scares him...I held my husband, when he was still my boyfriend, while he cried and got rid of a lotof old garbage that was tormenting his soul. It was very cleansing and it means the world to us, even though we are seperated now...\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nthe last three lines are my favorite of this song. supposed love that ends up hurting one more than making them euphoric. nothing like fairy tale love. i believe love is a type of insanity and this song shows this so beautifully. mmmm. \t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nthat's sad and you are a fool\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nHey joshthack - MJK IS GOD!!!\n\r\nAnywho, I don't know what the song's about but I love the last few verses that read \"I must persuade you another way \n\r\nThere's no love in fear \n\r\nStaring down the hole again \r\nHands upon my back again \r\nSurvival is my only friend \r\nTerrified of what may come \n\r\nJust remember I will always love you, \r\nEven as I tear your fucking throat away \r\nBut it will end no other way\"\n\r\nI have to believe those lines are about finally saying \"SCREW THIS!!  I still love you but you've messed me up so bad!  I'm going to kill you and you can't hurt me then and there's NOTHING you can do to stop me\"...  I mean, it's not really hidden, lol.  I do think the song is about abusive (though not physical) relationships...  I mean...  Pushit...  look at that word...  it could be Push, hit, or shit...  Maybe he's trying to say that he/she Pushed, hit, and shitted on him?  I don't know...  I'm not as clever as THE ONE AND ONLY MJK (AKA GOD)  lol...\n\r\n-The Prynce\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThere is no human being on this earth who can rightfully claim to be God, because the thing that makes us human is our faults.  Anyone who claims to be perfect is a liar.  Maybe Maynard has been inspired by God, or the devil.  I actually think human nature is that of the beast, because why would God put us here to destroy the earth and the animals, which is what the human race is doing.  I can't stand most people in America because most of them are ignorant, violent, and sex-crazed lunatics.  I may listen to the advise that others offer, after all I am only 19 which is not a long time at all, but essentially the only voice that I follow is my own.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nJesus was God on Earth, maybe Maynard is the 2nd coming! ;-) ps I hope you see that as a joke and not me being totally sycophantic, but you have to admit that Maynard isn't like any other person and that he does have something special about him. His lyrics are inspirational and his voice is completely unique. You now you're going to have to crack under the pressure and admit that Maynard and Tool totally rule! pps You don't have to live in England where President Blair (sic) constantly kisses the arse of George Dubya! \t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nYou got some built up hostilities Josh?  Maybe you should see someone about it.  I hear psychologists can work wonders with the mentally ill.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nMaybe you shouldn't offend other users?\r\nHe is free to express his opinion, no one is free to offend other users.\n\r\nSM Mod.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\njoshthack; shut the fuck up! let ppl assume what they want to, so why doesn't everyone stop telling everyone else that their ideas are stupid\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nby the way; I'M A SEX-CRAZED LUNATIC! SO WHAT OF IT?.........BITCH!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI must agree with Harry_Manback in that this song is about an abusive relationship and how he is trying to get out of it but the only way he can is by killing her.\n\r\nI think the two verses that show this for what it is are these: \n\r\n\"Saw that gap again today \r\nAs you were begging me to stay \r\nManaged to push myself away, \r\nAnd you, as well \n\r\nIf, when I say I may fade like a sigh if I stay, \r\nYou minimize my movement anyway, \r\nI must persuade you another way\"\n\r\nand that the infamous lines of:\n\r\n\"Just remember I will always love you, \r\nEven as I tear your fucking throat away \r\nBut it will end no other way\"\n\r\nAre him killing her or the relationship.\n\r\nJust my .02\n\n\n\n", "comment_31": "\nYay!! Someone agrees with me!! Normally, my thoughts are so banal you wouldn't guess that I'm studying English Language at college!\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI have another meaning for Pushit, i'll post it in a bit, the one above took me forever to type out.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nrzatheraza - Agreed!\n\r\n-The Prynce\ntheprynce.com\n\n\n", "comment_34": "\nI think that the 2 different versions of pushit have 2 different meanings.At least to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nthis song is about a man so in love and so afraid of loving. Perhapse she has hurt him, perhapse, more likely, someone else has and he is \"gunshy.\" It feels so good to be held by her, loved by her, but he is so afraid of loving her back, doesn't want to be hurt. If he doesn't \"enter,\" enter in to a deeper walk with her, he will be safe. \"If I do we both may disappear..\" He may end up destroying her with an involuntary pushing her away to save his own heart. He loves her, even though he rips her throat away, but not literally, he is just subconsciously pushing her away and it is killing her...He lets it go so far then withdraws...it kills them both and they push each other away. This song rips my guts out and makes me cry and makes me miss my husbnad, who introduced this song, this version, to me. I pushed him away...now we are getting a divorce...but I will always love him, even as I tear his throat away...\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nhey prom queen killer,i agree with u...may we have a count of hands here plz?...every1?..who doesnt?..oh here's a message 4 u?..fuck u!!!>.heheheheheheehhe..\r\nnice song...great music,these guys\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\ni identify with this song through the last relationship i had..near the end of our relationship, every time i'd get home from spending time with this guy i'd put this song on for hours.. we had so many problems with each other, it got to the point where we hated being around each other and talking...but we still had this strong love and connection.. we would fight so bad then appologize then lie, and appologize.. it was a total rollercoaster..and it sucked, but i loved this guy so much.. this song is exactly what i felt every day and it helped me from going insane every night .. maynard is right.. there is no love in fear.. i managed to push myself away, and you as well my dear ..  somehow i hope he reads this\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nfor all u people who somehow interpret  maynards songs about sex , im sorry to bring u down but u could not b more far from the truth, maynards songs have so much meaning thta u or i or ne body for that matter can even fathem, this song in my opinion is about a battle with ones self, a split personailty if u will, when he says you  pushit on me, he is saying his other self is quite a burden on him, and as the song goes on as he says staring down the hole again, and saw the gap again, thta is him comtiplating suicide to end his madness, when he says rest your trigger on my finger that is another example how this song is a battle with onesself, as the song continues to describe the struggle, and after about 5-6 min the song goes into a quiter less intense stage where he says hes in a place he doesnt want ot be and seig things he doesnt want to see, ect, i belive that he has then just fallen in the gap between himself and his other poerson and he sees the things the other person sees and what not , and eventually he   comes out of and speaks of seeing the gap again but is begged to stay, inother words contiplaint susiced again, and his other person is beggin him to stay becaue he knows that if he goes they both go, and eventually he realizes that ther is no way to stop him and he cant live a happy life with this burden other self on him so he stairs down the hole again, with hands of his other person on his back again, saying survival is his only friend now, and he says rememebr i will always love you because it is part of him so of course he loves himslef but the burden has become more then he can handle , so he says  , keep in mind i love u but its to much and he begins to tear his throat away because it willl end no other way meaning that only way to get rid of the suffering is by killing the other person and himself as well \t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI agree with harry...noone of us are probably even close...thats the beauty of it i guess.. we all can brainstorm on what it means.. and not be wrong.. even though some of these GENIOUS statements are way outta left field... \n\n\n", "comment_40": "\nI always looked at this song thru the eyes of an \"accidental father\". I picture a guy knocks a girl up, they have a shotgun wedding, and this song is going thru his head as the child is screaming at 3am and he's got two jobs to work today. Maybe this view is overly simplistic, but read the lines in that context and it fits. He loves his kid, the kid makes him feel alive, at the same time the kid is ruining his life. I love the line \"Rest your trigger on my finger\" as it is so telling of the speaker's view. \"I wont pull the trigger, but dont put it near me and tempt me.\" This meaning also fits with the overall progression of the album. The song is about evolution. The first songs show a need for change, the next shows a want for change, and then the next few songs show catalysts for change. Finally you have Aenima and (-)ions are the change, and third eye is the evolution occuring after. Pushit is one instance in our life where we wish we were better. He screws up and his a kid, now he wants to kill it, you can see him restraining himself, fortifying himself. \r\nI dunno. Its fun to imagine and let your mind play around with the imagery.\r\nTool is the best ever ever ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\noops, i meant the ALBUM is about evolution, not the SONG. the song is a catalyst.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nFirst off I have to say, There is no god!! Religion is all a fairy tail, it should all start by saying \"Once apon a time\"!! Just my views.. sorry.. but this song is by far the most inspiring song written by TOOL. I like the Salival version a lot better, so I will write my openion on that song under the salival Pushit version page!!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI like what ikilledthepromqueen had to say; to elaborate:\r\nThis, like any other impressive work of art, leaves for interpretation by the reader/listener/fan.  I find this as a situation of leaving a past habitual activity, be it sex, drugs whatever.  But the temtation keeps calling you back.  This too fits with the theme of the album (Anema + Enema), leaving a past behind, a shadow which is holding you from your greater enlightenment\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\ni think maynard is a fucking genious.................seriously........i think he makes alot of his songs sound sexual because everyone on the planet can relate to sex...but not everyone on the planet (obviously) can look past the actual words and find the true meaning.  If he were writing his songs about actual sexual meanings, he would be a rapper.  Oh, btw...I think this song is about an abusive relationship....\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nOk what I am about to write is just what I think. It isnt right, just as noone elses interpretations are right, but neither are they wrong. they are what they mean to you.\r\nOk my belief is that this song is about being in love with someone. You love this person but they hurt you, and they are aware that they hurt you, they use your weakness to there advantage, they abuse you. They push and shove you at there convenience.  You only are with them because what they do to you may hurt you, but it secures you and they feed on this. They konw you wont leave because you love them too much and are too comfortable in the relationship.  The only thing the abuser is willing to give you is sex, to satisfy you.  But soon this whole ordeal becomes akward, and then annoying, and person has pushed you to the brim:\r\n\"Put me somewhere I don't wanna be \r\nSeeing someplace I don't wanna see \r\nNever wanna see that place again \"\n\r\nthen you realize that this person is only going to tear you apart, so you push yourself away from them, and everyone else:\r\n\"Saw that gap again today \r\nAs you were begging me to stay \r\nManaged to push myself away, \r\nAnd you, as well my dear\"\r\nThen you explain to the person why you feel that this whole relationship is abusive to you:\n\r\n\"If, when I say I may fade like a sigh if I stay, \r\nYou minimize my movement anyway, \r\nI must persuade you another way \n\r\nThere's no love in fear \"\n\r\n\"Staring down the hole again \r\nHands upon my back again \r\nSurvival is my only friend \r\nTerrified of what may come \n\r\nJust remember I will always love you, \r\nEven as I tear your fucking throat away \r\nBut it will end no other way\"\r\nNow the fear comes into play, you want to leave, but shes pulling you in\" Hands upon my back again, and terrified of what may come\" Then the last lines, he breaks from the fear and ends the abusive relationship.\n\n\n\n", "comment_46": "\ni totally agree with movedbytool\r\ni understand this song to be about someone who is afraid to love and in doing so, he/she pushes said other away. pulls him/herself away.\r\n\"There's no love in fear\"\r\nif you are afraid to love, wouldn't you push it away\n\n\r\n-laynerox\r\ni know i do\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI think that this song is about life and authority specifically school and parents.  They make you go to school and make you do all those things even though they know you use them in real life.  You still love them even though your so annoyed sometimes you want to \"claw they're fucking throat away.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI agree with everyone that this is about an abusive relationship, however, i think that the relationship isn't between a man and his girl, but between a man and his drugs. I think it's about heroin in particular. Here's my analysis:\n\r\nI will choke until I swallow... \r\nChoke this infant here before me \r\nWhat is this but my reflection? \r\nWho am I to judge and strike you down? \r\nI think this verse he is talking about his consciense, and how its a little voice (infant) in the back of his head thats telling him that heroin is bad, but he doesnt listen (chokes) that voice away.\n\r\nBut you're \r\nPushing and shoving me \r\nYou still love me and you pushit on me \r\nThis is his addiction acting on him. He is saying that the drugs (referred to as 'you') are making him use them.\n\r\nRest your trigger on my finger, \r\nbang my head upon the fault line \r\nTake care not to make me enter \r\n'cause if I do we both may disappear \r\nI think the trigger is the needle's plunger, and he rests his finger on it to inject. The fault line, i believe, is referring to the tracks that the needle leaves after repeated use.\n\r\nBut you're pushing me, \r\nShoving me \r\nPushit on me \r\nBack to his addition forcing him to use the drugs.\n\r\nSlipping back into the gap again \r\nI'm alive when you're touching me, \r\nAlive when you're shoving me down \r\nThe first line has too meanings i think. One could be the needle being pushed (slipping) into his veins again. The second could be he wants to get away from the addiction, but it wont let him and he keeps slipping back into doing it. The alive part means he feels so alive when the heroin is entering his body.\n\r\nBut i'd trade it all \r\nFor just a little bit of \r\nPeace of mind \r\nThis is when he says he really wants to give up the addiction so he can just have some peace.\n\r\nPut me somewhere I don't wanna be \r\nSeeing someplace I don't wanna see \r\nNever wanna see that place again \r\nI think this either refers to a relapse, or it can be him thinking back to when he was high on the h.\n\r\nSaw that gap again today \r\nAs you were begging me to stay \r\nManaged to push myself away, \r\nAnd you, as well \r\nI think is him looking at his arm and seeing the needle's track and remembering what he used to do with it. He's saying that it's begging him to use h again, but he manages to somehow resist the urge.\n\r\nIf, when I say I may fade like a sigh if I stay, \r\nYou minimize my movement anyway, \r\nI must persuade you another way \r\nI'm not really sure on this verse. Maybe something about the h making him less of a person.\n\r\nThere's no love in fear \r\nThis is when the h starts making him paranoid and he's afraid all the time. He's tell the h that he can't love it if all it does is make him afraid/paranoid.\n\r\nStaring down the hole again \r\nHands upon my back again \r\nSurvival is my only friend \r\nTerrified of what may come \r\nI think this is where it really makes me think the song is about h. Staring down the hole again, i believe, refers to him looking at the needle, and looking down it's sharp end. The hands part i think feeds more into the paranoia, like how he's always looking over his shoulder. Or it could also show that he's helpless (hands on my back could be referancing handcuffs). The survival part could mean two things: One that he's got to not do h if he's going to survive, and the other being that he has to do h in order to survive, because if he doesnt he'll die from withdrawal. The last line is adding to the survival part, because theres a negative outcome either way so he's afraid of whats going to become of him.  \n\r\nJust remember I will always love you, \r\nEven as I tear your fucking throat away \r\nBut it will end no other way\r\nThis part i can only theorize on. I think the first line is him telling the h that he loves it, but in a love/hate kind of way. The second line has me confused, i think you can see it as him saying he's going to tear away the h's throat and finally be free from it, or it could mean that the only way to be free from it would be to tear away his own throat (commit suicide). The last line is just saying that he has to do it, because he has no choice.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI've read some of these comments before, but I can't be bothered to now.  I'll just stick my interpretation on here...\n\r\nBasically, the whole feeling I get is of an abusive relationship.  But emotionally, not physically.  The speakers partner forces them to do whatever they want them to.  I believe that there could be an element of sexual abuse here, as in \"Alive when you're touching me/Alive when you're shoving me down\".  I see this as a reference to the speaker enjoying the physical side of the relationship, but still being forced into it.  Maybe they are trying to hold onto a belief that they are in control, but they know that they are not.\n\r\nThe speaker has assumed the submissive role for too long, and feels that it is time to break away.  The first part of the song I see as the routine and what has happened this far.  The middle section is reflection and realisation, and calmly stepping back to observe the situation.  The last, faster and more aggressive section is the solution and resolution.  Thus the speaker will break the cycle and regain his(/her) freedom once again.\n\r\nThere's probably more, but...eh.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThis is a little odd, but I had this insight yesterday.  I read someone's view on here that the song could be about heroin addiction, and I think that maybe it could be, but from the perspective of the actual drug.\n\r\nLines like \"take care not to make me enter\" is the drug warning the addict of what will happen if he persists with his usage (\"we both may disappear\")\n\r\n\"bang my head upon the fault line\" as a track mark reference makes more sense to me from the heroin's point of view.  \"Saw that gap again today/While you were begging me to stay\" again is showing the dependence of the addict as he can't live without the drug.\n\n\r\n\"But you're pushing and shoving me/You still love me and pushit on me\" is the same, I guess.  The junkie feels like he loves the drug and forces use.  It's a little weird, as much of the lyrics would seem like the heroin resents the frequent usage, but it's something that I think could fit.  \"Put me somewhere I don't wanna be\" is resentment again.  \"Fade like a sigh\" and \"disappear\" can be references to the drug dissolving into the blood stream.\n\r\nIt's a weird relationship, like a love/hate thing.  \"Remember I'll always love you/If I claw your fucking throat away\" is how the drug loves the user, but knows it will ultimately be his death.  Oooh, new insight!  The song is about how the drug loves the junkie, but doesn't want him to use it as he doesn't want the junkie to die!\n\r\nOn second thoughts, that made no sense at all...\n\r\nWhatever.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI'm also sure the chorus says \"You're shooting me\" in it, when I listen to it I hear that.  So that would be shooting up, obviously.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nSilverdew, i like how you added and expanded to my theory that it was about herion addiction. Your theory makes a lot of sense, and you really can back it up. I applaud you.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI downloaded a live version of this song (the normal one, not the salival version) and right before they started playing Maynard said, \"Have you ever had anyone love you so much that they tried to kill you?....me either.\"  So there you go.  Personally I don't believe any of the meanings for their songs are true unless Maynard explains them himself because most of the things people interpret are way off.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nwow, thanks man.  English Lit is one of my best subjects and all we ever do is read into poetry, hehe.  I guess reading what you wrote made something click.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI feel like this song is talking about an abusive relationship. But the one that is getting the abuse will not leave but really wants to. like this line \"Slipping back into the gap again \r\nI'm alive when you're touching me, \r\nAlive when you're shoving me down.\" they feel alive no matter what they do to them. but this line \"But i'd trade it all \r\nFor just a little bit of \r\nPiece of mind.\" they would trade everything for that piece of mind. also this line \"But you're pushing me, \r\nShoving me \r\nPushit on me\" is like telling the abuser \"hey stop abusing me, ur pushing me away from you.\" then they finish it up with \"There's no love in fear\" so they're saying i dont wanna be with you because i dont wanna be scared of the one i love.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nquite obviously this song is about sex and the woman not stopping... (horny bitch)\r\nas said PERFECTLY by Asz\r\nbut yeah... Definetly one of the greatest songs ever to this day...\r\nMJK is an absolute fucking poet in the way he wrrites his songs... all i can say is WHEN IS THE NEXT ALBUM?!\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nYou must all remember that Maynard's lyrics are well nitted together and work on lateral plains. and even though he might be singing about humanity abusing each other/ or sex he will use sexual references because the dynamic of this sex, the pushing and shoving(agressiveness) forcing me somewhere a idont wanna be( forcing people to capitilate). there is a very feminine aspect of this song, and it creates alot of sexual/sensual energy via the auditory senses. Remember, when human beings find it hard to explain their feelings on a particular subject matter or state, then we use analogies, symbolism and sometimes refer to mythology. With a song as complex as this one, do not be so bold to force your opinions on others. What came first- forceful opinons or this song. peace\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nOKay this dosn't really have anything to do with the song but i thought it was awesome. did anyone else notice that on the first part of the song he Accents \"Push\" in pushit and then in the second part he accents the \"shit\" in pushit. giving double meanings to one word, like in AEnima the title and AEnema the song. it's great i think maynard is a genius. probably not god but a genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nwho cares about the meaning just enjoy the song.\n\n\r\nand the only true god is time\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI feel this song is about maynards inner if wanna say voice saying to him that is it not worth it that he should just turn back,i get the feel that he is saying to himself that the voice is right right but he has to resist so he can feel once again,then he comes in to the part that he would trade all of the spirts love and his trust within just to get a piece of mind and that he wish the voice would stop pushing all of this on him and let him have a little piece of mind for himself.Then because the voice has not stoped he has been pushed to far and now he is \"somewhere he doesnt want to be\" that he has pushed him into a horrrible place that he never wants to see again and ergo impling that he never wants to hear that voice again.Then after he shuts the voice well he thought he did it comes back again and he begin to see the gap again but he pushes it again and then he says that he must persuade the voice another way to leave him alone and stop pushing him and then finally he says that he should not be afaid what is gonig to come or he will not find love so then he says he has to kill him to move but maynard still assurers the voice that he will love him but its the only way it will end!\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI'm not sure if anyone has written this previously...and it's a fairly long shot. I myself, do believe the song is about abuse, about masochism even. But what about abortion? If you look at this song from the point of an unborn fetus, it also makes sence. You know, you still love your baby, even as you're tearing it the fuck out of your body and considering the last line, and followed by Cesaro Summability...\r\nAnyway, just thought I would offer an alternate suggestion.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\ninteresting that you should bring up the baby thing - i just found this site today and had same idea about song.  Its probably vague enough that it can extend to several situations whether physical or emotional BUT...   It could suggest that the woman wants to have a kid (the greatest act of love) and that the guy is afraid that sort of emotional and physical commitment will kill his identity and life as he currently enjoys it.  The trigger and faultline suggest a coitus interruptus because he's afraid of the commitment a baby will bring.  She limits him with this narrow minded coercion and he fears the commitment and thus her for doing so.  Cesaro Summability = mathematical equation of two infinite entities converging.  Two people becoming one identity.  That identity is the baby you hear crying in Cesaro Summability.  \n\r\nThats what I love about the lyrics.  Makes you think.  Therey is probably no right answer.  He probably just tries capture moments and strings them together so that they transcend literal interpretation while keeping some sort of logical flow.  I want to play this song at my wedding and see if I can make my fiance and perhaps some of the smaller children cry.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI think maynard just really hates being a masochist....perhaps. its a possibility. though it does make more sense about coitus interruptus. definetley somethign sexual, or emotional. one guy told me that he thought it was a song being sung from ther perspective of TOILET PAPER. think about it. it makes sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nits about toilet paper dude: pushit... pu shit lol\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nwell well it's all fine and good but as I have hear every body the one point was not taken into account that tool has a philosophy of being the pair of clean glasses in a shitty world.  worship a man no-one should ever do.  It's too much for a person to bare, but celebrate the art. \n\r\nAny way this whole piece could be about the different abuses on the body, from physical torment of a spouse, child, or whom ever.  The abuse of drugs like moriphine and the like.  \r\nThe first three stanzas sound just like an uncontroled responce like a habbit that you can not break.  and that can be anything, cigs, beer, drugs, hitting people, verbal abuse etc...\r\nThe next four stanzas and one line are a realization that one has a problem and can not do any thing about it.  If you have ever had an addiction then you can relate to this kind of torment.\r\nand finally the glorious conclusion to one of the greatest songs ever.  this is as simple as I can say\r\ncan you do it one last time or is it the last, and I can only say that I will always love you.  \r\nOR I COULD BE WORNG. but that is the beauty of poetry, isn't it.\r\nby the way it is PEACE OF MIND, piece of mind dosen't make any danm sence.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nSaw that gap again today , \r\nwhile you were beggin' me to stay,\r\ntake care not to make me enter,\r\nif i do we both may disappear.\n\r\nI will choke until I swallow... \r\nChoke this infant here before me. \r\nWhat is this but my reflection? \r\nWho am I to judge and strike you down? \r\nBut you're (pushing and shoving 4x) me. \r\n(You're pushing me and shoving me. 4x)\r\nYou (still love me, still love me, \r\npushit on me, pushit on me 2x). \n\r\nRest your trigger on my finger, \r\nbang my head upon the fault line. \r\nBetter take care not to make me enter. \r\n'cause if I do we both may disappear. \r\nBut (you're pushing me, shoving me. 4x)\r\nYou still love me, still love me \r\npushit on me, pushit on me.\r\n(You're pushing me and shoving me. 2x)\n\r\nSlipping back into the gap again. \r\nI'm alive when you're touching me, \r\nalive when you're shoving me down. \n\r\nBut i'd trade it all \r\nfor just a little \r\npiece of mind. \n\r\n(Pushit on me, 4x)\r\nYou're pushing, \r\nand shoving, \r\nand scrambling, \r\nkeep my feet back on the ground!\n\r\n(Put me somewhere I don't wanna be. 2x)\n\r\nSeeing someplace I don't wanna see. \n\r\nNever wanna see that place again. \n\r\nSaw that gap again today \r\nwhile you were begging me to stay. \r\nManaged to push myself away, \r\nand you, as well, my dear. \n\r\nIf, when I say I might fade like a sigh if I stay, \r\nyou minimize my movement anyway, \r\nI must persuade you another way. \n\r\npushing, shoving,\r\npushing, shoving,\r\npushing me\r\nThere's no love in fear!\n\r\nStaring down the hole again. \r\nHands are on my back again. \r\nSurvival is my only friend. \r\nTerrified of what may come. \r\nYeah. Remember I will always love you, \r\nas I claw your fucking throat away. \r\n(It will end no other way. 2x)\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nwho give a fuck what its about no1 will ever come close but what slickvic said about the multiple personalities is probly the best ive heard. btw the whole Maynard is god...me and my friends joke,,,but hes just the shit and is one of best writers ever. tool as been my fav. band since 2000 because i was shelterd and finaly got out and found tool...who on many occasions saved me from death...I LOVE TOOL!\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI once was in a relation that i eventualy saw it could never work.\n\r\nI was the only one that saw that tho, the other side could not understand it\n\r\nmy interpertation of this song is about that\n\r\n\"Saw that gap again today.\r\nWhile you were begging me to stay.\r\nTake care not to make me enter.\r\nIf I do we both may disappear.\"\n\r\n\"Saw that gap again today.\r\nWhile you were begging me to stay\r\nManaged to push myself away\r\nAnd you as well, my dear\r\nAnd you, as well\r\nPushed you away my dear\"\n\n\r\n(Aldo he sees the relationship cant work, the temptation is always there, but he knows of the danger of falling \"in to the gap again\". so he \"Managed to push myself away\" \"And you as well, my dear\")\n\n\r\n\"I will choke until I swallow\r\nChoke this infant here before me\r\nWhat are you but my reflection?\r\nWho am I to judge or strike you down?\"\n\n\r\n\"Rest your trigger on my finger,\r\nBang my head upon the fault line\r\nYou better take care not to make me enter\r\nIf I do we both may disappear\"\n\r\n(If any of you ever had a relation with someone that loves you verry much(realy a kind of strange love), and you dont feel the same(you just know it wont work) then you understant this verse.\r\nIn this kind of relation you are the dominat part of the relation, and you can make whatever you whant of the other part, but deep inside he knows his not better then her, but the temptation is there, so bewere fragil \"infant\"(which is the fragil non dominant side of the relation) you \"Rest your trigger on my finger\" BEWERE!)\n\r\n\"But you're pushing me\r\nAnd I'm shoving you\r\nAnd your pushing me\r\nAnd I'm shoving you\"\n\r\n(the relation will just not work)\n\n\r\n\"You still love me\"\n\r\n\"We're pushing and were shoving\r\nAnd you're pushing and I'm shoving\"\n\r\n\"You still love me\n\r\n\"And were pushing and were shoving\r\nAnd I'm pushing as your shoving\"\n\n\r\n(YOu love me but it will just not work)\n\n\r\n\"And I'm slipping back into the gap again\r\nI feel alive when you touch me...\r\nI feel alive when you hold me...\r\n...down\"\n\r\n(the temptation)\n\r\n\"Slipping back into you\"\n\r\n\"I am somewhere I dont wanna be, yeah\r\nPut me somewhere I dont wanna be\r\nPush me somewhere I dont wanna be\r\nSeeing someplace I don't wanna see\r\nNever wanna see that place again...\"\n\r\n\"If, when I say I may fade like a sigh if I stay,\r\nYou minimize my movement anyway,\r\nI must persuade you another way\"\n\r\n(The tempation of going back in tho the relation is always there, and even if he says it to her face \"I WILL HURT YOU IF THIS GOES ON\" it doesent work anyway, she keeps \"begging me to stay\")\n\r\n\"There's no love in fear.\"\n\r\n(FEAR OF... LONELINESS... IS NOT LOVE!!!!!!!!!!THIS IS SO TRUE!!!!!!!!THATS WHY IT CANT WORK)\n\n\r\n\"Staring down the hole again.\r\nHands are on my back again.\r\nSurvival is my only friend.\r\nTerrified of what may come.\"\n\r\n\"Remember I will always love you,\r\nAs I claw your fucking throat away.\r\nIt will end no other way.\"\n\r\n(THE TEMPTATION OF GOING BACK IN THE RELATION IS SO MUCH HE JUST CANT HELP IT, BECAUSE ALDO HE KNOWS IT WONT WORK, HE STILL LOVES HER...BUT IT WONT WORK, ITS A FEAR BASED RELATION, FEAR OF LONELINESS , IT WILL END IN SHIT)\n\r\nthanks for your time in reading, sorry for my english, i know its not the best, this is just MY interpertation, keep posting :) )\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI feel this song is about being in a relationship where both people are not letting each other in emotionally.This song also conveys a situation whre one partner may be lashing out in a sexually compulsive manner and the other partner knows this is going on but cannot get any straight answers.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nOne of Tool's best songs. One thing I know about Tool is the song never means what is seems. From what I read on the first page, knowledge6 is the closest. The sex thing is completely ridiculous. These lyrics are a little off though. The last 3 lines are actually.\n\r\n\"Remember I will Always Love you..As I claw your fucking throat away..There will be no other way..There will be no other way.\"\n\r\nTool fucking rocks !\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\np.s. Have you ever wondered if Maynard considers us (his fans) as tool's? Isn't ironic that Maynard is all about individualality with your thoughts and against being a sheep, yet we are all in a way sheep to the shepard (Maynard).\n\r\nJust a thought, id follow Maynard to the flaming gates of hell.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nGreat song. This is probably my favorite Tool song.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nNow for my personal meaning. This is just the way I personally can relate to this song. I agree that this song is most likely about an abusive relationship, however I'm taking a bit of a differnet spin on it just for the purpose of being able to personally relate to it. I don't expect anyone else to really agree with me or be able to relate to what I say, but I still wish to share it. Being able to take a song and turn it into a reflection tool is something I'd imagine Maynard would appreciate anyway. \n\r\nIn my interpretation, this is about a relationship or a friendship that is painful to one person because of the other persons' unwillingness to meet the physiological needs of the partner, kind of along the same lines of H. \n\r\n\"I will choke until I swallow...\r\nChoke this infant here before me\r\nWhat is this but my reflection?\r\nWho am I to judge and strike you down?\"\n\r\nHere, the speaker is saying he will choke until he swollows, in other words, he will be destroyed before he can grasp his treatment. He will choke this infant or treatment he receives. His reflection is his past guilts in other relationships that have failed, it is coming back to haunt him in how he is treated. The next line implys he'd be somewhat hypocritical to expect better treatment. \n\r\n\"But you're\r\nPushing and shoving me\r\nYou still love me and you pushit on me\"\n\r\nThe desire for a relationship is existant in the partner, however not taken as seriously as it should be.  \n\r\n\"Rest your trigger on my finger,\r\nbang my head upon the fault line\r\nTake care not to make me enter\r\n'cause if I do we both may disappear\"\n\r\nThe first two lines metaphorically narrate the physiological pain. He's then talks about entering, which is basically about entering and trying to change the ways of the partner for the better of the two. The last line here expresses that if the true complaints are voiced, he may be risking the relationship. \n\r\n\"But you're pushing me,\r\nShoving me\r\nPushit on me\"\n\r\nMore narration of the pain. \n\r\n\"Slipping back into the gap again\r\nI'm alive when you're touching me,\r\nAlive when you're shoving me down\"\n\r\nThe first line is telling how he is falling back into the experience again, or reflecting upon it. He feels the positive emotion (touching me) and the negative emotion (shoving me down). \n\r\n\"But i'd trade it all\r\nFor just a little bit of\r\nPiece of mind\"\n\r\nAll of this creates such an emotional roller coaster that he's just talking about having a little piece of mind. \n\r\n\"Put me somewhere I don't wanna be\r\nSeeing someplace I don't wanna see\r\nNever wanna see that place again\"\n\r\nThis all puts him in a negative place (state of mind). He dosen't want to see it, and he never wants to have to go through it again. \n\r\n\"Saw that gap again today\r\nAs you were begging me to stay\r\nManaged to push myself away,\r\nAnd you, as well\"\n\r\nThe gap, again is the actual experience. \"Begging me to stay\", I take this very diffrently, the partner of the speaker wants to leave him and go hang out with other people, however the partner does not want the speaker to follow. The speaker tells how he managed to push his desire to follow away(myself), and also momentarily rid the lonely and betrayed feelings(you).\n\r\n\"If, when I say I may fade like a sigh if I stay,\r\nYou minimize my movement anyway,\r\nI must persuade you another way\"\n\r\nThe first line talks about him fading into a chaotic depression if he \"stays\" (as in the last verse). If he trys to complain he \"minimizes his movement\"; stops it by not paying attention or not taking it into consideration. The speaker then reveals his desire to make it come through some other way. Out of sheer desperation. \n\r\n\"There's no love in fear\"\n\r\nHere; \"fear\" is not taken literally but rather as distrust or disharmony. \n\r\n\"Staring down the hole again\r\nHands upon my back again\r\nSurvival is my only friend\r\nTerrified of what may come\"\n\r\nThe first two lines express the same negative emotions that have already plagued him so many times. He talks of his need to survive and get through this. He is terrified of what may come, implying probable rejection in one way or another.\n\r\n\"Just remember I will always love you,\r\nEven as I tear your fucking throat away\r\nBut it will end no other way\"\n\r\nHe expresses in the first line that even though he has been hurt, he still gives his love to his partner. \"Even as I tear your fucking throat away\", here this is not interpreted as literally killing his partner, but rather finally just letting his partner know fully of all his contempts with him. He says this array of negativity will not end until this is done. \n\n\r\nAgain, I don't really expect anyone else except me to be able to identify with this meaning, which is alright because it's my own. Know that this was not just thought up, I spent alot of time to find metaphorical meanings to suit myself in this. And it does all make sense, so there's another valid meaning for you.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nThe one fairly constant interpretation is that this song is about a destructive relationship which you're unable to leave but know you must.\n\r\nMaynard is no god, but he's talented. I hate fanboys, grow some individuality.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI love this song...I think is about domestic violence...you know...autodestruction into a relationship, that you cannot avoid because it introduce you into a destructive circle that you don't want o you can't escape from...\"Just remember I will always love you, even as I tear your fucking throat away, but it will end no other way\"...Neither both, man or woman, can't escape from that obsesion and autodestructive relationship...\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nI think he is talking about how his mind and perception is more cleansed through practice of psychedelic drugs. The girl still loves him but she is still living in the ordinary bullshit human reality that each of us create. She still loves him but by making conversation and loving her he is being pulled back down to her level of consciousness, a place he never wants to be again.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThe music and lyrics Maynard and the band creates, is so amazing.  As you can see, everyone has a different relation to the song.  I think I heard in a interview that it doesnt matter what the lyrics are, it matters that you can feel the music.  Or something very similar to that.\r\nTo me, this song represents a boy being sexually abused by a close family member.  \n\r\n\"Take care not to make me enter\r\n'cause if I do we both may disappear\"\n\r\nThe family member cant have the boy enter him, otherwise the domination and power hold over the boy will end.\n\r\n\"There's no love in fear\r\nStaring down the hole again\r\nHands upon my back again\r\nSurvival is my only friend\r\nTerrified of what may come\r\nJust remember I will always love you,\r\nEven as I tear your fucking throat away\r\nBut it will end no other way \"\n\r\nTo me, the boys pissed off because he loves this family member, but also hates him for what he does.  The feeling the boy gets when it happens, kind of shuts off the world and waits for peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\ni always interpereted it as more of a song about domestic violence.\n\r\n\"But you're\r\nPushing and shoving me\r\nYou still love me and you pushit on me\"\n\r\nits like... the guy is trying his hardest to stay calm and not crumble under the pressures (that the \"you\" is putting on him) and ends up hurting them in some way.\n\r\nbut whoooo knowwwwsssss.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nSaw that gap again today ,\r\nwhile you were beggin' me to stay,\r\ntake care not to make me enter,\r\nif i do we both may disappear.\n\r\nI will choke until I swallow...\r\nChoke this infant here before me.\r\nWhat is this but my reflection?\r\nWho am I to judge and strike you down?\r\nBut you're (pushing and shoving 4x) me.\r\n(You're pushing me and shoving me. 4x)\r\nYou (still love me, still love me,\r\npushit on me, pushit on me 2x).\n\r\nRest your trigger on my finger,\r\nbang my head upon the fault line.\r\nBetter take care not to make me enter.\r\n'cause if I do we both may disappear.\r\nBut (you're pushing me, shoving me. 4x)\r\nYou still love me, still love me\r\npushit on me, pushit on me.\r\n(You're pushing me and shoving me. 2x)\n\r\nSlipping back into the gap again.\r\nI'm alive when you're touching me,\r\nalive when you're shoving me down.\n\r\nBut i'd trade it all\r\nfor just a little\r\npiece of miiiiiiiiiiiiiiind.\n\r\n(Pushit on me, 4x)\r\nYou're pushing,\r\nand shoving,\r\nand scrambling,\r\nkeep my feet back on the ground!\n\r\n(Put me somewhere I don't wanna beee. 2x)\n\r\nSeeing someplace I don't wanna seeee.\n\r\nNever wanna see that place agaaaaaaaaaaaaaaaain.\n\r\nSaw that gap again today\r\nwhile you were begging me to stay.\r\nManaged to push myself away,\r\nand you, as well, my dear.\n\r\nIf, when I say I might fade like a sigh if I staaaay,\r\nyou minimize my movement anywaaaay,\r\nI must persuade you another waaaaaaaaay.\n\r\npushing, shoving,\r\npushing, shoving,\r\npushing me\r\nThere's no love in feaaaaaaaar!\n\r\nStaring down the hole again.\r\nHands are on my back again.\r\nSurvival is my only friend.\r\nTerrified of what may come.\r\nYeah. Remember I will always love you,\r\nas I claw your fucking throat away.\r\n(It will end no other way. 2x)\n\r\nCorrect lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nWow...\r\nSex, abusive relationships, premature ejaculation, schizophrenia... maybe I'm completely wrong.\n\r\nI interpret this song more as an issue with religion, or the concept of a god.  The mellow interlude in this song is wonderful too, I might add.\n\n\r\n\"But you're\r\nPushing and shoving me\r\nYou still love me and you pushit on me\"\r\nTaught that God \"loves\" us and yet religion and the concept of a god is \"pushed\" onto us, pressured by society and by family morals and values to believe in something.\n\r\n\"Take care not to make me enter\r\n'cause if I do we both may disappear\"\n\r\nA discussion with the deity where Maynard may be acknowledging a problem with the concept of existence.\n\r\nTake care not to let him reach enlightenment on the same level, to become divine and break the border of divinity to join his \"god\" - because then that would negate all existence in the fact that God is not all-powerful.  Something like this\n\n\r\n\"Slipping back into the gap again\r\nI'm alive when you're touching me,\r\nAlive when you're shoving me down\"\n\r\nHe \"exists\" when he can feel the presence of the deity, he is shown his existence when God slams him down by fate or whatever is causing him strife.\n\r\n\"But i'd trade it all\r\nFor just a little bit of\r\nPiece of mind\"\n\r\nHe'd trade religion to be able to think for himself and not be confined by the laws and taboos of a religion.\n\r\n\"Saw that gap again today\r\nAs you were begging me to stay\r\nManaged to push myself away,\r\nAnd you, as well\"\n\r\nI think this means something like he saw where religion fails while he was also being forced to obey his \"religion\" but he manages to distance himself from religion and in doing so diminishes his obedience and belief in this \"god.\"\n\r\nIf, when I say I may fade like a sigh if I stay,\"\n\r\nHe thinks that he may lose himself in something that is organized for him to believe in, not something he designed through personal experiences and beliefs...\n\r\n\"You minimize my movement anyway,\"\r\n...constricting him through commandments as to what he should believe (as religion dictates)... and not think for himself, but live for that god.\n\r\n\"There's no love in fear\"\r\nTo fear God is not to love him.  It is to be afraid of a mental deity, to fear his power over all of you and, in essence, to fear for yourself.  \"God\" does not rule by love, but by fear for your soul.\n\r\n\"Survival is my only friend\r\nTerrified of what may come\"\r\nThe only thing that commands you is yourself, so Maynard knows that his own survival is what really matters.  It also sounds like he is terrified of what comes after death because he doesn't know.  Or doesn't like what he sees.\n\r\n\"...as I tear your fucking throat away\r\nBut it will end no other way\"\r\nHe has to detach from this religion and its god that demands of him in order to save himself from organized religion and its brainwashing.  To deny the idea of a god is pretty much to kill it, and perhaps its existence on this realm.\n\n\n\r\nor i'm way off.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nAnd I swear instead of \"Even as I tear your fucking throat away\" it's \"As I throw your fucking throne away\"\n\r\n...which would be once again denying a deity belief in it and therefore negate its existence, thus \"killing\" it.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\noh god this song just started making sense to me.i want to share MY point of view...and i thnk its the most correct.:P\r\nso basically this song deals with a relationship between two people.they both love each other but somehow...even as they love each other,equally,one cant seem to close to GAP between them.he doesnt want to.but the other person,the one who is giving more,is PUSHING his or her love through that particular distance,like forcing their love on the person who is trying to run away.the person who wants to run away is creating a distance...saw the ga again today...while the other person is BEGGING them to stay with them because theyre in love.\n\r\nthis songs from the point of view of the one who wants to break free and run away.he says that you know that i will receive your love when i cant resist it...choke until i swallow...because they dont need s much love in the first place..the person they love is their infant..their baby..they are twin souls and he says that i have no right to hurt you or judge you to hurt you.\r\nhes saying that youre still pushing yourself on me,your love into me.he wants the other person to hand him a weapon by which he can kill him.he is banging his head on the fault line...so that he can increase the gap.he is saying..that if you make me enter this particular gap..it wont be a unuin itll be like an explosion that kills both of them,\r\nhe saying that youre pushing me back into the gap again to close it...that hes alive when theres no distance but theres no peace of mine also and thats what he wants.hes saying that hes bin put somewhere he doesnt want to be...and he doesnt want to be in that particular state of union.\r\nhes saing taht even if i say i dont WANT to stay in this relationship...the other person wont let him go.so he must choose a more direct away of cutting loose.hes saing that he fears the other person who is giving him way too much love and he needs to break free...even if he is terrified of being alone or whatever...survival is his only aim...friend..whatever.\r\nhes saying that he will love the other person anyway but he has to end it...violently,wrongly...because it is the only way to do so effectively.tada.i hope it wasnt too dry i just spent the whole day studying sociology!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nThe thing with Tool is, even though so many interpretations match, the meanings of the songs can be narrowed down to something really simple which works with all interpretations. This song can be applied to any type of pressure, felt by religion, drugs, mental control, or the most common idea, the abusive relationship. In this idea, the abuser is the thing pressurising you that you cannot escape, and in the end, is the thing you are forced to face and defeat.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\ngood song good song\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nConsidering this album is about finding your own path, and finding yourself. I think this song is fittingly in the middle because it talks about a person not wanting to give into change. A person not willing to break away from steriotypes and dogma. Just like anything, for each action there is a reaction. This case, a person is having a hard time realizing there should be change. This will eventually lead to Third Eye, when the person realises who he/she is and finds his/her own path.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\n\"Ever have someone love you so much that they tried to kill you? \r\nOr prehaps suck you down into a hole, and you had to kill them to get away?\r\nMe neither.\"\r\n                -MJK, Woodstock 99, intro to Pushit.\n\r\nI think he writes songs that make a logical connection to him, but writes ambigously (or psychoticly) enough so that we can twist them to mean anything.\r\nThen he sits back and watches the show. Maybe our opinions give him ideas for future songs.\n\r\nMaynard is a genius, but I am not a sheep.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nok, am I the only one who thinks this song is about Masturbation?  choking the infant?  he's trying to get it to go back down and he's fighting with his cock.   \"you minimize my movement anyway\" so he's gotta take care of it... choke it!\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI know alot of you probably don't want to know this but this is based on an experience Maynard had when he was young with a member of the same gender. \n\r\nI mean I personally didn't think differently when I knew this. But that is what the song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nI think that Maynard is very good at understanding innate ideas. If you think about it, all that you experience (inside or outside of your conscious) can be traced right back to these ideas. \r\nI just thought I'd throw this out there. It should allow you to look at this song from a different perspective (that is if you understand these innate ideas).\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nLorr i love your interpretation.... The first time I heard this song I thought of the exact same thing... and yes I do believe it says throw your throne away.  Great song, very melodical......and for everyone who believes MJK is a god.......NOOOOOO.....that would be quite hypocritical of you all to think that.... He is just very talented.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nTo me this song is def. about a relationship that the narrator can't get out of, despite the fact that it is less than perfect.  Part of the reason that he is unable to escape is that he fully understands that he is not completely innocent himself (\"What is this but my reflection, who am I to judge or strike you down?\")  But I think that he is also warning that he can only be pushed so far by saying rest your trigger on my finger, Bang my head upon the faultline.  Better take care not to make me enter, if I do we both may disappear.  He's saying that if you keep on testing him, thinking he is weak and just leaving your trigger on his finger daring him to pull it, banging his head on the fault line until he finally loses it and pulls you into the void with him.  Then the line \"slipping back into the gap again, I'm alive when your touching me, alive when your shoving me down.\"  Indicates that he has been down before and the person this song is directed at was the one to help him out of the hole and now that person is no longer helpful but is actually hurting him now and he can't let go because he needs salvation now and that person was the only one to offer that salvation.  So here he is caught in a stressful place where his mind is torn between what he should do and what he wishes could be.  The only thing that makes him aware of himself (alive) is when she is touching him or shoving him down.  So now he just needs the attention from this other person whether it be positive or negative, but he'd trade it all for just a little peace of mind.  He'd give anything not to be torn that way anymore. And finally the line \"If when I see I might fade like a sigh if I stay, You minimize my movement anyway, I must persuade you another way.  Means that if he realizes that his true self is disappearing, and he stays anyway, then he must persuade the other person to change.  Which I think makes a point in itself that since he doesn't say I must leave, instead of I must change you.  It just further illustrates his dependance on the other person.  Hence he is afraid to leave.  And there is no love in fear.  This means that love and fear cannot exist simultaneoously in the same spirit.  You do not fear that which you love because if love is true love there is also trust and faith.  But in the end he can't take it anymore and is too weak to leave, the only way out is for him to murder her, but he still cares so much that he makes certain to tell her one last time that even as he kills her he LOVES HER.  Sorry this is so long and may not make since, but it's my first time and TOOL is my fav and I got a little carried away.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nI think the song is about two people being so wrong for each, the only time they are not fighting is when they are having sex. They love each other with everything they have until they are done with the sex and then it's back to hating each other, and shes back to hitting him. The one person figures out that the relationship and his life is going no where with this other person and he's trying to leave but shes using sex to keep bring him back.\n\r\nI will choke until I swallow...\r\nChoke this infant here before me.\r\nWhat is this but my reflection?\r\nWho am I to judge and strike you down?\n\r\n(Shes acting like child, and he wants to call her on it but he realizes he's acting just as bad)\n\n\r\nRest your trigger on my finger,\r\nbang my head upon the fault line.\r\nBetter take care not to make me enter.\r\n'cause if I do we both may disappear.\n\r\n(They have gone from fighting to having sex once again, and he knows onces he enters her theres no way he can walk away)\n\r\nSlipping back into the gap again.\r\nI'm alive when you're touching me,\r\nalive when you're shoving me down.\r\nBut i'd trade it all\r\nfor just a little\r\npiece of miiiiiiiiiiiiiiind.\n\r\n(He knows he loves the sex and her when they are like this, but he knows its making him crazy)\n\n\r\n(Put me somewhere I don't wanna beee. 2x)\r\nSeeing someplace I don't wanna seeee.\r\nNever wanna see that place agaaaaaaaaaaaaaaaain.\r\n(He sees that he needs to make a clean break or this will be what his life will be like forever)\n\r\nIf, when I say I might fade like a sigh if I staaaay,\r\nyou minimize my movement anywaaaay,\r\nI must persuade you another waaaaaaaaay.\r\n(He can't live his life like this, he life is moving no where. He needs another means then sex to persuade)\n\r\npushing, shoving,\r\npushing, shoving,\r\npushing me\r\nThere's no love in feaaaaaaaar!\r\n(he can't live his life in fear)\n\r\nStaring down the hole again.\r\nHands are on my back again.\r\nSurvival is my only friend.\r\nTerrified of what may come.\r\nYeah. Remember I will always love you,\r\nas I claw your fucking throat away.\r\n(It will end no other way. 2x)\r\n(he pushes her away, and decides that he will not fall back into that gap. Shes throwing herself at him and he walks away)\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nWow, it is so amazing reading everyone's interpretations, and of course there is no right or wrong answer - the music can have a particular meaning to a particular person, thus highlighting the sheer talent of the band and the fact their media is like a work of art that one person sees joy in yet the other sees fear.\n\r\nPersonally I have always seen this song as being about really coming to terms with some form of trauma that occurred as a child.  The whole album of Undertow, to me, screamed with peadophilic connotations and Aenima seems to be a slow and painful journey of actually grabbing that bullshit trauma that destroys so many lives, pulling it into the open, and finally making peace and saying goodbye forever.  \n\r\n46 & 2 and Jimmy to me coincide with this as well - it is completely about \"shedding skin\" and throwing off the shackles, but first one must look it in the eye, forgive it, then say goodbye.  I have had debilitating experiences with my father (not sexual) and it wasn't until the age of 24 that I could really gather where his actions were coming from because I myself was mimicking them in my own relationships and dealings (who is this but my reflection?).  \n\r\nThen of course it leads to \"so what was my grandfather like, and great grandfather\" and so on and so forth.  What's the fucken point of finding someone to blame and \"point the finger\" - its about acceptance, forgiveness and ultimately moving beyond.  The pheonix from the flames.\n\r\nTo me I see Lateralus as cathartic - the first three albums had quite a bit of anger to them, but Aenima, by the end, that anger does seem to have been worked through quite intently.  I see Lateralus as a reference point as to how to move on after trauma in a way that is not only beneficial to you, but to everyone.  It is like Maynard (or possibly another band member) has finally had release from a very long term repression, and wants to share with others how important it is to let go and move on, otherwise it is only yourself you hurt in the end.\n\r\nHope this makes sense (am a bit drunk and listened to Wings Part 2 way too much today).\n\r\nCheers!\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nJust my opinion, relating to my personal experience:\n\r\nI tend to think this song is about being in a relationship that is very strong(Alive when your touching me) but also being worried about being dragged into a hole with this person if they are not necessarily good for you.\n\r\nBut you dont want to let the other person leave, as to see them with someone else would devestate you and the thought of them being with someone else is just too much.\n\r\nKilling them, seems the easy answer. If they are dead you have that peace of mind.\r\nAnd, really thats all you want.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nyou're all very close but no cigar. this is a struggle between two sides of a multiple personality mind. the giveaway is right at the begginning \"what is this but my refelction/who am i to judge or strike you down?\" his personalities are talking to eachother in  a mirror (as im sure we've all done when blazed out of our minds)\n\r\nThe victim of the disease has realized their illness and wishes to free themselve from the torment of having conflicting minds. however the real problem is the victim probably doesnt know which mind is true. this causes the most conflict. it seems the victim has chosen to keep the mind they prefer but the other mind is the true mind \"i saw that gap again today (gap in reason/logic) as you were begging me to stay (the mind which is being forced out is trying to plead with the other)\"\n\r\nthis whole song seems like it can be summed up from the movie revolvver where the main character has multiple personalities and is trying to force them out. the personalities love him because they \r\nARE him and dont want to leave (i will always love you)\n\r\ni will not say for sure but may aswell claim to know that the personalities which are conflicting are those of a sexually confused boy who is struggling with the idea of homosexuallity. \"i will choke until i swallow/terrified of what may come (cum)/hands uppon my back again (doggystyle sex). its all in there.\n\r\nthe weaker mind is being pushed into a place wehere it is being ignored and and it doesnt like being there. \n\r\nit seems this song has a rather tragic ending which is hinted at throughout the song \"rest your trigger on my finger/cause if i do we both may disappear/ i may fade like a sigh if i stay/ terrified of what may come\" its fairly obvious that the victim will commit suicide because he is completly overcome with fear \"theres no love in fear\"  it is a brilliant song with amazing insight. \"but it will end no other way\"\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nI've been scanning through all the meanings, and some people have a very interesting insight about this song; it really speaks of their personal character. Anyhow, I don't think anybody (the last posting by HTL, kind of made a reference) has said anything about the reference that the line \"Terrified of what may come\", which is a line similar to what Shakespeare said, in meaning suicide. For all those hollywood-movie-loving people, there is a movie call \"What Dreams May Come\" with Robin Williams (I think) this movie is about this particular passage from and about suicide, heaven, hell, and life... it's good check it out. By the way I just came back from school to buy a few TOOL tickets, for their show in Denver... I'm such a lucky bastard!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nGOD\n\r\nthe box I am writing in say's \"What does this song mean to you?\" to me it expresses the dichotomy of mankind when attempting to understand God.  He is not talking about abuse or Love (not in my interpretation I'm not saying that is wrong) he is talking about how he does not want to and can not believe in God. Maynard is all about appreciating experiences no matter what they are good or bad.  This song is about realizing that there is no God in the Religioius sense but that we are all eternal and we all exist because we are choosing to be here. There is a God but we are he and he is us. We were created in the image of Him and we exist within him. \n\r\nOkay sounds deep and here come the flames I'm sure but just follow me on this one. \n\r\nI will choke until I swallow....\r\nWhat would you possibly choke on until you swallow? Everyone of us has experienced this, we just don't remember. It is what happens when you are born. Your first breath is a forced breathe that escapes only because they slap you on the back and otherwise you would choke. Such is the experience of accepting a new view of God. It is hard to swallow and it is hard to understand a different concept of what we are and why we are here....until you are able to swallow it. Lateralus gave us a great view of what Maynard believes and what I am saying is nothing new to a true tool fan. We are eternal all this pain is an illusion. This song is about his fight to push away the illusions and accept the reality of existence. \n\r\n\"There's no Love in Fear\"... Religion teaches that god should be feared, it teaches us that if we do not obey God we will be punished by being sent to Hell but God is supposed to be the embodiment of LOVE he is all the love in the world. The source that we exist in and the source of all that is, was and ever will be. \n\r\nOnce you stop thinking about God as a person and instead of a source of energy and knowledge you will realize what level Maynard writes his songs on. \n\r\nWe are choosing to be here, right now, hold on, stay inside, this body, this body holding me, feeling eternal all this pain is an illusion.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nWhat the fuck are we to rate whatever song? Do we know just what Maynard meant in the song? If the puzzle does not fit perfectly, than your interpretation is incorrect. But when you try to find some meaning in the song for you, then you can write whatever you want. Imagine Maynard reading this crap we write...\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\ntool are coming to new zealand! it sucks living at the bottom of the world so i was so excited when they announed theyre coming!!!! GOD i hope they play this song. one of may favourites\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nWhile the 3rd grade spelling and grammar level of certain of this forum's posters is unsurprising in the modern gangsta rap, South Park, 30-second-MTV-attention-span era, it is simply EGREGIOUS (look it up) that typos like \"piece of mind\" continue to pervade this and all other TOOL lyrics boards, degrading the meaning of this awe-inspiring and majestic song...\n\r\nTherefore, \n\r\nToward a fuller and more accurate treatment of Pushit, I offer the following... the most complete and precise transcription of the lyrics found on the entirety of the motherfucking World Wide Web.\n\r\nEnjoy and listen closely, bitches.\r\n_______________________________________________________\n\r\nSaw the gap again today\r\nWhile you were begginâ\u0080\u0099 me to stay.\r\nTake care not to make me enter.\r\nIf I do we both may disappear.\n\r\nKnow that I will choke until I swallow.\r\nChoke this infant here before me.\r\nWhat is this but my reflection?\r\nWho am I to judge or strike you down?\n\r\nBut you're\r\nPushinâ\u0080\u0099, shovinâ\u0080\u0099 me (x 4)\r\nPushinâ\u0080\u0099 and shovinâ\u0080\u0099 me (x3)\r\nPushinâ\u0080\u0099 me, shovinâ\u0080\u0099 me.\r\nYou still love me, still love me, shootinâ\u0080\u0099 me, Pushit on me.\r\nstill love me, still love me, shootinâ\u0080\u0099 me, Pushit on me.\n\r\nRest your trigger on my finger.\r\nBang my head upon the fault line.\r\nYou better take care not to make me enter.\r\n'cause if I do we both may disappear.\n\r\nBut you're\r\nPushinâ\u0080\u0099, shovinâ\u0080\u0099 me (x 2)\r\nPushinâ\u0080\u0099 and shovinâ\u0080\u0099 me.\r\nPushinâ\u0080\u0099 me, shovinâ\u0080\u0099 me.\r\nYou still love me, still love me, shootinâ\u0080\u0099 me, Pushit on me.\r\nYouâ\u0080\u0099re pushinâ\u0080\u0099 and shovinâ\u0080\u0099 me.\r\nPushinâ\u0080\u0099 and shovinâ\u0080\u0099 me.\n\r\nIâ\u0080\u0099m slippinâ\u0080\u0099 back into the gap again.\r\nI'm alive when you're touchinâ\u0080\u0099 me.\r\nAlive when you're shovinâ\u0080\u0099 me downâ\u0080¦ heyee.\n\r\nBut I'd trade it all\r\nFor just a little \r\nPeace of mind.\n\r\nPushit on me (x 4)\r\nYouâ\u0080\u0099re pushinâ\u0080\u0099\r\nâ\u0080\u0098n Shovinâ\u0080\u0099\r\nScramblinâ\u0080\u0099\r\nKeep my feet flat on the ground.\n\r\nI am somewhere I donâ\u0080\u0099t wanna be, yeah.\r\nPush me somewhere I don't wanna be.\r\nPut me somewhere I donâ\u0080\u0099t wanna be.\r\nSeeing some place I don't wanna see.\r\nNever wanna see that place again.\n\r\nSaw the gap again today\r\nWhile you were begginâ\u0080\u0099 me to stay.\r\nManaged to push myself away\r\nAnd you as well, my dear.\n\r\nAnd if, when I say I may fade like a sigh if I stay\r\nYou minimize my movement anyway.\r\nOh, I must persuade you another way.\n\r\nPushinâ\u0080\u0099 shovinâ\u0080\u0099\r\nPushinâ\u0080\u0099 shovinâ\u0080\u0099 \r\nPushinâ\u0080\u0099 me.\n\r\nThere's no love in fear.\n\r\nYeah, Iâ\u0080\u0099m starinâ\u0080\u0099 down the hole again.\r\nHands are on my back again.\r\nSurvival is my only friend.\r\nTerrified of what may come, yeah.\n\r\nRemember I will always love you\r\nAs I claw your fuckinâ\u0080\u0099 throat away.\r\nIt will end no other way (x 2)\n\r\nOUT.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nUNGH!\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nWell, fuck.\n\r\nI'm as intolerant of my own bullshit typos as I am of anyone else's I guess...\n\r\nCouple of minor changes, additions to achieve a full manifestation of completeness.\r\n________________________________________________________\n\r\nSaw the gap again today\r\nWhile you were begginâ\u0080\u0099 me to stay.\r\nTake care not to make me enter.\r\nIf I do we both may disappear.\n\r\nKnow that I will choke until I swallow.\r\nChoke this infant here before me.\r\nWhat is this but my reflection?\r\nWho am I to judge or strike you down?\n\r\nBut you're\r\nPushinâ\u0080\u0099, shovinâ\u0080\u0099 me (x 4)\r\nPushinâ\u0080\u0099 and shovinâ\u0080\u0099 me (x3)\r\nPushinâ\u0080\u0099 me, shovinâ\u0080\u0099 me.\r\nYou still love me, still love me, shouldn't be pushin' on me.\r\nstill love me, still love me, shouldn't be pushin' on me.\n\r\nRest your trigger on my finger.\r\nBang my head upon the fault line.\r\nYou better take care not to make me enter\r\n'cause if I do we both may disappear.\n\r\nBut you're\r\nPushinâ\u0080\u0099, shovinâ\u0080\u0099 me (x 2)\r\nPushinâ\u0080\u0099 and shovinâ\u0080\u0099 me.\r\nPushinâ\u0080\u0099 me, shovinâ\u0080\u0099 me.\r\nYou still love me, still love me, shouldn't be pushin' on me.\r\nYouâ\u0080\u0099re pushinâ\u0080\u0099 and shovinâ\u0080\u0099 me.\r\nPushinâ\u0080\u0099 and shovinâ\u0080\u0099 me.\n\r\nIâ\u0080\u0099m slippinâ\u0080\u0099 back into the gap again.\r\nI'm alive when you're touchinâ\u0080\u0099 me.\r\nAlive when you're shovinâ\u0080\u0099 me downâ\u0080¦ heyee.\n\r\nBut I'd trade it all\r\nfor just a little\r\npeace of mind.\n\r\nPushit on me (x 4)\r\nYouâ\u0080\u0099re pushinâ\u0080\u0099\r\nâ\u0080\u0098n shovinâ\u0080\u0099\r\nscramblinâ\u0080\u0099\r\nKeep my feet flat on the ground.\n\r\nI am somewhere I donâ\u0080\u0099t wanna be, yeah.\r\nPush me somewhere I don't wanna be.\r\nPut me somewhere I donâ\u0080\u0099t wanna be.\r\nSeeing some place I don't wanna see.\r\nNever wanna see that place again.\n\r\nSaw the gap again today\r\nWhile you were begginâ\u0080\u0099 me to stay.\r\nManaged to push myself away\r\nand you as well, my dear.\n\r\nAnd if, when I say I might fade like a sigh if I stay\r\nYou minimize my movement anyway.\r\nOh, I must persuade you another way.\n\r\nPushinâ\u0080\u0099 shovinâ\u0080\u0099\r\nPushinâ\u0080\u0099 shovinâ\u0080\u0099\r\nPushinâ\u0080\u0099 me.\n\r\nThere's no love in fear.\n\r\nYeah, Iâ\u0080\u0099m starinâ\u0080\u0099 down the hole again.\r\nHands are on my back again.\r\nSurvival is my only friend.\r\nTerrified of what may come, yeah.\n\r\nRemember I will always love you\r\nas I claw your fuckinâ\u0080\u0099 throat away.\r\nIt will end no other way (x 2)\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nSubmit corrections in the report forum.\r\nHere:\nsongmeanings.net/…\n\r\nThat way, they'll actually get fixed.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nIts about being raped\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nthis song to me is about drugs. anyone else see that?\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nFirstly, I'd like to say that tomman basically hit this right on the money.\n\r\nPushit is perhaps Tool's best song, period. It's very meaningful and emotional; I get chills down my spin each and every time I listen to it. Maynard is easialy the most brilliant poet I've had the pleasure of listening to vocalize.\n\r\nThe thing about Tool is that Maynard allows the listener to form their own opinion of what the song means... It means anything you want it to mean. Surely Maynard himself knows what each and every song really means, but again, he leaves this open to his listeners. \n\r\nI just got out of a relationship in which I can basically directly relate to this song... All you have to do is have the mindset of a bad relationship while listening, and I believe you will come to an agreement with me on this song.\n\r\nThis song is brilliant for many, many reasons, and this song is about an emotionally abusive relationship. I do not think that by any stretch that this song is about sex either.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nBy far my favourite Tool song.\r\n- Not a very useful comment I know but you lot have pretty much nailed what I interpreted it to be =)\n\r\nOh, and what's with the abuse on the first page? \r\nIt's just childish kids, grow up wont you?\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nhas anyone seen the video on you tube of Maynard wrestling a fan during this song in a concert?  It's pretty funny!\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nyeah i saw it...it was funny...\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nThes best song on aenima is Third Eye, but my personal favourite is Pushit. I've read some great interpretations, like it's about God or relationships. The one sentence that pops out for me is: \"There's no love in fear\". The two are actually opposites, like black and white. As a reference watch the movie Donnie Darko. And just like black and white, there are many grey zones between them. It's the same with love and fear, they are the deepest human emotions, but they're just the opposite ends of the whole spectrum of human emotions. I can also relate a lot of the song in a relationship with a girl a had a year earlier. She was my first girlfriend, a very nice girl who loved me so much that I was the one for her. First problem: I didn't feel the same. I did love her and we were happy for a while, but she loved me more than I loved her. And there comes a moment where fear takes over, you're not sure she's the one for you, you don't feel comfortable in this relationship anymore. She's still loves me so much, but it's killing me inside and it pushes me away from her. I couldn't handle the situation anymore, because it was tearing me apart, and I knew I would feel more secure and comfortable if I broke up with her. I didn't want to hurt her feelings, but I had no other choice. Even though I broke her heart, I felt relieved, it was a burden coming off my shoulders. \n\r\nThat's not how I interpret this song, it's how I FEEL it. Though I've read other interesting interpretations, like someone who said it involves your faith in God, not that he is a person, but a natural force, and nature is not just around us, it's also inside of us. The fact that we are here, and can think for ourselves and help others, is a gift. God creates, but humans create too. We create art, we create our own life like we want it. \r\nI know it looks like most people don't know what life is really about, and there are a lot bad things happening in the world, but guess what. We have the ability to change, we can live together as one. Maybe the biggest flaw in humans is ignorance, it's a bless and a curse. But ignorance can be stopped by delivering the right information to people. If they decide to ignore it then they are not ignorant anymore but dumb. If you act upon it, you're learning and then you become wiser. \r\nI don't know what's going to happen in the future, but I believe that the world is going to change, because more and more people are searching for spirituality and balance, and I think that's where our salvation is. Just believe in the greater good and in yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nthe lyrics that this website has matches tool's official website lyrics.  I know they do not match up to the song because they are missing a few words, but they are basically correct. But the lyrics on toolband is the song that maynard actually wrote, when things are song they are done differently\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nThe live version is awesome beyond belief\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nI've placed myself in this song several times. and for me, when I am this character, I am talking to that voice in my head that leads me to depression.\n\r\nwhen I get really upset, espcially when I am alone, that voice turns on and confirms all the bad things that anyone has ever said to me. It whispers to me, you're really not a good mother, you're a failure, you can'tinish anything.... might as well give up now.......better to quit than fail.\"\n\r\nI find great power in this song, to be able to turn against that voice, to destroy its power over me..... but it is only a temporary solution, I can never really kill the voice as it is a part of me.... so I always end up \"staring down the hole again\"\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nthis song is most likely about abuse yes. i mean a lot of his songs are about child abuse b/c he was abused \r\nBUT i think it can be interpeted deeper \r\ni think it has to do with a relationship with god\\\r\nNOTE: alot of us who were raised in christ have some turning point were we turn away and dont want to turn back, but God always loves us even thoe he pushes us. i dont know how this fits in with the end but i think that it may have been how the song started\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nthis song is most likely about abuse yes. i mean a lot of his songs are about child abuse b/c he was abused \r\nBUT i think it can be interpeted deeper \r\ni think it has to do with a relationship with god\\\r\nNOTE: alot of us who were raised in christ have some turning point were we turn away and dont want to turn back, but God always loves us even thoe he pushes us. i dont know how this fits in with the end but i think that it may have been how the song started\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nit has to do with an emotionally abusive relationship in which one person was abusive but wanted the other to stay. the person stayed but kept having second opinions and kept wanting to pull out but couldnt\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\ndude, someone please change the lyrics. its \"for just a little bit of, PEACE of mind.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\ni believe this song relates back to maynard's abuse as a child and how it is still affecting him and he believes that he is scared about becoming what his stepfather was. he loves this person that he refers to in the song but feels that they push him and shove him which he thinks will make the anger and abuse come out of him. this is shown in lines \"take care not to make me enter\" which means enter the state that he will hurt them, \"Put me somewhere I don't wanna be, Seeing someplace I don't wanna see, Never wanna see that place again\" which is reminding him of his childhood, and there are many other references that show that he is scared that he may become another person, an abusive person.\r\nthis topic of becoming like his stepfather is used in the song \"H.\" as well i think\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nI'm pretty sure it's \"Remember I'll always love you, as I claw your fucking throat away.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nThe bass pushes the song through beautifully and i love the part where maynard screams 'There is no love in faith'\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nThis song is about the type of relationship that you get sick of. He's with someone whos completely in love with him and he's not in love with her. 'theres no love in fear' fear meaning the fear that she has. That he is going to end it. She can't really love him if shes scared, can she? She's pushing him to be with her and he's shoving her away. And sometimes people can be pushed and forced into things, 'slipping back into the gap again' the gap is the empty void between the two. But he hates the fact that that he feels 'alive when you're touching me, alive when you're shoving me down'. Basically he's trapped in a position where he subconciously wants to be.\n\r\nWell thats my opinion. Time to read others.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\ni love two different meanings...and as maynard has songs such as 'maynards dick', 'prison sex' i can hardly tell th difference! the first one is th premature ejaculation theory...haha...quality...and also th religios approach saying how we are made to fear god, when god is supposed to be a loving god! etc...but as you all will kno if u've been on th toolshed website..maynard has more than one meaning for some of his sentances...eg 'release inside of me...and release in sodomy'...i believe he carefully thought about it all...and you can relate it however you want to...he knows it all...he's a clever mofo\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\ni like what the phil had to say, but my original interpitation was much diferent then most of the posts.\r\nMy meaning was that it was about parents forcing change on children. The change gives them more and more limitations and the child blames it on the parents, eventually killing them.\n\r\nThat was just my first thought on the lyrics. great song\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI believe Maynard used the relationship angle to make this song more understandable to a wider audience.  But I view these lyrics as more of an >>>opinionated person vs. yourself\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI believe Maynard used the relationship angle to make this song more understandable to a wider audience. But I view these lyrics as more of an [opinionated person vs. yourself], as in the opinionated person is shoving and pushing their beliefs and morals upon you, while you try to maintain individuality.  A set of lyrics which explains this best.\n\r\n\"Rest your trigger on my finger,\r\nbang my head upon the fault line\r\nTake care not to make me enter\r\ncause if I do we both may disappear\"\n\r\n\"Rest your trigger on my finger\" which is the opinionated person starting the conflict and not yourself. Whereas the \"fault line\" is the difference between the yourself and them, thus they're banging your head upon it trying to change you. Finally \"take care not to make me enter\" and \"cause if I do we both may disappear\" go hand-in-hand because letting yourself be swayed by the opinionated person would result in no differentiation between the two of you.\n\r\nPS - These lyrics definitely could be about sex as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nNo, josh is right. Don't think of Maynard as a god. He is simply just a human who can see things so much more deeply then most while still being able to portray it fantastically in lyric. Now, given the theme of the Aenima album (mostly about thinking for yourself and the advancement of human kind) do you REALLY think that Maynard himself would appreciate you thinking that he's a god? He wants us to think for ourselves. Think of Maynard as a portal to the abstract.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nplease. for being tool fans, we have to understand that their songs go deeper than and are more profound than being about having sex. all other interpretations are legitimate. but if it doesnt mean anything more than sex to you, please reasses yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nI think this song is about drug induced paranoia more than anything.  Maynard likes to trip acid, this we all know.  The insanity depicted in this song makes me think it's a trip gone bad.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nActually, I was too hasty to post my interp.  I really agree with Staticfactory after reading that.  Makes a whole helluva lot of sense, moreso than drug paranoia does.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nI'm going to keep this really simple.  True (real) love is a death sentence.  No matter what it ends badly for someone.  I think the girl is pushing him to fall in love.  Not so much forcing him but he's falling and he doesn't want to fall in love but the way she makes him feel makes him fall.  When he tells her to put the trigger on his finger I think it's saying you're falling too and i'm the one responsible.  If you think about it you're never the one that falls in love with the other person.  It's the other person that makes you fall in love with them.  Right?\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nwhy do we need to try and understand what the song means? it obviously triggers different emotions for different people. like Jackson Pollock said. we don't look at a bed of roses and tear our hear out over what it means. people need to stop doing this with art and just enjoy the music\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nI agree with janeitals.  A friend of mine told me to listen to this song and I just had a completely different perspective then they did.  It was weird.  I think it's interesting for venting or coffee talk though.  The song also reminds me of this one movie with socrates as a character.  The main character wants to throw a part of himself off  a building but in the end he comes to terms with it and feels better and gets over that side instead of killing it.  I think it's interesting to see what people say about lyrics.  That's my personal opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nthis song is an emotional journey. not neglecting the cynicism that TOOL often promotes, i think this song is a serious demonstration of one person pushing emotional oppression onto one they love. the 'peace of mind' part of the song allows for some true lucid thoughts in assessing the situation. something has to change. remember I'll always love you but I need to tear your fucking throat away.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nOnce upon a time maynard discussed in an interview after the stress of all the touring and whatnot that he started to forget who he was, had to keep checking his ID to remember, things of that nature.\n\r\nThat is the jest of what I believe this song is about. A man, struggling with two personalities, to a point. Either maybe it's the good and bad in him, or maybe the way he acts in front of some people (say, on stage and in life), and then others, and one is pulling (or, pushing in this case) on the other, and he doesn't want to turn into that person.\n\r\nThe \"gap\" is where he isn't either one, where he has no personality, and he could go either way. He feels that he is nothing usually, but when he gets this struggling \"gap\" going on it gives him what he feels is real feeling, a real personality based on just what his other personality is trying to do to him, causing havoc in his mind. \n\r\nHe talks about trading anything for peace of mind, how he abuses himself over and over again, and he just wants to get through it (\"Hands on my back again, survival is my only friend\")\n\r\nIn the end of the song, he talks of just ending it. Speaking to the other half of him, he decides to end it Fight Club style, you have to take yourself out, to get rid of the other. There is no other way, after all.\n\r\nBut then again, music is art, and art is interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\ni think this song is about abortion and how he doesn't want to have the baby in his life but the girl does...just my opinion...its probably wrong\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nEVERlast5150, That is EXACTLY how i interpret the song. \n\r\nKarkeltron said this about the song, Which I believe to strengthen the argument that this song is about a child out of wedlock and the differences in opinion that can result.\"\"Rest your trigger on my finger\" which is the opinionated person starting the conflict and not yourself. Whereas the \"fault line\" is the difference between the yourself and them, thus they're banging your head upon it trying to change you. Finally \"take care not to make me enter\" and \"cause if I do we both may disappear\" go hand-in-hand because letting yourself be swayed by the opinionated person would result in no differentiation between the two of you.\" \n\r\nThe line, \"what is this? but my reflection\" means the child he helped create is going to be a \"reflection\" of him, but asking \"what is this?\" makes it seem like he does not love the child but he sees it as more of a mistake that he feels should be handled by abortion.\n\r\nNext line, \"Who am i to judge or strike you down?\" He is saying how can i tell you to abort your child, it may be against her family's religious views or she might be ready to be mother. Its ultimately her choice.  \n\r\nIn the intro he foreshadows the situation by saying \"Saw that gap again today, while you were beggin' me to stay\" The gap meaning the distance he will make with the child and mother should she decide to keep it, and  while hes thinking about taking action she wants him to stay in the picture as the father.\n\r\nI dont have time to go through lyric by lyric but i feel that the whole song is about his struggle to deal with the idea of having a baby too soon in his life going back and forth with his decision to stay or leave. ending with his decision to kill both the mother and not yet born child, saying it will end no other way...\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nBTW I heard this song for the first time today in almost 4 years and I could not help but well up during the climax of the song, So much emotion ran though me i don't know how Maynard can perform these songs and not become emotional on stage.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nI really think this song is refering to shooting heroin. \"Rest your trigger on my finger\" refers to the plunger on the needle. \"Bang my head upon the faultline\" refers to being on the verge of overdose. And just the song title itself Pushit....like pushing the plunger to inject the drug. also \"you minimize my movement anyway\" reference to being drugged and drowsy.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nJust too many people thinks that a song is always about sexuality ( ejaculation sex etc) whenever they don't understand the meaning of the song only bec. it is so powerful and too deep for their shallow understanding.\n\r\nAnyway, it's their opinion, but please be careful to speak out our thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nI don't mean to attack, but noone should be careful about their opinions on a song meaning.  that's kinda stupid.  say whatever you want.  \n\r\nOk, I think that the song is about love and sex.  I think that there are two people in a relationship that's frighteningly intense.  they are very sexual and love each other but at the same time the guy ( maynard? )  is scared of this relationship because if you're like me, love, true love, is scary as hell.  you can't take it and you feel bad by the physical act of love.  now I also think there is an underlying topic in the song.  the \" i will choke until i swallow, choke this infant here before me\" part.  the first part is clearly fear.  the second part may be a stretch on my part but i always interpret this as a lyric pointing towards a pregnancy and him wanting an abortion based on his indecision.  now what could be worse or more intense?  intense love, fear, commitment, second thoughts, a child, and knowing that if you stay you'll go numb ( \"disappear\") and if you go you'll regret.  there is no piece of mind.  and i think we'd all feel like trading it for a little piece of that.  Maynard is not a god.  he is extremely talented lyrically and sings amazingly for a band that compliments him perfectly.  and i'll be perfectly ok with being wrong.  then again, that doesnt matter, does it?  i'll never change my mind.  to tell the truth, if maynard himself told me the meaning and it was completely different than how i interpret the song, i probably would'nt like it as much.  i've already applied it to my life if you could'nt already tell and that's how i like it.  it has meaning to me as much as it probably does to maynard himself.  different maybe, but equal all the same\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nbasically, what fortysix and two said.  wow.  i wasnt completely focused when i wrote but they were.  so yeah.  we're pretty much awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\ni agree with joshthank\r\nmaynard is NOT God, he is human!\r\nalthough he is the most talented and most beautiful voice in the WORLD!!!! i dont think he should be worshiped either because your worshipping one of your kind.but yeah... all his songs are brilliant! amazing! outstanding!!! i love this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nTool teaches us to look at the details, not to scratch the surface and be satisfied.\n\r\nIt seem to me (without cruel intention) many try to make an interpretation based on a glimpse or quote from Maynard or anyone in the band. The fact of the matter is, that's not enough.\n\r\nYou can't tell a story with one sentence. You need to pay close attention, and put the puzzle together.\n\r\nWords portray a meaning which can be expressed, and sound portrays that which words cannot.\r\nYou need both to put together the puzzle.\n\r\nSo sit back, clear your mind, listen to the song, and just feel...\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nI'd like to say that I agree with joshthack. What many people fail to realize is that to say and declare maynard as being a god is a paradox of sorts. The members of Tool are all extremely modest people, and they are just that: people. While they are all equally brilliant and amazing in their own right, they are not on the same level as that of a god.\n\r\nI will say that they are teachers, and through their art and their music strive to teach and encourage us to see more clearly, to open our third eye, think, breathe, live etc.\n\r\nFor those of you who still choose to place maynard on the plane of godliness, I would like to remind you that it is maynard who has repeatedly (through his poetry and songwriting) encouraged people to terminate the ego, arrogance, and other negative human actions, over thinking over analyzing -- cutting everything in two.\n\r\nWe are all one mind. it means that your negative and positive thoughts and actions have more consequences than you may initially have thought... it takes only a little positive energy to make a great change. I don't know what I'm trying to say anymore.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nCAN NO1 SEE THAT THIS SONG IS ABOUT ABORTION?!?\n\r\nits bout a guy who had a bad experiance with a miscarried child (one who died b4 being born) now he doesnt want to have sex cuz he's scared it will happen again\r\n(he's one of those emotional paranoid types)\n\r\nTake care not to make me enter\r\nIf i do we both may disappear\"\r\n-pain will come to both of them if it happens again\n\r\nI will choke until I swallow...\r\nChoke this infant here before me.\r\nWhat is this but my reflection?\r\nWho am I to judge and strike you down?\"\r\n-choking an infant... cutting the ambillical cord\r\nreflection=offspring\r\nhe cant judge... the child's not born yet\n\r\nIf, when I say I may fade like a sigh if I stay,\r\nYou minimize my movement anyway,\r\nI must persuade you another way\"\r\n-his partner wants to have sex anywhays\r\n(shes not a sourpuss like him)\r\nso... she ties him down\n\r\n*this may be wrong... that i admit\r\nbut i have sum legit points\n\r\n)))tool rocks@!!!!!@(((\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nHi I think is about transformation of individualily by Nietzsche. In the great work \"Thus Spoke Zarathustra\" Where first You are a Camel (a slave that must always say YES, under constant fear of your gods \"There's no love in fear.\"), then you became a Lion (always says NO and can't say YES) and in the end a innocent child (superhuman says YES because it wants to say it). To reach level of lion you have to defeat the camel \"Even as I tear your fucking throat away\" then to became a child you have to defeat camel and lion \"cause if I do we both may disappear\"\r\nand if so \"I will choke until I swallow...\r\nChoke this infant here before me.\"  \r\nThat's my interpretation. I recomend the poem by the way.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nGuys! This song is obviously about anal sex. Both from Maynards perspective and from his lover's.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nhe his saying that love is keeping him in a relationship but it is abusive (verbally or physically?) he cant leave her because of fear of being without her or her being with someone else, her death is the only way it will end\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nThe song is obviously about direct spiritual warfare with satan\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\n\n\r\nmy fave interpretation is the one from the buddhist-lit advocate, about the higher self vs ego.\r\nthough i could also understand and accept the abusive-relationship interpretation. \r\ni like to string various meanings together, and then find the common theme, the core issue. Paraphrasing ur contributions into the most minimalistic sense, this song illustrates to many of u, the urgent need, the desperate difficult attempt to break away or give up limiting, destructive habits/addictions/gods...\r\nthe driving force behind this pain that eventually liberates, is the higher self... which, during my first listen to Pushit, Salival version, i actually thought to be the song's narrator. That was my only 'close' listen though so I'm not done finding my own original meaning yet. Their songs don't hit you completely at one listen. And I didn't have the chance nor time to do a, um, song meditation session, hehe. Or musical swimming lesson...\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nStanding in the line of fire between Team Maynard-a-God and Team Maynard-Not-a-God... I can reconcile you two parties... No need to fight, as I find myself agreeing with both views. It's all about semantics, semiotics.\n\r\nbefore we negate another person's statements we ought to ask ourselves, 'is his definition of god same as mine?' ... \n\r\nfirst off, there exist at least THREE different IDEAS represented by the word GOD, but for the sake of this argument, i will name only TWO -\n\r\n1. The Herd's God, a.k.a. the Sheep's God\r\n2. The Objectivist's, Thinkers', Satanist's Idea of God.\n\r\nThe Sheep's God is supposedly the supernatural head of all monotheistic religions. An alternative is, okay, the God may not care about herds, but God IS, OUT THERE, 'all powerful, untamable, He put the stars in the sky and He knows em by naaame,' as a Christian song proclaims...\n\r\nwell, I agree with the Maynard-is-NOT-god people, in this respect, because obviously, Maynard is neither supernatural, nor sadistically manipulating groups of people to lose their brains, nor does he float around knowing ur heart of hearts and secret thoughts. Yes he is human.\n\r\nand now we move on to the Cool People's God - Cool People?! - i'm so biased, i belong here, hehehe... Ok. Atheistic point of view, but mind you, Objectivists and Satanists aren't ur ordinary atheists who are actually just another type of sheep. Satanists and Objectivists hold that the power to direct and influence lives lies in the Individual himself, not in any external made-up entity. If the definition of god is the force that makes things happen, then.. Every human being is a god. We just have different levels of competence and benevolence.\n\r\nso hell yeah. Maynard is a god! So are we!\n\r\nand then of course there's POETRY.\r\nthe poets are laughing at the protesting sheep.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nto me this song its about a stuggle between lovers, both heavly vested in eachother emotionaly. \n\r\ntheres a love hate relationship but not so black and white. \r\ntheres this of a see-saw of control both sides pushing eachother \r\nto the brink of violence and self destruction by eachothers actions.\n\r\nthe singer or artist whoever feels like he's the one being munipulated or froced to a place \r\nin this relationship he doesn't feel comfortable and in order to protect his sanity \r\nor comfort zone he must regress and become something he hates and doesn't want to be by \r\n\"slipping back into the gap agian\".\n\r\nhe feels he's in the wrong acting this way in order to protect himself questioning himself\r\n\"who am i to judge or strike you down\" \n\r\nbut he must fall back into this place even though that very part of him is just as detramenal to his being as the abuse he's withsanding from this other being.\n\r\nall the while he loves this other being and feels alive being opressed by his counterpart yet expresses that they should not be together or they \"both may dissappear\"\n\r\nanother way i sometimes interpit this is an inner struggle whithin himself or a person he had great influance on like a child when saying \"what is this but my reflection\"\n\r\nalso these feelings he is having may all be self self induced \"i will choke until i swallow\"\r\na glutin for punishment?  \n\r\ni could probably go on a while longer this song plays on a lot of different feelings in me.\n\r\na favorite of mine for many years, very deep and powerful song.\n\n\n", "comment_153": "\nyoutube.com/…\n\r\nAt 5:06 after \"I am somewhere I don't wanna be\" you can hear really really quietly \"without you\" after it\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\ni really cannot believe after 18 fucking years went by,i never heard this song until now,13 years after this album has been out.i just heard this song for the first time a few days ago,and it really just opened tool up for me.the tool songs that are played on the radio are seriously just the tip of their iceburg,you really have to listen to their songs like this to realise how amazing they truly are.\r\nas a general overview of this song,it just seems to be a really dreary song,that just out of nowhere gets really soft,then has the most awesome break down i've ever heard in my life;have any of you guys realised that? how amazing this song sounds when it gets faster? holy hell...astounding it is i tell ya.\r\nbut as for the true meaning of this song? i have to agree with movedbytool.she set the best example of what this song means IMO.this is one of the best songs i have ever heard in my life,and will always be one of my favs when it comes to tool\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\n\"If, when I say I may fade like a sigh if I stay,\r\nYou minimize my movement anyway,\r\nI must persuade you another way.\n\r\nThere's no love in fear.\"\n\r\nSounds pretty self explanatory to me. I love that section that begins at about 6:27, especially during those 4 bars where Adam is tremolo picking. Awesome section.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\n12 bars, my bad\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nIve been quite enamored with this song for a long time-its got such passionate delivery with a varied amount of tension and emotional range...so i finally decided to sit down and try to get a more vivid interpretation from it: Try this on for size\n\r\nTheres this distance between usâ\u0080¦you really want to be with me\r\nBut I want to keep my distance because I want to retain my sense of self\r\nIm feel like suffocating this young, precious emotion we have between us\r\nIn its infancy\r\nBefore I can finally take this in, and accept that wholeness.\r\nIs this my natureâ\u0080¦Is this sense of self that im perceiving?\r\nIm at a point of conflictionâ\u0080¦Maybe I just need time\n\r\nBut youre pushing yourself on me\r\nYour love is thrusting itself on me\r\nWith a weight I may not have the heart to accept yet \n\r\nYoure resting more love, and in turn, fault and guilt on me for feeling this way\r\nRacking more pressureâ\u0080¦There is a connection.. but your not giving it time\r\nAnd I feel this tension and expectation and its getting more heated\r\nI am not ready to feel this close to you\r\nIf you force this, as much as I feel I care for you, it will end\r\nAnd yet you still push and force this love on me so quickly\r\nBeyond its capacityâ\u0080¦beyond my current ability to receive\r\nAnd accept it and return it openly\n\r\nIm feeling myself pull back again from you\r\nThings are too unstable\r\nToo mixed up for me to firmly be able to plant my feet\r\nOne minute things are passionate and the next theyre painful \n\r\nSomething happensâ\u0080¦a fightâ\u0080¦\r\nA situationâ\u0080¦a side of myselfâ\u0080¦or you\r\nPerhaps something that reminded me \r\nOf a time before that I was hurt\r\nThat ive been trying to distance myself from\r\nAnd it feels like its repeated itself\n\r\nIm leaving and youre begging me to stay\r\nWe have this love but its totally imperfect\r\nUnbalanced, passionate, but destructive for both of us\r\nIm being smothered and your still reaching out to cling\r\nTrying to get more out of me...\r\nâ\u0080¦its grown into this persistent tainted ugly thing between us\r\nBorn from both of our misgivings\n\r\nI felt drawn in by you to stay and make it work\r\nEven though it has been eating me up inside\r\nBut Ive worked up the courage to finally leave\r\nAnother huge fight... bitter angry violent and abrupt and I didnâ\u0080\u0099t mean what I said\r\nit hurt both of us\n\r\nBut if I tried to tell you what ive been really feeling\r\nAnd I tell you this love will kill me\r\nYoull just try and convince me to stay \r\nAnd try to make it work\r\nThere is really no choice but to just let things go violently, angrily\r\nWithout regret\r\nPersuade you to hate me now so we can both move on\r\nRather than try and rope me into this relationship\n\r\nLove shouldnâ\u0080\u0099t feel this way.\r\nIm afraid of being close to you\r\nIve got my own past I must overcome\r\nAnd youre afraid of being without me\r\nYoure maybe insecure and not truly ready to be loved\r\nTheres no love in fear\r\nAnd so im ending this\r\nIts scary to lose you like this and its strange being alone again\r\nJust remember as I hurt you \r\nTo create this necessary distance\r\nAnd be at peace again\r\nDonâ\u0080\u0099t hate me for it\r\nDeep down inside you should cherish the good we saw\r\nin one another and\r\nThe love that we did share together\r\nAs abusive as this relationship was\r\nAnd realize eventually that either way it would have ended badly\n\n\n", "comment_158": "\nthis really conjures up past relationships\r\nand kind of gives me a better understanding of my ex's side....\r\nwhether or not it is the true meaning, it makes a lot of sense to me\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nAfter he says your pushing, and shoving at about 3:50,\r\nI swear I hear him say something like \"and scrambling, keep my feel flat on the ground\"\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nI see this song as the split within a personality, and the battle in moving away from certain aspects of the self. I use this song whenever I need to grow - I meditate on the lyrics, respect the child within me, and move a step further on, but bringing him with me as I go. We both grow, but we are tied together forever. To annihilate him would be to destroy myself. As is said, there is no love in fear, so the self has to love and not fear the backward aspects of the self, or even the fearful aspects of the self, even though they may pull you into a place rather not seen...\n\r\nOr I just have a beer and try to forget about such things!\n\n\n", "comment_161": "\nMJK is definitely NOT God. He tries everything in his power (reclusiveness, controlling his image) to make us think that.\n\r\nI think the song is simply a frustrated person trying to get out of an emotionally abusive relationship. It would hurt him if he stayed. But the girl keeps dragging him in, while at the same time pushing him to end it.\r\nOR it could be physically abusive. \"Who am I to judge and strike you down?\" Striking her down as in hitting her back/killing her. Who is he to do such a thing? And he's terrified of killing her and of what he would become (a murderer). \"Survival is my only friend, terrified of what I may become\" But he loves her, so it's very difficult. \"Just remember, I will always love you. Even as I tear your fucking throat away. But it will end no other way.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nits more about commentment\r\ninto the relationship.\r\nbut if they have sex then something will happend \r\nin the end..that he doesnt want to became.\r\nif they will end it will be tougher to let go.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\n\r\nTo me this song is about self-exploration, and sexual exploration in the realms of domination/submission. The protagonist is exploring his/her submissive side and enjoys the idea of having control taken away and given to a dominant, to be a slave. \n\r\nI'm alive when you're touching me,\r\nAlive when you're shoving me down.\n\r\nand\n\r\nknow that I will choke until I swallow\n\r\nAt least, a part of him/her feels that way.  Another, larger part resists and is not comfortable being dominated. It's not his/her true nature. Exploring this side of him/her is also scary since there's the chance that self-identity will be altered. This is \"the gap\", the unknown, which if explored too much may cause him/her to \"disappear\".\n\r\nTake care not to make me enter.\r\n'cause if I do we both may disappear\n\r\nToward the middle and end of the song, the person completely rebels against being dominated realizing that he/she doesnt want to be controlled after all, but at this point the dom is in control and doesnt want to let relinquish it.  \n\r\nSo there's a battle, both internal and external. In the end, the submissive side is abandoned and the protagonist fights back and is resolvd to defeat his/her master\n\n\n", "comment_164": "\nLizzigator... We have no proof that God does or doesn't exist. Obviously you're religious to some extent and yeah, that's perfectly fine and all. If we have no proof that God is or was around, who knows, maybe Maynard is God. You never know! Haha\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\n\"Pushit\" \n\n\r\n(Slip on that gap again someday, here \r\nWhile you were begging me to stay, \r\nTake care not to make me enter \r\nIf I do we both may disappear.) \n\r\nYou know that I will choke until I swallow \r\n...Choke this infant here before me, \r\nWhat is this but my reflection...? \r\nWho am I to judge or strike you down? \n\r\n('Cause you're) \r\nPushing, pushit, pushing, pushit, \r\nPushing, pushit, pushing, pushing me. \n\r\nPushing and shoving me \r\nPushing and hurting me, \r\nPushing and shoving me \r\nPushing and shoving me! \n\r\nYou still love me, you still love me \r\n'Cause you didn't think, pushit on me, \r\nYou still love me, you still love me \r\n'Cause you didn't think, pushit on me. \n\r\nRest your trigger on my finger \r\nBang my head upon the fault line, \r\nBetter take care not to make me enter \r\n'Cause if I do we both may disappear. \n\r\n('Cause you're) \r\nPushing, pushing me \r\nPushing, hurting me, \r\nPushing and shoving me \r\nPushing and shoving me! \n\r\nYou still love me, you still love me \r\n'Cause you didn't think, pushit on me, \r\nPushing and shoving me \r\nPushing and shoving me. \n\r\nYeah, I'm slipping back into the gap again; \r\nI'm alive when you're touching me, \r\nAlive when you're shoving me down... \n\r\nBut I'd trade it all \r\nFor just a little... \r\nPeace of mind!! \n\r\nPushit on me, pushit on me \r\nPushit on me, pushit on me, \r\nYour pushing and shoving, scrambling; \r\nKeep my feet flat on the ground... \n\r\nI am somewhere I don't wanna be, yeah... \r\nYou push me somewhere I don't wanna be... \r\nYou put me somewhere I don't wanna be... \r\nSeeing someplace I don't wanna see... \r\nNever wanna see that place again... \n\r\nI saw that gap again today \r\nWhile you were begging me to stay, \r\nManaged to push myself away \r\nAnd you, as well...my dear. \n\r\nIf, when I say I may fade like a sigh if I stay here, \r\nYou minimize my movement anyway, \r\nI must persuade you another way...! \n\r\nPushing and shoving, \r\nPushing and shoving, pushing me \r\n...There's no love in fear!! \n\r\nYeah, staring down the hole again, \r\nHands are on my back again, \r\nSurvival is my only friend, \r\nTerrified of what may come, yeah. \n\r\nRemember I will always love you, \r\nAs I tore your fucking throat away, \r\nIt will end no other way, \r\nIt will end no other way. \t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nPUSH SHIT \t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nbeing controlled in a doomed relationship with sex and a newborn baby.  hes  trying to get away from the controller but slipping back into the gap for instant comfort the controller provides.  the controller does not care about him. she only cares about having him close for herself.  she has latched onto him like a vampire as a final attempt to keep him forever but he chooses peace of mind over self deprecating instant gratifying mindless(awesome)sex and rips her fucking throat away for her to soon latch onto someone else.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nok, you know I appreciate the music tool has, huge fan of how I can connect to it, I'm no basher, I just wanted to comment, how everytime I read the fans comments on tools everyone believes Maynard is a god, i just want to put out how that is an irrational idea... Maynard is not a god, I'm sure he doesnt see himself that way either, he's just very in tune and self-actualized of his good nature and bad. He even admits in his songs that he struggles being compassionate, because he can be a terrible dick sometimes..\r\nyour just on his level, dont ever turn to the artists like they have the answers to life, because what he did to get where he is as a person was turn to himself and ask himself questions, I suggest we all do likewise. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nThe \"Choke this infant here before me\" line might be a reference to the follow-up track, Cesaro Summability\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\ni love maynard,tool,and this song. i always thought that this song is about him being raped by another man in prison or something.idk if hes ever been in jail or prison but thats just what my mind would make up cuz of the lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nthink of Maynard and Jimmy (the eleven year old boy) as the two characters to this and the gap as the place where they will be combined, where one and one are one.  Then see what you come up with.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nDid anyone else think of cunnilingus? Read it again with this in mind. Just sayin.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nto me, and someone here may have said this before i dont know, this song is about someone who is in an abusive relationship, and is continually driven towards \"the gap\" by it. this gap is the borderline of sanity and insanity. and at the end of the song, the abused perso has crossed the gap into insanity, and kills the abusive person. thats my interpretatio, also this is one of my favorite tool songs, JUST SAYING, this one and \"right in two\" are the shiz \t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nThis is one of my favorite Tool songs and one of the best songs Maynard sang and wrote. So much emotion. \n\r\nI love the lyric \"If, when I say I may fade like a sigh if I stay.\" The song evolves and changes, with the lyrics building on each other, up to a powerful climax at the end.\n\r\nIt's a song about an unhealthy, parasitic or abusive relationship. It might also mean that the speaker is having flashbacks to tramautic events from his past, and he knows this relationship isn't good for him, that it will slowly kill him or cause him to eventually lash out in harmful ways. \t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nIsn't it about Schizophrenia.\n\r\nThe constant battle between the two \"entities\" in one person.\n\r\n\"Rest your trigger on my finger\r\nbang my head upon the fault line.\r\nTake care not to make me enter.\r\n'cause if I do we both may disappear.\"\n\r\nThus saying one cannot die without the other.\n\r\nMaybe someone has said something similar before, I didn't go through all the comments.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nthis might seriously be the best drum performance of all time on this song.no kidding. fucking godly. this song completely blows my mind\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nIt can be interpreted so many ways... \r\nThat's why Tool is such a great band I feel like.  It's definitely about a relationship or multiple relationships clearly.  \n\r\nIn the end though, credit where credit is due... Like any song it was inspired by/about some event or experience in Maynard's life.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nI'm not sure if this is what went through Maynard's mind as he wrote this beautiful song, but it is one interpretation of it:\n\nI think it could be about a relationship between him and and another person. It seems that he loves the person but that person is so fearfully attached to him that it pushes him away and he detaches from the situation emotionally in order to refrain from acting violently or otherwise. Maybe he does not know exactly what to do so it's his only option. \n\n\"Take care not to make me enter. \n'Cause if I do we both may disappear.\"\n\nHe could react violently and kill them both in order to end the vicious cycle.\n\n\"Slipping back into the gap again.\nI'm alive when you're touching me,\nAlive when you're shoving me down.\nBut I'd trade it all\nFor just a little bit of\nPiece of mind.\"\n\nHe becomes alive, or fully consciously and emotionally present when she emotionally affects him, even if it is in a negative way. As said before, in order to get peace he has to detach from the situation emotionally. He would rather be fully present, but without the emotional pain or worry arising from other person's fearful attachment to him. The other person will not understand, or fulfill his desire or right to have his own personal space.\n\n\"Saw that gap again today\nAs you were begging me to stay.\nManaged to push myself away,\nAnd you, as well.\"\n\nHe detaches emotionally, or dissociates. From both how he feels and how the other person feels.\n\n\"If, when I say I may fade like a sigh if I stay,\nYou minimize my movement anyway,\nI must persuade you another way.\"\n\nHe says if he tells her that he just may fade like a sigh, or dissociate emotionally, and she minimizes his personal space and freedom anyway, that he must persuade her another way... even if by force, as we find out further into the song:\n\n\"There's no love in fear.\"\n\nHer fear that he will leave is actually pushing him away. Now he is desperate to escape the situation because she is so focused on her attachment to him that they cannot have any other type of experience but a fearful one. This is not love. It's selfish fearful attachment.\n\n\"Staring down the hole again.\nHands upon my back again.\nSurvival is my only friend.\nTerrified of what may come.\"\n\nHer hands are on his back because she is pushing him away. Survival is the only thing he can find comfort in, because he does not know what will come of the situation and fears the worst because of her lack of understanding and cooperation. \n\n\"Just remember I will always love you,\nEven as I tear your fucking throat away.\nBut it will end no other way.\"\n\nHe reassures her that he will always love her. The fact that he has to reassure her implies that she is fearful that he doesn't actually love her. There is no love in fear as he stated earlier. He decides to use force in order to break the vicious cycle because she isn't cooperating/allowing it to end any other (peaceful) way.\n\nI skipped the first verse because for me it's self-explanitory, but I cannot find the words to interpret it into. Any comments or critiques to this interpretation are completely welcome. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nI think this song is talking about a relationship.\n\nDont get me wrong, I'm not talking exclusively about a romantic relationship (which could be included) but as a struggle in a relationship that includes love.\n\nAn interaction between a guy that realizes that we live in shared consciousness, present and fate. The individual in this song has discovered the unity of every being (not talking exclusively about humans) with a consequential love.\n\nAlso I think that this song is like a conversation with him/self. At a deeper level, we are the ones that allow ourselves to suffer or enjoy, we are our toughest judges and we are those who decide whether we succeed or fail in achieving our goals and our emotional/spiritual realization.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nDivine Moment of Truth\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nwhenever i thought of the meaning to this song as always pictured him talking about his mom (or just authority figure in one's life) and how parents are always trying to push ideals and beliefs on their children instead of letting them decide for themselves.\nLyrics like \"I will choke until i swallow\"\nyou'll punish me until i accept your beliefs\n\n\"You still love me and you push it on me.\"\n\nidk! just what i think. but like every tool song, too many meanings! lol\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nI think this song is about drugs, or addiction to anything in general. If you listen to Weak and Powerless by APC, you'll get the references. Talking about the hole, being pushed down the hole, that's representing the addiction. Just imagine yourself in a relationship, where the two of you are addicted to something, heroin, alcohol, cutting, whatever. The two of you are hopelessly addicted. One of you, the one whose perspective is sung through this song, wants out. Not necessarily out of the relationship, but from the addiction. But you can't get away, the other person keeps pushing it on you. \n\n\"I will choke until I swallow\nChoke this infant here before me.\nWhat is this but my reflection?\nWho am I to judge and strike you down?\"\n\n\"This infant\" he's referring to is the other person, his partner, or maybe this other person in his mind, as you are your own worst enemy when you have an addiction, the infant is someone that he created. The other person, the other voice inside of his mind, the addict that he's created, his \"child\". \n\"What is this but my reflection? Who am I to judge and strike you down?\" He feels responsible for the outcome, so feels guilty for judging the other entity.\n\n\"But you're\nPushing and shoving me.\nYou still love me and you push it on me.\nRest your trigger on my finger,\nBang my head upon the fault line.\nTake care not to make me enter.\nCause if I do we both may disappear.\"\nRest your trigger on my finger, easy. Pushing the addiction back onto the person. \"Take care not to make me enter, cause if I do, we both may disappear.\" The addiction will destroy them if they \"enter the hole\" again.\n\n\"There's no love in fear.\nStaring down the hole again.\nHands upon my back again.\nSurvival is my only friend.\nTerrified of what may come.\nJust remember I will always love you,\nEven as I tear your fucking throat away.\nBut it will end no other way.\"\nHe decides the only thing to do is to destroy this other entity or person or voice that he's created that he loves. He feels he loves this other person, but he realizes there's no love in fear, if he feels afraid for his own safety, then how can that be love?\n\nThis is a beautiful song from the mind of someone who has obviously felt the clutch of addiction or somebody very close to him. As with quite a few \"Maynard\" songs, about addiction. 'Stinkfist', 'Weak and Powerless', 'The Package', 'Pushit'. Beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nI have come to believe that this song is about the struggle of a new father who was sexually abused as a child by his own father.  I think this story is told in pieces through the songs Prison Sex, Jimmy, H., and Pushit.  This song in particular is the fear of inflicting the same abuse onto his own son.  As a child of abuse there is still love for the abuser.  He knows that he must destroy in his own heart and mind any of the twisted views of this abuser as a father figure and someone who loved him.  This is the only way he can truly love his own son and not himself be an abuser.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nDefinitely an abusive relationship.\nJust remember you can get out. He did. Even if you are the victim here, you probably need to or should take responsibility for enabling the abuser. Sometimes doing the right thing is extremely painful, walking away from an abusive relationship is the right thing to do. Life is painful.\nThe end is the best part\n\"Saw that gap again today\nAs you were begging me to stay.\nManaged to push myself away,\nAnd you, as well.\nIf, when I say I may fade like a sigh if I stay,\nYou minimize my movement anyway,\nI must persuade you another way.\nThere's no love in fear.\nStaring down the hole again.\nHands upon my back again.\nSurvival is my only friend.\nTerrified of what may come.\nJust remember I will always love you,\nEven as I tear your fucking throat away.\nBut it will end no other way.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nThe song is almost certainly about an abusive/destructive relationship, but you need to be shallow to the point of stupidity to think any relationship must be based around sex, let alone the one in this song. More likely, it sees to be between parent and child, if it's even between two different people. As another commenter said, it may be between two different personas of one person.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nThis song is about Maynard's childhood and the abuse he went through as a kid and how that effected him and shaped his personality. We all have events in our life that make us who we are.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nThis song is in my top ten tracks ever written.\nTo me this song is about a relationship which is both extreme love and hate, a self destructive infatuation between two people. I believe it's written in a chronological order. The infant mjk describes is the nievity of love and the notion that love is a fairy tale and choking the infant is the reliasation or reality that love is sometimes and in this case cruel and destructive. It's also about a power struggle hence the reference to a fault line or weak point which he describes as forcing through or hitting to gain control. He describes being so infatuated that he is losing his own identity and losing himself. The gap he describes is a way out but he's so infatuated and weakened by this relationship he can't see any other way out other than killing the other person! Such an insightful, complex and powerful track. This of course is the nutshell version of my interpretation. I could analyse and debate every line of the song but don't want to complicate my comment.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nThis is about a romantic relationship where one person doesn't want to let go but the other does. \n\n\"I saw the gap again today\nWhile you were begging me to stay\nTake care not to make me enter\nIf I do we both may disappear\"\n\nGap again is that feeling of emptiness when you know you don't love that person or have feelings for them the way you use to, and it makes it even difficult to leave the relationship when the other person is begging you to stay. Make me enter is entering back into a relationship after breaking up or trying to stay away from it because it's bad or unhealthy type of relationship to the point where both won't be making any progress is they decide to stay together. May disappear = no progress = no point. \n\n\"You know that I will choke until I swallow\nChoke this infant here before me\nWhat is this but my reflection?\nWho am I to judge or strike you down?\"\n\nNow there was someone who mentioned this was about Maynard's childhood of abuse and I can definitely see that being the point, esp. if these lyrics are straightforward rather than analytical. If it's not about his childhood, I think it's another form of expressing how much of a pushover he has been in the relationship \"I will choke until I swallow\" and it's making him feel like an immature infant in the relationship since he depended to much on the other person. \"Who am I to judge or strike you down?\" Either way, whether he's referring to himself, both of them, or the other person in the relationship, he doesn't feel as if he can fight back or hold anything against the person for what he/she has done in their relationship.\n\n\"But you're pushing me shoving me\nYou still love me\nYou still love me but you didn't need to shit on me...\nShe didn't mean to pushit on me\"\n\nShe messed up. She keeps trying. She's not trying to let him go. She still loves him even though she keeps doing things in the relationship that are messed up. She didn't mean to push the relationship on him, but she keeps doing it anyways.\n\n\"Rest your trigger on my finger\nBang my head upon the fault line\nYou'd better take care not to make me enter\n'Cause if I do we both may disappear\"\n\nNow she's using manipulation to try to keep him in the relationship by making him feel as if everything was his fault, he's to blame, setting him up for a guilt-trip \"rest your trigger on my finger\" and he's still trying to tell her that it's not a good idea to get back into this relationship \"take care not to make me enter\" because he's getting exhausted, feeling trapped, annoyed to the point where he might just kill them both (most likely an expression than actually wanting to kill) \"cause if we do we both may disappear\"\n\n\"I'm slipping back into the gap again\nI'm alive when you're touching me\nAlive when you're shoving me down, hey\nBut I'd trade it all for just a little peace of mind\"\n\nHe's about to give in and get back with her because the sex was good, but not good enough to the point where he would rather just leave and live in peace. He's realizing that not even the sex is enough to keep him to stay.\n\n\"You're pushing and shoving and scrambling \nKeep my feet flat on the ground\nI am somewhere I don't wanna be\nPush me somewhere I don't wanna be\nPut me somewhere I don't wanna be\nSeeing someplace I don't wanna see\nNever wanna see that place again\"\n\nAren't you all getting a bit annoyed and frustrated reading this? Imagine how he feels. He's trying to tell her that he's done. He doesn't want to be with her. He isn't happy with her, living with her, it's done. He's pretty much done at this point and he's officially accepted it to the point where he's putting his foot down. He's not going to let her manipulate him, guilt-trip him, or persuade him to get back together.\n\n\"Saw that gap again today\nWhile you were begging me to stay\nManaged to push myself away\nAnd you, as well, my dear\"\n\nHe realized there's only a dark future ahead if he moves forward in the relationship. It's over. He's done.\n\n\"If when I say I might fade like a sigh if I stay\nYou minimize my movement anyway\nI must persuade you another way\nPushing and shovin'\nPushing and shoving, push at me!\nThere's no love in fear\nStaring down the hole again\nHands are on my back again\nSurviving is my only friend\nTerrified of what may come\nRemember I will always love you\nAs I claw your fucking throat away\nIt will end no other way\"\n\nHe has to persuade her to let go, to stop trying, strive to get out of that unhealthy relationship. There's no love in fear as in they can't be afraid to let each other go because it is scary to be alone, scary to know what's to happen next after you lose someone. He does love her, but it's just not working out, and since she doesn't, since she won't accept it and won't let him go, he has no choice but to stop being a pushover and make the tough call to leave her, and leaving her is such a hard thing to do (esp. for a pushover) that it felt like he was clawing her throat away, actually having to hurt her so he could get out of that situation, even though he tried to do it in nicer other ways, she left him with no choice.\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nThis song is about the push and pull of an abusive relationship (physical or emotional, all of the above). the \"gap\" being referred to in the song is the disassociation one begins to feel after repeated abuse and becoming fed up.\n\nBut in this song, it talks about how there is something that brings the person back into the relationship, being too weak to walk away and stay away from it. \n\nThe final line refers to the idea that the only way this situation will end is if the person finally loses control and attacks back.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nFinding comfort in the abuse because it's what you know of a life, but recognizing another way.Piece of mind.\r\nI see this abuse within myself, but I am trying to break it and you won't let me.I see distance between us. I love you, but I fear and that's not true love. The abuse continues so remember that I love you as it ends, because there is no other way...\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nIs it not when a relationship ends? Or when a relationship becomes abuseful? \"There's no love in fear\" \"I feel alive when touch me but not when you hold me\". Tool lyrics are just great beautiful poetry. I bet we aren't even close to guessing any of the meanings. We aren't the god himself, Maynard James Keenan\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nbtw joshthack, maynard is my god. =P. har har.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nI still stick by my interpretation of this song being about a relationship that turned abuseful. examples:\r\n\"There's no love in fear\" - How can they love the abuser when they are constantly scared of them.\r\n\"Remember I will always love you as I tear your fucking throat away\" - the abuser claims that they really love the abusee\r\n\"But you're pushing and shoving me. You still love me and you pushit on me\" - The abuser is saying that they love the abusee but they still hurt them.\r\nEither that or it's about S&M  (\"Alive when you're shoving me down\")\r\n;-)\n\n\n\n\n\n", "comment_194": "\nI interpret it as being stuck in a relationship you dont wanna be in - having sex cos its an inbuilt instinct (blokes will know how hard it is to say no here...) and wanting to be out of a relationship but ending up having sex again...I've been in that situation before..\n\r\nOpen to interpretation tho...\n\r\nStimpy\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nto all the ignorant fucks that don't deserve to be tool fans, maynard uses sex as a \"metaphor\" at various times on Aenima. yes, \"stinkfist\" is about penetration, but he is talking about penetrating someone until they open up completely, much like the theme to \"4 degrees\". Pushit is describing a relationship that was so abusive to him because this girl was so incredibly stupid, but he is hopeless without her (i'm alive when you're touching me) and even though he \"may fade like a sigh\" if he stays, for whatever reason she wont let him go, and he uses the incredibly strong imagery of killing her as the only way to get over her and move on with his life, because as long as she is alive, he knows they will be together.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\ntom man is right but instead of a person, its god.... thats my belief.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nthe song is about hell dumasses\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nImagine you're like Adam. Now imagine Eve keeps trying to shove her apple down your throat. That's what this song is about. As a sidenote, be careful around women. They're more susceptible to their shadows. Less willing to \"clear out what could have been\", so to speak, and more willing to suck you into their ways of thinking.\n\r\nTo the Maynard is god guy. Yes, he is the man. But if he's the man then I'm the man and you're the man as well. In other words, walk up to him with a Tool shirt on and tell him how much you worship him. I bet you'll be his new least favorite person.  \t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nPeople forget that a lot of Tool songs are about sex.. plain and simple..\n\r\nI believe that this song is about premature ejacualtion;\n\r\nsaying that he doesnt wanna have sex becuase he'll ejaculate too soon (put me sumwhere i dont wanna be/survival is my only friend/ you pushit on me)\n\r\n\"theres no love in fear\" could be saying how he is scared of sex becuase of the problem.\n\r\nTrading it all for a little piece of mind probably means that he'd want to give up the relationship just to know that he'll stop prematurely ejaculating..\n\r\n\"If i say i might fade like a sigh if i stay/you minimised my movement anyway, i must persuade you another way\" is saying that if he stays inside her, even though shes minimising his movement, hell still cum quickly, so he has to do sumthing else to satisfy her\n\r\n and saying that she was \"begging me to stay\" as in she wanted him in her longer..\n\r\nIm pretty sure about this one..\n\r\nxxxxxxx*xxxxxx\r\nNeverGreen\n\n\n\n", "comment_200": "\nIf there is such thing as god, Maynard is the closest thing.  Hes amazing, and should be worshiped\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nI must agree to some point, that this song is just about sex. But only about how he loves getting sex from his lover but not \"normal\" sex, the kind that makes babies so to say.\n\r\nThe virst verse: \"I will choke until I swallow... \r\nChoke this infant here before me \r\nWhat is this but my reflection? \r\nWho am I to judge and strike you down?\" \r\nHe is talking about how he doesn't want to have sex, but it's in his nature who is he to disagree with his instinct?\n\r\nThe Second verse: \"But you're \r\nPushing and shoving me \r\nYou still love me and you pushit on me\" \r\nBut his lover keeps pushing sex on him. He isn't saying anything to her to make her think he doesn't want to so she keeps doing it.\n\r\nThe third verse: \"Rest your trigger on my finger, \r\nbang my head upon the fault line \r\nTake care not to make me enter \r\n'cause if I do we both may disappear\"\r\nThis is where he is talking about the various ways he is having sex with his lover. (Fingering, \"Rest your trigger on my finger\", Oral, \"bang my head upon the fault line\") But he doesn't want to normal sex with her. Because he will completely lose it.\n\r\nThe fourth verse: \"But you're pushing me, \r\nShoving me \r\nPushit on me\"\r\nAgain he is talking about he is still doing it anyway, she keeps making him do it.\n\r\nThe fifth verse: \"Slipping back into the gap again \r\nI'm alive when you're touching me, \r\nAlive when you're shoving me down\"\r\nHere he is talking about how he is gonna lose it. But he loves it when she touches him and he loves it when he getting oral sex from her.\n\r\nThe sixth verse:\"But i'd trade it all \r\nFor just a little bit of \r\nPiece of mind\"\r\nHe would love it if they did more then just have sex all the time, but thats all she wants to do, he would trade it all for just a little peace of mind.\n\r\nThe seventh verse:\"Put me somewhere I don't wanna be \r\nSeeing someplace I don't wanna see \r\nNever wanna see that place again\"\r\nNow this is where he has got so into the oral/manual stimulation from his lover that he want to have \"normal\" sex with her, because he has just about lost it.\n\r\nThe eighth verse: \"Saw that gap again today \r\nAs you were begging me to stay \r\nManaged to push myself away, \r\nAnd you, as well\"\r\nHis lover wanted it again, she was begging him for it, but he managed to escape before he lost it, but in doing so pushed her away from him.\n\r\nThe Ninth verse: \"If, when I say I may fade like a sigh if I stay, \r\nYou minimize my movement anyway, \r\nI must persuade you another way\"\r\nBut if he says anything about how he doesn't want \"normal\" sex then his relationship with her will just be very shallow, they'll just sit around and do nothing. But she doesn't let him do much anyway. If only he could find a way to get her to stop.\n\r\nThe tenth verse: \"There's no love in fear\"\r\nHe can't truley love her if he is afraid of her in totality.\n\r\nThe eleventh verse: \"Staring down the hole again \r\nHands upon my back again \r\nSurvival is my only friend \r\nTerrified of what may come\"\r\nShe is doing it again, she wants it again, but he must escape he must not go insane, he knows what he must do to make it stop.\n\r\nThe final verse: \"Just remember I will always love you, \r\nEven as I tear your fucking throat away \r\nBut it will end no other way\"\r\nHe has to kill her to make it stop, but he still loves her, this is the only way.\n\r\nTruley one of the greatest songs ever. My favorite Tool song has to be Pushit (Live) and Pushit.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\n28.media.tumblr.com/…\n\n\n", "comment_203": "\nMental disorder and suicide.\r\nI've always felt that this about a duel personality disorder. Two personalities where one is child like and submissive and the other is the authoritarian forcing his demands. A bit like spiegal and gollum. However the child sees the gap again (suicide) which is his escape and peace of mind. The authoritarian has the ability to manipulate particularly through fear and any other emotion to get what he wants. He can even beg if its required. And it's all out of what he claims to be love.\r\nIf the child enters the gap, they both will disappear.\n\r\n\"There's no love in fear\" - I always think of this line when the kids get me upset. Another MJK gem and a wonderful message whoever the source.\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nI honestly think, that like so many other Tool songs this is about sex. \n\nMore specifically, I think it's about pulling out cause he doesn't want a kid and in the heat of passion he's finding it difficult to pull out.\t\t\t\t\n\t\t\t\t\n\n"}