{"comment_0": "\nCheers to Bentol and others:\n\r\nNo one mentioned that \"Red Right Hand\" is from\r\nJohn Milton's \"Paradise Lost\".\n\r\nThis is even spelled out on another Nick Cave album \"Murder ballads\" in \"Song of Joy\":\n\r\n\"\r\nQuotes John Milton on the walls in the victim's blood.\r\nPolice are investigating at tremendous cost.\r\nIn my house he wrote 'His red right hand' \"\r\nThat I am told, is from 'Paradise Lost'\r\n\"\n\r\nMilton wrote:\r\n\"\r\nChained on the burning lake? That sure was worse.\r\nWhat if the breath that kindled those grim fires,\r\nAwaked, should blow them into sevenfold rage,\r\nAnd plunge us in the flames; or from above\r\nShould intermitted vengeance arm again\r\nHis red right hand to plague us? What if all\r\nHer stores were opened, and this firmament\r\nOf Hell should spout her cataracts of fire,\r\nImpendent horrors, threatening hideous fall \r\n\"\n\r\nYou can see the obvious allure for our pal Nick.  All that old trestament wrathful divinity that fills much of his poetry.\n\r\nThe beauty of art is it's ability to become what the viewer sees or even wishes to see.  For my money, though, the tall, handsome man in this song might be the brutal God of the Christian tales, indiffrent to man's sense of self-destruction.\n\r\nCave is one fo my favourite poets who happens to be an excellent musician.\n\r\n-phase\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI always wondered if Nick Cave is a Stephwn King fan, because this song is a perfect description of Randall Flagg in The Stand. Everything about it is so perfect for that character, especially the lines 'On the gathering storm comes a tal handsome man in a dusty black coat with a red right hand.'\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nred right hand means he has killed people. red as in blood. I think they are talking about a government man. A shady unknown man that has done bad things involved with the government, such as war, illegal testing, corruption, and such. they are talking about uncle sam / the government. / the unknown and faceless government agent.\n\r\nhe will comfort you, that can represent the way they may give you a job and say you are protecting people, and it is in the interest of the nation, while in reality you are doing shady things. stacks of green paper in his red right hand, well that's obvious, the government has money to spend, and they have power and are corrupt.\n\r\nthis song was used in the x files tv series. In the show, they show shady government figures, like the cigarette smoking man, skinner, and others, that are involved with corrupt plots and cover ups. Some of them are murderers, aka \"red right hand\" (in my opinion, I think that is what the show and song is driving at)\n\r\n\"black coat\" = government agent\n\r\nmy opinion is that it has nothing to do with the devil, that's just my opinion.\n\r\nthere are lots of different opinions about this song, but this is what came into my mind when I heard it. great song by the way. (I like the music, not the lyrics)\n\r\n\"you are one microscopic cog in his plan\" = one small agent, amidst a vast network,, a large machine., one cog in a big machine.\n\r\n\"take me to the town, and go across the tracks.... \" = see? its anytown usa, it can happen anywhere. They can find you, any place, any where... no secret is safe.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nBentol's on to something -- between the Paradise Lost and the trinity references, God is a good call. One of my two favourite theories for this song.\n\r\nGoing with the god-theory: Rather than actual god, I think ol' Nick's describing the -idea- of god, drawn from the prayers of the wretched of a modern capitalist society. Divinity is meaningless, mercy and salvation are meaningless. All that matters is what you can get out of it, and so it doesn't matter who you're talking to (the 'ghost, god, man, guru' -bit). This is also why the description is so horriffic -- this is God as a dealer, the kind of guy who treats his congregation as customers. Pay your dues (in faith) and you'll get your fix of good stuff, don't and your life will be hell because always you'll be haunted by what you may ahve missed.\n\r\nMy problem with that theory is that it leaves the first verse (all that modern industrialist imagery) completely hanging. That's why I'd suggest a second identity for the man with the hand. On the one hand, it's the vindictive dealer image of God that runs through American politics. On the other, it's secular government as a controlling, identity-stealing and individualism-crushing force. That's what the lyric seems to be saying to me: \"Big Brother is watching, he knows all about you, he's everywhere, and this is -his- world. Conform to what we want you to want, or be ground down.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nScary eh? Thats neat. When I read the lyrics my first idea was a description of satan or a satanic figure, but when i actually listen to the song i get no such images of anything scare or demonic like that. Rather i get a picture of a person the kind who's status as hero or criminal is widely debated. Someone to be deeply respected and yet wanted dead by others. Someone with a shady background and the capability to be your worst nightmare or your best friend and asset. Meh.. just the imagery i get.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ni think john andrew philot is more or less right except that his explanation is about as cryptic as the song.\r\nthe man with the red right hand is a broad metaphor for something/someone which can make you feel better but not actually make you better. perhaps something which tricks your body or your mind into feeling more at ease, drugs for example or perhaps a fashion label. things you have been convinced to like by other people and those people (the ones with the red right hands) make \"stacks of green paper\" out of your addiction.\n\r\ni really hope thats true about this whole song being adlibbed but i doubt it.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nWhat if the breath that kindled those grim fires,\r\nAwaked, should blow them into sevenfold rage,\r\nAnd plunge us in the flames; or from above\r\nShould intermitted vengeance arm again\r\nHis red right hand to plague us?\n\nen.wikisource.org/wiki/Paradise_Lost/…\n\r\nAccording to Wikipedia the action of books I-II amongst other things centres around \"a debate [between the rebels] on what to do next in relation to the war in Heaven.\"  The extract is spoken by Belial, who has been symbolic of many differing qualities throughout history.  However, in Book I of Paradise Lost he is represented as:\n\r\nBelial came last; than whom a Spirit more lewd\r\nFell not from Heaven, or more gross to love\r\nVice for itself. To him no temple stood\r\nOr altar smoked; yet who more oft than he\r\nIn temples and at altars, when the priest\r\nTurns atheist, as did Eli's sons, who filled\r\nWith lust and violence the house of God?\r\nIn courts and palaces he also reigns,\r\nAnd in luxurious cities, where the noise\r\nOf riot ascends above their loftiest towers,\r\nAnd injury and outrage; and, when night\r\nDarkens the streets, then wander forth the sons\r\nOf Belial, flown with insolence and wine.\r\nWitness the streets of Sodom, and that night\r\nIn Gibeah, when the hospitable door\r\nExposed a matron, to avoid worse rape.\n\nen.wikisource.org/wiki/Paradise_Lost/…\n\r\nOn th' other side up rose\r\nBelial, in act more graceful and humane.\r\nA fairer person lost not Heaven; he seemed\r\nFor dignity composed, and high exploit.\r\nBut all was false and hollow; though his tongue\r\nDropped manna, and could make the worse appear\r\nThe better reason, to perplex and dash\r\nMaturest counsels: for his thoughts were lowâ\u0080\u0094\r\nTo vice industrious, but to nobler deeds\r\nTimorous and slothful. Yet he pleased the ear,\r\nAnd with persuasive accent thus began:â\u0080\u0094\n\nen.wikisource.org/wiki/Paradise_Lost/…\n\r\nSo Belial in the extract that Nick cave refers to in his song Red Right Hand is attempting to persuade atan that the rebellion against God and the war in heaven is lost and to give up the fight.  It is interesting to note that the phrase \"Red Right Hand\" refers to God and the fear of God's retaliation and not Satan or a lesser demon of hell, which isn't suprising since in religous terms right hand path denotes judeo-christian beliefs and left hand path alternative/satanist views.\n\r\nNow how does Nick cave use the phrase \"Red Right Hand\" in his song and what is he implying?\n\r\nFirstly, you have to decide weather the figure represents Christianity or the Devil.  The song is quite ambigous and could be interpreted either way.\n\r\nsavage suggested this song was about an evangelist and these lines certainly support that argument:\n\r\nHe'll wrap you in his arms,\r\ntell you that you've been a good boy\r\nHe'll rekindle all the dreams\n\r\nas Awwsugar pointed out these lines reflect the paradoxical nature of the trinity of god:\n\r\nHe's a god, he's a man,\r\nhe's a ghost, he's a guru\n\r\nCould it be that the Guru along with the Evangelical aspects of the song is Nick's suspected form of the second coming of Christ?\n\r\nAnyway I've spent enough time beating around the bush, I agree with the whole idea of Red Right Hand being a retelling of Faust but would add that the figure in the song is distinctly Christian and possibly a manifestation of God. \n\r\nI juat wanted to end by saying that the interpretations that you guys offer are really fascinating and to keep up the good work.  However, I doubt Nick Cave reads Stephen King.  He tends to \r\nlike the deeper, philosophical artists not the paperback novellists but you never know....\n\r\nI doubt that this song was entirely ad-libbed, or even partly ad-libbed.  it was probably well-thought out and written well before recording.\n\r\nAlso, ever noticed how Nick cave likes his serial killers, murderers and anti-heroes to be handsome and sexually alluring?\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI've read through all of these and have only found one member (John Andrew Philpot) who makes mention of what i think is a well crafted metaphore for drugs and addiction.\n\r\nTake the verse\r\nHere he comes..\r\nThrough the ghettos and the barrio\r\nand the bowery and the slum\r\nA shadow is cast wherever he stands\r\nStacks of green paper in his\r\nred right hand\n\n\r\nThis, to me anyway, points to nothing other than drugs. Coming in through the poorer sections of a city and leaving it's shadow cast on every where it's presence is known. Then, of course, the stacks of money piling up in it's red right hand.\n\r\nAlso, the last verse in the song can explain to anyone who's dealt the addiction (and maybe hasn't) the extent that it can overwhelm every \n\r\nIt's debatable, i know - but Nick's own struggles with addiction put this meaning over the top for me. Also, suggesting that the song is taken at face value as being about some evil, possibly supernatural devil-like figure belies the masterful song writer that is Nick Cave. Would he simply write some scary little tune about a Randal Flagg type persona? i don't believe it's in his character - particularly not on an album that isn't, say \"Murder Ballads.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nRandall Flagg, from the Stephen King Book  mini series, THE STAND, is the person mentioned in this song. Watch The Stand, and you'll know!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nGreat article on Cave here:\n\nthemonthly.com.au/…\n\r\nexert: \"... A â\u0080\u009cManichean divideâ\u0080\u009d, as the novelist Will Self has said, runs like an embattled frontier throughout Caveâ\u0080\u0099s mental universe. In â\u0080\u0098Song of Joyâ\u0080\u0099, he quotes Miltonâ\u0080\u0099s Satan, who in Paradise Lost refers to the â\u0080\u009cred right handâ\u0080\u009d of a jealous, vengeful God. In Miltonâ\u0080\u0099s poem the hand is red because it blazes with fiery potency; in Caveâ\u0080\u0099s song it belongs to a murderer who has scrawled the citation in his victimâ\u0080\u0099s blood...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nit's about a dangerous mob boss, infact you can even call him evil, he's willing to do you favors but then expects you to do favors for him as well. it's a epic song.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nApparently he really did ad-lib some of this. From an interview in Rolling Stone circa 1994:\n\r\nQ: I find it hard to believe that you ad-libbed in the song \"Red Right Hand.\"\n\r\nNick Cave: \"That's quite true. One of my great talents is ad-libbing, I have to say. I had the title, and basically I knew what I wanted to sing about, and it was a matter of just going in and putting it down. There's certain lines in there, obviously, that aren't off the top of my head, but there's ones in there that definitely are. Aren't I incredible?\"\n\r\nYes, Nick. Yes you are.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nCave certainly likes this image[RRH].\r\nIt is directly used in this song and \"Song of Joy\"\n\r\nAs Robster says below\n\r\n\"In Miltonâ\u0080\u0099s poem the hand is red because it BLAZES with fiery potency\"\n\n\r\nIn \"O'Malley's Bar\" he writes\n\r\nMy hand decided that the time was nigh\r\nAnd for a moment it slipped from view\r\nAnd when it returned, it fairly BURNED\r\nWith confidence anew.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nWell, I think Mr. Cave helps us with the intepretation of this song in the opener for Murder Ballads. 'Song of Joy' talks about the murder of a family, alluding to a man with a red right hand: 'In my house he wrote: \"his red right hand\" / That, I'm told is from Paradise Lost'\n\nSo yes, this song is possibly about an impersonation of Satan, as it has been mentioned in other comments. Seeing that this is a recurring character, I'd probably say that this man with a red right hand is Cave's lust for murder, his murderous self, for that matter. Sorry if this has been said before, but I haven't read through the 7 pages of comments :)\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI think its a song about God, but told from the perspective of Satan. That is where the term \"red right hand\" itself originates in Paradise Lost, its an attribute Satan speaks of referring to God. Im gonna give Cave credit for understanding the context and using it here. We've all heard songs with \"happy\" melodies but sad lyrics, this song is the opposite, its in a minor chord, but looking at the lyrics, theres nothing bad that can be attributed to the man, why then presume he's evil? \"He'll reach into your soul, and heal your shrinking soul\" anybody think thats a bad thing?\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nVanchacrep, the song was playing during the scene where Larten Crepsley was digging in the graveyard, so I can see your point there.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nthis song is about the other side of anyone\nsometimes you control it\nsometimes you don't\n\nbut mostly you don't\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nExtremely scary. This has to be about some kind of demon (or someone living by their code).\r\nOne remarkable thing about this one is that Cave was adlibing through the whole song. I guess I wouldn't last a day if I lived in the head of someone that has all of this inside.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nExtremely scary. This has to be about some kind of demon (or someone living by their code).\r\nOne remarkable thing about this one is that Cave was adlibing through the whole song. I guess I wouldn't last a day if I lived in the head of someone that has all of this inside.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nthis song scares me. listening to it at night.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song reminds me of the bad guy in the film 'The Usual Suspects.' An underworld figure of almost mythological power, who people speak of in whispers and rumours.\n\r\nThere is a Faustian angle here - you can sell your soul to this guy (the Devil? or a mob boss?), and he'll give you what you want, but you actually lose a lot more than you gain.\n\r\nOn a semi-related note, I always thought it was cool that Billy Corgan from the Smashing Pumpkins has a red LEFT hand... he has a birthmark on it. Especially cool because of his guitar playing, maybe he has the power of the devil too...\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nim not calling superchango a liar but how can someone human adlib such fantastic lyrics as these?\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nooooooh maybe the song is about the devil? \n\r\nahh\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI still can't help but associate this song with Scream... but then again I'm a weirdo. I kinda think this is about the devil or something... maybe a mob boss or something though, the red right hand might be like blood on his hands from the people he's killed or had killed or something weird...\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI think this song is about an evangelist.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nExtremely scary, although I cant help but laugh at the lines \" You're one microscopic cog in his catastrophic plan, Designed and directed by his red right hand \" if you take that part literally, it becomes rather funny, one time I was singing this to my friend in math class and we couldn't stop laughing at that part. But we are weird. Ahem.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\njust to mention one thing: this is one of the most intense songs i ever saw live (and maybe scary, yes..)\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nwell dunno exactly about the song..i think chaka has right  nick maybe took the idea from Stephen king's stand..and he created a story.....I've seen nick cave and his band in Athens...(he visited about 10 times) he's totally Rock.......few hours before his concert i visited a cafeteria near a beach in Athens...suddenly i saw nick cave opposite me....to relax and staring the sea.....i forgot to tell ya in his table was 3 cup of coffees!! (drunk 3 coffees in 10 mins and then he gone!!!..)\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThe figure is faustian that is clear, and that interpretation works well with  John Andrew Philpot's post too. \n\r\nAnd actually the lines \"You're one microscopic cog in his catastrophic plan, Designed and directed by his red right hand\" are brilliant. It makes me think both about powerhungry warmongers and about some unknown entity (perhaps myself).\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI think the figure with the red right hand is, well, God.\n\r\n*You're one microscopic cog, in his catastrophic plan.\r\nDesigned and directed byhis red right hand.*\n\r\nGreat lyric, that. \n\r\nLove the organ solos in this one.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nFrankly I think the man is God. More so than the devil because of the line about being a microscopic cog in his catastrophic plan. God has the devine plan set out or is known for it far more than Satan.\n\r\nIt speaks of the cynical nature or opinion of God. The story of Job comes to mind. He offers you salvation and love but in the end you feel a whole lot of pain and are told it's all your fault in the first place. Yet we all know the feel and struggle against temptation.\n\r\nNick Cave is a genius though, brilliant lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\n\"He's a god, he's a man,\r\nhe's a ghost\"\n\r\nGod the Father, God the Son and God the Holy Spirit.\n\r\n\"he's a guru\"\n\r\n?\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\ni don't think Nick would call God's plan catastrophic, given he is a Christian. he does have a very... \"distinct\" view of God though... but I don't know about that.\r\nTo me this song is about a human being... a mob boss, a criminal, a gangster.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nIt's God seen from the pov of the devil, as it is in Milton. \n\r\nThe first verse is simply NC placing it in a more modern context.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThe charachter really does smake of Randal Flagg in The Stand. Thats what I thought of the very first time I heard it. But what about a dual nature entity. God and the devil as one with the Red Right Hand playing out \"gods\" darker side. also \"hes a guru\" - more than just the trinity? more than just christianity? I dunno.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nGood Warmphase, I knew that (have the book with Blake's pictures) but failed to spin on it in my previous post. \n\r\n@ AwwSugar: Of course, it was clear to see but I failed to see it. Well I mix your observation into mine: A Faustian God, well then we really live in a \"scary\" world indeed.\n\n\r\n@ Dealy. I do not agree, but I think your are at something. Ok he does not mean the actual God... or does he. I think, based on other cavian songs, that it is about the interfering God, he who interfere in the world. Either you believe in that kind of God or into the Deus Ex Machina God, who does not interfere. If there is an interfering God, according to Cave, then it is the Â´figure in this lyric. A scary man.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nHere's the first thing I thought of when I first heard the song years ago:\n\nen.wikipedia.org/wiki/…\n\r\nThe video reminds me alot of Night of the Hunter with Robert Mitchum.  Well worth seeing.  I'm positive Nick was influenced in his craft by that movie (among many other things).\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nFrom my criminal justice background  The song really seems to come from the point of view of a serial killer.  If you keep this in mind while listening it fits very well.   Also the red right hand might be a reference to his killing hand  ( red with blood).   But the milton point is interesting as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nTheres a lot of very enlightened people here but the meaning of this song is closely connected to the fact that \"Red right hand\" is a reference to Milton's Paradise Lost.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThis song is probably talking about a figure in power who is abusing his (or her, its hard to tell because the song is so surreal) power.  \"His red right hand\" is the merging of 2 thoughts, the phrase \"caught him red handed\" and the fact that most people use there right hand as thier mian hand, meaning he stealing comes as second nature and is a habit (aka he is evil and steals from his people). It speaks of him also acting friendly to masqurade his true self, then abononing/hurting you when you thought he was your friend, basically he uses people.  And of course the stack of green paper is the money he gets from you.  All in all its about an evil political figure who seems smooth and nice (or perhaps fake fiath healer dihonest doctor ect.) but is really evil, though this doese not shine forth untill its to late.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThis song was used in the 2007 QCS Test for Queensland (Australia) High School students wanting to go to university. Knowing this song made it so much easier to answer the questions. Eg. What is the beat for the first verse of the song?\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI read this as the allure of communism being used to gain trust and power in order to serve an underlying motive.\n\r\n[\"red\" obviously being a refernce to communist ideals and \"righ hand\" implying that communism is second place to the leaders intentioons - such as a tool or right hand man]\n\r\ni think these lines in particular relate to key concepts in communism\n\r\n\"You ain't got no money?\r\nHe'll get you some\r\nYou ain't got no car? He'll get you one\r\nYou ain't got no self-respect,\r\nyou feel like an insect\r\nWell don't you worry buddy,\r\ncause here he comes\r\nThrough the ghettos and the barrio\r\nand the bowery and the slum\r\nA shadow is cast wherever he stands\r\nStacks of green paper in his\r\nred right hand\"\n\r\nand \n\r\n\"You're one microscopic cog\r\nin his catastrophic plan\r\nDesigned and directed by\r\nhis red right hand\"\n\n\n\r\n\"You'll see him in your head,\r\non the TV screen\r\nAnd hey buddy, I'm warning\r\nyou to turn it off\"\n\r\nis perhaps a refernce to the use of propaganda.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\ni thik it about sime man comingin into sum families lives who acts all good and is nice to every one but has evil intensions\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThis song always conjured an image of an old fashioned outlaw in a western. \n\r\n\"You're one microscopic cog\r\nin his catastrophic plan\r\nDesigned and directed by\r\nhis red right hand\"\n\r\nI love that passage, by far the best in the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI know I'm probably dead wrong, but the way I interpret this song is that it's about the part of the mind that's best described as evil. The line \"take a little walk to the edge of town\", for instance, could be that part of the mind that hides the monster in us all. And the man with the red right hand is that monster inside us, and when it gets out it destroys not only others but us as well.\n\r\n\"You'll see him in your nightmares/you'll see him in your dreams\" could be that the monster is starting to corrupt the mind and take over the once sane person.\n\r\nThe verse \"You ain't got no money?/He'll get you some You ain't got no car? He'll get you one/You ain't got no self-respect,/you feel like an insect/Well don't you worry buddy,/cause here he comes\" to me sounds like it's referring to becoming corrupted and no longer caring what the law or morality says and simply taking whatever you want.\n\r\nAnd the town is simply a metaphor for the mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nwhat about a politician? the faustian god seems like a very plausible explanation but i also was reminded of corrupt politicians, mainly due to the fact that i had recently read ben okri's famished road when i first heard the song, which has a lot to do with insane greed and spirits and people that turn on you. \n\r\nthe politician that rekindles your dreams with his words, lures you in, then takes from you \"stacks of green paper\" and murders and destroys.\r\njust a thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThose who think this song references Randall Flagg, the Dark Man from Stephen King's The Stand are pretty close, I think. It may not be Flagg specifically, but in general I think the song is talking about The Antichrist, which Flagg was basically a version of. The figure is NOT God. The Antichrist on the surface will appear Godlike and good, and many will mistake him for God. A man who appears out of nowhere, seems to have amazing power and influence, acts like he's here to help us all... but is actually here to destroy us. \"he's a ghost, he's a god, he's a man, he's a guru,\" describes humanity's varying perceptions about this creature. Some will think he's just a brilliant man, some will mistake him for God. But \"he ain't what he seems.\" He appears to be good, but \"hidden in his coat is a red right hand,\" a sign of his true nature, which as others have said, is a reference to Milton's works.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThose who think this song references Randall Flagg, the Dark Man from Stephen King's The Stand are pretty close, I think. It may not be Flagg specifically, but in general I think the song is talking about The Antichrist, which Flagg was basically a version of. The figure is NOT God. The Antichrist on the surface will appear Godlike and good, and many will mistake him for God. A man who appears out of nowhere, seems to have amazing power and influence, acts like he's here to help us all... but is actually here to destroy us. \"he's a ghost, he's a god, he's a man, he's a guru,\" describes humanity's varying perceptions about this creature. Some will think he's just a brilliant man, some will mistake him for God. But \"he ain't what he seems.\" He appears to be good, but \"hidden in his coat is a red right hand,\" a sign of his true nature, which as others have said, is a reference to Milton's works.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nThose who think this song references Randall Flagg, the Dark Man from Stephen King's The Stand are pretty close, I think. It may not be Flagg specifically, but in general I think the song is talking about The Antichrist, which Flagg was basically a version of. The figure is NOT God. The Antichrist on the surface will appear Godlike and good, and many will mistake him for God. A man who appears out of nowhere, seems to have amazing power and influence, acts like he's here to help us all... but is actually here to destroy us. \"he's a ghost, he's a god, he's a man, he's a guru,\" describes humanity's varying perceptions about this creature. Some will think he's just a brilliant man, some will mistake him for God. But \"he ain't what he seems.\" He appears to be good, but \"hidden in his coat is a red right hand,\" a sign of his true nature, which as others have said, is a reference to Milton's works.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI can't help thinking of Jim Morrison from this song... especially of 'The Hitchhiker' from An American Prayer. I saw Nick Cave and the Bad Seeds live recently, and there was one bit of this song that sounded just like the intro to Riders on the Storm.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nIf this song is about God, His son Christ and His Spirit, it's a very distorted view. Perhaps someone impersonating God like the Devil or a very greedy remorseless man. Pretending give but really only taking. If you really wanna know about God read the bible and talk to Him personally. The man described in the song is not God nor His Son nor His Spirit. \t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis song is about God and \"Revelations.\"  \n\r\nFirst, as others have noted, the Red Right Hand refers to God's vengeance (specifically against demons.)  God/Ghost/Man is obviously the Trinity, with guru referring specifically to Jesus' time on Earth, when he had his devoted followers. But that is hardly the beginning.\n\r\nThe end of the first stanza talks about God coming from a gathering storm (end of the world?) The second stanza starts with telling you that \"you've been a good boy\" = forgiveness of sins.  Rekindling of dreams = restoration of faith. Even through all this, he has the hidden Red Right Hand - that is, even though we as Christians see God as loving, there is the vengeful aspect, the Old Testament God, and the one that will return during the end times.\n\r\nThe third stanza talks about how God provides to the poor; how He gives to those who have nothing, and coming through the barrio/ghetto/etc. - those are all places where the poor reside.  \n\r\nThe fourth, and final, stanza is more about Revelations. Seeing God in our nightmares and dreams talks about the rewards of Heaven (\"you'll see him in your dreams\") and punishment of Hell (\"...nightmares\"). Him not appearing to be what he seems means people's rejection of God; people not believing in Him, and so they won't recognize that it is God. \n\r\nAnd the last four lines?  Microscopic cog in catastrophic plan = playing a small part in the overall plan (the endgame being from Revelations.) And we've been all designed by God, and directed by our free will.\n\n\n\n", "comment_52": "\n2 words\n\r\nCorruption and Opression.\n\r\nI'm loving what I'm hearing here. Every person has taken their own meaning from this song. As a song writer myself, I approach a song like some painters approach a canvass, sometimes planned out, sometimes just free sketching but mostly both. \n\r\nIn my humble opinion Nick Cave has this one pretty well laid out, borrowing from biblical images. Leonard Cohen is also a master of this technique. I think that corruption and oppression are the main themes here. One Microscopic Cog in His Catastrophic Plan feels biblical but it applies to any senerio dealing with corruption and oppression. Corruption in Capitalism, Socialism, Communism... It does not make much difference... A good songwriter leaves that up to his listener almost never forcing his/her own personal situation.\n\r\nAs for the allusions to Stephen King and so forth, it is quite possible that he and Nick Cave are borrowing from the same well- the poets and philosiphers of the past.\n\r\nOne more thing, the music is brilliant in this... Very Menacing...You hear this one in a lot of movie soundtracks.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nRed Right hand of comunism anyone ? stalin,  etc, about it creaping over everything and comming. \n\n\r\nYou ain't got no money?\r\nHe'll get you some\r\nYou ain't got no car? He'll get you one\n\r\nkinda about how everyone shares everything within the state...\n\r\nthats all I got, but i think thats what it it is about, witjh pleantly of caves imagination \n\r\nMike x\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nRed Right hand of comunism anyone ? stalin,  etc, about it creaping over everything and comming. \n\n\r\nYou ain't got no money?\r\nHe'll get you some\r\nYou ain't got no car? He'll get you one\n\r\nkinda about how everyone shares everything within the state...\n\r\nthats all I got, but i think thats what it it is about, witjh pleantly of caves imagination \n\r\nMike x\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI agree with StickityWicket 100%. That is what I thought from the first time I heard this song. Being a former heroin addict myself, I might be a little biased, but this song envokes the feeling of being deep into an addiction, meeting a dealer to buy drugs and resenting the whole situation. Hating yourself, the dealers and having to relive the vicious cycle of addiction day in and day out for 6 years, in my case. \n\r\nThis song paints the picture of an addict/dealer relationship perfectly...\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nWhat is this stuff about some character by Stephen King? Flagg and the man with the Red Right Hand are both definitely representations of the same being, which is (debatably) Antichrist, Belial or Lucifer, but this song is not about Flagg himself. Also, not simply about a drug addiction, but that can be part of what \"evil\" does to humans.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nwow..\r\nhaha, and to think i interprated this as a song about a pedophile..\r\nhahahah.\r\nbut seriously.\n\r\n'he'll wrap you in is arms and tell you that you've been a good boy, \r\nhe'll rekindle all of those nightmares it took you a lifetime to destroy'\n\r\nand 'designed and directed by his red right hand'\r\ndirected as in... well you know.\n\r\n'you feel like and insect'\r\nwell, that's pretty self explanitory.\r\nself esteem tends to plummet when you've ben sexually abused.\n\r\nand the money & car part i see as a bribe by him to make sure his victims stay quiet.\n\r\nand so on.\n\r\nbut possible not.\r\njust a thought.\n\n\n\n\n", "comment_58": "\nI don't know what to think about this song, but one thing that comes to mind when the red right hand is mentioned is Hellboy. . . I know that guess is way out there but I just thought it was kinda strange.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nI've always loved this song and recently--while rereading William Gibson's \"All Tomorrow's Parties\"--I ran into a snatch of lyrics (\"a microscopic cog...\"). I've been trying to find out--in typical chicken or the egg fashion--whether Gibson influenced Cave or vice versa. So far I've not gotten any answer to the mystery...except that Gibson apparently digs Cave and Cave reads Gibson. Anyone know any details?\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI've always loved this song and recently--while rereading William Gibson's \"All Tomorrow's Parties\"--I ran into a snatch of lyrics (\"a microscopic cog...\"). I've been trying to find out--in typical chicken or the egg fashion--whether Gibson influenced Cave or vice versa. So far I've not gotten any answer to the mystery...except that Gibson apparently digs Cave and Cave reads Gibson. Anyone know any details?\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI have often wondered if the description of the \"tall handsome man in a dusty black coat\" was taken fron the character Antonio das Mortes the main character in the Brazilian movies from the 1960s \"Black God, White Devil\" and and its sequel \"Antonio das Mortes\"\nen.wikipedia.org/wiki/…\n\r\nYou will remember that Cave lived in Brazil in the early 1990s and it seems likely that he would be familiar with the character.\r\nAntonio is a sort of avenging angel -causing all sorts of havoc or help depending on who you are.- just like the man with the red right hand.\n\r\nI can't say I can recommend the movies - they are pretty hard work, but none the less, interesting in their own way. \t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nthis song is amazingly deep, because at first you think immediately of the devil, especially with how creepy the background music.  but if you take a second to think, you get an image of a hero, or a god.  especially the verse where he can get you all the stuff you want.  as the devil you can sell your soul or you could pray for those things and get them.  designed and directed also raises these questions, because it could be an evil plot set by the devil or an ingenius idea of where people fit into the world as a god.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nThe author Peter Straub was a source of inspiration for Nick and this song reminds me of the Straub short story 'A Short Guide to the City' - a weird story written like a travel guide interspersed with news article excerpts about a serial killer on the loose called 'the Viaduct Killer'. Not sure if this story inspired the creation of the song but the similarities are there.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nIt's about the devil. \n''Red right hand'' comes from Paradise Lost. In the poem it's pretty obvious it's about Satan. \n\nIt may not be about the devil himself but about a generalized evil. A more psychological Satan rather than a spiritual one.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nit's obvs about Mr.Crepsley ktb\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nbut it is obvious isn't it?!\nhe is describing devil!\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI feel as if it's a song abut a man with power on an almost apocalyptic scale, hence the heavily daunting and foreboding tune. Someone who can get you anything, for a price. Several comments have already suggested that the song is based around Randal Flagg from The Stand, and I can see where they're coming from; a man with mysterious motives who can offer you the world as long as you do one little thing for him, the role fits perfectly.\n\n Personally I interpret it as a deal with the devil, or someone much like him. The line \"microscopic cog in his catastrophic plan\" heavily suggests that his overall goal is something chaotic and evil-like doomsday- and \"red right hand\" could be taken in a literal sense, seeing as the devil is generally personified as a red guy with horns. \n\nTL;DR: The guy the song is describing is an anarchist masquerading as your friend.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nHe could also be a Darren O Shaughnessy fan, as this song was used in the movie version of three of his Cirque du Freak books \"The Vampire's Assistant\". This song could apply to Mr. Destiny or Steve from those books, as they have been labeled as evil by various people. Steve was labeled as evil by Larten Crepsley, the vampire Steve asked to blood him. Mr. Destiny was labelled as evil by Darren, the main character.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nDoes the man here actually wear red clothes like Larten Crepsley and Seba Nile, since these vampires wear nothing but red clothes?\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nwhen i read this i get the perfect view of satan. the phrasing hes a god hes a ghost hes a guru what does it mean? hes a god, hell he wishes he was thats just satan's biggest desire to replace god and receive his praise from billions of followers. hes a ghost describes satans lack of physical form he cannot appear unto you because his wings were torn off and he was flung off from all other created things. he is the wind invisible whispering in your ear your greatest temptations whatever they may be. this also explains the use of \"money in his red right hand.\" he has money to turn those greedy for it away from the path. now for the guru. a guru is a teacher and satan is indeed a teacher to the wicked he'll teach you things  you shouldn't know. hes in your head and on the tv screen.  hes on the tv screen represented by all the tempting things in commercials and shows he's in your head scrambling your thoughts. through this disappearing land most likely represents america or hell or could just be used for the evil imagery. america is disappearing as it loses its founding values, soon we'll have to rename it. it could represent hell a place never seen yet exists all the same. \"directed by his red right hand\" satan was god all mighty's right hand as jesus is still his left. and he is red because of all the death's his chaos has caused. another way of putting red right hand would be \"directed by bloody satan\".   \"he casts a shadow where ever he stands\" prince of darkness is his second title prince of lies his first. \"he'll give you cars, money, houses.\" my sounds like somebody hit a few liquor stores lately, was it fun? this line represents ill gotten wealth probably from murder and robbery. \"he'll wrap you in his arms\" is a portrayal of his false sympathy.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI've read a few of your views and I thinks some are valid and I agree with the fact that there is a so called \"higher power\". My personal opinion is that it's a political critique of communism. The First verse is so bleak but the ever changing choruses is like a shimmer of light and optimism .This could be a way of saying there is another option to the \"norm\". As the song evolves the versus offer people a chance to improve and be apart of something. Then as the last chorus shows, it is a failure and the man with the \"red right hand\" can't be trusted. Therefore, overall it is how I see communism, a good idea in principle but in practice can never work fairly.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nHe could also be talking about Todd Smith, father of Becky Smith in Darren Shan's book series \"Zom B\". \"He'll wrap you in his arms/Tell you that you've been a good boy (or in this case, girl) He'll rekindle all the dreams/It took you a lifetime to destroy/He'll reach deep into the hole/Heal your shrinking soul/But there won't be a single thing that you can do\". \"You don't have no self respect/You feel like an insect\". Todd Smith is a two faced bigot that forced his own daughter to follow his ways. Funny thing, Nick Cave was mentioned in the first book, as when Becky says that one of her friends is a Nick Cave freak. Anti abortion advocates might not like him because he thinks that even babies are guilty.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI suspected the song is about an addictive substance. Probably alcohol. The metaphor might be comparing drug or alcohol addiction to a getting caught up in organized crime.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nThe red right hand refers to the Dexter Red Hand of ulster heraldry.  It's a symbol that was used by the provisional IRA in the 60's and 70's.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nJust a little insight. Take it or leave it.\n\nI have not read A Room With A View, but I came across this quote by E.M. Forster, from the book: \n \"We cast a shadow on something wherever we stand, and it is no good moving from place to place to save things; because the shadow always follows.\"\n\nThis isn't a huge part of the song but when he says \"His shadow is cast wherever he stands,\" perhaps Nick's saying that this Paradise Lost type, 'old-testamenty' God is an all-pervading presence you can't ignore because the knowledge of his judgement or whatever saturates all life.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nA vampire does not have a shadow, it belongs in fairy-tales & movies. But the guy/creature in the song seems to be VERY real and have a shadow?\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThe man is a recruiter for the IRA (Irish republican army)\n\nThe red right hand is the Red Hand of Ulster, the green papers are the IRA's Green Book, a training guide for new recruits.\n\nThe bittersweet he represents is the pride of belonging to the cause vs the hell of fighting 'the war'\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nIn this song, 'the red right hand' is a metaphorical representation of the financial sector. The money lenders bankers etc who, in our 'want it now' world, can give you what you need to get what ever it is that you want, but always at a much higher price. e.g. \"don't have no money he'll get you some, don't have no car he'll get you one, or \"a shadow is cast wherever he stands, stacks of green paper in his red right hand...the lyrics explain how the poor are encouraged to take a walk away from thier world of nothing, walk past the oppression of their day to day \"smoke stack\" working class lifestyle and to cross the tracks to the other side, to meet the man they've seen on TV,  the one who smiles like a reptile, who will wrap his arms around them and tell them how good and clever they are being in coming to him to make their escapes complete.......but its a trap, they whisper his name in their disappearing land cause he's always there, even in their slums and under his coat is hidden that red right hand...and \"I'm  warning you buddy to turn it off\" cause your only a microscopic cog in his catastrophic plan.....to own everything, including you. Shaking the red right hand leaves you in the red. Shaking the red hand leaves you powerless. Once you shake the red hand you lose your freedom of choice, i.e. if people are being treated unfairly at work, it's too dangerous or their not being paid enough to get by, there is nothing they can do about it if the bank owns most of what they have, because regardless of 'anything' else, the bank must be paid their instalments. If like most you've shaken the red right hand, your employer knows that you can't even afford to strike for a single day let alone a whole week or more it would take to bring them to the table, so they can treat you how ever they like....the red (in debt) right (right wing) hand (a hand can give and take) is a tool of oppression used to make the rich richer, and the poor more exploitable than ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nSeems pretty likely, as others have pointed out, that this song is a juxtaposition between the merciful, benevolent God usually portrayed in the New Testament and the vengeful and often malevolent God of the Old Testament. \n\r\nThe figure represents God. The red right hand is the vengeful hand of God, as it was in Paradise Lost. \"He's a God, he's a man, he's a ghost\" refers to the Holy Trinity. \"He's a guru\" could refer to a number of things, but my interpretation is that it's a reference to post-New Age Christianity and modern spiritualism. The fact that the figure visits hopeless places and offers hope in various forms represents God as the saviour, but the sinister end of each stanza reminds us that for every story in which God is a saviour, there is one in which he is a cruel and brutal justiciar. The punch at the end of the song is fantastic, as God's plan is often used as a message of hope by Christians, but this song reminds us that God is often portrayed as being vengeful and cruel, lending a very sinister undertone to any plan he might have for the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nNot a single one of you understand the beauty of unbelief here! This song is about the addiction to something I dare not mention. The \"red right hand\"? Are you blind, deaf? Mute monsters?@! Don't you see the addiction to things that make you feel like life is ahead of you instead of behind? Nick Cave lost his life! Those prone to his suffering of like kinds understand at least a fraction of \"it\". Don't you see? Are you all that blind? There is death. There is living. All those dreams can be rekindled but by God it's so damn hard. It may be a dream started again, but Jesus Christ when there's something so close to recover you without all the terrible effort, would? The red right hand reaches out to all those in need, but those in need shouldn't grab it. Yet, its the easiest to hold on to. All any one says is its \"weird\" or \"scary\". But you all lie, all everyone ever done without the \"hand\" is rely on their loved ones to \"help\" them When no mortal is left for you, when the Lord is too hard to believe in, where else is left but the soothing of a \"red right hand\"? In Logical terms why shouldn't we just relieve the agony with this? \r\nThat's what I think about the song, but I'm probably retarted and not \"artistic\" enough to understand your \"scary\" views on the subject...\n\r\nPhil\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nToo many simplistic explanations. This song seems to be about \"the mechanics of crime & evil\", both on street level & higher up? And psychological explanations about bad guys-motivations for doing dirt. And politicians seems to be talking/acting on telly, and not doing the lords work, so to speak. Fine song, a modern classic actually. Deep and disturbing. And those subtle \"chuckles\" here & there, not every song has those..\t\t\t\t\n\t\t\t\t\n\n"}