{"comment_0": "\nThis is a really incredible Tool song ! I was fortunate enough to see it performed live. It's a really beautiful and opitmistic song. This song has a commom message among Tool songs: pushing limits and excuse the term, \"maximizing human potential\". An incredible line is that we are \"capable of all that's imagined and all conceivable.\" I find that to be true but there are obstacles in the way. And in the beginning of the song, Maynard sounds as if he's just about to give up. Instead of \"pushing the envelope\",  he's happy with a self-indulgent, pitiful existence. This song has a lot of similarities to Lateralus. Although Maynard never gives you the exact details, \"there is so much more that beckons us\" and if we can't figure that out, then we can \"find peace within the emptiness\".\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nSorry. I forgot to mention that I suggest listening to this song whenever you feel like shit about whatever your into or if you are just feeling overwhelming hopeless. I hope that this song helps you out in the same way it has helped me\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis is my favorite Tool song.  Anyone who says it has no mystical meaning or intention has not plunged into the depths of meditation.  The Buddha himself would be proud of this song, as it reflects the dharma of Buddhism and Hinduism.  The entire album is about transcendence and this is the climax:  Enlightenment\r\nI have come curiously close to the end, down\r\nBeneath my self-indulgent pitiful hole,\r\nDefeated, I concede and\r\nMove closer\r\nI may find comfort here\r\nI may find peace within the emptiness\r\nHow pitiful.  â\u0080¦itâ\u0080\u0099s calling me.\r\nThis is the dark night of the soul.  A deep depression every spiritual seeker goes through.  Eventually we all get to this point where the suffering is so tremendous we start looking for a way to end it.  It is like the divine is calling you to find it.\r\nAnd in my darkest moment, fetal and weeping\r\nThe moon tells me a secret - my confidant\r\nAs full and bright as I am\r\nThis light is not my own and\r\nA million light reflections pass over me\r\nThe moon is a common theme for spiritual teachers.  The dharma is just a finger pointing to the moon.  You grasp at the finger (the teacher or teaching), when itâ\u0080\u0099s as simple as looking at the moon (absolute reality).  In these lyrics, there is an understanding in the subject that the moonâ\u0080\u0099s light is not its own, it is only an illusion; Maya.\r\nIts source is bright and endless\r\nShe resuscitates the hopeless\r\nWithout her, we are lifeless satellites drifting\r\nObviously, the source of light is the sun.  In the allegory of the cave, Socrates uses the Sun to represent pure goodness which is in all of us. It is our divine nature.  We are all that.  We just donâ\u0080\u0099t know it.  The ascent up causes a disorienting blur of the senses and eventually your union with permanent bliss.  If we can remember this, we will never suffer again.\n\r\nAnd as I pull my head out I am without one doubt\r\nDon't wanna be down here feeding my narcissism.\r\nI must crucify the ego before it's far too late\r\nI pray the light lifts me out\r\nBefore I pine away.\r\nTo attain the selfless state, one must kill the ego.  The Buddha taught this constantly, using the word atman which can be used to mean transcendent Self or ego self.  The ego is the illusion of who you think you are.  Enlightenment is the complete destruction of this view.  The light of the transcendent self will lift you out.  Only you can help you.\r\nSo crucify the ego, before it's far too late\r\nTo leave behind this place so negative and blind and cynical,\r\nAnd you will come to find that we are all one mind\r\nCapable of all that's imagined and all conceivable.\r\nJust let the light touch you\r\nAnd let the words spill through\r\nAnd let them pass right through\r\nBringing out our hope and reason ...\r\nbefore we pine away.\r\nThe best lines of the song, the subject realizes truth and the endless possibilities of life.  We are all literally one mind capable of all thatâ\u0080\u0099s imagined and conceivable.  Now he is free and genuinely qualifies as a human being pouring out love and compassion into the world.  He is telling you to let this love (light from the sun) pour and spill through you before you pine away, endlessly longing for something better.\n\n\n", "comment_3": "\nThe first time I ever really listened to this song was when I was in Washington state, on the beach at night and the moon was absolutely full and perfect. The light from the moon was reflection off of the ocean and this song was playing and it just gave me goosebumps. I was coming out of a very shitty relationship and felt very lost. This song on that night really pulled me through, and it's something I will never forget. So no, I don't have an analysis of what the song may truly mean, but I know exactly what it means to me, and I think in some way that is the point of any song, to find out what I means personally to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think that the ego is often outdated for the common person in day to day life in this modern society.\r\nWe are born with the ego for survival, but in todays society, physical survival is quite simple, and the ego often gets in the way. I believe this song implies that to advance, to further develop and evolve, we must crucify the ego.\r\nImagine someone who lets their ego get he best of them, then imagine an incident involving that person if they simply put away with their ego, and it is easy to see how the song is significant.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is about slowly drifting into depression because it feels more comfortable than facing your fears and risking failure when you don't have much to offer.  As he starts slipping, the guy rationalizes that the reason he can't be happy is that he is better than everyone else--that he's above them, so he's much better off alone in his own pitiful hole.\n\r\nAs he's tripping on his self-pity, he's made aware that the moon(his confidant), the brightest, fullest body in the night sky, is simply reflecting the light of other bodies.  Even though the moon provides light to everyone, she has no light of her own.  At that moment, the guy realizes that he doesn't need anything great built-in to himself in order to be full and bright, he just needs to reflect the light of others.  As he lifts himself out of his hole, he immediately realizes that the comfort he felt from his seclusion and loneliness was far worse than the relief he feels out in the open.  Even though it feels comforting to be depressed and accepting of your own sad fate, the relief that you get from rejecting it and rising above it feels much better.\n\r\nThe key here is that the moon was reflecting light, not absorbing it.  Even though she was better off than the guy in the song, she took notice and projected her (borrowed)light to get him out of his hole.  The rest of the song is about living by others for others.  You can't produce anything within yourself to make yourself happy, so you have to share the happiness of others.  You have to crucify your ego and make an effort to reflect light onto others.  The message is basically to follow the Golden Rule.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nSimply on a personal note, I first listenedn any drugs.  And I don't claim they are the \"key\" to understanding the song, or even that it has any relation to this before I'd ever take to drugs whatsoever.  However, I thought I understood it, more or less, but really didn't exactly connect with it.  After my first encounter with psychedelic mushrooms, I listened to it again and it was like I'd literally transformed my interpretation of this song.  Again, I know it probably isn't the same for everybody, but on a personal level I do feel I understand the song a lot better than ever before.\n\r\nMy Interpretation:\r\nI see a man who has come to realize he's disgusted with the person he's become.  He fears it's too late to turn away, he's gone too far, and perhaps he should simply embrace it (the ego, or \"self-indulgent pitiful hole\").  Then, in the pit of his disgrace, he has an epiphany.  The moon, as \"full and bright\" as it is, cannot and does not rely on its own self to be at its \"maximum,\" as it were.  It seeks the light from the \"sun,\" an endless source of energy and life (for this planet, at least).  Just like it, the man should seek guidance, recognize his own imperfections, and accept help from a \"higher order\" (be it reason, religion, spirituality, anything), in order to be truly whole or happy, or reach a sort of enlightenment.  But when you just accept yourself as you are, you're no better than the moon without the sun, just a \"lifeless satellite\"\n\r\nThe man understands, he wants to change what he's become, he doesn't need to sit and simply suffer his 'narcissistic' existence anymore - he wants to be alive.  Now that he truly believes he can be saved from himself, he turns to the audience and gives his sort of testimony and call to action.  He cries out that we join him in a search for truth, to cast our our pitiful judgements of one another, to want something more than simply what we've come to understand in this world.  It's not some contract, X number of years on earth for some heaven after death; rather, it's a promise for a happy life in the now.  This world offers so much more than many have witnessed, and he begs we not spare ourselves its beauty and a chance to see beyond our ego.  Our lives are a journey and there's only so many steps we can take before \"we pine away,\" so don't take it for granted.\n\r\nI don't claim any superior knowledge over anyone who has or hasn't taken any drugs, meditated, gone through life changing experiences, nor is it my intention to give off that tone.  That's what I hear when I listen to this song, and I'm sure I'm not alone. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis is sort of a long analysis, and without an understanding of the concept of the entire Lateralus album, it doesn't make as much sense, but I'll try my best:\n\r\nFirst of all, there's a reason it fits so well with Disposition and Triad. They all tell the same story. Disposition is sort of the beginning of the mind or the soul (I guess you could say the childhood), where you don't have as much experience or knowledge about the world, and you go entirely off of what you're taught. Your knowledge of the world depends on your *disposition* to it, and as such what people \"mention [...] to [you]\" causes the \"weather [to] change\". Reflection, then, is sort of the maturing of the soul, the adulthood if you will, where you begin to *reflect* on your experience. Triad, although being purely instrumental, closes off the trilogy well. I'll likely explain that on Triad's respective page.\n\r\nNow for a bit of a part-by-part analysis of Reflection:\n\r\n\"I have come curiously close to the end, down\r\nBeneath my self-indulgent pitiful hole, defeated I\r\nConcede and (Concede and) move closer (Move closer), I may find comfort here\r\nI may find peace within the emptiness, how pitiful\n\r\nIt's calling me (Calling me)\r\netc...\"\n\r\nThe narrator lives in a self-indulgent, selfish lifestyle. He focuses his life on his own benefit, not on his moral or spiritual gain. He considers it a pitiful lifestyle, but he refuses to do anything about it, instead feeling defeated by it, and tries to find his happiness in what he has, rather than doing something to create his happiness by improving his life.\n\r\n\"And in my darkest moment, fetal and weepin'\r\nThe moon tells me a secret, my confidant\r\nAs full and bright as I am, this light is not my own and\r\nA million light reflections pass over me\"\n\r\nAs the narrator is slipping down this path and losing himself, the moon (a common symbol of the spirit or spirituality) shares with him the secret of a proper life. It being \"full and bright\" means that it is pure and whole. And the reflections symbolise the knowledge and the awakening which he is receiving.\n\r\n\"It's source is bright and endless, she resuscitates the hopeless\r\nWithout her we are lifeless satellites dreamin' dreams\r\nAnd as I pull my head out, I am without one doubt, don't want to be down here soothing my narcissism, I\r\nMust crucify the ego before it's far too late, I pray the light lifts me out\n\r\nBefore I pine away\r\netc.\"\n\r\nThe moon is full of wisdom because it is truly complete and never-ending. It gives him hope and allows him to change, something he thought himself incapable of her, and now he believes himself indebted to her. And when he starts to truly see things, or \"pull his head out\" of his pitiful state, he realises that he no longer wants to be a part of such a selfish world, and wants to be a part of something bigger, which requires him to rid himself of his ego (often also referred to as the self) to become a part of something bigger, before it's far too late to change.\n\r\n\"So crucify the ego before it's far too late to leave behind this place, so negative and blind and cynical\r\nAnd you will come to find that we are all one mind, capable of all that's imagined and all conceivable\r\nJust let the light touch you and let the words spill through, just let them pass right through, bringin' out our hope and reason\n\r\nBefore we pine away\r\netc.\"\n\r\nAnd now he shares his realisation with the listener. He realises that we all must rid ourselves of our no-longer-necessary egos to become a part of something truly great, where all people are one. We are all the same person in different bodies. And if we see ourselves as that and unite, we're capable of everything, but rather because we remain selfish and refuse to listen to reason, we remain negative and blind and achieve very little. So he says that we must all accept this (\"let the light touch you\") and then share it with others to get them to see (\"let the words spill though, just let them pass right through\") until we can awaken the whole world to the true hope in the world, before we all destroy ourselves.\n\n\r\nThis song very much draws on the concepts explained in Lateralus, Parabol/Parabola, and to some extent, Schism, The Patient, and The Grudge. I'd suggest looking into the whole album.\n\r\nAlso, has anyone noticed that the intro to this song (when split into sections based on the introduction of instruments) is nearly the same when you play it backwards? I haven't yet found any meaning to this, other than the connection to the title.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI duuno what HE meant by it but it kinda seems to me that he's saying if you're all wrapped up in self-pity and sadness, mabe it's time to just contemplate your position in the entirety of the human condition and just be glad to just BE.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song is about becoming part of a higher consciousness in any form.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ni think this song is about instead of pulling away from saddness and instead of fighting depression, just leting it all go and fall as deep as one can and by going through the saddness u reach the emptiness where there are nothing that controls u, u are finally totally free to make up your own world, becoming part of a higher consciousness, giving away all temptations, crucifyig the ego. reaching the satate of parabol/parabola. \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nFor me, Tool's contant message throughout both this album, and Aenima, our need to evolve and realize our full potenial as beings of conscious thought. So much is possible to us, so much is in our grasp. Here's where I piss someone off: I think that our next evolutionary step MUST be a conscious process. As long as we live under the yoke of religious morality, the hate, bigotry, and fear of progress, we'll never reach that next step.\n\r\nForgive any typos, my keyboard is...shitty.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthis song helped me lift my head so many times when i felt like i just wanted to disappear and not exist because i was hopeless and lost. the lyrics and the music just want to let me get up and do something good. i have never heard such optimistic and authentic music before(not to mention from tool)!!! and the following instrumental (triad) is just like an impulse saying: get your ass up and do something!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nTo me, this song is probably the biggest \"Fuck You\" to the fans Tool had gained from AEnima... Also, the end of the song Reflection as well (The \"I don't want to be down here soothing my narcissism\" and the \"So negative blind and cynical\" lines)\n\r\nMaynard is almost in a sense admitting that he was being a negative-nancy with Tool's previous albums, and he looked down on all the 'average' people in the world around him because it made him feel superior (his narcissism) - if you take the narration in Reflection literally, then this is exactly what he is admitting.\n\r\n\"Reflection\" is almost the sequel to \"The Grudge\"\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nNemesis heard this prayer and sent Narcissus his punishment. He came across a deep pool in a forest, from which he took a drink. As he did, he saw his reflection for the first time in his life and fell in love with the beautiful boy he was looking at, not realizing it was himself. Eventually, after pining away for a while, he realized that the image he saw in the pool was a reflection of himself. Realizing that he could not act upon this love, he tore at his dress and beat at his body, his life force draining out of him. As he died, the bodyless Echo came upon him and felt sorrow and pity. His soul was sent to \"the darkest hell\" and the narcissus flower grew where he died. It is said that Narcissus still keeps gazing on his image in the waters of the river Styx. (wiki'd that shit up)\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThe moon tells me her secret. This light is not my own. I am a reflection of God, as the moon is to the sun. Without the energy that God (the Source and Creator) has blessed us with that flows through all of us (that animates us), we are lifeless satellites with no ambition or greatness, just shells of our true Selves. Realize your true Self and do what your meant to do in this world before its too late. Humanity is in a bad position right now and if everyone does what they are put on this Earth to do then the world can progress to the next level of existence. And to find peace within the emptiness? Materialism and the pleasuring of the senses. Its like when you buy something new, like a new car, or tv, or speaker, or whatever; you want it so badly but when you get it, its like its not big deal anymore. This world is the world of illusion and all the money and possessions are worldly and therefore empty and in truth, worthless.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nsounds like the lure of loneliness and the destruction of your confidence and as you slip into dark there is a light of hope so in the end its deciding to leave the past and all its negativity behind and move on before i becomes its own destruction\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nits as if your all copying each other lol in a good way. and why does 'good' has one less 'o' then 'god' lol\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ngo google the story of narcissa then listen to the song again. kinda funny seeing what everyone else made of the song. it's about the ancient greek myth about narcissus seeing his own reflection in a pool by moonlight and drowning in it. drowning in his own image, his ego\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nIn my opinion, the song is not as mystical, drug related, or dark related as one would think. I believe it's actually about being praised for one's talents and succumbing to one's inevitably growing ego. Coming \"curiously close to the edge\" is coming close to succumbing to it (the praise) and living in a \"self indulgent hole\" (fueled by the praise). Then in an epiphany (moon's secret), he realized, although he is a bright and shining light, the light is not his own. He (or the character sung about)didn't do anything but follow in the footsteps of others. If one would want to look at it from Maynard's point of view, yes he's a talented singer with deep, thought provoking lyrics, but he wasn't a sole creator so to speak. He understood that he stood on others shoulders to get where he was; creators of music, the electronic equipment used, media attention. This is what is meant when he says \"we are all one mind\". It's not mystical or anything. It just means that we build off one another. Nobody created anything without the help of previous creators. So you should crucify your ego because you haven't done anything others haven't helped you with. It's pretty deep and one of there best songs if you ask me. Of course, if you have created something completely new and inventive then yea, you have every right to be an arrogant prick.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nEveryone says that interpretations of Tool linked with LSD and other drugs like that are just assuming that Tool are obsessed with the stuff, but hear me out here. \n\r\nIt seems to be a bad acid trip, which induces ego death in the guy tripping. This will be long...\n\r\nFor a start, the first 5 minutes sound completely unnatural,somewhat alien. Then;\n\r\n\"I have come curiously close to the end, down \r\nBeneath my self-indulgent pitiful hole, defeated I \r\nConcede and move closer, I may find comfort here \r\nI may find peace within the emptiness, how pitiful\"\n\r\nI hear a troubled man who has taken acid or something similar, and it hasn't gone well. In the peak, it is pure hell, hence \"curiously close to the end\". He can feel his destruction coming. He is trying to act curious about it, trying to make sense of it all, but he is breaking down. He attempts to embrace it (\"Concede, and move closer\") but thats not working. It's destroying the light inside him, taking it away. He somehow barely understands that the flawed experience is probably part of him, old experiences which cause him pain, that he may have been trying to escape.\n\r\n\"And in my darkest moment, fetal and weeping \r\nThe moon tells me a secret, my confidant \r\nAs full and bright as I am, this light is not my own and \r\nA million light reflections pass over me \"\n\r\nHere the moon seems to be actually talking to him (probably to do with the fact he is tripping balls) and those last two lines are what the moon says. A confidant is someone you trust and aspire to, and in that context it makes sense. He is told that even though the overwhelming fear he feels seems like it is ripping his light away, he is like the moon, all illumination from another origin. His soul and thoughts are not really his own, just part of a universal consciousness, and he uses this to remind himself that the fear cannot harm him.\n\r\n\"It's source is bright and endless, she resuscitates the hopeless \r\nWithout her we are lifeless satellites dreamin' dreams\"\n\r\nThis source is the universal consciousness I just mentioned. I get this idea from a Bill Hicks quote which is actually quoted in 'Third Eye'; \r\n\"Today, a young man on acid realized that all matter is merely energy condensed to a slow vibration â\u0080\u0094 that we are all one consciousness experiencing itself subjectively. There's no such thing as death, life is only a dream, and we're the imagination of ourselves. Here's Tom with the weather.\" \r\nThe man has this realization and this singular consciousness becomes his source of hope in this terrifying state. With concepts taking place in mind, his state begins to change.\n\r\n\"And as I pull my head out, I am without one doubt, don't want to be down here soothing my narcissism\"\n\r\nHe begins to touch base with the new reality he has conceived. He wants to come back to the sane world, he wants to live a  new life, he wants to leave the troubles he obsessed over behind. \n\r\n\"I must crucify the ego before it's far too late, I pray the light lifts me out\"\n\r\nHe realizes he can do this in his state, and that he needs to do it right there and then, or he may never make it out of this hellish state. He needs to confront and battle these demons or they will never leave him alone. He prays he will win and resurface from hell after...\n\r\n\"Before I pine away \r\nBefore I pine away\r\nBefore I pine away\r\nBefore I pine away\"\n\r\nHe feels the fear that he may actually never get to see this new life. He might become a vegetable, and end up thinking he's a sunflower or something...\n\r\n\"So crucify the ego before it's far too late to leave behind this place, so negative and blind and cynical\"\n\r\nA simpler version of what I've said before. He needs to kill the part of him which worries so much over the superficial parts of life which made him \"negative and blind and cynical\", to accept the past and move on and out, because that is the only way to escape this state of mind which is essentially his old life and state of mind collapsing down onto him.\n\r\n\"And you will come to find that we are all one mind, capable of all that's imagined and all conceivable\"\n\r\nAlmost a recital of that Bill Hicks quote, he is reminding himself that in truth he cannot be harmed, he can move on and will make it out.\n\r\n\"Just let the light touch you and let the words spill through, just let them pass right through, bringing out our hope and reason\"\n\r\nHe is using the belief of one consciousness to draw himself out, and drawing from it to help give him the strength, to endure, and to wake up.\n\r\n\"Before I pine away \r\nBefore I pine away\r\nBefore I pine away\r\nBefore I pine away\"\n\r\nThe trip seems to fade. It seems unresolved how it ends, whether he made it out to appreciate his life like he hoped, or whether his past state of mind crushed his thoughts and he lost his incarnation of consciousness, or if he was absorbed into the singular mind, waking up from the dream leaving a shell behind. If it was biographical of MJK, well he obviously made it out didn't he?\n\r\nMy long-winded interpretation. Beautiful music however you take it!\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThe ego is the source of all suffering. Simple as that. Banish the ego, and all the allusions to suffering in this song would not exist.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI agree it seems alot like recovery  spirituality  like honesty and emotional awareness!!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThe song is about his spiteful past view of the world in general. He hated everything about the world, and he is trying to let these angers and hatreds leave him before its too late and he wastes his one opportunity to live.\n\n'So crucify the ego, before it's far too late\nTo leave behind this place so negative and blind and cynical,\nAnd you will come to find that we are all one mind\nCapable of all that's imagined and all conceivable.'\n\nIn summary, let shit go. Kill your ego.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nAs of my own interpretation of this song;\n\nâ\u0080\u0098\nI have come curiously close to the end, down\nBeneath my self-indulgent pitiful hole,\nDefeated, I concede and\nMove closer\nI may find comfort here\nI may find peace within the emptiness\nHow pitiful \n'\nAnd as I lose hope in myself as well as the world, I feel like a failure, I am getting used to this depression, this lifelessness, this failing of utter failure, I acknowledge that itâ\u0080\u0099s â\u0080\u009cpitifulâ\u0080\u009d.\n\n'\nAnd in my darkest moment, feeble and weeping\nThe moon tells me a secret, my confidant\nAs full and bright as I am\nThis light is not my own and\nA million light reflections pass over me\nIts source is bright and endless\nShe resuscitates the hopeless\nWithout her, we are lifeless satellites drifting\n'\n\nMost of us share a feeling, a feeling of failure in comparison to others, this is mostly because we view flashes of their lives, the success of their lives, but when it comes right down to it, when we get to know those who we look up to, they â\u0080\u009cthe moonâ\u0080\u009d explains how his success is more accredited to othersâ\u0080\u0099 help â\u0080\u009cA million light reflections pass over meâ\u0080\u009d  than his own efforts, and how this source (othersâ\u0080\u0099 help) is an endless source who revives us and helps us prosper, without the help of people we are â\u0080\u009clifeless satellites drifting`â\u0080\u009d wandering aimlessly.\n\nâ\u0080\u0098\nAnd as I pull my head out I am without one doubt\nDon't want to be down here feeding my narcissism.\nI must crucify the ego before it's far too late\nI pray the light lifts me out\nBefore I pine away.\nâ\u0080\u0098\nAnd as I come to this realization, this epiphany, I understand that to proceed with my life I need to destroy this selfish desire to proceed without others â\u0080\u009ccrucify the egoâ\u0080\u009d, to live life as a competition, to fight over whoâ\u0080\u0099s better and instead live harmony and in a egalitarianism-oriented lifestyle. I, as well as others, must do it fast before the (minimalistic and colossal) wars destroy us. \n\nâ\u0080\u0098\nSo crucify the ego, before it's far too late\nTo leave behind this place so negative and blind and cynical,\nAnd you will come to find that we are all one mind\nCapable of all that's imagined and all conceivable.\nJust let the light touch you\nAnd let the words spill through\nAnd let them pass right through\nBringing out our hope and reason \nBefore we pine away.\n â\u0080\u0098\nSo kill your ego, your selfishness, your competitive side, your arrogance, before you drown far too deeply to be saved, to leave this mindset, this mindset where you are alone in the world, this sad, pessimist mindset, and when you do you will realize that we are all the same, egalitarianist again, together we can achieve everything that we can wrap our heads around, to bring about a new sense of hope and understanding.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nanother amazing song about the third eye. \t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthe only way to understand this song is to hear it live. tool are true artists. i have never heard such emotion conveyed through song and lyric in such a powerful way before.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI agree totally, i saw this song live on Saturday nite ( auckland, NZ ) and it lifted me 50 feet above the ground. what a great piece of musicianship, by 4 brilliant musicians\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nSpiralout has nailed it.  After coming out of a severe depression, you deffinitely feel \"reborn\" with a higher consciousness\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni believe that this is the most bueatiful and spiritually important song i have ever heard.rise above the illusion of pain and suffering and realize the inter connectedness.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nthe 'third eye' of the lateralus album. what an epic.\n\n\n", "comment_31": "\nSo true stayhuman, this song is amazing, I didn't think that much of it until I stoped fiddleing and closed my eyes, and just listened to the intertwining melodys and emotions. I tells ya, the images that this song brings to you is icredible, there is no other song that has done this to me with such power and control. But the best thing about it is (like most good songs, but reflection more than anyother) it starts off making you feel one way and leaves you feeling something totaly different. What an epic indeed.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nthis is truly a masterful and beautiful song. it instantly sinks me into a relaxed and poetic mood. i am completely void of anger and i can look at aspects of my life in a different light. The line \"...we are all one mind, capable of all imagined and all conceivable\" is the most meaningful and powerful statement that i have heard in awhile. i had the previlage to see Tool live so i can tell you how captivating and how charismatic Maynard is. His lyrics have inspired and influenced my own writing greatly and he is a man to be respected, to say the least.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI would have to agree with Parabola898. Reflections translucent rythms and mezmorizing  drum beats are almost hypnotic. it sets me in a mood of peace and spiratualistic happiness. To me the strongest meaing of this that we are all one mind capable of all thats imagined and conceivable. I think when Maynard is peaking to his listeners followers, and he is tellign us to \"crucify our ego before it's far too late to leave behind this place, so negative and blind and cynical.\" To me it makes sense that he is telling us we need to leave behind our current state of consciousness and evolve into our next state. \r\nMaynards lyrics are so open to interpetation that tools music can relate to everybody. Tool is for anybody who can truly appreciate great art.\n\n\n", "comment_34": "\npardon me shitty typing\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nMaynard has said that he believes information is pure, and people merely reflect it in different ways. Something you know is not your own knowledge, simply a truth that you are aware of, that you might reflect onto someone else. A person taking credit for their knowledge of something would be like the moon taking credit for the light it shines, even though it's the sun's light, not it's own. \"The moon tells me a secret, my confidant \r\nAs full and bright as I am, this light is not my own and \r\nA million light reflections pass over me. \" The light(information) is not our own, it's simply something for us to pass on, and to realize this we must \"crucify our egos.\" \"Just let the light touch you and let the words spill through Just let them pass right through, bringin' out our hope and reason\" is saying that if we all except information and knowledge(light) as truth, not our own, and let it pass through us(learn, teach) we can really understand the world and bring out our hope and reason. I'd say I'm 99% sure this is what is meant by the song. Maynard has said a lot of this in interviews he's given.\n\n\n", "comment_36": "\nThis song is one of Tools best, when you listen to this song you become able to \"reflect\" on your life and can help you to crawl away from depression.\n\n\n", "comment_37": "\nThis song to me is maynard talking about how he has come to close to wanting to know what death is like. And that he has had to have lots doubts and reflection over death. and he hopes he hasent gone to far into the state where he dosent belive in god and hes contradicting himself and hoping that if a god or god (the light passing over him as in the song) will pull him out of this state and still except him into a higher level of life which is heaven. thast my opinion anyway, tool fucking rules. \t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI think this song means that we should drop our pride...\"stop the hate\", if you will. If we all work together as one we are \"Capable of all Imagined and all convceivable\". But I'm not exactly sure...\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThe views that everyone has expressed are truly depth felt and beautiful, as I'm sure Maynard intended his audience to come forth. This song is my ultimate favorite on Lateralus. This album is the masterpiece of Tool's collection; it's pure beauty and gorgeousness. This is the track that is on repeat late at night when I'm in the car and the wind's in my hair.  My mind and thoughts just flow with its rhythm.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThe last words \"before we pine away\" are sang in the end with such a passion, it,s awesome. \"pine away\" might mean \"before we end up destroying ourselves\". \t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI believe that what everyone here has said...is basically what I believe concerning this song. Its just one of those songs that you can listen to sort of get you out of a rut. I know this song has helped me....I am a decent music fan and a weak expert at best when it comes to knowledge and or expertise of music. However, I will say that Lateralus is my favorite CD of all time and Reflection my favorite song of All-Time!\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nSorry guyz,but i think all of u look way too deep into Tool's songs.Maynard kinda says it in Lateralus.\"Over thinking over analyzing separates the body from the mind\".Think about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nTo me this song is following the same theme as Forty Six & 2.  It's saying that we, as a spiecies must learn that we are all one mind and learn to live together before we can evolve to our next level of conscienceness.  \n\r\nAnd in my darkest moment, fetal and weepin' \r\nThe moon tells me a secret, my confidant \r\nAs full and bright as I am, this light is not my own and \r\nA million light reflections pass over me \n\r\n\"It's source is bright and endless, she resuscitates the hopeless \r\nWithout her we are lifeless satellites dreamin' dreams \r\nAnd as I pull my head out, I am without one doubt, don't want to be down here soothing my narcissism, I \r\nMust crucify the ego before it's far too late, I pray the light lifts me out \"\n\r\nhe is saying that none of us are great on our own.  as beautiful and bright as the moon is, the light is not its own.  it takes millions of rays from the sun reflecting off of it to make it bright and beautiful.  once we realize that we are all the same and that we need each other we will eventually be able to do anything imaginable.  we need to learn to get rid of our pride and ego because they are the very thing that is stopping our evolution.  this has a lot to do with Carl Jung's theory of 46+2(im not even going to attempt to explaing.  if you wanna know and have about 2 hours to read go here innuendocornecopria.com/…)\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\n\"Sorry guyz,but i think all of u look way too deep into Tool's songs.Maynard kinda says it in Lateralus.\"Over thinking over analyzing separates the body from the mind\".Think about it.\"\n\r\nwhen maynard says that he means that we get so caught up in the small things in life that we fail to see the big picture.  he isnt talking about something like trying to find out what a writing means to you.  thats the base of tools songs.  you listen to songs like this and 46+2 and you realize how much he analyzed things he has read, trying to discover how it applies to him and how it can positively affect him.  \n\r\nalso when you take into consideration all of the lyrics in Lateralus you can see that he means instead of thinking about all the risks and dangers just do what your heart tells you.  your mind is so worried about the minor details that it wont let its body act on instinct.  hes saying take risks, push the envelope and you may go somewhere no one has gone before.  he definitely encourages thinking.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nMJK's voice is really melancholy when he sings this song and that adds to the beauty of it. I always thought it could be about how he doesn't want his ego to become so huge just because he is in a band. But that is a too simple song meaning for Tool so it's probably somethingmuch more complex.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nthis is a long/deep song, hehe\n\r\n\"So crucify the ego before it's far too late to leave behind this place, so negative and blind and cynical\"\n\r\nhe talks about liberating himself from ego, and in an interview he commented:\n\r\nMaynard: \"If you look at the cycles of the moon, it starts as a thin crescent and then gradually waxes until it becomes full; then it gradually wanes back into another crescent and then it is gone. The moon reflects sunlight like humans reflect information. We wax and wane and when we become full moons, our egos are full. We think we have this knowledge when in fact, the information we have is pure. And how it reflects or shines off of us, is something we take credit for as though the moon could take credit for its brightness when, in fact, it is only reflecting light from the sun. We have to understand that we are ego-less just as the moon is without light. It and we are simply reflectors. The ego is not responsible for the information. It can reflect the information in creative ways, but the information itself is pure\"\n\r\nWell what does this mean? Maybe be humble and liberate yourself from thinking big about yourself, since you're just a temporary carrier of the knowledge u have attaind. This reminds me of an expression in buddhism called Bodhichitta, the state of metal awakening...\n\r\nWe really just obtain information in it's purest form, then it is up to you if you abuse this information, twist it in creative ways and do whatever with it, but from the beginning, it is just the reflection on you from it's origional source, like moon in only shining from it's origional source, the sun...\n\r\nLike people say...Maynard James Keenan is god...and if not, atleast an enlightened buddha of the music industry =]\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThis is definitely one of the most amazing songs I've ever heard in my entire life. I saw it performed live for the first time 2 nights ago, and I've never had such a wonderful feeling while listening to a song. Definitely one of my favorite Tool songs ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nThe album Lateralus is a tale of a breaking up of a relationship, as far as I can tell of any type, but particularly honing on on your loved one. The albums follows a plot, The Grudge is fairly self evident as to it's meaning. Then The Patient :\n\r\nIf there were no rewards to reap,\r\nNo loving embrace to see me through\r\nThis tedious path I've chosen here,\r\nI certainly would've walked away by now.\r\nGonna wait it out.\n\r\nThen on to Schism:\n\r\nCold silence has a tendency to atrophy any\r\nSense of compassion\r\nBetween supposed lovers\n\r\nThen Parabol, which obviously means the shape formed by a quadratic graph, in other words the turning about from the breaking up, and perhaps coming back together. \n\r\nWe barely remember what came before this precious moment,\r\nChoosing to be here right now. Hold on, stay inside...\r\nThis body holding me, reminding me that I am not alone in\r\nThis body makes me feel eternal. All this pain is an illusion.\n\r\nSo far I am not sure of the relationships of Ticks & Leeches and lateralus into this, in fact I don't believe there is one, they are stand alone songs.\n\r\nThen we get back into Disposition, and of course, relection. The Reflection is fairly specific, the overall metaphor that he sunk into a hole at the beginning of the break up, and her light is lifting him back out as they are reunified. And I believe Maynard truly means Unity, as he clearly indicates that there can not be an ego in a relationship.\n\r\nAs with most tool songs, there are many different ways to read into this. I choose this one, and to me it seems the most beautiful and enlightened of them all, and judging by Maynard's penchant for writing about relationships, I tend to favour my theory.\n\r\n:D\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\ntool does not sing about love, compassion, or sex, people, that is only their illusion. this song, as i posted unter Disposition, is about a tree, that doesnt want to go back thru the circle of life by entering the ground again, but wants to become a higher consiousness, and leave its physyical self, and it also ties into us, wanting to become free and to evolve, before its too late. Project into the astral, and dialate the pupil of your eye.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nyea whiteout is right most songs that you think tool rights about sex or love really has a deeper metaphorical meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nall this talk about higher conciousness, i think this is maynard definately talking about the higher conciousness, goes well with 46&2\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nthis song i think is probly about maynard being happy being in his misery\r\nthen he realises while looking at the the moon that we are all but reflections of the sun and it gets all complacated after that :)\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nquote:\n\r\ntool does not sing about love, compassion, or sex\n\r\n1) That's a stupid blanket statement that could get you in a lot of trouble :) Christ, I can't actually believe you said that.\n\r\n2) As I said, my interpretation of it is just that. Mine. I offer it here only as perhaps guidance to those looking for a meaning themselves. Unless it is vetoed by Maynard himself, how can you say that my meaning is wrong?\n\r\nquote:\n\r\n Project into the astral, and dialate the pupil of your eye.\n\r\nSponge.\n\r\nYou take in snippets of what tool is about and divulge it at your will. Just because through the use of DMT, acid, and fuck knows what else Tool can experience certain things out of our reach, it does not mean that they are the strict path to follow. Their music, as I see it, is a way for them to help other people to think for themselves, and, indeed, question authority :). It is not for them to buy a hoody, go to a concert, and become some bullshit pseudo-intellectual holier-than-thou moron who can repeat the same old crap over and over again without actually knowing what it means.\n\r\narf.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nall those who think that lateralus is a tale of love or sex and anything like that are wrong....in an interview maynard said that during the process and writing of lateralus he hasn't FELT anything...but KNOWN alot!!!let me explain the meaning of this song(this is only my opinion)\n\r\n in this song maynard explains no one is better than anyother.....no one has any superiority over the other!!!some ppl who are so proud of their knowledge and intelligence keep bragging about it...INFACT...the truth is that they might have obtained that information from some one else....all the powers given to us are given by God....no one shud have any ego or arrogance due to his better knowledge....i have learnt many things from many ppl and i spread the word into other ppl who think i thought about this myself.....\n\r\n the moon which starts from nothing to a full moon and then cums back to nothing again....it REFLECTS the light of the sun....so thats not its own....untill we keep communication wid each other...we will always be in a shape of a full moon but the moment we lose our communication skill we will cum back to nothing...tv shows us only half of the story...but when we tok to different ppl we share evrything not the half!!!we must crucify our egos and the thinking that we are better than any other human being...we all all the same....and not to forget THINK FOR URSELF,QUESTION AUTHORITY is another message in the song!!!!what do u think of that,guyzzz????\n\n\n\n", "comment_55": "\nAs most people know, Disposition, Reflection, and Triad were originally one song that got broken up into three pieces. I think that these three songs fit better as one, because it flows so very well, and the individual titles fit with the one that would have been: Resolution. Think about it, with a problem, or a thought process you start off with a particular disposition, and you \"watch the weather change\" as you ponder it, and you have a reflection, and make a decision. Triad is an amazing piece that ties the entire album and thought process together, with one final 8 minute blast of emotion. And then you're left with a stunning silence before the closing track of the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\ni love this song, the feelings it brings to me is ineffable, mjk is such a genius in a way he delievers feelings and messages\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThis song is saying that to become better people we all need to \"crucify the ego\". This song is about making the world a better place, and not letting negativity bring you down. It's a very valid statement considering what is going on in the world right now. \n\r\nXXX\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nBeautiful song, I don't have much to add on top of the above comments.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis song sounds like contimplating suicide in the beginning. \"I have come curiously close to the end\" But turns more hopefull near the end \"bringing out our hope and reason\" Maybe it's about overcoming negativity. I think that's a lot of what Lateralus is about. Tool is evolving and shedding it's negativity and cinicism from the earlier albums. I'm impressed that so many Tool fans don't have a problem with that. I kind of figured that a lot of Tool fans were dumbass death rockers. But Tool is more widley listened to than ever. So metal doesn't have to have negative themes to be damn good music.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nWhen he said ego, I didn't really think about pride. I thought about the Freudian concept of the term. \n\r\nSigmund Freud, a psychoanalyst, divided the mind in to 3 parts: The id, the ego, and the superego. The id is the part of the mind that demands satisfaction, no matter the consequence or situation (ex. a thirsty infant). The superego is the part that upholds your morals (ex.  your conscience and ideals). The ego is what realizes that immediate gratification isn't possible, and suppresses urges until they can be sated (ex. going to the refrigerator when youâ\u0080\u0099re hungry).\n\r\nIt seems to make sense because he called his â\u0080\u0098self-indulgent holeâ\u0080\u0099 pitiful. Which may mean that heâ\u0080\u0099s become disgusted with his excessive indulgence. But then I thought that if you destroy your ego youâ\u0080\u0099d probably indulge more. \n\r\nThe lyrics say that the end is â\u0080\u0098beneath my self-indulgent pitiful holeâ\u0080\u009d. If you wanted to convey the transcendence of indulgence, youâ\u0080\u0099d probably say that â\u0080\u009cthe endâ\u0080\u009d was above the hole.   But Maynard uses the word below.\n\r\nWith this in mind, I read that the ego is ruled by the â\u0080\u0098reality principleâ\u0080\u0099. If you think that your urge is impossible to satisfy at the moment, youâ\u0080\u0099ll focus on it until it is. (ex. when you really have to take a piss). But if you realize that you are â\u0080\u0098capableâ\u0080\u0099 of gratifying your self and you let the desire â\u0080\u0098pass right throughâ\u0080\u0099, you wont waste your time â\u0080\u0098piningâ\u0080\u0099 for gratification. Instead, you have it. And in being free of this strong internal desire, youâ\u0080\u0099ll have more reason because youâ\u0080\u0099re free from this one negative impulse. \n\r\nUnfortunately, we have a lot more than just one desire. Weâ\u0080\u0099re taught that gratification is a dirty thing and that the only way to be pure is to deny our impulses. To me, the song means that people, being caught up in reality and their desires, canâ\u0080\u0099t realize their true potential. To reach some ultimate truth, you need to rid yourself of desires. And the only way to do that, is to act on them.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nThat's a great theory ilikepork. Unfortunatly anyone who listens to linkin park is someone of low musical taste and therefore most likely low intelligence. Ergo your theory is wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nThe guitar solo in this song about 7min 35sec is absolutely overwhelming...\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\neqb unless you were joking you should pipe down i think.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI cant believe none of you have found the actual meaning. If you have read any Greek mythology Reflection is a lyrical reteling of the story of narcissus. In the myth narcissus is the most beutiful male in the entire world and no matter who tried to love him, no one was good enough, (in his eyes). For his pride (or ego) the gods made him fall in love with his own reflection. There he sat for his entire life staring back at his own face. He eventualy pined away to nothing, leaving behind the flower named after him. The greek myth says word fo word \"he pined away\". The story fallows the song exactly and there are key phrases from the myth that are included in the story. In a way you are right since the word narcissisum is derived from this story, which means a deep love for ones self. Maynard is telling us to crucify the ego and become free of our self but none of you had it right. and you call yourselves Tool fans!\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nMy personal opinion this song goes back to maynards original messages in 4 degrees and Opiate, that evanglists and people who have used the church for their own doing have corrupted it and created a divinity out of jesus and god, where as jesus was just supposed to be a role model, a man who acheived spiritual enlightenment, as opposed to the god as we refer to him today. I did note the relation to Narcissus though, and i think that is used to relate my previous idea. but what ever that's just my opinion, you never can tell with tool. this song could be about beating up midgets as crazy as maynard is.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nI'm not sure if anyone has said this yet, but i think there may be a mistake in the lyrics posted on this page. Where it says \"Don't wanna be down here, soothing my narcissism\" i think it may be \"You wanna peer down here, survey my narcissism\" ... i always thought it was the first one, except i looked up the lyrics once and it said the latter instead. I was sure it was wrong so i listened again and again... and it turned out that \"You wanna peer down here, survey my narcissism\" was right! as far as i could tell... what do you all think?\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nalso... i think it may be \"self-indulgent pitiful WHOLE\" not hole\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nIn response to telepanedium462s comment, I can see how this information is relevant. I'm not going to tell you all the \"definite\" meaning of the song, as like everyone else except maynard himself, i have no idea. Although i do see your point, i find it really hard to believe that tool would take a classical greek myth and re-work it into a song. Most of Maynards lyrics and drowning in allusions to obscure beliefs, knowledge and literature. I believe that these references aren't the actual meaning of the song, but a device used to help convey Tool's own unique message. In other words, any parallels between Reflection and the story of narcissus don't exist because the song is a retelling of the story of narcissus, but because the story relates to Tool's own message, and can be used as an aid in conveying it. Well, that's my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI have a question regarding all tool of tool's songs, could you consider them literature like you would a novel or a poem?  Are they any ones specifically?\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nYes\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nYo Everlong get ur lyrics right its \"Without her we are lifeless satellites drifting.\" not 'dreaming dreams'.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nA very powerful song indeed.  I love the sound behind it.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI think it is about reaching a new level of self-awareness and acceptance. Instead of dwelling on the depression that you feel, you accept it and know that there is much more out there in the world other than your conscious state of mind; hence \"crucify the ego.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI was reading something further up about this song being about relationships or sex, and how enlightened that viewpoint is. To me, sex and relationships are ALL about the ego- and this isn't good or bad, it just IS. In a sexual relationship, all we are looking for is someone who reflects are own ego back to us. This is really narcissicm, if you think about it. It's normal, but I think there is more to this song than just romance.\n\r\nBeing an Aquarius, I for one would be so disappointed if all these songs were about sexual relationships. We are all one, there is so much more. True enlightenment is loving all of humanity, even the homeless guy on the street who can't affort Tool tickets.\n\r\n The idea of posessing and being possesed by someone, or saving or being saved by someone, or being \"special\" in the eyes of your \"precious\"  is not enlightenment, in my opinion. Yes, there can be love between 2 people, (I'm happily married) but our society is so sick when in comes to this kind of love- people cling to each other so desparately like there will never be enough love, and if they don't get it from their partner, how quickly it turns to hate! \n\r\nTalking about sex or romance turns all this beautiful music into just another porn movie  chick flick- take your pick. They are about the same in the end.  I hope there is a transcendent love present when large numbers of people get together for a tool concert. If Maynard were just writing about just his girlfriend, it would be so fucking banal and anticlimactic, after all that talk about us all being one and capable of anything. How can one even listen to a typical love song after hearing this stuff? It's like peering into the beyond, and then you have to go about an ordinary existence- Love songs are about the narcissistic need to breed and become immortal, in the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nthis is the most positive song tool has ever made! there were lines that were hopeful let's say... but the anger, disappointment, etc. always came out somewhere in the lyrics... but this one is really pure... \n\r\ntool is my favorite band for years. but i also think that it is time to take conscious breaths, let this rage go and concentrate on more enlightened lyrics. \n\r\ni hope \"lateralis\" was just a milestone on this way...\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nLateralUs\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nAnother one of my favorite songs.\n\r\nI have come curiously close to the end... We've come around full circle.. Though I have $353452345, Brad Pitt looks, women, cars, and all other material things I'm sad. \r\nThis 'forgien' idea that we are all one comes to mind. Even though I have all these neat things I'm just not happy. But something is telling me to give it all away. I concede, I give up all my worldly possesions. I may find peace withing the 'emptyness.' It's calling me. It's undenyable. Within my darkest moment.... The moon/the light tells me a secret... As full and bright as I am... All the things I have, it's not mine. The light/the source has given me everything. My looks/money/material things. But 'without her' we are no more significant than a rock. And as I pull my head out... Don't wanna be down here serving my narcissim. I don't want the material world. Crucify the ego. Life is about loving each other, etc.... True joy is what we can't buy. Before we pine away.\n\r\nAnd you will come to find that we are all one mind. We breath the same air, drink the same water, and are made up of the same stuff that Jesus, Buddah, Mohammed and all the other great people in history are made of. We are all divine.... Etc.... But we must realise this before it's far too late.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nI'm...not going to bother reading through these descriptions.  But somebody say, \"you look way too deep into tool's lyrics\".  Whoever that was, I laugh at you.  You can't look too deep into poetry...there is no \"too deep\" unless it's something that might hurt you or someone else.\n\r\nAnyway, I don't care about the \"big picture\" because everyone's already mentioned it.\n\r\nI am wondering if anyone else feels slight connections to astrology.  This is my subjective view.  When it says, \"in my darkest moment, fetal and weeping, the moon tells me a secret, my confident\", I kind of relate this to my own natal moon placement (that being in the twelveth house).  Because it's the emotions sort of hidden in the unconscious, and when I am depressed that is where I go, and that is where I find my solace, when my imagination is tapped by my loneliness and melancholy, and I can explore anything there.  And then the next two lines are informing that these thoughts-these messages that end up coming through the imagination, communicating to you, and then through you, once expressed, don't actually come from you, but you're merely the mediator, and there is something much greater.  I think that's really beautifully put there.\n\r\nAnd, as a wannabe-writer, I love this line: \"Just let the light touch you and let the words spill through\" and so on...it's really all a beautiful explanation of this great heirarchy of creativity.\n\r\nI just love this song and relate to it so much, because of my natural tendency towards melancholy, and the peace I find in it (comfortable sadness...could consume you so easily).  Ironically of course, the song helps me be melancholy.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\n\" by myusernameisthis on 03-07-2005 @ 01:17:17 PM\r\nLateralUs \"\n\r\nHoly shit!!  Yes!  *is hit in the face*\r\n>.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\n\"It's source is bright and endless, she resuscitates the hopeless\r\nWithout her we are lifeless satellites dreamin' dreams\r\nAnd as I pull my head out, I am without one doubt, don't want to be down here soothing my narcissism, I\r\nMust crucify the ego before it's far too late, I pray the light lifts me out \"\n\n\r\nThis part of the song is most interesting to me without \"her\" it is from Maynards perspective this closely relates Qabala which is the tree of life i think MJK is refering to the high priestess who is the guadian of the temple of the mysterious. First stage of contact between human and the divine worlds\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nthis song is about how we have to realize that we are all conected to The Collective Unconcious which is exactly what it sounds like it is\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nsometimes the ego is just too damn high, we all have moments like this were we feel realy great and THEN we are faced with reality for some reason and you cant hold that ego enymore...\n\r\n\"I have come curiously close to the end, down\r\nBeneath my self-indulgent pitiful hole, defeated I\r\nConcede and (Concede and) move closer (Move closer), I may find comfort here\r\nI may find peace within the emptiness, how pitiful\"\n\r\nif this happends its time for  some reflection my friend\r\nyou need to understand that you are not better then all the others, you need to know that the light you hold it is in fact bright but it is not your own...you have to be modest even in your best moments were your ego is realy high.\n\r\nAnd in my darkest moment, fetal and weepin'\r\nThe moon tells me a secret, my confidant\r\nAs full and bright as I am, this light is not my own and\r\nA million light reflections pass over me \n\r\nyou have to stoop  soothing your narcissism and crussify your ego or else you will just fuck up eveything(you and others) just trying to feed it.\r\nand if for some reason you fucked up something allready thinking your \"the man\" and shit go and set things right or you will just fuck thing up again and again, stop beeing cinical and get of that place...your just as good as anyone else.\n\r\n\"It's source is bright and endless, she resuscitates the hopeless\r\nWithout her we are lifeless satellites dreamin' dreams\r\nAnd as I pull my head out, I am without one doubt, don't want to be down here soothing my narcissism, I\r\nMust crucify the ego before it's far too late, I pray the light lifts me out \"\n\r\nSo crucify the ego before it's far too late to leave behind this place, so negative and blind and cynical\r\nAnd you will come to find that we are all one mind, capable of all that's imagined and all conceivable\r\nJust let the light touch you and let the words spill through, just let them pass right through, bringin' out our hope and reason\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nand your just living in a dream actualy...reflect and drop the ego \n\r\nmy interp :) *\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nis there any word which can express its greatness?\r\ni dont think so!\r\nwhen i listen to the electric giutar part of this song i find myself lying in the sand of a desert with a giutar in my hand, playing it.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nyeah, props to the sand and desert, that's the best thing about this song.  you are there.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nThe song is using the idea of the moon in showing the way most humans cannot reach their potential. With the moon there are billions of light rays coming off the sun but only a few million are reflected off the moon's surface to show its pearly view to the earth. That is like human's, we are given hundreds of oportunities to live to our best (eg. being born) but most waste them and let them fly past. Like the moon, it's light source is the sun, and yet this beautiful thing's power is wasted in the earea that it shines around the mood. Human's strength is given to us by some other power through our parents (Maynard is a strong believer of spiritualism and so this is relevent) but the amount of it that is blown away by the lazy humans is staggering. This song has the same meaning as 46 & 2, Lateralus and Parabol/Parabola in that we should take everthing we have, EVERYTHING, and use it.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nI like this song. And giving feedback to other comments written here, I do feel this song inspires me to get motivated and live life to the fullest. I think its amazing what it can do to you when you are feeling down, because it really does pick you up again; If you let it. For me, I think this song is about picking yourself up, out of a hole you have gotten your self into. \r\nâ\u0080\u0098And as I pull my head out I am without one doubt\r\nDon't wanna be down here feeding my narcissism.\r\nI must crucify the ego before it's far too late\r\nI pray the light lifts me out\r\nBefore I pine away.â\u0080\u0099\r\nThis part of the song, for me, is the most inspirational section.  You can really do a lot with this song, I feel this song, like a lot of tools songs, you can really twist and turn it to suit whatever mood or thought you may have, or just to interpret it another way.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nOk, so I have to say I have been spending the longest time trying to figure out what the lyrics of this piece are pertaining to. When I least expect it I placed \"Lateralus\" into my cd player and turned to this song as it's my favorite from this album. It came upon the last verse which has always been my personally most enjoyed part of the song and I sang through it and pretty much stopped dead in my tracks when I remembered something. A couple months ago I sat back and watched the \"Amotion\" DVD with commentaries on the videos. I can't remember exactly which video it was but I had the Maynard commentary on and he was speaking about an original translation of a ...hebrew term? Jehovah may have been the term (I'm not what one would call religous so bare with me here.) Anyhow, he was explaining how the original translation for the term meant \"Light\". Through random modern translations it took the image of a man with a beard, etc. etc. In it's original term it had meant light though, and in that term it had actually meant love. The light which is love itself as it is the single greatest part that seperates us from any other species. You know, once you go farther and farther and continue deeper into the thoughts which bind us to this mortality you sort of stray away from that idea. Such as in philosophy, after you go too far you can't really come back from there. It makes the go viable and it continues to grow and you forfeit your intuition for the ability to know. After you know so much though you start to disdain ideas such as emotional qualities like love. Trying to define it in restraints of physical attraction and mental compatability......... It's sort of in a way when he describes \"I may find peace within the emptiness. How pitiful.\" Trying to find the holes and fill them with the simple complacency you can find with that standard human running in the lines of \"physical attraction and mental compatability\". And that it's pitiful to fill your life with this and live it that way. That the true concept of \"Love\" is the greatest thing imaginable.\n\r\nThis song, is about learning to love. Not to abide by the standards you find through the depths of human breaches. In the end \"Before I pine away\" love is all that really matters.\n\r\nIt's about love.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nGreat song. And I love the little guitar part at the end after the last \"Before we pine away\". It's so relaxing!\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nrather than belt out a secondhand interpretation ill just post an excerpt from an interview with maynard on this song: MK: \"If you look at the cycles of the moon, it starts as a thin crescent and then gradually waxes until it becomes full; then it gradually wanes back into another crescent and then it is gone. The moon reflects sunlight like humans reflect information. We wax and wane and when we become full moons, our egos are full. We think we have this knowledge when in fact, the information we have is pure. And how it reflects or shines off of us, is something we take credit for as though the moon could take credit for its brightness when, in fact, it is only reflecting light from the sun. We have to understand that we are ego-less just as the moon is without light. It and we are simply reflectors. The ego is not responsible for the information. It can reflect the information in creative ways, but the information itself is pure\". \n\r\n-cdicarlo.com/…\n\n\n", "comment_91": "\nrather than belt out a secondhand interpretation ill just post an excerpt from an interview with maynard on this song: MK: \"If you look at the cycles of the moon, it starts as a thin crescent and then gradually waxes until it becomes full; then it gradually wanes back into another crescent and then it is gone. The moon reflects sunlight like humans reflect information. We wax and wane and when we become full moons, our egos are full. We think we have this knowledge when in fact, the information we have is pure. And how it reflects or shines off of us, is something we take credit for as though the moon could take credit for its brightness when, in fact, it is only reflecting light from the sun. We have to understand that we are ego-less just as the moon is without light. It and we are simply reflectors. The ego is not responsible for the information. It can reflect the information in creative ways, but the information itself is pure\". \n\r\n-cdicarlo.com/…\n\n\n", "comment_92": "\nthe way i see it... in order to understand REFLECTION. you have to first understand DISPOSITION. and before even that... you really gotta see the whole album as a unified whole. \n\r\nREFLECTION can be summed up in a single line (derived from the lyrics themselves) \"you will come to find that we are all one mind\"... the whole album reeks of such themes as the \"collective consciousness\" \"unity\" \"prying open one's third eye\"... personally i see the song and most of tool's conceptual work favouring / exploring Eastern philosophy... in Hinduism, the third eye is the eye of enlightenment... and in Hinduism enlightenment means the realisation of one's soul unified with the universe / god... in other words realising the \"one mind\" nature of all things... \n\r\nin saying all this... i must also add that Buddhist Philosophy also plays part in the piece... lines such as \"crucify the ego\" etc reflect the supreme buddhist goal... the goal to realise the SELFLESS nature of all things... to remove the misconception of an individual soul... \n\r\nthe most remarkable thing about TOOL, has to be the intellectual and artistic backgrounds to their conceptual albums... philosophy (eastern), psychology (carl jung), and western skepticism. \n\r\nHOD\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\namazing song, i cant get enough of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nI've been listening to tool since i was 14(im 19 now). I've had the lateralus cd for 4 years now almost. I've gradually come to understand the concepts expressed in this album like wiping the dirt off of a mirror. It gets better as time goes on. This song, this whole album, is a journey into the deepest, darkest, and most lightened parts of the human soul. It is greatly influenced by buddhism and other esoteric themes. This song in particular is basically enlightenment put into words, if it were even possible to do so. The lyrics speak to me. I can feel them and understand them. Buddhism(mahayana specifically) tells you that you must release the ego(your image of your self, what you believe to be your self). You must eliminate all desire, as this the cause of suffering, and be content with the possibilities of existance. All emotions are created by you, they arise by your doings and your reactions. This is not to say that emotions are not real. They are VERY real. You must simply realize that you allow them to manifest themselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nThis song is about hitting rock bottom and finding nirvana there.  It's a \"horrible\" truth that sets you free, realization of the inner self,  undeniably intact, a solid ground always.  Once you go there you can't come back,  and there is always a small little voice in the back of your mind saying \"Kill this facade you once were.  It's not real, true (to yourself)\" - hence the negative cynicism, i think (possibly heh).  If you kill your ego and accept your inner self, you stop comparing yourself to other people and dont care what everyone thinks and says.  We are all just reflections of one another,  symbols and meanings we thought up in our minds, i think if you free yourself from this \"cage\"  the reflection shifts in an almost holy light.\n\r\nBut don't over analyze you say?  It's just a song about hitting rock bottom and finding nirvana.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThe one Tool song I've yet been able to appreciate.\r\nYet, I say.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nok so i hear a phone ringing in the back gorund when he says 'calling me'...i dont know if anyone else noticed but it sounds like an old phone.....but yeah great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nbasically what this song means to me is its about opening your mind and crucifying your ego through any spiritual method, and no matter what you'll Find we are ONE in nature and balance.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nWow this song is amazing!! you guys and gals have covered my thoughts on this masterpiece! i never got this song until i stopped thinking and just relaxed. the best way for me to do that was to listen to Disposition first, which goes hand in hand with this song. i have to say that this song is as close to peace as i think i can get. the beginning drums just throw me in to this dark hole and my emotions began to build as i think of my own life. the place this song puts me is dark but is so calm and so right. when Maynard begins to sing i feel as if i'm sinking deeper into my own depression and hit rock bottom as MJK says \"I may find peace within the emptiness\" as the song progresses my thoughts get heavier all the way up to \"The moon tells me a secret\" that for me is like a bit of hope. as the moon tells him the secret it gives me the power to progresses and to push through the muck in life to find that we are all one and are all alike weather we want it that way or not. the point where the drums change its like im being lifted out of that hole and into the light. \"I feel reborn\" Tool is a great group i don't look at Maynard as a god, but the band Tool has helped me more than \"almighty\" has. i am very happy to see that people get this \"Tool\" and it affects them. i think we all can agree that the music out now is just \"beggin for your fatass dirty dolled up dollar\" \n\r\nmy favorite way to experience Tool is while driving down a road that is in the middle of no where and is like the road of life.\n\r\nps. the (live) version is more amazing than the cd one.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nA lot of other bands on this site people are clueless about the meanings but you guys have it in the bag.  The song seems to be that when maynards in his darkest moment proubably drugs of some sort(considering all the alex grey art, alex grey wrote a book called zig zag zen, its about using hallucanagenecs to reach no levels or doing things tradtional with discipline, basiaclly should one take the escalater or the stares)\r\nAnyways assuming drugs proubably mescaline or ayahuasca(Oral Dmt mixed with MAos do dreamy to be lsd) the drugs brought him to his dark moment then he became connected with the univers and all the information contained in the energy reflected off of him and with out his ego the light touched him filling him with infanint information.  He realized that we are all one mind and he fades away into the energy.  Triad, just weird sounds.  I took some acid one time and listened to all of aenima ended up trapped in a fetal possesion went through lateralus tell reflection came on dont only remember the begging of the song.  All i remember is blackness with colours and the triad sounds.  Now i get honoroll marks in school have excellent determination and i can use other peoples minds to think.  This isnt a sight to write about my trips so no more on that im just saying it does have its drug influences.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nA lot of other bands on this site people are clueless about the meanings but you guys have it in the bag.  The song seems to be that when maynards in his darkest moment proubably drugs of some sort(considering all the alex grey art, alex grey wrote a book called zig zag zen, its about using hallucanagenecs to reach no levels or doing things tradtional with discipline, basiaclly should one take the escalater or the stares)\r\nAnyways assuming drugs proubably mescaline or ayahuasca(Oral Dmt mixed with MAos do dreamy to be lsd) the drugs brought him to his dark moment then he became connected with the univers and all the information contained in the energy reflected off of him and with out his ego the light touched him filling him with infanint information.  He realized that we are all one mind and he fades away into the energy.  Triad, just weird sounds.  I took some acid one time and listened to all of aenima ended up trapped in a fetal possesion went through lateralus tell reflection came on dont only remember the begging of the song.  All i remember is blackness with colours and the triad sounds.  Now i get honoroll marks in school have excellent determination and i can use other peoples minds to think.  This isnt a sight to write about my trips so no more on that im just saying it does have its drug influences.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nA lot of other bands on this site people are clueless about the meanings but you guys have it in the bag.  The song seems to be that when maynards in his darkest moment proubably drugs of some sort(considering all the alex grey art, alex grey wrote a book called zig zag zen, its about using hallucanagenecs to reach no levels or doing things tradtional with discipline, basiaclly should one take the escalater or the stares)\r\nAnyways assuming drugs proubably mescaline or ayahuasca(Oral Dmt mixed with MAos do dreamy to be lsd) the drugs brought him to his dark moment then he became connected with the univers and all the information contained in the energy reflected off of him and with out his ego the light touched him filling him with infanint information.  He realized that we are all one mind and he fades away into the energy.  Triad, just weird sounds.  I took some acid one time and listened to all of aenima ended up trapped in a fetal possesion went through lateralus tell reflection came on dont only remember the begging of the song.  All i remember is blackness with colours and the triad sounds.  Now i get honoroll marks in school have excellent determination and i can use other peoples minds to think.  This isnt a sight to write about my trips so no more on that im just saying it does have its drug influences.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nonly one other person has realised that \"reflection\", seems to bare some reference to greek mythology,  in particular the story of narcissus and echo, a man so consumed with his own beauty that he failed to open his heart to anyone, but his own reflection, and eventually, I quote \"pines away\", all alone. I do not think this song tells the story of Narcissus, but somehow relates back to Maynard closing himself off from everyone around him (in particualr a girl), perhaps due to his \"ego\". I recommend searching the internet for the story of narcissus and echo, and perhaps, at least some aspects of this song may make more sense to you. I would also dare say Salvador Dali's surreal work of art \"The Metamorphosis of Narcissus\", had some influence too.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nMaynards words:\r\n If you look at the cycles of the moon, it starts as a thin \r\ncrescent and then gradually waxes and becomes full; then i \r\ngradually wanes back into another crescent and then is gone. \r\nThe moon reflects sunlight like humans reflect information. \r\nWe wax and wane and when we become full moons, are ego's \r\nare full. We think we have this knowledge when in fact, the \r\ninformation we have his pure. And it reflects or shines off of \r\nus, is something we take credit for as though the moon could \r\ntake credit for the light it reflects from the sun. We have to \r\nunderstand that we are ego-less just as the moon is without \r\nlight. It and we, are simply reflectors. The ego is not \r\nrespondsible for the information.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nbtw. you can read this up at\ntoolshed.down.net/articles/…\r\nvery interesting interview with maynard about the lateralus album :)\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nAhhh Reflection\r\nIn my opinion their best song.\r\nPerfect build up (including disposition).  Also amazing and very poetic lyrics.  I am too lazy to read all the posts but i still have my own opinions on what the song means and from what i read it sounds pretty accurate.  This song and Third eye are deffinetly tools (non live) best songs, (in my opinion of course).  I have been listeneing to this song for a couple times a day for about 6 months...and i still haven't gotten bored of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI want a goddamn video clip for this song! \r\nA video in a desert when the full moon is shining would be really great.\n\r\nbtw! \r\nI never analyze Maynard's lyrics. coz i \"personally\" think by analyzing his lyrics, i would betray him.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nnone of you are right, and none of you are wrong...but here's what i believe the intended meaning to be: the climax of the song talks about \"crucifying the ego\", maynard is talking about shedding the human ego/human identity in order to obtain pure being, seeing that we are one consciousness that creates subidentities (i.e. me, you, a ballon, a tree, the wind). once we rid ourselves of the restrictions of our human identity/ego we will become one with the light. and without the restrictions of the human identity we can find happiness in knowing that we are capable of anything.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nThe whole writing of lateralus I noticed focus on 2 things\n\r\n1)human relationships\r\n2)Evolution of the human spirit/mind\n\r\nThe album of laturalus is simply about peace I think. If we just got along, instead of at each other's throats for things like religion (possible interpretation for schism) \n\r\nReflection is sort of saying cast all of this aside, get closer to the source (after hearing rumors that Maynard had found Jesus, I am inclined to take a more christian interpretation to the song. In other words living like Christ, you become closer to god and become washed anew, and reborn. or so christianity says, I'm an agnostic. For those not in the know Jesus preached during his life (or time on earth if you will) about loving thy neighbor.) and you'll become somethign else. Though I gave the example of christianity it can be interpreted in other religions (I heared Buddhism being tossed around). Also there's a sense of urgency in the \"Before we pine away\" lines of the song, possibly before you die (and go to hell?)\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nHoly INTRO! Man... wow. this is like... deep? And meaningful and I just love the way he says narcissism and how this band can use big words and put meaningful things in without being lame and corny.  Good band. Sweet sound.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nThe moon as a magical symbol for the peaceful vision of a common humanity: The moon, by being a mirror to human souls and their longings, binds humanity together; simultaneously its mild, diffusing light infuses the human soul with a distilled (=purified) and common vision, the vision of wholesomeness/unanimity.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nOk, this is a great song with some awesome lyrics. I think it's telling us to let our spiritual side take over rather than let religion do it. This reminds me of a Final Fantasy game in that it says that we're not really alive. I'm not sure who the \"her\" is in the song though. But when MJK says \"before we pine away\", he's referring to the end of life (when this light stops). I'll do some more thinking though and add to this interpretation though..\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nI think I figured it out. Without this light, we will die. The light (spirituality) is gradually fading as we move along because we have lost contact with god. Church is just another blindfold. So, with this knowledge, he wants to get rid of his ego. If he can't \"crucify the ego\" then he won't be able to let his spiritual side take over. Without the light, we will die out and just drift away. Get it now? I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nWow, umm, ok, I had a change of heart about this song. Without information we are hopeless as a whole. Our spiritual being has lost its contact with god. Remember, the earliest hermaphrodites had two heads and three eyes. When the communication faded, the gods retreated and it kept fading and thus our spiritual eye became pretty much useless. Now seeing as Maynard is a political person and disagrees with the direction that we as humans are heading in, I think he's trying to assure us that there is still hope. And by hope I mean a will to open up to our spiritual body..\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nTo me, this song is like the discovery of the main character in Siddhartha by Hermann Hesse, where the character is devolved by capitalism and money and that which is right in front of us. The speaker in this song has ignored the spiritual side in his life. The cycles of the moon are like the cycles within the speaker's life. Eventually, i think that 'she' represents eternal light, spirituality, or the duality of human consiousness, both of the physical and the spiritual. Without this light, humans can only drift along the physical in life, where emotions, being shallow, guide life, like satellites are simply moving in space without true direction.\n\r\nsorry for that being all over the place but this song just pulls me in so many directions.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nTo me, this song is like the discovery of the main character in Siddhartha by Hermann Hesse, where the character is devolved by capitalism and money and that which is right in front of us. The speaker in this song has ignored the spiritual side in his life. The cycles of the moon are like the cycles within the speaker's life. Eventually, i think that 'she' represents eternal light, spirituality, or the duality of human consiousness, both of the physical and the spiritual. Without this light, humans can only drift along the physical in life, where emotions, being shallow, guide life, like satellites are simply moving in space without true direction.\n\r\nsorry for that being all over the place but this song just pulls me in so many directions.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nTo me, this song is like the discovery of the main character in Siddhartha by Hermann Hesse, where the character is devolved by capitalism and money and that which is right in front of us. The speaker in this song has ignored the spiritual side in his life. The cycles of the moon are like the cycles within the speaker's life. Eventually, i think that 'she' represents eternal light, spirituality, or the duality of human consiousness, both of the physical and the spiritual. Without this light, humans can only drift along the physical in life, where emotions, being shallow, guide life, like satellites are simply moving in space without true direction.\n\r\nsorry for that being all over the place but this song just pulls me in so many directions.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nIt is almost like this song is the life of the main character within Siddhartha by Hermann Hesse, in which once the character sinks to the lowest and most physical form of life, he is only then able to realize the truth of life, that all pain comes from want, spawned by desire, and that only by the release of the desire to want, the ego, can one embrace all that life has to offer. The 'she' in this song seems to be representative of eternal light, of dual human consiousness, that people have to ability to view both the physical and the spiritual. Without this light, humans are like satellites, simply drifting throughout life. The cycle of human life is representative of the cycles of the moon, which someone mentioned earlier.\n\r\nDefinite connections to buddhism within this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nouch, sorry for the double post.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nThis is my first interpretation here:\n\r\nWhen we manifest our nature - emptiness - everything is clear.\r\nInner world and outer world freely give and receive from each other\r\nwithout the distortions of self-interest.\n\r\nThe ego, the \"dark side\" of the moon (innocent)\r\nMysteries are in the Cosmos \r\nOnce they are unveiled the world is filled with light.\n\r\nDivine the material from the immaterial, \r\nthe fire from the earth (Reflection)\r\nfire spirals unto \r\nfire and becomes one with fire\n\r\nIf you know the fire that is within \r\nYou may spiral upward unto the eternal fire \r\nand dwell in it eternally with joy.\n\r\nWisdom is power and power is wisdom, \r\none with each other, perfecting the whole\n\n\r\n\"Just let the light touch you\r\nAnd let the words spill thorough\r\nJust let them pass right through,\r\nBringing out our hope and reason.\"\n\r\nBefore we pine away....\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nI believe this song is about understanding your own self worth and not considering yourself to be better than everyone else. It bears a strong resemblance to the myth of Narcissus (from which the psychological condition narcissism got it's name) Who was so beautiful that everyone who saw him instantly fell in love with him. He however did not like this, because he didn't think anyone were worthy of his love since nobody were as beautiful as him. For this the gods cursed him to fall in love with his own reflection in the water. He could never embrace his own reflection and it was always out of reach. He spent the rest of his days on the bank watching his reflection until he pined away into a flower. \n\r\nI dunno, just seems logical when you look at the lyrics which speaks of a reflection, narcissism, crucifying the ego and pining away.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nThis song makes me imagine a dark brown forest, with a lot of people crowding around a person resembling Maynard with a beam of tremendously bright but focused light projecting from his body, arcing over the top of the trees, and into the starry night sky.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nThe first part of this song is easy to understand. I think its about depression. Everyone goes through it and feels like they have to crawl in a hole so they can escape their problems. The problem with depression is that it can keep getting worst. You move farther and farther in this \"hole\" and after a while you get used to it. You make peace within the emptiness, and you feel pitiful about it. So when maynard is saying \"Its calling me\", I believe depression is whats calling him, deeper and deeper in this hole. This makes more sense to me since when he says \"Its calling me\", you hear an echo, as if you were in a deep hole.\n\r\nWhile your in depression, as it gets worst and worst, you experience your darkest moment; when things are the worst. You decide you cant take this anymore, you have to do something about it. Some people think suicide is the best solution, but really you just need someone to talk to about your troubles. In the song he is talking to the moon, which makes since because when people are sad or lonely they usually look up at the moon or stars. And the moon is telling him, \"As full and bright as I am, this light is not my own and a million lights reflections pass over me\". What the moon is saying is that as full and bright as I seem, this light is not my own; the sun gives the moon its light. And the million lights that pass over him I assume, are the stars; gives the moon more appeal. What the moon is saying is that it cannot shine without the sun or stars. This relates to humans reflecting off other humans and another one of my theories that I will explain sometime later. So after he hears \"the moons secret\", he feels like he understands everything now. That he must join in with other people in order to shine, or be happy, or succeed, etc. \n\r\nThis next part is really confusing. The best idea I can come up with is when he says \"she\" and \"her\", he is refering to this secret:\n\r\nIt's source is bright and endless, she resuscitates the hopeless \r\nWithout her we are lifeless satellites dreamin' dreams\n\r\nSo with my interpretation it would read:\r\nTogether our source of what we can accomplish is bright and endless; we restore the hopeless, meaning we renew it, or reset the limits to whats possible; Without each other we are lifeless followers chasing our out of reach dreams.\n\r\nAnd so as he pulls his head out (of depression) he is without one doubt that he doesnt want to be down in the hole soothing his narcissism, that he must crucify his ego. He's not talking about a cocky ego, he's talking about a negative ego, or attitude. So he must get rid of his negative ego before its to late and he pines away. To \"pine away\" means to lose strength, health, or flesh from grief. So basically he's saying that he must break out of his depression before he gets so deep in this \"hole\" that he cant move anymore.\n\r\nAnd in the end he is saying he again that he must crucify his negative ego before its far to late, and leave behind this place (depression) its so, negative and blind and cynical (another word for negative) And we will come to find that we are all one mind, (This one line has a meaning of its own which i will explain later) By working together we are capable of all thats imaginable and all concievable. Just let the light touch you (like its touched him) and let the words spill through just let them pass right through (speak your mind) and lets bring out our hope and reason all before its to late and we pine away. \n\r\nThats about it. This song is awesome and so is the whole Lateralus CD. It all has so much meaning and symbolism, I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nOk so the page before this basically told you what i thought the lyrics meant, but now I'm going to tell you what I think the name of the song means. \r\nFrom the lyrics, I got that the meaning of the song was to go out and be social and interact with other people (reflect off of each other). And thats basically where the meaning of the song comes from. People reflecting off of each other. Whether its knowlege being reflected or personality or anything and everything. Think of it this way: People are learning new stuff every day. And most of what you learn comes from people teaching it to each other. Where would we be if our parents didn't teach us anything? Another thing people reflect is personality. Your personality basically depends on your suroundings while growing up. Like how your parents raise you has alot to do with how you turn out. And what kind of friends you have and what type of school you go to. If you think about it, and get really into it, you don't have much say for how you turn out. It all depends on your surroundings. Your personality changes everyday as you go through more experiences and make mistakes. So, basically, I guess what this all means to me is that you cant really judge a person without jugding the people around him. Like in Maynards case, he had a bad childhood as we all know. And that made him the great artist he is today, so think about if he had good parents and good friends. Can you imagine Maynard working a regular job in a suit and tie like a normal person? \r\nMaynard is a deep person so I think its a possibility that he could of thought of all of this when he made this song. This is just an optimistic song and so is this CD. So like Disposition, He could just be sitting back and appreciating life and all the amazing stuff I just explained. \r\nOr on another note, he could be saying that people are not always themselves and they should be. You know how Maynards always preaching to think for yourself (like the beggining of the Salival Third Eye). So maybe he's saying you have to stop letting people influence you and do what you want to do. But yeah this song has many meanings and this is just the way I think of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI must of been stoned when i said all that crap\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nAs far as I know this is thinking about the past, you know, yearning for change in things that already happened. The narator is kind of realizing this halfway through this song, notice the change in the way it is played. You know, drums start going their own way (instead of that one beat it was doing for the first few minutes) and the ultimate point of realization is reached when the guitar starts playing that one part by itself (don't have the time of that).\n\r\nBut three things: 1 Whats the deal with people using the song lyrics to show what they mean (case and point: using that speech in salival)\r\n2. Does anybody else not get the idea of 'The moon tells me a secret'? It's a pretty dumb line IMHO.\r\n3. Did anybody else wonder how they would play this live? The drums, from what i'm hearing, are impossible to play, and there are at least three guitars that I am hearing.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\n\"The album Lateralus is a tale of a breaking up of a relationship, as far as I can tell of any type\"\n\r\nperhaps the relationship with the ego/\"self\" ?  \n\r\na truly inspiring song, along with fortysix & 2.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nThis is not a song by itself really. It is the second movement of the epic \"resolution\"\r\nThe second to last step on the road to enlightenment is about self. It constantly referenced Narcisus, who fell in love with his own reflection and pined away as he stared at himself. The song is about letting go of who you think you are. You must understand, you are nothing. The individual is an illusion. We are all one mind. We are just a great collective, we only imagine that we are seperate people. Give up the illusion. Crucify the ego and reject individualistic thinking. Embrace the collective. Become a waking part of the one organism: humanity. \r\nThis message is somewhat upsetting to many. Especially in the west, we glorify the individual and reject collectivist thinking. This is why we advocate democracy so much, instead of more collective ideas like meritocratic fascism. I for one take the song's message to heart. I have given up individual thinking, and so should you. Together, as one mind, we can make the world a better place. I am ready for the Infinite(Triad)\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nREAD AND LISTEN TO THIS!!!\n\r\n7812569103411/67584131221911310/15\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nTool: The Cyclic Playlist.\r\n6,7,5,8,4,13,12,2,1,9,11,3,10 / 15 / 7,8,1,2,5,6,9,10,3,4\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nI think that they are saying that we as a society must stop thinking and focusing  only on ourselves and realize that by working together we can live peacefully and acomplish anything we put our minds to.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nBTW, how do I read and listen to a bunch of random numbers?! :)\r\nWhy are they arranged in this order?\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nthe numbers arent random. havent you heard of the holy gift?\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nI know that the first numbers up to 10 is the holy gift. I have them burned to a cd already... But what is the 15 and the rest for? Lateralus only has 13 tracks.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nDo you include Aenima(has 15) and Undertow(has 10)? ... I guess that would make sense. Crap, I answered my own question.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nTool Synclist (complete)\r\n7,8,1,2,5,6,9,10,3,4 - 6,7,5,8,4,9,13,1,12,2,11,3,10 â\u0080\u0093 15,14 (or 14,15)\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nIt's quite simple really, you just need to listen to the drums - Before he realizes his self-obsession the drums follow a very very strict beat (of the drums going up and down constantly). But when he lets go of his self image/obsession, his ego really, he sees the outside world, and at this point the drums start to go free. Could be coincidental, who knows?\n\r\nAlso, is every song on this album about something moral? So far the grudge is about forgiveness, the patient is about patience (surprise!), schism is about unifying, parabol/parabola i have absolutely no idea, ticks and leeches is a metaphor for what seems to be like obsession with others (who really don't seem to matter), lateralus is about false judgement, disposition - reflection - triad (which, by the way, did anybody notice how it gets heavier throughout this triple-ary sequence) is about the self\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nDoes anyone know what the \"noise\" is that starts at around 1.30? Is it an instrument? A synthesizer? Or si it Maynard's voice, only heavily distorted? I'd like to know, it sounds very eastern and it's really cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nI think in the actual song its some kind of recorder or ocorina with some kind of affect on it, but live Maynard does it with his voice. Just wanna say again how wonderful of a song this is. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nwell, does ne1 know about narcissus the little greek mythology boy who got obsessed with his image in water and began to \"pine\" away?? :D i tink it'd go great with this song, nehoo...i love this song...makes you think about what ur doin wrong and finding ways to better myself :)\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nAs far as I can recall, Narcissus was the most beautiful one in the world until he saw his reflection in the water. Jealous of this equally beautiful reflection in the water, he jumped in to attack the reflection (?) and drowned. Either that or he fell in love with his reflection and embraced it, thus drowning.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nI think this song is about overcoming your self consiousness and looking outward for help instead of curling up in a ball and self obsesed. This song is telling us that we have to overcome our narcissism\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nI think this song is about overcoming your self consiousness and looking outward for help instead of curling up in a ball and self obsesed. This song is telling us that we have to overcome our narcissism\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nIt confuses me that Maynard says \"over thinking over analyzing separates the body from the mind.\"  To me this is in odd conflict with the nature of his songs.  Do we look to deep into these lyrics.  I am a person that has been labled as an over analyzer; I like to think deep.  However, if Tool puts so much meaning into their songs, is that meaning meant to be found by analyzing them, or simply feeling them.  I've described Tool's music as an experience to others before.  I just felt the need to throw these thoughts out there.  Anyone is free to interpret the lyrics as they please, and figure out what it means to them, but basically what I am trying to say is, if there is a way to figure out what Maynard is trying to say, what is the best approach?  Or perhaps simply, Maynard writes every song with the mindset that the meaning the listener creates should be more important than what the song meant to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nThis song is definitely the first part, with Reflection being the second. It's about life as a child, as your disposition is defined. \n\r\nI can't really say what he meant with the lyrics, that's up to each to determine. To me, it's about having no care, watching time go by. Naturally, everybody learns things such as pride, ego, selfishness. Thinking the world revolves around them. This is part of most people's disposition.\n\r\nAt the end of the song, it's meant to sound like a ball bouncing, as in a child playing.\n\r\nThe second part, Reflection is about learning the truth and reflecting back on the past(obviously). The truth that life is amazing, that we all share this world. Simply amazing, every facet of life. It's saying to drop those bad habits of egotism, pride, and selfishness and live. Live as a good human before it's too late and you're dead. You don't want to reflect upon your life at the very end and realize how wrong you were.\n\r\nI think it explores the ideas of nirvana and qiyamat.\n\r\nThe music is so trance like. These two songs are great on their own, together it's simply genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nYou know there are plenty of down right incredible songs out there in the world today, but reflection is unlike any other (at least to me). Cause its hard to find a song that can make u raise goosebumps and send u far into the depths of your mind to discover something trapped within.  This song is one of those songs that posses such a power, just like many other tool songs can. This one is unique tho because it made me take a look at myself and revealed to me my shadow, my dark side the beast within. And thats why i love Tool cause they suggest that you should look at the world from different angles and different perspectives to see things in ways you never thought existed. If it weren't for this song i never would have realized that i have been so blind and cynical in life. luckily things have turned around and i have opened my third eye.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nI was surprised to find that nobody has yet noticed the double meaning behind this song. The name \"Reflection\" refers to to the lyrics as they reflect on life, but also contains a deeper meaning. If you ever noticed something strange about this song but could never quite put your finger on it, you may have subconsciously realized that this song is musically symmetrical. Instrumentally, as well as vocally, this song plays exactly the same backwards as forwards. The album Lateralus really goes much deeper than most think. If you haven't yet discovered \"The Holy Gift\", I would suggest you look into it. The song Lateralus acts as a key to unlock a hidden order of the tracks on the album, letting us see it in a completely new light. Tool really hands down the most amazing band ever to walk the earth. If you're interested in learning more about the deeper meanings of this album, google \"Lateralus\" and check into the 4h from the top.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nAfter really reading into this one, I've come to several different ideas. One being that it a song based from the point of view of Narcissus, looking into the pool and seeing his reflection, then falling in love with himself... Thus, pining away in his own image and dying in that state. \n\r\nNext one is the possibility of Jungian Psychology. Much like 46 & 2, we shed the ego and step into the shadow and intigrate to continue in evolution. This being shown that in Jungian Psychology, Jung believed we were all one single consciousness. The collective unconscious.\n\r\nAnd the last of my ideas about this song being that we reflect information like the moon reflects sunlight. Like Greensaint said.\n\r\nNo matter what point of view I look at this song from, it always seems to sooth me and make me feel better. One of Tool's more beautiful songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nI think that the whole album is a progression. \n\r\nFirst there is \"The Grudge\" which symbolizes a life that needs anger for motivation. \n\r\nThen comes \"EBA\" and \"The Patient\" where the anger is getting boring and he has already begone to let go but can't as he is trapped with a person who keeps challenging him despite a desire to move on.\n\r\nThen comes \"Schism\" which symbolizes cognitive dissonance. He is beginning to put together why he hates this person and is coming up with several ideas as to why but is also feeling a need to return to hate. Therefore, he is dividing his consciousness into several peices and reprganizing them in order to find out why he does what he does and how to let go.\n\r\nThen comes \"Parabol(a)\" which is about embracing life. The first step to healing. He has chosen to finally seek a higher purpose in life. He understands that our actions leave a permanent impact in the world and that this is the time in human history that we have to make those footprints.\n\r\nThen comes \"Lateralus.\" It's about finally being awake to reality through objective veiwing of the self and seeing the self as being imperfect and that the morality of all decisions is graded on a spectrum.\n\r\nAfter that comes \"Disposition.\" Dispostion is about finally beginning anew and choosing to mature. Before there was a fear of maturity, but now he has rached the point where he can mature without sacrificing his identity.\n\r\nFinally, there is \"Reflection,\" which is about seeing beyond the self an connecting with people on a deeper level. The man who was an earlier rival is now seen as being just as human as the narrator. The narrator is just as human as anyone else and he is aware that he could easily fall back into seeing nothing more than his own perspective later and has chosen to savor this moment of solidarity.\n\r\n\"Ticks and Leeches\" is about how record execs forced Tool to throw a heavy, angry track into the album and they are venting at how the track's inclusion ruins the entire theme of the album itself.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\n\"And in my darkest moment, fetal and weepin'\r\nThe moon tells me a secret, my confidant\r\nAs full and bright as I am, this light is not my own and\r\nA million light reflections pass over me \"\n\r\nThis is referring to the fact that the moon, bright as it is, does not generate any of its own light, but reflects it off the sun. The connection to reality is that we cannot always shine by ourselves, but can still be part of the reflection of a greater cause.\n\r\n\"Its source is bright and endless, she resuscitates the hopeless\r\nWithout her we are lifeless satellites dreamin' dreams \"\n\r\nAgain... Referring to the sun. The sun has always been a symbol of revival, because it breaks the dead of night with dawn.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\n\"And in my darkest moment, fetal and weepin' \r\nThe moon tells me a secret, my confidant\"\n\r\nThis verse refers to individuals who are at a higher awareness on oneness trying to pull or help individuals at a lower awareness of oneness higher. \n\r\n\"As full and bright as I am, this light is not my own and \r\nA million light reflections pass over me\"\n\r\nThis verse refers to the higher individuals pulling others up having individuals higher still than them pulling up.  It is like a chain of people pulling other people up toward oneness.  Each spark of light is another person, another struggle toward oneness.\n\r\n\"It's source is bright and endless, she resuscitates the hopeless \r\nWithout her we are lifeless satellites dreamin' dreams\"\n\r\nWithout both the masculine and feminine identities, we can never achieve oneness.  The feminine gave rise and continues to give rise to seperation.  She creates or gives birth to reality - and humans give birth to more separate people.  Separation is neither good nor bad - but different than oneness.  All the separated must become the one again before it is too late.  \n\r\n\"And as I pull my head out,\"\n\r\nI'll let you figure that one out.  (see above explanation.)\n\r\n\"I am without one doubt, don't want to be down here soothing my narcissism,\"\n\r\nBecoming one means evil and good must merge together.  Masculine and feminine must merge together.  Master and slave must merge together.  God and mortal must merge together.  Pricelessness and worthlessness must merge together.\n\r\n\"I Must crucify the ego before it's far too late, I pray the light lifts me out\"\n\r\nBecome aware that to achieve oneness, you will become one with people you don't like in this reality.  People that may hate you.  Your enemies.  Kill yourself to yourself so that there is room for merging with all other conciousness. \n\r\n\"Before I pine away\"\n\r\nIf the oneness operation doesn't work immediately, all of humanity will become hooked together in freakish knowing of each other.  No lies, no secrets, no differences, no escape, no rest.  It will become like torture and people will yearn for the good old days of separation.  It will take generations to fix the damage. \n\r\n\"And you will come to find that we are all one mind,\"\n\r\nHaving killed yourself on the ego level, you find that you can communicate with other people in an odd way.  Schism: \"To bring the pieces back together, rediscover communication\"  The individual (ego) is a block.  When two people try to achieve oneness in the physical (like lovers) pain and roadblocks often result.  But oneness of the mind is possible.  \n\r\nSchism: \"cold, cold, cold,\r\nCold silence has\r\na tendency to \r\natrophy any\r\nsense of compassion\"\n\r\nHe is not referring to oral communication, but mental commucation - talking in your head.  Remember, some individuals are more at one in some ways than others.  They can share energy and thoughts and love and hate.  Some people can hear your thoughts (the higher) some can't (the lower).  But once you get high enough, no other communication seems good enough.  If one partner has it and the other doesn't, the relationship is doomed.\n\r\n\"capable of all that's imagined and all conceivable \r\nJust let the light touch you and let the words spill through, just let them pass right through, bringin' out our hope and reason\"\n\r\nThere are factions that want this power for themselves.  They have achieved higher levels of oneness but failed to kill their own egos.  They may try to crush you.  However, you must become one with these people too.   Neither love nor hate anyone, find beauty in the dissonance.  Find that both are required to be one.\n\r\nIMHO\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\ni really think this song is about coming out of depression and finding peace before you destroy yourself. I listened to this song at least 30 times the day my dad died and that was before I really understood exactly what the song was talking about but for some reason I felt better just listening too it over and over, and i can honestly say it helped me a lot. I always wanted to write a letter or email toolband.com, something saying just how much it helped me but i never did\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nOne of the most beautiful songs ever put on a cd.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nSacriface the ego before its far too late\r\n'nough said.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nJESUS CHRIST I NEARLY CRIED READING THE LYRICS TO THIS SONG, IVE OVERLOOKED THIS SONG SOOO MANY TIMES, ALMOST A HUNDRED TIMES AND HAVE NEVER READ THE LYRICS.\n\r\nTHE LAST VERSE IS BEAUTIFUL. TRULY & ABSOLUTELY BEAUTIFUL ... SERIOUSLY.\n\r\nAlso people need to stop comparing the \"OVER-THINKING, OVER-ANALYZING, SEPARATE THE BODY FROM THE MIND\" in TOOL's LATERALUS to the act of \"ANALYZING\" of their songs.\n\r\nThat part of Lateralus only relates to when people ponder or think too much, constantly JUDGING or BASING INFORMATION on the sense of seeing through the biological eyes; the biological perspective; and are blind to true reality.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nI can see how D/R/T are connected.....This one is about the character taking part in the journey, he reflects his own life than looks at the moon and notices it's relfecting light like i'm reflecting life...than at the end realizes we are all one...then tells you the listener to realize this...before we all pine away.....\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nOur interpretations of this song (and others) are mere reflections of who we are.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nCorrection to 'parabola 17' comment made on 5-5-05\n\r\nThe Kabalah is jewish mysticism and is not read by very many jews, except in cases where there has been a long, sustained study of the Tanakh, Mishnah and Talmud.\n\r\nThe Torah (the first 5 books of the Tanakh(old testament)) is what is referred to as 'the tree of life'.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nyou gutta love getting baked to this song ..\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\naenema, are you absolutely sure about the symetrical thing? shit...\r\ni've never thought that, but you're right, there is something about it. by symetrical, do you mean completely symetrical, or just that the general pattern is? and snake doctor, why do you think that?\r\nMJK is speaking at our level ENTIRELY. that's the point. this song communicates to us that we need to change, we need to realise that we are all linked, and start living life in a way that is beneficial to everyone, to see things clearly, to open the third eye. listen to it again, try and understand if you're not too much of an idiot.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nSSJVegeto: Truly insightful. I believe you are 100% correct.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nYou're an idiot Snake Doctor. \n\r\nAlso Reflection is about his soul mate Brena..\n\r\nHe has referred to  her as his \"reflection\" in interviews.\n\r\nThey got divorced so something probably happened in her past that Maynard thought he could cure her of..\n\r\nTelling her that to not fret because she will come to find that \"we are all one mind.\" \n\r\nOther songs he refers to her are in a lot of APC songs; Sleeping Beauty, Brena, and a few other ones.\n\r\nRead those lyrics and it starts to make sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nhmm, yeah, i really like the song brena, but i've never been able to work out what it's really about...\r\ni didn't know it was about his soulmate...\r\nthat could be another layer of meaning in the song actually. i mean, there's never just one meaning in tool. (although it would be nice to know that this song did have one meaning; it would affirm my belief that this song, along with triad and disposition, is perfect.)\r\nit does seem like those three at the end of lateralus (excluding faaiip de oiad, maybe. unless that has a deeper connection with the album than is obvious.)\r\nare completely enlightened, the pinnacle of tool's music.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nWithout the sun the moon is just a dark satellite, without life we are just corpses.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\njHe's actually talking about the moon. Keeping with the Hermetic theme of the album, Hermes Trimestigus said that the Sun is the father, and the moon is the mother. The moon/mother is comforting him and without her, he'd be nothing.\n\r\nAnyway. This song is about destroying your ego in order to spiritually transcend. We're all stuck in our 3D ego consciousness, and we cannot transcend until we \"crucify the ego\"\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nThe song and the artist that changed my life. I recommend people look into the endless yet simple meaning of this song.  We go through life assuming that our experiences are our own they are simple reflections of our past.  They are not ours to claim but we continue to do so. People believe life is full of problems and we are raised to think that there is only external cures for them.  When the cure for all problems is found in a state of mind.\n\r\n    After following my perceived path of enlightenment, I have learned more about myself in the first 11 hrs than a lifetime of therapy and prescriptions could have ever offered me.  There is a higher level, I wish this feeling upon anyone who is willing to take everything they hold to be true in this physical world and shatter them.\n\r\n  Its been 4 years since the start of my journey, and I am still so far away, but like anything worthwhile it's far from easy. Unlike other people that share these beliefs, I don't think our minds are mature enough to ever achieve \"nirvana\" or a full understanding of the non-physical world.  Like many people, I started this path with the hope of achieving \"enlightenment\", but I shortly came to the conclusion I had become, unknowingly, a puppet of my own ego.  It's not about enlightenment, it's about the deepest possible understanding of your subconscious and coming to the realization that we victims of our own mental shortcomings(Ego predominantly).  And once you fully understand that we are flawed by this, you can take steps in everyday life to, as Maynard states, \"Crucify the ego\".\n\r\n*note - Since the installment of this idea, my life has meaning. I love everyday like it were my last.  Many people love there emotions to much to let go of them, but what they cant see is that happiness is just a controlling aspect of our ego keeping us lokked in our primal state of conscious.  Take a chance, feel the connection with every ounce of life in this world and I'll guarantee you will never crave the shallow happiness again.  This is song about the path to pure bliss. \n\r\nUnderstand yourself, this world is based upon our perceptions of it. Knowing that along with deep understanding of our mind, will allow you to shape/control your own emotions.  Everyone that has read all of this and wants to better themselves, I ask you to look for the meaning of life. It is out there. We have just been raised to look in all the wrong places. \n\r\nThis song is the only thing in this world that can make me shed a tear every time i hear it. I've learned much but at the same time understand that I know nothing\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nwhen I first listened to the disposition-reflection-triad suite,i found that they conjured up images of some sort of prince of persia setting*\r\n*for those who don't know,prince of persia is a game set in the middleast\r\ni'm well aware that the lyrics are nothing to do with that,but i find it to be noteworthy\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nhe sings \"lifeless satellites, drifting\"\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\ni agree.\n\r\nLOL\n\r\n:)   he he its a smiley!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\n;)\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nSuch a soothing song. Going along with Truth's statement. Your conception is very similar to what maynard has said about the band. \r\nIt went something like : \"they see those out of control kids, smelly and carless, wearing Tool shirts, then people being to accumulate the wrong ideas. Then more and more you being to see the same people at the show.\"\n\r\nThey are a mirror for how society works, and for those willing to dive through the garbage, you will find what you have been searching for.\r\nBe patient.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\n\"And in my darkest moment, fetal and weepin' \r\nThe moon tells me a secret, my confidant \r\nAs full and bright as I am, this light is not my own and \r\nA million light reflections pass over me \n\r\nIt's source is bright and endless, she resuscitates the hopeless \r\nWithout her we are lifeless satellites dreamin' dreams \r\nAnd as I pull my head out, I am without one doubt, don't want to be down here soothing my narcissism, I \r\nMust crucify the ego before it's far too late, I pray the light lifts me out \"\n\r\nPersonally, ive spent about the last 9 minutes looking these 2 paragraphs.  alot of references to the mathimatical conic section of a parabola.  no not the song, but the weird little shape on a x-y graph that resembles the shape of a \"U\". in my dealings, the parabola was a prime symbol/shape for Human Life.  rising and falling, and with a focal point.  might be nothing but, \"And in my darkest moment, fetal and weepin' \", the fetal postition reminds me of a parabola, as does the crescent moon in \"The moon tells me a secret\".  One could conlude that..the moon and the man  in the fetal position are parabolas, constantly communicating with each other.  and no matter, as the parabolas are aligned, face to face, in any distance apart, the data waves emitted out of the parabola will miraculously fit into the focal point with the other. look it up, all information.light.waves (whaveter) are directed right into the focus. its amazing!\r\nanyway, \r\n\"It's source is bright and endless, she resuscitates the hopeless \r\nWithout her we are lifeless satellites dreamin' dreams \r\n\"\r\nthe 'source is each other, because parabolas feed off each other as i jsut explained.  the 'she' im not so sure what is, resuscitates is bringing back from the dead, so in essences, bringing life back to the form  for the time that the emitted data/information is returned to the parabola, and 'without her we are satellites'.  can you guess the shape of satellites? why they are a disc? whats the focus? the focus is that metal thing hanging in the middle, that reads the data that is bounced back from the inside of the disc.  the focus is the point in which all data is concentrated in one point, so focus is an appropriate word.\r\nanyway, thats all i got. bedtime.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\n\"by Woody87 on 07-17-2002 @ 09:24:27 AM  \r\nSorry guyz,but i think all of u look way too deep into Tool's songs.Maynard kinda says it in Lateralus.\"Over thinking over analyzing separates the body from the mind\".Think about it.  \r\n\"\r\nby woody87 on sept 17 2002, i think that is exactly what maynard is trying to do.  why do you think people say \"body is temple\", when all a temple is, is just a place to conduit your worship.  the IDEA IS to seperate the body from the mind.  and by doing so, your seperating the ANIMAL of the human from the SOUL of the human, which in essence makes you two lifeforms.  i consider the animal portion, impure, but necessary.  over think and over analyzing is like rolling into a ball, a ball that when get s to big for its own mass to roll, it implodes, or unravels from the inside out and becoming a completely irrational and chaotic form. this amok form would allow you to pretty much explore any and all regions and cultures the brain has to offer\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\navery optimistic and spiritual song.the main theme is moongazing, but it goes much deeper than that.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nI haven't read all your comments but I'd like to share my thoughts. The name of the band is Tool, so why don't you use this tool ? Use this tool to get to a higher level. The light is pure thats true, the moon's light comes from the sun but where does our \" light \" come from ? it comes from ourselves, this means we produce it. We shine as humans and reflect other humans' light and this is the PROGRESS of humanity and it's thingking and most of all its love. Realizing the truth is just the bitter begining and most of you consider the truth the end. You all are thirsty for truth and lower the human beign as just somthing present, something that is there. Why is there always something higher ? You dont have to be ego to think that there is no god or somethign equal ...\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nthat'd be hilarious... if all these \"spiritual\" nuts called tool fans... and anyone else who fit that description found out that there is no \"higher power\" or afterlife and all this we are all one consciousness horse shit turned out to be just that. and, when we die, we essentially become maggot food and uhhh thats about it. i'd laugh my ass off if i knew this was fact.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nits a good tune though...\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nmakonu2 it's sad that you think that way. i think people like you dismiss the possibility of anything spiritual whether it be christian or new age or whatever assinine man made religion it is because you just look at that religion. all religions are wrong even though there is some truth to them. your to ignorant to try anything spiritual because your view of spirituality came from some stupid religion. surelry you cannot call every NDE or every meditation or connection to god or ala or whatever you call your god (when there all the same at the core) a farse. i do not believe in the worlds view of god no matter what religion were looking at but i know there is much more to life than wrotting in the ground. science cant explain everything and neither can religion so there are many mysteries out there that we will find out in time. dont just close yourself off from possibilities but dont except one infinite truth forever. i believe in god but i dont think we abide for eternity singing praise songs in heaven. just remember there is much more to all this and you need to dismiss what the worlds taught you of god and form your own oppinnion yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nDo you think that the lyrics \"before I pine away\" could be a reference to the PINEAL GLAND. The pineal gland is located in the center of the brain and is responsible for the production of the substance DMT. DMT is said to be released when we dream and also during near death experiences. The pineal gland is present in the human embryo at around 49 days of gestation. The differentiation between male or female also occurs at this time. 49 days coincidentally is also the amount of time that the Tibetans believe it takes for one soul to incarnate into the next. Just a thought??\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nanother thing about the pineal gland is the connection it has to the rebirthing practice. its what some some call the third eye. i suggest doing some research on rebirthing its pretty interesting\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nThis song is another reference to Carl Jung.  Tool refers to Jung in TONS of their music.  forty-six & 2 is all about the shadow archetype, and the name Aenima refers to another archetype that Jung wrote about.  Though the song itself is about LA sinking, and refers to Bill Hick's comedy routing \"Arizona Bay\"\n\r\nAnyways this song goes way deeper than a lot of people seem to think.  The part about crucifying the ego is another reference to Jung.  He spoke of the ego and as others have said, it gets in the way, it seperates the body and mind, jung says you must seperate yourself from the ego in some ways.  though in others it can help create balance.\n\r\nLater maynard goes on to say \"And you will come to find that we are all one mind, capable of all that's imagined and all conceivable \"\n\r\nThat is a reference to the Collective Unconscious that Jung spoke of.  Along with Synchronicity, (you may know of it as \"the secret,\") Jung theorized that anything was possible.  Everything that is in your life was brought into your life, by you.  and you can learn to control it.  So much of tools music is a map to Jung's work that if you listen closely, and read everything there is to read about Carl Jung and Synchronicity, then you will realize how deep some of tool's music can get.   it's got that meaning on the outside that anyone can relate to, but if you listen with a similar frame of reference that tool had when the song was written, you see it on a whole different level.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nThis song is proof for anyone who ever stated that tool was a pessimistic group. This song is full of inspiration and makes me feel like i can accomplish anything when hearing it. \n\r\n\"You will come to find that we are all one mind, capable of all imaginable and all concievable, let the light shine through, let the words spill through\"\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nAnd in my darkest moment, fetal and weepin' \r\nThe moon tells me a secret, my confidant \r\nAs full and bright as I am, this light is not my own and \r\nA million light reflections pass over me \n\r\nthis to me seems to invoke a sense of collective being. An artichoke point of view in philosophical terms. We are made up of the the universe collectively. To think of yourself as an individual \"self\" would be to separate the body from the mind. \t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nWow. I listened to this song high... It made me miss being a child desperately. I came up with a good interpretation of this song... well, its how i interpret it.\r\nIts not a \"reflection\" like a mirror, but its a \"reflection\" on your life, probably in your last moments. To me its kind of like I'm looking for comfort by thinking back to when I was 5 years old, and didnt worry about much. it really moved me.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nThis song always makes me feel so relaxed when I listen to it, no matter what kind of mood I'm in. It's such a brilliant song.\n\r\nAs for meaning, I'm still to decide on that one. :P\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nThis song actually makes me feel like my third eye chakra is going to start spinning; if anybody is at all familiar with that :/\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nOkay, this has been my favorite Tool song for quite some time, and while listening to it I can't help but consider it in Thelemic terms.\n\r\nThe first verse can be considered as kind of realization of life.  Suffering is apparent.  Then the \"It's calling me\" can be seen as a calling to uptake the Great Work, which is the union of man and the Godhead.  Then the moon (symbol of feminine energies) leads him to realize that the light is not his own.  The light, can be the Body of Light, which when we die reincarnates into another body.  The millions of light reflections is the energies passing on, coming into new life, it's a symbol of death and rebirth.  It is a reflection of what is to happen to the light which is not his.\n\r\nThe verse after this, he talks of a feminine energy.  \"Without her we are lifeless satellites, dreaming dreams.\"  I take this as his view upon Nuit, the goddess that the first chapter of the Book of the Law (the main text of Thelema) deals with.  She is infinite space, and infinite stars.  Everyone orbits their own path within Her body.  This universal consciousness leads to the want to destroy the ego and to quit soothing petty narcissism.  He is now practicing the path to achieving the Great Work, before he \"pines away.\"  After this, \"and you will come to find, we are all one mind,\"  describes realization we are all in one body, all a source of Light, of God, or however you wish to perceive it. He is not attained this enlightenment, and is spreading it to others, asking them to let the light come through, to achieve the Great Work.  now, instead of \"before I pine away\" it's \"before WE pine away.\"  He has let go of the ego, and now instead of selfish thoughts of himself he is know aware of spreading the light to others.\n\r\nI tried to describe this the best I can in my own viewpoint.  I would love to go in depth with more references that could possibly be compared to Thelemic philosophy, but I doubt that a lot of people on here wouldn't know what I'm talking about.  If someone has already thought of something similar to this then I'm sorry for repeating, I didn't look through all the comments.  And if there are some grammar/punctuation inaccuracies I do apologize for them, I haven't slept in quite some time now.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nThis song is about a tree\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nIn perspective, the birth, life, death, and rebirth of a tree, possibly a willow or some evergreen of some sort... duhh\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nThis song is about the after life. Must crucify the ego before it's far too late, I pray the light lifts me out. in other words he is dead and being lifted out of the pitiful hole such as our planet earth. also the millions of reflections that are not is own are others dead in the after life. \n\r\nthats just what my sixty year old paps said to me. just thought i might fill you in on a lil somthin.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\ni've just read 'thus spake zarathrustra' and this reminds me of his plight down from the mountains where he was confronted w/ obtuse and naive people. not something he wishes to regret of himself... For me, the music takes me on the journey and i can hear the echo through the forests. SUBLIME\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nThis song is the middle part of a three song piece: \r\nDisposition + Reflection + Triad\n\r\nIn various beliefs and religions, people believe that after death you get to speak to a Master in a kind of waiting room (known as \"Space Between Lifes\") where you (in spiritual form) must Reflect on your recent past life, and when you come to a Conclusion that involves on HOW you could have leaded your life in a better and purest way, then you can peacefuly continue to HEAVEN and choose to continue as a spiritual form or reincarnate (perhaps depending on your experience as a human being). \n\r\nSo in my opinion, this song talks about someone reflecting in that \"waiting room\" so to achieve mental pureness.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nThis song is about ego death.  This is a state that you find within yourself after long meditation.  You literally loose your ego.  Ego means you. Your ego is your individualism, whether you have a cocky ego or maybe an insecure ego... but nonetheless, he is talking about his individualism as a human.  when you find \"ego death\" you see that we are all \"one mind\".  Just one continuous experience. You can find this in Alex Grey's art work.  Ego death can be achieved by using psychedelic drugs. \t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nIn my eyes, this song is about humanity in general. \"Before we pine away\" prolly means \"Stop all of this before we destroy ourselves\".\n\r\nHOWEVER...\n\r\nI also have been thinking that this song is about Maynard's abusive stepfather. \"A million light Reflections pass over me\" is saying that sometimes when you were harmed or abused, you will pass it on to another person, a cycle, or in this case a \"Reflection\". \n\r\nJust my interpretations.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\ni think that, by use of psychedelic drugs, maynard has realized that we are a single consciousness. Left his body, as i believe we do every night, and actually spoken with a spirit that filled him in on a lot. So much to talk about with maynard and bill hicks that its not even funny. they both followed carl jung's theory on a subconcious that all humans have, and unity as well, but hicks noted that he had realized this through lsd in a joke about a positive drug story, so it could have been realized either way. hicks is in a tool song as well, third eye, and meantions a stealth banana joke in rosetta stoned that hicks mentioned in a ufo joke. That being covered...\n\n\r\nI have come curiously close to the end, down \r\nBeneath my self-indulgent pitiful hole, defeated I \r\nConcede and (Concede and) move closer (Move closer), I may find comfort here \r\nI may find peace within the emptiness, how pitiful \n\r\n\"he says that he has come close to the end...if we assume he is talking about death, he is beneath his self indulgent pitiful hole, or body. if his body was lost, than he has been defeated, and is taking the trip through the afterlife that leads to the first \"conversation\" realizing that he has done this before, he is not worried about his body, or if he even has one, \"how pitiful...\" he accepts it to be natual and real easily, because it is.\"\n\r\nIt's calling me (Calling me) \r\nIt's calling me (Calling me) \r\nIt's calling me (Calling me) \r\nIt's calling me \n\r\n\"people that have have had near death experiences or \"nde\" say that they follow a light through a tunnel...i know not so original but it has been reported multiple times, and all are eerily similar. i believe he may be experiencing or imagining what would happen next but one can never be sure.\"\n\r\nAnd in my darkest moment, fetal and weepin' \r\nThe moon tells me a secret, my confidant \r\nAs full and bright as I am, this light is not my own and \r\nA million light reflections pass over me \n\r\n\"I believe that after death there would be a period of \"reflection\" since this is his darkest moment, and this moment is what the song is about, that this would be what he is talking about. The moon, the biggest light that we are all a part of and all connected to, if he is grounded on earth he can not be a part of the light yet, but he can notice all the others, who have been enlightened, and even speak with them.\"\n\r\nIt's source is bright and endless, she resuscitates the hopeless \r\nWithout her we are lifeless satellites dreamin' dreams \r\nAnd as I pull my head out, I am without one doubt, don't want to be down here soothing my narcissism, I \r\nMust crucify the ego before it's far too late, I pray the light lifts me out \n\r\n\"god, if you will, gives us consciousness, so that we can experience this pain, and \"crucify the ego\" to better ourselves and move on. When he realized this he must have felt like he wanted death. I know the feeling, to want to go back home.\"\n\r\nBefore I pine away \r\nBefore I pine away (Pine away) \r\nBefore I pine away (Pine away) \r\nBefore I pine away (Pine away) \n\r\n\"I think he wants to get out before he loses connection to \"the moon\"\n\r\nSo crucify the ego before it's far too late to leave behind this place, so negative and blind and cynical \r\nAnd you will come to find that we are all one mind, capable of all that's imagined and all conceivable \r\nJust let the light touch you and let the words spill through, just let them pass right through, bringin' out our hope and reason \n\r\n\"so get rid of your negative ego, stop killing each other. Sell every gun ever made and feed and clothe every single person, not one child left behind. in the end posession wont matter, discover this somehow, remember...open your third eye, the spirit will be healed on every level. and you will come to find, that we are all one mind, capable of all thats imagined and all conceivable. let the words fill you up and enlighten you before we pine away.\"\n\r\nBefore we pine away (Pine away) \r\nBefore we pine away (Pine away) \r\nBefore we pine away (Pine away) \r\nBefore we pine away \n\n\n", "comment_196": "\nthe song is about reaching a higher consciousness.  over thinking and over analyzing seperates the body from the mind.. ego is the root of all thought. when you take away thought you are left with the energy inside of you and your spirit, which should guide you through life and put you on your pre-existing path.\r\nwhen it starts off maynard is talking about his deep state of depression and the hole of darkness he is trapped in. he is about to accept his pitiful state and do what he can in his state of blackness.  at the bottom he realizes that he cant live the rest of his days like he is, then he is shown a secret which is the light (his spirit) or chakras, and is instatly connected to the universe and everyone else when he crusifies his ego and ultimately let's go (kind of like the message in \"the grudge\")\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nWell, If you take each stanza, metaphorically: \n\r\nHe is in a worse place he has ever been and feels beaten down. He is getting used to this dark, deep, shallow consious state that he is starting to feel comfortable with it. The emptiness is calling him farther within the hole. When he finally breaks down and lets all the darkness subside he finds the light he has been looking for to remind him why he is there and is not alone. He pulls his head out of his ass and stops pitying himself and knows be must leave his ego down there before he wastes away into the Earth. We are all equal and everyone has the same abilites if we seek them. The light is there for another as well to show them what he has encountered and that there is a reason to get out. \n\r\n- Some one who is depressed and has finally gotten over themself has figured out why he is so trapped within that consious state. As he reconnects and walks in the world again, a new person he realizes he is better than he thought he was, and can do things. He figures there is more to life and wishes people would see things the same way before they let life take them as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nseriously, i think i just a spiritual epiphany listening to this song! Danny Carey is my god, Lateralus his bible. maybe it's just the skunky hamilton green talking?\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\n\r\nComment to the discussions going on:\n\r\nSongs and religious/philosophical books are the most ambiguous things there are in my opinion. They promise so much and deliver little in terms of meaning.\n\r\nWhat songs seem to be about in general, is a specific thing that happened to the song writer, but is written about very broadly so that if someone is going through a similar thing, it may help them too.\n\r\ne.g The lyrics for this is based around the Greek myth possibly, but look how many other meanings it could have....\n\r\nTo me it seems to show a person going into a bad state, then having some kind of cosmic light pass over them gaining strength from the universe (moon light, a reflective light)...or something, coming out of it better than before, because now they know the reason that got them in that place, it was their own ego. Set it aside and you won't ever have to feel that way again, then you will realise we are all like one consciousnous not one above another, all the same.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nThis song is an absolute masterpiece.\n\r\n\"Just let the light touch you and let the words spill through, just let them pass right through, bringin' out our hope and reason.\"\n\r\nThat has to be the most powerful verse of the song.   The way Maynard sings this verse and the effects applied to his voice show that this is a sort of climax to the song and the point where a sort of equilibrium has been achieved.  There is so much feeling applied, you can't help but see this song as masterful art.  \t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nThe true meaning of this song is quite hidden, since most are not aware of the true nature of the spirit. It is mostly about connecting with your higher self (the moon, as symbolism). \n\r\n\"This light is not my own.\" Our higher selves (the real \"us\", call it spirit or whatever you call the animating force behind your body) connect to thousands of other bodies that we live in different \"times\". Our higher selves are indeed \"bright and endless\", when seen from without they have a glow to them, almost like the inside of a light bulb. \n\r\n\"As I pull my head out, I am without one doubt...\" This line reflects seperating our astral body from our physical body. First step to connecting with your higher self. Once this is done, Maynard realizes we are not physical beings, but immortal and eternal. The ego is what holds us back from evolving spiritually. We get caught up in thinking that we are our bodies, our houses, jobs, whatever. In order to proceed in our journey, its necessary to leave our physical bodies and lives and egos behind. We are nothing but a spirit experiencing 3rd density through multiple bodies/lives. As long as you believe you are the costume you've been given in life, you will never be able to leave this behind. \n\n\n\n", "comment_202": "\nFirst up, this is an absolutely prefect song, lyrically perfect and instrumentally perfect, everything, perfect.\n\r\nI'm 99% sure this song is about the 'ego death' that is attributed to the extremely intense psychedelic drug N-N-Dimethyltriptamine, or, 'DMT' (and other psychedelics). A naturally occurring compound in plants and every human being on this planet. Theorised to be what causes dreams.\n\r\nAfter first trying to decipher this, before my knowing about DMT, I just assumed this song was about changing a negative mindset on life to a positive one to find peace and happiness etc. But now that I've been doing a bit of research and reading a few accounts of people who have experienced the awesomely intense power of DMT, I'm now lead to believe this song, along with Parabola, is about an ego death from a DMT trip.\n\r\nLines like 'crucify the ego before it's far too late' give it away for me.\r\nAlso, reading many accounts of DMT trips, one of the main revelations people have is that we are all one mind, all connected etc, ie, 'So crucify the ego before it's far too late to leave behind this place, so negative and blind and cynical\r\nAnd you will come to find that we are all one mind, capable of all that's imagined and all conceivable'.\n\r\nThat's my interpretation of this song and I think I'm pretty spot on (sounds like I need to crucify MY ego).\n\r\nScratch.\n\r\nOh and also, watch this:\nyoutube.com/…\n\n\r\nCorrect me if I'm wrong.\r\n-Reef.\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nThis song is about the Narcissus myth.  Start here:\n\nen.wikipedia.org/wiki/…\n\n\n", "comment_204": "\nAs far as tool goes the lyrics are meant to be up to the interpretation of the listener. Maynard James Keenan once said, \"I just hope our fans are people who are inspired by music, and just use our music as a background or inspiration for whatever it is they do.\"\r\nI can say that tool has been an inspiration to me and helped me though hard times. There are specific songs that have had varying interpretations at different times in my life. \r\nAs for refection.... This song is not just him lamenting about his own weaknesses. He feels that it is human nature to let our egos take control over our lives, it prevents us from reaching our full potential. \r\nIt starts out as his self \"reflection\", about feeling pitiful and defeated as a man. He is moving towards letting these feelings go and drifting into the unknown, becoming vulnerable to it, \"defeated, I concede\". \"I may find peace within the emptiness\"\r\nHe then becomes hopeless, but at his \"darkest moment\" he has an epiphany. There is spiritual energy that we can all draw from to become enlightened, become whole. Even when the moon is full, it still pulls it's light from the sun. \"it is a source that it bright and endless\" without this source our existence is meaningless. \r\nThe last paragraph is the most profound. We can all leave this existence to become higher, integral beings,\"leave behind this place so negative blind and cynical, and you will come to find that we are all one mind capable of all that's imagined and all conceivable.\"\r\nIf we stifle our pride we can come to realize there is something greater than ourselves in the universe. \r\nNo matter how one interpets this song, it is unmistakably an ethereal message of hope. \n\n\n\n\n", "comment_205": "\nAs of my own interpretation of this song;\n\nâ\u0080\u0098\nI have come curiously close to the end, down\nBeneath my self-indulgent pitiful hole,\nDefeated, I concede and\nMove closer\nI may find comfort here\nI may find peace within the emptiness\nHow pitiful \n'\nAnd as I lose hope in myself as well as the world, I feel like a failure, I am getting used to this depression, this lifelessness, this feeling of utter failure, I am drowning in this depression so deeply that I cannot see the light, Iâ\u0080\u0099ve been here for so long that Iâ\u0080\u0099m starting to find comfort here.\n\n'\nAnd in my darkest moment, feeble and weeping\nThe moon tells me a secret, my confidant\nAs full and bright as I am\nThis light is not my own and\nA million light reflections pass over me\nIts source is bright and endless\nShe resuscitates the hopeless\nWithout her, we are lifeless satellites drifting\n'\n\nMost of us share a feeling, a feeling of failure in comparison to others, this is mostly because we do not view their lives as a whole, we view flashes of their lives, the success of their lives, but when it comes right down to it, when we get to know those who we look up to, they â\u0080\u009cthe moonâ\u0080\u009d explain(s) how itâ\u0080\u0099s success is more accredited to othersâ\u0080\u0099 help â\u0080\u009cA million light reflections pass over meâ\u0080\u009d than its own efforts, and how this source (othersâ\u0080\u0099 help) is an endless source who revives us and helps us prosper, without the help of people we are â\u0080\u009clifeless satellites drifting`â\u0080\u009d wandering aimlessly.\n\nâ\u0080\u0098\nAnd as I pull my head out I am without one doubt\nDon't want to be down here feeding my narcissism.\nI must crucify the ego before it's far too late\nI pray the light lifts me out\nBefore I pine away.\nâ\u0080\u0098\nAnd as I come to this realization, this epiphany, I understand that to proceed with my life I need to destroy this selfish desire to proceed without others, to live life as a competition, to fight over whoâ\u0080\u0099s better, â\u0080\u009ccrucify the egoâ\u0080\u009d, and instead live in harmony and in a egalitarianism-oriented lifestyle. I, as well as others, must do it fast before the (minimalistic and colossal) wars destroy us. \n\nâ\u0080\u0098\nSo crucify the ego, before it's far too late\nTo leave behind this place so negative and blind and cynical,\nAnd you will come to find that we are all one mind\nCapable of all that's imagined and all conceivable.\nJust let the light touch you\nAnd let the words spill through\nAnd let them pass right through\nBringing out our hope and reason \nBefore we pine away.\n â\u0080\u0098\nSo kill your ego, your selfishness, your competitiveness, your arrogance, before you drown far too deeply to be saved, to leave this mindset, this mindset where you are alone in the world, this sad, pessimistic mindset, and when you do, you will realize that we are all the same, together we can achieve everything that we can wrap our heads around, to bring about a new sense of hope and understanding.\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nAs of my own interpretation of this song;\n\nâ\u0080\u0098\nI have come curiously close to the end, down\nBeneath my self-indulgent pitiful hole,\nDefeated, I concede and\nMove closer\nI may find comfort here\nI may find peace within the emptiness\nHow pitiful \n'\nAnd as I lose hope in myself as well as the world, I feel like a failure, I am getting used to this depression, this lifelessness, this feeling of utter failure, I am drowning in this depression so deeply that I cannot see the light, Iâ\u0080\u0099ve been here for so long that Iâ\u0080\u0099m starting to find comfort here.\n\n'\nAnd in my darkest moment, feeble and weeping\nThe moon tells me a secret, my confidant\nAs full and bright as I am\nThis light is not my own and\nA million light reflections pass over me\nIts source is bright and endless\nShe resuscitates the hopeless\nWithout her, we are lifeless satellites drifting\n'\n\nMost of us share a feeling, a feeling of failure in comparison to others, this is mostly because we do not view their lives as a whole, we view flashes of their lives, the success of their lives, but when it comes right down to it, when we get to know those who we look up to, they â\u0080\u009cthe moonâ\u0080\u009d explain(s) how itâ\u0080\u0099s success is more accredited to othersâ\u0080\u0099 help â\u0080\u009cA million light reflections pass over meâ\u0080\u009d than its own efforts, and how this source (othersâ\u0080\u0099 help) is an endless source who revives us and helps us prosper, without the help of people we are â\u0080\u009clifeless satellites drifting`â\u0080\u009d wandering aimlessly.\n\nâ\u0080\u0098\nAnd as I pull my head out I am without one doubt\nDon't want to be down here feeding my narcissism.\nI must crucify the ego before it's far too late\nI pray the light lifts me out\nBefore I pine away.\nâ\u0080\u0098\nAnd as I come to this realization, this epiphany, I understand that to proceed with my life I need to destroy this selfish desire to proceed without others, to live life as a competition, to fight over whoâ\u0080\u0099s better, â\u0080\u009ccrucify the egoâ\u0080\u009d, and instead live in harmony and in a egalitarianism-oriented lifestyle. I, as well as others, must do it fast before the (minimalistic and colossal) wars destroy us. \n\nâ\u0080\u0098\nSo crucify the ego, before it's far too late\nTo leave behind this place so negative and blind and cynical,\nAnd you will come to find that we are all one mind\nCapable of all that's imagined and all conceivable.\nJust let the light touch you\nAnd let the words spill through\nAnd let them pass right through\nBringing out our hope and reason \nBefore we pine away.\n â\u0080\u0098\nSo kill your ego, your selfishness, your competitiveness, your arrogance, before you drown far too deeply to be saved, to leave this mindset, this mindset where you are alone in the world, this sad, pessimistic mindset, and when you do, you will realize that we are all the same, together we can achieve everything that we can wrap our heads around, to bring about a new sense of hope and understanding.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nI have a feeling this is about escaping depression. Particularly the \"moon\" section.\n\nThe more lunar activity a human allows themselves, the more likely they are to become depressed. Maynard seems to depict the moon as an empathising force. The \"million lights\" statement, for example, may be a way of telling a depressive that they are not alone.\n\nMaybe I'm reaching a bit far with that one but, hey. Worth a go, right? :)\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nI think at least one of the lyrics is wrong. \nDon't want to be down here feeding my narcissism.\nWell, I think the lyrics are actually:\nDon't want to peer down here, survey my narcissism.\nAll though, I'm a little iffy on the first word. It could be \"you\". But it could also be don't. I'M NOT SURE. I know it says \"peer down here\" though. Other lyrics that could be wrong...\nThe posted lyrics say \"fetal and weeping\" but I always thought it was \"feeble and weeping.\" I relistened to the song though, and I admit it could be fetal. It's difficult to tell. Anyone have any thoughts on that one? One final lyric that might be wrong...\nThe first lyric, it says, \"I have come curiously close to the end, down.\"\nI agree with that almost entirely. I'm just a little unsure about the last word. I'm not sure if it's \"down\". I always heard it as \"though\". Anyone else?\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nHmmm...third eye. You cant really see through the smoke and mirrors until you learn to use it. Enlightenment. Peace with yourself and unto others. Non material things matter, but our egos are foolish this day of age...it hinders our ability to be real human beings, compassionate and capable of loving our brothers and sisters. Until the lesson is learned and the ego cast aside in favor or acting humanely and brotherly towards each other, instead of causing harm and emotional, physchological pain pain to others by the pursuit of material goods rather than love, we are stuck here. Beneath our pitiful hole. The moon tells a secret for those whom seek it. Down here, where we will remain intil we pine away, rotting and aging to death. Then the light at tge end of the tunnel....being reborn again, down here, stuck forever. Until i pull my head out. And realize what matters. Not money. Not fancy cars or shoes or any other bullshit. Survival is necessary. Communication is too. And love towards others over money and posessions which we leave behind again and again...until the light touches me and opens my third eye\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nI think this song is actually a metaphor. \nYou could interpret its lyrics as a story of a seed. A seed which is buried and it's being drawn by the moon's gravity each night, the moon helps it grow. At the end of the song the sapling actually reaches the surface and experiences what the moon was merely reflecting. This could also explained the insistence with the fear of pinning away, as the only goal of a sapling is to reach the surface\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nThis band references the bible often. He's pulling a head out of a black hole and feels shame.... \t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nBut he wouldn't feel that way about who he is if people would walk in human shoes\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nItâ\u0080\u0099s an esoteric explanation of his growth into Mystery Babylon. The Moon his confidant represents the Goddess ISIS . The million light reflection represents Osiris the suns light reflected to the moon . In the religion Isis the Godess represents knowledge Osiris is the sun he represents primordial knowing so Maynard in this song represents the initiate receiving her light . In order for any human to grow crucifying the ego has to be done the ego is the false sense of self .  With out her light he would be a lifeless satellite drifting. In the end itâ\u0080\u0099s about hope and reason itâ\u0080\u0099s about mankindâ\u0080\u0099s wisdom his own intellect is the light ! \t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nI have read the other comments on this page and I appreciate all the different views and think it's wonderful that this page exists (first of all).\r\nI think this song, contrary to what a few other people have said, has an underlying tone of wistfulness; yearning. Maynard (praise him) seems to possess an understanding that human potential to co-operate and repress the selfish qualities of human nature are not being fulfilled. This song seems to me to recount his moment of awakening when he realised the futulity of most human behaviour. I fully concur that this song is a call to the world to join the higher consciousness - as a Buddhist, this concept is familiar to me and if anyone has any questions, please contact me. I also agree that the notion of \"reflection\", and the admission of \"this light is not my own\" expresses the idea that as humans, we are very dependant on others to do our thinking for us - to me this, this song promotes free thought.\r\nI went to the Tool concert near me just recently, and, being a twig of a girl, I was almost snapped in the mosh, but when this song was played everyone stopped and there was this ethereal stillness and sadness in the crowd. This is my absolute favourite song in the world; I saw its impact on thousands of angry teens, I know the impact it's had on me; now I think it's up to us who appreciate the majesty and beauty and insightfulness of Tool to spread this song's message to the whole world.\r\nThe last time I can remember crying was seeing this song peformed live. Listening to it again (right now, actually) I get goosebumps. Maynard is a GENIUS.\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nOK, now that I'm not about to pass out I can explain this better then what I last did. To me, this song is saying that human beings are selfish, racist, stupid, and other things. We refuse to help each other. And he is simply saying that if we do help each other, the potential of the human race is neverending. And if we don't? We'll end up destroying each other in one way or another.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nTerrible Tool song. Bad lyrics, talks above the audience, just horrible. If anyone's ego needs to be crucified, it's Maynard who took a great band and ruined them. They also suck live.\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nI think of it as being about getting over an addiction. \r\n\"I may find comfort here \r\nI may find peace within the emptiness, how pitiful \r\nIt's calling me\"\r\ndrugs are the only thing that can comfort him now. \n\r\nhe's \"pining away\" for whatever drug he may be talking about. \n\r\nmy favorite on the album.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nQuit moping and feeling sorry for yourself.  Others have and are going through the same shit, so get up and be happy for what is and can be.\n\r\nI thought it was time for something a little less deep and more to the point.\t\t\t\t\n\t\t\t\t\n\n"}