{"comment_0": "\nSomething I think people are missing - the idea of thinking \"about the end way too much\" and \"it's fun to fantasize\" - I think some people are missing what that means. That is suicidal thinking. I'm seeing a counselor now about this. When you think about death, you are fantasizing about leaving this stressful world and going somewhere with no worries, a place of rest. (This is particularly true if you believe in an afterlife.) And like I said earlier, in this song, ToP is saying that the way to stay alive is to let go of that need to control - particularly that need to control the end of your life - let go of it and give control to a higher power. Don't hurry toward death -- TAKE YOUR TIME. Let God do the controlling and just RIDE in the passenger seat. You're fallen. And you're continuing to fall. So just drop into God's arms, sit back, let God drive, and enjoy the ride.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI absolutely adore this song it's gotta be my favourite they've ever written.\nAs for the meaning, short version I think it's literally just struggling to make it through life, wanting to leave and so you've just gotta enjoy each moment as it comes. Struggling, but enjoying the ride\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWhen I first heard this song, I was only really listening to the music and never realized how dark the lyrics are. \"I'm falling, so I'm taking my time on my ride\", \"I think about the end just way too much, but it's fun to fantasize\"... i think this song is about blunt acceptance of degradation. I also think the topic is legit! Sometimes you struggle so hard with one concept (life) that you never realize you can just let go, and I think this was about letting go. During the rap I think this is further proved. \"I'd take a bullet for everyone in this room\", a promise that builds yourself up, but that's a ton of weight to carry. You can't keep going with the weight of empty words, promises, personas. This is about letting go, and seeing whats happening to you, evermore accepting it. You can decide for yourself wither this is positive or negative, but I love this song a lot. I like how hard their song's make me think, and I like how controversial they are, but my vote on this one is letting go, and having to accept that, as well as preparing to hit rock bottom by celebrating while you still can.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI love the rap in this one. Tyler often just puts out a small rant on a given subject that seems to bother him or be on his mind like this one. He kinda just talks about walking the walk and how so many people are just all about the talk.\n\"'I'd die for you', that's easy to say...but I don't seem to see many bullets coming through\"\nIt's easy to say that we'll be there through thick and thin when things are good. How many times do people say things of such intensity that are clearly not something they'd likely ever have to prove?\nHe then makes it more personal by saying \"'I'd live for you', and that's harder to do\". How is that more personal? Because he suffers from depression. For someone who wants to die it's a more powerful and legitimate promise to stay alive for someone instead of selfishly \"dying for someone\" and taking the easy way out.\nAt the end he then of course drops those intense rhetorical questions of \"who would you live for?\nWho would you die for?\nAnd would you ever kill?\"\nOf course he doesn't meant literally kill, but instead more along the lines of making one of these extreme promises to someone just to eventually fail them, or \"kill\" them.\nSome of the most impactful lyrics by Tyler and something that has really made me stop and think.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song plays with the images of light and dark (both in the first verse's lyrics and in the video) - this is a theme that runs through much of the Blurryface album & many of the band's videos. In Ride's first verse, Tyler sings of wanting to stay in the light of the sun. This has a double (even maybe triple) meaning -- staying in the light refers to staying away from dark/depressive/suicidal thoughts, but it also refers to staying in the light of God's love -- both of which are \"hard sometimes\" to do. (And since the band's members are Christians, \"sun\" is likely a thinly veiled metaphor for \"Son,\" because a follower of Jesus seeks to \"stay in the Son\" and seeks \"Son's peace of mind\"). The second verse plays with biblical teachings regarding laying down your life for your brothers, loving your enemies, loving others more than yourself, etc. Regarding the chorus, I believe there are two key things to understand about this song: \"Ride\" refers to letting go of control of your life and letting someone else do the \"driving.\" And \"falling\" refers to both the fall toward death and the biblical fall of man -- our fall away from God. I think the band is saying that letting go of control and turning it over to a higher power (basically, the first step on a 12-step program) allows an individual to trust and love and enjoy the \"ride\" of life. But it's \"hard sometimes\" to stay in that place, particularly when you \"think too much.\" I believe Tyler sings \"help me\" both to God and to his friends and fans, because his music is where he's able to really let go and enjoy the \"ride.\" (The video re-emphasizes this idea, as the band struggles to stay in the light but, once they are able to \"polarize\" and focus on a higher power - represented by sunglasses - they are able to stay in the light via their music.)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI feel like the songs is a deep look at the human minds ability of escapism and depression. The way we escape from reality and the spiral of thought it can take us down. Life \"is hard sometimes\" so to escape we fantasize. In following this distraction we get lost in your own thoghts, \"taking a ride\" if you will. Eventually this road leads your mind to realize \"I've been thinking to much\", the fantasy ends the depression sinks in again. The ride ends leaving you to left ot ask \"Help Me\".\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI forgot to add that they are in a forest in the video because he is lost in the forest of his own thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nSo I'm gonna add my own interpretation because I've never seen it explained.\n\nFor me the song is partly about their fame.\nTo understand that you have to have the video in mind.\n\n\"I just wanna stay in the sun where I find\nI know it's hard sometimes\nPieces of peace in the sun's peace of mind\nI know it's hard sometimes\"\n\nHere the sun would represent their fame, their success, they're in the light of the public now. And their success gives Tyler some peace of mind, because that was the goal, to be listened to, to make shows. But it's hard sometimes because typically, Tyler (or Josh I think) wouldn't be the kind of person comfortable with fame. Doing interviews and explaining deep and personal song lyrics is not his most comfortable place to be. \n\n\n\"Yeah, I think about the end just way too much\nBut it's fun to fantasize\nAll my enemies who wouldn't wish who I was\nBut it's fun to fantasize\"\n\nHere it could have a double meaning. The first one being related to suicidal thoughts, thinking about death, fantasizing about it when it sees as a freeing, a relief. \nBut it could also mean the end of fame, which could also be a relief for someone like Tyler because fame also means being inspected, judged. \n\n\n\n\"Oh, oh\nI'm falling so I'm taking my time on my ride\nOh, I'm falling so I'm taking my time on my ride\nTaking my time on my ride\"\n\nTyler think they just have a ride to success, that all of this will fall down anyways so he enjoys while it lasts.\nIn the video, they're in the dark until the second \"ride\" when the light of the sun suddenly appear and you can see in te video how the light dazzle them, as it being annoying and forbidding them to properly see. That's duality of fame being represented, they're shown in the lights but it keeps them from seeing what's in front of them.\n\n\n\"I'd die for you\nThat's easy to say\nWe have a list of people that we would take\nA bullet for them\nA bullet for you\nA bullet for everybody in this room\nBut I don't seem to see many bullets coming through\nSee many bullets coming through\"\n\nHere it's about how everyone talks about self sacrifice but we rarely have the occasion to prove that we would do it. \"Everyone in this room\" makes me think of a concert. How Tyler would sacrifices for the fans if needed. He wants to have this feeling, that he would do it. But you never know until it happens.\n\n\n\"Metaphorically I'm the man\nBut literally I don't know what I'd do\"\n\nHere explained more clearly, Tyler's the man because he's the one fans look up too, and he wants to be able to handle the task, but if we speak literally, real bullets, real death, he's not sure if he could.\n\n\n\"I'd live for you\nAnd that's hard to do\nEven harder to say\nWhen you know it's not true\nEven harder to write\nWhen you know that tonight\nThere are people back home who tried talking to you\nBut then you ignored them still\nAll these questions they're for real\nLike Who would you live for?\nWho would you die for?\nAnd would you ever kill?\"\n\nTyler said in interviews several time (also for House of Gold) that living for someone is actually harder than dying for them (which I personally think is extremely true and we don't think about that enough). I think he can be talking here about song writing. Writing songs about your loved ones, saying you would die and live for them but in reality (\"the literally\" from above) when those persons try to reach you, you ignore them. So you say in a song you would live for them but it's not true in reality.\nSo it makes you think to these concepts of living and dying for someone in real life. Not in a sentence in a song. Who would you actually be dying /living/killing for if even your loved ones at home are not it? \nAnd that would be the part \"I've been thinking too much, help me\".\n\n\nThen it's when it becomes even more interesting in the music video. After the second chorus in the sun, the dark is back and you see Tyler singing the \"I've been thinking too much, help me \".\nWhen the last chorus starts, we see Josh putting sunglasses on Tyler, and Tyler on Josh. The sunglasses clearly representing their relationship to fame. They explicitly said in interviews that sunglasses are there to make them \"cooler\" and hide them. In the first chorus, when the sun appeared, they didn't wear them, they weren't prepared and were dazzled. Now, on the last chorus, they're prepared to live the fame, live in the light.\nIt's even more clear when you see that for this last chorus, the light is not the sun anymore, it's actual spotlights usually used in big shows. So it's about them living under the spotlights. And look how they act way more \"cool\" in that part than in the first chorus. \n\nBut the song ends on another \"I've been thinking too much, help me verse\", Tyler in a dimmer sunlight, sunglasses still on. The all picture and the lyrics added represent the confusion of it all. How they want success and and can't handle it at the same time.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nOK, wait, if you transliterate in English \"sun\" to \"Son\" then suicide would TOTALLY miss the mark!  The whole message of the song changes more to the whole \"let go and let God\" message:\n\nI just wanna stay in the Son where I find              (Jesus)\nI know it's hard sometimes                                   (We all loose focus)\nPieces of peace in Son's peace of mind           (The peace we find in Jesus)\nI know it's hard sometimes                                   (Again, we all loose focus)\nYeah, I think about the end just way too much     (End of the WORLD Revelation)\nBut it's fun to fantasize                                           (Hollywood LOVES \"THE END\")\nAll my enemies who wouldn't wish who I was      (\"who I was\" A raptured Christian)\nBut it's fun to fantasize\n\nWHOA, not to mention that the lyrics listed here are WRONG!  He CLEARLY says:\n\"Pieces of peace in Son's peace of mind\"  The word THE is not there in this line.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song makes me cry. It's so very deep. I think the general meaning is a struggle with depression and or dark thoughts. When the music is happy and upbeat is a good day. You realize you're going to die anyways so you might as well take your time. \r\nEven when he talks about the sun he still says \"I think about the end just way too much\" those thoughts never leave, they're always in the back of your mind but some days it's easier to push them away and stay positive.\r\nHe quickly can switch to \"I've been thinking too much. Help me.\" And it just goes to show how quickly your mind can change course and how quickly depression can set in. It's a fight and the balance of the song between upbeat and serious really shows that!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nClearly undertones of suicide.  (sad)\n\nAnyone ever think about this song and replace the word \"sun\" with \"Son\" ?  Think about it.\n\nCould he simply be conveying a message of \"Let go and let God\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nhe says he thinks about the end way too much and at the end when he's like 'I've been thinking too much help me', in the video they are wearing dark glasses and this is because he keeps thinking about death and maybe how he'd much rather be dead than living in a world like this (maybe) and when you start thinking like that you forget the joys in life and the good stuff. it's like someone put dark glasses over your eyes so all you see is darkness. when it is night time in the video that is from his point of view where everything is dark. right at the end it is daytime and he is calling out for help from the people that can see the light and the good stuff. that's what I think the video is about anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nAs the first line goes - I just want to stay in the sun where I find - Tyler is saying how he wants an easy life where everything is there for him and so on- I know it's hard sometimes- Tyler is now saying that though he wants an easy life it's not and life is hard in many ways- Pieces of peace in the sun's peace of mind- Tyler is saying that there are pieces of peace in the earths mind\t\t\t\t\n\t\t\t\t\n\n"}