{"comment_0": "\nEveryone has spoken about the lyrics but how about that awesome breakdown from 4:00 to 7:10? To me it sounds like a progression of battle music from primitive times to the industrial war machine of now. Here me out. The music goes through stages. \n\r\nThe sound begins with sticks drumming. Imagine mankind in its infancy and small groups of men battling. As the drums beat faster around 4:40 we are now in an age of larger tribes warring. At 5:24 mankind has progressed into full on organized warfare. The sound here is heavier, more complex. The guitar screeching at 6:02-6:04 transitions to a new era of battle music. The guitar is the sound of a new battle cry, more aggressive and dangerous. The sound from here on out is more industrial, the drums hit harder like artillery rounds. The guitars scream like assault rifles. At 6:45 is another transition. The industrial war machine now marches forward melodically, with calculated moves, set out to destroy everything in its path.\n\r\nAnyways, that's my interpretation of the sound and I'm sticking to it. The sound from 4:00 minutes out progresses from monkeys marching to the sound of sticks hitting coconuts to the sounds of the industrial war machine of today. Tool is a band that speaks with more than just it's lyrics.\n\n\n\n", "comment_1": "\n\"Repugnant is a creature who would squander the ability\r\nto live tonight in heaven,\r\nconscious of his fleeting time here.\"\n\r\nSeriously, how beautiful and poignant is that.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI have bad news for everyone who wrote about this one. Unfortunately you have to really delve into this song and understand that everything he references through imagery is a metaphor. This song is about separation. And not just from each other but from God. We as humans are extension of the ego, and the ego tries to separate everything into more pieces because that is its true nature. But the separation only exists in our minds. We all know Tool is/was a huge Bill Hicks fan, and this was something he discussed from time to time. We as conscious humans believe there are multiple parts to everything, but we really are one whole entity. The more we try to cut things in two the further we are from our true selves and our true happiness. We are all actually in the \"garden\" the songs referencing right now, but we separate ourselves from it in our minds because we need to feed the ego.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThe meaning of the phrase 'right in two' is straight from the bible: 1 kings 3 16-28:\n\nKing Solomon, the wisest man to ever live is holding court.\n\nThe case is that of a child, and two women claim to be the mother, each saying that the child of the other died in the night, and her own live child was stolen.\n\nThe king said bring a sword, and orders that the living child be 'cut in two', and half be given to each woman.\n\nThe real mom immediately gives up her claim, willing to give up her child rather than see it killed. Fake mom says, sure, this seems a fair settlement. Solomon then correctly awards custody to the rightful mother.\n\nWe silly monkeys are like fake Mom, fighting to the bitter end, willing to divide things in two, destroying them in the process, in the interest of 'fairness', but without regard for the end result.\n\nThis seems a departure for Tool, using the bible with out sarcasm, but the song is about human nature, not biblical truth. In this case, the story from the bible happens to fit perfectly.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI love this song. Anyone who's interested in the meaning of the lyrics should watch the first 15 minutes of the movie \"2001: A Space Oddysey\" (the one made by Stanley Kubrick, not the newer one)... It might give you some insight into the meaning of this song, as well as Tool in general.\n\r\nThe first 15 minutes of the movie takes place at the \"Dawn of Mankind\" - there are two packs of primitive humanoid apes (apparently representing our ancestors). One pack of apes is drinking at a watering hole, and then the other pack invades their territory and scares the first pack away.\r\nLater on, the first pack of apes (the one that had been evicted from their own watering hole) encounter a strange black monolith that had suddenly appeared in the middle of their den. After being frightened at first, they all reach out an touch the smooth black monolith. \n\r\nAfterwards, the first pack of apes is suddenly gifted with the curiosity of technology, and one of the apes discovers that he can use animal bones as a club to fight off the second pack of apes. Him and his posse all arm themselves with femurs from some dead animal, and proceed to beat the shit out of one of the rival apes. In doing so, they scare off the second pack of apes, and win back their watering hole.\n\r\nThere is no real explanation of the mysterious 'black monolith' throughout the movie, but perhaps it is merely symbolic of \"technology\", or simply a metaphor for the concept of a \"Tool\". Its presence in the minds of the apes caused them to begin thinking abstractly, such that they were able to develop their own tools.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nOk. Im robotripping right now listening to this song and i had a breakthrough, trash me if im wrong. But when he says \"silly monkeys, where theres one, your bound to divide it, right in two,\" hes saying if you have one good thing you should share it. But no. We don't. The humans would rather cut it in two and have 2 lesser things. Then they cut those 2 things in two. Continues.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nBefore reading this, know that every comment on here is based upon opinion. Unless MJK actually got on here and explained what goes on in his mind none of us is right. \r\n Angels on the sideline - Angels are sent here on earth to be our protectors and do help us along the path of righteousness. They sit there watching over us until they are called upon to do God's bidding. This is what they are thinking: They are puzzled because \"Father\" (God) gave his children (\"humans\") the right to choose what to do. They are amused because they are wondering what we will do with this newly given right. They humans dont actually know what to do with it yet because they just have recieved it. I think this is also referring to the Garden of Eden where Adam and Eve were made, and, therefore, humanity was created. God makes no mistakes so He has given them all they could ever want. But despite that fact, the greed in all of us comes out when we don't choose to do the right thing (what is correct in God's eyes). He now blesses humans with reason. He gives them the power to decide what to do, making us above every other living thing placed on this earth. The angels are baffled and confused because they are reaching this rediculous idea of fighting and killing each other over peices of land (because of greed). The angels are still confused at the fact that when God gives humans working hands, they create weapons to cause pain and suffering to other humans over stupid things.\n\r\nNow from a more deeper and meaninful experience, Maynard obviously wants us to dig deeper into his lyris and find more meaning to his songs. I will attempt to make a stab at it, and probably fail miserably...\n\r\nGod places things here on earth for our pleasure and to pass the time until he welcomes us into the gates of heaven. Now, part of the deal is that we have to accept him as our creator, and as our father, and spread his teachings and wisdom with the world. These material things that he gives us wasn't meant to make us jealous and want us to fight over them, but to use them as intended: live with what you have to have and give up what you don't need for God. (if you're looking for that in the bible, peter is a good example) But we can't take these things into heaven, the greatest place, an intangeable object to our minds (unless we reach 46 & 2 of course!). We have to learn to live with each other and not fight over things that matter but rather, embrace one another with love and respect because we all have something in common. We are all striving to make it into heaven and it can be easier to do that in unity with one another rather than fighting all the time over things that have no true value. Peace throughout the world is the greatest goal for the human race, and until every single person living on earth right now agrees and follows that, we will always have fighting and war. \n\r\nDamn what a long post sorry about that I just had to get that out of my system. Hope someone agrees with me, if you don't, argue in a civilized manner and I'll respect you. Otherwise, dont say anything because all you\"ll be doing is making yourself look like an idiot.\n\n\n\n\n\n\n\n", "comment_7": "\nI know this is obnoxiously long...but I just copied my english project which was that I had to analyze a song. so here. There could be many different interpretations of this song. In my opinion, this song is about war, hatred and selfishness in general. I believe the over-all message of this song is that there is a lot of pointless fighting and hatred going on for no reason. Possessions such as land could much more easily be shared rather than taking lives over them. Whatever canâ\u0080\u0099t be shared, there is enough of for everybody. The line: â\u0080\u009cAngels on the sidelines baffled and confused. Father blessed them all with reason, and this is what they choose?â\u0080\u009d is saying that, as humans, we have the ability to reason and use logic, and should be using those abilities for good. But instead of coming up with solutions, we choose unnecessary fighting and hatred. This is also why I believe Maynard refers to humans as monkeys; we donâ\u0080\u0099t tend to think about what weâ\u0080\u0099re doing or look for easier, more peaceful solutions to our problems. Also, as humans, we tend to take what we need, if not more, and whatever we want, usually without giving any regard to who we may be taking from. It is for this reason that I believe the line: â\u0080\u009cDon't these talking monkeys know that Eden has enough to go around? Plenty in this holy garden, silly monkeys, where there's one you're bound to divide it right in twoâ\u0080\u009d is used.  Some of the words used in the rhyme scheme of this song are: confused, choose, ground and down. Maynard also uses personification in this song when he says: â\u0080\u009cAngels on the sideline again, benched along with patience and reasonâ\u0080\u009d Repetition is also often used in lines such as: â\u0080\u009cmonkey killing monkey killing monkey over pieces of the groundâ\u0080\u009d and â\u0080\u009cFight till they die over sun, over sky, They fight till they die over sea, over air, they fight till they die over blood, over love, they fight till they die over words, polarizingâ\u0080\u009d  Sickimage from songmeanings.net states that the Angels are interpreting what they see in humans. Weâ\u0080\u0099re just humans, but we were given all these things (thumbs) that are supposed to make us \"better\" than other animals, yet, we still act like animalsâ\u0080¦we kill each other and thereâ\u0080\u0099s no need for itâ\u0080¦we fight for land, yet, thereâ\u0080\u0099s enough for everyone to live in peacefully. Pwnage...I wonder how many people will actually read this...or comment it.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThe Angels are interpreting how they see humans. The first stanza shows the Angels amusement when God first grants the humans with freewill. The Angels seem to think that the behavior of the Humans is a big joke at first. After all, the Angels also have been granted freewill and they have managed to live in harmony. The Angels have past God's test. Humans were given gifts, such as freewill and thumbs in attempt to make them  \"Different\" from other animals. This was another one of God's test. Yet, even with these gifts, they still act like animals. â\u0080\u009cSilly monkeys give them thumbs. They make a club And beat their brother, down.â\u0080\u009d. They kill each other without realizing that there is no need for it.  Constantly fighting for land yet there is enough for everyone to live in peacefully. Again, the Angels are referenced. However, now they are no longer amused with the situation. Instead the poem now depicts them as, â\u0080\u009cBaffled and confusedâ\u0080\u009d. They cannot understand why the humans will not live together in peace. Instead they try to kill each other. The whole \"right in two\" line that repeats truly emphasizes the idea that we cannot live harmoniously as humans. Instead, much like animals, we are territorial and must have individual possessions. The last stanza once more references the Angels. They still watch as the humans who have made no progress towards living in harmony. Instead, the Angels are now  â\u0080\u009cBenched along with patience and reasonâ\u0080\u009d. They realize they mistake made by giving the humans a chance. By doing this, they have sealed the fate of the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThe lyrics about fighting never added up to what I hear when I listen to the song. The lyrics that I hear, while they may not be correct, are:\n\"Fight over cloud over earth over sky\nThey fight Over love over blood over hell and light\nOver love over sun over flood\nThey fight or they die over one for uprising!\"\n\nI agree that the song is essentially about the angels ridiculing man(monkeys) for fighting to claim everything which isn't theirs to begin with. The lyrics i've posted can add backing to the notion, ridiculing the causes people fight for to begin with. The last line really hooks me. They fight or they die over one for uprising. I can imagine the \"one\" being Jesus who caused an uprising and was crucified for the behaviour. And now these confused monkeys are fighting in the name of that one up-riser but are truly no better than the ones who had slain him.\nAlso, dividing/cutting in two can be seen as destroying something, sharing something, or creating something (Cells dividing in two.) So the division can be bad, good, or neutral. Just depends on how the monkeys choose to divide.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis is about how humans fought each other on land since they were monkey's.  Super song I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nTREXOR, since it seems you really don't have better things to do than writing in almost all new tool lyrics \"this is the crappiest song\", would you try to explain why you've come to this conclusion?\n\r\nOn topic: great song with not too obvious meaning. I went from a theory that we, humans, are but a virus, consuming every resource and divide in many different ways (cut it right in two). Just one perception.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\noh dear... it seems the word is in from the auzzies and kiwis... the album is selling fast...\n\r\n10,000 DAYS IS THE REAL DEAL... THE LEAK IS NOT FAKE... THE FAKEOUT IS FAKE\n\r\nHey TREXOR ... 'foot in mouth and head up ass, so whatcha talkin' bout'... eh?\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nGreat song. Obviously not a fake ... But really egb is right though...Have you ever taken a history class! I think the song is about people being dumb same as most here. I don't think the meaning for this is too deep at all.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nAwsome song.\r\nIts clear though. The Angels are interpeting what they see humans. Were just humans we were given all these things (thumbs) etc. that make us \"better\" than other animals yet we still act like animals.. we kill eachother and theres no need for it.. we fight for land yet theres enough for everyone to live in peacefully\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\n^^^ i'd agree with you being anally raped by a big fat guy named Bubba... \n\r\nQUIT SPAMMING THE TOOL SONGS DICKHEAD... WE GET IT, YOU DON'T LIKE IT... IF YOU HAVE  SUCH A LARGE PROBLEM WITH THE NEW ALBUM THAN YOU NEVER UNDERSTOOD TOOL IN THE FIRST PLACE\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nuhhh, Salivaltow... dude, how old are you? 15? i don't think you said a single thing that wasn't bullshit... Muslims and Christians fighting over Jerusalem? WHAT?...\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nMyShadow! thankyou for the prompt reply, that is definately the story i meant.  i dont think the song does have anything directly to do with the story, but i do believe it uses it as a reference.  to my mind it seems there are many biblical references in this; call me cpt obvious.  and the attention to 'right in two' also seems to be an odd aspect to view our greed, and negative states of mind.  having read the story of king S again, it makes even more sense as an analogy of modern life.\n\r\nnamaste\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nFirst off... Fumar... You pwn...\r\n\"humans got given free will and they just took it and pissed all over everything, and the angels are like \"ohhhh....man... oops\".\r\nCracked me up...\r\nNow... I've read through a lot of comments on this website... Seen the arguements... And listened to the music quite a bit...\r\nAnd though if you read the lyrics to Hooker With a Penis, the thought that this album is a hoax does seem just a tad logical...\r\nI have only one thing to say to TREXOR, just as a matter of rational thought... More of a two-step question really...\r\nI'm sure you know how much money goes into creating, producing, and distributing an album... Yes?\r\nQuestion... Why would anyone, sane or insane... Or even unsane (beyond sanity), spend that much money, as a joke?\r\nMoving on...\r\nThis song... Is so clear in it's message, that it basically gives a name to those who do not understand it... \"Silly Monkeys\"...\r\nWe were given so many things...\r\nEarth...\r\nIntelligence...\r\nReason...\r\nLogic...\r\nThumbs...\r\nWhether by god...\r\nOr evolution...\r\nOr whatever design holds this reality/dimension/plane of existence (if you can call it any of those things, or if existence exists) together...\r\nAnd what have we done with them?\r\nThe only words to describe it...\r\nUnintelligent...\r\nUnreasonable...\r\nIllogical...\r\nBasically... Animalistic...\r\nIf you look at it the way I do...\r\nWhich by all logical right is your choice...\r\n(But does logic exist? Does choice exist?)\r\nAll we are... Compared to what we should be...\r\nIs, infact, monkeys...\r\nSince history was written...\r\nHumankind has never stopped fighting...\r\nOver religion...\r\nOver king and country...\r\nOver wealth...\r\nOver greed...\r\nOver a difference in fucking opinion...\r\nAnd what have we gained from it?\r\nSome woven fabric that appeals to the eye?\r\nA cave that can be as cool or hot as we want it to?\r\nA motorized means of sitting on your ass so that you can move from one place to the other more quickly?\r\nWe've gained nothing, and lost only the ability to live in tranquility...\r\nIn the biblical or proverbial eden we have destroyed over so many millennia...\r\nAt least... Thats my opinion...\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nBtw this song is great\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI have NO clue what this song is about BUT...I love it. One of my favorites.  It just proves you don't have to \"get\" the song to enjoy the \"H E double hockey\" sticks out of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nthis song could have 2 meanings in the first case iv'e noticed that he keeps comparing \"monkeys\" to a biblical reference and angels on the sideline. This i believe could be a reference to the constant debate for the truth, which no one absolutely knows. \n\r\nThe second meaning is unreasonable violence. The song states that the \"angels\" watch the monkeys continue to fight over \"pieceson the ground\" thus explaining why they are \"baffled and confused.\"  After the lyrics state that after they fight; that someone, (probably god because of the religous mash-up) gave them thumbs to forge a blade. Finally,it states that the angels sit theere just waiting and waiting for them to realize that they are fighting for practically no reason.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nSo met up with Lucy last night and i REALLY showed my best gay..i showed him through influencing others tonight..err last night..and TOOL!! lol i showed him vicarious and right in two...annnnd even i relearned alot..ALSO!! i watched Pocahontas (changed my life lol) and Alice in wonderland, i dont even know where to begin with that cause that shit didnt end or begin..it just is. just like everything else...oh i wish i could stop being so cracked it literally hurts sometimes llike i cant explain...i guess its the balance idk... its hard to stayy in this mind set cause everyones so against what they dont know cause they fear it(fear of the unknown)..when only their fearing themselves the whole timeeeeeee(reflection)...ooooohhhhh this could go on forever...i feel like a broken record.. which is why i finally decided to comment, really need to get this out..i just have to beat what i feel into me now..everything blends for me..everything is a very very very very very very realistic DREAM so its hard to deal with shitt that tries to discourage me, things will only discourage me though if i give them the power to..i guess true/pure love is trust in NO hurt..even if there is bad along the way there is truly no hurt unless we LOVE ENOUGH TO HURT...without love, you always have walls..with walls there is no feelings then you become a fucking zombie that just wants and wants and wants and wants, because you dont even know what you want..just that you do want an nothing material will permanently cure the bottomless pit we earthlings call PRIDE..god, pride has gotten me NOWHERE...except here, at this very moment typing this to YOU idk why i dont care to know why at the moment cuz im fryed to shit right now lol ina very GOOOD WAAAAYYYY okay i need to send this elsewhere cause i just blew my own fuckin mind!!..its like i say what i feel so much that i dont even realize what im saying anymore...oh damn i need rest, even then rest is for the dead..an i assure you that i am very much alive soooo alive that sleepp is like idkkk...blehhh..thanks for reading!..btw i love comments good or bad so just shower me with your thoughts people!!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI thought it interesting that Maynard, some one who doesnt believe in god, wrote the song the aspect of angels viewing down from gods kingdom on the slowly impending doom of the human race. As a violent and animalistic creature that is considered superior as a species as well as mentally superior creature that only wants to fight and be selfish for their own gain. Really i find this song as a satiric look at how with out peace that we will be our own destruction.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nIt needs to be considered that (at least) Danny Carry is a Thelemite. Maynard May be one too, and by his lyrics he seems to at least share a lot of thelemic views. I think right in two refers two our disconnection with ourselfs/God/holy guardian angel, whatever you want to call it. \t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nYou guys said everything about the meaning of a song that is, in my opinion, one of the most simple yet hard to understand. \nBut I think lots of you are incorrect about the true meaning of the line \"right in two\". You said that its just a metaphor to explain how people fight to divide everything they don't want to share, but I think it's incorrect, cause it says multiple times \"divide it RIGHT in two\". So I guess it's important to understand why there must be TWO precise parts, and Tool are always intrested in the deep meanings of numbers. \nMy interpretation (and I've had it since the first listening of this masterpiece) is that the angels came to the conclusion that Heaven and Earth must be divided and separated, so the unity of the world as we know it must be divided RIGHT in those two parts. The divine things must be set apart from the terrestrial things, just not to do the same error again, cause people cannot use wisely the divine powers, like it happened with the free will gift. That'd easly explain the \"RIGHT in TWO\" concept, and also the fact that it says \"cut IT ALL right in two\" and not just \"we must cut EVERYTHING right in two\", and also \"where there's ONE you have to divide it right in two\". Also, do not forget that we are reading the song from the angel's point of view \"wondering when this tug of war will end\": mankind constantly fighting to reach the divine power and killing everyone to rule over the world, like God is doing. That's why the world must be divided: Adam and Eve started with this sin long time ago.\nFor me, that's the perfect interpretation of the song, hope to have opened some of your third eyes ^^\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nRight in two is a line from the Bible: 1 Kings 3 16-28.\n\nKing Solomon, the wisest man to ever live is holding court. He is hearing a case about a child that is claimed by two prostitutes. They each tell Solomon that the other's child died in the night, and the child was stolen. Solomon calls for a sword and orders that the child be cut in two, and half be given to each woman.\n\nThe real mother immediately gives up her claim, willing to give up her child rather than see it killed. The lying woman says it is a fair settlement. Solomon knows which is which and gives the child back to his real mother.\n\nWe \"silly monkeys\" are like the lying woman, fighting to the bitter end, willing to divide things in two and destroy everything in the process.\n\nThe song is about human nature and our constant eagerness to fight over everything in spite of our supposed intelligence.\n\n    16 Now two prostitutes came to the king and stood before him. 17 One of them said, â\u0080\u009cPardon me, my lord. This woman and I live in the same house, and I had a baby while she was there with me. 18 The third day after my child was born, this woman also had a baby. We were alone; there was no one in the house but the two of us.\n\n    19 â\u0080\u009cDuring the night this womanâ\u0080\u0099s son died because she lay on him. 20 So she got up in the middle of the night and took my son from my side while I your servant was asleep. She put him by her breast and put her dead son by my breast. 21 The next morning, I got up to nurse my sonâ\u0080\u0094and he was dead! But when I looked at him closely in the morning light, I saw that it wasnâ\u0080\u0099t the son I had borne.â\u0080\u009d\n\n    22 The other woman said, â\u0080\u009cNo! The living one is my son; the dead one is yours.â\u0080\u009d\n\n    But the first one insisted, â\u0080\u009cNo! The dead one is yours; the living one is mine.â\u0080\u009d And so they argued before the king.\n\n    23 The king said, â\u0080\u009cThis one says, â\u0080\u0098My son is alive and your son is dead,â\u0080\u0099 while that one says, â\u0080\u0098No! Your son is dead and mine is alive.â\u0080\u0099â\u0080\u009d\n\n    24 Then the king said, â\u0080\u009cBring me a sword.â\u0080\u009d So they brought a sword for the king. 25 He then gave an order: â\u0080\u009cCut the living child in two and give half to one and half to the other.â\u0080\u009d\n\n    26 The woman whose son was alive was deeply moved out of love for her son and said to the king, â\u0080\u009cPlease, my lord, give her the living baby! Donâ\u0080\u0099t kill him!â\u0080\u009d\n\n    But the other said, â\u0080\u009cNeither I nor you shall have him. Cut him in two!â\u0080\u009d\n\n    27 Then the king gave his ruling: â\u0080\u009cGive the living baby to the first woman. Do not kill him; she is his mother.â\u0080\u009d\n\n    28 When all Israel heard the verdict the king had given, they held the king in awe, because they saw that he had wisdom from God to administer justice.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nIt's obviously about the Prophecy movies (with Christopher Walken, etc.). The theme about the angels vs. the humans and Gabriel referring to the humans as \"monkeys\", etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThe song is pretty clear and Sickimage pretty much summed it all up ontop of it. It pretty much follows the same theme as, \"Do The Evolution\" by Pearl Jam (Which is an awesome song by the way)...\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nSickimage nailed it right on.\n\r\nThe whole \"right in two\" line that repeats truly emphasizes that we cannot live harmoniously as humans. Instead, much like animals, we are territorial and must have individual possessions.\n\r\nTo quote Savage Garden:\r\n\"Animals and children tell the truth, they never lie.\r\nWhich one is more human? There's a thought, now you decide.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nmonkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin monkey killin \n\r\n=)\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ngood song\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nyes i am the real vicarious\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nrather dirty nation nailed this one on the head.  Sorry to f up your inside joke dude...but listen to 6:01 very carefully.  WARNING: once you hear this you will hear it every f'n time you listen to this song.  Oh ok, so this song means that humans got given free will and they just took it and pissed all over everything, and the angels are like \"ohhhh....man... oops\".\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nPeople do anything they can for money and power, instead of living in peace and sharing.\r\n\"Angels on the sideline again\r\nBeen too long with patience and reason\r\nAngels on the sideline again\r\nWondering where this tug of war will end\"\r\nWhen are they [people] gonna learn?\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\ndoes that really make much difference friend? i know what i know...\n\r\nand i'm willing to wager i'm older than you...\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nWIKIPEDIA-\n\r\nSkepticism that 10,000 Days is the actual title has become void since the album has already been released in some European countries.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nalready have the album at the store I work in. It is 10000 days.\n\r\nWhat is with everybody and 10,000 now. First disturbed now Tool. Who will be next?\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nHaha... Timmy. That cracks me up.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\ni got ten bucks, sayin may 2nd we wont be hearin anymore of trexors brilliant interpretations\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nFumar, what exactly am I listening for at 6:01?\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nAnybody reversed the song yet?\n\r\nI did and at roughly 2:50 (6:06 forward), he distinctly says \"it doesn't matter what you think...\"\n\r\nHmm, so, is there something like the Holy Gift of Lateralus on the new album?\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\ni am in australia and the album came out yesterdayi own a copy and have listened to it many times. so i dont understand why trexor still thinks its fake and is so upset with the lyrics. you dont have to believe wether or not i actually own it but it would be almost impossible for a band to be able to keep the album \"fake\" up until 2 days before the set release date\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI'll vouch for you stormin_norman. I too got the album, along with a mate. I like this song, and I agree with the angel remarks. Humans may think highly of themselves, but deep down, we're all animals.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nit make a good point about saying \"Monkey killing monkey killing monkey over a piece of ground.\"\r\nits good because it is just ground, no fancy names change this. its just like think well what the fuck makes the mona lisa so great, all it is is oil paint on some wood.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nmessage to trexor dont just judge the entire fucking album by its lyrics. just because you thinks it got shocking lyrics doesnt mean its a rat shit album. your way too critical. grow up.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\n\"silly monkeys give them thumbs, they make a club \r\nand beat their brother down.\"\n\r\nill give you an exemple: trexor. \n\r\nits up to you\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nmyspace.com/… \n\r\nhmmmm...? is this you???? \r\nyou must be hungry for attention...bugging all us TOOL fans.... well, if it is you???? Here is a little attention????\r\nI mean we have heard so much from you I guess \"WE\" should get to know you better???\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI think this song is about a theory by Terance McKenna called the \"stoned monkey\" theory. It talks about how before the 1st humns, animal consciousness was a prerational and unselfconscious. When Adam and Eve began to be self-aware, they started on their 1st stages of rationality. The rational mind can distinguish one thing from another. So the early humans had to deal with anxiety of their newly precieved seperation from each other and their enviornment, all while having  a strong sense of their own mortality. The 1st humans understood their own mortality and were responsible for their own actions, thus the Tree of Knowledge of Good and Evil. McKenna says, maybe the early hominids, being omnivorous, one day discoverd and ate some kind of psychedelic plant. These plants sharpend the hominids perception, so that they could \"sense\" predetors better that the ones not taking psychedelics. This could have given the edge on their competetors, making them the ones to survive. I think Intesion and Right in Two are about this very theory. It wouldnt surprise me either, seeing as how I know about this theory through an Alex Grey art book. Its either this theory or about war, who knows for sure?\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nhmm, does anyone know that bible story of the king who attempts to cut the baby in two?\n\r\nfrom what i remember that could be referenced to this piece??\n\r\nnamaste\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nalso, fumar, i didnt understand what u meant.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI think these lyrics go a bit deeper ... a bit more specific. It's about the ongoing holy war between the Jews, Christians, Muslims, Hindu and Buddists. Probably, mainly just the Muslims and Christians over Jerusalem. The song mentions a tug-o-war and what the band means by cutting it right in two is the figurative \"rope\" or land that is always being fought over. Perhaps in a way they are saying just build a wall and seperate you two already because obviously you can't get along and probably never will. I agree with what most of the people before me have stated as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nWell where is he he's wrong and it drop in the us, 10000 days and it wasn't a fake name, nor where the songs!\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nSalivaltow has a great point, actually. \n\r\nQuite a few years ago, there were these wars. They were called the Crusades. Ring a bell? I don't think you realize that the Jewish, Christian, and Muslim god is the same, only with different beliefs around it. Christianity sprung from Judaism, and Islam sprung from Judaism as well. The Crusades were the wars fought over the Holy Land between the Christian Europe and the Muslim Middle East/North Africa. The Holy Land was Jerusalem (where Jesus was crucified), but for about a hundred years, the Christians conquered pretty much the entire eastern Mediterranean coast in the name of the Crusades.\n\r\nJust a bit of history.\n\r\nAll in all, I agree with Salivaltow as a possible interpretation and the other ideas about angels, man fighting man, etc. Though it mentions \"angels on the sidelines\", it isn't necessarily religious. It might just be people looking in from the outside.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nlittle choi, the bible story (and one of the only ones I know) is about king solomon, where two women claim the same baby is thiers, so to settle it he says to cut the baby in two and give each half to each woman, one agrees, but the other shouts to give the baby to the other woman, saying she'd rather the baby live, even with another family.  This proves that she's the real mom.  I don't think it has anything to do with the song, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nFor the people who thought the album was a hoax... hah.\n\r\nHonestly though, the idea of it being a hoax had VERY good points. Wasn't altogether true, however.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nthere WAS actually a fake (a decoy, really) which was just b-sides from the new cd and even bsides from lateralus. but the real cd did leak about 3 weeks ago, and i know because ive compared every song to the real cd. so yea...maybe it was a joke the band was playing?\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nSoakedinMercury- yeah yeah, we all saw that movie... my point was the dude refferred to the 'conflict' as 'ongoing' between muslims and christians... while you aren't incorrect in saying that Christians and Jews share a common god, muslims do not. muslims recognize figures like moses and jesus as historical figures of signifigance, but their prayer is pretty self explanatory, 'there is only one God and muhammed is his profet'...\n\r\nthat being said, there's really very little left to interpretation with this song... just that those who follow religious teaching to their most radical point are probobly the same ones who would dissapoint their god the most... kinda like 46&2... time to evolve...\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThat is an interesting theory Salivaltow.  I have done a few research papers on the Crusades and after reading the lyrics it does make sense even if that was not Maynards intentions.\n\r\n\"Donâ\u0080\u0099t these talking monkeys know that Eden has enough to go around\r\nPlenty in this holy garden, silly monkeys..\"\n\r\n\"Father blessed them all with reason.\r\nThis is what they choose...\"\n\r\nThis could very easily be referring to different religions and how they just to cut the bullshit already.\r\nJust an idea though...\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nif you listen closely at 6:01 or so, you can hear a really clear exclamation of \"TIMMYYYYYY\".  It's a total coincidence, it's just when adam's guitar is coming in, but sounds just like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nTREX- i hope that when some time has past, the dust has settled, and maybe you've seen the songs live in concert that you'll have a different opinion...\n\r\ni only hope you'll come to love this album as much as i do... it would be a shame otherwise... best of luck in coming to accept this disk...\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\ni wonder if the lyrics do go deeper than what we think.  it woudnt surprise me since throught tool's career they've gotten deeper and vaguer.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nTREXOR U STUPID COWARD NONCOMITTED FUCK, you go around trashing the album EVERYONE else loves, and you go on and on and on about \"hows its a fake album\" WELL YOU WERE WRONG YOU STUPID SHIT. now you just dropped your whole theory dead and just try to back it up with half ass comments of how you hate it...guess what? your the official unanimous joke of every 10000 days song comment on this site\r\nTHIS SONG IS AMAZING I LOVE IT\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nToo much hostility here and on the other songs since 10,000 Days leaked. If TREXOR doesn't like the album, well, too bad for him. If he wants to add a comment to the song, he has all the right in the world to, even if it's derogatory. These aren't meant to be places where we can uniformly praise all that is Tool. It's for interpretations.\n\r\nNow, if you choose to respond to TREXOR, you're egging him on and you're making yourself look petty and ignorant (ie Dustpan). And you're only adding to the hostility and detracting from what this site is for. We all have our opinions, so just let it be.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nEGB: Sorry to tell you that the muslim God is sooooo the same God as the Christian/Jewish one. The beliefs around who were and weren't his prophets is a difference, but not one that changes the belief that it is the same God. I have several muslim friends and we agree on this.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nhirotheavitar... once again, you're close, but it's not entirely correct. while christianity is directly based on the Old Testament, Islam is more like a cheap ripoff... most muslim scholars (of which i've spoken to a few) will tell you that Islam doesn't worship the same god...\n\r\nthe proof's in the prayer... Allah is not Jehovah... it's kinda like the way the Romans ripped off the Greek gods... i mean, Jupiter isn't Zeus, but it's hard to say that one's not based on the other...\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nSoakedinMercurty: you would normally be right, but this guy's spamming.  I'd even go as far as to say he doesnt deserve the free songmeanings account.  \n\r\nSo.. on that note:\r\nTREXOR, please shut the fuck up now.  The reason no one is interested in your opinion or what you have to say anymore is simple:  You spammed it.  You sold out your thoughts pretty cheaply.  To top it off, you sound juvenile, and conspiracy theory hoax bullshit doesn't usually go over well with true fans of a band.  So now that you're definitely wrong, thanks for playing, and have a nice day.  No need to respond either, you imbecile.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nThinking about the biblical references, God himself did a lot if dividing at the beginning. Dividing time into night and day, separating the waters below and the waters above, separating the waters below with earth. Then we skip along to the story of the tower of Babel, where he divided the spoken language of the various people to prevent them from working together to finish the tower.\n\r\nJust an observation.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nThese humans...perhaps not referring to all humans\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nEgalitarianists won't get that one...tools...\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nThe lyrics to the song are a bit off:\n\r\n\"Monkey killing monkey killing monkey over a piece of other ground.\" \r\nshould read\r\n\"Monkey killing monkey killing monkey over pieces of the ground\"\n\r\n\"Silly monkeys given thumbs,\r\nthey forge a blade, and then theres one bound to divide it,\"\r\nshould read\r\n\"Silly monkeys, give them thumbs,\r\nthey forge a blade, and where theres One you're bound to divide it,\"\n\r\n\"Repugnant is a creature who would squander the ability\r\nto live tonight in heaven, conscious of his fleeting time here\"\r\nshould read\r\n\"Repugnant is a creature who would squander the ability\r\nto lift an eye to heaven, conscious of his fleeting time here\"\n\r\n\"Fight all the time\r\nOver the blade, over sky\r\nFight over, lie over, blew over?\r\n? of a winner ?\r\nfight for me, die for me, live for our lies\"\r\nshould read\r\n\"Fight over the clouds, over wind, over sky.\r\nFight over life, over blood, over air.\r\nFight over love, over sun, over another.\r\nFight over..\"    something something... heheh.  help me out here.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nTREXOR\r\nI do not care if you like the CD or not.  If you do not like a song...so.  If you were to write why you did not like a song and how it could be better, that would be an opinion.  When you go to each lyric page and write crappy song...this sucks....no real tool fan should like this etc.  you are begging people to react.  Why would you say the things you have said, responded to the results the way you have; unless you want to see TREXOR up and down each page????? Or do you just pick fights?\r\nyou claim that you are, or were, a TOOL fan.  Then, surely you understand how much most of us love tool!  I am 31 years old.  I have listened to tool since I was a year out of high school.  I respect the band..I look for them to show me something new, to lead me in a new direction; they have never lead me the wrong way.\r\nIt sounds like you are listening to this CD with contempt!  Lateraleus is still my all time favorite TOOL CD...but that does not mean i cant listen to the new cd with fresh ears and an open mind.\r\nListen to this CD as a TOOL fan, not as someone who demands something \"better\" than Lateraleus.\r\nAlso,  Maynard's lyrics show his growth as a human.\r\nOpiate rages at organized religion. Aenima, in part, is about personal growth and realizations.  Lateraleus is so full of spiritual understanding that transcends organized religion.  10,000 days shows how maynard has reconciled his spiritual awareness with his mothers religious beliefs.   This CD is progression...It is good.  If you want your favorite bands to keep churning out the same things...well then they would not be your favorite band anymore b/c you would say they were top 40 pop.\r\nIf you are that disappointed write a personal letter or something.  But please, stop making these people so aggravated!  It can not be healthy for you to read all of these insults! and if you are purposely generating  these insult towards you...stop being so masochistic and self loathing.\r\nmonkeys fight over opinions too!  have an opinion,,,don't fight over it.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nYes the gods are the same between the muslims and judeo-christian nations.  They have two different books, but are very similar.  If there is any difference it is within the New Testament.  They have completely distorted the Old Testament and turned god into a spirit rather than a actual personality.  Yaweh(Old Testament god) used to walk around and have picnics with his children, but the christian god the father does not.  Very much different, just as Jesus is different in each gospel.  It shows you how religions can be altered due to who is practicing them.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nThe main difference between the muslims and judeo-christians is their way of worshipping this god, but yes they are from the same foundation of beliefs, as hard as that is to believe.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nGreat song imo. God gives us free will and reason as humans, not the animals. (notice your cat can not read and maybe you can't either) but we have the choice to say screw you God, I am my OWN GOD and have free will and will cut your one plan into two divisions.....\n\r\n2Cents\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nawesome song, towards the middle of the song it gets intense and loud\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\npersonally, i'm persian and know much better about \r\nmuslims. there is no differnce between what we pray and what christians do. \r\nyou must'nt confused the real muslims with some guys like Taliban.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThis song had two angles talking in heaven talking about how they cant belive God gave humans every freedom and all we did was spit it in his face. it also talks about humans fighting each other over land\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nI wonder if this song is partly about The War in Iraq. Archeologists say that if The Garden of Eden existed, it would have been in Iraq. Also, there is talk of dividing the country in half to appease the different religious groups-\"cut it all right in two\".\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nLike most Tool songs, i think theres a deeper meaning to this song then what most people are seeing. This song is very-anti religion, much like many tool songs, but particullarly the grudge and schism. The overall message in all the songs being we need to throw aside all of our previously established beliefs about religion, among other things. He's not talking about dividing anything when he says cut it all right in two. He's talking about the tug of war battle that's been going on since the start of civilization between humans. The tug of war battle relates to the \"schism\", and the \"grudge\" in that we have this grudge (our religious beliefs), which seperates us, causes tension, a schism, if you will, and the result is this ongoing tug of war battle. \n\r\nSo until we choose to let this grudge go, (accept that we are all humans, and none of us can explain why we're here or how the universe came into existence with certainty) the tug of war battle will continue to rage on.\r\n\"The light that fueled the fire then, has burned a hole between us so, we can not seem to reach an end, cripling our communication.\" - Schism\n\r\nOur differences in beliefs (that were designed to guide us into peace and harmony) has created a huge burden, the tug of war match, the schism, that will continue to plague our species until we individually make the chose to let go of the grudge, Accept the truths about the reality of religion.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nTo me, this sounds like the angels watching the humans using violence to solve everything; ownership, love, and overall just fighting over stupid shit, and the angels seem to be wondering; \"Why did God make these humans so stupid?\"\n\r\nHeh, ironic how I agree with them, even though I don't even believe in the angels and whatnot anymore....\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nI think that this song could be a criticism of religion. \n\r\nAt frist he says \"Why did Father give these humans free will?/now they're all confused\" saying that when humans only had free will, they got confused because they didn't know what to do. They could think for themselves, but that was it.\n\r\nThen he says \"Father blessed them all with reason\", implying that god thought reason would be a solution to the problem of free will. But then he says \"And this is what they choose/monkey killing monkey killing monkey over peices of the ground\", imlying that people used the reason and free will blessed to them by god for the wrong reasons. \n\r\nHe is saying that when you have free will and you combine that with reason, you start to use reason to justify your free will and visa versa. In other words, you justify your need for something by using reason. \n\r\nFor example, say you want a candy bar. That was free will you just used by saying you wnat a candy bar because no one told you to have a candy bar-you're the one that wants it. But then you realize you don't have any money, so you steal it. Your reason for stealing it was because you had no money, but stealing it was justified by you will of wanting it.\n\r\nI think in the song he means cutting free will and reason in two will make things a lot better. Also, about the religion part, he might be saying that if religion is as good as people say it is, then why would religion have made such a stupid thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nEveryone talking down to TREXOR is kinda missing the point. Take a step back and remember what song this board is about. Its about Right In Two, a song based around how humans fight among eachother. The irony is crazy. Although TREXOR was wrong, do we need to rub it in. We know it and he knows it. I applaud TREXOR for having the balls to come on to the Tool page and share his unpopula opinion to us. I do not agree with how he went about it. Instead of telling us why (specifically) he doesn't like the songs, he left the same message on every page.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\n... some people here overanalyze way too much... i think half of their enjoyment of tool comes from trying to find hidden messages and whatnot... this song's pretty straighforward...\n\r\nhumans, despite their enormous capacity for good, for knowledge, for self awareness, for enlightenment... seem so willing to 'squander' it for personal gain (pieces of the ground)...\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\n... we are flawed...\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nIs it just me or is this songvery straighforward for a tool song? then again the whole album is starting to look more and more straightforward...\r\nyea its most certainly a question of what the hellare we doin still surviving, with a bit of a sideswipe at religion.\r\nyea that bit at 6:01 is kinda wierd, its almost as though they cut a bit out or somthing. then again, im not a professional mixer or anything so what do i know?\r\nAnd sorry guys but trexor, if ure still following this thred, i sorta agree with you. 10000 days isnt tool's best piece of work in my opinion.the meanings of the songs arent as hidden as they are in other songs, like H or well, lateralus i guess, then again you look at hooker with a penis or stinkfist and there isnt much hiding there. and there nowhere near as angry either. which is a shame, i know its pretty much a tribute album to maynards mum and all, but still.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nIs it just me or is this songvery straighforward for a tool song? then again the whole album is starting to look more and more straightforward...\r\nyea its most certainly a question of what the hellare we doin still surviving, with a bit of a sideswipe at religion.\r\nyea that bit at 6:01 is kinda wierd, its almost as though they cut a bit out or somthing. then again, im not a professional mixer or anything so what do i know?\r\nAnd sorry guys but trexor, if ure still following this thred, i sorta agree with you. 10000 days isnt tool's best piece of work in my opinion.the meanings of the songs arent as hidden as they are in other songs, like H or well, lateralus i guess, then again you look at hooker with a penis or stinkfist and there isnt much hiding there. and there nowhere near as angry either. which is a shame, i know its pretty much a tribute album to maynards mum and all, but still.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\n^^^ you're 'bummed' that this album is 'nowhere near as angry' as previous ones... uhhh... maybe something like Disturbed or Linkin Park is more your speed...\n\r\nthere's only so much anger a person can purge... these guys have been around for about 15 years now... do you really wanna hear a new version of opiate every album... \n\r\nno... this is an album writen by thoughtful, mature, adults... it's meant to inspire... to create insight... not to be your personal 'i hate my parents' anthem... goddamn...\n\r\nlike i said, maybe Tool's just a bit much for you to handle friend...\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\n...just as i suspected... 16 years old... didn't even see the 80's... did your parents see the Warning, Explicit lyrics sticker before they bought this disk for you... perhaps a bit too high minded for youngins...\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nI'm 14, and I can see what these songs mean.\n\r\nBy the way, the explicit lyrics sticker wasn't even on the CD. What are you talking about?\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI think this song DEFINETLY is about the israel, palestine, and Arab conflicts.\n\r\nDonâ\u0080\u0099t these talking monkeys know that Eden has enough to go around?\r\nPlenty in this holy garden?\r\nWondering where this tug of war will end\n\r\nYou see!\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nhaha i was just waiting for the flame .yea fair enough egb, ill pass up the linkin park tho, if i was going for a \"i hate my parents' anthem\" i probly would have converted myself to 50 cent and then commited suicide for seeing the error in my ways.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nThis song can relate to everything even opinion, this song even is relavant to the album itself outside the album if that makes sense? some people seem to be debateing about the album, people like TREXOR giving his  opinion and people ripping him apart for it, as he rips apart their opinion... They gave us an album and we cut it right in 2.\n\r\nIn that way this song is not directly linked to war just down to people being closed minded.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nI think:\r\n\"Angels on the sideline again\r\nBeen so long, with patience and reason\r\nAngels on the sideline again\r\nWondering where this tug of war will end\"\n\r\nShould be:\r\n\"Angels on the sideline again\r\nBitter longing patience and reason\r\nAngels on the sideline again\r\nWondering when this tug of war will end\"\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nGreat song, good one to just relax to.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nI think it's great how people analyze the songs, which is fine since this site is called SongMeanings, but then become insulted or outraged when they hear something that perhaps they didnâ\u0080\u0099t think about. I canâ\u0080\u0099t wait for Tool to make a song where the story behind it is that people fight over what a song means, and that they know exactly the premise of why it was made.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nmany of your lyrics for this song are still incorrect\n\r\n\"Repugnant is a creature who would squander the ability\r\nTo live tonight in heaven,\r\nConscious of his fleeting time here\"\n\r\nshould read \n\r\n\"Repugnant is a creature who would squander the ability\r\nTo live, to die, to have a consience.  \r\nbrothers sleep inside here\"\n\r\naswell, at around 6 minutes where u are missing lyrics he sais\n\r\n\"fight, all the time. Over what? over lies and...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI vote egb shuts the fuck up. He instantly thinks every Tool song is deeper then the Atlantic simply because Tool wrote it. And what's all that bullshit about Tool being 'too much to handle' for someone? Fuck it's not like music can harm you or anything, I don't listen to music to analyse the fucking lyrics and even if I did, I don't think a band with cryptics lyrics is exactly 'too much to handle' as if my head will explode if I don't find a definate meaning. This is a 15 year old typing. egb is 23, Would you think that just by reading his posts?\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nlol i second that green to red\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nFight over the clouds, over wind, over sky.\r\nFight over life, over blood, over air.\r\nFight over love, over sun, over another.\r\nFight over.. *\n\r\nWhat is ironic is that this website is a great example of what this song is talking about. The purpose of this website is not to get into arguments and fight over nonsense, like how old people are, if the music is too sophisiticated for someone, and other bs. Take the lyrics of this song as advice.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nFromGreenToRed- suck it... that's all, just suck it.\n\r\nyou too snailboy\n\r\narguing on the internet is like jerking off (i'm sure you two are quite familiar with that right? maybe with each other even?)... it's just not quite the same thing as the real deal...\n\r\nthis is a public forum... i'll formulate whatever the fuck song meaning i feel like... and the rantings of children won't stop me...\n\r\ndid you not notice the post several pages ago where i talked about how STRAIGHTFORWARD this song is? my only problem with snailboy's post was his need for anger in the songs on this album... \n\r\nTHESE GUYS ARE IN THEIR FUCKING 40's!!!! raise your hands if you think the Rolling Stones are a bit rediculous at this point... yeah? me too... great musicians, but they should have given it up a while ago... this is mature, fully evolved music... like i said, if you want angry maybe something a little more simple is called for... anyway, i'm done now...\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nthis song is so dope, the meaning is pretty straightforward, we're just silly monkeys killing each other, but also i think there maybe a submeaning having to do with ego and self, seeing as how when they're aligned you're at peace with yourself, yet still subconciously, you do things to tear them apart again, split them right in two, you know what i'm saying.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\negb- Christianity is NOT directly based on the Old Testament. It is based on both the Old and New Testaments. Jews and Christians both believe the Old Testament, but only Christians believe the New Testament because Jews do not believe Jesus was the messiah. The Old Testament is basically the Jewish Bible.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nIn fact, the Old Testament IS the Jewish Bible.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nHOW THE FUCK TO WE ALWAYS ARRIVE AT CHRISTIAN BICKERING???  SILLY MONKEYS-NO BANANA!\n\r\n...whew, I'm okay now...\n\r\nI don't know about you monkeys, but I find that my favorite bands are the ones that evolve, not the ones that put out the same shit year after year...(kudos to egb, I don't agree with everything you have to say, but I'll give you that much.)  Try this-go back and listen to all of their previous albums-take a day off work, school, whatever you have to do.  I find that 10000 Days fits well with Lateralus, which fits well with Aenema.  They all seem to occupy a continuem.  Opiate and undertow are also great albums, but they come from a different era.  Each album is lyrically and sonically unique, despite the reappearing themes.  I  would be more than a little annoyed if 10000 days sounded like Opiate.  You're entitled to your opinion (trexor), but to dismiss this album as untoolish--did you even listen to it?  Or are you still cheesed off because it's not a fake?  I'm not saying it's their best work (I think that was Aenema, followed very closely by lateralus) but to say it sucks seems a bit-naiive?\n\r\nAs for the plainly stated lyrics-perhaps they are not so plain.  I can't be the only one who noticed that bifrucation is a common theme in their music (Schism, Parabola-remember the videos?).  Or maybe they are as is-hey, sometimes a banana is just a banana (Sorry Jungians, that was uncalled for...)\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nhey egb lol did u read the lyrics to this song lately? :)\r\nand despite my critisisms i still think 10000 days is a great album. nd im more \"bummed\" about the straightforwardness of the album (which after reading about the whole Vigiti Tres/wings/10000 days thing i may have to take back anyway) then the lack of anger, lack of anger dosent bother me, simply stating a fact, i mean on my playlist at the moment is alot of pink floyd would you believe it?\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nBlindrider-you're wrong... by association the christian religion is based on the old testament. the bible aka the new testament (the foundation of the christian faith) is based on the old testament and therefore so is christianity...\n\r\nthirdeyewide-when a band ceases to evolve they start to die... the simple fact that so many people didn't enjoy this album is a monument to the vast progression displayed here...\n\r\nsnailman-no hard feelings friend... trust me, i understand the need for angry music... but Tool has never been the place i go for that kind of thing, and it certainly wasn't what i expected from this disk... either wya, glad you like it.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\negb-no...the old testament has been around a lot longer than the Christian religion. It is the New Testament that makes Christianity. The Old Testament is what makes Judaism.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nyou guys still havent fixed the lyrics\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nFromgreentored: Watch your tone, dude. Tool does have value and some people aren't used to music of this quality. The whole album is brilliant (best $15 I have ever spent). Personally, I think Tool should be considered legendary as they realease near perfect cd's everytime.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\ni agree... pink floyd and led zeppelin weren't appreciated by all during their time, but they'll be listened to as long as music is listened to.\n\r\nhistory will prove Tool to be of that calibre... our children will be buying these albums on whatever new meduim carries music in the future and asking us about what it was like to see them in concert, with envy in their eyes...\n\r\ntreasure this time, fans of great music, for one day Tool will be over and that will be that... fuck people who can't appreciate it... i'm getting 10x the value and enjoyment from this music than any of them get from the trash they consider worth listening to... fuck them if they think Tool fans are obsessive freaks... fuck all those too cool for school mofos...\n\r\nsometimes there's a damn good reason certain bands get so popular and arouse such a cult following... Tool sold Pearl Jam under the table... 10 years ago it was the other way around... what does that tell you? these guys age like a fine wine... rant over... peace...\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nCouldn't have said it better myself egb.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nwait i need a pepsi, then i can continue listening to this album agian for the rest of the day, cause its damn good, i mean awesome eh\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nsong about how humans are given free will, reason and many other beutifull habilaties but instead of using them for our own commun good, we use them to hurt and devide each other.\n\r\nmoral: we are not better then the primitive monkeys before us.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\negb     : what do you mean by saying \"Tool sold Pearl Jam under the table \" ?      \r\nyes , i agree that is a fucking awesome band , tool and the mars volta are my favorites . \r\nso , iÂ´ve read all the comments and...all i could say has already been said.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nIt isn't just the physical things we are fighting about. So many posts in so many songs turn into two person flame wars, or religious debates with both sides saying they are wrong.\n\r\nWe are even dividing ourselves in two, because of some sick little need to be superior, which you would hope we had learned to abandon by now.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nlol, again, I've read through all the interpretations and they only skim the surface of this song. I think we need to go deeper.\n\r\nHas it occured to anybody that the angels in this song could be a reference to aliens or extra-terrestrials? \n\r\nIt fits the description doesn't it? Watching mankind from the sidelines? I don't think a person like MJK would write such a straightforward song.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nYou guys all peeled the orange, but you haven't quite eaten the fruit, yet. I think, possibly, but this is just an interpretation, that -as we stated earlier- humans have always been divided and it's about time we worked together, all as one and one as all (but let's not be communist). One thing we all do share, though, is our science and our thought, but, because we are terrirorial, we have developed different \"ideas\" on, say, how we came to be. Thus, there're are breaks on religions, in the forms of several thousand religions, each religion thinking they're correct. And then there's is a communal science, which evolution came to be the most prominant thought in our modern science of how we came to be. So, now there's a division between science and religious science. Mr. Keenan, being awesome as he is, threw in some irony in the song writing. The angels speak of the descent of man from monkeys despite the contridictions and disagreement from religion as an ironic form of unison between the two divisions of religion and science.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nthirdeyewide - The answer to your question about why we (assuming you mean posters on Tool lyrics) always arrive at Christian bickering, is that so much of what Tool is *about* is Christian/religious bickering. Their lyrics and attitude reflect not only railing against Christianity and religion itself, but also at its followers, for arguing amongst themselves to the detriment of the whole World (among other faults...). It only makes sense that that spirit and attitude would permeate the musings of people who spend countless hours focused on their music.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nDaggarfall-I thought of aliens too, especailly after what you said about Rosetta Stoned (which was awesome by the way), but I think he's really talking about angels because he says \"Why did Father give these humans free will?\". Father = God in this case.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nI'm sorry Ouroboros...it just kills me that the basal meaning of this song is so brilliantly demonstrated by the fact that this post disintegrated into an argument over religion.   And I'm pretty sure somebody took a shot at Islam that was totally uncalled for early on--\"Islam is more like a cheap ripoff\"--(egb that was fucking harsh, by the way).  I think this kinda proves the song's point? Nearly every religion in the world agrees on one thing--there was a paradise, and the chimps done lost it...oh hell, I'm just chasing my own tail a this point...;)\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nwhen i 1st heard this song with out reading the lyrics i instantly thought of a horrible instance in someones life when their personality \"splits in two\" like multiple personality or bi-polar. creating a stronger personality that deals with the trauma and a weaker personality that hides from the pain.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nThirdeyewide, I find the irony most appropriate. As several have mentioned, this very forum has become a verbal monkey-war zone. I think it illustrates beautifully the concept of this song and Tool's lyrics in general. Basically, Maynard has spent so much energy confronting his own upbringing and surroundings (the faith of his mother and her congregation) and constantly repeating the mantra of \"breaking through\" the film of this existence and its monkeywars. At the same time, he seems to be angered by our (and his) general inability to do so - as demonstrated so perfectly by this forum. That's why (IMO) he tends to write from such an outside, 3rd-person perspective (angels watching) much of the time; he's trying to provide the vision of something better for both us and himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\n*nice one w/ the tail reference, btw.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nthirdeyewide- what's your problem man? quit riding me...\n\r\nso, my opinion is 'uncalled for' ... well then, if any muslims, or christians, or jews, or hindus, or any other subscribers to organized religions are offended by the fact that i think they're wasting their lives believing the lies of some mad fool who's been dead for thousands of years... well, they can rest assured that i'm offended by the fact they think i'm inferior, or that i'm going to 'hell' because of the way i live my life...\n\r\nlet's just say that calling Islam a 'cheap ripoff' was about as friendly as i'm willing to get with orgainzed religion... and i don't play favorites, they're all guilty as hell as far as i'm concerned... they're the devisive ones, not 'non believers'...\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nThe lyric should be:\n\r\nRepugnant is the creature who would squander the ability to lift an eye to heaven conscience of a fleeting time here.\n\r\n(look up to heaven(or God) that is)\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nAlso the Judeo-Christian God is the same as the Islam God.  It is the God of Abraham.  The Islamic religion was started from the descendants of Ishmael(who was the illegitimate son Abraham had with Sarai's Egyptian servant).  Jews are descendants of Isaac, Ishmael's half brother.  They both went their own ways, and now have their own religions.  However they're still both born of Abraham, who worshiped the God mentioned in the old testament.\n\r\negb doesn't hate all Christians, just the fanatics who preach hell and fire to those who don't want to hear about it.  They're all fucking hypocrites.  I'm a Christian and it's my belief that if egb doesn't want to believe in it, then that's fine, and nobody should push it on him(if they do he reserves the right to punch them in the face).  Nobody is inferior to anyone else.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nIt's a cool song, is all.............\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nI read an interview w/ MJK in Revolver. \n\r\n\"On our last few albums, there's been more of a metaphysical, attemt-to-open-your-third-eye kind of approach, having faith that people will find a way to expand their consciousness and wake up to the world they live in...but I think I've lost a little faith watching the whole political thing... if there's a theme to [10,000 days] it'd be 'Hey, you can lead a horse to water, but you can't make him drink. I have witnessed this firsthand - and therefore, you're on your own.\"\n\r\nThat interview definitely coincides w/ the feeling I got from listening to this album, an angry \"well, fuck this\" response to monkies' vicarious viewing of monkeys killing monkeys.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nThe song is pretty straightforward in its meaning...it simply dipicts the way heaven's angels view humans (all humans) and our petty squabbles.  \n\r\nThe \"Talking Monkeys\" reference was taken from the 1995 movie \"The Prophecy\" staring Christopher Walken where Satan (played by a young Viggo Mortensen) says...\"Humans, and how I love you talking monkeys for this, know more about war and treachery of the spirit than any angel. Gabriel is well aware of this, and has found a way to steal the blackest soul on Earth to fight for him.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nTHANK YOU EBG, COULDNT HAVE SAID IT BETTER MYSELF, living your life dedicated to a figure of the past thats been gone for millenia isnt a life i could embrace, religion in my mind, is a horrible thing in many contents: for example, next to plague religion is the single greatest claimer of lives in history. just a few months ago i saw an article in the news paper that said 315 muslims had been TRAMPLED to death during a religious ceremony...and you argue its a good thing, i interpret this song much the same as maynards imagine in APC (i chose to use this one because i dont like lennon) religion is a border which devides us and with it we will never know peace on this earth\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nIt pains me to see the most important and poignant line of this song mis-transcribed... So here's the correction without jumping through the \"formal\" correction process hoops:\n\r\n\"Repugnant is a creature who would squander the ability\n\r\nTO LIFT AN EYE TO HEAVEN, \r\n(NOT: To live tonight in heaven) \n\r\nConscious of his fleeting time here.\"\n\r\nThis line is, at its core, a lyrical restatement of Socrates' assertion that, \"The unexamined life is not worth living.\" Meaning that one who goes through life without ever asking the important questions is living a worthless existence.\n\r\nOne of the natural inclinations of human beings since we have been human beings is to ask the BIG questions... Why am I here? What is the Purpose of Life? etc... \n\r\nThese questions lead us to contemplating the nature of the being/intelligence some call God, the universe and our place in it. Naturally, when contemplating the universe we look to the sky and the heavens as the starting point of the journey (think early astronomers, Ptolemy, Copernicus, Galileo, etc...). \n\r\nThey were exploring sky and space not for the sake of the task itself, and not even for the sake of \"science,\" (although modern science was born out of their early efforts) but as a way of trying to understand the characteristics and laws governing the physical world, time and space... existence itself, very specifically their own existence, but also that of all other people as well.\n\r\nOur existences are like fire. We spark into existence and burn for a short time then extinguish. There is, cosmically speaking, a very miniscule amount of time involved in the span of even the longest-lived human being's lifetime. And yet, we squander it.\n\r\nKnowing our inherent mortality, we should be able to understand the fleeting nature of our own lifetime. \n\r\nTo understand our imminent mortality and yet practice willful ignorance as to our origin, destination and purpose; to not even begin the long and arduous journey toward understanding and enlightnment (a path on which MJK and likely the rest of TOOL have well advanced) is to live in a primitive and lowly state of existence, like uncivilized and blissfully ignorant \"talking monkeys.\"\n\r\nRepugnant indeed. \n\r\nI'm also of the mind to think that the last line in the \"Fight over...\" section (currently blank with an asterisk) says, \"Fight over lies and ME.\" I think the fighting over me part directly references this and other lyrics websites where 'We the Users' gather to collectively discuss, debate, refute, belittle, flame, foment, badger, fight, piss, bitch, and moan to each other over our interpretations of TOOL's music.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nAs a follow up, please see Plato's \"Allegory of the Cave\" which explains the process of coming to knowledge/enlightenment from the dark cave of human ignorance.\n\r\nThe reason Plato is important is because he was Socrates' pupil and Socrates himself never wrote anything down. He was an oral teacher. So all we know about Socrates or his teachings is from Plato's own philosophical works.\n\r\nHere are links...\n\nfaculty.washington.edu/smcohen/320/…\nen.wikipedia.org/wiki/…\n\r\nThanks.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nwow...i just cant stop my damn iPod that is playing this song for hours already\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nMy friend and I bought this album the day it came out. My friend mentioned that it reminded him of the New Orleans crisis, where even though everyone was in the same dillemma, they couldn't help but loot things they never needed, and try to take territory.\n\r\nSort of how no matter what the situation is, humans (referred to as monkies) will end up getting animalistic.\n\r\nFunny thing was, just before I bought the album, I had the urge to write a similar song, and refer to humans as animals.... maybe Maynard is speaking to me telepathically? :/\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nthis song sounds a lot like dogma and how the angels are all pissed off that man can do watever the hell they want\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nThis is the best song on 10, 000 Days along with \"Vicarious\". This album is great.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nJFizzo, the album was titled 10,000 Days for Maynard's mother, Judith Marie. Also, the song Judith is about his mother. Judith was paralized dispite her strong belief in god. Judith (APC) was about how maynard felt about her belief after that happened. Roughly 10,000 days after she was paralized, she died. Thus, the album was titled 10,000 days and the song 10,000 days is about her life and death. \"10,000 days in the fire is long enough, you're going home.\"\n\r\nTrexor... please take your ignorance elsewhere.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\ni just have a comment on all the tool fans here. including myself, isnt it funny that one of the meanings of the bands name describes all of us? TOOL's, not following ones own will and instinct.\n\r\nand the other meaning i know of describes Trexor, To orally obfuscate leviathan.\n\r\nin other words, to mask the chaos with words, Trexor cant find a way to understand the music, or, just needs to get attention, whatever his chaos, he is just using words, and mostly the words of others, to mask it.\n\r\n@ Trexor, dont use references by themselves, maybe you didnt go to school, but references are used to back up your own words and thoughts, no the other way around. thanks.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nOK, first and foremost, I am going to post this here because for some reason I can not get my e-mail to work on the sign up for the opinion page on toolshed.down.net.\n\r\nTHE LYRICS ABOVE ARE VERY WRONG IN SOME PARTS AND IT SEEMS THAT NOONE BUT ME CAN HEAR WHAT HE IS SAYING... Either that or noone has questioned the previously posted lyrics...\n\r\nThese are my edits. If you read them and listen again you will hear that i am very much correct or at least alot more correct than the lyrics posted above.\n\r\nHere goes... (see my next post above for lyrics)\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\n(OOPS THIS IS BELOW NOT ABOVE)\r\nAngels on the sideline, puzzled and amused. Why did Father give these humans free will? Now they're all confused.\n\r\nDon't these talking monkeys know that Eden has enough to go around? Plenty in this holy garden. Silly monkeys, where there's one you're bound to divide it, right in two.\n\r\nAngels on the sideline, baffled and confused. Father blessed them all with reason and this is what they choose?\n\r\nMonkey killing monkey killing monkey over pieces of the ground. Silly monkeys, give them thumbs they forge a blade. And where there's one they're bound to divide it, right in two.\n\r\nMonkey killing monkey killing monkey over pieces of the ground. Silly monkeys, give them thumbs they make a club and beat their brother down.\n\r\nHow they survive so misguided is a mystery. Repugnant is a creature who would squander the ability to lift an eye to heaven, conscious of his fleeting time here.\n\r\nCutting it all, right in two. Cutting it all, right in two. Cutting it all, right in two. Cutting it all, right in two.\n\r\nFight over ground, over earth, over sky. They fight over life, over blood, over air and light, over love, over some, over none. They fight or they die, Over what? Over writing!\n\r\n((REMEMBER: the angels are on the sideline hence being \"benched\"... like baseball or whatnot))\r\nAngels on the sideline again, Benched along with patience and reason. Angels on the sideline again, Wondering where this tug of war will end.\n\r\nCutting it all, right in two. Cutting it all, right in two. Cutting it all, right in two. Right in two!\n\r\nRight in two.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\ncri0262 i wud just like to thank u for finally shutting trexor up i cud not take his mindless ranting and raving much longer u took the words rite out of my mouth i think everyone here really appreciates wat u did \n\r\nthank u\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nThe music is so amazing...Maynard is one of the few people who shares the fame with the band members...I always feel great after listening to this song, only I've been to a couple other lyric sites and when he says \"cut it all right in two\" I cant tell if he is saying \"cut, divide it all right in two\" or \"cut it all right in two\" \n\r\nAnybody care to give their two cents?\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\ni love TOOL, definitely think they are the greatest band in human history .Ok on this song the music is PEFECT like all of their music, but the lyrics are just so obvious,so boring, so simple, so understandable , i don't  even think mynard wrote it,probably his son did, besides he gets all religiuos with the angels and the father thing,and i hate religion, and i always thought mynard didnt like religion that much, from everithing he's wrote all along the years, so its kind of confusing for me, for all NEW TOOL LISTENERS it's probably a great piece of writing.\r\nAny way, i've listen to every tool album carefully, maynard has always written such thick,deep, complex lyrics that you have to figure out what the f#*! he's trying to say or settle for  just not knowing, i love that kind of writting, like i said before musically the song is perfect,but the lyrics really SUCK!\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nArvat- This song is not agreeing with the church one bit... By the way, this is in no way suppose to start shit, I just figured since in your comment you say that you don't understand it or whatnot... Let me explain...\n\r\nThis song is in fact a direct hit to the church and/or \"catholic american'ts\" including the president himself. \n\r\nIt is about how \"they\" believe in war for biblical reasons. When all the while \"their God\" and \"His angels\" are watching in disgust whilst \"they\" go about fighting in the name of \"Him\".\n\r\n(((FYI- Maynard has not posted any lyrics to the CD yet. He leaves it up to us to decipher them. Eventually they will be given to and posted on \"toolshed.down.net\". The sites lyrics are wrong!!!... The lyrics that I posted above are very much so, 99% correct. I have put the song through filters and listened to it in slow motion and all that jazz.))) \n\r\n\"Fight over ground, over earth, over sky. They fight over life, over blood, over air and light, over love, over some, over none. They fight or they die, Over what? Over writing!\"\n\r\nThis verse states how all wars have been started over religious text, when you get to the root of things... hence fighting \"over writing\".\n\r\nI hope I have explained the lyrics enough so that you can now understand the direct stab he is taking into the church. He has not changed he is just a bit more direct and forward with his lyrics because he wants people to get the point on this album.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nNOBODYSMITH- the lyric is... \"Cutting it all, right in two\"\n\r\n(((Also>>>\n\r\n(((Read the lyrics I posted above they are the correct ones. The site is wrong, because it is based on our input... I don't know how to work the message board on this site to give them the correct lyrics. COULD ANYONE EXPLAIN TO ME HOW??? Please and Thank You , if you can.)))\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nCould you guys please drop the whole trexor thing? Look at you guys, you're biquering right now and yet this is what the song is partially about. You guys need to grow up. No more instigating, it's childish. Anyway, I really like scremotional's take on this. It can be taken as a direct hit to the church and our president. It's clear that Maynard is mad about something and can sense that humanity is doomed unless we stop this nonsense. This really is a masterpiece, even it's not typical Tool, it fucking rocks. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nSome food for thought. In sacred geometry, the number 11 means change. I mean change as in the growth of human consciousness. Rosetta Stoned is 11:11. Yeah, I know that has nothing to do with this song but try to put these songs together like a jigsaw puzzle. Try to connect the meanings in some way. And after the whole fibonacci sequence in Lateralus, I doubt that this is a coincidence.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nLATERALUS518- thank you for acknowledging my existance and not being in the bullshit. peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nlove the line \"where there's one you're bound to divide it, right in two\" kinda like how the bible says we were created, from one, right in two. \n\r\nanother one for MJK!!\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nThe first part of the song is, \n\r\nAngels on the sideline, \r\nPuzzled Adam mused, \r\n\"Why did Father give these humans free will ?....\"\n\r\nThere is clearly no 'n' sound so it cannot be 'and amused'.\n\r\nIt would seem that the fighting that was always on the cards is starting to come to fruition.  And this time it is not over land or people, but will be spiritual in scope and will therefore be the definitive fight, hence the angels.\n\r\nAs Bill Hicks once said, \"It occurred to me that we're just fucked.  You know, I'm sorry, I'm not a bitter... but we're fucked.  Satan is gonna have no problems ruling this planet.  None !  Your know why ?  All the women in the world are gonna go, 'What a cute butt!'.\"  \n\r\nPS. You can get odds of 30-1 on sportsbook.com by choosing Johnny Edwards with a bet up to $500 maximum giving you a return of $15,000.  If you don't have enough faith to share your winnings with someone who needs it, you can use it to build a underground bunker stocked with dried potato and penthouse magazines.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nok...\r\nSeeing as Plato and Socrates has been mentioned, has anyone considered this song might also be about dualism? Listening to Danny's tabla playing, the beat travels back and forth from left to right, building up throughout the song to quite a big climax. This conveys and idea of conflict, struggle and war. Cutting it all right in two is not only what we as humans do with eachother, e.g: war, religion, politics etc, but it also is the final solution of the 'angels' in the song.\r\nSeeing as (IMO) the song seems to convey the feeling of Armageddon i.e. a war of biblical proportions (quite relevent to the world today huh?)\r\nit seems that these 'angels' decide that the only solution is to cut the tug of war rope \"Right in Two\" If you consider what the Apocalypse is all about, it will be a time when both sides will be chosen and no one will be left sitting on the fence. Keeping in mind that the whole album is about death (among other things) this song seems to be about the end (death) of the world and angels/aliens/powers that be watching us destroy ourselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nYeah, \"Puzzled Adam mused\" makes more sense I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nActually, seeing as the whole song is from the viewpoint of angels, \"puzzled and amused\" makes more sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nactually renegade ninja, you're an idiot. blindrider's right, puzzled adam mused does make more sense. i think you were born without the ability to reason, dumbass.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nI hear \"..puzzled and amused..\" but that doesn't spoil the song's beauty if You don't hear same.\r\nArguing abt that only shows how much monkey killing monkey killing monkey indoctrination has worked..\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nLiterally, the lyrics blend the Abrahamic creationist belief(s) with evolution belief(s) and the resulting duality.  We've become and will remain duality induced beings unless We think|question|seek.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nwe won't know what the lyrics are for certain until the band release official ones. \"Who are you to wave your finger\" dingo? What did I ever do to you?\r\nBlindrider; I mean no disrespect.\n\r\nd_b\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nFIGHT over lyrics\r\nFIGHT over hoaxes\r\nFIGHT over trexor\r\n  Tool really hit the nail on the head with this track. Brilliant!\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nThe Masses, \r\nThere is no point in waiting for lyrics from Tool as they spank you further by putting up wrong lyrics, eg on their website the first lines for Reflection apparently are \"I find that I can see a light at the end down, Beneath my self-indulgent pitiful hole.\" which is clearly b.s. (or an obvious hint to listen for yourself).  Also, I think 10,000 days is not just about his mother, there is some other meaning - maybe something to do with the fact they end all their concerts now with Aenema ?\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\ncutting my love\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nThis is another obvious song, about heaven and earth.  It's about the Arc Angels in heaven looking down on us and shaking theirs heads at what we have become.  They see us as Monkeys, (which we deem lesser beings than humans, therefore, we are lesser beings than them).  They are disgusted that we are so loved by God that he gave us everything to use to our benefit and live in love, and we have managed to destroy earth and fight like spoiled children or animals  who don't value life-not our own or anyone elses.  Thinking we are so superior, that we can act like this, and still thinking we are going to heaven to be rewarded.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nIn \"Right in two\" the repeating guitar riff has 22 beats. on the 23rd beat there is a chime !TING! At first I thought it was just part of the whole Angelic theme but after counting the beats it seems that the '23' Enigma strikes again.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nI think it's about how we take religion and distort it and then fight over who is right. The humor is that we all think we're right and if you keep tugging, something is going to snap and we're all going to fall flat on our asses. Take that however you want to take it.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nHave anyone else notices a morse code in the middle of the song?\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nYou mean the \"BOMMM, BOM, BOMMM, BOMMM, BOMMM, BOM, BOMMM\" right? I didn't think it was morse code though, just a symmetric beat running through most of the song. Any idea what it's morse code for?\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nIt's not morse code, it's an electronic drum.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nthe second line is \"puzzled Adam mused\" and so makes more sense!\n\r\ni think Maynard relates the song to the book \"Ishmael\" by Daniel Quinn.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nThe song is all about that man doesn't have any actuall purpose in life. We have all been handed the tools to do great things, still all we do is fight.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nif maynard is accepted to be influenced by gnosticism (ie references to the magdalene / dr jung etc ) then perhaps a gospel of thomas parable is relevant ; \n\r\nJesus said, \"When you make the two into one, you will become children of Adam, and when you say, 'Mountain, move from here!' it will move.\"\n\r\nor,\n\r\nJesus said to them, \"When you make the two into one, and when you make the inner like the outer and the outer like the inner, and the upper like the lower, and when you make male and female into a single one, so that the male will not be male nor the female be female, when you make eyes in place of an eye, a hand in place of a hand, a foot in place of a foot, an image in place of an image, then you will enter [the kingdom].\"\n\r\npersonally, i think TREXOR is a prophet..\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nToo1SyNcLiSt\n\r\nStep 1:\tCreate Playlist 1.\t(MusicMatch Jukebox)*\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tEon Blue Apocalypse\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tCesaro Summability\r\nâ\u0080¢\t(-) Ions\r\nâ\u0080¢\tEon Blue Apocalypse\r\nâ\u0080¢\tViginti Tres\r\nâ\u0080¢\tCesaro Summability\r\nâ\u0080¢\tLateralus\r\nâ\u0080¢\tThird Eye\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tCesaro Summability\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tEon Blue Apocalypse\r\nâ\u0080¢\t(-) Ions\r\nâ\u0080¢\tViginti Tres\r\nâ\u0080¢\tDisposition\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\t(-) Ions\r\nStep 2: Create Playlist 2.\t(Windows Media Player)*\r\nâ\u0080¢\tLipan Conjuring\r\nâ\u0080¢\tLost Keys (Blame Hofmann)\r\nâ\u0080¢\tRosetta Stoned\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tEon Blue Apocalypse\r\nâ\u0080¢\tCesaro Summability\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\tViginti Tres\r\nâ\u0080¢\tEon Blue Apocalypse\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\t(-) Ions\r\nâ\u0080¢\tViginti Tres\r\nâ\u0080¢\tUseful Idiot\r\nâ\u0080¢\tEon Blue Apocalypse\r\nâ\u0080¢\tIntension\r\nâ\u0080¢\tRight in Two\r\nâ\u0080¢\tMantra\r\nâ\u0080¢\t(-) Ions\r\nâ\u0080¢\tViginti Tres\r\nStep 3: Start Playlist 1. 23 seconds into the first track, start Playlist 2.\n\r\nEnjoy.\n\r\nâ\u0080\u009cBorn to bear en writ to all, for all the world to see.â\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nAt times were so blind it hurts and in times it makes us more observant, at times our soul fights with our other half personality or that which makes us human, at times or soul fights with our judgment, but I believe itâ\u0080\u0099s the thought of this which is responsible for this song that we live vicariously through ourselves no matter what our soul says. I think right in two means realizing we have a soul, that we contradict that with our own lives, that we complicate things for no reason and that if a soul and personality cannot live as one cut it down the middle so we have two sides.  I think he speaks of the soul wanting one thing for itself and us wanting another for ourselves and that we are fighting a never ending battle. Heâ\u0080\u0099s pointing out that we make our existence unworthy of life itself, that if we cant fight the starvation of what we want for a little bit of peace, then we shouldnâ\u0080\u0099t exist at all thus pointing to stupidityâ\u0080¦ monkeys killing monkeys, humans battling souls were killing ourselves, basically with what one thinks is right vs another with far superior historyâ\u0080¦ im lost in the  â\u0080\u009cI hate meâ\u0080\u009d but  â\u0080\u009cI love meâ\u0080\u009d complex, which brings me to this reason. When we took a bite of the fruit of knowledge we were born with something that could potentially contradict our soul, and it has spread like a virus amongst us, hes saying its time to cut it right in 2, how do you see the inside of an apple without cutting it in half, which reminds me of parabola, where the fruit sits in the middle of the table with its seed structure changingâ\u0080¦.  He wants us to divide to see the strength each side has and use them both with vigor and animosity.  I donâ\u0080\u0099t believe he is talking about interaction with others as much as he speaks of us finding one within our selves, that once we find ourselves that is the route to the salvation all religions speak of, becoming one, perhaps that is what being god is all about a manifestation of life and unliving, once we realize our weaknesses we shall forgive others. Im not preachingâ\u0080¦ im saying I believe this is what he speaks of is the internal battle, angels on the sidelines puzzled and amused why did father give them free will now theyre all confusedâ\u0080¦ we have 2 side fighting us constantly and if you cant see it your blinder than a mute. Because you can see yet you swallow your words in search of something to sayâ\u0080¦ im lostâ\u0080¦ my soul always knows where its at if I could only listen and be like a child againâ\u0080¦ where I get to choose what channel I put on or listen toâ\u0080¦ if I could only be so grown up that I realize that it might not be me choosing all this time, that I have a soul that searches with the most witty and cunning facilities of my mind that I seldom know the controls ofâ\u0080¦ I cant do it but internally my soul mans my brain like no other pilot yet its going against some kamikaze self indignant repugnant statement for a life I call my ownâ\u0080¦ thatâ\u0080\u0099s the tug o warâ\u0080¦ the battle of ourselves not each other, thatâ\u0080\u0099s what really makes us stupid but no one states this point hereâ\u0080¦   everyone avoids calling themselves a foolâ\u0080¦ but I am a foolâ\u0080¦\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nI think the angels on the sidelines is referring to the good people of this plannet. so turned off by the violence and hatred shown by mankind they are forced into a corner not knowing what they should do, only knowing what not do to. Showing how dangerous free will can be when evil is the ruler. To take it a big further, going along with abstract quantem theory, the heavens and the earth are all one in the same. We are all God's, we are all Devil's we are all Angels, and we are all Demons.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nAlthough it sounds like 'or' on the cd, at the end of that whispery part, when it's sung live it's clearly 'They fight, till they die', nor 'or they die'.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nwell, i think its a brilliant song. some of the imagery is a bit blunt, but that doesnt make the lyrics bad, its just a different way of going sbout it. as for the meaning, yeah its a pretty simple metaphor but 9as ever) there could be so many things it hints at, or then again could be unintentional, and just how we interpret it. all art is a *tool*, so it doesnt really matter what was meant, does it? i love the whole irony thing, with the angels and yet the evolution thing, never thought of that...\r\nsong could be a demonstration of what mjk says, err howd did he put it, positive pessimism or something, the knowing that everything if completely fucked (and yes tons of references here again, many biblical yet we can do something about it so its okay. again, the whole leading horse to water thing, great image. the song seems to have a tone almost of amusement, like theyve given up on being angry and frustrated all that is left is laugh despairingly at how we'r throwing everything away and destroying it all whilst squabbling amongst ourselves, when we should make the most of thi amazing life that wev got,cos wer all gonna die pretty soon.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nI just typed an article on myspace about this song. Effing brilliant. We could learn a lot from these lyrics. It expresses my thoughts about the state of the world & religion flawlessly.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\naright before hand trexors a pretty funny guy, makes this thread more lively hehe. So my interpretation of the song is:\n\r\n This song is looked through the views from an angel and as they are looking down they see how humans have taken everything for granted and as we have the freedom to choose, we've gone astray (war, corrupition, etc) \n\r\nAngels on the sideline,\r\nbaffled and confused.\r\nFather blessed them all with reason\r\nand this is what they choose?\n\r\nThe rest of the song is pretty self explainatory.\n\r\nHow they survive so misguided is a mystery.\r\nRepugnant is a creature who would squander the ability\r\nto lift an eye to heaven,\r\nconscious of his fleeting time here.\n\r\nthis part probably goes to show how we waste our time for the wrong reasons.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\n\"Father blessed them all with reason\r\nand this is what they choose?\"\n\r\nFOR ME, this line is a bit ironic as well...\n\r\n\"God\" gave humans reason, but even with the ability to reason, they still believe that there's someone in the sky watching over them, and that these religious texts are literal truth. \n\r\nI don't know, but reason tells me that there's no such thing as the God we are all too familiar with.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nDon't these talking monkeys know that Eden has enough to go around?\n\r\nFor me this song says that the human race is out of balance with itself and we're destroying our brotherhood and world. More or less...\n\r\nRepugnant is a creature who would squander the ability\r\nto lift an eye to heaven,\r\nconscious of his fleeting time here.\n\r\nI feel this song also is saying that we are blessed with so many gifts like reason and thumbs and mozart - we have AMAZING capabilities and yet we choose to degenerate.\n\r\nWhy did Father give these humans free will?\r\nFather blessed them all with reason,\r\nAnd this is what they choose?\n\r\nI also think that using the words Father along with monkeys and freewill is shows that duality and coexisting is possible.\n\r\nFor me this song shows us the dim reality of our species while at the same time offering hope.\n\r\nI think we should make good use of our \"fleeting time here\"\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nTo me, and I just started liking this song about a weeek ago, I think this song could be TOOL'S greatest of all time. Yeah thats right, I said it. I mean I listen to this song and it feels like 2 minutes has past when its over. But anyways, this song got me thinking about something. \n\r\nThis song is written from an Angel's point of view of humans. That spread the idea that MAYNARD could be an Angel. I laughed at first. It doesnt seem possible. People are always saying that MAYNARD is God, and I always thought they were crazy. Well now, it doesn't seem all impossible. I don't think that MAYNARD is God, but; I do think it is possible that HE could be a higher being of some sort. All of TOOL could be. I just think that THEIR music is to good to be written by any other band. Anyone else agree with that? \n\r\nAll THEIR songs are masterpieces, they are so perfect; to perfect. To perfect to be written by human anyways... I'm probably just going TOOL crazy right now but I really do believe this right now. Maybe its just me, and by the post' other people are putting up about TOOL I'm probably not alone; THEY are the perfect type of music for my taste. THEY stand miles above all other bands I like.\n\r\nIn case your wondering why I keep capitalizing TOOL and MAYNARD and all words associated with TOOL, its because THEY are such a GREAT BAND, that THEY deserve to be capitalized. And not just the first letter, the whole word.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nOh yeah one more thing I forgot to put, FUCK YOU TREXOR. Ok thankyou for your time.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nI like the idea ruderock was saying about angels on the sidelines not actually being angels but just regular good people, but my personal interpretation is just the angels themselves wondering what we're doing by slaughtering each other over land while they're watching us on the side.  I agree with most of the other things said here as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nyou are all the monkeys that this song is talking about. This song is about the schism between humans and God. \r\n\"Father blessed them all with free will and this is what they choose\"\r\nIt is highlighting out division from God. \"Cut it right in two...\"\r\nIts simple.. to quote bill hicks \"We are all one conciousness experiencing itself subjectively...\" We are all one. One being. One light. One entity. The entire universe is a singularity. Stoopid monkeys have forgotten it because they believe they are sperate beings. We are not. We are all one. The same conciousness.\r\nThis song is about the monkeys divinding this whole, by forgetting who they are. \"Where there is one, they're bound to divide it right in two\" It is talking about our one-ness with the universe. Could it be any simpler? \"How they survive so misguided is a mystery.\r\nRepugnant is a creature who would squander the ability\r\nto lift an eye to heaven,\r\nconscious of his fleeting time here.\"\r\nIf you have not been able to lift an eye to heaven, then you are a repugnant monkey.\r\nGod help all the monkeys.\r\n\"Shine on forever, shine on benevolent son. Shine down upon the broken, shine until the 2 become 1\"\r\nIf you havent realised this yet, then you are on the wrong side of the tug of war. The tug of war is between those who remember our one-ness and those who have forgotten.\r\nAnd by the way. Jambi is a prayer...\n\n\r\nshine on...\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nThis song is clearly about how we have felt the need to divid all our lands, when there is plenty to go around.And this is obviussly a follow up to the song Intension.\n\r\nPS. TREXOR if you dont like the music keep it to youreself, no one is forcing you to buy the albums...\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nFight till we die.\r\nOver what?\r\nOver writings!\n\r\nThat's a big call, but then again, this is Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nthe writing is the bible, or else god's words. Yeah, not really the bible but the whole abrahmic religious texts\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nit's not writing, but writings. I believe Tool are referring to all religious texts that condone violence towards others.\r\nI'm probably gonna hit a nerve with someone in writing this but anyway, fanatical muslims justify the killing of unbelievers by claiming the Quaran, or Allah commanded them to. Going back to the Crusades, christians justified the killing of muslims in the same way. It is quite ridiculous to fight and kill, then claim the Bible or Quaran or any writings condone it. Silly,silly monkeys.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\ni love this song...it took me a few listens to fully appreciate it but now im hooked!\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nREAD AND LISTEN TO THIS!!!\n\r\n7812569103411/67584131221911310/15\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nTool: The Cyclic Playlist.\r\n6,7,5,8,4,13,12,2,1,9,11,3,10 / 15 / 7,8,1,2,5,6,9,10,3,4\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nTool Synclist (complete)\r\n7,8,1,2,5,6,9,10,3,4 - 6,7,5,8,4,9,13,1,12,2,11,3,10 â\u0080\u0093 15,14 (or 14,15)\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nTo me, all i seem to think of when i hear this song is the underlying concept thats in the book Ishmael. if you've read the book, maybe you catch my drift. if you havent, all i can say is to read the book.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nTo be honest, I'm not likely to read the book. Imay however change my mind if you explain how it relates to this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nWow, Trexor. You prove this song to be right.\n\r\n\"Don't these talking monkeys know that Eden\r\nhas enough to go around?\r\nPlenty in this holy garden.\r\nSilly monkeys,\r\nwhere there's one you're bound to divide it,\r\nright in two.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nI am a senior sociology major in upstate NY and I just wanted to say that songs like these have given me inspiration throughout my enitre college career. I wrote my senior seminar project while listening to 10,000 days constantly especially right in two, which is my favorite song. Ive used Tools music as background in creating art, writing papers and even in inspiring me to continue to help people suffering from alcoholism and addiction and to build on my own spiritual journey through life. Now that Ive said that, I love the endless potential for meaning in this song, its been said Im sure but I believe that its the bands hope for all of us to make these songs our own in how we react to them and translate the message. Thats what makes it great, thats what makes it art! For me it was when I was senior in high school at the Tool show in Albany, NY, 2001. Maynard's message was for each individual in the audience to remember the feeling he/she was having to take it home with them and use it to create something that will heal everyone. This music has helped me recognize the trials and shortcomings of suffering from the human condition and how to keep going to see where we are wrong to see a bigger picture, to see everything fucked up and then to act upon it. The applications are endless. Ive seen this song translated in so many ways, of course all of them cant be right but many are backed with very interesting explanations why? the one that I am still unsure of is this part: they fight or they die, over what? _____________. this line right here, Ive read many possible lines but some dont really make that much sense can someone clear this up with uttmost certainty?\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nIt's \"Fight till/or they die, over what? Over writing(s)\".\r\nThis is complemented by the sound of the guitar at the end of the line, which sounds like frantic writing.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nits about the angels sittin gup in heaven looking down on us acting like monkeys(or anmals) fighting over stoopid shit...\n\r\nthe song is basically saying we were given all these things htta the angels werent and this it what we do with our blessings\n\r\n\"right in two\" is saying that everyone is divided into parts and the world is in disaray\n\r\nIDK...just my take on the song...its my favorite on the CD and i agree with the song...we dont deserve these things we're given if all we use them for is war and blood shed.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nyeah, well i think there is just a tad more meaning than all of that, i think maybe it directs monkeys at some people you are all overlooking, also who the so called angels are!\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nits about how humankind has always been warring even before we were humans, or maybe hes comparing us to animals fighting (either way this song is made cooler by the discovery of chimps sharpining sticks into spears)\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\n\"Angels on the sideline,\r\npuzzled and amused.\"\r\nWHY DID GOD KEEP THE HUMANS AROUND AFTER SINNING, AND WAITING TO SEE WHAT HE WOULD DO.\r\n\"Plenty in this holy garden.\r\nSilly monkeys,\"\r\nSAYING WHY DID THE HUMANS SIN WHEN THEY HAD EVERYTHING.\r\n\"Repugnant is a creature who would squander the ability\r\nto lift an eye to heaven\"\r\nNOT SHOWING ANY RESPECT TOWARDS GOD.\r\n---\r\nALSO THAT GOD COULDNT DESTORY HUMANS AFTER SINNING BECAUSE THE ANGELS WERE WATCHING AND THAY WOULDNT LIVE UP TO GODS SOVERIGNTY AND DISCREDIT HIM AS GOD.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nthis is un related to the song, but wat does my journal do?\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nThough I'm not disagreeing with you a3nima, I think you may be listening to this song with a certain bias(but then again, aren't we all). You may have taken those lines out of context as well.\r\nThe 'monkeys' are 'silly' because they keep dividing what is originally one and keep killing eachother over 'pieces of the ground'.\r\nThe 'angels' are 'puzzled and amused' as well as 'baffled and confused' because these 'monkeys' have misused and taken for granted all the blessings that 'Father' as given them.\r\nFinally, the line \"Repugnant is a creature who would squander the ability to lift an eye to Heaven concious of his fleeting time here.\" refers to how ridiculous it is that these 'monkeys' would even divide their mortal and spiritual awareness right in two.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nthis song is talking from the angels talking about war on earth. That is obvious.  I think over all meaning is that MJK is trying to point out how in almost every religion it calls for unity and brotherhood.  But we just divide it \"right in two\"\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nWord!\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nTREXOR fuckin TREXOR fuckin TREXOR fuckin TREXOR fuckin TREXOR silly TREXOR killing TREXOR ripping TREXOR fuckin TREXOR murder TREXOR. \n\r\nOhh God ... \n\r\nThe satifisfation I would gain to know who this TREXOR in real life so I could find him, watch him, wait a little while, then smuther his fuckin face into the concrete till his face bleeds and his skull splits ... RIGHT IN TWOoOOoO. \n\r\nRegardless of TREXOR most possibly being a retard.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nTrexor u fucking looser ...     'foot in mouth and head up ass !!        -u idiot have no idea !\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nYEAH!!! THATS THE SPIRIT!!! =P FOOT IN MOUTH AND HEAD UP ASS TREXOR U FAGGOT.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nAiaa!\r\nJust make an effigy already, burn it, then build a bridge!\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nStop flaming TREXOR, that's exactly what he wants, you dumbasses\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nHmmm...\r\nIt took me some time to read all the interesting variety of posts here, and I must say it was most amusing.\r\nI find it interesting the amount of disagreement and the level of emotion, which has sprung from a simple posting of song lyrics, and the resulting open forum discussion.\r\nIronically, Iâ\u0080\u0099m moving from my position as an \"angel on the sideline\" to one of the \"silly monkeys\"\r\nI hardly believe that my words will result in any epiphanies, but allow me to explain.\r\nWhether it is religion, politics, life-styles, music, or pretty much anything \"silly monkeys,\" err, humans, do, we disagree on the details. Even as we see the big picture, we see it through our own individually narrow perspectives. We want things done our way, run our way, and think our way is the best way to do it.\r\nIt is easy for an outsider of an argument to see the fallacy in both sides, as well as the merit.\r\nIt is when one becomes embroiled in the disagreement, challenged by anotherâ\u0080\u0099s perspective, that one decides they must take a hard line stand on an issue that, given time to rationally analyze, they may otherwise come to the same conclusion as the person they are squaring off against.\r\nIâ\u0080\u0099ve seen it and Iâ\u0080\u0099ve done it, it's called \"playing devil's advocate,\" disagreeing simply for the sake of disagreeing.\r\nI also realize that many people have rationally come to the conclusions of their individual argument, and square off against each other with the full force of their beliefs and wills.\r\nThat is the beautiful curse of being a sentient, rationalizing, analyzing, emotional creature.\r\nOur free will allows this.\r\nI freely admit that I would love for someone close to the band to read this and tell the guys, and they would exclaim \"At long last, someone understands!\"\r\nHmmm, how selfish and arrogant is that?\r\nI suppose that is the way we humans process our world. it is very hard to truly be open-minded to all sides of an issue, and to accept others point of view is even more trying.\r\nIn the end, the song has a different meaning for each individual that hears it. some people may come to the same or very similar conclusions. many people will differ in the details of how the interpret the music or the lyrics, and many will square off against one another with the full force of their beliefs, half-cocked or well thought out.\r\nI think the song encapsulates all of this, the strife that humans constantly wage amongst themselves, and the neutral outsider to the conflict observing from a totally different perspective \"puzzled and amused... baffled and confused\" not truly understanding the point of the issue.\r\nWell, there it is, one tool's thoughts on a thought provoking song.\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nHaha, so pretty much, one of the reasons tool made this song was because they knew this would happen? Ironic.\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\ntoolfan13 you have my respect.  You sound like an intelligent, level headed person, unlike a few people I could mention on this post (silly monkeys).  You covered everything that I had to say, so now I don't have any information to share.  Y'know the sad thing I can relate to this song?  No human here on earth is the angel on the sideline.  Although you are a person that does understand this song, and I can venture to guess life too, you cannot be on the sideline.  We cannot remove ourselves from the system, or call ourselves unique, even if we have profound understanding of the actions and tendencies of humans in general, and those around us.  We are still to blame.  We are still one in the same.  We only differ in our understanding of our actions.  I do not wish to sound self righteous, or conversely, condescending.  I merely wish to not ever think that I understand things so capitally that I can remove myself from that which I observe.  Humanity.  Just another tool's thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nYou are what you are. In other words, you are exactly what you make yourself to be. What others think of you is irrevelant, as long as you are the person YOU desire to be, not what they desire you to be. The thought that people with greater understanding can never seperate themselves from humanity is because they know of these things, yet they end up commiting such an act themselves, or they know they can not change it, so they think it makes them no better. It is you that comes first in such a situation, and because you can't make people see what you see and change themselves doesn't make you any lesser, it just may mean that they are too ignorant to get the point, or that their own ego and immaturaty will not allow them to accept the consequences of their actions. Sure, we will always be humans just like them, but just because we look the same doesn't mean that we think the same, which may set us on a higher plane of consciousness. You'll see this is true for physical differences among humans as well. Proffesional sports player are most definitely on a higher plane of athletic fitness then someone who works in an office all day, therefor, why do we not look at it in the same way for the intellect?\n\r\nIt is true that you will always physically be a human, but it must be possible to ascend your conscious understanding beyond that of the \"silly monkies\". And part of going past that stage is taking what you know and using it for what you see as the better.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nLet me rephrase that part about you being what you desire to be.\n\r\nYou should be able to honestly look at yourself and say that this is the best you can be, or this is what you want to be, and do it without a second thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\num, this egb fellow seems to be a bit confused. the Islamic religion does in fact believe in the same God as in Christianity as well as judiasm. they just do not believe that he had a son, though they do believe in Jesus. Just because some dumbass has a turban on their head doesnt mean their a muslim scholar or \"saiyd\". haha. reading your comment made me laugh.\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nThe Islams don't believe in the same god as Christianity, it's just a very similar interpretation. They have the most of the same characters, but that's because the three religions were created in extremely close proximity of eachother.\n\r\nYou'll notice that they have a different bible (the koran), and they believe in defending and spreading their religion in drastically different ways than the other religions do, namely by the use of violence and the jihad (although the jihad is somewhat similar to the crusades, it does have several differences).\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nI still lol every time I hear the \"TIMMMMMAY\" part, awesome song with one of the most unintentionally funny parts in the history of all time\n\r\nAlso, Vulken, you are completely wrong on the fact that Muslims don't follow the same god as christians, it's a judeo christian religion with it's roots directly in earlier judeo-christian religions.  right down to practically the same dietary laws.\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nalso, to further show that, muslims can only eat meat \"from herbivorous animals that have been killed in the name of God by a Muslim, Jew, or Christian.\"\n\r\nThey do however, reject the Christian idea of a holy trinity, which is Muslims believe to be comparable polytheism.\n\r\nAll you have to do is read some stuff before you post an article about it on the internet.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\nSong Is GOOD. Trexor is Stupid.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\ni'd have to agree with most peoples comments on this, i think its about humans being fools at times, what is the point of war and what-not? there is no point. i have a feeling this is alot to do with religion though. not because of the word 'angel' said several times through this. but the fact it says \"They fight or they die, Over what? Over writing!\". writing meaning the bible.\n\r\npersonally, i dont believe in god or anything along those lines. and maynard MIGHT be saying the fact war is happening over writing which no one can guarentee is true, religious people only HOPE its true. \n\r\nim going to continue thinking its about war over religion, now just to find out what the title means... ?\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\noh and, dont call this 'trexor' character stupid, or a dickhead.\r\nfeel sympathy for him\r\nhe isnt embracing such good music as we are,\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\ni agree with rather_dirty_nation  timmmay\r\nthis song is about timmmay :P\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\nI think the meaning of this song is to make a bunch of bitchy crybabies cry and bitch to each other because they can't agree. It's ironic, really.\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nOh and to Vulken, you don't think Christianity uses violence to spread it's message? Or even Judaism. All religion is in fact the same. It's fucking stupid and if you aren't smart enough to realise that there's no supreme being and when you die you just rot in the ground, you really need to wake the fuck up, because it's two thousand mother fucking seven. Everyone should be an atheist.\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\ndoes everyone try to overanalyze every Tool song out there?? If you have ever seen the movie \"Prophecy\" you will notice that Chrstopher Walken's character \"Gabriel\" refers to man as \"talking monkeys\" throughout the entire movie .He loathes the fact that God put them, humans, above every thing else by giving them a soul and free will. They, the angels, sit on the sideline forced to obey God's will and do nothing but serve him completely , while man is given free will to do as he pleases. They cannot understand why man, though given whatever he pleases in this Holy garden of Eden, would chose to break everything \"right in two\" destroying it's perfectness and total harmony. God also blessed us with thumbs and we choose to kill our brother as the angels yet again sit on the sideline in observation \"baffled and confused\". This song seems to be taken exactly from the story of \"Prophecy\", only with a Tool slant to it. Maynard writes this song from the point of view of the angels as they ask \"why would these talking monkeys do these idiotic things when God loves them so much he gave them free will, reason, the Garden of Eden and yes even thumbs\"? 10,000 days seems to be a deeply religious album with much reference toGod and the way he treats his children. It's easy to see that Maynard is pissed off at God for what he did to his mother \"wing's for Marie\" and \"Judith\" but it also appears that he still believes in his Father. \"Right in two\" kicks ass!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nI never knew how positive the message was that this sends until now.\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nEveryone who commented back to my posts. You are all way too close minded to even think straight.\n\r\nNow, I just typed up a whole page worth of thought only to be disconnected from the internet, so I think I'll type them back up on Word and get back to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nAlrighty, here is the response I have typed and saved on Word, so that hopefully, it will reach your eyes.\n\r\nHailsatan, you are in fact wrong that the Muslims worship the same God as the Christian and Judaic faith. Allow me to explain via a little historyâ\u0080¦\n\r\nJudaism is one of the worldâ\u0080\u0099s oldest religions. It has been around far longer than both Islam and Christianity. Christianity just so happens to be a direct offshoot of Judaism. It was a group of Jews who believed that a Jewish man was the incarnation of God and the messiah of all humanity. They became his disciples and followed the ideals that he taught. They also went from land to land, sharing their good news with all who they could reach. Jesus was crucified, the New Testament was written, and Christianity was formed, as a direct offshoot of Judaism. \n\r\nThe Islamic â\u0080\u009cJesusâ\u0080\u009d, of sorts, was Muhammad. He was a caravan man, which made him rather lacking in wealth. His source of money was, in fact, a widow who owned a large trading company, and therefore had access to a large sum of cash. When Muhammad created the Islamic faith, he borrowed many ideals from the Christian, Judaic, Hindu, and a other religions, thus creating a likeness, and your assumption of the same God.\n\r\nWhen Muhammad had to choose a singular god for his Islamic faith, he chose the Arabic god, Allah. For those lacking in knowledge of old Arabic gods, Allah was the God of the Moon, one of the two primary gods, along with the Sun. Allah was a male god who chased the sun god (a female by the name of which I do not currently have knowledge of), as to old times, it was the man who sought the women?\n\r\nNow, that says a little something, doesnâ\u0080\u0099t it? A man who owed all his wealth to his wife, and not himself, chose a male god, and, in fact, made women the lesser counterparts of men in his new faith.\n\r\nI believe that constitutes to research, eh?\r\n_____\n\r\nJackrules, boy is this going to be fun.\n\r\nâ\u0080\u009cI think the meaning of this song is to make a bunch of bitchy crybabies cry and bitch to each other because they can't agree. It's ironic, really.â\u0080\u009d\n\r\nFollowed byâ\u0080¦.\n\r\nâ\u0080\u009cOh and to Vulken, you don't think Christianity uses violence to spread it's message? Or even Judaism. All religion is in fact the same. It's fucking stupid and if you aren't smart enough to realise that there's no supreme being and when you die you just rot in the ground, you really need to wake the fuck up, because it's two thousand mother fucking seven. Everyone should be an atheist.â\u0080\u009d\n\r\nThat sounds a bit like whining and bitching, ironic, no?\n\n\r\nYou want to know what really is ironic? Atheism. The entire idea itself is and oxymoron. It states that there is no god to speak of, and no afterlife. Death is the end and thatâ\u0080\u0099s that, right? Do you not see the irony yet?\n\r\nHmm, can you prove that there is no god? Can you show me this amazing evidence that will solve millennium of struggle? No, I imagine you canâ\u0080\u0099t. Therefore, atheism is a belief, just as much as any religion. The funny thing about it is, itâ\u0080\u0099s a belief (or lack thereof) in a higher power, thus making it a religion. Itâ\u0080\u0099s a religion that does not believe in a religion. Sounds rather ridiculous when put in such obvious terms, no?\n\r\nChristianity does not use violence to spread. None at all. No where in the Christian, or Judaic, Bible does it authorize the use of violence in the name of conversion and growth. It does, however, authorize the right to fight for the safety of oneâ\u0080\u0099s nation, although not under the name of God and not to spread Christianity.\n\r\nHowever, the Muslim faith states that the only guarantee to get into Heaven, or whatever you want to call the â\u0080\u009cgoodâ\u0080\u009d afterlife, is to perform in the jihad (â\u0080\u009cthe struggleâ\u0080\u009d). You have to kill infidels or be slain in the battle against infidels to go to Heaven, upon which time you also receive 72 virgins (or some odd number like that). Now, considering the Muslim outlook upon women, where does that leave them? They arenâ\u0080\u0099t allowed to fight in the jihad, so there is no guarantee for them to go to Heaven. Says something about our good friend Muhammad, doesnâ\u0080\u0099t it?\n\r\nI mentioned earlier that jihad translates to â\u0080\u009cthe struggleâ\u0080\u009d. Did you also know that Hitler wrote a book called Meinkumpf (sp?), which also translates to â\u0080\u009cmy struggleâ\u0080\u009d. Just a little tid bit for you right there.\r\n ____\n\r\nAnd every one of you who disagrees with this war on terrorism. I would absolutely love a peaceful world with no wars, killing, stealing, plundering, rape, and all those terrible things. I would. But we canâ\u0080\u0099t sit back and let Muslim fascists (yes, despite what you may have been told, they are fascist) kill and terrorize innocent people. Sure, there have been some mistakes and dumbass decisions in the process, but who better to stop terrorism than America, the country that stands for freedom above all else? \n\r\nYou think we should let China, or the UN handle this? Ha, as if. \n\r\nAnd we canâ\u0080\u0099t just give them what they want to make them stop either. They did it with Hitler, and guess what? WWII started because of it. We must learn from our past, or the same mistakes are bound to repeat themselves.\n\r\nTo quote jackrules, â\u0080\u009cyou really need to wake the fuck up, because it's two thousand mother fucking seven.â\u0080\u009d\r\n ____  \n\r\nOne last tid bit for you guys. I find it extremely hard to believe that Maynard is an atheist. Why? Well, if you go to his sight, you will find that most of the artwork and pictures there are pictures of old Judaic mysticism. Things such as the Tree of Life can be found on his sight. Not to mention his huge involvement and interest in religion and the purpose of life that has become apparent in almost all of his works.\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nagain, as jambi , it`s a song about gow we devided from our Home, our heaven, Eden, The gartden of God, how we used our free will to use god`s energy for our personal use. deviding right in two is deviding is, mankind, from the Source, From God, and angels are wathicng us amused and wondering when we will wake up fort this tug of war we`re into with thw universe, and epseciallly our dear mother earth :( please, wake UP\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nVulken, Dood you need a hobby/gf/job/life. \n\r\nAtheism is a religion? Its called circular logic, when you talk in circles enough it all makes sense. Its a religion because it devout to no religion.\n\r\nIf you think anyone read that whole thing your retarded.\n\r\nAs for the song, it rox. I can't see how ppl would argue about its meaning, its pretty str8 forward. Although I wonder if the \"angel on the sideline\" might be in reference to his mother. I imagine she was quite insightful, and probably commented on how mankind can be so ignorant to the gifts he's been given by god.\n\r\nI haven't seen the film mentioned earlier \"prophecy\" or whatever, but I'm sure the correlations are exagerated.\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nThis song has a couple meanings and makes a few points.\n\r\n\"Angels on the sideline, baffled and confused, father blessed them all with reason, and this is what they choose?\" - This to me sounds like an observation of christianity from a christan's perspective. If god and angels exists, why are they on the sideline? Why do bad things happen?\n\r\n\"Monkey killing monkey killing monkey over pieces of the ground\" -Monkey, repeatedly used in this song as a metaphor for 'man' Despite having evolved and grown over eons, we have yet to abandon our primitive way of thought.\n\r\nPhenomenal song by the way.\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nI would explain further, but it appears you dislike reading. So for your sake, I will sum this in brevity.\n\n\n\r\nT0OL, it appears you read it, retard....\n\r\nBesides, I have hobbies and friends. How precocious of you to demand how I should run my life. \n\r\nI'm 16 next month. It's summer time. I play sports (in fact, I am on A team for track, an extremely physically demanding sport), have several hobbies, don't have a girlfriend right now (bear with me, I hardly live in an area full of women my age). I have plenty of a life.\n\r\nAtheism is not a religion??? in entirety, it entails the very ways of our coming into to being, and very much affects how we think of a right and wrong, good and bad.\n\r\nI told you, it's an irony. I never declared it a falacy, nor have I declared science one either. I don't strictly believe in a faith. Stop assuming you know me, stop assuming you understand me, because it appears you have not even the slightest clue of what I'm saying.\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\ni saw them  2 days ago an read this whole discussion\n\r\nif theres anthing i can add and what immediatly struck me in the concert was the fact that\n\r\nTOOL NEVER LEFT THEIR FANS\r\n by making albums which does not fit, YES, there is a great evolution, NO they only make albums when time is right and not for commercial reason\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nTheGrimJacket , you summed it pretty well. \r\nI was amazed at this song the first time i heard it. I bought the album thinking that the best songs were VICARIOUS and THE POT..then i heard THIs song. I realized that i had underestimated TOOL, and that this song ROCKSS lyrically and musically (sorry i couldnt think of a better word). \r\nIts about the angels' perspectives of us humans, here on Earth. They pity us \"silly monkeys\" and further more, they question God for giving us our thumbs and minds. For, all they see is what we've been doing, and they couldn't be more disappointed.\r\nAll in all, its a GREAT SONG. and I dont think anything else can top it.\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nTheGrimJacket, that is quite the observation, and i couldn't agree more.  I just got a profile on this site but i've read nearly all the posts for most of the songs posted, as well as the links to wikepedia or tooshed or w/e site it happens to be.  The message this song is trying to convey is that basically with our materialistic society we look like a bunch of silly monkeys.  We may have all these things, nice clothes, big houses, cool phones, but have we progressed as humans? We haven't solved any problems... such as war or diseases we just keep worrying about all of our stuff when it just needs to be all washed away so we can start over and live as nature intended us to\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nWell, not everyone is like that, but a lot are. Don't clump the good with the bad.\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nObviously not everyone is like that, but that is the group of people this song is about. that was my point, it was a lil unclear\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nhey isnt it funny how all these religion ads started popping up?  \r\nGuys the truth is (i believe) that although maynard probably despises organized religion, especially christianity (opiatE) , he was brought up as a christian and his mother had just died or was on her death bed.  The band has been spiritual before - \"merkava\" is taken from kabbalah (judaism), so its not surprising that he should mention angels and \"father\"  in an album dedicated to his mother.\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\ni read somewhere reasonably official that the 10,000 days part was about the length of time his mother spent in a coma or paralysed.  and as much as he is anti-religion (as you may read in the lyrics for this album) he has to admit there must be something out there for his mother to be faithful to god when \"he struck her down to paralysis for that long\"  looking back on these comments dated pre-release, Trexor is and was very misinformed, but then there's always one ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\n10,000 is about 27 years, which is around how long his mother was crippled, not in a coma. She wouldn't be able to speak in a coma.  =P\n\r\nHaha, i get what you're saying ThirdEyeWide, but I do believe that people have progressed, some definitely more than others. Just look at ancient through modern philosophers. These people we use as judgment for humans are usually misinformed, have raging hormones, want to fight the system just because (I did that a few years ago >.>), etc. etc.\n\r\nNot all of us are stupid, just not all of us are really smart.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nEdit: THE people we use for judgment....\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nI dont see too much progression, maybe in information. We have a lot more information and better and better ways of getting it, but it seems that we are paying the price by living in a manufactured world instead of a natural one.\n\r\n\"not all of us are stupid, just not all of us are really smart.\"  thats a good quote, ill def have to use that\n\r\nand your right about his mother being crippled and in a wheelchair for 27 years which is approx. 10,000 days, its right off toolshed\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nI guess it all matters where you look. I posted on the other thread you and I were talking on that, much as I dislike saying it, many people would rather have processed \"easy\" thoughts handed to them, rather than having to solve most problems themselves. \n\r\nI love the natural world, I go into the woods almost everyday. Smells clean, is clean, and I can hear my thoughts.\n\r\nThere are good things about our industrial world. Think of the airplane, and the phone, the printing press, or even the internet by which you and I are communicating.\n\r\nMany of the problems are apparent because a lot of the industrial world is tethered to the political world, which just so happens to have plenty of idiots in it, who have somehow found themselves with large sums of cash. If we took the necessary steps to solve these problems, and recycled our energy, used our minds to come up with a solution, I'm sure we could do it. \n\r\nOne cut, scratch, or crack may mean very little, but a hundred could kill.\n\n\r\nHaha, I like how you found the quote amusing. I meant it to be \n\r\n\"not all of us are stupid, just not all of us are smart\"\n\r\nBut w/e, use it the other way if you want, just don't twist it into something it isn't. I hate when people put words in my mouth or say \"I think what he's trying to say is...\"\n\r\nI say what I mean and I mean what I say.\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\ni see where your comin from... there are good things in the hands of very misinformed rich politicians leading to many of our problems. its hard to decide what the necassary steps are to \"take the power back\" so to speak, and yes it helps a lot to spend time in nature, i always do my best thinking there... its so much more peaceful.  The system we live in has a tendency to strain people and wear them down... maybe there is a balance between nature and industrialism.  Sometimes i wonder if mankind is really better off with the technology we have.  \n\r\nYa i was reading that other post and saw a lot of closed minded comments and i had to say something... especially ... when people were saying open your mind and believe in evolution... that almost made my head explode... \n\r\nI think tool def would like to see a world more in tune with nature... to what extent we dont know...\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nYup, there's some pretty nasty shit in the world, but hey, that's what toilet paper was invented for. =D\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nmaynardslyrics.com\n\r\nI think Maynard's words need to be shared with the world, in their most accurate form. He is something of a lyrical genius, and we all know this. The site is very simple, but the main object of my site is not the layout, it's the lyrics. You will not find more accurate tool/apc/puscifer lyrics anywhere. So feel free to browse, peruse, if you will, maynardslyrics.com ...\n\r\nI have all the Tool albums done, minus Opiate, which will be added very soon.\n\r\nAll his APC stuff, minus emotive, which will be added very soon.\n\r\nAnd as soon as his Puscifer stuff comes out, expect it to be added as well.\n\r\nIf you see any lyric or line that you feel is not what you think it should be, please feel free to email me @ magiclessmarker@maynardslyrics.com\n\r\n-magiclessmarker.\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\n\"Cutting it all, right in two\" should be \"Cut thy love right in two\".\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\ni agree with a lot of what most people have said, but i have another thought.\r\nI think the phrase\"Right in Two\" would be meaning sacred and secular.(sacred meaning everything that is dealing with god and secular means everything else, not dealing with god) as the renaissance in the 1300's-1600's. with the invention of the printing press, it was easier for people to make copies of the bible instead of writing them by hand. and then they didnt need a priest to translate it to them, and that made people start to interpret the bible by themselves and people would argue over what different things meant. \"fight over writing\"  .  i have not found a way to make some of the lyrics work with this thought, but i think a good amount of it makes sense. i really like what sickimage said too.\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nwow, are people still going on about this song\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\ntrevor, no offence, but be very offended, and i think i speak for everybody when i say FUCK YOU\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nThis song is so great, I just got the CD from the library and this is my favorite I think.\r\n\"Give them thumbs, they make a club and beat their brother down\"\r\nFav. line, but the whole song is great, lyrics and instrumental\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nIt should be:\r\n\"Repugnant is a creature who would squander the ability\r\nto lift an eye to heaven,\r\nconscious of his fleeting time here.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nI think this has to do with the fact that we are warring creatures.  There has been war nearly 98% of all recorded history.  This is just pointing out how pointless it is for us to be \"intelligent\" when we don't even use it.\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nI'm pretty sure this has something to do with the Bible and Christianity.\n\r\n-Angels on the sideline,\r\npuzzled and amused.\r\nWhy did Father give these humans free will?\r\nNow they're all confused.-\n\r\nWell God (father) gave humans free will to believe in him or not, and the angels are confused why he would, because they know only bad things will happen.\n\r\n-Don't these talking monkeys know that Eden\r\nhas enough to go around?\r\nPlenty in this holy garden.\r\nSilly monkeys,\r\nwhere there's one you're bound to divide it,\r\nright in two.-\n\r\nThe Garden of Eden, where God made the first humans. Theres plenty of things in it for everyone but everybody wants more than their share.\n\r\n-\r\nAngels on the sideline,\r\nbaffled and confused.\r\nFather blessed them all with reason\r\nand this is what they choose?-\n\r\nThe angels are confused because God gave humans (they) the gift of knowledge and reason and we use to hurt each other instead of help each other.\n\r\n-\r\nMonkey killing monkey killing monkey\r\nover pieces of the ground.\r\nSilly monkeys,\r\ngive them thumbs they forge a blade\r\nand where there's one they're bound to divide it,\r\nright in two.\n\r\nMonkey killing monkey killing monkey\r\nover pieces of the ground.\r\nSilly monkeys,\r\ngive them thumbs they make a club\r\nand beat their brother down.-\n\r\nOnce again, its about how humans will use things given to them by God to destroy each other, and how instead of sharing things they will divide it and take it for themselves.\n\r\n-How they survive so misguided is a mystery.\r\nRepugnant is a creature who would squander the ability\r\nto live tonight in heaven,\r\nconscious of his fleeting time here.-\n\r\nHow do humans live on their own dangerous will?\r\nIdiotic is the creature who would not accept Jesus so it could live in heaven, when it knows it is bound to die eventually.\n\r\n-\r\nCutting it all, right in two.\r\nCutting it all, right in two.\r\nCutting it all, right in two.\r\nCutting it all, right in two.-\n\r\nHumans destroying themselves.\n\r\n-Fight over ground, over earth, over sky.\r\nThey fight over life, over blood, over air and light,\r\nover love, over some, over none.\r\nThey fight or they die, Over what?\r\nOver writing!-\n\r\nI believe this has to do with Holy Wars, and how humans will fight over religion. \"Over writing\" referring to the bibles and teachings of other religions.\n\r\n-Angels on the sideline again,\r\nBenched along with patience and reason.\r\nAngels on the sideline again,\r\nWondering where this tug of war will end.-\n\r\nAngels are wondering when it will end, obviously.\n\r\n-\r\nCutting it all, right in two.\r\nCutting it all, right in two.\r\nCutting it all, right in two.\r\nRight in two!\n\r\nRight in two.-\n\r\nHumans continue to destroy themselves.\n\r\nI'm not trying to rub religion in anyone's faces, but it just seems to me that this song is based on Christianity with all the biblical references (Father, Angels, Eden)\n\r\nAlso how pointless it is for us to exist if all we are gonna do is destroy each other.\r\nHope it makes sense, it took awhile to type that.\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nThis is a VERY powerful song and the point is cut and clear. The point is some thing every one should learn.\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nI may be looking at this thing from a more human perspective but to me this song seems to be about the United Nations' inability to act (angels on the sidelines). Amongst others...the holy war between the Israelis and Palestinians pops to mind. They are fighting for the same piece of land trying to cut the one holy land right into two. The lines about \"they fight over air and further down \"writing\" is a direct ref to the religious text. All in all a brilliant song but remember the song chooses the writer not the writer the song so only the creator will ultimately know ...\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nThis is an interesting Tool song, as it seems to be very religiously inspired, namely by the God and angels of the Christian faith. \n\r\nIn the first verse, it's talking about angels wondering why God (God is often referred to as 'Father' or 'The Father' in the Bible) gave humans free will, as that has a lot of potential for disaster. \n\r\nIn the second verse, the angels point out that even though Eden is a perfect place, the humans will never be satisfied and still make the wrong decision (Adam and Eve eating the fruit of the Tree of Knowledge of Good and Evil).\n\r\nThird verse: The angels lament the fact that even though God created humans to be rational and logical, they choose the wrong thing.\n\r\nIn the 'Monkey killing monkey' verse, it's stated that humans are no better than the monkeys (perhaps a theory of evolution reference), and that they misuse gifts that have great potential for good, instead making weapons ('Give them thumbs...')\n\r\nIn verses 6 and 8, the angels say that humans ignore the important things (in this case, Heaven, salvation, etc.) and instead focus on greedy things of the earth and killing for them; which, when compared to Heaven, is meaningless. \n\r\nVerse 9 restates how the virtues of reason and patience are put aside in conflict. \n\r\nI believe the phrase 'Cutting it right in two' could be about: Even when something is truth/right/good/just (an absolute singularity), humans can disagree or take sides on it (cutting it in two). \n\r\nTo conclude, I believe Tool is asking how a good God could give humans free will, though that's a self-defeating question. However, Right in Two is still a well-written and sobering message on the depravity of man.\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nHey Rockr09 about the whole christianity thing, in my opinion i do not believe that Tool is using the christian terms to relay a message but more as a way to relate to the mass public with christian terms that we can more easily relate to such as father, angels, etc.; the real message is to show how f*ckd up humanity is in general and by using these christian terms it is merely trying to portray this perspective from a higher beings point of view; I believe this because i dont think tool really buys into the whole \"Christianity\" thing most specifically cuz of the song eulogy \"Come down.\r\nGet off your fuckin cross.\r\nWe need the fuckin space to nail the next fool martyr.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nyou can be anti-religion and still spiritual. i am. i believe every living thing has a soul. in order to become truly happy with ours, we need to cease our greed and power struggles and other earthly troubles. it's all fairly meaningless in the long run,\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nslippi butiful thats totally me im dont believe in a god, i believe in a higher being but sprits are all around us\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nand Rockr09 its talking about monkey killing monkey and the bible dosent we were created by evoliution and a theroy is that we were made over mutations from monkeys over time and saome say that god just zaped us here (sorry if my religious knowlage is inaccuriate but i dont read the bible i believ in a god but i am open and i believe in sprits more, im more open to anything)\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nObsessed487, how can you not believe in a god but believe in a higher power? Isn't that a contradiction?\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nThis song is about how we are all the same thing.  Humans=animals=viruses=cells (Right in Two) How we seek resources and once we have consumed them, we look for more and divide all even though we have enough.  Angels are baffled and confused because they live so peacefully in heaven at god's will, but we seem to divide everything in two and kill each other.  Humans are always looking for new ways to kill EACH OTHER!\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nwow, i don't know how people live if they can't understand the art of music like trexor...so sad that they can't see what i see in music...\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nIf you've seen the movie the Prophecy you'd understand right away what the song is about. \n\r\nThe only thing that bothers me, is the part where he says \"Silly Monkeys, give them thumbs and...\"\r\nAll monkeys have thumbs. It is a required characteristic of being a primate. Only humans make weapons and hurt eachother. \n\r\nThis song is offensive to monkeys, that's all I'm trying to say.\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nYou may have already mentioned it (I'm too lazy to read all these posts) but the 'writing' Maynard says humans fight over may be a reference to religious holy texts. So maybe he's saying that all the abrahamic religions in the end basically believe in this same eden, the same afterlife, the same God, so why should they fight over insignificant intricacies as they are doing so all over the globe? Or maybe he's being less specific and saying that EVERY religion on Earth is, in the end, trying to address the same innate feelings (or illusions) of spirituality so we all should stop being so intolerant and just recognize each opinion's right to exist. Just my thoughts. Too bad I'm an atheist..\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nVulken, Hitler wrote Mein Kampf yes. \n\r\nBut guess who he owed his holocaust strategy to. \n\r\nMartin Luther, the monk who began Protestant Christianity, which means almost any branch of Christianity other than Catholism, is also known for how he wrote a 9 step plan of how to deal with the 'Jewish problem', which basically detailed instructions to confiscate Jewish possessions then systematically kill them. \n\r\nYes, the father of most of American Christiandom was also a rabid anti-semetic who, if given the same power as Hitler, would have eliminated the need for Hitler's racism because, if Luther had had power, he would have initiated the holocaust 500 years early! And, surprise surprise, Hitler found and used Martin's plan which resulted in the Holocaust. \n\r\nSo if you want to relate Hitler to any religion, you can relate him to your good old friend, the father of Protestantism, Martin Luther, who has disturbingly inspired fledging religious scholars for hundreds of years. Bet you didn't know Protestantism was created by a genocidal madman.\n\r\nThough I agree that Islam is an undesirable religion, elevating Christianity above other religions is simply irrational dogmatism.\n\r\nAs well as this, please explain how the hypothesis of a God can be in any way possible? If the universe is so ordered that it requires an even more orderly creator, isn't that a contradiction? If you follow that line of reasoning, God, being infinitely ordered, would require an infinitely more ordered creator, and that creator in turn would require an even greater creator, and so on and so forth. \n\r\nThat, my friend, is an infinite regress. And that means that your theory FAILS!\n\r\nAtheism shits all over theism in every way possible...\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nI just read another silly post of yours Vulken. America the country that stands for freedom...? Wow! Turns out you ARE an ignorant fark. America stands for its own interests, just like every other nation, religion, individual or organisation in the world. And Muslim fascists? Thats rich come from the keyboard of what looks like a true American patriot. America is the most fascist country in the west, and the sooner you wake up to the hypocritical, oil-guzzling, selfish, war-mongering, foolish, elitist reality of the 'Land of Opportunity' and stop guzzling on the American media-teat of misinformation, propaganda and hypnosis, the better. You're as ignorant as you are naive and I would have said your blindness is alright because you're still just a kid, but the thing is I am 16 too, and my head is obviously a lot clearer than that miasma, or vacuum, take your pick, in your head. \n\r\nGet it straight though, I have nothing against Americans. I only have a problem with fools, and Vulken is one of them...\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nI believe that it is about how God had angels first, Lucifer (devil) was an angel as well, he left because God made man in His image and a lot of angels felt that God turned on them. So from that perspective, those are the angels watching \"Gods children\" kill each other, even though they have all those amazing things such as free will and reason, yet we use these things for killing and harm. There has been nothing but war since the world was created, even when there was just a million people..there was war..The Earth was born from war..and eventually will die because of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nSeriosly the greatest song in the world. Holds no equal, and none greater. The PERFECT piece of music.\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nBut for the record, its Cut it all right in two, not Cutting it all.\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nTool has to be one of the greatest gifts given to us in the world of music.\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\n\"Live tonight in heaven\" should be \"Lift an eye to heaven\"\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nfor all of you devout atheists on this post who worship Maynard as your God and who thinks that this song is completely anti-religion, anti-God, its not.  In fact I was surprised to hear Maynard make reference to God as \"Father,\" thus acknowledging Gods existence. You see, many of you atheists are like Maynard back in his Opiate/Undertow days, but he is finally, slowly realizing the existence of a higher being. If you love him so much, evolve with him, skip your hateful Undertow/Opiate stage and realize what Maynard has come to realize.\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nSimple\n\r\nHow we humans (monkeys) divide the world only to fight for it\n\r\nWe divide each other to fight the other half\n\r\nKinda cute song in a way...\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nTo ASlave2Audio,\n\r\nIt's pretty obvious that the part \"Why did father give these humans free will\" is soley from the perspectives of the angels, not Maynard himself, so your whole thing about Maynard \"realizing the existence of a higher being\" is completely pointless now.\n\r\nYou don't have to believe in a higher being to write a story or song about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nTo ASlave2Audio\n\r\nTo refer to God as 'Father' in a song doesn't necessarily mean MJK has become a Theist. He is almost certainly not talking in the guise of himself as the character voice of the song.\n\r\nIf you knew about Tool mythology you'd know the band was formed out of anger and hatred of oppression. All of the members of Tool, including MJK, hate anything which sets itself up as a guiding voice or someting to be followed blindly (and the big beardy guy is up there) [P.S. I don't mean Santa Claus]. That's why the band delight in misinforming their own fans, to remind them not to take Tool as a religion either and think for themselves. Tool are very aware that a band who claim to be anti-authority can hypocritically demand fans to follow them just as the forces they preach against do, Tool aren't those bands...\n\r\n---\n\r\nI love Tool and I love this song. Most Tool songs have layers of meaning. Layer one is pretty apparent, it is almost a lamentation by 'Angels' between themselves, or one Angel to itself, about how God created humanity, and humanity seems bent on destroying and fighting with itself. I adore the lyrics here just for their evocative use of words, MJKs word choice is almost scalding of humanity, and his voice echoes through Tool's dulled down sound, evoking for me even more Angel imagery.\n\r\nThough there is and irony in one of the lines\r\n\"Repugnant is a creature who would squander the ability\r\nto live tonight in heaven\"\r\nMJK cleverly sets the Angel(s) up as hypocrites, rejecting the 'silly' monkeys (at first we think rightly, for they are self destructive) but then we realise God gave the monkeys free will, yet the Angels mock when the monkeys don't choose to do the same as they have done. MJKs view on God for me, in this song is neuteral, but he does use the monkeys and Angels as a microcosm.\n\r\nPerhaps he is referring to the monkeys being given free will, in the hope they will justify the Angels belief in themselves, and when the monkeys begin to destroy each other the Angels find it more difficult to justify themselves.\n\r\nJust thoughts here, I'm brainstorming.\n\r\nFeel free to drop me a PM. I love talking about music =D\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nI dont think tool are anti-religion one thing for sure is that they are very spiritual I think theyre mostly against \"organizations\" (if we can call them that) that use and manipulate religion for their own gain. MJK doesnt seem to hate or despise religions he just hates the ongoing conflict between them.\r\nTo Vivalarevolution16 you seem to think that religion is a form of oppression but theres also another way to look at this song, maybe their point is that humans need to be controlled, maybe humans need boundaries and laws to keep them for committing stupidities if the first thing they do with their free-will is start wars? But I personally think that this song is pretty straight forward and theres no need to look for hidden meanings that arent remember \"over analyzing over thinking\". I know it might seem a bit gay but i think song's point is Why cant we all live together theres enough space for everyone :). Anyway this is just my point of view.\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nThis has to be the most straightforward yet amazingly awesome Tool song. This is the only song that I hold comparable to Lataralis. Being an Indian, I love the Tabla solo at around 4:05. Otherwise this is a pretty simple description of what a human being thinks throughout his whole life - Competition - How do I beat the other monkey?\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nHigher beings looking down on us foolishly, were all on this earth as \"brothers\" but we have all become selfish and stupid and weve seperated whether it be race color nationality, Eden has plenty for us all what are we fighting over. He sees it as there is only one higher power and what are most wars over?? religion, am I wrong? Anyways the angels, who are already \"home\" are watching us as we waste our time, \"fleeting\" time on this bountyful earth fight over land we should all be sharing, as brothers do. Soon enough well either become one, share \"cut in two\" or end up killing eachother. Angels are amused by us, practically chickens running around with our heads cut off as time quickly wastes away.........\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nI see a different exapmle here that maybe no one else saw although ill admit i dindnt read all the post (thats a hell of alot plus trexor never shutting up) but what I see that angels are opbviously watching what we do and confused as to why \"father\" gaves us reason and free will and we make terrible things such as weapons and things and the reference to eden in which adam and eve consumed the forbbiden fruit and they SHARED it hence divide in two ... we take our reason and free will and make things of evil and then share them or divide them so that we dont feel guilty or something to that affect (misery loves company)... if were going to sin we'd perfer someone sin with us right? thats what i saw\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\nThis is one of my Favorite tool songs ever thoughs of u that disagree can piss up a rope!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nin regards to what Vulken has said, his/her posts clearly show ignorance of the Muslim world and the Islamic faith. \n\r\nfor one, Allah is the word in Arabic for God; Allah is the same as the God in the Christian bible. It is just a language difference; similarly Dios is the Spanish word for God. \n\r\nas for Vulcen's \"research\", he seemed to miss the little bit about how Muslims acknowledge the profits of the Christian and Judaic faiths. Islam takes that procession one step further by saying that Muhammad was the final prophet. He was not the Islamic \"Jesus\" in the since that he was the son of God, for he was not the son of god. He was just the vessel through which god's word could be spread. \n\r\nYour opinions about Islam and the Muslim world are based only on the fraction of Islamic fundamentalism which you see in the news media. \n\r\n\"However, the Muslim faith states that the only guarantee to get into Heaven, or whatever you want to call the Ã¯Â¿Â½goodÃ¯Â¿Â½ afterlife, is to perform in the jihad (Ã¯Â¿Â½the struggleÃ¯Â¿Â½). You have to kill infidels or be slain in the battle against infidels to go to Heaven, upon which time you also receive 72 virgins (or some odd number like that). Now, considering the Muslim outlook upon women, where does that leave them? They arenÃ¯Â¿Â½t allowed to fight in the jihad, so there is no guarantee for them to go to Heaven. Says something about our good friend Muhammad, doesnÃ¯Â¿Â½t it?\"   \n\r\nI found this to be the most stereotypical belief on the jihad that i have seen; you clearly have no idea about what you are talking about. \n\r\nThe Jihad is a \"struggle\" to improve ones self and society; there are four main types of Jihad, \r\n    * Jihad of the heart (jihad bil qalb/nafs) is concerned with combatting the devil and in the attempt to escape his persuasion to evil. This type of Jihad was regarded as the greater jihad (al-jihad al-akbar).\r\n    * Jihad by the tongue (jihad bil lisan) is concerned with speaking the truth and spreading the word of Islam with one's tongue.\r\n    * Jihad by the hand (jihad bil yad) refers to choosing to do what is right and to combat injustice and what is wrong with action.\r\n    * Jihad by the sword (jihad bis saif) refers to qital fi sabilillah (armed fighting in the way of God, or holy war), the most common usage by Salafi Muslims and offshoots of the Muslim Brotherhood.\n\r\nOnly one includes violence, and that inclusion does not mean \"killing Infidels\", it means killing in the way of god. \n\n\n\r\nThe problem with our societies is that there are people like you who use your faith as a shield and your ignorance as a spear; you pass judgment on a faith that you have no true knowledge of, and you make the same fallacious argument that you think your \"enemies\" make. \n\r\nDo you want to know why the monkeys kill monkeys?\n\r\nlook in the mirror     \n\n\n", "comment_283": "\nMountainman112358, I couldn't agree more.\r\nThis song is very good btw :)\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\ni always thought right in two was like, you got it right in two guesses, but i guess i wasn't really listening to the rest of the song... amazing though\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nJust for the record, Judaism, Christianity and Islam all pray to the God of Abraham. All three religions pray to the same God. \t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nI belive that this song as many of you  said humans acting as if we are animals but listen to the part where he says \"fight over ground over earth over sky they fight over life over blood over air and light over love over some over none they fight or they die over what over writing\" could be a refrence to the bible and its like hes telling us why did god give us these advantages over other animals if he knew we would just mis use them maybe its just a game to god.......i dont know thats my theory on the song\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\nAbout the use of the word \"father\" as the source of men, i guess we're not talking about God, right?\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nI like how people still manage to fight on this comment board despite the meaning of this song. It really does prove the point: we manage to fight over everything.\n\n\n\r\nWho cares what TREXOR, egb, or whoever has to say or if it's different from what you believe? Forget it about it; there's more important things than fighting over it.\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nBy \"Right in Two\", I believe they're saying how everything is always divided. There's never just a perfect one with anything, instead there is always two sides to a story.\n\r\n\"Don't these talking monkeys know that Eden has enough to go around?\"\n\r\n-We've all taught ourselves to be selfish and to fight over things in due to the lack of them (Land, money, etc.), but what maynard is saying is that there is plenty to go around for everyone to share.\n\r\nOverall, one of Tool's most beautiful pieces, in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nThe whole \"Right in two\" line of lyrics might be referring to metaphysics - and the creation of the universe.\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nThis song was also part of Tool's effort to fight mass-ignorance. Hence, they make references to both evolution and creationism. The lyrics about \"monkeys\" are clearly referencing evolution. The lyrics about angels and \"Father\" are clearly referencing religion.\n\r\nBasically, Tool is trying to tell us \"neither side is right or wrong. Perhaps the religious individuals in this world should be more open-minded about considering evolution, and perhaps all the christian-bashing believers in evolution should try to view religion symbolically.\"\n\r\nThe Bible really isn't the result of some \"mass brainwashing scheme to control the population\", although I used to like to think it was. In reality, I think the Bible is a literary masterpiece. The books Ecclesiastes and Job in the Old Testament are perhaps the most nihilistic, pessimistic, and philosophical works ever written.\n\r\nI also believe in darwinian evolution - I am not a Christian (I have taken multiple stances on religion throughout my life: believer, non-believer, critic, skeptic, and even the occult. Before I would be presumed a christian in disguise, I'll have you know that I am very huge fan of Nietzsche and have read his works thoroughly - if you knew anything about the criticism of religion, christianity, and the western judeo-christian ideals, you would know that Nietzsche is perhaps the most revered critic of the church. He was the one who proclaimed \"God is dead\", and wrote a book entitled \"The Antichrist\" referring to himself. Wow I sort of got off track, but this is still all relevant to the song's meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nI'm going to die if this toolfreak guy calls another human a \"fag\", without knowing really who his target is. \"Hooker with a Penis\"...how does the OGT know who Maynard is besides what Maynard says he is? God damn, you people are fighting through comments on a song thats targeted directly at you.\r\nWait, so are all of you tool fans homophobic or what? Gay people rule. I, personally, am heterosexual, but I'm just saying. Your fighting makes no sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nI've been listening in on all of your comments for the past couple of days and i'm just glad i found this site, it really made me appreciate Tool so much more. Can anybody recommend other great places like this to discuss Tool? \t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\n I'm sure our friendly dinosaur(:P) does more than just add controversial comments on pages like this :P\n\r\n- a fan :)\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nDid anyone else fail to notice that this song takes two entirely aspects of humans, and how they became and combine them in a song? Look:\r\nMonkey killing monkey sounds like a reference to the theory of evolution.\r\nFather blessed them all with reason points a little more towards Chrisitanity. \n\r\nMy point is, it's borderline social suicide, because you can put alot of people off by expressing two different views that don't really belong together.\r\nThat being said, the band did an EXCELLENT job of this. Made both sides of the story quite clear, and combined them to make one of the bands' best songs, in my opinion. Anyone else seeing this?\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nThat's why it fits in more with Kabbalistic or Qabbalistic thinking. After all the members of Tool are interested in the occult as they've stated, and as is obvious in many of there songs. Not to mention the picture in the background behind Danny Carey from 10'000 days has the freakin tree of life on it which is the symbol used in the Qabbalah.  The Tree is divided into four worlds which make up the essance of God.\r\nOne is the god essence which is technically in all things. The archangels which make up the mind of God.\r\nThe Angels which read the mind of god and the physical world, or Universal material world which consist of animals, us, demons etc. We were blessed with reason, something the higher beings have that most stuff doesn't. \n\r\nIt doesn't necessarily go against evolution because Kabbalist believe in reincarnation, in the evolution of body, mind and spirit till we can tapp into God and be one with him.\n\n\n", "comment_297": "\nI think that the lyrics to this song right after the drum solo at about 6 minutes (Fight over yada yada) are off. It doesn't sound like he's saying:\r\nThey fight or they die over what?\r\nOver writing!\n\r\nIt actually sounds more like this:\r\nThey fight 'til they die over words\r\npolarizing\n\r\nAnd another reason why I think that it would be polarizing is that it would also fit the original idea or concept of splitting people up and fighting because of differing beliefs. It makes more sense conceptually, and it makes more sense in the auditorial sense as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\nThis song is fairly straight forward.  Think of \"angels\" as rational people...for this example-atheists.  They are on the sidelines, aren't involved in the game, but involved in the overall outcome.  The monkeys are probably christians, but let's just say religious people.  The angels are confused and looking at the monkeys and trying to understand them through monkey eyes.  They think, okay, if you believe in god, and you believe god gave you reason, then why are you doing these things?  If you believe in all of these positive things why are you alienating yourselves?  And most of the song is about the monkeys (religious people).  Muslims wanna fight christians daily, christians wanna fight with who knows blah blah blah.  Then the angels (atheists trying to understand) think: repugnant is a creature who will squander the ability to lift an eye to heaven conscious of his fleeting time here.  The atheists judge the believers.  (after all, you gotta cut it ALL right in two) They think it's disgusting and ridiculous to ignore the possibility that life is simply just life.  By \"lift an eye\" they are stating the importance to question existence.  (If you let something rule you or are intimidated you look at the ground.)  The band is stating that they are the rational people, the angels, the minority.  Nothing can be done with the religious vengeful people who somehow only care about themselves...you just have to sit around and wait, and wonder how they are the way they are.  (or write a song about it)\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nthis song is about how we as a human race fight over land and how we split our dicisions into two for we have a choice to take or give the land to whoever we wish and how we have lost our way to heaven according to religion\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nok 1. the lyrics really sound like \"tear thine own right in two\" and not \"cut it all right in two\"\r\nand 2. this song is somewhat john lennon esque. when it says \"monkey killin monkey over pieces in the ground\" is talking about war over territories. like expanding your empire shit and after all weve been given we still need more or want more, its never enough for humans.\r\nand actually humans are the ONLY mammals who kill their own kind..\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nRemember way back?.....life feeds on life...this is necessary...\r\nlife feeds on life...this is necessary...\n\r\nMaynard wants it both ways. He wants to deny Christ but preach His peace, love, why can't we all just get along message. If 'evolution' is true, then no surprise monkeys killing monkeys killing...the 'fittest' survive to reproduce, kill whatever gets in your way, just like the animal kingdom does, preying on the weakest. No right or wrong, good or evil. Life feeds on life... this is necessary...\n\r\nMaynard has been given artistic brilliance & voice of an angel-- gifts from God-- but soul of anti-Christ, tormented, spits in His face again and again via many lyrics.  I don't see honest seeking but mocking rebellion.  Not beyond prayer though.  His mother never stopped loving him, but I seriously doubt she would be proud of her son's lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\nWrong:\r\nHow they survive so misguided is a mystery.\r\nRepugnant is a creature who would squander the ability\r\nto live tonight in heaven,\r\nconscious of his fleeting time here.\n\r\nCutting it all, right in two.\r\nCutting it all, right in two.\r\nCutting it all, right in two.\r\nCutting it all, right in two.\n\r\nFight over ground, over earth, over sky.\r\nThey fight over life, over blood, over air and light,\r\nover love, over some, over none.\r\nThey fight or they die, Over what?\r\nOver writing!\n\r\nRight:\r\nHow they survived so misguided is a mystery.\r\nRepugnant is a creature who would squander the ability\r\nto lift an eye to heaven, conscious of his fleeting time here.\n\r\nGotta divide it all right in two.\r\nGotta divide it all right in two.\r\nGotta divide it all right in two.\r\nGotta divide it all right in two.\n\r\nFight til they die over earth over sky (best guess)\r\nThey fight over love over blood over air (best guess)\r\nThey fight over love over sun over blood (best guess)\r\nThey fight til they die over words, polarizing.\n\n\n", "comment_303": "\nA great song, but probably Tool's silliest lyrics ever. \n\r\nMaynard nailed it when he sang\n\r\n\"Credulous at best, your desire to believe in angels in the hearts of men.\r\nPull your head on out your hippy haze and give a listen.\r\nShouldn't have to say it all again.\r\nThe universe is hostile. so Impersonal. devour to survive.\r\nSo it is. So it's always been.\" \n\r\non Vicarious. It seems to me that he's satirizing the views express in Vicarious, while he actually believes what he wrote in Right in Two. He's wrong. We're evolved for conflict. There is finite space and finite resources on this globe, and the group that fights best wins the evolutionary battle. Meanwhile, the group puzzling over what \"angels\" might think of our behavior is a sad one indeed. \t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nMasters in perfect control of their craft.\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nThis song reminds me of the Middle East and all the bs that goes on there with those people that live there.\t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\nOne of my favorite Tool songs, can't help but think about gang violence when I hear this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nI think the word \"monkeys\" refers to humans because of it's said that the human being is a descendent of the monkey, and the song is a lament of the angels and (perhaps) all the heaven. I mean, when angels look what do the humans do with free will and all the consequences of that they ask: \"Why?\", \"Why do they act like animals (literally)?\", and they no have more choice that stay here, at the sideline, waiting us for a change... Come on! I hope this song really inspire everyone, and make us rise the head to the heaven for help, or just to say: \"Thank you\" (: \t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\nanother beautiful tool song.. about our mindless wars, we fight over all the stupid shit in life, when CLEARLY theres enough of \"eden\" (the WORLD) to go around for us. theres plenty of room for us all, why do we fight? i love this work of art.\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nI think There is so much  bible in this song.The angels there(the gods assistants) are arguing about whats happenning with human race. Assuming that god(''the father that created'', listed on the song) created them by his own image(blessed them all) ,they are wondering why they are all sinning an. The reference to the eden its about adams history ;the beginnig of the sin and going out(being expelled) of the holy garden, due to the  the sin. and now the human race is out of the eden, he(the human race) got free will to do whats on his mind and deal with the consequences of his acts after(the final jugdement, going to heaven or hell), so they keep on sinning and sinning, hurting one another, separating(cutting off right in two), as sinning becomes now their nature. They monkey thing there is a reference to dumbness of the human race that keeps on sinning, not the evolution  from monkeys because if  we assume this song is at least based on bible, it cant include the darwin theory.\r\nThough I dont think its a christian song because maynard inst one, I think. And all the things I wrote up there are all just my opinion, be free to rate it and give more opinions too. =)\r\nPlease forgive my bad english grammar, Im brasilian.\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\nTo me, I get a message relating to the creation of the universe. All matter in the universe would have had to derive from one atom. For  he universe to be created, it must be split in two. Every crime, every horrible deed commited by mankind, was us splitting more atoms in two.\r\nWhile the \"angels\" look from the sideline upon our splitting in two, we create more and more, becoming greater and greater. For existence to continue, everything must be split in two. Monkeys killing monkeys is an example, if early man never started to kill each other, we never would have become what we are. The \"angels\" never became more than what they started as, \"pure as they came in, pure as they begin\"\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\nCut it all in two!\n\nVery philosofic and deep.\n\nI can't understand where this comes from. Usualy i understand their lyrics but \"cut it right in two\"?\n\nThe last thing a human would do is cut it in two unless he wants to break it!\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nMy personal opinion is that this song is about the stuggles here on earth \"edin\" and the separation from our higher self keeps consciousness  US cut \"right in two\"\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nHe kind of explains exactly what he means by \"right in two\" pretty early in the song. \n\nDon't these talking monkeys know that Eden has enough to go around?\nPlenty in this holy garden, silly old monkeys,\nWhere there's one you're bound to divide it\n\nInstead of living together we feel the need to conquer each other.\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nTo me this song talks about how we turn away from the unity of the universe. The unity is of love. The song talks about how we as the human race are aggressive and violent. This of course not coming from love. By turning away from the singular unity of love you cut it \"right in two\" creating a duality where you are separated from that love and thus become aggressive.\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nGod gave humans one of everything.\nHumans in turn, cut that one into two\nTherefore, in humans reality things MUST be \"good\" and \"bad\" instead of just one.\nMost of Tools songs are thoughts of \"New Age\" religon.\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nGreat and pretty quintessential Tool at the core.  Props to Danny Carey, drums are awesome in this jam.\n\nAnd the lyrics give you a bit to think about.  \n\nOn a side note, if we are a product of evolution, I do wonder whether it's necessary to put the if there to be PC but anyway; we're bound to carry some of the instincts of our ancestors in addition to physiology.  Theres a concept of the 'monkey mind' in buddhism which may be easily related.  I do like the religious/spiritual tones Tool takes which are often powerful mediums for asking deeper questions about morality or the human condition.\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\nHere's what I hear in the breakdown part: \n\nFight over clouds, over wind, over sky and\nFight over life, over blood, over air and light,\nOver love, over sun, over another.\nFight 'till they die, over words, over writing.\n\nCould be wrong, but I that's what I hear. It's really hard to make out, but I think it was done on purpose to make us form our own opinions and interpretations of the song.  I think it makes sense in the context of the song and how religion has caused so many wars, blah blah blah. At least that's how I interpret it.  Cheers.\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nMy belief is that Maynard mocks organized religion in many of his songs. He makes biblical references in many of his songs including his other projects. In this song he is telling a story/making a point from the point of an angel. I believe that he is mocking the idea of a \"creator\" but is asking those listening to consider the same. He makes his lyrics vague on purpose. But when the gist of all his other songs in other projects are taken into account, I believe that this is what he is trying to say in this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nThis song is written in the vein of Satan's point of view. He led a portion of the Angels to rebel against God partially due to the fact that God gave humans souls which the Angels lack and placed them above the angels in his love. Satan and the others who sided with him hated the humans because of their place in God's heart and for the foolish decisions humans made, the first being to choose death and the knowledge of good and evil over life in Eden. The Angels were created first and told to serve God only. Then God created humans and told the Angels they would serve the humans as well. This caused an irreconcilable conflict among Satan and his followers who could not realign their service to God to include his command to serve His chosen, humans. \nI have heard that the members of Tool consider themselves \"Satanists\" which is not to say black magic and all that crap but more of Stanism as the true rebuking of religion and human being focused free will. Many of their songs speak to this ideology and also reference the beliefs of organized religion, particularly Christianity. I am a Christian and find their music and lyrics fascinating and insightful as I base my beliefs on faith and love the gathering of people to these ends and not control of the masses through religion.\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nI see this song being about how the world has gone to shit... How humans are so ready to kill eachother of useless shiny objects...\n\n\n", "comment_321": "\nAnyone else think of the book Ishmael when reading these lyrics?\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nMaynard and the rest of the guys in TOOL are a cleaver bunch. Being staunch atheists, they've found a way to relate reason-and-logic-based social and political commentary to nonbelievers and believers alike by leveraging parables the common man is familiar with, even though they don't believe the religious dogma themselves.\n\nBeing that the song is sung satirically from the \"Angels\" perspective (i.e., intelligent, rational people), the band can stand back and comment on the behavior of the \"monkeys\" (i.e., all humans--people in general) without the flack they would catch from being more blunt about it.\n\nThe line I love most in the song is, \n\"Repugnant is a Creature who would squander the ability\nTo lift an eye to heaven, conscious of his fleeting time here\".\nThe use of the words \"heaven\" and \"here\" are loaded and telling; they are saying that \"heaven\" is actually our time \"here\" as conscious beings on earth and that we should use that time wisely, rather than waste it on unproductive, selfish, violent, and irrational pursuits.\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\nIt talks about how god gave the humans all this land, an entire world to thrive in, and yet we still ; for years, have fought over land and material objects. And the \"angels on the sideline\" refers to the fact that they have know idea why they are fighting over land when there is enough for everyone to have a little bit\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\nfor me its about how you can and sometimes indeed should \"cut it right in two\" - -can see and fuckin make a clear cut between \"right\" and \"wrong\" cause especially today people often dont know or dare if they should.. driven by lower instincts\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\nMaybe he just saw the movie Prophecy\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\nI kind of get the feeling that all the metaphors in this referencing religion are actually just a satirical joke at people who actually think God is something that is all knowing and plays an active role in our everyday lives. \"Angels on the sidelines\" seems it could just be a way of saying the angels are watching but never impacting what happens on earth even though Angels are supposed to be guardian spirits. People are dieing everyday for the silliest reasons and God does nothing for them. \"How they survive so misguided is a mystery\" is funny because it comes off as if someone guided them, perhaps God? God is misguiding the human race and yet they are surviving. They are surviving because science is conquering religion. \"Cut and divide it all right in two\" is just a way of saying kill, at least in the context of the song. \n\nMonkeys are continuously used to refer to humans. Not only because we behave like monkeys, but they are also a close ancestor. I feel like the close ancestor is more relevant because our brains are just a more developed monkey brain. We should realize this and use that difference to understand that violence is not the answer. It sucks though because we have dug the human society as a whole into a big hole so it would be very difficult to bring world peace. However, it is still possibly to rid the world of fear. Imagine a world where everyone appreciated each other, imagine the prosperity. No money would need to go into military expenses. everyone could have shelter and education. At this point It would have be a global reform, even then there would be problems. \nAnyway, I'm off topic. \n\nThe song is about the stupidity of Humans over their history, It's not completely their fault because a lot of them were misguided. The human mind was ignorant and therefore gullible. This might sound like a conspiracy and it might now be a joke on God, but I guess none of us really know. I do feel some other things I brought up stand on their own without the religion references.\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nI also think that there are specific references to the Iraq/Middle East war as well. \n\n\"Don't these talking monkeys know that Eden has enough to go around.\"\n\nIt's believed that historically the Garden of Eden was located somewhere in what is now modern day Iraq. In my opinion that is an ingenious reference in the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nSilly me as this song seams to be the theme song . To the video game TRUE CRIMES STREETS OF L.A. I thought it was refering to the gang wars in Los Angeles California.\t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nI thought the song was about gang wars in Los Angeles. As the song is like the theme to the video game True Crimes Streets of L.A.\t\t\t\t\n\t\t\t\t\n\n", "comment_330": "\nIn the music video, The creator finds a piece of molten substance which later becomes earth. When earth was completely destroyed along with its creator, it transformed back into it's original form- that very same molten substance.\nIn Judaism, by the jewish bible- an identicle motif is appearing, when speaking or learning of death and creation:\n\"×\u009b×\u0099 ×¢×¤×¨ ×\u0090×ª×\u0094 - ×\u0095×\u0090×\u009c ×¢×¤×¨ ×ª×©×\u0095×\u0091\" - \"Because ashes you are- and to ashes you will return\"\n\nWondering how Tool keeps taking inspiration from so many different aspects and momvents of the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\nI believe that as a human species, we were meant to think for our selfs and be slef-centered.  We can choose not to be. We have to realize that we're all one conscious, and we all think alike it very different.  Our ego has cause us many hardships in a past and future, this song is basically about ll the ego and control we want to have in our life, and that will always bring chaos. We will always be separating eachother for our ego to feed or ego\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nThere are some great interpretations on here. So I will echo slightly of whats already been said. \n\nIts clear that we were monkeys who were given a set of skills and features to help us thrive and live in peace yet we used them for all the wrong reasons. instead of sharing land, wealth and existence, we instead go back animalistic routes (silly monkeys ref) and fight and cut everything to divide it. You need to watch the video too, its fantastic and explains so many of the lyrics. \n\nNow with reference to the Angels, I think that they have a double meaning, one being Angels, assistants of God and tasked with watching over our development. Secondly I believe they're also being referenced to our higher consciousness, as in the the rational side of our mind, the side that is intelligent enough to live in peace. I draw this conclusion from the video, because the creator in the video is quite clearly your average man, he isnt illustrated as a divine character whos wearing a robe and has a big grey beard. I think this is saying that we are the masters of our own destiny. We're the ones that have forged everything we use and we will be the ones that ultimately destroy ourselves, exactly how the little minions destroy the creator in the video.\n\nIts an epic song and I will never tire of listening to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_333": "\n@heartagramheat I love it man you hit this right on the head. And no doubt that maynar is always going to be talking about something deeper than the face value of the lyrics but it's a song that quite literally describes how we as humans have made the worst possible mess of the gifts we have been given and that our greed has caused us all to forget that each other are all that matters and so instead of valuing eachother we kill each other based on the confusion of what was important from the start which is that we had each other and everything that we needed Adam and Eve and the garden but again thought that through human \"reasoning\" we would be better off taking what we want and not having regard for one another Cain and able. \t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nI've always loved this song.  I read through several of the comments regarding meaning, and I've always thought the meaning was very different.  Obviously with a Tool song, none of us know.  I always thought the entire song was somewhat mocking religion.  It's showing that people will fight to the death over it, and it's using the angels as the \"outsiders\" watching us do this.  The use of angels is the irony, because people believe they exist, but really, people are simply fighting over things and killing one another because they can.  I think divide it right in 2 is referencing how people divide their life between their life on earth and their afterlife.  I could be way off, but that's my take on it.\t\t\t\t\n\t\t\t\t\n\n", "comment_335": "\nWith tools religious belefes, with god creating man we have always wanted more in our nature. with our fighting and always fighting for first we seem to\" Devide it right in two\"\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\nWhy for every tool song there is 5 versions of the lyric, and why the hell Tool don't publish the official lyrics on the web, why????? Every site give you another lyric for different song, it's drive me crazy !!!!!  \t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\nIn the beginning god was unconscious (darkness/nothing) . He woke up, saw the\n (light/ his external world). This was the first separation, unconsciousness from consciousness, Nothing from something.  he then  became conscous of himself and the world around him. That's why he studies his hands like that. Second separation. His body from the body around him. he climbs to the top of a hill, and down it. Seperating above from below. He finds water and seperates it from the dry ground.\t\t\t\t\n\t\t\t\t\n\n", "comment_338": "\nI agree non the biblical reference is most correct. However, I also see that there is a reference to non-duality: \"cut it all right in two\". Western philosophy is all about dualities: goodness vs. evil. mind vs. body, etc. Perhaps this is a protest against that type of thinking. Or maybe it's not. Maynard has said that he does not believe that tool's lyrics should have a strict interpretation, which is why I love them as a band.\t\t\t\t\n\t\t\t\t\n\n", "comment_339": "\nTHE LYRICS ARE WRONG IN THE CHORUS ABOVE â¬\u0086ï¸\u008f\n\r\nI need all your help to tell me if Iâ\u0080\u0099m going crazy, or are the lyrics for the chorus here, and everywhere Iâ\u0080\u0099ve looked online absolutely wrong??? The fact that nobody else seems to notice, mention or correct this is why I think Iâ\u0080\u0099m half way to the nut house...\n\r\nWhat I hear Maynard sing is not even anywhere close to â\u0080\u009cCut and divide it all right in twoâ\u0080\u009d which for one thing is way to many syllables to be right! I could never wrap my head around that or any of the various vexatious variations Iâ\u0080\u0099ve read out there over a plethora of years. \n\n\r\nHere is what I believe are the correct lyrics,  put the song on and listen along with the words below in mind, and let me know if you agree or not that the what Maynard sings in the Chorus in Toolâ\u0080\u0099s - Right In Two is: \n\n\n\n", "comment_340": "\nTHE CHORS IS WRITTEN WRONG IN THESE LYRICS ABOVE â¬\u0086ï¸\u008f\n\r\nI need all your help to tell me if Iâ\u0080\u0099m going crazy, or are the lyrics for the chorus here, and everywhere Iâ\u0080\u0099ve looked online absolutely wrong??? The fact that nobody else seems to notice, mention or correct this is why I think Iâ\u0080\u0099m half way to the nut house...\n\r\nWhat I hear Maynard sing is not even anywhere close to â\u0080\u009cCut and divide it all right in twoâ\u0080\u009d which for one thing is way to many syllables to be right! I could never wrap my head around that or any of the various vexatious variations Iâ\u0080\u0099ve read out there over the years. \n\n\r\nI you're like me, and you never though this sounded correct,  focus on the following words that I believe are the correct lyrics,  and listen along to the songs chorus, which is much more simple than people seem to think it is....and I think you will agree with me.  Hereâ\u0080\u0099s what I hear:\n\r\nâ\u0080\u009cCUT IT ALL, RIGHT IN TWOâ\u0080\u009d \n\r\nBut to write it the way it sounds with the word â\u0080\u009ccutâ\u0080\u009d drawn out more like:\n\r\nâ\u0080\u009cCuh-ught itâ\u0080\u0099all, right in twoâ\u0080\u009d\n\r\nOr hereâ\u0080\u0099s me attempt to write the words with the songs time signature of 11/8, So each bar has 11 beats of 8th notes... so u would count to eleven, 4 times. It also helps to see the offbeats between each beat that I wrote as â\u0080\u009candâ\u0080\u009d or â\u0080\u009c&â\u0080\u009d so count: one and two and three and....up to 10 and 11 and...then repeat...so maybe this will help....maybe lol\n\r\ncuhh-uttt  ittâ\u0080\u0099allll       rite-inn-twooo \r\n1 & 2 & 3 & 4 & 5 & 6 & 7 & 8 & 9 &10&11&\r\n(Repeat 3 more times)\n\r\nIt did, however, take me quite a long time before I realized what MJK is really saying. And now I canâ\u0080\u0099t believe it was so hard, maybe all the incorrect versions out there were hard to shake off...and it doesnâ\u0080\u0099t help that his voice is always really low in the mix for a band this big...they do this because he feels as the non-traditional front man that he is, that his voice another instrument in the group, adding to the mix as well as contrasting tastefully, not taking away from any of the other members instruments. And pushing to the max when it calls for it,  which helps contribute to their amazing dynamics.  This is also one of the reasons why he stands at the back of the stage when playing live.\t\t\t\t\n\t\t\t\t\n\n", "comment_341": "\nYeah Trexor your a Tool. Not a TOOL fan. So GTFO \t\t\t\t\n\t\t\t\t\n\n", "comment_342": "\n.,;I know i think none of you know and i know i don't know;,.,;/no comment\\;,.\t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nI like this website because people re often reasonable here, having discussion and considering other's opinions when discussing the actual (original, artists') meaning of the song.  I say thus even though I have never used another inclusive song meanings website.  I came here hoping to find Christians' comments so I can reply to them.  You see them incorrectly so often on hundreds of song (that and the \"every sing is about drug addiction1\" crowd), yet strangely I see none here.  Many of Tool's songs are confusing because they talk about Christianity as though they were promoting it, and you sometimes can find the spot where they're taking an activist or sarcastic position against it.  Which, by the way, they always ate, Tool is extremely anti-Christianity and at least half if their songs are about that.\n\r\nAlthough there are no Christianity-related comments here, the complete and utter lack of depth given in the meanings posted here is amazing.  Tool is is an extremely depth-filled band that makes Dan Brown-level puzzles out of their CDs (or at least out of Lateralus).  A mere \"Hey stop killing each other\" has been done by like every activist band ever, and 85% of the rest of rock bands as well.  Even Hollywood Undead, who frequently talk about \"bang sluts,\" does this.  My own explanation, because it is based only on the obvious lyrics right in front of you and is not even relaying to other songs on this CD, will most definitely be missing at least two aspects.\n\r\nThis song, first, mentions \"Christians say why did God give free will?.\"  This alone is multi-faceted, with the two biggest meanings being that 1) Christians want drones - \"Why should we have free will?  God should direct us so that were all moronic puppets with a pointless existence!,\" Christians think and 2) Certain types (they don't say the \"certain types\" part) ofChristians claimto want peace and happiness for people.  They also say \"How they survive so misguided is a mystery,\" referring to Christians, but using it ironically, that the \"misguided\" ones according to the Christians are those who don't believe in their gods and cause.  And yet...\n\r\nCHRISTIANS are the ones killing over pieces of the ground.  In the second chorus this is revealed from the previously ironic statements which are said by those who believe in Allah or Jehovah.  \"Repugnant is a creature who would squander the ability to live in heaven.\"  \"Cut it in two,\" \"these stupid fools are killing reach other instead of following our god.  Repugnant are such people, let's go kill them.\"  And the angels watch \"confused\" (a metaphor of course, a Thelemic-like interpretation of the word \"angel\".  Which is completely abstract by the way and could be almost anything).\n\n\n", "comment_344": "\nTIMMMAY\t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nTIMMMAY\t\t\t\t\n\t\t\t\t\n\n"}