{"comment_0": "\n(first verse) i think that it's saying that everyone's life is the same, and that people think they're original and individuals but we're not really. And the words circling and \"round and round\" kind of suggest the same, and that it's never ending.\n\"you don't have to hold your head up high\" as in you don't have to feel special, and proud all the time. \nAnd in the chorus, i think that he's saying that there must be another reason to life than this ^ and that he won't give up until he finds an answer.\n\nAll the emptiness inside you\nIs hard enough to fill\nWithout a sense of purpose\nWe're setting up to fail\nYou donâ\u0080\u0099t have to make it right\nJust hold your head up high\n\nand then in the bridge ^, he's saying that you think you don't have a purpose in life and that that's ok you don't have to fix it, just be proud of who you are.\n\nyeah sorry. i'm not really good with words :P\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe Imagine Dragonâ\u0080\u0099s song Round and Round relates the authors hardship in finding a purpose in life, while observing the falseness of the lives around him.\n\nIn a way that neither condemns nor agrees, he tells how many live their lives lying to themselves thinking they are more than what they truly are. â\u0080\u009cWe think we're making our own wayâ\u0080\u009d. Here, he relates the error in feeling in control of oneâ\u0080\u0099s life telling how people are all born with the same mindset, and are â\u0080\u009call living the same wayâ\u0080\u009d, and they canâ\u0080\u0099t escape it. In addition, he sarcastically points out the falsehood in self-righteousness. â\u0080\u009cYou donâ\u0080\u0099t have to hold your head up highâ\u0080\u009d. Although he is critical of people around him, the tone of the song indicates he is simply disappointed and wants more. \n\nAlthough his inclination is to hide from the truth he decides to confront it. â\u0080\u009cI wonâ\u0080\u0099t run away this time, till you show me what this life is forâ\u0080\u009d. His persistence is truly what sets him apart from others. While everyone else abandoned hope of finding what was real, thus becoming callous to their doubts, he sought to answer these questions even though it meant perseverance and waiting. \n\nBasically, the song tells people that if one doesnâ\u0080\u0099t seek answers and face the darkness in life, they end up living a lie.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nTo me this song seems to have multiple meanings. \n\r\nFor one, it could be a love story. Partially because I've had something like this makes me think of happen to me. I think it could be about a guy who falls for this girl, or vise versa. But this guy won't give up on being with her anytime soon, hence: \"I won't run away this time\". That's basically all I think for the love theory. Someone who won't give up on love. \n\r\nThe other meaning to me, could be about life going on and on. We are the way we are, and there's a reason for that. Life goes on, and we'll each be our own individuals, and no matter what, nothing is going to stop that. Or maybe you're afraid of something happening. For example, someone who's afraid of death. There's nothing anyone can do to prevent it; life goes on. Or 'Round and Round'. \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nFor me it means whatever you do, you are yourself and you are that way for a reason. The world will still keep spinning, and you have to enjoy life as it is.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nMy opinion on the song meaning is part of a love story. They keep on doing the same thing over and over again and it keeps going on, but thinking each time is something different. Unless you show him he is wrong, he is not going to run away nor change his opinion. Suffering from lies and getting pushed, but protected by their past love, one step at a time, waiting patiently. The point is, The pain can be healed, but without a source, you wont be able to fix it. You dont need to change it! JUST STAY STRONG!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think everyone is hitting it right either a love song or about life. My opinion is, it's about life. One verse (witch is the reason why I looked this up in the first place) \"you don't have to hold your head up\" I think no one has really gotten the correct message along with that. My opinion is that it's saying you don't always have to be strong. You can break and it will be okay. Although it does say later in the song, \"just hold your head up high\" I think they mean it's okay to break but after a while but yourself up and be strong. Don't always be weak. \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI believe this song can have many meanings to many people but here is what I believe it means. \n\r\nI believe the first verse refers to the fact that we are all part of the same life and we don't realize or words and actions effect others and we all try to escape our words actions by hiding them under lies and secrets.\n\r\nWhen it says \"You donâ\u0080\u0099t have to hold your head up high\" I believe it refers to the pride we all feel,  that many will protect with their life. \n\r\n\"We are afflicted by fiction\" I believe refers to the great plague of lies every one of us adds to. \n\r\n\"Building a case for eviction\" refers to the destruction those lies will cause. \n\r\n\"Guarding a tower of ancients\" refers to all the lies and secrets of the past you must continually cover up. \n\r\n\"Shooting down arrows of patience\" refers to when someone begins to uncover your lies and secrets it hurts (as if being shot by an arrow) and you must cover it up and patiently wait for it to pass by, your mind painfully circling with every second that passes. \n\r\n\"Round and round\" the endless cycle of lies and secrets.\n\r\n\"I wonâ\u0080\u0099t run away this time\" refers to the fact that you must stop running from the secrets of the past. \n\r\n\"Till you show me what this life is for\" there must be more to life than the lies and secrets.\n\r\n\"Iâ\u0080\u0099m not gonna let you change my mind\" make up your mind today to stop running from your past and don't let anybody tell you different. \n\r\n\"All the emptiness inside you\r\nIs hard enough to fill\r\nWithout a sense of purpose\r\nWe're setting up to fail\" people will try to give themselves a sense of purpose by telling lies to fill an emptiness they feel and only making that emptiness feel even greater than it was before. The lies are only setting them up for failure And the only way to truly fill that emptiness is by telling the truth. \n\r\n\"You donâ\u0080\u0099t have to make it right\" you may not be able to fix the lies of the past. \n\r\n\"Just hold your head up high\" replace your pride with courage to tell the truth and stop running from your past or you'll become stuck in an endless cycle of lies and secrets.  Have confidence in yourself and who you are! \n\n\n", "comment_7": "\nI thought this was about a spy. Dang o_o\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nEvery time I listen to it, I imagine it on a religious level.  \"I won't run away this time, till you show me what this life is for\" is being spoken to God. Showing a desire to let your old self go and move forward with a purpose.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nIt sounds like heâ\u0080\u0099s battling a crisis of faith.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI disagree that this song is meant to tear down those with a higher sense of self-importance. I see it as a cry for answers and meaning, a reason for existing. It has a heavy vibe, almost weighed down by depression. \"You donâ\u0080\u0099t have to hold your head up high,\" seems to me like a reassurance; that you don't have to pretend to be happy and fake it for everyone else. This along with other lyrics, \"We are all living the same way\r\nWe are escaping the same way\r\nCircling,\" strongly reminds me of the looping cycle of depression.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nWe're all living our lives, circling and circling, looking for a purpose, a point to it all. We go about our daily routines, every day the same.\n\"The same play\" all the world's a stage, right?\n\"You don't have to hold your head up high\" it's okay to admit you're upset, lost, hurt, confused, you don't have to pretend to know what you're doing, none of us really know. What is this life for? This song is a beautifully drum driven cry of confusion yet also reassurance. It's good.\t\t\t\t\n\t\t\t\t\n\n"}