{"comment_0": "\nThis is my first attempt at entering lyrics so I hope they're good. I love this song. I can't wait until Chris Browns CD is released on iTunes.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think the meaning of this song is obvious. It is talking about a boy who is at a party and just wants to have fun and dance wit some gurls. He is asking do they have a man and if they dont, he is asking them to dance with him. He is trying to see if they know how to move because he knows that he already can.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis is a cool song. Chris may be young but he sure can dance.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni love this song its a great party song. and i met chris brown at jamba juice near my school i love his new song \"yo\"\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nCool. I just submitted lyrics to Yo(Excuse Me Miss). They should Be Up Tomorrow.Happy Holidays.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nUh, this is pretty much what every rap song is about, either getting high, going to a party, or a girl.\n\r\nnot that hard.\n\r\nyo yo yo yo yo yo yizle\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nDoes it really matter what it means? Awesome song. Enough Said\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nMy favorite part is the little R&B stanza and where it climaxes at \" the way that you wear them jeans is turnin' me on...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nSHITTY SONG.\n\r\nDumb-ass wannabe Usher pop artist.\n\r\nWill be gone along with other acts like Immature, IMX, BBD, etc\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nok from what i can tell this song is NOT just about dancing u guys\r\n\"Plus I heard if you can dance you can bump\r\nWell dance time is up\r\nLet's Go\"\n\r\ncmon people\n\r\ni do like this song (i have it on my ipod and everything) but it think its funny how its talking about how hes a \"big boy\" and it keeps pointing out how young he is.  it sounds really little kid-ish in those parts.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nFuck Chris Brown and his devil friend Julez Satan.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song is realy annoying. How could it possibly have knocked Gold Digger of No. 1 in America?!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nwell chris brown is good so i don't what you're talking about butmaybe no where as good as eminem or kanye west but still chris brown has good dance moves and can sing well\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nFunny, I thought it was a song about getting a girl to cheat on her boyfriend for some dude at a club...there seems to be an incredible number of them these days.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nwat a wkd song his album is amazin i luv every single 1!! xxx\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni fucking hate this song\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nhahaha....i saw chris brown on the oc last nite...he was a nerd!!! hehe....xD\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nim with livelikenotomorrow... this is the gayest, shitest.. fucking annoying song out.. chris brown is a tosser... and anyone that likes him can be a tosser too\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nGAAAYYYYYY\t\t\t\t\n\t\t\t\t\n\n"}