{"comment_0": "\nI have been reading about the true self which is how we are when we are born and we are supposed to be free and happy but we get told not to do things,told to do things we dont want, smacked, judged, controlled, shamed for being alive. The shame remains inside the brain/body having learned from parents and school and it becomes automatic, judging and controlling us from the inside. 'It' learns do do things to avoid abandonment from parents and the true self underneath is constantly screaming to reconnect with us, which is the fear we feel, so we drink, smoke, party, distract ourselves from the true self fearing the shame but wanting to reconnect. It is like having a small child and constantly ignoring it and or abusing it and it is screaming and you cant stand the noise and distract yourself. All it wants is love and no more shame and this conflict is going on in our minds unconsciously. On the surface we have cravings,copulsiveness and addictions that seem to have no reason to be there. I think what they call the ego is a screaming frightened and abandoned energy reacting to inner and outer shame. It's emotions and energy are constantly being suppressed and drugs are a powerful way to release it by force. If we can do what we truly want without any fear or judgement and notice when we feel shame from within and the feelings that come with it we will feel happy without needing anything from out there. There is a cure from all this dysfunction, that is all it is! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think this song about dealing with an addiction, perhaps an alochol addiction considering that Metallia was once called Alochollica.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nuhh... since I once heard James Hetfield say that this song is about addiction, that is what I'm going to go with here. If anyone here has had the unfortunate experience of dealing with addiction you could see where it would make sense. Those of you who interpret the song as being about evil aren't far off as being addicted to drugs and/or alcohol is a bitch and sometimes leads people to do things they wouldn't ordinarily do. \r\nthe lines \"I'm your life, I'm the one who takes you there....I'm the one who cares....do my dirty work scape goat......pay the price, pay for nothings fair.\"  really work for the addiction scenario.  The sad fact is that you can turn your back on your friends and family but you can't turn your back on a drug. And once you are controlled by a substance,  and i mean really controlled by one it really changes your persona.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nmaybe its just me, but personally, i get the feeling that this explains the betrayal of one person to another\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think its about a persons drug addiction, (or alcohol addiction which may be more likely), but, I think its from the perspective of said drug/alchohol, as if the item the person was addicted to was talking to the addict, corrupting him in a way but also telling him how it is, and what the item is telling him, is \"sad but true\"\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIs this just my self or not, but i think it's about one word \"addicted\".. When you are addicted to something, that thing will be part of you.. Really love this lyric.. it make me think everything bad had a voices SAD BUT TRUE!!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIt's about inner demons. It could refer to drugs, violence, sex, power, greed or anything else. Everyone can relate to this song, we all struggle with something.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI thik this song is talking about God, but not in a possitive way. I feel like this song is supposed to be sang from the perspective of God and he is talking about how he says that he is everything for us, but it's not actually true. It says \"Iâ\u0080\u0099m your life\nAnd I no longer care\" which would be God talking and it's true, God says he's our life but doesn't seem to care. This song was probably written to make people think logivcally and realize that god is either evil or imaginary, and i think that what they believe is that he doesn't exist and they're right.\nSorry if a offended anyone.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI with all of you. This is a song about a guys's dark side speaking to him and controling him. this song is antoher that is best heard live. This is like minus human with it's looseness and heavyness. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nUh definitely not about suicide, i think just about everyone else was right besides you Ekliptik. How moronic. Suicide...lol..there's one line that you can barely relate to the word in the song..so it must be about killing yourself eh? Clueless.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nits obvious that its your inner evil that takes control of you sometimes and you have no control of it\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think its about multiple personalities or schizophrenia.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nMetallica didnt used to be called Alochollica., it was a joke a fan started and it kind of stuck as a nick name threw out the 80's but it wasnt ever offically there name.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI don't care if you insult me, I don't have much knowledge of music never said I did, I just wnated an answer to my question.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis reminds me of my EX.\n\r\nHey\r\nI'm your life\r\nI'm the one who takes you there\r\nhey\r\nI'm your life\r\nI'm the one who cares\r\nthey\r\nthey betray\r\nI'm your only true friend now \r\nthey \r\nthey'll betray\r\nI'm forever there\n\r\nShe had convinced me that she was the only friend I had and that she was the only one she could count on. \n\r\nyou\r\nyou're my mask\r\nyou're my cover, my shelter\r\nyou\r\nyou're my mask\r\nyou're the one who's blamed\r\ndo\r\ndo my work\r\ndo my dirty work, scapegoat\r\ndo\r\ndo my deeds\r\nfor you're the one who's shamed\n\r\nI would do things for her that I didn't want to do but she had controll over me and I did them anyway. \n\r\nhey\r\nI'm your life\r\nI'm the one who took you here\r\nhey\r\nI'm your life\r\nand I no longer care\n\r\nAnd now she has betrayed me. She was only there for me when she needed me and she was never the perfect girl that I thought she was.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nyeah this song is about alcohol. as i hope you all know james went through a hardcore drinking problem and this was a song he wrote about it.. then he went through treatment and after that everything he ever wrote ended up being shit. in conclusion, if you're in an awesome band and you have a drinking problem, suck it up pussy and keep drinking and making good music. gah i can't imagine what metallica would be like now if he was still drinking.. well actually... we probably would have a dead james hetfield, but hey at least we'd have good metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI know this to be a fact.  This song is about James Hetfield's love affair with his hand.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nFor me, this song is about God, and someone's realization that God exists. The fact that God is not only 'good'. God is everything. God is also us. We are like puppets. We think we are in control but since God is everything we play no real part in our own lives. He's playing with us for his own reasons, that we don't know. We just experience carrying the blame and paying the price for the deeds he makes us do.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nDepression.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nYou guys are dumb,this song is about devil,he is inside us and he tempt us,he can see thru our eyes when we commit sins,he is the hate when we seek love,he is symbolically our friend because he lives in us shares our good and bad moments as \"true\" friends do,but the fact is that we will be ashamed and blamed when the judgment day comes,he is our dream as a sinful fantasy that we all have sometimes in our lives and interestingly enough metallica says pay pay the price pay for nothing's fair it represents out punishment for the sins that we have committed,then they say i i'm your life i'm the one who took you there and the truth is that devil can only lead us to hell or sulfurous lake of fire where all the doomed soul will burn forever,then it says i'm your life and i no longer care,which means his mission is to follow us thru whole life lead us astray and finally when life gets over and soul is sent to hell he truly don't care his mission is accomplished,and one more thing they they betray now what metallica meant when they say that \"they\" betray who are they,sadly enough but true they are referring to God and His Angels,that is metallica satan worshipers\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nIt's about the inner self that heals us when the outside world hurts us emotionally\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nTo me, it means you've been betrayed so much. You only have one friend but in reality it's just you. \"They betray, I'm your only true friend now\" and at the end.. \"I'm you\". See?\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThis song is so obviously about the devil!\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nSince the album has one of the symbols associated with libertarian ideals in the cover, the Gadsden flag snake, and it contains a song which is titled with the text that goes below the snake: \"Don`t Thread On Me\", it's fair to say that this album has a very clear political tone and stance.\n\nSince libertarians believe in free market capitalism, and they are opposed to any form of populism, which is a way of PRETENDING to care for the people, specially the most vulnerable ones, like minorities and the poor, with laws that seem very benevolent and beneficial to these groups, while in fact they are designed to only contribute to maintain them in their position of vulnerability and dependency of the State forever, so they can vote for the populists forever and maintain their power.\n\nOne of the greatest forms of populism is the one preached by the socialists/communists followers of Antonio Gramsci, an Intalian socialist who developed a strategy for implementing socialism around the globe. This strategy was meant to replace the bloody armed revolution preached by Karl Marx in the Communist Manifest of 1838. Gramsci's idea was that, intead of the blunt, violent approach that was taken in the Russian Revolution of 1917, Cuban revolution of Fidel Castro or Chinese revolution of Mao Tse Tung amongst others, they should quietly and progressively infiltrate their ideas and philosophy into the mass culture: Starting with universities, arts in general (film, music), press, media, anything that would provide a channel to spread their ideas to the masses, but in a discrete, not obvious way.\n\nWith that strategy, with decades of work, they would  (As some believe they succeeded in) have \"soldiers\" everywhere, fighting and defending the socialist ideals sometimes without even knowing where those ideals came from. In a form of mind control or brain wash, so to speak. \n\nSo, if you listen to the verses of the song again, now assuming that the words are spoken by this \"entity\" , which would be socialism itself, or populism, if you may, this philosophic shadow  personified, or maybe Antonio Gramsci himself, which dictates what we all think and do. Making us do terrible things (the dirty work) in it's name, making us take the blame (We are the ones who are shamed) and fight instead of him (we are scapegoats). In the end the entity reveals itself: \n\n\" Iâ\u0080\u0099m your truth, telling lies ( One of the main strategies preached by Gramsci is to lie)\nIâ\u0080\u0099m your reasoned, alibis (to do and defend the bad things in name of Socialism)\nI'm Inside, open your eyes  (hey, wake up you idiot, I'm inside you all this time )\nI'm YOU! \"  ( the ideology has completely taken over the person's thoughts and actions)\n\nIt gives me goose bumps. It's an awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nIt is about your evil part which tries to take the control over you. It was inspired by the film \"Magic\"\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nthis song to  me is about a man's \"darkside\"  speaking to him. telling him how it(the darkside) runs his life.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis song is about Suicide, and I'll Quote the Lyrics - \"hey, I'm your life, and I no longer care\" - and Also about the 'inner voice' of your consience, Telling you what you do, and what it will do for you.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nIt sounds to me like they're talking about getting pulled into a mafioso sort of arrangement.\n\r\n\"you you, you're my mask, you're my cover my shelter\"\n\r\nyou're the fall guy\n\r\n\"do, do, do my work, do my dirty work, scapegoat\"\n\r\nyou get to do the dirty work because you're expendable\n\r\nthe parts about being \"his life\" mean that if he leaves he's screwed, because he's already in too deep.\n\r\nI think the first verse really gives it away:\r\n\"Hey\r\nI'm your life\r\nI'm the one who takes you there\r\nhey\r\nI'm your life\r\nI'm the one who cares\r\nthey\r\nthey betray\r\nI'm your only true friend now\r\nthey\r\nthey'll betray\r\nI'm forever there \"\n\r\nsounds very gang/mafioso related to me, saying everyone else is lying, and they're your only friends.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nBrilliantly haunting song about the Self wearing masks. Inner Truth never sounded so good, or so heavy. This is Metallica doing what they do man, and it's fuckin awesome!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\na good song from an average album.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\n\"you you, you're my mask, you're my cover my shelter\" \n\r\nis not refering to the mafia.  The bad side is the cover or shelter.  When something bad happens he hides behind his bad side.  his bad side is his only true friend.  As if \"I'm you\" didnt make it clear enough.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nDo you know Tyler Durden?\n\r\nThe thing that struck me about this song was the similarities to Fight Club. Consider the lines\n\r\n\"you \r\nyou're my mask \r\nyou're the one who's blamed\"\n\r\nIn fight club, everything tyler did, \"jack\" took the blame for\n\r\n\"I'm your dream, make you real \r\nI'm your eyes when you must steal \r\nI'm your pain when you can't feel \r\nsad but true \n\r\nI'm your dream, mind astray \r\nI'm your eyes while you're away \r\nI'm your pain while you repay \r\nyou know it's sad but true\"\n\r\nWhen \"Jack\" slept, Tyler controlled his body. His eyes while he was away, dream mind astray and pain when he couldnt feel\n\r\nYou think?\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nWell, let's think about this. Fight Club came out in '99, the Black album came out in '91. Still think it's about fight club?\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nim not taking sides, but it could still b bout fight club (y does it have to b metallica copying? y couldnt fight club get it from metallica???) haha metallica kicks ass ~4 ever~ as 4 the meaning flames38\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nYou misunderstand me SolidSteak, I was implying they deal with the same theme, not taht one is based off the other\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\ni think that the song is being narrated by \"evil\" and the evil is saying how it can do whatever it wants by being in your brain and using your body for the dirty work. hence the line:\n\r\nyou're my mask \r\nyou're the one who's blamed \r\ndo \r\ndo my work \r\ndo my dirty work, scapegoat \r\ndo \r\ndo my deeds \r\nfor you're the one who's shamed \n\r\nyea that's my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nDefinately about Satan. The Father of Lies!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nNO!!! It doesn't have to about Satan, it could be anybody that you let run your life:  a boss, a co-worker, anybody.  So untill the authenticity of Satan is proved I'm sticking with my opinion!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nit seems to me that Master of Puppets and abrooke01 have got it right its about there addiction to alcohol and how it conrtols them if u look at the lyrics it makes sence\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nThis is the only song recorded after \"Justice\" that doesnt make me want to vomit. It has a couple of good changes, and Hammitt laid off the fucking Wah pedal for a second, reminds me of the good old days.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI think it's just about how everyone, even against everyone else, has themselves to look to...\n\r\nthat, and this song is awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis song reffers to the devil.  The devil that takes over us, and becomes in control\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nWhy does it have to be him battling the \"devil\" inside of him? Ever think it was just a man and his conscience? Think about it. The last four lines seem to be pointing out that it is him himself and not some external force that's trying to control him. That's what i gather from it. Just a man and his conscience. I think that pqf1976 is probably right when he adds that it's about the psychotic mind of a killer.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI think this song is about an abusive father, and the boy grows older he realizes how much like his father he has become.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\ni think this song is about being owned by something that benefits you to a degree, but in the end fucks you over. I came to this conclusion right after i got fired lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\ni think that this song is about an evil, most probably the devil, which controls you the more you listen to it. For example, earlier in the song it is like they are being tempted and later it is like the devil is working through them \"you're my mask\" and becoming you, whilst torturing you \"do my duty~for your the one whose shamed\". Also, many people have said this could be a lot of things, drug related, abusive fathers, and these all stem from the devil, so in the end all of you are right.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI think it's to do with the whole dealing with the 'evil' inside. To me it reminds me very much of the best movie of all time, Secret Window...\n\r\nHey\r\nI'm your life\r\nI'm the one who takes you there\r\nhey\r\nI'm your life\r\nI'm the one who cares\r\nthey\r\nthey betray\r\nI'm your only true friend now \r\nthey \r\nthey'll betray\r\nI'm forever there\n\r\nMort's wife betrayed him by cheating with another man and he soon left to live by himself, away from all others in his log cabin, but it forever was on his mind (I'm forever there)\n\r\nI'm your dream, make you real\r\nI'm your eyes when you must steal\r\nI'm your pain when you can't feel\r\nsad but true\n\r\nI'm your dream, mind astray\r\nI'm your eyes while you're away\r\nI'm your pain while you repay\r\nyou know it's sad but true\n\r\nMort becomes schitzofrenic, which this verse could quite easily be translated into meaning (I'm your eyes while you're away) While mort's second personality is in control, Mort is 'away' and is unaware of what's going on\n\r\nyou\r\nyou're my mask\r\nyou're my cover, my shelter\r\nyou\r\nyou're my mask\r\nyou're the one who's blamed\r\ndo\r\ndo my work\r\ndo my dirty work, scapegoat\r\ndo\r\ndo my deeds\r\nfor you're the one who's shamed\n\r\nMort's dark side has been making him do horrible things which on one side he has wanted to do since his wife betrayed him, but it's not something anyone with a conscience can really do.\n\r\nhate\r\nI'm your hate\r\nI'm your hate when you want love\r\npay\r\npay the price\r\npay, for nothing's fair\n\r\nhey\r\nI'm your life\r\nI'm the one who took you here\r\nhey\r\nI'm your life\r\nand I no longer care\n\r\nMorts dark side 'took' him to the place he needed to go to do what he did and his madness drove him to no longer care for those around him.\n\r\nI'm your dream, make you real\r\nI'm your eyes when you must steal\r\nI'm your pain when you can't feel\r\nsad but true\n\r\nI'm your truth, telling lies\r\nI'm your reasoned alibis\r\nI'm inside open your eyes\r\nI'm you\n\r\nMort always had alibies as to where he was, and obviously being that he had the split personality he THOUGHT it was Shooter, who had been threatening him, he was telling lies to himself, he had viable alibies but in the end he opened his eyes to the numerous signs that this madman and all he had done was really mort, he then has a disscusion with himself telling himself to open his eyes and realise what the hell has been going on (I'm inside open your eyes I'm you) Mort's dark side has finally taken over and he finally does what he had wanted to do for so long, but could not bring himself to do so because after all that has happened he opens his eyes and realises what is happening.\n\r\nAll that aside, I do NOT think the song is about schizofrenia (even though it very much reminds me of Secret Window) but merely saying, we all have voices in us, one that will say, yes do it, and one that will say no... this song is about the voice trying to make you do wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nwatch the mtv icon featuring them.  James is quoted as this song was meant to express how he felt when people would see him in person and expect him to be an in your face energetic animal all the time.  He did it because he wasnt a frontman all the time and we shouldnt expect him to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\ngoeb2, I'm trying my hardest to hold back from insulting you and your knowledge of music.  It's clear that you don't have a clue.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\np.s.  the song kicks ass! metallica  is right up there for the best band in the history of the world\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nA picture is worth a thousand words and a song is worth more. what i mean is that a song means differnt things to differnt people. to me this one is about someone with a split personality\n\r\nHowever the inspiration behind sad but true, what this song is about, is indeed alocholism and the addiction to it that the band went through. \n\r\nI know that because it came right from the Horses mouth, Metallica said it thwm selves\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nAlso forgot\n\r\nfriskitty is 100% right and there is proof. when they were at ozzfest, instead of people screaming OZZY, OZZY they wanted an enchor from matallica. Ozzy People we're talkin about ozzy here...He Who Wears the crown of rock n' roll on his head\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI think that some songs are written vaguely with the intention of having the listener fill in the vague parts. You all have your own opinions as to what the \"I\" stands for in this song. I, am schizophrenic I believe that this song is about the little voice in the back of your mind saying, \"Hey, those people aren't really your friends, look what they do to you. Come with me. I'll show you what WE can do together as friends.\" While the voice is really using your own paranoia against you. You know deep inside that these are your friends, but you can't convince yourself. Hence, you give in to doubt and that little voice uses you as a shield. It does horrible things, but you are the one who is blamed. You didn't have the willpower to resist.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI was watching cunning stunts the other day and it seemed as if James was aiming the lyrics to the fans... I know it sounds weird but if you listen to the song and interpret it in that way it kind of makes sense...\r\n\"I'm the one that takes you there\" and \"I'm your only true friend now... I'm forver there\" Could suggest that the fans rely on Metallica however they're feeling, as many fans have said the band helped them through tough times.  The title could be that it's sad, but true of the fans dependancy on the band. \r\nSome lines give a link of Hetfield being somewhat of a God: \"I'm your dream\" etc\r\n\"You're my mask.. cover.. shelter\" is that he takes his emotions out by writing new material for such a large fan-base who are always wanting more.\r\nWhen things go wrong for the band e.g bad record sales the fans are \"blamed\" or \"scapegoats\" \r\nAnd the last bit, \"I'm inside, I'm you\" shows that although people see him as a \"God' he's nothing supernatural, just like everyone else, and there's a bit of that in all of us\n\r\njust  thought...\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\ni have heard rumors that this song is about james hetfields' girlfriend at the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\n?? that mustve been one helluva girlfriend if it was!?\n\r\ni think this is about the guys 'evil conscience'. his dark side whichsubconciously controlls him..\n\r\nbut i could be wrong i think m3tall1ca ^^^ has a good idea\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI think Friskitty is right. I didn't know that Hetfield said this was about drugs, but it makes sense.  I always this song was about someone who was wasting their life away, and those people who abuse drugs to the point that it affects their life adversely are doing basically the same thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI agree with the addiction part with the alchahol. It makes more sense in my opinion. This was the first metallica song I heard when i was six, ha.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nStill syncs up with Fight Club/\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nI love this song. It's soo frikken AWSOMEE... to me this is my second favourite after enter sandman... YAY\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nIn my opinion this song is about the bad side of us as individuals. \r\nThe lines 'I'm your eyes when you must steal,' etc, give the feel that we let this side of us take control when we do something that we know isn't right. Such as stealing.....if you catch my drift.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI think it is about a drug addiction, and what you become when you are on the drugs. In some cases it makes you steal to keep up the addiction (im your eyes when you must steal). And in the end who gets blamed for all the bad stuff you do whilst on the drugs?!..the addict, not the drugs themselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nits fate\n\r\ntaking us through life, helpless us\r\njams really understands tho fucking life\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI must agree with those who identify the devil in this song, taking over the man.  This also aligns to later songs.  In devils dance you can hear \"Let me make your mind, Leave yourself behind\", which then results finally in \"I'm you\".\r\nThese are the accusations of the devil, who wants to lead us into sin, since nothing else seems to make sense anymore, for the sinful one.  He can't even feel anymore, though the pain is there.  Hmm, really black, that album.  Maybe it's best to follow the god that failed, in the end ?\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI don't remember exactly through which media source I heard this, but this song's supposed to be about drug addiction, and if you really think about it and look over the lyrics again, it's very relative to what an addiction can be.\n\r\n\"You. You're my mask. You're my cover--my shelter\", or \"you (the drug) are my refuge from reality\".\n\r\n\"Do, do my work. Do my dirty work, scapegoat. Do, do my deeds, for you're the one who's shamed\", which can be interpreted as the drug talking to the addict saying, \"You're gonna do what I make you do because you're gonna take the blame for it anyway.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nthis is my fav song on the black album. The lyrics r so wicked. \"I'm U!!!\" I think James is talking about the hypocracey of the media and the whole world. By the way Metallica has never sold out. With out Metallica and Alice In Chains I'd have no reason 2 live\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nFEAGKDSAFPSDGJPODSFKP\n\r\nAlcohol addiction is what this song is about--makes perfect sense every time I read the lyrics.\n\r\nbut DAMN, people, schizophrenia and dissociative identidy disorder (formerly known as multiple personality disorcer) are two very different things! Take a basic psychology class and you'll figure that out really quick.\n\r\nSchizophrenia is a form of insanity that causes intensely real hallucinations. I remember a movie about it--but I can't remember the name of it. =/  Awakenings, perhaps? >_> I honestly can't remember. It was very good, though. This guy kept having hallucinations about an old war he was in, and he had all sorts of old papers he thought were maps and blueprints n' shit in a shed he kept locked...\n\r\nfucking creepy shit, but a GREAT movie.\n\r\nAnd guys? Alcohol IS a drug. =/ So, in essence, this song IS about a drug addiction.\n\r\n...That movie's name is going to drive me nuts... XD;;\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nMAN THIS SONG IS FUCKIN AWESOME! ITS ABOUT THE PARTYING DRINKIN FANS OF METALLICA NOT THE FUCKIN EMOS AND GOTHS YOU SEE NOW, just look at the music video....i don't see any  emos there XD\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\ni think it's about a drug that takes over someone.... everyone else has betrayed this person, but he can always rely on this one drug to be there... ya know?\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\ni can see where dropdeadfred is coming from. i don't really have a set meaning for any given song...it means different crap to different people. drugs is a possiblity......as is any other substance or something that controls someone.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\ndoes it not put posession in anyone elses mind??\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\ni thought it was about multiple personality disorder.. \r\nbut i can see the drinking side too..\r\nits like most of metallicas good music, no totally obvious meaning, you can make it mean what you want...\r\no and sad but true kiks sandmans ass anyday =P\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nim gonna say that part of it is about ur inner darkside but another part of it is a little like master of puppets because if u look at the lyrics it sorta talks about self manipulation\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nya metallicas old stuff is WAY better but this song is really good and the lyrics are powerful.  I dont really know about the whole child abuse thing but i think its about an evil spirit (possibly satan) tempts a human and eventually completely possesses him hence the phrase \"im inside open your eyes... im YOU!!!\" as in i am now at the point where i completely rule over you. I am you.  Kick ass song. Metallica rules!\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nI think it is a self realization.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nAny one that has ever been an addict can relate to this song. I think that it is the drug talking to someone in thier subconconsience.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nMost of you are dumbfucks, but a few are on the right track. In essence with ambiguity, the song IS about the dark side of man. But it's deeper than you pudwhackers think. It's about the source of pride, the source of desire which encompasses man's dreams and becomes directly proportional to all of one's pains in life. It's about the ego. Not simply the Freudian term, but a far more encompassing entity which latches onto the chakra of the soul with the one true purpose of promoting non-existence through spiritual declination and eventual annihilation of the divine presence or \"true you\" through proxy replication of the soul from a greater \"entity\" that remains the antithesis of the one you sheep call god. Ironically manifesting itself within the spiritual bounds of your soul no different than the destructive nature of a computer virus would on a file.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nwhat i heard was him saying that he's all these bad things making someone do it, I'm this, I'm that.\n\r\nbut at the end he surprises you by saying that it isn't anyone else, its just you\n\r\nyou are your hate, you are your truth, you are your only shelter, you cant blame it on others\n\r\nits all you, take control\n\r\nor something along those lines\n\r\nthis song rocks so bad..metallica rule\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nI think it's like a cocaine addiction... \r\nhe thinks it's some force he can't control making him act senselessly. but then he realizes that all it is, is his decision to take the drug and that allthis is his fault and the addiction he's fighting against is himself...\r\ni think\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nNot trying to seem naive but if you've read the novel by John Steinbeck \"The Pearl,\" then I think that this song illustrates what becomes of Kino after he obtains the pearl and is consumed by it.\n\r\nNo doubt a wonderful song. I'm bringing it into class for extra credit xD\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI think this song is about manipulation. People claim they have proof to say otherwise, but frankly i don't give a fuck what it ment 2 metallica, i care about what it means to me, and if you read the lyrics carefully maybe you can see this viewpoint.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nthis song is obviously about the evil and spite inside evryone, this song got me into metallica:)\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nthis song has special meaning to me:\n\r\ni relate this to drugs. a few lines in particular...\n\r\n\"I'm the one who cares\"\n\r\n\"I'm forever there\"\n\r\n\"you're the one who's blamed\"\n\r\n\"I'm your dream, make you real\"\n\r\nwhether or not you folks find it, that's what it means to me... just thought i'd say something... great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nim not sure or anything, but my guess is that this song is about the devil (or evil things in general) controlling you... but idk lol\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nim not sure or anything, but my guess is that this song is about the devil (or evil things in general) controlling you... but idk lol\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nJames is singing about you, and I and everyone else being the same, regardless of who's smarter, who's a nigger, who's a faggot, who's a child molester, we are all one.\n\r\n\"I'm your pain\". Your suffering is my suffering, mine is yours. Let's say a nazi says \"let's extermiante blacks and jews\", what are they doing? They're giving into a weakness, and admitting that because those people exist, the themselves suffer. What would happen to someone like that is, better whites would step in and kill them, eventually, because they gave into their animal instinct/weakness, and thus would be exploited.\n\r\nSuicide is murder, and betrayal is self-denial. This song actually has a strong buddhist meaning to it. But take it how you will, as everyone can relate to the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI think Sad But True relates to government propaganda... The lyrics are spoken by a government authority figure e.g. \"Uncle Sam\" convincing people to join him at war... not that the lyrics are his form of persuasion.. but maybe the true meaning behind his propaganda that only he knows but kept secret from society...\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nThis is an awesome Metallica song, a favourite of mine. To me, it could be aboot two things: drug/alcohol addiction and depression. While the first commenter could be right, think aboot it, sounds like a drug/drinking addicition to me, how the addict loses control and feels false sense of security...\r\n\"hey\r\nI'm your life\r\nI'm the one who cares\r\nthey\r\nthey betray\r\nI'm your only true friend now \r\nthey \r\nthey'll betray\r\nI'm forever there...\"\r\n-An addict might feel like that addiction is everything, and developing a paranoia, a false trust in the addiction to sustain and never betray or leave...\r\nThen, the addict realizes they've been controlled or screwed by it...\r\n\"hey\r\nI'm your life\r\nI'm the one who took you here\r\nhey\r\nI'm your life\r\nand I no longer care...\"\r\n-The addiction is an obsession, and has driven their life into living hell; the addict feeling betrayed by the addicition, shocked into reality, possibly..................... Also, sounds like depression, how it screws with you and your brain. Don't think that's what it's aboot, just saying it sounds like it or something.\r\n\"I'm your pain when you can't feel\r\nsad but true...\r\nHey....\r\nI'm the one who takes you there...\"\r\n-Takes happiness away, makes you feel like crap, and possibly leads you into deeper crap.\r\n\"hey\r\nI'm your life\r\nI'm the one who cares\r\nthey\r\nthey betray\r\nI'm your only true friend now ...\"\r\n-You feel alone, like your an annoyance to others and/or they don't like you/betray you, so you wallow and keep to yourself, and you believe you're your only ali, not wanting help from a psychiatrist or anti-depressants (so you feel stuck, like it's not going to go away).\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nok for all you so called metallica fans out their you have no clue  what this song is about the song is actually bout a man who is trying not  bre like one of his parent but in turn by his actions and his words he actually is like them and he dont care because hes doing what he can to make the best of a bad situation the only reason why i know is cause i meet metallica nad actually asked james him self because this is the song that made me the die hard fan i am today so if your totally oblivious to the actually concept dont read the lyrics you dumb fucks understand the lyrics to understand the meaning its plain and simple and clear as day so their i only seen a few people who where close and had a remote idea of what the song means and if you dont like what i said kiss my ass you lame fukking poser wannabes\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nI think this song is sung from the perspective of a bad guy's consience. about how the consience suffers from the evil deeds and in turn makes the bas guy suffer and about whenever you do something bad your consience takes the blow\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nGuys..... Think about it. The Song is clearly about DRUGS. Not a bad guy's self concious... Think of it as if the drugs are talking to the person. \"I'm your dreams make you real\" ... every line said is being said by the DRUGS to the person..... And that is why the song is called \"Sad But True\" because it's about drugs, and its sad but true.... Think Drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nomg! you guys are idiots it has absolutly nothing to do with drugs or depression the first comenter hit the nail on the head but my interoretation of the idea is different. its about the guilty conscience within all of us though singing about his own pains hes giving a message not to let the guilty conscience to take over or to hide behind it. not drugs.(or depression thats even more ridiculous)\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nsorry interpretation not interoreation\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nYou guys are all retarded it has nothing to do with evil, suicide, or satan at all. its about the voice in your head thats always with you even unto your death. AKA the EGO.\n\r\nIm inside, open your eyes. Im you.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nIts obviously about ones inside thoughts controlling him and making him make bad choices. Meaning, the \"voice\" hides inside him and makes him the all the dirty work.\n\r\nyou\r\nyou're my mask\r\nyou're my cover, my shelter\r\nyou\r\nyou're my mask\r\nyou're the one who's blamed\r\ndo\r\ndo my work\r\ndo my dirty work, scapegoat\r\ndo\r\ndo my deeds\r\nfor you're the one who's shamed\n\r\nthese lines are the meaning of the whole song.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nthis song is obviously talking about the devil telling you that \"I'm your only true friend now\" and that everyone else betraying you (\"they'll betray\") and eventually making you trust him so much that he'll get you to do bad things (\"you, you're my mask, you're my cover, my shelter, you, you're my mask\") and then you get in trouble (\"you're the one who's shamed\")\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nGreat Song...........Great Lyrics..........very powerful music overall\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nIts probably wrong but to me its about a guys dark side talking to him and controlling him and he cant do anything about it hence 'sad but true' still a fuckin killer song! metallica for life! \\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\n\n\r\nR4phael, I like what you said, agree with that.\n\n\n", "comment_99": "\nR4phael, that fight club comment was pretty cool, it DOES a similar theme\n\n\n", "comment_100": "\ni personally see this song as a sort of coping mechanism, \r\nTHEY, THEY'LL BETRAY, IM FOREVER THERE\n\r\ninterpert the mechanism as what you want, drugs, alcohol, a sort of sin, anything...a way out. \n\r\nsaying 'you can always come to me when everything else goes bad. and\r\n'I'M YOU' the coping mechanism eats you away 'IM INSIDE, OPEN YOUR EYES' it has wholly consumed your life\n\r\nand in the end of the song, \r\nHATE, IM YOUR HATE, IM YOUR HATE WHEN YOU WANT LOVE\r\nthe cope has become the addiction, all one thinks about, but it turns into a lifestyle, you start to hate yourself for it. \n\r\nmaybe wrong, maybe right. i love metallica though\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nI think this song is about control and manipulation.\r\nAnother person is controling everything you think and do. Its hard to describe but if you have ever been controled its like you are the one thats wrong all the time, not the person thats controlling.\r\nYou'd never ever THINK you are being controled or manipulated cuz its WELL HIDDEN.\n\r\nJust what i feel about it =)\n\n\n", "comment_102": "\nThis song is about one's alter ego or second personality, someone who is good in general yet they have a bad side which they don't show... that's why at the end of the song the lyrics goes \r\n\"I'm you\", the part of you who is tempted to steal, who feels pain, open your eyes and you can see me... anyway that's how i see it. \t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nTo me this is about the evil \"personality\" that lives inside everybody and it's mocking the good \"personality\" saying that it has control and it's everywhere even in your dreams.\r\nAnd he can't do anything about it but take the blame for the things the evil does.\r\nThat's just sad but true.\n\n\n", "comment_104": "\nsongs fuckin awsome, love headbangin to this after smokin a niice blunt\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nThis song is about the fans of metallica literally. James is reflecting his guilty conscious of the lyrics he has written (which are all towards a negative aspect, which in turn have pulled the negative out of his fans)  James is simply being the narrator for the story of countless fans that live, breath, and die Metallica. \n\r\nJames is the following: I'm your dream, eyes, pain, hate, your only true friend now (living the experience of Metallica)\r\nThe fans are: His mask, his cover, his shelter, his work, his scapegoat, his deeds, his dirty work, the ones that are blamed/ shamed (because of his work of rebellious and dangerous lyrics).  \n\r\nHey, I'm your life, I'm the one who took you here\r\nHey, I'm your life, And I no longer care\r\nJames telling his fans, he no longer wants the burden of being a god to his masses of fans. \n\r\nI'm inside open your eyes...I'm you...sad but true. \r\nMocking his devoted fans by saying that his existence as a songwriter has created a world that is based around his negativity and he's through being that person...it's sad but true. \n\n\n\n", "comment_106": "\nI THINK IT'S ABOUT A PRE-HISTORIC FELINE NAMED SABRETOOTH...THAT WAS SUPPOSE TO BE THE TITLE BUT JAMES WAS SO HAMMERED WHEN THEY DID THE TAKE IN THE STUDIO, THAT THEY NAMED IT SAD BUT TRUE, BEING THAT IT WAS SAD BUT TRUE THAT JAMES WAS TOO HAMMERED TO REMEMBER THE LYRICS ABOUT SABRETOOTH. \"MIND ASTRAY\"=STRAY CATS..\"SCAPEGOATS\"=SABRETOOTHS' USED TO EAT SCAPEGOATS BACK IN THE BRONZE AGE...EVERYBODY KNOWS THAT...\\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI used to think that this was about soulmates\r\none being able to feel all that the other feels, even what the other\r\ndoesnt think that they feel, when they are numb (I'm You) being what sums it up...\r\nbut now I think that it is about blame, who will take the blame and I think it is saying\r\nyou will take the blame, we're in it together but you'll take the blame...I liked it better when I thought \r\nit was about soulmates but I'm Niave so oh well...its still a DAMNED good song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nAll of you that think its about \"your evil side\" are not quit right.evil is another word for our true animal-like,look down upon behaviors that arent accepted by the brainwashed mainstream culture.\r\nits about your inner true self talking to your outer self and how now matter what you do, you cant change the way you truly feel no matter how badly you dont want to feel that way. sad but true. nothing you can ever do about it. listen to this song when your high, you will get a deep sense for this song. weed reveals yourself to you. Bob Marley can clairfy that. In other words, its pretty much your true self making fun of you. \t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nsounds like it's the devil...sung from his perspective\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nMy interpretation is that it's about your dark side mostly. To be more exact, how you sometimes have to switch to evil (without twin personalities, just lowering your moral standards) self to get the job done not because you choose to, but because you have no choice sometimes.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nI don't know but this song reminds me of Adam and Eve.. or is it just me?. Hm.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nYou know, I can't really say what exactly this song is about, but I'll tell you I hated it for a while. It was okay (I had only listened to it about 3 times) and my friend Ryan, who thinks like every good band sucks (i.e. Disturbed, Avenged 7 fold, Gallows, Guns N' Roses, etc.), liked it. After a while it grew on me, and now it's my favorite song on this album. Go figure.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nIt IS about alcohol, and it IS about your darkside, and it IS about the devil... I fail to see why it can't be all those things at the same time.\n\r\nIt's like there is this great pit of fear inside everyone of us, and it can grow as we give in to certain things, like addiction, paranoia or fanatism. It can grow to the point where you see yourself alone in the world, with only your own fear as your friend. It is an evil thing, a REAL thing, it is within us, and it is probably the human trait that gave origin to the idea of The Devil.\n\r\nAlso, anyone who's experienced a paranoia episode (when it REALLY seems like everyone around you is trying to fool you) can relate to the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nYep.  This song must be about James' alcohol addiction, written from the liquor's point of view.  I remember on a \"Black Album\" documentary the song being played while showing clip of band members guzzling booze like it's water.\n\r\n\"Hey\r\nI'm your life\r\nI'm the one who takes you there\r\nHey\r\nI'm your life\r\nI'm the one who cares\"\r\n-Once you're addicted, it consumes your agenda.\n\r\n\"They\r\nThey betray\r\nI'm your only true friend now\r\nThey\r\nThey'll betray\r\nI'm forever there\r\n-Alcoholism tears families, friends and workers apart.\n\r\n\"I'm your dream, make you real\r\nI'm your eyes when you must steal\r\nI'm your pain when you can't feel\r\nSad but true\n\r\nI'm your dream, mind astray\r\nI'm your eyes while you're away\r\nI'm your pain while you repay\r\nYou know it's sad but true\n\r\nSad but true\"\n\r\n-When you're drunk, you can be visually impaired, numb from any emotional stress and just plain caught off from the life you are normally able to focus on when you're sober.  The next day, you feel shit when you realize you did bad things, some which you can't remember or believe that you did.\n\r\n\"You\r\nYou're my mask\r\nYou're my cover, my shelter\r\nYou\r\nYou're my mask\r\nYou're the one who's blamed\r\nDo\r\nDo my work\r\nDo my dirty work, scapegoat\r\nDo\r\nDo my deeds\r\nFor you're the one who's shamed\"\r\n-Alcoholics aren't in control of their liquor.  The liquor is in control of them.  When they're sober, the often end up regretting their actions while taken to their drunken dimensions despite that they continue their habits.\n\r\n\"Hate\r\nI'm your hate\r\nI'm your hate when you want love\"\r\n-As mentioned, alcoholics can lose their families and their other beloved.\n\r\n\"Pay\r\nPay the price\r\nPay, for nothing's fair\"\r\n-This refers to such consequences that result from alcoholism (i.e. hangovers, depression)\n\r\n\"Hey\r\nI'm your life\r\nI'm the one who took you here\r\nHey\r\nI'm your life\r\nAnd I no longer care\"\r\n-The open line is switched to past tense possibly to depict the alcoholic eventually dying.\n\r\n\"I'm your truth, telling lies\"\r\n-This could refer either to the alcoholic's frequent memory loss.\n\r\n\"I'm your reasoned alibis\"\r\n-The more drunk you are, the further you are away from yourself and the world around you.\n\r\nI'm inside open your eyes\r\n-The alcoholic is slowly realizing that his addiction is destroying his life.\n\r\nI'm you\r\n-No interpretation needed here.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nHi guys, IÃ\u0082Â´m going to say something that most of you will find stupid and childish.\n\r\nHave you ever read or watched Harry Potter and the Chamber of Secrets? ThereÃ\u0082Â´s a big fucking SNAKE thatÃ\u0082Â´s petrifying people each time they look into THE EYE. The fact is that the master of these creature is using his powers to speak to HarryÃ\u0082Â´s mind in a short of way that reminds of how voices attack schizophrenic people minds. This voice always leads Harry to where the snake had previously attacked, so people always thinks Harry is the evil guy and all distrust him. So he eventually became the scapegoat. ItÃ\u0082Â´s also remarkable how HarryÃ\u0082Â´s life seems to be a lot like the one the master of the snake had before turning into the evil kind of fellow heÃ\u0082Â´s now. \n\r\nBy the way sure this has nothing to do with the song but some elements are there; schizophrenia, scapegoating, one manÃ\u0082Â´s bad side, and a very big fucking snake!!!\n\r\nSAD BUT TRUE!!!\n\r\nXDDDDD\n\n\n\n", "comment_116": "\nI don't know if anyone else said this (didn't care to look), but it is defiantly about alcohol. Think about it, when people bother an alcoholic about his/her drinking, they're going to get annoyed or angry and get a drink (\"They, they betray, I'm your only true friend now, they, they'll betray, I'm forever there\"), and it's obviously the alcohol singing in the song. And after drinking for a long, long time, you get liver failure (or whatever doctors call it) (\"Hey, I'm your life, I'm the one who took you here, hey, I'm your life and I no longer care\"). \n\n\n", "comment_117": "\nHow about the \"evil\" is James and the \"you\" is the listener? Because the lyrics are very loose, it fits for me. More sonds can be interpreted like this, for example Master of Puppets. It fits nicely my corrupt idea of James being the \"master of puppets\" that controls the crowd ang \"gets through you\" - you sing his songs in your mind, so he \"becomes you\"... :)\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nWhen I first heard this song I was surprised. I honestly did not get that he had multiple personalities until the very end when he says \"I'm YOU!\". I've seen movies that have a surprise ending, and read books that have a surprise ending, but this is the first song with a surprise ending I have ever heard.\n\n\n", "comment_119": "\nI don't understand why people think this song has to do with Schizophrenia or drug addictions. It is possible that drug use could be involved, but that would be due to his inner demons (which we all have) or that inner voice that gives us that \"fuck you\" attitude, telling us what we WANT to hear, do, or say. Not what we NEED to be informed. Whether that attitude is only a thought or an action, it is still regarding to that little bit of yourself telling you (the bad option) is okay.\r\nI is also written in a fairly open idea that can be applied to peoples' related experiences. So this doesn't have to get to technical.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nI listened to this long ago, but it was clear to me that it's about demon taking over. It can be with a little help of some drug though(for exampe).\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nAll of you are wrong...good grief its about the lead singers addiction to alcohol, the song's message is how the bottle controls his every action and manipulates his life, just like a mask. The blaming, the hate, cover and scape goat are words he uses that any alcoholic would say is the best way to describe an alcohol addiction. A long time ago in school I used this song in a music class that had a song meaning academic, and I chose this song because it has the perfect interface for being misunderstood. \n\r\nAs with most of Metallica's songs, they have a deep story behind what is actually being sung. This is why they are, and still my favorite metal band. \t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nThis song is straightforward for meaning, like Creeping Death. Honestly, I'm not here to comment on what the song's about. We all know. I'm here to comment on HOW FUCKING HEAVY THE GUITARS ARE. \"A Year and a Half in the Life of Metallica\" documentary has a clip of James doing the chords, it sounds fucking awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nUgh.  This song is obviously about a parasitic worm controlling your nervous system.  Duh.   Or, in the worst case, about an eye-seeing dog gone astray. \t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nThis song seems to me to be about someone who has a sober normal side and a twisted twacked out side. Sounds to me like its the addiction changing the person and the person they become when they are tweaked is telling them they are one and the same, yet he makes it clear that he is what is in the hosts best interest. Everybody becomes twisted and scandalous when they are on uppers. thats what i get out of the song. \t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nOne of the best. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nIn my opinion this song is about our animal side. Our ego.\n\r\nCheck it out.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nThe soul contols the corpse and corpse is just a puppet. The corpse is a mask, a shelpter.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nDefinitely this song is about DEVIL INSIDE!\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nThis song is related to the soul and body ..\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nEsta canciÃ³n tiene que ver con el alma y el cuerpo ..\nDieser Song ist fÃ¼r die Seele und KÃ¶rper im Zusammenhang ..\n\n\n\nÙ\u0088Ù\u008aØ±ØªØ¨Ø· Ù\u0087Ø°Ø§ Ø§Ù\u0084Ø£ØºÙ\u0086Ù\u008aØ© Ø¥Ù\u0084Ù\u0089 Ø±Ù\u0088Ø­ Ù\u0088Ø¬Ø³Ø¯ ..\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\ndudes its about a guy and his nasty gal,  feeling all shes about.  or vise versa.  but all that think it is about addiction love and hate is as well.  the adam and eve guy cuddos your on it.  the drug and alcohaul people assure me that there are no shortages of sinical addicts.  its someone blaming and hurting others for being born. all have the evil inside its how we handle it.  always a conflict of good and evil.   doing good does not always add up to recieving good when your dealing with someone who cant hold there evil.  \n\nthe gosple according to geekmetal\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nTo me it's about original sin and our imperfect nature.\n\nIt's up to us to decide if it's an anthem of evil or a stark warning. \n\nThe chorus repeats \"sad but true.\"  Is this a sarcastic jab, or a lament ? \nI think more the latter.\n\nTo me it doesn't celebrate a condition of hopelessness. It just announces the unfortunate facts. We live in a fractured, imperfect, often conflicted existence.\n\nIn order to understand evil we must face it and acknowledge it exists. That's the first step in beating it. this song does that.\n\nWhen I hear this song I don't feel repulsed by evil. I feel the righteous power of the Redeemer who died taking on all these sad truths and conquering them to lift the death of original sin..\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nI think that this song is related on being alone in this world, without any friends for example, and that is sad but true.\n\nI'm your truth, telling lies\nI'm your reasoned alibis\nI'm inside open your eyes\nI'm you\n\nSad but true\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nOk so far reading the comments on here and a lot of people are kind of touching on the real meaning ere but barely. I have watched a lot of videos and read articles and whatnot about Metallica considering the Black Album and this song is not about addiction, I mean I agree to a degree that its about addiction but not in the way everyone is thinking. This song is about religion and how it poisons your mind and beliefs to take over your opinions and ideologies of your life. The line 'I'm inside open your eyes, I'm you' validates that. James Hetfield grew up in a very religious family and his mother died because of a lack of medical treatment due to religion so a lot of that trauma is placed into their songs and lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nCould be about schizophrenia if you think about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nIm in recovery for poly-drug addiction as well as human trafficking. One day I'll break this down with a verse by verse interpretation. However, this, this is exactly how I was made to feel.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\n\"I am you, you are me, we are the same, we are evil.\" That's what James Hetfield said about the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nTo me the lyrics are about our animal side, the animal seeks constant satisfaction, it is susceptible to all kind of addictions and sex is it's main driving force.\n\nImagine if you haven't felt hunger, attraction, cold, heat, pain, pleasure... imagine if you haven't felt anything... there would be no culture, no society...\n\nHaven't you thought about our obsession with sex, how funny it actually is, and how sad it is? We have evolved to act upon our basic instincts such as mating, Yet it tortures us in our modern society, the beast is always hungry, and there are no boundaries as far as you finances go. Our human part is the one that repays, the lament, the shame, the depression.\n\nYet we need the beast to go on... sad but true.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nThis song is about your ego - your mind which judges yourself and others, complains about them, cares what other people think, wants to please them to get admiration in return, wants to be above others, makes you feel like a victim if needed, creates \"reasoned alibies\" for what you do on its behalf. Ego leads you through your life until you discover it exists, the way it operates, and find out that your ego is not you. I've discovered it after reading Eckhart Tolle's \"A New Earth\", which describes mechanics of ego besides other spiritual stuff. At the same time, Metallica's song Sad but True became understandable like never before.\n\nEgo survives by pretending to be you (â\u0080\u009cIâ\u0080\u0099m your lifeâ\u0080\u009d) and keeping you out of being aware of it. Furthermore, stories in your mind about others betraying you and other judgments empower ego through feeling of separateness from others. Ego pretends to be \"the one who cares\", but it actually only cares about its own survival. You are only its \"mask, cover, shelter\". Ego also feeds itself on the belief that without it and separation between \"me\" and others you are not real, so it \"makes you real\". If you go through life with ego being your eyes, you'll live in \"your dream\" created by ego and not really living. \n\nYour ego pushes you to do whatever it thinks it will make it grow more, even bad things, just to enhance itself and separateness from others. You are just its \"scapegoat\" who does his \"dirty work\". Then it judges your doings through its eyes (when you must steal)\". \n\nYour ego seeks admiration and love from others. It can never get those from others fully, so it makes you feeling hate because of that - \"hate when you want love\" - and you \"pay the price\" by feeling negative emotions, pain. \n\nWhen your ego has grown too much and became too arrogant, it stops caring (\"I no longer care\"), even about being discovered and destroyed. It can even afford to tease you to \"come inside and open your eyes\". It doesn't care at all, so it's free to impose great suffering on you. Under a great suffering, you start questioning yourself, \"looing inside and opening your eyes\" and finally see the ego inside you. It says \"I'm you\", but it can't trick you anymore. The mere fact that there's a separation in that sentence between I and you signals that you are aware that the ego exists as something other than you. Otherwise, the end would have been just \"I am.\" So the song ends with your ego being discovered in light of awareness / consciousness. Ego can't live in presence of consciousness, so it dissolves and you are finally becoming free. Or, you can still live your \"dream\" through your ego's eyes, always judging and complaining about the world and people, just like the man in My Friend of Misery. And spend the whole life without knowing the truth. Just like the man in the Unforgiven song. But even he at the end takes a look back and realizes the truth.\n\nIt's incredible how I previously had thought this song is so depressive, but now it appears so positive, since consciousness wins. Sooner or later.\n\nAlso, it looks like those who understand this song as about being about addiction are right. Ego survives by you being addicted to your thoughts. Once the addiction is gone by being aware / conscious of your thoughts, you're free.\n\nSorry about bad text formatting in the previous version of the same comment.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nWhy does song facts insist that this song is about \"blind faith in religion\"?\n\nNormally that site, mentions some interview where the band explains the song; but this song was really never explained.\n\nSo I have no idea what this song is about. I just now realized they were saying \"Sad but True\", because over the years it just sounded like \"Self-Control\" or like some foreign language.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nI do believe this is about addiction but I think Metallica is pointing directly to what is causing the addiction or self medication. Sad is an acronym for Social Anxiety Disorder. When you suffer from this condition almost everything that is in this song is how you feel. Just a thought. Listen to it again with that in mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nI have read that this is about addiction, but to me it screams of my feelings about living with Dissociative Identity Disorder.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nI don't knou about you guys, but I think this song, as well as The Unforgiven on the same album, fits perfectly with Batman.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nIt's just your skeleton they are referring to! All these silly deep interpatations! LOL It's just your bones dummy!\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nI think it's about someone with skitzophrenia (I know that isn't spelled right) like having a voice inside of your head. Like they're the persons only true friend, and they're everything to this person.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nOMFG\n\r\nI never thought some people were enough moron to think about such idoit crap...\r\nThis fucking song is about alcoolism like 2 other guys have spotted before...\r\n\"I\" stands for alcool in this song.\r\nExemple:\r\nI'm your life\r\nI'm the one who takes you there\r\nhey\r\nI'm your life\r\nI'm the one who cares\r\nthey\r\nthey betray\r\nI'm your only true friend now\r\nthey\r\nthey'll betray\r\nI'm forever there\n\r\nstands for how james used to see alcool and how it would make him feel better (angain \"I\" stands for the alcool so it would like Mr. vodka or whatever speaking...)\n\r\nAnd in:\r\nhate\r\nI'm your hate\r\nI'm your hate when you want love\r\npay\r\npay the price\r\npay, for nothing's fair\n\r\nhey\r\nI'm your life\r\nI'm the one who took you here\r\nhey\r\nI'm your life\r\nand I no longer care\n\r\nwould stand for what alcool has done to him in the end...\n\r\nNow anyone who still can't understand it and think this song about \"satan\"(LOLLLLLLL) well go cry in a dark corner.\n\r\nP.S I didn't invent that crap, I heard it from james on tv once... If you don't believe james well ur losers(HE WROTE THE FUCKING SONG GODAMN)\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nthis song is the evil side of your consience taking over your mind. By the way does anyone realize the intro sounds exactly like Kid Rock's \"American Badass\" did he steal it from this song or something?\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nActually, it is about an eye-seeing dog.  Just think about it.  Think of what a dog means to someone blind: \"I'm your life\"- true.  \"I'm the one who cares\"- true. \"I'm your only true friend now\"- of course, a dog will never betray! \"I'm your eyes when you must steal\"- duh, too.  The dog helps with the theft. \"You're the one who is blamed\"- obviously, nobody would blame an animal, but rather a human. \t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nI think it is about drugs...\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI think this is a song about pretty flowers\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nI think that this song is about the devil and how he really controls us.  althoght we have a choice to ignore him, we normally don't. i get this main idea from the verse \"you're my mask \r\nyou're my cover, my shelter \r\nyou \r\nyou're my mask \r\nyou're the one who's blamed \r\ndo \r\ndo my work \r\ndo my dirty work, scapegoat \r\ndo \r\ndo my deeds \r\nfor you're the one who's shamed\"\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nCOMON GUYS! WHAT THE HELL ARE YOU TALKING ABOUT?? EVERYONE HAS AN EVIL INSIDE OF US BUT THIS IS NOT WHAT THE SONG IS ABOUT.\r\nI THINK THAT IT'S ABOUT THE PSYCHOTIC MIND OF A KILLER!!!\t\t\t\t\n\t\t\t\t\n\n"}