{"comment_0": "\nBringing Back the Sunshine is the upcoming ninth studio album by American country music singer Blake Shelton. The album is scheduled to be released on September 30, 2014, by Warner Bros. Nashville.[1][2] The album will be produced by Shelton's longtime producer Scott Hendricks.[3] \"Neon Light,\" the album's lead-off single, was released on August 18, 2014.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nWhen it came time to film a music video, though, Shelton â\u0080\u0094 who's been married to Miranda Lambert since May 2011 â\u0080\u0094 chose to let an actor play the lead role. Smart move. It's a fairly steamy clip, after all, filled with PG-13 love scenes and slow-motion shots of a woman bathing in a tub of red wine. Shelton lurks in the background, sipping his drink and acting as a sort of non-participating narrator for the whole affair. Also, to drive home the fact that he's a loyal family man, he filmed the entire clip in the Ladysmith, the boutique bed and breakfast that Lambert opened last fall in Tishomingo, Oklahoma.\n\nWith a slightly different soundtrack, \"Sangria\" could double as a promo piece for the Ladysmith. The place looks great, its walls covered in reclaimed barn wood and Christmas lights. Over in the Losa Lounge, where the song's characters share their first drinks, a vintage jukebox sits in the corner. Later, when they hit the bedroom, they're surrounded by smoked glass and a headboard that might be as old as the building itself, which was built in the early 1900s. The Ladysmith may not be the cheapest lodging in the superstar couple's adopted hometown â\u0080\u0094 if you want a room with its own bathroom, you'll be paying at least $250 a night â\u0080\u0094 but \"Sangria\" makes it seem like a worthy destinationâ\u0080¦assuming you don't mind some pinot noir stains in your bathtub.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song makes me feel sexy and heightened and it's cab btw mr. Shelton. Meow...\t\t\t\t\n\t\t\t\t\n\n"}