{"comment_0": "\nThe song is pretty self explanatory. He thought he would be with this girl forever but things didn't go as planned. Even though he loves her, he knows that staying with her will only hurt her more. He has to leave her in order to find what it is he's looking for. I think this song captures that feeling of not wanting to leave a person, but knowing that you have to, and the emotions that come with not knowing how to do it.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nwhen listening to this song, you just feel it. . . if you've gone through it, you'll know what he's talking about. . .the relationship isn't what they expected, he cares for her and he doesn't want to hurt her, but even though it hurts, he has to end it for his sake, and maybe for hers. . .he doesn't wanna be with her anymore.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ngood song. I am listening to it now.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis songs brings back a lot for me and my boyfriend\r\ncause we were broken up for a couple days and i felt like i always fixed stuff and he didn't seem like he wanted to. like he'd call but then hang up .. but call back and come over but then suddenly have to leave. but then finally he called me to come out to the car but he didnt say anything.. but this song was playing and he turned it up and i started balllling. i figured he wanted me to hear this. and he said he loved me but it just didnt work out. and we said .. goodbye.\r\neven though he asked me back out and said he wanted to fix stuff it still brings back that feeling of saying goodbye and being without him\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nim going through what he is feeling right now... my feelings for my girlfriend have changed and i just dont know how to tell her\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nive gone through this and sometimes its just not fair.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI'm not really into r&b, but i really like this song. It's a good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ndeff. like when boy and girl break up. he loves her too much he doesnt want to hurt her anymore. becuase he doesnt no whats right. and whats wrong. he doesnt want to kkeep hurting her like he has been. i love this song so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nIt talks about how he doesn't want to lead her on and he needs to break up with her because he doesn't feel the same way towards her anymore and he needs to tell her before he hurts her too bad. I mean he's gonna hurt her anyways by breaking up with her but this way it won't be like he led her on or anything. This is a great song. I think anyone who's deciding to break up with someone should listen to this song because it'll teach them a lot.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nhell yah.. im a lead singer for a pop punk band but i love r&b haha this song is off the chain.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nOkay, let me just say this...I am the BIGGEST HeadBanger you will ever meet, but I do have to admitt that I love this song!\r\nI just think he is so cute, and he has a hell of a voice ! And I also think alot of people can relate this song, on some level.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI've been through this feeling several times....\n\r\nand trust me it sucks...but i mean if you have been through this feeling when you hear the song it just all comes back to you...and you just feel it...and if at one time you really cared about the person this song will def remind you of them\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI think this song is pretty stupid.  It's a guy feeding this chick some emotional bullshit when he's too pussy to just come out and say he's tired of her.  It pretends to be a love song too which sickens me.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nfor one... if the song sucks... why not move on to something else without leaving a retarded ass comment. \n\r\nnow... I'm listening to this song right now... and I've been listening to it before it even became a single. Becfore I thought I listened to it because I thought that was how my boyfriend felt... but more and more recently... I've been feeling this way. I've been with my boyfriend for a year in a half... both military he's in Iraq and I'm going there... but we just don't feel right anymore. he wants to stay a \"lifetime\" with me... and I find myself trying to push him away... because I don't feel like I used to. it's pretty bad... because I don't wanna leave and hurt him, but I know it has to be done.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis song is about a guy that doesn't exactly want to be with his girlfriend anymore, so he comes out and tells her. Although, he knows that it will upset her and he may be a little upset too, because there isn't a right time to say good-bye....and I completely agree with that quote.\n\r\nChris Brown is MMMMMM-azing\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nits sad bcuz i broke up with my boyfriend thru this song as my bestmale frend broke up with his girlfriend...its kinda strange bcuz i was rly happy then i listen to the song n i can see my ex's face n it just bothers me...i mean i love the song and big ups for Chris for singing it an he sounded great but yeh\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis song is just one of those \"I'll-never-get-sick-or-tired-of-this\".. It's a sad song .. pretty self explanatory like someone said. It's a simple plot when you still LOVE the person, just not IN love with them.. you still care for them immensely but it's just not working out. You don't to hurt them of course but you know it's the right thing to do because one person has changed and grown in a different direction. \n\r\nThat's why I think it's so hard to stay in love, I look at people who are like 70 and still deeply in \"love\" and think how the hell do they do it. I guess it's different with age but it's still a scary thought.. committing your WHOLE life to just one person.. for the rest of your life, everyday you wake up and it's gonna be them next to you. Scary!\n\r\nI guess I'm drifting off. But it's sad to \"Say Goodbye\" as the song says but it has to be done because it's so hard to find someone that's constantly growing with you & then you turn back and realise you're both not the same people you were when you fell in love.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\neverytime i listen to this song, it makes me want to cry. \n\r\nthis is such a sad song but we will all go through this in our lifetime. whether it may be from chris's point of view or from the viewpoint of the  person chris is singing this song to. \n\r\nhe never thought him and his girlfriend would break up or fall out of love but things have changed. he doesn't feel the same way about her anymore. even though he still cares for her and doesn't want to hurt her, he knows that he has to say goodbye because he's not in love with her anymore. he also doesn't want to hurt her by leading her on and staying with her while he falls in love with someone else.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ni know exactly what chris brown in saying in this song, he loves the girl but he doesnt and he thought he should break it off with her cause he doesnt want to lie to her any more because he knows how much it will hurt her ,i actually just went through this and it is the worst feeling in the world!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nthis song has the exact same meaning as Goodbye by Air Supply\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni still cry every time i hear this song...reminds me of me and my friend jordan...great song though\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nlove this song, but it hurts so much 2 listen to. especially now adays cos wat the song is describing is wat happend 2 me. but for some reason, singin the song gives me strength and helps me to understand everything ahaha dno if tht makes much sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nthis song reminds me of r. kelly\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nthis song was playing when my ex and i were breaking up..it was kinda funny when i think back(even though it was recent) and he was telling me that he still loves me, but in a different way and that he didnt want to hurt me anymore than he already was cuz i had know for a week or two that we had changed and that he had moved on w/o me..so neway, he told me that he finally worked up the courage to tell me that we were over..it still hurts but not as bad as going out with a guy that doesnt feel the way he did at the beginning\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song is to finally say goodbye to someone you loved but you realized it's never gonna work. You're never gonna be who they want you to be, and they're never gonna themselves with you. All you can do is go and say goodbye.\t\t\t\t\n\t\t\t\t\n\n"}