{"comment_0": "\nthis song is hard for me to read but i feel like he is saying he is broken and hiding who he is but when he is with people who he feels comfortable with he lets down his guard and they have a good time:\"While you're doing fine, there's some people and I Who have a really tough time getting through this life\r\nSo excuse us while we sing to the sky\"\r\nthis makes me think of being at a concert where you let your walls down and you just live your life to the fullest and feel one with all the people.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe song is to God. He's saying there's no point in trying to hide anything from God, because God is all-knowing, and knows his heart from the inside-out- hence there is a screen on his chest. In the chorus, he talks about trying to be cool and make himself look like he has everything together- efforts which he says in the previous verses are futile. In the second verse, he basically says that he's messed up, but so is everyone else, and it's okay that we're all messed up because God loves us regardless- the reason God sent Jesus to Earth was because he knows every single one of us is a sinner. This is also the essence of the bridge- he's saying we're broken people, almost in a celebratory manner, because again, the fact that we're all broken just means that we each need God's grace.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think that this song talks about him trying to hide himself from God.  He says, \"I do not know why I would go\nIn front of you and hide my soul\n'Cause you're the only one who knows it,\nYeah you're the only one who knows it\" Also, he repeats \"we're broken people\" at the end.  This, with the fact that they have Christian background, makes me believe this song about him hiding himself from God, just as Adam did in the garden.  Also, \"having a hard time getting through this life, so excuse us while we sing to the sky\" is something that Christians do to praise God.  They sing and praise God.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think this song is about having depression and trying to hide the bad thoughts from the person/people you care about the most. \"And I will hide behind my pride/ Don't know why I think I can lie\" Is saying how when we are are troubled or having one of those days where the depression is stronger we'll put on a face and \"gode behind my pride\" when we know we won't be able to lie forever. I think it could also tie into self harm, as we can try to lie about it but it always comes out.\r\nAnd when he he says \"painting the mental picture that's in my brain\" It describes the way a depressed person might feel. I don't think this is a religious song like many are saying, I feel like a lot of religious people try to take songs about depression and relate then to their faith, which is fine, everyone is entitled to their own opinions. This is just what the song means to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nHe thinks he's a telly tubby \"there's a screen on my chest\"\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI can't tell you what Tyler meant when he wrote this song but I can tell you what it means to me. \n\nScreen is a song sung to myself. I'm the only person who I trust to \"know my soul.\" I have a hard time processing my emotions so my long-time method of handling them has been lying to myself about how I feel. I religiously live life with a screen on my chest because I've thought it makes it easier. You fool yourself into believing that you're okay and that things that affect you, don't. \n\n\"I'm standing in front of you\nI'm standing in front of you\nI'm trying to be so cool\nEverything together trying to be so cool.\"\n\nI found strength in this false sense that I had my emotions under control. But eventually those delusions were shattered and the screen became transparent. There's a voice in my head which now counters my lies, saying \"Why are you trying to lie to yourself? I'm not fooled.\" I feel like that voice is sarcastically mocking me when Tyler says:\n\n\"While you're doing fine\nThere's some people and I\nWho have a really tough time getting through this life\nSo excuse us while we sing to the sky.\"\n\nEventually, I listened to that voice beyond the screen. Because it feels like the first time in forever since I've actually been honest with myself and it helps me to trust myself more (because I don't). The first step to achieving emotional stability (for me) is accepting that:\n\n\"We're broken\nWe're broken\nWe're broken\nWe're broken people.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think that he's saying he's broken hearted but trying to play it off. I came up with this from my life... \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think he's taking about being infront of someone he loves and hiding his feelings from that person. And when he says \"we're broken people\" it basically means we're messed up and hard to love because we were broken hearted. But that's just what I get from it. Cause hi im a broken person\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThe song is about a man's crush on a beautiful girl whom he's trying to play it cool with and he's incredible friends with the girl and he and her lay down in the grass and sing to the sky and they connect in an unimaginable way. They are both dead inside and they find peace and comfort in eachother's well being and enjoys the capabilities of his female companion.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI feel like this song means different things to different people. For me, this song is about trying to hide your depression/suicidal thoughts from the person you love most. Of course, that person knows you better than that, and can tell when you're not alright. (\"Don't know why I think I can lie\") This song, like many other TÃ\u0098P songs, is about putting on a mask and hiding the fact that you are *not* okay. But, that's just my interpretation, I know everyone has their own message that goes with this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI think \"I do not know why I would go\r\nIn front of you and hide my soul\r\n'Cause you're the only one who knows it\" means that he is talking to someone really close to him and is telling them lies, saying he's fine, but this person knows about his struggles and there's no point in him trying to hide it, and he knows this himself. \"And I will hide behind my pride\r\nDon't know why I think I can lie\r\n'Cause there's a screen on my chest\" means that he's trying to hide it all in the fear that if anyone found out, his reputation or pride will be ruined and he's trying to hold on to that, but this person knows what's going on as he said earlier on, so he doesn't understand why he keeps on lying and he's not good at lying because he's clearly not okay, hence \"there's a screen on my chest\". \"Everything together trying to be so cool\" is him acting like everything is good and he's okay in front of this person, maybe someone he loves or admires. \"I can't see past my own nose\" means that it's so obvious that even he can see how fake his lies seem. Quickly changing loco to \"locomotive\" shows the common sign of people summoning the courage to speak about problems but quickly changing the topic, thinking that people will judge them, so they keep these problems to themselves. From \"my motives are insane\" I believe he has finally got his point across that he needs help and is being open about everything. He's addressing everything that's an issue: his \"flow\" (way of getting by), him getting \"no radio play\" (trying to fit in by being himself), and finally saying that he finds it hard getting through life. By \"excuse us while we sing to the sky\" he could mean that he turns to God for help with his struggles, and finds that being open is the best option. Then he starts saying \"we're broken people\", speaking for everyone who's \"broken\". As he carries on, more voices join and it means that people are starting to come to light and express their problems with other people who go through the same struggles and these people unite and feel a little less lonely together.\n\r\nI didn't mean for this comment to be so long, but if you've read this far, thank you and I hope you found it interesting or amusing in some way :)\t\t\t\t\n\t\t\t\t\n\n"}