{"comment_0": "\nSelene by the group Imagine Dragons could be about a girl who striving to be on top of the world and is lonely and heartbroken.\n\nIf you dig deeper into the time of Cleopatra Queen of the Nile, her daughter Cleopatra Selene and her fraternal twin brother Alexander Helios.  Though the only living survivor of her family I believe that the song could parallel her \"eulogy\".\nThe following epigram by Greek Epigrammatist Crinagoras of Mytilene is considered to be Cleopatra Selene's eulogy.\n\n    The moon herself grew dark, rising at sunset,\n    Covering her suffering in the night,\n    Because she saw her beautiful namesake, Selene,\n    Breathless, descending to Hades,\n    With her she had had the beauty of her light in common,\n    And mingled her own darkness with her death.  \n\nMore info just click the link en.wikipedia.org/wiki/…\n\nI may over analyze sometimes\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAs one of my favorite songs of the album, I think this is a reflection of love & heartache. & I say reflection because of Selene sat he goddess of the moon.\n\r\nBut I think it's about a girl who's heartbroken & refuses to see the good, or finds it difficult to forgive. It's like you're trying to reason with someone who has a broken heart but they only see what you've done wrong, & it's almost as if it didn't matter who you were or what you did... It would have been an inevitable discovery. \"Typically I was a validation on your sleeve\" as if to say \"all guys are the same\" (the ever-famous line used by pouting women). \"I can see it in your eyes & now they're crowning met he Caesar\" like you rest he bad guy. \n\r\nTo me it's all just an act by the girl. The man has serious feelings for someone who has only ever been hurt in the past & so she refuses to see the good, & she's in love with an idea or maybe even a member of her past that she can't get over. So she dates other guys hoping to move on, \"love is clueless & destiny is wishing\", but in reality she's the barrier for moving on. Instead, she finds fault in every man, & decides that nothing is worth it.\n\r\n\"This is my heart, it's not he line, Selene\" goes both ways. They're both saying they're putting their hearts on the line, but only the one who isn't emotionally damaged is REALLY putting his out, because he's the only one who really has something to lose.\n\r\nThat's just what I think though. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI believe the song to be Octavian talking to Brutus.  One thing that supports this is the line: \"Cleopatra is the only one you loved.\"  Brutus marries Cleopatra.  Then he is torn to pieces because Caesar was a father to Octavian and him and brutus are his only real family he is in touch with.  Then he fought and won in the battle of Phillipi and won afterward Brutus Killed himself. The song goes \"this is not what i expect this is not what i expect and now they're crowning me the caesar.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI agree with Chnpoon \n\nI thought it was about Augustus (Octavian) talking to Mark Antony and might have been upset/angry about his suicide and his betrayal.\n\nWith â\u0080\u009cI was a validation on your sleeveâ\u0080\u009d Octavian and Mark Antony were allied and managed to defeat the liberators who were responsible for the death of Caesar. Antony Possibly attempted to treat Octavian as a subordinate.\n\nand â\u0080\u009cCleopatra is the only you lovedâ\u0080\u009d (Possible angry due to the fact he is married to Octavian Sister but is with Cleopatra, Caesars love interest)\n\nand â\u0080\u009cI can see it in your tears and now theyâ\u0080\u0099re crowning me the Caesarâ\u0080\u009d (Caesar and Antony were allies but after his death, Octavian takes his place with the Senate declaring Antony a traitor)\n\nHowever the Chorus completely goes against this theory.\n\nHowever it could also mean this......\n\nWhat he wanted\n\"To the center of the pain                - Pain\nThrough your tattered window pane  - Romance \nTo the middle of your heart\"             - Want her Love.         \n\nA man who badly wants the girl or attempting to use her pain to get to her. \n\nWhat Happened \n\n\"This is not what I expect, this is not what I expect                       - Unexpected\nI can see it in your tears and now they're crowning me the Caesar\" - Shes Sad\n\nHe has upset her, without realizing possibly become powerful in the process\n\nWhy it happened\n\n\"Resolutions and lovers in the kitchen       - Her Home, she likes someone else\nLove is clueless and destiny is wishing\"     - He is clueless.\n\nHe blames love and Destiny or/and her's firm decision to stick with a different lover? \n\nAnd whats on the line \n\n\"This is my heart, it's on the line\"    - Fear\n\nHe fears that he will not longer feel or fall in love again.\n\nAbout a man who loves a girl who loves someone else, and in his efforts to change her, he has made her cried and ruined his chance/friendship and even possibly becoming powerful and feared. (Caesar) \n\nJust my Interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think it is referencing Alexander The Great's relationship with his father; i.e. his father loved Cleopatra (of Macedonia) to suit him a rightful heir, as Alexander's mother was not of Macedon. \"Validation on your sleeve\" may be referencing that Alexander was a great millitary general at the time his father ruled and was nothing more than that.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think that this is about Dan Reynolds and his wife, Aja. They are in a band called Egyptian together, which could be part of the line \"Cleopatra is the only one you love\". I don't think it is directly about the Greek Myth, because Dan usually tries to right things that are meaningful to him, and I think the whole \"Cleopatra and Caesar\" things are metaphors about his fame and love life.\t\t\t\t\n\t\t\t\t\n\n"}