{"comment_0": "\nI have always thought this song was about going though your day without even thinking about it. Your life just becomes routine and when you do think about it, its terrible and depressing. lines 3/4, \"Taking my only friend I know, / He lives a lie, his name is Hope.\" His life is nothing except the idea that it will be in the future, and he feels like that's a lie now too. The chorus \"I'm never what I like / I'm double-sided.\" He has two sides the side he shows everyone is the one he doesn't think about, the conformist who does what fits in, not what is right. then there is the real him, the person he wants to be. It me a while to decide what \"I kinda like it/ When I make you cry/ 'Cause I'm twisted up, I'm twisted up, inside.\" I believe it means He likes it when he disappoints people because he is doing what he wants, not what they want. And the paradox of his emotions vs. his actions twists him. And the the next verse about the horrors of the night, survival of the day, friends shrink as his fears grow. It goes with the verse after it about relief for the day coming but he knows it will go away at night again. So even though he doesn't like the way he is living his life at least trying to get through the day will distract him from all his scary and depressing thoughts he has at night. Thoughts that make him question his life and his friends. Then after the chorus repeats twice, As far as I can tell, he prays and decides he will \"live on\" and then he is ready to \"stand [his] ground/ Waiting for the night's return.\" He will fight off his fears. \r\nI don't know if it is what Twenty One Pilots had in mind when they wrote it. Its what I got out of it though.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nSo I'm not too sure about anything but,\n\"I'm semi-automatic,\nMy prayers schizophrenic\nBut I'll live on, yeah I'll live on, yeah I'll live on\"\nBasically I think, that he doesn't think what he is doing first. He is so used to what the world tells him to do that he doesn't even give it a second though. \nSchizophrenia means \"split from reality\", it is a mental illness where patience experience social isolation. Although the most well know symptom is hearing voices, sometimes to the point of not knowing the difference between real voices and the voices inside the patience's head.\n\nSo either Tyler is hearing voices during and after his prayers, or that he is isolated from God during his prayers. \nI personally think the second one. The struggle to connect with God is a common theme for TÃ\u0098P songs. However, hearing voices is also mentioned sometimes. I still think that isolation better fits this songs context. \n\nDespite the no-questions-asked conforming to society and the isolation from God experienced, Tyler goes with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nTo me, this song represents what someone with depression/anxiety feels about the night. At least for me, the night can be dangerous. I start thinking in circle and becoming anxious. In the night, there is no one to talk to except for myself, and sometimes I don't really trust myself. \"The horrors of the night melt away under the warm glow of survival of the day.Then we move on, my shadow grows taller along with my fears and my friends shrink smaller as night grows near.\" When the day comes around, our character in the song feels safe, he survived the night, he is going to be safe for this whole day. \r\n\"I'm never what I like\r\nI'm double-sided.\r\nAnd I just can't hide\r\nI kinda like it\r\nWhen I make you cry\"\r\n'Cause I'm twisted up, I'm twisted up, inside.\"\n\r\nWhen the night comes around again, the other side of him takes over and he snaps. He may hurt those around him because he can't control his emotions. He says things that hurt those he loves, but it makes him feel better, because he was able to release that blind fury that builds up from the internal struggles that become hard to fight when the night comes around.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think that this is one of their more overlooked songs-but it's not a meaningless, empty, one only meant to be catchy.\nThe name is what throws people off the most, you would assume it's about self harm like \"Guns for Hands,\" but it's more about personality.\n\"I'm double sided/ and I just can't hide/ I kinda like it\" Is one of the stanzas that repeats constantly, which I think means two personalities- One at night, and one during the day. During the day, you're happy, cheery, etc, but at night, when you are alone in the dark, you begin to worry and overthink and drive yourself crazy.\nAnother thing that points to this is the \" I will be saved/ for one whole day,\", meaning you will be saved from worrying for another day. When the light comes, \" I will rise and stand my ground/ waiting for night's return\" meaning you will stop overthinking.\nI'm the type of person who overthinks and goes a little crazy at night, freaking OUT about everything, making promises to myself or goals, hence the \"My prayer's schizophrenic,\" . I think it means that your judgement or thoughts are so clouded by overthinking that you are praying to, or thinking about, problems that are nonexistent.\nOverall, I think this song is about how night is not a time for partying, like so much social media tries to tell us- it's also a hard time for many people, the ones who overthink and worry.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nRomans 7:15 \n\r\nI do not understand what I do. For what I want to do I do not do, but what I hate I do. \n\r\nThis is exactly what I think the song is trying to say. \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nNow, in the beginning, where it says \"Taking the only friend I know, he lives a lie, his name is hope\", are you sure it's not \"Taking the only friend I know, he leaves a lot, his name is hope\"? That's what I've always thought it was, and it still makes sense so I was just wondering. (:\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni think that he is saying (second verse) that he is perfectly fine in the day but then when he has to resort to solitude at night, that is when his thoughts take over\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nWhen I go over the lyrics, I can clearly see how he associates the 'dark' with depression like in the lines;\n\"I will be saved for one whole day\nUntil the Sun makes the hills it's grave\"\nIt's easy to think that maybe he means that the dark brings with it suicidal thoughts, and he is safe as long as the sun is shining, but when I read the lyrics again and again, I began to wonder whether the song has anything to do with the 'physical' night and day at all.\nMy interpretation of this song is how he is trying to be at peace with himself, because we aren't 'what we like' we're 'double sided', we're just two-faced humans, with the night and day just the different sides of us. \nI was also dwelling on the lines - 'My prayers schizophrenic' because i couldn't make out whether he was actually talking about actual 'prayer' per se, because sometimes lyrics are like codes, you have to decipher them, they are not always what they seem, but I think it's just about the formality of a prayer, about how we are 'semi automatic' without actually praying because of our belief, but rather because it makes us feel better about ourselves.\nThe part which made me tear up though, was the part about his friend-'hope' Who 'leaves a lot' I guess it's just how we cling to hope, because it's our only way to make it out of this vicious cycle of depression alive, but he goes away, too often and we're just left alone, in the 'darkness'.\n\n\nI hope this makes sense to whoever reads this, this is purely MY interpretation and i don't want to offend anybody who thinks otherwise.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think it's \"He leaves a lot, his name is hope\" because he could be talking about losing hope alot\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis concept of being \"double-minded\" or double-sided is from the Bible, especially the Book of James. So many of twenty one pilots' lyrics come straight out of the Bible. Double-minded means wanting to be one way (loving and serving God and trusting his will) but inevitably doing the opposite (doing something/being someone you don't like/being far from God or doubting his will).\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nalright so i don't know the song meaning BUT I think the song could take place in the perspective of someone that is either mentally ill, insane, or a schizophrenic.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nit was written from a perspective of the hater. he lives his pitiful life for a whole day, just waiting to come home from boring job or whatever, and when his done for a day he has a whole night to make someone cry over internet, for example\t\t\t\t\n\t\t\t\t\n\n"}