{"comment_0": "\nI think its about sex\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAnyone who thinks the guy is a douche in this song is a complete idiot. The song is about him being with a girl who has a boyfriend and is only using him for sex. He wants to build a relationship and connect with the girl but all she wants is casual sex (whilst dating another guy I might add). Then when he's about to have sex with her, she says no, so basically she led him on the entire time only to crush his dreams.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nMatt described this song as being about \"Your typical, prudish seventeen year old girl who doesn't know what she wants.\" He also said it's labeled as very brash, but he intended it to be very romantic. Essentially it's about wanting sex or connection from a girl when they can't make up their mind about it, pretty romantic if you ask me. I love the anthemic feel of it\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nTo me, this song symbolizes a specific situation. I think Matt is singing about a guy who is longing for something more than just sex with this girl. Ironically, all they \"seem to do is talk about sex.\" At the end of the song, it truly begins to express how frustrated he is that he couldn't feel anything with her. \"They've all got back combs anyway, you've all got boyfriends anyway\"---all of these girls are the same to him, and he's just looking for something different; something more than SEX.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt's about his ex girlfriend.\r\nHe said this on the TDCC concert in Hamburg early 2013.\r\nSo I'd say she cheated on him.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nWell. Since no one else has commented, I'm going to put forward three possibilities for the lyrics: \"I love your friend when I saw his film, He's got a funny face but I like that because he still looks cool\"\n\n1. He means that her boyfriend has a funny face but didn't have enough space in the song to add the extra syllable, hence \"I liked your friend ...\"\n\n2. Its from an actual and specific situation that he has personally experienced and so listeners will not be able to relate to this part of the song in the same way that they can with the rest of the song\n\n3. It highlights that he wants to impress her by showing that he likes everything about her, even her friend with the funny face.\n\nNone of these explanations seem quite right but it's all I can think of so far.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI've been in the same position. It's so frustrating to want someone who you can't have.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni think this song is about a guy thats having sex with a girl that has a boyfriend.\nand the guy really likes the girl and shes only in it for sex.\n\n\"the only thing we have in common is this tongue of mine\" i think the girl is saying they nothing in common except sexual things...\n\nthe guy wants to fill the boyfriends shpes because hes saying hes better than the boyfriend and will treat her better but shes telling him no because she still wants to be with her boyfriend\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI have a slightly different interpretation that I haven't really seen discussed on here. The song is about sex, yes, but its about doing everything except fucking. Here, I'll explain my thoughts. \n\nSo the first stanza is talking about making out in the back of this guy's van. It says she wants him to use his hands and his tongue being shared which is, to me, probably indicative of french kissing or oral sex. \n\nHe's dropping her off afterward and all they talk about is sex and, like most everyone else, I have no clue about the friend in the film. Maybe it just them talking about a movie they saw that night, IDK. \n\nThe next part is them in the guy's room and he's \"about to fill his shoes\" which I take as a euphemism for having sex, the full on intercourse, and she says no. They've done this other stuff, but she says now, she's got a boyfriend. I think that \"filling his shoes\" works as a metaphor for having sex with her and also filling his shoes as a boyfriend. As others have said he does want to be more than just her make out buddy and sex, to her, signifies a step beyond just casual making out our mouth stuff. \n\nThen on to another time (I'm guessing) and she's making her way down, to blow him, and he's thinking, well shit if we're going to do all this, we might as well just fuck, but she considers the full on fucking as crossing the line between what she's willing to do as long as she has a boyfriend, and also there is this level of commitment that goes along with it for her that she's not willing to give him. Which is why he mentions her pierced tongue in the very next line as she's using it on him. \n\nAfter that he's saying he would date her or her friends and be their boyfriend, but they've already got boyfriends and they're basically indecisive girls. \n\nI can't really put my finger on why this song is so good, but there's this sense of real youthful sexual frustration mixed with loneliness and the longing for something greater than what someone is willing to give. There's a lot of sadness and unrequited desire going on which is easily identifiable with anyone who's ever had a crush or been in a friend zone. It's quite nice to me because I feel like what could be a relatively shallow song has an underlying depth of feeling.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI don't get why he's singing about her friend with a funny face. Any ideas?\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nSo most of this song is pretty obvious, the exception being \"I loved your friend when I saw his film, he's got a funny face, but I like that 'cause he still looks cool\"\nI think this part means that he is trying to convince himself that he feels sorry for being \"the other man,\" by telling himself that he \"loved\" him and that he \"likes his funny face because it's cool,\" but he later shows that he can't overcome his feelings for the girl because he tries to fill his shoes.\nThe lyric \"If we're gonna do anything we might as well just fuck\" is so awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI agree with most of the people below. The song is obviously about a relationship between a guy and a girl, in the beginning it's only about sex. 'We've got one thing in common it's this tongue of mine' expresses that he's fine with the only sex relationship they have, however throughout the song it changes. \n'And all we seem to do it talk about sex\nShe's got a boyfriend anyway' he starts finding it annoying they only have sex and she doesn't want anything more than that. He probably starts thinking about more than having sex. \n\n'I love your friend when I saw his film\nHe's got a funny face but I like that because he still looks cool' probably expresses that they have became friends and that she showed/told him more about her boyfriend, he kind of didn't mind because the guy was okay and probably would be better for her than he would be. \n\n'And I'm about to fill his shoes\nBut you say no\nBut do you say no\nDoes he take care of you\nOr could I easily fill his shoes\nDo you say no'\nThen one time after they had sex he probably asks her if she wants more than that and she says no. He wonders if he's really good for her or if he could easily fill him in because he wasn't any better than him. \n\n'And now we're just outside of town\nAnd you're making your way down\nShe's got a boyfriend anyway\nShe's got a boyfriend anyway\nAnd I'm not trying to stop you love\nBut if we're gonna do anything we might as well just fuck' She basically gives him head and he's back at where he was in the beginning. He knows they will never get together, so if she's giving him head he could as well just fuck her again, it doesn't matter anymore anyway. \n\n'You've got your tongue pierced anyway\nYou in your hightops anyway\nYou in your skinny jeans anyway\nYou and your fit friends anyway\nI'd take them all out any day\nThey've all got back combs anyway\nYou've all got boyfriends anyway'\nBasically describes what he likes so much about her and then says she's not any different than other girls, he could as well just fuck her friends because she's not any different, but they're all the same, all not wanting a relationship and no sex. (Using the boyfriend thing as an excuse)\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n\"If we're gonna do anything, we might as well just fuck\".\n\nAwesomely frustrated song, on repeat in my head for the foreseeable future. The repetition of a phrase is certainly what does it. So why do girls stick with guys who are terrible for them? It results in some of the great art in this world, however. And I love art.\n\nThe yearning is palpable in this song, and every boy has felt this at one point in time.\n\nSuch an old boy now: \"I could easily fill his shoes\".\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nit's not just generally about sex if you watched the music video it's a bunch of metaphors. I think when Matty says \"she's got a boyfriend anyway\" he's making a reference that she has her drugs anyway (metaphorically). Of course this song could mean a load but it's just what I think after watching the video, I don't really think it's generally Matty made a song to generally be a douche and just want to have sex it means more than that.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nCan everyone please notice before they talk about MattyÂ´s experiences notice that this song is actually written by Adam and Ross. Ok. Go on with your interpretations.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThis song is pretty straight forward, I think. So sad and full of so many feelings.\n\n\"And this is how it starts\nYou take your shoes off in the back of my van\nMy shirt looks so good\nWhen it's just hanging off your back\"\n\nThis is introducing us to their relationship, where they meet to have sex in his van, and he gives us a glimpse into how attracted to her he is.\n\n\"And she said use your hands and my spare time\nWe've got one thing in common it's this tongue of mine\n\nThis is to explain her blatant sexuality, and to communicate to us how hard it is for him to resist her, especially when she talks like that and when he's already physically attracted to her in the first place. He's really into this girl, magnetically drawn to her and her sex appeal. She doesnt think of him as anything but a sexual entity because she feels they have nothing else in common except their animal attraction to each other.\n\nThen she drops the bomb \"She says she's got a boyfriend anyway\"\n\nBut what's a young boy to do? He's already in too deep, so he continues the situation they've set up.\n\n\"There's only minutes before I drop you off\nAnd all we seem to do it talk about sex\nShe's got a boyfriend anyway\nShe's got a boyfriend anyway\nI love your friend when I saw his film\nHe's got a funny face but I like that because he still looks cool\nShe's got a boyfriend anyway\nShe's got a boyfriend anyway\"\n\nHe wants to connect with her, to build intimacy around what they are doing, to find something other than sex to talk about because sex is all they do, but she's not interested. \n\n\"Now we are on the bed in my room\nAnd I'm about to fill his shoes\nBut you say no\nBut do you say no\nDoes he take care of you\nOr could I easily fill his shoes\nDo you say no\nDo you say no\"\n\nI think this describes a time when they were having sex and he tried to talk to her about his feelings, he tried to ask her if he could ever be good enough for her, or take her boyfriend's place and she said no, he can't and this emotionally devastated him. But at this point, he's addicted to her and probably the sadness that comes with their relationship, and she's addicted to the thrill of eating forbidden fruit. they're both caught up in the thrill of doing something they know is wrong.\n\n\"And now we're just outside of town\nAnd you're making your way down\nShe's got a boyfriend anyway\nShe's got a boyfriend anyway\nAnd I'm not trying to stop you love\nBut if we're gonna do anything we might as well just fuck\"\n\nThis is his sad acceptance of the facts: she will never be his, and if she won't be his, he at least wants to keep her the only way he can, which is by continuing their sexual relationship.\n\nThe end of the song signifies how he felt so used by her and how much impact that had on him with women, \"they've all got boyfriends anyway\" means that now he never feels good enough for anyone, or that he could make anyone happy enough to be their boyfriend. this also explains why he looks so damn sad in the music video. the addiction ends and so does their relationship, but his feelings of self worth he got from it continue on.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nTo me, the song is very conflicting. To some extent, it seems the guy genuinely wants more than just sex from this girl who, against his best intentions, seems superficial and doesn't have a real concern for her \"boyfriend\" because she's clearly hooking up with someone else.  The other side of it is the guy sees her as just a booty call, and wants more than the occasional blow-job; \"If we're going to do anything we might as well just fuck\" When he refers to her friends, \"I'd take them all out any day\" I wonder if he's referring to getting along with her friends or having sex with them as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI think it is about a man who has a sexual relationship with a girl who is secretly gay. I know it sounds silly but Matt Healy actually makes hints like \"you've got your toungue pierced anyway\" and \"your in your high tops anyway\". He always talks about stereotypes etc and personally, I think he is saying he knows she is lesbian now and that's why she says \"no\" . Think about it, she will kiss him \"and make her way down\" but says no to sex. Does that not sound like she can't come to terms with herself? Idk it's just my opinion and it makes sense to me lol\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nIt's beautifully written. It's kind of a masterpiece, I feel. Like Chekhov, and I don't mean to be pretentious. It's about tamping down hope and excitement. About not wanting to fall in love because of the heartbreak that may come. \"She's got a boyfriend anyway\" is what he says to himself to not get his hopes up. It's a way of pinching himself because it's too good to be true. Specifically, he's touring and meeting these girls and craving something meaningful (just like when you're stuck in a relationship and crave casual sex - ha - sucks being human). But he feels something with this girl. The thing with her friend and his film and all that: That's just a snippet of their conversation. It's the point that he is sharing something with her life. Some friend of hers he met. He's part of her life while the conversation is like this. Like a couple in a relationship. It's an example of when he's feeling the butterflies and then he has to pinch himself and remind himself he can't have that. By the end, he just gives up. It's, 'whatever', it's all the same. It's just sex. Even if you wish it was more...\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis song is basically from the perspective of a douche bag who cheated with someone's girlfriend. The boyfriend who was cheated on is singing from what he imagines to be the guy's perspective, and how he pictured the situation to go down.\n\r\nHis girlfriend and a guy are just hanging out, and he's just dropping her off somewhere. The guy is talking about her boyfriend, and how he thinks he has a \"funny face\", meaning the guy thinks that he is more attractive than her boyfriend. The guy's reassuring her that he's nice, and he says her boyfriend \"still looks cool.\" Basically they just keep talking about sex, and the guy and her are flirting.\n\r\nNow the girlfriend wants to have sex with the guy just because she's bored and she's attracted to the guy, and she may even like him. But she feels guilty, even though the guy is really into it. She hesitates because she knows she has a boyfriend, but the guy keeps pushing her on and trying to persuade her into having sex. And we can assume that he persuaded her well enough and they did have sex.\n\r\nAs the song ends, we see the guy's thoughts about how he would still bang her and all her friends even though they have boyfriends. Basically he's just a huge douche bag.\n\r\nAgain, this is all how the boyfriend pictured the situation to go down and this is what he assumes the guy is thinking.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nHonestly, when you listen to the lyrics carefully they're clearly singing about shoe fetishism. i mean, come on \"you take your shoes off in the back of my van\"? Hello? Also anyone who owns a van is practically bound to be a PERV. Oh and also the part where he goes on and on about filling the other guys shoes. Don't blame me, but i really REALLY don't wanna know with what the heck he wants to fill them up. That's like, totally gross. Seriously. No wonder that chick doesn't want to get it on with such a weirdo.\t\t\t\t\n\t\t\t\t\n\n"}