{"comment_0": "\nthis song is obviously about having sex.\n\r\n\"'Round these fields in the hot summer sun\r\nOver by the gate Lordy here she comes\r\nWith a basket full of chicken and a big cold jug of sweet tea\"\n\r\nyour sitting at the bar or in a restaurant and hook up with the waitress or bartender.  then you go back to your place.  could be.  i know a few guys who have hooked up with hooters girls.\n\r\n\"I make a little room and she climbs on up\"\n\r\nyou invite her into bed.\n\r\n\"Open up the throttle and stir a little dust\"\n\r\nforeplay.\n\r\n\"Just look at her face, she ain't a fool to me\"\n\r\nforeplay turned her on and shes ready to go.\n\r\nCHORUS:\r\n\"She thinks my tractor's sexy\r\nIt really turns her on\"\n\r\nhis tractor is obviously his penis.  he's say that his penis makes her horny.\n\r\n\"She's always starin' at me\r\nwhile I'm chugging along\"\n\r\nshes staring at you while your going down on her.\n\r\n\"She likes the way it's pulling while we're tillin' up the land\"\n\r\nyou do her so she orgasms.\n\r\n\"She's even kinda crazy 'bout my farmers tan\"\n\r\nshe likes his body but likes how he does her more.\n\r\n\"She's the only one who really understands what gets me...\r\nShe thinks my tractor's sexy\"\n\r\nhes saying shes the only one who does it for him right now and he does it for her.\n\r\n\"We ride back and forth till we run outta light\r\nTake it to the barn, put it up for the night\r\nClimb up in the loft, sit and talk with the radio on\"\n\r\nwhen your done with sex and you sit in bed and talk afterwards, was it good for you, etc.\n\r\n\"She said she's got a dream, and I ask what it is\r\nShe wants a little farm and a yard full of kids\r\nAnd one more teeny wenny ride before I take her home\"\n\r\nthey talk about possibly keeping the relationship going.  she tells him she wants kids and shes wants more sex before she goes.\n\r\n\"Well she ain't into cars or pick-up trucks\r\nBut if it runs like a Deere then her eyes light up\"\n\r\ntalking about what kind of guy does it for her and how any guy can turn her own.\n\r\nthat just what it means to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nwoo hoo! this song is awesome!!!!!!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nLOOOOOOOVE this song!  (and that Kenny Chesney is niiiiice...very nice)\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWhat a redneck song :-P\r\n-LimpedBRoach\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nhaha  yeah but it's fun to listen to\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI hate country, but this is a great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think the first word is actually 'plowin' instead of 'round.  \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think his tractor's sexy\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ni love him he's songs all soo sexy just what a women wants....\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nKenny is just one sexy man.  His tractor MUST be sexy as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nHm.  ACCrazy003.  I'm assuming your name means something like Aaron Carter Crazy?  Correct me if I'm wrong.  Please do.\n\r\nIt makes me wonder why anyone who doesn't like country would come to one of these COUNTRY lyric pages.  Hm.  Doesn't make much sense now, does it?  Yeah, I didn't think so.\n\r\nWe like country, and that's okay.  You like what you like, and that's okay too.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI love this song...it's just fun to listen to.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song is awesome... and Kenny Chesney is Sooo SEXY. Anything that coames outta that mans mouth is good.  I lve cowboys their sexy that goes to you ACCrazy003, you just mad cuz you aint that sexy. Women Love Cowboys!!!!!!!!!!! okz :) If you like cowboys gives me  a \"heck Ya\" lol\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis is such a funny song.  Kenny Chesney is an amazing artist who makes songs that his fans can relate to and some that just make us laugh.  He has a great voice, not to mention how sexy he is.  I think that you people who don't have anything nice to say about the artist, which means you ACCrazy003, should just shut up.  Not that whatever gay music you listen to is so much better anyway, right?\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nOk, ACCrazy003. What music do you listen to anyhow? You come in here and diss on everyone else's music, but you won't say what kind of music you like.  It's some gay techno music or foreign crap, isn't it?  Country music is good music that actually has meaning.  If you don't like it, you should just keep your big fat mouth shut.  Is that OK with you?\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nac crazy...umm just because we like country u call us perves?? do you even know what a perve is? it doesnt mean someone who listens to country music. leave us alone and let us listen to our country music and u listen to urs. and it does have meaning!!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nHah, a Simple Plan and aaron carter fan saying country music has no meaning. I hope you guys enjoyed that a s much as i did.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nACCrazy003..first of all you clearly only listen to music that's on mtv or mtv2..would you admit that you are a poser? I doubt you would..and I would like to know how the hell a tractor can be implanted from a sex change..dumbass\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nACCrazy003,\n\r\nIf you dont like the music leave it alone.  Stop getting people rowled up.  It's immature.  Every country song has a meaning to it.  It has a story, and your pretty dumb to not know that.  Before you diss the songs and the listeners, read some of the lyrics.  Every country song means something!  YAY Aaron Carter.. wooo, hes stupid, and HIS SONGS HAVE NO MEANING!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI dont agree with either of you i dont like country not because it sounds bad, but because the only meaning in the songs are shallow and written for rednecks, they are not insightful and i really think its stupid that people wouldnt aspire to being anything but a hillbilly farmer on a tractor, i respect farmers because they do what makes them happy, i just think that country music listeners would get more out of life if they tried to do something with it.\n\r\nby the way, acccrazy, those bands you named are just as bad as country, being stylishly angry is silly, aaron carter is just a body, he doesnt write anything and his voice is made better by computers, all those punk-pop bands suck ass, they piss me off more than country artists.\n\r\nthese are my thoughts and im not trying to force them on anyone else, id be happy to argue with someone that wants to contact me on AIM or through the message board\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nACCrazy003, at least my music is real...all of your people are just little pop people adn most don't even write their own music. i'm a country girl through and through. i'd rather have the guys in tight jeans were you can tell they have butts thatn someone in baggy pants around their ankles. you might not like my music, but at least try to know something about stuff before you go saying crap about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\naccrrazy003...sooo we meet again..(if you read on the good stuff page)...yeah......but that is no reason to diss country... BITCH IM FROM TEXAS....and i'll kick your ass......yet..again- try me....its no fun to get your ass kicked by a texan..ask all the other whores asses i kicked....oh..yeah they're dead...lol....well...i gotta go- but AARON CARTER? DUDE...HE IS SOO NOT POPULAR ANYMORE- oh yeah and i'd love to hear from you-\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\naccrrazy003...sooo we meet again..(if you read on the good stuff page)...yeah......but that is no reason to diss country... BITCH IM FROM TEXAS....and i'll kick your ass......yet..again- try me....its no fun to get your ass kicked by a texan..ask all the other whores asses i kicked....oh..yeah they're dead...lol....well...i gotta go- but AARON CARTER? DUDE...HE IS SOO NOT POPULAR ANYMORE- oh yeah and i'd love to hear from you-\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nACCrazy......boi u r a ass fucker! i am also from texas and would be more than happy to kick you scronny white ass! i am not saying u have to like country or that your music sucks because i listen to both and others like ICP, Godsmack, Cradle of Filth, and Manson amd much more. it takes a person with a low self-esteme to diss country and an even lower self-esteme to diss kenny.  i am not the bigest country fan in the world but even i have to agree kenny has a nice ass! i dont hate ppl who dotn like country but it pisses me off when they diss it.  i highly dout u have acually taken the time to listen to a good country song. 10 bucks says u once heard a hill-billy song and labled it a country song and thats y u dont like country. huh? huh? huh? ya thats waht i thought! so go piss off and suck your moms milk!!\n\n\n\r\nok...now after i got done with ass fucker over there.....i think this song is the shit! it is a pimpn song and i could listen to it all day!\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\numm..country music is simple. its something that everyone can relate to. its laid back and friendly. a lot of country musicians write their own songs and i have the utmost respect for those people. theres nothing wrong with listening to simple plan and relient k i listen to 'em. and they are great bands. but i am country because country is real. i relate well to most of the songs they sing. i guess thats what happens when your raised in the south. woot for southerners\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nhaha, i now love this song even more! last night they played it while i was at the skating rink with my boyfriend and he was singing it. amazing how great one song can be...\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI have nothing against most country songs. I don't like them, but I still consider most of it to have a point. This though is probably one of the stupidest things I have ever seen.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nYeah ok ACCrazy003. If you don't like country then why did you even write anything here? Don't go dissin our music when whatever you listen to is total crap to begin with. Country music has meaning. It's not just  songs about your dog dyin or your gf leavin you. There's a lot more to it that than. If you actually listened to country you would understand that. But you don't. So you come in here and diss somethin you know absolutely nothing about.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis song is so awesome! It's funny to listen to, like it puts a smile on my face. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nMy friend Ryan has a really funny parody of this about his Jeep Wrangler \"she think's my Wrangler's sexy.....\" too damn funny, anyway catchy song even as written although I must say i like the version about going mudding in a wrangler better :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nTHis is a great song! I love being a redneck, aint nothin wrong with it!! Me and some of my friends just sang this for kareoke...\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI love Kenny Chesney and this is my favourite song by him because I live on a farm and I can totally relate to it. Oh, and the first word isn't 'Round', it's \"plowin'\".\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nMy Uncle Shawn's wedding is next month and we are having the whoile thing on his farm! its going to be a gaint tailgate party wedding-style. and his bride is not waering a dress but blue jeans its going to be really cool. and hes going to leave on one of the tractors with \"Just Married\" painted on it while the Dj plays She thinks My Tractors sexy. To bad Gramma cant be here to see it.\r\nR.I.P Gramma\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nOkay everybody now that I've gotten incredibly pissed off.... If you people listened to country music you'd understand how meaningful and insightful it is. I'm listening to a song now called \"Kill Myself\" by Tim McGraw and its one of the most insightful songs I've ever heard. The song isn't about boo hoo my life sucks so I want to die (emo and punk shit talks about that) but it's about realizing you were wrong and completely changing your life. Listen to country music people. Turn a country station on for a day and I can almost guarantee you you'll hear songs that'll move you to tears and songs that'll have you sayin hell yea that's how I feel. To the person who says people who listen to country music should aspire to be more than hillbillies and farmers you are completely wrong. All I listen to is country music and I will soon be going to college to study social work. People who listen to rap should aspire to be more than murderers, drug dealers, and strippers. People who listen to punk and emo should aspire to be happier. She Thinks My Tractors Sexy is an awesome song. lol Oh and to the person who says She Thinks My Wranglers Sexy... I sang the same thing when I got my Wrangler for my 16th birthday b/c this song was playin while I was sittin in it. Well I said HE thinks my Wranglers sexy.  I love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nDude, I love this song! I LOVE to dance to this song. It's awesome to dance to at the country bar. Not sure if it's a couples dance or a line dance, though. This is my feel-good song. I play it when I need to smile.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI ,\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nto anyone who said his tractor was sexy--damn are u right!!  im country listener at heart and well this is my song b/c tractors are sexy!!! lol\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nSaw Chesney on TV not that long ago... apparently he has two tractors, neither of which he considers sexy. Apparently, this song was a bit of a gamble for him, taking the comedic approach to try to jumpstart his career or something. Can't remember the details, but I guess it really worked for him. It's a great song to make you laugh. This and George Strait's 'All my ex's live in texas'...\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nInsanityIsBliss- what kind of a low-life bull faggot are you? I'm just curious as to why you go and waste your time looking for music you don't even like to put stupid comments that go absolutely nowhere...you just need to go listen to your emo shit and cut your wrists and then casterate yourself, if there is anything to casterate that is....\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI understand if you don't favor country music, but it is not meaningless - far from it.\r\nHave you ever heard the song, 'Concrete Angel' by Martina McBride?\r\nIt's probably one of the most sad songs I have ever heard; and it damn well has a meaning, thanks.\r\nMost country music is really fun and is a mood-booster, for sure.\r\nI normally listen to Aerosmith, Puddle of Mudd, Nirvana, The Clash, Metallica and many, many, many other rock bands.\r\nBut I also like country because it never fails to get one in a better mood. It always puts a smile on my face.\n\r\nAnyways, about this song:\r\nI think it's really funny and it makes me laugh a lot.\r\n^_^\r\nThe meaning is basicly obvious, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nEver run a 22HP Deere and have a Sexiphite stare you down?  She could have burned a hole in my hood or left my fuel lines in knots.  Should have seen it----no video to show----no trailer either.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nShe might like your tractor, but does she like YOU.....? Be careful, Kenny! (Ha, ha!)\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nIt's about his dick!!\n\r\n'She thinks my dick is sexy'\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nXD this song cracked me up the 1st time i heard it and now it's AWESOME. what a sexy tractor lol!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThis song isn't meant to be about sex like *some* may claim! It's much more innocent then that! Jim Collins, who also wrote \"The Good Stuff\", \"Then They Do\" (Trace Adkins) and funny enough \"Big Green Tractor\" with David Lee Murphy, has stated the reason for writing it was all in good fun and meant as a novelty song. Put into simpler terms: a joke! Not a dirty joke mind you, but it was wrote by two people who were once farmers in their day. If you think this song is about having sex your mind is in the gutter and you should really rethink your priorities! \t\t\t\t\n\t\t\t\t\n\n"}