{"comment_0": "\nIt seems to me like it's about him always having failed relationships with people. Every time he gets close to someone he screws it up. Now he's convinced he's always just going to mess it up. Since then he's just been pushing people away.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI firmly believe that this song is about his failed relationships with people (as agreed by sirlenopow) due to his depression. As a person with depression, it gets harder and harder to maintain a healthy relationship because you don't feel like talking to anyone. As such, he 'shot, shot, shot a hole' through everything he loved by pushing them away and hurting them by doing so.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI really liked the music video for this song, its awesome :D\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThe situation happened me continuously during these two years, so I am very familiar, perhaps too familiar, about the meaning of this song. \n\nThis song is an apology from the singer to a friend he loved romantically and confessed his love to. Unfortunately, the women he displayed affection to does not feel the same way back; in this case, their previous relationship was destroyed. \n\nThe first phrase is an apology: \"I'm sorry for everything, oh everything I've done.\" The singer is apologizing to the women he loved for not being a good friend but instead risked the friendship between them for \"romance.\" The second part of the story describes the current situation of the singer: although he still loves the women, there is a barrier between them now since he confessed his romantic attractions toward her. \"Oh I'm wishing you're here // But I'm wishing you're gone\" implies that he loves and is afraid of meeting the woman again. The chorus, \"From the second that I was born I think that I have loaded a gun,\" implies that the singer acknowledges that he had hurt the woman since he broke the friendship between them by confessing his love for her. \n\nSkipping over the repeat of the melody, the bridge of the song is, in my opinion, the darkest and most expressive part of the song. \"In the meantime, let it go // At the roadside // We used to know // ... // At the bay side // Used to show\" evokes the pleasant times that the singer had with the woman he loved when he did not confess his love to her; when they were still close friends. The next part of the bridge, \"And there's always time to change your mind // Oh there's always time to change your mind // Oh love, can you hear me\" implies that although the woman rejected the singer for his love, the singer still hopes openly for her to accept him; for her to change the mind and accept his love. \n\nOverall, I feel that this is a very depressing song, especially since the exact scenario happened to me two years ago.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song is all about an apology to the woman he loves. He feels torn apart and lost in his life. He's looking for a way to escape and he's taking things for granted and realizes he's messing everything up. He's letting everything drift away and wants to be heard in his pain. He's shot a hole through everything he's ever loved. He's wishing in this particular case, he wishes the girl he loves were there. In the meantime, he's trying to let go of the people he loves. At the end, he says there's always hope and time to change the things that have happened leaving the song on a somewhat hopeful note. Overall, this song is in relation is a testament to failed relationships and his apology since the moment he was born. Therefore causing this song to be named \"Shots\".\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI believe its all about life relationships n not just love n confession... Its a great song including all these problems making connection with others n especially people close to us even family members... Saying the fact that we humans want n need to be with each other but we can't  Stand each other forever n after all loneliness is what we prefer in the part saying i want u to beh here n i don't...\t\t\t\t\n\t\t\t\t\n\n"}