{"comment_0": "\nhe is saying that it's the bad parents and our dangerous culture that messes kids up, not the rappers.  Eminem's job is to tell it like it is, and people shouldnt sue him justy because they're in denial about whos at fault.  Em is very wise, an incredible poet.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nTo all those viewers who wonder who Guerra is? He was a bouncer at a club who was flirting with Marshal's wife Kim. Therefore, he got into a fist fight with him and \"alledgedly\" won.  Its also acted out in track #6 \"The Kiss\" off the The Eminem Show record.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nobviously a brilliant song lyrically, but equally brilliant MUSICALLY.\n\r\nthis song combines 3 genres:\n\r\n1. rap -- obviously\n\r\n2. rock -- samples Aerosmith's \"Dream On\", for the chorus\n\r\n3. classical -- the song starts w/ string music (from \"Dream On\")\n\r\nlyrically, it has just as much depth -- classical seriousness to discussion (about politics, legal system, etc., other serious topics), but a huge rock/rap edge to it\n\r\nbrilliant lyrically & musically\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nEminem is awsome, to be honest i HATE rap but hes just killgr i really love the first 7 lines and then everything after ''it's why we sing for these kids tjat don't have a thing  except for a dream and a fucking rap magazine' everything after that describes me, with rock music\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nfor anyone who's ever been through shit in they lives \r\nso they sit and they cry at night, wishing they die \r\ntil they throw on a rap record, and they sit and they vibe \r\nwe're nothing to you, but we're the fuckin' shit in their eyes \r\nthat's why we sieze the moment, and try to freeze it and own it \r\nsqueeze it and hold it, 'cos we consider these minutes golden \r\nand maybe they'll admit it when we're gone \r\njust let our spirits live on, through out lyrics that you hear in our songs \r\nand we can \n\r\ni love this part the most...so true\r\ni think every1 can relate 2 it\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nPersonally i like the last verse of this song when i heard it for the virst time i got a lump in my throat and i sorta wanted to cry\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI hate rap, but when a lyrical genius like Eminem writes stuff like this, it is hard not to stop and listen. He's amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI used to sit on my bed, when I was thirteen, and just blast this song into my ears through my headphones on repeat. This song described how I felt to a T back then. This is definitely one of Eminem's best, if not THE best.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI remember hearing this song when it first came out so I was like 11 and thinking that even back then this song is one of those ones that no matter what kind of music you actually listen to, where you're from or whatever you can relate to it in one way or another.\n\r\n\"They say music can alter moods and talk to you\r\nbut can it load a gun for you and cock it too?\"\n\r\nThis line reminds me of how people tried to accuse Marilyn Manson for the Columbine Shootings.\r\nIgnorant fucks, it goes with anything really if you listen to metal or whatever it doesn't mean you're some murderer to be or because you listen to hip hop doesn't mean you're a thug or whatever it's up to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI ADORE THIS SONG!!! I know the entire song by heart and feel that it is talking about how all rappers sing so kids can express themselves.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nOkay...Eminem is the SHIT.  I've listened to him FOREVER.  This is definately one of my favorite songs by him.  It describes how I feel perfectly.  I love you, Em.  And every night I thank God for giving me you.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nDamn good lyric...the text really goes down to the bottom of my heart. No Bullshit! I think especially the germans should think about the two first lines of verse 3...especially after the massaker in that school lately.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nWrong! It's:\r\n\"But everybody just feels like they can relate\r\nI guess words are a motherfucker\r\nThey can be great\r\nOr they can degrate, or even worse\r\nThey can teach hate\"\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think this and Halie's Song are the best two songs Eminem has made. Im not a huge fan of his, but I do like listening to him every now again.\n\r\nThis and Halie's Song are absolutely incredible though.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI agree, ab0ve. This and \"Hailie's Song\" are two of the best on \"The Eminem Show\".\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nyeah uncgurl, you have no idea\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI totally agree... this and Hailie's Song are fu*kin amazing... \r\nEminem is straight up, no bullshit.. and i like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nthese lyrics are so wrong....\r\npartly corrections:\r\n'it's why we sing for these kids that don't have a thing \r\nexcept for a dream and a fucking rap magazine \r\nwho post pinup pictures on their walls all day long \r\nidolise their favourite rappers and know all they songs \r\nor for anyone who's ever been through shit in they lives \r\nso they sit and they cry at night, wishing they die \r\nso they throw on a rap record, and they sit and they vibe\r\nwe are nothing to you, but we're the fuckin' shit in their eyes\"\r\nthese lines reminds me so much of my self....reminds you of anyone? =]\r\ni love this song and i love the lyrics, my favourite song on the new album!\r\nPS. Em is the shit in my eyes\n\n\n", "comment_18": "\nhaha first of all eminem is hott NEwayz tho.. this song has mad meanings to da fact that thes rappers have meanin to kids and how they feel.. i kno most of his songs have feelings towards me and i think hes 1 of the only rappers who will speak his mind in his music and  dats mad rare.. i luv eminem..\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis kicks ass!!! I love it!! ....EM makes a great point as he usually does. Aerosmith is the greatest rock band of all time and adding them onto his record makes him that much cooler!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nwhat song is that in the chorus?\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nthe song in the chorus is Dream On, by Aerosmith\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThey say music can alter moods and talk to you\r\nWell can it load a gun up for you and cock it too?\r\nWell if it can, and the next time you assault a dude\r\nJust tell the judge it was my fault, and I'll get sued\n\r\nIs he taking partial responsibilty or telling the \"Dateline Bandwagon\" parents out there that its not his fault?\n\r\nI think hes saying that its not his fault and that parents need to take responsibility 4 thier actions.......\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis song is amazing. I love the first verse the best, it explains how a lot of kids are living today. It always makes me want to cry...I don't know, it just really gets to me...\n\n\n\n\n\n", "comment_24": "\nthis song is sooo me! being a marshall fan well obessive fan, eminem lyric have made me become a stronger person! i find the lyrics in this song r actually very true! dong worry noreality they make me cry but thats coz ive learnt that maybe when eminem's gone ill let his sprit live on and ill admit that i have a problem but y wait till hes gone i gotta do sommin now! cheers masrh\n\r\nsarah\r\n--x--\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is probably one of Em's most powerful songs. I love it, but I do think the original is better, but Em does a good job. I still love this song. PS. Does anyone know if that is Steven Tyler singing the chorus, It sounds like him, but I am not sure.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\neminem is one of the only rappers i like. he tells it like it is and doesnt leave anything out. he doesnt cover the facts to make the world seem like a better place, cuz its not. \t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\ni like this song\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\ni'm not a great fan of rap music...espc eminem...but i heard this song with my brother and it immdiately caught my attention...i love it....not so much eminems rapping but when aerosmith comes in...its a cool song...i dont' see why you people would like cry over it ...but hey i guess i'm just not weird like the rest of america.....mmmmmkay\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThe song in the chrorus owns the world.\n\r\nAerosmith - Dream on.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\neknick - that reminds me of myself, hes teh fucking shit in my eyes\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ndream on\r\ndon't shoot me now but i think it's sad he took that in his song :( \r\nwell, whatever.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\n\"words can be great or they can be great\", who the hell wrote these lyrics, cant listen for shi*\r\n\"i guess words are a mother fucker they can be great or they can degrate\" it should be-----good song though, who ever wrote these lyrics must have been high\n\n\n", "comment_33": "\nis that aerosmith singing the chorus? -i know, someone asked that already-\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\na lot of people have been asking this: yes, Eminem DID sample Aerosmith's \"Dream On\" for the song, a very smart move on his part IMO. \t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI don't even like rap music, except for Eminem, because his words are so real and his music is amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis is yet another example of why The Eminem Show is one of the best CDs ever. \t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nok there are like alot of things wrong in there so im just gonna put the right way even if someone else did-i have the cd so im just copying from the lyrics on there:)\r\n1. its not \"alone in his own zone, cold in his own paries \" its \"alone in his own zone, cold and he just dont care\"\n\r\n2. its not \"2 rags\" its \"do-rags\"\n\r\n3.oh and come on is part of the chourse...\n\r\n4.change \"only this gun, lonely, cuz you only need one homey \" to \"only this gun, lonely cuz dont anyone know me\"\n\r\n5.some one already said this but \"but everybody just feels they can relate to the words of a motherfucker they can be great or they can be great, or even worse they can teach hate \" is sposed to be \"yet everybody feels like they can relate, i gues words are a motherfucker-they can be great. or they can dgrate or even worse they can teach hate.\"\n\r\n6.change \"attorney's all gonna turn it to \" to \"attorneys all want a turn at you\"\n\r\n7. \"you need to spew, dont hesitate to produce air-guns\" to any dispute wont hesitate to produce handguns\"\n\r\n8.its not \"swiftly\" its \"strictly\"...and change \"pete\" to \"B\"\n\r\n9. and its not \"and they sit and they quiet \" its \"and they sit and they vibe\" \n\r\nk i didnt do this to be like all perfect and shit i did it cuz my mom took the tv away and im bored:) so yeah if i messed up sorry-im just copying from the lyrics and i did skip a few things that were just one word\n\r\nPS-this song kicks ass \n\n\n\n", "comment_38": "\ni think this is like em somehow explaining somehow that what he writes, he writes from what he knows, feels, sees, and that just because one of his fans decided to get a gun or hurt someone doesn't mean he is the guilty one, since MUSIC IS REFLECTION OF SELF, this is one of my favorites songs, i mean C'MON, the song is great, and i think EM can still do great songs without being talking on everyone TH0UGH ppl expect him to do that on every song...I think even though he doesn't talk bad shit on everyone the album is still very good, EM showed that he ain't just a white boy mad at the bubble gum pop ppl, and that he doesn't need to diss ppl to have number one hits...i think the next song of his album should be SING FOR THE MOMENT, CLEANIN OUT MY CLOSET(coz it would be cool coz he would do at same time some publicity to his movie 8MILE, coz here in portugal for an exemple not many ppl have heard of the movie), SOLDIER or  TILL I COLAPSE i think this 4 songs should be(of course only one) the next single....lol...\r\nBut i heard it will be WHITE AMERICA...but i just heard...i don't know\r\nONE LOVE\n\r\n                      the_tormented_one\r\n:) :D\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nwhen u guys post the lyrics up.... especially for eminem  ...please get it right....just copy it from the cover...\n\r\nNOT TO BE MEAN OR ANYTHING...\n\n\n", "comment_40": "\nThis song is unreal. Eminem tells it like it is. He aplies many lyrics that are \"against parental views\" but in teh next few lines he says listen kids don't so this, it's bad I just say it to get things of my chest...but the media turns it all around like he never said any of that. Bullshit. Eminem tells it like it is in his lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nthis is the best rap song eminem has ever and probably will ever put out. i can relate to this song so much especially the first verse and the third.  eminem is the best rapper out there right now no contest.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nsong is so true it's sad.  people need to quit playing the blame game... a good child starts with good upbringing which can only occur from good parents.  Folks, when you point your fingers, there are still those 3 you curl up pointing right back at who's truly guilty.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI really have hated eminem ever since he started gettin big... I still dislike him.  Part of it is at the VMA's this year he was sucking his stomach in, anotehr that he was lip-singing but that don't matter, I was downloading this CD fro my friend and I just listened to the first part of this song.  It's really powerful\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThis song is awesome, the lyrics are very very good.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\njus wondering, when he says \"it's fucked up ain't it, how we can come from practically nothin' \r\nto bein' able to have any fuckin' thing that we wanted \r\nit's why we sing for these kids that don't have a thing\". Does he mean the reason he sings for those kids is because he gets to have anything he wants or because he was in the same situation and it would give the kids hope?\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThis song would have too be the best eminem song too come out yet , This song makes me have respect for him now .\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nHey i wuz wonderin if anybody knew who em wuz talkin bout when he says \"guerra that was a fist that hit you\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nDub-c, he was talking about the bouncer who he caught kissing his wife, kim, and that whole legal battle thing.  Guerra said that Em pistol-whipped him but Em said it was his fist.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nAnd to sparx- it's definitely the latter of the two.  He means that since he was in that situation and felt like no one was listening, now he's in a position to call attention to it and sing for the people without voices.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nahhh will you people stop making eminem too be  this icon of sticking his middle finger up at everyone and who cares about the media , why not just analyze his skills and talent instead of the contraversey etc. .... i dont really think twice about that bull , media has always attacked rap or rock artists , who cares .This song didnt have the ''middle finger effect''  , it means more than that . Like how people are followers and some of his fans are crazy . His fans are doing most of the damage and thats why he sticks his middle finger up , not cause hes trying to piss of parents and the media but the fans who give him a bad name .\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nthis is great song, i like how he took it from the old Aerosmith.  Eminem is madd talented and all the parents arent paying attention to his skills, just the fact that it doesnt seem right to let little kids listen to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nim not a big eminem fan either, i dont even like rap except him but his cd The eminem show, i think, is great he always has a message in his songs someplace even if they might not be so great but its still respected, this song is one of my favorites.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\ni cried the first time when i heard this song. the lyrics are amazing. i'm not really into rap either but this one is so much better than most rock-songs that i know. \r\nthe lyrics really touch my heart and the sample that he used from aerosmith's dream on is perfect for this song. it suits the song.. i listen to this song almost everyday and i could listen to it endlessly. i don't think i could ever get tired of this song because i love the lyrics so much.\r\nit's so true..\r\nmore people should be realising this\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI think this song is one of eminem's best so far. This song shows how he can take parts to an older song and update it to make it another hit.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI didn't feel like looking through all of the comments... so sorry if thisd was asked.. but when he says \"you're full of shit too, Guerra, that was a fist that hit you,\"... who is Guerra?? I'm not an Eminem fan... so (once again) sorry if it is an obivious answer.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\n\"by marsbeautyqueen \n\r\n, he was talking about the bouncer who he caught kissing his wife, kim, and that whole legal battle thing. Guerra said that Em pistol-whipped him but Em said it was his fist.  \"\n\r\nthere ya go bleed.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nGood lyrics, though I hate it when people take old songs and completely change it around.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\ndon' like it- it's like a stale sandwich w/ no meat\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nI could care less about what the actual lyrics, because I can tell you what the song is about.  Its about how kids today are idolizing rappers and how they shouldn't do that because rappers aren't exactly the right people to idolize because of what some do (shooting and all that).  Eminem has a good point because fans like that think they are being cool, but they really aren't.  I hope I got that right.  I'm not a huge eminem fan, but he's one of the few good rappers out there because he isn't rapping about \"da booty\" 90% of the time.  Even my FATHER (who HATES rap to death) likes this song, so that tells you a lot.  Like someone mentioned, its not about just pissing people off, its about saying its his fans who do all that shit...Gah, just ignore this, I make no sense >.<\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nya the chorus is the best part and eminems voice is awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nTo all you who think that Eminem is some sort of musical genius, or that this is one of the greatest albums of all time, I have to explain some things to you.  Eminem makes songs that are easy to listen to, I'll agree.  But he's not a musician, and I don't think he's overly talented.  I mean, rap in general has no musical value whatsoever, as it's prettymuch all repetitive computer generated drumbeats and some simple synthesized bass.  So to call Eminem, or any rapper for that matter, a musical genius is a farce.  But since they have no musical value, their strength has to be in their lyrics and vocal talent.  To be honest, Eminem can't sing.  He more or less talks to a beat, he doesn't sing.  And his lyrics are mainly him bitching about everything, in normal prose.  Once again, no musical value.  He's not a lyricist, he just writes long satirical rants about how the world is too mean to him.  It flows extremely well, I'll give you that, but there's no deeper meaning, no metaphors, nothing.  If you guys think that this is among the best that music has to offer, I honestly pity you.  There's so much more out there, so much actual musical talent.  My sympathies are with you.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nall respect to anyone that likes this particular song...but i have grown to HATE it for one specific reason....i was in my dorm room one day listening to Aerosmith Dream On and some kid passed by and asked if it was eminem....i said no, its aerosmith...the kid then asked oh did they steal that from Eminem?....this pissed me off rediculously...its just a small example of the fact that eminem didnt give enough credit in the song to aerosmith....this is also evident by the numerous posts asking who the band in the background is. Eminem might have a big career ahead of him but he does not compare to Aerosmith yet...if i he wants to write songs i say he should use his own beats...really who is he..puff daddy?\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nI LOVE this song....it's one of my fav of em's songs...the part that most hit me was \"for anyone who's ever been through shit in they lives \r\nso they sit and they cry at night, wishing they die \r\ntil they throw on a rap record, and they sit and they vibe\"...that's exactly what i do when i'm pissed off and he helps me so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nthis is another great song by eminem...i love all his songs\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI love eminem hes fuckin amazing...I just love everythin he dose...he always comes out on top...he has worked hard to get this far...and now he aint gunna give it up for nothin..now this holy rap thing..my mum she hates it if i would sware and man the kid up in the frist verse shit son thats me..Eminem has helped me through alot!!!Eminem your the shit man Peace Kage\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nthis and lose yourself are eminem's best. where normally he is pretty closed-mided, this shows his human side, one that appreciates emotion, and such. it's one of his brilliant moments, with a good message\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI agree with SoyFarra This is my fav. eminem song cause I like how he combined the beat with the original song ang his lyrics bring tears to my eyes. Shut the fuck up i know the tears thing was cheesey.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nEminem always seems to tell it like it is. Particularly on 'The Eminem Show' which is a lot more mature than his previous albums. 'Sing For The Moment' is about taking every chance, i think. Eminem's expressing his viewpoint and this song opened my mind to his world and the way he see's things. He handles criticism well in that he channels all the energy it gives him into his music and it's all fuel for his fire. \r\nI think he's a clever lyricist. This song's almost like a 'two fingers up' to the media which can be narrow-minded. Society is too quick to judge people like Eminem. I can see why some people idolise him.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nBy the way, youlikestuff...i think you need to keep an open mind, doll. Let people have their own musical preferences. Not every song needs to contain complicated metaphors to be decent music.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI liked this song cuz it is really tru, a lot of the shit he says is like 90% accurate\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\ni don't like rap (except for eminem and beastie boys). eminem is a great lyricist.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nThese lyrics are so real its amazing. Eminem is the best rapper ever\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI only liked it cause the Chorus is by Aerosmith and isn't original.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nis this person fuckin retarded or just deaf. this is my favorite fuck up\r\n\"they're for the judges daughter, but his grudge is against me \r\nif i'm such a fuckin' menace, this shit doesnt make sense, pete\"\n\r\nhahaha pete? fuckin deaf retard\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI remember when I got this album, the day it came out, this was instantly one of my favorites.\n\r\nI think Eminem totally convays the way it feels when you hear a song that just speaks to you, or you can relate to, because of the situation you are in at the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nThis song talkes about how parents can be rong even though they always think that they're right.He's saying that all the parents don't want they're kids to be gangster but thats aint they're choice they made us and controle us while were home but still they can't controle us when were at school.Em's also saying that tennagers also kids want to so shit to themslefs for bad or good resans.This song brings a lot of messages.Luv ya Em\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI like this song, but:\n\r\nsee what these kids do, is hear about us toting pistols\r\nand they want to get one, cos they think the shit's cool\r\nnot knowin' we're really just protectin' ourselves \n\r\nI know he doesn't want to get blamed for that kind of thing, but the dude's got like 10 bodyguards.  Why does he need a gun?  Ppl said he was just showing it off anyway.  He doesn't need protection from anyone except his crazy wife.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nWell there you go wisearse you just answered your own question; \"except for his crazy wife.\" Besides, I would imagine there are certain people he would like to take on himself. Or not. I don't know. Either way, I maintain that the point he was making in that part of the song is that he's getting alot of bs from suburban holier-than-thou parents \"whose worst fear is a child with died hair and  who wears earrings\". If the parents would actually explain to their kids why not to listen to this or that kind of music instead of using up all their energy nagging and finger-wagging they might actually have a chance. And that is  what the song is about;  Em's childhood as he growing up with authoritarian self-righteous bastards for parents and that he now wants to send a wake-up call to overbearing parents to tell them that if they force their ideas and beliefs on  their kids too much that rebellion is inevetible\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nby ab0ve on 05-28-2002 @ 05:22:11 AM  \r\nI think this and Halie's Song are the best two songs Eminem has made. Im not a huge fan of his, but I do like listening to him every now again. \n\r\nThis and Halie's Song are absolutely incredible though.  \n\n\r\nabsolutely what I think..\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nwhats the whole\n\r\n\"yoiu full of shit too Guerra, that wasa fist that hit you\"\n\r\n?Â¿\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nwhats the whole\n\r\n\"yoiu full of shit too Guerra, that wasa fist that hit you\"\n\r\n?Â¿\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nThis used to be my most favorite song EVER in the world, because i liked the meaning of his song and i understood him, but then after a while Encore came out and my fave song changed! And by the way, Eminem did not sing the chorus.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\ni like this song, but no one can honestly tell me that its better than the original by aerosmith. never has a cover been better than the original.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nhere is the story behind  \"Guerrerra\" (taken from mugshots.net\". If you read through, it also tells the real story behind the skit track that plays right before \"Soldier\".\n\r\n---------------------------------------------------------------------------\n\r\nEminem was charged with carrying a concealed weapon following a June 4 confrontation outside a Warren nightclub. Police say Eminem struck a man - club bouncer John Guerrera - he says he saw kissing his estranged wife, Kim. Alledgedly, the victim was pistol-whipped, but Eminem has always denied this, claiming he only threatened him with the gun but hit him with his fist.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\numm uncgurl, i am wondering if you can hear yourself. you arent even close to what he says, adding words and what not.\n\r\n\"but everbody just feels like they can relate. i guess words are a motherfucker; they can be great or they can degrade, or even worse they can teach hate.\"\n\r\nyou retarded deaf mule\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nthis song=awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nFor me, I loved this song as soon as I heard it, and basically it's about WHY Eminem raps: Not for money or glory, but because of all the kids who can REALLY feel this HIP-HOP (not POP!) music and relate, and be comforted by it.  \"Sing For The Moment\" is saying that the fame and money doesn't last, and that it's just a moment, so while he has the spot-light, he wants to try to make them feel it.  \n\r\nBut just him knowing that all the real fans (Eminem is hip-hop, not pop, not for pop fans) really appreciate the music, that's what makes this song great.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nhahaha finally someone said something about how he says words can degrade, not degrate, not be great, but friggin DEGRADE. and yes i know it's spelled like degrate in the album cover but it still isn't right.\r\nthis song, while not Eninem's best, still has its moments (pun intended). furthermore, i'm a huge aerosmith fan and if they didn't have a problem selling out their song you all shouldn't have a problem with Em using it.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nWow i hate rap and this song really touched me i like how he says \"it's fucked up ain't it, how we can come from practically nothin'\r\nto bein' able to have any fuckin' thing that we wanted\r\nit's why we sing for these kids that don't have a thing\r\nexcept for a dream and a fucking rap magazine\" I like how it gives kids hope and that you can go from nothing and become as popular as he is, This song it jsut fucking great!\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\ni really don't like most rap but WOW! this song is amazing! the lyrics are so raw and real and just hits you! this song is awesome! eminem's awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nEMINEM IZ SO HOTT!!!! ANYHOW, THIS SONG ROX!!!!! ILUV HOW EM JUS STRAIGHT UP SAYS WHATS ON HIS MIND, I DONT KNOW OF ANY OTHER RAPPER THAT SAYS WHATS ON THEIR MIND!!!!!!\r\n                          LYL MARSHALL\r\n                             ~shelby~\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nI love Eminem... not as much as Green Day. But you know. This song is my favourite track by him. Eminem rocks. My parents don't allow me to have his CDs but what the hell I'll just buy them secretly. \n\r\nEminem is the rapper version of Elvis Presley. He'll always live on.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nI love Eminem... not as much as Green Day. But you know. This song is my favourite track by him. Eminem rocks. My parents don't allow me to have his CDs but what the hell I'll just buy them secretly. \n\r\nEminem is the rapper version of Elvis Presley. He'll always live on.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nI didn't read all the comments since there's a couple pages and I've only got a few minutes, but I just have to say Marshall really outdid himself on this. I'm a rocker (Slipknot, Rise Against, Die Trying, etc.) and I still listen to Emi because of this song. People say I'm torn between social classes. Could care less. Great song.\n\r\n\"They call me Raptor. I'm fast and born to kill.\"\n\r\n- Raptor\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\ni am OBSESSED with Eminem, and after this song, well, im even more. this is a really powerful song. it realtes to me on so many different levels.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\ni bought curtain call a few days ago,when i heard the 3rd verse of this song,i just broke into tears...nobody cares about the artists i like(eminem,mudvayne,linkin park,korn etc.)but they're the shit in my eyes.and there ARE people who cry at night,conteplating suicide,even though \"normal\" people find it hard to believe.i wish i could just scream this to everyone who has ever brought me down,so they know how i really feel behind all the fake smiles....\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nas much as i love eminem...\n\r\nHE F-in made it with this song!!\r\nit's just AMAZING!!\n\r\ni'm also happen to be a huge aerosmith fan too...so it just bascially rocked my world\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nI don't like most of Eminem's stuff, but this song is cool.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nI like this song because Eminem actually talks issues in the world, not just sex, drugs and gangs (50 Cent) :z\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nJustarandomteen sounds like Stan a little bit. LOL\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\ndefinately one of the best, if not the best eminem song.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nI LOVE IT!!\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\ni love eminem this song just reaches out to me and \r\ni love everything he does because hes the one person i know who can write lyrics as serious as this and goofy lyrics! but yeah he pulls it off and i love him and this song! MY FAVORITE!\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\ni love this song so much.\n\r\nthis song means that parents always blame eminen for how fucked up their kids are, when it's not his fault because music can't control them. it's their decisions to be that way.\n\r\n\"They say music can alter moods and talk to you \r\nbut can it load a gun for you and cock it too? \"\n\r\nis my favorite quote. it's pretty much telling you the meaning of the whole song.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nits, only the unholy, only have one homie, only this gun, lonely, cause dont anyone no me\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\ni've heard this song hundreds of times, but i was listening to it the other day and the bit in the third verse, the 'that's why we sing for these kids that don't have a thing' part right to the end, just made me fucking cry so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nHard times. My life's story. Not quite how it's explained in the song but, I can relate. Not like those fake people who seem to wish they knew what hard times were like. When I say fake, I mean just act like the person you really are. Don't try to be something/someone that you are not. It's pointless. Clothes, money, really any material things don't make you who you are, it's what you go through in life and how you treat people. Many lost souls out there. This, to me is a shout out to realization, hope, and corrupt minds/politicians/average selfish greedy peole.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\neminems best song bya country mile i mean compare this to the new song we made you i mean thats just him beig outrageous for the mere sake of it this on the otherhand is extremely powerful and doesnt have that annoying accent \t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nman.....im such a HUGE fan of eminem....i mean i listen and soak every one of his songs.....\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\ni listen to mostly death metal bands like cannibal corpse, but this is the only rap song i will listen to\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\n\r\nIf I'm such a fuckin menace this shot doesn't make sense B? I think it's pete... And if it is pete, who is he? I've always wondered that, I've heard that he is lainey's dad, or kims brothe in law\n\n\r\nAnybod wanna help? \n\n\n\n", "comment_112": "\nI'm going out on a limb by saying this but Eminem is the Conor Oberst of rap music. This song and \"Going Through Changes\" proves it.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nattention all idiots who say \"these lyrics are so wrong, heres what it should be\" and either A) post some bullshit or B) copy-paste what's already up there, STOP! your F*CKING STUPID\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nhaha eminem is a FUCKHEAD anyone could SPEAK one of his songs or write one for that matter. it makes me sick to think that he can jabber on about nothing with a catchy beat in the background and its called a 'song'.  he RUINED this song, aerosmith kick that shit heads ass.  just shows that it takes little talent to make it in the pop charts...and to quote wierd al yankovic, eminem 'sounds like a 12 year old girl on helium'\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nPete Guerrera was his principal.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nthis song to me is just saying that when ever you are depressed you always put rap songs, like in the part \"'Til they sit and they cry at night, wishing they die\n'Til they throw on a rap record\" and its also saying that, just because you dont have money or anything now doesnt mean when you grow up. like in the part \"It's fucked up ain't it, how we can come from practically nothin'\nTo bein' able to have any fuckin' thing that we wanted\"\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nbad listening, its \"but everybody just feels they can relate to the words of a motherfucker they can be great or they can be great, or even worse they can teach hate\"\t\t\t\t\n\t\t\t\t\n\n"}