{"comment_0": "\nthis is an awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI AM this girl, right now. This explains my relationship with this guy I've been with for a while. I think it's disproving what love songs say love is really like, and the stereotypes of what people think relationships should be like. Opposites attract, yes. And most of the time real soul mates, if you believe in such, are really so much alike and so different, and that's how love works. And people may think you're a weird couple, but they don't understand love as is and how it works. Fairy tales don't work that way. There's not always happy endings to the story (especially if you've read any of Grimm's fairy tales). Love songs are more of an exaggeration of what people think real love is like.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthis song totally speaks the truth....everyone tries so hard to prove they're in love but then there are people, like the ones in this song, who are simply in love and can make fun of anyone!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song is pretty much about me and a girl i've been talking to for awhile now. The relationship is so perfect but it's not perfect like all the movies and songs say, it's perfect in it's own way. Our own way.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n\"She's my lunatic and I'm her psychopath\"\n\r\nI love it. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI love this song.  Its so paradoxically romantic.  Its about the ridiculous, sparkly, happily-ever-after definitions of love that we subject ourselves to, and the acknowledgement that we're all screwed up and real love is what you make it to be.\n\r\n\"and all this only matters if we listen anyway.\"...\"You're crazy and I'm crazy about you.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song strikes a chord with me, I've been told that my partner and I don't have a conventional relationship. People don't understand our dynamics sometimes but it works for us, we're happy and that's all that matters.\t\t\t\t\n\t\t\t\t\n\n"}