{"comment_0": "\nIt doesn't surprise me that people would really turn this toward religion. As against religion as Maynard or the band may be, i don't get that from this song.\n\r\nBeing someone who struggled with different addictions i can definitely relate to every line in this song. \n\r\n\"There's a shadow just behind me,\r\nShrouding every step I take,\r\nMaking every promise empty,\r\nPointing every finger at me.\"\n\r\nDrug/Alcohol addiction promises alot but there is always a price. People get high to feel good. However, You will feel empty when you aren't high, but you will be judged when you are. Hence the reason it makes \"every promise empty and pointing every finger at me\"\n\r\n\"Waiting like a stalking butler\r\nWho upon the finger rests.\r\nMurder now the path called \"must we\"\r\nJust before the son has come.\"\n\n\r\nAddiction stands like a butler that follows you and like a butler it promises to help you through your day and the analogy of the butler on the finger as a way to use. Alot of drugs will lay on your finger especially if your snorting.\n\r\n\"The path called 'must we'\" references to me the \"Rules of the world\". Kind of a Damned if you do Damned if you don't kind of thing. Addictions will tell the user that they need to not be concerned with what \"needs to be done\". Just sit back and use/drink/smoke/whatever.\n\r\n\"Jesus wont you Fucking Whistle\r\nSomething but the past and done\r\nJesus won't you Fucking whistle\r\nSomething but the past and done\"\n\r\nReaching out for answers but feeling like your past is the reason you won't ever find forgiveness or peace.(I mean come on how many of us have felt the negative effects of a night drinking/partying/smoking/whatever and gotten sick and cried out to God even if you don't believe he exists. \"God if you get me out of this i'll never drink again\".)  Asking \"Jesus if you are real all i want is a whistle\" or \"God if you are real now would be the time to show it\".\n\r\n\"Why can't we not be sober?\r\nI just want to start this over.\r\nWhy can't we drink forever.\r\nI just want to start things over.\"\n\r\nThis is the argument every person has at one time or another during their time of addiction. (if you haven't then congrats you are the first i've ever heard of.)\n\r\n\"I am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\nJust enough to bring you down.\"\n\r\nThe reality of what our addictions bring in the end. And i'm not talking about the recreational or social users, i'm talking about the ADDICTS who need it. Those who cant function in their day without whatever their addiction is. (i'm not condemning, i was there at one point too and i know how that battle goes.)\n\r\nSo there's my take. it's all based on personal experience so i could be way off. I'm not personal friends with the band so obviously i can't say this is what they meant, but when i listen to this song, this is what it tells me.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nMaynard creates a character that epitomizes self hatred.\n\r\nThis song to me paints a picture of the loop this man gets caught in, where he hates himself, and absolutely wallows in it. Instead of looking for change, he persists in this stubborn cycle of nostalgia and depression. He just wants to start it over, but he's too fucked up by now to do it.\n\r\nThis is one of the only Tool songs that i don't see the \"light at the end of the tunnel\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nAs numerous people have said before, yes, the chorus is a double-negative. \"Why can't we not be sober\" is the equivalent of \"Why can't we just be drunk\". I don't know if anyone else said this already, but I think Maynard was being clever with this song; the narrator is a drunk and a selfish hypocrite. Yes, he is an alcoholic. The shadow behind him is his CONSCIENCE. It follows him everywhere no matter how much he drinks and \"points every finger at him\" (AKA he knows he is responsible for his own faults, but will not accept it). \"I just want to start this over\" refers to his excuse for drinking, he wants to lose himself in the liquor and \"start over\", or in reality act like all his problems don't exist. He knows he is just a worthless liar, and is not willing to do anything about it. Everyone who has ever cared about him, he only made their lives more complicated by causing them the pain of watching his addiction consume him; they trusted him to take care of himself, but he let them down (trust in me and fall as well). The people who loved him watched as he destroyed himself (I will find a center in you, I will chew it up and leave), and despite numerous attempts at rehab, no matter how good things looked, he always reverted back to drinking (I will work to elevate you, just enough to bring you down). \"Trust me\" is a contradiction to what he clearly says earlier (trust in me and fall as well), he tells other people to trust him, that he can take care of himself, when clearly he cannot. \"I want what I want\" reinforces how selfish he is, he doesn't care that he's hurting others by hurting himself, he wants to drink and he will continue to do so. Its a sad story in my eyes. There's lots of people like that in real life I think. Of course this is just my interpretation though. All music is interpreted differently by different people.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nit can also be another Tool attack on organized religion, asking why people can't be sober and think for themselves\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nWow, all the irony and paradoxes aren't gonna get you anywhere Maynard.  The speaker feels that he is always being blamed by others for everything he does wrong.  And obviously he doesn't think much of himself.  \"Why can't we not be sober?\" has a double-negative.  Simplify it-- 'why can't we be drunk'-- he doesn't want to be sober and think, he wants to drown the problems.  (Not that the song endorses alcoholism or anything.)\n\r\n\"Jesus won't you fucking whistle/something but the past and done\" is a rhetorical question.  It asks higher powers for help for the present and to come.\n\r\nAnd I don't hear any whispering.  Have I been listening to the song too loud?\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nWow!!! first thing's first: this song doesn't consult or insult any religion at all.\r\nNow: Maynard's only saying that we are all faulted and no matter how hard we try to look and become sober we're still filthy, hopeless, lier and not to mention fake (throughout a major fuck up) maybe not from the outside but from the inside....\r\nThe worst part is: We're so blissfully ignorant that we dont realize it has gone too far and now there's No Time to Start Over....\n\r\nMaybe I'm wrong but this is the theory that came in my head when I heard *Sober*\r\nThank You.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\"i will find a center in you/ i will chew it up and leave ...\" in this verse maynard is mocking something that attacks the core of your being while giving you a false sense of security and happiness and fulfillment.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe song seems to be about a self-loathing drug addict who wishes he never got himself into the hellhole he is in, is begging God for help, and now loathes every moment he isn't high.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nBesides all the possible interpretations for this song, i believe its meaning is the same as Forty-six & 2's. It's about Jung's Psychological theory of the \"Shadow.\"\n\nIt's pretty obvious in the firsts verses \n\"There's a shadow just behind me,\nShrouding every step I take\"\n\nLater on he says\n\"I am just a worthless liar.\nI am just an imbecile.\nI will only complicate you.\nTrust in me and fall as well.\nI will find a center in you.\nI will chew it up and leave,\nI will work to elevate you\nJust enough to bring you down.\"\n\nHere he talks about how people and himself are victims of his shadow, dealing with his consciousness and ego.\n\nI don't know, this is just another way of interpreting this awesome song. And this is what i love the most about music, specially Maynard's..\n\n(sorry about my terrible english too)\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThe whispering in the song is maynard saying \"turn that shit down\" which is seemingly ironic because you have to have the song very loud to hear it and it is still very failt in the background, the first time you ehar it you may think it is a neighboor or someone far away talking\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nLet's consider that this song is about sex. Rather than being \"sober\" from alcohol, it could mean from the sexual urge.\n\r\nIn the first verse he talks about this urge. \"Every promise empty\" as in empty promises to women. The urge haunts him like a \"stalking butler\" that makes him do all sorts of sleazy things.\n\r\nIn the second verse, he warns others against himself  while he is under the influence of this urge. This is evident in every single line of the verse. Especially so in \"I will find a center in you\" -- straight up innuendo right there. \"I will chew it up and leave\" refers to one night stands. \"I will work to elevate you just enough to bring you down\" -- again, get the girl emotionally worked up just to get sex and leave her upset.\n\r\nThat being said, the references to Jesus and Mary make perfect sense. Christianity places an emphasis in chasity, further personifying the speaker's sexual urge as a demon. In other words, faith places a guilt on the speaker.\n\r\n\"Murder now the path called 'must we' just before the son has come\" -- sex is something \"we must\" do, are we supposed to give it up in the name of Christianity, just because the son has come?\n\r\n\"Jesus won't you fucking whistle\" -- whistle and ignore the promiscuity, to being indifferent to it rather than condemn it.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think it's about falling back on alcohol when something goes wrong and all seems lost and hopeless and there's no one to blame but yourself not even your religious figures have the answers for your faults. (Surprised?) Feeling as though life is too far gone and he just wants to start over, which is impossible so best next thing is just forget about it.\n\r\nWaiting like a stalking butler as if it's there to solve every problem he has.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nOk seriously, I'm going to lose faith in humanity if another site UTTERLY FAILS to hear the basic English language as spoken.\n\r\n1. It's not \"waiting like a stalking butler\" it's \"waiting like a stalking burglar\" - butler's don't stalk\r\n2. It's not \"Jesus won't you fucking whistle\" it's \"Jesus, want to fucking whistle\" - like a god damn hot kettle of water\n\r\nInterwebs, please, for the love of all that is good and sane use a little deductive logic on this stuff. Please, admins, someone correct these two lyrics. It's embarrassing.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is just awesome, both in the kewlness and wicked shit. It reflects my own opinions about religion. I thought that was the meaning behind the song in the first place. Like no matter how hard you walk the thin line of \"holiness\" your still faulted. There's always someone \"pointing\" at you. The sober part is like, \"Wake the fuck up!\" kinda thing. The one part I have hard understanding is... \"something but the past and done? \" part. Anyone have any ideas? Is that like others bringing up the past to taunt you????\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nyeah....retards all the way....:)\r\nJust listen to Bill Hicks and u'll know....\n\nyoutube.com/…\n\n\n", "comment_15": "\nThis song has a lot to do with Maynard's military history as an cadet at the United States Military Academy Preparatory School. For instance, consider some of the verses such as:\n\r\n\"There's a shadow just behind me,\r\nShrouding every step I take,\"\n\r\nThis is referring to his military schooling such as Basic Training and the people he would have had to deal with there.\n\r\nRead these lyrics:\n\r\n\"Making every promise empty,\r\npointing every finger at me.\"\n\r\nThese lyrics are saying that he had to deal with a lot crap from his officers while they trainied him to become a soldier.\n\n\r\nSo, in a lot of ways, being in the military is like not being sober, it is an overwhelming state of mind to be in. This song was written not too long after he left his career in the army, and it is about reflections on life in the military and being happy about being a civilian. \n\r\nBut you can look at it from the other way too. Who are we to be sober? Being sober is just a state of mind, and there are many states of mind. Shouldn't we experience other states of mind as well? We typically experience sobriety when we are clam and relaxed. Maynard may not have experience a calm and relaxing environment in the military. Perhaps he is distinguishing states of mind depending on situations. We sometimes have to go through a lot of situations, and perhaps, in an effort to keep the human population under control by our government, we are encouraged to aspire to become sober. In this sober, being sober is a means of population control.\n\r\nWe are left without answers, but at least we can now distinguish between different situations, environments, and states of mind.\n\n\n\n\n\n", "comment_16": "\nDefinitely about addiction and how it lets everyone around you down, hurts your loved ones\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI think this song is about someone with a personality disorder, telling traits at each line..i mean borderline or narcissitic personality disorders.(BPD-NPD)\n\r\n''There's a shadow just behind me,\r\nShrouding every step i take''\n\r\nhe talks about his diseased character, his feelings of emptiness like a shadow behind. and he cannot live his life normally becouse every step he takes is related with the feelings and stress coused by NPD/BPD\n\r\n''making every promise empty''\n\r\nas he goes his way, the things he does just for himself cant make him feel better forever. this is only a temporary satisfaction until he comes acroos anotherone who he thinks is overly critical again* \n\r\n''pointing every finger at me'' \n\r\nthis is both about the people he this they are overly critical, and also about his isolation. he feels he is not one of them\n\r\n''Waiting like a stalking butler\r\nwho upon the finger rests.''\n\r\nit is again about his disease, his inside world and instincts\n\r\n''Jesus, won't you fucking whistle\r\nsomething but the past and done?''\n\r\njesus here means the true sight of himself, he knows deep inside that he is not as precious as he shows himself to other people. he doestnt want to remember about his past and what he has done which indicates his reality. he denies his cravings for fear of \"losing face\" .\n\r\n''Why can't we not be sober?''\r\n''Why can't we drink forever''\n\r\nalcoholism and other addictions are the result of his personality disorder:the result of self-medication to deal with the emotional pain of his disorder. it takes his mind off his inherent limitations, inevitable failures, painful and much-feared rejections, and the grandiosity gap - the abyss between the image he projects (the false Self) and the injurious truth. drinking  relieves his anxiety and resolve the tension between his unrealistic expectations and inflated self-image \n\r\n''I am just a worthless liar.\r\nI am just an imbecile.''\n\r\nhe talks about his pathological lying trait which is also common in personality disorders.\n\n\r\n''I will only complicate you.\r\nTrust in me and fall as well.''\n\r\nthese are the words that he cant say out loud to his new victims. these is how he thinks when he fools someone.\n\r\n''I will find a center in you.\r\nI will chew it up and leave''\n\r\nthis is obviously about manipulating trait of his personality disorder. that he is not in a real relationship with others, just using them for his temporary satisfaction.\n\r\n''I will work to elevate you\r\njust enough to bring you down''\n\r\nand this is another typical behavioual trait of especially borderline personality disorder. they see everything black and white : splitting, in which a person or thing is seen as all good or all bad. that something which is all good one day can be all bad the next, which is related to another symptom: borderlines have problems with object constancy in people -they read each action of people in their lives as if there were no prior context; they don't have a sense of continuity and consistency about people and things in their lives. they have a hard time experiencing an absent loved one as a loving presence in their minds.\n\r\n''Mother Mary won't you whisper\r\nsomething but what's past and done''\n\r\nthis is probably about the mother figure , the superego again judging him.\n\r\n''I want what i want''\n\r\nthis tells lack of  empathy. he is only he  is unwilling to recognize or identify with the feelings and needs of others.\n\n\r\n''turst me..trust me''\n\r\nthis is his wiling about finding new victims who feed him.\n\n\n\n\n\n\n\n\n", "comment_18": "\ntheir music vids are kinda creepy to sum ppl....but to me...this one....is sad,it doesnt scare me at all cuz EVRYONE pretty much has a special box and that poor little creature has nuthing in its box. its sad if yoou think about it. he has NO memories in his box,nuthing. but ya i LUV this song. i can go to sleep with this stuff on,idk just sumthing with his voice makes me relaxed. but hooker with a  penis is my #1 song this is my second fav.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis song is obviously talking about the unconscious mind. In the music video the creature has a box that it wants to open and look into. The box represent the unconsciousness. Now the part saying \"why can't we not be sober\" is referring to why can't we always be looking into our unconscious mind. Instead we must dwell in this form of reality through which our unconscious mind portrays. And then the song starts saying\n\r\n \"I am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down\"\n\r\nThis is describing what would happen if we look into our unconscious mind. It will lie to us it is an imbecile because it is your unconscious mind the things you see in it will only complicate you and not make any sense at all. if you believe in what you see in the unconscious mind it will bring you down because all of it will be fake. it will find the most important  meaning for you and chew it to shreds and drop you down as it lifted your insight.\n\r\nAnd so when we are not sober we would always be dwelling in our unconscious mind and it would eventually be our only form of reality since we would lose our knowledge of the reality which we experience now.\n\r\nWe see reality through what our unconsciouness portrays through our eyes. So we see reality in a \"straight line\". If we look into our unconsciouness we will see all the possibilities our reality and humanly existence could have and we see all the outcomes of what could have happened in this reality we look at a part of history and see every single possibility and other thing that could have occured in that time and existence. So we basically see everything that happens EVER or could have happened. we see all of time and its possible outcomes.we see everything that is and could have existed or happened.\r\nso if we were to not be sober to this whole knowledge base existence or whatever this feeling would be called then our own reality wouldn't be holding us down to only one outcome of time and existence.\r\nwe see every why if possiblity outcome and answer.  What our reality and we we expierence everyday is only one of our outcomes of life and time existence. But in our mind we experience ever point of reality and outcome of time and existence.\n\r\nNow that is just my theory of sober. There were also partial meanings to other songs in here.And i think this is why why tool sings. Because somehow their songs open up our mind and we each can perceive a different meaning in each of their songs.\r\nIf you did not completly understand this then you obviously have a closed mind and will never experience what is listed in what i wrote up above. I got this theory from entering my unconscious mind.\n\n\n\n", "comment_20": "\nI guess everyone's fair in not wanting to take the title literally, it almost seems too simple coming from Maynard, but truly the title fits what I feel the meaning to be very justly. Being an addict myself, this illustrates the emotions, the hollowness, and that sinking desire/need to pull back to your best of chemical friends. No one wants to be one, and great people, sometimes surprisingly the deepest, most profound ones this Earth has housed, get taken by a substance. A voice comes to you, worded here as a \"shadow\" towards the beginning, changes you, fits you into this new mutant and soon enough you feel a bit like Dr. Jekyll. \r\nThe chorus enforces this point bluntly, after Mr. Hyde is more you than you, the thought of going back to what you were before feels distant and very very impossible. Wouldn't it be easier to just start over?\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI think this song uses religion as an example of how we should follow our own intuition, and not anything else that gets in the way of that (like religion).  Instead of believing in old dogma, we should be thinking for ourselves.  Looking inward for the answers.\n\r\n(It's interesting to note that I think you could include the ego as something that gets in the way of our intuition.  It feeds us lies about ourselves).  \n\r\nThe 'shadow' and 'stalking butler' describe religion (or the old dogma).  It's like a shadow because it is always with you, dictating your decisions.  Any religion can be a 'stalking butler' that takes care of your every need, but rapes you of your own ability to think.  Further, he's saying that religion murders the 'path of 'must we''.  I think this means that before the 'son' (Christ or any other old diety) came, we thought in a world of 'must we' or possibility...must we do this?  must we do that?\"\n\r\nHe goes on to ask Jesus and Mary if they can tell us something other that what is 'past and done.'  Is there anything new that they can give us?  Again, I think he's talking about religion as an EXAMPLE of anything that gets in the way of your intuition.\n\r\nI think 'Why can't we not be sober?\" simply asks the question, \"Why can't we just drink in the new life of possibility everyday?\"  Why can't we just start over, and think for ourselves?  Why do we have to be 'sober' (or follow the rules) like everyone else tells us we should?  Why can't we live by the beat of our own drum?  Why can't we be 'drunk' in the present moment?\n\r\n'I am just a worthless liar' to 'Trust me' is from religion's voice.  It's basically telling us the qualities of religion (worthless liar, imbecile, a complication, etc.).  Trust in it, and you'll fall down.  Religion will find a place inside your heart (instead of your own intuitive voice), and it will 'chew you up and leave.'  It gets inside, chews you up, and leaves you empty.  It pushes your divine self aside.\n\r\nAt the end, he concludes, 'I want what I want.'  Meaning, I want to do whatever I want to do.  I don't want anything to tell me otherwise.  My intuition is correct, and it will guide me.  My inner soul (and not the external world) will guide me.\n\r\nTo me, this song is very much like Lateralus.  It encourages us to feed our will to live in the moment.  Applying old laws and regulations from other people withers away our own ability to decide what we want to do with our lives.  I definitely don't think it's bashing religion.  It's bashing anything that gets in the way of us believing we are divine creatures that can do anything our inner voice tells us.\n\r\nThat's my two cents anyway :)\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nWe used to play this with our band, just to see who were musicians, and who were \"regular\" crowd.\nThe regular crowd went to the bar when we started playing this, the musicians came toward the stage.\nStill an awesome song to play, just because of the emotions we could put into it.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThe over analysis here is ridiculous. It's an addict struggling to deal with what they've done to their life, wishing it could be different but also wanting to continue on the same path.\n\r\nWhy the hell does everyone in this society think that if they see things that aren't there, they're insightful? Usually the obvious is the correct answer. 'Oooh he mentions Jesus and Mary, it must be about religion' ... idiots\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis song does have a religious baring. Look at all songs on undertow majority of songs are about religion\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is good. This was the song that got me into Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nThis agains is another one fo Tools all time greatest songs. i think it is trying to say soemthing about being blamed for things and jsut knowing that all u do to people is cause them pain and that we are all stupid:)\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis is there best ever. The song is saying how the main character of the song has a drug/drinking problem. I think it is a message saying that because he has this problem, people aren't trusting him anymore and he's using a low self esteem to beg for forgivness from god.\r\nThat is my theory.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nthroughout the song there is whispering/screaming and i've never met anybody that could say what maynard is saying. not even the radio dj of 102.1 The Edge knew what it was. if anyone has figured it out post a msg here, thx.\nthe-lob.cjb.net\n\n\n", "comment_29": "\nI do not agree with most of you saying that \"Sober\" is Tool's best song. It really isn't. All their albums have GREAT songs, but this (to me) doesnt qualify as their best. My favorites are \"The Patient\" off of Lateralus, \"Ã\u0086nema\" off of Ã\u0086nema, \"Undertow\" off of Undertow, and \"opiate\" off of Opiate.\r\nGreat song nontheless tho.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nWow, all the irony and paradoxes aren't gonna get you anywhere Maynard.  The speaker feels that he is always being blamed by others for everything he does wrong.  And obviously he doesn't think much of himself.  \"Why can't we not be sober?\" has a double-negative.  Simplify it-- 'why can't we be drunk'-- he doesn't want to be sober and think, he wants to drown the problems.  (Not that the song endorses alcoholism or anything.)\n\r\n\"Jesus won't you fucking whistle/something but the past and done\" is a rhetorical question.  It asks higher powers for help for the present and to come.\n\r\nAnd I don't hear any whispering.  Have I been listening to the song too loud?\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nok i believe rossross now. i have heard the screaming, wailing, and whispering in the background. put on some headphones and listen to it loud. after the \"trust me, trust me, trust me\" bit and into the chorus, you can hear a muffled grunt in the background. this is the first time i notcied it. i thought it was someone calling me but when noone was there i rewound it and listened to it again and it was there. after that i could here the whispering and screaming in it. well done rossross.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\ni also ar=gree with rossross.. I've always heard the \"trust me\" thing. Never thought it was hard to heaaar since i only listened to it on Launch.yahoo.com, and only wehn i could blare it....\r\nG2G!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI still think its about how religion brainwashes people...think about it:\n\r\nin our modern society its considered the normal and right thing to do to belong to some religion, making the person seem normal and \"sober\", if you will\n\r\nthen Maynard asks \"why can't we NOT be sober?\", meaning why can't we not be like everyone else and do things our own way, and beleive in what we want to\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nAbout an artist? Haven't heard that one, I always thought the song's meaning was pure and simple - just getting along in this world and stop antagonising each other.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\ntool is my fave band of all time. this song is so powerful to me. i understand every lyric becuz i have dealt w/ addiction and asking all the \"whys\" \t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nFinding a center in someone and chewing them up and leaving just says that he's lost respect for humans as a whole, and he's hating and sick of where hes at right now and he wishes he could \"start this over\"\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nhow about, like many Tool songs, that idea of constant corcles of abuse and pain. \n\r\n\"I will only complicate you. \r\nTrust in me and fall as well. \r\nI will find a center in you. \r\nI will chew it up and leave, \r\nI will work to elevate you \r\njust enough to bring you down\"\n\r\nConstantly I will do you harm, yet I will also heal and care for you. I will chew up your centre, yet I need you as mine. Trust me because I am all that you have\r\n\"Jesus, won't you fucking whistle \r\nsomething but the past and done? \"\r\nBut it needs t end. Why am I trapped in this cycle of pain and abuse of wahtever (woman/aalchohol/drugs/religion)\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nIve heard the theory that it wsas about an artist friend drinking. But i personally dont believe it. I dont think Maynard is the type to fully tell what a meaning is. He seems the type that would hide it... let you decide what it means.\n\r\nthe line \"why cant we not be sober?\" doesnt mean that they cant be sober, its the fact that they ARE sober, and cant NOT be, but they wish they could.\n\r\nI personally think the song is about some sort of relationship whether its friendship, love, or family. It seems like its his regrets that seem to be haunting and plaguing him. And he just wants to change it so it all stops.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nMeredith you are stupid.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI think this song is asking why we have to live our lives the way we do (going to work, school, schedules) I think he wants to go back to the way it was suppose to be where we're all naked and carefree. \"just want to start this over\", I also think he saying God is watching us and \"pointing every finger at me\" he wants Jesus to stop it all and go back to the way it was...\"murder now the past must we, just before the son has come\"(Jesus)..and the part about, \"Jesus won't you fucking whistle\" I think he'd rather sleep and drink then the way it is now...\r\njust my thoughts...\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\ni think this song means what ever we think of it meaning...everything that one of you guys siad makes sense...but only to the person who sees it. Thats what makes art. \t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\n\r\nI just want to start this over. \t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nTo me this song is just about lieing to others, this could be because I have done it a million times. I have lied to my parents about my school marks and about smoking, \r\nI told them I was doing great at school, and that I didnt smoke. I was elevating them, they were proud of me. I was making them feel good just to bring them down again. I was not just lieing to my parents but also to myself. 'Trust in me and fall as well', and then the explantion of, Mother mary won't you whisper, something but the past and done. I was looking for new hope, and I wanted to forget the past forget my bad grades. I was praying for better, to me this sentence means pls give me hope but don't talk about the past and don't talk about what is done. Why can't we not be sober isnt a double negative it just sounds better, many artists use double negatives but mean one negative. To me it means why cant we be honest, why do we have to lie.\r\nOn the oter hand if I didnt lie my parents would be destroyed by the grades I had so I was protecting them, 'Why can't we drink forever' I wanted to lie to them, so I would not be punished etc.\n\r\nso that is the meaning of this song to me and to me it is a very special song\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI think that \"whispering\" may be coming from the instruments because of the way they play.  I heard it too but it doesn't sound like its actually saying anything.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThere are not only lyrical depths to almost all tool songs, there are musical depths. In a whole lot of tool songs, whispers can be heard. Just another way tool adds mystery.\n\n\n", "comment_46": "\nThis is such a mean song... maybe I'm just too feminine, but I couldn't IMAGINE saying anything this song says to someone. It kinda sucks, it pains me to listen to this song, but the music is so lush and pretty for such a nasty bitter song.. anyways if yuo think I'm a little fairy or what not I don't blame you, just getting my two cents in...\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\ni really like this song, i think that is screams such power when u listen to it. when you get into the lyrics its quite surreal, i mean its like the person is trying to move away from alcohol, but they cant live with out it. so its very contradicting, very well put together....i wouldnt have a clue what the refernces to jesus and mother mary mean though. but whoever the song is about cant escape their addiction, and it is a real cry for help\r\nthanx for listening, i am prolly really wrong, but yeah..\r\nps...i went to see tool play live in perth and it was sooooo good!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI've read in many different places, and I've heard it myself and I agree. The whispering is supposed to be Maynard saying \"turn that shit down\". Like IAMTHEPATIENT said.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\ni was told that it was written for one of maynards friends that could only write or paint or do what ever he did when he was drunk of high i bet im wrong im stating what i was told my 2 cents\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nfuck man, I was reading all of the things you people have said.... I got half way through, but now I have this real big head ache. \t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI think it is really obvious that Maynard is talking about a friend of his that is an alcoholic artist. â\u0080\u009cThere's a shadow just behind me, \r\nshrouding every breath I take, \r\nmaking every promise empty, \r\npointing every finger at meâ\u0080\u009d I think he is talking about drinking there. Shadow meaning his addiction, pointing every finger at him would mean every one is blaming him and not trusting him because he is an alcoholic. â\u0080\u009cMurder now the path called â\u0080\u0098must weâ\u0080\u0099â\u0080\u009d I think he is talking about how his friend doesnâ\u0080\u0099t think drinking is something to frown upon. While society is blaming problems on drug and alcohol use, he has an amazing gift that is brought out by the same thing society shuns. â\u0080\u009cJesus, won't you fucking whistle \r\nsomething but the past and done?â\u0080\u009d I think he is saying how God made â\u0080\u009cmiraclesâ\u0080\u009d happen in the past (according to the bible) but he doesnâ\u0080\u0099t save us now. Obviously, â\u0080\u009cWhy can't we not be sober? \r\nI just want to start this over. \r\nWhy can't we drink forever? \r\nI just want to start things overâ\u0080\u009d he is talking about drinking and being sober. And the last of it is about him feeling worthless because of his addictions and he feels manipulative. \n\n\n", "comment_52": "\n...At any rate, a great song.  Personally, I like the cover that Staind did of it....   Aaron Lewis has a simply amazing voice that's undeniable.  Maynard is good, yes, but I like Lewis better...  Still a good song...  Definitely.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nRight now, this is my favorite song of all times, well maybe tied with \"Fallen\" ~ Ill Nino, and \"Epiphany\" ~ Staind\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThe Staind cover (live) is so incredibly powerful...  The crowd and Aaron's voice... \t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nthe staind cover can't be as good as the original.  I havent heard it yet, but there's no way aaron lewis can do it better than Maynard.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nAfter the \"trust me,trust me, trust me\" part, the whispering in the background is just echoing of \"just be sober\"\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThis is how I see things...The first paragraph he is explaining about God and how He is pointing a finger at him from thousands of years ago telling him not to do that...Then in the second he is questioning God about drinking and following all the said ways...why cant we not be sober?...Then in the third he is talking in the place of God...I am just a worthless liar...I am just an imbecile... \t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI had my own idea about it, but after reading the drunken artist friend definition, I kinda agree with both, if possible. But now to give mine.\n\r\nI feel that this is a multi-stage relationship between someone and how they feel about themselves and what's going on inside of them. It starting with how he has something haunting him, making him feel out of place about something going on inside, and after asking others (or more particularly, Jesus and Mary) he asks \"Well why do I need to listen to you anymore? Why CAN'T we get drunk?\", and after all the questioning he gets so lost in himself and everything that he can't believe anyone, including himself, so he wishes he could \"just start things over\". As for the whispering, it is him saying \"Trust me\", which is his old way of thinking trying to catch back up with him.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nGreat song. One of my favorites. (Though I still like \"H\" and \"Ã\u0086nema\" better?).  I think this song is that the main character has several problems, so he drinks, but he wants to stop annd can't. The \" . . . whistle/whisper \r\nsomething but what's past and done.\" to me means that God, Jesus, and/or Mary shouldn't just talk about sins and things that happened in the past, but instead try and help the future. It's no good to just say what happened in the past. \n\n\n", "comment_60": "\nsobriety = believeing in god.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nSometimes, when i lose my keys to the house, i have to poop in the backyard...\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nto BoneDaddy up there - \r\ndon't assume so much. the song is definitely about alcoholism. maynard has said so. he has also discouraged taking any meaning you want from his lyrics. i'm sure he would very much prefer that you try to find the real meaning instead of associating the song with something he may be totally opposed to.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nhey, bonzo, are you sober?\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nto people who keep referencing drinking and drugs to this song...OPEN YOUR MIND....drinking is only a small part of the meaning to this song....when he talks about Jesus and Mary...that obviously has nothing to do with getting drunk...\r\nreligion is a huge part of this song (obviously) \" I will work to elevate you\" someone up there said that's an obvious drug reference: anything can elevate you to bring you down...ex: he could be talking about religion, money, \r\nhappiness, failed relationship, himself...it could be about anything...JUST open your mind...\n\n\n\n", "comment_65": "\nthank you koolkris!  \t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nI love tool! The best thing about tool is the very rarley tell you what was going on when they wrote a song or what the song is about. They leave it up to you to get a message out of it if you choose. All of the tool songs are so deep and could mean anything to anybody. Tool are one of the very few artists now days that get you thinking about a song. To me this song is about faith and trust and hiding yourself away from what hurts and trying to erase all the hurt from your self. \t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nThis song kicks so much ass. I am going to see Tool in August and I am so excited!!! Maynard has a kick ass voice and I love him! My brother made me grow up on Tool so I have liked them for a long time, its all he would let me listen to!!!!! TOOL ROXX\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nThis song to me is not about drinking or drug prbolems. I think it is about being Sober from beleiveing in a God or higer power. He maynard says \"why can't we not be sober'' he is not talking about being sober from alcohol he is saying why cant we not beleive in a God.  Thats what i think the song means.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nWell i have to say this is about the best song Tool ever made. And i really dont think 'Sober' has anything to do with alcohol, you really shouldnt take Tool's songs at face value! \r\n   Consider this: (Jesus, won't you fucking whistle something but the past and done?) and (Mother Mary won't you whisper something but what's past and done.)\r\nIts somethin to do with religion. As we all know Tool arent religions best friends. Its like theyre using Marx's statement, religion is the opium of the ppl. And so they ask: Why cant we not be sober?. In other words: WAKE UP! its all a lie. \r\n  Well i might be wrong ofcourse and this is just IMHO, but it all fits in well with the jesus and mary and 'i am just a worthless liar.. i will only complicate u' parts. Any comments?\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nThis was the first song I learned to play on the gutair..so it's special. I agree with drarab for the most part...but I've said it before and I'll say it again..listen and feel. It'll all come to you..and of course noone is going to precive it in the way it was really suppose to be..thats the glory of it all. \t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI think the part that says \"Jesus wont you fucking whistle, something but the past and done\" is pointing out to people who beleive in Jesus, that all this time he has never proven himself on earth to anyone really.\"  A lot of people will probably disagree, but thats just my thought.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nJust saw TOOL live in Vegas on 7/19.  This song was THE highlight of the show.  Check out their website (toolband.com) and find a show near you.  Call in sick and GO!\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\ngood song. great song. BEST SONG EVER. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\ni think this song is about a guy who is addicted 2 drugs and alcohol and every1 is blaming him for things that he does and every1 paying close attention 2 him waiting for him 2 mess up so they can make him feel like an loser and a lier and a imbisel and maynard is pointing out that these people arnt bad that the can drink for ever and why they cant be sober cuz it takes them 2 a place that helps them not hurts them and they shouldnt b blamed or pointed the finger at for that \t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThis is by far the very best song about vampires i have ever heard. think about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nscrew all that shit about some guy being a drunk and wanting not to be if you ever listen to tool for real then you would know that they are quite beyond the average persons perspective. WAKE UP AMERICA stop just tryig to take everything for it's face value and look deper into things like this song for example.  I believe it is about a person who who has lost a very important part of themself or an important person to them and wants to return to the way things were before.  being sober isn't refeing to not drinkin but being inocent when ther person was blissfully happy. this is only my view of the song so to me it's rihgt but you ar free to have you own opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nOK WHAT IS EVERYONE'S OBSESSION WITH VAMPIRES???? IS THERE ANY LINES IN THIS SONG THAT MAY IMPLY OR INDICATE THAT THIS SONG IS ABOUT VAMPIRES??? NO DILDOS.....\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\ni went to theri concert yesterday and they opened with this song so kick ass there show was so cool they rock\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nI'm probably wrong, but i got the idea that5 this song was about being haunted by the past.  \"There's a shadow just behind me, Shrouding every breath I take, Making every promise empty, pointing every finger at me\"  It seems to me that whatever happened in his past (drugs/relationship/alcohol etc.) makes people distrust him and opint to him when anything goes wrong.  The \"Why can't we not be sober?/ I just want to start this over\" part means that while he wants to continue whatever he was doing he wishes he had never started in the first place.  The \"I am just a worthless liar/I am...\" is a warning to anyone who might not yet know him.  He knows deep down that others mistrust of him is well deserved.  The Jesus/Mother Mary part is about how when he cried out to God/society for help all they gave him was a list of the bad things he had done.  This is just what the song means to me.  It's probably totally off base but this is just my 2cents.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nthis song is obviously a lot like most tool songs, i see it is obvious now that i think about it. like in fourty six & 2, he is talking about leaving his shadow behind and free himself to add on 2 more chromosomes, and become the third level of consiousness.  and like in parabola he is saying the body is only a suit for our souls, and our souls can expand the leave the shadow behind. i understand sober was mainly written for an artist that could work very well while intoxicated, but i think maynard in this song is saying once again why cant we just all evolve, or see the world with your third eye open. He is saying \"WHY cant we not be sober\" as a reference that we need to all start to open our third eye.  He also talks about his shadow again in this song, which right there tells he wants to enter the third level.  He just wants to start things over, just become another race. He is also saying, Jesus, Mary, whistle/whisper something, now that all that shit has passed him, and wont phase him one bit, but he is asking them to please push us in the right direction, which is ironic since they are not even real, i love the sarcasm he uses. So, lose your sober feeling, your sobriety in god, and realize the truth. With your third eye open, see what tool sees.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nTo me this song is about a man who is hounded by his past and no one will let him move on.\r\nThe first verse is all about how the things he's done (commited a crime, done drugs; the song doesn't specify) have caused people to lose trust in him.\r\nThe last line of the first verse \"Jesus, won't you fucking whistle / something but the past and done?\" means \"Why can't we move on: stop dwelling on things that have passed.\"\n\r\nThe chorus \"Why can't we not be sober..\" refers to how he is unable to relax now.  No one can feel secure around him enough to be uninhibited and therefore he must always be \"sober\" as well.\n\r\nThe last verse refers to what people think of him.\n\r\nThe wispered \"trust me\" seems to be a cry for help.  The only want of a man who is alienated by society.\n\r\nThe video also refects my interpretation.  The figure has a box heavily chained (his past indiscetions) and he can't keep it closed.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nHey Melancholy61, what country do you live in?\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nI think this song has a very definite flow to it, and that it repeats the meanings found in the songs Ã\u0086nema and Eulogy.  My interpetation of those is that, #1: the world is too messed up to fix, and it would be great if we could just hit the reset button, and #2: People are naturally selfish, so if you put trust in someone, don't be surprised if they use it to their advantage.\n\r\nBelow, I put a section of the lyrics followed by a version that says it more casually, which should show what I think they mean.\n\n\n\r\n     There's a shadow just behind me,\r\n     Shrouding every step I take.\r\n     Making every promise empty,\r\n     Pointing every finger at me.\r\n     Waiting like a stalking burglar,\r\n     who upon the finger rests.\n\r\nâ\u0080\u009cAs I move forward in life, I am burdened by the mistakes of my past, which, like a stalking burglar, lie in wait to make me take the blame and to force me to make empty promises.â\u0080\u009d\n\r\n     Murder, now, the pattern, must we,\r\n     just because the son has come.\r\n     Jesus, won't you fucking whistle\r\n     something? ...but the past is done.\n\r\n\"We must now murder the pattern of life just because the son of God has come back.  Jesus, wonâ\u0080\u0099t you say something?\" (implying that when Jesus returns, Judgment Day has arrived and this world will end) \"...but even that wouldnâ\u0080\u0099t undo my past mistakes.\"\n\r\n     Why can't we not be sober?\r\n     I just want to start this over, and\r\n     why can't we drink forever?\r\n     I just want to start this over.\n\r\n\"Why canâ\u0080\u0099t reality be the way it seems when weâ\u0080\u0099re drunk?  I just want to start my life over.  I wish all these temporary escapes from reality could last forever.  I just want to start my life over.\"\n\r\n     I am just a worthless liar.\r\n     I am just an imbecile.\r\n     I will only complicate you.\r\n     Trust in me and fall as well.\r\n     I will find a center in you.\r\n     I will chew it up and leave.\r\n     I will work to elevate you\r\n     just enough to bring you down.\n\r\n\"I am a worthless liar and an imbecile.  I will only bring you more problems, and if you put any faith in me, I will find out whatâ\u0080\u0099s important to you and try to help you, and then I will use your success to my advantage, breaking your trust and hurting you.\"\n\r\n     Mother Mary won't you whisper\r\n     something? ...but the past is done.\r\n     Mother Mary won't you whisper\r\n     something? ...but the past is done.\n\r\n(since Jesus obviously isnâ\u0080\u0099t listening) \"Mother Mary, wonâ\u0080\u0099t you say something instead? ...but that still wouldnâ\u0080\u0099t undo my past mistakes.\"\n\r\n     Trust me, trust me, trust me,\r\n     trust me, trust me...\n\r\n(This part is a taunt aimed at the person to whom heâ\u0080\u0099s been revealing his plans.)\r\nâ\u0080\u009cSince Iâ\u0080\u0099ve told you exactly what Iâ\u0080\u0099ll do to you, Iâ\u0080\u0099m going to start playing the head games now.  Come on, you fool, take the bait.â\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nHmm. I think the song is about a guy that wants to be drunk so he doesn't have to see the problems of things. But everyone wants him to clean up his act and he doesn't know what to do. He's not a good man when he's drunk, and people tell him he's worthless and not good. But he wants them to see what he sees. Blah, I'm not good at these interpretations...others have much better ones than me...but anyway, back to the song, no one listens to him. He's trying to get them to see what he sees. That's why he says \"Trust me,\" because they're backing away from him. He just wants them to understand. You know, like those drug addicts who want people to \"try it\" because it makes everything better. He turns to God to get rid of his problems, or possibly the people who want him to sober up keep lecturing about God. In the end, when he says \"I want what I want,\" I've said that before. I've said it when I've just wanted to be left alone. Where I just want to see things the way I want to see things, but everyone is trying to make me see differently. I think that's what he's saying.\n\r\nI too, agree that this is one of Tool's best songs. I don't usually listen to Tool, but I've grown to like what I've heard so far. I hope to hear more in the future.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nfungicord........ it says butler not burgler!\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nTHIS IS THE SONG!! I heard this on the radio and I didn't know what it's called but now I do!\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nYou all sicken me. How can you pick a favorite Tool song? Just when you think one is the best, four or five more will pop in your head. And what the hell DrArab? Don't take Tool songs at face value? Then what makes you think \"Jesus won't you fucking whistle\" and \"Mother Mary won't you whisper\" is about religion? Idiot.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nhey in an interview member of tool, i think danny said this song was about an artist the band new who could only perform when drunk so that should clear this up.\r\nne wayz tool is the greatest band ever they are all the most talented at what insrument they play they tell the truth and maynard has never changed despite all his fame he still brings it to us straight up the way he sees it and he's not afraid to say what he believes. DID ANYONE SEE VH1'S TOP 100 BANDS TOOL WAS #92! WHAT  A BUNCH OF IDIOTS\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nI agree with some of the things on here about the song, and how it is that people are basically drukened by the world and forcecd to think a certain way. Just like the organized religion that is involvedin many of peoples lives. Even though I do practice Christianity, I don't attened church, I found it to restricting, and forced you to worship at certain times. I think that one should worship what they when they want. \r\nAlso as people state that they have a favorite tool song, I found that I was saying that for almost every song of their's but for different reasons. Now I just say that I have a few favorite songs due to the message in them, not the music that invelopes with the lyrics. Well peacec and harmony to all, and find what you are looking for in life, because it just gets easier from there.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nVH1 sucks ass. Don't watch VH1. They're commy bastards who try to feed us bullshit like Norah Jones.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nJust a thought....ive been listening to this song all day trying to figure out just what it meant.  The best i can come up with is that it is about a person who has done something terrible. The, \r\nThere's a shadow just behind me, \r\nShrouding every step i take, \r\nmaking every promise empty, \r\npointing every finger at me. \r\nWaiting like a stalking butler \r\nwho upon the finger rests. \r\nMurder now the path called \"must we\" \r\njust before the son has come. \r\nComes across in my mind as a man filled so heavily with guilt that he can hardly function in his life. Of course the\r\nI am just a worthless liar\r\npart is self-explanatory.....the best i can do with the chorus about being sober and sleeping is that he has taken to drinking and sleeping all the time to get away from his guilt.....anyway, im probly wrong but this is the best i can do with this song\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\ndidn't it occur to you that there may be more than just one meaning to the song? there are definate biblical references, there are definately references to lying, and there are definately references to addiction. maybe, maynard is simply comparing addiction and religion, lying is included in both.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nreligion isn't merely the opium of the masses, it's the cyanide\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nYou guys have pretty much covered the meaning of the song although i havent read all of the entries. I would like to point out that this song came out in the early ninetys and it still sounds it belongs now in this decade. Tool really set the example for all those rock bands out their right now but it seems similar bands have trouble being half as good as Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nThis song is awesome, the song that turned me on to Tool when I was young.\n\r\nThat bass line is like one of the most recognizable and coolest ever, with Schizm being up there with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nI saw that VH1 thing and I think the funny thing is that in 20 or 30 years Tool is going to be right up there next to Black Sabbath, because Tool is changing music just like Sabbath did.  Tool, and pretty much any band today, wouldn't exhist if it weren't for Sabbath and the same is true for many band that will come out in the future being so influenced by Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nthis song rules its fucking awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nOk all you people are tool fans. Most of you anyway. Come on. This song isn't that great. First of all let me state that I do like this song. It's a good song. But tool has done so much more complex, beautiful, and meaningful music than this. This is probobly the most pop-like song they've ever done. Once again I don't have any negative feelings about this song. I just think Tool has done much better. Before and since this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\ndarktoss callm down. we sicken you cause we pick a favorite tool song? jesus christ, chill\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nHmm.  I went to a Tool concert last year.. He didnt sing this song so i was somewhat dissappointed..... WEll not really.. He sang Opiate and i about passed out from the force he has as an artist...It was truely awesome.. I do agree with EGB, this song is nothing to freak over.. its not his best.. but all of his songs are equally meaningfull.. All of them are truely blessed songs.. with the love as a true fan... i'll end with that....\r\n                                  .....-----Raven\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\ni like tool too ... been hearing them only since a month or so ... and i just have a few songs ... but i really do like em ... sober opiate aenima parabola stinkfist euology ... ive heard these and i love the start of the parabola video where he does a kinda slow chant type thing im not sure what its called but his voice is amazing there ... can u ppl gimmie a name of some of their best songs?\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nYeah, these guys, like many other artists, use drugs to try to enhance their music, which seems like the basic theme of this song. My interpretation of the whole Jesus and Mother Mary parts seem like MJK is trying to forget about these religious figures because his art will be something that contradicts them. This is definitely their best song\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nI think the only reason people consider this song Tools most 'pop like' song, is because it's probably their most popular song.  Eh I know that's kinda silly, I'm just sayin if they hadn't made a video for it it wouldn't be thought of that way.  It's a dark and eerie song man, gotta love it.\n\r\nAnd I totally agree about VH1 choosing Tool as 92, just wait a few years they will be puttin Tool at number 9 or somethin.  They influence so many of todays bands it's crazy.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nWell the thing about this song is that it is simple enough that it doesn't require 4 muscicians to play it. The guitar part is no more difficult than most Nirvana music. It's just that they're capable of a lot more complex music. Stuff with odd time signitures and basslines that have more than 2 notes throughout the whole song. And I would beg to differ with anyone who thinks this is still they're most recognizeable song. It's probobly stinkfist or schism or something now.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nThis song is kick ass.it got me into Tool,becuase when i first heard Schism i hated it,i thought it was a crappy waste of time.However,this song open up tool to me,because it presented me with a catchy chorus.\r\nThe video is cool as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nThe video is better than stinkfists by a long way.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nthis song is pretty cool but the video is so awesome. I first saw it when i was around 4 or 5.... It gave me horrible nightmares.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nRazormasticator. What the fuck man. This song has been in regular rotation on every rock radio station in the world for the last 10 fucking years. And you heard schism before this. Man where have you been. Also the thing about Tool's videos is that while they're all very cool, most of them are very similar. They all either have some wierd human like creatures in them or some sort of funny little claymation guy. Every single one.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nThe video for this song scares the crap out of me. I watche d it around 2 AM one morning on one of those late-night MTV metal shows (stupid, I know, but whatever) and... I couldn't sleep.\n\r\nThat little.. guy.. in the floating chair and.. \n\r\nThere is no God.\n\r\nCreepy videos aside, Tool is awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nI have a little different take on Sober.\n\r\nI feel that it's about some type of clergyman (priest, reverend, etc.) who is slowly drifting away from his or her faith.  With the lines that start \"I am\" and \"I will\", he/she is deprecating theirself because they are preaching something that they don't believe in.  When it says \"Jesus won't you fucking whistle?\" and \"Mother Mary won't you whisper?\" I think he/she is stressing their doubts of the existance of God.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nIt is saying how he tries to change, \"trust me\" that is like his begging to be forgiven for what is done. He keeps saying that he wants to start this over, he wishes he could undo all the wrong he has burdened his loved ones with.  \"Trust in me and fall as well\", that is saying that if you do trust him you will be inconvenienced greatly, and he will bring you down.  thats what i get from the lyrics anyway. This is one of Tools greatest songs, definately the best on this album. But Opiate is my favorite album. But you know what they say about opinions, they're like assholes. everyone's got one\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nI get vibes of 'breaking out of reality/seeing how the world really is' from this song.\n\r\n\"Why can't why not be sober...\"\n\r\nWhile one can point out that this has to do with someone abusing drugs and is sorry for it, I see it as 'why can I not see the world as it really is? Why can I not sleep forever in a dreamstate and explore my mind?'\n\r\nUnderstand my thoughts?\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nOnce again, I didn't read through all the posts.  I was overwhelmed with people's bullshit theories.  This song is pro-drug use.  \"Why can't we do drugs if something POSTIVE is happening?\"  That is all it is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nMaynardâ\u0080\u0099s state of mind may be considered devilish or evil by the western worlds definition (perhaps in Asia he may be considered an enlightened man?).  His state of mind is seen as evil by society around him.  Therefore he feels almost as if the devil has consumed his view on the world.  How he sees the world is not the same as everyone else sees the world.  He is a deviant man with deviant thoughts.  So since his way appears to be in the minority in society, he may question his sanity.  Thus further producing more feelings of melancholy of various capacities.   \n\r\n\tAlso to be considered that contributed to Maynardâ\u0080\u0099s melancholy is the fact of conditioning as a kid.  He was brought up Christian and the idea of the devil or Satan has been conditioned into his head with feelings of melancholy/hate.  So every time he thinks of how deviant he is, by societies definition, he is a walking devil.  Thinking about the devil as a kid has carried with him as he thinks of himself being the deviant devilish creature.  Thus producing the feelings of melancholy that are unconsciously associated with thinking of the devil.  But Maynard cannot get rid of that old conditioning.  Leaving him depressed and wishing he could be like everyone else(unconscious happy creatures) as seen in the last quote at the bottom.  \n\r\n\"Why can't we not be sober?\"  (Yes there is a double negative) \r\nMeaning: I am sick of thinking this way it is too depressing.  Cant I just erase my manifestation and be like everyone else?  Because it seems way easier.  He says this because of the melancholy he feels being the deviant person in the western world.  \r\nHe asks that because he \"just want to start this over.\"\r\nmeaning:  having his insanity never manifest into his head.  To just die and be like everyone else, the unconscious type; for it is the easy way out and he would not have this hole in his head.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nOh i think i forgot to mention that i think maynard uses parelells with alcholholism/sex/drugs and real life situations like NIN/Manson.  I think some people may have missed that in here.  I think he does that to give the songs meaning rather than a pointless blabber about some drunk dude that no one cares about.   but i could be wrong.  \n\r\np.s. Pointless blabber about nothing is left to most cliche punk bands or bands like slipknow(which I still enjoy) not tool....lol\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nI thinks its a song about my wife, thanks Maynard, for trying to warn me...haha\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nThis song is amazing, that's what I have to say first.\r\nSecond of i think the meaning is that to do with love. Maynard uses the image of alcohol and drug addiction to show what love can do to you. The second verse really clenches it for me, how when you're in love it rises you as far as it can and then pulls you down when you're at your weakest.\r\nMainly, though, i think it is made so you can make your own interpretation of it. The theme is whatever in your life that really brings you down.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nthis song rocks!!! it's soo deep and it just rocks!!! Tool is a freakin awesome band!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nEskimo 8 is gay, and correct. Amazing song you wombtastic whore mongerer\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nOkay..... I thought this song had so much more with simple human nature, our flaws and our hatred for ourselves. The introspective hate that raises humans above animals yet is our ultimate flaw. Doesn't really have any meaning towards drugs or whatever unless in a general sense. We're intoxicated in our emotions.... Why can't we not be sober?\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nThis is my favorite Tool song ever. Nuff said.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\n>There's a shadow just behind me,\r\n>shrouding every breath I take,\r\n>making every promise empty,\r\n>pointing every finger at me.\r\n>Waiting like a stalking butler\r\n>who upon the finger rests.\r\n-The voice is speaking about himself. The tendancy that he and some people have to promise much, but deliver little. As the voice has nothing but good intentions, he cannot see how empty promises hurt, which \"feels\" like somebody is forcing his hand to break those promises. \n\r\n>Murder now the path called \"must we\"\r\n>just before the son has come.\r\n>Jesus, won't you fucking whistle\r\n>something but the past and done?\r\n-This is the voice blaming God/Jesus/Church for forsaking him, giving him no shelter from his current pain, which he feels from the broken promises mentioned erlier. \n\r\n>Why can't we not be sober?\r\n>I just want to start this over.\r\n-Sober means \"not on drugs\" but it can also mean \"clear of mind\". According to Marx \"Religion is the opium of the masses\", seeing it that way, sober in this instance could mean \"without religion\". So \"Why can't we not be sober?\" is a plea to rid ourselves from religion.\n\r\n>Why can't we drink forever.\r\n>I just want to start things over.\r\n-This and the last verse are always linked, but when they are not it brings new meaning. I have heard a cliche which goes something like \"Drink the knowledge in\". Using that, the voice is speaking of drinking from knowledge, forsaking the crutch of religion. \n\r\n>I am just a worthless liar.\r\n>I am just an imbecile.\r\n>I will only complicate you.\r\n>Trust in me and fall as well.\r\n>I will find a center in you.\r\n>I will chew it up and leave,\r\n>I will work to elevate you\r\n>just enough to bring you down.\r\n-Here he voice is speaking to, for an example _only_, a christian. He is saying from that point of view he is a worthless liar, an imbecile, etc, etc. Also it serves as a warning to christians, still using the example, as he will degrate them and chew them up. Also, it is another attempt to remind himself of the promises broken.\n\r\n>Trust me.\r\n-*double meaning alert* Linking this with the previous verse it is used as a warning to christians as in; \"Trust me when I say I'll chew you up and spit you out.\". _BUT_ on it's own, it is a plea for the sane to embrace life and forget religion, which from the moment of inception is dying. \n\r\n>Mother Mary won't you whisper\r\n>something but what's past and done.\r\n-See \"Jesus\" line above. This is the lyric that keeps my third eye trained on interpreting this song as \"the voice\" vs. \"the church\".\n\r\n>Trust me.\r\n-See above.\n\r\n>Why can't we not be sober?\r\n>I just want to start this over.\r\n-See above.\n\r\n>Why can't we sleep forever.\r\n>I just want to start things over.\r\n- Now for the only alternative to \"with God\" or \"without God\" that the voice sees as a good one, to sleep forever. This could mean one of three things, all opposing:\r\n1. Sleep forever meaning \"being dead\", which with the hope of the lyric \"Trust me\" doesn't quite make sense.\r\n2. Sleep forever meaning \"being dead\", and bring new hope by cleaning all the dead brains out of the mix.\r\n3.  Sleep forever meaning \"dream forever\", which is the only alternative left, sit in dreamstate, accomplishing nothing.\n\r\n>I want what I want.\r\n- to quote Issac Asimov: \"I am an atheist, out and out. It took me a long time to say it. I've been an atheist for years and years, but somehow I felt it was intellectually unrespectable to say one was an atheist, because it assumed knowledge that one didn't have. Somehow it was better to say one was a humanist or an agnostic. I finally decided that I'm a creature of emotion as well as of reason. Emotionally I am an atheist. I don't have the evidence to prove that God doesn't exist, but I so strongly suspect he doesn't that I don't want to waste my time.\" \r\nMeaning, I don't have to explain myself. For a better example, think of a parent saying in retort to a child \"Because I said so.\"\n\r\nThanks for reading this and I don't think this meaning has been yet been posted.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nWe are all just sharing opinions that's all we have.  Nobodys is better or worse than anybodys elses.\r\nI'll just agree with Eskimo 8 and take side.\r\nI only ask you to listen to the song after you've been ditched by an lover.  And the simple fact that alot of relationships start off with some heavy drinking.   And when your all sobered up shit often hits the fan.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nthe song was one of the things that got me trough rehab its so fucking awesome along with a seether cd and pictures of my neices and nefew\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nlol its kinda ironic when you read the lryics isnt it?\n\n\n", "comment_126": "\nThis song can be taken in the blunt way...drug addiction bad and eventually you'll wish you hadn't done any of that...or you can \"read between the lines\" ;) I take it to mean, eventually no matter what decision you make, you're going to regret it. But, if you really think about what you're doing you ight not regret it as much. ;) Tool is amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nThis song means, to me, an addict wondering how the hell his/her life turned to shit the second part of the song is sung by the drug... well that is my take on the song. take it or leave it. hopefully you will leave it\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nthis song I think is about narcissism. Even in tools song \"reflection\" he admits he is one. and if you know what a narcissism is, than you know why this song is atleast partially related to it. hence why he says \"I am just a worthless liar. I am just an imbecile. I will only complicate you, trust in me and fall as well. I will find a center in you. I will chew it up and leave. I will work to elevate you, just enough to bring you down.\" As you will soon find out if you read into narcissism, a narcissist is someone who is quite often a liar and uses people to reflect an image back on themselves so that they know how to act and how they are interpreted. The fact that maynard says he will work to elevate you is because a narcissist puts his problems last and the other people first so that he/she can use them just to satisfy themselves then quite often leaves them\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\ni think this songis talking about a second chance in life, its about a person who fucked up theyre life and they want to start over. and then the jesus reference and the mother mary reference is to say y the fuck wont u give me a second chance god. kindof and anti religion song\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nyou are all so out of touch with the REAL message that my best bud and soulmate Maynard is trying to get through your thick skulls. the truth is made evident in the lyrics \"winking like a stinging nettle, who will find my cigarettes\" what he is talking about is the time he was in london and his slevve got caught on a nettle bush and the pack of smokes he had in his hand got lost in the bushes. Its more of a cry for help \"WHO WILL FIND MY CIGARETTES!?\" sometimes i also have to poop in the backyard! the parts where he talks about jebus and marry is him calling out to the heavens for assistance and all he gets is the old \"its your sin of smoking that put jesus on the cross!\" bit. the secret whispers in the background are actually maynerds astral projected spirit calling to Whiteout to come join him. (go already whiteout. are you going to keep him waiting forever. just put the barrel in your mouth and squeeze the trigger, its easy!) anyway i just got off the phone with the may-man (thats my \"best pal\" name for him) and he wants you all to stop lying to your mommies and to start doing drugs. thats what the line \"why is it that we can not not be not sober\" really means. damn you people just don't get it. as whitout would say. \"open your puckered brown-eye and look around!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\ndoes anyone know when the \"whispering\" part starts, cause i cant hear it\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nHere's a parallel I was noticing.. but maybe i'm way off. \n\r\nThe Beatles had the line \"Mother Mary comes to me \r\nSpeaking words of wisdom, let it be...whisper words of wisdom, let it be.\" \n\r\nTool says \"Mother Mary won't you whisper \r\nsomething but what's past and done?\" \n\r\nthere's also the parallel between being sober, and accepting life as it is rather than having to change your state of being using drugs or alcohol, and on the other hand the beatles telling us to let it be, and that there will be an answer. I thought they seemed to go together. Tell me what youthink!\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nwhat an awesome band\r\ntool rules\r\nmy friend dumped his g/f by sending her this and telling her to listen to the \"i will only complicate you, trust in me and fall as well\" bit\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nTo me, this song is about not wanting to deal with the miserable circumstances of life. There is always something wrong, nothing is ever perfect so what's the point in trying to be live perfectly. You can't take back mistakes, and there is always some way of improving yourself. I think Maynard is telling everyone to do what makes them happy, and if drugs or alcohol does the trick, why not?\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nthough i don't think this has much to do with the song, but the naming of Jesus and Mother Mary brings up the Christian thing into the song. Growing up with a Christian back ground. i know that Christians are called to not be drunk with wine, but the Holy Spirit. I know now that i've \"fallen away\" from the christian faith. i use the term \"Sober in the Spirit\" to show my distaste for the modern day christians around me. \n\r\nThat's what feelings this song stirs up for me. though i don't think that song has much to do with that. though i thought that i'd share that with all of you.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nthis song is about an artist that did his best work when he was drunk and he always got a lot of crap for it\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\ni feel like killin myself with this song...it gives me the chills, full of contradictions, bout jesus and mother mary...it kicks asses! \r\n*kinks*\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down.\n\n\n\n", "comment_139": "\nfuckin comment formatting.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\n\"There's a shadow just behind me,\r\nShrouding every step i take,\r\nmaking every promise empty,\r\npointing every finger at me.\r\nWaiting like a stalking butler\r\nwho upon the finger rests.\"\n\r\n^^^This part of the verse is talking about problems of his past that haunt him. Something we call, \"a skeleton in the closet.\" He's describing how the regret is taking over his life, and how the bad reputation resulting from the past precedes him, like it's become his identity, like it affects every descision he makes.\n\r\n\"Murder now the path called \"must we\"\r\njust before the son has come.\r\nJesus, won't you fucking whistle\r\nsomething but the past and done?\"\n\r\n^^^ This part of the verse is where he's pleading to anyone with power, asking for things not to go further and get worse, hoping that everyone just forgets the things he did in the past.\n\r\n\"Why can't we not be sober?\r\nI just want to start this over.\r\nWhy can't we drink forever.\r\nI just want to start things over.\"\n\r\n^^^ This part is where all the conflict lies. There are so many underlying meanings to it that nobody can pinpoint what it is exactly. \"Why can't we not be sober\" is a double negative, saying why do we have to be sober. When we're sober, we're aware of the things we do and say--our judgement of right and wrong is far better. In my opinion, he's saying that he wishes everyone could live in a state of being where nobody can remember anything or pay attention to the dark details of someone, or worry about good and evil.\n\r\n\"I am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\"\n\r\n^^^ He's talking about how anyone who wants to get involved with him will end up going through some heavy shit and turning out to be influenced by him. You know, 'Garbage in, garbage out.'\n\r\n\"I will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down.\"\n\r\n^^^ He's saying that even though it appears as though he's doing better and can lead a normal life, he'll end up disappointing those who rely on him.\n\r\nTrust me.\n\r\n\"Mother Mary won't you whisper\r\nsomething but what's past and done.\"\n\r\n^^^ Again, he's making a plea to the powers that be, asking that his past just disappear.\n\r\nTrust me.\n\r\n\"I want what I want.\"\n\r\n^^^ Blatantly obvious. He's again referring to how he wants all the bad stuff to go away...wants life to change and be like oblivion.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nwhat\"something but the past and done\"means is that once you've done it in the past it's already done and over with.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nmeredith is a piece of shit to even come on here and say she like tool,fuck you meredith.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nHear f***in Hear!!!! Why CANT i NOT be sober??!!?!!!! \r\nPS the best way to win an election? Offer free pizza....or even better, take-away in general. They'd have my vote!\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\ni reckon this song is a guys plea for the world to take him seriously after hes totally exposed some naked vulnerability (such as being drunk). it may not just be concernced with teh aftereffects of alcohol, but whatever drug, or attitude or relationship-and its him trying to get the world to give him a second chance and at trhe same time trying to let himself have a second chance\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nThey wrote it about an artist they know who is at his best while on drugs. But I get something completely different out of it. My interpretation is that of wanting to do away with a bad past, sorta like  palerougedeath just pointed out ^ there. Often times, people start doing alcohol to forget bad memories, that's where the \"why can't we not be sober\" and \"just want to start this over come in\". The \"shadow\" in the first line are the past faults that constantly haunt you --\"making every promise empty,pointing every finger at me.Waiting like a stalking butler who upon the finger rests.\"\n\r\nI think \"jesus, won't you fucking whistle something but the past and done\" and \"mother mary won't you whisper, something but the past and done\" are both prayer references. Some people say praying can change things for the good, but the song is saying that it can't change thre past, hense \"something but the past and done\". That's another one that supports my bad past interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nthis song got me kick out of my house  but it's so kick ass i don't give a shit!!!!! TOOL RULES\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nI think that this one of the best songs of all times. This is as close as humanly possible to create a perfect song.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nEveryone listening to the second time the chorus is being played, you should here a noise like i think one of the other band members is saying hey\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nNot knocking anyone's opinnion but the song seems rather straight forward. I know many people looking for alot of hidden meanings in Maynard's lyrics but in many songs i think he comes out and says everything he has to say clearly and simply. And lets not forget that Tool is made up of three other individuals who all contribute in their own way to the meaning of the songs they write, namely Adam, Danny and Justin. Even Maynard himself said in an interview 'the music should always come first. If the words were so important and the music wasn't then people would be doing sold out spoken word tours.' I think their main concern is the music and the lyrics sort of point out where the emotion is pointing towards. However in Sober the chords seem rigid and Harsh as is the case with many other early tool songs (undertow, hush). The song is an angry song more than anything else and it is obvious that the anger is pointed at Christ. We tool fans all know how they feel about religion and christianity already.\n\n\r\nThere's a shadow just behind me,\r\nShrouding every step i take,\r\nmaking every promise empty,\r\npointing every finger at me.\r\n(In these lines the persona feels like he is being stalked by God. As iif God is waiting for him do make a wrong move only to point the finger of blame at him when he does.)\n\r\nWaiting like a stalking butler\r\nwho upon the finger rests.\r\n(Again with the stalking presence he feels from God watching watching him. However the second line points to him feeling that God deserves all of the blme for making him imperfectly)\n\r\nMurder now the path called \"must we\"\r\njust before the son has come.\r\n(the narrator saying that after Jesus come we have no choice but to follow or to be damned.)\n\r\nJesus, won't you fucking whistle\r\nsomething but the past and done?\r\n(Basically him cursing and challenging Jesus to tell him something he doesnt know already. The ultimate insult to God as he is an all knowing being. If you listen to the entire song these lines are the angriest, the loudest and the clearest while the rest of the song is almost murmered and muttered with the exception of the second and third chorus) \n\r\nWhy can't we not be sober?\r\nI just want to start this over.\r\nWhy can't we drink forever.\r\nI just want to start things over.\r\n(Him challenging God saying why can't we just be drunk. Drunkeness in the eyes of christianity is a grievious sin. Maynard could also be pointing to christianity as a form of drunkeness.)\n\r\nI am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\n(this entire verse is a two way conversation between the persona and God. The first Half above is the persona listing all of his faults to God saying if God trusts in him he may sink to his lowliness as well.)\n\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down.\r\n(God telling him that he will make him rise out of his current state. However the last two lines show that the persona believes that if he trusts in God in the end it will just lead to his destruction.)\n\r\nTrust me.\n\r\nMother Mary won't you whisper\r\nsomething but what's past and done.\r\n(Same line except directed at Mary, mother of God)\n\r\nTrust me.\n\r\nI want what I want.\r\n(The persona decides that he will do what he wants to do and live the way he wants to live.)\n\r\nIn short the whole song is Tool laughing at the religious who keep their faith in God, while he believes that christianity is merely a hindrance on their intellectual growth. Don't believe me listen to Eulogy, The Patient, Opiate, Judith (APC), and many other tool songs. However i believe that all interpretations of the song may have some relevance. If you really want to know next time you see maynard, danny, adam or justin walking down the street ask them and maybe they wontfuck with your mind more.\r\nThats my two cents. peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nok like idk if u guys have noticed but ever since tool maynard has hinted something about his past and a special some1 becuz in sober it seems he is talking about a realtionship saying \"i am just a worthless liar i am just an imbecile i will only elevate you long enough to bring u down \" so hes saying i am just a liar i am an idiot i will only make u happy long enough for me to do something to make u sad and i think hes afraid to commeit because he still feels for another girl\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nI dont want to diss anyones opinion i merely want to add to the common cause of finding out what this song means\r\nMy Opinions are that: \r\n1)a close friend of tools' has turned into a Junkie/drunk. \r\n2)Tool has structured the song in a particular way so that the song is the Junkie/drunk singing about himself truthfully. \r\n3)The Part from 'I am just a worthless liar' to 'just enough to bring u down' emplys that this junkie/drunk rips people up emotionally and doesn't care because he's ignorantly blissful on his high\r\n4) The questions 'why cant we not be sober' and 'why cant we drink forever' emply that he wants to continue drinking and deny reality (for lack of a better word).  I mean in the video, watch the actions of the clay characters arm trying to reach through the floor and grab the H towards the end of the video. His arm starts flapping around, emplying that the junkie/drunk is desperately trying to deny reality by staying high, and then comes down from the buzz and then the arm suddenly stops flapping. Which leaves the question, is this junkie/drunk going to finally realise reality?\n\r\nI'd love to hear what anyone has to say about what i typed\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nThis song is fantastic, just as an aside, has anyone noticed that the songs bears some musical similarity to Queen's song 'Innuendo'. Don't get me wrong, I don't think it is a ripoff or anything, but I wondered if Tool had expressed an appreciation for Queen in any interviews?\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nI think it's about alcoholism. A alcoholic makes empty promises and lets people down. If you are an alcoholic then you would certainly be asking \"Why can't I just stay drunk?\" Your addiction is what is stalking you, making you a \"worthless liar\", ect. The Mother Mary reference may be a reference to that even if he asks for forgiveness or something, what's done is done. \r\nStill my absolute favorite Tool song.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nA great song about ADDICTION. Proabably heroin cause it was written by The Rev, but it works for all addiction, Favourite lines \"Haunting every step I take, making every promise empty, pointing every finger at me\",\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\num, no one's whispering anything, lol. you guys are weeeeeeeeeird. if anything it's the instruments.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\ni agree with the addiction deal, i mean listen to pretty much every song from apc's 13th step. but a lot of tool's songs have a certain amount of ambiguity to them, allowing the listener to exercise a certain amount of liberty in pulling out meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nThe meaning of this song is very simple.  Being the great artists that tool are it is understood why people want the lyrics to mean more then they do.  When something is important to you - it takes a life of its own.  \r\nSober is about that - the struggle and wanting to be \"sober\" when one knows of no other way but to be otherwise.  Though this song seems to pertain to Alcoholism it could be any sort of substances.  When you have a chemical dependence it stalks you like a stalking butler - slow and methodical.  It slowly destroys you.  Everything around you is affected.  It is about knowing what alcohol is...\r\n \"I am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down\"...\r\nbut not being able to stay away from it.  Not being able to control the dependency that your body and mind has for it.\r\nAnd the part of \"Jesus, won't you fucking whistle\r\nsomething but the past and done?\" is him asking why through the bible do we only know what happened in the past.  There is nothing there in it to help us with today.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nTo me it sounds like society treats Maynard badly just because he takes drugs. They think that he's just an dishonest idiot that will only stab you in the back, and he's wishing he could have never taken narcotics just so his reputation wasn't destroyed in the first place. I'm not 100% certain about my interpretation here, but I'm guessing I'm close.\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nAgain, I hate making it into a religous song because all their songs come back to that debate, but if it is. here's my view on it. Maynard points out that organized religion isn't the answer, but people accuse him of bieng a \"Worthless liar\" he calls for soberity and reason only to be slapped in the face of people who refuse all reason \"Why can't we not be sober?\" It's a complete lie, yet the radicals will accuse anyone no matter how reasonable of being a worthless lying imbecile who wants nothing more than to drag them down and work for them to fall, which is the ultimate irony because it's exactly what their religion is doing to them.\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nThis song is a classic example of a Tool song.  It means something different to everyone.  When I interpret it, I see that Manyard had a drinking problem and forced it upon someone close to him.  This just makes him feel worse about himself.  I might be completely off though.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nDank...in the song he doesn't Say F-ing hes says     ---\"why wont you try and whisper?\"---\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\naddiction. not just alcohol but any drug. i know of addiction, i have seen it take my friends and my family, it is evil. \r\nI am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down.\r\nThese are the traits of drug abusers. they lie cheat steal abuse and don't care. the only thing a drug addict cares for is the next temporary high they can get. they lose their whole life meaning. House job spouse children and thier soul.\n\r\nThere's a shadow just behind me,\r\nShrouding every step i take,\r\nmaking every promise empty,\r\npointing every finger at me.\r\nWaiting like a stalking butler\r\nwho upon the finger rests.---ADDICTION\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nThe first time I saw the video, I didn't realize who it was. I was just looking for something to watch. It caught my eye and kept me there. Most Tool vids do that, especially Stinkfist\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nThis song is about the human psyche. Look beyond the writer...people get to caught up that Maynard wrote it and it's about something personal to him. We all have a \"shadow\". And, no, Jesus wasn't the one that created the shadow. Read up on your Carl Jung cause I'm 100% sure that Maynard has.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nI don't care, this song is the Shit\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nTHIS SONG KICKS SOME SERIOUS FUCKING ASS!!!\r\nthis song got me into tool to begin with and its amazing, the only tool song that can compare is the grudge\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nthis song tells so much about me like he understands its so awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nprobably one of my fav songs by TOOL\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nIn the original demo, Maynard said this instead, for the various choruses:\n\r\n\"Why can't we not be sober?\r\nI just want to sleep forever\r\nWhy can't we start this over?\r\nWhy can't we start things over?\"\n\r\n\"Why can't we not be sober?\r\nI just want to sleep forever\r\nWhy can't we start this over?\r\nI just want to sart things over\" x2\n\r\nNotice the lack of the line,\r\n\"Why can't we drink forever?\"\n\r\nI'll leave it up to you to intepret the differences, on the song's suppossed \"intended\" meaning...\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\n-ZERO-, exactly. If you listen to it on a site that censors it doesn't censor anything.. so it can't be saying f-ing.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nHis mom was in a wheelchari after sum bad shit went down( accedent sickness..i dunno) anywhay, he remembered going to church and he would see all the adults saying how brave she was, and nice to her and such, and he found out from his freinds and children of the people that they were really saying bad shit about her behind her back, so in the song hes saying fuck your god , the god you think pretects you, the god you lie in front of. so hes not pissed at jesus or anything, just people who are clame to be jesusians. take it or leave it, its the truth\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nOk to me this song is about drinking / Drugs. But this entry is all based around my perception of the song. If you watch the music video it helps alot. And to me the character is addicted to what ever is in the box. Even though he's trying to break the addiction he feels empty and useless without it. So when he opens the box he feels whole and happy though it's making him feel worse when he's sober so he just wishes to not be sober without the consequences of reliving his horrible past that haunts him and he still lives in without finding a way to move on. And his way out is through the addiction and also prays for god to help him to move on. \r\n           Reminds me of The Raven by Edgar Allen Poe.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nwell i cant tell you the exact meaning because i didnt write the song, but heres what i get out of it\n\r\nin the video, you see the guy with the little box\r\nhe keeps checking inside it for, what i think are drugs, the source of his problem\r\nBUT\r\nhe is tripping so hard, hes delirious, so he thinks when he comes back that he will get a different result, but of course the box remains empty\n\r\nand also in the lyrics, he says hes a worthless liar and will make you more complicated. this is refering to the purpose of his existence, to make others misreable and cause problems, with no real benefit for himself. he also says, why cant we sleep/drink forever. i think this is because he is searching for bliss, even though it doesnt exist.\n\r\nthat video is insane...you have to love claymation\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nEasily the best track of undertow, it sends shivers down my spine it has such a powerful chorus.  Awesome film clip probably my fav tool clip, \n\r\nok tool love Jungian concepts (e.g anima) so maybe the shadow has somethng to do with jung's concept of the alter ego being called a shadow in one of his books also note the use of a double negative in the chorus \"why can't we not be sober?\" \n\r\nSober is very ambigous in its meaning. clearly it has an anti-christian message which is connected ironically to let it be by john Lennon . tool (silly little love songs) as well as APC (imagine) seem to parody the Beatles work an awful lot.  Now i think his is more of a lament for the time which has passed and the spirit which embodied the Beatles songs (free love, flower power etc)\n\r\nNow this is what i think the song is about:\n\r\nthe shadow represents music, art and life in general in the 60's and 70's.  The chorus is asking what happened to those times, was it right to live life in such a manner and in a way lamenting the loss of the 60's-70's as a kind of age of innocence.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nthat line about the stalking butler always cracks me up, especially the way maynard sings it... still a great song nonetheless.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\ni read all the replies, and i think everyone missed the point.\n\r\nit's really simple.\n\r\nit's about being condemned by his peers for a choice.  first verse shows him condemned.  everyone assumes he's wrong.\n\r\nthe misconception is in the chorus.  it's \"something but the past is done\".  meaning everyone is wrong about his actions.\n\r\nthe allusion to being sober means...why can't anyone see it clearly?  the allusion to drinking is twofold...is everyone so forgone they can't see?  and the need to be wasted to forget that such human bullshit exists.  his mention of wanting to start it over is just that...he wishes this bullshit had never happened.\n\r\nthe second verse is pure self loathing, for the fact that he is vilified for an action that was necessary.\n\r\nthe references to jesus and mother mary only enforce the righteousness he feels.  he has been so wronged, and is amazed no one has a clue to his reality.\n\n\r\nso, for the tldr crowd, he's been fucked for being himself, and is done with it.  that's it.\n\r\nbtw, best tool song.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nparts of this came from the c.a.d. song \"burn about out\", featuring maynard with a mullet and dangling earing and full spandex and eddie murphy on headless bass\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nand \"Burn About Out\" predates to around 87/88\n\r\neddie murphy; king of slap bass next to claypool and billy gould!!\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nOverwhelming to see so many people posting in this thread. This is a great song. Didn't know that it was about his friend before I read the posts. I always thought that it was about love gone bad and how he wants to start things over.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nslamking \r\ni would just like to say thankyou for telling it like it is too bad your comment wasn't the first one i wouldn't of wasted so much time reading other comments\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nIsn't it possible that \"why can't we not be sober?\" means the same thing as \"why can we not be sober\"? There often are double negatives for a negative meaning, \"I ain't sad no more\" meaning \"I'm not sad anymore\". Can anyone clear this up for me? Thanks.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nTRUST ME,TRUST ME!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nThe video is a portrayal of several Edgar Allen Poe stories.  The more prevalent ones are The Tell-Tale Heart (where the man hides the heart of someone he has killed under the floor and hears it still beating so he keeps checking it until he goes crazy), and The Cask of Amontillado (where a man is chained to a wall then a brick wall is built around him, essentially burying him alive).  I am sure there are more Poe references, but I did not catch any more blatant than those two.  \n\r\nIt seems to me that when you combine what others have said about the lyrics and what the video is about, the song is about a person being haunted by their past, most likely guilt for a past crime (sin?).  Both of the Poe stories main characters are haunted by guilt.  The man in the Tell-Tale heart believes that he is hearing the heartbeat of the man he killed (it was actually his own heart) that he reveals his crime.  The man who buried the other man alive in The Cask of Amontillado revealed his crime on his deathbed, after letting it stew and haunt him his entire life.\n\r\nSo its about being haunted by your past, in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nI agree with treestump.  Although Tool's songs are always open to interpretation I think 'Sober' has to do with religous dogma and thinking for yourself.  There's a lot of teetotaling Christians that think you should always be sober that way you can have a clear mind to listen to the preacher degrade you...\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nWhile obviously Maynard had a specific friend in mind when writing this song, I will always interpret the main character as I did when I first heard it.\n\r\nI think the man singing is Satan himself.\n\r\nIt makes sense. He was once the accuser of man before God, the prosecution as opposed to Jesus' defense team. Now the finger is pointed at him. The evil of the modern Satan stalks us, lingers like shadows and tries to lure us from the path of obediant duty. The seconf verse, as read in the context of Satan speaking about himself, is pretty self explanatory. Even his references to Mary and Jesus are rife with cynicism and bitterness. When I hear this song, I see a sardonic smile on his face, but also feel an anger in his voice. I mean, what feelings could Satan have? Anger at being rejected by God, apathy to his role, cynical \"self-pitying\", the deranged glee that comes with manipulating people, a sense of power even as he's relegated to the shadows.\n\r\nJust try reading these lyrics and listening to the song, imagining it's Satan speaking, and tell me what you think.\n\r\n~my own wacked out interpretation~\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nAnother interesting tidbit in Old Testament Jewish tradition, a person's \"cup\" was their fate, their destiny. So the references to drinking and sobriety could reflect a denial of fate or capitulating to fate, juxtaposed with the main character's desire to chuck it all and begin again. He seems very undecided between wanting some mercy for a new start or just saying f*ck it all, I've always been evil, and I'll do my damnedest to keep it that way.\n\r\nI'm telling you, it's Lucifer!!\n\r\n*crickets chirping...*\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nI mean, he keeps saying \"Trust me, trust me\" but would you trust him after what he said??? I'm TELLING you!!!\n\r\nIt's...Satan!!! *Seriously, this is my last post...I'm just a little too excited...*\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\n\"Trust in me and fall as well.\"\n\r\n...fallen angel! Lucifer!!\n\r\n...I swear, this is my very last post...\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\ni do see your point, and you didnt need to post that many posts! i think that like any other tool song this can be interpreted in many different ways.\n\r\nthis is by far the best song on undertow, and one of their best overall\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nThis song's meaning is almost obvious due to it's title.  It pertains to alocoholism and the seductive nature of alcohol and the inability to stop drinking in certain people.  I interpret a lot of it as alcohol speaking in the first person, telling you straight-forward what it is and what you will eventually become because of what it seeks to lower you to.\n\r\n\"Waiting like a stalking butler\"\n\r\nIt serves you by blurring reality and realeasing you, yet at the same time \"stalking\" you by rendering you steadily dependant on the temporary peace it offers you.\n\r\n\"Why can't we not be sober?\r\nI just want to start this over.\r\nWhy can't we drink forever.\r\nI just want to start things over. \"\n\r\nThe condensed thought processes/patterns in every alcoholic's mind.  You want a fresh start but at the same time \"I want what i want.\"  \n\r\n\"I am just a worthless liar.\"\n\r\nI'll lead you to believe that everything is alright.  I'm nothing but trouble.\n\r\n\"I am just an imbecile.\"\n\r\nAlcohol is soulless and therefore a stupid inanimate object in and of itself.  Yet it has power over some of us.  \n\r\n\"I will only complicate you.\"\n\r\nIt only tells the truth because you know already know where it will lead you.\n\r\n\"Trust in me and fall as well.\"\n\r\nIf you depend on alcohol, the bottle will hold you instead of you holding it.  The results of alcoholism are well-known and obvious.  If you trust it, it will inevitibly betray you.  \n\r\n\"I will find a center in you.\r\nI will chew it up and leave,\"\n\r\nIt will find whatever coping resources you had before and destroy them over time, leaving you with less than you had before.  You'll need alcohol to cope with everyday life.\n\r\n\"I will work to elevate you\r\njust enough to bring you down.\"\n\r\nThese lyrics are self-explanatory...at least to me.\n\r\n\"Jesus, won't you fucking whistle\r\nsomething but the past and done?\"\n\r\n\"Mother Mary won't you whisper\r\nsomething but what's past and done.\"\n\r\nThe drunk is asking for a divine sign that something sacred exists; likely to assure him that he is not alone and that he has a reason to fight off his addiction.\n\r\nThat's just my take on the song though.  i'm not accusing anyone else of being wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nI think that this song is talking about how people with a drinking/drug problem look to those things as their gods and will do anything to get them so when he says jesus wont you fucking whistle hes just saying that these things that people always turn to arent real and cant help you and if you watch the video the guy keeps going back to the box to see if anything is there aand that makes me think that they are talking about drugs/drinking because eventually everyone who has a problem and doesnt get out hits rock bottom and there is nothing left\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nI am shocked at how dense many of the comments on this are. Song interpretation is always open to the listener, but of course the artist had an original intention. The clues are there, in the title. \"sober\" in the lyrics. \"Theres a shadow just behind me\"\n\r\nThere are double negitives which further point to meaning \"Why can't we not be be sober\" otherwise put as \"Why do I have to be sober\" however many will read that as why cant I be sober.\n\r\nYou see this is a song, as maynard said about a friend who had a drinking problem, that is the shadow behind him, the song is about drink or drugs, the song is sung from two points of view, one of the person and one of the drink or drug. hence the \"we\" in there, moreso the song is sung from the perspective of the alcohol or drug.\n\r\nkeep this in mind and re-read the lyrics, it makes amazing sense. Some key phrases\n\r\n\"I will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down\"\n\r\nThe first 2 lines are the general perception of drugs, they will find a part of you latch on, and tear your life apart.\n\r\nI will work to elivate you, that is simple poetic arrangment, for \"I will make you high\" just enough to bring you down, well what happens to most drug addicts or alcoholics, they crash and burn!\n\r\nI could disect every line if you like but the meanings really aren't that hard to pull out. The religious undertow to the song, which is of course there, is relevant but think of it more along the lines of AA \n\r\nand so on and so on! Simple, this man is a fantastic poet though\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\n\"Why can't we not be sober\" ---This is clearly a double negative. I think it's about how creativity only comes to him when he's fucked up and how he likes to be fucked up. He's also saying, at the same time, it's your own fault if you become a junkie. Your the one to blame for your own addictions.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nI applaud Slamking.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nthis song, if not fully, is greatly in regards to jesus/religion/christianity - I am amazed how anybody can take this so literally. (haunted by drugs/past MY FOOT)\n\r\n\"there's a shadow just behind me,\r\nshrouding every step I take,\r\nmaking every promise empty,\r\npointing every finger at me.\"\n\r\nreligion is full of empty promises, pointing fingers, and following your every movement (sins).\n\r\n\"waiting like a stalking butler who upon the finger rests.\r\nMurder now the path called must we\r\njust because the son has come.\"\n\r\njust because Jesus has come, we have to follow these guidelines, morals, testaments, (path) in order to be righteous and go to Heaven.\n\r\n\"Jesus, won't you fucking whistle\r\nsomething but the past and done?\"\n\r\nI'm not sure how to you'd translate this literally, but considering he's basically cursing a demand at Jesus. \n\r\n\"Why can't we not be sober?\r\nI just want to start this over.\r\nWhy can't we drink forever.\r\nI just want to start things over.\"\n\r\nLiterally \"Why can't we not be sober?\"  Just like \"why can't we drink forever.\" However you can relate this not only literally, but also relate it to other sinful/improper like things that we're not supposed to do, in order to be holy, righteous, and a law obiding christian. This is a general poke at indulgence in things Christianity looks down upon.\n\r\n\"I am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you just enough to bring you down.\"\n\r\nSpeaking in the third person as Jesus/a priest/anyone holy. Complete denial of faith and complete mocking of everything to do with Christianity.\n\r\n\"Trust me. Mother Mary\r\nwon't you whisper something\r\nbut what's past and done.\r\nTrust me. I want what I want.\"\n\r\n\"Trust me\" parts mock the mantra of a typical Christian faith, \"trust me, trust me, trust me, trust me\" \n\n\r\nI am Christian but I feel the song meaning is pretty obvious once you think about it\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nI think Maynard has had some bad experience with religion or religious people who don't meet up with the standards that they put before themselves. And He is bringing all this hypocrisy to light in this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nBoneDaddy, you're kidding yourself if you think artists are that creative anymore. I like Tool and everything, but, come on... a song means what it means to you. No one's wrong, unless the question is, \"what was the artist thinking when he wrote this?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nThis song is about the \"drunkiness\" of people. They become drunk \"Brainwashed\" if you will. They all need to sober up and think for themselves. This song is attacking collectivism.\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nIm pretty sure this song is about murder regrets. Like in Edger Allen Poe's Cask of Amantillado (Im so sorry for my spelling of everything lol). The video makes me think of that, and look at some of the phrases:\n\r\nThere's a shadow just behind me,\r\nShrouding every step i take,\r\nmaking every promise empty,\r\npointing every finger at me.\r\nWaiting like a stalking butler\r\nwho upon the finger rests.\n\r\nAll this seems like its eating at him (just like the charactor in cask) like someone might find out what he did.\n\r\nMurder now the path called \"must we\"\n\r\ni think thats obvious\n\r\njust before the son has come.\r\nJesus, won't you fucking whistle\r\nsomething but the past and done? \n\r\ni think this is like he almost wants someone to find out...the son is jesus...he knows what he did....\"blow the whistle\" maybe?\n\n\r\nWhy can't we not be sober?\r\nI just want to start this over.\r\nWhy can't we drink forever.\r\nI just want to start things over. \n\r\nAmantiado is wine...another reference...plus nothing will make his pain of regret for ending his freinds life go away\n\r\nI am just a worthless liar.\r\nI am just an imbecile.\n\r\nhe feels like nothing\n\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down. \n\r\nim a monster...i will screw you over...i will be the death of u\n\r\nTrust me. \n\r\nHe needed the other guys trust in COA...to lead him into the catacombs to bury him\n\r\nMother Mary won't you whisper\r\nsomething but what's past and done. \n\r\nobvious\n\r\nI want what I want.\n\r\nidk...maybe i want to kill you...in COA he tried to justify the murder...if not then maybe i want forgivenss\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nOh and just to be clear...im saying Sober and cask of amantiallo parallel...not that sober is based on it. The video may be based on that loosely. idk\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nMeredith8490...Get lost then.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nTHE SONG IS ABOUT HOW PEOPLE ARE BROUGHT UP AND RAISED EVER SINCE CHILDREN TO BELIEVE IN SOMETHING WRITTEN BY SOMEONE ELSE eg the bible XD\n\r\nI TOO ARE FUCKED OFF AT PEOPLE WHO ARE SO CLOSE MINDED AND CANNOT THINK BEYOND THE BIBLE OR RELIGION!!! WHY CANT YOU CHRISTIANS/JEWS/BUDDHAST/etc THINK FOR YOURSELVES ONCE IN A WHILE???\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nThis song seems to me to be about Jesus's feelings/thoughts on the night before his death according to the author.  It's seems the author is saying that possibly he had a tremendous sense of guilt that he knew he was lying etc. If I or a regular person was to say that I was going to save you for the rest of eternity that would make lots of people hopeful and joyful and happy.  If I knew i was lying and that the Roman soldiers were going to kill me for trying make a uprising like here in new Rome America Whites if someone was to say lets put Jose into power he would be killed.   the internal sensations feelings being conveyed by this music to me are guilt, desperate anger, hopeless, and fear.  yippee!!!! I'm probably off by a long shot eh i tried.\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nI've known people who believe atheisticaly then something else religious wise \"I'm a pagan, christamas tree\" or something.  That 'seem' to have had many many many fights with their parents maybe even raped by a priest or someone close to them that they trusted who believed strongly in a particular religion Christianity in particular because it's such a huge gang. Is there a correlation I don't know but they seem to occur concurrently in many cases often.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\ntools dark odd and Erie mysterious none of the real reasons why I listen to it  but they are.   I like them because there good and their good because i like them because there good and because I like them. I like them because they odd and their good and I like them because their mysterious and because my friend think i'm cool and their intelligent and artist and good and one of these days I'm going to catch my tail. Why do I like them i just do all right.\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nI think any interpretation of messages that are not meant to be taken at face value will reflect whats front and center in the frontal lobe.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nWhen it comes to what people are saying, as evidence decreases improbability increases.  . And the unexplainable is solved tah da! no more reality investigation.  World poof 7 days flood poof arc  lightning bolts poof Zeus everyone does it so why get mad we are a superstitious capable species.\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nYou can offend my or anyone's interpretations if you do? o but thats not what this website is for.\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nIt would be funny if Maynard and the rest of those guys adam whatever just kidding spend 5 seconds writing the song threw it together with some mystery and riddling.  *Made a bunch of money off it or their record label not a complete sentence on purpose*.  Then waited for comments from this website.  I've heard they like dark humor.\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nvicariously I watch Maynard and adam and shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nhidden meanings are fun but disappointing when you find out like esp b104 is my bass. wow not as exciting as it could used to be now is it.\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nit seems to me that probably I'm just guessing that I feel like maybe sorta but not exactly kinda \"Please don't be wrong I've been called stupid in the past for being wrong.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nand one more OK the internet if fucking fun.\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nespb104...were you umm high when you posted those comments? lol just kinda looks like it\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nThis is funny, but every time I heard this song I thought he was saying \"Jesus blows his fucking whistle, something that the pastor done.\"  Same meaning though -- saying that religion is about blame.  Idon't agree.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nI heard that this song is actually about Layne Staley.  apparently him and Maynard were really tight, and this is just about Layne's struggles with drugs.  i could be wrong, but that would correspond to his artist friend people have been talking about that only does good when hes high.  anyone else heard of this?\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nThe ad, sober lyrics page: \"Alcohol and Detox Treatment\"... IS THIS, the day to whistle?\r\nSober is intense, it captures the emotion, the music is constructed well.  They can't see past their hatred.\r\nEnjoy the $.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\ni think this song is about how fucked up life is how u want what you want and don't get it and getting fucked up whether it be drugs or achool is a wa to get out and have something you enjoy in a way but i also beleive there are a few rreligous ideas in here as well just my thoughts\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\nTo me, Maynard is speaking in the perception of someone addicted to drugs and alcohol who believes in God.  Anyone with a drug problem who has faith in God will ask, \"Why can we not be sober.\"  He also speaks in the substances point of view when he says, \"I am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down.\n\r\nTrust me.\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nnot 1 of you noticed the fact that he says, \"why CANT we NOT be sober\"- that is very significant and the whole level of confusion it adds to the song has something to do with its message, which although in part about religion, is not totally about religion as all of u have said. no tool song out there has ONE SIGLE meaning, he write songs based off of many emotions and events trying to fuse them all together.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\ni thought it was about doing acid in a creepy house from the video\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\ni never thought this song was this hard to understand.... \r\nevery1 has different interpretations but most i see is on 1 line ..\n\n\r\nthe song is about drugs and his past haunting him constantly and how he wishes he could live his life on drugs and alcohol...\n\r\nThere's a shadow just behind me,\r\nShrouding every step i take,\r\nmaking every promise empty,\r\npointing every finger at me.\r\nWaiting like a stalking butler\r\nwho upon the finger rests.\r\nMurder now the path called \"must we\"\r\njust before the son has come.\r\nJesus, won't you fucking whistle\r\nsomething but the past and done? \n\r\n(this is all about his past haunting him everywhere he goes)\n\r\n\"the chorus.. is \"jesus wont u fucking whistle something but the past and done\"\r\nits pretty much spelled out for u there.....\r\nhe goes deeper into his own problems saying hes a worhtless liar and will only complicate u\r\n (a popular roch quote if u listen to rock music)\r\nand how he lets every1 he knows down\n\r\nthis song is not a love song \n\r\nultimately \"why cant we not be sober\"?\n\r\nhe wants to drown his problems in drugs and alchol\n\r\nits debateable but this is definetly not a love song ..Bonedaddy..stonetemplechick... ur jsut trying to relate it to ur own situation.... whcih every tries to do ... especially females.. they relate everything to some kind of a love song... when it is obviously not...\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nthis song is absolutely about some one's battle with a drinking problem. But there is some imagery that leads me to believe that this person has done the sobriety thing in AA or something. Yeah, most definitely someone who is very familiar with the inner workings of the alcoholic mind. I am a recovering alcoholic myself...and a lot of these lyrics really ring true for me. It is a fucking struggle.\r\nThis is a great song!\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nI don;t think it's that much about alcohol but it can be tied to the song. It's about looking for mappiness but never finding it, and eventually it's all what keeps us going in life, so your pretty much just denying the inevitable... If you watch the video for it it's some guy just walking around searching for somthing I don't think he even knows what, it just keeps us going sometimes.\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nbefor all, I find this song powerfull.\r\nlike almost all of Tool's songs.\n\n\r\nI think here sober means 'too realistic' or taking everything for granted.\r\ncuz it's hard when you try to make some things better\r\nand the people dont want to listen to you cuz\r\nthey see u as a bad person [worthless liar, imbecile etc.] as u were when you made\r\nsomething wrong.  so it's kindof about preconception.\n\r\n[english is not my mother language..so I cant really\r\nmake my point. ^^]\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nbefor all, I find this song powerfull.\r\nlike almost all of Tool's songs.\n\n\r\nI think here sober means 'too realistic' or taking everything for granted.\r\ncuz it's hard when you try to make some things better\r\nand the people dont want to listen to you cuz\r\nthey see u as a bad person [worthless liar, imbecile etc.] as u were when you made\r\nsomething wrong.  so it's kindof about preconception.\n\r\n[english is not my mother language..so I cant really\r\nmake my point. ^^]\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nhes talking about how he hates his life. he doesnt want to be in his normal state of mind and he hates the world. 'why cant we not be sober?' the dulling of senses is where he wants to be all the time,he wants it to be the standard of our perception of out existence and the center of mind. he also says 'jesus wont you fucking whistle something but the past and done' hes saying he wants god to show us something other than whats already past,whats already been done.its a sad song,and as always with tool amazing lyrics\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\nguys, it's called acid, and most Tool songs are about it, even in a slight way.\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nmy vote is for another song about Christianity.\n\n\r\n\"I will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down. \"\n\r\nreferring to the finding of jesus (from 1st person, other than maynard) and destroying the true meanings of everything, and sort of messing it up.\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\nI'm usually not on this site anymore, but I have an interesting piece of information to share with you guys.\n\r\nApparently, the lyrics to this song are way old, dating from early 1987. In March 1986, Maynard formed a band called Children of the Anachronistic Dynasty (C.A.D.) with another guy named Kevin Horning. They made an album called Fingernails with 13 tracks on it, mostly experimental stuff and noise collages. It's not very good, but everyone's gotta start somewhere. Fingernails, apparently, is now widely available on the Internet in MP3 format.\n\r\nAnyway, after Fingernails, C.A.D. added three more members: Todd Horning (Kevin Horning's brother, second guitar), Stan Henderson (really tall and strong freaky-looking black dude, on bass), and Tom Geluso (some other dude, on drums - on Fingernails, Maynard used a drum machine because they didn't have a drummer). Anyways, they recorded another album in early 1987 called Dog.House, which is extremely rare. Very, VERY few copies are known to exist, and, unlike Fingernails, cannot be found anywhere on the internet. It shows up occasionally on eBay every now and then for upward of $100. There was this really nice guy who owned a copy of Dog.House and posted the tracklist on his website, but I'm too tired to try and find the link (don't worry, Google it, you'll find it easily).\n\r\nAnyway, there was this one track on Dog.House called \"Waiting for the World\", which contains most of the lyrics from Sober, but with a very different melody. Therefore, this means that Maynard must have written these lyrics before April 1987, and possibly even in late 1986. The earliest recorded version of Sober (with the melody and everything), was in 1991, on the \"72826\" demo tape, which can be found on YouTube (search for \"72826\"). Also, here's a video of C.A.D. from their only concert ever, on April 17, 1987 (which, coincedentally, was the date of Nirvana's first-ever concert and Maynard's 23rd birthday) at the Peace Day event in Grand Rapids, Michigan (where Maynard lived from 1986-1987). However, I must warn you, this was the 80's, and you'll never look at Maynard the same way after you watch it:\n\nyoutube.com/…\n\r\nIt's them (with Todd Horning, Henderson, and Geluso), performing \"Mandango Lover\", the third track from Dog.House. Enjoy.\n\r\nAnyway, I just wanted to tell you all the history of Sober's lyrics. Just thought you should know. :D\n\r\nSee ya!\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nI'm the guy who posted the last comment... luckily I've found the only live recording of \"Waiting for the World\" on YouTube! It's from the April 17, 1987 concert that I mentioned...\n\r\nIt's... wow.\n\nyoutube.com/…\n\r\nEnjoy!\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nAnd actually, it's not called \"Waiting for the World\", it's actually \"Burn About Out\" and it DOES have the full melody, but an instrumental chorus, and VERY different lyrics, and can be found on Fingernails.\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\n\"Murder now the path called \"must we\"\r\njust before the son has come.\"\n\r\nI think he says \"Because\" instead of before.\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nO.K. - kids, this is what it is.  Maynard is just sugar coating (it) to make it easier to swallow.  The Son of  Man has once tried to come and save us in the Past.  Humanity was blinded by what (they wanted).   Murder now the path calledâ\u0080¦\tmust we?  Jesus questioned why should he drink from the cup of blasphemy  when it was so much easier to teach us of were  Man really and truly came from.  Jesus spoke in riddles, much as Maynard enjoys to do.  Man was not ready for what Jesus wanted to teach.   So he let us drink from his blood so we remained un-sober.    His mother Mary only whispered his teaching thereafter only due to fear.  Time went on, and the whisper became many, and complicated the Truth.  We all have became worthless liars, ready to elevate, and only just to bring down why Jesus drank from the cup of blasphemy; dying and taking all of what was true with him, only to leave humanity to distort it.   Maynard set this poem up so we may take from it what we want â\u0080¦ much like the whispers of the Bible.\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nAlso note the original lyrics of Sober from Maynard James Keenan on his project of 1991 called (Satan) â\u0080\u0093  â\u0080\u009c72826â\u0080\u009d -  They are poetry from the Tool Shed.  A little help from an ancient friend who never lied to us.   \r\n-  Jesus wonâ\u0080\u0099t you fucking whistle, (something but the past), its done. \r\n- Mother Mary wonâ\u0080\u0099t you whisper something (but the past), its done.\r\nWe want what we want.  Lies, cause the truth is to damn scary.\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nThis almost sounds Christian in a way\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\ni think this song is about a alchoholic who had just recovered but hes starting to relapse. \"Theres a shadow just behind me....\" is about his drinking problem and how its sneaking up on him. then when its says \" i am just a worthless liar.  i am just imbecile....\" is about how hes relapsed now and how no one should trust him. \n\r\nthats what it means to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nim not sure about the greatest tool song but it is up there wt sweat, 46 & 2, anema, and well just about all of them\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nThe truth of the matter is (to all you tool fans) Tool sucks, and for alot of you, who post comments saying , I think it's about this, or I think it's about that, you obviously don't have a clue what the song is about. Why would anyone like a song that uses blasphemy by cursing at God? What kind of sick people like music like that. The honest truth about the meaning of this stupid song is that it has no meaning. Tool just put together alot of stupid un Christian Lyrics knowing that alot of naive fans (like many of ya'll) Would buy their stupid albums. Oh and, this song has nothing to do with asking God for forgiveness. Why don't ya'll  just stop following the crowd and start listening to good music?\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nbigrobkerr...AHAHA....look at this shit...hes only got 2 comments..one is a tool sucks because i cant understand big words and his other is how much he loves shinedown......AHAH..i dont even have to make fun of you...your idiocy does it all for me\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\n....I am not exactly sure what this song means or is about, but i would have to agree with the guys on page 2 of the comments and say that its about a love that was broken apart and now the he wants her back. also, at \"six feet under hell\", I don't think that any song with \"Jesus\" and \"Fucking\" in the same sentence... or even in the song, would be considered christian (or even sound christian).\n\r\n---Jesus, won't you fucking whistle\r\nsomething but the past and done?\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\ngosh everyone in this fucking site is a fucking retard\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nAnyone interesting in the original 72826 demo?\n\ntooldemo.net\n\n\n", "comment_244": "\ninterested* lol. The chorus is performed differently in that version. I'll post the lyrics soon.\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nI agree totally with bonedaddy, the past and done thing, my opinion would be what is done is done and u cant fix what already was and is and your totally screwed now?\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nI think this song is talking about the effects of drugs on your mind, while peaking on them. 'Why can we not be sober, i just want to start this over' is talking about how angry you get with yourself for doing them, and 'why cant we sleep for ever' is because marajuana makes you lazy. I dont personally do drugs, but i have heard of the things people will do 'i will chew it openly' and\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nI love how most Tool songs can pretty much mean anything to anyone.  Don't listen to anyone on this board, as Maynard would say: \"THINK FOR YOURSELF\"  I think that Maynard writes his lyrics about very personal issues that we as the audience could never truly understand, but he is writing is so genius that we can bring our prejudices and experiences to the table and decide what it means to us.\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nThis song is about severe addiction, and the self hatred that comes with it\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nI remember when I was three, seeing this song on tv as the only live proshot of tool. I've been listening ever since.\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\nThe vocals on this song are amazing. I'm in a 6-state middle school honor choir, but I want Maynard's pipes... Just remarkable.\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nwhat's the point ?  Every1 is living in altered states in comparison to every1 else, why can't we be messed up until our own death its our decision.  This dude Mynard wrote it about is definately paranoid/afraid when he's not drunk.  Unreliable, just lives to get drunk.  What's past is prologue or what ever, live for the now and what makes you happy...regardless of the well being of others???  No, I don't suggest this song to any1 it's sad it mocks Jesus, and his Mother.  They got drunk back then, too.  Its nothing new.  idk what i'm trying to say, this song is pure concentrated evil i e shit\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nthis song is an amazing song, it reminds me so much like myself and what has been happening to me the past few weeks. everything in this song reflects on me in ways. in ways to do with my newly ex-girlfriend and what has been happening in my family. \r\nthis song was written about a friend of the band whose artistic expression only comes out when he is under the influence of drugs, that is what adam jones has said in an interview.\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nits about the inevitability and frustration of in. your sins simply build up as you age and you can't start over with a clean sheet. instead of judging you on your character we are told we are disgusting because of our past sins.\n\r\n'Jesus, won't you fucking whistle\r\nsomething but the past and done? '\n\r\nthis quote is saying how god only blows the whistle on sins that are past and done and can't be changed no matter how much we regret. \n\r\nits another strike at rediculous christianity.\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nDefinetely has more than one meaning. Includes insults to christianity, drunks and more.\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nDoes anyone think that the way intoxication is depicted in this song has anything to do with Karl Marxist idea of religion being opium for the masses? Just a thought...this song definitly has religious themes within it and this interpretation could make sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\nThis song is about Maynard's friend, who was a painter/sculptor or something of that nature, who could only unlock his creativity while he was drunk. He's trying to say theres nothing wrong with that, even though people tell him its wrong. \"Jesus, won't you fucking whistle, something but the past and done,\" means to stop repeating yourself about how bad it is to be drunk. And \"Why can't we NOT be sober,\" and \"Why can't we drink forever,\" means whats wrong with being drunk, if it helps you to create?\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\ntool blows. but i actually like this song.\n\r\nbut i like staind, and i like thier cover better.\n\r\njust pointing how tool blows.\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\ntool hablando sobre cÃ³mo la religiÃ³n y su falso envoltorio te embriagan y te \"elevan, sÃ³lo para dejarte caer\". notable canciÃ³n.\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nChaDMcBaDD first off i wanna laugh at you for the name.  but dont post anything if you dont like the band.  and if you like the song but like a shitty band that leeches off of the \"x\" generation like Stained.  than dont say it,  cuz theres a lot of tool fans that would shoot you for a dumb comment like that.  anyways,\n\r\nI always go for the meanings I and I alone got from the song and not what the author was thinking.  I felt it meant that theres a religious part of us that is looming over our heads because we as humans secretly have doubts about what we believe in.  I felt \"murder now the path called \"must we\"  was about how jesus's sacrifice makes the old testiment meaningless.  and christianity and judism ect.. a hypocrisy.  I agree with the interpretations about the jesus whistling part.  Every time i have drank i have felt like the chorous of this song the next day.   its a good reference for how we feel about intoxication spanned over our lives.   i think the second verse is about the depression or self hating tied into alchoholism. sorry this is long but i really love this song.  finally what i interpret from this song is how alot of religions have a tie to intoxication and how religion is a hypocrisy and how we all wish we could stay in the \"euphoria\" feeling during intoxication forever.  Tool is awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nI couldn't agree more with you Zakkun1m, but even if that isn't the meaning, I don't think any of us here will ever feel the meaning of this song that Maynard has created. He has an incredible outlook on life and is an absolute genius in the field of art, so I don't think it's really necessary to lock in to one particular meaning of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nThis song is about escaping the past. It seems like there is drug and alcohol abuse. \n\r\nThere's a shadow just behind me,\r\nShrouding every step i take,\r\nmaking every promise empty,\r\npointing every finger at me.\n\r\nHes trying to change but something wont let him. It overshadows everything good. Every time he decides to change it alway comes back to overpower him. It reaches out to everyone and points their fingers at him. Not only does it ruin his life by controlling his addiction it controls everyone else and makes them scold him. They all need help because this problem effects the people around him just a much as him.\n\r\nWaiting like a stalking butler\r\nwho upon the finger rests.\r\n*Anytime he has any need at all or the slightest discomfort the alcohol is immediately there to make things perfect for him. Just like a stalking butler it lives \r\nto take away any thing that displeases.\n\r\nMurder now the path called \"must we\"\r\njust before the son has come.\r\n*In English (Must We) is Perfect Past. So if you murder \r\nthe perfect past just before the son has come. You take away the story of Jesus. Jesus saved. He loses his\r\nfaith right before change happens. Without believing in \r\nJesus the change in his life cant work.\n\r\nJesus won't you fuckin whistle...\r\n*If you look back into the first part of the verse you will notice that there is a shadow that covers him...like a shroud. The church teaches Jesus is always with us.\r\nSo ..If hes in the shadow with Jesus he wants Jesus to whistle in the dark. To \"whistle in the dark\" is to inspire faith and give hope. He's had enough of waiting. He's desperate and needs change now. He's angry at Jesus for taking his time.\n\r\nSomething but the past and done..\r\n*He wants to hear something other than replay all of the memories of bad things hes done in the past.\r\nI imagine the bottle to either be there and hes struggling not to pick it up..or the alcohol is readily available..\n\r\nMother Mary won't you whisper...\n\r\nI think this is a reference to \"Let it Be\" by The Beatles.\n\r\nWhen I find myself in times of trouble\r\nMother Mary comes to me\r\nSpeaking words of wisdom, let it be.\r\nAnd in my hour of darkness\r\nShe is standing right in front of me\r\nSpeaking words of wisdom, let it be.\r\nLet it be, let it be.\r\nWhisper words of wisdom, let it be.\n\r\nThis is what the *Sober* means to me.\r\nThe first time I heard it..I thought it was an attack\r\non religion.\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\nOK guys, ready for the real meaning of this song? I'ts not about drugs or addiction or what everyone thinks EVERY song is about. It's about religion and he is saying, \"Why do we have to prove ourselves to a god why can't he prove himself to us?\" In the first verse he is talking about Jesus putting guilt on people to do what's \"right\" and when he says \"Jesus won't you fucking whistle\" he is basically saying \"If you care so much do something, get my attention\" The second verse is talking about Satan being deceitful and how he will tempt you and eventually make you fall... But what tool is saying is it's all a bunch of shit and to do do what you want because either way is retarded and you should live your OWN life. If your not sober it's your choice\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\n... and most of tools music is \"attack on religion\" he believes religion is oppression\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\ndickjames does have a point but Tool doesnt always mocks religion. \n\r\nOne piece of evidence is in the album \"10,000 Days\" the songs Wings For Marie and 10,00 Days.\n\r\nThese songs show that they don't really attack religion but only question it. I think Maynard really does think in a higher power but as any true person should do is to question it. Though our knowledge may be our lock it is also our key to move forward. To question is to know more about one self and others. \n\r\nAs the law states, \"For every action there is an opposite and equal reaction\". Life doesn't just start something has to cause it. And in turn come the lyrics:\n\r\nThere's a shadow just behind me,\r\nShrouding every step i take,\r\nmaking every promise empty,\r\npointing every finger at me.\r\nWaiting like a stalking butler\r\nwho upon the finger rests.\r\nMurder now the path called \"must we\"\r\njust before the son has come.\n\r\nThis part of the song may mean God, Jesus, and Mary all together. Our shadows are our past. But we must go down to rise up.\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nHas anyone sought the relationship between Judus and the song the, reason why this person wants what ever happened the night before not come to fuition the next day. This whole song to me would discribe the feelings Judus had the next day after he defied Jesus and asking himself why.\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\ni just realized something...\r\ni know some Tool songs have numericly-arranged lyrics...\r\nWell, in this song, its an alternation of 7 and 8 syllables. \n\r\nLook at this:\n\r\nThere's a shadow just behind me, (8)\r\nShrouding every step i take, (7)\r\nmaking every promise empty, (8)\r\npointing every finger at me. (8)\r\nWaiting like a stalking butler (8)\r\nwho upon the finger rests. (7)\r\nMurder now the path called \"must we\" (8)\r\njust before the son has come. (7)\n\r\nJesus, won't you fucking whistle (8)\r\nsomething but the past and done? (7)\n\r\nWhy can't we not be sober? (7)\r\nJust want to start this over. (8)\r\nWhy can't we drink forever? (7)\r\nI just want to start things over. (8)\n\r\nI am just a worthless liar. (8)\r\nI am just an imbecile. (7)\r\nI will only complicate you. (8)\r\nTrust in me and fall as well. (7)\r\nI will find a center in you. (8)\r\nI will chew it up and leave, (7)\r\nI will work to elevate you (8)\r\njust enough to bring you down. (7) \n\n\r\nMother Mary won't you whisper (8)\r\nsomething but what's past and done. (7)\r\n-----------\r\nNice sctructure, eh? thats why these lyrics sound so good - they have structure.\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nThe guitar intro it's like an orange light moving behind the scene and fading - cinematographic stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nI wouldn't say this is tool's best song, but its up there. \r\nto me, it almost sounds like maynard is sad when he's singing it. \r\nI guess some people interpret this in different ways but I interpret it quite literally as some who is an alcoholic.\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nI wouldn't say this is tool's best song, but its up there. \r\nto me, it almost sounds like maynard is sad when he's singing it. \r\nI guess some people interpret this in different ways but I interpret it quite literally as some who is an alcoholic.\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nthe song is loud & clear ...it is fearless attack on the fucking religions... the main question here is why we can not live without this stupid dogma.\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\nMurder now the PATTERN MUST WEAVE,\r\nJust BECAUSE the SUN has come,\n\r\nAt least that's what it sounds like, and I think it makes more sense, though I could be wrong...\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\n\"Why CAN we NOT be sober\"\r\n(Why must I be faced with this choice)\r\n\"I just want to start THIS over\"\r\n(Wants to start the PATTERN caused by use of drugs/alcohol again)\n\r\nOnce again, that is what I believe is said on the album and it also seems to make more sense...\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nI believe this song is an existential treatise of sorts. One that deals with the idea or rather impossibility of sustained transcendence. We at times find ourselves in a brief moment of elighntenment or ectasy however such moments are temporal and we inevitably find ourselves 'sobered' by reality.\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nMost of you are wrong. Not about drugs or anything like that. Don't you guys see the cynicism in this song? The lines \"murder must we\" before \"the son\" refers to how the apocalyptic times will be bad and people will kill each other. And the part of \"can't you say somethign past and done\" refers to the fact that he wants to find a solution in religion, but all he finds is blame, and the past and done just refers to the blame. The rest is about how trying to be perect makes im feel insuperior and dirty. THAT is what this song is about. Not silly alcohol.\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nOh, and staying sober refers to \"not sinning\" but the impossibility of not sinning. Its a very cyinically angsty song, but so true\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nrighhttt dunoi if anyone has said this already but i reckon this song is a metaphore for religion as in religion b eing the drug. and how religion makes you feel worthless by telling you that you must repent and conform to their society \"I am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down.\"  these lines show that in the song religion can be seen as lies \n\n\r\nits kinda hard to explain but ah well\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nYou retards......\n\r\nTool guitarist Adam Jones has stated in an interview that the song is about a friend of the band whose artistic expression only comes out when he is under the influence. \"A lot of people give him shit for that,\" Jones explains. \"If you become addicted and a junkie, well, that's your fault.\" \n\r\nThat's what the song Sober is about.... Sometimes we take lyric's and understand them from our own intrepretation, etc. but a lot of times when we do that we miss out on the grand scheme of things... if ever in question do your research before you post your \"meaning\" of a Tool,APC or Puscifer song.\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nThis song was written by Dana Carey. It was about how he battled himself on getting sober. I can relate to him, being a drug addict and all.\n\r\nPrison Sex is a good TOOL song as well\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nThis is my new favorite song, I've always heard it, and even did a cover of it. But until me and my girlfriend recently had an argument I didn't understand it too well. She never wants to be sober, and she's always sleeping with her free-time, it breaks my heart but this song reminds me of her so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nHave you guys heard this? It's almost as great as the original song.\n\nyoutube.com/…\n\r\non topic; i don't know what this song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\ntheres a really weird bit at 4:02 and then again a few seconds later. If you listen closely, I always think its my mum calling me or something! \t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nI've been to inpatient rehab and various drug programs...heres what it means to me...\n\n\r\nThere's a shadow just behind me,\r\nShrouding every step i take,\r\nmaking every promise empty,\r\npointing every finger at me.\r\nWaiting like a stalking butler\r\nwho upon the finger rests.\n\r\nThis part for me talks about the fact that the drugs/alcohol is always taunting you to use it. its there for you to get ahold of and is always in your head. \n\r\nJesus, won't you fucking whistle\r\nsomething but the past and done? \n\r\nTo me this section means we have values that our parents taught us or that society taught us. Dont use drugs, follow what the bible/religion says...If the bible/religion is so correct, why are these things here? Why are am i able to ruin myself in this?...Im talking about this in the point of view as if you were messed up on drugs, listening to this song, and WANTING help...like I am now. I guess this part basically makes an addict/alcoholic think \"If there is a god/jesus/higher power...where are they. How could they have let me get into this mess\"\n\r\nWhy can't we not be sober?\r\nI just want to start this over.\r\nWhy can't we drink forever.\r\nI just want to start things over. \n\r\nThis for me is exactly what I have felt in my rehab phase with drugs ( i am now an alcoholic)...every addict thinks about these exact questions. You wish it was over. You wish the pain was gone. \n\r\nI am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down.\n\r\nOk, this part makes me think about how I, and most other addicts/alcoholics are. We lie, we steal, we cheat, we do whatever it takes to make you trust us so we can take as much as we can from whether its money, love, a place to live, sympathy...anything. \n\n\n\n\n\n\n", "comment_283": "\nBoneDaddy: I think you nailed it, the song is about obsession.  I am an addict; drugs are just another lover, and obsession for me.  For me this song has two parts \n\r\n1) There is me:\n\r\n   I am just a worthless liar.\r\n   I am just an imbecile.\r\n   I will only complicate you.\r\n   Trust in me and fall as well.\n\r\n2) Then there is the addiction:\n\r\n   I will find a center in you.\r\n   I will chew it up and leave,\r\n   I will work to elevate you\r\n   Just enough to bring you down\n\r\nSo many times I wish I could start things over and never took that first hit, never left my little boy home alone, never lived on the street, never was raped, I just want to start things over!\n\n\n", "comment_284": "\ni'm pretty sure this is about drinking booze to forget the past... you feel like shit and worthless, etc, so you divulge in binge drinking.  \t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nI think this is a good song. I like the lyrics and shit, but I don't agree with the message, cuz I'm Catholic, and because my family and I only go to church on X-mas eve / X-mas, and I don't think religion brainswahes people. I think that ppl choose to let themselves become brainwashed by religion and shit, cuz everyone has the ability to make decisions on their own. Sorry if I was ranting there, that's just what I believe. Good song though...\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nOh, and Meredith8490, if you don't like Tool, then don't bother posting on their songs, cuz I honestly don't care if you don't like Tool. Everyone is entitled to their own opinions, but still. Oh, and just for the record, rap sucks! \n\n\n\r\nRap (n): An acronym for \"Retards Attempting Poetry.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\n i bet most the people saying best tool song have not heard many other tool songs its just because this is the most mainstream song they have,as for the meaning i think hes saying like he is always taking drugs or getting drunk and why cant i be happy sober without drugs and alcahol\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nThe line \"I want what I want\" at the end of the song suggests to me that Maynard actually had himself in mind when writing this song.\n\r\nThe sleep deprivation associated with different drugs (amphetamine for example, or the withdrawals from opiates) can cause a user to feel like they have absolutely no control over what they say/do and how they say/do it. From first-hand experience with crashing on speed, nothing seems more relavent than this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nIn my opinion you're on to something SpunkySkunk347 when you say that Maynard may have had himself in mind when writing this song. However, while I definitely consider the possibility that a peak and the comedown from a drug-induced experience may have had a lot to do with the fuel for this song, I think the end result of the lyrics has a lot more to do with power.  I have a feeling that whatever may have been the plateau (I suspect a spirtual experience) caused both an awakening, and simltaneously, soon before, or after, regret for the way life has been carried out.\n\r\nI also think that the slamming of Christianity in this track makes way for the song to draw the audience in through a sense of empathy for those who are lost and search for meaning- those who reject Chrisitanity, or more broadly, overtly organized religion.  The slower section \"I am just a worthless liar....\" is the narrator struggling with one's own power, or perhaps even tricking the audience to seem as though Maynard wouldn't want people to follow him while that might be exactly his goal as after the last time Maynar sings that section he repeats \"trust me\" which is up in the air, it could be a sardonic take on Jesus's words, giving in to the will to influence others, both, or the mindset during whatever inspired the song lyrics taking over the narrator, shouting over what could have been individuality, or it could be the major cataylst for Maynard's will to define himself as an individual, or again, both.\n\r\nWe don't don't definitely what Tool's songs are actually about. I hope this blurb may have shown that there are a variety of possiblities as to the meaning of the song that may be equally credible, as to not get locked into thinking one take on it is the only true way of interpreting the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\nI think it's about the duality of his personality.  There is an evil part of him(the shadow).  Although he likes to think he's good.  He has learned that he can go into a relationship with the best intent, but in the end he won't love, but will destroy his lover.  This song is about the pain of being so evil.\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nThis song is about self hate.  Maybe the drugs/woman/religion/whatever caused the self-hatred, but this song is definitely about hating oneself.  \n\r\n\"I will only complicate you\r\ntrust in me and fall as well\"\n\r\nHe's saying here, basically, that he fucks everything/everyone up.  He wants people to stay away from him because he's not worth it, and he hurts people unintentionally.\n\r\n\"I will find a center in you\r\nI will chew it up and leave\"\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nWhat I think, this song is about a character who fucked things up with someone they're in love with.\r\nThe character feels foolish and wishes they could start it over.\r\nThey blame themselves for the failure in attaining/within the relationship. \r\nSimple as that.\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nThe music kinda sounds like \"Kashmir\" by Zeppelin.\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nThis song has a few different meanings to me.  One relates to religion and the notion of appearance vs reality.  The effects of sobering up or waking up from your dogmatic slumber can be a very unpleasant experience (like a hangover), which in turn leaves many people wishing they could stay ignorant since their is sucurity in ignorance (search the alegory of the cave by Plato for an excellent example of what I am speaking about).  \r\nAnother dominant theme in this song relates to interpersonal relationships.  Similar to many drinking experience that we have all had that are well intended, and are at times used as means to forget about problems in previous relationships, we can see our new relationships going into the same downward spiral as the old ones, which in turn can give you a sobering feeling, one that you wish would just go away.  So in many respects it is a very cyclical phenomenon.  We get into new relationships to forget about old ones, then find ourselves making the same mistakes as we did in the previous one.  The sobering effect only makes you yearn to start a new and forget about the past.  But in the end we realize that it is better to stay sober, and try to learn from our mistakes and hopeful learn from them instead of forgetting about them. \t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\nOkay, I've read a lot of good ideas about the meaning of these lyrics and here is my take on two versus in particular. \"Jesus blow your *** whistle sometime before the past and done\" Okay, to me and the reference to \"Mother Mary won't you whisper sometime before the past and done\" is a hint pointing to the writer's Catholic upbringing and wondering why he was never stopped, \"supernaturally\", from making the bad decision that ruined his life in the first place. The whisper from Mary being mostly a Catholic thing, as Catholics put Mary on a level near Jesus. So, Jesus didn't \"supernaturally\" intervene and stop him from making the BIG mistake that he wishes he could take back. And Mary didn't do her part and \"whisper\" any words of warning for him to head before the past and done, so basically he's saying that he was allowed to go past the point of no return and, of course, blames his \"Higher Power\" for letting him learn a lesson the hard way. I'm not a Catholic but a christian, nonetheless, and I say Jesus has been blowing the whistle ever since he arrived. His message, in the  case of the writer, has fallen on deaf ears or else he could have been saved from himself before it was too late. I believe others have accurately surmised the rest of the lyrics as they pertain to the sin of \"consumption\". This song is like a cry for help that was never heard- the resulting loss of this man's soul. Very sad indeed....\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\nI was in high school, when my English teacher assigned us all a project, where you had to type out the lyrics to a song you liked and describe what it meant to you.  Well, the entire basis for this website, frankly.  I remember sitting there, listening to everyone else's.  Most of them were awful, considering where I grew up.  A lot of country songs, which you don't exactly need to interpret, and songs by Whitney Houston, Nirvana, and Bon Jovi.  My turn came to read the lyrics to Sober, which required some censoring.  What a grand day it was, when I was able to basically make 90% of that class uncomfortable with the \"Jesus blow your *** whistle\" line.  Awesome memory.\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nI would say, the main charactor is feeling scared. Cause he lies, hes a different person then himself.\n\r\n\"There's a shadow just behind me,\r\nShrouding every step i take,\r\nmaking every promise empty,\r\npointing every finger at me.\" [Its not real people pointing figers or watching what he does, its all in his head]\n\r\nAlso alot of it is past and future. \n\r\n\"Murder now the path called \"must we\"\r\njust before the son has come\"\n\r\nMurder \"must we\" [man and women] \"just before the son has come\" [baby]\n\r\n\"I am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down.\" \n\r\n[I am someone who i am not, I will corrupt you, i will ruin you. Even tho i'am myself.] Understand it?\n\r\n\"trust in me and fall as well\" [friendship or relationship, whichever,] [everything will be fine when we part as well] \n\r\n\"jesus wont you fuckng whistle\" [jesus wont you tell me whats wrong?]\n\n\r\n\"Mother Mary won't you whisper\" [wont you explain it all to me?]\n\r\n\"why cant we not be sober\" [see the world in different eyes]\n\r\nthere so many fuckin metaphores to their fuckin songs.. wtf\n\n\n\n", "comment_298": "\nAside from the fandom, I believe that the lyrics post a very educated view of religion. People need a savior, a \"higher being\" If you will, to console them in their constant questioning of what is beyond death. This turns into a need and becomes a sickness that consumes the follower, causing them to protect these beliefs at any cost, making them blind to their own hypocrisy.  \t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nHere's what I see from my experience...\n\r\n\"There's a shadow just behind me,\r\nshrouding every breath I take,\r\nmaking every promise empty,\r\npointing every finger at me.\n\r\nPeople take stories from past mistakes of people and point at people's faults (or \"sins\") as being bad. Then promise all sorts of things if people trust them.\n\r\nWaiting like a stalking butler\r\nwho upon the finger rests.\n\r\nIt's wrong to judge people's behavior as bad in all cases based on the past.\n\r\nMurder now the path called \"must we\"\r\njust before the son has come.\"\n\r\nI think this is Tool's philosophy. Rather than blindly following a bunch of rules based on stories of the past, we should think for ourselves. Before the son comes back, we can live virtuously without needing rules to be kind and just.\n\n\r\nI keep thinking about the line Mother Mary won't you whisper something but the past and done\n\r\nOnce my family had an Easter cake with Mary on it and the nose was really long. I joked that she was lying. My dad didn't really like it much.\n\r\nThen there's the line Jesus won't you fucking whistle something but the past and done.\n\r\nI had another experience where my pastor broke the bread just after I had been staring at the art on the wall. A bright light happened to be in my left periferia. So when I looked at the broken bread it looked greenish.\n\r\nI knew these were just coincidences, but I couldn't help but think that these stories are old. I wouldn't say they're irrelevant, but we all just keep telling each generation the same story. We're not allowed to think differently, and have our own new ideas. Like, maybe Mary lied to save herself. Why can't we just wake up and think for ourselves? Why are these stories still relevant today?\n\r\nfrom the movie script Saved!...\n\r\n\"She was found to be pregnant\r\nthrough the Holy Spirit.\n\n\n\r\nWhen he had contemplated this,\r\nan angel of the Lord\n\n\n\r\nappeared to him in a dream\r\nand said, \"Joseph, son of David,\n\n\n\r\n\"do not be afraid\r\nto take Mary as your wife\n\n\n\r\n\"because the child conceived in her\r\nis from the Holy Spirit.\n\n\n\r\nBehold, a virgin shall conceive\r\nand bear a son.\"\n\n\n\r\nI know this is,\r\nlike, totally wrong,\n\n\n\r\nbut don't you ever wonder\r\nif she made the whole thing up?\n\n\n\r\nI mean, you have to admit\r\nit's a good one.\n\n\n\r\nIt's not like anyone could use\r\nvirgin birth as an excuse again.\n\n\n\r\nI don't really think she made it up,\n\n\n\r\nbut I could understand\r\nwhy a girl would.\"\n\n\n\r\nIn toolshed.down.net/faq/…\n\r\n\"Adam has said \"the song and video are based on a guy we know who is at his a artistic best when he's loaded.\"\n\r\nI like the idea people gave here that there is some good that came from this artist doing something \"bad\". We have to take on our experience on a case by case basis. We can't just tell people this or that behavior is always bad based on a past outside of our present experience. \"We barely remember who or what came before this precious moment.\" \"You can do what you want, but you have to take responsibility for what happens. If you become addicted and a junkie, well, that's your fault.\" One person said on here that the artist fried his brain in the end. Well that's what happened to Bill Hicks, anyway. Am I right?\n\n\n\r\nSo part of the human condition with our present chromosomes is that we are flawed. We aren't the greatest artists of life. So then what does the person in this song do? He tries to help us by telling us what we're doing wrong. So he's just as bad as who he's arguing against.\n\r\n I just want to start things over.\n\r\nI am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\n\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down.\n\r\nTrust me.\n\n\r\nHumans can hand down wisdom through the centuries about things our species do wrong. We promise people they will be saved if they follow their wisdom. It hits at the center of our being. It elevates people for a while. But eventually people are just let down. No matter how much we trust people who have good ideas, we ultimately fail anyway. We can't really change our human tenancies much.\n\r\nSo he's crying. Why can't we just wake up? Why do we have to keep telling each generation they are bad. Why can't we just leave these stories behind and just do good.\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nOK, the lyric is not DRINK forever, it is actually, \"why cant we DREAM forever\"\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\nI think there's only a jab at organized religion here, in that it isn't as helpful for everyone who's in a dark place like preachers would have us believe - some claimed to have been saved by it whilst others feel utterly cold to it. The protagonist of this song sees organized religion as bullshit and thus finds no saviour in it.\n\r\nI think the song is mainly about alcohol addiction. I mean if 'drink forever' is meant to be a metaphor for religion I don't think it's a good one since heavy alcohol consumption will bring you down whereas being a follower of an organized religion won't. A lot of the lyrics allude to a constant temptation to fall back on something, and what that is is spelled-out by Maynard in the chorus\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\nI am an alchoholic.  I will surely have no future.  Every day I wake up dying. pushing everyone away. I am an angry lover.  I will only scar your life.  Run as fast as you can. Avoid me at all cost.  Seperate me from your life.  Leave me to my misery.  only you can save yourself.  I am allready lost. I'm aware my ending fate.  I am here to educate.  my life is to be example.  there is still time. make a choice this is yours. -myonus\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nthis song is about how addiction drags you down and may seem great, however in your altered mind, the harsh reality is grinding away at your life and sucking you into a imminent death.  \n\r\n\"I am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down.\"\n\r\nexample, pretend that verse is alcohol talking to you, or put whatever you think should be there.\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nI think this song has two different speakers. I think part of the song is from the \"perspective\" of alcohol, the other half the alcoholic. The \"Trust in me and fall as well\", and \"I will work to elevate you, just enough to bring you down\" seem to be the booze talking. \n\r\nConversely, the main speaker talks about being stalked by his demons so to speak, making him full of regrets. This is what I presume to be the alcoholic talking. As for the \"Jesus won't you fucking whistle something but the past and done?\", it sounds kind of like, \"Won't you stop reminding me of the past? What's done is done.\"   \n\r\nAnd yes, I know that this song is about a friend of the band, who despite being an alcoholic, produces great works when drunk. \t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nOf course this song has many layers.(drugs and alcohol are one) Yet at its core I feel this song is about being sober from religion. Thinking clearly with out some one pointing the finger at you just for questioning or thinking differently. Now mind you that the lyrics at toolband.com says \"shrouding every BREATH I take\". In other words covering up every thing he says or misconstruding the meaning behind it. Or really any decision he makes. In religion they make promises like: your going to heaven or hell because of you decisions, and he finds these promises empty. \n\r\nI am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down.\n\r\nI think of the \"I\" as religion. \t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\nIt's about wanting to commit suicide.  Maynard is listing all the reasons why he should commit suicide.  That's my opinion at least.\t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nTaking into consideration the use of Jesus and Mother Mary in this song, I had an interesting take on the following verse.\n\r\nI am just a worthless liar.\r\nI am just an imbecile.\r\nI will only complicate you.\r\nTrust in me and fall as well.\r\nI will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down.\n\r\nI have always wondered if this verse was in any way a reference to Jerry Falwell the well known evangelist. (...trust in me and FAL as WELL).  He was, of course, well known for his extremely conservative social views which almost always demonized evil rock and roll.\n\r\nIt was stated in an interview that this song was about a friend of the band whos creativity would only come out when he was under the influence.  One of my interpretations is that in addition to drugs or alcohol people can also be under the influence of religious zealotry as well.  I just find the lyrics ring so true of how certain religions will brainwash you, take control of you, take your money, and raise your spirit, but not so much that they cant keep you down.  Finally theyll leave you hung out to dry when a time comes that you are in need \n\n\n", "comment_308": "\nThis used to be the only too song I ever knew.\n\r\nNow, since I've listened to everything they've made, I'd say this isn't even in the top 5 of their best songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nI think this one big satire..   In the beginning of the song Maynard talks about the \"devil\" and how believing in religion is completely ridiculous..   Why would anyone subject themselves to something so hellish as not being sober??  Being drunk on religion..\r\nThen he comes again from the devils point of view. \"I will work to elevate you, just enough to bring you down\"..  Later on the song hooker with a penis Maynard states that he sold his soul to make a record..   When in reality he does what he wants.. \"I want what I want\".  Which in it's own right is like making a pact with the devil bc you're not confining yourself to a god..  You're actually sober.. (which is like being drunk depending in the point of view you're coming from)\n\n\n", "comment_310": "\nTool could lead the new renissance of human thought with their songs if all people took a little time out of their lives and look inside themselves while listening to their songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\nI believe only that the first verse is from the point of view of the alcoholic.  The second (beginning with 'worthless liar') is from the point of view of the alcohol itself.  And the choruses are the desperate and angry addict begging God for mercy and change...praying.  In other words, he says, \"Why cant You give me anything different?!\"  \"How come I have to wake up and have a beer just like everyday before this one?!\"  It's like....when you are having a bad day and your phone rings...you say, \"Jesus! What now?!\"   Or when your husband dies and you are miserable everyday without him, you say,\"God Damn it! Can't I have a day where I'm not overwhelmed by lonliness like every other day before this?!\"        ...I myself do not believe in any traditional God.  But I see this song as a fight between good and evil and a prayer.  I believe that people see the metal-ish band screaming and thrashing around, and the singer belting the words \"Jesus\" and \"Fucking\" in the same sentence, and then they automatically think it is anti-God or something.  This I thought before knowing how Catholic Maynard's mother was.  As the son of devout Catholics, I can say with certainty that it is easy to go against your parent's beliefs as you become more mentally privileged than they ever were.  But if there was love shared between your parents and yourself, no matter what they believed, it is impossible to completely abandon what they believed and tried to pass down on you all their lives.  In other words, here is Maynard singing a song about prayer.\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nI know what the meaning to the song to me personally, it comes across as being about someone trying to right wrongs in his past, but he just keeps screwing it up. The other way this songs comes across to me is something I was discussing at a band practise a couple days ago. We were listening to Undertow and this song came on, and we just started talking about, my feelings on it were as how I wrote it on a peice of paper the night following.\n\r\n\"Tool's song Sober sounds like the soundtrack to depraved sex, but not bondage, the kind of sex where both hate each other but you're doing it anyway because ou need to fuck to relieve the stress, the anxiety, the anger, and it feels disgusting, wrong, and a waste of time, and you this will lead to something worse betweeb you two, you'll fall in love. At least that's what it feels like to me.\"\n\r\nAnyway, it's an awesome song, simple yet powerful. Hopefully Tool will continue to release music just as good as this.\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nMaynard is really the only one who could ever possible correctly break down this song. It's gotta be ver layered and such and have lots of interpretations as most Tool songs do. All I can say is when I am in a depressed state of mind and I feel worthless and nothing is going right for me in my life, this song always speaks to me. It's for whateve reason, a soothing salve. I feel better after I listen to it and it works for me in ways other songs can't. There are other songs that do this for me for, but Sober just may top the list and I think it does. \t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nThe feeling that I have taken from this song is the feeling of guilt or like everything has failed around you. You just want to take it all back, but you can't. So instead you drown your sorrows away by getting high or drinking. I also took the feeling that he is mad at religion for allowing this to happen.\n\r\nBecause of these past failures you feel like you will just hurt everyone or let them down. So all you can do is get high or drink. I always find myself compulsing over things I have done wrong in the past. I really like songs you can take your own meaning out of them when you apply your own experiences to them.\n\r\n-------------------------------------------------\n\r\nI don't really have a favorite tool song, because each and everyone is well thought out and perfectly preformed and arranged IMO. They each bring a different mood and feelings. I would have to say I find myself listening to Ã\u0083â\u0080 nima more than the other albums, but it really just depends on my mood.\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nI love this song. To me, this song is about a guy who knows he's no good for this girl but he wants to change and \"start this over\".. Idk, that's just my interpretation. It's probably wrong but whatever(x\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nSure this is a drug song. But even from when I first heard it, I always saw the \"drugs\" thing as being a metaphor. I always focused on the \"Just want to start this over...\" part. It was always just about anger and sadness and despair to me.\n\r\nAnd it totally kicks ass. ''']['''{[]} {[]} ][ - one of the best bands of our time.\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\nReligion is much more confortable than nihilism. Nihilism is sober and religion keep us in an inconscious state of dependency.\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nReligion is much more confortable than nihilism. The denial of all values take us from the incouscious state of dependency to the instability of disbelief\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nThis is a great song and undoubtedly a serious one but man, if I wake up early after a long night and I'm hung over and foggy and this song comes on I can't help but laugh, because I just wanna be sober again.\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nok i wanna take a stab at it it def a alchohol or drug adiction it has to be think about it i been strung out on alot of shit it def found a center in me chewed it up and left u can only get so high or drunk till u come down \"i will work to elivate u just enough to bring you down \" that shadow that follows him around is the adiction just waiting to be fed the chorus is talking about when he is sober and reality sets in and buzz is gone he wants anormal life begging god for it i will only complicate u trust in me and fall as well ? know any crack heads that fell in that hole and got up? yeah me niether thats my opinion\n\n\n", "comment_321": "\nI think most people are taking this too literally. Maynard never leaves anything as a single meaning, and this song among almost all the others has a double meaning. The first verse is a reflection of an inner self, the side of us all that only speaks of our every weakness, breaks down our self esteem with all our faults and fears. Maynard is very human as he has informed us many times, and he is always trying to connect with the rest of humanity on the deepest and most sincere levels. Its key that that this is apart of himself when he refers to it as a shadow that \"shrouds every step he takes.\" The chorus is most profound, as he begs the question we've all felt but maybe not put into words: why do we as humans, feel the need to be inebriated- not plainly with alcohol, that's simply a metaphor to get the point across- why is being sober so painful? People who have never done drugs may say that they are simply fine without them and never felt better- but they probably don't understand that every piece of fruit, meat, vegetables, or ANY kind of edible source they intake changes their chemistry in someway. Drugs are no different, it is just a much more vibrant effect. But no doubt to those of us who have experimented, life feels like eternal bliss when we are not sober, and that is the grand message of the song. The dark dissonance beautifully compliments this theme, and really had me re-appreciate it all together. And definitely as one other i noticed said, there are plenty of great tool songs, and they just really can't be compared. They are all so different, profound, and inspiring.\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\nIn my view it is on alcoholism, caused by love which has gone totally wrong. Its all too common that a man gets his heart broken, mostly through no fault of his own, and has no other friend left than the bottle. He begs to start his own life over, even to start over with her, but his soul has been scarred and fouled, by the event with his ex which destroyed him. A massive hole in his personality which he can only fill with alcohol. Perhaps he was accused (pointing every finger at me)of being a creep, implied by the first verse(waiting like a stalking butler). Religion hasn't helped him (jesus won't you fucking whistle), being sober didn't help, so in desperation of some kind of warmth and affection (i want what i want)(trust me) alcohol becomes his only friend. \n\r\nIn my mind it's followed up later by 46 & 2, where his soul is cleansed as he moves up to a higher, more meaningful level of thought,in theme of the whole AEnima album.\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\nThis was the song that got me into Tool. one of there best but they have way better songs like Opiate, Fourty Six and 2, Right In Two, and Lateralis(the way its spelled as the song) I think Sober is about being Sober of religion and being able to be a true free thinker. Religion being the root of all evil and expressed in other songs like Opiate from there first album. I think its saying how Jesus was a lier and a fraud. Trust in him and fall as well. If we were all sober from religion we could all work as one and breathe in union. the first two albums have by far the most straight forward lyrics. I think thats why the are the most popular\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\ni wouldn't be so bold trying to dismantle any of keenan's lyrics, so its just my request for all these guys that read everything literally.Please, don't!this song is about everything else, but not about being drunk. and also if you have ever noticed, keena often says he'll never disclose what he was thinking of while writing a particular song(reminds me of nirvana and their obscure lyrics dow)\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\nI don't think none of y'all are sober because I hear no screaming/whispering after the \"trust me\" part. \n\r\nWhat I do think however, is everyone can take their own meaning from a song. Although Maynard already specified this is about a friend, what I take from this is having a life that is full of guilt and pain, and the only way to get rid of that pain is to drown it out with alcohol and drugs...and just black it all out until the next life comes, whatever it may be. I think some of you are reading between the lines too much, which is a lot to say for a Tool song, I know. One thing I can tell you is never try to connect the music videos with the lyrics, you're wasting your time.\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\n'Jesus don't you fucking whistle.'\n\r\nDon't know why no one else picked that up.\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nI'm pretty I'm going to get a few people saying my interpretation is completely off but it's just the way I see it & how I've found this song relate to me. To me, it makes sense in the context of being in love or in some kind of close relationship with an addict from the addict's perspective himself. I just got out of a relationship with a meth addict just about every word reflects his point of view.\n\r\nI don't want to delve too far into my situation so here's what I get from this song:\n\r\n\"There's a shadow just behind me,shrouding every breath I take,making every promise empty,pointing every finger at me.\"- the day he started abusing his medication was the day he was hooked, the \"shadow\", which has been following him since. His addiction has influenced his choices so much to the point where he is no longer trusted by anyone\r\n\"Waiting like a stalking butler\r\nwho upon the finger rests.\"- the \"shadow\" is compared to \"a stalking butler\", which could be interpreted as someone/thing that is meant to cater to you but is \"stalking\" or pressuring you & \"waiting\" which would describe the craves/desires of the addict\r\n\"Jesus, won't you fucking whistle something but the past and done?\"- at least in my situation, the addict turns to god because he does not trust his own free will & control so he puts in the hands of someone else, God, to get rid of the past & move him on from his addiction\r\n\"Why can't we not be sober? I just want to start this over. Why can't we drink forever.I just want to start things over.\"- the double negative reflects how the addict complicates things, he manipulates his words to make his point seem like what it is not. He wants to \"start this over\" but his addictive side keeps coming around tricking him into wanting to \"drink forever\", constantly quenching his thirst for the drug. I know there were plenty of times in our relationship when my ex would manipulate his words & situations, etc, in ways to make me believe the wrong thing or do something for his benefit. It's what he was best at & he would manipulate even without realizing it until after & he manipulate himself.\n\r\n\"I am just a worthless liar.\r\nI am just an imbecile.\"- obviously, self-loathing because of the person he has become b/c of the addiction\r\n\"I will only complicate you. Trust in me and fall as well. I will find a center in you. I will chew it up and leave, I will work to elevate you just enough to bring you down. Trust me. Mother Mary won't you whisper something but what's past and done. Trust me. I want what I want.\"- He knows what he is capable of,whether he chooses to do harm or not he will only cause trouble. He told me straightforward coming into the relationship that he would only give me trouble & that I do not understand addiction. I thought I would be able to help him, I wanted to be with him but I also wanted to be the person who brought him out the hole he dug himself in but I was wrong. He got to know me & I opened myself up to him & let him in & he saw how vulnerable & naive I was but also that I was a good person with compassion & care & giving so he took advantage of my kindness at a time when he didn't have a support system. He told me things & made me feel like I was at the top of the world but after rehab he fell out of love (thought he believed it was drug-induced the entire time) & even though he found he had feelings for me, we broke up & he decided it would be best to cut me off completely. Instead of taking responsibility for his actions, he turned the tables on me once again & described me as a burden to him & he needed to let go of me since we used together (though we only both used pot) to let go of the memories, even though memories dont just go like that, they stay. If anything he was weight I was always carrying, I was always trying to give to him & be there for him. Everything I did was for him, that is what he wanted & he got it because I trusted him. It is a constant struggle for him, between himself & his addicted self. He's always juggling between what he wants & what his addicted side wants. He may not have wanted to cause me such harm but I trusted in him & he knew it would be inevitable. I has caused many people close to him harm but most of the time it was unintentional. That's just how it came to be. But now he is recovering & coming out of that past life & finally picking himself up again.\n\r\nI'm sure a lot of people will disagree with this interpretation but just thought I'd share my story & how it fits.\t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nThose are the lyrics from toolband.com .... but Maynard changes the lyrics in the album version a lot if you listen to it. so some of undertow is different.\t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nI haven't read all comments, but this is what I think since I first heard this song (circa 2002).\n\nThis song is about someone who doesnt like the way his 'self' works naturally (or sober). He thinks his self can only function properly while under the influence of alcohol or sleeping, or something like that, but he can't be permanently under such effects for his body has its limitations. He gets upset over his imperfections, and, in a rage, he blames his deities for making him that way. \n\nIt is a great performance by the singer, you can feel the displeasure in his voice.\t\t\t\t\n\t\t\t\t\n\n", "comment_330": "\nThis song is about religion. By 'sober' he means sober from the bullshit religion has put in our minds. He's saying we're all f**ked up on the IDEA of religion, our minds our poisoned and there is no antidote, and there are only a few of us who really understand but could never make a significant change, at least in this day and age. \n\n'Jesus wont you fucking whiste, \nsomething but the past and done?\n...\nMother Mary won't you whisper,\nsomething but what's past and done'\n\nThese lines both ask, in essence, that why is there evidence today of a God today? Not evidence as in nature or overcoming illness, REAL evidence. Not fake miracles, the real ones ones from the Bible. Just like once every hundred years, God, just to make sure we are still on the same page. Show your face for once! Jesus, whisper in my ear that you're actually still out there! Why are they keeping so quiet? They better make some noise soon if they want ANYONE to continue believing in them for an extended period of time. We are getting smarter! IMO we will live in an all-atheist world before too incredibly long. I\n\nRead these lyrics through the eyes of a person who has been forced to believe in some god or another for their whole lives, spiritually abused, and finally come to the horrible realization their whole life was built upon pillars of salt and sand. You need proof, but all you can see is the aftermath - pain and suffering your religion has caused you.. you could have believed, too, only if God would have shown his face for one lousy second. But no. \n\nSo you sit in awe of what the world could have been had it not been for that cursed plague called religion, poisoning the minds of humanity and leeching the hope of what we could have been, out of us forever. This song is the song for the forever tortured souls; those who need proof to believe..The non-believers born into a believing world. \n\nThank you, Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\n(There's a shadow just behind me. Shrouding every step\nI take)\n\nTo me, this part means that the person in the song has 2\nsides to them. The shadow is another part of the person \nand it's concealing (shrouding) the person's true self.\n\nThe song is about wanting to be high and not sober because\nit helps forgetting the pain and confusion being felt inside by\nthe person in the song. To the person in the song, not being\nsober is the only way because  feels\neverything has turned on them, even their own religion.\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nI agree that this song is probably just about what the lyrics say. They're pretty deep feelings in themseleves, and I don't think they really have a lot to do with religion at all. Every time a biblical figure is mentioned, everyone makes the entire song about it. It's just about a sad man, maybe even himself or an exaggeration of himself.\n\r\nHe has a shadow (drug addiction, mental disorder, bad history) that follows behind him and helps him behave in a way many would consider immoral.\n\r\n\"Jesus won't you fucking whistle!?\" sounds like him calling out to Jesus (either literal Jesus, or archaic morality systems), saying, \"How is this allowed to be?\" \"Something but the past and done,\" could be a rib shot at Christians, or just him saying that something needs to change in general.\n\r\nThe part about not wanting to be Sober is obviously a really extreme regret about what has happened, and how he would drink and sleep forever were it possible. That's why I don't think this song is about drug addiction. I know exactly what he's saying and i'm \"sober\" most the time. I had a friend who slept fifteen hours a day and drank when he was awake. I don't think he had a physical dependency, rather he was just running from the past. (He has since accepted it, by the way.)\n\r\nThe following self-depreciating statements are probably brought on by feelings that you've dragged somebody down. Unfortunately some of us are flawed to the point we can bring others down, and here he's complaining about other's persecution and the persecution done by himself.\n\r\nUnfortunately, I can relate to the \"trust me\" part. Many people are optimistic on a regular basis and can't see when someone is spiraling down, so every mistake you make wounds them, and you try to say, \"Just don't have faith in me.\"\n\r\nHe closes on, \"I want what I want,\" because he's human and struggling with the fact, in that time period, that he only has the strength to satisfy himself and no one else.\n\r\nThat's my interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_333": "\nI think its about belief....Jesus wont you fucken whistle....something, the something part needs to be added to the first line. Hence Jesus wont you fucking whislte something...so I know your REAL!\r\nThe song seems to also relate to alcoholism...stalking butler is a classic line, because thats the shadow of drinking always being an easy option and maybe religion is also an easy option!\t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nI have read a few comments regarding this song, and for once I have to admit I am pleasantly surprised to read some people actually believe in many respects that this song is primarily about God and the proof of his existence. I believe the reference to being sober refers to those who are not drunk on believing and or following God. This like MANY tool songs is about God...period!!! Maynard isn't  \"so deep\", \"so mysterious\" he's a puppet, a pawn for the devil!!! The only reason this band is where they are is because they sold out to the devil for talent and fame!!! This band will burn in hell unless they repent of their sin and turn to Christ!!! It always astounds me how 90% of the time people read these lyrics and interpret them, that people almost  always turn to God or Christ in the reference and justify it as though \"well its not really about God\"  but Maynard is just using it as a metaphor or drug addiction or insert your favorite load of garbage. The bottom line is God or Christ is blasphemed in dozens of Maynard written songs, and it's no coincidence, or happenstance but rather deliberate! Wake up! You people who channel these songs into metaphors and other arbitrary concepts are choosing to change the meaning of the songs to justify the fact that you as well as I know these songs are in fact evil wicked and wrong and you just want to justify your lifestyle because your conscience bears the true witness of the Godhead and you are simply refusing to change your life to live for God!! Quit justifying your wickedness stop serving the devil and see that these men in this band are evil and this song is no exception!!! They are puppets given fame and glory and riches by the devil for a purpose to lead fools astray! Satan is the God of this world, and whether you choose to serve God or  Satan you are serving one or the other no matter what! Start paying attention to what these people are brainwashing your minds with people!!! All rockstars promote and encourage wicked behaviour and sin! Everyone in this band is FULLY aware that they are serving Satan and that they are on their way to Hell! Maynard promotes the devil and the occult and anyone who even scratches the surface of their image and music/lyrics knows this so stop ignoring it people! Be advised! Turn to Christ and repent! I once was fooled and beguiled by this band over 20 years ago, and now I know what they are and what they stand for! They are damning millions to hell!!! \t\t\t\t\n\t\t\t\t\n\n", "comment_335": "\nThis song is about if you can do drugs, enjoy doing it and can not be a junkie then you have no reason to be ridiculed. more or less tool saying \"fuck off let us do drugs\"\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\nI remember relating to the line about \"pointing every finger at me\" when I was around ten and saw this video. No one drank in my house so I didn't understand what sober meant. Thinking about this again perhaps I related to it more from being addicted to dissociation to escape school. So being sober was like people telling you stop hiding from reality. \n\nIt's interesting how drinking is another form of dissociation for people, and how I managed to get this at such a young age. Maybe I just related to the claymation character's isolation. Also the idea of people asking them to trust you only to turn on you later, a lot of teachers did that to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\nAbout getting high....duh there's no secret meaning .songs called sober. Get it straight.\n\n-kb\t\t\t\t\n\t\t\t\t\n\n", "comment_338": "\nOk call me crazy but if im not mistaken hasnt maynard admitted to having commitment issues? Possibly that plays a role? I dunno just thinking x3\t\t\t\t\n\t\t\t\t\n\n", "comment_339": "\nOkay, Im a big fan of tool. Poetry, it leaves everyone thinking it about something different. This song in particular I've seen three answers that stick out: religion, addiction, and self loathing... In my opinion, those are are connected, so all are right. You start off being religious, then you move to the religious addiction, where your religion is 100% right, and everyone else's is wrong, then when you find that one flaw, you become confused, which leads to hate for anything, including your self...\n\n\n", "comment_340": "\nThis song may speak to addicts but it's about Christianity.  I am a Christian, but I love this song.  I love it because it points to the way the rest of the world sees us and Christ--as a bunch of worthless legalists who fill your head with empty hope.  Jesus is the worthless lawyer he's referring to. \n\r\nThe way \"modern Christianity\" (really, Christianity since Constantine c. 300 AD) is practiced, it's no wonder this is the way it has been and is seen.  This song speaks to me about how we have failed to demonstrate something wonderful by becoming judgmental hypocrites and how not to act.  It has affected me so much that I am in the preliminary steps of forming a group in my local church called \"worthless lawyers\" that is all about practicing what the bible teaches us to be, not  what do many others are, as this song portrays us to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_341": "\nThis is from the perspective of the alcoholic who is pissed that everyone keeps telling him to stop drinking. \"Jesus won't you fucking whistle something but the past and done\" has NOTHING to do with Jesus or religion. He is saying \"Jesus\" as in a curse word - like \"Jesus F-in Christ, would you shut up and talk about something else\" - he's saying this to the people who are always on his case - because he'd prefer to keep drinking\t\t\t\t\n\t\t\t\t\n\n", "comment_342": "\nThis is just me but....\r\nAbout an alcoholic from the point of view of the human and the source. I.e. the bottle\r\nThe beauty of Maynard is every song could be about anything but in his mind you'll only get a glimpse. One of the top 3 lyricists of all time. In the pack is tom petty and Lou reed. Arguable I know \t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nThis can be interpreted many ways but for me it is clear based off of experience with an addict... This is an addict that does NOT want help. The shadow can be concious or just the dark part that enjoys the addiction and the high. Addicts tend to be manipulative and due to chemical changes in the brain they lack coping skills, act childish- he is complaining why can't he just stay high, and \"Jesus\" as in cursing \"JF***C, leave me alone about the past\". \"why can't we start over\" (relapse perhaps) Addiction is a repeated cycle, broken promises to stop, \"trust me\"- (Definition of insanity: doing the same thing over and over again and expecting a different outcome.) \"sleep forever\" -stay in an intoxicated state, away from reality.\r\nRead the lyrics with this view point from a victim of someone that tried to help someone that doesn't want help and see if it makes sense for you ;) \t\t\t\t\n\t\t\t\t\n\n", "comment_344": "\nAs with most of Tools music the lyrics are a template for your own interpretation. A guide as to what ever the song cunjures up in your own mind. This is why the bands name is Tool. They are a tool to help you vent, overcome barriers and so on. A different question is what ever this song meant for Maynard? In my opinion and logic it is, at least for maynard, about Jesus and religion and the restrictions on his freedom it place upon him as a child n maybe still sometimes does as it was drilled so deep into his conciousness by his mother. \t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nAccording to Tool guitarist Adam Jones the song Sober was about a friend of theirs that could only be artistic when he was loaded but he would also emotionally drain everybody around him by harping on the same crap day in and day out.\t\t\t\t\n\t\t\t\t\n\n", "comment_346": "\nI am pretty sure these lyrics are wrong on a couple of lines:\n\r\nJesus blows his fucking whistle /something that the past had done \r\nNot : Jesus won't you fucking whistle7somethin but the past and done \n\r\nLike an eternal whistle blower , calling us out for every last one of our fuck ups from 2000 years ago\n\r\nWhat they have here doesn't even make sense, especially the second line, that doesn't even work grammatically \n\r\nI'm pretty certain of that, and then this one I've always thought this but I'll concede that I could be wrong:\n\r\nMurder now the pattern, must we/just because the son has come\n\r\nNot: Murder now, the path called must wait\n\r\nAgain, this doesn't even make much sense. I know the lyrics aren't printed on the CD jacket, i checked out a couple of other sites and there are several in discrepancies between them, none of them have what I just said bit that doesn't mean I'm wrong as there doesn't seem to be a consensus to the contrary. \t\t\t\t\n\t\t\t\t\n\n", "comment_347": "\nAnd to add to my previous comment, I've always thought the chorus says:\n\r\nWhy can we not be sober? \n\r\nInstead of :\n\r\nWhy can't we not be sober\n\r\nAgain, doesn't make much sense the way its written here\n\n\n", "comment_348": "\nThere are a lot of comments here but I get a bit different vibe from this song. To me it seems to be about a depressed man who is going through existential crisis and cannot find any meaning in life. He doesn't want to be so \"awaken\", he doesn't want to be sober - thinking about the meaning of life all the time. \n\"I am just a worthless liar\", \"I will only complicate you\" - in my opinion, since he does not see the meaning in anything, he sees himself as a liar. How can you make a promise to someone if you don't believe in anything, he probably pretends he is not as depressed as he is to the rest of the world and sees it as being a liar. \n\nFirst verse especially -\n\"There's a shadow just behind me\nShrouding every step I take\nMaking every promise empty\nPointing every finger at me\nWaiting like a stalking butler\"\n\nHe cannot get past the feeling of hopelessness: it's always there - stalking him. does not give meaning to anything he says, he feels like an outcast and is getting paranoid.\n\nThis: \"I will only complicate you\nTrust in me and fall as well\nI will find a center in you\nI will chew it up and leave\"\n\nIt's like whoever he befriends - he will make them see the meaningless and hopelessness of everything.\n\n\"Jesus won't you whistle\" - just a helpless call to whichever deity (in this case Christian) to give him a sign that there is something more out there.\n\n\n\nMaybe I got this feeling because I am often depressed and question the meaning of life soo it hits close to home ^^\t\t\t\t\n\t\t\t\t\n\n", "comment_349": "\nMy whole take on this song is my experience with depression. From the first bit:\n\n\"There's a shadow just behind me\nShrouding every step I take\nMaking every promise empty\nPointing every finger at me\nWaiting like a stalking butler\nWho upon the finger rests\nMurder now, the path called must wait\nJust because the son has come\"\n\nThis honestly describes what my depression was like.. A shadow just behind me always talking me and staying with me throughout the days and nights following the same path to wait for something to happen without doing anything.\n\nThe second bit:\n\n\"Jesus, won't you fucking whistle\nSomething but the past and done?\nJesus, won't you fucking whistle\nSomething but the past and done?\"\n\nMy wanting of Jesus to tell me what will happen in the future, rather than something that already happened or what was done. I wanted him to tell me if my future was going to be bright or not and to give it straight to me.\n\n\"Why can't we not be sober?\nI just want to start this over\nAnd why can't we drink forever?\nI just want to start this over\"\n\nUsually when I am in a super depressed mood, my body goes numb and it feels like I am drunk. It feels good because you cut off feelings for everything and to me I do not feel as sad but more connected to the world than anything if that makes any sort of sense.. I always want that feeling, forever and I want to start it over and over again in an endless loop because it makes em feel better and it makes me have a deeper connection with everything.\t\t\t\t\n\t\t\t\t\n\n", "comment_350": "\nThe shadow is your critic as far as psychology goes. People with addiction do have a worse critic than most. That is really the crux of this.\n\n\n\"There's a shadow just behind me,\nShrouding every step I take,\nMaking every promise empty,\nPointing every finger at me.\"\n\nIn Jungian psychology, the shadow or \"shadow aspect\" may refer to (1) an unconscious aspect of the personality which the conscious ego does not identify in itself. Because one tends to reject or remain ignorant of the least desirable aspects of one's personality, the shadow is largely negative, or (2) the entirety of the unconscious, i.e., everything of which a person is not fully conscious.\t\t\t\t\n\t\t\t\t\n\n", "comment_351": "\nThis is not necessarily about addiction or religion (which is, in its weird sense, also an addiction). It's about a person in a state of despair who is regretting the fact that we're sentient beings having free will. He regrets the very division into consciousness and subsubconscious. He is relucnatly willing to merge both into one(of course, not being able to do it), thus abolishing his lucidness and ability to make decisions (which he really does not wish, having hesitation and doubts). Idea of free will as the reason of his despair unsettles him.\n\n\"There's a shadow just behind me,\nShrouding every step I take\"\na shadow behind him = subconscious\nSubconscious never leaves us alone.\n\n\"Making every promise empty\"\nHis delusion about subconscious as the reason of his despair\n\n\"Pointing every finger at me\"\nSubconscious has power to somehow direct conscious mind\n\n\"Waiting like a stalking butler\nWho upon the finger rests\"\nConscious mind is built upon subconscious one\nSecond one is like an elusive guide\n\n\" Murder now the path of \"must we\" \"\nWords \"must we\" refer to free will. He's prone to negate and destroy it.\n\n\"Just because the son(sun?) has come\"\nI'll go with the sun version. No solid proof, just feeling: sun is a symbol of life.\nAnd with \"son\" - son, a child, a (poetically speaking) newborn is also a new life.\nThe wholg song is about life containing its wholeness (he is desperate not about some failed project but about life in general)\n\n\"Jesus, won't you fucking whistle\nSomething but the past is done?\"\nSubconscious, why won'y you give me a sign? Subsciousness is somehow a god... hard to explain.\nAnd might be some regrets about the past\n\n\"Why can't we not be sober?\nI just want to start this over\"\nWe all sometimes feel that, given the ability to start all our life over from the beginning, we'll change it completely. Also it's a deisre to feel ever happily, like in childhood ( equals to not be sober)\n\nLines of consciousness:\n\"I am just a worthless liar. \nI am just an imbecile\"\nA sudden realization (worthless liar) that he actually doesn't want to go crazy and lose his mind (that've been the result of negating his conciousness mind)\nHe again makes a statement about his despair (lmbecile, worthless liar)\n\nAnswer of subconscious:\n\"I will only complicate you\"\nSubconscious is more ancient and more complicated than our common conscious\n\n\"Trust in me and fall as well.\nI will find a center in you.\nI will chew it up and leave\"\nOur self-destructive urges can turn into subconscious impulses leading to some mishap accidentally causing death, injuries or afflictions\n\n\"I will work to elevate you\"\nSubconscious can also be empowering\n\n\"Just enough to bring you down\"\nMeaning becomes quite fuzzy here, he sees everything - his mind, both conscious and subconscious - as his enemies.\n\n\"Mother Mary, won't you whisper\nSomething but the past is done?\"\nCan't get this Mary line. Another regrets about past\n\n\"I want what I want\"\nHe is stating his ability to have free will and desire to have desires (and thefore to live). But he's still confused\n\nSo one heavily addicted to something and consuming it on daily basis in large quantities. Or the one submerged into religion. These persons actually might be willing to leave their ordinary life, although not to better transformation of it, but into losing their mind (sometimes literally, but more likely not to live and feel life in its wholeness)\n\nSo religion meaning and addiction meaning are actually submeanings of this one, more profound meaning\t\t\t\t\n\t\t\t\t\n\n", "comment_352": "\nThis song is about a person who thinks he or she is in such a deplorable state that he or she feels worthless. It is a song written from a dark place... I love the art of it, and relate to the despiration\n\n\n\n\n\n\n", "comment_353": "\nItâ\u0080\u0099s a song about addiction, and the selfishness of it. He wants to know why Jesus and Mary to help him.\t\t\t\t\n\t\t\t\t\n\n", "comment_354": "\n Wow! \r\nYOU ARE ALL WRONG...Hereâ\u0080\u0099s your answer...\n\r\nI used to read Hit Parader Magazine in high school (early nineties)......There was an article/interview with Adam Jones about this song...\n\r\nHe explained....\n\r\nSober was written about a Los Angeles artist who had been shunned from the art community and negatively criticized from art critics in regards to his â\u0080\u009cArtistic methodsâ\u0080\u009d. This artist only painted while under the influence i.e. â\u0080\u009cnot soberâ\u0080\u009d.....Possibly drunk, stoned, tripping on psychedelics(most likely).\n\r\nAccording to him it was the only way he could make his art....Well apparently there was some debate on whether he was (cheating) or it was actually him naturally producing his artwork.\n\r\nTool found this to be absolutely asinine (which it is) and the seed was planted that became the song â\u0080\u009cSoberâ\u0080\u009d.\n\r\nSorry for the lack of specifics....it was almost 30yrs ago!\n\r\nThey were also influenced/inspired by an unpublished book called â\u0080\u009cThe Joys of Lachrymology*â\u0080\u009d .....the author was a drifter apparently and gave the book to Paul or Adam....not sure...\n\r\n*Crying, Lachrymose glands/tear ducts\t\t\t\t\n\t\t\t\t\n\n", "comment_355": "\nI've read a lot of these \"thoughts\" people have about this song and I didnt see the word Meth used once.\n\r\n\"Why cant we not drink forever\"...\r\nThat makes it obvious to me Maynard would rather use alchohol forever instead of abusing methamphetamine because all glass does is build you up just to break you down.\n\r\n\"Why cant we not sleep forever\"\r\nThat's what some people (not me, never could) do.  It seems like forever but some need 5-10 to recuperate/sleep after smoking glass for 5-10 days straight.\n\r\nThe song screams Meth to me but that's just me I guess.\n\r\nThanks For reading!\n\n\n", "comment_356": "\nI heard this song again today for the gazillionth time and had a flashback thought of a former boss that was very abusive. They were the ultimate micromanager and pressure packed cheerleader all while being the first to deflate your rise to success.\t\t\t\t\n\t\t\t\t\n\n", "comment_357": "\ni'd have to say this song ties with schism as the best song.  They both kick ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_358": "\nno no no, in a recent interview on TripleJ with maynard, he explained that it's about a friend of his that is an artist, and he has a drinking problem, but he always creates his greatest paintings when he's completely wasted. So he's taken that idea, that sometimes that the things that society concentrates on as being bad things that we shouldn't do, they can actually have some good points as well, and he's just gone from there.\n\r\nbut like with all Tool songs, there a many different meanings for their tracks, it all depends what you wanna get out of it\t\t\t\t\n\t\t\t\t\n\n", "comment_359": "\nI like this song.  Very dark and haunting.  Anyone who can remember the late 1980's should note similarities to the music of a group called \"The Call\".\r\nNext thing kiddies....this song has nothing to do with drinking and/or drugs.  Zilch, nada.  Get a clue.  That would be far to blunt on the part of the artist.  This song is a story of love denied.  The protagonist is remembering a love from the past.  One he still craves.  We don't know what happened, but it seems that they were pulled a part by external demands on both of them, \"murder now the path called must we\".  He laments the events that pulled them apart, \"why can't we not be sober, I just want to start over\".  But he still wants the passion he felt with her, \"why can't we drink forever, I just want to start things over.\"  He wants to drink from HER, not from a bottle.  Wise up.\r\nHe blames himself, \"I am just a worthless liar...I will find a center in you...I will chew it up in leave..\"et al.\r\nHe is obsessed by her and seeks resolution, \"mother mary won't you whisper, something but what's past and done.\"\r\nBut ultimately, he wants her and would do anything to have her, \"Trust me, I want what I want.\" \r\nIt's a story of love denied, kiddies, love denied.  Been there, am there.\t\t\t\t\n\t\t\t\t\n\n", "comment_360": "\ni completely agree with bonedaddy and have thought that since the very first time i heard this song.  it's a song about a love gone bad and wanting it back.  \t\t\t\t\n\t\t\t\t\n\n", "comment_361": "\ndon't you like Aenima? i think Sober and Aenima are equally good though so different. they both seem best tool songs to me\t\t\t\t\n\t\t\t\t\n\n", "comment_362": "\ndon't you like Aenima? i think Sober and Aenima are equally good though so different. they both seem best tool songs to me\t\t\t\t\n\t\t\t\t\n\n", "comment_363": "\nThis song is about an arist who feels that he can only perform while intoxicated.  All the while he is mocked by his peers for this.  It addresses the problems with drugs \"I am just a worthless liar...I will work to elevate you just enough to bring you down\" and the fact that he can't seem to quit.  In the video you can watch the character open his \"secret box\" to get high only to come back down twice as fast as he went up.  Also in the you can watch as he moves to harder drugs.  The moral of the story, (which seems ironic) don't do drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_364": "\nI strongly agree with psyberchotic, and I think that the main message in this song comes from the chorus.\r\n\"Why can we not be sober? \r\nI just want to start this over. \r\nWhy can't we drink forever. \r\nI just want to start things over.\"\r\nDrug addiction is a bad thing, obviously, and using them is self destructive.\n\r\nI also agree with psyberchotic on the verse:\r\n\"I am just a worthless liar. \r\nI am just an imbecile. \r\nI will only complicate you. \r\nTrust in me and fall as well. \r\nI will find a center in you. \r\nI will chew it up and leave, \r\nI will work to elevate you \r\njust enough to bring you down.\"\r\nThis can very well be the drugs talking.  Having used drugs in the past myself, I know that they do elevate you by making you forget your problems, only to bring you down.\n\r\nTo see that drugs are a bad thing all you have to do is look at our parents generation.  The hippies, and virtually everyone else, were heavily into all kinds of drugs and just look at how messed up this country is now!\r\n\"murder now the pattern must we,\" this is the pattern that I think Maynard is talking about.\n\r\nYes there are some good things that came from drug use, but there is no need to continue it.  Most of the ideas that came from the Hippie era are documented in movies, books, and music.  You don't need to experience them first hand, it is possible to learn from other peoples experiences.  And their mistakes.\t\t\t\t\n\t\t\t\t\n\n", "comment_365": "\nRAP SUCKS!!!!!!!!!!!!!!!!!!!! Rock will always be better than a bunch of fat black guys TALKING (see not SINGING) about how they fucked some girl and drove a car with 50 chicks hanging out of it. Dont come in here and say Tool sucks. Why were you even looking for their lyrics dood. AHH you ppl make me so mad!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_366": "\noh yeah and Tool RULES\t\t\t\t\n\t\t\t\t\n\n", "comment_367": "\nto em this song means that maynard is getting blammed for everything that everyone else does\t\t\t\t\n\t\t\t\t\n\n", "comment_368": "\nTool rules, sober is an awsome song, i think its my favorite from them.\t\t\t\t\n\t\t\t\t\n\n", "comment_369": "\nThis song is FUcking awesome. Merideth can go fuck herself cause rap sux.\t\t\t\t\n\t\t\t\t\n\n", "comment_370": "\nThis song is about how when you do a drug for the first time, you're fucked.  Your mind is never the same as it once was.  You've taken that one step closer to insanity and there's no going back.  Maynard wishes he had a second chance to be \"sober\"(sober=normal).\t\t\t\t\n\t\t\t\t\n\n", "comment_371": "\n Yeah clearly this is not about alcohol addiction.\r\nHe is saying how God is always there waiting\r\nand watching him like a butler and he always loses\r\nfaith asking Him for things.\r\n Also he is confessing hes a sinner and thinks about \r\ngiving up probably because hes scared of what will happen\r\nwhen he finds God.\t\t\t\t\n\t\t\t\t\n\n", "comment_372": "\nWhat I take from this song is the various emotions that go along with a crumbling relationship. I think the idea of being \"sober\" refers to the fact that that's when things are the worst. Sadly, alcohol can be an be an effective means of communication, but sometimes it's the ONLY means. In other words, we get along great when we drink, but it's horrible any other time. The line \"Jesus, won't you fucking whistle\" isn't calling out to the guy at all. try replace Jesus with \"for Pete's sake\" or \"Goddammit\" and you'll see what I mean. He is basically talking about the akward silences that tend to happen when they are sober.\"..won't you fucking whistle\", anything to break this akward silence.The song is basically about the stage in a relationship when either side is trying to hold on to any shred they can. Constantly bringing up past mistakes, always arguing. He implies that he is the root of the problem: \"I am just a worthless liar, I am just an imbecile, I will only complicate you, trust in me and fall as well\"\r\nHe implies that he uses her as a crutch, and will only drag her down. \r\n\"why can't we drink forever\" and forget about all of the past mistakes, and \"making every promise empty\" and \"pointing every finger at me\".\r\nWhy is it that things are only perfect when we're drunk? Can't we start this over?\r\nThat's what I get from this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_373": "\nOk seriously, I am all about deep thought, but when a f*cking band member states what the song is about; and the video coincides... Stop implying it is about things more complex. Ever heard the song \"trapped under ice\" by metallica? It isn't about being trapped under the expectations of some overbearing institution bent on breaking your individuality... The fucking song is straight up about being trapped under a sheet of ice and dieing.\n\r\nThe guys say their friend is an artist who does his most creative work while ^'ed on narcotics (heroine). The video goes along with this theme completely, adding more reinforcement to the BANDMEMBERS claim. The track arm shaking wildly, the little figure living in a den, the muckyness off the view leading to his opening of a box (if any of you have ever known someone that uses, you know cigar boxes, shoe boxes, etc. are the prefered storage medium for their \"tools\"). The opening of the box is what starts the trip, his seeing these horrific and creative images, hallucinations, etc. \n\r\nThe manner of the unfolding events would lead one to (easily) surmise that the \"man\" is somehow innervated by the contents of the box. When the video ends the box is empty, ever seen a junky stare at his pipe while it's empty?\n\r\nJust accept that you are imposing your own thoughts onto a song, which is good, it is supposed to be done; you find your own meaning in the content. But don't get on and argue with each other about what the song is about if the answer is glaring right at you. Take a breath, and discuss what it means to you and why.\t\t\t\t\n\t\t\t\t\n\n", "comment_374": "\nIt's about Addiction........whats behind him is his \"monkey\".....\t\t\t\t\n\t\t\t\t\n\n", "comment_375": "\ni personally think its about a man who has a drinking problem and his girl friend or wife left him and he wants to see her again...\t\t\t\t\n\t\t\t\t\n\n", "comment_376": "\nIts about the death of his junkie mate,Layne Staley from Alice In Chains.\t\t\t\t\n\t\t\t\t\n\n", "comment_377": "\nTools music is designed to help you discard God as a possibility. To help you take a stand on what you no longer beleive. Many people are undecided on Gods existence even those who claim to be athiests. But maynard has been through the proccess of ridding his mind of Any trace of God or Jesus and thus take his listeners through the same trip and cycles. Dangerous music\t\t\t\t\n\t\t\t\t\n\n", "comment_378": "\nthis song is actually about an artist that the band knew that was really bad at art, but did really good art when on drugs. He eventually \"fried\" himself into a mental hospital\t\t\t\t\n\t\t\t\t\n\n", "comment_379": "\ni believe that Maynard is describing drug addiction and his ambiguity about his feelings toward it. The first verse implies his addiction causes him to do bad stuff. The Jesus and Mary references are his cries for help from the church who responds with verses of scripture and Biblical fables that are not very useful, as opposed to divine influence to help him. The third verse, \"I am a worthless liar... I am... I will\", are the drugs talking to him.  \"Why can't we not be sober, Just wanna start this over\" implies that he lacks the willpower to quit but if he could go back he would have never started.\t\t\t\t\n\t\t\t\t\n\n", "comment_380": "\nMy interpretation is that this song is a message from Satan.  \n\r\n-There's a shadow just behind me,\r\nshrouding every step I take,-\n\r\nLucifer (the state of the fallen Satan) was prideful, wanted to be just like God, but he was cast out and basically lives in God's shadow.  He thought that what it means to be God, is to be exalted above all others, however as seen by Jesus' example, it really means to serve. \n\r\n-making every promise empty,\r\npointing every finger at me.-\n\r\nAlmost all evil and sin is attributed to Satan.  He is the father of lies; all of his promises are empty and people point the finger at him.\n\r\n-Waiting like a stalking butler\r\nwho upon the finger rests.-\n\r\nSatan claims that God is a stalking butler.  What is a butler?  A butler is a \"senior worker\" who is the \"highest and most loyal servant of a household\".  This sounds very much like God.  Christians equate Jesus to God incarnate.  Jesus proclaimed that he would come as a servant or slave to his people instead of a king. Since Jesus is supposed to be the perfect example to man (to love and serve one another) but is also divine (he is the \"most high\") essentially a butler. He is a \"stalking\" butler, because Satan sees him as an overseer, or one who is always there, watching. Satan also says the blame rests on God, not him.\n\r\n-Murder now the path of \"must we\",\r\nJust because the son has come-\n\r\nFirstly, what is \"murder\"?  Murder is an \"unlawful killing, with malice aforethought\".  So basically God \"unlawfully\" does away with the path of \"must we\", just because the son has come (Jesus birth, sacrifice and resurrection).  The path of \"must we\" is the requirements, the laws that \"we must\" follow to ensure a path to salvation.  Jesus is now the way to heaven instead of the path of \"must we\".  So in short, Satan claims that God contradicts the Old Testament with the New Testament.  \"Just because the son has come\" is one of the key lyrics that leads me to believe this song to be a religious statement (besides the obvious Jesus and Mother Mary references).\n\r\n-Jesus, won't you fucking whistle\r\nsomething but the past and done?-\n\r\nA person asking to be saved would not use vulgarity and ultimatums when asking for Christ forgiveness. Instead this is Satan asking Jesus \"why don't you reveal yourself to your people?  Prove that you are real and are who you say you are instead of relying on what was done in the past.\"  \n\r\n-Why can't we not be sober?\r\nI just want to start things over- \n\r\nThis is a prime example of how Satan deceives.  There is a double negative, which instead means \"why can't we be drunk?\"  In this case, I think it means why can't we be ignorant and blind, just like in the beginning in the garden of Eden when Adam and Eve had yet to eat from the Tree of Knowledge.  Satan knows his impending doom and wants things to be as they were.\n\r\n-Why can't we drink forever?\r\nI just want to start things over-\n\r\nReinforces the lines above.  Satan is stating that he \"just\" wants to start things over, where there is only a small population, oblivious to the evils of the world.  However, I'm assuming it would be to start the whole chain of events over again because after all...\n\r\n-I am a worthless liar-\n\r\nSelf explanatory, but here it is Satan actually stating a truth, repenting and being honest about his nature.\n\r\n-I am an imbecile-\n\r\nPerhaps Satan conceding that he acted stupidly.  This could be just a way to saying \"I know I did wrong, I acted badly\" even though, being the liar that he is, really doesn't concede to anything.\n\r\n-I will only complicate you-\n\r\nThis is where some people point out that this is actually an \"anti-Christian\" song, and they may be right (religion complicates, so do drugs and drug users).  However I think it is Satan saying that he complicates things by trying to pull people away from God.\n\r\n-Trust me and fall as well-\n\r\nThis is the lyric that partially reinforces my interpretation.  If this was a religious person warning someone away from Christianity, how did that person fall?  It could make sense if is a junkie basically saying \"if I trick you into taking drugs, you'll get hooked as well\".  Satan-Sataniel fell from Heaven and is saying \"trust in me and you will fall as I have\".\n\r\n-I will find a center in you.\r\nI will chew it up and leave,\r\nI will work to elevate you\r\njust enough to bring you down-\n\r\nThis could be trying to talk from the \"drug's\" perspective, however if you go back to the lines above, how could the drug itself \"fall\", as in \"trust me and fall AS WELL\" or \"fall AS I HAVE\".  Instead it can be about religion finding a center in you, but again, how has Christianity or any Christian \"fell\"?  Satan finds your vices, conflicts your sense of right and wrong, promises you all your wishes and dreams, tempts you away from salvation and brings you down.\n\r\n-Mother Mary won't you whisper \r\nsomething but what's past and done.-\n\r\nOnce again, Satan is asking \"People pray for your guidance Mary, why don't you whisper back, prove that you are there.\"\n\r\n-Why can't we sleep forever?-\n\r\nInstead of going to Heaven, why can't humanity sleep forever after death?  Of course this can also be straight forward and mean, why can't we escape reality (drug use interpretation).\n\r\n-Trust me-\n\r\nThe ultimate thing that Satan wants is people to trust in him.\n\r\n-I want what I want-\n\r\nIf this was about drug using, then who knows what the drug user wants, which is the major question in that interpretation.  Its left up the air, \"I want what I want\", the addict may want to quit but the saying goes \"if person really WANTS to quit they would\".  Satan wants what he wants, not what God wants, not what people want.  \n\n\n\n", "comment_381": "\nI agree I really like this song-Tool is the best!\t\t\t\t\n\t\t\t\t\n\n", "comment_382": "\nmoo.\t\t\t\t\n\t\t\t\t\n\n", "comment_383": "\ni m drunk   but tool   is tha shit and every cd has its own  \"personality\" that is why tool is the shit\n\n\n"}