{"comment_0": "\nThis song is about a guy who was dating a girl and they broke up after a long time. The two were completely in love and something happened to cause them to go their separate ways. Now that some time has passed, they are both going out with new people (\"If you're going out with someone new, I'm going out with someone too\"), but the guy cannot seem to get the girl off his mind and keeps reminiscing on their memories together. He goes through some of his favorite memories and then says that no matter what he's doing, he would always rather be with her. He even goes as far as to say that no girl will ever compare to her because he would rather be with her than any other girl he meets (\"I can go out every night of the week, can go home with anybody I meet, but it's just a temporary high, 'cause when I close my eyes, I'm somewhere with you.\"). It says that if they see each other out one day, they won't speak and he knows it but, even after all this, he's still always going to be with her in his heart (\"If you see me out on the town and it looks like I'm burning it down, you won't ask and I won't say, but in my heart I'll always be somewhere with you.\") It is a song expressing the love that has not left even after all the time of separation that they have had since the breakup.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nRE: csnowman, he is saying that she whispers into his ear that she hates her life and if HE ever decides to leave town, she'll go with him.\n\r\n\"You laid me down, whispered in my ear,\r\nI hate my life, hold on to me,\r\nAh, if you ever decide to leave,\r\nThen I'll go, I'll go, I'll go...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nTo me this song is about two people that are best friends and for some reason they never ended up together. He would always rather be with her but he doesn't think she has the same feelings for him. And even though they never were together she still always turns to him with the problems in her life and no matter what he will always be there for her. I see that song this way because I have a best friend that I am in love with but would never want to ruin our friendship by taking things to the next step because I never want to be without him. So instead I love him from a distance because I don't know if he has the same feelings for me and Im too scared to find out.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nto me this song is about a relationship that ended and they're going out with new people, but the other person wishes they were with them instead... and he's also saying if she called him he'd take her back. \n\n\n\n", "comment_4": "\nHe loved a girl he will never be able to get out of his head. They loved each other with ALL their hearts but there are no signs of reconciliation. He does not know this girl anymore. He just knows the memories still exist in his head and eat at him. He would not take her back (\"You won't ask and I won't say\") because I assume she left him and when she left, a part of him died. Death is irreversible.  \n\n\n\n", "comment_5": "\nCan someone give some incite to this line:\n\r\nAh, if you ever decide to leave\r\nThen I'll go, I'll go, I'll go\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI absolutely love this song!\n\r\nThis song hits home, I see it as this... This guy loves this girl after all of this time. Theirs something about this girl he can't get of of his mind. Hes replaying all these great times he's had with her because its pretty much the best times he's ever had. Hes telling her that no matter who he's with its never gonna measure up. Theres that one person thats gonna make you laugh the most, make you smile the most and just fill your heart. This is that girl! She moved on and he'd like to think he has too but he hasn't. Hes playing back his memories with her....Personally i find this song sexy in a way, if you've ever had this much passion with a person you could never find it anything less then sexy. \r\nToo respond too csnowman00... I think the \"then i'll go i'll go i'll go\" part means this... Shes saying \"I hate my life hold on too me\" Hes saying oh if you ever decide to leave (HIM - the new guy shes with, saying shes not happy) then hes saysing i'll go with you... I'll leave with you.. we can be together.. I don't know thats how i see it. Awesome song though. \n\n\n", "comment_7": "\nif this song is about the woman leavin the guy, then why would the guy that broke up the family due to a midlife crisis, send this song to the almost ex-wife?\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nHe is still and always will be in love with her. Its as though he was just along for the ride but loved her so much he cant get passed it. She says \"i hate my life hold onto me\"... she is unhappy but in his arms she felt safe. I think she ran away from his love out of fear. I believe she does love him. \"You wont ask and i wont say\"... in my opinion means she would rather leave well enough alone and he knows it so he lets her be. She is with someone else to convince herself she is fine and he cant be with someone else without imagining its her he is with... very sad.. but its my life to a T. And again just the way i see it..\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nWell this is a lot different of an answer than some of you have given but to me, this song is about a guy being with someone (as in married) but being in love with someone else. The reason is that I dated someone who was married (he was in an open marriage--his wife was my friend and she actually encouraged us to date, then changed her mind, but he later told me that he was in love with me...) and this was a song he told me reminded him of me when we were breaking up. So basically I think of it as the guy is married but in love with someone else and he'd rather be with her than his wife; that he's always thinking of her, and although he may seem happy to outsiders, he's only pretending for his wifes' sake.\n\r\nAlso the line that says \"If you ever decide to leave then I'll go, I'll go, I'll go\"...a lot of you are interpreting that as being what the girl is saying, but I think it goes like this....\r\nGirl-\" I hate my life, hold on to me...\"\r\nKenny-\"Oh, if you ever decide to leave then I'll go, I'll go, I'll go somewhere with you.\" \r\nAlthough of course for me it's reversed with me in Kenny's POV. I miss this guy so much and if he ever left her I'd go anywhere with him.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI really love the sound of this song but the lyrics throw me.  \"You're fighting with your mom again\"...what is he dating, a 16 year old?  I know some people said it was about a married woman but the whole song seems to be about a teenager.  It's weird, I wish he would have gone a different direction with it and it would have rivaled \"Alone With You\" for sexiest song!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nObviously it is about a girl he dated in high school that had a difficult home life. He was there for her through the bad times and now that they have broken up he reflects on the memories of the things they went through together so many years ago. He knows he will never find a woman to compare to his first love.\t\t\t\t\n\t\t\t\t\n\n"}