{"comment_0": "\nAccording to Frank Sinatra, this is the best love song ever written.  I tend to like George's love songs better than the Lennon/McCartney love songs just because they're much deeper, sweeter, and more sincere.  The video had Ringo & Maureen, Paul & Linda, John & Yoko, and (of course) George & Patti.  Although, George and Patti latter divorced, this song is still one of the most sincere and sweet love songs I've ever heard.  \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nMy interpretation:\r\nBoy meets girl\r\nShe is the most beautiful (inside and out) he's ever come across\r\nSo boy is going to be honest with the girl.\r\nBoy can't promise forever, b/c he can't predict the future\r\nBut boy would love to promise forever, b/c girl knows everything \r\nBoy is thinking and compliments him perfectly.\r\nGirl does for and teaches boy things he's always dreamed of\r\nBoy cannot pin one thing and physical beauty has little to do\r\nwith his awe of said girl.\n\r\nI about fell off my desk chair when someone sent me this song this past November.\n\r\nEveryone is entitled to their own opinions, go forth and share!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nIt seems to me that Patti Boyd must have been a very special woman. Not only was this song written about her, but so was \"Layla\" - two of the greatest songs of all time.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nYes George did write a few great songs, but how can you say hes better than John one of the ALL TIME greatest. George was better than Paul though. Pauls songs are only good for hearing not listening too.\r\nAnyhow, yes I do remember George sayig this song was not about Patti, but maybe he was bitter when he said that.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nSomeone commented that this song is based on a James Brown song, which is wrong.  It's based on the James Taylor song, \"Something In The Way She Moves\", which was released in 1968 by Apple Records.  George and Paul both worked on James Taylor's album with him, and George used the first line (and title) of James's song as a sort of temporary first line to start writing a song, but ended up keeping it.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ndef my favourite beatles song\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI believe this song was a message for his friend E.Clapton:\n\r\n\"I don't want to leave her now,\r\nYou know I believe and how.\"\r\nand also:\r\n\"Something in her style that shows me.\r\nI don't want to leave her now,\r\nYou know I believe and how.\"\n\r\nUntil this part, GH was speaking about her, \r\nbut now he turns to Clapton\r\nas he changes \"She/her\"(Pattie)for \"You\" (E.Clapton): \n\r\nYou're asking me: Will my love grow ?\r\nI don't know, I don't know.\r\nYou stick around, now: it may show!\r\n...I don't know, I don't know. (this three really emphasized\r\nand I would say angry or at least annoyed! Just hear him again.\r\nIt seems to me He`s telling him: \"I cannot agree on your taking her with you\"\r\n(in fact some time later Clapton came to GH saying he wanted to take Pattie\r\nwith him and GH said some kind of: \"You want her; OK, just take her with you\")\r\nBut at that time he still wanted to keep her and wrote his final message to\r\nhis friend E. Clapton:\n\r\n\"Something in the things she shows me.\r\nI don't want to leave her now, \r\nYou know I believe and how.\"\n\n\n", "comment_7": "\nWhat would say if I told you that the \"She\" that Georgie wrote about was none other than Mother Nature...it was the ultimate eternal Love song.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nEven though Sinatra said it was the best love song, he never gave George the credit. He always refered to it as a Lennon/McCartney song. George had a good reason to write this song too....Pattie was hot!!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI really can't say anything more except that George Harrison (in my humble opinion) was by far the best Beatle.  If it wasn't for him, they never would've experimented with drugs and they never would've left their bubble gum pop era.  Not that there's anything wrong with their earlier work... It's just their later songs had SO much more meaning.  That's just my opinion, I could be wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song is one of the greatest songs written, for obvious reasons, and was covered by over 100 artists!\r\nDon't think you'll find many other songs that have been recorded that many times! This has got to be George's finest song as a beatle!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nGeorge wasn't the one that got The Beatles into drugs, but nevertheless this is an amazing love song.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ngeorge was the quiet one while the beatles were the trendy mop top pop group. why? because he didn't fit in or like it. he was the one that first wrote the beatles songs that meant something. before them they were all about love and just the music, after they became songs that had meaning. they all were great songwriters and i dont' think any one of them is better than the other... they rank all tied for 2nd behind bob dylan.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nEverything about this song is so perfect and humbling. I also love \"Just Ask\" by gearge harrison (it was never released), however it hardly compares to this intoxicating masterpiece.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis song just seems to be so simple and true, music and lyrics combine so beautifuly and fluently as this song was always there, waiting to be written. absolutly beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI can relate. That's one reason I really love this.\n\r\nHas anyone heard the new relased version of this in 5.1 surround and without the strings and stuff? It's pretty neat, it's really just George on vocals and guitar, and Ringo on drums. I don't think anyone else is audible in that mix.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis is definitely one of the greatest songs ever by the Beatles, and George is and was always my favorite Beatle. Dont know why, just something about him struck me in a way the other three didn't. Anyways, amazing song, lyrics are so true and sincere, plus its got one of the most wonderful guitar solos ever written. Not too hard to play, but god damn, its well written.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nSuperstitions Of The Sky did a cover of this, it's really good.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\none of the greatest songs ever in life. i love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\none of my favorite beatles song.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nYes George had way better love songs than Paul.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni love this song the man of my dreams will sing this song to me and mean it is a very simple song about love and thats all i want is simple love\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nMy girl hums this song to me as I sing it to her. It's so...perfect :)\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI know that this is mostly about lyrics, but I'd say that the chord structure in this song is the work of an absolute genius.\r\nYet another perfect song.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nthis song was mentioned in the perks of being a wallflower, it fit in perfectly.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI Love It Too Its A Great Love Song!\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ngeroge kills the shit out of those other two fugs. geroge was a pushover. both john and paul had said in interviews that geroge was a better guitar player than the both of them. something is a perfect example of just how incredibly awesome george was. and his solo stuff is way way way way better. this song was inspired by a james brown song called 'something in the way she moves'. george was a big fan of re-writing songs. my sweet lord, for example, is a re-write of a gospel song.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI donÂ´t really know if itÂ´s true, but iÂ´ve heard that the solo was written by Eric Clapton (which by the way he married patty and George and Eric stayed friends). Is this true??????\n\r\nAnyway i canÂ´t find words to discribe georgeÂ´s work, itÂ´s more than perfect, the way the chords, lyrics, and guitar sounds combien canÂ´t really be true, itÂ´s awsome, itÂ´s the perfect song of all times.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis is so going to be one of my wedding songs. Definately one of the best love songs EVER written.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThis song is so gonna be my wedding song. And why would he believe that she wouldn't let their love grow after she heard this song? Crazy boyz these dayz ....\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nCrazy me these dayz .... posting twice. Sorry people.  XD\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI don't understand what he is trying to say when he says:\r\nYou know I believe and how.\r\nYouâ\u0080\u0099re asking me will my love grow,\r\nI donâ\u0080\u0099t know, I donâ\u0080\u0099t know.\r\nYou stick around now it may show,\r\nI donâ\u0080\u0099t know, I donâ\u0080\u0099t know.\n\r\nCan someone please fill me in?\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nFrank Sinatra said that this song is so great. But he ruined it by saying Paul and John had written it. Anyway! I agree with HabsFanVA! I mean, George and Eric Clapton? She doesn't like guitarists, does she?\n\r\npJ ;P\n\r\nThis song is so great and sweet! Woo!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI know everyone mentioned that thing about how Frank Sinatra called 'Something' his favorite Lennon/McCartney tune but I felt like reiterating it because it really displays how underappreciated and underated (one 'r' or two??) George Harrison's songwriting was.\n\r\nAlso, 'Something' was NOT written about Patti. According to George Harrison, he imagined Ray Charles singing the song when he wrote it.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nsomething is one of my favourite beatles songs!!!!!!!!!!!!!!!!!!!!!!!!!!!!i can play it.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nHey if anybody is a Nirvana fan Kurt Cobain wrote the song Something in the way...And he was a huge beatles fan mybe theres a connection since the opening line is Something in the way ( she moves ) Anyway this is a great beatles song i love the later beatles not the Bubble Pop. Just my opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nMy favorite George Harrison tune when he was still a Beatle. Written for her wife at that time Pattie Boyd. Frank Sinatra once said that this is one of the best love songs of all time and indeed it was! The tune and specially the sliding lead guitar was awesome! This is John's favorite song on Abbey Road.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI KNEW I'd see you here, Lennonian. Actually, I'd say that this song is probably the favorite song of John, Paul, George and Ringo on Abbey Road. And I like the video! So cool! With their wives and all.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI KNEW I'd see you here, Lennonian. Actually, I'd say that this song is probably the favorite song of John, Paul, George and Ringo on Abbey Road. And I like the video! So cool! With their wives and all.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nA great song both lyrically and musically.  \r\nGeorge was a great writer and played an important role in the development of the Beatles.  \r\nI liked the George Tribute Concert when Paul and Eric did a memorable version.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nOne of my favourite Beatles gems! If Abbey Road is the Crown on the Beatles (and it is) then this track is the diadem! Perfection.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nActually this WAS NOT written about Pattie.... George wasn't thinking of her when he wrote this but was rather trying to imitate Ray Charles' style. Pattie and George were about to break up at this point in their relationship, so why would he write it for his soon to be ex-wife?\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\n\"I donâ\u0080\u0099t want to leave her now,\r\nYou know I believe and how.\r\nYouâ\u0080\u0099re asking me will my love grow,\r\nI donâ\u0080\u0099t know, I donâ\u0080\u0099t know.\r\nYou stick around now it may show,\r\nI donâ\u0080\u0099t know, I donâ\u0080\u0099t know.\r\nSomething in the way she knows\r\nAnd all I have to do is think of her,\r\nSomething in the things she shows me.\r\nI donâ\u0080\u0099t want to leave her now, \r\nYou know I believe and how. \"\n\r\ngO put the song on and come back.\r\nNow listen to it again and understand it's about George when he was having a difficult time getting Xcitied for a young lady.\n\r\nYou really have to hear the anxiety in his voice for the message to come clear........but the word Love is a noun here, not a verb.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nOne of the sweetest love songs ever written, ever! I don't care who was the inspiration. Just whenever I hear it, I think of my wife and how much I want to be with her forever. There's something in the way she moves.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nIdiots...this was NOT ABOUT PATTIE! and nor was patti special. she was trampy and disrespectful towards george. she was so trampy that she was okay with george going off with other women. the other wives were so much better, especially olivia harrison. and btw\n\r\nPC: You're also performing \"Something\" on the live album. Now, you wrote that about Patti, is that right? \r\nGH: We'll no, I didn't, I just wrote it and then somebody put together a video and what they did, was they went out and got some footage of me and Patti, Paul and Linda, Ringo and Maureen, it was at that time, and John and Yoko and they just made up a little video to go with it, so then everybody presumed I wrote it about Patti, but actually when I wrote it I was thinking of Ray Charles. \r\nPC: He's not as good looking, but well, you know.... \r\nGH: Yeah, but he's a better singer (laughs) but that's what I was thinking of, I could hear in my head Ray Charles singing it. \n\r\nyes indeed clapton wrote layla and wonderful tonight about patti. but this special lady was dumped by george harrison who was okay with his best friend taking her, and then clapton and pattie ended after 9 years :) as for george and olivia, they stayed together until george died.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThis song says it all. In my opinion, one of the very few songs that actually describes love in a way that feels true.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\n\"something in the way she moves\" was in an everytime i die song named here's looking at you.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nFrank Sinatra was taking the piss when he would say its the best Lennon/McCartney love song. \n\r\nThat being said, Eric Clapton did the guitar on While My Guitar Gently Weeps, not this one. Hope that clears some things up.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nGeorge had two absolutely amazing songs on Abbey Road with this and Here Comes the Sun.  The entire album is spectacular, but George definitely nailed the two singles.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\ni really dig this song, but idk.....it isnt georges best by a longshot. its a good love song, yes, but john and paul can write those too. long, long, long......blue jay way.....here comes the sun....think for yourself.....for you blue.....I ME MINE for fucks sake. norwegian wood? come on\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\neven if he changed his story later, he told pattie this song was for her. and pattie wasn't his \"soon to be ex-wife\" at the time. they didn't divorce until '77\r\nalso I think sinatra's comment was in sarcasim\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nalso, greendaygirl, pattie wasn't trampy at all. I love george (by far my favorite beatle) but I would've left him long before pattie did. she turned down a lot of men while george was having affairs. and even turned down clapton once, before it was all over.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\ni love this song. its really sweet and cute and simple. no fancy literary analysis needed to understand how he was feeling\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nWell tiffany, Pattie did not only sleep with Clapton who was George's best friend, but she had an affair with Lennon, Ronnie Wood who later joined the Stones, and Donovan who was with her sister. I don't think there is anything trampier than sleeping with your husband's best friend and band mate. And to sleep with her sister's man? Wow, now that's what a call a slut. And by the way, George and Pattie separated in 73 and he got with Olivia in 76 (later  having a child together, marrying, and living happily ever after). Why defend her anyway, she probably would have slept with your boyfriend if she got the chance.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI always thought this song had to do with lust and the question of, \"Is it/will it ever be love?\"\n\r\n\"Youâ\u0080\u0099re asking me will my love grow,\r\nI donâ\u0080\u0099t know, I donâ\u0080\u0099t know.\r\nYou stick around now it may show,\r\nI donâ\u0080\u0099t know, I donâ\u0080\u0099t know.\"\n\r\nI thought that meant something along the lines of \"Maybe this lust I feel will flourish into something more. Maybe love.\"\n\r\nAm I the only one who thinks this?\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nThis song was nothing about pattie. In fact, many of you may know that george harrison believed in hinduism. The inspiration behind this song was that hindu god named Kristna. This was the greatest of god at that time, and was know as the god of love and all that was attractive. Though george really didnt mind people thinking of it about pattie, because he believed that individual love was a part of universal love. which is basically all the same. hope that answers anybodies questions.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nFAV beatle song... and fav george song. He has the ability to 'move' his listeners with even a single word. so deep and so true, 'something' has to be the best love song ever written.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI've always thought what Sharpiee thinks.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThe bass in this song is unbelievable I love it, but I still stand by my comment that Pauls song \"And I love her\" Is the best love song, but Something definetely comes second.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nSomething is clearly about a man looking upon his recently quickening lover, the something that he sees in this woman is a beauty more powerful than her physical attraction as she carries the lover of her lover, which is the child that is slowly blossoming and growing. A man's love never looks more beautiful than when he is watching his lover who is carrying his child. Of course the man can not place it and can only interpret this beatuy and love they are viewing as something. The greatest joy a couple can experience is of course a child. Anyhow the lines, \"youre asking me will my love grow\" well obviously the child is growing in the wombs confines, \"you stick around and it might show,\" well, the stick is obviously phallic and the \"stick around\" also means, if you wait nine monrths, the baby might show, and \"show\" is obviously a reference to the saying a woman is showing when she gets the pregger bump, anyways, this is the meaning that works for me, everyone is entitled to their own, it makes the song that much more beautiful, so try it sometime and think about it this way. Give Peace a Chance.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nmy absolute favorite Beatle songs. It's so sweet and sincere. This is a song I'd want to be played at my wedding. It's amazing. I listen to it every single day.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI agree with the previous comment. Perfect song for a young woman after a day at the beach followed by love songs and love blogs. Absolutely great choice! Go for it...\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nI like the acoustic version from the anthology\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nThis song makes me blush and warm. It's one of those things where you think about the person you like and picture how they would think about this song with you. It would be so sweet if they thought of you this way. It makes you smile to tink about it. \t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nyeah, i think george songs are a lot deeper than lennon/mccartney ones. the music and the lyrics are incredible and the way they go together makes the song even better.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nThis song reminds me of when my sweet foxy lady and i first got together. This is our special song i will always love her and have no worries in my soul and know that She'll always love me.If it wasn't for the beatles and my sweet foxy lady i think life would truly suck. I LOVE YOU KELZY.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nDudes this song was writen and created by Elvis Presley (ITS A COVER) sorry.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nDuuuuuuuuude, Bob Dylan is the most over-rated songwriter ever! Yes, he is good: I will allow you your moment. And it is irrelevant as to whether he can sing or play (which, after 40 years, he can't). He is a good songwriter. And I stress good. He is by no means ahead of the Beatles, nor is he ahead of Leonard Cohen, Paul Simon, Syd Barrett, Roger Waters, Lou Reed, Jerry Cantrell, Jeff Buckely, and anyone else you can name, You have the same syndrome Nirvana fans have when they say Kurt Cobain was a genius. The guy wrote good songs, but is not the genius everyone makes him out to be. He was surrounded by far superior contemporaries, so get over it! DYLAN WAS (AND IS) AVERAGE IN COMPARISON TO THE ARTISTS YOU THINK HE IS SUPERIOR TO! You have ears, don't just hear, LISTEN!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1\t\t\t\t\n\t\t\t\t\n\n"}