{"comment_0": "\nI dont really feel like JBs songs have deep meaning to them... Most of them are pretty strait forward in my mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI love this song :D I'm glad it's new Justin's single!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think it's about how he's found a girl that gives him the feeling that he'd do anything for her, and all he wants is to love her. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nthis is song is just about a guy who is a little lonely and he likes a girl and wants somebody to luv:)\n\r\nI need somebody to luv!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nPeople, People, listen...Justin Bieber is playing his way to the hearts of young girls and makes them feel like they have a chance. BTW, How old is Justin Bieber 12, 14, 15? Does he even know wat freakin love is? Its songs like this that make me shake my head because this song is not true. He don't know CRAP about love.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nJust sayn.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nokay i m sick of ppl saying that justin is too young to know what love is!! i mean young ppl kno what love is. just b cuz they r young doesnt mean they havent experienced a lot. if they have been thru a lot and can kno what love if. no offense hellokitty23\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think that today's youth gets sidetracked from what love really is sometimes. One of my friends told his girlfriend he loved her after they had been going out for three days- he hadn't even seen her in person, only got her phone number from a friend. I think I'm pretty sure what love is, but then again, I'm only 13. I think that JB might know what love is. I think that its something you have to experience yourself and for all we know, Justin has been in love more than we imagine.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\njustin beiber has genital herpes\n\r\nstill wanna suck his dick??\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni dont like JB but usher rocks this song!\t\t\t\t\n\t\t\t\t\n\n"}