{"comment_0": "\nits not about the son of sam killer, or relationships. its neither. its about discovery and enlightenment. \n\r\nshiva is the destroyer.\n\r\nwhen the world reaches the point where it is turned into a hell, shiva comes to destroy everything, as sort of a savior in a sense, before we become too evil. shiva destroys everything so it can begin again fresh.\n\r\nthe person in the song is describing his philisophical enlightenment, he believes himself to be the destroyer, so he is going about doing what he thinks his job is. the son of sam reference is doubt. he fears his cause may be in vain, and that he is just insane (a-la son of sam killer)  \n\r\nin the end he is going to sleep, forever, as shiva opens his arms up to him, because he fears he is indeed just like the son of sam killer, so rather than live with it, he decides to kill himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI can't help but think this song is about David Berkowitz (Son of Sam.) This guy ran around killing women in the 70's.\n\r\n\"couple killer each and every time\"\r\n\"acting under orders from above\"\r\n\"the clouded mind\"\n\r\nall references to Berkowitz\n\r\nBerkowitz claimed demons controlled him and a talking dog told him to kill the girls. He later told the truth in prison that he really killed these women because of his shit relationships with his mom/other women and he would masturbate after killing these women. Berkowitz claims to be sorry for everything he did as of 2002, he's rotting away in jail and claims to be a Christian now.\n\r\nAs far as the reference to Shiva, she would be more..creative than destructive. I guess maybe this song is about good vs evil type of thing? The whole \"Shiva opens her arms now to make sure I don't get too far\" I guess too far out of her reach. Maybe he's saying he's creatively destroying himself. I mean, he did kill himself in the end. He was awesome though.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song is about interpretation of oneself and the conflict within.  It gives a sense of awe about what we are capable of, be it good or evil.\n\r\nWe've spawned from the love of a mother and the slap of a docter, to be thrown into the world to make our move, with nowhere to go.\n\r\nWe've the courage to not feel weird being out of our comfort zone, but we don't really have any other choice.\n\r\nGod's embrace keeps us close, but when you look at me, you are not looking at an image of yourself, but at a demon within.\n\r\nWhat the hell are we?\n\r\nGreat Song Elliott!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\n\"It's not about the serial killer. I'm not sure exactly what it's about because it's just sort of like telling someone a dream you had last night. There are some destructive figures in it, 'Son of Sam', Shiva... but Shiva's also associated with creativity... I'm not sure... it's just an impressionistic song about destruction and creativity, I guess, if it's about anything.\" -- Elliott Smith\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think Elliott's father, Gary, is a doctor (retired now). Correct me on that if I'm wrong. Also, Son of Sam WAS a \"couple killer.\" He shot at couples making out in alleys or cars with .44 caliber. Usually the men were just badly wounded and one man DID die. So he didn't just kill women, theough his anger was probably more fixed towanrds them. Elliott might be saying that his failed relationships make him a couple killer and that he didn't feel particularly great about it. He felt guilty, and that makes him no better than Son of Sam, because he knew he harbored a messed up love and hate for those women in his love. Since his dad was a doctor whom he repsected and loved, his mom was probably the nurse. Although the images are pretty sterile, aren't they? BTW, Elliott's relationship with his mom was strained. He got along much better with his dad, probably blaming his mom for letting him be abused by his step-dad. \"You tears are cheap\" he once wrote of her. I can understand why he said this song was written without Berkowitz in mind, creativity can be very sub-conscious.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nyoutube.com/…\n\r\nListen to this for a great cover of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nSon of Sam is metaphor for being a fucked up product of abuse. You know he can't form relationships or hold relationships because of this. Hence couple killer each and everytime. The ending shows that he is scared of himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni think this is one of elliots catchiest songs\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthis is the first of elliott i ever heard, and it's probably the most different of any of his other stuff. \n\r\naslard, i was thinking about david berkowitz, too.  \r\nberkowitz and smith both had a really messed up childhoods, and there are parellels in the way that they both were rejected from step-parents and whatnot.  \r\ncreepy connection but it's a cool song nonetheless.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI heard Elliott say on an interview one time that he wasn't thinking of Berkowitz at all when he wrote this, like he didn't even know what the lyrics meant\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nSon of Sam didn't kill couples though, he killed women.  I don't think this song is about him, because there are too many references that wouldn't apply to him.\n\r\nWhat does this line mean:  son of a doctor's touch, a nurse's love ...  it kind of bugs me for some reason.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nMarsh..if you kill one person in a relationship..you kill the couple =p In a sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nsweetadeline's right about the npr interview, but i do like aslard's description of shiva and the whole creative destruction thing. he wrote it after the whole oscars experience where he was starting to shun fame and all the attention, even though his creativity brought him to that point.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThe doctor's touch = The educated, intelligent care of someone, but which is without emotion.\n\r\nThe nurse's love = Just that: Love. The calm, considerate touch of a caring nurse.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ni wonder if the line about the doctor's touch has anything to do with his father being a psychiatrist...\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI had always assumed it was about Berkowitz as well. When I sat down and though about it a little more, I wonder if he didn't write it grouping different serial killers and ideas together. With the couple killer theme it reminded me of the zodiac killer more than Berkowitz. Shiva's inclusion would lend to the thought of a creative destruction element. The lyric about \"opens her arms to make sure I don't get too far\" would lead to the controlled destruction thought. Destroy a little to accomplish the bigger goal. It also brings to mind the idea that after you take a little too much you break. It brings to my mind the Michael Douglas film Falling Down. The line at the end about \"I'm a little like you, more like Son of Sam\" might be there to serve as a sort of warning that he is closer to being a serial killer than a \"normal\" individual. \n\r\nMy personal take on the Doctor/nurse bit is kind of like Lovers Need Lawyers. Doctors are usually cold. They don't show much emotion, and are more concerned with a person's medical state than the warm fuzzy feeling that isn't there. Most Nurses I have encountered have been nearly the same way. The nurses might be slightly more interested in the emotional side of things, but neither are much for emotion. I believe there was a study done on what no \"love\" factor did to infants and children. They ended up being sickly and unpleasant. I'm probably wrong, but hey, I'm open to new ideas.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis song is without a doubt about David Berkowitz, a man who seemed to scare the wits out of America for a while. You'll always see references to him in American TV - he was a postman that killed couples and blamed it on his neighbour who was supposedly the devil, and his dog 'sam', hence the name 'son of sam'. I had to do a speech on son of sam once, so I used this song in it.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\neven if he wasn't thinking about son of sam in particular, your subconcious can do some pretty weird things, and really..if it's about destruction what's more destructive than a serial killer?\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ni agree with Stuffclq, i think he was using son of sam as more of a concept then accually telling the story of son of sam in the song.  talking about failing in most relationships in his life. and in the line \"son of sam, son of a shining path, the clouded mind\" it also kinda seems like elliott is relating to son of sam's state of mind by saying the clouded mind.  mmm like many of elliott's song a beautiful melody complimented by very twisted lyrics\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\ni LOVE THIS SONG TO PEICES, AND IM NOT SURE EXACTLY WHY.  IT PROBABLY IS BECAUSE OF THE REFERENCE TO BERKOWITZ, BUT I JUST LIKE TO LOOK AT THE SIMPLE SKELETAL STRUCTURE OF SONG.\n\r\nITS BEAUTIFUL, PURE AND SIMPLE\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nsome of the lyrics to this song are wrong. i dont know how to change them but ill figure it out. by the way has no one noticed this?!\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nsome of the lyrics to this song are wrong. i dont know how to change them but ill figure it out. by the way has no one noticed this?!\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nMadsy your wrong â\u0080\u009cson of samâ\u0080\u009d wasnâ\u0080\u0099t a postman  he was a security guard quitting that job one day b4 his first murder to become a taxi driver also he never had a dog he hated dogs. He rented a house owned by a guy called sam casâ\u0080¦ something and he claimed that there  was a demon inside him called sam and he was controlled by another demon called General Jack Cosmo. The people he lived with and others on his street had dogs and he would claim there barking to be insufferable and that they were possessed by demons and they were howling for blood and to silence them 4 a while he had to kill. Though he later admitted this was merely a cover up to use for when he got caught, which he knew was inevitable â\u0080\u009cthe cuple killer running out of timeâ\u0080\u009d. Also he did kill couples! And soulbot david wasnâ\u0080\u0099t as insane as first appeared the demons were a cover story for his sick killing then masturbation over his â\u0080\u009chandiworkâ\u0080\u009d. This isnâ\u0080\u0099t a song about the son of sam but Elliott is comparing himself to him the last line â\u0080\u009cim a little like you more like son of samâ\u0080\u009d even though Elliott said he wasnâ\u0080\u0099t thinking of son of sam while writing the song he must have just to include the phrases and that stuff about it being subconscious is bullshit song writing is an entirely cognitive process  just like speeches and poems the ego defences wouldnâ\u0080\u0099t let stuff out through song writing its all considered songs donâ\u0080\u0099t just suddenly appear. so what im saying is that this song isnt about david but elliott  using him as a metaphor about relatoinships and a comparison to himself\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\n\"Son of sam, son of a doctor's touch, a nurse's love.\"\r\nI like that line. When he was born, the doctor was the first to touch him, bring him into existance. And the nurse cared for him, cleaned him, wrapped him in a blanket; her love.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI adore this song. It's so different from all of his other stuff and so catchy.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nits definitely is not about berkowitz even though he is the son of sam. what it is about i do not know, but i am convinced it is not about him. its definitely a metaphor of some type, of what i dont know.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nIts \"lonely leered, options disappear\", not \"long revered\".\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI luff this song.\r\nIt's put me to sleep a million times.\r\nReferences to Berkowitz, yes.\r\nElliott Smith is not a killer though.\r\nPerhaps there were cases when he felt a connection with berkowitz. I doubt it though. i did do some research on the son of sam in a crime website and in most cases when he attacked, two people were together. Just a thought.\r\nAlso, perhaps elliott was angry or upset by someone who had moved on and now they're with someone else. upset enough to want them to die?\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI luff this song.\r\nIt's put me to sleep a million times.\r\nReferences to Berkowitz, yes.\r\nElliott Smith is not a killer though.\r\nPerhaps there were cases when he felt a connection with berkowitz. I doubt it though. i did do some research on the son of sam in a crime website and in most cases when he attacked, two people were together. Just a thought.\r\nAlso, perhaps elliott was angry or upset by someone who had moved on and now they're with someone else. upset enough to want them to die?\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI think it's at least half important that he relates himself to son of sam at the end.  It might be how he is a serial killer of his own relationships due to his childhood, or how he battles with the thoughts of evil urges, but Chiva, creativity, keeps him from getting too out of control and literally becoming a Son of Sam type figure.  I think everyone has days where they think they are a lot more of a danger to others than they are because of some sick, twisted thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nthe acoustic version is much better\n\r\nyou shouldnt argue about meanings. this is suppose to be what this songs means to you and no one is ever wrong\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ni agree with wickedly2. it means different stuff to everyone. \r\ni think the song has references to the son of sam, but i dont think the whole song was meant to be about that. elliott's never really struck me as the kind of person to write a bunch of biographical songs about serial killers. but that's just me. about the interview where he said it wasn't about the son of sam though, i don't know if that's entirely true. first of all, he said that \"no one listens to the lyrics in rock songs anyway.\" haha, well, i think he knew that all his fans listen to his lyrics. and elliott also always said that some of his very personal songs were not personal whatsoever. and i think he was not being honest about that either, just trying to be strong. i think this song has to do with elliott feeling like he's destroying all sorts of relationships, how he's running out of time to fix things, and he feels like he's like the son of sam, because his upset feelings are getting out of control. so shiva, the destoyer, comes down and opens her arms to take him away.\r\nthe son of sam, david berkowitz's psychiatrist talks about how he imagined a \"fantasy life\" with the demons and \"sam\" and such and how he was forced to kill. although this later turned up to be false because he really just did it for sick pleasure, it makes me think. maybe when elliott says \"i'm a little like you, more like son of sam,\" maybe he's talking about how he wishes he could imagine a sort of fantasy life for himself, one that doesn't involve the pain he has.\n\r\nwhatever the meaning, it's a great song.\r\nand i dunno if i like the acoustic better, it's hard to choose..but wow that harmonica is amazing!\n\r\n:] and i'm learning son of sam on piano. damn it's hard!\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\n\"i may talk in my sleep tonight cause i don't know what i am\r\ni'm a little like you, more like son of sam\"\n\r\nI've always taken this to mean that although he's surrounded by a certain type of people: people that might be happy and uplifting and fulfilled, people that have certain nice tendencies or positive qualities and people might have become convinced that he also this type of person deep down inside he's more disturbed and separated from the pack.  He's more like Son of Sam cuz he looks around and disagrees with all of it, or can't feel the same way about everything that everyone else does.  He feels parts of why people are like they are, but deep inside he's really playing a role and he's not like them.  Absolutely awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nWhen I first heard this song, I thought that he was singing about the killer, too...but since he said he didn't I don't know... maybe he lied?:D To me it seemed that he kinda felt like he and The Son of Sam were alike.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nIt's \"lonely leering, options disappear\", not \"long revered options disappear\".  If you can't tell by listening, then listen to In The Lost And Found. The lyrics to a verse in that song are \"kissed you quick, feeling weird, lonely leered, disappear.\" \n\r\nThere's clearly an intentional lyrical connection between the two songs. I don't think there is a thematic connection... rather, I think that he wrote one of the two songs first, and then while writing the second he penned the line \"feeling weird\" without realizing it was in the other song. When he noticed he decided to add the next couple lines as well as a sort of inside joke to listeners. It's not unheard of.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThis isn't much of a contribution, but I just realized Elliot uses almost the same phrase in this song as in In the Lost and Found. The words \"lonely\" leered\" and \"disappeared\" are all together in the verse. Idk..I just found it interesting.\n\r\n\"Kissed you quick\r\nFeeling weird\r\nLonely leered and disappeared\"\r\n-In the Lost and Found\n\r\n\"I'm not uncomfortable, feeling weird\r\nlonely leered, options disappear \"\r\n-Son of Sam\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThe last line of this song reminds me of the last lines of the sufjan stevens song, john wayne gacy jr. of course in reference to the serial killer...\n\r\n\"And in my best behavior \r\nI am really just like him\r\nLook beneath the floor boards \r\nFor the secrets I have hid \"\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\njust some abstract ideas here, but maybe some will find them helpful...\n\r\ni feel the last stanza is the most important.  as mentioned earlier, shiva is the destroyer in hindu mythology- after all is destroyed, the slate is wiped clean, and we start fresh.  doesn't this happen every night, after we dream?  if \"i may talk in my sleep tonight 'cause i don't know who i am,\" couldn't he be having a nightmare?  shiva could be a metaphor; he wakes up in the morning and everything is new, unlike the awful dream...\n\r\nso then, one option could be that all these things--telling his boss off, feeling lonely, etc--could be things that happened to him the day before the dream (he sleeps it off, \"shiva\" wipes him clean, and he wakes up new).  a second option is that this was ALL in his dream, and then he wakes up new.\n\r\ni haven't read any interviews or transcripts from elliot.  this is just a thought after listening to the song several thousand times and reading all the posts above.  like someone who posted previously, this was my first experience with elliot smith, and it remains my favorite of his songs\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nnot much like elliott's stuff, but i like it\n\r\ni'm not sure of the meaning... but i wanna learn the piano part\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\ni dont think it is directly about \"son of sam\" but in the sense that he killed people and ruined relationships by killing the females.\r\nI think that elliott is compairing himself to son of sam because mabey he couldnt keep a relationship and mabey he kept fuking them up and \"killing\" it so there is a couple no more.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nthis song is a great album opener. one of my favourites ever. \n\r\ni think sometimes finding out any kind of literal meaning of songs kills it for me, still, i come here and read about them.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI'm seeing a few people who are confused or have some details wrong about the Son of Sam Killings, I'd suggest a quick wikipedia browse. Pretty fascinating stuff.  One detail people missed:  Early on in the big NYC scare (in '77) that there was a killer on the loose, the police had thought that nurses/med students were targets.  This might explain where that part of the song started, but I think the line is more about contrasting a kind of medically clean love to a really screwed up, psycho relationship.  \n\r\nI think Elliott is mostly drawing an emotional parallel between his own failed relationships and the \"crazy\", \"murderous\", \"schizo\" kind of feelings you get when overwhelmed by an angst of that kind.  I think anyone who has self destructed in a relationship can relate.  \n\r\nThere are a few comments on how different this song is from his others, which I find interesting...I like learning his stuff on guitar and musically he puts this song together in a very \"Elliott Smith\" manner, same kind of picking technique.  I guess they just rock it out a bit more with the electric.  Anyway, I love this song, love the artist, and it really pisses me off he's gone.  This guy should still be making music.  crap.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI like this one a lot and I see that so many other do too. My take on the lines:\r\n\"Son of Sam, son of a doctor's touch, a nurse's love\r\nActing under orders from above\" comes from the John Irving book The Cider House Rules. I mean the character is named by a nurse in an orphanage where he stays on with a Dr., and couldn't he be seen as being a child of the state (Son of Sam)? I haven't read all the book and the connection is a bit far out but it's what I thought of when hearing the songs a few times.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\n\"son of sam\" is an open declaration of independence and dignity.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nRecorded circa 3rd April 2000 when Elliott came over to do a solo acoustic date in London prior to the release of his 'Figure 8' album on Dreamworks records. The interview was rushed, partly due to Elliott having to rush off for his soundcheck... mainly due to the fact that I had twenty five minutes to knock off the interview, hop in a taxi and get half way across London for a train back to Cardiff where I was due to record an edition of 'Tutti Frutti'.  \n\n\r\nHe intimates on 'Son of Sam':\n\r\nELLIOTT: No, it was made before I knew about that movie... and then when the movie came out I was like, \"Oh no! It's gonna rain on my parade.\". It's not about the serial killer, I'm not sure exactly what it's about because it's just sort of like telling someone a dream you had last night. There are some destructive figures in it, 'Son of Sam', Shiva... but Shiva's also associated with creativity... I'm not sure... it's just an impressionistic song about destruction and creativity, I guess; if it's about anything.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nIs it not about the media's need for a villain; or hero? \n\r\nIf this was on Dreamworks then ES's feelings about being commercialised were well documented and this song hones in on the way he felt molested.\n\r\nThe references to Berkowitz just reflect the way the media has pin-ups to gain eyes, the same way the music press has - and he didn't want to be part of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI always thought Shiva had a dual meaning - chiva, Mexican slang for heroin. But maybe I'm just looking too hard for oblique smack references.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nthe video really reminds me of this quote from american beauty\n\r\n\"Sometimes there's so much beauty in the world I feel like I can't take it, like my heart's going to cave in. Sometimes I feel like I'm seeing it all at once, and it's too much, my heart fills up like a balloon that's about to burst\"\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nNow, correct me if I'm wrong, or missing something, but isn't Shiva male??\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI think vaguely this song is about doing something that you really want to do but has a hard consequence, though I'm not sure about what though.\n\r\n\"I told the boss off a made my move\"\n\r\nA metaphor, Say your at work and don't wanna do what your boss tells you so you say no, which feels good at the time but the consequence is you'll have to deal with it tomorrow.\n\r\nAfter searching 'son of sam' I came with \"The phrase Son of Sam Law refers to a type of law designed to keep criminals from profiting from their crimes\", which would fit well with what I said before.\n\r\nPerhaps the thing it is talking about is in a relationship. It could be to do with musical descions he makes like; by not doing what will make number 1 hits and doing what he really feels is right though the record company would be annoyed and lose money.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nI think it's a bout america. Sam being uncle sam, the rest just seems to make sense. son of a doctor's touch a nurse's love, acting under orders from above, thats america!\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nNone of you guys read the comments (but I'll repost this from Stuffclg anyway) :\r\n\"You guys really oughta like actually read about elliott before you interpret his songs. Like and interview or two. IT IS NOT ABOUT SON OF SAM. He actually said that, and that he was not thinking about Son of Sam at all.\n\r\nAccording to elliott the song is about destruction of relationships. Which, if you look at the rest of figure 8, makes a lot of sense. His albums werent concept albums, but they tended to have very similar themes. Self Titled-lots of drugs. XO-lots of references to interventions.\n\r\nJust guys. please more interviews, you can learn a lot from him. Sorry if i came off as a jerk, but, I spent 2 years researching all these songs.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nElliot wrote songs about his life dilemmas and then obscured them with outside world events. When he says \"couple killer each and every time\", maybe he sabotages relationships and thinks of himself as some sort of couple serial killer, \"son of sam\" \n\nplease note that I got this idea from his biography and all credit goes to W. Tod Schultz\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI'm pretty sure he said specifically that this song is not in reference to the actual serial killer, so I'm not going to try and prove that.\n\nFrom a completely subjective and non-evidence-based standpoint, this song has always seemed to me like this thoroughly amoral celebration of freedom and the giving up of conventions and social norms in favour of personal liberty. It's almost like this maniacal high of realising you just don't care. I suppose a similar narrative could apply, or at least relate, to the concept of creativity.\n\nEven though, as with almost all Elliott Smith songs, there are darker undertones, I find this song empowering.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nYou guys really oughta like actually read about elliott before you interpret his songs. Like and interview or two. IT IS NOT ABOUT SON OF SAM. He actually said that, and that he was not thinking about Son of Sam at all.\n\r\nAccording to elliott the song is about destruction of relationships. Which, if you look at the rest of figure 8, makes a lot of sense. His albums werent concept albums, but they tended to have very similar themes. Self Titled-lots of drugs. XO-lots of references to interventions. \n\r\nJust guys. please more interviews, you can learn a lot from him. Sorry if i came off as a jerk, but, I spent 2 years researching all these songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nYes, he was probably using son of sam as a metaphor. but its not about son of sam. can't just read it line for line. Poetry is for the pretentious. you gotta think like a pretentious person might.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI was at work and a song came on the store's radio and the piano part sounded a LOT like this song's... it sounded older, therefore i assume maybe elliott borrowed the melody or something? if anyone can help me figure this out, please reply!\t\t\t\t\n\t\t\t\t\n\n"}