{"comment_0": "\nThe singer is the killer, thats what makes the song so scary.  He says the killer quotes John Milton on the walls, the singer claiming that the cops told him this, yet he himself quotes paradise lost: \"Farewell happy fields Where joy forever dwells \".\r\nThe last part is what freaked me out the most when I first heard it. No matter how often I've heard it since, its still good for a chill.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe narrator was definitely the killer, and as far as I can see there's three clear indications of that provided: firstly, the echo of the early reference to his tale of murder befalling \"a man and his family\" in the question \"are you a family man?\" Secondly, there's the fact that the narrator quotes Milton, as others have pointed out, fitting the killer's MO, and finally and most eeriely there's the narrator's subtly but distinctly too-knowing description of the details of the murder (\"those lunatic eyes, the hungry kitchen-knife\").\n\r\nBrilliant song, gives you a crawling sense of terror and foreboding without ever hammering it's point home clearly.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song for me centres around the ambiguity of weather the narrator is the killer and the irony of his wife being named Joy .\n\r\ngloom, that's an interesting idea i hadn't thought of the inclusion of \"Red Right Hand\" in the song in quite those terms before...\n\r\nGirgo, I don't think that the character in Red right Hand can possibly be the same as the character in Song of Joy simply for me the character in Red Right Hand is God.  the quote from Milton itself refers to the possibility of God's vengeance on the rebels.  \n\nen.wikisource.org/wiki/Paradise_Lost/…\n\r\nFarewell, happy fields,\r\nWhere joy for ever dwells! Hail, horrors! hail,\n\r\nDoesn't the fact that he quotes paradise lost, almost abscent-mindedly during the recounting of the tale of his children's and wife's murder clarly point to him as being the murderer?  He appears to be further implicated when he claims that the killer \"In my house he wrote \"his red right hand\" That, I'm told is from Paradise Lost\".  \n\r\nThe fact that the narrator first quotes Paradise Lost in conversation and then claims to have no knowledge of it, for me seals the case that he is the killer.  \n\r\naffe, I don't see any evidence of the killer suffering from a split personailty or of this song being a kind of retelling of Jekyl and Hyde.  \n\r\nI think this song is about a family man and doctor whose wife became depressed and he grew bored of her and in revenge (the quotation of Milton \"His Red Right Hand\" supports the theme of vengeanvce if you look at it in it's original context) he murdered them and took up the life of a vagrant to kill others.\n\r\nGravityAlwaysWins I think that it is the latter.  I think the quotation from paradise lost \n\r\nFarewell, happy fields,\r\nWhere joy for ever dwells! Hail, horrors! hail,\n\r\nsummarises not only the oncoming of Joy's depression but of the narrator's desire to murder his family.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nAbsolute terror!! The whole song. The perfect combination of music, voice, lyrics makes you shover as hell. One of the few songs in the world that awake a very strong emotion in my: FEAR!!\n\r\nA real masterpiece.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nYeah, I think he was the killer he was talking about, who now just wonders possibly looking to just recreate his crimes. 'In my house he wrote \"his red right hand\" ' is a line that strongly suggests it was the story teller himself (Cave, in a fantasy role of an insane Cave) who did it.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nYou are right about narrator/killer being the ame. The absolute worst part isn't the past, but it is what happens after the story ends. These lines are building something up:\n\r\n\"It seems he has done many many more \"\n\r\n\"I am upon your step and you are a family man \"\n\r\n\"Do you, sir, have a room?\r\nAre you beckoning me in? \"\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni know that the narrator is the killer, but the other day a question was brought up that i'd never thought about:\n\r\nwas his insanity the cause of joy's depression, or was her depression the cause of his insanity? if the latter...what was wrong with her?  and even with the children?\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nmight i also point out that the line \"all things move toward their end\" was also in \"Do You Love Me?\" (pt 1)... if there is a connection, it might be the same men in both songs.. although \"Do You Love Me?\" (pt 2) speaks of paedophilia, so i kind of doubt it.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nDefinitely the killer - that's what makes the song. Without it, it's just some guy telling the tale of his dead family to some other guy in the woods......who cares? It also would remove any tension or suspense this song had if he was NOT the killer.\n\r\nAnd surprising to me, the thing that proved this to me initially was the one Milton quote no ones mentioned.\n\r\n\" 'The sun to me is dark, and silent as the moon'.....do you sir have a room,....are ya beckoning me in?\"\n\r\nOr, basically, \"here's a John Milton quote Mr. Family man, are you well read, do you understand that i'm admitting to you that i killed my own family? How bout that spare room? You inviting me in here or what?\n\r\nPhenomenal song.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI think Dressed2Depress had it right, in that the narrator resented Joy's depression, since it robbed him of his own happiness.  The narrator hints that Joy was guilty in some way when he asks if it was \"an act of contrition\" that caused her sorrow, suggesting that she deserved it (in his own mind).  Also, he makes sure to point out that the daughters were \"their mother's children,\" which could only add to his sense of loss and feelings of resentment.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nHi guys. The ultimate PROOF the narrator-traveler is the killer:\n\nHe says \"In my house he wrote \"his red right hand\" / That, I'm told is from Paradise Lost\". Okay. But do you recognize what he quoted just a moment earlier? \n\n\"Farewell happy fields\nWhere joy forever dwells\nHail horrors hail\"\n\nThese lines are straight from Paradise Lost, not a single word changed.\nLet's see some more:\n\n\"He's still on the loose\nIt seems he has done many many more\nQuotes John Milton on the walls in the victim's blood\"\n\nThe narrator is the serial killer, a Milton maniac, who killed his own family and is coming for another, that's why he's knocked on the door of a \"family man\". The more people in the house, the more blood, more \"entertainment\" for the SICK'n'tired traveler.\n\nThe lessons from the story seem quite simple though. Never let a stranger finish their story... and know your fiancÃ\u0083Â© before you marry them :O\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis is a very chilling song...I think the meaning is clear (it's a story about a man whose family was murdered and who now walks the world alone). The lyrics, however, don't convey the utter desolation of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nYou mean the music does?\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nNo, more like his tone of voice does.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nAbsoloutly fantastic song and great lyrics. To me,  the storyteller and husband is the killer of his family which he grew tired of. The wife grew silent with time and the kids were silent as mice,  which one day made the storyteller go crazy and kill them.\n\r\nNick Cave is the best lyric and song composer ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni just thought it was the character from the song Red Right Hand\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nHeh. Would any of you let this guy in after that story?\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nYes.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThe entire cd \"Murder Ballads\" is about him killing people. It could be the same guy or it could be different cases. It could certainly be both.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nTwistedLittleStar, that is the best idea I have ever heard.\n\r\nThe narrator of the songs of murder ballads are not the same person, in the curse of milhaven the killer is a fifteen year old girl.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nYeah TwistedLittleStar, great idea - or a movie comprising all the murder ballads songs as short stories. That would be sweet...\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\n\r\nI just came on here to validate my suspicion that the narrator is the killer. I also agree that his insanity, although it was probably always within his reach, was dormant until the subsequent failing of his marriage.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nCould be Joy the killer of the babies, due to her depression, and then the narrator killed her for revenge? Something here and there in the lyrics suggest me that option\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThe narrator is definitely the killer. I think the lines:\n\n\"Well, one night there came a visitor to our little home\nI was visiting a sick friend\nI was a doctor then\"\n\nShows his madness coming in. The \"visitor\" is his insanity. This \"sick friend\" is this sick side of him that he's allowing to take over, he's visiting it in his mind. I guess the doctor part could be his actual occupation or perhaps more likely, in his mind, he is curing his wife and children of their depression by killing them--in this way he's being a \"doctor\". Just some insight on something I haven't seen talked about. I think it makes a lot of sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nAlso, he says he was a doctor and \"visiting a sick friend.\"  This was a joke back in the day, code for when men wanted to go out with the chaps and get in trouble.  \n\nIf anyone's familiar with the \"dogs playing poker\" paintings by Cassius Coolidge, there is a painting in that series called \"Sitting Up With a Sick Friend\" that depicts the dogs playing poker and the wives catching them.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI've always wondered if, when he says the children had their mother's eyes, whether he is suspicious that they are not his. It might add further motivation to the murder.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI don't know where the lyrics \"La la la la la la la la la la\nLa la la la la la la la la la\" come from, but their not in the song at all.\nCan't be bothered to check the cd album myself, but maybe it was in the lyrics book that's added with the cd.\n\n\n\"Then one morning I awoke to find her weeping\nAnd for many days to follow\nShe grew so sad and lonely\nBecame Joy in name only\nWithin her breast there launched an unnamed sorrow\nAnd a dark and grim force set sail\nFarewell happy fields\nWhere joy forever dwells\nHail horrors hail\"\n\nFor me the most interesting part. It still left me in wonders, what happened to this girl called Joy?\nMiscarriage, cancer, crazy husband. Was it something that happened overnight?\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nWhy assume that the man killed his wife _and_ family?  Children are most often killed by the mother after all.  If he found the children killed he could have then killed his wife in a similar manner.  When he got the housecall he went out to get himself an alibi.  He now kills to make it seem like the killings were the first of a serial killer.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nthe narrator is clearly himself the killer. he suffers from a split personality (as dr. jekyll & mr. hyde--see the line \\\"i was visiting a sick friend / i was a doctor then\\\"--he was visiting his other personality) and is pulled between benevolent and malevolent intentions. therefore the references to \\\"paradise lost,\\\" which tells the age-old story of good versus evil.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthese lyrics just give me the chills!!!!i was about to make the dr jekyl-mr hyde reference but it s already been done & analysed....i think tim burton should make a movie inspired by one of nick cave's songs....that would be really interesting\t\t\t\t\n\t\t\t\t\n\n"}