{"comment_0": "\nTo me, this song is about not being able to make it work with the one person that you love.. 'the one that got away', even.\n\r\nIt accurately shows the entire development of the relationship, from the excitement of first meeting them (we touch i feel a rush.. etc.) - to the fear of being vulnerable with this person (i've been treated like dirt before 'ya).\n\r\nHe accurately describes how people want what they can't have during the development of a relationship (you want them when they don't want you, soon as they do feelings change), but justifies this as he tries to explain that it 'must've been fate':\n\r\nIt's not a contest and I ain't on no conquest for no mate\r\nI wasn't lookin' but I stumbled onto you, must've been fate\r\nBut so much is at stake, what the fuck does it take\n\r\nthose defensive lyrics, particularly the first line, highlight his fear of this commitment and sets himself up for disappointment.\n\r\nIt starts with his partner no longer wanting him which breaks his heart and he does anything to fix it. This sudden 'roller coaster' and confusion sets him into a spiral of depression and anger which makes him angry that he can't have her so he tries to kill her in his confused and angry state. He's passionately angry over how much he let himself love her and how much she doesn't care for him. \n\r\nIn the end, the artist put so much trust and knew what was at stake before putting this trust into the relationship, that when it fucked up, the effects were amplified causing self hatred for trusting this person (before i put this gun to my temple i told you this..) as well as the girl herself. \n\r\nThis song isn't just about any relationship. It's about that one person you love the most....\n\r\nSuch strong lyrics, Eminem pwns as usual.. best song on the album IMO \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nMy interpretation for the song, taking in consideration also the video, is that everything that is said in the lyrics are just thoughts about getting in an emotional relationship. People, who believe in extreme love but were hurt badly because of this, sometimes take the decision to remain cold all their lives and not show emotions, because if feelings are involved things can get ugly and dangerous. The song is a fight between him and his subconscious for not opening up. The lyrics represent the subconscious, who is reminding him how love is evil. He meets someone new that wakes up his feelings and the subconscious wants to threaten her to stay away, his falling in love and itâ\u0080\u0099s exactly how he thought it will be and he needs her help to end it. He tries to explain himself how much love is in him and how badly itâ\u0080\u0099s going to end if things are moving further. \r\nThe only way he would open up for her is if she will convince him and promise him that itâ\u0080\u0099s not going to hurt him, but nobody can make such commitment and he knows it.   Although he will remain cold because of loveâ\u0080\u0099s nature, he wants to be remembered by her that he exists, their love cannot be saved because itâ\u0080\u0099s too late, someone hurt him badly before and he cannot be the same. He compares himself with a racket ship which can go far into space. She is very close to him, (Earth â\u0080\u0094 Moon) and from all the stars from a clear night sky he aims at her (The Moon). Telling her somehow what sacrifice she is considering his potential, but still, he â\u0080\u009caimsâ\u0080\u009d at her.\n\n\n", "comment_2": "\nThis song is absolutely amazing. The chorus is beautiful. The meaning is pretty clear; he's in love.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWhy doesn't enyone else besides d32h9, gr1fter and myself see that this song is cleary about his battle with addiction.  I have to admit after first hearing the song I did think he was talking about a previous relationship, but listening to it more than once, it made more and more sense that it is the addiction he is talking about.  C'mon now people think outside the the box, like EM does, his words have a deeper meaning. He did and interview on sirius radio and he said the song is about the addiction.  It really doesn't seem like him to have more than one love song on this album...just saying.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song is by far, my favorite song by Eminem, aside from When I'm Gone, I especially love these lines\r\n\"I'll do whatever it takes, when I'm with you I get the shakes, my body aches when I ain't with you, I have zero strength, there's no limit on how far I would go, no boundaries no lengths, why do we say that till we get that person that we thinks, gonna be that one and then once we get em it's never the same, you want em when they don't want you, soon as they do feelings change\" \n\r\nThat whole verse is so true for me, I always have liked people who have had no feelings for me back, then once they do, I move on... it's so frustrating.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis is Eminem's attempt at producing a sad love song, he succeeds immensely. Eminem tells his story of love from a different point of view which we're all not used to hearing. This song starts of with Eminem describing the feeling that Kim gives him and ends with him wantinging to kill her. I think this song shows the versatility that Eminem has in making music. This song is powerful, and like most of Eminem's songs, full of real emotion. \n\r\nFavorite line:\r\n\"love is evil\r\nSpell it backwards I'll show ya\"\n\n\n", "comment_6": "\nif this is eminem's love song at least he kills the girl and himself at the end, classic\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nAnother favorite from him! This song is pure genius!!! \n\r\n\"And love is evil\r\nSpell it backwards I'll show ya\"\n\r\nBRILLIANT! I stopped the song right there to shake off my goosebumps. \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\n\"Why do we say that until we get that person that we think's \r\nGonna be that one and then once we get 'em it's never the same\r\nYou want them when they don't want you \r\nSoon as they do feelings change\"\n\n\n\r\nAnd this is why I will probably always be single lol. So true.\n\r\nThis album is amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nNot only is Eminem a master at multies, metaphors and similes, but he's also a master at flow.  None more evident than on this song.  Perfect example is how he builds up his rapping speed in the first verse to have it come to an abrupt halt when he compares her to a supernova, which in essence are how supernovas react.  Genius!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nWell it does sound more like a relationship\n\r\n\"your heart's the moon\"?\n\r\nsounds more like a person to me\n\r\n\"imma show you what it's like to hurt\"?\n\r\ni didn't know that drugs, which are inanimate, can hurt\n\r\n\"i put both hands on your throat\"\n\r\nyou can't kill drugs either  \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthis song gives me intense chills\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthe song is about a girl for him it's kim.... the hole thing is about how you always fell like your in love and you want someone till you get them then you forget what made you want them if the first place...first part- love sucks but it fells good second- you don't want it just happens you can't help it third- it hurts and when it ends it fells like the end. its one of his deepest songs ever...... stop with this drug shit or is eminem not aloud to make a clean song it sound like you guys want him to get hooked a third time he almost died last time...   \t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI just love this song! I have a tattoo on my wrist that says \"live si evol\" because this song gave me the idea the letters are backwards like the e and s are so that when you put it in the mirror it looks exactly like \"love is evil\" :)\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nhonestly, think outside the box. we all know eminem & what it sounds like hes rapping about is ushally 100% of the time the exact oppasite,& whoever said it was about mariah i should slap you,& kim i can see why you guys said that. but i think either hes singing about THE GAME since he was married to the game. Or this is about how every girl has fucked him over, so thats why he has \"no love for these motherfuckin hoes\" c'mon guys, your eminem fans right?! you guys should know him better than that. But i must admit i still have no idea what love the way you lie is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni think that its really creative and  i think it has a very strong meaning for people all over the world\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis song is so fucking good. Is the chorus a sample of another song?\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nnot sure what the chorus is from but this song is great. the meaning is obvious and shady is back!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis song definitely caught me off guard. A love song by Eminem!? Well, the first two verses are. It's most likely about Kim, and I love it. He can bring the heat while rapping about love. Awesome.\n\r\n\"You must be a sorceress 'cause you just\r\nDid the impossible\r\nGame I trust, don't play games it'll be dangerous\"\n\r\nAnd I'm pretty sure it's:\r\n\"You must be a sorceress 'cause you just\r\nDid the impossible:\r\nGAINED MY TRUST.\"\n\r\nThat sounds way more believable in the context of the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI don't know...but this song seems like he is talking about his battle with addiction (which is what the Album is about) another Metaphor song similar to 25 to Life.\n\r\nOne line that stands out is\n\r\n\"So after a year and six months, its no longer me that you want\"\n\r\nWhich is roughly the same amount of time he has been sober... \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni dont think this is about kim.. \"a year and six months and its no longer me that you want\" possibly mariah? idk not too sure though. at first i thought this song was a joke cause ive NEVER heard this side of eminem. but i love how he ends it how shady would end it, snappin her neck like a popsicle stick :)\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI think Eminem sings about person who he was in relationship for a year and six months. He is in love but she does not want to be with him anymore. even though he still cares. He also writes about Kim I think \"'cause I been treated like dirt before\". Then he did not want to love again but she (new girl) did the impossible and gained his trust. However she broke his heart. Sad song\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI really don't think this song is about Kim... There's another song on the album that is \"definitely\" Kim-oriented, but I think this has to do with a \"new found\" relationship he has recently experienced. Especially since a large part of the lyrics reference some of the feelings you get when you first start to date or share a romantic interest with someone... So I'm just really thinking that this song has NOTHING to do with Kim! There's a line in this song: \"after a year and six months\" ...  I really don't think a \"year and six months\" would hold too much significance to the song if the woman in reference was Kim.. seeing that they have been on agian off again so many times that keeping up with how long \"this time\" lasted would be redundant.\n\r\nC'mon guys... think outside the box and listen to the words. Think beyond the first and obvious answer. \n\r\nAnyone have any ideas about who this mysterious love interst of Eminem's is that he's referencing in the song???\n\n\n\n", "comment_23": "\nDEFINITELY NOT A SYMBOLIC SONG TO RESEMBLE ADDICTION!!!! Psh! Ha.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nApsolutly Love this song, Eminem has made such a beutiful song.\r\n-- Promise me if I cave in and break and leave myself open That I wont be makin' a mistake <3\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI think this song is 100% about his addiction, and not about a girl at all.\n\r\nListen to the words.\n\r\nThe entire opening the second verse is about drugs.\n\r\n\"I do whatever it takes\r\nWhen I'm with you I get the shakes\r\nMy body aches when I ain't\r\nWith you I have zero strength\r\nThere's no limit on how far I would go\r\nNo boundaries, no lengths\"\n\r\nThe third verse, the year and six months reference, that's how long he's been clean.\n\r\nIn the first verse, ending it with \"You're a supernova\" talking about how the feeling while on drugs is like nothing else and it was the bright spot for him in his dark days, but they burn out relatively fast and then it's back to normal, just like the effects of a drug high.\n\r\n\"I wasn't lookin' but I stumbled onto you, must've been fate\" Talking about how he never wanted to become hooked on drugs, but through all the tough times and losing Proof it just kinda happened because he needed them at the time to get through.\n\r\nThis song is riddled with drug references the entire way though, first time I heard it I thought it was about addiction. Em is a lyrical genius and he continues to show it on this song and the entire album. Amazing work by Em on Recovery. \n\n\n", "comment_26": "\nThe songs about a relationship, it doesn't have to be with anyone, its just a song about a relationship. its not about drugs or anything, clearly, read the lyrics and you can tell. not everysong has a deeper meaning. It's about how being with someone makes you get the butterflies and shit, and how things go from good to bad.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI agree with the whole thing about how it's about his battle with addiction. Addicts are selfish and only want one thing and will do anything for it, and it was literally the love of his life at the time.\n\r\nsuch a good song <3\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\neminem and kim remarried for a year and six months and divorced again. the song is about kim.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nwell its the same situation with the \"Girl With Golden Eyes\" song by Sixx A.M. that song was about a heroin addiction but some lines can be turned into a relationship with a girl. This song can be either relationship or addiction depending on the listener. you cant kill drugs but you can kill the addiction. i think thats what he means by \"i put both hands on your throat\" \t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nOmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmg..\n\r\nIt's NOT about drug addiction! RELAPSE was about his drug addiction\n\r\n\"Encore I was on drugs, relapse I was flushing them out\"\n\r\nHave you listened to 'De ja vu' and 'Talking to myself'?!!!!\n\r\nYES sometimes songs are a metaphor for drugs, and even alcohol (referring to the song 'Moonshine' but this song is CLEARLY a love song.. He's written about having 'other' love interests before;\n\r\n\"Who woulda knew, who woulda thought possibly cupid coulda shoot anothe one of them god damn darts at me\"\n\r\n.. And when he said \"Almost introduced you to my daughters\"\n\r\nCOME ON I've been wanting to discuss the possibility of Eminem having a relationship with someone that's not Kim! How interesting!\n\r\nI really don't think it's Mariah, either lol.\n\r\n*(Sorry for posting this 3 times.. I'm new to the site lol. Well not really.. New to posting on the site!)\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nSorry slight mistake in above post I meant \"divorced 14 months later\" and then remarried for anoter two months making it 1 year and six months in total.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI think this song may have relation to his uncle ronnie who killed himself over a girl because the song ends with him killing her then killing himself over her, i think it inspired the theme of the song and then the love lyrics just came from eminem's experience with girls also.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nAnnoying, why isn't there an edit button here.\n\r\nOk, got it now. The song must be dedicated to Kim, they married in june 1999 then divorced in August 2000 - that's 14 months in total. Then they married again in January 2006 and divorced 1st week of May 2006 which is another 4 months so that's 1 year and six months like Eminem says.... it must be about Kim.\n\n\r\n\"Don't ask me why I have no love for these m'fuckin' hos\r\nBlood-suckin' succubuses, what the fuck is up with this\r\nI've tried in this department, but, I ain't had no luck with this\r\nIt sucks but it's exactly what I thought it would be like tryin' to start over\"\n\r\n^^ He's referring to the woman who are constantly throwing themselves at him. It seems like he wants Kim back...\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nAlso \"I'm a space bound rocket ship and your heart's the moon\r\nAnd I'm aiming right at you\r\nRight at you\r\n250 thousand miles on a clear night in June\r\nAnd I'm aiming right at you\"\n\r\n^^ they married June so he's making a reference to when they first married. \n\r\n\"You must be a sorceress 'cause you just\r\nDid the impossible\r\nGained my trust\"\n\r\nKim did two or three interviews after they split to set the record straight, she could have done a lot more, she could have even written a book and made a lot more money off him, like all his relatives did lol but she chose not to so I think that's another reference.\n\n\n\n\n\n\n\n", "comment_35": "\nwell to be honest i've listen to this song a lot\r\n and first a though it was song about addicton like few people said befor but \r\nafter i listen the whole album (and this song) few times im pretty sure that this song is about his girlfriend or relationship that he is or was in \n\r\nBut it's over now\r\nIt's too late to save our love\n\r\nand also i think that \"love the way you lie\"  is about the same relationship. director of this video said that isnt about kim so it must be about the girl. and em usually write about things that he's going through so for me is pretty clear\n\r\nwhat do you thin about this?\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nummm...have any of you thouht that maybe this song has more than one meaning? i think its about is addiction and his relationship. cuz if you listen to the lyrics it talks abuot both. it also talks about his connection to hip hop.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nWhere it says: \n\r\n\"Up to my knees and I'm bleedin'\r\nI'm tryin' to stop you from leavin'\"\n\r\nDoesn't he say \"Drop to my knees and I'm bleedin'...\"? I think I heard him say drop. :P\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\n@ Audric - Are you serious? It's called a personification.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nahhhhh. i love it. so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nSee nobody thought about this, i think hes talking about his drugs the first 2 verses, but then the last verse its the drug talking to eminem. and how the drugs going to try to kill him cause hes quiting the \"drug\"..................AKA overdose?!?!! \t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nEminem is a lyrical genious who can create a song and make it fit into anyones life. if you have'nt battled addiction you would'nt understand that this is what he is most likely talking about in  this song, yet he is so incredible to turn it into other things to get people through though times in ther life, as in a lost relationship. his last two albums are relapse and recovery, in which he is venting about recovering. knowing what he has gone through, i definately think this song is about addiction but he wanted to put it in a way that other people can relate to.. sinse eminem has been known he has talked about his personal life in metephors that most people wouldnt understand unless they have been in that spot. he is always real..he is the most incredible artist out there\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nJust about anyone can relate to this song!\r\nIt is by far amamzing! \r\n:) keep it coming Em!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nyou guys are dumb! this song is definitely not about drugs! for instance:\n\r\n-how can he refer to drugs as a sorceress? drugs don't have a gender.\r\n-it talks about the development of a relationship (Why do we say that until we get that person that we think's/Gonna be that one and then once we get 'em it's never the same)\r\n-\"I'll blow my brains in your lap\" \"Lay here and die in your arms\" \"til I snap ya neck like a Popsicle stick\" drugs do not have laps, arms, or necks.\n\r\nanyways...I think it's about a failed relationship. I'm not sure.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThe interesting thing about drugs and addiction is that it can often be considered to be, recognized as, or mistaken for a love interest.  In the case of this song, I think it represents a certain love for addiction.  Of course no one truly wants or desires addiction... until it happens.   But, when it actually does happen the addiction is like love. \n\r\nI have an ex boy that I dated for many years and we were crazy in love!  He later became addicted to crystal meth.  For me, his struggle with this addiction felt like he was cheating on me.  Although, he never cheated on me with another girl; metaphorically speaking, he was â\u0080\u009ccheatingâ\u0080\u009d because thatâ\u0080\u0099s what it felt like.  Later, I decided I wasnâ\u0080\u0099t going to compete with his new love interest.  \n\r\nAnyway, I think thatâ\u0080\u0099s the reason the song is being debated as to what it is actually about.  I think it is about love, addiction, and his love for addiction.  And, I think it is about both drugs and girl(s).  Love can make you shake.  Drugs can make you shake.  Love can give you a rush.  Drugs can give you a rush.  Love can be â\u0080\u009cevolâ\u0080\u009d.  Drugs can be evil.  Every lyric in this song can be a reflection of love and a reflection of addiction.  The last verse talks about killing (it)â\u0080¦ killing the addiction or killing the girl, which is not uncommon in his music because he â\u0080\u009ckillsâ\u0080\u009d a lot in his lyrics.  As someone mentioned above, Shady is an effing lyrical prodigy.  We arenâ\u0080\u0099t giving this mastermind enough credit if we think that this (or any of his songs) only represents ONE facet of his life.  Brilliant I say!  \n\n\n", "comment_45": "\nMaybe its comparing the girl to drugs and how they are so much alike and how he was addicted to them both.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nif your a guy or girl from age 14-15 you know exactly this song means.\r\nlove is evol plain and simple. you will do anything for it but when you get it you don't want it.\r\nthen drama starts people make a big deal they make it hurt more then it should have so you hurt the person that hurt you.but you still want that person and its all a big mess.... \t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nthis could be a song completely not related to him, artists do do that.\r\nTaylor Swifts new song is all about what its like with her baby and husband...\r\nTAY DOESN\"T HAVE A BABY OR A HUSBAND.\n\r\nEminem is great enough to make up stories for songs to reach out to his fans.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nThis is the most amazing song ever written. So heartfelt, it's like he stole the words right from my mouth. \t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\n\r\nThis song is about a female fan who fell in love with Eminem and used to write letters to him and he eventually took to liking her but she gave up on him and then he gave up on her (through this song) and it was too late to save their love. It's about Unrequited Love-Love U want but can't have\n\r\nA year and 6 months is the time Eminem was counting since the last letter she wrote him.\n\r\n'promise me if i cave in and break and leave myself open that i won't be making a mistake'-she wants him to trust her but also understands what a private person he is and why he won't write back to her because he's afraid she'll go and run her mouth and it'll be all over the media and things will just get chaotic and people will give him a hard time about her, and he's telling her that he's afraid of opening up to her because he's afraid it'll not only wreck what they have/had but it will also cause him to regret opening up to her.\n\r\n'you want 'em when they don't want u soon as they do feelings change'-people feel so bad for eminem but they regret to think, acknowledge, or know that (maybe) this girl had feelings for eminem to begin with but she didn't feel those feelings were reciprocated/returned, so she let him go, and soon as she did, he started wanting to be with her.\n\r\nIt's not about addiction or kim.\n\r\nIt's not even really about a relationship cause u can hear from the lyrics that their love ended before it really began.\n\r\n'I wasn't lookin' but I stumbled onto you, must've been fate'-this is about the time he got her letter \n\n\r\n'But a door shuts in your face'-she loved him and told him how she felt but he pushed her away-he 'shut the door in her face'\n\n\n\n", "comment_50": "\nThis was me and my girlfriend of 6 month's song. It made me wanna cry then, still does now. \t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nIt says \"love is evol spell it backwards I'll show ya\"\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nlmao i always love it when u c ppl read wayyyy to much into lyrics love is evil spell it backwards ill show ya just like someone pointed out he even pronounces evil like evol... love evol annunciation e-vul evil e-vul *gasp* wow it doesnt mean i twisted love to evil to live oh i gotta live my life like this to get it no jack ass he just means it sounds like evil backwards \t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\n^^i meant that to b a reply and i placed as a comment by acc and i cant get off so ignore \t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nit's about him breaking up with his girlfriend\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nhey guys,stop worrying about his love life.\r\nthis song ....just like most of his other songs, has a deep personal meaning to him but iem shure he doesnt want you to find all the missing pieces.\r\ni love this song. hands down amazing.\n\r\nndd idk why you are all trying to say its about drugs or a girl.\r\nhow bout both?\r\nem is no idiot. he has the talent to pull it off, ndd he did.\r\n<3\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis is probley da best new song Em has made.\r\nIt's kinda sad and makes ya think of the people ya have been wit before and how you hate them now.\r\nLove is a bitch sometimes. \r\nThis song really speaks to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nIn the third verse, instead of 'Up to my knees and I'm bleedin' I'm pretty sure it's 'Drop to my knees and I'm bleedin'\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nit seems to me that this song has nothing to do with drug addictions. It is actually about an addiction because love is an addiction. \"with you I have zero strength\" people automatically think drugs but no, if you have ever felt so deeply for someone they almost complete you and you break up you feel like you have no strength. the amazing line \"love is evil spell is backwards ill show ya\" is just about this very love. love is a paradox because it is evil, but at the same time the complete opposite. Throught the song he goes about how being in love with this unknown person makes him feel so amazing but it also talks about how it can destroy you when things don't work out (hence love is evil). This love is so strong for this person that he goes into saying how he would give up anything, even die for her. He has so much feeling that he would go from complete love and compassion to hate and anger if she leaves.  \"I would've did anything for you to show you how much I adored you, but it's over now It's too late to save our love\". It seems to me that hes saying he fucked up and he still loves her and wants her back. To summarize this it seems like this is a song about how paradoxal love is, and how strong it is. He obviously screwed up, and he thinks all hope is lost but he just wishes she still thinks about him \"Just promise you will think of me every time you look up in the sky and see a star\".\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nYeah me and my girl dated a year and 6 months then she cheated on me with one guy and broke up with me for another\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI can't be 100% sure but I really think this is about addiction. Em is describing falling in love with a drug after just a taste, he describes his early fears that the drug will eventually turn on him. This is seen in the first verse. The second verse talks about it being his own fault, he also notes his lack of love for hoes. Drugs have replaced his need for a real life love. \n\r\n \"I gotta hole in my heart, I'm some kind of emotional roller coaster\r\nSomethin' I wont go on til you toy with my emotion so it's over\r\nIt's like an explosion every time I hold ya\r\nWasn't jokin' when I told ya\r\nYou take my breath away\r\nYou're a supernova and I'm a...\"\n\r\nHe talks about being an \"emotional roller coaster\", leaving him vulnerable to drug addiction, which he succumbs to at the end of this verse. \n\r\nThe third verse describes how he is fully addicted, if you know anything about withdrawal this line rings true.. \" I do whatever it takes\r\nWhen I'm with you I get the shakes\r\nMy body aches when I ain't\r\nWith you I have zero strength\r\nThere's no limit on how far I would go\r\nNo boundaries, no lengths\" \n\r\nThose are powerful words if you've experienced addiction. \n\r\nOk the final verse is where Eminem REALLY gets philosophical and paints a ridiculously genius analogy. As someone noted above \"\"imma show you what it's like to hurt\"?\n\r\ni didn't know that drugs, which are inanimate, can hurt\n\r\n\"i put both hands on your throat\"\n\r\nyou can't kill drugs either \"\n\r\nAt first glance/listen it would seem this kills the drug theory. But I believe, after hours of listening, that Eminem is describing the battle between the addicted Eminem and the sobering Eminem. Here's my big theory.... The song appears to be all from Eminem's point of view on someone he loves, but in reality the song is all Eminem talking about and to to sides of himself, rapping from both points of view, that of the addict(or the drug) and the regular Marshall who falls in love with his addiction in turn becoming the addict but still exists underneath the drugs. The last verse is Eminem the drug addict going back and forth with the sobering Eminem, the two are fighting for control over Eminem. Em tries to kill off his addiction/addicted alter ego, while at the same time his addicted side threatens to live on or even kill Em(overdose). In the end, and this is the most telling line in the song. Eminem realizes the only way to destroy his addict side is to kill himself, since they are one in the same. Similar to the end of Fight Club. I know this sounds like a stretch but read these last few lines of the final verse. \n\r\n\"Ain't no possible reason I could think of to let you walk up out this house\r\nAnd let you live\r\nTears streamed down both of my cheeks\r\nThen I let you just go and just give\r\nAnd before I put that gun to my temple\r\nI told you this\"\n\r\nThis is the key! Eminem says he won't let this \"you\" live, so he lets go, puts the gun to his own head and pulls the trigger. If he had just concluded he shouldn't/can't let this person walk out of the house and live, why would he then NOT KILL THE PERSON and kill himself? Unless of course killing himself guarantees the end of the \"person\" in questions life, which is the case as the addict and sober Eminem share the same body. \t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nwell my friend told me the song was about his first love. i think also that he found out that shed been cheating on him so he was tryin to tell her to stop cuz she was about to leave him so he got so furious the he just lost his mid and started to choke her then snapped her neck i think i just said the obvious though\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nwell after he made his video i dont think its about drugs cause hes fell in love with a girl and then she leaves him and he shoots himself3\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nSo, in general I feel the song is about a girl, and the drug-like reference is to give a stronger understanding of what exactly this girl meant.\r\nNow in my own interpretation. I feel the girl is someone he just met, but fireworks are going off in him. I think touch signifies more of a brush of hands, arms, etc. And clutch is more like a hug. I feel even after his heart break and closing himself up he figured this was maybe more of a lust but realizing it isn't and he opens himself up to her letting her in, he falls in love, and thought she was too but she wants to be more of a \"close friends\" situation. He doesn't get why, he found someone he fell in love with when he wasn't looking, so he keeps her around even if it's painful because he has hope but he also did let her in. Then when he finally starts losing feelings for her in that sense, she wants him causing confusion from the denial earlier and him to ask if he should cave or not, but he takes the risk and does because he honestly loves her. The \"after a year and six months\" makes me think he is talking about the whole time they had known each other not just dated. She basically breaks his heart, he goes off saying he's basically causing her pain like he had warned, but he never did cause her the pain in return and let her go. When he insinuates he kills himself is more of a metaphor to show he basically feels beyond hurt, but he feels taking his own life and his last words basically being i love you no matter will hurt her more than any physical pain he can cause. Just my opinion. \t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nHi Guys,\r\nSo Eminem is back with another hit â\u0080\u009cSpace Boundâ\u0080\u009d and we here at muzu.tv are loving the slow/emotional vibe to the song. The video is great too and a little shocking in some parts! Check it out right here  muzu.tv/ie/eminem/space-bound-music-video/… . What do you guys think of it?\n\r\nCheck out our Eminem channel here  muzu.tv/ie/eminem/profile/ for exclusive interviews and content too.\n\r\nHappy Watching :)\n\n\n", "comment_65": "\nthe song is about whatever the listener feels when they hear it\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nthis song is not about being addicted to drugs because he is clearly talking about loving someone and having your heart broken \r\nthis song is also not about kim because of the line \"after a year and 6 months\" - him and kim was together for ages from when they was teenagers \r\nthis song is also not about mariah because he actually once said in a interview that him and mariah was only together for about 6,7 months \r\npersonally i think that this song may be britney spears or another girl who he had a relationship with \t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nthis song is actually about his uncle Ronnie, who, if you don't know, killed himself when Marshall was young because of a bad relationship. but Ronnie was like a father to him. but anyway, it's about a relationship that started out good, but then, feelings started to change, but they never seemed to be on the same page about it. it's about how he loved the girl, told her everything, completely trusted her, but she betrayed him in one form or another. and he becomes so emotional over it, that he kills her and ultimately ends up killing himself as well.\n\r\n(btw, the video for this song is amazing, sad, but amazing)\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nthe song meaning is obvious, but i watched the video that came out a month ago,and i have no idea what it means.can someone help me with this?\n\r\nthis song is total story of my life.some people use that as an expression, but not for me.youtube is always on at my house, and EminemVEVO Space Bound is, too\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nLyrical godpiece hats off momento song and so engaging.\r\nIt stays with you once you listen\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nThis is another song about murder from Eminem. They all have the same theme of murder or suicide but they're all different in their own ways. (e.g. Stan, Love the Way You Lie, Space Bound) It's about a hoe trying to leave Eminem, but he's in love so he snaps and threathens to kill her. Then, he realises he loves her and can't, so shoots himself instead.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nWhen I watch the video I get an entirely different view- I believe that he is in Hell forced to relive his suicide and the events leading up to it.  In the beginning it shows the wolf-  a pack animal but here alone.  When he is on the road there is a bright light at the end (light at the end of the tunnel).   When they are in the diner they don't eat or drink.  When he opens the door to the motel his G-shock is blank- \"tic toc\" (REM) ran out of time.  The \"alter ego\" stays in the diner and does not go into the motel- he knows what is going to happen and does not want to relive it.  After he kills himself it starts all over again- kind of a Twilight Zone/Groundhog day.\r\n\"Nobody knows me I'm cold\"  \"It's no one's fault but my own\"  \"I told you you take my breath away\" \"Its the path I've chosen to go  Frozen as snow\"  \"I'm a space bound rocket ship\"- I've left this world promise to remember me when you look at the night sky.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nThis song is about a man who kills himself because the woman he loved, has left him. /wikipedia/\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nthis song perfectly describes the corrupted nature of modern relationships ,it contains 3 parts and after each one you hear the beautiful chores:\r\n1)Introduction: it describes the beginning of his relationship; he is suspicious and f**ked up because of his last unsuccessful relationships and describes why he is the way he is and why itâ\u0080\u0099s so hard for him to trust her. He has two characters in this part, it, maybe it is because one is playing the role and the other one should sing, but I think it shows how he is trying to cover his real self(the person in the back sit who is angry and canâ\u0080\u0099t trust the girl) and part of him( the angry f**ked up part) tries to keep his distance and not get involved.\r\n2)Relationship: itâ\u0080\u0099s the best part and each word of it is gold, he describes his deep emotions toward her, he complains about the f**ked up chase that exist in the beginning of any relationship and how we canâ\u0080\u0099t show our love to others without fearing that it might blow the whole thing, itâ\u0080\u0099s like you have to be unreachable to be desirable and this is a messed up game that people play, this part is amazing, in the end he asks her to make a promise(obviously in his mind) however he knows she is gonna screw him, but anyway he talks himself in and trust her.  \r\n3)The end: she leaves him, after all that he has been through and finally found the strength to trust her, she Is going and after disappointing efforts for stopping her, he gives up and let her go resulting him to die inside(or killing himself which is not different from being dead inside from his point of view)\r\nand finally there is the bitter ending, the lyrics after the shooting which is his last words to the girl which describes his lost but also true love for the girl. The genius part is that when he kills himself not only the exterior part of him dies but also the very core part of his being which is the person who wanted to keep his distance and was left in the cafÃ\u0083Â© also dies.\r\nto sum up the song is about reoccurring event in his life: liking someone, getting close to her while you are feared of what is coming and finally giving up and loving her and being left alone\r\nthis song is simply perfect \n\n\n\n\n\n", "comment_74": "\nits not about drugs,\r\nits on about a relationship that was good and bad at the same time, on about how he'd do anything to show the girl how much he adores her but shes determent to leave him and she doesnt care, then she starts to want him when he doesnt want her. so he kills her and then kills himself and hes telling her to remember him .\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\noh my god this song alwyas makes me cry\r\nyou are so perfect eminem\r\nlove yaaa\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nforever everyone that missed it.... its no \"love is evil\" spell it backwards ill show ya.... THE CORRECT WAY IS   \"love is evol\" spell it backwards ill show ya..\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThis is definitely about a girl. \n\r\n\"Don't ask me why I have no love for these mufuckin' hos\r\nBloodsuckin' succubus what the fuck is up with this?\"\n\r\nespecially the succubus part. Made it obvious he's talking about a woman who broke his heart.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThis song shows my favorite side of Eminem. The side that makes him famous. I think he's talking about his relationship with Kim. When he says \"When I put my gun to my temple\" I think it's a revealing that he thought of killing himself. I think this is his true feelings for Kim. At the end he's saying that although he couldn't work it out, he's still there for her and there's a place in his heart for her.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThis song speaks to me so well. I did the same thing I gave my heart to a girl and I felt she was the one. I gave her everything and then she left and I tried to kill myself. If you're reading this don't be like me. Don't just give your heart away or you will be hurt just as the charachter in this song was and just as I was.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI agree with driaxx but there's a very important aspect in the end:\nHe kills himself after he tried to kill his love and let her go for good. He \"put that gun to my temple\" : he shot himself in the head. In the video Eminem shoots himself in the head as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nThere's no limit on how far I would go\nNo boundaries no lengths\nWhy do we say that until we get that person that we think is\nGonna be that one and then once we get 'em it's never the same\nYou want them when they don't want you, soon as they do, feelings change\n\n\n\ni love this part of the song because i believe everyone can relate to this. we've all loved someone that doesn't feel the same way.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nThis one rings close. Once upon a woman, she reached out to my core and I gave in when I am not the kind of person to be alright with the very notion of companionship. So I went in ahead, in spite of my better sense, and fell hard.\n\nFell so hard.\n\nEventually, she grew tired of me, since I was not \"the same person\" I was when we started going out. Not sure if that's true, cause I merely opened myself to her like I never have before. She showed me her faults and I accepted her, and when I did the same, she did not. Whatever, I was long fixated on her even when it was all over. I ached everyday, I hated every minute apart from her... and I became obsessed. I fucked up every time afterwards when we'd communicate.\n\nI won't deny my fault, cause I had great part of it, but she threw me away when I needed her the most. \n\nNow adays, she matters little to me, or rather, if I feel something, it is mere animosity. I am a much more balanced person now. But this song will always remind me of that relationship, years ago.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nThis song is incomparable owing to em's ingenious hard-hitting verses which is a perfect example of an extra-strong emotional experience. Most of my interpretation involves expanding the cues into a contextual narrative, the implied human experience and the unfavourable environment of the current day love-affairs which is frightening, in general. Extremely touching because of its relatable ideas like possessiveness, victimhood, abuse, compulsive thinking, social frustration, loss anxiety, self-limiting cycles of insecurity, passion, undisclosed longing and bewilderment. It serves to tell that one should love more honestly. Shows that people with a broken heart need a solid assurance to believe in love again. \n\r\nGist: Space Bound has a fantastical touch with a space metaphor in the hook, implying that the harsh circumstances between the could-be-lovers as a game of cosmic fate. \n\n\r\n...its torturous: He's passionate, maybe even in excess of what this situation can allow at maximum. An overwhelming deal of emotional rush that he just cannot share with her, drives him into a chain of destructive thoughts. All such confusions mentioned in the song adds to his self-pity\n\r\n....just did the impossible: He considers this woman special for an additional reason. She showed him a picture so compelling that he faces his \"desire to be loved\" like when it was his first time. A fact so wild, he becomes childish which is most likely  unwelcomed and mispercieved. That is why at one juncture in this story he tries to hide his intense need when he says;  \"I ain't on no conquest for no mate.\" Her image in his mind unearths his past supression for ideal love. He probes across the difficulties, complexities and the few outcomes of his undisciplined imagination. \n\r\nGained my trust...: He is extraordinarily aware of his lover's recklessness and her indifferent nature. He gets this hint from how she behaves with him or meddles with his emotions. She is definitely showing him a tough time. He sort of knows that she has misused her feminine charm.\n\r\nCause if I get burnt....: He posesses a violent tendency to react in situations he can't reason with. Hardly a warning, this is a threat because he has a bitter suspicion that she will resort to mistreatment and manipulation to get it her way and it should be done away with completely if she wants to feel his genuine love. Upon overthinking toxic signs he feels the need to defend himself.\n\r\nNobody knows me I'm cold: He has not recieved his fair share of love in this life. He  has passed through a phase of self judgement in which he concluded that his need for love eventually destroys his self-esteem and then his unkind reactions distances his lover only to fuel the problems more than ever. He is cold now that the totality of his efforts to experience love has led to his own psychological disintegration.\n\r\nIts the path I've chosen:  as obvious as it is, everyone has struggles above the ones they face in intimate relationships. Those other struggles require him to be the self he is. This self isn't full of traits that exactly lead to a healthy relation. Life so far has added up to the unlovable persona he has today. With this he also reveals he is very hurt by his troubles already and would like it if she deals with him keeping this unfair reality of his life in her mind. \n\r\n...hole in my heart for some kind of emotional rollercoaster: he's content with the idea of necessary sacrifices and unconditional compromise because he's learnt its value but somehow always sets himself up for chaos by giving in to the tsunami of uncontrolled sentiments. \n\r\nTwo hundred fifty thousand miles...And I'm aiming right at you: he knows the pain it would cause him do cover the harsh path before they can be together peacefully. The fact that he knows it and still takes up the challenge makes him perfect in every dimension. This is the value he brings to their relationship which needs to be acknowledged by her even if she doesn't love him back with the same intensity. \n\r\nMy body aches when I ain't: This woman, is to him, what home means to a wanderer. The wanderer never had a chance to settle down because he wanted the right place to belong to. Wandering here means carrying on with life without a lasting personal meaning. He feels they are fated to be together inspite of multitudes of differences. Her presence is a deeply moving experience for him. She is her single chance at being complete. \n\r\nWith you I have zero strength: he doesn't want to be vulnerable in front of a person who cannot be trusted for a consistent emotional exchanges. In the later stages of a relationship, often, the other misuses his emotional surrender to their interest. It's a blood boiling fact about one's self; this is the only place in the world where he feels torn to death when something goes wrong. It's tragic, he can't properly live with her but without her he doesn't feel alive. \n\r\n*Incomplete*\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nThe song is about Kim, eminem and kim were married in June 1999 and divorced 12 months later in August 2000 making it 14 months, then they remarried for 2 months and divorced again, making it 1 year and six months in total.\t\t\t\t\n\t\t\t\t\n\n"}