{"comment_0": "\nThere are various recordings and various spellings (stackolee, stagolee, stagger lee, stack a lee) of this song going back decades.  With it's explicit lyrics, Nick Cave's version most closely resembles 'The Great Stack-a-Lee' by Snatch and The Poontangs (a band led by Johnny Otis), in 1969.  The line \"I'll crawl over fifty good pussies just to get one fat boy's asshole\" is actually from another Snatch and The Poontangs song called 'Two-time Slim'.\n\r\nThe Great Stack-a-Lee: cowbell.fm/track/…\n\r\nTwo-Time Slim: youtube.com/…\n\n\n", "comment_1": "\nI didn't think I could like this song more, then I saw the video. Nick Cave does the best homoerotic out, and still manages to look incredibly bangin' in a pink shirt.  \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nStagger Lee songs are rumored to have come to America on slave ships- I've read that he's been killing poor Billy for centuries and centuries.  \r\n  I've also read, and agree with, that the overblown violence and profanity in Nick's take on Stag is a commentary/parody on gangster rap.\r\n  Anyway, this is my second favorite Stagger Lee song, the best imo is The Clash's Wrong \"Em Boyo.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIt is very rappy, I love that! Cave is a brilliant satirist, and if there's any good place to take the piss out the rap phenomenon, it'd be Murder Ballads. It's got a fantastic bass line, metronomic rhyme-droppin', and of course, all that fucking profanity. Absolutely genius. One of my favorite songs he's done!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI'm a bad motherfucker, don't you know \r\nAnd I'll crawl over fifty good pussies just to get one fat boy's asshole\" \n\r\nNick Cave's best line\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI don't usually leave blatant comments on lyric pages, but I have to for \"Stagger Lee\". This song kicks ass all the way through. Nick Cave is a storyteller.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIts not really based on the 50's song Stagger Lee, but its based on an old folk song, which the 50's Stagger Lee took inspiration from.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis is possibly my favourite piece of Nick Cave poetry of all his work. I wish I could say 'I'm the bad mothafucker called Sagger Lee' like Nick does. It would make me a real man, I reckon.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ngreat song....good times.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song is SORT of based on a 50's song also called Stagger Lee.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nStagger Lee has had many songs written about him\r\nthis is just another added to the list\r\nand a brilliant one at that \r\ni love that bass line\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nStagger Lee is actually the most written about character that was never originally created in a novel, short story, film etc.\n\r\nHis entire character is created from his appearance in different songs by different bands over the years. There was a book on this somewhere, can't remember it though.\n\r\nStill, great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThe book Bentol refers to is called Stagolee shot Billy, it's about how the song has been recorded by so many different artists. It was originally a traditional black folk song from long long ago. For serious.\n\r\nWhen I saw the Cavester live last month the version of this performed was very strange. He kept the lyrics the same, but changed the song so that it didn't sound sleazy and nasty like the one on record, but more like an epic ballad. And there was an extra verse at the end involving the devil.\n\r\nAnd by the way, has anyone seen Nick Cave's facial hair? it's real awful.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nStagger Lee is actually a true story, kind of.  It's been obviously changed many, many times over the years.\n\n.clearlight.com/~acsa/…\n\n\n", "comment_14": "\nsome times I listen to this song just to hear Nick Cave say groovy. He he.  But that's not my favorite part.  The Lines \"I gotta pretty little mouth underneath all the foamin'\" and \"Aw fuck it I'm a monster I admit it\" hit me hard\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nOops, my bad wrong song, ha ha, sorry\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nWOW!!!Nick can be shocking!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThe meaning of this song is pretty clear.  Stagger Lee was a bad bastard of a man.  Anyone who would crawl over fifty good pussies just to get to one fat boy's asshole truly is one bad motherfucker....\t\t\t\t\n\t\t\t\t\n\n"}