{"comment_0": "\nNow that Eminem is highly prased as a rapper today, I can actually look back and see the deeper meaning of this song. It is very morbid and no doubt one of Eminem's most controversial songs. However if you analyze the overall meaning it's really brillant. First I agree the Stan part means ST as in stalker and AN as in fan, symbolism of Stan. \r\nWhen you think about it, a lot of Eminem's songs are about his personal problems as well as society's problems. I think he used himself to represent a society problem, the media and music influencing people. Stan becomes so obsessed with Slim, and lives his life for Slim. I think he's trying to show the person's side rather than the music/media. It almost reminds me of the Columbine Tragedy, many people thought Marilyn Manson's music had an influence on the boys behavior and indirectly caused them to shoot innocent people. I think Eminem is trying to show that music may influence it, it is always initially the person who has the problem and not the music. You can clearly see Stan has mental issues which leads to his suicide and killing of his pregnant girlfriend (when he kills his girlfriend it actually really seems to symbolize Columbine because innocent people were killed because of madness). In the end, you hear Slim saying \"You cut your wrists too, I was clowin man, I think you need some help, why you so mad, I don't want you to do some crazy shit.\" This part is the strongest in saying how you can't literally take all controversial music or use it to blame people's problems.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think that this song is to send a warning out to his fans. Of course we all know that Eminem's next best talent is stirring up controversy. If you listen to the songs on The Marshall Mathers LP, there are many reoccurrences of a message that says to his fans that a lot of the things he says should not be taken seriously, and that he doesn't really mean what he means.\n\r\nI think this song is that same warning, except he's trying to use an example of what would happen if you take him too seriously. Stan is writing to Eminem about how he takes everything that Eminem says seriously, and Eminem writes back saying that Stan doesn't really understand him and that Stan should seek some help. Finally, we know what happened to Stan. I think the point of the song was to send out a message to his fans to not take everything he says seriously.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nlike everyone else says the song is really deep it touches the surface of the soul i mean this is where a drunk would have a clear moment of clarity..and someone whos thoughtfully deep..the truth is that em put alot of thought into this song, this definetley came from the heart and it has multiple meanings mainley towards what us the fans think of it you could just say it was a song expressing how it is for a famous person a dealing with all fans which is impossible because you cant satisfy everyone and for someone like em you can only do that through your songs ..one of the points is you cant write just write him or any famous person and expect them too respond because they got a life just like you ..i mean damn all of us are only human..he speaks too us through all of his songs, which show his personality and his life think of it from his concept not just your own.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nnaw...really.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think that this song shows the \"deeper\" side of Eminem, he isn't ALL about what people think he is. I also think that this song has more meaning then the obvious.......yes I'm talking about you Kevin..... I think this also goes to say that life isn't as easy for people like Eminem (famous) as some people think it is. But that is just my outlook on it. Thsi song is deep and I think that it will be in peoples minds for a long time to come.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI don't think anyone should get offended by the way Stan killed his girlfriend.  Eminem was actually trying to send a real message in this video.  Maybe he could have done it less morbidly, but then, he could have been more morbid, as well.  The point is, if Stan had just killed himself, it would have been sad.  But the fact that he took this poor woman and her baby with him adds to the horrific poignancy of the song.  This song was about pain, about someone trying to find himself by living through another person.  And in the end, when his sanity came crumbling down...well.  The part of the song that hit me the hardest was actually at the very end, when Eminem is writing back and suddenly realizes who Stan was, and you know that maybe (lost cause though he was), if Stan had held out just a little longer, all that death would never have occured.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nwas that Devon Sawa as Stan???:S\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI believe the term you're looking for is redundant, not double negative, chief.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nok, look look, i got something to say, and i ain't dissin Dre, but this song is makin everyone feel grey, great song and all but not the happy mood, while Eminem's showing his bare ass in the nude, maybe Stan was on drugs like coke, maybe before he drowned he choked, cause at the end of this song he croaked, and when the police found him he was soaked, his wife was dead in the trunk, maybe if he played basketball he'd be able to dunk, sounds like a punk,  talkin on a recorder while yellin at Bonnie, thinkin about Eminem's uncle Ronnie, what a good guy, but he just had to die, Stan stay alive? he won't even try, he's gonna kill himself in the water, he thinks this could have taught her, his wife...to learn how to understand, that Eminem's his best friend, never again will be able to come back, i think he was smokin crack on this track, cause it's so crazy, and he says\"now did my mother raise me?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nAlso stan could be a combination of the word stalker and fan\n\r\nStalker + Fan = Stan\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nits about what can happen to an overeager fan if they take eminem's lyrics too literally. Eminem writes about all the bad in the world and stan says that \"everything you say is real, and I respect you cause you tell it\" and when he's got his girlfriend in the trunk he says \"but I didn't slit her throat, I just tied her up, see I ain't like you\" bc he doesnt get that eminem writes, not kills.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think the literal meaning of this is song is obvious. Perhaps there is a little subtle message that Eminem is trying to say that the stuff he says in this lyrics about wanting to hurt himself and others shouldn't be taken seriously, and if you do take it seriously, you're fucking insane, just like Stan. I honestly think the entire song is about Eminem trying to express that not everything he says should be taken as gospel. The fact that in the end he lets his \"1# fan\" down, and thus inadvertantly causes his death, is kind of like symbolically Eminem is trying to say, \"I'm just human like everyone else! I make mistakes! Don't worship me or take what I say seriously!\" Perhaps as an emotional response to this incredible amount of fame and perhaps as a response to all the hate he seems to get from parents convinced he's brainwashing their kids. (I don't think the message is to the parents, I think it's to the kids. In the music video, the \"Mom\" of Stan looks at the boy and it looks like she's trying to convince the 6 year old not to follow in Stan's footsteps...I'm not sure, but it seems like she's probably cursing out Stan and Eminem and telling the boy not to be like them).\n\r\nThe irony at the end, that Eminem actually does reply back to Stan in the end, makes me think...maybe he's trying to say, \"I'm human, I make mistakes, but I always try to come through for my fans.\"\n\r\nIt's definately one of Eminem's best songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI've been an Eminem fan since the beginning. I can remember rapping his songs when I was 6 years old. Imagine a little Mexican girl that grew up on Led Zeppelin and The Doors rapping Eminem. I don't know why I loved him so much because I didn't really like rap too much. I thought he was great. But then, I remember being in 7th grade as a 12 year old and I found Stan on YouTube, and it's the song that made me /really/ become a fan. I've gotten much farther into rap but he's still my favorite rapper and I know he always will be. This song is haunting and brilliant. Definitely my favorite song of his. It's real and raw and emotional. I don't even know how to describe it accurately because there's so many different great things to say about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is really goood\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nCrazed, obsessed fan communicates to Eminem through letters and, when a response takes too long, ends up killing himself and his pregnant girlfriend by driving his car off a bridge.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nwhat can i say..... duh\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nthe song is fine, except all the crap he says about his girlfriend.  thats makes me sick, especially when he kills her also, he should have just killed himself\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\ni thought that was gay in the video?\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI like this song, it's cool how in the end you can see Stan at the window. Other songs of his I like are Kim & Kill You.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nthis is a deep song it has a really good message. it shows that people go through a lot and u think people dont care but there is always someone who does. so all the hatas can see that eminem is deep he does not always talk about killing his wife.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nthis song is probably one of his best...and i really loved the version from the grammy's with Elton John.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni'm not a huge fan of rap by any means but this songs is really very good. Its very deep and disturbing but thats good cause it's a thing that actually happens in real life and it maybe brutal but that's cause Eminem doesn't hold back. I think 99% of rap music is corny, bitch-slappin, bling-bling cRAP. BUt I really respect Eminem and this song especially.\n\n\n", "comment_22": "\nyea definitely jaxgrrl,the 2001 Grammys version with Elton John is the best ever,just too bad he had to change like half the lyrics for it,lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI love the way eminem took such a beautiful song (Dido's \"Thank You\"), and turned it into kind of a sad, sick, eerie sort of ode. it really is a great song- one of his finest.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nBy the way, wasn't that Devon Sawa as Stan?\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is aight--the beat is the thing i like, and the lyrics are perfectly put together, into a meaningful story or situation. it's sweet....\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis song is about an obbsesive fan of Eminem's  \r\nhe writes him a bunch of letters then he expects him to respond when he writes a bunch of stupid crap and when he doesn't have any time to write.\r\nthe part with dido just makes the song better. \r\nand he expects Eminem to remember everybody he sees at concerts\r\nadn then in the end when he drives his girlfriend off the dock  eminem sees the stroy on the news and decides to write him back \r\nbut its too late .\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis song has an obvious meaning, HOWEVER,\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\ni think this song is one of eminem's betta ones (of course i luv all o' 'em) its a pretty cool song i luv it oh and dido cool 2! \t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThis isn't the best song, but it's really deep, I mean, this crazy fan is obsessesed, and he really is crazy, but everything just works out wrong, the thing that makes the song meaningful is that he killed his girlfriend, I mean, otherwise it wouldn't have meant anything but some lunatic commiting suicide. \t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nYes, that is Devon Sawa as Stan.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nwow...now thats something that stays in your memory. deep, very deep\n\n\n", "comment_32": "\nYou know, this song really means alot. And when I saw Eminem perform this with Elton John on the awards show, I just stop what I was doing and watched it. I had it on MP3 but it got erased. I am not a rap fan, but this song is really really good. I want to know if there is a story of Eminem's behind it.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThis song is one of his best, in terms of really telling a story and letting the listener visualize it.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\ni really like this song and i think its sad but i think it is one of eminems best songs\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nis this tru?\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nwow i love this song its about one of his fan being really obsessesed with him and he didnt write in time to save this person and its sad because he killed his gal and unborn kid and himself cuz someone didnt write him back this guy must have been crazy cuz thats messed up and itlezed over everything  Eminem did i wonder is this really a true story \t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nBut ill pay Baby Lon back, and i'll pay back all the Baby Lonians for all the evil things they did to Jerusalem\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nStupid rapper could be a double negative, because aren't all rappers stupid? So is gay faggot, because a faggot IS gay so calling one that's already gay a gay cancels out the gay and makes him straight. And like they say, you can't spell crap without rap.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\ni've noticed that people who like to say faggot that much are usually gay but can't tell yet\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nyou're right littledemigod , those people're GAY :D\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\ni hate rap but i like this song\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nGreatRedGoat,\r\nIf you are actually interested in allowing other people to listen to what you claim is better music, why don't you actually list some bands that you think are good music.  Not only did you not do this, you didn't give any reason why this song or the artist is not talented, you just named called.  No proof, no nothing.  I am not a fan of rap, but this song is a great illustration of someone who has their priorities messed up.  Next time you try to enlighten people, act with maturity, and maybe actually suggest bands.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI came here to try and figure out what the deeper meaning of this song is cause obviously one exists.  No one seems to have posted anything really deep.  I don't really understand what Eminem is trying to say, but I am wondering if there is some parallel with this song to his dad and Eminem might have been trying to reach him for years, but when his dad finally tried to get reach him, it was too late and Eminem was too pissed at him to talk.  Probably nothing to do with this song, but..\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI ain't into rap very much, but this is deffo a masterpiece as far as writing goes.  You can almost visualise what is going on in the song...wicked!\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nthis iz a gr8 song.....the lyrics are so strong(jus a lil exaggerated)but none the less itz an awsome song\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nI never get bored of this song.\r\nNo one can tell a story th eway Eminem can.\r\nIt's so cool how as the song progresses, his writting becomes more eratic and creepy. I love the line; \"But she don't know you like I know you Slim, no one does\".  There is a term for people who feel that celebraties love them or can empathize with them, but I can't remember what it is at the moment.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI HATE EMINEMS MUSIC, BUT HE IS AN INSPIRATION TO US ALL. HES A GREAT DAD TO HAILIE (CANT SPELL IT) ANDDDDD HES WELL FIT....PLUS, HE WAS A GREAT ACTOR IN EIGHT MILE!!\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nGreatRedGoat, go fuck off. this is a website about soong meanings not dissing people you don't like, if you feel that strongly about eminem, take it to a chatroom cuz you're in the wrong place...ANYWAYS...i love this song, one of my favorites from eminem. i used to love him but now i just like him and i think the songs he writes are really good and he puts a lot of effort into his music.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nGreadRedGoat, if you hate this song, and Eminem so terribly much, why bother clicking on his name, scrolling down the page to his song, and then posting how much you dislike him, more than once?! If you hate him and his music, don't waste your time posting here. 99% of the people posting here seem to like the song, and you are wasting our time because we read it. So go fuck yourself in the meantime, and let us read. :)\n\r\nAnyway, i LOVE THIS SONG! it's so deep and makes me think about things... That's all i can really say about the song... But i love it, and i love you, Eminem! (Marry Me, Please!)\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nthis song is gay it scared me lol\r\nLuv *Roxy* mwa mwa\r\nxxoo\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis is my favorite song!!Eminem is hott and I love most of his music!!I think this is one of the coolest songs!!\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nDownload \" DEAR SLIM \"- KJ-52.. its a rap back to this song.. its hell.. realli meaning full.. i think its one of those songs wen u either love it or hate it.. meh.. download it.. see wat u think..\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nObviously its pretty self explanitory if u just listen to it, a fan thats like obessed with Eminem, writes him letters and shit, then he put his gf in the truck, starts drinkin and kills them. Then eminem writes him a letter, then releaizes that the guy hes writing the letter to, killed himself\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI love it Great Song! The story just stuck to me like gum to hair lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI find this his best song, you cant help but love a couple of Eminem's songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis song is so sad...I can barely listen to it without tearing up...I'm such a wimp when it comes to emotional crap.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nya, kevin, we can read there pal.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nthis is a beautifully, deep and meaningful song. It is trying to put across to us that no matter how you love something or someone you should never try and hurt yourself to be able to get it. I love the way stan starts off as nice and gradually as he realizes eminem isn't going to reply he gets more and more wound up. By the time eminem has wrote back, it's too late. I love this! the added vocals by dido make it even better. Eminem is at his best on this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis song is an amazing song one of my favourite songs ever!!\r\nYea this is a rap song but it isnt based only on the rap scene I bet lots of celebrities could relate to this song maybe not the ending but the deranged fan anyway.\r\nPeople will do so much to be like their idols. I don't see how anyone can find it offensive though? Maybe its because i'm used to eminems music and rap music but this song just comes accross as many things but offensive isnt one of them. If you think this songs bad you obviously havent listened to kim.\r\nThe bit that gets me is in the video when stans brother is at his grave and he pulls his hood down and he's like a mini eminem with his hair all bleeched ect.\r\nThe message in it is not to do everything your idols \"say\" they do because 80% of the time they dont do it!\r\nbillsqurl 01: no offence but asking him to marry you sounds like your heading along the lines of stan himself! lol\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\noh i forgot to ask...... who is devon sawa? and why is it such a big deal him playing stan? maybe this is just one of my more stupid moments asking this question but i have to ask or I'll never find out!! lol\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI really like this song, I used to be an Eminem fanatic, but now I can care less about him in general.\n\r\nSomebody once told me that Stan was a real person, and parts of the verses in this song were actually taken from letters, which Stan had sent to Eminem.  Does anyone know if this is true?\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nthis is by far eminem's greatest song.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nit just goes to show how crazy people can get. this is a really good song\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\ni think the song and video explains itself cause its pretty much a story about Stan through letters.\r\nbrillaint song\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nGreat song, one of Eminem's finest. He was a genius to put Dido in as well, and at this point she was more or less completely unknown.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\ni agree if this song was put without dido then it wouldn't of been as good as it is. Still i don't this is one of em's greatest song but it still sounds ok\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI'm a fans from CHINA,I heard this song about 6 years ago at my highschool time,when i read that lyrics,I was amazed by the story told by this song! that's great!it's beyond a common song ,it's just like a movie.and i translated the lyrics of this song into Chinese to  let more Chinese fans understand this wonderful song!\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nwow, that's amazing if that's true cos i can understand a bit of chinese since i learned a bit from school but if you really did translate the lyrics of this song into chinese i'd be wondering what it would of sounded like, lol\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nIt is a really good song. Like him or hate him, he is an amazing artist.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nsong just sticks in my mind it is so awsome great beat great lyrics eminems songs that are deep and harcore are awsome aint a huge fan of rap anymore but eminem always has a place in my music\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nOk you all bag Eminem for writing and releasing this song. This song portrays eminem's view of his own actions and slow and ineffective. say your best mate is plannin to jump off a bridge, what are you going to do, jump with them, sit down and wait, or talk to them.\n\r\nI believce is a good song, strong meaning, unique beats. sounds good through my car hehe\n\r\nThis song isnt politically suggesting everyone should go drive a car into a river with your girlfriend inside at all. It suggests that people dont consider consiquences of their actions on society, hence Eminem saying he felt sick. \n\r\nGo listen to Rasputin by Boney M\n\r\nthats all about Rasputin and his love affairs in Post Revolutionary Russia. It has murder, sexual attraction, love affairs, political persuasion, religion, accusations, and more\n\r\nand in the lyrics they always spell his name Rasputine, Now is this trying to make it \"not directive\", considering they go and say everything else that creates the environment for the song.\n\r\nOh by the way Faggots are a bundle of sticks for you illiterate fools (lol contradiction here)\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nthis song has great lyrics. it has a really clear, but powerful meaning. this song really impacted me when i first heard it...especially at the end\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nTrue story.\n\r\nI love this song. It has such a deep meaning, and the eerie, ominous lyrics put together with Dido's 'Thank You' (a song that is usually beautiful but when used in 'Stan' is turned into a bone-chattering melody) are perfect.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nwhat an amazing song.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nwhat an amazing song.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nhe pretty much killed somebody and all he can say is damn??? lol good song slim\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nEminem wrote this song to show that his hateful lyrics are written only for the money he earns from the albums, and that people follow capitalistic artists blindly without realizing that they're in it for the money.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nYou know what....\n\r\nI think its too late to post this com., but, this song is incredible.\n\r\nThats what i think.\n\r\nMaybe stan just cant think about the ...what?\n\r\nStanlee mitchell, isnt it?\n\r\nBTW in the end of the vid, do u realize that stan looked em within the glass window?\n\r\nI thought that was stan ghost.\n\r\nAnyways, is this song based on em true story?fictional?\n\r\nYa know, i love the part when stan drove his car in a heavy rain, and he did his rap in a cassette.\n\r\nI just love it, ya know?\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nI love the bit when he's propa furious \r\nI love you Slim, we coulda been together, think about it\r\nYou ruined it now, I hope you can't sleep and you dream about it\r\nAnd when you dream I hope you can't sleep and you SCREAM about it\r\nI hope your conscience EATS AT YOU and you can't BREATHE without me\n\r\nHave u eva been hurt, deeply by some bastard? that's hows u feel, thats y i like this bit its so powerful.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI usually don't like rap but I give Em major props for his lyrics. \n\r\nThis just shows the obsession of fans to be like their idol and how it can be destructive.\n\r\nIt's cool to like people and to admire them but at the end of the day be your damn self and don't surround your life int hem is what he's sayin.  \n\r\nAnd Didos' hook really sends it home in an eerie way. \"Your picture on my wall..it's not so bad\" O.O creepy obsession.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\ni love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nAmazing, the lyrics are truly beautiful, \"I hope you know I ripped +ALL+ of your pictures off the wall.\"\n\r\nIt is almost too much. I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nthe \"we could have been together\" part is a lil bit weird o_o but yeah this song is pretty tight. gives me shivers... amazing chorus... so creepy. really deep stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\ndoes anyone know if this was written about something that actualy happend?\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThis song is sad.. Poop_head_mofo.. stfu your fuckin retarded. this is probably one of the saddest songs ive ever heard... i love it and it is Eminems best... hes the only rapper i like..\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\njust to clear it up for anyone who might not know, this is a reply/parody to 2 songs written to eminem by KJ-52 titled \"Dear Slim\" and \"Dear Slim Pt. 2\"\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nThis song is amazing. I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\ntheres a really god explanation of this song on wikipedia.com i dont have the link but you can just look for it. =]\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\neminem at its best\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nto help your ass from bouncing off the walls when you get down some....... what does this mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nthis song is the greatest eminem song ever.It has so much meaning you dont even know\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nthis is one of those songs where you read throught the lyrics and just go wow. I love eminem as a rapper because his lyrics usually have meaning...not just like lets get wasted and fuck some whores...like things that make you really think. This song is so sad because it talks about how when someone is depressed, they so badly need someone to latch onto to save them. For Stan, he idolizes Eminem to a point wayyyyyy past obsession, thinking that he deserves at least something in return. In the end, he kills himself and his girlfriend because the person who really mattered let him down. The fact that eminem wrote the song from stan's perspective and not his own really adds to the power of the lyrics and the strength it must have taken to write them\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\ni like eminem's older songs compared to his last album. his old ones are better lyrically, his last few ones were just good beats.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nMaybe it's about Eminem's dad O_o\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nthis song is a great song, but kind of wierd, but then isnt. yeah, so its all good. or not. :P\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nokay, this song does have a story in it, \r\nbut that's not the meaning as I see it.\r\nI Em is saying that you shouldn't him for stuff\r\nfans do because, simply, it's not his fault. \n\r\n\"you ever been hated or discrimanated against,\r\ni have, I've been protested, and dimastarted against. Picket signs for my wicked rhymes.\"\n\r\nanother meaning as saying it's not my fault\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nthis is probably the only eminem song that will become a \"classic\" and people will still listen to 10 years from now\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nAbsolutely Eminem's best song. The version featuring Elton John is way better than the \"original\" featuring Dido, it has more intense.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\n\"LBDamned on 06-20-2006 @ 01:06:26 AM  \r\nhe pretty much killed somebody and all he can say is damn??? lol good song slim \"\r\n-----wow how clueless are you? He didnt kill anybody, in the song Stan decided to kill HIMSELF. Eminem had nothing to do with it. The only thing he did was respond to a letter to late so clearly it wasnt his fault. Plus, people are responsible for their own actions.\n\n\r\n\"sicklecow on 07-20-2006 @ 04:44:15 PM  \r\nEminem wrote this song to show that his hateful lyrics are written only for the money he earns from the albums, and that people follow capitalistic artists blindly without realizing that they're in it for the money.\"\r\n-----Um, wow. Youre not understanding it either. He wrote this song to give an example of what could happen if you become some crazy obsessed fan, and as a warning not to take some of the things he says to seriously. \"Eminem wrote this song to show that his hateful lyrics are written only for the money\". No his \"hateful lyrics\" in reference to this song, are a WARNING to his fans to not do crazy shit like Stan.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nAmazing song... by far his best. I agree with brenda619 on its meaning. The dido part is really great with it...\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nThis song has genuinely great lyrics, good enough to make you forget this is a rap song. It sounds nostalgic and the Dido sample gives it some heart.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\ni think the ending of this video is awesome.  with stan in the window when the lightning flashes... its pretty freaky\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nThis message I think was to his fans to show them that he cares about them despite his actions that may lead them to think otherwise.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nsomehow i can't shake the feeling this is about someone with a borderline disorder.....\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nThis song is fucked up. He killed his pregnant girlfriend. Fucked up!\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nDeep Shit.\r\nHits you hard, Eminem's a genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI love this song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nI hope you can't sleep and you dream about it\r\nAnd when you dream I hope you can't sleep and you SCREAM about it\r\nI hope your conscience EATS AT YOU and you can't BREATHE without me\n\n\r\nthat part gives me the chills.\r\ni like how he puts words together. I dont like hip hop but growing up I listened to\r\nhim alot....even listened to the inappropiate music, the songs that talked about drugs and whatnot.\r\nEminem is epic.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nI thought that this song could have a double meaning... it is the story of the fan who ended up killing himself and his preg girl friend... on the other side it could possibly be em telling Cage to leave him alone. I get that from how similar stan claims his life is to eminem, you know that Cage said that em stole his style. That is slightly believable...\r\nWhy would em have characters with names like Ken Kenniff... it sounds like Cage Kennyls\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nI think it just shows how you could mean the world to someone who is lonely or just fed up with life, and though you may not love them back, just giving that person a little bit of your time can make a huge difference, and even save a life. \t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nEminem gets a lot of crap for his songs and his lyrics,\r\nbut they're not really meant to be taken seriously.\r\nAnd a lot of the time the deeper meaning really does have a good message.\r\nI'm not a huge fan of rap, but Eminem is definitely one of my favorite artists.\n\r\nHis songs never get old.\r\nThis one is really intense and morbid,\r\nbut I think it's beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nI love this song! I think it shows the responsibility an artist unwillingly and undeservedly takes when an unstable person takes thr art they have made and use it to justify or act upon their irrational actions. Stan says he cuts himself too, not understanding that Eminem says that sort of thing just to give drama to his songs, and the same with killing his girlfriend. It's art, and art isn't always pretty but it is an outlet for all sorts of emotions and thoughts, and Stan takes it too literal. It reminds me of John Hinckley Jr. who got obsessed with Taxi Driver and Jodie Foster and tried to assasinate President Ronald Reagan. They take the art and use it in ways that the artists never meant to have them taken. And Eminem has faced criticism for being a bad influence but how can he control how people take his music. And is he responsible? No, but the feeling of guilt and a sick feeling of those who are messed up and mess other peoples' lives and use an artist as a scapegoat or source of inspiration are hard tackles to take on, especially in a song. But Eminem did a great job of it!\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nI think the title of this song is a veiled reference to the character of Stan Marsh on South Park, who is often seen experiencing personal troubles on the show.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nI am not an Eminem fan in general, and I don't like rap/hip hop as a rule. But this song is awesome. The passion and intensity of Stans anger, leading him to a psychological breakdown, against the chilled out Dido tune in the background ( and, FWIW, he also picks the only bit of Dido I reckon is worth listening to ), against the busy artist, trying to find the time to write to his fans - phenomenal. This is genius.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nThis song is describing how an obsessive fan becomes so obsessed with his idol not responding and his wife discovers the truth of how much he really loves slim causing him to kill him.\n\r\nI believe the Dido Chorus Refers to how slim feels about slim.\n\r\nStan feels upset because he feels no one understands him and can relate to him , and when he remembers slim and how he can relate to someone and he no longer feels alone.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nfuckin great\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nWell, has this happened? Or does he mean something else, like fans Shouldnt be so obsessed, and it will not be long before they do that kindo crazy stuff...?\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nI love the part where Stan says \"Hey Slim, I drank a fifth of vodka, you dare me to drive?\"\n\r\nA direct reference to My Name Is, and completely relevant. Emphasises how much of an obsessed fan that Stan is, by having him actually using Eminem's previous lyrics against him. Eerie.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nI think this song really brings out how much Eminem has been through, like how crazy his fans could be, how obsessive and following that they can be; that they will do anything to contact him, meet him, just to know him like a close friend. So rather than just a song, it's a warning to people that listen to his music to not be obsessive and to do crazy crap over him. It's really a matter of how seriously they take his lyrics.\n\r\nIf they take them too seriously, like Stan, they will do crazy things to prove the 'I'm the Number One Fan' fact of life, sort of-thing. If they're here for listening and trying to understand Marshall in a nice, subtle, non-obsessive way, then it'll show them what become obsessive could possibly do to them.\n\r\nMostly, it's all to do with whether you're obsessed with Eminem or not for your take on this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nOh yeah, I forgot to add that Dido and Eminem...never would have thought the combination would work so well, but it really does...Dido's part just becomes more and more creepy as the song progresses due to the dark subject matter of Eminem's lyrics. \t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nThis song is absoloutley brilliant. Eminem is one of the best song writers... ever.\n\r\n(:\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nanother perfect song from eminem i bet you some of his fans can relate to the song  i kno i do except for the drugs and pregnant girlfriend part  i love it \t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nThe tragedy of this song comes from the fact that if the letter was answered just that little bit sooner, the tragedy wouldn't have happened.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\namazing song\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nwas part of this song written for Kj-52? cause he got a song called dear slim and was written for eminem\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nThis song makes me cry everytime i listen to it but love it my fave song of all time\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nhis song is reely sad\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nTo give you a bit of insight, Stan is a name generally used as a shortened version of Stanley.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nThis song is so powerful. It is one of my favorite songs of all time. To most people who are just listening to the song, it probably sounds like some explicit disgusting song by Eminem. Well let me just say that Eminem is misunderstood, especially in this song. When Eminem raps, he lets all his emotions go. His thoughts spill onto his paper. This is good. However, those who idolize Eminem take his words literally, and do some of the stuff he talks about in his songs (ie killing girlfriends and doing drugs). The meaning of this song is simply Eminem stating don't do anything I talk about in my songs if it's negative because most of the time I don't mean it. \nThis song is about a fan of Eminem's, Stanley Mitchell (aka Stan. That's where the name of the song comes from). Stan obviously is suffering with depression, or something very similar. He opens up his letters to Eminem by saying how much he idolizes him. For example, \"My girlfriend's preganant too I'm about to be a father. If I have a daughter, guess what I'ma call her? I'm gonna name her Bonnie.\" Stan also states how much he can relate to Eminem. For example, \"I heard about your Uncle Ronnie too I'm sorry. I had a friend kill himself over some ___ who didn't want him.\" He ends the letter on a calm note.\nThe song progresses to the chorus, and Stan writes another letter. In this letter, Stan becomes more annoyed that his idol (Eminem) still hasn't written or called. He continues to explain to Eminem how much he means to him, and pleads with him to write him back. He ends the letter, and the chorus comes back up again. Then, Stan records a cassette of himself for Eminem while he's really drunk. Stan states in this letter that he tied his girlfriend up and threw her in the trunk. He was on his way to drive off a bridge, basically to commit suicide, and kill his pregnant girlfriend. Stan pretty much states that this wouldn't have happend if Eminem had written him back. And then, this verse ends when Stan drives off the bridge. \nEminem then finally writes him back. This is where he basically states that Stan shouldn't do what he says in his songs. For example, \"I think you and you're girlfriend really need eachother, or maybe you just need to treat her better.\" Then, right at the end of the verse, Eminem realizes that Stan killed himself, and he could have helped him, if he had just written back sooner.\n\nSo anyway, this is what this song means to me. Like I said above, this is one of my favorite songs of all time.. So i've listened to it enough to discet the true meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nlol,  Stan wasn't even really a fan\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nSometimes I cry to this song while thinking of my ex. What sticks out is the tea going cold. Mormons can't drink tea. It symbolizes a pleasure I gave up for him as well as him growing cold. \"Got out of bed alone.\" I often text him, \"I don't want to go to bed alone.\" before or after a depressive episode. I normally end up sleeping alone. He said the break up was only temporary while he gets his shit together. I'm like Stan. All I want is a lousy fucking text or call! You say you love me, but do you mean it? \"Killed himself over some bitch who didn't want him\" sometimes I think about it. I don't always have the will to live, but I don't have the will to die either. He was the only thing that kept my mood stable. The pills don't work by themselves. \"Sometimes I even cut myself.\" I promised him I wouldn't do it anymore. \"You could've rescued me from drowning.\" He could've, but he hasn't yet. Yes, \"yet\". That sliver of hope. I think about how he would react though if what happened to Stan happened to me. If I had a manic episode, told him to go fuck himself, and ended my life. The pregnant girlfriend in the car is a figment of my imagination. She represents the sanity I have left.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nI personally believe the song is a metaphor for his internal conflict with Stan representing one of his 3 egos,Marshal mathers,the little brother being Eminem and slim being slim\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nsic n twisted's got it right.  You may not agree, but you have to respect some of the things he has to say.  Haven't you ever wanted to hurt somebody, I mean really hurt somebody, and had no way to express that feeling?  Well, Eminem found a way, and he's making money off it, to boot.  If the Stans in the world can't figure that out, I guess it's well enough that they remove themselves from the gene pool.  It's just too bad they have to take others with them.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nstupid rapper, he must be one of the worst rappers out there\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nthis song makes me wanna kill jews\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nthis song makes me wanna kill jews\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nkj-52 is way better!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nBest line:\n\r\nP.S.\r\nWe should be together too\n\r\nEminem is such a CLOSET CASE! Obviously a HOMO! Big time!\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nReally?\n\r\nI thought this song was a series of love letters between Eminem and Elton John.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nIn my opinion, this song was billed up as so much, but delivered less (not much less, but still). The story of the crazed epistlee craving Eminem's inward presence within his soul, and yet in his outward soul, he feels nothing has come of his epistiliarism. What do people think? About this song, A) the content, B) the concept and C) the fact it's a mainstream rap single which went into the chart at number one?\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nTHIS SONG SUCKS COCK\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nSILENTAENIMA I BET U LIKE ANAL LOVING WITH EMINEM..  U FUCKING FAGGOT... URE JUST AN IDIOT WHO THINKS IS SMART BUT U JUST LIKE ANAL LOVING\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nKj-52 is way better than eminem!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nYOUR A FAGGOT TOO YOU FUCKING ASS RAMMING CUNT... HES FUCKING A FAGGOT AND I KNOW YOU ENJOEY HAVING HIM IN U... DIE FAGGOT\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nEMINEM IS A GAY FAGGOT WITH A HIGH PITCHED VOICE THAT LIKES ANAL LOVING.... ONLY FAGGOTS LISTEN TO HIS FUCKED UP FUCKING WOMANLY VOICE... ITS AS IF HE'S GOT NO BALLS... LISTEN TO SOME DECENT Musik \t\t\t\t\n\t\t\t\t\n\n"}