{"comment_0": "\nI think it's very explicit. He's in love with somebody, but unfortunelly, that person doesn't love him back. He's in pain but he rather have that person close to him, even if it's a lie, than be apart. God, I love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nBeautiful song,before I interpret I'd just like to say that this is a wonderful song no matter the meaning. I think this song is about needing someone,and not really caring who that someone is. It's about being so fragile and broken that you feel like you'll fall apart and then someone offers you companionship. I think the woman or man was simply looking for a good screw, not knowing the agony inside him.\"Deep down I know this never works, but you can lay with me so it doesn't hurt.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think this song is bittersweet and he's writing about the emotional connection that you get after being intimate with someone. \n\r\nShe's told him it was just a one night thing...maybe for her it was to just get over an Ex or whatever but after being with her, he realizes that he has feelings for her which are sadly not reciprocated.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI personally believe this song is about when you develop feelings for someone you are sleeping with ... You know they don't feel the same way as you do but you're willing to be okay with that because being with them helps you deal with the loneliness that you feel ... You know that nothing is ever going to happen between both of you.... But they ease you pain and that's all that matters to you\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nHere's my take on this song and I think some people may have been through the same situation. What started out as innocence between two people friendship or otherwise when one of them eventually fell in love with the other person.  But the other person is mostly likely married from my take on \"and deep down I know this will never work.\" But because he loved her so much that he is willing to settle for the few stolen moments he has with her.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is easily interpreted. Basically Sam loves a girl who doesn't love him back, but he wants her to 'stay with him' rather than leave him even tho he knows she doesn't really love him.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis is personally what I think it's about just from listening to it a few times.\n\r\nThe guy in this song is just getting out of a relationship that has left him feeling heartbroken and empty. So he goes out and has a one night stand trying to forget his ex.\n\r\nBut he is in such a fragile state that he finds comfort in having that girl there, even though he knows there's not going to be anything out of the relationship.\n\r\nAll he wants is someone there to hold him.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nIt's about how he wants more in a relationship than just a one night stand.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nloving someone and can not be together.\n\nso the best thing he can do is stay with her.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nMy interpretation of this song is about a man who is heartbroken. He has a series of one nightstands trying to look for a similar feeling of what his ex partner made him feel. He knows is out of character for him to have nightstands because he has always been in a relationship . But he feels so lonely that he needs love even if it's for just one night which helps him ease the pain he is feeling from being heartbroken. It's clear to him that these nightstands with these women is not love but still wants them to stay with him after sex even if it's just to lay down with him because that's all he needs to ease his hurt.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI think that it started off as a simple one night stand and he developed feelings for her. He knows that a relationship between them will never work out because it is not love but he wants her to stay so he will not be lonely.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nGuess it's true, I'm not good at a one-night stand\r\nBut I still need love cause I'm just a man\r\nThese nights never seem to go to plan\r\nI don't want you to leave, will you hold my hand?\n\r\n-For me the first verse is about hime continuously trying to fill a void with new people. He keeps repeting his mistake even though he's aware of the outcome just to feel the illusion of being loved. \n\r\nOh, won't you stay with me?\r\n'Cause you're all I need\r\nThis ain't love it's clear to see\r\nBut darling, stay with me\n\r\n- He desperately yearns for someone to play the role of being his partner even though they both know that it isn't going anywhere because there is no real foundation for love.\n\r\nWhy am I so emotional?\r\nNo it's not a good look, gain some self control\r\nAnd deep down I know this never works\r\nBut you can lay with me so it doesn't hurt\n\r\n-At this point I feel like he is in the moment of this person being there with him and giving hime that comfort he needs and he is starting to have hope and feel a false attachment. He knows deep down that it's not the real thing but feels helpless for allowing himself to be sucked in by the feeling; yet he still just wants to feel the bliss of it all.\n\r\nOh, won't you stay with me?\r\n'Cause you're all I need\r\nThis ain't love it's clear to see\r\nBut darling, stay with me\n\r\n-All he really needs or wants is to be lost in this moment so he can feel loved even if he knows it isn't right .\n\r\nI love how  there can be so many different interpretations of a song.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nIm sorry ot say this but if you don't know him he is in love with a man \t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nIt's very clear that this song is about building a piece of IKEA flat pack furniture.\n\nSo, it starts with the protagonist saying that he, a man, as social convention would have it (which I don't agree), should be handy with building a piece of furniture, but he is \"not good at making a night stand\" and is getting \"so emotional\", he therefore needs \"love\" (or support) to do it. \n\nSo he called IKEA external contractor to \"Stay with me\" at his home and by his side to build this \"night stand\". He keeps calling the contractor \"Darling\" in reference to \"Captain Darling\" from Blackadder (Rowan Atkinson) who is always supporting and by the side of General Melchett through the war. \n\nObviously, when we build a piece of flat pack furniture, we would logically lay out all the components on the floor, like a puzzle, the last piece could sometimes be a large wooden board or door for, say, a wardrobe. \n\nThis very large night stand (more like a small wardrobe) needed a final piece putting in - its door. So he asks the contractor, \"but you can lay with me so it doesn't hurt\". Just don't forget, a lot or people suffers from a bad back and 2 is better than 1 when trying to lift, lay and secure a large wooden door to the wardrobe hinges.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI think he's talking about a \"F buddy\" that he wants more from but she doesn't\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\n\r\nI dated a girl, We had a very good connection from the first time we met.\r\nWe had a few magical nights together, and I started developing feelings toward her. \n\r\nThe last time we met, I remember us cuddling in my bed, talking about how we see this relationship from our point of view. \r\nEventually, very maturely and with a lot of recpect, we both understood our values are too different, and the way we see our future is way more different. We understood it was the time to say goodbye.\n\r\nShe asked me if I want her to leave but I said no. I didn't want to, after all this time feeling lonely, I wanted to feel loved for one night , even if that means that I will think about it afterwords with tears in my eyes. \n\r\nSo she stayed. \r\nAfter she left, that song crossed my mind. I felt every word.\n\r\nThis is a sad story, but I am thankful for this experience of being loved once again.\n\r\nWishing us all to feel loved and whole for the rest of our lives. â\u009d¤\n\n\n\n\n\n", "comment_16": "\nI could listen to this song on repeat for a million years and never tire of it. Love love love.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI think this song is definitely about loneliness. He's just had a one night stand that he knows will never go anywhere after the other person leaves, but he doesn't care. At least while that other person is there he can pretend it's something real. He'll take it even if it is a lie, just so he doesn't have to be lonely anymore. It is a beautifully traffic song!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nit's so beautiful but I think it would be better with different words. I love meaningful lyrics even from a song that it's not so amazing. but I think all the songs should have meaningful lyrics. love and life have alot of romantic moments that can be the best songs .\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think this song is bittersweet and he's writing about the emotional connection that you get after being intimate with someone. \n\r\nShe's told him it was just a one night thing...maybe for her it was to just get over an Ex or whatever but after being with her, he realizes that he has feelings for her which are sadly not reciprocated.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI think this song is bittersweet and he's writing about the emotional connection that you get after being intimate with someone. \n\r\nShe's told him it was just a one night thing...maybe for her it was to just get over an Ex or whatever but after being with her, he realizes that he has feelings for her which are sadly not reciprocated.\t\t\t\t\n\t\t\t\t\n\n"}