{"comment_0": "\nThis song is about him realizing he's in a toxic relationship and making himself leave, no matter how much it hurts.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAwesome song. A guy has clearly fallen hard for his \"dream girl\" (or so he thought ). After all, she seemed like everything he was looking for. Things really took off between them, and and came to a screeching halt just as fast. She doesn't love him anymore. He is emotionally wounded as he struggles to overcome his feelings of unrequitted love.\n\r\nMoving on is hard, and the girl's not willing to make it any easier. Perhaps she just doesn't care about him anymore, or maybe letting him down easily would be too inconvenient. Whatever the reason, he is hurt, and the pain is so real that it might as well be physically inflicted. Despite the hurt, he keeps returning to its source, \"like a moth to a flame\". Love is irrational and this might not make sense. But the truth is, part of him still loves the girl and wants to be with her. \n\r\nYet an even bigger part of him knows better. To feel whole again, he must fight these feelings and \"move on\". It's a struggle. But he knows he will make it. As he fights his poorer judgment, he searches for \"needle and thread\" (new love) to help stitch his wounds and bring him back to himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWhat if this song is his way of pointing out that men can be abused in a relationship just as much as a woman can be. What if he wanted to leave the relationship, every time he wanted to leave she would abuse him. This happened so often that he didn't know how to go about leaving her?\n\nThis is a shot in the dark, but it could definitely be a possibility..\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think â\u0080\u009cneedle and the threadâ\u0080\u009d means his girlfriend has been hurting him so much he will need stitches. I donâ\u0080\u0099t know sorry if itâ\u0080\u0099s obvious or Iâ\u0080\u0099m not clear.( Í¡Â° Í\u009cÊ\u0096 Í¡Â°)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThe lyrics and the film clip are about the open secret of Magianism. Magicians often tie knots when they are weaving a curse and this is what \"stitches\" gives reference to. This practice is where the name wicker comes from because the knots were commonly used to create a piece of wickerwork. There is a price in the next life for practising black magic and \"gonna wind up dead\" refers to both the authors death and the price the Jinn (Demon) he worshipped in the ritual will extract from him as well as the death of the subject of the curse. \n\r\nBlack magic can be fatal and usually manifests in the form of an accident; I would expect that the person he is singing about died in a car accident.\n\r\nDon't believe me? You buy into the veil of absurdity that witchcraft hides behind and are distracted by the retarded herbal hippies with crystals right? Real magicians will almost never admit to practising witchcraft and will make a fool of you and cast doubt on its existence if you don't really believe. If you find yourself foolhardy enough to ignore everything you have heard about dabbling in the occult try this.\n\r\nThe next time you see someone with a wart get a viable green pea (without antifungal agent on it), hold the pea and say \"please help\" and touch it to the wart (getting a spec of blood or lymph [wart juice] on the pea will help). Wrap the pea in a piece of paper and later plant it in moist earth and as it germinates and grows the wart will wither and die. Cursing someone with warts is not much harder.\n\r\nYou will not thank me for telling you this if you try it and later die outside of Islam.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nEverybody in rehab thinking this song be about dope.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nInteresting discussion.  I interpret the lyrics to be about a guy with a broken heart, trying to get over it.  But the idea that it's a metaphor for addiction works too.\n\nDoes anyone else think the lines beginning with  \"Needle and the thread...\" sound like something from an old nursery rhyme?  Probably not, but that part really caught my attention.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nMy co-workers told me it was about his addiction to Heroin??? \n\nI was like, \"Nooooooo, say it ain't so\" but now that I really really listen to the lyrics, it could possibly be that :-( disturbing, I know.\n\n\"Needle in a thread, gonna wind up dead\" [Heroin needle in his vein, which may eventually kill him]\n\n\"I'm without your kisses, I'll be needing stitches\" [With putting the heroin in him \"Heroin kisses\" he'll be going through withdrawal and will probably start scratching, or doing whatever happens, to himself, during withdrawal]\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nLove this song!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThe song is just about dealing with the pain of breaking up and the hurtful things that people say to each other but focusing on moving on. I love this kid's voice! I read he is a Canadian whose mom is English and his dad is Portuguese. His name reminds me of my daughter's friends with an Irish mom and a Latino dad because their first names are Irish and their last names are Latino.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nIn my personal opinion I think itâ\u0080\u0099s a song about a loved or him is obsessed over a drug from a needle.(heroine) â\u0080\u009dbut no one has left me quite this soreâ\u0080\u009d heroine is a drug that kills people every day. Throughout the song it seems like he is trying to get clean but itâ\u0080\u0099s such an addictive drug he canâ\u0080\u0099t help it going through withdraws and much more â\u0080\u009cneedle and the treadâ\u0080\u009d (gotta get you outta me head)(gonna wind up dead) \n\r\nBut that is just a theory Iâ\u0080\u0099m not saying the relationship theory isnâ\u0080\u0099t wrong itâ\u0080\u0099s a good theory but this is my opinion \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nObviously a song about a gay relationship.  \"No one's ever left me quite this sore.\"  Hello?  No male with any sort of masculinity would utter such a statement.  Lots of mentions of needles - phallic.\t\t\t\t\n\t\t\t\t\n\n"}