{"comment_0": "\n\"Replay the scene over again, \nBefore the credits rolling in\nInside my head\nI don't recall a single word, \nIt hit me faster than I heard\nInside my head\" \n\nI think what they're saying here is that maybe this girl had been cheating on them, or maybe she had broken up with him, and either way he couldn't get the look of her face or whatever it was that they witnessed out of their head. \"Before the credits rolling in\" I see this as also meaning \"before we're over\" so before they actually end what they had, he wants to look back and make sure that what happened was true or if what's happening is what they really want.\n\n\"And now I'm shaking, wearing thin\nI've always wondered where you've been\nTell me if you wanted it at all\" \n\nMaybe this girl was really distant and always out of it, never really there when she's with him. And when he sees her with another guy, he starts questioning if she ever really loved him and if she actually ever wanted there to be a \"them.\"\n\n\"I got a long-term plan with short-term fixes\nAnd a wasted heart to that just eclipses\nAnd I push my luck and trust the dust enough\nThat's the story of another us\"\n\nMaybe when they were together he wanted them to last a long time aka \"long term\" and only expected minor problems like a little case of jealousy when another guy looks at her or when he leaves his clothes on the floor and she gets mad, but now they're dealing with something more, which is fading love. I think he's upset with how fast he fell and how oblivious he was to the situation, and if it ever became a thought, he would brush it off because he trusted her, and he has a \"wasted heart that just eclipses\" because he might have had to deal with this multiple times before and he \"pushed his luck\" because this time he thought it was going to be different. \n\n\"One last ditch and new beginnings\nSo take this heart, put yourself in it\nThis surprise ending I'm depending on\nCould be the story of another us\"\n\nWhen Luke says \"one last ditch and new beginnings\" he means that she can leave him one more time, but that's the end anyways, and something or someone new will come along. \"Take this heart, put yourself in it\" means that he wants her to see what he's feeling, and understand what she is doing to him. He hopes for a different ending, and he's depending on one that may end with them being together, but it's a surprise and there's nothing much he can do. \n\n\"Memories are pay-per-view, it costs too much to think of you\nI'm hanging by a thread\nAnd ever long before we're done, I see quick to what we've begun\nI'm hanging by a thread\nAnd now before our hope is lost\nMy heart is here, it's such a cause\nTell me if you wanted it at all\"\n\nI think that whenever he thinks of her, it starts to hurt too much to handle which is why it \"cost too much,\" and he can barely hold on. He is starting to really see the reality of who they are now, and \"before our hope is lost my heart is here\" is basically translated to \"before we give up one each other know that I still love you and maybe we could make this work.: \n\n\"Drowning beside you\nWhere I'll be to remind you\nWe're still first in line for\nThe front row of last resorts\"\n\nI think this part is more on the bitter side of their breakup. What Michael is saying is that while their relationship is dying or \"drowning\" he, deep down, knows he can blame her for what is happening between them. \n\n_\n\nYou may not agree with what I've said, but this is just how I view the song!\t\t\t\t\n\t\t\t\t\n\n"}