{"comment_0": "\nIt seems to me that John wrote this song as a representation of a place that he goes in his head to escape his troubles.  When he was younger, he often took refuge in Strawberry Field.  This song is using Strawberry Field as a metaphor for a place he mentally wanders to forget his stress.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe song opens with the chorus, \"Let me take you down cos I'm going to, Strawberry Fields, nothing is real, and nothing to get hung-about. Strawberry Fields forever.\" \n\r\nIt was written during the time of the Beatles, and has both figurative and metaphorical representations. One, it is an actual place John went to visit often - Strawberry Fields being an orphanage near John's home in Liverpool where he went as a young boy to escape his troubles â\u0080\u0094 And two, this song is also using Strawberry Fields symbolically - a place he mentally wanders to forget his stress - yearning for simpler times. He also is frustrated and disillusioned with those who go through life blind to things going on around them, and too there are indications of Lennon's own insecurities about his genius. John invites us to come on \"down\" and join him into a world where there is no fussing, fighting, or killing.\n\r\n\"Living is easy with eyes closed. Misunderstanding all you see.\n\r\nThis is so true when you deliberate about how easy life is when you accept things superficially and don't utilize research. However, John knew that living life shallowly is not really living at all.\n\r\n\"It's getting hard to be someone, but it all works out.\"\n\r\nJohn finds seeing things as they really are is no easy task, but he trust that in the end it will all work out.\n\r\n\"It doesn't matter much to me.\"\n\r\nAnd John figures if things don't work out \"it doesn't matter much...\" because there is no way he is turning back and giving up on the road less traveled.\n\r\nThe next verse begins, \"No one I think is in my tree, I mean it must be high or low.\"\n\r\nIt's apparent John is struggling with the notion that maybe he is not a genius after all. There's a saying, \"There's a fine line between genius and insanity,\" and John may, at that point in time, have questioned his sanity even for a brief time.\n\r\n\"That is you can't you know, tune in, but it's all right. That is I think it's not too bad.\"\n\r\nJohn lets us know that the mental state he is in is not a place where many minds \"tune in,\" \"but it's alright.\" John's okay with knowing his psychic state is not for everyone, but hopes that there are enough intelligent and well-informed people to acknowledge brilliance and a greater message. Lennon tapped into primal emotions that never left his consciousness.\n\r\n\"Always, know sometimes, think it's me, but you know I know when it's a dream.\"\n\r\nI don't have the facts here in front of me, but I'm guessing John's confused about who he is at times. He reassures us though that even when he may be in doubt and \"thinks it's him,\" he is quite certain he \"...know when it's a dream.\"\n\r\nBefore repeating the chorus one last time, John ends with, \"I think I know I mean a yes, but it's all wrong. That is I think I disagree.\"\n\r\nAgain, the fine line of genius and insanity is gripping. John want's to agree with society, but he knows society is \"all wrong,\" forcing him to disagree with it's direction and conditions. John felt mankind could build reality from it's dreams.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nLiving is easy with eyes closed \r\nMisunderstanding all you see\r\nYou won't find any better lyrics!\r\nJohn Lennon was a Genius!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\npoor john was never truly satisfied\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nUm, you guys know that \"strawberry fields\" is a slang term for acid, right? You know, LSD?\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nTake a good dose of lsd and listen to this and all will become clear.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nGreat Lyric...I think this song speaks of yearning for simpler times and frustration/diillusionmeet with those who go through life blind to things going on around them.  There is also an indication of Lennon's own insecurities.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nStrawberry Fields was an orphanage near John's home in Liverpool. He went there alot as a young boy.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthis song is very deep and a classic beatle favorite. its one of those songs that john wrote that make you think, wow he WAS a genius. i really enjoy the orchestration and arrangement of sounds in this masterpiece. no matter what meaning it supposedly had in real life, it can mean many cool things depending how you want to see it. thats why it rocks so much\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI think this song is about youth...when he says \"living is easy with eyes closed, misunderstanding all you see, its getting hard to be someone but it all works out, it doesn't matter much to me\"...I think hes talking about fitting in and the troubles that teens encounter throughout adolescence...and strawberry fields is a place to get away by themselves, and that can be interpreted with \"nothing is real; nothing to get hungabout, strawberry fields forever!\"...maybe he's talking about how he can just be himself there until he really finds himself as a person.\n\r\nThat's what I think anyway. Whatever the meaning of this song is, I think we can come to the consensus that it is a great song no matter what it really means.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nMan, the line, \"Living is easy with eyes closed \r\nMisunderstanding all you see,\" is so amazing.  This is so true when you think about how easy life is when you except things only superficially and don't utilize inquiry, but living life that way is not really living.  I think the rest of the song has to do with the struggle of staying true to oneself and confusion of who that is \"Itâ\u0080\u0099s getting hard to be someone\"  because there are so many road blocks in life; Loneliness: \"No one I think is in my tree\", confusion:  \"I think I know I mean a â\u0080\u0098Yesâ\u0080\u0099\" and it so easy to go back to our old ways, which are easier in the moment, but don't really make us happy.  I think there might be some implications to drugs, but I feel that it has more to do with being lonely and wanting someone to escape the hardships of life because of the phrase  \"Let me take you down, â\u0080\u0098Cos Iâ\u0080\u0099m going to Strawberry Fields. Nothing is real\" that is repeated three times throughout the song.  Despite the obvious drug implication there is this struggle to take the easy road or hard road, which is good in the long run, but takes more to get there.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThe song is definatly about LSD. I listen to it and the way the song is played just trips you out i could just loop the song all day long\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song is actually about using heroin\r\nwhen you stab your arm so many times with a needle its starts to get all red and look like strawberry fields\r\nthats why he talks about escaping and stuff\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nStrawberry Fields is a type of LSD. And an orphanage. I'm pretty sure John Lennon knew this, therefore wrote the song to have a double meaning as well. Songwriters always do this. It's what makes them smart. Don't get touchy over the LSD reference, its only acid, in a song written like 40 years ago.\r\nI think it's about escape either way you look at it.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThe form of the song is one side of a conversation, lapsing into monologue in which Lennon's trying to explain to an imagined audience what it's like to be Lennon, see things the way he sees them.\n\nen.wikipedia.org/wiki/… has some interesting reportage on this song.\n\r\nLennon said \"I was different all my life. The second verse goes, 'No one I think is in my tree.' Well, I was too shy and self-doubting. Nobody seems to be as hip as me is what I was saying. Therefore, I must be crazy or a geniusâ\u0080\u0093'I mean it must be high or low'\"\n\r\nLennon described the song as \"psycho-analysis set to music\"\n\r\nThe problem he's trying to solve is how to be someone when a solitary genius (or fool, always the self-doubt) alone in a tree, on a wavelength nobody else can tune into, although he's reassuring us that the problem is not too bad for him.\n\r\nHe invites us to try on one of the solutions he has recourse to, which is a kind of nihilism.  \"Let me take you down to Strawberry Fields\", where \"nothing is real\" and consequently nothing matters enough that anybody is going to be hung (I suspect Lennon felt that people were going to hang him, for being too different (\"You know how hard it can be, the way things are going they're gonna crucify me,\" and I guess that's kinda prophetic in view of the way he died.)\n\r\nSo Lennon is describing one way he tries to cope with being different, seeing things differently (and perhaps more accurately than those around him,) by keeping his eyes closed, and by purposefully misunderstanding what he knows and sees.  Denying his gifts, perhaps.  It results in his own identity being eroded (\"getting hard to be someone\") but he's coping (\"but it's alright,\") and in any case \"it doesn't matter much to me\" ... perhaps he's saying he doesn't need to \"be someone.\"\n\r\nThis is a kind of nihilism.  Lennon presents it as a way of getting by, not being hung.  Of being by not being himself.  We see other instances of this nihilism in other Lennon songs, \"I know what it's like to be dead\"/\"making me feel like I've never been born\" and of his rejection of it.\n\r\nFinally, \"Always, no, *sometimes* think it's me,\" is, I think Lennon saying that he's reconciled to just being different but is seeking reassurance from the audience, \"but *you* know I know and it's a dream\" in which I think he is saying that at least the person to whom he's speaking knows that Lennon's perceptions aren't completely unreal, and that the rest of the world (as people see it) is not real.  So here, he's finally getting the courage to admit to himself (through his imaginary audience) that he in fact does possess unusual faculties, and is trusting in their validity.\n\r\nFinally, \"I think I know of thee, ah yes, but it's all wrong.  That is I think I disagree\" is how I've always heard the last lines.  I think he's now trying to apply his unique faculties to understanding or describe the imagined audience, his interlocutor, or perhaps more generally speaking of the possibility of knowing the other in their subjectivity (I find the use of 'thee' interesting, perhaps reflecting Buber's treatment of what Sartre called 'concrete relations with the Other', or perhaps just generally honouring the Other ... bear in mind, Lennon's just returned from the \"We're bigger than Jesus\" tour of the USA, and trying to deal with the absurdly extremely negative and irrational uproar of that.)\n\r\nIn any case, having \"taken us down\" to Strawberry Fields, Lennon's no closer to comprehending others and himself as part of the same world, but he has found the pure nihilism of Strawberry Fields untenable.\n\r\nIn Strawberry Fields, he's just asking, I think, to be understood (\"Love is asking to be loved.\")  I hope I have gone some way, not that it matters much to him.\n\n\n", "comment_15": "\nThere is no metaphors and stuff, Lennons method was to right a straight prose then mix it up randomly so it would not seem trite and obvious, and make him look deep like Dylan. \nif he didn't know there was no heaven he would be up there laughing at us all trying to sort out meanings that aren't there and bullshitting each other.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nWhat I hear in the 3rd vers is:\n\r\nAlways, no, sometimes think it's me\r\nBut you know I know when it's a dream\r\nI think a NO, a MEAN, a YES \r\nbut it's all wrong\r\nThat is I think I disagree\n\r\nIt would match the meaning of the previous verses, in the sense of him not tunning in with the rest (sometimes?)\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nStrawberry Fields was aa orphanage near John's home in Liverpool. He went there alot as a young boy.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nLOVE IT!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\ni love this song...but people seem to enjoy making horrible covers of it. like cyndi lauper on the john lennon tribute concert *shudder* it was so awful...\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI totally agree w/ weezerific:cutlery. Some of the covers of Beatles songs are so awful!!! \t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni was brought up on the beatles this song always sticks in my mind as a favourite\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni think Ben Harper did an excellent job covering this song.  The entire I Am Sam Soundtrack it amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nyeah Ben Harper did a very good cover of this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI agree that Ben Harper's rendition was well done, and I also like the I Am Sam soundtrack..  I love this song!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is amazing. Hypnotizing. \r\nIn my eyes, what stands out in this song is the amazing work done vocaly. Most of the melody of the song is made by voice, when the music is really just a background. \r\nThe lyrics are very unique but I dare not do an interpetation to it. It is really very indevidual.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nzps2 you are a bleeding moron... strawberry fields is one of the BEST Beatles songs\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nzps2 you are a bleeding moron... strawberry fields is one of the BEST Beatles songs\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nhonestly though, don't u at all think the melody gets a little lost thanks to the background music...there's some parts where it's cool and all but other times the music just gets in the way of the song...(that's an expression my grandfather--one of the best musician's you'd ever know--likes to say when the accompaniment doesn't do it's job and accentuate the melody, which the overpretentions orchestrations fails at very effectively)\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nLast fall I heard the Other Ones (band made up of former Grateful Dead members) do a cover of this and it was GREAT!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nNo mention of the \"I buried paul\" at the end of the song???\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nfuck you guys...you guys are on crack...strawberry fields is an salavation army back in liverpool england.... and he would go there as a kid..and still as an adult\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThe first time I heard this song I thought it wasn't too good. But the second time it sort of clicked into place and now I love it! Its unique, one of a kind and anyone who tries to knock this song or any of John Lennon's other works really don't have a clue what real music is.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI love this song its so trippy\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nthis song is very deep and a classic beatle favorite. its one of those songs that john wrote that make you think, wow he WAS a genius. i really enjoy the orchestration and arrangement of sounds in this masterpiece. no matter what meaning it supposedly had in real life, it can mean many cool things depending how you want to see it. thats why it rocks so much\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nthis song is very deep and a classic beatle favorite. its one of those songs that john wrote that make you think, wow he WAS a genius. i really enjoy the orchestration and arrangement of sounds in this masterpiece. no matter what meaning it supposedly had in real life, it can mean many cool things depending how you want to see it. thats why it rocks so much\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nthis song is very deep and a classic beatle favorite. its one of those songs that john wrote that make you think, wow he WAS a genius. i really enjoy the orchestration and arrangement of sounds in this masterpiece. no matter what meaning it supposedly had in real life, it can mean many cool things depending how you want to see it. thats why it rocks so much\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nmy dad told me this song was about heroin.. strawberry fields is what you can call the track marks on you arms\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nit's NOT ABOUT DRUGS man doesn't ANYONE else see the beatles lyrics with more of a meaning then drugs and hallucinating? no? damn...lol...anyways what about the \"I buried Paul\" thing at the end which actually may be \"cranberry sauce\", I dunno that part always mystifies me i guess\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI am from England, and i have been to Liverpool a few times, there really is an orphanage there called, \"Strawberry Fields\" and supposibly, John did go there as a child because he knew kids who lived there.  This is all true, but it does not knock off the idea that perhaps this song is about tripping face...  The Beatles were noutorious drug abusers, and this song and many others, (Lucy in the Sky with Diamonds) may now not be about the actual drug acid itself, but they were more than likely writen while John was on one of his many crazy acid trips...\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nAbout the Paul is dead comment...John does not say \"I buried Paul\", he says \"Cranberry sauce\", trust me.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\njohn lennon said this song was one of the only bealtes songs he wrote that meant something to him. its about youth and his childhood. its not about drugs, even though john was on heroin at the time. john just wrote in a different way than anyone ever has or probably ever will. thats what made him such a great musician. this song is amazing... and he does say \"cranberry sauce\" at the end, which people thought was actually \"I buried Paul\"\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nTRIVIA TID BIT: Cameron Crowe stated on the DVD commentary for \"Vanilla Sky\" that he originally had cut a certain scene to this song involving Tom Cruise's character, but wasn't able to keep it in due to time restriction.  I haven't given the details on what scene because I am not sure how many have seen the movie.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nlol johnny b where did you pull that one out of????....\r\nlennon was never on heroin....the only drugs the beatles did were acid and weed....maybe a little coke a read somwhere but i doubt that...and yes this is one of lennon's best\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nYes Lennon was on herion! His solo song \"cold turkey\" is about his herion withdrawl. It was basically Yoko who got him on herion.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nyou sure??? cuz i read about 30 books on the beatles and their solo careers and the only thing in every one of those books and on the anthologies they said lennon did was acid and weed....and he admitted to it, not even a mention of heroin and lennon was never afraid to admit he was on acid and weed, ive looked everywhere to see and nothing....and i read in one of the books that lennon was quiting drinking and facing other personal problems not related to drugs but who knows...ya never know\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nDominic Monaghan, Merry in \"Lord of the Rings\" trilogy and Charlie on ABC's \"Lost,\" has \"Living is easy with eyes closed\" tattooed on his left arm.\n\n\r\nCB2001 - What scene in \"Vanilla Sky?\"  Pretty please?\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nfirst of all everyone quting their parents and grandparents should just stop, and get their own opinion instead of just using others.\r\nalso i agree with the guy that said beatle's weren't all about drugs.\r\nnext, i've also heard the slang term \"strawberry feilds\" used as a term for the track marks on a heroin users arms.\r\nAND NO, not everything you read is true. no matter how many books you think you've read, doesn't mean you know everything about their lives. and it should stay that way.\r\nother than the excess drama, i love this song. truely means a lot to me, and has been interpreted in SO many ways throughout my life. my blessing.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nyeah but lennon wasnt on heroin....The media was 24 hours a day 7 days a week swarming the beatles they picked up on the weed use and acid use by them,  dont you think they would have picked up heroin use too??.....and if they did please show me!!! cuz you dont so F off\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nLennon was on herion throughout the Let It Be sessions. Read the Febuary 2003 edition of Rolling Stone, the one with The Beatles on the cover.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nLennon used heroin.  He says so right in the 1970 Playboy interviews.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nget what you want out of it. i personally like the idea of john getting away from things and feeling a strange sense of euphoria at the Strawberry Fields orphanage. that's one theory that everyone can relate to.. getting away from stressful times, be it physically or mentally, through drugs or whatever.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\n\"Man, the line, \"Living is easy with eyes closed \r\nMisunderstanding all you see,\" is so amazing. This is so true when you think about how easy life is when you except things only superficially and don't utilize inquiry, but living life that way is not really living.\"\n\r\n--Amen to that\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nOk guys. Beatles songs have literal and symbolic meanings all of them. This song may literally be talking about an orphanage. But it is also about the relation between society and LSD. Acid gives people realizations. So take acid and open your eyes, you are misunderstanding things. Its getting hard to be someone in society nowadays, so why not go have fun tripping on acid. Society is messed up, government is screwy so we might as well go have fun on acid because it is not really as bad as everyone says.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\n\"yeah but lennon wasnt on heroin....The media was 24 hours a day 7 days a week swarming the beatles they picked up on the weed use and acid use by them, dont you think they would have picked up heroin use too??.....and if they did please show me!!! cuz you dont so F off \"\n\r\nwow. it's obvious you aren't getting any of the messages the beatles were sending. take a look at what you just wrote. horrible. i feel sorry for you, bud.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\n\"yeah but lennon wasnt on heroin....The media was 24 hours a day 7 days a week swarming the beatles they picked up on the weed use and acid use by them, dont you think they would have picked up heroin use too??.....and if they did please show me!!! cuz you dont so F off \"\n\r\nwow. it's obvious you aren't getting any of the messages the beatles were sending. take a look at what you just wrote. horrible. i feel sorry for you, bud.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nthis song is trippy as hell... the lyrics are some of the best. and it's one of the best beatles songs depending on what you like. it takes a certain kind of beatles fan to appreciate it. you kind of have to be open-minded.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nben harpers version was shithouse.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nben harper should die for ruining this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nyeah this song is very amazing..imagine hearing it for the first time in 67 when it came out fuckin crazy\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nWhen I was younger my grandparents lived at 27 Strawberry Fields, in west yorkshire. I used to go down to their house in my dinner break from school. My grandfather was starting to go senile and I had a deaf mute grandma. And as I couldn't do much sign language it was a bit of a problem communicating. So this song always reminds me of them times. Strangely enough I cannot sing at all, wailing cats, but this is the only song I can sing well on karaoke.....\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI get a kick out of people who defend the Beatles against those who say they were on drugs.  What's wrong with musicians being on drugs anyways?  It's standard practice in my opinion, and I don't even do drugs or support others' doing them.  Next time someone says your favorite  band was on drugs when they wrote a particular song you should take it as a compliment. If they wrote something great inbetween trying to find another heroin hit more power to them because that would take real talent.  Probably the Beatles' greatest gift, besides musically--not lyrically so much compared to Dylan and Morrison--was their ability to appeal to prudish everyday happy-go-lucky people like I've seen posting here.  Not everyone: there are some great comments from some people but others here really have poles up their u no what's and it amazes me they are aware enough to listen to great music when they should be listening to teeny-bop.  Somehow the Beatles crossed that barrier and they are special because of that.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\n\"No One I think is in my tree/ I mean it must be high or low...\" Top line in all of songwriting history that will forever resonate like nothing else I have heard before or since. Between genius and madness Lennon tapped into primal emotions that have never left my consciousness. Phrases half remembered and dark noises suggest insanity, terror or far worse. Yet the scope and ambition break open the head prooving that pop masterpieces have no limits whatsoever. \r\nListen to the drumbeats from Ringo on the coda while mellotron bleeps bubble out and John screams a varispeeded \"Crrrrrrrrrrrrrraaaaaaaaaaaanberryyyyyyyyyyyy Sauuuuuuuuuuceeeee\". It'll make you rethink who invented trip-hop nearly 30 years before Tricky or Portishead wanted to soundtrack repressed memories.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nTo me this is a song about a place to escape things.. \"nothing to get hung about\" it's a refuge from the rest of the world and from life in general, it reminds me of a place I go to sometimes....\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nhaha indeed that trip hop idea is very new, never concidered it! point is, wonderful song. i'm just too much of a person to care to argue about it...\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\n\"I get a kick out of people who defend the Beatles against those who say they were on drugs. What's wrong with musicians being on drugs anyways?\"\n\r\nThe argument isn't whether or not the Beatles enjoyed weed, LSD, or Chicken Gumbo.  The argument is whether or not that's what the songs are about.  \n\r\nLennon responded to a reporters question about one of his songs being about marijuana; he answered, quite indignantly, that it wasn't, and that he \"wouldn't be so gross.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\n\"No one I think is in my tree, \r\nI mean it must be high or low\"\n\r\nThe original lyric was something similar to...\n\r\n\"No one I think is on my wavelength, \r\nI mean it must be high or low\"\n\r\nLennon basically \"dumbed it down\" because he believed most people of the time would not understand his use of the word \"wavelength\". Upon examination, the word \"wavelength\" makes more sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nthis song is amazing, and it will always be one of my all time favorite beatle songs.  in addition to it being about the strawberry fields orphanage, it definitely has something to do with getting high.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nis strawberry fields not a salvation army store in liverpool\r\n? i dunno thats wut i heard\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nAmazing\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\ncrikey people, you're all being rather rude to each other.. just enjoy the amazing song.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nits about drugs\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nThis song is amazing.. I really like how when it comes in at the beginning and the other parts of the song when he sings \"let me take you down, cause im gooing toooo...\" sounds fricken cool it's my favorite part\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nThis song (like most beatles songs) was written while lennon was doing LSD, and then he wrote on his experience of when he was a kid in the strawberry fields where he lived, The music wonderfully was orginally put together three different ways, first was orchestra, second was a regular rock sound, and the third was a marching band sound, then lennon decided he wanted all three and put them all together you can tell if you listen right the differences, he also would put in things like drums that were recorded backwards, with all this in mind it's not really about drugs, just because he was on them when he wrote it. Over all one of the best songs out there.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\ni luv this song and even though a lot of the song is based on singing i luv the guitar at the beggining, afta that it goes quite orchestral. still brilliant though\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\njohn wrote this to show how his life was so much different and glomy, unlike pauls penny lane. he was a foster with not much money. very very good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\njohn wrote this to show how his life was so much different and glomy, unlike pauls penny lane. he was a foster with not much money. very very good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThis is Absolutly the best Beatles song ever. Lennon is a genius...i'm sorry but this song totally blows Paul's 'Yesterday' out of the water.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nThis is a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nits about heaven. not knowing what 2 expect but kinda using the media version of what heaven is supposed 2 b..but the name says it all..strawberry fields FOREVER.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\ni like this song its wiked and laid back like jack johnson.i like jj 2 ther kool\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nFor anyone who loves this song, pick up the Beatles Anthology 2. It has three alternate version of this song (Take 1, Take 7, and an acoustic demo). The demo is really nice, it's just John Lennon and his guitar. It was recorded just after he composed it on a casette recorder in his home. It's like you're in there in the house. It's creepy in a good way.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nHere's my analysis of Strawberry Fields (probably my favorite Beatles song):\n\r\nFirst off, I don't think it's \"about\" drugs.  It might contain references to drug-induced experiences, or been written either under the influence of them or as a result of having been, but that really doesn't mean anything.  Use of pot or hallucinogens will affect your outlook on the world and influence your creative endeavors, as will many other experiences, but to say that \"this song is about drugs\" is extremely simple-minded.\n\r\nWith that out of the way, I believe this song is about the concept of building one's own reality out of dreams (both literal and figurative dreams), fantasies, and delusions.  Retreating into one's own dream-world is a concept that's hardly unique to this song.  What makes Strawberry Fields unique, however, is that it takes the conept a step further, by not only retreating into a fantasy, but by actually realizing it to the extent that you can invite someone else to join you, hence the chorus: \n\r\n\"Let me take you down, 'cos I'm going to Strawberry Fields\r\nNothing is real, and nothing to get hungabout\r\nStrawberry Fields forever\"\n\r\nHowever, the song also deals with the inherrant issues with the idea of dream-reality-living, which is that, over time, the lines between your fantasy and the real world can erode, leaving behind feelings of contradiction and confusion.  What's more, it ultimately proves impossible for another to live (though she might try) entirely within your own fantasy world, as he realizes over the course of the song.  In each verse, this progression is evident as the singer's views become more confused and unsure of himself.\n\r\n\"Living is easy with eyes closed, misunderstanding all you see\r\nIt's getting hard to be someone but it all works out, it doesn't matter much to me \"\n\r\nThe first verse clearly acknowledges that he is not living in the \"real world\", and that he's even losing his \"real world\" identity, but that it scarcely matters, because the world he IS living in is an easy one to grow accustomed to and enjoy, and this is all he really needs.\n\r\n\"No one I think is in my tree, I mean it must be high or low\r\nThat is you can't, you know, tune in, but it's all right, that is I think it's not too bad\"\n\r\nHe realizes in the second verse that he's more lonely here than originally intended.  The one he wants to share his dream world with can't entirely tune into it, and he finds himself alone there.  What mattered little in the first verse is now noticed, but bearable. \"that is, I think it's not too bad\"\n\r\n\"Always, no sometimes, think it's me, but you know I know when it's a dream\r\nI think I know I mean a \"Yes\" but it's all wrong, that is I think I disagree\"\n\r\nThese lyrics make little sense, and I'm fairly certain the lyrics listed on this site are innacurate, as I've always seen (and heard) this final verse as:\n\r\n\"Always, no sometimes, think it's me, but you know I know when it's a dream\r\nI think, er, no... I mean, er, \"Yes\", but it's all wrong.  That is I think I disagree\"\n\r\nAssuming the latter lyrics are the correct ones, the final verse shows the singer's final acknowledgement that his reality is nothing but a dream, and one that he can't feel fulfilled living in exclusively.  His confusion in this verse is very blatant, as he stammers over lines and corrects himself, trying to remain positive, but in the end, admitting that it's all wrong.\n\r\nWhat is left up to conjecture, of course, is how it ends, whether he comes back to true reality or whether he's too far gone.  The repeated \"strawberry fields forever\" at the end of the song might imply the latter.  As for \"Strawberry Fields\" itself, I think the fact that it's an orphanage in england is fairly irrelevant, because for the purpose of the song, it's simply a symbolic place or state of existance, and dwelling on why he chose it as his symbol rather than some other place is a mundane excercise.\n\r\nInterestingly, Paul's \"Penny Lane\", released as the B-side on the strawberry fields single, is about a similar concept.  However, where Strawberry fields is about the singer actually attempting to live in his dream world, and dealing with the benefits, challanges, and consequences of doing so, Penny Lane simply takes the form of an idle daydream.  \"There beneath the blue suburban skies I sit and meanwhile back, on Penny Lane...\", \"Penny Lane is in my ears and in my eyes\" and \"And though she feels as if she's in a play, she is anyway\" all drive the concept home.  IMO, Strawberry fields is a much more powerful song due to the extent to which it delves into the idea of waking dreams, whereas Penny lane takes a very superficial (though also inspired and catchy) view of daydreams.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nStrawberry Fields was one of the two really famous houses in Woolton (where John grew up) and it was an old Victorian house (built on a strawberry farm) that was converted into a home for salvation army orphans.  Ivan, Pete, Nigel, and of course John, would go there to have garden parties and sell lemonade.\n\r\npeace\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nThis is one of my all time favorite Beatle's songs.  The lyrics are great...and I also believe Lennon was singing about a place from his childhood with some of the lyrics influenced by his frequent use of LSD.  I believe when one drops acid as much as the Beatles did,  it's going to influence the user whether the user is aware of it or not.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nthe cover done by narada piano is beautiful\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI like this song. I first heard it when I was 12 yo. and the melothrone intro has always hypnotized me. It still has a magic influence at me. \"No one I think is in my tree\" thatÂ´s the point I often feel to stand in. I was really unhappy until I could record the tune from the radio. I think John more and more frequently fell in nostalgy. He was a master of nostalgy. See \"In My Life\".\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nLennons childhood house in Menlove avenue backs onto strawberry fields orphanage grounds. If he climbed over the fence when he was a kid he would have been in strawberry fields. Its just a very pretty lyric about yearning for lost childhood.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nThe last part is not \"I buried Paul\", its \"cranberry sauce\"\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nI like this one... it's got really cool music, the melodies are quite strange (in a good way)\n\r\nit's quite hip-hoppy. \n\r\nI heard they were writing this song as a trip through an LSD trip...\n\r\nwhich must explain the lyrics, which i feel are all about needing an escape to somewhere you don't have to worry about anything, your surroundings.\n\r\nand a strawberry field is a rather peaceful and romantic place- I can just imagine living blissfully in a sunny field eating strawberries and not worrying about anything.\n\r\nOf course it might be a bit crazier if I had taken drugs...\n\r\nI think the 'hard to be someone' is also about the toubles of fame...\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI don't think just because he went to an orphanage called 'strawberry fields' he was especially talking about his times there..\n\r\nIn alot of beatles songs there are reference points to things. I mean, when you are writing a song you use the words which are at your disposal- strawberry fields just might have exhisted in his head.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\ni love this song. it's so crazy sounding and it's definately one of my favourites.\n\r\n\"And nothing to get hungabout\" definately my fave line...\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nI love this song, it makes me feel stoned.  I think John was stoned when he wrote it.  Strawberry Fields is a salvation arm place, but I totally think there is a drug element in this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nThis song was written by John when the beatles were experimenting with acid.  If you don't know, acid is a powerful hallucinogen.  Read the lyrics after knowing this and your whole opinion changes.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nWell done iteration, listen to this song when youre really reall high...euphoria. :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nOh, and how exactly do you know who wrote this (paul or john) because everything i see just says, \"mccartney/lennon\".\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nmy teeth are broken\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\ni love the song and the lost relaxed feeling you get when listening to it but I know its about  the orphanage he spent part of his life in called strawberry fields\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nstrawberry fields is not slang for acid so go to hell who ever said that because john wrote this song after his return from india and when the beatles went to india all of them stopped fucking with drugs except paul\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\n\"Let me take you down,\r\nâ\u0080\u0098Cos Iâ\u0080\u0099m going to Strawberry Fields.â\u0080\u009d\n\r\nJohn Lennon often played with friends (Pete Best) at Strawberry Fields, a place in Liverpool - his hometown.\n\r\n\"Nothing is real\" saying he views this place like a sacred place, where he can be free.\n\r\n\"Nothing to get hungabout\" comes from his aunt Mimi telling him not to go, but his respond was \"what are you gonna do? Hang me?\"\n\r\nâ\u0080\u009cLiving is easy with eyes closed\r\nMisunderstanding all you see.â\u0080\u009d\n\r\nAs a child John lived his childhood very happily, he didnâ\u0080\u0099t know why he was with his aunt. When being a child you say youâ\u0080\u0099re as pure as it gets, perhaps that is what heâ\u0080\u0099s trying to say.\n\r\nâ\u0080\u009cItâ\u0080\u0099s getting hard to be someone.\r\nBut it all works out,\r\nIt doesnâ\u0080\u0099t matter much to me.â\u0080\u009d\n\r\nEventhough he had a happy childhood he was a troublemaker, heâ\u0080\u0099d constanly get in trouble with the same buddies heâ\u0080\u0099d play with at Strawberry Fields. â\u0080\u009cItâ\u0080\u0099s getting hard to be someoneâ\u0080\u009d Mimi told him â\u0080\u009cthe guitarâ\u0080\u0099s all very good John, but youâ\u0080\u0099ll never make a living out of itâ\u0080\u009d When he was 15 his mother cantacted him for the first time since she left him, she always told him to donâ\u0080\u0099t worry about school, itâ\u0080\u0099ll all work out, and it shouldnâ\u0080\u0099t matter much. â\u0080\u009c\n\r\nâ\u0080\u009cNo one I think is in my tree,\r\nI mean it must be high or low.â\u0080\u009d\n\r\nWhen he was a kid he knew he was a genious, but somehow nobody could see it. He could lost in high school. Tree is supposed to be his level of intelligence, â\u0080\u009chigh or lowâ\u0080\u009d heâ\u0080\u0099s not sure weather heâ\u0080\u0099s insane or a genious. Thereâ\u0080\u0099s a saying that the line between being a genious and insane is very thin, and if youâ\u0080\u0099re insane, you donâ\u0080\u0099t know it, but claims to be a genious â\u0080\u0093 was that him?\n\r\nThat is you canâ\u0080\u0099t you know tune in.\r\nBut itâ\u0080\u0099s all right.\r\nThat is I think itâ\u0080\u0099s not too bad.\n\r\nâ\u0080\u009cTune inâ\u0080\u009d meant interacting harmoniously with the world around you. A speech by Timothy Leary. (see wikipedia en.wikipedia.org/wiki/… â\u0080\u0093 itâ\u0080\u0099s a long article, but explains it very good)\n\r\nâ\u0080\u009cAlways, no sometimes, I think itâ\u0080\u0099s me,â\u0080\u009d\n\r\nAgain heâ\u0080\u0099s saying he knows heâ\u0080\u0099s a genious, but is he? Heâ\u0080\u0099s questioning himself.\n\r\nâ\u0080\u009cBut you know I know when itâ\u0080\u0099s a dream.â\u0080\u009d\n\r\nMaybe some drugs are included (could be interbritated with â\u0080\u009cdreamâ\u0080\u009d or â\u0080\u009cdreamâ\u0080\u009d being Strawberry Fields, like he knows he canâ\u0080\u0099t act they way he acts in Strawberry Fields in the real world outside of it.\n\r\nâ\u0080\u009cI think I know I mean a â\u0080\u0098Yesâ\u0080\u0099.\r\nBut itâ\u0080\u0099s all wrong\r\nThat is I think I disagree.â\u0080\u009d\n\r\nDuring the time being in The Beatles he accidently stated that (quote) â\u0080\u009cChristianity will go. It will vanish and shrink. â\u0080¦ I don't know what will go firstâ\u0080\u0094Rock and Roll or Christianity. We're more popular than Jesus now.â\u0080\u009d Later on he had to apologize to the public, 35 radio stations in the Bible belt in the US abandoned the Beatles, and people burned their records in protest. He had to appologize, he regret saying it causing all that controversy. \n\r\nOkay everybody, this is what I get out of this song. Tell me if thereâ\u0080\u0099s something you disagree with, or think is wrong, Iâ\u0080\u0099m open for ideas. After all nothing is right or wrongâ\u0080¦ sorry for my English grammer, I'm tired, but I though I'd leave you this, since I think this song is abselutely fantastic.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nwow...........\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nas for me  i cant get enough of this song. its a classic\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nStrawberry Fields is a place in Central Park.Directly across from the Dakota. where John Lennon lived.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\n\"Strawberry Fields is a place in Central Park.Directly across from the Dakota. where John Lennon lived. \"\n\r\nThat's a memorial named after the song. The place John Lennon is singing about was a Salvation Army orphanage, near John's childhood home. The Strawberry Fields of the song represent those of his imagination, though, not just the real place. Generally, the song is about using the imagination to escape boredom and the negative things in life.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\ni heard the anthology version today. HOLY SHIT!\r\nyou guys this song was pretty cool originally, but only on this version (anthology) has some remarkable drumming of Mr. Ringo, I think that's the best I've heard him\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nRight...It's not \"I buried Paul\". Listen to the Anthology one...you can hear John say Cranberry Sauce.  He liked to f*ck with people.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nTo clarify someones post earlier, Lennon was a heroin addict, but not during the time he wrote and made this song- this was made during his LSD period.\n\r\nBloody good song anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nthis is the greatest song ever. this is why beatles are and always will be my all time no. 1. this is magic. it's the tune that wakes me up every morning :)\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nI wouldn't go so far as #1 ever, but definitely #1 Beatles song.  Very nostalgic, and very good.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nIf you play it backwards, you can hear them say:\r\n\"of course we fear a horse, on the (gibberish name) farm\"\r\nNot that that means anything, but it's there\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nSorry, it just says\r\n\"we fear a horse of the (gibberish name) farm\"\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nOther random phrases in the song (played backwards):\n\r\n\"we fear a horse\" - repeated multiple times throughout (think strawberry fields backwards)\n\r\n\"Our horse didn't say yeah.  You know I maketh that\"\n\r\n\"Does anyone know when we should hear him speak and smile\"\n\r\n\"we're singing fun\"\n\r\n\"we hear him speaking\"\n\r\n\"may our horse be an english one\"\n\r\n\"here stands the hero\"\n\r\n\"we kissed him\"\n\r\n\"he sings on in mad sensation\"\n\r\nIt sounds like there's more, but I can't make it out.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nSo therefore the song must be about a horse (or not).\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nI have also found that it says, after \"hear him speak and smile\":\r\n\"most one to war\"\n\r\nBefore: \"may our horse be...\"\r\n\"the foolish one speaketh thus\"\n\r\nAlso, may our horse be an english one should really be: \"may our horse LIVE an english one\"\n\r\n\"here stands the hero\" should be changed to \"here stands the pharaoh\"\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nSorry, I don't have an 'Horse' stuff to contribute.  \n\r\nAt one time John Lennon asked George Martin how to make a song sound 'Orange'.  I can only imagine the expression on Georges face and what his response was.  But it gives you some insight to what John was thinking.  This song (probably due to the Strawberry reference) has always sounded 'red' to me. If Good Vibrations was Brian Wilsons masterpiece, then Strawberry Field Forever was John Lennons.  \n\r\nAlso, this song was spliced from 2 completely different takes - one slow and one fast with orchestration.  George Martin slowed one down and sped the other up so they'd be in the same key.  if you listen closely you can hear the change at 0:59 into the song.  It's mid-sentence which is really cool (let me take you  down).\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nThis is a great,or at least parts of it but is I find with some of the Beatles best song, some parts just sound all wrong, such as the nothing is real line or the chorus in sergeant pepppers...  Does no one else find this?\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nPLAYBOY: \"The most obvious is the 'Paul is dead' fiasco. You already explained the line in 'Glass Onion.' What about the line in 'I am the Walrus'... (correction: Strawberry Fields Forever) ...'I buried Paul'?\"\n\r\nLENNON: \"I said 'Cranberry sauce.' That's all I said. Some people like ping-pong, other people like digging over graves. Some people will do anything rather than be here now.\"\n\r\nFrom the 1980 Playboy interview\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nWhen I was 10 or so, this song really creeped me out.  I was facinated with it.  The cellos in the beginning are fantastic.  This discussion on whether the Beatles were doing drugs is pointless--drugs influence the song i am sure, but you can't write and pull off a song like this when you are stoned in the studio (which Lennon was not).  I'm sure he like his drugs, but it is immaterial to the song - Lennon didn't write this song while stoned out of his mind.  \n\r\nAs for the \"Paul is dead\" thing, a deejay out of Detroit looked at various snips of songs like the one here and looked at pictures of Paul walking across the road in Abbey Road (said he was walking in bare feet --like in burial), the license plate on the car in the Abbey Road picture that says \"29IF\" --Paul was 28 or 29 so that mean't that he died.  Paul's black carnation in the pictures within the Magical Mystery Tour album--yes, they had a large picture book within the vinyl album, etc.    Great bullshit.\n\r\nAs for the song itself, I could have sworn that Strawberry Fields was a graveyard.   In the video of \r\n\"Free As a Bird\" they \"fly\" into the graveyard (name of it is Strawberry Fields\" and you see the grave of Eleanor Rigby.  Right?  \n\r\nThe sheer inventiveness of the song is fantastic.  I think it is about death and life.  \"nothing to get hung about\" \"living is easy with eyes closed\" \"let me take you down\" (to the grave), etc..  all death imagines but Lennon loves to play the fool with his sarcastic humor.  At the end of the day, he affirms life and is engaged in it.  \"its not too bad\"   Difficult song to understand, but I think he is being really humorous and tongue in cheek about it all.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nA horse often seen to many as Herion just like in americas song horse with no name. This sond may be about acid as so many of the beatles songs were\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nSome believers have interpreted what is generally agreed to be Lennon saying \"cranberry sauce\" at 3:57 & 4:03 into \"Strawberry Fields Forever\" to in fact be \"I Buried Paul\".\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nthis is just one of the best beatles songs... unquestionably. it is a show of john lennon's musical genious\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nFirst off...I cannot stand the Ben Harper cover of this song. He plays around with the vocal melody, which is the most amazing part of the song. It also happens to be one of my favorites, so if you're going to cover it, you better do it right. Having already mentioned the vocals, the music changes in this song are amazing. It starts off in a trippy trancey sound, which is oddly contemporary. Then darker, creepier rock. Then more upbeat brassiness that always reminds me of Pauls songs. Then classically at the end with the chaotic acid jazz marching band hysteria. Its all just mysterious enough to be interesting, but not so much that its nonsense. Brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\ni dont konw sometimes i just think people dig to deep in the beatles songes. i kin of just think it was about the orphanage near his house. you guys are over analysing\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nI LOVE this song... in fact i LOVE ALL Beatles songs\n\n\r\nPAUL IS DEAD!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI wish john and goerge were here...\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nI've listened to the Sgt Pepper version over and over again.  I don't hear, \"cranberry sauce\"...I hear,  \"I buried Paul\".   Just turn your stereo up loud towards the end of the song.  The 'I', the 'b,' and 'P' are very audible.  It's part of the Paul is dead gimmick.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nthis is a great song.....a nice mellow beat I seem to injoy.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\n\"Sgt. Pepper version\"\n\r\nThis puzzles me. I may just be slow, but what does it have to do with Sgt. Pepper?\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nit was recorded for the sgt pepper album (as was 'penny lane') but was ultimately left off cuz the custom in england at the time was to not include singles on albums. and both songs were released as singles and thus didnt make the sgt pepper album, which, by the way, i read is george martin's biggest regret in his entire career, leaving 'strawberry fields' off the album, that is\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nI buried Paul and covered him in cranberry sauce!\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nI didn't get to read everyone's post but when I first heard this song on a personal level it brought me back to my childhood because when I was younger we lived near a strawberry field that literally went on forever.  I know Lennon is talking about his childhood at the strawberry fields orphanage but as I listen to this song over and over again I get this feeling that this song is really about suicide.  Someone killing themselves and then going into an eternal life into their most happiest place which in this case is strawberry fields.  \n\r\nThese lyrics just scream suicide to me.\n\r\n\"Let me take you down\"\r\nI'm going to bum you out or depress you right now.\n\r\n\"Living is easy with eyes closed\"\n\r\nDeath is an easy way out.\n\r\n\"Noone is in my tree, I mean it must be high or low\"\n\r\nLonliness.  Noone to relate to.\n\r\n\"Strawberry fields forever\"\n\r\nTo be in paradise forever.\n\r\n\"it's getting hard to be someone.....but it all works out\"\r\nHopelessness which in turn leads to something else, hence death.\n\r\n\"Nothing to get hungabout\"\r\nI guess you can be literal about it and have it be about hanging one's self.  But its really about if I pass on don't worry about it.\n\r\nAnd the last part where he seems to be in a state of confusion is where he's thinking should he or shouldn't he do this?  \n\r\nAnyways, thats my take on it.  Love the song.  I love that it can be interpreted in many different ways.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nI didn't read through most of the comments, so I'm unsure whether or not this was mentioned.\n\r\nStrawberry Fields is a term for LSD.\n\r\nThe lyrics define the behaviors of a person who is using LSD such as: Synesthesia, delusions, visual hallucinations, distorted perceptions, etc. which I'm willing to point out if bothered to.\n\r\nNot that I've completely disregarded the whole \"Strawberry Fields Sanctuary\" of Lennon's, but I see this song reflecting drug use.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nahhh john lennon is GENIUS.  strawberry fields forever is probly my favorite beatles song\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nHuh it musn't be about drugs just because 'Strawberry fields' is a drug related term. It can be that the term wasn't used as a drug term until after the song was released and not vice versa. Since many of the Beatles' songs are about acid and trips it's probable that people take some, for them, unknown expressions and apply them to drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nI wouldn't exactly call myself a 'real' Beatles fan, meaning that I'm not one of the hardcore ones that dedicates their lives to them. But I enjoy their music so much, even in this modern age, it's still the most creative music that I've ever heard. The lyrics, the insturments, the ideas, it's better than a great amount of musical artists these days. \n\r\nI look at the lyrics to Strawberry Fields and I immediately picture a large red field in my mind. A very vacant field, no buildings or modern things, but explosive with colours. It's something that I wish I could paint. \n\r\nSure, the song sounds drug influenced, and heck, it might actually be, but I just see it as the story of a place in your subconcious where you can escape reality and just live in the fields of strawberries forever. It also talks about how it's not possible to live with your eyes closed. I know that feeling too well. And if it is based off of Lennon's youth, it's obvious, because of the childlike innocence of living in a fantasy world in your imagination. The lyrics speak wonders.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nI didn't read anything, but this is all I know about it. Most of the John's Beatles songs didn't mean anything, he said himself that they're \"Just words I put together\". John and Paul decided to both write songs with references to places they grew up with in Liverpool. Paul wrote \"Penny Lane\",I forgot what that place was, and John wrote this about the Salvation Army center, that they called stawberry feilds. I think Ringo said they were trying to make something that no one could ever reproduce live.\n\r\nBut I do love this song, and I was totally devistated when I watched the footage of John saying his songs were meaningless.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nsorry, i have to disagree with most of you... this song is about acid... maybe partly about where he used to go as a child to cover up the real meaning... it says \"nothing is real\" and \"living is easy with eyes closed, misunderstanding all you see.\" That's def. refering to acid... cuz with you trip and you close your eyes you see tons of weird and strange things... and you wouldn't understand most of it... hence those lyrics. also, the lyrics, \"Always, no sometimes, I think itâ\u0080\u0099s me, But you know I know when itâ\u0080\u0099s a dream. I think I know I mean a â\u0080\u0098Yesâ\u0080\u0099. But itâ\u0080\u0099s all wrong. That is I think I disagree.\" things seem dream like when your tripping. to explain that, in the middle of your brain theres a drug called DMT which is like acid... and when your dreaming that drug is released into your whole brain when you go into REM (rapid eye movement), thats what makes you dream which explains those lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nin the movie across the universe the strawberries were a symbol of war hatred and death :(\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\n'Living is easy with your eyes closed' It is, isn't it?  It's so much easier to just let life take you wherever the fuck it wants to and you can just lean back and enjoy the ride.  My all time fav beatles song.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nI believe that there's a possibility the intention behind this song was to reflect a double meaning:\n\r\n1. Freedom, calm, reflection, etc.\r\nand\r\n2. Drug use\n\r\nWho's to say there's only one true way Lennon meant it? He was freakin' genius - I don't see why not. ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nit's a beautiful song, no one has commented on the refrain. if you have, I apologize. \"strawberry fields forever\" let us realize our problems and fix them, so we can live happily ever after in strawberry fields, eternal happiness. I love John Lennon. He was so full of love. I get depressed thinking about his murder.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nahh just breathe deep...breathe true\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nPAUL-IS-DEAD \n\r\nSgt. Pepper's Lonely Hearts Club Band:\n\r\nOn the Front Cover:\n\r\n1.) All the people are looking at a freshly dug grave.\n\r\n2.) Paul is holding the musical instrument cor anglais, and it is black, symbolizing death, and the only Beatle holding a black instrument. Where Paul is holding it with his left hand (being left-handed) he is displaying three fingers, meaning only three Beatles left?\n\r\n3.) This was the first album on Apple Records and the first album that the group wrote their name as \"Beatles,\" rather than \"The Beatles.\" This is inferred to mean that they are no longer a whole as in \"The,\" but now since there are only three, it is just \"Beatles.\"\n\r\n4.) The yellow hyacinth in the shape of a left-handed guitar only has three strings.\n\r\n5.) The doll in the red, black and white stripes has a car model on her lap next to her right hand. This model with red interior is supposed to mean the car in which Paul was killed and the red interior is blood.\n\r\n6.) The other three Beatles' are standing sideways behind the drum, except Paul who is standing forward.\n\r\n7.) On the drum is written in the center \"Lonely Hearts.\" Using a mirror, place it perpendicular to the center of the drum. Splitting the words \"Lonely Hearts\" in half, the combined writing reads - 1 ONE 1 X HE DIE. This means that the \"1 One 1\" equal three, or that Paul is gone, and the \"X\" is meant to cross out Paul. Between the words \"HE\" and \"DIE\" is an arrow that points directly to Paul.\n\r\n8.) The hand raised over Paul's head, is to mean \"death.\"\n\r\nThe Back Cover:\n\r\n1.) Paul is facing the back, which can mean that he is an imposter, or that he is dead.\n\r\n2.) George's right-hand index finger is pointing directly to the words \"five o'clock,\" the supposed time of the car crash.\n\r\n3.) That the song lyrics \"Within You, Without You,\" are printed over Paul's body.\n\r\nThe Songs:\n\r\n1.) Lovely Rita:\"When I caught a glimpse of Rita,\" and \"I took her home, I nearly made it.\"\n\r\n2.) A Day In The Life: \" He blew his mind out in a car, he didn't notice that the lights had changed. A crowd of people stood and stared, they'd seen his face before...\" \n\r\n3.) Good Morning, Good Morning: \"Nothing to do to save his life.\" \"People running around it's five o'clock.\" \n\r\n4.) She's Leaving Home: \"Wednesday morning at five o'clock.\"\n\r\n5.) Sgt. Pepper's Lonely Hearts Club Band: The reference to Billy Shears is supposed to be that of William (Billy) Campbell, the look-alike.\n\r\nMagical Mystery Tour\n\r\nThe Front Cover:\n\r\n1.) Paul is alleged to be the one in the \"black\" walrus suit.\n\r\n2.) In the booklet, Ringo's drums read \"Love the 3 Beatles.\"\n\r\n3.) In the picture where The Beatles' are wearing white tails, Paul is the only one with a black carnation, the other three have red. \n\r\n4.) When you hold the album cover to a mirror, the word \"Beatles\" is a phone number, which is 2317438. It has been said that if you had called this number back then, a recording came on saying, \"you're getting closer.\" Of course there is no area code etc., so I doubt this one too.\n\r\nThe Songs:\n\r\n1.) I Am The Walrus: At the end of the song, where the spoken words from the play King Lear are placed, you here \"O, untimely death!\" and of course as we know, \"The Walrus Was Paul.\"\n\r\n2.) Strawberry Fields Forever: When John Lennon says in the end of the song the words \"Cranberry Sauce,\" it was long believed to be he saying \"I Buried Paul.\" However, it was electronically manipulated to sound like he was saying \"I Buried Paul\" but he actually isn't. 3.) All You Need Is Love: At the end, Lennon says, \"Yes, he's dead.\"\n\r\nYellow Submarine\n\r\nThe Front and Back Covers\n\r\n1.) Lennon's hand raised over Paul's head, indicating \"death.\"\n\r\nThe Beatles (The White Album)\n\r\n1.) Glass Onion: The term used for a coffin with a glass top.\n\r\n2.) 'Don't Pass Me By: \"You were in a car crash....\"\n\r\n3.) Revolution 9: The words, \"Number nine, number nine,\" repeated many times are supposed to say when played backwards, \"dead man, turn me on dead man.\" The reference to the number 9 is supposed to be that of McCartney having nine letters.\n\r\nAbbey Road\n\r\nThe Front Cover:\n\r\n1.) The common meaning of the Beatles' dress - Lennon in white for a priest, Ringo as the undertaker, George as the grave digger, and of course Paul, in his bare feet, holding a cigarette in his right hand (being lefty) all means death.\n\r\n2,) The police vehicle parked to the right in the photograph is a morgue wagon. \n\r\n3.) The Volkswagen parked on the left side of the street has a tag that reads, \"LMW 28IF. This has been construed to mean \"LMW - Linda McCartney Weeps\" and the \"28IF\" means that Paul would have been 28 years old IF he had lived\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\noh and the song doesnt go ''...i think i know i mean a yes...''          its '' i think A NO means A YES but its all wrong...'' .        plus it makes much more sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\ni think it is about multiple things that are perhaps unknow because john is dead.but,i think strawberry fields is a dream.and in your dreams it seems like foreverand in your dreams there is nothing to worry about because nothing is real.when you are a child things are easy but when you grow up you see things and you misinterpret which leads to mischief.an when they sing their nonscese part they are interpreting that there is different meanin or they are arguing over something.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\ni don't think this song is THAT incredible deep.\r\ni think why he says strawberry fields are because of the marks on his arm from injecting heroine.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nThe most common tale is that on Wednesday, 9 November 1966 at 5 am, McCartney, while working on the Sgt. Pepper's Lonely Hearts Club Band album, stormed out of a recording session after an argument with the other Beatles and rode off in his Austin-Healey, which he subsequently crashed.[5]\n\r\nThe story was largely pieced together by fans from the lyrics of several Beatles songs. The most common narrative includes the following pieces of evidence: \"He didn't notice that the lights had changed\" (\"A Day in the Life\") because he was busy watching the pretty girl on the pavement (the eponymous meter maid of \"Lovely Rita\") after narrowly missing her dressed in blue (she's said to be the blur on the back of Abbey Road) jaywalking (\"Blue Jay Way\"). He then crashed into a lamp-post (a car crash sound is heard in \"Revolution 9\" and \"A Day in the Life\"). He was pronounced dead on a \"Wednesday morning at 5 o'clock as the day begins\" (\"She's Leaving Home\"), and nobody found out this because the news was withheld: \"Wednesday morning papers didn't come\" (\"Lady Madonna\"). A funeral procession was held days later (as supposedly implied in the Abbey Road album cover). Adding fuel to the legend is the ending of \"Strawberry Fields Forever.\" Some believed John said \"I buried Paul\" in a slow deep voice over the final refrain. He later refuted that, stating that he said \"cranberry sauce.\"\n\r\nAccording to believers, McCartney was replaced with the winner of a McCartney look-alike contest. The name of this look-alike has been recorded as William Shears Campbell, Billy Shears (the name of the fictitious leader of Sgt. Pepper's Lonely Hearts Club Band), William Sheppard (based on the inspiration for the song \"The Continuing Story of Bungalow Bill\"), or some combination of the names.\n\r\nThere is no evidence of any sort of car crash in which McCartney was involved, although during the first week of January 1967, McCartney's custom-made Mini Cooper was wrecked by a friend on the M1 Motorway outside London. McCartney was involved in a moped crash on December 26, 1965, which resulted in a chipped tooth and the scar on his lip that can be seen on promotional videos for the \"Paperback Writer\"/\"Rain\" single, made shortly after the crash, in May 1966. According to McCartney, his desire to hide the scar on his lip was the impetus to grow a moustache; at about the same time the other three Beatles grew moustaches as wellâ\u0080\u0094in time for Sgt. Pepper's Lonely Hearts Club Band\n\r\nso here is what i found on that hoax for the ppl that have lloked into this paul is dead thing so i hope u take the time to read this so u can relize THAT IT WAS A HOAX AND IT WAS A LONG TIME AGO...ty\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nThis is perhaps Johns greatest piece of work. It shows him in a fragile state. He misses the innocence of childhood.  In this song John expresses the pain of not being able to fit in straight society. On the one hand he cheriches his unique perception on life, on the other he just wants the simplicity of a normal and stable existance.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nyou conspiracy junkies are nuts!! HE'S NOT DEAD\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nyes, just like everyone else have said, this is one of the best beatles' songs ever. it's deep and catchy and it gives everyone a whole new perspective of life. i think jim sturgess (across the universe) did a really good cover of it and.. theres no and. this is the shit you people should be listening to!\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI immediatly thought it was about vietnam and how the blood stained the rice firleds making them all red so they were strawberry fields forever\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nLENNON: (singing) \"'...with eyes closed. Misunderstanding all you see.' It still goes, doesn't it? Aren't I saying exactly the same thing now? The awareness apparently trying to be expressed is-- let's say in one way I was always hip. I was hip in kindergarten. I was different from the others. I was different all my life. The second verse goes, 'No one I think is in my tree.' Well, I was too shy and self-doubting. Nobody seems to be as hip as me is what I was saying. Therefore, I must be crazy or a genius-- 'I mean it must be high or low,' the next line. There was something wrong with me, I thought, because I seemed to see things other people didn't see. I thought I was crazy or an egomaniac for claiming to see things other people didn't see. As a child, I would say, 'But this is going on!' and everybody would look at me as if I was crazy. I always was so psychic or intuitive or poetic or whatever you want to call it, that I was always seeing things in a hallucinatory way. It was scary as a child, because there was nobody to relate to. Neither my auntie nor my friends nor anybody could ever see what I did. It was very, very scary and the only contact I had was reading about an Oscar Wilde or a Dylan Thomas or a Vincent van Gogh-- all those books that my auntie had that talked about their suffering because of their visions. Because of what they saw, they were tortured by society for trying to express what they were. I saw loneliness.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nHoly shit people, every song from this period is NOT about drugs. Any TRUE fan of the Beatles knows that.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\ni love this song\r\nwhen i hear it, it make sm efell like im floating on a cloud :] lol\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nAlways, no sometimes, I think itâ\u0080\u0099s me,\r\nBut you know I know when itâ\u0080\u0099s a dream.\r\nI think I know I mean a â\u0080\u0098Yesâ\u0080\u0099.\r\nBut itâ\u0080\u0099s all wrong.\r\nThat is I think I disagree.\n\n\n\n\n\n\n\n\r\nSomeone please tell me what that means!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\n\"Strawberry Field was the name of a Salvation Army Children's Home just around the corner from Lennon's boyhood home in the Woolton suburb of Liverpool. Lennon and his childhood friends Pete Shotton and Ivan Vaughan used to play in the trees behind the home.[6] One of Lennon's childhood treats was the garden party held each summer on the grounds of Strawberry Field. Lennon's Aunt Mimi recalled: \"As soon as we could hear the Salvation Army band starting, John would jump up and down shouting, 'Mimi, come on. We're going to be late.'\"\"\n\r\nFrom Wikipedia, about this song's meaning :]\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nI love the first verse.  Quite possibly my favorite verse in any song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nEveryone that keeps interpreting EVERY Beatles' song about drugs needs to stop, because they weren't all about drugs. Yeah, the Beatles did do drugs, but its not all they wrote about.\n\r\nI basically agree with those that think this song is about a mental escape of sorts.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nThis song reminds me of someone special. \t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nOkay, I hate it when people get mad @ other people for listening to the beatles right after watching Across The Universe. So what if they did? The love for the beatles and their songs are all the same. This song happens to be my favorite one from the beatles they were brilliant. They had actual music with meaning not all this crap that people listen to that's al about sex, drugs, getting girls, booty calls, ect. I do not believe that every beatles song was about drugs as I've been told. And I have also been called a hippie just becos I listen to the beatles. I'm really tierd of people lableing according to the genre or artist of music you listen to cos lol I listen to beatles and MSI and guns n roses pfft I am not labled :D\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nDrugs are the first thing that comes to mind when people listen to this song... when its really about a place that john would go as a child (which was located next to an orphanage.)\n\r\nBut thats the thing about The Beatles, they make songs so you can interpret them in different ways.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nMelody trips me out. Incredible song though, really takes me there.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nbeatles.ncf.ca/…\n\r\nGo to this link for photos of Stawberry Field and the story.\r\nOn May 31, 2005, Strawberry Field, the Liverpool orphanage that John Lennon immortalized into a hit song, officially closed it's doors for the last time. After 69 years of it's existence the decision to close the orphanage was made by the Salvation Army this past January. The three remaining children who were living at Strawberry Field had been placed foster homes or under the control of Liverpool's social services. \r\nThe reason for the closure stems from a major policy shift by Liverpool's City Council which has seen a larger number of children placed in foster homes as opposed to institutions (foster care families actually doubled for the 2003-04 period thereby decreasing the demand for children being placed into orphanages.)\r\n\"It's a Salvation Army home that was near the house I lived in with my auntie in the suburbs,\" said John Lennon in a September 1980 interview with David Sheff for Playboy when describing Strawberry Field. \"There were two famous houses there. One was owned by Gladstone, which was a reformatory for boys, which I could see out my window. And Strawberry Fields was just around the corner from that. It was an old Victorian house  converted for the Salvation Army orphans, as a kid I used to go to their garden parties with my friends Ivan, Nigel and Pete. We'd all go up there and hang out and sell lemonade for a penny and we always had fun at Strawberry Fields.\r\n\"Apparently, it used to be farm that made strawberries or whatever. I don't know. But I just took the name,\" exclaimed Lennon, \"it had nothing to do with the Salvation Army. As an image -- Strawberry Fields forever.\"\r\n\"I remember John Lennon sneaking into our garden parties from the back gate,\" said former 63-year-old resident Pat Fitt of Wavertree. \"The children who played around always wanted to know about the home.\" On the closing of Strawberry Field, Ms. Fitt lamented: \"It was a wonderful place and I made great friends there.\"  According to Kate Mansey of the Liverpool Daily Post, \"Ms. Fitt arrived at Strawberry Field as a three-year-old in 1944\" and that \"she worked at the home until 1991.\"\r\nThe final day saw staff \"working this morning to move everything out\" of the Strawberry Field. Said Assistant Manager Peter Burns: \"It is a very sad day for all the staff as it is the last day the children will cease to be a working children's home.\r\n\"It has been a very emotional time for all the children and staff. I can't praise the staff enough. They have been 100% committed to the children and the home over the years - so much so that it has become like another family for them.\"\r\nOf the 26 staff members who ran Strawberry Field, only a few staff members will stay behind until August to clear up the remaining administrative tasks.  And as to the fate of the building itself, no decision has been yet made but Sheila Powell, 69, who was one of the first who was taken into care at the orphanage pines: \"It is wrong for them to close Strawberry Fields. The Salvation Army were my only parents and now I hope that the building is put to good use - as a holiday home for children for example.\"\n\r\n... more on the website...\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nThis song relaxes me. I don't do drugs, minus smoke pot, but I can lay in the dark in my bed and listen to this song and just escape everything\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nPaul isn't dead u tards he came out with a video in like 2005 and has been on magazine covers and in interviews and everywhere. How is he dead? Stupids. This song probably has more than one meaning, thinking it only has one is understimating the Beatles' creativity.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nWhile I can appreciate the Beatles' experimentation with music, this song (and most late Beatles) is like the sound of a bad hangover.\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nMy friends and I sang this today when we were sponning around on the track feild : )\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\n\"Its getting hard to be someone, but it all works out\" i absolutely love the way john sings that line. I cant explain why. Im not a massive beatles fan but you have to give them credit for this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\n\"Its getting hard to be someone, but it all works out\" i absolutely love the way john sings that line. I cant explain why. Im not a massive beatles fan but you have to give them credit for this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nyes, i was introduced to The Beatles' music through across the universe and yes i have to come to love it. people must get over this unnecessasary arrogance with regard to WHEN one becomes a fan. anyway, this site is about song meanings. strawberry fields is brilliant, because decades on i can relate to the feeling of detoxing the mind i.e. going to strawberry fields.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nso so so very good\n\r\ni love this so so much\n\r\ni dont even want to know\n\r\nwhat its about.\n\n\n\n\r\n<3\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nat the end.\r\nwould you say its cranberry sauce\r\nor i buried pual.\r\nor any thing else?  \t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nat the end john doesnt say \"i buried paul\" he said \"cranberry sauce\"\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nback in the day they used to grow marijuana in the strawberry farms, so i think this song is about going down to the fields to smoke a joint and how being stoned makes everything better (for a while), but it could also be about the strawberry fields orphanage, idk, just thought i'd throw the pot thing out there\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nthis outside the trippy psychedelics. \r\nacid and shrooms arent the only ones. \r\ndmt... the beatles were exposed to a lot psychedelics\r\nbut out of all of them dmt is the eye opener. \n\r\nstrawberry fields might be a place where he lived but its also the place where we all can live\n\r\nnothing is real.. if you've done or researched dmt or ancient toltec wisdom you might better understant\r\nwhen you die dmt is released in your brain and everthing you see gets wiped away and you learn that nothing is real\r\nthe only thing thats real is your soul\r\ntheres nothing to get hung about\r\nbe happy and be in strawberry fields as much as you can in life because when you die you see that nothing is real and all the sadness and pain is pointless. \r\ngod is love\r\nlove as much as you can.\r\nits the only helpful emotion.\n\r\n[when it comes to the beatles you have to think beyond the trippy psychedelics, \r\nthey were influenced by experienced teachers and shamans they were on a whole different level]\n\n\n", "comment_175": "\nyou know john murmurs \"cranberry sauce\" at the end of this song but a lot of people thought he said \"i buried paul\" during the paul is dead hoax. also the weird noises in the last thirty to forty seconds of the song were put there to annoy dogs they had an ultrasonic pitch in them this was what drove dogs nuts\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nSeems to be about psychedelic drugs. \t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nto me other way to sum it up is this ignorance is bliss\r\nliving is easy with eyes closes \r\nand no one i think isa in my tree i mean it must be high or low \r\nmeans noone is going through the same thing that he is going through and he doesn't know if his life is good or bad \t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nThe best way to relate to this song is to think of it as an operatic work.  In MOzart's operas, for example, he insisted that the words were always secondary to the song -- so the librettist had to write the words in a way that would best realize the voice (for example more vowells).  When you think about that, you realize that a good song, like this one, should never be broken apart into words and lyrics.  Instead we should be thinking about the combination.  On the music side, there is a continuous and regular declension of both the background music and the melody (the notes Let me take you down, literally travel down on the scale).  This creates a feeling of settling, indeed a rapid feeling of submersion, emotionally.  A second thing to notice in the music is the way the stringed isntruments break in upon the song in fragments, drums too, all ending in a sound very similar to an orchestra tuning up before a performance.  The overall effect gives the listener a sense of the uncanny, the unfamiliar, and yet the settled. Musically we have been drawn down into an underworld of settled strageness, where we could imagine carnival acrobats upside down.  The lyrics compliment this musical sense of the unfamiliar and awkward.  They, like the music, appear as chunks of order.  Nevertheless, the overall meaning of the lyrics escapes us.  Through the use of uncanny musical form which nevertheless HAS structure, Lennon manages to get his audience to imagine that his uncanny words also have meaning. It is feeling, not meaning, that Lennon intends to evoke in his audience, however, the feeling of uncanniness.  That is the genious of the song.  How many rock songs were doing that in the 1960's?\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nbahahahaha cranberry sauce! sooo random loves itttt\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nI LOVE THE BEATLES\r\n~the spaceman lives~\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nhow the hell did the \"I buried Paul\" thing ever start? It sounds nothing like that.  Cranberry sauce is kind of a weird thing to say but it's very clear that's what he is saying.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nsorry but other than that one line I don't see it, I mean John has said himself it's a song about how he feels different from other people, with references to his childhood.  Also if you put that one line in context with the next line:\n\r\nLiving is easy with eyes closed \r\nMisunderstanding all you see.\n\r\nThey clearly have to be considered together.  In this sense it seems to be a comment on going through life without understanding what you see.  nothing to do with literally having your eyes closed.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nthey actually wrote this song in memory of strawberry fields (an orphanage near lennons house growing up) after it closed\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nI think it has a lot of deal with how people will never connect in anyone's ideas fully, as human, no one could ever connect to everyone's thoughts or feelings. I think John is saying \"No one I think is in my tree.\" Meaning that no one could be in the same thoughts as his. \"It must be high or low\" Means that whatever this means that it's either good or bad, that you \"can't tune in..but it's all right, that is I think it's not too bad\" That's just my thoughts.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nim getting 'living is easy with eyes closed' on my arm\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nstrawberry fields is another name for acid. \r\n\"Living is easy with eyes closed\r\nMisunderstanding all you see.\"\r\nits pretty obvious depending on how you look at it.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nI think the song somewhat ties into the vietnam war.  The strawberry fields represent the fields of blood left behind, and lines like 'nothing is real' were used to describe how crazy the war seemed to them.  Under those conditions, I guess 'That is you can't tune in but it's all right, at least I think it's not too bad,' would refer to the inflated casualty levels and propaganda surrounding the event which made it hard to find real estimates at the time, though it would have been a little bit more difficult to notice at the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nThis is not my favourite song, but certainly in the top 10. \n\r\nOne of the few things I love about it, is the use of moods, especially in the chorus. It starts pretty chipper, but takes a darker tone for a few seconds. Which creates this weird sinister mood. It's very hard to explain.\n\r\nSecond of all, to me, it's about never really connecting to the world around you and just going through the motions. Nothing really sticks, but then again, nothing really matters. \t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nTo me, this song is very reminiscent of dying. Not that I remember dying, because then I would be dead and not writing this. But I do remember ALMOST dying. That confused, yet calm feeling is translated from this song for me. \r\nEspecially the line, \"It's getting hard to be someone...\"\r\nIt's hard to keep an eye on reality when every idea about yourself is slipping away... and surely, hard to be someone when you're not going to be anything anymore.\n\n\n", "comment_190": "\nthis song was just great, one of lennon's best work indeed\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nthe meaning of  this song is about the lead singer and how as a child he used to go and play in the salvation army band in which is referring to as strawberry fields(salvation army logo). This song is a reminisce of those childhood memories. \"strawberry fields forever\"\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nBasically its like this..... The Strawberry fields were just around the corner from Johns childhood house. He use to go and play there when he was a kid. Its meaning is about the nostalgia an innocence of places like that when your a kid. You know when you go somewhere and while your there.... the rest of the world does not exist because you with your mates and lost in your own world having fun\nWhen i was younger, we use to play in park wood, climbing trees, riding bikes and war games.......\nPark Wood Forever!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nI walked past Strawberry Fields in New York's Central Park in the early morning mist yesterday morning. This is my interpretation:\nmystmodmus.blogspot.co.uk/2013/05/…\n\n\n", "comment_194": "\njohn lennon was my original spirit animal.  'though i can see, i walk in total darkness, and though i feel, i care less than i see.'\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nThis song makes sense without the use of acid or any other hallucinogen....Strawberry Fields is just a literary representation of any sort of fantastical fantasy land. Strawberry Fields is where you daydream at. It's your imaginary place where everything is ok, it's your escape from reality. So the chorus is basically saying that he is leaving reality where there is nothing to be upset about because nothing is real, and he's wishing he could stay in this imaginary place forever. The first verse is pretty self-explanatory. Life is easy, when you never stop to realize what's going on or think about things and just accept whatever society or religion or government tell you to believe. But in the end none of it matters, because nothing ever really changes. The second verse is saying that he feels like he's all alone and that nobody sees things the way he does or thinks the way he does, because they can't \"tune in,\" but it's ok, he accepts it and doesn't let himself feel lonely or isolated or separated from everyone else as a result of it, he lets it be. I think the last verse is about how sometimes when you can feel so different from everyone else, you can almost experience this disassociation with everything. I think he's saying that sometimes he feels like true reality is only a dream, so he's confused about what's real, not in any literal sense like if the building he's looking at is real or not, but in a more perceived sense, like is society really like this? Is government really like this? Are people really being genuine and true when they are doing these things? Etc. \t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nI believe he is speaking of a place that we can all reach naturally if we can get past our ego to a place that most religions speak of as well, it is truth.  In that place you realize nothing in this realm we see is actually real.  lots of beatles tunes speak of this place.  check out thetruthcontest.com they have a whole section on interpreting the beatles that is the best I've ever read.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nIt was written during an acid trip. Apparently it's a safe place he remember when we was young. If I remember right it was a field by his house with a fence the Salvation Army.\n\nThis is a pretty personal song. He doesn't show a lot and I don't know if he was having a bad trip, I doubt that. Lennon was able to do psychedelics. I think it's more just in a reflective state of mind and remembering how that was a safe place and now being an adult he doesn't have a place like that anymore. So yea that's how it's personal. It's not just some love song or whatever not to knock the Beatles. I'm just saying this is about as personal as Lennon will get, in his own trippy unique way.\n\nI tripped to Sgt. Peppers once. I feel like you don't choose if it's a music trip or not. But I enjoyed Sgt. Peppers. Having done almost every pscadelic drug except peyote (unless mescaline is synthesized peote) I'm not sure if I would enjoy this song tripping. Having done psychedelics I hear it and I think this is psychedelic but just might not be my first choice. I was listening to A Go Go the other day and realized how much of a role acid had in that album. Really good trip but I was doing it too much. Had a ton of really good trips I just don't think it's good to drop acid all the time so I'm taking a break for a while.\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nI wanted to add to earlier comments he barely gives you anything. Very interesting individual Lennon was. Maybe this is why I don't write lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nI think this song is a celebration of the total freedom you can enjoy only in your childhood. As people grow up, make their choices and feel they have to be cohesive and rational, but as well trapped in a part they made or someone else pushed them into because there were no choices they could make.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nJohn's Aunt Mimi's house at 251 Menlove Avenue used to back onto the Strawberry Fields buildings which at the time were a girls school.  The teenage Lennon was VERY interested in the inhabitants and used to climb out of his window and stare at the girls from a tree.  His Aunt Mimi used to say to him \"they'll hang you if you get caught\" - which is where the line \"Nothing to get hung about\" comes from.\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nOne time I got high and I listened to a cover of this song. The one from Across the Universe. It may have been the haziness of my brain talking, but I came to the realization that strawberries in a field could be dead bodies. It could be talking about war and about the soldiers who would run through the fields, shooting at the enemy and getting shot at. Fellow soldiers would be dying at their sides, and the blood would splatter and look like strawberries in the field.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nSet as a song of psychotherapy set to music, it's a song about John exploring his own thoughts with some disagreement.\n\nI submitted corrections to the lyrics such as:\n\n\"Always, no sometimes think it's me\" to say he corrects himself about always, er, sometimes.\n\nThis section is about drug use and how he was on drugs so much he posted he Sometimes thinks it's about him (as opposed to Always\", then says \"I know when it's a dream\" as in he knows when it's drug use lucidity.  So catch the drift?  Sometimes knows it's real but always knows when it's drugs?\n\nThe phrase \"It's not too bad\" was their thoughts on the whole Magical Mystery Tour album often leaving recording sessions with engineers having to work their magic but saying to them \"it's not too bad\"\n\nThe 2nd part about no one being in his tree is specifically talking about his level of thinking and no one being in that class of thought, but hey, that either means I'm hi (genius) or low (idiot).\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nI donâ\u0080\u0099t know how many persons can agree, perhaps a few, however this song seems to be the criticism of a movie. The two fundamental words of the lyrics are â\u0080\u009ccranberry sauceâ\u0080\u009d, recalling the Christmas period in the UK, and also a slang insult in the USA. In brief, something completed in December 1966 in the USA was extremely disgusting to John Lennon, who wrote this song to criticize it. I think it was the movie â\u0080\u009cHallucination Generationâ\u0080\u009d, directed by Edward Mann.\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nnot at all well known at the time [nor even now] that this was where he buried the bodies that would be remain there 'forever'\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nmaybe you need to get off the lsd......LSDtangerine strawberry fields was a place where lennon went as a kid it was an orphange or sumtin like that, to get away from his troubles he might have been on heroin but this song is not about it.....get your facts straight......if you knew anything about lennon or the beatles....you would know lennon hated people who analyzed and looked into his lyrics obsessivley....which he wrote the song \"Glass onion\" for, people like you that sit around, drop 6 hits of acid and think every song is about drugs....i feel sorry for you........bud.\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nin my point of view, strawberry fields is an image of making love, or kissing your lover.\n\r\nthink about it and read the poem again:\n\r\ncause Im going to Strawberry Fields.\r\nNothing is real\r\nAnd nothing to get hungabout.\r\nStrawberry Fields forever.\r\nLiving is easy with eyes closed (reffering to kiss)\r\nMisunderstanding all you see.\r\nIts getting hard to be someone.\r\nBut it all works out,\r\nIt doesnt matter much to me.\r\nLet me take you down\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nI think it is much simpler than the whole hidden meaning thing. I think he is talking about Him and Paul and the whole Beatle thing. I think he is already getting pretty tired of the studio and trying to get his music \"Beatle\" perfect. He always said he should have been in the Stones because he just wanted to play rock and roll in 4/4 time, and that the Beatles sold out the minute they put on the grey suits and performed instead of played....\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\n\"Take a good dose of lsd and listen to this and all will become clear. - wyguy\"\n\nAbsolutely.\n\nIt's quite funny reading some of the silly interpretations on here. If you've been there, you will know.\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nStrawberry Fields is about the effort of keeping up with conformity.  The poetic narrator is trying to be a conformist, but ends up more and more confused in trying to keep up.\n\r\nthere is no real Sitz im Leben (explaination from the life of the artist) except for his subcultural 'distain' for conformity, neither is it about drugs.\t\t\t\t\n\t\t\t\t\n\n"}