{"comment_0": "\nWorthwhile to note that Brother, My Cup Is Empty (also from Henry's Dream) contains the lines \n\r\n\"Well I've been sliding down on rainbows\r\n Well I've been swinging from the stars\"\n\n\n\n", "comment_1": "\nI find this song very painful to listen to, yet it's one of my favorites. I can't explain the paradox. I just know that listening to it (especially with headphones) makes me feel like I'm going to physically explode.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nMy favorite Nick Cave song. It floats very well throughout the song.\n\r\nI'm guessing it's about a dying relationship that the singer can't get over.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis used to be my fav. It probably isn't anymore but it still ranks pretty highly.\n\r\nAnyway, I always thought the idea was no matter what, the narrator would always love this girl and always make an effort to be with her.\n\r\nNick uses a lot of religous imagery to convey a bleak apocalyptic picture which I don't think is a metaphor for the relationship at all but is either a deepistion of the world at large at the moment or an actual description of the world ending as Nick see's it and despite what's going on around him still wanting to only be with his love.\n\r\nIn terms of meaning it is a very similar song, I would argue, as (I'll Love You) Till the End of the World.  \n\r\nAnother possibility is that Nick is describing the death of religion or it's lack of compatability in modernity and decline and failure to remain relevent i particular amongst the intelligentsia.\n\r\nHeaven has denied us its kingdom\r\nThe saints are drunk howling at the moon\r\nThe chariots of angels are colliding\n\r\nIt's quite an ambigous song and I still havn't concluded as to what its about other than love, rleigion etc\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nTo me this seems to be about his drugs addiction.\n\r\nThe moment when the highs are not so great anymore and the lows are worse and worse. But still he has been captured and keeps going back.\r\nThe second verse describes this perfectly:\r\n\"Gone are the days of Rainbows\" \r\n\"For the sea (the low) will swallow up the mountains (the high)\"\n\r\nThe recurring sentence \"one more time\" seems also an obvious pointer towards addiction.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nJust perfect. This was the song that made me buy everything Nick Cave had recorded. I think it's about star-crossed love, about everything being against you. That third verse is tremendous - \"the sky will throw thunderbolts & sparks/ straight at you\". That's not an accident, it's personal - something is out to destroy them. But he doesn't care. This has got to be one of the most powerful love songs ever written.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis almost seems like a pleasant daydream, for Nick Cave. It's grandiose! Exciting! Everything can go f**k itself! There's nothing left holding things in their places and he can take off and go running, straight to the one he loves.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI take the description of the destruction of the world to be judgement day, the end of the world.  Particularly the image of the 'ivory tower' crumbling, which connotes civilisation and privilege.  The fact that he returns to 'her' infers that she is the one, the one he is meant to be with, that he will take refuge with.\n\r\nIf we take the 'end of the world' to be a metaphor for difficult times in our lives, times when everything falls apart- this is when he goes to the girl he loves as 'I am captured' which connotes a difficult unbalanced relationship.  Perhaps he is running to her despite knowing it is the wrong thing to do.\n\r\nThe repetition of 'one more time' and 'once again' supports this idea that he is returning to this woman every time things go wrong, and that this is an unhealthy and destructive relationship.\n\r\nBeautiful lyrics- my favourite is the 'gone are the days of rainbows/and gone are the nights of swinging from the stars'  \t\t\t\t\n\t\t\t\t\n\n"}