{"comment_0": "\nI think this song is about growing up and realizing that you are human and that you don't quite live up to the ideals that society tells you you should. For example, society tells you \"Don't care what other people think!\" I think this song references that by saying \"My names Blurryface and I care what you think.\" Plus I think Blurryface refers to the fact that he doesn't feel like he is just one person to the world. He is different things to different people, which goes against another rule that society imposes on us which is to have integrity is to be the same to all people.\n\nI think he goes on to reminisce about life when he was younger and life was simpler. You could say \"I don't care what anyone thinks of me!\" and be unique and thrive off of that. As you get older you realize that you can't be so headstrong all the time, because we are just human after all. We care what other people think because we can't always be Superman all the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe actual meaning of this song is that he simly wants to turn back time to the good old days. He misses his childhood and how easy life was back then.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThat bit about catching a whiff of a certain smell sending you back to when you were young . . . Gods, I always thought for some reason that I was the only one who did that. It's always there and then gone again, so quickly that I can never even identify what it is, or where it's coming from, and I don't think it's even really a smell so much as a memory of a smell, because I've found that sometimes I can catch a whiff of it when I play certain music ( Genesis, for some reason, brings it up frequently, as does Rush on occasion, and certain Springsteen songs, and sometimes Paul Simon ), but I tell ya, if someone could find that smell and turn it into a scented candle? I'd probably go broke. \n\nY'know, it's funny, I'm not a big fan of this band, but this one song? Just that one little line took it from being just an OK little ditty that I wouldn't seek out, but wouldn't necessarily change the stereo if it came on, and turned it into one of my favourite newer songs on the radio.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song is SO powerful. WISH WEWish we could turn back time, to the good old days\nWhen our momma sang us to sleep but now weâ\u0080\u0099re stressed out\nWish we could turn back time, to the good old days\nWhen our momma sang us to sleep but now weâ\u0080\u0099re stressed out\nthat power oh. and thenUsed to play pretend, used to play pretend, bunny\nWe used to play pretend, wake up, you need the money\nUsed to play pretend, used to play pretend, bunny\nWe used to play pretend, wake up, you need the money\nWe used to play pretend, give each other different names\nWe would build a rocket ship and then weâ\u0080\u0099d fly it far away\nUsed to dream of outer space but now theyâ\u0080\u0099re laughing at our face\nSaying, \"Wake up, you need to make money\"\nYeah. YEAH that is just pure beauty!!! I look back on my childhood and just cry. I was a foster child. I was adopted at seven after being sexually abused from my father. he was good but then mom left when i was 5 and bam when i was 6 he changed to a whole other person. then i was taken away at 1:30 one morning wearing only a t-shirt and a pair of barbie PJ pants. I was given to a family who showed me what I should be like but I missed out on a major part of my childhood. And even though I cant I wish i could turn back time, to the good old days when our mother sang us to sleep but now were stressed out.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nOk I feel like\n\"my names blurryface and i care what you think'\nmeans a inward demon, obviously. But he cares what you think because he doesnt want you to see the horrors of the outside world, he blurs you out with emotion so you dont get hurt my society\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis is the \"Slow Town\" of Blurryface\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIm 14 and my life is already stressful and crappy. Are they saying it just gets worse?! \r\nAnyway, awesome song! Twenty one pilots rule!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nwikipedia.org says that it's about the harsh end of adolescence and the transition to adulthood.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI like to focus on the blurryface mention, my names blurryfsce and I care wat you think, blurry face to me means the people who are quiet. And you forget their faces easily or don't see them at all, sometimes (often) people make fun of the blurryfaces of the world. I think it means what you say hurts me cuz I care wat you think. The red has been covered well by u guys\n\n\n", "comment_9": "\nDeep yet simple song about the loss of carefree innocent days of youth and the transition to the stresses and complexities of being an adult in our modern world.  I heard this song on the way in to work this morning and the repeated lyric \"Wake up, you need to make money\" was practically taunting me.  That's when you know someone has written a song that's pretty real.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI feel like this song is self explanatory. But, the way I see it is how young people deal with the pressure to the 'real' world and growing up. In an interview once, Tyler actually said this song was originally about one of his brother's and Tyler as kids!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThe lyrics say that he wishes he could go back to when he was a young child. Back when he wasn't stressed about the stuff that you have to worry about when you enter adulthood.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song brings out nostalgic feeelings and you cant help but think of your childhood and all you did. Now you are grown up and long gone is the carefree feeling you always had, when you wanted to be tucked in bed and have big dreams. You are now grown up and you realise the difference between your adulthood and childhood. As an adult you are coped up by the different stresses of growing up. As a child you have fears and you are told that as you grow up all those fears will fade but it turns out differently, they turn into insecurities. \n     In the song it talks about how they used to play pretend and dream of  building rockets and flying very far away and now people people laughing at their faces telling them to wake up and they need to make money. This makes me think that as a child all you do is dream unrealisticand childish  stuff and you are not aware of the pressure being put on adults to go out and make money.  \n  In the song the writer wishes that he could go to the good old days of childhood where their mommas sang them to sleep. the writer talks about smelling things  and the smell takes him to his child hood but he dosen't quite remember hwere it comes from. H e says he'd make a candle out of it and never sell it. He'd give it to his brother because the have the same nose. The same nose expression may tell us that the writer and his bother have had the same childhood and have experienced the same things. \nAll in all this song reminds me of my childhood. It shows me the stark difference between my childhood and adulthood. The struggles are different and as we grow up we become less scared and more insecure. I also feel like I'd give anything to go back to my childhood and experince it all over agian due to the fact that grown up life seems hard and all people think about is succeeding and putting on pressure on themselves and otherss to go out and make money.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song is about growing up and realizing that as you get older life becomes more stressful.\n\n\tIn the opening he talks about how he wishes things were different.He says he wishes he could change the way he sounds and that he wishes he didn't always have to rhyme when he sings. The listener could compare wanting to break the rules of song writing to wanting to break the rules of everyday life. There are might be times when you want to go against what would be considered normal and just be yourself, but you can't and you just end up putting your head down and pretending to someone else. This idea gets talked about even more in the song when he says, \"My name's Blurryface and I care what you think.\" The phrase \"Blurryface\" could have some different meanings but I interpreted it as someone without a true identity. They're stuck between being who they want to be, and being who society says they're supposed to be.\n\n\tAs the song progresses he starts to talk more about his childhood;\"Wish we could turn back time, to the good old days.\"  This line gets the point across that the stress is getting to him and that he wishes he could go back to a more simple time in his life. He continues with,\"When our momma sang us to sleep but now weâ\u0080\u0099re stressed out,\" this line is him saying even though he has grown up, he is still a human. Everybody, no matter how old, needs love in there life.\n\n\tThe song repeats the chorus a total of 3 times. In between the choruses, the verses continue to talk about the stress he feels as an adult  and how he wishes he could go back to a simpler time without all the responsibility. \n\n\tOverall, I would say this is a song that we could all relate to. Even though I'm not an adult yet, I'm already feeling more and more stressed as the years go by. There are some times when I also wish I could go back to my days of being a little kid.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nNot hating on the song or anything but this is boring sad and scary\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI like this song about growing up and don't quite what your doing \t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI swear they are saying, \"Wish we could turn back time, to the good dope days.\"  I do not hear good \"old\" days.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nForget the lyrics. Why did he have red creepy demonic looking eyes at the end of the video? I don't like getting creeped out, and I don't listen to bands who do that to me. \t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI don't care for the band, I'm probably too old for this style to gel with me- I grew up with 60's, 70's and early 80's hard rock and metal, and as a guitar player I have a deep love for the blues. The song lyrics are powerful, however- if you have never heard it, try the partial cover/mashup of this song by The Marty Ray Project, on youtube.\n\nyoutube.com/…\n\nHe takes these powerful lyrics and turns them into a blues song that will rip your face off..it's a mashup of Bill Withers' \"Ain't No Sunshine\" and this song, and somehow it works, really well- although I love the way he sings this song, and would kill to hear the entire thing on its own.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nMy thoughts are just that Tyler is addressing how when we were young things were easier and we did not have the surprisingly huge amount of adult worries we do. His stress could be seen when he opens with insecurities about the music he is making. Then he addresses how when he is hit with nostalgia he is just reminded that between 'student loans' and 'tee houses' we would want the childhood life. The rocket ship part is just showing how we are constantly reminded that we have to be self sufficient above all else. And I think he uses the deep voice (I think it is supposed to be blurry face?) to help the lyrics really sink in\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI think that in the first stanza it's talking about how hard it is to create music and be recognized by people as a musician.\nIn the second stanza I think parents would be the ones telling us that our fears would shrink to boost our confidence as kids, but then it goes on to the present time of how we grow insecure when our views change in the world.\nWhen he calls himself 'Blurryface' in the song I interpret it as him saying how no matter how much of a legacy he leaves, people start to forget and things start to get blurry.  Then when he goes on, he's referencing how we're still human and no matter how pointless it seems, we still care what people say and think of us, making us want to prove something to people.\nIn the chorus t's talking about how he wants to go back to when everything was cheerful and our moms watched over us, but then he goes back to present time and how we're stressed out.\nThen it goes on to where he has nostalgia when it comes to a certain thing, but he's forgotten where that memory came from.  He also says that he'd make a 'candle' which, to me, means that he wants to hold on to that feeling, making it last for as long as it can.  He would sell these 'candles' so other people could experience the same feeling that makes himself so happy.\nSince his brother grew up with him they have the same experiences, or 'noses'.  It goes on to referencing that same nostalgic feeling, reminding them of their childhood 'when nothing really mattered'.  Then it compares student loans to tree houses and how we would choose tree houses.  Student loans representing our responsibilities while tree houses represent our childhood fun.\nWhen it comes to the bridge, he's talking about our childhood again and how we would pretend to be other people, such as being astronauts in a rocket ship.  Then 'outer space' would represent our dreams as individuals, and the 'they' he's talking about would be the people who don't think we can achieve our dreams.  When 'they' say we need to make money, I think of the economy and how humans use money to 'make the world go 'round'.\nThen when the bridge is extended and he says 'you need the money', he expresses our own greed that everyone experiences.\n\nBut yeah, this is only my interpretation...  What's yours?\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI hope my son isnâ\u0080\u0099t right. He told me when he was 15 that â\u0080\u0098blurry faceâ\u0080\u0099 is the name of a drug and this song is about being high to get over stress and wishing he could go back to time before drugs. I wanted to look for other reasons. I like this song. Do keep in mind, my son is is career oriented for living a Navy life and has not done drugs. He simply thinks that is the meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nthis is one of my favorite songs\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nThis song is about the rude awakening of growing up and realizing that after your parents took care of all your monetary needs during your childhood, you are now on your own and have to find a way to support yourself.\t\t\t\t\n\t\t\t\t\n\n"}