{"comment_0": "\nthis is sad..im not really a justin bieber fan, \r\nbut some of his songs are good,\r\nto me this song means, there relationship would be frowned upon by there friends, family, peers, but they had such strong feelings for each other. they broke up or whatever , but they still love each other very much, but they cant be together like said in the line, \"like adam & eve, tradgey was our destiny\" , \r\neverything they had is stuck in the moment, meaning...he still thinks of her & the memories they had, hes still living in that moment but doesnt know whether to let go of her or not.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nInstead of that straight forward relationship business, where it's frowned upon.\r\nI see it to be as Justin is already in a relationship with somebody, but has fell in love with this girl he is describing. \n\r\nHere I believe he's realising that it's wrong what he's doing saying:\r\n\"You and I both know it can't work, It's all fun and games till, someone gets hurt, and I don't,\r\nI won't let that be you.\r\nI think he's saying that he loves having her to be with and spend time with but doesn't want her to get hurt at the end of it all.\n\r\nBut later in the song it's revealed she's becomed attatched to him and shares similar feelings for him:\r\nNow you don't wanna let go, and I don't wanna let you know, that there might be something real between us two, who knew?\r\nRealising that they've both fallen for eachother...\n\r\nHere I believe that Beiber is saying how reckless it is to fall in love with someone else:\r\nNow we don't wanna fall but, we're tripping in our hearts and it's reckless and clumsy, cause I know you can't love me.\r\nSaying she can't be with him becuase he's already with someone, most likely regretting kidding themselves in the first place - 'wreckless and clumsy'.\n\r\nThis continues throughout the song, I think it's him wishing he could have been with her.\r\nI wish we had another time, I wish we had another place, cause everything we did and everything we have\r\nIs stuck in the moment.\r\nI think that's bascially saying that if he wasn't taken, and had the same situation, just in 'another time and another place', things would have worked out for them. But they're just stuck living in this world of theirs and are relluctant to let what they shared go.\n\r\nJust my two cents anyway, it's how it related to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think he saying that everyone is against their relationship but he still wants to be with her\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI love this song!! This is me & my boyfriends song we both love this!!:)\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ni agree with babygirl90 \r\nTheir relationship wasnt meant to work but he still wishes they could be stuck in the moment with her.\r\nLuvv this song :)\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nthis is exactly what im LIVING right now! im soo in love with my boyfriend, but society is telling us that we can't be together because of our ages...so we were FORCED to break up but we cnt let go of eachother bcuz it would be too painful && we dnt want to wonder if what we had was real wen we look backk on everything! so we r jus staying put bcuz we dont want to lose out on our potential FOREVER!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nwith this song....i wasn't just stumbling upon it and found it and then thought...\"wow! I can really relate to this song. I love it\"\r\nno. a crush from a different town had told me to listen to this song because it described his feelings better than the way he could....but basically after i listened to it (and loved it) he said that he fell in love with me when we were together and when we went back to our own towns, all he could do was reminisce..if i spelled that right. he wished we could see each other again. but he said it wouldn't be the same because things had changed.....all of his friends thought i was just another girl to deflower and then he would move on...but he didn't want to cause me the embarrassment or hassle of trying to make something work because he liked me and he didn't want me to get hurt.  so he basically cut off all contact with me....but he mailed me a letter the other day saying....\"I'm still stuck in the moment with you\" \r\n<3\r\nso yeah, this song is on my daily playlist :)\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nSo.. my, now, ex girlfriend broke up with me for a week ago. And she sheared this song on facebook. I ofc listened to it and I can agree with you guys what it could mean. But my question is.. is there still a shot for me? Or is it REALLY over? What do you think of that?\r\nPlease, comment. And sorry for bad english!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis is about a taboo relationship ... a cousin? ....a sister? Some intimate relation had to certainly occur as he pines to relive it in another place and time where it is possible. Conventional society is clearly against it.\n\nI don't know if this song is about Justin as I noticed that it is multi-credited: Jonathan James Yip, Jeremy L Reeves, Ray Romulus, and Justin Bieber. It could be about something of any of these contributors.\n\nI mentioned family taboos because they seem to be the most extreme that today's society would still most frown upon. If it is less severe, it is possible that it is anything from a secret gay relationship to some unacceptable relation between people of different races or religions or social backgrounds. I also mentioned the family thing because I can relate personally!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nIt's about a fan. not his sister, not a cousin A FAN. Jesus..\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nFrom my understanding, stuck in the moment is about him and a girl falling in love, but the girl is in a relationship. When he talks about 'you don't want to let go and i dont want to let you know that there might be something real between us two' this means that she doesn't want to let go of her relationship and he's trying to hold back from telling her that they are actually both in love. \nWhen he says 'Bonnie and Clyde never had to hide like we do, we do' this also suggests that they are hiding from another boyfriend or girlfriend.\nWhen he sings 'because i know you can't love me here' he is saying that the girl cannot love him at this point in time, this leaves possibility for the future though, so she may already have a boyfriend.\n\"I wish we had another time, i wish we had another place,cos everything we have is stuck in the moment\" this indicates that there love is stuck right now, and can't work, but later on in another time it could work, this also indicates she may be in a relationship at this time and place.\n' i dont wanna be so old and grey' indicates that there relationship would work later on, once the girl isn't taken. I think it means the girl is in a relationship because Justin seems quite happy for the relationship to work and start, but she 'doesn't want to let go'\n\nI understand it because I've been in the same position. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI was a \"loser\" to the others and he was a popular person and we liked each other but he didn't want to be with me because he knew that I would get hurt by the other people because I don't fit in with them so we just keep thinking back to the times that we had together that we were so close to being in a relationship. now in September I changed schools and I don't see him anymore but I'm changing back next year so I wonder what will happen when we're going to see each other again\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthis is all over just a deep meaningful beautiful song \n\r\nthis song is about two people who love each other so much, although it's not the right time and place to be together \r\nmeaning; people/friends/family don't support it or they know that at this point they're going to end up hurting each other and that's something they both don't want \r\nbut they're too inlove with one another to let go \r\nthey simply just can't go without one another and want to continue their relationship even though they know in the end it's not going to work out because they're too foolish and selfish to stop the relationship before someone gets truly hurt\t\t\t\t\n\t\t\t\t\n\n"}