{"comment_0": "\nShe's reminiscing about a love that she had during the time and it brings her \"summertime sadness.\" \n\r\nThis person is someone who made her feel electric, alive, and in love. She feels so invincible with this person that she could die and still be happy. Thinking about how much she loved this person and how this person may have been the best person she's ever been with, it brings her sadness. \"Even if you're gone, I'm going to drive.\" Yes, this person isn't a part of her life anymore, but she relives her relationship with him by driving down memory lane.\n\r\nDoes anyone else hear \"I think I'll miss you forever like the stars miss the sun in the morning skies\"? That makes more sense to me than \"I think I'll love you forever.\" \r\n\"I think I'll miss you forever\r\nLike the stars miss the sun in the morning sky.\r\nLate is better than never.\r\nEven if you're gone, I'm gonna drive.\"\r\nThis is my favorite part of the song. It's as if she finally realized how much she's going to miss this person and has finally told them her true feelings. Even though he's gone, she's going to remember and honor how wonderful this time period of her life was. Beautiful...\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nNice. Everybody is so focused in partnership love.\n\r\nI actually watched a Video, where there was a girl involved, not a guy. Though even before that I already thought it might be someone like a sister, someone who's not completing Lana like a partner would, but is/was exactly like her, a real soulmate. It seems, the sister wanted to suicide, and though Lana didn't, they understood each other enough, that Lana didn't want to stop her, just make sure she says goodbye.\n\r\nNow when she's gone, Lana keeps doing everything they might have done together (partys, cars, what young girls can do), like in a trance, so she won't break down over her death, still feeling everything they felt together, but also (summertime) sadness and emptiness. And now she's not scared to die anymore, though she moves on. A little bit of an empty shell.\n\r\nIrritating might be the \"kiss me hard\" part, though girls/sisters can kiss without beeing lesbian, too. On the cheeks, or it might be a greeting or some sort of code...\n\r\nBesides: sisterhood might be much stronger. Usually the most people fall in love, lose the loved (without them dying), fall in love with someone else, lose them, fall in love again... but a sister you can lose only once (more or less).\n\r\nAnyway... just my thoughts...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI think this is her reliving some sort of fast-paced, almost destructive relationship with a guy. You know, one of those \"I'm deeply, dramatically in love with you, I'll die without you\" kind of things that almost every girl has at one point. And now, she's looking back with melancholy nostalgia, because it was passionate and dramatic and beautiful, but also not meant to last. The whole summertime sadness is the beauty of this ephemeral relationship that ended too fast, and can never be recovered.\n\r\n\"Oh, my God, I feel it in the air\r\nTelephone wires above all sizzlin' like your stare\r\nHoney I'm on fire I feel it everywhere\r\nNothing scares me anymore\"\n\r\nHere she's remembering it, and feels like she's so much more wise and experienced from this.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nTotal obsessional love, the Lana Del Rey all-in masochistic approach to relationships.\n\r\nHer guy leaves her as the Summer begins. Since she's addicted to him like a drug, her Summer (which should be a good time of year) isn't. She sings \"I think I'll miss you forever.\" She will never get over him. With him, she could die happy. Without him, she just wants to die. That's her summertime sadness.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThere is only one thing that I can think of that is inherently and characteristically sad about summer & that is the fact that it has to end/is temporary. It seems like Lana is singing about something that is happening and she knows its great and enjoying every bit of it that she can, but she also knows that it has to end eventually & how much she will miss it once it's gone.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nShe has lost someone dear to her.  A lover, I think, because of the line, \"kiss me hard before you go.\"  This *could* be directed at a close female friend or sister or other family member but to me the line is more passionate and sexual than that.  I hug my little sister hard when I'm not going to see her for a while.  I kiss my lover goodbye.\n\r\nShe feels his presence this summer, as she does every summer because it is the season in which he died.  The elements remind her of him and freshen her fading memories.  It could be his spirit or wishful thinking but it's all the same to her.  It's been a while since she lost him.  She misses him madly and is somewhat happy just to feel him around.  Which is why she tells him, \"Kiss me hard before you go.\"  She knows when the summer ends she will have to go back to trying to live without him, instead of just letting the depression consume her as she does at this time of the year.  I think it is this idea that inspires her to commit suicide in the first place.  She can't bear the thought of going back to trying to forget him.\n\r\nOh, my God, I feel it in the air\r\nTelephone wires above all sizzling like your stare\r\nHoney I'm on fire I feel it everywhere\r\nNothing scares me anymore\n\r\nShe feels his intense gaze on her (\"sizzling like your stare\") as she she dolls herself up for the occasion.  She is sort of delirious and euphoric at the idea of being reunited with her lover in the afterlife.  She feels \"alive\" and \"on fire.\" She feels this energy \"in the air\" and all around her.    She's not afraid.  Nothing could ever hurt her worse than losing him did.\n\r\n\"Cruising down the coast goin' 'bout 99\r\nGot my bad baby by my heavenly side\r\nI know if I go, I'll die happy tonight\"\n\r\nShe senses him in the passenger seat as she speeds down the road and this gives her confidence.  If her suicide attempt is successful, she knows she will die happy.\n\r\n\"I think I'll miss you forever\r\nLike the stars miss the sun in the morning skies\r\nLate is better than never\r\nEven if you're gone I'm gonna drive, drive\"\n\r\nIt has been so long and she still misses him deeply.  Because it doesn't hurt any less now than it ever did she thinks it won't ever get any better.  She considers the possibility that they may never be together again.  They are so close, yet so far.  She's a bird who is in love with a fish.  She doesn't care.  Even if he really is lost to her forever she would rather bet her life on the chance of being with him again than go on without him.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nWe've all had the too good to be true type feeling. While it's happening, it's already beginning to dissipate. The excitement which overcomes us, triggers the fear that over take us. Whether it's a passionate summer fling that burned quickly or a long lasting relationship that started on fire but never really quite caught on. Either way, the chemistry seems to be unmatched by any other flame that's lit or died out.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI've listened to the song and watched the video quite a few times. So, I think that this song is about moving on from an ex-boyfriend/girlfriend who has passed away, maybe unexpectedly. Lana sings that she's sad he/she died, but she is trying to move on, even though she will always miss him/her. Kinda like the Power of Goodbye by Madonna. She tries to kiss goodbye the summertime sadness that his/her death brought her. \n\nI think the \"drive\" part could be about moving on, but also, like Lahhva said, could be about reminiscing on their time together and celebrate their past relationship. Have no regrets and only remember the best. \n\nThe video is interesting, because it is quite literal to the song, except that the roles are reversed and the ending is not so positive. Lana (I'll use the actors' names) is the one dying by committing suicide. Jaime King is wearing the red dress and drives a car with her bad baby (i.e. Lana) on her heavenly side. However, unlike in the song, Jaime fails to move on and commits suicide. \n\nFinally, I find it interesting that the girls don't end up together in heaven. I think it means that the relationship was passionate love - that is, it was a summer love more than anything. It was not going to last a lifetime anyway. In short, they were not soul mates, but they had fun for a short period of time. In the song, Lana embraces that part of her life before embarking on another chapter. \n\nAnyway, that's my interpretation. Great song and video!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nIn two different articles and Wikipedia, they're described as lesbian lovers in the music video. I took it as though they were lovers, it just had that kind of feel to the video with certain shots of them together in romantic ways. If some of you are refusing they're lesbians because you're biggots, then fuck off with your stupidity.The rest of you that refuse they're not lesbian lovers, just passionate about eachother, could be. Maybe the articles are wrong, who knows.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nIt is 'sizzling like a snare' as in a snare drum.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song is about missing a truly great love who passed away unexpectedly. These feelings are even more prominent in the summer cause that's when he died. Its also about her trying to kill herself cause she can't live with that sadness. So she puts on her red dress, does up her hair (looking her best for their reunion) and is driving hard (I'm guessing that's how he went out too). Where she says \"got my bad baby by my heavenly side\" she's imagining him beside her staring at her, almost like he's waiting for her \"blissful\" death to be with him (my sis says she thinks she's stoned lol)\r\nMy take on it: its a beautiful song about painful nostalgia and suicide.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ncrying so hard rn, lana del crey, etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nFor the meaning of \"Summertime Sadness,\" I think it's not completely about a boy. I think that she has actually diagnosed herself as having a case of \"Summertime Sadness\" and someone or something has made her realize that she should be happy to be alive and so she tells \"Summertime Sadness\" to kiss her hard before it leaves her forever. Maybe the boy who's in the car with her is responsible for allowing her to come out of her shell of sadness. She also lets \"Summertime Sadness\" know that it was the best for her because if she had never gone through all of her sadness, then she wouldn't have come out of it a lot more daring and stronger than ever.\n\r\n\"I think I'll love you forever like the stars miss the sun in the morning skies.\"\r\n\"Late is better than never.\" \"Even if I'm gone I'm gonna drive.\"\n\r\n^I think at that point, you can clearly see where I'm coming from. She said that late is better than never, meaning that even though she knows that some people get over things pretty quickly, for some it's not so easy and it takes a little longer. She just happened to be one of the people who took a little longer, but at least she got over her sadness and she happily asserts her new positive outlook on life by saying that even if she's gone, she's still going to drive.\n\r\nIn closing, I'll also like to say that in my own personal opinion, this song also inspires spontaneity. I am a boy, but maybe I'll put on a red dress without any high heels on a wear my hair in \"big beauty queen style.\" Just kidding, but my point is that it makes me want to step out of my comfort zone sometimes.\n\r\nWith the western flare that this song has, I envision myself on a highway with someone I love with this song blasting from the open windows of my car while strong winds embrace us.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nHaha I hear \"sizzling like a snail\". Neither snare nor snail make a whole lot of sense, but I've got this image fixed in my head of a snail frying under the rays of a baking noon-time sun. Which is sit??\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nMost people interpret this song as a love song, like a lover being far away from her or something or a break up.But This song is actually about her best friend who committed suicide.\n\r\n \"Kiss me hard before you go, summertime sadness. I just wanted you to know, that baby you're the best.\" Girls especially show their love for their best friends in numerous ways. Just because she says \"kiss\" doesn't mean it's a guy. It's like when close friends greet each other they kiss each other on the cheeks and hug,etc. So she's saying how she wants to see her best friend one last time to tell her how much she meant to her and how much she loves her. \n\r\n\"Nothing scares me anymore.\" I feel like she's saying that when her best friend passed it was it was the worst thing to ever happen to her and how nothing else can compare to it.\n\r\n\"I'm feeling electric tonight, cruising down the coast going 'bout 99. Got my bad baby by my heavenly side, I know if I go I'll die happy tonight.\" Honestly I'm not really sure about this part but I thinks she's either talking about the memories she's had with her best friend or that she's trying to commit suicide as well to try to be with her best friend again, hence \"I'll die happy tonight.\".\n\r\n\"I think I'll miss you forever, like the stars miss the sun in the morning skies.\"\r\nI think she meant that she misses her best friend but will never see her again because she belongs to the sun, and Lana will always be a star. The sun also once started out as a star, but now has become a bigger entity. This shows how her best friend was once with her but she either died or moved on, intent on not giving her a second chance.\n\r\n\"Late is better than never, even if you're gone I'm gonna drive.\"\r\nShe's saying how even though she killed herself she happy with all the memories they had together and all the times she got to be with her. When she says that she's gonna drive I think she means that she's gonna try to move on from the past.\n\r\nThis is just what I think tho..\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nMy thoughts are that the boy and girl (Lana Del Ray and ___) had a summertime relationship, but then the boy has to leave when summer ends, and the girl has to learn to cope and learn to love again after he leaves. (Ex: Kiss me hard before you go)\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis is one of my favorite one from all of Lana Del Ray's song. I remember listening to this song sometime last year, playing it over and over again and feeling that kind of summertime sadness in me. \n\nI think the song is about saying goodbye to someone, letting go of someone special to you, but instead of being sad about it, you see the good thing about the relationship and how it made you a better person. It's a beautiful song, a reminder of how we should see goodbyes in a different light. For me it was one of those things that I always try and find every time something good has to end, it's hard for me to let people go but at the same time, it's just one of those things that need to happen. \n\nI love the fact that she used summertime to describe the kind of sadness that she's feeling. It gives the song a more positive sound. During summer seasons, people are more likely to be happier, with the sun shining out every morning, you can't help but just smile to it as it represents another day of sunshine in your life.  It's like the idea of â\u0080\u009cit was good while it lastedâ\u0080\u009d, and the acceptance that you have to just let it go and be happy about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nSome lyrics are never quite understood as writers can have mixed emotions. \r\nMy interpretation is mixed. Some say suicidal lyrics,. Some say a summertime lover,. Ex partner. At first I believed it was a suicidal sadness song. But, I'm in 2 minds about it now.\r\nAfter the song was released people close to producing with Lana stated the album was about her boyfriend that died 2 years earlier before the album was written. 'Born To Die'\n\r\nKiss me hard before you go, summertime sadness. \r\nInterp: that summer was her ultimate and untimely sadness. Kiss me hard before you go,. She knew deep down without her approval,.someone was about to make a permanent exit in her life.\r\nI just wanted you to know,. That baby you were the best.\r\nInt: her deepest thoughts on that person who was her baby...needed to know they were the best her one true love.\r\nRed dress on- oh my god I feel it everywhere.\r\nInt: Lana is happy and about to party or has just come home from one,. Maybe even high...She is in bliss. Until she feels a state of sudden anxiety,. And her intuition is telling her something has.. Gone. \r\nTelephone lines above-nothing scares me anymore.\r\nInt: wherever she was at the time,. She was unreachable on her telephone,.  and perhaps friends or family passed on the news... And the lines were sizzling like a snare. \r\nHoney I'm on fire,. I feel it everywhere.. nothing scares me anymore.\r\nInt: she feels a sudden rage of passion, denial,.shock,.anger,. Agony, grief,. And then decides that nothing can ever hurt her worse than the pain she felt when that person left her.\n\r\nI'm feeling electric tonight- oh my god I feel it everywhere.\r\nInt: Lana is reminiscing or even perhaps dreaming/remembering a moment most fondest to her which she shared with her 'bad baby by her heavenly side'  together 'cruising down the coast ,. Doin bout 99' when she felt most alive and happy. Which only reverts back to a shattered reality because it is summertime again and he is but a memory and it lingers on and will remind her off loss every summertime which has become her own 'Summertime Sadness' as she sings,. 'Got that summertime,. Summertime sadness'... As if it's no surprise to her or others around her.. It's a given that she will mourn each summer for him.\n\n\r\nThink I'll miss you forever-even if you're gone I'm gonna drive.\r\nInt: It's no doubt Lana feels a loss. Music suddenly intensifies. Lana's voice heightens. Her emotions voice an angelic message to her loved one.\r\nThe stars never see the Sun, they are in the same sky but will remain separate forever. It's of great pain to Lana that that is how her sorrow is beautifully described.\r\nLate is better than never:\r\nFinally letting go of the pain is better late than never letting go of the pain at all .. Perhaps it was more than a few summertimes of heartache before Lana could even attempt to try and say goodbye to her true love.\n\r\nEven if you're gone I'm gonna drive.\r\nInt: This could be interpreted many ways.\r\nBut I assume that Lana has decided to come to terms with the grief and loss the best way she can and decides she will go on and succeed in her life and dreams and musical talent,. Which was more than likely discussed many times with her lost loved one. \r\nThe chorus again comes in.\r\nLana wants one final hard kiss goodbye to the hurtful memory and agony of her lost love she refers to as her Summertime Sadness. The love was her best., And is never forgotten each summer.\n\n\n", "comment_18": "\nI think its actually about missing the summertime.. not a guy, sure a guy is mentioned but i think its souly about summertime ending?\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI like the song. For me, I hear a goodbye to sadness and a hello to fun times. I don't think it has anything to do with a relationship, other than one with her/himself. The warmth, energy, and activites of summer (often hampered by climate in most states) have a way of making us feel higher than usual. Nothing like being able to be outside with the sun shining on your face as you sip a margarita and listen to music surrounded by fun people. Can't always do that yearround...\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nOur class discussed this one, and bassically what we came up with was that there were two lovers, and they were made fun of because of their sexaulity, and then one of them suicided, which made the other one kill herself. Realy depressing actually. But our reason for desiding this is that the video is bassically two girls acting like they are in love and one of them dies, then the voice switches over to the other girl and the video shows her being haunted by the memory of her dead lover, and then she kills herself to be with her.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nAfter watching the music video, I felt this song was about two very close friends but when considering the lyrics as well the song feels like its about a lesbian couple. Throughout the video Lana has a very eerie and pale ghostly image. As she jumps off a cliff at the beginning of the video, I believe what we see of her in the video is the spirit and memories of Lana haunting the woman in the video, their good times together and all that. I'm sure that without the video the lyrics are less specific and may not have originally been written about a lesbian couple. Who knows! Great thing about lyrics is they're often so open to interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nBased on the video, it seems like a lot of people think it has something to do with a lesbian relationship between Lana and the other girl. The lyrics and the video could be interpreted in different ways. That's why I love this song. It has a lot of mystery and ways you can interpret it. \n\nFrom what I personally interpret, it sounds like it's about suicide. She already knows the girl is contemplating suicide, and Lana isn't necessarily talking her out of it, but reminding the girl of what she felt about her before she committed suicide. It could be really hard to guess what the real meaning is, but you can relate it to suicide an awful lot. I've been hearing so much suicide this year, and it's sad. I do wish people who commit suicide knew they were loved and there are people who thought a lot about them. No matter what, someone still thinks of you, before and after your dead.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI think this song is about a feeling or a 'mixed state'.  I've been diagnosed with bipolar and I'm quite accustomed to this state.  Summertime usually represents a hot time and in life it relates to a time of sexuality, though with bipolar this state can be mixed with a sort of intense sadness and melancholia which can almost 'heighten' the experience; it's a sort of euphoria, hence she states about it that at  least she'll die happy tonight\".  Some of this 'euphoria' comes a sense ( especially after the challenges that come with this state) that nothing really scares her anymore; a state of fearlessness!\n\n\n", "comment_24": "\nI think its a song about tripping on LSD with her lover. All of her senses are magnified, she describes her experiences as being in a heightened state. She has feelings of euphoria, \"feeling alive,\" The verse:\n\r\n Oh, my God, I feel it in the air\r\nTelephone wires above all sizzlin' like your stare\r\nHoney I'm on fire I feel it everywhere\r\nNothing scares me anymore\n\r\nAll feelings someone would feel while tripping on LSD. The other lyrics are about her obvious love for her partner (male/female?), and how she wouldn't mind dying by his/her side. As for the title \"Summertime Sadness,\" perhaps shes coming down from the trip with her lover and is feeling regretful. Or perhaps she realizes it won't last since its a \"summer\" love. The sadness bit is a tough lyric to figure out. This might sound like a crazy explanation but its just how I see it.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nLana is kissing goodbye \"the best\" she ever had. She has to move on and this brings her sadness. For whatever reason, she still remains the one person that's hung up on love, and this might be unrequited love, forbidden love, impossible love or her love is moving away and or leaving for unknown circumstances. The red dress could be an indicative that she is still \"dressed up with passion\", meaning her feelings for this person are still alive and they are tormenting her in a good way. Regardless, she still wants to have a little bit more; maybe because when you are captured by such passion, you just can't have enough.\n\r\nPretty sexy and sensual way to say, I miss you, I still want you, I know you are leaving, I'll carry on but I can't forget you. \n\r\nMy ex played the video for me two nights ago. While I was watching this on his phone, he was standing sorta beside me/behind me. I felt his breathing getting heavy as well as that burning sensation that was consuming him. I know he wants more, but he feels like he can't just say it. So he sends me song lyrics. He is all I ever wanted and more. I hope one day we can be on different circumstances where we can get back on that amazing chemistry that always takes over when we are less than a feet from one another.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nIt's evidently about her bein sad in the summertime duhhhhh\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis sounds to me like a song about not wanting summer to end, wanting to stay in the moment of summer with a love forever. I can imagine this being a way of saying goodbye to the good things the summer brought, and acknowledging the pain of it all as well as the fact that you will have to move on.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI feel like this is a 'farewell' song. She is telling the person she loves goodbye. She has to let go of them; and even though it will hurt, she has to do it anyways. It makes her sad; but it's the right think to do. \"I'm feelin' electric tonight, cruisin' down the coast, goin' 'bout 99. Got my bad baby by my heavenly side; I know if I go, I'll die happy tonight.\" She knows he has to go, but she can enjoy the good while it lasts.\"Think I'll miss you forever, like stars miss the sun in the morning sky. Later's better than never\" She will miss this person greatly but she must let go and I think 'later's better than never' she means; I'll see you later on, even if it seems hard, at least it'll be later on in life. In the video, both girls allow themselves to fall from great heights, almost like they believe they'll meet in a different place later on if they do so, they can be together.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nOk, I watched the video this is my interpretation of the whole thing. What if, Lana Del Rey was the one who committed suicide first. The entire video is a recollection of jamie king sadly remembering the beautiful memories she had with her lover/friend etc. Unable to take the sadness anymore thats when jamie king commits suicide. Because the entire time Lana walks as if in a ghostly shroud.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI think many people here have the understanding that this song is about a lost love. While I agree with this I think that the lost love isn't a person but ALCOHOL. How she loved drinking, became an alcoholic and eventually quit.\n\nEarly in the song she sings:\nOh, my God, I feel it in the air \n    -- She feels the warm embrace of a drink start to take hold and puts her into a party mood\nTelephone wires above all sizzlin' like your stare \n    -- The drink makes her call up friends \nHoney I'm on fire I feel it everywhere \n    -- Getting more intoxicated she starts to feel alive\nNothing scares me anymore \n    -- With her inhibitions gone, nothing scares her\n\nLate in the song she sings:\nI think I'll miss you forever \n    -- She finds it hard to imagine a world without drinking\nLike the stars miss the sun in the morning skies \n    -- She feels drink makes her who she is\nLate is better than never \n    -- Its better to quit now rather than never\nEven if you're gone I'm gonna drive, drive \n    -- With alcohol gone, she's still going to try to enjoy life\n\nThe summer time sadness is thinking back to how happy she was with reminiscing with rose tinted glasses back in those crazy drunken summers.\n\nLana has talked about her alcohol problems as a younger woman often but i think this quote sums up the song\n\"Thinking about not drinking forever was very scary, but once I did it wasn't hard anymore because I had all of these miracles happen that let me know I was on exactly the right path.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThis song is about her friend who committed suicide and how she found her. She says \"i've got my red dress on tonight\" but in the video she's wearing a white dress because the red symbolises how she was covered in her friend's blood.\n\n\"Oh my god i feel it in the air telephone wires above are sizzling like a snare honey im on fire i feel it everywhere nothing scares me anymore\"\nShe's talking about how even though her friend is gone she still feels her presence everywhere she goes making her not afraid of what's going to happen to her or her friend.\n\n\"'m feelin' electric tonight\nCruising down the coast goin' 'bout 99\nGot my bad baby by my heavenly side\nOh if I go, I'll die happy tonight\"\n\nLana is talking about how she started to live recklessly as her and her friend did if not more and she was saying she wasn't afraid of death because her friend is in the same place as she would be going.\nin the end lana is talking about even though her friend is not there to live rcklessly with her she's still going to live a crazy life as if her friend had never left.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nper the wiki page: A music video for the song features a lesbian couple, one played by Jaime King and the other played by Del Rey. As the storyline progresses, both characters commit suicide by jumping from perilous heights. \n\nthats what I had taken from this song, it's about a suicide. the whole summertime thing, isnt to be taken so literal.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nShe wrote the song after her friend committed suicide. That explains the video. The lyrics are trying to explain the thoughts of someone depressed and also the thoughts of Lana saying \"kiss me hard before you go\" meaning say goodbye before you leave. \t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nIf you actually study the song and research, it isn't about family, or friends. it's about two lesbian lovers, both resorting to suicide\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nShe say snare not stare, the guy is holding her not staring at her.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nTo me, I think this is about her saying goodbye to \"Summertime Sadness\". Maybe she was with a guy that broke her heart and at that time she was fragile and well... Sad! So i think she is just saying goodbye to that horrible time in her life. Now she feels alive. I love it when she says \"Got my bad baby on my heavenly side. Oh if I go, Ill die happy tonight.\" I think that shows that she has found someone new that she loves and now she is not afraid of death and she living her life to the fullest and telling \"Summertime Sadness\" to kiss her goodbye because now she feels better than ever!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI think that the song alone (I'm not talking about the video) is about a girl and a boy who met over the summer and the girl fell in love, but she knows that they won't be together because for some reason they're never going to see each other again and she feels like she can't go on living without him.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThis is just my opinion. She is remembering her past life which ended during the summertime by suicide. The first person (who died) is her life before, when she was also a woman, and it is like that woman is still with her. The second person is her today, reminiscing about the good times as if those memories are a tangible person. That life was full of beauty and tragedy, a raw deal in the end. The electric feeling is a realization, and \"Oh my God!\" is the feeling that overwhelms her when she realizes it. She consoles herself by remembering and that brings peace to her prior self. \"Kiss me hard\" and \"you're the best\" is a way of saying goodbye, a eulogy, something you say when you'll never see someone again. \"Nothing scares me anymore\" because she's been there, done that. I also feel that her entire body of work is based on this theme, portrayed very artistically from different points of view. If you watch her videos it isn't hard to figure out the time period.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nlesbians? really?? \nI think a lot of you are being too literal. Especially with the video.. \n\nThey are not lesbians, sorry to break it to you.\nthere is no evidence in the video linking them as a couple.\n\nAnyways, what i think the VIDEO is about:\n\nLana is most likely a ghost/angel/whatever, she jumped to her death, and now shes watching this random non lesbian girl jump to her's. you watch both of their lives flash before their eyes. This other girl obviously dies and you watch her turn into a ghost/angel/whatever also (she goes from wearing the red dress while alive, to wearing the white dress during all the smokey effects  after she jumps.)\n\nBut anyways, What I think the SONG is about is very simple-\n\n-instead of focusing on each and every single word, i think about the \"picture\" as a whole. obviously its about suicide, and love. \n\nsummertime sadness is just a phrase, a catchy phrase, that lana came up with, to sing a million times in the song. after all, thats what most songs are nowadays.. repetition.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI believe this song is about being sad in the summer time\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nWhat i took it as, Was when she says \"Kiss me before you go\" she was talking to her lover, and he was going off to the war or some conflict. And when she says shes feeling alive\" she is possibly high on something. When she says \"I just want you to know that you are the best\" shes talking to him spiritually. The same thing is seen in a sense when she says\" Driving down the coast goin bout 99, Got my bad baby by my heavenly side\" Means that he has died and that when she says that \"if I go I'll be happy tonight\" Indicating that if she does die going close to 100 mph she would be happy because she would be with her lover once again.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI think it's about a lost lover. Someone who has passed away. When she says 'Kiss me before you go' She wishes that they could say goodbye to her lost lover or she's saying goodbye to the people she's leaving behind when she goes to be with that lover. 'I'll dye happy tonight' She says because she is happy that she will soon be with her lost lover. When I say lost lover I mean passed away lover. 'I got my red dress on tonight' and 'got my hair up real big beauty queen star' means she has dressed up for her and her lover's meeting in heaven. It's about suicide to be with the person you love because if they love you back, they're worth it.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nMy friend said its about committing suicide, but I beg to differ, I think she's singing about summertime ending.......saying goodbye to summertime........\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nIn the music video its her and a girl being in love and broke up and at the end they both kill themselves..\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nBefore I write anything else- Lana Del Rey is a genius. Her voice, her songwriting, her music videos, completely and utterly awesome. \r\nAfter listening to this song (basically on repeat!) and reading these lyrics, this is how I interpret Summertime Sadness; \r\nShe is recalling the memories she's had with someone special (probably a partner or a close friend) that had either died or just gone away. \r\nI think lana is also just setting the mood of 'summertime sadness.' When your meant to be feeling so happy like everyone else when really your not, and there is more feelings of sadness and loss beneath the surface. \n\r\nEveryone that reads this MUST watch the music video cos it's really good!! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThis song is absolutely amazing and I discovered it when I was going through a \"summertime sadness,\" I interpret this song in a way I was feeling last summer. I fell in love with someone who had to move across the country at the end of summer. \n\nI think this song is about a summer relationship/fling that was so rare and absolutely indescribable . She is so in love with him, and had so many amazing moments with him but knows he will be leaving soon...knows she should guard her heart but doesn't care and embraces the time she does have with him... even though she knows the more time she spends with him, the worse it will be when they part. When he parts they kiss goodbye, and they both know how they feel about one another but nothing can help the situation. She will always miss him and maybe sometime later in life they can be with one another. Late is better than never.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI personally think it's about Lana Del Rey's best friend who died in a car crash when she was 13 years old.  (\"Cruising down the coast goin' by 99/Got my bad baby by my heavenly side/Oh if I go, I'll die happy tonight\"). The 'lesbian lover' in the music video is a stand-in for her friend.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nRandom observation, but every time I hear the line \"Dancing in the dark in the pale moonlight\" I think of \"Green River\" by Creedence Clearwater Revival: \"Barefoot girls dancin' in the moonlight.\" Totally and completely different songs...but a similar line.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nLana wrote this song in memory of a friend of hers that committed suicide by jumping off a bridge with her car. That's the real story behind it, not just my interpretation. And to you idiots who are like \"Omg lesbian lovers!\" No, it's not that kind of love. It's close, friendship. Like sister kind of relationship. The line \"Kiss me hard before you go\" is not in a romantic way, it's in the family-relationship kind of way. She loved her friend like a sister, and because of her committing suicide she had \"Summertime Sadness\".\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nLana del Rey is known for being a fan of David Lynch and a lot of her songs and videos, especially this one is super similar to Fire Walk With Me/Twin Peaks. Honestly Lana del Rey is a Laura Palmer wanna be. She wants to embody the drugged up dream girl who dies young.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nShe's asking her lover to spend some time together and kiss her, to make the separation that will happen later less hard. When he will be gone, she will move on, but for the moment she just want to stay in that moment and enjoy it for what it is.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\n\"Sizzling like a SNARE\" as in a snare drum\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nSeems like she had a feeling, that something was going on, something bad was going to happen, seems like she had that kind of bond with this person, she just knew, and it wasnt an happy ending, this person was going out of here life, a person who she truly loved and who she will miss forever, i feel bad for her, she feels sad, like a sad summer, so thats why she called this song; summertime sadness, she looks back on the time she had with him/her, she has flashbacks.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nBeautiful song.. Reminds me of something really great.. It seems to me like a \"hidden\" message. \"If you love me, if you really miss me and most important US, and you're really not well where you are.. Come home!!!!!.. To ME.. I still love you.. And I want you!.. And I still feel like I want to spend ALL the rest of my life.. Just.. With YOU.. For better and for worse.. They still love them!.. Sad and beautiful!.. It is only up to them.. But, more important, YOU have to promise ME one more thing: that you'll take good care of you no matter what you decide!!!..\"..\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI Love You.. Always Will.. Take Good Care of You.. <3\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nSo strange! Real fact!  Just wanted to say that last night, I do not know how, I had a dream, reliving a painful fact after a such a long period of time. My dear loved one was leaving. The real strange fact is that I instantly woke up at that moment sensing a similar pain like I felt then, back in time. He must have been truly loved her! He will always love her and wishes her all the best! Just a thought... Now... After all these years!\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nLyric-wise, it appears to me to be a song about a lost love. The line \"kiss me hard before you go\" is really the one line that indicates it is about a lost lover and not just a close friend or sibling.\n\r\nIn light of that, I'm thinking the video is about a woman remembering her lesbian lover who has passed away. In other words, it takes the more broad idea of a lost love (which the song is about) and tells a story about a specific kind of lost love.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nFrom what I've read, you're all over thinking the meaning of the song. I think the song is based around  two girls who are best friends. Girls can show off their love very passionately even through friendship, I don't think the song is meant to be taken in the context of lovers. I think that the girl with  the short blonde hair committed suicide and Lana is reminiscing their memories together while also trying to figure out why she committed suicide, trying to feel what she felt. Lana by saying \"I just wanted you to know, that baby you're the best\" it's like she was trying to help her and prevent her from committing suicide. I know from first hand experience and I can relate to this song, when a friend of yours is very depressed and contemplating suicide you try everything to stop it and repeatedly tell them they're better then that, but in the end we never really understand.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nI certainly agree with Tippy Toes comments, as in my reply. The Line that puzzles me the most, is, ' Like the Stars Miss the the Sun in Morning Skies' To me, this line defies logic, as the Stars are still there, only we can't see them because of the Sun's radiance. So the Stars can't miss the Sun, only we can. Any thoughts on this ?\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nThe way I interpreted this from the first moment I heard it was as a love or summer fling that is cut short due to separation when summer comes to an end. summertime is carefree and feels everlasting just like young love. But once school starts up again, especially if its college, then despite that young love there is sadness knowing you can no longer be together if your lives take place in different locations.\r\nJust my thoughts. Interpret as you please.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nBehind the song, there are illuminati secrets.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nThis song is actually about her girlfriend that committed suicide\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nTo me it's about two girls who were best friends. \r\nBut one of them (the girl with the short hair) committed suicide and so Lana recall the past and all the things they both went through together\r\nshe will miss her forever cos' they were so close to each other like sisters and it hurts her so much that her best friend suddenly \"vanished \" , \r\nI also don't think the song is meant to be taken in the context of lovers.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nLana's song to me, isn't about  whether or not they are \"lesbians\", the fact people are focusing on that aspect just shows how ridiculous people are. The song has a timeless, general meaning that can relate to anyone in any context or relationship  it's basically saying: the absence or loss of a true love, is corruptive and detrimental. This is epitomised in her suicide\r\n\"Summertime Sadness\" to me, is an ironic juxtaposition of two polar opposites \r\n\"summertime\" brings connotations of happiness, sun, holidays, love ect thus combining this emotive word with sadness emphasises how depressed she must feel now that even summertime can't make her happy\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI've heard it's about how her boyfriend passed away and her new boyfriend doesn't love her as much as her boyfriend who passed away did.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nTo me the song is about a lesbian couple who's love is like infinity, but one commits suicide and the girl is so sad but can't let her go. She'll miss her like the stars miss the moon in the morning sky. and even when she's gone she's gonna drive.\nbut then the other one commits suicide.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nI just found this out. I was reading an article about he Summertime Sadness Video and it is about a suicidal lesbian lover. this song is great but sad :( hope this helps clarify things about the song. \nOh here is the article \nhuffingtonpost.com/2012/07/20/…\n\n\n"}