{"comment_0": "\nThis is a song that means a lot to me...\r\nI think almost anyone can relate to it...I mean we've all been there, trusting someone with our hearts only to see our hopes dashed against the grindstone of our own foolishness. And that summer wind that helps to capture eyes and hearts...\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nmountainjew, it's a different generation. i think it's really cool that some people are getting exposed to sinatra through the ataris. shows you how much music influences us.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nokay I didn't even know the ataris had a song about \"Summer Wind\" until I was downloading Sinatra's after I found it...it's beautiful, and so much better than any one else has ever done, IMHO.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nmy grandpa loved sailing, and 23 years ago he bought a boat and at the time this was his favorite song in the whole world so he named his boat Summer Wind.  Unfortunatly the same year he drowned off of the same boat. This is my all time favorite song because it reminds me of my grandpa and everytime I hear the part \"I lost you to the summer wind\" it gives me chills down my spine. it's just so weird that he named his boat after this song. I am now into sailing and I named my sailboat Summer Wind II.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI grew up listening to Sinatra (and Dean Martin) thru my father.  I'm only 25 years old so I may not have the \"credibility\" to really talk about Sinatra...but I wanted to come here and just point out that if you add up ALL of the comments from ALL of Sinatra's songs on here then you won't pass 200.  This is unfortunate, as Sinatra is a God, but also is probably the best example you'll find of a generation gap in music taste.  I gaurantee that if all of the Sinatra fans from my father's and grandfather's generations were to post on this site...the servers would crash.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThe song is simply about a fleeting romance, a type of \"the one that got away.\" While somewhat sad, it is a memory sweetly savored.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis song is so amazing.  I always wanted to hear it after I heard the song \"Summer Wind Was Always Our Song\" by the Ataris.  Everyone should listen to Sinatra \t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nOh my god you are right Saves the day girl. Summer wind is truly grand.\n\n\n", "comment_8": "\nsame here, heard \"summer wind was always our song\" and had to know what it was all about!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nme i was curious when listenning at looking back on taday by the ataris, \"playing summer wind in the juebox of the bar we use to go....\"\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ni heard this on that ataris song, and theres a fenix tx that mentions it on the cd lechuza. Its pretty good for an oldy.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\ni am a chick magnet when i belt out this toon after getting piss drunk\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nthis song is from summer wind was always our song by the ataris... i LOVE that song! it reminds me of my breakups with guys...*tear*...\"these breakup songs make sense again and i really wish they didnt Sinatra's singing summer wind and i'm thinking about the night we met...\" we could all learn a lil something from frank... lol\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nAww I love this song it's a classic. Frank Sinatra's my neighbor...the cemetery that he's at is right up my street ::tear tear:: And punkrockz Fenix TX's \"A Song For Everyone\" says 'Summer Wind'...but it's not talking about this song. I found out about this song in my favorite song by the Ataris \"Looking Back on Today\"...and \"Summer Wind Was Always Our Favorite Song\"\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nAww I love this song it's a classic. Frank Sinatra's my neighbor...the cemetery that he's at is right up my street ::tear tear:: And punkrockz Fenix TX's \"A Song For Everyone\" says 'Summer Wind'...but it's not talking about this song. I found out about this song in my favorite song by the Ataris \"Looking Back on Today\"...and \"Summer Wind Was Always Our Favorite Song\"\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nno , they are just saying the ataris song brought them to sinatra . \n\r\nme , i grew up on sinatra and bennet . truely amazing artists .\n\r\nthis is such a sweet song .\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\ngreat song. 2 thumbs up!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nthe lyrics sound so mournful, but the instrumental parts add some hopefulness to finding love agian.  People can learn lessons from sinatra songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\ni agree with pilotvsplane...even though it's really sad that some people are forgetting about the truly great artists of the 20th century. frank sinatra was god.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\ni prefer the duet of this song with julio iglecias... i think it's cool because it's about two friends growing apart rather than two lovers. there are so many songs about love, it's a nice change to have one about friends, espeically male friends.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ngot to agree with shawnshmawn both kick ass but the duet with the spanish guy just is softer and nice change\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThis song always reminds me of Edgar Allen Poe's Annabel Lee. How they were so in love, but then the wind came from the sea, killing her. Just my opinion. \n\n\n", "comment_22": "\nGreat Song, I didn't know it exsisted until I heard the James Dean Bradfield version, check it out on youtube.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ni must be drunk now. i wrote toon, i meant tune. im retarded\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\na breezy song telling about the fickleness and emptiness of pure infatuation\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nAll people to have posted here got it from the Ataris song.\r\nThe Ataris is more popular than Frank Sinatra? You uncultured oafs!\n\r\nExcept maybe tenburner and the masetro dude..\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI sing a lot of Sinatra. They tell me I do a pretty good job.\n\r\nThe melody of Summer Wind is beautiful. But I always felt that I was missing the true meaning of the words.\n\r\nOne day I met a man who was about the same age as sinatra, and he explained the song to me.\n\r\nFirst------it has nothing to do with wind, as such.\n\r\nIt's about two young friends, lovers. They go to the East coast of the US for a two month summer vacation. After about a week, they are joined by a young fellow from Europe. Although they don't know him, a strong bond is quickly formed between the three. He just sort of 'blew in', like the summerwind.\n\r\n\"like painted kites those days and night went flyin' by...\" etc.\n\r\nEverything was great......for a while.\n\r\nAnd then, \"I lost you to the summerwind\"  Yes, she develops a passion for the new guy who \"came blowin' in from across the sea\".\n\r\nThe first guy suffers through the autum and the winter, while the \"summer wind\" guy (the fickle friend) sighs \"his lullabies\" to his new girl friend, through nights that never end.\n\r\nSo in some ways it's a sad song and in some ways it's a happy song. It depends if you are the first guy or the second.\n\r\nWhen I studied the song again, with this meaning, it all seemed to make sense.\n\r\nfrankisbac\t\t\t\t\n\t\t\t\t\n\n"}