{"comment_0": "\nI can see a lot of my summers in this song - playing baseball, drinking wine and listening to the radio, the Yoo-hoo bottle (I had an addiction in high school), wearing a bathing suit under my clothes to go swimming...the song is supposed to invoke old memories, and it does...nice job, Mr. Chesney.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song makes me feel like going out with my group of friends just to hang out. He did such a good job putting everything summertime is about into one song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ni love this song...classic summer kenny song. destined to be a great live song\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nSuch a feel good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nFrom beginning to end--pure greatness.  Even just the way Kenny hits that high note in the word Yoo-hoo gives me a kind of chill\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nthis song is the total embodiment of summer..omg. such love. But isnt it \"her favourite song on the radio...\" not \"perfect song...\" ?\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nNo, it's perfect song.  I used to think it was her favorite song, too.  Listen a little closer next time, you'll see that it's perfect song.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI always thought it was favorite song also but I always thought it sounded really strange.  Makes sense now.  The P is a bit silent though.  Doesn't take away from the fact that this is an amazing song.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nGreat song for the summer, I feel like going outside and blasting it out the windows of my car!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nYa I feel like that sometimes too but when summer's over it's so damn dapressing to listen to.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nyea during winter i was listening to this song and i just couldn't bare it cuz this was my summer song for a california vacation...sad:-(\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI do feel that without a good winter, summer is less fun ... not much, but it's the difference between those two that makes the feeling of summer special! And this song great.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ni downloaded this song during the winter, soooo pretty much wne summer comes along this is gonna be one of my hundreds of summertime songs. IT'S AMAZING.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nYa'll are badly mistaken. This song clearly has beastiality overtones! I mean, \"two back feet on the dashboard, young love in an old Ford\"?!? \"Sheep shank and a tattoo and a YooHoo\"?!? This cowboy is in love with his sheep! And what I don't understand is where he lives, because obviously people are OK with him driving around with his young, woolly love in summer, in the cab of the truck! I mean, he talks about being different, since the boys' hearts skip a beat when the girls take off their cutoffs, and here HE is, with his sheep. They must be accepting of him, but Geez!\t\t\t\t\n\t\t\t\t\n\n"}