{"comment_0": "\nDude, it's a *parody!*  \n\r\nEminem's just making fun of all those songs out there that are like \"I think I love you baby, I think I love you too...\"  etc.  He's basically saying that they're full of shit and guys who say those things are most likey paying their girl lip service to score.\n\r\nHe's also saying (between the lines) that girls who buy this BS are stupid; he's not slamming females in general.\n\r\nIt's strange how intellegent his lyrics can be.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nim sure a lot of people are gonna get pissed off by this song but im a feminist, and i think this song is kind of sad.  it says a lot about him.  His mother was a drug addict, and it sounds like his wife was a cheating drug addict, so of course he doesn't trust women!  Doesn't sound like he's met one that is worth his time.  If a female came out with a song like this no one would blink an eye, but its true, women can be just as cruel as men.  I wish the best for him, hopefully someday he'll meet someone who really cares about him, so he wont have to put up anymore walls.  Eminem is awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nyea...even tho i am a gurl...i think that they screw ppl over too much...so do guys, but still....love this song...ur right Em is sexy as hell in it...love the rot in pieces part...i don't think is song is bout 8 mile, but i'm not sure...& he talked bout Mariah cuz he actually dated 4 a short while...peace!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nNo one's touched on the meaning yet... And this is the irony, he's refering to the bitches in the song as shallow people in the world. Read the song again, and you'll see it... I got a laugh out of the comments on here though, all the women saying they love him, et cetera. He's talking about you kind of people in the song... \n\r\nRegardless, though, I like the beat and the fact that Eminem is not reserved in his songs. Anyone's who's been with a shallow or slutty girl may not feel this passionate but they can definately relate to an extent.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ni really can't understand why everyone can't lighten the hell up and laugh at this song, cause i think it's pretty funny. I am a female, but unlike many people who've already posted, listening to this song does not make me want to jump Eminem's bones, nor does it make me want to cause him bodily harm. how can you get pissed at him for speaking the truth? yeah there are women out there who are sluts and liars and only want to hook up with him because he's famous or rich or whatever. more power to him for calling them on it. does it make him sexist if its true????!!!!! Furthermore, the majority of the insults in the song are directed to the following types of women: Sluts, Hos, and Bitches.  I don't fall into any of those categories, so maybe that's why i don't take it so personally.\r\nalso, guys are liars and sluts too, we all know that. if a chick sang this song would you all be jumping on her calling her sexist?? probably not, but there's the double standard.\n\r\ntazzy:\r\n he said you want what you can't have, don't touch what you can't grab, end up with two back hands...\r\n*to back hand someone generally means to bitch slap them as far as i know, so he probably means you can't have me, don't touch me or you're gonna get smacked* \r\nthat's what i get out of it anyway.\n\r\nBlackberry: you are so right, i thought the same thing when i saw Kill Avrils name \n\r\ndesperacidea (sorry if i spelled that wrong) don't worry,:  i would run the other way as fast as i could. lol\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nVery easy...  The girl is too messed up in the head and looking for a guy she will never find.  He comes around and is the best thing she will ever get and she still acts like a dumb ho.  He finally realizes this and he tells her there is no chance he can be her superman (who is the stongest and best) Sorry Susie but it is the truth.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nA lot of things in this song are funny (yeah, the anthrax lyric is \"pure eminem\" as someone said), but it's also a very melancholy and touching song...\r\nThe thing I love about it (and about a lot of Eminem's music), is it isn't nearly so mindless as some of the rap you hear where they're just pure \"sex fuck bitch whores ima gangsta woo drugs\"\r\nThere are actual meanings and stories behind his lyrics, and real feelings, and the sounds within the songs give his music a huge touch of personality. (This is partially in response to the person who disagrees with this music btw) Even if some people might take the music \"seriously,\" it is unfortunately because they're too stupid to listen to it closely, and that is something that is unavoidable with any medium (and I don't think that a stable person will actually imitate what they hear in this music anyway). As far as bad treatment of women in his music, yes, it is unfortunate, but it isn't bad treatment of women, and a lot of his songs are really mocking more than anything. (And he does seem to love his daughter and care for her greatly, which implies that it is more that he's jaded, than that he's just inherently an asshole, especially what with bitterness at his mother and his wife, etc etc)\r\nAnyway, regarding this song specifically: it isn't just about hating on women, really. At least, I think it's more about encountering all these fake, whorish women (and perhaps he just attracts them, or it's partially because of his outlook, but nonetheless). It's basically the outpouring of a very very hurt individual who has put a barrier. The lyric \"maybe I'll love you one day, maybe we'll some day grow\" is very important in this, as well as the lyrics when the girls are talking about being unfazed, in which they're portrayed as trying to prove they can be trusted, even though they more likely just want to hump the guy (and again, vice versa ... eminem obviously feels the same way)\r\nIt's just a statement of his state of mind saying that relationship(s?) have fucked him over and he's just too sick of it to care anymore - for now.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nAck, sorry, putting another post. It's because I'm sleepy and been listening to this song for like the last two hours so it keeps making me think ....\n\r\nIt really makes me think of Eminem just as a person, and it makes me feel so sincerely sorry for him that I wish I could just go and be like \"I WON'T PRETEND TO BE YOUR GIRLFRIEND BUT I WILL BE YOUR FRIEND AND HELP YOU WHEN YOU'RE DOWN AND JUST BE NICE AND NOT AN EVIL BITCH REALLY\" and I just hope, as the person above said, that he'll find an honest person who really cares to love and be loved by\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nfuck the new stuff..this song kicks major ass. he ryhmes like no other. fav part's gotta be \"don't put out, I'll put you out.\r\nWont get out, I'll push you out\" or just the whole song.\n\r\nhaha, superman ain't savin shit, you  can jump on shady's dick.\n\r\ni wanna do it to this song haha. ;D\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nEveryone should be able to associate with this song at some point in their lives. He's been burnt by his gf and lost all respect for women. Now he just sleeps with 'em and then tosses 'em out and keeps them at a distance\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song has a really frustrated tone. I don't see why this song is funny, it's really dark IMO. I see this song as Eminem/the narrator basically losing all respect and trust in women after being with so many fake and untrustworthy chicks. The sad thing is, with all the fake girls just trying to get with a famous person, he will probably never find true love.\n\r\nSo yeah, hilarious, right? -_-\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song is about his wife cheating on him and losing respect to her .\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nMy friend just went through a breakup a month ago, and after hearing about the relationship from his side (as she wouldn't even talk to me), and him telling me this is his \"theme song\", it's a sad song. Her nickname for him was Superman. And he's a super nice guy, and from what I've been told, all she did was bring him down. Now he's happier, but he can still relate to this song, and I hope that one day, he'll find someone who appreciates him.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think he is calling out women who act like hoes, and how he plays along with them. He already knows they are just wanting him for sex/money/fame/attention. He is tired of being there for a woman he was committed to \"ain't got no ring on this finger now\" because she cheated on him. He now isn't going to waste his time on thinking too much or dealing with relationship stuff, or being someone's \"Superman\" because he is too wise for the bullshit now.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nHell, I just love that lyric! \r\nBecause Bitches they come they go..\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nfuck yeah! eminem does it again!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nLoL! Gotta love Em!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nhaha wow strong lyrics\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nPut anthrax on a tampax and slap you till you canâ\u0080\u0099t stand.\n\r\npure eminem...\n\n\n", "comment_19": "\nPut anthrax on a tampax and slap you till you canâ\u0080\u0099t stand.\n\r\npure eminem...\n\n\n", "comment_20": "\neminem is funny as hell when i first heard this song a was laughin my ass off this is an awsome \t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThis song is fucking funny!  It kinda sounds like me is wut my friends would say.  how rude.  I LUV THIS SONG though!  hehe!  :):D;)\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ndamn great song, end.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nit is really \" I'm not Fazed I hang around big stars all\"it is not i'm not faced.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\ndamn true song. goes for guys too. damn tru\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nIts true bitchs they do come and go. And why not have fun with them while their there? heh thats always my moto\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ndamn i love this song, the lyrics are tite as hell, i just got the cd today with the special DVD that came with it. I suggest takin a look at it, also, there a easter egg on the dvd, just hit the left arrow button when u highlight the \"next\" button, the chair should glow hit enter\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nthis song reminds me of my ex boyfriend the lyircs of it cuz i donno he reminds me of eminem and this song fits him perfectly\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThis is my all time favourite song. I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nits not beat tall hoes, its Leap tall hoes in a single bound, like superman leaping buildings? good job on the rest of the song though\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nThis is prolly my fav song by him. I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nclassic. \r\n\"Till then just sit your drunk ass on that fucking runway hoe.\"\r\ni love it. \n\n\n\n", "comment_32": "\nthis song is so funny...put anthrax on a tampax..\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nHey is it true that this song is about the girl who plays his girlfriend in his new movie, 8 Miles?\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nthis song kix so much fukin ass,slim seems ta do it yet again n pulls off a sick song wit sick beats props ta em das all i can say\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nthis is about spider-man    cant you tell\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nHAHAHA! I love when does the girl's voice saying \"Rot in pieces...Umm, that's great!\" It's hilarious! Comedy and hardcore rap. Gotta love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nThis is my absolute favorite song of the moment. I love it! I love: \"Am I too nice? Buy you ice? Bitch, I wouldn't piss on fire to buy you life!\" and just every verse in this song. It's classic Eminem.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nOops! That should say, of course... \"Bitch, if you died I wouldn't buy you life!\" \r\nD'oh!!\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\neminem is soooo sexy in this song. im probley the only female that thinks so\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nWell...Im not much for rap music.  Most of the rap songs I hear I absolutely hate.  But this song is fucking wonderful...it sums up my life.  Eminem has impressed me...more songs like this and i'm gonna be happy with rap.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nNo, Rubikia, I'm a girl, too, and I love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThis is the best song ever! More poeple should be commenting on this!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\n\"love that tattoo whatâ\u0080\u0099s that say? \r\nRot in Pieces, uh thatâ\u0080\u0099s great. \"\r\nI about drove off the road laughing when I heard that. This song is freakin hilarious. I think that anyone that has been fucked over by a girl can relate to this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nHAHA!! i loved this song \t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nyeah, not much i can say that hasnt been mentioned already-- great song though. cant help but laugh ur ass off every time you hear it\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nall guys should love this song. \"not a jealous man but females lie, but i guess thats just what sluts do.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nthis song cracks me up everytime he sings this part right here:\r\nBut I do know one thing though \r\nbitches they come they go, \r\nSaturday through Sunday, Monday. \r\nMonday through Sunday yo. \n\n\n", "comment_48": "\nHe's such an asshole!! But you cant help but love him. \n\n\n", "comment_49": "\nYes Eminem is sexy and I love this song.                                                                                                                                                                                                              LATER\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\neminem is the man. even if he's dissin women...he sounds so awesome doin it.  he's jus playin. and i jus love hearin my boo sing me this song...love u nd.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\neminem is the man. even if he's dissin women...he sounds so awesome doin it.  he's jus playin. and i jus love hearin my boo sing me this song...love u nd.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nwell i like all kinds of music..punk is my fave..but eminem..he is a good rapper..i cant not say that. hes truely very talented..and he does a damn good job at expressing what he feels.. its like you can actually understand what hes really talking bout..hell that just may be me...but i could. and even tho i ama female..and he tends to diss us a lot..who the hell cares..its music ..its good..and he makes millions off of it. id diss on everyone too if i made the bux he did!! fuck! lol\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\ndis song is tite! it is funny as hell!!! damn. eminem juss doin his thang and i agree wit all yall. u know? representin!\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nthis song is hella funny-even tho he's dissing us i still love him =)\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nActually, the video for Superman is on the 8 Mile DVD, which is coming out March 18.  If you don't wanna watch it on the DVD, you can just download it off Kazaa (now).\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis could be why he doesn't like the woman hes singing to: \"I'd never love you enough to trust you, we just met and I just f*cked you.\" Maybe he wants someone with morals? I think that women would want to save HIM.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\ni dont get it why everyone likes this guy so much. i came here to see what this song was about and what people think about it. not to offend anyone (which im thoroughly about to do)..but eminem talks about raping women, using women, killing people, and being violent. they always tell us, \"if u dont like it dont listen to it...\" but the fact is that other people who listen to it CAN take it seriously, whether Em likes it or not, he's a\"role model\" to some people who wanna be like him. Its ridiculous, because we dont need anymore of what he's saying in the world. hell no. this song isnt 'funny' or 'tight'...its wrong. completely wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nHEY! i just watched this music video with amyjayne!\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nkill avril 41 bitch you make me hurl\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nthe beat in this song is so fucking tight, and marshall is a fucking lyrical genious, all these eminem haters dont listen at all i swear, i think hes a good influence on todays youth \r\nto people like kill avril:\r\nFirst off you dont know Marshall, at all so dont grow partial thats ammo for his arsenal.\r\nHe'lll slap you off that barstool\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\n\"I'll never let another chick bring me down, \r\nin a relationship \"......... \n\r\nIn all my relationships now that I think about it. I would always do anything for my girlfriend. And how does it end? It ends the same way each time. The girl being a freakin' TRICK.. \r\n\"I don't wanna flip when I see you with guys. \r\nToo much pride, between you and I not a jealous man but females lie.\" \r\n\"\"Cause I can't be your Superman\"\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nlove the song! love em!\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\ni like the song. it is funny\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nSome of this song reminds me of my life. But I do know one thing \r\nthough bitches they come they go\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\n<3 the song!\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nyo kill avril.... ur gay. u think eminem talks bout raping women and killing ppl, and thatz true, but he aint SUPPORTING it. He tells every1 a message in his lyrics, and in this song, he tells all da guys to not do soo much for ur gf if they except too much, and if they r a bitch. And he tells the guys to make sure a bitch wont let them down.So kill avril, SHUT UP, SCREW U, and don type nething here that will make every1 here want to kick ur ass. if ne1 is with me, plz type smt that supports my point of view and thx every1 here for support on eminem\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nyo every1.....\n\r\nU DON LIKE THIS SONG NEMORE? CMON TYP[E SMT PPL...... I need some support against kill avril everybody..... eminem pimps out. ppl type smt please.... o and kill avril..... i still hate u..... ur GAY, get it? GAY. u don like eminem dumbass? thers no prob with hating eminem, but dont get ur stupisd ass over here and go smw else where u like music u dumbass\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nzion im soooooooooooooooooooo with u.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\no and by da way... im shibu, if ne1 noes me, then type smt here. Yeah, japan is awesome... im still coming bak 2 florida!!\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI LOVE this song!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nOh first off KILL AVRIL 41, FUCK YOU! You don't even no what the Fuck ur talkin about! What r u a Parent get a Fucking BRAIN HOE! Bitch if you died wouldn't buy you life! SMT BITCH!\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nzion im sooooooooooooooooooooo with u 2\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nsabrina williams 3. what the hell r u? u come on dis site and think ur da shit...\"ok i like this song but i dont come and go Istay with my man and I wont lie 2 him\" come on!!!! ur 11 4 fuck sakes. get a grip gurl. Ur pathetic. oh and zion im witchu babe\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nif you're with a guy and he says this song is his theme song, do not stop, do not think, turn around and run away as fast as you can. that is NOT a guy you want to be with anymore. \n\r\nanybody want to jump up my ass for that?\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nyeah deffinitly favorite eminem song, it never gets  old.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\noh yeah and eminemfan, i noticed that too. it's fazed.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nthis is a completely sexist song and all of you girls are on here \" omg eminem is soo hot hehe\" your stupid and you fuckin need to get a brain.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\noh and i agree with everything kill avril 41 said and TEXticle2 shut the fuck up and grow up, dickwad.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThis song helps me realize how much of a bitch this one girl we I just broke up with.  Thank you Eminem!\n\r\nMy pride is at 110% again.  I'm too fucking perfect for that bitch.\n\r\nDownload \"(S)AINT\" by marilyn manson for a song like this.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nhe is so hot, i would do him in a second. I never knew he was a man of such intense passion. he probably had a boner the whoe time he was rapping this song!\r\nstill I love this song\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nUmmm...oxymoron anyone? \n\r\nKill Avril 41- \"eminem talks about raping women, using women, killing people, and being violent\"\n\r\nHa, your name seems pretty voilent to me and it's DEFINATELY talking about killing people...\n\r\nYeah, I just found that kinda funny.....\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nwhat a fag\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\ntrue What a FAG!!!!!!!\r\nrock on!\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nclearly a fag, no doubt, no doubt in my mind.(to be read using the voice of uncle rico).\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nI'm not a rap fan and eminem's recent stuff ain't anything spectacular but once upon a time I loved M.Mathers and this song has got some really funny lyrics and does have a good point to it. The Eminem Show is actually a pretty awesome album i've gotta say.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\ndoes any1 have any idea wat this line means\r\n\"dont touch wat u cant grab, end up with two back hands\"\r\nI LOVE EMINEM TO DEATH! AND ALWAYS WILL.........HES A DAMN GENIUS.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nguybrows, i'm going to start a fansite for you and your funny-ass explanations.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\ncan we same theme song? :P\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\ni know im not the only girl commenting on here, so let me know.  does this song SERIOUSLY turn anybody on?  not just eminem sounds sexy in this song, but this song turns you on a lot?\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\n\"Am I too nice? Buy you ice?\r\nBitch if you died wouldn't buy you life.\"\n\r\nMan Eminem brings out the worst in me.  I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nlol...all i have to say..fuckin genius!!! gotta love this guy!!\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\n'girl you can sit on shady's dick'\r\nbest\r\nline\r\never\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nI heard this song was about a relationship he had with Mariah Carey\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nawesomeusernamehere: Yeah, and he is right too.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nwhat eminem said is true. bitches, liars, sluts... to me \"i love u\" is precious...\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nsuch a good song...\r\nyay eminem! =]\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI love this song. He is basically mocking people who got offended after his first 2 albums. It sounds super sweet at the beginning and as soon as you think he might actually be making some sort of love song, he's like \"Bitch you make me hurl.\" \n\r\nAlso, he is saying that a lot of (not all) women are fake, gold digging whores who act nice in your face and the next day, they are gone with your bank accounts cleaned out. And sadly, this is true. It happens all the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\none thing I hate about this site is that it's called SONGMEANINGS.net meaning you are suppose to talk about the meaning of the song. Almost every comment I read has been \"Oh i love this song!\" \"Eminem's hot!\" UGH!! To me this song sounds like shady's been hurt soo bad by his ex wife that he's just givin up on women completely and is just going to fuck whoever because that's all they're good for now. They're not worth the pain.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nI just love how he's so honest about it. At least he tell you straight to the face that's not gonna marry you, and dun hav expectations.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nThis song came out at the perfect time in my life.I was still fairly young,I was 25 and going through the worst break up of my life and my best friend committed suicide just a month prior.I had entered a really dark point in my life and needless to say that I was very bitter.In fact,bitter's not even a strong enough word to describe where I was mentally and emotionally.Anyway,I used to put this song on repeat and turn the radio all the way up and belt out the lyrics just because I had it in my head that all women were whores and bitches.Thankfully,as time went on those wounds healed and that anger and misogony dissipated.I still miss my friend something terrible and even now six years later it hurts,but I rarely think about her anymore.In fact when we were together,I was so in love with her that I couldn't even imagine myself with anyone else.Now,however,I can't even picture us together anymore because i'm too different now from back then.I can still listen to this song and get a good chuckle out of it and now I just enjoy the humor in it.But damn,back then this song turned me into a beast.I'm glad I don't feel that way anymore,and hope I never have to feel that way again.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nMariah Carey Suck Outtt\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nPeople that say Eminem is nothing but a piece of trash and so is all of the music he makes because of all of the explicit material really shouldn't be so shallow and prejudiced in their thinking. To me, this song is about how screwed up things are in the world (what I think the majority of his songs are about), particularly that have to do with relationships. He's not degrading women or anything like that, I think he's simply putting out to the world the things that are really messed up out there. Eminem is no idiot, he's not going to put such extreme ideas out there because he truly believes in them, he's doing it to reveal to everyone what he has only been \"lucky\" enough to experience. Also, his life definitely never was the bes and still isn't so he's got a lot of problems to rap about. And he came straight out of the gutter with nothing to build off of, so his idea, in my opinion, to get noticed has always been to put out the most attention-grabbing material. Maybe I'm just taking this all naively, but I think everyone should get off his back and at very least appreciate his originality.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nThis song is about Jennifer Watkins, who wrote the tell-all book \"Cleaning Out My Closet.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nhes making fun of superman, what he doesn't know is that he could be a good super hero to if he chooses to.  friend or foe?\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nhe was telling everyone hes not superman, \n he knew it was a guy in fort wayne Indiana, and hes been downing him his whole career, the moral of the story is, never bet against God, because superman is right here\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nYes\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nThis sums up his frustration With the women who just wanted to fuck Eminem talking game trying to play like it's love.\r\nHe was in love with two other women who constantly did the same exact type of thing to him as addicts, he can see through it.   it's actually sad to me that he can't trust anyone because anyone he really likes is behind a curtain and groupies are what gets behind his curtain everyday with the same story, the story portrayed here. Always breaking any expectation they ask him to entertain.\n\r\nThis part is the core of the song;\n\r\n----First thing you said:\n\r\nI'm not fazed; I hang around big stars all day. I donâ\u0080\u0099t see what the big deal is anyway; youâ\u0080\u0099re just plain old Marshall to me.\r\nEm - Oh yeah girl run that game.\r\nGirl - Hailie Jade I love that name,\r\nlove that tattoo whatâ\u0080\u0099s that say?\r\nRot in Pieces, uh thatâ\u0080\u0099s great.\n\r\nFirst off you donâ\u0080\u0099t know Marshall,\r\nat all so donâ\u0080\u0099t grow partial thatâ\u0080\u0099s ammo for my arsenal.\r\nI'll slap you off that barstool; there goes another lawsuit.\r\nLeave handprints all across you.\r\nGood lordy wody you must be gone off that water bottle you want what you cant have oh girl thatâ\u0080\u0099s too damn bad\r\ndonâ\u0080\u0099t touch what you can't grab\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nIt's about Mariah Carey?....Eminem is so stranger...Mariah is too much for him...\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nI think Eminem is a complete jackass most of the time...or he used to be, like when he made this song. But now he is the best rapper I know...But that is not saying much, I fucken hate rap!! He just makes me like his music somehow.........He must be real good!\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nYes, we all understand that is directed at one particular type of woman, however the lyrics are very generalised. Whilst I don't completely agree that \"he's a bastard and should die\" or whatever, I do think that this song is quite offensive. From all the comments here you can tell that. Almost everyone is saying \"women are bitches\" \"don't do anything for them\" \"just get what you can then leave\" etc. This just proves that this song is creating a terrible perception of women and that his lyrics are quite sexist and they have a lot of influence. Also to wicked1, yes I would think this song were sexist if a woman were singing it.\n\r\nAnother point, any girl who says \"omg now i love enimen after hearing this song\" you either have not actually considered what this song is saying or have no self-respect. This song should not cause you to love him, that's just ridiculous. I agree with Desaparecida, if a guy says this is his \"themesong\" run as fast as you can.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nhahah fuck ya bitches\r\nstop fucking wasting or times with ur high expectations and standards.\t\t\t\t\n\t\t\t\t\n\n"}