{"comment_0": "\nThis song is absolutely amazing . .! All his collaborations are good & just like \"No Air\" this will probably be a hit. The music video looks awesome too!\r\nI agree with dancehalldrugg, the person was depressed because their life lacked of something, in particular, someone. They found that person, who gave them the reason to change their way or outlook on life. \r\nTheir love and acceptance brought out the happiness, confidence and the courage in him. Whenever he's with this person, she seems to bring out the invincible side or 'protective' streak in him, a side he never knew he had until he met her. Love has the power to conquer all and I guess the concept is shown through this song. \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nYeah, this song is heaps awesome.\r\nI guess its about someone being pretty depressed.\r\nand then someone 'amazing' comes to their life, and you are pretty much the happiest person alive.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthis song kiks total ass!!!!!!\r\nits about a person whos \"weak\" after a break-up and just when they think its the end, someone (as dancehalldrug said) \"amazing\" comes in their life and they feel so much stronger and invincible...yeeeeaaaahhh\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nWow no one commented on this song? \r\nI like this song, a very nice duet with Keri.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song is so amazing first time I heard it I cried.\r\nBut the lyrics are wrong..\n\r\nThis song is about pretty much what everyone has said.\r\nA brutal breakup left Chris down and in the dumps and this girl comes out of nowhere and saves him and makes him feel like he can do anything as long as he has her.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis is most amazing song ever.\r\nIt describes so much.\r\nBeing lost and not knowing where life will take you....feeling like there's nothing worth living for.\r\nSlowly killing yourself emotionally.\r\nBut then someone comes into your life, and everything changes.\r\nYou feel like you can do anything.\r\nYou feel like nothing can stop you.\r\nWhether they love you like you love them or not, your love for them has changed you.\r\nFor the better.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI was lost, and you found me. I was lonely, and you came to help me. We've endured the up's and downs, but look at us now :) we are strong. Dedicated to the one I love.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni luv this song....it described me n ma b.f, i had just finished ma long term x n he just gt finished n then after 1 month we gt 2gether n we still are **7 months** but the vid 2 this songs a bit cheesy...the part where he saves her from the accident but i guess there's a point cz he feels superhuuman...lol\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ndepressing.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nthis is my song...\r\nI love it so much...\r\neveryword is amazing...\r\nkeri hilson has an amazing voice..\r\nChris Brown needs to get his life together but that doesn't make him a bad singer...\r\nhe still has an amazing voice...and writes amazing songs....\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ndude this song stinks more than my pet robert who died years ago... anyway, this song means that as a chameleon changes its color, it uses up its calories making it more vulnerable to roadside accidents.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nEven if the lyrics were actually good (which the're not) it wouldn't be enough to save this horrid song.\r\nIt just sounds off. \r\nOh, and CB sucks.\t\t\t\t\n\t\t\t\t\n\n"}