{"comment_0": "\ni absolutely love this song, the intro is so addictive\r\ni also love when it gets really slow and then it speeds up again\r\nthey definately need to do a remix of this song like they did with rubbernecking or a little less conversation\n\r\nthis song is basically about how he loves her so much but he feels trapped because of her suspicions. he's like don't throw our love away and keeps trying to convince her of his innocence \n\r\nhe can't let go of her love but he just can't keep going on like this - it has to end and he's promised he's never lied - love the song!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\ni love this song! i've only heard it a few times before... but after hearing it in the movie Black Hawk Down... i've listened to it every day. What it means... well... it's pretty obvious! i'm sure you've been suspiciuos at least once when a girl/boyfriend talks or goes out with a friend of the opposite sex. but what he is trying to get across is that he loves his girl and wants her to trust him that she is the only one he wants to be with. they can't have a good relationship if she doesn't trust him when he talks to others. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nMost disingenuous song ever.  If he loved a woman 'too much' why not spend all his time with her?  There's no room for suspicion then.  He wanted to bully and nag his wife into suspending disbelief so that he could keep doing what he wanted to do.  He wore a jumpsuit because he was an emotional toddler.  It's too bad that nobody counselled him well enough for him to live a better and longer life as his voice was a beautiful thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni heard this all the time on holiday and i love it so much! It makes me like almost want to cry, coz its just kinda...tragic\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nFunny scene in Breathless when they play this tune (shower fun).\n\r\nAnyway, this is such a great tune when it's cranked up.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI had a holliday job and they played it on the radio every day beacause he just was 25 years dead.\r\nVery nice song\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nhe screwed around on her once and she has sort of forgiven him, but doesn't want to move on, cause it hurt real bad and he's saying he loves her and he never meant to fuck around, but she needs to get over it and move on so they can be together.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nawesome song!\r\nlisten to the bloody chorus... you just wanna basically belt the shit out of it! haha\r\nlove it love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI love Elvis, but this has to be the most overplayed of all Elvis songs and I hate the radio stations for it, he has hundreds of other great songs they they never play, idiots.  \n\r\nAnyway, it's about two people that don't trust each other and can't figure out what to do with thier relationship, they sound like they both need help.  maybe that's why the chorus is so repeatitive.  It represents the monotnous cycle of indecision and procrastination.  Niether has the guts to be honest so they make up fears of the other lying.  \n\r\nA psychiatrist would have fun with this song.  Is there is doctor in the house?\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\n^^^ true.. great song, probably the only one u will hear occasionally on the radio.. along with hound dog / blue suede shoes.. welcome to Elvis commercialised... i am sick to death of the two latter songs.. basically the only two songs he is known for.. if you come across some Elvis-illiterate dim wit, please do make an effort to point them into the right direction, shedding some light onto the kings best material\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis is pretty good, but too soft for me. I think the Dwight Yoakam version is way better, and the quality on the CD is better because it's newer as well. I also like Yoakams voice better.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nSuspicious Minds was the last of 17 songs by Elvis that hit #1 on the Hot 100, written by Mark James.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nMr. no Name is crazy I dont think anyone should      remake other peoples songs there is nobody is as good as ELVIS this is one of the best songs he has\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThis song really hit home when I was going through a divorce. It felt like it was written for me.not many songs have touched me the way this one did. Long live the king\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThis song really hit home when I was going through a divorce. It felt like it was written for me.not many songs have touched me the way this one did. Long live the king\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nthis is the second elvis sonmg i heard and its one of my favorites!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\ni love!!this song!!i think its so sad. the song is obviously about a suspicious mind. he loves her and would never cheat on her or do anything to hurt her, but shes so suspicious and untrusting. relationships should not be like that\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis is my ONLY Elvis song. And in comparison to his other stuff, it's almost anti-Elvis. It's like a deep, thoughtful, relevant ballad. It's his last and best No.1.\n\nAside from the masterful rendition by The King, I love the backup vocals, all the complementary instrumentals, the spot-on melodies perfectly evoking the emotions, even the fade-out-then-fade-back effects at the end.\n\nIt's definitely a classic.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nIn my view, its a short and simple meaning, if you love each other, their should be no suspicion, just love. Thank you for reading.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI have Elvis but I love this song.  It's just perfect -the lyrics, the music, the backing, it all just comes together for a great song.  The story it tells is pretty obvious and a poingnent one at that.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nrather, I meant to say \"I Hate Elvis\".\r\nnot \"I have Elvis\".  All you crazy Elvis people, he's still in his tomb in graceland.  leave me alone.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nGreat song. & Elvis is obviously a kick ass legend but.. I would have to agree with \"Mr. No Name\", the Dwight Yoakam version is much better. My personal preference tho!!\t\t\t\t\n\t\t\t\t\n\n"}