{"comment_0": "\nUnlike most people, I believe Bruno Mars wrote this song about his dream girl. Like some great guys out there, Bruno wants a girl that will make him happy and be with him forever. He is looking for this perfect girl but he can't find her \"I know your somewhere out there, somewhere far away\".\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI believe it is about a girl who he loved and she meant everything to him. It may or may not have ended on a bad note,but she moved away, or they lost touch completely. He was the one to break up and it was a mistake and so he has been regretting it ever since. He never got the chance to say sorry for hurting her, and now lives everyday of his life hoping that somehow she could hear him. Anyway, thats what I think of it, its truely a beautiful song, written from the heart. This is why Bruno Mars is different from many other Artists who write love songs :).\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI agree with the dream girl theory I think he's saying that whether people believe him or not he's not going to give up on finding love and he believes that there is a girl somewhere in the world who believes the same and though they may not have each other they take comfort in talking to the moon hoping there words someday get to each other and that the other talks back\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think this song is about his beloved has died, that he is talking to the moon in hope she can still hear him and know that he loves him. I think this is such a sad song, sad and beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nFirst let me say this is such a beautiful song! I am in love with Bruno Mars's voice!\n\r\nFor me this song is about someone who's love is separated by distance which keeps them apart. And whether their being apart is due to distance (ie. long distance relationship) or just because they've separated and no longer see each other, it's about that moment when the night is clear and you look up at the stars and the moon. You think of someone you love and you hope that they're looking up at the sky and thinking about you too. Because you know if they are, then they're that much closer to you.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI'm gonna go a completely different path with this one.\r\nI think this song may be about the death of someone close to him, as in they are on the other side of the moon in Heaven.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI first heard this song around this time last year, right after I had met this guy on vacation (2,000 miles from home). he and I only had a few weeks together so it was very short lived, but the lyrics fit perfectly once I left. \n\nNow, however, I've had a change of heart. I lost my best friend in the world (he was my high school sweetheart as well) just last weekend. and every single word fits how I feel. I literally stare up at the sky and talk to him, and just pray and pray he hears me and is talking back, even though I can't hear him. it's a small town so that's about all everyone talks about, and I have more than gone mad on several occasions. \n\nMy interpretation is that he lost someone extremely close to him, whether it be a best friend, a girlfriend, or even a sibling. you could all be right as well though, it could be about a break-up or an ended long distance relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis one is for my man, Greg, who recently lost his beloved dog, Max, just shy of celebrating 13 years together! My heart aches for you Greg, knowing you believed Max was all you had, The loneliness you have endured makes it hard to breathe baby! I have been alone too, but as a child I learned how to deny my needs and please those around me so I didn't feel loneliness like you have. I can't imagine trying to live one single day without hope, it's unthinkable to me. Well, guess it's up to us now to be there, without question, for each other. We deserve it after all. Marry Me\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think this song is so beautiful. It's about a guy longing for a girl he once had. Now all he has is the moon. He stares at in longing for her, talking to the moon in hopes she'll hear him and want him back! I love this song, Bruno Mars is very talented. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI think this song is about a girl he lost because she died or moved far away\r\n\"I sit by myself\r\nTalking to the Moon\r\nTry to get to You\r\nIn hopes you're on\r\nthe other side\"\n\r\nI dont think they necessarily broke up on a bad note, but she left him or just isnt around anymore for whatever reason.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI personally love this song! Its so beautiful, Bruno Mars is the only person who could sing this song. \r\nI think that this song could be about what all of you have said. Me personally, i think he did the breaking up or made the mistake and regrets it. So 'Talking to the Moon', is the only way he can be with her, hoping shes talking to him too.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song was my official relationship with her. A really meaningful song, and a true song. I used to have a long distance relationship. She is all the way in Jakarta, while I'm in Adelaide. And true, each night I listen to this song, looking at the moon by the window. And I actually talked to the moon. As my girlfriend's name was Luna. Luna in Latin means the moon. And nevertheless, this song is basically dedicated for you. Luna Fransisca. \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI believe this song is about a long distance relationship. And its a relationship this is killing him inside because he has these feelings for this woman that he cant't express to her physically. He can't hold her close or give her a kiss. The moon plays an important factor because that is the only thing connecting him to her. when he looks up at the moon its the only thing that they can both see at the same time. So when he looks at the moon he likes to think that she is looking at it too. And then it feels like she is right next to him. So he starts to talking to the moon in reality, but in his mind he is talking to her. Which is why everyone thinks he has gone mad.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI personally think that it is a person that he fell in love with, and she got taken away from her before he could even have a chance to talk to her. Hence he is talking to the moon 'Trying to get to her'. With hopes that she is on the other side realising his plea that he loves her. Thats what i think anyway and it applies to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI think the song is talking about when you lose someone close to you and you miss them. You want to talk to them, see them, hug them, cherish them. When my dog died, I was devastated. But when I listened to this song, I understood it. I literally did talk to the moon. I would look up at the sky at night and talk as if my dog would hear me. I would hope he would and that he was talking to me too. Bruno Mars sings that is he just a fool who talks to the moon, it seems that he thinks it's a foolish thing to do but he can't help it . Whatever he lost, he wants it back. he can't like without it, so he talks to the moon, hoping whatever it is he lost can hear him, that it's talking back to him. It might sound insane to someone else but to him it makes perfect sense. This is just what I think so please no hate.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI believe he is either talking to a distant love or a lost relative/friend/love. \n\nHaving a distant love, your just hoping that their looking up at the moon also, talking strait back to you, like you can feel their presence there with you.\n\nHaving lost someone you just wish they were still there and with you but since their not you just have to hope that they can hear you while you talk about how much you miss them\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nMany people say its bc of a girl and yes it could be but i lost my brother and he's in heaven now and i will never see him again but i do talk to him and i look at the moon and i know he's looking down on me, I took it like that instead of about a girl, But there is some parts where my reply may not make sense!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI think it is a lot more sad than that. It is about someone he loved and that has gone forever (possibly death) that is why he says \"I want you back\". He does not want to face the fact that she is no longer alive and that is why he talks to the moon hoping she is in \"the other side\" (heaven, etc.) tlaking back. He hears her at the sunset \"someone is talking back\" and he has gone mad because of her loss. \n\nTell me what you think about this possibility.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI agree with the 'girl far away' scenario,  but after the death of his mother, I now picture him singing this incredible song to her. This guy can not be pigeon holed, such diverse music & styles.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nï¸\u008fBruno has the most amazing voice.  I have yet to dislike anything I have heard him sing.  â\u009d¤ï¸\u008f\n\r\nI fell in love with this song the first time I heard it.  I don't think there is any question that the lyrics are about a loved one, (family member, significant other or close friend), who has passed away.  The person who he is singing about was a very special person in his life.  Someone he could rely on, someone who was able to provide him with that rare level of love and support few people in the world are able to give.  So now there is a void that will be difficult, if ever, able to be filled again.   He's talking/praying to this person in Heaven, hoping they hear his prayers. There are days when he questions if they hear him: those bad days that he just doesn't think he can get through.  When he realizes he has the strength and ability to get through it: \"he knows you're out there somewhere;  when the sun goes down someone's talking back\".  \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\ni love the song but let me say just give this 1 thought gosh you all be writing something totally different and away off topic.\n\nThe meaning about the song in my opinion is that he is talking about a girl who is on the other side of the world who he is crazy in love but his neighbors think he is crazy because they don't understand his love for her. Whenever he talks to the moon he speaks about his emotion or everytime he looks at the moon he hopes she is looking at the same moon as he. \"I'm feeling like I'm famous the talk of the town\" this means that he feels like he famous because people are saying things about him about how he should let her go or say he is crazy.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni love the song but let me say just give this 1 thought gosh you all be writing something totally different and away off topic.\n\nThe meaning about the song in my opinion is that he is talking about a girl who is on the other side of the world who he is crazy in love but his neighbors think he is crazy because they don't understand his love for her. Whenever he talks to the moon he speaks about his emotion or everytime he looks at the moon he hopes she is looking at the same moon as he. \"I'm feeling like I'm famous the talk of the town\" this means that he feels like he famous because people are saying things about him about how he should let her go or say he is crazy.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nEverybody in the comment section is saying that they think this song could be about a death of someone he loves, or a break up between him and another girl.. but Iâ\u0080\u0099ve thought way ahead into what it could maybe be about?\n\r\nI was thinking that maybe he wrote the song to someone he cares about running away, since he did say that theyâ\u0080\u0099re â\u0080\u009csomewhere out there, somewhere far awayâ\u0080\u009d. \n\r\nI believe this could be true, because he still has hope in the person still being alive and that heâ\u0080\u0099ll see him/her again one day. And he does seem really eager to see and speak to them but he probably wouldâ\u0080\u0099ve still had contact with the person or had a way to find their number if it was a breakup. \r\nThatâ\u0080\u0099s just what Iâ\u0080\u0099ve thought of, it probably isnâ\u0080\u0099t true.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nFor me... its about distance between my guy and me due to conflict and additional emotional strain since to the death of my Mother. We had gotten so glued to a routine that hasnt been encouraging a connection between us. Then my Mother died and I've been dealing with the loss of her. He did not know her, so it's not a grief we cannot share together. So it's twofold. I'm in the garden when the stars come out talking to the moon hoping my Mother is on the other side talking back to me and He's in the house talking to the Moon tryin to get to me. Your not a fool. Find a way to reach the one you love.\t\t\t\t\n\t\t\t\t\n\n"}