{"comment_0": "\nThis is a song describing the author's faith. He wants everyone to know that he is helpless without God and must rely on Him for hope. The author knows he's not alone. \n\r\nThe rap goes into a beautiful picture of salvation in Christ. The author found himself a passenger in a broken-down hearse (hopeless life). The driver (God) planned a new route, though. A taxi (Jesus) appears, and the author was packed into the back in his coffin. When the author opens the coffin, he sees he's been fighting against his inevitable death, but couldn't get out on his own. When he asks the three men up front (the Trinity) what happened, and they explain what they had done. They assure the author he can hope. He's been freed from his death, his guilt, and his fear.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThe last stanza is really something to marvel at. So much is happening there. I found some really neat imagery in there, all you have to do is dig a little.\n\n\"Then there were three men up front\"\nThis represents the three persons of the trinity.\n\n\"All I saw were backs of heads\"\nGod shows himself, but not always in the most obvious ways. This line is setting up what is about to happen.\n\n\"And then one turned around to say\"\nWhich person of the trinity showed their face? Oh yeah. Its Jesus. Jesus is the nly one to ever come to earth in the human flesh and TELL us the way to heaven. This line is also setting up this next part.\n\nWe are going to break up this chunk, but stay with me here.\n\n-1-\"We're driving toward the morning sun\"\n-2-\"Where all your blood is washed away\"\n-3-\"And all you did will be undone\"\n\n1. Jesus tells us that we are on our way to heaven. He tells us how to get to heaven.\n2.This is pretty chilling to me, but the blood of Jesus is talked about a lot in the New Testament. Especially at the crucifixion. It is said that Jesus took away our sins on the cross with his blood.\n3.Back to him taking away our sins on the cross.\n\nTwenty One Pilots uses the metaphor of a car in several of their songs. In most of the songs, a car drive is a metaphor for someones life, i think this song is no different.\n\nIt sounds like to me that This last part is about him and God.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nMan, this song just means everything to me. I'm not religious whatsoever, but it just for me describes my struggles with depression, the night, and starting over. That last line of his rap is just... so powerful for me. I love it so much and I can listen to it on repeat for hours.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI agree with much of what others have posted here, but I wonder how many appreciate the allegorical significance of the taxi cab itself. Unlike the hearse, which takes its cargo to a cemetery or crematorium -- or even an ambulance, as some have suggested, which takes a patient to the nearest hospital -- a taxi cab symbolizes true free will: it'll take its passenger wherever he or she wants to go, with no predetermined destination. Of course, the same could be said of a limousine, but a taxi cab -- most especially a \"beautifully PLAIN taxi cab\" -- is affordable by anyone, the common man as well as the rich man. I believe the songwriter is telling us that salvation is a free will choice that's open to everyone.\n\nAnd to those arguing that the last lines of the rap represent a hospital and/or post-hospital therapy instead of Christian salvation, I respectfully suggest you consider the writer's choice of words more carefully. We go to hospitals to treat our ailments, and we go to therapy to learn how to cope with our lives. But these lyrics describe a more fundamental forgiveness only possible through salvation: having our sins (blood) washed away, and undoing whatever harm we've done.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nOkay honestly, to me this song is like...i can listen ro it as many times as i want without getting bored of it.\r\nIn my opinion this song has to do with the religious concepts. Like the three men are the trinity and all he could see were the backs of heads, God presents himself in different ways. The hearse is what carries the coffins to the cemetery and when the three men stole him from his \"fate\" (death, or like hell) they put him in the taxi. Which was his second chance at life, his other way (Jesus).\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI really, REALLY don't feel like this song, or any of their songs in general, is about faith or God or any of that feel-good shit.\nEveryone knows their songs are primarily about mental struggles and mental illnesses.\nSo here is my interpretation:\nThis song is about depression.\nThe narrator (not necessarily Tyler) is struggling with his feelings about someone, and fighting their own brain in an attempt to be happy for once. \"You're by my side until my dying days\", \"a breathless piece of death made just for you\".\nAforementioned narrator is feeling particularly low, and starts having suicidal thoughts.\nThe narrator attempts suicide somewhere between Verse 2 and Chorus 2.\nThen, the story becomes more interesting.\nMy colleagues were right here in saying that Verse 3 (aka the rap) is a metaphor.\nBut it's not about finding faith.\nThe last verse is a metaphor for the hospital visit and therapy after the attempt.\n\"We had to steal him from his fate\"=saving his/her/their life\n\"The hearse ran out of gas\"=the narrator couldnt go through with the suicide attempt\n\"A beautifully plain taxi cab\"=an ambulance\n\"Where my fingernails had fought\"=the scars from cutting his/her/their wrists\n\"Someone must have picked the lock\"=the narrator felt that someone or something freed him/her/them from their suicidal thoughts\n\"Morning sun\"=a bright and happy future\n\"Where all your blood is washed away and all you did will be undone\"=could refer to the ER or therapy\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI just don't think his songs are strictly about his faith. I really like the idea of the rap being a suicide attempt- and him finding his way back to sanity- which he needed his faith to do, and relied on that. But I don't think any of his songs were written strictly about his faith. They're not a Christian band, but he does express his faith freely.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe great thing about it is that it means whatever you want it to mean. That is what art is after all, open for interpretation. That's why Tyler doesn't sit there and break down the meaning behind the lyrics that he writes because that's just what it means to him. I'm fairly confident that this song was written based off of religion. However, it's still one of my favorite songs, though I'm an atheist. Despite knowing Tyler wrote this based on a concept that I don't believe in, I have attached my own meaning to the song and it inspires me. There's no incorrect interpretation to music.\t\t\t\t\n\t\t\t\t\n\n"}