{"comment_0": "\nNo girl, thank u for this song! Congrats to Ariana Grande for releasing a pop song that is basically the anthem for girls who have been in their fair share of failed relationships! Ariana has been in the public eye a lot lately and honestly, I think the world has been waiting for her to make some kind of statement since the death of Mac Miller and since she broke off her engagement to Pete Davidson.  In the song, she says that her exâ\u0080\u0099s taught her love, patience, and pain and that she turned out amazing because of it. Which honestly is a message I love. This song is setting a great example to a lot of girls out there that itâ\u0080\u0099s important to love yourself, and be in a relationship with yourself, and that you donâ\u0080\u0099t need a man to be amazing. \n\nI especially love how relatable this song is. Usually, girls tend to bash and hate their ex boyfriends for hurting them but Ariana sends the message that sheâ\u0080\u0099s actually thankful for her ex because of how she turned out. Her releasing this song is the best clap back that she could have given to her haters out there that even though sheâ\u0080\u0099s been through hell, sheâ\u0080\u0099s still on top. Ariana Grande turns lemons into lemonade. I applaud her for her maturity and for her using her voice in an inspirational way.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAriana is bringing us another one of her famous move on and love yourself breakup songs. As in her previous songs, Ariana reminds us that loving ourselves is the most important and that no matter how many failed relationships we have, there will always be a next one. The part of this song that really stands out is the first verse where she takes a moment to thank all of her exes individually for the lessons they taught her. She shows us that having animosity isn't necessary after a breakup, because each relationship teaches us something, even if that person wasn't \"the one.\" The entire second verse is dedicated to the reflection inward and how much can be learned from being on our own, too. Ariana continues to cement herself as a queen in the music scene, not only with her female empowerment jams, but also with messages of love and gratitude.\t\t\t\t\n\t\t\t\t\n\n"}