{"comment_0": "\nMan I cannot believe nobody has said anything about this song yet, this is crazy. Well alright I guess Ill just tell yall my story cause there's nothin to figure out bout this song. This song means a whole lot to me cause my dad is actually in rehab right now as I right this recovering from alchoholism. Weve tried to stick beside him this whole time but it is the hardest thing in my life to sit there and watch my family destroyed because of this disease addiction. My mom has done a great job for the past say 12 years covering everything and trying to get through this. Hes been through plenty of rehabs but none that actualy worked permanently. Recently before we took him to rehab this time which is hopefully the last I havent had a father. I mean how could I when he wasnt there and the only time i saw him was when he came outta his room to go get beer. And I know this doesnt sound like that bad of a story but for a kid who has to cover up his tracks help his mom cause shes always stressed and then deal with a little brother its been horrible. Its finally coming to an end and I am so thankful. This song just means alot to me cause it reminds me of so much of what we go through. Well i guess thats all I have to say.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI totally love this song. I can relate it to a lot aspects of my life not just drinking and doing drugs.  \r\n\"Well, they started talkin bout steps you take \r\nMistakes you make \r\nThe hearts you break \r\nAnd the price you pay \"\r\nFor every action there is a reaction and there's always a price you have to pay for decisions that you make.  Made me think a lot. And realize that it's not just me; there's someone out there right now that can stand up and repeat my life word for word, made me feel a little less alone.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nKenny sings this song straight to my heart.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis song makes me cry everytime I hear it... My dad and two of my uncles are alcoholics, and we've been trying so hard to get them to stop drinking, for so long now, but they never quit, so it really tears my family apart. I made my uncle listen to this song, hoping that it would get through to him, but it didn't which was suprising because it's such an amazing song and really rings true to his life.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI really love this song because it's about alcoholism, recovery, and the 12 steps. It's simple .....and Kenny Chesney is SO freakin HOT....sorry but he is.....hehe\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nTo me, this song is all about how a man's alcohol addiction tore his family apart. He has now admitted and accepted that he has a drinking problem and is seeking help at a 12 step meeting and he wants his ex wife/girlfriend/SO there to support him. Beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIt makes me having great respect for people who tell their story at rehab and help others (and themselves). Keep strong.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song makes me so sad. I was married for 12 years and alcohol completely tore it apart. My wife was one of the most beautiful, sweetest people you could ever know.. when she was sober. Booze turned her into someone I didn't know anymore. She tried hiding it for the longest time, but that only works for a while. The lies and BS that came with drinking just got to be too much. I begged her to get help, and of course an alcoholic's reasoning is that they can quit anytime they want. Well, we split up 4 years ago. I just recently went home to finalize a divorce with her, and it was the first time I had seen her in that 4 years. It is so sad to see what alcohol does to a person. She used to be beautiful and sweet and now... well, things change. Deep down, I know there is still love between us, but as long as she refuses to accept her problem, then there is nothing. I just hope one day she sobers up and realizes what she lost. One step at a time, honey...\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nIt's definitely about a guy going through AA; Most country songs are not that hard to figure out; Leave the difficult lyrics to the rock category! However, I find it rather disturbing that this is the same guy that sings, \"I'm gonna sit right here & have another beer in Mexico\", plus the obscure tracks, \"Tequila Loves Me\" & \"Got a Little Crazy Last Night\".\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI am currently an alcoholic due to this week, My grandma died, and i am broken hearted the woman i love just wants to be friends and friends tend to do theor own thing and im going tin the army in 3 weeks. im so down and i cant seem to pick myself up/.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nthis is a beautiful song. it is definitely about alcoholism. and the 12 step program of recovery. this is very well written and from the heart, also so true. definitely hits home. \n\n\"I couldn't believe what I heard\nIt was my life word for word\nAnd all of the sudden it was clear\"\t\t\t\t\n\t\t\t\t\n\n"}