{"comment_0": "\nThis song follows Bruno telling a girl all the things he has and likes, and saying that she can have anything she likes too.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAgree with @Mellow_Harsher it is Bruno bragging about his riches and fame to impress a girl. Guessing he isn't targeting girls with high self esteem or who are simply looking to be gold diggers.\n\r\nHow many times can Bruno rehash this theme and still keep getting number 1 hits???\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nInteresting that at the moment this is number 1 on the Billboard charts and number 3 is Kendrick Lamar's \"Humble\" ... which is pretty much a satirical attack on artists singing about what Bruno is exactly about in this song.\n\r\nBruno obviously didn't get the memo regarding being humble ... you might have to message him again Lamar.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI got a gun no girls, girls gotta die\r\nwake up with no hhhuuueÉ\u0098Ï\u0085Ï\u0085Ï\u0085Ê\u009cÊ\u009cÊ\u009c JulioioioioÌ¸Í\u009bÍ\u0094hÌ´Í\u0080Í\u0087hÌ¶Í\u0091Ì°hÌ¸Ì\u0086Ì\u0096hÌ·Ì\u008eÌ¢hÌ´Ì\u0085Ì¼hÌ·Ì\u008fÌ§  \r\nI can I canâ\u0080\u0099t baby jeans. You and your pe nis inpoopments   Ì·Ì\u0080Í\u009bÌ\u0081Í\u008cÍ\u009dÌ\u0095Í\u0090Í\u0098Ì\u008aÌ\u008fÌ©Í\u0095Ì\u009eÌ¼Ì\u009dÌ\u0098Ì\u0098Ì»ÌºÌ¦Ì¥Í\u008eÌ®Í\u0087Ì£Ì¼ Ì´Í\u0090Ì\u008dÍ\u0098Í\u009dÍ\u008cÌ\u008bÌ\u0093Ì\u0082Ì\u008bÌ\u0087Ì\u008bÌ\u0095Ì\u0083Ì\u0089Í\u0098Ì\u0092Í\u0084Ì\u0091Í\u0084Ì\u0089Í\u0088Í\u009aÍ\u009cÍ\u0089Í\u0088Í\u009aÌ°Í\u0093Ì¼Ì£Í\u0087Ì\u009fÍ\u0093Ì¡Ì²Ì£ ÌµÌ\u0090Ì¾Ì\u008eÌ\u0091Í\u0080Ì\u0080Í\u0081Ì\u008cÍ\u008bÌ\u0080Ì\u008dÌ\u008dÍ\u0084Ì½Ì\u0080Í\u0082Ì\u008fÌ¿Ì\u0094Í\u0083Ì¥Ì Ì¼ ÌµÍ\u008bÌ¿Ì\u0088Ì\u0083Ì\u0089Ì\u008bÌ¿Ì\u0081Ì½Í\u0082Ì\u0091Í\u009cÌ Ì¹Ì¨Í\u008eÌ£Ì\u009dÍ\u0099Ì¹Ì¦Ì¹Ì\u009dÌ\u0098Ì¯Ì²Ì®Ì¹Ì³ Ì¸Ì\u0084Ì\u0090Ì\u0093Í\u008aÌ\u0087Ì\u009aÍ\u0084Ì\u0080Ì\u0081Ì\u0087Ì  Ì´Ì\u0092Ì\u0094Í\u009dÌ\u0086Í\u0092Í\u008bÍ\u009dÍ\u009bÌ\u008eÌ½Ì¿Í Ì½Í Í\u008aÌ\u0094Ì\u0083Ì\u0094Ì\u0080Ì\u009aÌ£Í\u0088Ì\u0098Ì\u009eÌ\u0097Í\u0093Ì\u009cÌ¤Í\u0088Í\u0088Ì\u0099 Ì·Í\u0097Ì\u0086Ì\u0082Ì\u008cÍ\u008cÍ\u0080Ì\u008aÌ\u0088Í\u0084Í\u008cÌ\u0095Í\u0083Ì\u0086Ì\u009bÍ\u009dÍ\u0086Ì\u009bÍ\u009aÍ\u009cÍ\u008eÍ\u008eÍ\u0088Ì±Ì¦Í\u0089Ì»Ì¯ Ì¶Í\u0090Ì\u0091Ì\u0088Ì\u008eÌ½Ì\u008dÌ\u0083Í\u008bÍ\u0086Ì\u0083Ì\u008aÍ\u0092Í\u0091Ì\u0084Í\u0080Í\u0098Ì½Í\u0097Ì\u008dÌ\u0083Ì\u008eÍ\u0081Ì\u009aÌ\u008eÌ\u0091Ì\u0089Ì³Í\u009aÌ¹Í\u0096Ì¥Ì¡Í\u0087Ìª Ì¸Ì\u009aÌ\u0094Ì\u0083Í\u008cÍ\u0086Ì\u0082Í\u0080Í\u0097Ì\u0085Í Ì\u008fÌ\u0092Í\u0086Ì\u0097Í\u009cÌ¥Í\u0088Í\u0094Ì©Í\u0094Ì»Ì§Í\u009cÌ¢Í\u0099Ì²Í\u0088Ì£Ì°Ì\u009fÌ¬Ì­Ì¦Ì\u009eÌ Í\u0087Í\u009c Ì¶Ì\u0093Í\u0084Í\u0084Ì\u008dÍ\u0092Í\u0099Ì§Ì®Ì¨Ì³Í\u0095Í\u0088ÌªÌ«Í\u0093Ì\u0097Ì¯Í\u0096Ì¨ Ì¸Í\u009dÌ\u0094Ì\u0095Ì¾Í\u0086Í\u0086Ì¿Ì\u009bÍ\u0091Ì\u0091Í\u0098Ì\u008dÍ\u0091Ì\u0095Í\u0096Ì» Ì¸Ì¿Í\u0083Í\u0097Ì\u008dÌ\u0084Í\u0084Ì\u0089Ì°Ì¯Ì§Í\u009cÌ¨Í\u0099Ì±Í\u0094Ì Ì­Í\u0085Ì\u0099Ì²Í\u0094Ì¼Ì³Ì­Ì¦Ì¹Ì«Í\u0094Ì\u0096Ì\u0099 Ì¶Í\u0091Ì\u0085Ì\u0088Í\u008aÌ«Ì§Ì®Ì£Ì\u009dÌ Í\u008eÌ°Ì\u009cÌ\u009cÌ\u0097Í\u009cÍ\u0096Ì®Í\u0093Í\u0089Í\u0099Ì¯Ì¨Í\u0099 Ì¸Í\u0081Ì\u0089Ì¿Ì\u0090Ì\u0085Ì\u0089Í\u008aÍ\u009dÍ\u0098Ì\u0086Ì\u0095Í\u008bÌ½Í\u0084Í\u0084Í\u009dÌ\u0090Í\u0083Í\u0098Ì\u0081Ì¿Ì\u0092Í\u0098Ì\u008aÌ\u0084Ì¾Ì¬Í\u0095Í\u0094ÌºÌ¡Í\u009cÍ\u009aÌ\u0098 Ì¸Í\u0082Í\u008cÍ\u0080Ì\u0085Ì\u0085Ì\u0085Ì\u009f Ì¶Ì\u0091Í\u0084Í\u008cÌ\u008cÌ\u0082Í\u008cÌ\u0081Ì\u0093Í\u0089Ì\u0098Ì\u009fÍ\u008eÌ¨Ì£Ì³Í\u0096Ì\u0097Ì© Ì¸Í\u0086Í\u009dÌ\u0083Ì°Ì±Í\u0088Ì£Ì\u009fÍ\u009aÌ©Ì  Ì¶Í\u0081Ì\u0091Í\u0092Ì\u0080Í\u0083Ì\u0080Í\u0091Í\u0091Ì\u0084Ì\u0080Ì\u0080Í\u0082Í\u0086Ì\u0080Ì\u0087ÌªÌ¼Ì\u009eÌ¨Ì\u0096Ì\u009dÌ¦Í\u0094Í\u0089Ì²Ì©Ì±Í\u008dÌ±Í\u0087Í\u008dÌ\u0097ÌºÌ¡Ì\u009eÌ¨Ì§Ì¨Ì¦ Ì¸Ì\u0087Ì½Í\u0098Ì\u0080Ì\u0082Ì\u0081Í\u0091Í\u009dÌ\u0095Ì¢Í\u0099Í\u0094Í\u0087Í\u0096Ì Ì¨Ì¥Í\u0095Í\u009cÍ\u008eÌ\u0096Ì«Ì\u0097    \n\r\nJJJUUU UUUUUU Ð\u0098Ð\u0098Ð\u0098Ð\u0098Ð\u0098Ð\u0098Ð\u0098Ð\u0098Ð\u0098 HHHHH jushjush\r\n                                                          Ê³Ê³Ê³Ê³Ê³Ë¡Ë¡Ë¡Ë¡Ë¡Ë¡Ë¡ á´®Ê·á¶¦áµ\u0096\r\n                                                É¢á´\u009cá´\u009cá´\u009c\r\nï¼ª ï¼µ ï¼­ ï¼°  in the CAAC , gáµ¤áµ¤        \t\t\t\t\n\t\t\t\t\n\n"}