{"comment_0": "\nThis song means \"Don't take advantage of the things that you have right now.\"  And the good stuff isn't always there.\n\n\n", "comment_1": "\nI adore this song so much.  Don't take for granted what you have because someday it may be gone.  When I get married, I want it to be exactly like this, if being that perfect is possible.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nWhen I hear this song, I think of riding in an old pick up truck with a guy who I was so in love with and his best friend and those two young men just singing their hearts out. It's a song that every generation can appreciate. The young generation is looking forward to all of \"the good stuff\" and the older generations are glad they've lived it.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI LOVE KENNY CHESNEY AND THIS SONG ROX!!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI love this song- it's so real and true.  It makes me appreciate the important things in life!  GO KENNY!!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nwell, I used to hate country and everything about it...but come on, who doesn't like to kick back with some beer listening to kenny chesney? especially this song! one of my friends plays it on guitar when we're all drinkin...its a great song..and i've learned to love it.  I think its just about concentrating on the little things in life, and the bartender is telling kenny chesney about how he lost his wife...\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nwow... such hate... *shakes head in disgust* this song is beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nTHANKS.ANYWAYS,i love this song and its about not taking things for granted and stuff like that.I love Kenny.Edited by Matty on December  6 2005, at 05:44AM\n\n\n", "comment_8": "\nanways..this song is about how kenny got into a fight w/ his chick..and goes to a bar to blow off some steam...then the bar tender tells him that he needs to apologize to his g/f, and not end up like he did becoming an alcoholic and not getting to really be with her kuz the good stuff is actually being there with her...and inlove\n\r\n-- Edit: Removed Inappropriate comments.. --Edited by Matty on December  6 2005, at 05:42AM\n\n\n", "comment_9": "\nwhy dont we just ignore people like accrazy003 cause all he wants to do is have peple pissed of at him. anyway its is a great song. with a lot of meaning and heart. i love it\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nSad song, and I'm not even into country. Blame my mother, dammit.\r\nAnyhoo. Very sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nBeautiful song, gets me everytime.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nme and my best friend used to sing this song everynight.  she moved away but we remained best friends.  everytime i hear this song i think of her and she thinks of me when she hears it.  i love you tracy and miss you so much!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nGREAT SONG! This is the song that got me to like country music...\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI do wish every man runs into a bartender like this after \"the first big fight\" ...\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nDoes anyone else catch that he says she died a year after they got married - but she saw thier youngest son get married? I lovvvve this song, but have never understood that...\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nYeah!! thats what i was tring to find out! haha if someone knows what is going on there please enlighten.... ive spent so much time trying to reason it out and it doesnt make sense to me, did she die right away and how did she see their son get married??\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nIt just says that the picture he's looking at was taken a year after their wedding. She didn't die for a while after that.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI think she died after the son was married.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nyeah great song.  it means the picture was taken a year after they wed.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nMy favorite Kenny song he doesn't play it live as much as he should.\r\nIt's so beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni've always listened to this song and sung along and all, but for the first time today i actually listened to the words. and i cried. its just a really simple way to sum up how love feels. perfection.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThis is an amazing song, but every time I listened to it I was always confused because it sounded like the wife died a year after they were married. It didn't occur to me that it was the picture itself that was \"Taken 'bout a year\" after they got married. Now the song makes alot more sense :).\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nWow..I love this song..everytime I listen to it I listen to the lyrics carefully and get goosebumps!\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nwhat a cute bartender lol\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\ni feel like i have to clear this up. He sais \"taken about a year after we wed...\" The PHOTO was taken, not her. I know i was saying to myself \"How can she be alive when their son marries, even though they were only married for a year?\" lol. Anyways besides the extremely desperate \"ill have some of that...\" line, this song is very good. well done\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ni love how he writes and makes it suit reality perfectly.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nGreat song!  A celebration of the moments that add up to a good life with your life partner, and how even things that seem trying at the time can become precious with time.  Plus *news flash* trying to drown your sorrows or frustrations with booze isnâ\u0080\u0099t the way to a good life.  The passage of wisdom from an older, wiser man to a less- experienced young one is a great theme, too.  This song makes me misty-eyed (and choked up) whenever I hear it.\n\r\nI also think thereâ\u0080\u0099s a bit of a magical angle; the bartender seems to know exactly why the young man is there even though thereâ\u0080\u0099s no indication they know each other, they have the bar completely to themselves for quite a while, and the young man felt somewhat compelled to go there.  The bartender seemed like a spiritual guide to help the younger man choose a path that will prove very fulfilling.  Perhaps he is a spirit; â\u0080\u009csoulâ\u0080\u009d is used, rather than â\u0080\u009cpersonâ\u0080\u009d, or some such. \n\r\nThatâ\u0080\u0099s another mark of a good song, too; giving you more to think about!\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nGreat song to put things into perspective. The \"good stuff\" is also the most important stuff in life. Sometimes it's all too easy to take for granted or want more or be dissatisfied, but in the end, these are the moments! So, drink it up! Perfect song to play on your anniversary to remind you...\t\t\t\t\n\t\t\t\t\n\n"}