{"comment_0": "\nI wrote the song because Anita and i would argue at a constant pace and I would always tell her to unleash the dogs and burn the bridges as a way of saying you can say what you feel but forget the past and let's move forward. in an argument one always has to stand down until the other quits. this cleans off the slate. the first verse contemplates arguing all night long until one gives in and they embrace each other and start over. this was not one of my \"dark\" songs. I write what I feel and I was not feeling \"dark\". if you want \"dark\" then immerse yourself into murder ballads. thank you\n\r\nNicholas Edward Cave\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI think that is a fair interpretation, however, I think it could also be about forbidden love, an affair, not just old lovers.  It's clear that they are old lovers with a history.  Burning bridges, makes me guess that she is married.  Finding myself in a similare situation in my life, I find the line \"We make a little history, baby/Every time you come around\" especially beautiful.  Inside of a relationship that can have no future, I found myself telling my lover that I will remember him when I am an old woman.  Sometimes life is complicated, like a good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI love this song. Giving yourself entirely to another person. That's all. Come what may, ships, dogs.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think \"come sail your ships\" means a battle is about to begin: he sees courtship as a war, but in a playful sense, it's not a sad song. I suppose \"and let your hair hang down\" refers to war too: the woman is seen as a warrior goddess. These lyrics are really haunting, it's one of my favourite Nick Cave songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nit really surprises me that no one has commented on this song before...it's just beautiful. i'm not too sure whether i understand all the lyrics, but i love it. \r\ni would b glad if someone could tell me what is meant by\r\n*Come sail your ships around me*\n\r\nis it referring to his want to have her near him?\r\nor could it be interpreted as sexual?? \n\n\n", "comment_5": "\nI agree with Lady Evelnhair, this is a beautiful song.  I love it.  I have only heard the version with Concrete Blonde and it is so good.  \r\n My favorite lines are:\n\r\nYour face has fallen sad now \r\nFor you know the time is nigh \r\nWhen I must remove your wings \r\nAnd you, you must try to fly \n\r\nIt is about letting someone you love go.  It may be sad, but it is the right thing to do.  Although, I have always wondered why the songs speaks of \"removing wings\"  when it is hard to fly without them?  Perhaps that is the irony in it?\n\n\n\n", "comment_6": "\n\"We talk about it all night long\r\nWe define our moral ground\r\nBut when I crawl into your arms\r\nEverything comes tumbling down\"\n\r\nTalk about a weird verse...\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni think this song is about inspiration. the process of creation. \r\nit's always a struggle. taking from some unknown source. working as a tool for something you may not fully understand. \n\r\nyou can define a moral ground, think of it as a craft, put it in a 'frame'. but when it comes to 'painting' - rules are no longer valid. they're useful as a rational background. hints for the person who encounters it, leading to the certain emotional path. but the process of creation remains a mystery. \n\r\ncome sail your ships around me\r\nand burn your bridges down\r\n- an invitation for a brand new journey\n\r\ncome loose your dogs upon me\r\nand let your hair hang down (image of tranquility)\r\n- haunt me with ideas and watch the clash\n\r\nyour face has fallen sad now\r\nfor you know the time is nigh\r\nwhen i must remove your wings\r\nand you, you must try to fly\n\r\nlet's say that inspiration is personified as an angelic vision of a woman. with wings being a symbol of freedom but also of a womb. her face is sad, she feels the end is near. the work is done. another gulf has its bridge. \r\ni think that's the most difficult/important part in the process of creation - knowing where the thread changes its structure. the moment when you say 'cut'. you see the birth of something that has its own life. \r\n'remove your wings' - remove protection. you must try to fly - find your way to people. inspire. 'grow your own wings'. \n\r\nthis song is more than a song. it's a description of a particular frame of mind. that's the way i see it. \r\nbut the most important beauty of any song, poem, painting, (...), is the fact that anyone can understand it in his/her own way. if it strikes a chord, develops something new in you every time it comes around - the work is done. the circle is closed.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think this song is about two ex-lovers that continually go back to each other.  \n\r\nThe two lovers have a history of each time they meet they make love.  But this time when they meet again, they donâ\u0080\u0099t want to let this happen because they are both very guarded and hurt during their on and off again relationship.  When they talk about their moral ground, I feel that it is they are agreeing to not make love.  However, when they are in each other embrace â\u0080\u009ceverything comes tumbling downâ\u0080\u009d and they can no long resist the urge to make love.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI think this song is about two ex-lovers that continually go back to each other.  \n\r\nThe two lovers have a history of each time they meet they make love.  But this time when they meet again, they donâ\u0080\u0099t want to let this happen because they are both very guarded and hurt during their on and off again relationship.  When they talk about their moral ground, I feel that it is they are agreeing to not make love.  However, when they are in each other embrace â\u0080\u009ceverything comes tumbling downâ\u0080\u009d and they can no long resist the urge to make love.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nvery good interpretation. i agree with you. after reading it i realized i was misinterpreting the song myself. btw i like it better now ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nvery good interpretation. i agree with you. after reading it i realized i was misinterpreting the song myself. btw i like it better now ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nSimply one of the greatest love songs ever written, with a semi-dark undertone typical to Nick Cave. Man I want to see these guys live, had a chance about a year ago but ended up getting into them just after that. I hate how that always seems to happen to me...\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think you are all right on this song, I also would like to add to the lovers interpretation that the song also play's with the idea that \"no man's an island\". In the song the lyrics affirm the character as an island, thus the song is also a reassurance of your space in any relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI also thing that, and I hate to say this, but theres one moment in the beginning, just that one moment!, this song sounds just like \"Hard to say I'm sorry\" by Chicago lol\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nFor the singer and the subject to be together means breaking social boundaries, perhaps the subject's friends object, hence the bridges being burned.  She's a mystery to him because he doesn't understand why she is attracted to him, and on each of the rare occasions that they meet, it's so significant that history is made.\n\r\nEven though they discuss how they can't be together, and set out where they're coming from - ie their moral ground - they can't resist the tie that binds them.  It's a really difficult situation, when you love someone, but everything dictates that you shouldn't be together.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis is a very special song to me. I had a girlfriend when i was 20 and she was my first love and this was 'our' song.\n\r\nOne time we listened to it after we had a fight and were sitting on the couch and we nearly cired, it has so much emotion.\n\r\nAs far as meaning goes, i think its about a loving couple having a fight, it seems nic is sacrificing himself allowing to be surounded by her ships. Maybe he is doing it out of love.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nHello everybody. I hesitated a lot if to write here or not but then I read what you guys think about this WONDERFUL song and I couldnˇt resist anymore...I love it now even more after reading all the interpretations cause I realised that in this song Nicky writes about something that happened to me as well...And the emotions in the song are so strong and brilliantly described...\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI thin The Ship Song is another Nick Cave's song about some kind of love, relationship, about position of man and a woman in it. As in usual, this time, the woman is interpreted as a fragile but wild child ( there is also connection with Ship Song video, which, as Nicka said, had to describe the relationship between children and adults )with unpredictable actions and. The man is a \"story teller\", there is no much space dedicated to him, what is understandable. \n\r\nI love this song, the plot, the interpetation, everything... it reminds me about much...\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nthis song can have many different meanings to different ppl...  i only just heard this song ... but still cant make a proper relation to it yet...\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI agree with gummitch. it is about lovers going into a relation ship. its beautiful and warm but one must give up his freedom and let go because in love you cant make rules. hens the lines:\"We talk about it all night long\r\nWe define our moral ground\r\nBut when I crawl into your arms\r\nEverything comes tumbling down \"\r\nany attempt to set up ground rules is going to fail.\n\r\n\"Your face has fallen sad now\r\nFor you know the time is nigh\r\nWhen I must remove your wings\r\nAnd you, you must try to fly \"\n\r\nwe all want to be free but he is taking off her wings because now they are lovers and partners, she is no longer free to fly, she is confined to him.\n\r\ntruly a beautiful song\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI enjoyed reading the different views on the song. I think the beauty of it is that everyone can relate to it in a certain way. To me it sounds so much like the thing I went through with my ex. I loved her (and still do) so much, but she cheated on me. And I don't even think she intented to do it, but more because she felt afraid in our relationship and not ready to commit yet. So anyway, I can really relate to the different lines of the song in this way.\n\r\nCome sail your ships around me\r\nAnd burn your bridges down\r\nWe make a little history, baby\r\nEvery time you come around\r\n- This is saying that she should come to me, sail her ships around me and burn the bridges after her. Choosing for someone and don't look back. 'Cause we're great when we are together, making history.\n\r\nCome loose your dogs upon me\r\nAnd let your hair hang down\r\nYou are a little mystery to me\r\nEvery time you come around \r\n- This could be interpreted as hurting someone (loose their dogs upon you) and giving up on a relationship (letting the hair/head hang down). The coming around here can mean changing their feelings towards you instead of the physical interpretation of coming over. This also adds to the mystery part, since it is a mystery why they can change the feelings they have for you.\n\r\nWe talk about it all night long\r\nWe define our moral ground\r\nBut when I crawl into your arms\r\nEverything comes tumbling down \r\n- This I can relate to very much. I always said I would never let anyone cheat on me. That was like a moral ground for me. But when you are in the arms of the person you love, all those feelings of anger, hurt, and betrayal make way for the love you feel and you forgive them everything just to be able to stay in those arms.\n\r\nYour face has fallen sad now\r\nFor you know the time is nigh\r\nWhen I must remove your wings\r\nAnd you, you must try to fly \r\n- She is sad because she knows that what has happened is wrong and that she can't go on like this. She has to choose what she wants. And when she chooses for a relationship that means having her wings clipped in a certain way. So she must try to find the freedom she needs but without the wings, without the absolute freedom of doing whatever she wants, without thinking about anyone else.\n\r\nSo in short I think it's about the two sides of a relationship: the verses with the ship part being the good moments and the verses with the dog part being the bad ones. But if you want the relationship to succeed you have to get past those bad moments and accept giving up certain things in return for others.\n\n\n\n\n\n\n\n\n", "comment_22": "\nits about a couple fighting and then one of them (presumably Cave) stopping and letting the other win to end the argument and sort of start over\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nA good half of the lines in this song are specific literary or historical references to war.  Usually stuff like \"Love is a Battlefield\" presumes that's a bad thing, that either it's a necessary evil or it's a relationship that's toxic.  This doesn't do either.  It welcomes, invites, embraces the engagement, even as it acknowledges the upcoming carnage.  It's an interesting theme.\n\r\nIt also lets you imagine the song as correspondence between the rulers of nations, if you like your romance *really really epic.*\n\r\nLine by line:\n\r\nCome sail your ships around me       >>> Siege, notably Troy's \"face that launched a thousand ships\"\r\nAnd burn your bridges down           >>> Preventing your own retreat by burning bridges or boats is a terrifying morale tactic, used all over the place.  It says there can be no compromise.\r\nWe make a little history, baby       >>> What are history books punctuated by?\r\nEvery time you come around \n\r\nCome loose your dogs upon me         >>> \"Cry havoc, and let slip the dogs of war!\" Translation: \"Oh, it's on now.\"\r\nAnd let your hair hang down          >>> And a swerve into Song of Solomon-style intimacy for the rest of the chorus.\r\nYou are a little mystery to me\r\nEvery time you come around \n\r\nWe talk about it all night long\r\nWe define our moral ground         >>> Most wars start with a lot of diplomacy in which people try to both get what they want and look like the good guy.\r\nBut when I crawl into your arms\r\nEverything comes tumbling down     >>> Which all goes out the window when the cannons start.\n\r\nYour face has fallen sad now\r\nFor you know the time is nigh\r\nWhen I must remove your wings\r\nAnd you, you must try to fly        >>> No direct references to war in this verse, but the part about flight lends itself to siege interpretations; both sides can't win in this situation, and one side's freedom/integrity is in question.\n\n\n", "comment_24": "\nBy the way, this song makes me all schmoopy about the Doctor and River Song, who are a passionate disaster in the making no matter which direction you walk from.\n\r\n\"We make a little history, baby, every time you come around.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nTo me this is about being tempted by someone while in a relationship with someone else. We used to stay up all night talking about how nothing could ever happen between us. But as soon as there was contact, everything was out the window. The 'moral ground' is the limits of what they believe they should or should not do - cheating etc. The time is nigh, removing wings and trying to fly, is trying to live without each other, trying to forget about each other, despite being in love. Very painful song, and so accurate to those feelings of denying what may be true love because of some kind of boundary. \t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nAs one of the other posters commented I think this song is about the process of creation. I once read an article about Nick Cave where he talked about his muse. I think this song is about Nick Cave's muse, personified in the form of a woman - \"We make a little history baby, every time you come around\" specifically makes me think that. His muse has inspired him to write popular songs that have made him famous, or \"made history\".\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI wrote my comment that this was above his muse and and then read this in one of the above postings:\r\n\"I wrote the song because Anita and i would argue at a constant pace and I would always tell her to unleash the dogs and burn the bridges as a way of saying you can say what you feel but forget the past and let's move forward. in an argument one always has to stand down until the other quits. this cleans off the slate. the first verse contemplates arguing all night long until one gives in and they embrace each other and start over. this was not one of my \"dark\" songs. I write what I feel and I was not feeling \"dark\". if you want \"dark\" then immerse yourself into murder ballads.\"\n\r\nWhen I read this I thought my interpretation was wrong. But then I read on wikipedia:\n\r\n\"Cave dated Anita Lane from the late 1970s to mid 1980s. She had an undeniably strong influence upon Cave and his work, often cited as his \"muse\".\n\r\nSo I think my interpretation could be part of his interpretation about his relationship with Anita.\n\n\n", "comment_28": "\n\"For you know the time is nigh\r\nWhen I must remove your wings\r\nAnd you, you must try to fly\"\n\r\nhe's touched her soul (removed her wings) in a way that she can never really be (fly) far from him.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI really love Nick Cave's 'The Ship Song'.  Its redolent of sentiments in Bob Dylan's Just Like a Woman.\nThe 'boy/man' likes the 'girl/woman'.  But sadly for the 'boy/man' the 'girl/woman' desires to grow up and become \"independent woman'.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nCan someone tell me (hopefully thestaggerlee him self), what is the right word on \"Every time you come around\" the word \"come\". Everywhere it's printed \"come\", but it definitely can't be the right word, unless there's a very strange way to pronounce it  ? Thank You.\n\nNiilo Luola\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nWow, I never seen the artist tell what the song means to them on this site, it's rare that they even say that in interviews. Very cool song.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nMaybe he wants her to leave him, but he loves her too much to make that easy for her? That why he 'removes her wings' and then she has to try to fly? Maybe he thinks he is not good for her, even though he loves her..\r\nAmazing song..\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nTo me this song is about two lovers, about forbidden love, an affair. \"We make a little history baby Every time you come around\" is clear that they are seeing each other from time to time, but they are so good together. He is calling her to sail her ships around him, to burn bridges, to be just with him. This is especially clear in the verse  \"your face has fallen sad now\nfor you know the time is nigh\nwhen i must remove your wings\nand you, you must try to fly\" where he refers that he told her all that, and she knows that the time is near where he must leave her (remove your wings) and she must try to fly without him and thats why her face is falling sad. She knows she cant fly without him :( It is so sad that my heart weeps every time I hear this song.\t\t\t\t\n\t\t\t\t\n\n"}