{"comment_0": "\nSomeone's probably mentioned this before, but I'll add it anyway since it's pure awesomeness:\n\r\n\"When Brian May presented the final demo to Mercury, he had doubts that Mercury would be physically capable of singing the song's highly demanding vocal line, due to the extent of his illness at the time. To May's surprise, when the time came to record the vocals, Mercury consumed a measure of vodka and said \"I'll fucking do it, darling!\" then proceeded to nail the vocal line in one take without problems.\"\n\r\nFreddie was seriously amazing. He managed to live more in 45 years than a lot of people do in twice that. I love this song: it just captures how he lived perfectly.\n\r\nAlso, I think \"I'll fucking do it, darling!\" is going to be my catchphrase from now on.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIts about life. Replace the word 'show' with 'life'. Its saying that there are hard times in life but we should carry on and still aim high. Freddie Mercury was very optimistic, even when he found out he had aids, this was his outlook on life and if we all think about it it should be true. Its telling us that life goes on regardless fo what happens. Very meaningful.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI like to think that this song was about Freddie's attitude in the face of his final stages of AIDS.  He knew he was dying, but he fought up to the very end.  I think he felt that he couldn't give up.  Life is a battle, but despite whatver comes our way, the show must go on.  Also, I think that it was a way for Freddie to tell the world that despite his illness, he continued to make music up until the very end.  He loved his fans, and I think he wanted to please them as long as it was humanly possible for him to do so.\n\n\n", "comment_3": "\nThe song meaning is obvious, but this is just on of those songs that transcends the meaning of the words.  Listening to to Freddie Mercury sing this one is beyond any other Queen song; he lifts it up from sappy to spiritual.  \n\r\nIt carries the weight of Mozart's Requiem.  Many writers sing about dying, but very few (Roy Orbison comes to mind) have a chance to write about it when they know it's coming.  Mercury conquers death with this song (\"Fairy tales of yesterday will grow but never die/I can fly my friend\" \"I'll face it with a grin/I'm never giving in\").  The song was beautiful when I first heard it as a child; when I found out the circumstances it was truly haunting.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nIt's probably their most powerful song. To me, it means that whatever you do, don't give up !\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis is one of the most frighteningly honest songs I have ever encountered. Freddie is almost defiant in his acceptance of his fate, but in true Queen style, he infuses it with his love for all things theatrical. Social comment, regret, acceptance and optimism: this song manages to balance it all. A fitting tribute to one of the world's best lead singers.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nMagnifique!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nActually, I read that song was written by Brian May. I think he's expressing his fear: Freddie's illness was a tremendous shock for his friends. Brian is asking himself how can he cope with that. These feelings match Freddie's feelings, that's why the song is so powerful.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI was six when Freddie died, & ironically had never even heard of Queen, when it was announced he had died of his illness. I then realised that Queens music had been the background music to my life, what I heard blasting out of my elder brothers bedroom & suddenly, at six years old, it all clicked & i was hooked. I watched every tv program dedicated in Freddies' honour & as i grew older gradually bought the albums & then I heard this song, & I cried. It overpowered me, the beauty of the lyrics spoke to me & told me what Freddie had been going through & I couldn't believe how much this song called out to me. It made me understand how he felt inside & for this made me feel as though I knew this man, although at one point I never knew who he was. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nNow I'm young and had only really known the queen songs that were obvious through the media, but after a ew years started getting into it more and more.  I actually only found that this was Queen's song when I was watching \"Moulin Rouge\" and fell in love with the power of it.  After hearing I started looking for dates to see if it was at all related to Freddy's aids.  I found that Brian May wrote it, and that he did it before he really knew anything about the aids (they're pretty sure anyway). So I dunno.  Still a great song though. I'm gonna keep resaerching (cuz that's what I do) and I'll write what I find later.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI agree with napnip this song is about freedies struggle with AIDS.\r\nThe Show Must Go On no matter what you've just gotta get on with life the line 'I guess im learnin ill soon be turning round the corner now' that is a kind of innuendo of death.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThe best song!!!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nBrian May wrote this as a kind of tribute to the way Freddie kept on making music right to the end even though he knew death was coming. Brian definately knew about this when he wrote it because as soon as Freddie knew he had AIDs he got all the band members together and told them.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthe live version with Elton John singing the lyrics is ten times better than the original, a lot more dramatic.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nBrian May wrote this great song and it was the last single when Freddie was alive. It's therefore ironic that the show must go on but it also make some sense. Although Freddie was very ill at the time he just went on to make music till he really couldn't anymore. It's incredible that he still had such a powerful voice, even with AIDS raging through his body. The song is about him and I think it's clear that it is Brian May saying goodbye to a dear friend.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nWhenever i hear this song i keep going back to the 1986 wembley concert recording where freddie addressed the crowd about the rumors of queen splitting up and says \"We'll be together until we fucking well die!\" indeed they were, at least until Fred's death. It seems to reflect Freddie's attitude on life quite well, all of the interviews i've heard with him at least\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThis is by far Queen's or even the entire music world's most powerful and moving song. Just how incredibly prophetic this song is, almost brings tears to my eyes. The lyrics are so beautifully written to express Freddie's mentality throughout his battle with AIDS. Freddie's ability to sing at that age while fighting AIDS just amazes me still. Here's how i interpret some of these lyrics.\r\n\"Inside my heart is breaking, my make-up may be flaking but my smile still stays on\" - obviously referring to his diminishing health, but his positive attitude.\r\n\"My soul is painted like the wings of butterflies, fairytales of yesterday will grow but never die. I can fly - my friends.\" - He is saying that his image has been forever embedded into the memories of his loving fans, and so has Queen's legacy that can only grow and never die down. So because of this, it's ok for Freddie to leave them. This is the part of the song that always touches me.\r\n\"I'll face it with a grin, I'm never giving in. On with the show. I'll top the bill, I'll overkill, I have to find the will to carry on with the show...\" - apparently talking about Freddie's persistence in creating beautiful vocals while fighting until the very end of his life.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis track is reflects the last year of queen most beautifully. It's my favourite song of all time and agrying with weave056, this has got to be the most moving songs of all time. I heard in an interview that when Brian May wrote this and showed it to freddie, he said \"I will sing this with all I have got\", because he knew what the song was about.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nokay, here's what i think.. (at least some of it)... can't say i'm good at enterpreting songs, but this is such a great song!!! always knew it was good, but i didnt realise just how good until i read it here... finally understood some more of it.. here goes=)\n\r\nInside my heart is breaking \r\nMy makeup may be flaking \r\nBut my smile still stays on (he's not giving up fighting AIDS)\r\nI'll soon be turning, round the corner now (he's dying)\r\nOutside the dawn is breaking \r\nBut inside in the dark I'm aching to be free (sometimes he feels like giving up, but he doesn't)\r\nI'll face it with a grin \r\nI'm never giving in \r\nOn - with the show \r\nI'll top the bill, I'll overkill \r\nI have to find the will to carry on..\r\nOn with the - \r\nOn with the show- \r\nThe show must go on... \n\n\r\nopinions, anyone?? \n\r\n**R.I.P. Freddie**\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI played this song on my classic rock radio show when my science teacher died a few days ago. His fight was leukemia was much alike Freddie Mercury's fight with AIDS. He continued to teach even after he was diagnosed with the disease, as his condition got worse and worse, much as Freddie's continuance with Queen after he was diagnosed with AIDS. This is definitely one of my all-time favorite songs, and Freddie's indestructably positive outlook on life was, in my opinion, very admirable.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nFreddie Mercury = legend\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nHello everyone, I'm new here, but when I read that everyone was talking about queen songs, I wanted to be apart of it! This song is one of my fav queen songs. It's so powerfully moving. I really loved it too in the  movie 'Moulin Rouge', suited the scene well.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nPeople keep saying it was written by Brian May. You're right, but you're also wrong. The song was written in part by all four of them, like in \"onme Vision\". It was one of the last times they wrote a song together.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI've read many of the coments in here...I agree on that the word \"show\" on this song represents life.  This song contains a lesson for everybody...a message.\r\nLife may be full of emptiness (\"...empty spaces...\") but we must overcome that fact and make our moments value, every second to have it's meaning...every moment to count.  When something bad happens, we must gon on...not stay stucked on the same pesimist thinking, drowned on tears and feeling miserable...things happen because of something, so we don't have to waste out our lifes thinking over and over again why didn't you do such thing, or why didn't you say such thing on such moment...etc. Smile at life, if life doesn't smile at you. About Freddy Mercury, at this moment I would say it's realy amazing how he fought against AIDS whith a positive thinking, he teached us something very important: to fight untill the end, don't let sickness consume you before even dying because of it.  Your body may be dying, but your soul must be alive.  Freddy knew this song mainly represented what he was going through... this song is realy, realy moving...I just love it.  My first Queen song was this one, and I thank it to the guy I like...he is a Queen Freak and always wrote Queen's lyrics on his MSN nicks... I liked very much this part, the one he putted on msn:\n\r\n\" My soul is painted like the wings of butterflies \r\nFairytales of yesterday will grow but never die\"\n\r\nI looked for it, it was this song...by Queen...I listened it... I was realy moved...literarily fell in love with Freddy's voice, and since then I listen to Queen...and I love it.  =P\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThis is one of the FEW songs that is ABOUT Freddie when he was dying... And that's true. Brian said that himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThe song was written by Brian, not all of them. The albums from The Miracle (1989) on credited the song to all four of them regardless who wrote it to avoid arguments over royalties etc. Some of these were collaborations but I believe this one is all Brian\n\r\nAnd Elton John's version is not better. Elton's got a great voice but he doesn't actually suit Queen's songs. His Bohemian Rhapsody and SMGO are not crap, but not the best renditions\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI wonder in how many forums to I need to write this again and again til people actually remember it... *sigh*\n\r\nBut well, I guess I can write it one more time. :)\n\r\nThis song wasn't exactly written by Brian May. It isn't as simple as that. The idea behind this song came from Mercury himself, just that he had troubles expressing it exactly as he wanted, so he asked help from May. Some times later May showed up with these, \"modified\" lyrics. Later of course they said that it's written by May, but as I said, it isn't as simple as that.\n\r\nQueenFreak. Most of the time they didn't write lyrics together. However, on the later albums they decided to simply write it - \"Lyrics: Queen\" to avoid all the mess giving exact names gave. The lyrics still came from one of the four.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nBrian said it's co-written by himself with Freddie. The lines \"My soul is painted like the wings of butterflies \r\nFairytales of yesterday will grow but never die \r\nI can fly - my friends \" are for sure Brian's, as he has said.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nQueen rules\n\r\n\"On with the show must go on....Show must go on, go on, go on...\"\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nthis is my favorite song of all times... my nr. 1! \n\r\nimagine: it is sad, wise and hopeful at the same time... \n\r\nremember: this one was co-written by a man who was very well aware that he was just about to die! \n\r\nthis is a very worthful testament to all of us\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nI get so sad every time I hear this.Freddie Mecury's story just makes me cry.I wanna break down to tears when I hear this song.Queen is one of the best rockbands ever.Totally a legend.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nEvlin - true. And I love the lines that scandal mentioned.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThe saddest & best Queen sing. Freddie's requiem. His goodbye to his friends / fans. \n\r\nThe video of this husk of a man but still with that amazing voice shows his courage & optimism even at the end.\n\r\nFreddy was around all my life from the rock days to when, quite frankly, Queen weren't relevant anymore. This song & video made everyone realise how great they were & how much we were going to lose.\n\r\nThe day he died they played all Queen songs on the AM drivetime show on Radio 1 (national UK radio). Everyone (from kids to truckers) had the volume right up, windows down and tears in their eyes. I just hope he knew how much he was genuinely loved (for being him, gay, extreme etc) by everyone in Britain. \n\r\nJust played it 4/5 times back to back and it still makes me cry.\n\r\nRoger\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nevlin yeh i'm with you.. i'm only 18 though\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\ntheir greatest job!\n\r\ni wonder why there are so few comments on this great song?\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nQueen's most poweful song! No question. It's made even more powerful in that the song relates to Freddie more than anything, and that it's basically him speaking his mind, which in itself is very powerful. Quite simply, this song is about people who were/are suffering like Freddie Mercury, and that there is an optimism behind the dark evils of those problems.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis song is so many things in under 4 and a half minutes.\n\r\nIt's uplifting, sad, overwhelming, emotional, inspirational, it makes you sympathetic towards Freddies plight. Most of all though, it is unique. There is no song anywhere else that sounds like it. It's almost it's own genre of song.\n\r\nI love it, it's like he's saying he knows he's going to die, but he's accepted it, and won't roll over and let AIDS take him. It will have to take him down fighting.\n\r\nIt's probably along with 'These Are The Days of Our Lives', the saddest song I have ever heard. Yet at the same time, it psyches you up and uplifts you a bit.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nThis song is one of my all time favorite queen songs. This one and bohemian rapshody from the classic queen cd are what got me into queen. I first heard it from moulin rouge (though it's nowhere as good)\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nIt was simply Freddie Mercury's swan song, him saying goodbye to his friends and fans in a grand style. He gave it his all until the end in music and in life and like a true showman he bowed down to his audience and gave us this hauntingly classic song.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nit gives me goosebumps. and what they did to it in moulin rouge is breathtaking as well. i love the origional though.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nI heard a different virsion about the meaning of this wonderful song.  What I heard is that Freddie Mercury knew he was dying and he wrote the song actually to tell his band members that the show must go on and the band must continue singing and performing.  Another thing I heard is that he asked his band to publish this song only after he will die.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThere are so many fools that say such-and-such song is about AIDS or Freddy coping with AIDS.  As far as I know, this is the ONLY song where that indeed was the theme.  Bohemian Rhapsody is not about AIDS!  It bugs me how many people think that Freddy is always singing about AIDS or homosexuality.  They haven't listened to his songs very closely and have a pretty one-dimensional view of the band.  Just because Freddy was gay and lived secretly with AIDS for years doesn't mean that he was all woe-is-me and only wrote about those topics!  He had a lot more dignity than that.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI've heard it said that this song has a double meaning-- first, the obvious one about Freddie and his impending death, and second, about Brian trying to make it through both a tough divorce and the death of one of his bandmates of 30 years, all in a period of a few months.  I feel like the lyrics amazingly capture things from both perspectives-- from the protagonist as well as the audience.\r\nAs proof of its power, this was voted in a British poll as the song people would most like to be played at their funeral.  Personally I don't think quite that far ahead, but it is definitely my favorite Queen song.\r\nThe metaphor of the show is amazing in that it applies particularly to Queen in a way, but also relates to everyone else who has to paint a smile on while going through difficult times.  It also gives a nod to the classic theater axiom-- the show is a magical moment, so do whatever you can to keep it alive as long as possible.  Interestingly the verses 1 and 2 seem to contradict this idea-- they are the truth that the singer is facing, but in the end he defies it by saying that he needs the show to get him through the end, too.  Freddie was always transformed this way when he got on stage.\r\nThe music is pure genius.  The funereal opening Deacon/Taylor chord sequence plays nearly throughout, and is something that Freddie almost fights against as he makes his runs at the end.  How he managed to hit a D5 or two after needing vodka just to make it through each take is astounding.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI luv da version of this song on mulan rouge when its mixed in wiv roxanne. they jst took what da song is about n made it so much more relavent n its jst so effective. da tension is unbarable - totally breathtaking. gr8 song\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThis song is so sad and heartbreaking, yet wonderfully inspirational at the same time. Although it's probably true what's been said about Brian writing this song about Freddie dying, it has a different meaning for me. i think that life is the show and no matter how much you're hurting inside and how awful it is you have to keep going. The first time I really listened to this was right after I tried to kill myself, so maybe that has a bit of an influence on how I interpret it. \"I face it with a grin, I'm never giving in- ON WITH THE SHOW!\"\n\r\nRIP Freddie- you're a beautiful soul\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nI don't think there will ever be a more powerful and meaningful song than \"The Show Must Go On\". I bought this album as soon as it was released and this song seemed to signal the end. It was not yet common knowledge that Freddie Mercury was ill. When he did pass away I found this song very hard to listen to for a while. I had lost the music in my life. There was and never will be another Queen ,and particularly another Freddie Mercury. This song is a grand farewell from the greatest rock singer in history.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nthis song tollaly sends shivers down my spine evritime i hear it. the words r so beautiful n da music is verrri dramatic wiv da long string chords n aww its gr8. i agree wiv NicoleInWonderland da mulan rouge version is ded gd aswell bt wen da roxanne bit is mixed its jst soo powerful n changes da meening 2 aa deeper level again. wooooowwwwwww i luv it\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI'll always think of this as \"Freddie's Song\".  It's Freddie Mercury's last stab at Death, his final cry that, yes, his life may be ending, but if he has to go, he'll go out performing, doing what he loves, with a smile on his face.\n\r\nRIP Freddie.  There'll never be another like you.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nIf you've been to their new tour, you'll realize just how powerful this song is. They put so much effort into the song, and the lighting becomes just like an opera house. The backdrop changes from lots of fire and stuff (coming from their energetic, optimistic songs) to scenes of Freddie and all of the highlights of his life. It's simply a heart-breaking, loving song, and anyone who isn't emotionally changed by it doesn't have a soul. But then, anyone who can't understand its message isn't even close to being a true Queen fan.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nIMHO, this is by far the best song Queen ever did. Every time I hear it, I think of two things: Freddys defiance against his illness and the depth of the lyrics he sings, and the fact that when this song was recorded, he weighed about 90 pounds. (Remember the video for \"these are the days of our lives?\") It is amazing that as sick as he was, he was able to conjure up enough power to deliver the absolutely HUGE vocals in this song. I nearly get choked up every time I hear it. Freddy and Queen are legends. And he is probably the best singer in the history of rock. Period.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nWhen this song was released it hightened speculation that Freddie was ill, due to lyrics such as \"I'll soon be turning round the corner now\" and \"what are we living for\" and \"my make-up may be flaking\"\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nIf Queen would have stopped making albums after A kind of magic, they would certainly not be half the band they are now. Their early to mid 80'S albums were really not that great except for The Game and The works which are decent. The three albums that I think defined them as Legendary are The Miracle, Innuendo, and the great Made in Heaven. These albums feature the most passionate vocals you will ever hear. (To agree with scoonman and Glacion and everybody else) Brian really steps it up on his guitar with melodies that make the guitar sound as if it is weeping but in a very great sounding way. These three albums and including their 70'S releases have made Queen one of the greatest bands of all time, If not the most unique and most passionate.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI would also have to include that their 80'S albums are good, the only one that is truely mediocre is Hot Space and A Kind of Magic is decent\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nSad and great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis is the most beautiful song of Queen. Truly my favorite one, even though I love all the early Queen material pretty much, I have to admit that Innuendo is the most magnificent, inspiring and profound album the band ever created. I'd even say THE most magnficient album EVER created by ANY band. \r\nIt's Freddie's life, it's all the things he's given, all the things he created and done for the world, as an artist a true artist. \r\nTSMGO is... well, who else than Brian could have written it so perfectly? \r\nHe knew was he was going through, he knew what lies he had to tell whereas it was obvious that something was wrong. I think Brian admired Freddie's courage throughout his illness. Because he never gave in, up until the end. Never stopped smiling, even when his insides were nothing but wrecks, he kept on singing, giving all his voice, for singing was all his life, what he loved the most, creating... being an artist. \r\nWho could not admire that?\r\nFor those who don't know, he kept on recording material 2 weeks before he died. And he stopped taking his medication at that time, deciding he didn't want to end up blind, something that started to happen already. \r\nHe was unique.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI just wanted to comment again that I love this song. It is astounding and powerfully sad, but with a message of overcoming the obstacles to create another great rock classic like the \"Innuendo\" album.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nWhen I find out that my long old dream will never come true I didn't cry, my friends gave me a lot of support and I didn't cry! But on that day when I was alone in my bedroom listening to this music I cry for almost 10 minutes, the words were like a light in the dark... I did it like in the song, I \"find the will to carry on \" and now my dream is finally coming true!\r\nThis song is about the sadness of losing but it's also about finding the straight to carry on...\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nFor me, this was such MercuryÂ´s \"good bye\" for his fans. Theyre best song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\n\"The show must go on, yeah\r\nInside my heart is breaking\r\nMy makeup may be flaking\r\nBut my smile still stays on\"\n\r\nthe \"show\" is quite literally the show we put on for other people. It was most likely written about Freddy dying, and Brian getting a divorce and whatever...and the song relates to how men are expected to act in our society. Men often see themselves as being forced to hold the world up, and we cant show any weakness as a result. No matter how much crap hits us, we're forced to take it with a smile.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nthere are not words\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nGreat song, this songs sums the man to what he really was- a genius- highlighting the fact that his time is coming to an end and that truly the show must indeed go on\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nAs my name would suggest, this is my favorite song ever written.  \n\r\nThe original phrase of \"the show must go on\" is often used when something, in the performing arts, goes really really REALLY wrong, either someone dies or something happens, like a theatre burning down or something.  That's what Freddie's saying in these lyrics.  He's saying that \"I may be about to die.....but i'm gonna keep going until i've got nothing left, and then the show must still go on......\"\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nWhen I first heard this song I was crying so hard! Personally I think it does not have the same effect on my heart when other people sing it because you know that they are not dying (soon).\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\ni want this played at my funeral it just sums up life so well and life is like a show and no matter what happens it hs to go on even if someone dies. so is it being optimistic or pessimistic?\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\ni heard he sung it in one take.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI think this is one of the greatest songs ever!\r\nI agree 100% with Surrenderyourego.\r\nI've heard this song for the first time on the radio when they'd said that Freddie died. I was only 7 years old, bit I was really shocked and upset by the news because I already knew and loved Queen (my parents were their fans). I was very moved by this song and I understood its message in spite of the fact that I didn't understand the lyrics (because I didn't know English yet). A couple of days later I've bought my very first album and it was Innuendo. I was a huge fan of Queen for almost ten years and I still love their music.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\ni always think that some lyrics(\"save me\"\"too much love will kill you\"  etc.) just express the feeling of Freddie's feeling in his soul,but in fact  they were all wirtten by Brian.I don't know whether Brian is Freddie's best frend(I read that Jim sat by Freddie\r\nuntill the last breath of Freddie ),I just think Brian know Freddie so deeply...\n\r\nI've cried for many times when I listen this song,especially  when he sings\" My soul is painted like the wings of butterflies\r\nFairytales of yesterday will grow but never die\r\nI can fly - my friends\"........\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\n\"Inside my heart is breaking My make-up may be flaking But my smile still stays on\" \n\r\nsays it all really\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI knew Queen and Freddie Mercury by this song!\r\nI think it's ...\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nThis song is incredible, it's tell the saddest yet happiest story, about Mercury and his will to go on. Queen was just the greatest. \"My smile still stays on\", by far the best line in the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nthere was an amazing version of this song in Moulin Rouge. it fit perfectly i love in that movie how all the music was made up of bits and pieces of other songs \t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nObviously, it is about facing the possible end of one era of Queen. Freddie was going to pass away very soon after its recording...or the release of Innuendo. All of them knew it. The song is about him laughing in the face of death and being strong. But it is also about the fact that he wanted his friends to continue recording their own material - and to release their final recordings with him. I.E. Made in Heaven, etc. It is a mixture of both Freddie's personal \"going on\" in his last days - staying strong and defiant - and his realization that his friends would now have to continue without him. Sure, it could also mean \"life\" as well. A song can mean anything, really.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\ndramatic. powerful. amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nmy brother was dying of cancer last year when he picked this song for his funeral. I found this site then to try to find the meaning of it because although his death was imminent, at the end it came sudden and we never had the chance to talk about what was happening to him, I mean in detail, how he felt about it. Somehow we were afraid to talk about it although we kept hugging and give each others strenght. What's there to say when you know what the inevitable is? It breaks my hearth every time I hear this song, yet I do play it to feel near him, to try to see if there was something he wanted to tell us with it. \r\nI guess each of us can have our own interpretation of this song and still be right. \n\r\nIn this verse in particular:\n\r\nThe Show must go on!Yeah!\r\nInside my heart is breaking,\r\nMy make-up may be flaking,\r\nBut my smile, still, stays on!\n\r\nI find the part that hurts the most is that he put up a good act, trying to make it look like things were normal as much as he possibly could, never complaining about the pain, and the fear to die that he must have had. Putting on the mask of a smile for all of us to see to hide the pain that he feels inside\r\nHow some people nearing death find such strenght is behond me, and some that know that are going to die, do actually give up, perhaps it depends on how much they value what's around them. \n\r\n\"Whatever happens, I'll leave it all to chance.\" -  those things that others never listened to, and that now they won't matter how they'll turn out because he won't have control over them any longer\n\r\n\"Does anybody know what we are living for?\r\nI guess i'm learning\" - understanding parts of life whatever they may be, like \r\nthose things what we think are so important to do, like our jobs, our ambitions etc, at the expense of having more time at home with families,and at the expense of actually living life to the fullest while we're healty\n\r\n\"Outside the dawn is breaking - he's ready for another day, for another fight to live\n\r\n\"But inside in the dark I'm aching to be free!\"   - while inside his soul he wants it all to be over\n\r\nI realize Freddy was different than my brother, yet I think when someone is dying, what they feel is pretty well all the same ...we're all human after all\n\r\nR.I.P.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nwell my friends this song is about freddie last days.As far as i know he knew what would happen to him, but he was encouraging his friends to keep up with the great song and feeling regret about what happened to him.the title says what happens to me you guys must continue to live from music and don't worry about me.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nI first heard this song in conjuction with a favorite anime character. hearing that this song was written in defiance of a dying showman... really makes the show match so much more. the character in question ended up dying without achieving all of his goals... and his son took up the deadly mantle afterwords to continue his work...\n\r\nthe show must truely go on. <3\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nThis being the VERY LAST song recorded on an album while Freddie Mercury is extremely moving. I feel he's really talking to all the world about his hardships and connecting to other's hardships by saying that life is a like a show, and although things might not go like we planned it, the show must go on. The fact that these were his last days, he kept his head high and never backed down from what he loved. \t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThis is an AMAZING SONG!!!! wrote by one of the best rock bands in the world. This song was writon (is that how you spell it dont really know) in the very last stages of Freddie's life this song was representing Freddie's fight against aids. This song can motavate any one from Armed forces personel to a stroppy teenager   \t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nI think this was one of Freddie's Best work before he passed. I remember getting this single when I was 8 years old \t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nI think that first of all, this is one of the best songs ever.\n\r\nRegarding the meaning, I think this is talking about how Freddie knew he was going to die, and this was his goodbye song.\n\r\nThe lyrics 'Inside my heart is breaking,\r\nMy makeup may be flaking,\r\nbut my smile still stays on.'\r\nShows that Freddie never complained, even on his deathbed.\n\r\nRIP Freddie- If I had a time machine...\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nYou are right, it's a Brian May song but the subject matter and some lyrics were by Mercury too. You need to listen to the Acapella version of this song. This guy has balls\n\n\n", "comment_81": "\nFreddie Mercury had a diehard spirit. Through all the pain he as they were recording this CD must have been very hard. He fought to the bitter end. Brian, John and Roger protected him from the paparazzi and did a damn good job.  I have no doubt if Freddie was still alive, Queen would still be together. \t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nPity it never got to be performed live, I would've like to see Freddie's interpretation in front of an audience.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nIt's a veeerrrrryyyyy goooooooodddddd song!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n"}