{"comment_0": "\nexcellent song!!!....i think this song is about a man singin about how this genuine lady is labeled a \"tramp\" by society because she cuts through superficial social customs-one can easily assume he likes her because of that\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nthis song is such a classic i luv it prolly one of my favorite frank songs\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nright, maestro, and also you get the feeling the other women are jelous of her because she's got real class.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nMaestro's got it nailed.  I tried to sing this to my girlfriend and she got offended. I shoulda sent her to this page\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nEverything is relative â\u0080\u0093 someoneâ\u0080\u0099s insult can be anotherâ\u0080\u0099s greatest complement.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nyeah i got confused by it first but i reckon whats happened is some of the \"broads\" have been insulting her because she isnt like them, and she has a successful relationship with the narrator, so they called her a tramp.\n\r\nand this song is what the narrator is sarcastically saying back to those bitchy women\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI agree with maestro's meaning; a girl who doesn't act like everyone else and is criticized for it. I sure wish I could find a 'tramp'!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nElla Fitzgeralds version is ace \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nHe changes the words sometimes to \"this chick is a champ.\" I agree with the rest of you guys.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\none bit i've never really understood was.\n\r\n\"Hates California, it's cold and it's damp\"\n\r\ni'm guessing this woman is from new york. i would of thought California would be warmer and have better weather than NY.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis is from Wikipedia:\r\n\"The Lady Is a Tramp\" is a show tune from the 1937 Rodgers and Hart musical Babes In Arms. This song is a sophisticated and witty spoof of New York high society and its strict etiquette (the first line of the verse is significant: \"I get too hungry for dinner at eight...\").\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nAs Frank describes her, who would want be with anyone other than this tramp? ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nMy take is he visualized Ava when he sang this song.  I think she more than any other in his life epitomizes the lyrics.\t\t\t\t\n\t\t\t\t\n\n"}