{"comment_0": "\nSelena Gomez is ready to wear her heart on her sleeve. \"I have been waiting to share this with all of you,\" the singer tweeted Thursday. \"The video for my new single 'The Heart Wants What It Wants.'\"\n\nThe black-and-white video opens with a voice recording of Gomez, 22, talking about being wronged by a man, presumably her on-and-off boyfriend Justin Bieber, 20. Fighting back tears and revealing little details, she says, \"When I was on stage and I was thinking of...I felt like I know...I know him, though, and I know his heart and I know what he wouldn't do to hurt me. But I didn't realize that feeling so confident and feeling so great about myself and then [to have] it just be completely shattered by one thing, by something so stupid. But then you make me feel crazy, you make me feel like it's my fault. I was in pain.\"\n\n\"You got me sippin' on somethin' / I can't compare to nothin' / I've ever known / I'm hopin' / That after this fever I'll survive / I know I'm acting a bit crazy / Strung out, a little bit hazy / Hand over heart, I'm prayin' / That I'm gonna make it out alive,\" Gomez sings. \"The bed's gettin' cold and you're not here / The future that we hold is so unclear / But I'm not alive until you call / And now I bet the odds against it all / Save your advice, 'cause I won't hear / You might be right, but I don't care / There's a million reasons why I should give you up / But the heart wants what it wants / The heart wants what it wants\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nIt's about Justin Bieber and how she refuses to give him up despite everything he's putting her through.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nFor You is an upcoming greatest hits album by American singer and actress Selena Gomez. The project serves as the first greatest hits of Gomez's career, and is scheduled to be released on November 24, 2014. For You serves as Gomez's final release with Hollywood Records, having signed a new recording contract with Interscope Records. It features some of Gomez's previous singles, as well as remixes of previously released material; two new songs were recorded for the album. Gomez worked with long-time collaborators Rock Mafia on the new material for the album, with Gomez co-writing one of the songs. The project was preceded by the release of its lead single, \"The Heart Wants What It Wants\", which was released as a surprise on November 6, 2014 to overwhelmingly positive reviews from critics.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI think this song is about loving someone that you know is no good for you deep down and yet you want to continue loving them no matter how much it is destroying you in the process. It's about how we each endure spectacular breathless moments and heartbreaking tragedies simultaneously in our pursuits for love. Sometimes the pursuit is in vain, but we secretly cling to the hope that this one will be the lasting love that we have been looking for and that we are deserving of. In the end, you and your love are irreversibly changed either bonding perfectly together or by each developing the strength to love oneself more and walk away.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n This song is about being in love with someone who is toxic and not knowing whether to stay or leave. Like the artist, Selena Gomez, her mind is telling her that heâ\u0080\u0099s bad for her but her heart is saying â\u0080\u009cstayâ\u0080\u009d Sheâ\u0080\u0099s describing an emotional pull towards this person. Her significant other is the one guy that sheâ\u0080\u0099s drawn to. And no matter what her family and friends tell her \t\t\t\t\n\t\t\t\t\n\n"}