{"comment_0": "\nI think he's talking about drugs in this song. The 'line' that he mentions in this song and other songs could be a line of cocaine or something similar. He says he was a king under its control because of how it made him feel so in control of everything and it gave him so much power in his head, but he knows it's also destroying him and he wants to stop using it. He says 'All that I've compromised to feel another high' shows that he knows the consequences of whatever drug it is but he compromises that to 'feel another high'. The dreams mentioned in the lyrics 'I dreamed you dreamed of me' could also be drug induced. 'Is it worth the price' can show the cost of drugs. 'I need to feel like you've let me go' shows how he wants to move on from it but he can't because of the addiction. 'I've had to break myself to carry on' and 'They say it's easy to leave you behind, I don't want to try' could show how difficult it is to quit once you start using drugs, because of the withdrawal and difficulty to function normally. Most people say this song is about an abusive or destructive relationship which could also be true, but I think that the lyrics can be taken more literally. A lot of Y\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAmazing song! The parts just connect well and the song's flow is perfect. \n\r\nHelloween just gets better and better.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI just heard this song today for the first time. very good. awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nBrilliant!!!! I love Helloween.. but I'm not very familiar with the concept of the first two Keepers albums though I love listenning to them but this song is just amazing... the chorus melody is addictive.. I find myself humming the chorus whatever I go.\n\r\nHail Helloween !!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nyeah great flow great message great lyric, excellent i love that sentence: Alienation, elimination, chaos, no exoneration\r\nNo believers, all deceivers, no illusions, executions mainly in the music as a really strong force\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI agree, the song does have wonderful flow.\n\r\nAt first, I thought the song refered to the anti-Christ ruling for Satan, but that isn't the case as that the anti-Christ will rule for 7 years, and Jesus will rule for 1000 following that, and I kind of doubt that Jesus is intended to be the 'evil king'. That said, I imagine this is simply an original fantasy concept meant to tie-in with the loose concept of the keeper of the seven keys (there isn't really an actual plot line, as far as I can tell, just loose references here and there). Doesn't matter though, because it's still a great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\"Alienation, elimination, chaos, no exoneration\r\nNo believers, all deceivers, no illusions, executions.\"\n\r\nFucking fantastic...! This song is the ultimate \"morning therapy.\"Just put it on in the morning, listen to it, and you're all set to face any day, really... Marvellous!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI'm pretty sure this song is about the Third Reich, AKA Nazi Germany ruled by Adolf Hitler. Why? Just look:\n\r\n\"Forgotten in his reich of shadows\"\n\r\nReich - pretty obvious; there are English words with the same meaning but still they used German word. \n\r\n\"The lord of the evil\"\n\r\nSo we have evil dude... most people see Hitler as one of the vilest individuals in the human history.\n\r\n\"A puppet on a string\"\n\r\nWhile Hitler was more than a puppet, his 'trusted' advisors and military leaders held a lot of power. They just needed his charisma to inspire common people to fight and die.\n\r\n\"For a thousand years\"\n\r\nHitler promised that Third Reich will last for 1000 years.\n\r\nLater in the song there are multiple of references to annihilation, executions, fear, greed, hate and obsession - all of these fit the Third Reich and Adolf Hitler perfectly.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nLook...\nI think it's the aftermath of the song \"Keepers Of Seven Keys\"\nWhen the keeper locks the last sea and dethrone the Devil, and defeated he tries to Trick or even conquer him with his offer of power. \nAnd the keeper denny the devil and stand still on your promise.\n\nFor real, the evidence that the devil calls the keeper of brother makes me think that in real... The keeper its not Jesus...\nTHE KEEPER CAN BE OR MICHAEL OR GABRIEL! \nARCHANGELS OF THE LORD!\t\t\t\t\n\t\t\t\t\n\n"}