{"comment_0": "\nWhen I listened to this song I invisioned an abusive relationship.\n\r\nBorn to push you around\r\nbetter just stay down\r\nyou pull away\r\nhe hits the flesh\r\nyou hit the ground\n\r\nI read in a metallica post somwhere that the war themed video does not flow with what the song is truely about. \n\r\nThis is one of those songs that can be inturpreted in many ways. LOVE IT!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis one hits home with me, so i understood it from the get go and many of james' songs are about this very upbringing, it's common knowledge he's got daddy issues... however, he never got the chance to get back at his father.\n\r\nBorn to push you around \r\nYou better just stay down\r\nYou pull away\r\nHe hits the flesh [ daddy is abusive ]\r\nYou hit the ground\r\nMouths so full of lies [ he tells you it won't happen again ]\r\nTend to black your eyes\r\nJust keep them closed\r\nKeep praying\r\nJust keep waiting [waiting for the day you can get back at him ]\n\r\nWaiting for the one\r\nThe day that never comes [where he gets revenge]\r\nWhen you stand up and feel the warmth\r\nbut the sunshine never comes\r\nNo the sunshine never comes\n\r\nPush you cross that line\r\nJust stay down this time\r\nHide in yourself\r\nCrawl in yourself\r\nYou'll have your time\r\nGod I'll make them pay [ either both parents sucked, or he was bullied ]\r\nTake it back one day\r\nI'll end this day\r\nI'll splatter color on this gray [ kill him, his blood on your grey life ]\n\r\nLove is a four letter word\r\nAnd never spoken here [this isn't love, it's abuse]\n\n\n", "comment_2": "\nHoly shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni havent thought any other ways to see this song but as i was reading all the comments and i was shocked. i totally disagree with everybody. allright so here we go on my point of view. its about a growing up person who is looking for love. he knows it is there. the day just never comes. ive allways thought it was obivious but i guess you see what you want to see :S\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI like all of the interpretations I've seen. I've been listening to this song a lot likely and for me, it takes a more general perspective on everything I've seen. When I coupled the lyrics with the instruments, it came together for me.\n\nBorn to push you around\nYou better just stay down\nYou pull away\nHe hits the flesh\nYou hit the ground\nMouths so full of lies\nTend to black your eyes\nJust keep them closed\nKeep praying\nJust keep waiting\n\nThe idea of \"just stay[ing] down\" when in the eyes of some kind of adversity (someone \"born to push you around\") is of course suppose to be the opposing voice of the songs message. The person goes to hit the ground i.e. having some sort of struggle such as being bullied or maybe failing at what someone aspires to be great at. The \"mouth so full of lies\" could be akin to naysayers surrounding this individuals or even to those trying to console the person saying \"things will get better\" which tends to black your eyes because it doesn't get any better or because the negative things said only hurt you. Classically, this individual is weak and meager and just hopes whatever they are going through will end.\n\nWaiting for the one\nThe day that never comes\nWhen you stand up and feel the warmth\nbut the sunshine never comes\nNo the sunshine never comes\n\nThis individual sits around waiting for the day he will be free of whatever problems he has- the day that never comes, the sunshine that he won't feel because the sun won't come. \n\nPush you cross that line\nJust stay down this time\nHide in yourself\nCrawl in yourself\nYou'll have your time\nGod I'll make them pay\nTake it back one day\nI'll end this day\nI'll splatter color on this gray\n\nThis individual has been pushed by whatever problem he has so much that he crawls inside of himself and hides, hoping that one day he can make whoever caused the pain pay for what they did. But again, this is all \"wishful thinking\". He speaks in the future but it has never happened. We see that \"the day that never comes\"- the day of redemption- doesn't come because these individuals are sitting back and taking it and not standing up. In a way its about making that day come, not waiting for it.\n\nThe music goes from sad, depressed and painful to full of angst, passion and energy as the lyrics come to with \n\nLove is a four letter word\nAnd never spoken here\nLove is a four letter word\nHere in this prison\nI suffer this no longer\nI put it into\nThis I swear!\nThis I swear!\nThe sun will shine\nThis I swear!\n\nThere is no love because the problem has been overthrown by \"the prison\" (the problem entrapping the individual). He must deal with his problem head on, fully facing it and create his own sunshine because it won't simply come to him. And this individual swears he will break free from his problem and feel that sunshine.\n\nAfter this, the music becomes immensely powerful and full of passion, the same passion we see during the chorus, but that passion ends and becomes a sad melody again because the individual simply gave up and waited. Now, the power is in full force because the individual had sworn to make change and to take all of the empty promises they had made in the second verse and make them happy.\n\nI believe this song is about standing up and fighting, not sitting back and waiting for the good times to come. You have to make your good times and fight hard and energetically for them- The sun will shine, this I swear.\n\nThis song is so powerfully emotional and raw. The lyrics fit the music and the song is a masterpiece and my favorite of the whole album.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI believe this song is about the release of Tools next album!\n\r\nAs a tool fan you feel beaten and lied to with hope of a new album but the day never comes....\n\r\nMetallica like the rest of us just want to hear more Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI don't know what it means, and i don't care. It's just such an amazing song. It has everything that metallica has done, from old to new stuff. Amazing. We love you, Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nGiven the video's got a war theme, I think this song's about a wounded soldier in Iraq who feels betrayed by the \"people in charge\" and no longer has the will to fight.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nIts about his relationship with his penis \n\nBorn to push you around - sex\nYou better just stay down - uncontrollable erections\nYou pull away - masturbation\nHe hits the flesh - masturbation \nYou hit the ground - girl kneeling down to give head\nMouths so full of lies - he shoots in her mouth\nTend to black your eyes - skull fucking\nJust keep them closed -[legs] \nKeep praying\nJust keep waiting\n\nWaiting for the one\nThe day that never comes\nWhen you stand up and feel the warmth - Cum runs down her legs after sex\nbut the sun shine never comes - masturbating outside\nNo the sun shine never comes\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI always thought it was a mockery towards his bully victims from his childhood glory days.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThe song is just ok for the first few minutes, but the solos get me very, very excited for this upcoming album\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nOh yeah, I think the song's great regardless.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nMy interpretation of the song is as knighthawk127 says, a abusive relationship. Doesn't have to be a romantic relationship but a relation of any kind where someone is a bully, and the the hate the bullied starts to grow when he/she is oppressed and beaten. As the lyrics says the beaten never seem to be able to to reach out and feel the warmth of real love, the hate grows and he/she thinks of revenge but the day when it'll happen never comes, as most people in abusive relationships never does take  the stand, they just take the beating and hope it'll end (on the day that never comes).\n\r\nAnd now I understand what Hetfield meant when he said that he didn't want the song to be interpreted as being only about the Iraq war. As the video is made by a director who's interpretation is expressed in the video. \n\r\nI think the song is great, the lyrics can be interpreted in many ways as great lyrics should be. And Hetfield again proves his skills at writing great lyrics and great riffs. And of course the other guys did a great job on this. Death Magnetic looks like it'll be a GREAT album :).\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nRegardless of what it means. I am actually excited for a Metallica Cd again. Last one wasnt so great. BUT... by the sound of this one, things might be looking up!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nhey, comment # 9\r\ni didnt expect a very good comeback after SA...i saw the interviews and the vids and everything, but the song blew my mind off....ppl, Metallica is back\n\r\nROCK OOOOON 'TALLICA \\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\n'That's the beauty, I think, of writing vague but powerful lyrics â\u0080\u0094 that someone like a movie director can interpret it in his own way and obviously, someone creative is able to take the metaphors and apply them to whatever he needs in his own life,\" the frontman explained. \"The main [theme of the video] is the human element of forgiveness and someone doing you wrong, you feeling resentment and you being able to see through that in the next situation that might be similar and not take your rage or resentment out on the next person and basically keep spreading the disease of that through life...The one thing that I wasn't keen on here was Metallica plugging into a modern war or a current event [that] might be construed as some sort of political statement on our part... There are so many celebrities that soapbox their opinions, and people believe it's more valid because they're popular. For us, people are people â\u0080\u0094 you should all have your own opinion. We are hopefully putting the human element in what is an unfortunate part of life. There are people over there dealing with situations like this, and we're showing the human part of being there'-James Hetfield\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI also didn't think the beginning was that good but the solos were badass. It sounded like classic Metallica\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI also didn't think the beginning was that good but the solos were badass. It sounded like classic Metallica\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI just heard this song yesterday, and i am heavily anticipating its release on september 15th. THIS SONG FUCKING ROCKS! METALLICA IS REBORN!\n\r\nWhen you listen to it, you can hear Metallica's adaptation once more to the more current trends of music, only mixed with the classic metallica style. To me this sounds like The Black Album mixed with Load, and some new stuff thrown in.\n\r\nGreat job overall. Hetfields passion filled vocals (best of his career, even topping S&M). Rob Trujillo's awesome bass, Lars even stepped up his drumming game. The only person im somewhat dissapointed about is Kirk. The solo's were good, but not vintage Kirk (i'm talking the Kirk from Ride the Lightning). Great job though, I am DEFINITELY copping this one on the day it comes out.\n\r\nBut on to the real meaning, since this isnt songreviews.net. \n\r\nI think this is about resentment of ones life. Someone has been abused, or felt abuse in their life. OR, maybe just neglected and discouraged by someone. Whether it be a family member, friend, girlfriend, teacher, etc.\n\r\nHe is waiting for a day where he can show them wrong. That he is worthy of their praise. This is just my interpretation. I have heard the video has something to do with war. If this is true, im sure you can relate this song to a soldiers experience during war. (Iraq, in this case)\n\r\nMETALLICA ALWAYS AND FOREVER.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nthis most be about revenge, or about hoping that it will \"come the day\" that this agression to you will stop.\r\nLove this fucking song, it's so powerful from the beggining to the end\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nguys, yeah im just adding my 2 bits worth, ok heres what i think\r\nits about an abusive relationship as some have you have come to realise. and i think the title/chorus is about the day for which the man or woman in the relationship doesnt get abused. so yeah \r\nthanks :P\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\noh and uh, tender needs to be changed to tend to for whoever changes that stuff\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI think it's about being in jail and waiting for ur release but it never comes\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nSo good it definitely helps you forget about St.Mistaker!\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nmetallica , have always be there the 4 last albums where differents and had something special. im a true metallica fan and never shit on them like some  *little shit fans*    d'ont know the meaning yet...   im so excited and so happy to hear this ballad at the middle and the end is so aggressif. cou can hear kirk's solo cry and james riffs speed it up , rob's bass rumble and lars pounding is drum so fuckin loud.....   fuckyeah !!!    MetallicAAAAAAAAAAAAAAAAAAAA\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nFinally, classic MetallicA are back!!! Song at first sounds like load or reload. \r\nI think it's about an abusive relationship, and the person being beat down is waiting for revenge.\n\r\nMet better come to Aus! Finally a solo worth listning to!!\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nGuys, I don't want to sound like i'm not satisfied with anything, but this just isn't that good for me.  I think it is a vast improvement on st anger, but it isn't much better than Load/Reload.  The song is much more complex with better riffs, solos, but the lyrics arent that great and it still sounds as if metallica is trying too hard.  I hope i'm wrong and will learn to love the cd...\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nto me the lyrics are so obviously...it's so sad...it's about a weak man who is so disappointed in life a man who is born to be pushed around.\r\nthat man has surrender his life and now just waits the day when he will die and be saved from his misery - the day that never comes\r\nhe hide in his self and speak with god saying that he will revenge all the pain others inflict to him but he just have no strenght...\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nits a great song!! and the album comes out on the 12th not the 15th.. its on that friday.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nyes i do see the idialism behind the abusive relation ship ... but for me as i tent to interpret lyrics from my own point off view this one has an real stron meaning for me, im this sports type of guy been training my wehole life but now sickness might stike me down \n\r\nBorn to push you around\r\nbetter just stay down\r\nyou pull away\r\nhe hits the flesh\r\nyou hit the ground\n\r\nwhen the pain comes and you start thinking u should just give up \n\r\nmouth so full of lies\r\ntender black, your eyes\r\njust keep them closed\r\nkeep praying\r\njust keep (a)waiting\n\r\nwhen u tell your parents/coach/doctor that your OK and u can keep going on and on but deep inside u close ur ayes and pray and wait for the day that never comes when ul feel fine and strong again\n\r\npush you cross that line\r\njust stay down this time\r\nhide in yourself\r\ncrawl in yourself\r\nyou'll have your time\n\r\nthis part here i see as when u simply ignore the pain, push your self mentaly across this line, hide in your self push everything else away for thats the only way you will have \"your time\" of victory\n\r\nGod I'll make them pay\r\ntake it back one day\r\nI'll end this day\r\nI'll splatter color on this grave\n\r\nOfc since your sick and not able to train as the best of you would want u start loosing but still thinking youl keep trying, \"take it back one day\" or die trying...\n\r\nthe love part i never fully put in contents with my thoughts but the prison made perfect sence to me...\n\n\r\nI suffer this no longer\r\nI put it into\r\nthis I swear\r\nthis I swear\r\nthe sun will shine\r\nthis I swear\r\nthis I swear\r\nthis I swear \n\r\nthis is your way out, where ur mind beats the war against your body and u forget the pain and just keep on going for glory and honor since \"pain is temporary pride is forever\"\n\r\nBere in mind that this meaning was before reading any of the other comments or articles about the video but hey this is what the song means to me :)\n\r\nafter reading the other comments i see the lyrics are ofc not anywhere near this idia of mine , but the song does alot for me and aslong as i keep this meaning to me self it works :)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\n\"The main [theme of the video] is the human element of forgiveness and someone doing you wrong, you feeling resentment and you being able to see through that in the next situation that might be similar and not take your rage or resentment out on the next person and basically keep spreading the disease of that through life...\" - James Hetfield\n\r\nTHIS is the REAL meaning :-\" :D\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nMan oh man is it good to hear good stuff from the masters of thrash metal at last!!!  Their last good song before this was Fixxxer off of ReLoad (that album sucked though).  It sounds to me like they've pretty gone back to their old ways, at least a much as they possibly can at their current age.  Well, either way, they're Metallica, and they have always rocked (except on St. Anger), and always will in my opinion.\n\r\nMy interpretation of this song's lyrics are of child abuse.  Since the child in the song keeps hoping to be saved from his abusive family, and that day never seems to come, and it just goes on and on.  \n\r\nThis song reminds of me of Dave Pelzer's autobiography, \"A Child Named It\".  A good book to say the least.  For anyone who wants to read about one the worst recorded cases of child abuse in recent years, I suggest that book.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nOh my goodness... This song is so powerful, some parts remind me of the \"Justice-Album\".\r\nMetallica are back and they are as heavy and hard as they were 20 years ago.\r\nMetallica, I love you!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nload was okay, reload was alright, st, anger sucked ass but if this new CD has more songs on it like this one then i can safely say i am actually looking forward to a new metallica CD againe\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nOnce again, Metallica does NOT disappoint ;)\r\nThis song is great\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nsuch a powerful song.  i like the quote that raprocker007 put up.  thanks bro!  i've always loved and idolized james hetfield.  as someone who has issues dealing with anger he has helped me a lot by being so open about his problems with the same thing.  i have been a metallica fan as far as i can remember and have stood next to them through thick and thin.  for all you people who trashed their music in the 90's grow up.  it was the music they wanted to make, so they made it.  songs like \"bleeding me\" are epic and really express what james was dealing with.   \n\r\nas far as what the song means to me it is definitely about some type of abusive relationship.  i'm a soldier in iraq so i know all about that \"relationship\".  i have supported the war from the beginning, i just question sometimes the policies we carry out in it.  sometimes i feel betrayed by the \"echelons above reality\" and i definitely feel forgotten by my fellow americans who \"just want an end to it so they dont have to 'deal' with it anymore\".  it is songs like this that help me get through.  thank you metallica from the bottom of my heart.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nMy God, about time they went back to there old disgustingly amazing style, and not the St. Anger way. One thing to say, METALLICA IS BACK\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nI tend to lean towards the abusive relationship meaning from the lyrics...\n\r\nI think benighted was spot on for the most part however I interpret the chorus differently:\n\r\nwaiting for the one\r\nthe day that never comes\r\nwhen you stand up and feel the warmth\r\nbut the sunshine never comes, no\r\nno, the sunshine never comes\n\r\nI think it could be meant in the way that people in abusive relationships usually don't leave them because they are in love with the other person. To stand up and feel the warmth I believe is \"feeling the warmth\" of the abuser. As in, one day they will change, but alas that's \"The Day That Never Comes\"\n\r\nGod I'll make them pay\r\ntake it back one day\r\nI'll end this day\r\nI'll splatter color on this gray\n\r\nThis is strange though in that the song changes from 3rd to 1st person...but it could just be Hetfield showing how the abused person changes their opinion of their abuser...perhaps the moment when 'enough is enough'.\n\r\nHence the moment when the song goes heavy and \"I suffer this no longer, etc...\" is sung.\n\r\nAnyways that's pretty much what I got from it...take what you want from it.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nMetallica has always tried something different, and while far fewer people were fans of the last 3 albums, it's in the past.  Too often I think Load and stuff gets compared to Master of Puppets.  They were still a good metal band in the 90's; the only problem was that before the 90's they were undisputed gods of metal.  This sound like a pretty good comeback to me ;)\n\r\nAnyway, the actual reason I posted.  Any ideas on the \"love is a four letter word\" bit?  I hope there's some meaning to it that I can't see, because otherwise it just means that, yes, James can count =P\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI love that people keep saying things akin to \"St. Anger was horrible.\" or \"This isn't as good as the old stuff.\" Obviously none of you want Metallica to grow as artists, to expand, to explore their worlds, and their capabilities. If that's the case then don't like any band. They're all bound to change. The fickle masses will never be content with something they've heard repeatedly and will eventually cry out for change, but when that change comes they're unwilling to accept it... They shun it, shove it aside, and try to degrade it. St. Anger was an amazing album. It reinvented Metallica, while still bringing back the aggression of Kill 'Em All. This album, will no doubt be just as spectacular.\n\r\nOn to a meaning.\r\nTo me, this song is about abuse. Not just physical, \"He hits the flesh\", but mental, \"Push you cross that line\". The obvious physical abuse is there. But the mental is something I believe to be buried under the physical. This person is dying to be free, but it's a day that can't come. \"When you stand up and feel the warmth, but the sunshine never comes\" references the impossibility of leaving. Which is most likely where the director of the video pulled the war idea. As for \"Love is a four letter word\" it obviously falls under the mental, but is it about a relationship? You could say that. The person could be trapped in a loveless relationship and unable to leave because of the abuse. But, I think it's brainwashing due to the mental abuse and the insane mind has finally snapped and is unable to tell what is real and what has been forced into their head. The sun will always come, but this person can't see that. \"Love is a four letter word... Here in this prison.\" Seems to back up the whole brainwashing and conflicting opinions. \"Love is a four letter word, I'm confined, it means nothing.... But I can't fight this... It's too powerful.\" \n\r\nI realize this is really long, but this song just speaks to me. It's such a beautiful testament to the staying power of Metallica and their amazing lyrical work.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nSomeone posted something above regarding the video. I just watched it, and Im not sure how that quote from James can be true. The video has a  war theme to it. \n\r\nYou view the video here: \n\nyoutube.com/…\n\r\nIm trying to fit the lyrics with the video, so not sure what it means just yet. Maybe the video will help others as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nGovernmentman - my take on the \"love is a four letter word\" line.  I interpret that to mean that in this circumstance it is treated as a swear word and rarely, if ever, used (especially in a positive context).  Example: \"I love you, daddy.\" - \"Watch your mouth - don't ever use that word around me!  Or I might just 'love' to teach you a lesson.\"\n\r\nOkay, maybe the worst example ever but I'm hoping you get the gist of it.  I've not seen the video so if it is war as has been mentioned it is a very poor example.\n\r\nAnyway, just enjoy the song for what it is (I know I do) - a return to form!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI agree on the \"Four Letter Word\" thing that Sleeping Death said. Think about as many swear words you can, then figure out how many consist of 4 letters. It's a phrase that is used collectively for all swear words (I think it has kind of died out amongst younger generations, the first time I heard a friend's parents say something about \"we don't use four-letter words\" I was utterly confused).\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nWhenever Metallica releases new material nowadays, they market it so ridiculously much that they shouldn't even rightly claim themselves to be a metal band; metal is not meant to be this commercial. To market this album they've put up every track from the album for sale on Guitar Hero, or Rock Band or some bullshit game like that. \n\r\nI can't believe that there are people comparing this to ...And Justice For All. \"...Justice\" wasn't sloppy, lyrically vague and over-produced (some would argue this, but this listener hears perfection from Justice). I say lyrically vague because, well, this song doesn't make sense. There are inconsistencies in what is being said: \n\r\n\"Born to push YOU* around            *emphasis on 'you': shows inconsistent\r\nBetter just stay down\"                       viewpoints*\n\r\n\"God I'll make THEM* pay             *I thought this was about \"an abusive \r\nTake it back one day\"                     relationship.\" Who is \"THEM?\"\n\r\nI could continue, but you Metallica fiends are very set in your ways.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nLayout of that comment was messed up by Songmeanings...lol\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nIf it weren't for vague lyrics, this site would have no purpose.\n\r\nSome people like being able to interpret things in their own way rather than have everything drawn out in crayon for them.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nis it just me or has kirk put on a lot of weight????\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThis song tells a story about both parental abuse and religious fanaticism.\n\r\n\"Born to push you around\r\nbetter just stay down\r\nyou pull away\r\nhe hits the flesh\r\nyou hit the ground\"\n\r\nObviously a verse about violence towards a child or youngster.\n\r\n\"mouth so full of lies\r\ntender black, your eyes\r\njust keep them closed\r\nkeep praying\r\njust keep (a)waiting\"\n\r\nFirst line is about religious fanaticism, we all know good examples of lies told and believed by religious fanatics.\n\r\nWaiting means just that, pentecostals and new born christians really believe the world to end during their lifetime.\n\r\nEven the wrod praying is mentioned, just to make the message very easy to understand.\n\r\n\"\r\nwaiting for the one\r\nthe day that never comes\r\nwhen you stand up and feel the warmth\r\nbut the sunshine never comes, no\r\nno, the sunshine never comes\"\n\r\nNo, Jesus is not coming, however eagerly these people wait for it... also these people think our world is a cold place and the heaven awaiting them will be a much better place.\n\r\n\"push you cross that line\r\njust stay down this time\r\nhide in yourself\r\ncrawl in yourself\r\nyou'll have your time\"\n\r\nThis chapter is about despair and inner pain caused from having to conform to religious beliefs even then one has real doubt inside their heart.\n\r\n\"\r\nGod I'll make them pay\r\ntake it back one day\r\nI'll end this day\r\nI'll splatter color on this gray\"\n\r\nQuite obvious this one :)\n\n\r\n\"love is a four letter word\r\nand never spoken in care\r\nlove is a four letter word\r\nhere in this prison\"\n\r\nReligious fanatics abuse the word \"love\" to suit their own means. At the same time that they speak about religious love they can lead a life full of hatred. Feeling of love is replaced by a myriad of religious rules. This person hates these rules, he feels he has been imprisoned by them, perhaps he is a prison in a family that has all these rules.\n\r\n\"\r\nI suffer this no longer\r\nI put it into\r\nthis I swear\r\nthis I swear\r\nthe sun will shine\r\nthis I swear\r\nthis I swear\r\nthis I swear\"\n\r\nObvious, this also :)\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nDude, I'm all for vague lyrics, but only when they actually make sense given enough thought. Why does he repeat \"this I swear\" 5 times in one verse? This lyric is past the line between vague and absurd. Ugh, whatever. Not worth arguing about lol. \n\r\nI'm listening to the album RIGHT NOW, a WHOLE DAY before release. It's not great, as I expected. Both James' and Kirk's guitars sound a bit too bassy in their tone, James' vocals sound like they did on St.Anguish. Other than that, it's not too bad. Some pretty good material on it. Oh yeah, the \"vague\" nature of this song is continued throughout the album.\n\r\nHeaviest song on the album: \"All Nightmare Long.\" Some great riffage in it.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nI think its like One, soft intro, heavy guitars, then soft again then heavier and faster and long solo. :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nOh yeah and it ends abruptley.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI think it's important that in the lyrics that come with the CD it's: SONshine never comes.\r\nWhen I read these lyrics what jumped out at me, like a lot of people here was an abusive relationship as well.  But an abusive relationship in which the wife is waiting for the day when her son will be able to protect her?\n\r\n\"God I'll make them pay\r\ntake it back one day\r\nI'll end this day\r\nI'll splatter color on this gray\"\n\r\nTo me that's the son talking, along with the outro: This I Swear etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nEveryone who thinks this is about an abusive relationship...\r\nLyrics often have meanings on different levels, but the abusive relationship story is a metaphor on America's ongoing wars, especially the one in Afghanistan.\n\r\n\"The day that never comes\" indicates that the government sent troops to bring peace (according to themselves), and that the soldiers have to wait forever, cause that day will never come.\r\nThey also sing \"Waiting for the one\"; could be Bin Laden. \n\r\nThe economical costs are astronomical, for each day he is still out there, America is drained for money.\n\r\nI myself think they have been inspired by System of a Down's lyrics. They also use a lot of metaphors on USA's warfare.\n\r\n-Kjetil-\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nto me, this song has a very \"fade to black\" feeling to it. not necessasarily the meaning, but the structure in the creative process that was followed and the general feel of the music. great f'ing song! hands down my favorite after song after \"suicide & redemption\"\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nin my opinion is something like the unforgiven,the song critizise the society or the family or somone who do not permit to live how we want to,and we swear that someday we can...maybe...that's not a bad meaning,isn't it?\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nhas anyone else noticed similarly this song is structured compared to free bird - lynyrd skynyd? of course much more thrash, but the structure is definitely similar\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nin my opinion is something like the unforgiven,the song critizise the society or the family or somone who do not permit to live how we want to,and we swear that someday we can...maybe...that's not a bad meaning,isn't it?\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nthis song is good! I luv it!\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nwell as what james said in an interview its about humanity. its nice it can be put into different meanings though\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nMost of your meanings of \"the day that never comes\" about the abusive relationship i agree with. I have a few additional notes:\n\r\nThe day that never comes: is the day that the abused will leave the abuser. But very often this never happens  for unclear reasons, but the abused would say it is because he/she \"loves\" the abuser...\n\r\nFirst 2 verses to describe the relationship, and the fighting:\r\nBorn to push you around\r\nbetter just stay down\r\nyou pull away\r\nhe hits the flesh\r\nyou hit the ground\n\r\nmouth so full of lies\r\ntender black, your eyes\r\njust keep them closed\r\nkeep praying\r\njust keep (a)waiting\n\r\nmouth so full of lies - \r\nthe lies of the abuser, like \"i'll never do it again...\"\n\r\nThen a verse about the hope that everything will be better:\n\r\nwaiting for the one\r\nthe day that never comes\r\nwhen you stand up and feel the warmth\r\nbut the sunshine never comes, no\r\nno, the sunshine never comes\n\r\nNext verse is about the severe pressure the abused is under to NOT leave the abuser, it refers to the wishes of the abused to end the struggle, maybe by leaving:\n\r\npush you cross that line\r\njust stay down this time\r\nhide in yourself\r\ncrawl in yourself\r\nyou'll have your time\n\r\nthen this:\r\nGod I'll make them pay\r\ntake it back one day\r\nI'll end this day\r\nI'll splatter color on this gray\n\r\nThis part I explain by the dream of the abused to retaliate the abuser and actually leave him/her... (its only a dream at first)\n\r\nlater on:\n\r\nLove is a 4 letter word: Love doesn't actually exist in this relationship, it's just a word used to stay together.\r\n(i like the duality with \"fuck\" and \"shit', words often described as 4 letter words...)\n\r\nnext:\r\nI suffer this no longer\r\nI put it into\r\nthis I swear\r\nthis I swear\r\nthe sun will shine\r\nthis I swear\r\nthis I swear\r\nthis I swear \n\r\nSo in the end, finally, the abused will leave the abuser and the sun will shine! \n\r\nMetallica actually has an happy end... where are we going to in this world.... :-)\n\r\nReally great song by the way.\n\r\nI dont really like the video, and i also think that is doesn't have anything to do with the meaning of the lyrics. This is very often the case with video's.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nhey everyone, new to posting on this site. im not a big metallica \n\r\nfan, but there are a lot of songs that i enjoy from them. when i \n\r\nfirst heard this song, i knew right away what it was about. this is \n\r\nwhat i came up with relating it to the world in general. war scenes \n\r\nin the video is just a metaphore. the war, this song and others \n\r\nfrom metallica, speak of is the war between ourselves.\n\r\nthis song has to do with people who believe in hope/fait/religion. \n\r\nwaiting for the \"the one\" to save all from this \"prison\". these \n\r\npeople feel the \"warmth\" of their \"belief\", but that \"one/sunshine\" \n\r\nnever shows up.\n\r\nthe first verse is in reference to how we are all born into \n\r\nbondage. a world of enslavement within ourselves. never are we \n\r\nhonest with our self expression, just a \"mouth full of lies\". \n\r\nthe second verse deals with being pushed across a mental boundry of \n\r\nours. \"hide in yourself, crawl in yourself\" to supress your true \n\r\nexpression of how you feel about the world/mankind in general. the \n\r\nsecond half of verse 2 is about triumph. taking responsiblity of \n\r\nthis change that \"the one\" is suppose to bring, no more waiting. \"I \n\r\nWILL\" end this day\", \"I WILL\" splatter COLOR on this GRAY\".\n\r\n\"love is a four letter word\". never do we express love in its true \n\r\ndefinition. its just another word in this \"prison\"\n\r\n\"i suffer this no longer... the sun will shine. this I swear\", \n\r\nagain, taking responsibility and doing something about this \n\r\n\"prison\", instead of waiting for \"the one\".\n\r\nand that is what i believe this song is all about. same goes for \n\r\nthe song \"One\", not about physical wars, more about the battle of \n\r\nour true be-ing. self honesty is the key to true expression of \n\r\nself, that is why in the song \"unforgiven 3\" he asks himself \"why \n\r\ncant I forgive ME\".\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nsorry for the double spacing, wrote this down first on notepad and pasted.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nHard to comprehend, sorta, but true enough. The Unforgiven series is about how they always try to keep you on your knees so that they can use you...but always about how you'll fight back with every ounce of muscle in your body.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nAlright, people are probably gonna think I'm on crack or something but listen to the whole album and take it all in... I believe this song is about taking all you've gotten from this life on earth and realizing that there is more after death. \"the day that never comes\" is the day that the lord has forgiven you for all you have done in this cursed life. \"the sun will shine\" meaning the light will win over all of your dark desires. This song as well as this entire album is based on a new found belief in the one that truly loves all of us.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nhey everyone,  im a first time poster for this site, but i posted my interpretation of these lyrics on the second set that shows up under metallica.  this set of lyrics are a tad bit different.  first off, im not a that big of a metallica fan, but i do understand most of what james hetfield speaks of .\r\nthis song has to do with those who believe in some \"one\" or some thing that will save mankind from this \"prison\" we blindly live in. \n\r\n\"Born to push you around...\"  james sees people as slaves in this \"prison\", not in just this song either (end of the line), so this is what the first part of the verse means.   \"Mouth so full of lies...\"  no one is truely honest with their own selves (thoughts suppress our true expression), which \"tend to black your eyes\", of truth.\n\r\nwhile people wait around for \"the one\", they live by what they \"believe\", and doing so, they feel \"warm\" about themselves.\n\r\n\"Push you cross that line...\"  frustrated from living in this \"prison\", james is saying to just suppress this feeling till the moment to take action in which he will make \"them pay\". (the ones who enslave people into this prison).  \"I'll end this day...\",  knowing that there is no \"one\" that will come to save the world, he takes responsibility of the issue, ending the days of waiting, giving color to everyones grey perception of life.  \n\r\n\"Love is a four letter word...\", love, in this prison, is used religiously by people.  in other words, love is not what is needed for the world to change.  understanding this, he does not \"suffer\" from this confusion any longer and again takes responsibility and \"swears\" by his own self that the world will change.\n\r\nsorry if this was too long but it is important that every verse is explained and not just some of the lyrics, like some people on here.  so this is not about a relationship, or a war with armies, or just a story.  all of james' songs have to do with life in general in which we can all relate to.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\ngreat song death magnetic sounds like the missing link between ...and justice for all and the black album\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nThe way I initially interpreted it was for it to be between a person and a drug habit they can't kick. In this sense, it is about an abusive relationship, but it's a relationship between a person and their habit, not about a relationship between two people necessarily. \n\r\nThe way I would summarize the lyrics with this interpretation is as follows: the addiction pushes you around and makes you more and more reclusive. You lie to everyone around you and become hostile towards those who love you and end up crawling inside yourself amidst all the destruction the addiction is causing around you -- it's the only place you feel safe and sane, is in your own head in your own world and you're basically imprisoned there. You keep hoping for the day that you will be free of the imprisonment of addiction and feel the warmth of redemption (the sun shining on you), but it's ultimately a day that never comes.\n\r\nThat's just my 2 cents on the song. I'm sure you can apply a political twist to it or something, but based on the rest of the album's lyrics, I don't think that's the direction they were heading.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nthe day that never comes to me is the day something bad and unexpexted occurs. maybe NWO being  initiated and being betrayed by the government you once beileved in\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nyeah... this song is defiantly about a dad beating his son, and eventually the son gets tired of it and kills the father. by they way, the lyrics posted are wrong. if you get the cd itself the correct lyrics are in the book. for example, in the book it's actually \"son shine\" not \"sunshine\". and its \"splatter cover on this grave\" not \"gray\" and it's \"tend to black your eyes\" not \"tender black your eyes\"\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nPART OF THESE LYRICS ARE WRONG!!  REFER TO \n\nsongmeanings.net/…\n\r\nWRONG LYRICS CAN SCREW WITH INTERPRETATION. \n\r\nGilson.. you can clearly hear the L in \"color\" and  AY in the word \"gray\". this is not about addiction or child abuse. those interpretations do not go with the video. and about the \"son shine\". if it is even written this way, he could be refering to the \"son of God\", as an example of people waiting for \"the one\".\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nok i had ment color. i accidentally put a \"v\" and believe me, i've read quotes from the band members. its about an abusive relationship. and its \"grave\" it's in the book.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nAnyone think that this song could be about rape?\n\r\nSeems like it could be about somebody being forced to watch a rape.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nAlso, this isn't live journal. I swear, you guys could tie a bad relationship to any song you hear.\n\r\nYou had a break up...get over it. Quit cluttering up the comments with your \"I think this is about having a broken heart\" \"I think this is about a relationship you really miss and you can't get it back\" \"It's about an abusive relationship but you stay in it anyway cuz you're a weak pussy and instead of doing something about your problems you get on a series of tubes and go write about how the song you just heard is obviously about the same problem you keep having.\"\n\r\nSeriously, get over yourselves. Or at least go back to your blog.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\ndont take any of this wrong. i understand \"grave\" may be written in the cd book but u can clearly hear him say \"gray\". listen to how he extends the word but ends it with a \"yah\" sound rather than \"vah\" for grave. perhaps a misprint? anyway, these other perceptions still dont fit along with the video. maybe the abusive relationship the memebers speak of is our own relationship with ourselves. if people keep waiting for \"the one\", in which will never come, then they just beat their own selves down. james has deep messages in all his songs.\n\r\ni rewrote my perception on this set\n\nsongmeanings.net/…\n\r\neven just 1 wrong word can decieve your perception\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nthis song is about payday\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nthis song has the least abstract lyrics in the album as James says, it's just what is written, somebody wronging u all the time and you having to take it... like in an abusive relationship between any two people (like father n son) or groups... and then you are always planning pay backs when the time comes but it doesn't.\n\r\nThe video, as James puts it actually has nothing directly to do with the song; but it has one thing in common, it's about ppl being in situations that they don't wanna be in n how they act then, human relations etc. So the song video has a timeless quality also to it while being directly about a contemporary topic which is the war in Iraq n Afghanistan...\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nIt's completely about Christians waiting for Jesus to return and it's never going to happen.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nhmm... could this be what James' lyrics have been refering to throughout his career?\n\ndesteni.co.za/…\n\n\n", "comment_78": "\ni believe this is what James has been speaking about since the start of his career. \n\ndesteni.co.za/…\n\n\n", "comment_79": "\nI read all of these comments on the meaning of this song. Most of them are true, of course, since you can interpret the lyrics of a song in many different ways.\r\nI like to combine all these interpretations.  I think that the song is about fighters. Fighters in war, fighters in relationships, fighters in sports and fighters in real life. I really don't see the aggressive people in these lyrics, I would even say that the song is about people who are way too less aggressive or hold their aggression back. About people who were \"born to be pushed around\" and to \"stay down\".  Whatever the reason for this behavior may be, those people either think that they are not able to fight or they don't want to fight even if it's necessary. Whatever reason, maybe because they were raised by their parents to believe that aggression is not a solution.\r\nThe lyrics describe the way of dealing with such situations that require more responsibility, more reaction, more aggression and less waiting for better days. \"The day will never come\" if you don't put up with the things in your way.\r\nâ\u0080\u009eMouth so full of lies\r\nTender black, your eyes\r\nJust keep them closed\r\nKeep praying\r\nJust keep waitingâ\u0080\u009c\r\nDescribes the first reaction to circumstances that require responsibility. If people are not able to take this responsibility, they tend to look away, dream of better days and wait for them to come true. But, as the chorus tells us, â\u0080\u009ethe sunshine never comesâ\u0080\u009c.\r\nâ\u0080\u009ePush you cross that line\r\nJust stay down this time\r\nHide in yourself\r\nCrawl in yourself,\r\nyouâ\u0080\u0099ll have your time\r\nâ\u0080¦â\u0080\u009c\r\nEven if those people are pushed across that line, they still feel the force to hold themselves down. They hide in themselves, but they start to think of a fight: â\u0080\u009eMy time will comeâ\u0080\u009c. The first thoughts of taking action.\r\nâ\u0080\u009eIâ\u0080\u0099ll splatter color in this grayâ\u0080\u009c\r\nIn this part of the process, people start to believe in justice. They try to contribute their share to more justice.\r\nâ\u0080\u009eLove is a four letter word\r\nAnd never spoken in care.\r\nLove is a four letter word\r\nHere in this prison.â\u0080\u009c\r\nTo me, this part of the song describes the rational thinking you have to get into if you want to start fighting. Watching all the unjust things that happen to you or others, you stop to believe in love. In the video, this meaning is shown very clearly. Thatâ\u0080\u0099s the scene where the soldier loads his gun, gets on the military vehicle and starts his own fight against the war. When the lyrics end in this song, the video even continues the plot. We see the soldier getting into a dangerous situation. Saying, when youâ\u0080\u0099re in your fight, donâ\u0080\u0098t trust people implicitly.\r\nThe message of this great song to me:\r\nDonâ\u0080\u0099t be sorry for yourself or the things that happen to others. Thatâ\u0080\u0099s the way life goes. The only thing you can do is to take responsibility, stand up for yourself and others, and fight. For me, the song is a motivation to stop dreaming, worrying or waiting and get up and contribute my share to more justice in this world.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\ni think that james is speaking to robert trujillo that his armpits smells really good. THE DAY THAT NEVER COMES means that there is no way that robert's upper pussy will smell bad.Kirk hammet also helped writing the lyrics cause he too, with no doubt thinks that robert's upper pussy will smell good forever\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nThough I agree this song can be interpreted a few different ways (and I'm pretty sure they meant for that) ..an abusive relationship is what makes the most sense to me. It's what first came to me when I heard it.\n\n\r\nBorn to push you around\r\nbetter just stay down\r\nyou pull away\r\nhe hits the flesh\r\nyou hit the ground\n\r\nmouth so full of lies\r\ntend to black your eyes\r\njust keep them closed\r\nkeep praying\r\njust keep waiting\n\r\nThese two verses talk about the abuse. (\"he hits the flesh,\" \"tend to black your eyes\") It's also about the passive behavior of the abused person. (\"better just stay down,\" \"you pull away,\" \"just keep them closed, keep praying, just keep waiting\")\n\n\r\nwaiting for the one\r\nthe day that never comes\r\nwhen you stand up and feel the warmth\r\nbut the sunshine never comes, no\r\nno, the sunshine never comes\n\r\nThe chorus is about the abused person waiting for the end of the abuse. I agree with what someone said about the warmth being the abuser seeming like he/she is going to change. The cycle of abuse is abuse, making up, calm, then back to abuse. The warmth is felt in the calm stage, but \"the sunshine never comes.\"\n\n\r\npush you cross that line\r\njust stay down this time\r\nhide in yourself\r\ncrawl in yourself\r\nyou'll have your time\n\r\nThis verse is about the passive behavior again.\n\n\r\nGod I'll make them pay\r\ntake it back one day\r\nI'll end this day\r\nI'll splatter color on this gray\n\r\nThis verse is about the abused person wanting to end the relationship and to get revenge.\n\r\nwaiting for the one\r\nthe day that never comes\r\nwhen you stand up and feel the warmth\r\nbut the sunshine never comes\n\r\nlove is a four letter word\r\nand never spoken in care\r\nlove is a four letter word\r\nhere in this prison\n\r\nThe \"love is a four letter word\" part to me says that \"love\" is nothing but a word in the home of an abusive relationship. The word is used by the abuser to make the person stay, but isn't true, not in their \"prison.\"\n\r\nI suffer this no longer\r\nI put it into\r\nthis I swear\r\nthis I swear\r\nthe sun will shine\r\nthis I swear\r\nthis I swear\r\nthis I swear\n\r\nThis part is about the abused person making a promise to themselves not to let it go on any \r\nlonger.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nwhen someone writes about something, it is never meant to be interpreted in different ways. yes the song is about abuse, but abuse with mankind. these lyrics do not refer to one specific type of abuse. some of you are forgetting about the video to this song, which videos are made to go with the meaning of the song. why would james write about an abusive relationship, then make a simple basic video of soldiers waiting for help? \t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nse7en43 is right - the other page for this song has the correct lyrics.  It isn't \"Love is a four letter word/and never spoken in care\" - it is \"Love is a four letter word/and never spoken here.\"  See Metallica's website.  Here are the lyrics from Metallica's website:\n\r\nBorn to push you around\r\nBetter just stay down.\r\nYou pull away\r\nHe hits the flesh\r\nYou hit the ground.\n\r\nMouth so full of lies\r\nTend to black your eyes.\r\nJust keep them closed\r\nKeep praying\r\nJust keep waiting\n\r\nWaiting for the one\r\nThe day that never comes\r\nWhen you stand up and feel the warmth\r\nBut the son shine never comes.\r\nNo, the son shine never comes.\n\r\nPush you cross that line,\r\nJust stay down this time.\r\nHide in yourself\r\nCrawl in yourself\r\nYouâ\u0080\u0099ll have your time.\n\r\nGod Iâ\u0080\u0099ll make them pay\r\nTake it back one day.\r\nIâ\u0080\u0099ll end this day.\r\nIâ\u0080\u0099ll splatter color on this gray.\n\r\nWaiting for the one\r\nThe day that never comes\r\nWhen you stand up and feel the warmth\r\nBut the son shine never comes.\n\r\nLoveâ\u0080¦ is a four letter word,\r\nAnd never spoken here.\r\nLoveâ\u0080¦ is a four letter word,\r\nHere in this prison.\n\r\nI suffer this no longer,\r\nIâ\u0080\u0099ll put an end to this, I swear.\r\nThis, I swear. The son will shine.\r\nThis, I swear,\r\nThis, I swear,\r\nThis, I swear!\n\r\nGreat song, great (and timely) video.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nCorrection to notation in last post - the official lyrics say \"son shine\", not \"sunshine,\" and \"the son will shine,\" not \"the sun will shine\" in the last part.  I am quite sure there is a specific reason for this choice of spelling.  There are clearly several ways to interpret the song, and one is related to Christianity and the second coming.  I am sure that is the purpose of \"son\" as opposed to \"sun.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\ni think it is like a sort of second part to One\r\nwhen it says \"searching for the one, the day that never comes\"\r\nhe wants to die\r\nhe wants to be taken away from the life he hates.\r\nthe one is about being alive and trapped inside a useless body\r\nthis song is about leving that body\r\nit is about finally getting out\r\nhe is saying that the sunshine never comes, he is never relieved of this tourture, but someday he will be\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nThis is the best from death magnetic\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nCan nobody else see that this song is just a carbon copy of One? The pattern is the same, the solos are damn close, this song = an attempt to reclaim the success they had with One...just like Unforigiven II (and III) are attempts to try and make money off of the original. This is not \"reborn\" Metallica...this is still commercial sellout Metallica...idiots.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\n******This song LITERALLY converted me from Atheist to Catholic/Christian******\n\r\n******PS. IN A NON-BULLSHIT CHRISTIAN CATHOLIC WAY!!!!*******\n\r\nFirst let me start by saying THANK GOD Metallica created a few songs that were deep but still simple. I loved Saint Anger, But nothing like I loved THIS album just like the REST of the old Metallica Albums.\n\r\nWhat I mean by Deep but still simple is that, Well, after a song converts you, you tend to show it to other people to show it's effects. Every person i showed it to had a COMPLETELY different interpretation of what the lyrics ment, but at the same time, was touched just as much. Writing a song, that can apply to just about everyone, and remain deep to those who listen to it, THAT is a TRUE masterpiece.\n\r\nTIME for LYRICAL Interpretation!!!!\r\nThis is what it ment to me. As crazy as I feel i sound when i make myself read it now.................\n\r\nBorn to push you around\r\nbetter just stay down\r\nyou pull away\r\nhe hits the flesh\r\nyou hit the ground\n\r\nThis doesn't show much for how I interpret the lyrics actually. Maybe other then how I feel. Hurt, in a \"can't win\" situation.\n\r\nmouth so full of lies\r\ntender black, your eyes\r\njust keep them closed\r\nkeep praying\r\njust keep waiting\n\r\nThis is how I see society with things that walk a moral fine line. How do you know what is truly right or wrong? you can't tell, because the way that society sees it, hinders your view, and BLACKS your eyes.\r\nThe rest says that there's no point in trying to fight or struggle to figure out what society / god? would really consider right or wrong and to just keep praying and waiting......\n\r\nwaiting for the one\r\nthe day that never comes\r\nwhen you stand up and feel the warmth\r\nbut the sunshine never comes, no\r\nno, the sunshine never comes\n\r\nThis explains exactly how I felt. Literally.\r\nIt's Like I was waiting for god to come down and tell me the answers because no one else would tell me the truth of what was truly right or wrong.\n\r\n*When you stand up and feel the warmth*\r\n*but the sunshine never comes, no*\r\n*no, the sunshine never comes*\n\r\nPretty much exactly what it says. Like it's saying \"when \"he\" comes down and tells you the truth, your answers, all the questions you've been seeking, but.. \"he\" never comes\"... Like they're saying.. It's hopeless. It's too late. maybe we'll never know. I've also found several references to \"sunshine\" and connected them to another song by Metallica called, \"The Unforgiven II\". This makes me feel very much as if, maybe we're already in the apocalypse. Maybe evil won, and it's too late. So it made me ask myself what did \"god\" want then. what could I do. And the answer which I felt was correct was that I'd have to lead by example and nothing more. I would have to be the \"Christian/Catholic\" \"he\" wanted me to be. I'd have to undo Years of damage by the Christian/Catholic church. I know TOO many people who \"are\" their Religion, but they don't practice they're religion. And hey, to each they're own, but there's a reason why such a HIGH amount of people have strayed from their faiths. Primarily, the attitude of the church, which i don't agree with half the time, the fact that some church groups will force quotes from the bible on you to try to sway what you do, or how you think. And it just gets increasingly more judgmental and aggravating. Do Not Judge. ITS RIGHT UP there with do not Kill/Steal/Cheat. If people were just left alone to figure out their own PERSONAL RELATIONSHIP with \"god\", everything would be fine. Instead people are forced, judged, directed too harshly, etc. All I can do is admit that I am what I am, show it's OKAY to be what I am, and show it's okay to have a relationship with god, even after previous mess ups, and hopefully people will see my convictions, that i am what i am and HOPEFULLY (this is all I really want) reconsider their own personal relationship with god/jesus/whatever saint you feel closest to. and when the time is right, things will work themselves out and things will be good. just keep that door in your heart open.\n\n\r\n****************LYRICS CONTINUED****************\n\r\n***push you cross that line***\r\n***just stay down this time***\r\n***hide in yourself***\r\n***crawl in yourself***\r\n***you'll have your time***\n\r\nSame as the first set of lyrics. just set the mood for how you physically feel? \n\r\n***God I'll make them pay***\r\n***take YA** back one day***\r\n***I'll end this day***\r\n***I'll splatter color on this gray***\n\r\nThis is AGAIN exactly how i felt. \r\nI was so upset. I was literally crying to myself thinking about God. How I felt like he just wanted to love with open arms. How everything should be unconditional. But i denied him for so long, and that society couldn't see the truth. how so many people hate religion based on what they've seen from others and how they practiced it. How many people reject god/jesus/whom'ever, because of how an entire group/society treated them. And all god wants to do is offer salvation. Love. Open Arms. But you need to open your arms as well to receive him. As gappingly homosexual as this all sounds to the majority of you, i broke down.\r\nTake ya* back one day can mean a lot of things.You could just be saying. just give me time. but hell .it's pretty generic.\r\n***I'll end this day***\r\n***I'll spatter Color On This Gray***\n\r\nExactly how i Felt AGAIN. It was like after realizing how my religion was, and how other people were directly effected by it, especially all the while it was like, \"he\" just wanted to give love and be there for anyone who wanted to come, It's like me making a vow. That I'll end this misconception. I'll fix the problem by showing the truth. I'll spatter color on this gray. People WILL see the truth. And that's all I could DO for \"him\".\n\r\n***love is a four letter word***\r\n***and never spoken in **HERE***\r\n***love is a four letter word***\r\n***here in this prison***\n\r\nPretty simple. take it for what it is / for what you want. Love's not felt in this prison. Prison of lies and misconception and lack of truth. \n\r\n***I suffer this no longer***\r\n***I'LL PUT AN END TO*****\r\n***this I swear***\r\n***this I swear***\r\n***the sun will shine***\r\n***this I swear***\r\n***this I swear***\r\n***this I swear***\n\r\nHim Swearing that he'll put an end to the lack of unrebuttaled love. Wanting to fix everything, swearing that The sun WILL shine. That the truth will be seen, that god's still here.\n\n\n\n\n\r\nOK. Now that was extremely RELIGIOUSLY based. Perhaps no one else will see it the way i did, like i said, i showed it to quite a few people, and every person came to their own relization and conection on how it exaplained their life. FROM A ATHEIST - CHRISTIAN ALLLLLL THE WAY TO AN ANAREXIC EXPLAINING HER SITUATION AND HOPING FOR RECOVERY! really... i swear that was one person's interpretation.\n\n\n\n\n\n\r\nEither way, this song rocks. \n\r\nSorry to include so much religion. I know it's a touchy hate hardcore topic for a lot of you out there. \n\n\n\n\n\r\nGood lucks all!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nThis is my favorite song for the simple fact in PERFECTLY conveys an emotion. One very familiar from a abusive relationship.  I agree this isn't there best musical composition, or lyrics. The combined emotion created by the two is what makes the song real. \n\r\nI agree it is about a abusive relationship, but more accurately I think it is about a abusive father-son relationship.  \n\r\nIt captures that rage of an abusive father-son relationship.  You are powerless to stop it, so you develop a deep rage.  You allow yourself to be put into submission because that is the only thing that makes it stop, and your hatred is the only thing that can't be taken away. \n\r\nWith this interpretation the lyrics make perfect sense to me. Having to fit it to music can distort the strict interpretation of lyrics. In that there I can see two lines that are iffy:\n\r\n\"God I'll make them pay\"\r\nThem isn't singular, so perhaps his mother was in on it to?\n\r\n\"Born to push you around\"\r\nWhile your father may be abusive he isn't necessarily born to abuse. Or perhaps he was abused to.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nListening to this song reminds me of war and oppression, that I think the MV is quiet relevant to what message the song delivers. It speaks of revenge which is somehow impossible but will eventually come. There is hope, hatred, courage and a lot more feelings rolled into one in its vague but powerful lyrics.\n\r\nHail ye Metallica \\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\n  I was thinking it might mean when someone has had relationship after relationship that goes nowhere or keeps getting screwed over. Tired of meaningless relationships and waiting for that one person that never comes. I feel getting emotionally beaten down is worse than a physical beat down. \t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nits about the day that never comes, you know, the day that hetfields been wanting mustaine back in his life. he wants mustaines dick but he wont let him, poor unforgiven faggot.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nYeahh i think it might be about domestic violence but thats just my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nThe song is about abuse whether it be someone feel like they are being abused by humanity, or it is a physical/emotional abuse by a father to his son (though with how sun is spelled son it makes it more likely it is literally ment that a son is being abused by his father).\n\r\nAnd all of you morons saying that it cant be abuse in a family \"because it doesnt make sense with the music video\" need to stop being a bunch of tards, not every music video follows the lyrical content of the song its for, jesus.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nThe song is about forgiveness and resentment, and the lyrics were inspired by a father-son relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nI think this song is just about how things sometimes will never be better.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\ni think this song is about revenge. you are waiting for the day to take back what you lost but it never comes because revenge just leads to more hurt. he says 'God ill make them pay take it back one day' i think he is talking about getting his revenge on some one but the day never comes. \t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nSome songs can mean whatever you want it to mean, \r\nthis is one of those song\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nhey has anyone else noticed this stickingly resembles \"The Giver\"? \n\r\nmouth so full of lies\r\nThroughout the entire book, everyone tells lies at pretty much every turn\r\ntender black, your eyes\r\neveryones eyes were black, even though if you saw through the illusion they werent\r\nwaiting for the one\r\nthe day that never comes\r\nwhen you stand up and feel the warmth\r\nbut the sunshine never comes\r\nThere was no sunshine because it caused cancer or whatever, so they simply eliminated it\r\npush you cross that line\r\njust stay down this time\r\nNow hes told them to stay down twice, and if you get back up you are \"released\"\r\nGod I'll make them pay\r\nThe main character of the book (drawing a blank on name) feels animosity toward the Elders, the leaders, and wants to make  them pay.\r\nI'll splatter color on this gray\r\nThe book takes place in a colorless community, and he just wants to have the color he sees in memories\r\nlove is a four letter word\r\nand never spoken in care\r\nYou never said love, because it was a word noone even knew the definition of anymore.\r\nlove is a four letter word\r\nhere in this prison\n\n\r\nThe commnity the lived in was like a prison.\r\nI suffer this no longer\r\nIn the end he decides that he wont live witth this anymore\r\nthe sun will shine\r\nthis I swear\r\nthis I swear\r\nthis I swear \n\r\nIn runing away, he frees his memories and everything he believes will return to normal\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nIt's \"tend to block your eyes\" not \"tender black your eyes\"\n\r\nAnd it's about child abuse I think, because the lines, mouth so fill of lies/tend to block your eyes, is about how abusive mothers always lie to their kid to make it seem that it's their fault so they don't get caught. And the very first four lines Is obviously about getting beat up or something.  And the chorus is what Benighted said \t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nIn my honest opinion, I think that it's about a father-son relationship, because the \"sun\" is actually spelt \"son\" in the lyrics booklet.\n\r\nPicture yourself as the son in a family. Your father does nothing but beat you and put you down all the time. You think he was \"born to push you around\" and instead of taking more, you \"better just stay down\".\n\r\nThe chorus, to me, says that you're waiting for the day when you'll be free of his abuse. \"The day that never comes\". But that day might be too far out of sight. He may kill you before then. So \"the son shine never comes\".\n\n\r\nOne day, he \"pushes you 'cross that line\" and you feel like getting your own back on him, or standing up to him. So you say to yourself \"God, I'll make them pay!!\", hoping that they'll \"take it back one day\".\n\r\nBasically, all this song is about is a father abusing his son and then his son getting his own back on the dad.\n\r\nThat's my interpretation of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nwhen u stand up and feel the warmth...this dudes voice is so kool i love james hetfield and metallica...this song is so kool...for some reason i think new school metallica is better than old skool..this song is like so kool man...i fuckn love it...as i speak now im going to to try to practice the drumming on this song by lars ulrich.. and btw, fyi kirk's riffs are mazing i head bang to them all the time or do some kind of random movement to it..idk lol i have to\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nwhat this song is about is \"The Day That Never Comes\" which metaphorically means the day that our troops come home from Iraq and war itself, every time someone says that the troops are coming home somthing happens to make them stay so, hence, its a day that never comes.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\ni think the song is talking about how U.S. soldiers are over in Iraq taking all this crap from the government. they are waiting for a day when they can leave that hell and return home, but that day is the day that never comes.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nThis is the greatest song Yeah! \r\nbest video , best all!\r\nDEATH MAGNETIC album is the greatest thrash metal!!!!\n\n\n", "comment_106": "\nahhh! love this song. it's flippin awesome. at first when i listened to it i thought it was about someone being abused but when i saw the music video i thought maybe it's more than that. like it could be about one of the wars. or maybe it's a medaphore about life like i write music and sometimes life is described as war right? like the music video's about an injured soldier. you know like when you're brother is down in the \"war\" you want revenge on who's to blame. idk. what do you guys think? i mean i think it's important for music and poetry not to have only one meaning and one way to be looked at but it's important for a song to mean different things to different people. like whatever's important to the person. get what i'm saying? the song can have different meanings to different people according to what they're feeling. sorry to get touchy.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nI actually think it's about being picked on by any way, and not being cared about... And waiting 'till you get to give them back, like \n\r\n\"God I'll make them pay \r\ntake it back one day\r\nI'll end this day\r\nI'll splatter color on this grave\"\n\r\nSo there is person X, who is this silent, depressed human, who is being bullied / kept as nothing for his whole life, and he is tired of it and decides to give it all back at once, \"splattering colour on his grave\"....\n\r\nFirst he think that he shouldn't even try to make it better.\n\r\nBorn to push you around\r\nbetter just stay down\r\nyou pull away\r\nhe hits the flesh\r\nyou hit the ground\n\r\nAnd then he gets tired of it and starts swearing that there will be better times for him :).\n\r\nJust my 2 cents for the song's meaning.\n\n\n\n", "comment_108": "\ni dont know what it is but whenever i hear the guitar solo i think of good vs. evil like the good of the high pitched notes vs. the low pitch and darkness of the other guitar, but thats just me\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nThis is just my opinion, but did anyone else hear like a mixture of One and Sad But True? Cause I sure did. Since both those songs rocked, this is a great song probably 3rd best on the album, right under My Apocalypse and Cyanide.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nI think this song is about cliffs death\n\r\nwhen they say the sun will never shine that is how they were feeling when he died and when they saying this i swear the sun will shine i think that they are saying there will be away to get over his tragic death\n\n\n", "comment_111": "\nYeah I thought this was about an abusive relationship too, cuz when he says,\" you better just stay down\" I thought it was \"baby just stay down\". Also the \"love is a 4 letter word\" part, but the soldier theme sounds cooler so meh\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nEven verified by the itunes digital booklet, the lyric is sonshine. Does anyone know why it isnt sunshine?\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nAwesome Song...Always reminds me of the Punisher(the one with Tom Jane...Not the shitty warzone)\r\n :)\n\n\n", "comment_114": "\ni love the music video to this song. It shows what really gose on in iraq and what our boys have to deal with\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nMore than about A relationship, I think it's a person haunted by MANY such relationships. Notice it says \"God I'll make THEM pay\", not him.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nthis song is incredible. Got me really listening to their other stuff. Some one is stuck in an abusive relationship. Another in a long line of bad. First time I heard this was about the first time I saw Mary J Blige in \"I can do bad all by myself\". She sings the song in the movie. Similar theme, incredible performance. the You Tube version does not sound near as good as the movie itself. \t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nwell whatever this song may mean, there's no doubt it is anabsolute kickass.The sound is very very addictive. METALLICA rules!\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nwell whatever this song may mean, there's no doubt it is anabsolute kickass.The sound is very very addictive. METALLICA rules!\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nMetallica Rocks Great Song \t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nI guess I can believe so few people would know what this is about, It is one of the the most powerful and deep songs EVER written. I made an account just to write a post for this song. The lyrics are absolute.\r\nfirst the song is about high school and the pain that an outcast or \"loser\" endures and what it does to him also this persons homelife is equally as bad. This is a song about making your reason for living revenge. \n\n\r\nBorn to push you around\r\nYou better just stay down\r\nYou pull away\r\nHe hits the flesh\r\nYou hit the ground\r\nMouths so full of lies\r\nTend to black your eyes\r\nJust keep them closed\r\nKeep praying\r\nJust keep waiting\n\r\nThis is about getting picked on in school and praying for a way out even though it never comes\n\r\nWaiting for the one\r\nThe day that never comes\r\nWhen you stand up and feel the warmth\r\nbut the sunshine never comes\r\nNo the sunshine never comes\n\r\nThis is about waiting for God to come save you, at this time the person being bullied is still a good person and even though this person remains good inside he realizes that his immense hope for change will not ever happen.\n\r\nPush you cross that line\r\nJust stay down this time\r\nHide in yourself\r\nCrawl in yourself\r\nYou'll have your time\r\nGod I'll make them pay\r\nTake it back one day\r\nI'll end this day\r\nI'll splatter color on this gray\n\r\nThis is about getting pushed past the point that the person can handle and even though this person strongly desires to fight back they can't and he retreats inside himself. Now what this means \n\r\n\"Crawl in yourself\r\nYou'll have your time\r\nGod I'll make them pay\r\nTake it back one day\r\nI'll end this day\"\n\r\nHe is filling himself with hatred and quite literally his soul is burning away. this persons world is so dark and this person is doing everything in his power to make it somewhat normal. \n\r\nLove is a four letter word\r\nAnd never spoken here\r\nLove is a four letter word\r\nHere in this prison\r\nI suffer this no longer\r\nI put it into\r\nThis I swear!\r\nThis I swear!\r\nThe sun will shine\r\nThis I swear!\r\nThis I swear!\r\nThis I swear! \n\r\nthis part really got to me, Whether they know it or not Metallica is the embodiment of the antichrist.\r\nthese lyrics are right here, these words in they way they are written are nothing short of... amazing there are no words to describe this. This is when the person being abused has something that pushes him to a point where he gives up, He literally has reached a point where he will no longer try, fuck the world cannot begin to describe what this person feels. Since he cannot be a good person and he cannot find any peace inside himself. He gives in to his hate, he closes his eyes, and the only two things that remain inside himself are revenge and pain. He makes a promise with himself, so absolute that even if he wants to he will not be able to break this pact. He has sold his soul, and it will never come back, The title of this song is also rather amazing. It is called \"The Day that Never Comes\" because even though you are now a husk of a person, and are dead inside, probably forever. That pact that you made with yourself to BY ANY MEANS NECESSARY no matter the workload or task before you. is void because there is absolutely no way you will get revenge on the entire human race. It is a physically impossible task and even though the promise stays strong inside you. The best way to explain it would be that the world get in the way of your ambition of revenge. That is why the song is called the day that never comes. \n\r\nThis song.... is the abyss of the human spirit, this is basically the outcome of abuse. Bullying, probably domestic violence, among other things. Metallica IS THE BEST. anyone who says otherwise is literally shallow and they don't even know it.\n\r\nThis is why you don't bully people and this song is why people bring guns to school, WATCH WHAT YOU F**CKING say because you don't know who you are pissing on.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nI think it's about bullying(but my interpretation on bullying is close to war)\n\r\nBorn to push you around - The bully is born to push you around\r\nYou better just stay down - Or else he'll hit you again\r\nYou pull away - You try to run or you refuse to fight\r\nHe hits the flesh - He still hits you\r\nYou hit the ground - you fall down\r\nMouths so full of lies - People call you a loser\r\nTend to black your eyes - You start to believe them\r\nJust keep them closed - Keep your eyes closed to stop believing in their lies\r\nKeep praying\r\nJust keep waiting\n\r\nWaiting for the one\r\nThe day that never comes - The day when the bullying stops\r\nWhen you stand up and feel the warmth - The warmth of love from other people\r\nbut the sonshine never comes - the son is not exceptional and will never break free. He will never shine.\r\nNo the sonshine never comes\n\r\nPush you cross that line - It's the last straw\r\nJust stay down this time - You are begging yourself not to fight them\r\nHide in yourself - Don't show your feelings\r\nCrawl in yourself - Live inside yourself\r\nYou'll have your time - Your revenge\r\nGod I'll make them pay\r\nTake it back one day - \r\nI'll end this day - I'll end this bullying once and for all and start a fresh new day\r\nI'll splatter color on this gray - Splatter is defined in oxford dictionary as:\r\n\"splash with a liquid, typically a thick or viscous one\" A thick liqued would be blood on his gray life.\n\r\nWaiting for the one\r\nThe day that never comes\r\nWhen you stand up and feel the warmth\r\nbut the sonshine never comes\r\nNo the sonshine never comes\n\r\nLove is a four letter word\r\nAnd never spoken here - I feel no love and I am not sure it exsists \r\nLove is a four letter word\r\nHere in this prison - In this awfull place love is only a four letter word and not a feeling\r\nI suffer this no longer - I will stand this any longer\r\nI put it into - I put all of my hatred into these words\r\nThis I swear!\r\nThis I swear!\r\nThe son will shine - I swear that I will shine!!! I will break free.\r\nThis I swear!\r\nThis I swear!\r\nThis I swear!\n\r\nAnd then comes the instrumental part which in my ears sound a lot like a school shooting. Metallica has used guitars to simulate machine guns before(disposable heroes) and the fast riffs do sound like a machine gun.\r\nHe knows that school shootings is not an option for him because to him it's madness but in the end he has been pushed so hard that he has become insane and is laughing as he shots his fellow students(The laughing being the higher pitched fast riffs together with the sound of the gun, while the low is just the gun). \r\nThis is just my interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nIt's about a soldier who loses his friend to an I.E.D. and is angered at the Muslim people but learns to forgive them. (Watch the video)\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nI like that James keeps the lyrics somewhat vague but I believe this song is more personal than generally thought. I agree, I think the song is about abuse, but not as a broad statement. \n\nJames and Jason did not have a good relationship. James could never get over the loss of Cliff and he took it out on Jason. While the other members learned to accept Jason as a full member of Metallica, James never could and subsequently, did not let Jason contribute very much artistically to Metallica. James continued his stranglehold on Jason when he told him he could not go do his side project. Jason drew the line there and quit Metallica. \n\nThe downward spiral of Metallica ensued resulting with James in rehab for alcohol. It took getting sober for James to realize what a control freak he was being and why he was being that way. James' admissions start to come out lyrically with All Within My Hands from St Anger...\n\n\"Love is control. I'll die if I let go.\"\n\nThe Day That Never Comes is a further explanation of that line, why it is important and what it means. The lyrics don't really expose the true meaning of the song until the second verse...\n\n\"Push you cross that line\nJust stay down this time\nHide in yourself\nCrawl in yourself\nYou'll have your time\"\n\nThis is James controlling Jason's contributions while attempting to comfort him with the notion that this is your one and only family and one day, you will shine. James continues to explain his behavior with this...\n\n\"Love is a four letter word\nAnd never spoken here\nLove is a four letter word\nHere in this prison\"\n\nThis ties back to the \"Love is control\" line from All Within My Hands. Love did not mean \"love\" in the general sense to James. Love meant control; control meant love. James did not want Jason to do his side project because he did not want Jason to \"like\" that better and leave Metallica. \n\nHowever, this control over Jason is what ultimately lead to his departure. Jason was never allowed to make the contributions to Metallica that he wanted to, nor was he ever truly accepted by James as a full member of Metallica. That is The Day That Never Comes.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI believe that this song and video are about the choices and decisions that soldiers have to make under pressure. Metallica shows us that a hardened soldier can still have a soft side to them.\n\n\nWhen his friend is shot, he feels sad or hurt or like the love has been \n\nbroken. As the lyrics state â\u0080\u0098love is a four letter word, and never spoken hereâ\u0080\u0099\n\nwhich means that love is like a swear word on the battlefield. Like anyone, the soldier is upset when his friend is shot.He channels his anger to go and fight for justice.\n\n\nWhen the team spotted the Arab couple they were on to it straight away as they were tense and uneasy. The soldier was primed and ready to shoot but then he remembered his friend and made the decision to cease fire and break the cycle. Otherwise everyone ends up killing each other.\n\nI think Metallica wrote this song to show people how the soldiers are actually all good. They are not stereotypical war machines.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nTo me this song is about a guy who likes this girl that is in an abusive relationship. The guy is saying \"the day that never comes\" is when the girl will realize that the she doesn't belong in that abusive relation ship. When it is said \"love is a four letter word never spoken here\" the narrator loves this girl but she doesn't love him at all. When the narrator says \" I suffer this no longer\" and \"the sun will shine\" I think he is saying he moved on because he knows he will never have a shot with that girl.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nNot only their best song in my opinion but delivers a strong message along with it. The guitar is so good in this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nThis song is obviously about the Cleveland Browns search for a franchise Quarterback.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nIt's about war, its an anti war song following someone who's friend got shot at war and he seeks revenge he will \"splatter color on this gray\" and \"God will make them Pay\" and he swears it, that's what the song is about.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nThis song, to me, is about physical and verbal abuse. Growing up, I was bullied and beaten by my dad. I once tried to enlist in the marines and he saw the paper in the mail. Said I was too stupid and weak to make it and continued to beat me. When I heard this song, it hit me like a brick. Love this.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nMost of you got a decent intuition imagining that it is about an abusive relationship.  I probably would as well if I hadnâ\u0080\u0099t luckily found out long ago that every instance of sun in the lyrics is spelled son.  After finding this out I did research and my new feelings about the song were close to what I newly imagined.  Anyway, the song is essentially about a child growing up in a loveless, occasionally abusive family with unfeeling parents.  Specifically it is about Hetfieldâ\u0080\u0099s own upbringing.  So sorry it wasnâ\u0080\u0099t about relationships at its heart.  But hey, music can be what you want it to be and honestly the relationship angle works so go with it if you like.  Either way pretty good song man.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nGreat song. Metallica are back!!\t\t\t\t\n\t\t\t\t\n\n"}