{"comment_0": "\nWhat is it like to leave a place you love, experience life, but realize that you are not fulfilled?  Even more so, what do you do when you return home to rediscover yourself but all you encounter are the memories that echo your brokenness?\n\r\nThroughout the verses of this song, Miranda introduces the occupant of her old house to its history, while switching to her current struggles in the chorus.  She starts with a brief introduction of the house and then ventures to more specifics once inside.  The climax of the song hits when she realizes that she has done the best she could in life but has managed to lose herself along the way.  Her current attempt to rediscover herself is evident in the visit to her old home.\n\r\nThe great thing about great songs is that they can have different meanings to different people.  Songs can also have varying meanings for the same person, depending on their life stage and point of view.  I find this to be the case with â\u0080\u009cThe House that Built Me.â\u0080\u009d  When I first heard this song, I thought of when I left home for college and a professional career.  I often thought of what it would be like to go back and if I would find restoration of the sadness that I experienced with leaving home for school.\n\r\nHowever, after listening to the song again, I have discovered another meaning that relates loosely to the â\u0080\u009cParable of the Prodigal Sonâ\u0080\u009d in the Bible (Luke 15:11-31).  This parable describes a son that leaves home, squanders his wealth, experiences heartache and poverty in his attempt to live on his own, and  then eventually returns home to his family.  Similar to the parable, Miranda sings about how â\u0080\u009cyou leave home, you move on, and you do the best you can.â\u0080\u009d  Like the prodigal son, there was a realization in Mirandaâ\u0080\u0099s song about how in doing what she thought was best, she â\u0080\u009cgot lost in this old worldâ\u0080\u009d and forgot herself.  In the song, however, she returns to a home occupied by another, and no mention is made of where the family is.  While listeners may not know the specific reasons for leaving, there is a bittersweet perspective given when visiting her old home.  While the prodigal son was able to reconcile with his family, the main character in this song was not as fortunate during her visit. \n\r\nThis particular view of the song reminded me that there will be a moment when it may be too late to receive restoration in the way we may desire.  There is an appreciation for oneâ\u0080\u0099s past and a longing to be made well again, and it is through this that we find an emphasis on not postponing healing.  The song leaves me questioning where will she go after her visit?  What type of healing was she able to experience?  In her taking â\u0080\u009cnothing but a memory,â\u0080\u009d did she not find the repair that her heart needed?\n\n\n", "comment_1": "\nAbsolutely love this beautiful song. You can almost see yourself in twenty years time saying the exact same thing to the new owner of your old house. It has a nostalgic tone to it that really touches my heart every time I hear it. I can listen and listen to it and never get tired of it's powerful and emotional words. Did she find what she was searching for? Closure? Fulfillment? I don't know... But I certainly hope she did.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthis song truly means alot to me and probly always will be. I had to move away from my old house after my dad past away and it exactly tells how i want to go back and just remember the good times its sad and i cry everytime i listen to and most of my old pets are burried there to.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI love this song because I relate to it. I lived in the same house in Kentucky until I was eleven and it was just a trailer on two acres, and my mama would cut out pictures of Home and Garden Magazine, Southern Living, O Magazine, you name it, and arrange the rooms and she bought books that had blueprints for houses in them and would dream about her ideal home and Daddy did his best to breathe life into it and make that old, silver trailer into a real house. \n\r\nI was so young and so free and I was me. I just wish I could go back and be me again, but I've lost myself along the way and I just don't know where I forgot who I am or when I lost what I've been missing, but I just want to knock on the door of my old house and ask to look around and try to find what it is that I've lost. I remember my bedroom was so small and had a funny shape to it, but I just want to go back and run my fingers along the window seal where I nearly broke all my fingers when my brother dropped the window on them when I was three, I want to look under the bed where I hid from monsters when I was six, I want to knock on the hollow spot in the wall Daddy covered with Spackle because the door knob went right through it when I was throwing a fit when I was five. \n\r\nI just wish I could pay my respects to my beloved dog, Bingo, one last time, and somehow find what I've lost. I just want to remember again and be myself again. \n\r\nBasically, that's what the song is saying and I cry every time I hear it. I hate everyone who does a cover on it because none of them capture the emotion behind it. They think it's a pretty song and move on. They hear the lyrics, but they don't listen. They don't know what she's saying. They can't connect to it, they don't know how it feels to lose something along the way and want so desperately to backtrack and go back to your childhood home and try to find it and just remember. They sing it with a smile on their face, a laugh in their throat. I want to punch them in the face. They just don't understand and they never will. \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song brings tears to my eyes. I interpret it as when you're younger and you aren't as thankful for what you have until it's gone. I think everyone will experience this feeling. When you look back and if you're able to visit it again, it makes you so sad because all the memories come back. What a beautiful song with beautiful meaning. \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nGod I love this song...it is absolutely amazing.  Miranda's voice on it is so spot on, and the video is amazing.  It talks about how you are raised and how your home values are set and how you want to get back...I can't even form a coherent comment, I love it THAT much.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThis is just my personal interpretation from experience.\r\nBut when she was young she had the perfect childhood. A family with a mom that had big dreams of a perfect house, that her daddy built them. And she was happy, but at some point it was all broken. Probably just because she grew up, and her parents sold the house (or died?(. But maybe her parents could've divorced, and the house was sold to someone else, and she lost that perfect childhood. So now she's tried doing everything to move on and become something new, to fix that broken feeling. But no matter what she can't, because that childhood was a huge part of her life, even if it's not herself anymore..\n\n\n\n", "comment_7": "\ni like this song too. It just makes me think of a girl who grew up and left her home. it sounds like she became something she didnt want to. Now she is trying to find herself again, reminds me of Lady Antebellum's \"American Honey\".\n\r\nWhat does it mean when she says \"i know you dont know me from Adam\"? i dont get it.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI absolutely love this song. Miranda's voice is almost angelic the way she shows the heartbreak in a song. \r\nI agree with everyone, though I do have my own thoughts on it. I get that she wants to go back home to all the memories, and the good times. But why? I think because maybe, she's taken her new life a little for granted. Maybe she feels that she needs a reality check and she knew that seeing everything from her past would help that. Remind her who she is and where she came from. What do you think?\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nSign if you want real country back: petitionspot.com/petitions/fixcountrymusic/\n\n\n", "comment_10": "\nThis one is probably about not knowing what you have until it's gone. It's like if you have a special hideout you went to with your friend when you were little, and you go back when your older and remember all the memories and fun times you had. This one is so sad, but so good.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI think this song is about Growing up and Leaving things behind, then going back to look through the memories. \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI love this song; it has such a nostolgic, bittersweet vibe.  It's a great outlet for feelings of loss and sadness.  It seems to be about someone who tries to revisit her past to find healing for herself, but even at the end it still isn't clear if she found it or not.  \t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni like the line \"ma'am i know you don't know me from adam\r\nmaybe she's referring to adam lambert\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI love this song!!!! It tears me up everytime because of the bad economy and everything we lost our house:((\r\nand I just miss our big old brick house on 4 acres I miss it so much!! I miss my room I miss the smell of lilacs in the spring I  miss the big tree with the tire swing at the top of the hill I miss everything about it there are so many memories there and I never truly appreciated it until \r\nnow and this song just reminds me so much of home:))there really  is no place like home    \t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nso sad..makes me think of my grandma's house back there in our province.\n\r\nwhen I got back there 3 years ago after 14 years of never going there..that was really saddening.I cried.Remembered my granny which was already dead that time.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nMiranda was brought up in a home where her parents housed battered women and their children. So the part of the house that built me means that what she seen and the stories that were told to her while she was home and seen the pain all the women were in it made her who she is today. It helped shape her, so its kinda like saying \"my home made me who i am.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\n\"House that built me\" ... besides the literal interpretation, her talking about an old house.. I also interpret it as being about an old lover, who built her up to what she is today. she is somewhat lost, and in need of that old reassurance, or comfort, of a past love.\n\r\nNot normally a country fan but this is amazing music.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nsince i don't know if i can relate too much to this song because i've lived in at least 2 houses during my childhood so i don't have a particular attachment to any of them, i will present a straight up interpretation to the lyrics and what i think this really song means.\n\r\nthis song is about a home that holds significance to the singer, where she obviously spent most, if not all, of her childood and where she was raised. so she revisits this place probably after a long time away. i am sensing that she probably left home when she just came of age and went out into the big wide world to chase her dreams as an (country)artist.\n\r\nthen she finds herself to have gotten where she wanted to be in her music career and then it hits her that she is so overwhelmed and she gets caught up and loses her true self in all that fame. even though she is now famous she will always remember where she came from and how she was brought up and her family and how all that made her the person she is today.and that without all that she wouldn't have made it to where she is now.\n\r\nSo she feels like the only way she can truly find herself and stay grounded is by going to that place again, perhaps for the last time ever, taking it all in and then finally being able to connect with her roots and get on with her future, knowing she will always be grateful of how lucky she was to have a great childhood even though it is sad to let that part of her life go.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nFirst off I'm completely in love with this song!! Maybe its just me, but i get more from this than just missing a childhood home. It is that of course, but i think its also its supposed to represent a happy place when life was easier and innocent. As you get older things that were once simpler become more difficult and complex This is her need to go back to where things all started, somewhere happy.\t\t\t\t\n\t\t\t\t\n\n"}