{"comment_0": "\nUnforgiven: A child becomes a lost soul after being beaten down by the conformist society\n\r\nUnforgiven II: That lost soul is found by another.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nMy interpretation probably doesn't matter at this point because so many others have posted already, but I'll give it a go anyway. I feel the lyrics describe an introverted guy who finally finds a girl that understands what it means to be lonely. The \"door\" spoken of in the song is the guy's soul, and the girl is the only person who has ever been able to make it \"crack open.\" She dies (\"The door is closed, so are your eyes\"), and he goes on waiting for death, alone again, because she was the only one with the \"key\" to his soul. I can almost relate to this song...I've yet to meet that girl.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\n\"Lay beside me, tell me what they've done\"\r\nHe's find another person, who has gone through the same ordeal he has, society rejects them both, and tries to get her to confide and console in him her experiences and demons of her past.\n\r\n\"Speak the words I wanna hear, to make my demons run\r\nThe door is locked now, but it's open if you're true\"\r\nHe wants her to say things that will help ease the darkness he in consumed in.\r\nThe door symbolising his secrets, the demons, the darkness, pain, suffering, and memories of his past which he will expose and confide to her if her actions are genuine and are really out of love & compassion.\r\nThe door also symbolises the passage to freedom and the gateway to redemption.\r\nHe wants her to help him find solace and bury the burdens of his past. \n\r\n\"If you can understand the me, than I can understand the you\"\r\nIf she can understand what he's gone through and has been in similar circumstances than surely he can understand what she's gone through as well. \n\r\n\"Lay beside me, under wicked sky\r\nThe black of day, dark of night, we share this paralyse\"\r\nHe is asking her to join him in the \"darkness\" with the demons that haunt them. Every passing second they are consumed in this pain and suffering they both feel for their own as well as each otherâ\u0080\u0099s ordeals, \"paralysing\" them in the process.\n\r\n\"The door cracks open, but there's no sun shining through\r\nBlack hearts scarring darkness still, but there's no sun shining through\"\r\nThey both seek solace and comfort in each other hoping for redemption. The \"Sun shining\" through the door symbolises the redemption, the forgiveness they both desperately seek to overcome their demons behind the door to their past.\n\r\n\"Black hearts\" symbolising their own two hearts, still in the \"Darkness\" with their demons. (When I say demons I don't mean literally, I mean it figuratively as in \"demons\" symbolising their woes, negative experiences, haunting memories of their past etc)\n\n\r\n\"What I've felt, what I've known\r\nTurn the pages, turn the stone\r\nBehind the door, should I open it for you\"\r\nHe reflecting what he was taught and programmed to believe whilst growing up by the world, society 's norms, the system, His parents, other people and God.\r\nHe wondering if he should help her seek redemption by opening the door for her, after all she's trying to help him (refer to what i said before about what I think the door symbolises)\n\r\n\"Yeah\r\nWhat I've felt, what I've known\r\nSick and tired, I stand alone\r\nCould you be there, 'cause I'm the one who waits for you\r\nOr are you unforgiven too?\"\r\nHe's faced his battles and the demons of his past alone and wonders if she can be with him as he \"turns the pages\" of his past like a storybook and reads it out a loud to her and help him see through it not alone but together, relieve him of his pain and memories by sharing them with her. \n\r\nIf you notice, when you tend to share your problems with some one else it feels as though they share half the weight of your burden, yeah well thatâ\u0080\u0099s what I'm trying to say here.\r\nHe contemplates if she's like him too . . Unforgiven that is.\n\r\n\"Lay beside me, this won't hurt, I swear\"\r\nHe's trying to convince her to help him confide his darkness in her and promises it won't affect her in anyway, or hurt her in the process (which is a load of bull, because how can not another person's experience especially that of a person whom you love not kill you, to know that muthafckers out there have broken them)\n\r\n\"She loves me not, she loves me still, but she'll never love again\"\r\nAs he's telling her all his secrets, he's unsure if she stills loves him the same still, or if her love for him changes.\n\r\n\"She lay beside me, but she'll be there when I'm gone\r\nBlack hearts scarring darker steel, yes, she'll be there when I'm gone\r\nYes, she'll be there when I'm gone\"\r\nHe's saying that he'll be able to be \"forgiven\" because of her but the thing is he'll be forgiven before her and he will no longer have to live in the \"darkness\" with his demons as he has found redemption at last. \r\nShe on the other hand is still unforgiven and thus lies in the darkness with her demons alone.\n\r\n\"What I've felt, what I've known\r\nTurn the pages, turn the stone\r\nBehind the door, should I open it for you\"\r\nLike I said before I think the chorus is the \"aftermath\" of him finally seeking redemption and leaving the darkness, since it's in past tense with the \"I've\".\r\nNow that he's free, he wonders if he should \"open the door\", help her find redemption as well.\n\r\n\"Yeah\r\nWhat I've felt, what I've known\r\nSick and tired, I stand alone\"\r\nEven though he's found redemption and is free of his demons, he's alone and misses her.\n\r\n\"Could you be there, 'cause I'm the one who waits for you\r\nOr are you unforgiven too?\"\r\nHe's wondering if she could join him and leave the darkness of her demons and find forgiveness too. \r\nHe'll wait for her on the other side of the door, where he's found redemption and accepted his demons.\n\r\n\"Lay beside me, tell me what I've done\r\nThe door is closed, so are your eyes\"\r\nHe's come back and returns to ask her what she thinks of him now, now that she knows everything terrible of his past (The door was open for her to enter and see into his memories of his past but now it's closed meaning she's returned from his past and he's finished confiding his ordeals to her).  \r\nThere is an \"insight motif\". Her eyes are closed now symbolising she has finished searching for answers of his past and knows everything now.\n\r\n\"But now I see the sun, now I see the sun\r\nYes, now I see it\"\r\nHe finally found redemption through her, because she accepts him for who he is and now he's is FORGIVEN. \n\r\n\"I take this key\r\nAnd I bury it in you\r\nBecause you're unforgiven too\"\r\nFiguratively speaking the \"key\" to the door he's giving her symbolises he's allowing her permanent access to his memories and she can ask him about his problems. Also he's giving her to key to access her own painful memories of the past as well maybe.\n\r\nI wonder if metallica intended to do a pun considering the title of the song \"The Unforgiven II\" . .The second unforgiven person would be the girl who loves him. and In the chorus as well \"'cause you're unforgiven too (II)\" . . coincidence or what . .creative nonetheless. I love this song.\n\r\nWell thatâ\u0080\u0099s my take on it. Believe it or deny it whatever you want with it. lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIt has more emotion in it than the first one if you ask me\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nExcellent does not begin to describe this song its so good it just draws you in.\n\r\n\"I take this key\r\nAnd I bury it in you\r\nBecause you're unforgiven too\"\n\r\nThe symbolism is too much it carries so much emotion\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nFrom my perspective, this song is about forgiveness.  \nThe lyrics come from a man who has a broken heart.\nHe has been through a stormy past and he blames himself for\nhis failed relationships.  He has not forgiven himself for his \nperceived failures and is looking for an escape.  \"Turn the page, turn the \nstone\" refers to keeping an open mind and not completely\nshutting out a chance for being in a healthy relationship.  \n\"If you can understand the me, than I can understand the you\" means this person is looking for someone who can understand him\nbecause he cannot understand himself. This is also reinforced by saying\n\"Lay beside me, tell me what I've done\" because he doesnt understand\nwhy he keeps failing and is unaware of the consequences of his actions.  By saying \"I take this key\nAnd I bury it in you\nBecause you're unforgiven too\" means that he is searching\nfor someone who has shared his painful experience so they can\nboth heal each other's hearts.  He must feel that he cant trust another person unless they understand what he's been through.   \"Never free\nNever me\n'cause you're unforgiven too\" means that the man can only see himself through the eyes\nof another person and therefore can not find forgiveness through that person.  He cannot see himself for what he really is.  He is never free because he \nsolely reliant on other people to find his identity. However, the one he seeks is most likely broken and sees themself through others as well.  In a way, the man and his lover act as reflections of each other.  Because they both look for themselves in the other person who can understand them, they will only see their own tormented self through the other person. This perpetuates the man's long string of unsuccessful relationships. He must learn to forgive himself instead of looking for forgiveness in others, otherwise he will never be completely forgiven.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nShe doesn't mean a girl ...\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI agree with the poster who feels it's about an introverted guy who meets a girl, but with a different spin:\n\nIt's the character from the first song, who feels like everyone in life has betrayed him (everyone's \"unforgiven\"). He starts a relationship with a woman and he wonders if she may finally be different from everyone else he feels has labeled and betrayed him. The song is largely about him contemplating whether to totally open himself up to her (\"behind the door should I open it for you?\"), or will she just betray him like everyone else (\"or are you unforgiven too?\").\n\nIn the end, for whatever reason, he decides she's the same as everyone else (\"because you're unforgiven too.\"). He kills her (\"she loves me not, she loves me still, but she'll never love again\") and resumes his life feeling betrayed by everyone.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthe only reason i compare this to \"Unforgiven\" is every time i say i like this song, *someone* says \"the first one was better\".\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nno guy kills his wife in Gundam-W , peple compare this song with Unforgive bacause it is called Unforgiven 2, like how some movie are compared to their sequels (even though they may be completely different stories), Unforgiven is much more dark and depressing which is why I like it better than Unforgiven II...but UII is still a damn good song...\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nFor me the song is about a man who loves 2 women. I think that way, because of \"the door\" mentionen so many times in the song. I will start with the first time we hear about that door:\r\n\"The door is locked now, but it's open if you're true\" - the door to his heart is locked, it means he is in a relationship with one of the women, but he wouldn't hesitate to unlock that door and let the second woman in ( and get rid of the first one ) if she is truthful.\r\n\"The door cracks open, but there's no sun shining through\" - he has let the second woman in his heart, he has chosen her over the first one, but she doesn't turn out to be what he wanted, thus the lyric \"no sun shining through\".\r\n\"Behind the door, should I open it for you?\" - those lyrics actually come after \"the door\" has been opened. The second woman is behind the door, which means she is so close to his heart, just a couple of steps away from entering it. But now the man hesitates - \"should I open it for you?\". He has grown unsure of his thoughts and choices. But as we saw in the second sighting of \"the door\" he indeed has opened it.\r\n\"The door is closed, so are your eyes\r\nBut now I see the sun, now I see the sun\r\nYes now I see it!\" - let's first focus on the eyes. They are closed, just like the door. Now, when are a person's eyes closed ? When he sleeps ? Nope, the door wouldn't be closed then. Death. The second woman has died. Her eyes shut, just like the door. And now, with the second woman gone, the man finally sees the sun, he so long lusted for. The first woman. The one he left. He has realised that she is more truthful than the second one, she is the one he wants, she is his sun.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThe meaning to this song for me is biblical.\n\nIt is the story of Lot and his Wife while they were fleeing the destruction of Sodom and she turned to look back and became a pillar of salt.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nLay beside me, tell me what theyâ\u0080\u0099ve done\nSpeak the words I want to hear, to make my demons run\nThe door is locked now but itâ\u0080\u0099s opened if youâ\u0080\u0099re true\nIf you can understand the me, then I can understand the you\n=============================================\n\nThe child from Unforgiven I has met a woman with the same experiences\nas him. He wants her to share her feelings with him, and this will, perhaps, make his depression and anger go away.\n\nLay beside me, under wicked skies\nThrough black of day, dark of night, we share this paralyze\nThe door cracks open but thereâ\u0080\u0099s no sun shining through\nBlack heart scarring darker still, but thereâ\u0080\u0099s no sun shining through\nNo, thereâ\u0080\u0099s no sun shining through..\nNo, thereâ\u0080\u0099s no sun shining\n=================================================\nThe man is telling her to lay beside him, as if they are both paralyzed and tell him her feelings. They're together in a room, and a door leading to the outside opens itself, but light does not shine upon them.\n\nWhat Iâ\u0080\u0099ve felt, what Iâ\u0080\u0099ve known\nTurn the pages, turn the stone\nBehind the door, should I open it for you?\n==============================\nWhatever the boy once felt, the woman makes him happy.\nHis pain and sadness is going away, but he still wonders if he\nshould let her into his heart.\n\nWhat Iâ\u0080\u0099ve felt, what Iâ\u0080\u0099ve known\nSick and tired, I stand alone\nCould you be there, â\u0080\u0098cause Iâ\u0080\u0099m the one who waits for you\nOr are you unforgiven, too?\n====================\nWhatever the boy once felt, he has known, but what he feels now,\nhe does not. He needs time to make the decision on whether or not\nto let her into his heart, and asks her to wait, as he waits for her, but if she does not, he will\nknow that she is one of society's exploiters, The Unforgiven.\n\nCome beside me, this wonâ\u0080\u0099t hurt, I swear\nShe loves me not, she loves me still, but sheâ\u0080\u0099ll never love again\nShe lay beside me but sheâ\u0080\u0099ll be there when Iâ\u0080\u0099m gone\nBlack heart scarring darker still, yes, sheâ\u0080\u0099ll be there when Iâ\u0080\u0099m gone\nYes, sheâ\u0080\u0099ll be there when Iâ\u0080\u0099m gone\nDead sure sheâ\u0080\u0099ll be there\n===================\nThe man once again asks her to lay beside him, and swears that\nit will not have a bad impact on her. He says that she loves him, but if\nshe chooses to betray him and side with the Unforgiven, she will never\nlove anyone again, as much as she loved him. His heart is black and scarred from all\nthe pain and sadness he has gone through, but she makes it even worse, by lying to him, and telling him that she'll wait for him forever.\n\nWhat Iâ\u0080\u0099ve felt, what Iâ\u0080\u0099ve known\nTurn the pages, turn the stone\nBehind the door, should I open it for you?\n\nWhat Iâ\u0080\u0099ve felt, what Iâ\u0080\u0099ve known\nSick and tired, I stand alone\nCould you be there, â\u0080\u0098cause Iâ\u0080\u0099m the one who waits for you\nOr are you unforgiven, too?\n====================\nRepeats of past lines.\n\nLay beside me, tell me what Iâ\u0080\u0099ve done\nThe door is closed, so are your eyes\nBut now I see the sun, now I see the sun\nYes, now I see it\n=============\nHe is asking her to lay beside him again, and tell him what he has done wrong to grant him this betrayal. She closes her eyes as she wants to die and not experience this moment, she wants to still be with the man, as she still loves him. The door to the outside opens, and the man sees that the light shines upon him.\n\nI take this key\nAnd I bury it in you\nBecause youâ\u0080\u0099re unforgiven, too\n=======================\nHe contemplates killing his lover, but decides not to. In his mind, he stabs her with a key to his heart, because his \"lover\" is the Unforgiven.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nchrist i love this song. i think this is probably the best Metallica song, apart from maybe Until It Sleeps. it makes me cry though, too many memories attatched :'o(\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ni am the only person i know who likes this better than the first unforgiven, but i do, dammit!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ntipically, girls tend to like this one more than the original Unforgiven\r\nI don't know why, though. Any ideas?\r\nPersonally, I like the other one. This one is great, but lacks some of the strength in Unforgiven, IMHO.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI don't know why you feel you should compare it with the first unforgiven, it's a copletely new song. it does'nt realy have anything to do with The Unforgiven, except for the title and a few lines in the song.\r\nanyway, this is definitely the best Metallica song ever, and THE BEST song i've ever heard! it's huge!!\r\nJames Hetfield also said once it's one of his alltime favorites.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nsupposedly, however, it's about a man killing his wife.\n\r\nand al, it's in the same key (well, half step down, but that's because the album is tuned that way)\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nJiqokusabre, you're damn right!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nJigokusabre is right. Except that in the end of Unforgiven that child becomes old. This is about the rest of the life of the person in Unforgiven and how he/she finds someone else who knows how he/she feels.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nwatch the videos's back to back, it explains it prefectly, they were filmed by the dame director, the second was set to finish of the first in the same manner as the songs\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\ni dunno what its about cause im not that smart at things like that but it is the best metallica song ever i think and metallica has some of the greatest metal songs ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThe kid in the video for \"The Unforgiven II\" was also the same kid as the one in \"The Unforgiven\" 6 or so years later.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nYou cannot compare the first and second ones to each other because both are talking about different things and they're both from different time periods\n\n\n", "comment_24": "\nYou cannot compare the first and second ones to each other because both are talking about different things and they're both from different time periods\n\n\n", "comment_25": "\nThis one's already been cracked by Jigokusabre\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ni don't know... i personally agree with DrivenInHiFi... i can certainly see how this would fit to that idea. at least in gundam wing, in a fanfic, it made perfect sense\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nJiqokusabre is sooo right. And I don't like the way people compare it to Unforgiven. They are both great songs. Unforgiven, Unforgiven II, Until it Sleeps, Fade to Black, Nothing Else Matters are my fav songs and they can even bring me to tears sometimes.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nthey dont relate at all....its about someone who is alone in the world...who is \"Unforgiven\" and he/she is searching for someone else as a friend or companion to relate too. But the problem is they are \"unforgive too\"\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nOK DUDES, this song is about the original person in the original Unforgiven that after being beaten and torn finds someone to relate to!\n\r\n\"Lay beside me, tell me what they've done\"\n\r\nHe's asking her to tell him what they did to her to compare it to what they've done to him.\n\r\n\"If you can understand the me, then i can understand the you\"\n\r\nHe's saying that if she can understand what happened to him then he can understand what happened to her because they went through the same things\n\r\n\"In the black of day and dark of night we share this paralyzed\"\n\r\nHe's saying that they can talk all day and all night about what happened to them\n\r\nAnd the rest of the song if you can see it how i do is self-explainitory... this was an awesome song! I especially liked the part at the end where they put the original song in it\n\n\n\n", "comment_30": "\nOK DUDES, this song is about the original person in the original Unforgiven that after being beaten and torn finds someone to relate to!\n\r\n\"Lay beside me, tell me what they've done\"\n\r\nHe's asking her to tell him what they did to her to compare it to what they've done to him.\n\r\n\"If you can understand the me, then i can understand the you\"\n\r\nHe's saying that if she can understand what happened to him then he can understand what happened to her because they went through the same things\n\r\n\"In the black of day and dark of night we share this paralyzed\"\n\r\nHe's saying that they can talk all day and all night about what happened to them\n\r\nAnd the rest of the song if you can see it how i do is self-explainitory... this was an awesome song! I especially liked the part at the end where they put the original song in it\n\n\n\n", "comment_31": "\ni agree with Load_myself and Jigokusabre\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nNOT EVEN CLOSE TO THE EMOTION OF THE FIRST ONE\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nDUDE!! GO LOAD YERSELF!!!..DO U NOT READ THE WHOLE THING??\r\n\"Could you be there, 'cause I'm the one who waits for you\" HE IS WAITING FOR HIM?? HOW THE HELL CAN THEY BE TOGETHER RELATING TO EACHOTHER IF HE IS WAITING!?!? DONT TRY AND SHOW PPL UP UNLESS U KNOW WUT YER TALKING ABOUT WISE ASS!\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nIn short, I think Unforgiven II is really about a guy who is down..and who wants a girlfriend to pick him back up again. He finds this girl..but she isnt all that he wanted..for example..she cheats and really makes the man upset. He wants to work things out..but she isnt his type..its almost everytime he talks to her about it..hes kinda expecting the same result(Lay beside me..tell me what theyve done..to make my demons run) Although he wanted a girlfriend so bad to help him..she really wasnt the person..and shes his downfall(Could you be there..because im the one who waits for you). After time..he cant take it anymore..so he kills her in his hurt and rage(Lay beside me..this wont hurt I swear..She loves me not..she loves me still..but she'll never love again..she'll be there when im gone..dead sure she'll be there) He did everything to please her..but she kept spitting back in his face..and eventually she paid the price with her life. And hes not sure if what he did was right..he kinda regrets what he did..but in the end..he believes it was the right thing to do(Lay beside me..tell me what ive done..the door is closed so are your eyes..but now i see the sun) the sun is kind of a represenation of the happiness that he needed..which was to get rid of her. the whole key thing was what she deserved...a key to his happiness..and that opened the door so he could see the sun,(i take this key.and i bury it in you) this is what i think the whole song is about..i think its pretty accurate. Metallica forever..the best metal band that ever lived! \t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nwhat the fuk...\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nLook, Man...The guy is dead and up at the Perly Gates and he's explaining what happened in his life and all that stuff.  The door opens if he is true, and he's free to go in heaven, but the door cracks open and there's no sun shinning through.  The sun indicates the light from heaven.  Therefore, since he sees no light, he is not going to heaven and he is unforgiven.  The whole thing is a conversation with him and St. Peter at the Perly Gates.  AND THE REST OF YOU ARE WRONG!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nLook, Man...The guy is dead and up at the Perly Gates and he's explaining what happened in his life and all that stuff.  The door opens if he is true, and he's free to go in heaven, but the door cracks open and there's no sun shinning through.  The sun indicates the light from heaven.  Therefore, since he sees no light, he is not going to heaven and he is unforgiven.  The whole thing is a conversation with him and St. Peter at the Perly Gates.  AND THE REST OF YOU ARE WRONG!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nOk, I read Hetfield's comments about the song in Maximum Guitar or something a few years back...he said that the song is sort of a love song or something, but it ends in murder.  The song itself came from tooling around with a Fender B-bender Telecaster.  He was playing around with it, came up with a cool riff, then realized it was the same chord progression as Unforgiven (which, in turn, is the same chord progression as Fade to Black I noticed).  He kept the riff, wrote a song around it, and called it Unforgiven II 'cause it was inspired by the first one\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nFor the record Unforgiven 1 is better but 2 also rocks. Both songs have the most complicated lyrics ever. Have't understood yet the meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\ni think this song is a very great song i love it\n\n\n", "comment_41": "\nthis is the BEST Metallica song EVER MADE!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nFirst off. personally i think Load Myself is most on w. his interpretation.....and i like beans...thats not in short at all.........\n\n\n", "comment_43": "\nI love this song! James has an amazing voice. And it is surprizing how well he can sing considering how low his voice is. Most men who are baritones have difficulty with thier pitch, but James? \n\r\nWHOA! \n\r\nHe's got the kind of voice that makes a woman wonder what it would sound like moaning out her name....... he he......\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThe song is about the boy who was in the first Unforgiven is tired of being lonely and wants to open his heart to a new love, only to find that this love was never true. One of my favorites!\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nBoth are good songs, and when played back to back they make a great progressive rock piece. I agree with this being a sequel, and on that theme it reminds me of 1984 by George Orwell, in so far as Winston and Julia meet eachother in the wartorn conformist society and try to break away from it together with their love. So those 2 characters remind me of the 2 characters in this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nmeh... i like both versions and i'm a chick..\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nBoth songs definitely represent different scenarios and are not exactly the same. Although with careful deliberation I am sure that many connections can be made, Unforgiven II tells me of a story of lost bitter love turned to hate and eventually, death. It contains some elements of repentance and deep contemplation, but hey, that is merely my interpretation. People need to stop criticising each other so fiercely about the meanings. It is so childish! Although there is a basic meaning to this song, it is definite that we did not write this song. Hetfield did, and while we ponder about all the subtle meanings and try to decipher his \"code\", I think it is important for us all, me included, to just shaddup and enjoy the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nBoth songs definitely represent different scenarios and are not exactly the same. Although with careful deliberation I am sure that many connections can be made, Unforgiven II tells me of a story of lost bitter love turned to hate and eventually, death. It contains some elements of repentance and deep contemplation, but hey, that is merely my interpretation. People need to stop criticising each other so fiercely about the meanings. It is so childish! Although there is a basic meaning to this song, it is definite that we did not write this song. Hetfield did, and while we ponder about all the subtle meanings and try to decipher his \"code\", I think it is important for us all, me included, to just shaddup and enjoy the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nactually i think that if you listen to the way the song is played you will notice many similairities, such as the beat in the chorus, really the only real differences between the two songs are the lyrics, and the way the chorus and the verses are sung.  if you listen to the chorus in the first song, is nice and soft, but the chorus in the second song is nice and heavy.  same with the verses, the first song the verses are nice and heavy, and in the second song they are nice and soft.\n\r\ni am sorry if this is not following the whole conversation, i didnt feel like reading the whole thing, its f*ckin long and i just didnt have the time to read it all.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThis song's pretty good, one of the only emotional songs on Reload. It's pretty much about the kid in the first unforgiven, and the rest of his life, and how miserable he is. I still think the first unforgiven is better.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI like this song a lot better than the first unforgiven. im not sure what it means tho.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nTheF16Falcon's explanation is good along with I Like Beans, but i first interpreted it as this guy who is rejected by his family having a child with a girl, and along with the rejection of their families, the girl won't talk to him either, and he doesn't know if she is unforgiven by her too.  The light behind the door represents hope.  The pages turning to stone is there life stopping with this tragedy(a baby). \"She loves me not, she loves me still, but she'll never love again\" He doesn't know if she still loves him, but she knows that they will have to be together for the rest of their lives becuase they now have a child, and even when he he dies she will live in the same house,\"she'll be there when I'm gone\" The door represents their relationship,\"Behind the door, should I open it for you\"  He really wants them to be together and start a conversation, and he tries to start it off with should i open it (the conversation) for you.{Then again he could just be mad at his life and kills his wife becuase she is unforgiving just as life is \"The door is closed, so are your eyes \r\nBut now I see the sun, now I see the sun \r\nYes, now I see it\", the sun represents freedom}\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nASFalcon13 nailed it as James Hetfield has said himself that it deals with love and murder.  The murder lines are pretty subtle but they're clearly there.  \n\r\nAs far as whether the character referred to in the first person dies as well, not sure about that.  Seems like the murder sets the character free in some way.  \n\r\nRanks right up there with \"Sanitarium\" for the dark subject matter and Really Angry Lyrics(tm) but not quite as fast paced and more open to interpretation than that one.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nyeah, falcon hit the nail on the head.  im positive that the song is not about a man who falls in love with a lady and kills her (as one or more people declared) simply because of the tone of the song.  it is not nearly dark and gloomy enough for that, and yes, this is a legitimate way to judge a song even though it sounds childish.  if james hetfield wrote a song about such an act, the lyrics would run parallel with a depressing guitar melody.   if you want an interpretation of the song, just read what falcon wrote, i dont feel like restating the whole thing, however i will add that murder is not an issue in the song, just simply a person dying.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nThis song is about a prostitute that he can't make himself have sex with. (Lay beside me, tell me what they've done ) He tells the prostitute to speak dirty to him, to get him hard. (Speak the words I wanna hear, to make my demons run ) He just can't make himself have sex with a prostitute . (The door is locked now, but it's open if you're true ) He knows what he is doing is wrong but he really wants to do this because he is sick of being alone and not having sex. (What I've felt, what I've known Sick and tired, I stand alone ) The end of the song he makes himself do it. (I take this key \r\nAnd I bury it in you). I think its true, because listen to how climatic the song is. Listen to how James sings each lyric, and then at the end he emphasizes it. just my theory anyways....\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis song has alot of meanings to me seeing as how I've listened to it, analyzed it and pondered over it countless times as I do with every Metallica song seeing as I'm a Metallicaholic. First of all you have to listen to the \"Unforgiven\" before listening to this song. In the \"Unforgiven\" there is a lyric that goes; \"this whipping boy done wrong\". . .a whipping boy is someone who is used to take the blame of someone and is often actually \"whipped\". Princes used to make these out of servants of theirs, they would blame something that they did on their servant and he would be whipped. Or it also means a slave, a scapegoat, someone that is punished for the misdeeds of others. So the boy that the \"Unforgiven\" is about is obviously some sort of slave or servant. He is abused all of his life and knows nothing of compassion. So therefore in the end he makes a list of all the people that he hates, all of the people that made his life a living Hell and he dubs them all \"Unforgiven\", hence the lyric \"So I dub thee Unforgiven.\" He is a bitter man due to all that he has endured. Now on to the \"Unforgiven II\". In this song it still focuses on the man but it has another character in it. It focuses on the same \"whipping boy\" but it also has a woman involved. This man is asked for help by the young woman, and he asks her \"tell me what they've done\", but then he realizes that she is one of the people he swore to never forgive, \"or are you unforgiven too?\" He rubs it in her face that he hates her and that she never helped him. He goes on and tells her why he is the way he is \"What I've felt what I've known. . .So sick and tired I stand alone!\" but he gives her a small amount of help. But it comes to be that she is in love with him \"She loves me not, she loves me still, but she'll never love again. . .She'll be there when I'm gone.\" he knows that she loves him and he also uses this against her. He is pretty sure that no matter what he tells her she will put up with it due to her love, and she does. He won't let her into him, he hates her and he is just tolerating her presence, \"The door is locked now. . .Should I open it for you?\" He leads her on and then he still comes back to \"Or are you Unforgiven too?\" He eventually ends up hurting her, very badly, this can be interpereted as emotionally, mentally or physically. You can tell he has hurt her 'cause he asks 'Tell me what I've done.' I can imagine her being bed-ridden or forced into a coma due to shock, \"the door is closed so are your eyes.\" He probably influenced her to commit suicide because he wasn't returning any love to her. You can also tell her that he has fallen in love with her fafter he hurt her because he starts to care for her with the lyrics \"But now I see the Sun. . .I take this key and bury it in you.\" He tries to impart himself in her because he loves her now. But when she \"awakens\" or realizes how cruel he was she dubs him \"Unforgiven\". She no longer has any love for him and she comes to adapt his philosophy of pessimism and then she starts to hate him. You can deduce this from the lyrics \"Never free, Never me! (\"Cause you're Unforgiven too!)\" The man cries out that he is never free and never happy, in a sense, but then the girl says \"cause you're unforgiven too\". Now that he has finnally decided not to be an asshole anymore she's not having anymore of it. When you listen to the song and hear the last lyrics imagine the boy shouting \"Never free, Never me!\" and the girl yelling \"Cause you're unforgiven too!\" and just leaving him by himself. Now he is the \"Unforgiven\", that's why it's called the \"Unfogiven II\" because now he is the second unforgiven, he is unforgiven too or as well. So basically the song is about people who are mean and hatefull and who are obviously loved, but end up pushing the people who love them away from with their hate. Sorry to give you such a deep analysis hope you enjoyed reading this, that's the best definition I can give for this magnificent song.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\ni like beans, you are the least intelligent person on this site (i'm tryin to be polite) you are ignorant and rude and you don't think before you type. go die. load myself is right. just read the lyrics after reading the first unforgiven, and it is so obvious. you really over-react, i like beans. and like i said, go die.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nwow\r\nthere are a lot of interesting interpretations that i have read here, and some i never even thought of...\n\r\ni think beans has the right idea when he says UII is about a guy \"who wants a girlfriend to pick him back up again.\"\n\r\nthe rest we disagree on.  I dont think he killed her.  Someone also said the light = heaven or something... i dont think so.  I think door = his heart, and light = love/truth/good, like basic symbolism, the light reflects those things.\n\r\nthe chorus says \"What I've felt, what I've known\r\nTurn the pages, turn the stone\r\nBehind the door, should I open it for you\"\n\r\n1st line is just a reflection of UI as in his hate for those who try to control him, turn the pages/stone he is wondering if he should change his life, should he open his heart to ppl, etc.  And he's asking if he should open the door (his heart) for some1.\n\r\nthen i disagree with beans about the killing and him treating her bad.  I think its the other way, she cheated on him.  \"She loves me not, she loves me still, but she'll never love again\r\nShe lay beside me, but she'll be there when I'm gone \"  She loves him in she says she does but then she doesnt because she cheats on him.  Thats why you have the line of her being there.  Sure she'll be there (physically) but there is no love.  Hence \"dead sure she'll be there\" in that she is not there mentally, there is no love for him.  He didnt kill her or treat her bad.\n\r\nBut he's now unsure if he should give her another chance or not?  Thats why her eyes are closed, b/c she cant look him in the eyes since she cheated.  Then when he says \"now i see the sun\" etc, he's seeing the light, but my conclusion is that he realises that she doesnt love him.\n\r\nThats why in the conclusion he buries the key in her and dubs HER unforgiven too, b/c he's saying she's one of those ppl who ends up hurting him.\n\r\nSee, in UI he dubs the \"society\" Unforgiven b/c they hurt him, and here he is dubbing HER as one of them b/c she hurt him as well.  If he hurt her, he wouldnt dub her Unforgiven.  He isnt the Unforgiven (thats a mistake!! SOCIETY IS THE UNFORGIVEN)\n\r\nAlso, if you watch the video of the song, in the end, the boy leaves the girl, eventhough she has the key to his heart, and he cant see her eyes since her back is to him b/c she cant face him for cheating on him.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nthis song is so deep it would make my brain explode to try and make sense of it.. it lulls me into a state of depression.. but i like it\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nFUCKKK this song is way too deep for my little brain....lol   but its fucking awsum!!\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\ni almost burst into tears each time i sing it, thats what i like about it, its great to sing to, and a nice little air guitar in the solo helps too, lol\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nthis is better than the first Unforgiven. better singing and better guitar work. the chorus is so amazing and I still can't get that crunchy sound on my guitar. the solo is simple but uncanny. the video is a little lame. this is probably my favorite Metallica solo to sing to. the song itself is self explanitory.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\n*song to sing to, not solo. if anyone cares\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI can relate to this song so much.  It's my favorite Metallica song.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nhey i dnt usualy like think of wot songs originaly ment i think bout what they meen to me.  to me i see this song as bein about trust and needing to find the right person for ur trust. and finaly wen u find that person they r just the same as u. anyway emotional song. love it\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nthis song is amazing....It makes me so fucking sad, but I cant stop myself from listenting it over and over agine....... I agree with Fizle. Idont know and I dont wanna know what THEY ment, I take it very personally.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nMETALLICA RULES!!! I LOVE THIS SONG!! It's so beautiful. I take it personal too. It reminds me of the past in witch i hate!\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI agree with Vicious_machine.. you're absolutely right in my opinion. Brings back memories from the time when my ex-boyfriend broke up with me (after I'd cheated on him)..\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nyea the music video isnt too bad either.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nok.. dont bag me about what im gonna say.. its prolly already been said.. but im gonna say it anyways.. Unforgiven II is a fkn wicked song.. trying to decypher the meaning of it.. without reading any of the above.. would be extremely hard.. and in some aspects of the song.. i argee with different ppl.. neways.. ther are probly infinate different meanings to this song.. you can like which one you want.. whatever one gives you the most.. whatever you want.. believe what you want.. dont listen to what someone else says if you know differently. PEACE IM OUTA HERE!\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nThis is my absolute favorite Metallica song. ROCK ON, JAMES H!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI think that the title says the meaning of the song.\r\nYou guys have a lot of imagination!!!\r\nThe title says it all!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\ni love this song, one of my favs by metallica. i am unhappily single and i am kind of depressed, so this song comforts me. i think its about a lost soul wanting to open his heart to someone and not be lonely anymore. much better than the first unforgiven.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nYeah its a song...\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nlook! DUDES! Chill for crying out loud! Don't you guys just get it... it is simple... James is talking/singing about hidden sins... was that so hard to figgure? And if you are pretty much in to music \"like me\":P, than you can actually hear crying sinned souls through the guitar... it is a damn good song...  Just Rock On!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\njaxgrrl i completley agree wit wat u said, this song is far better than the orginal i love this song i dnt no why it doesnt get the praise it deserves,its defs up there wit fade to black, some ppl need 2 open their minds more\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\ni like this more than the original..... even though the only simalarities are the begging, and the fact they say that your unforgiven. the song is about not forgiving people when they do wrong to you. straight from james's mouth\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nthis is prolly one of the best songs ever made by metallica besides one\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nFreeSpeech4ThaDum has the closest interpretation to mine, I'm surprised others don't agree with him/her. \n\r\nI believe it's about the same broken man from Unforgiven, but he's found a companion. It never reveals a certain gender, but I'm assuming it's a woman. He tries to get to know her, and when her heart finally opens, (\"black hearts scarring darkness still\") he realizes that she's no better than the others. He begins to show her a false personality (\"behind the door, should I open it for you?\"). He's trying to find someone who will treat him differently, someone to care for and that cares for him (\"could you be there, 'cause I'm the one that waits for you\") but he doesn't believe this woman is the one (\"or are you unforgiven too?\"). Then she's stricken with an illness or death. Personally, I believe death. \n\r\nI can see where people believe that he killed her because of the line \"Lay beside me, this won't hurt, I swear.\" I had to think a while to find it's relation to the song but I've found it. That's the turning point. With that line, he readies her for the opening of his \"door\". She is, of course, deceased, but he wants to open his heart to the only one who'd ever listen, the only one who'd ever cared. \"She'll be there when I'm gone\" states how he will never forget her. He finally opens his heart to her with the same lyric that he once mocked her with \"behind the door, should I open it for you?\" I think that line is a metaphor for him crying for her, as well as the obvious opening of the heart. \n\r\nBut he's alone once again (\"Sick and tired, I stand alone\"). Then he misses her and can't forgive himself for pushing her away with accusations (\"Could you be there, 'cause I'm the one that waits for you/Or are you unforgiven too?\") He can't believe what he's done. He hated the only person who's ever loved him, and he can't make amends (\"Lay beside me, tell me what I've done/ the door is closed so are your eyes/ but now I see the sun\"). He tumbles into a distrought chaos of regret, asking himself why it had to happen that way, and never recovers.\n\r\nThe key to his heart lied solely with that woman and he refused access to her. He will forever be burdened with regret, because he can never forgive himself (\"Never free, never me, 'cause you're unforgiven too\"). He is unforgiven, too. \n\r\nI enjoy this song. It does what many have failed to do: make music more than just instruments and vocals. I think James put his own demons in this song. This song could be a symbol for a \"loved and lost\" relationship of his. This song is too sad to be just a story that he made up. James must've been hurting pretty bad =/\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nyes it does i am assuming where it said \"she loves me not she loves me still\"  that they're talking about a girl.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\npersonally i just love the song. its very powerfully written, especially the \"but she'll be there when im gone...dead sure she'll be there\" mwa haaa tis very cool. metallica rule\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nok i can see some people comparen this some to unforgivin, but y the fuck gundam wing\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nYou know Angelcex, I totally agree with you. I just figured out something about this song today. \r\nI think the Title shouldn't be read as \"the unforgiven 2\" but \"the unforgiven too\" I think it's because it's actually centered about another person, but you \"see\" it from the eyes of the unforgiven. He talking about the unforgiven too. I think.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\ni would like to comment on Nacho and Jigokusabre at the same time; i think that Jigokusabre's explanation says why girls like the second and guys the first.  \n\r\nGirls have the romanticized ideal that there is Mr. Right out there somewhere; and to them, the idea of the two 'unforgiven' people finding each other is romantic.  \n\r\nGuys, on the other hand, like to think that they're tough, and they don't need anyone.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nHow can anyone like this song? Metallica is just using the name of a previous song to raise their own popularity and sell out even more than they already have. How could they change from a metal band to this pseudo country and western shit. What respectable metal band writes about things like this? The lyrics are just words anyway, they arent even good. Metallica are a disgrace to metal and music althogether.How could they sue their own fans? its people like all of you who fuel their greed and listen to all their shitty stuff, which makes them more money orientated. This causes them to focus less on actually releasing good music.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nLooking at the first Unforgiven, the character turns against the world that treated him so badly and dubbed everyone 'unforgiven'. In this song, the character is happy to have found his soulmate and companion, but he has suspicions. She is not as perfect as he thought she was, and he's hoping that she is not like the others, but he's questioning 'or are you unforgiven too?'. In the end, he kills her, and it is a release for him in a way, 'I see the sun yes, now I see it'. However, the hope for him to love again has been lost 'I take this key and I bury it in you, because you're unforgiven too'. He will not love ever again as she broke his heart so badly and he will think everyone else is unforgiven.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\ni love this song one of my favs such a good song who cares what it means its just sang so great\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nDEC0 you're so wrong. First of all, there's a good reason for the title as you would have read. Secondly, metallica DID NOT sue any fans, but demanded them banned. \n\r\nMetallicas lyrics are some of the deepest that exist because they are bound with sincere feelings and experiences. Your whole post is bs. You probably can't interpret metallica lyrics and need the superficial down-right unsincere pop lyrics. Go home.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nAngelcex I totaly agree with you! Though I never even tried to understand the song like you did. But If you realy put some tought in it is just what you said! \n\r\nNow after reading this I like both songs even more!\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI may be crazy but i think this one's about Jame's mom. I think since she died when he was young she haunts his dreams and that's when he speaks with her. I think the origional unforgiven was his father for never accepting him for who he was. I think he looks for forgivness and acceptance from his mother in his dreams, The whole song references to a woman who has passed away. The door is closed so are your eyes, She'll be there when I;m gone, dead sure she'll be there. But when he wakes up every day he realizes that she cannot save him and that by being gone, she has abandoned him and he just has to much hate so he puts her in the same catagory as his unforgiven father. You can tell that he loves her but he just has to much hate. Just like that song. Mama let my heart go, or let this heart beat still. He never wants to love anyone because it hurts to much and it all started with his parents.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nUnforgiven: A child becomes a lost soul after being beaten down by the conformist society\n\r\nUnforgiven II: That lost soul is found by another. \n\n\r\ni love that,\r\nJigokusabre  i totally agree. \n\n\n\n\n\r\nthis song means so much to me, me and my boyfriend consider this our song it has just always made us think of eachother. \r\nhis lost soul found mine. \n\r\nand i really couldn't have put it in better words. than Jigokusabre  did, whoever you are.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nDEC0 \r\noh and you,\r\ni dont agree with you.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\ni actually think this song is beautiful, im usually in the mood for the the metallica that i know and love but all of there slower songs are kick ass too\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nLoad_myself and Jigokusabre got it. And King Nothing is right, its the same damn kid. crazy, huh? anyways, killer song and while not comparable to the first one it still happens to be part 2. it is just a continuation in a different manner, but if it was taken up a half step the two songs could go together. kick-ass.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nman this song relates to lot of us and how we have our relationships, some turned out bad and others were good but thats how life works...\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nJigokusabre i totally agree with you 100%- This song is about a stalker!\n\r\nUnforgiven: A child becomes a lost soul after being stalked and beaten down by the conformist society\n\r\nUnforgiven II: That lost soul stalkes another. \n\r\nin other words: The stalked is now the stalker 2\n\n\r\nI couldn't have put it better: jigokusabre and some others are right on the money, a paridigm shift and a stalker are all that remains.\n\r\nI'm pretty sure this song is about a stalker...\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nThe answer to why people would relate this song to some Gundam fanfic is simple: when you become addicted to shitty Japanese cartoons, it's only a matter of time before you'll start reading fanfics of said shitty Japanese cartoon that are 10 times shittier than the cartoon itself, and once you hit that state, you have to relate everything in the ENTIRE FUCKING UNIVERSE to some goddamn fanfic somebody wrote.\n\r\nAll that aside: personally, I like this better than the first one, mainly because of the brilliant guitar riff.   My first impression of the song was of a man who murdered a wife whom he tried to, but could not, love.  I got the impression that the paralysis they shared was that neither was capable of actually feeling love.  They left the door open for each other, but neither could enter.   He killed her hoping that he could at least feel something new, because he was sick of trying for so long to feel some way about someone that he wasn't capable of feeling.  \n\r\nMaybe my interpretation of the song isn't the same as what James's was when he wrote it.  Maybe he literally murdered her, maybe he only metaphorically killed her, but the lyrics strongly suggest to me that, either way, this song depicts a man (possibly \"dead\" himself) lying next to a dead woman...\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nI love this song it makes me cry cuz me and my ex used to listen to this song b4 he died so it means alot to me\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nWhy women love this song? For me, what I really love about this song, from the lyrics, it also sounds as if the song about a woman (or anyone) who, through past experiences, is apprehensive about love and puts up a wall in defense. The challenge is to penetrate through this wall. \n\r\nAmazing and powerful lyrics! The mood, music, and Jame's voice all blend in to create this incredibly moving song.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\n\"The door is locked now, but it's open if you're true\r\nIf you can understand the me, than I can understand the you\r\nLay beside me, under wicked sky\r\nThe black of day, dark of night, we share this paralyze\"\n\r\nSometimes we lose trust in the opposite sex; fear of being burned by another causes us to create walls or put up that \"door\". The \"paralyze\" is the inability to move forward.\n\r\n\"Lay beside me, tell me what I've done\r\nThe door is closed, so are your eyes\r\nBut now I see the sun, now I see the sun\r\nYes, now I see it\"\n\r\nA ray of hope shines through.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nI think The unforgivenI has a lot more emotion in it, a lot more pain. this one is emotional too (god i hate using \"emotional\" cus it reminds me too much of the new emo poserness around but whatever), but this one has love and hope mixed together with the pain. the First one is pure sorrow.\r\nbut this song still rocks.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nthe unforgiven 2 is a great song\r\nit really reminds me of my girlfreind, and the first deep conversations we had together\r\ni think the song is about finding someone who you can relate to on many levels\r\nvery deep and when i feel like ive had a horrible day this song is one i can always pop in and feel better (before putting in battery ;) )\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\ni love this song its better than then part 1 though it reminds me of alot of crap\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nreminds me of the intro on Iron Maiden - Children Of The Damned.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nThe original is better.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nOriginal unforgiven is great and muuch better than this. This song is... ok i think.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nhmmmm.... this imho is far below the strength of the original unforgiven. Everything from the cliched lyrics to Jamyz's vocal delivery and the guitar work is just nowhere near as powerful as it is in the Unforgiven.  I've never really been into this song for some reason...\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nReally good song.. tho it doesn't compare with One or Nothing else matters, but I love this song too, and It's just kickass..\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nWell I guess I can say that this song is both related and not related to the first one \r\n But I think if  this song is related to the first one then I  guess could say  its a sequel to the unforgiving 1 and he is the same man whoâ\u0080\u0099s in the unforgiving 1   but he is not living in our world anymore  I think he is dead because in the unforgiving 1 the man is prepared to die and  I guess in this song he is dead and another younger soul  joins his old soul and both souls had suffered from others when they were alive and now when they died they are trying to find comfort in each other company  and trying to adapt in the new world where the found  themselves trapped in and hopefully theyâ\u0080\u0099ll find peace and comfort  together\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nwell...to all the Mother FU*kers out there...U've Earned Urself A great Deal of Respect Listenin to Thrash MEtal...U guys R great..Well Bein a metal fan for more than a decade i think i know a thing or two abt this song..this song is based on the classic \"The Myth oF the SYSYIPHUS\" by the late n Great -ALBERT CAMUS, the song/story portrays the image of a condemd soul doomed to raise a rock on top of a mountain only to find it roll back down again...thus for eternity his fate is unforgiven...\r\ncheck u loosers out later...\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\ni like this song as much as i like the first one...\r\neven tho', i'm not a girl Â¬Â¬\r\ni friggin' love \"lay beside me, this won't hurt, i sweare\" almost made me cry the first time i heared that part!!\r\nThis Song FCKN' ROCKS!!!!\r\ni agree that is about a person who can relate to the character of Unf. I....\r\nbut he still has doubts about if he should let this person into his life...\r\nfck.. I LOVEEEEE THIS SONG!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nI think everyone who made a positive comment about this song is a stupid American dick. \n\r\nAlso, Slayer piss all over Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nI think this song tells about when you aren't going well with a girl and you dont see the light and when the girl cheats on the boy the boy is happy because he is not blind anymore and he can see the light and goes to the correct path but then the girls comes again\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nAs a lot of people have already said in previous pages, I feel that this song is about a man who murders his significant other for cheating on him. \n\r\nThis may not be what James intended the song to be about, but that's just how I interpret it. That's the beauty in lyrics. \n\r\nNow, to explain my theory:\n\r\nLay beside me, tell me what they've done\r\nSpeak the words I wanna hear, to make my demons run\n\r\n(This could either mean he wants her to lie to him so he won't have to bare the pain or he's just stating in a sarcastic manner that that is what she is doing.)\n\n\n\r\nThe door is locked now, but it's open if you're true\r\nIf you can understand the me, than I can understand the you.\n\r\n(Basically, he just wants the truth. Maybe saying \"the door is locked now, but you haven't broken faith with me, I'll let you go.)\n\r\nLay beside me, under wicked sky\r\nThe black of day, dark of night, we share this paralyze\r\nThe door cracks open, but there's no sun shining through\r\nBlack hearts scarring darkness still, but there's no sun shining through\r\nNo, there's no sun shining through\r\nNo, there's no sun shining\n\r\n(I'll be honest and say I have no fucking clue what this means or how it plays a part in my theory.)\n\r\nWhat I've felt, what I've known\r\nTurn the pages, turn the stone\r\nBehind the door, should I open it for you\n\r\nYeah\r\nWhat I've felt, what I've known\r\nSick and tired, I stand alone\r\nCould you be there, 'cause I'm the one who waits for you\r\nOr are you unforgiven too?\n\r\nLay beside me, this won't hurt, I swear\r\nShe loves me not, she loves me still, but she'll never love again\n\r\n(She'll never love again...because she's dead.)\n\r\nShe lay beside me, but she'll be there when I'm gone\r\nBlack hearts scarring darker steel, yes, she'll be there when I'm gone\r\nYes, she'll be there when I'm gone\n\r\nDead sure she'll be there\n\r\n(\"Dead\" sure she'll be there. After he killed her, she definitely won't be leaving to have her affair when he goes to work or wotnot. When he says \"DEAD sure she'll be there\" I think that's a pun or it's emphasizing what he did.)\n\r\nWhat I've felt, what I've known\r\nTurn the pages, turn the stone\r\nBehind the door, should I open it for you\n\r\nYeah\r\nWhat I've felt, what I've known\r\nSick and tired, I stand alone\n\n\r\nCould you be there, 'cause I'm the one who waits for you\r\nOr are you unforgiven too?\n\r\nLay beside me, tell me what I've done\r\nThe door is closed, so are your eyes\r\nBut now I see the sun, now I see the sun\r\nYes, now I see it\n\r\n(The door is closed, SO ARE YOUR EYES. Once again, maybe meaning she's dead and that he killed her.)\n\r\nWhat I've felt, what I've known\r\nTurn the pages, turn the stone\r\nBehind the door, should I open it for you\n\r\nYeah\r\nWhat I've felt, wha I've known\r\nSo sick and tired, I stand alone\r\nCould you be there, 'cause I'm the one who waits\r\nThe one who waits for you\n\r\nOh, what I've felt, what I've known\r\nTurn the pages, turn the stone\r\nBehind the door, should I open it for you\r\nSo I dub thee unforgiven\n\r\nOh, what I've felt\r\nOh, what I've known\n\r\nI take this key\r\nAnd I bury it in you\r\nBecause you're unforgiven too\n\r\nNever free\r\nNever me\r\n'cause you're unforgiven too\r\nOH \n\r\n(She's unforgiven because she was unfaithful. He's unforgiven because he murdered her.)\n\r\nNow, I'm not saying that's what it means and that it's set in stone. Just a simple observation.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nthis song is about drugs\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nI also like this song better than The Unforgiven part one, because this song sort of continues the story. In the Unforgiven part one, this man has had such a hard life that he doesn't care anymore. He thinks nothing will make it better. In this one, he thinks he has finally found his answer in a girl, but he isn't for sure that she is the answer. He doesn't realy want to put all of his faith in that idea, because usually things don't turn out in his favor. She has done something [possibly infidelity, or maybe something else] that he sees as wrong, or that made him see that \"she loves him not.\" But he knows she did love him, but it doesn't matter now, because \"she'll never love again.\" This could mean that he killed her, or he just broke her heart. He feels like just as he has been scorned and unforgiven, she was too. Regardless, the outcome is still that he questions his actions of letting her get close to him. This is a tragic story about how love can go horribly awry, and for the dumbass who said this song is about drugs, you are obviously a complete idiot. Anyone who has ever faced hardships in life and in love, should be able to see the song for what it really is.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nMaybe its about the way music connects people.  It could be about a couple committing suicide then being trapped in the afterlife.  \"This won't hurt I swear/The black of day, the dark of night, we share this paralyzed.\"  The black of day line might refer to the couple lying dead.  \"Turn the pages, turn the stone\" might be talking about the funeral.  The preacher turns the pages of the Bible and bury them next to a gravestone.  I give up now because I want to go do something else.  I'm probably wrong about this one anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nIght guys...this song is the way Load_myself said it\r\nexcept its a bit different..im breakin it down line by line\n\r\nlay beside me, tell me what theyve done\r\nsame as load_myself said...he wants her to tell him her story so they can relate\r\nspeak the words loud for me to hear to make my demons run\r\nhe knows the same thing happened..and he wants to punish \"the unforgiven\" from the first song for doing it to them both..hence lettin his demons run\r\nthe door is locked now but its open if your true\r\nmeans hes locked his heart but if she is honest and won't hurt him..hell open it up to her\r\nif you can understand the me then i can understand the you\r\nmeans if she understands his story he understands hers because they are the same\r\nlay beside me under wicked sky through black of day, dark of night, we share this PAIR OF LIVES(not paralyzed)\r\nthat all means its a cruel world and hell be with her forever if she just shares her life with him...treats him right..all that stuff\r\nthe door cracks open but theres no sun shining through\r\nmeans he opened up his heart but she wasn't honest\r\nwhat ive felt what ive known turn the pages turn the stone\r\nmeans what hes lived thru, he wants to get over it...its in the history, thats his past..he wants to \"turn the page\"\r\nbehind the door should i open it for you\r\nmeans he wants to know if he can trust her\r\nsick and tired i stand alone could you be there cuz im the one who waits for you or are you unforgiven too?\r\nmeans hes alone..no one is good to him and hes waiting for that one person TO be good to him and he wants to know if shes an \"unforgiven\" like the people from the unforgiven\r\ncome lay beside me this won't hurt i swear\r\nshe loves me not she loves me still\r\nbut shell never love again\r\nshe lay beside me\r\nbut shell be there when im gone \r\nblack heart scarring darker still but shell be there when im gone\r\ndead sure shell be there\r\nmeans hes gonna kill her for being an unforgiven hence \"shell never love again\" and \"shell be there when im gone\" and \"DEAD sure shell be there\" and his heart is still gettin torn and hurt \"black heart scarring darker still\"\r\nlay beside me tell me what ive done\r\nthe door is closed so are your eyes\r\nhe killed her  and his heart is closed..he won't let anyone else in now that she hurt him..that was the last time\r\nbut now i see the sun\r\nmeans that now that he won't let anyone into his heart...he won't get hurt anymore..or perhaps he plans to end his life and hell see \"the light\"\r\nill take this key and ill bury it in you\r\nmeans hes lockin his heart up for good since shes dead..and she has the key...it will open never again\r\nnever free never me cause your unforgiven too\r\nmeans hell never be treated right...and whoever is treated right won't be him (never me) and hes finally labeled her an unforgiven too\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nand one more thing....the unforgiven one is his life as a child and then as an old man....the unforgiven 2 is the time in between young and old...these songs are the same story..just seperate parts...don't try to act cocky sayin how they are totally different stories because they are not..if you disagree with anything ive said about this song...email me and yea..\n\r\npalumboner@hotmail.com\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nJust to get it out of the way, this is my favorite song from Metallica of all time. Actually, it's my fav song. I love it more than the first, but only slightly. THey are both damn good songs. Anyway on to what I think.\n\r\nI just watched the theatrical video for The Unforgiven, then the vid for UII, and I came to a realization. If you watch the first video (theatrical. iTunes, $2.) it really flushes out The Unfogiven. It shows the boy with a friend, a girl in a white dress and they are playing. Then it goes on to show the boy go into a sewer and make it his own room in the conformist society. It ends with boy, now an old man, digging out a block of stone from the wall and covering the entrance to his room and locking it. Then, from where he took the block, the sun shines in and he dies.\r\nNOW, to the point, if you listen to the Unforgiven II right after (or during, i havn't tried during yet) the song matches almost perfectly with the video for The Unforgiven! (Ok, not with timeing or anything, but with meaning.) So, what I think is that the two songs really are interchangable. Like, they are both about the same boy at the same time, but one ends with him dying alone and regretfull, and the other with him finding someone to share the sun with.\n\r\nNow, the meaning of this.\n\r\nAt the end of The Unforgiven, the old man \"prepares/to die regretfully\". I think The Unforgiven II is about the regret. Like, and alternate life flashed before his eyes as he died. He realizes, he could have taken comfort in his friend (Lay beside me, tell me what they've done\". He could have opened his heart to her instead of becoming bitter \"Lay beside me, this won't hurt I swear\" and could have comforted her \"Lay beside me, tell me what I've done\" but he didin't (The door is closed so are your eyes). He just went to his corner of the universe and slammed the door shut. Just my scattered thought. What do you think.\n\r\nBTW, I'm a Straight guy, and I love this song more than the first. Rationalize that!\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nTo me this song sounded like it was about rape at first â\u0080\u009clay beside me, this wonâ\u0080\u0099t hurt I swearâ\u0080¦I take this key and I bury it in youâ\u0080\u009d. \n\r\nEither that or its about two people who have been â\u0080\u009crapedâ\u0080\u009d in the sense of going through troublesome lives or being used and abused during their childhood and having their character and soul destroyed. I think itâ\u0080\u0099s a dark love song. Two people are brought together through their connection to pain and trouble and are clearly traumatised â\u0080\u009cif you can understand the me, then I can understand the youâ\u0080¦we share this paralyseâ\u0080\u009d. And their â\u0080\u009cblack hearts scarring darkness stillâ\u0080\u009d explains how theyâ\u0080\u0099re permanently scarred. \n\r\nMaybe what theyâ\u0080\u0099ve been through makes them hurt each other because pain is all they know and they see themselves, rather than their abusers, as the unforgivenâ\u0080¦ â\u0080\u009cLay beside me, tell me what Iâ\u0080\u0099ve doneâ\u0080\u009d. They continue to live as abused people.\n\r\nThe line â\u0080\u009cnow I see the sunâ\u0080\u009d could mean that theyâ\u0080\u0099ve finally found a release in each other, however sick, twisted and diseased the relationship might be.\n\r\nI donâ\u0080\u0099t know. I think the song can be interpreted in many ways. I also agree that it has some biblical references to heaven etc. Itâ\u0080\u0099s a very deep and dark song.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nprobably the best song ever\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nawesome song, just because it isnt heavy doesn't make it a fucking awesome jam.  fuck all you stereotypical metallica fans who say if its metallica and it isnt heavy it isnt good.  you dont know what metallica is, and you dont deserve to listen to their music.  like in the one simpsons episode.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nOk..this is what it sounded like to me. \n\r\nThe broken man from The Unforgiven I now has found some sort of soulmate, a girl. They share the same history and they try to comfort eachother. \r\n(tell me what they've done. Say the words I want to hear to make my demons run)\n\r\nBecause of the love & comfort he recieves from this girl the door (to his heart I think) seems to crack open. But there's no sun shining through. Meaning that there's still something strange going on, because he can't seem to really love her. So now he starts to wonder what's going on (should I open it for you?) \r\nThen he sort of finds out\r\nSick and tired, I stand alone\r\nCould you be there, 'cause I'm the one who waits for you\r\nOr are you unforgiven too?\n\r\nThe girl he wants to love is the same as the ones he dubbed unforgiven. At this points he's becoming a bitter man again. \r\nThe he kills the girl. (this won't hurt I swear / she'll never love again) The girl will always stay in his memories though (She'll be there when I'm gone) \n\r\nHe finally knows what to do now (now I see the sun)\n\r\nI take this key\r\nAnd I bury it in you\n\r\nHe takes the key to the door he's mentioning all the time, which is the door to his heart. He buries it in the girl, meaning that the key of his heart will disappear (because the girl is dead)  \n\r\nHe shuts his heart forever and he'll stay the broken man he was forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\ni think this song was written because the thought the first one was incomplete, you will also notive in the booklet of the album the lyrics are incomplete.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nI am not a great expert of Metallica (but a great fan, that's for sure), but what I have noticed is that James Hetfield's lyrics usually relates to his personal life. He may have said that this song relates to love and murder but generally poets (because that's what Hetfield really is) are poor analysts of their own texts. What I think is that so far (until Load and Reload) in his own personal life, Hetfield was living a chaotic and lonely life, trying to solve many things with his own past. On Load and Reload, the lyrics are more direct, the music is not so speedy as the previous albums. He takes their time to say things and to put his feelings in words.\n\r\nWhen he says Lay beside me it won't hurt, it could also mean lay beside me, don't be afraid of what I am I am not going to hurt you.\r\nShe loves me not, she loves me still, but she'll never love again = she doesn't seem to make up her mind about him, but she'll never love anyone else than him.\r\nNow I see the sun: now I am loved and see how I could be happy \r\nI always thought that he wrote this song more or less at the time he met his wife.\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nI have no idea why you would say poets are poor analysts of their own work, and also, that the song does not have the meaning Hetfield ascribes to it. It is perfectly possible that the song is about love and murder on a superficial level, but those being the explicit themes does not mean that those are not merely metaphors. I also disagree that the song is related to his wife or any other particular person - but this is only my personal interpretation. The way I see it, is the lack of what he desires in his life that is the primum mobile of the song, not one single individual. Everything, every instance of being wronged, is compounded and generalized into terms of erotic love, because that is where betrayal hurts the most (and perceived betrayal is, at least to me, what the song is mostly about).\n\r\nNow, whether it be actual or imagined betrayal, his reaction is that of immense pain. If he leaves her, he is forsaking love. If he stays with her, he is forsaking himself. So even at the cost of longterm unhappiness and solitude, he decides to stay true to himself and not forgive the betrayal.\n\r\nThe girl - the unforgiven - for her part, is merely guilty of not understanding him. I have a much milder view on the text in that it does not involve murder or cheating, or concrete betrayal, even. The problem, to me, is that he made the mistake of thinking that they were similar and compatible; he wanted to be understood, and thought he could get that understanding from her. But from the lines such as \"the door cracks open/but there's no sun shining through,\" it is apparent that he will find no light, i.e., no intellectual grasp on what he is about coming from her. Him seeing the sun only after she is gone means that he has accepted that she will not understand him. And she will only realize what he wanted from her when there is no further chance of a relationship - \"she'll be there when I'm gone . . . dead sure she'll be there.\"\n\r\nSimply my two cents. This has been my favorite song since the day I heard it a little less than nine years ago, and this is what it means to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nI'd also like to add that the two songs are disparate, and complete unto themselves. Yes, they could be referring to the same person, but that is irrelevant considering each song's theme.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nJaxgrrl, you are not alone!\n\r\nI feel so much for this song. Dunno why it never reached as far as Unforgiven 1. Probably because they refuse to play it live..\n\r\nI made a \"the unforgiven III\", just as a tribute. It's not as good, though : p\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nwow... pretty much after listening to the emotion and pain poured into every line of this song i wanna marry james!!! hmm... that relationship might be a little odd, considering im 14 years old hahahaha! but really, i love this song with a burning passion. ill shut up now =)\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nJust kidding, I'm not gonna shut up yet! LOL. Well, I think the song is about... Hmm... This is hard to put into words... I think it's about a guy that is \"unforgiven\" and he finally thinks he has found hope because he's met this girl that he can really relate to. But... it turns out she is just bringing him down. He really wants to find happiness with this girl, but she remains depressed or \"unforgiven\" and so he kills her and tries to find happiness on his own \"the door is closed, so are your eyes, but now I see the sun\"... I'm just guessing, but tell me if you agree/disagree or whatever. =)\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nJust kidding, I'm not gonna shut up yet! LOL. Well, I think the song is about... Hmm... This is hard to put into words... I think it's about a guy that is \"unforgiven\" and he finally thinks he has found hope because he's met this girl that he can really relate to. But... it turns out she is just bringing him down. He really wants to find happiness with this girl, but she remains depressed or \"unforgiven\" and so he kills her and tries to find happiness on his own \"the door is closed, so are your eyes, but now I see the sun\"... I'm just guessing, but tell me if you agree/disagree or whatever. =)\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nwow... pretty much after listening to the emotion and pain poured into every line of this song i wanna marry james!!! hmm... that relationship might be a little odd, considering im 14 years old hahahaha! but really, i love this song with a burning passion. ill shut up now =)\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nI like this one better than the other Unforgivin. This has so much more power than the first. My favorite part is the Chorus. It just kicks you in the balls.\n\r\nFavorite Metallica song!\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nThis is a good song. But understand that they just made it for shitz and gigglez. Fade to Black, Unforgiven, and Nothing Else Matters kick this songs ass. Low Man is the better ballad from reload. The best is obviously Fuel, and the most impressive is Fixxxer. Memo, Wild, Dance, and the very underated Attitude are highlights as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nwoah, lack of comments.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nBeautiful song. tells how 2 people who were rejected from society come togeather and now they dont care about anyone else but each other. Sounds girly i know but it is what the songs about.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nIm so glad theres still comments on this song. This song is the best song I have ever heard. Everything about it is amazing. It gives me goosebumps everytime I listen to it. It reminds me of basically myself in a way. I dont know but I freakin love this song! I have since the first day I heard it.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\ni dont listen to metallica much but does anybody else think that there are certain phrases that come up in many metallica songs like turn  the page in this one\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\no my god people\n\r\nits about a guy whos girlfriend, or wife, betrayed him in some way, im guessing cheated on him, and their love is fading.  This is the guy wondering if he should still trust her.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\n\"Lay beside me, tell me what they've done\"\r\nHe's find another person, who has gone through the same ordeal he has and tries to get her to confide and console in him her experiences and demons of her past.\n\r\n\"Speak the words I wanna hear, to make my demons run\r\nThe door is locked now, but it's open if you're true\"\r\nHe wants her to say things that will help ease the darkness he in consumed in.\r\nThe door symbolising his secrets, the demons, the darkness, pain, suffering, and memories of his past which he will expose and confide to her if her actions are genuine and are really out of love & compassion.\r\nThe door also symbolises the passage to freedom and the gateway to redemption.\r\nHe wants her to help him find solace and bury the burdans of his past. \n\r\n\"If you can understand the me, than I can understand the you\"\r\nIf she can understand what he's gone through and has been in similiar circumstances than surely he can understand what she's gone through as well. \n\r\n\"Lay beside me, under wicked sky\r\nThe black of day, dark of night, we share this paralyze\"\r\nHe is asking her to join him in the \"darkness\" with the demons that haunt them. Every passing second they are consumed in this pain and suffering they both feel for their own as well as eachother's ordeals, \"paralyzing\" them in the process.\n\r\n\"The door cracks open, but there's no sun shining through\r\nBlack hearts scarring darkness still, but there's no sun shining through\"\r\nThey both seek solace and comfort in eacother hoping for redemption. The \"Sun shining\" through the door symbolises the redemption, the forgiveness they both desperately seek to overcome their demons behind the door to their past.\n\r\n\"Black hearts\" symbolising their own two hearts, still in the \"Darkness\" with their demons. (When I say demons I don't mean literally, I mean it figuratively as in \"demons\" symbolising their woes, negative experiences, haunting memories of their past etc)\n\r\n\"What I've felt, what I've known\r\nTurn the pages, turn the stone\r\nBehind the door, should I open it for you\"\r\nHe reflecting what he was taught and programmed to believe whilst growing up by the world, society 's norms, the system, His parents, other people and God.\r\nHe wondering if he should help her seek redemption by opening the door for her, afterall she's trying to help him (refer to what i said before about what I think the door symbolises)\n\r\n\"Yeah\r\nWhat I've felt, what I've known\r\nSick and tired, I stand alone\r\nCould you be there, 'cause I'm the one who waits for you\r\nOr are you unforgiven too?\"\r\nHe's faced his battles and the demons of his past alone and wonders if she can be with him as he \"turns the pages\" of his past like a storybook and reads it out a loud to her and help him see through it not alone but together, relieve him of his pain and memories by sharing them with her. \n\r\nIf you notice, when you tend to share your problems with some one else it feels as though they share half the weight of your burdan, yeah well thats what I'm trying to say here.\r\nHe contemplates if she's like him too . . unforgiven that is.\n\r\n\"Lay beside me, this won't hurt, I swear\"\r\nHe's trying to convince her to help him confide his darkness in her and promises it won't affect her in anyway, or hurt her in the process (which is a load of bull, because how can not another person's experience especially that of a person whom you love not kill you, to know that muthafckers out there have broken them)\n\r\n\"She loves me not, she loves me still, but she'll never love again\"\r\nAs he's telling her all his secrets, he's unsure if she stills loves him the same still, or if her love for him changes.\n\r\n\"She lay beside me, but she'll be there when I'm gone\r\nBlack hearts scarring darker steel, yes, she'll be there when I'm gone\r\nYes, she'll be there when I'm gone\"\r\nHe's saying that he'll be able to be \"forgiven\" because of her but the thing is he'll be forgiven before her and he will no longer have to live in the \"darkness\" with his demons as he has found redemption at last. \r\nShe on the other hand is still unforgiven and thus lies in the darkness with her demons alone.\n\r\n\"What I've felt, what I've known\r\nTurn the pages, turn the stone\r\nBehind the door, should I open it for you\"\r\nLike I said before I think the chorus is the \"aftermath\" of him finally seeking redemption and leaving the darkness, since it's in past tense with the \"I've\".\r\nNow that he's free, he wonders if he should \"open the door\", help her find redemption as well.\n\r\n\"Yeah\r\nWhat I've felt, what I've known\r\nSick and tired, I stand alone\"\r\nEven though he's found redemption and is free of his demons, he's alone and misses her.\n\r\n\"Could you be there, 'cause I'm the one who waits for you\r\nOr are you unforgiven too?\"\r\nHe's wondering if she could join him and leave the darkness of her demons and find forgiveness too. \r\nHe'll wait for her on the other side of the door, where he's found redemption and accepted his demons.\n\r\n\"Lay beside me, tell me what I've done\r\nThe door is closed, so are your eyes\"\r\nHe's come back and returns to ask her what she thinks of him now, now that she knows everything terrible of his past (The door was open for her to enter and see into his memories of his past but now it's closed meaning she's returned from his past and he's finished confiding his ordeals to her).  \r\nThere is an \"insight motif\". Her eyes are closed now symbolising she has finished searching for answers of his past and knows everything now.\n\r\n\"But now I see the sun, now I see the sun\r\nYes, now I see it\"\r\nHe finally founds redmeption through her, because she accepts him for who he is and now he's is FORGIVEN. \n\r\n\"I take this key\r\nAnd I bury it in you\r\nBecause you're unforgiven too\"\r\nFiguratively speaking the \"key\" to the door he's giving her symbolises he's allowing her permamnent access to his memories and she can ask him about his problems. Also he's giving her to key to access her own painful mameories of the past as well maybe.\n\r\nI wonder if metallica intended to do a pun considering the title of the song \"The Unforgiven II\" . .The second unforgiven person would be the girl who loves him. and In the chorus as well \"'cause you're unforgiven too (II)\" . .coincidence or what . .creative nonetheless. I love this song.\n\r\nWell thats my take on it. Believe it or deny it whatever you want with it. lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nthe dreamerdisease guy or girl really got it and got everything i wanted to say.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nJames has never really told people what this song is about, but I think it's about his parenst like so many of his other songs. \n\r\nFor me I think this is a song about him forgiving his parents for dying.\n\r\n\"What I've felt, what I've known\r\nSo sick and tired, I stand alone\r\nCould you be there, cause I'm the one who waits\r\nThe one who waits for you\"\n\r\nThis could be a reference about him waitihng to see them on the other side.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nThere's no metaphors here.  This happened. Dead sure!\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nThis song is one of my favorites, but not as good as Unforgiven.\n\r\nI think the meaning of this song is quite complicated actually, since he states a few times, \"Or are you unforgiven too?\" It's like, to whom is he speaking? \r\nThough it seems its talking about a lover, since he keeps asking questions, like at the beginning, but I don't know.  \n\r\nBut I think i agree with Rockin_Fool:\n\r\n\"Look, Man...The guy is dead and up at the Perly Gates and he's explaining what happened in his life and all that stuff. The door opens if he is true, and he's free to go in heaven, but the door cracks open and there's no sun shinning through. The sun indicates the light from heaven. Therefore, since he sees no light, he is not going to heaven and he is unforgiven. The whole thing is a conversation with him and St. Peter at the Perly Gates. AND THE REST OF YOU ARE WRONG!\"  \n\r\nI think that is a very good theory.\n\r\nBut all the same, I am only 16, I really don't know anything, sorry.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nI see alot of people comparing the two songs and which one is better. Whether this one is better then the original is debatable, but one thing is certain: it wouldn't be as powerful of a song if it was a standalone song.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nI think its about someone who struggles to trust someone and allow them into his heart (closed door).\n\r\nHe then tries with someone, but doesn't recieve the acceptance/love he needs (the door cracks open but there is no light shining through).\n\r\nThen I think, due to him being so fragile, he kills her for betraying his trust.  there are lots of hint towards this in the song:\r\n\"She loves me not, she loves me still, but she'll never love again\"\n\r\n\"She lay beside me, but she'll be there when I'm gone\"\n\r\n\"Yes she'll be there when I'm gone\r\nDead sure she'll be there\"\r\n-- he puts alot of emphasis on the word \"dead\", more than is necessary had it only been a figure of speach\n\r\n\"Or are you unforgiven too?\"\r\n-- he insinuates that she is unforgiven for what she has done, but so is he, for what he has done to her.\n\r\n\"Lay beside me, tell me what I've done\"\r\n-- he realizes what he has done\n\r\n\"The door is closed, so are your eyes\r\nBut now I see the sun, now I see the sun\r\nYes, now I see it\"\r\n-- she is dead because he could not really open to anyone, and he realizes this now.\n\r\nthis is just imho\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\ni think dreamersdisease has it.\n\r\n\"Come lay beside me, this won't hurt I swear\"\r\nthis part to me suggests that he has opened himself to her, and is trying to convince her that its easier to open the door then it feels. she may still not feel comfortable in doing so.\n\r\n\"She loves me not, she loves me still, but she'll never love again\"\r\nhe is questioning weather what he has told her will have an impact on what their relationship was before he opened himself to her. the last part might be that at one point she may have said she will never love again or be comfortable in trusting a partner into that part of her soul.\n\r\n\"She lay beside me, but she'll be there when I'm gone\"\r\nthis part could be that he sees something different when he looks into her eyes and he's not sure what she has in mind, but hes trying to convince himself that she will still be there with/for him.\n\r\n\"Black heart scarring darker still, but she'll be there when I'm gone\"\r\nhis heart is still hurting from his pain and the not knowing if she will stay or go. he is still trying to convince himself that she will still be there\n\r\n\"Yes she'll be there when I'm gone\r\nDead sure she'll be there\"\r\nhe has asked if she will stay or go, and she says she will still be there this could be the change he sees in her eyes and in her response he knows for sure that she will be there.\n\r\nthe eyes really come to my mind because this reminds me of a situation that i was in with someone that i let into a part of my life that no one else has seen and the conversation took place when we were laying in bed together and my focus was on her eyes. it didn't work out as well as the song, but that does come to mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nOne of the very best Metalica songs. Perhaps Unforgiven III will finally solve all of the mysteries! DEATH MAGNETIC 9.12.08!!! Metallica > all.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI wonder what the Unforgiven III will be about.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nI wonder what the Unforgiven III will be about.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nthis is a good song but 3 and 1 are better. and i read in a interview with james the first one is about suicide and this one is about murder\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nI like beans' 2nd post on the second page hit the nail on the head\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nits a little more simple than you may think.... its about forgiving no one and ending up alone.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nMy favourite Metallica song! It has a really deep meaning!\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nThis song is NOT about being at the pearly gates you idiot! The Unforgiven I *one* from the first Unforgiven went through his life battered, beaten, and broken. He finally found someone who was like him...aka Unforgiven II *too*..this makes II *Two* Unforgiven(s). She betrays him in some form or manner, and he leaves her with a key to leave the world of hurt and betrayal by killing her.\n\r\nThe Unforgiven II *three* is about after he killed her, and now he's in hell in the River Styx, but of course I'll comment on that song when I've had time to get to it.\n\r\nAlso, Metallica does use the phrase \"Turn the pages\" Not in reference to the song \"Turn the Page\" Which isn't actually one of their original songs. It is a cover that can be found on the Garage INC. album. Turn the page is, from Metallica's point of view I suppose, about a stripper/prostitute, who is only trying to provide for her little girl, and enjoyed working in the \"entertainment\" business. I'm not sure what the actual meaning behind that song is though.\n\r\nJames is my sex symbol. I'm 20 years old, but I'm head over heels in love with him. If only he weren't married...*dreams*\r\nHis voice is gorgeous, and there's no way that anyone will ever take his place in my heart..other than my fiance, who is sitting here giving me the glare because I'm going on and on about how I'm soo in love with James....\n\r\n*goes to comment on The Unforgiven III*\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nI think this song is about a man who has murdered his love, but cannot accept it.  He mourns the loss of her and tries to blame others for her death until eventually realizing that he was the murderer.  After coming to this realization, he decides never to allow anyone to know of the truth.  The listener is told \"The door is closed for all your eyes, but now I see the sun.\"  He is telling the recipient of the song that while they are given false closure, he sees the true story of the situation as clear as day, which he cannot take and grows angry over.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nI think that the Unforgiven was better by far\n\n\n\n", "comment_159": "\nmy fav of the 3\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\ni think its about he finding a woman and she cheats or sumthin so he want to get the truth out of her, as he wishes she didnt cheat and he is asking are u unforgiven too like he will not forgive her as his parents.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nOkay I probably can't add much that hasn't already been said, but the character from the first Unforgiven has found another that he thinks he can relate to and thinks maybe she can relate to him as well. I think he's still very afraid to let someone in which is what I think \"Behind the door, should I open it for you\" is referencing to. Eventually he learns she's not gonna be there for him and he wonders what he's done to make her not love him and he's left alone again. Finally he realizes that she's just like him and is afraid to love which he states, \"now I see the sun\" which is him realizing she's just like him and he says, \"because you're unforgiven too\".  \t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nCompletly agree with Jigokusabre.. Epic song \t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nI think its about the unforgiven guy who finds a girl. Shes been through pain just like him. He tells her his story to try and get through it. He tells her all of his story but he doesn't find his redemption(the door symbolizes this).. He becomes frustrated. He kills her. He finds his redemption through this but now he regrets it because he used her. \r\n\"Never free\r\nNever me\r\n'cause you're unforgiven too\"\n\r\nbasically he used her to find his redemption but now he has that in his conscience.\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nWhat I've felt, What I've known,.... \r\nhere the man has not felt anything in his life, because he has always been afraid about the dark side of the life,another damn song about the fucking foolish life\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nJust thought that i'd point out the some of the lyrics are inforrect.\n\r\n\"The black of day, dark of night, we share this paralyze\"\n\r\nReally is:\n\r\n Through black of day, dark of night, we share this pair of lifes.\n\n\n", "comment_166": "\nthis  song is great.it feels much more emotional,probably cause it is slower.best of the three for me\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nTHE GREATEST METALLICA SONG EVER!!!!!!!!!!!!!!!!! It is really hard to play though but i can!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nOne of the most depressing songs of Metallica! i heard it last nite! i cried a little bit! but i think it's about sharing your life but in the end, a woman does something to hurt you! the lyrics are what make it a sad song! I LOVE U METALLICA! In fact, it doesn't matter what Metallica song it is! either way, Metallica's got the great songs\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nI agree with many of you. I always thought the story was a continuation of \"The Unforgiven.\" The first one is about growing up and getting treated like shit your whole life. And then finally you're just like \"fuck this shit. I don't deserve to be treated this way\" so you never forgive those people in your life. Then, in the second one, you finally meet someone that's been through the same shit as you. You begin to fall in love but you're not sure if you can trust that person given everything you've gone through (\"The door is locked now, but it's open if you're true\" \"Behind the door, should I open it for you\"). But once you let her (or him) through the door, you realize what a bitch she (or he) is because she treats you like shit too (\"Black heart scarring darker still, but there's no sun shining through\") so you decide that she's unforgiven 2 (too). Many of you said that in the end he decides to kill her. I'm not sure if this is what James was going for, but the lyrics make a lot of sense. \"Lay beside me, tell me what I've done The door is closed, so are your eyes\" He uses the door as a metaphor for trust again saying that it's closed now. And \"so are your eyes\" might mean that she's lying beside him dead. \"I take this key And I bury it in you Because you're unforgiven too\" This means that that you are burying the key to the door along with her because you don't feel like you can trust anyone anymore, so you're not going to open the door for anyone ever again. You feel like an idiot and you feel betrayed and filled with pain, so you're never going to let it happen again.\r\nThis is one of my favorite Metallica songs. Many of their songs are about death and destruction (which I do still like) but this one shows a deeper and more meaningful side to James's songwriting. And I do take this song personally.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nThis is a song LYRICS website, but the amazingness of this song's music should be discussed. The first two people who decyphered the lyrics had it right, this is certainly a continuation of the first. Anyone who thinks two songs by the same band with that share lyrics are not related is stupid. The main verse riff is by far the best clean metallica riff, though if you play guitar you can see the similarities between most of their clean riffs. Chronologically, fade to black, to live is to die, the unforgiven II, and the day that never comes all follow rather similar chord patterns, but this one is the best. The bending in the riff is mindblowing. I love the repeating of some of the solo licks as the unforgiven I. Just an all around great song. \t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nits speak the words out as you near not i wanna hear\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nToo bad instead of 'The black of day, dark of night, we share this paralyze' he says 'The black of day, dark of night, we share this pair of lives' but he says of like uh so that's why it sounds like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nA lot of symbolism in this series of Songs, in this one however I don't see him \"killing\" her, I see that she is somehow immortalized by him and in that will remain \"alive\" way beyond death.  The buried key is \r\n\"key\" in solving this.  Yes, it seems a mystery to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nWell I see this song is all about a chance.. He is agitating on the girl's decision. It hurt him so terribly, he has been surviving all by himself. The lyrics says, \"I'll take this key and I bury it in you\" for me he's giving a key to forgive her, but he's not sure if she can find it so if she is true she'll dig more to find it. If she can understand him then he will let himself to understand her too. \nIn the end, he finds a light, either from the sorrow he has been tired of or he has come to understand that he can forgive her. I don;t know... I think that way because I have been in the girl's shoes.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nI love this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nOk this might be stretching it a bit but these are my thoughts.\nThe man from the first Unforgiven grows up and finds a partner that understands him. They relate to the darkness within eachother. The shared pain brings them closer.\nThen the man begins to exhibit some of the controlling behaviour of his upbringing toward his new partner and/or their children if they have any. He, perhaps unintentionally, reverted to the behaviour that he had been done unto him, because that was all he knew. What he does hurts her deeply. She leaves him but still loves him.\nBoth broken, hearts blackened and hard as ever. She tells him she will wait for him if he can change his ways, then they can be together again. This is a glimmer of hope, the sun. But in the mean time and if he cannot change forever, she must be strong without him and bear the shockwaves of his actions alone. She doesn't know if she can forgive him and he is hurt because she abandoned him.\nIn the end I think they reconcile. Bury the key to the \"door\" that had been locked up until that point, in each other. Maybe if they ever feel betrayed by the other again they will retrieve the key and lock the other out for good. Bit now they have come full circle, recognise the brokenness within each other and reconnect over it.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\none of the best songs\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nI could be way off base but I do wonder whether this is yet another track about JH mother and her death. There seems to be a spiritual guilt wrapped around the lyrics because her beliefs failed her and also his guilt through grief surrounding her death\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nJust vibrations. You'll realise what this means one day.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nI think Unforgiven is about a person(Guy) that the world has destroyed his dreams and hopes so he rejects the world and dubs it the Unforgiven.\n\r\nSo Unforgiven 2 is about the same Guy, he met a girl and she wants to help him and he fell in love but the Guy is suspecting something \"cuold you be there? 'cause un the one who waits for you or are you Unforgiven too'?\" and he found out her intentions or something like that and he killed her \"i take this key and i buried ir un you cause you're Unforgiven too'\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nFollowing the first song \"The Unforgiven\", which says: \"The old man then prepares / To die regretfully / That old man here is me\", now the hurt and disappointed man blames death (which he also dubs unforgiven) for not coming to take him away: \"Cause I'm the one who waits for you / Or are you unforgiven too?\". He is not sure about dying though (Behind the door, should I open it for you?\". Eventually he dies \"now I see the sun\" and he surrenders his soul \"I take this key and I bury it in you\".\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nThis song is about trust and not being able to let go of the past.\n\r\nThe protagonist is describing someone they have learned to open up to, after carrying grudges and emotional scars their whole life. \n\r\nThis person has \" laid beside\" them \"under wicked sky,\" not being scared away by the protagonist's dark side or fleeing during hard times.\n\r\nEveryone else this person has trusted before they feel has hurt or abandoned them. So they've closed themselves off. Now \"behind the door,\" the protagonist asks this person they feel inclined to trust \"should I open it for you?\" As in, \"should I let this person in and put my faith in them?\"\n\r\nBut they are also reluctant. \"Are you Unforgiven, too?\" The Unforgiven is a term the protagonist gives all of those who have hurt them, creating the emotional baggage they can't seem to toss off.\n\r\nThe song doesn't seem to have a happy resolution. After deciding to unlock the proverbial door and let someone in again, the protagonist says \"I take this key, and I bury it in you, because you're Unforgiven, too.\" Ultimately they feel betrayed by the person they decided to let in, and have decided to lay to rest the notion of ever letting someone in again, along with the relationship.\n\r\nIf this song was autobiographical at all for James Hetfield, he must have moved past the feeling. He has a family he presumably loves and trusts. Or maybe he wrote it from the perspective of the person he was afraid of becoming.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nIn my view and understanding of the song it is about a man who falls in love with a women who constantly betrays him every time he gives her a second chance. Every time he â\u0080\u009cturns the pagesâ\u0080\u009d he gives her another chance and starts over again with her. Also by â\u0080\u009csick and tired I stand aloneâ\u0080\u009d he means that everyone around him is telling him that she is not right for him but he stands there alone giving her another chance.\r\nAnother lyric in the song â\u0080\u009cwhat Iâ\u0080\u0099ve felt what Iâ\u0080\u0099ve knownâ\u0080\u009d describes how he has gone through heartbreak and the knowledge of what she had done and how she has wronged him. Through out the song it doesnâ\u0080\u0099t seem very clear but it actually shows how he forgives her 3 - 4 times until finally condemning her as â\u0080\u009cunforgivenâ\u0080\u009d after coming to his senses. You can pin point his own revelation of his situation with the linesâ\u0080\u009dshe lay beside me, but sheâ\u0080\u0099ll be there when Iâ\u0080\u0099m goneâ\u0080\u009d this line is him realizing that she wonâ\u0080\u0099t fallow him no matter what he does and that she will always keep treating him like this. The part of the song â\u0080\u009cthe door is closed so are your eyes, but now I see the sunâ\u0080\u009d is him clearly saying that he is not going to let her back into his life, and because of that he realizes that the happiness he had looked for in her is now revealed to him because she is not in his life. But then again dispite his realization he rethinks on his choice and wants to forgive her again, but as he thinks back to what heâ\u0080\u0099s â\u0080\u009cfeltâ\u0080\u009d and what heâ\u0080\u0099s â\u0080\u009cknownâ\u0080\u009d about her he realizes that he canâ\u0080\u0099t forgive her anymore so he buries the â\u0080\u009ckeyâ\u0080\u009d to the supposed â\u0080\u009cdoorâ\u0080\u009d with her memory. And thus declares her unforgiven. \r\nI was extremely stoned when listening to this song and I really understood every part of it, I got really emotional because I was going through the same exact thing that is described in the song. Iâ\u0080\u0099m not whatsoever stating that this is what the song is supposed to factually represent, Iâ\u0080\u0099m just giving my take on how I analyzed it to be. Hoped this cleared up any misconceptions ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nMany ways to interpret the meaning behind the song. At it's base there is someone he wants beside him and there are questions he is asking them. In conclusion  at it's heart this song speaks to the many forms of love and suffering... Death and forgiveness and ultimately it's about life and what that means for those who must live with it all. Which is every last one of us. \t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nno, i meant in a gundam wing fanfic, heero kills relena because of duo... and stuff...\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\noh, lol that kinda thing...Duo of all of them is straightest..let me a assure you O_o\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\ni do happen to like this one by Metallica not sure what its about and dont really give a damn either. but Metallica has to be the most over-rated band ever! i mean all their shit sounds good til that fag Hetfield starts singing and fucks the song all up... all but this one that is... and Metallcia fucked turn the page all up too fucking homos they should have let it go it was perfectly fine the way it was then they think they can make it better or some shit... IT FUCKING SUCKED! you people want to hear a real band then check out Pantera they have to be the best heavy metal band of all time RIP Dimebag well thats about it im out and FUCK METALLICA!\t\t\t\t\n\t\t\t\t\n\n"}