{"comment_0": "\ni love this song. bbygrll05 is right, he isnt quite over a girl but she's moved on and he thinks if he disappears it will help.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nas far as i can tell, this song is about a guy who left his town....for some reason. In the back of his mind there is this girl that he loves. He clould never tell her just what she means to him, and he hopes that someday he will be able to tell her the truth....... \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nthis song made me cry ; hes obviously not over a girl &+ he doesnt want anyone to know it ,. hes trying to make it seem like hes not around ; because he doesnt want his feelings to show anymore ,.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis is currently my favorite song! It's basically saying he isnt over his ex and he thinks that if he stays away it will b better 4 the both of them... but he doesnt want any1 2 knw hes still strung out over her so he doesnt want her 2 tell them the truth... great song! great lyrics! great video! love Jason Aldean!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\n I think he left the girl he (found out later) he loved alot, and regrets it. Or maybe he left out of anger or because he didnt feel he was good enough or along those lines. Either way, he still loves her, and hes asking her not to tell anyone the real reason why he left, and to continue to make up excuses for his absence. \n\r\n Or it could be that he left a girl, or she left him, but he still loves her, but he think its better if he stays away.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI love how the beat is fun and not depressing yet he is obviously so sad and so strong about leaving the girl he still has feelings for.  Absolutely one of my favorite songs!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\ni heard this last night live, Jason and Eric Church were in Greenville SC. He does amazing live, and this was probably my favorite one of the night.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis song is one of my favorites!  I think he has left town because he knows that he is still in love with a girl that has already moved on.  The girl knows why he left, but he wants the girl to make up some story about why he left.  He does not want his friends back home to know the real reason why he left.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI am this person. I could be either one. Running away or crying to stay. But damn, this is real life. When ya don't hear from someone for awhile, and all the time you have held on, kept your head up high....just like wading through a deep creek. Should you go under or should you wander on.......or take a chance of never looking back. But if I don't take the chance of looking back, would it bring me anything, or even Give me anything? This particular person has had a tippy-tight hold on my heart from the very first night. And that turned into 1o years.....with both of us runing from each other's friends,and that was A Lot OF the Trouble's  and well, you should be able to read between some lines. That is what I need, someone elses' thougts. He maybe made himself crazy, but in the long run, he tore my world apart., but the feelings never changed. Each meeting, pass-by. damn. What the hell can anyone make right anymore. Cause he makes me crazy too. and that  has been advoding one another very hard for a very long time now. Ya'll lovers and cheaters, lovers and haters; give me some kind of , hell there ain'nt so sign. I just want your thoughts, your viewes. Should I leave or go, Love him and stay. Take him with, and just runaway. I waNT  'THE Truth FROM EVERY INCINDENCE OR HAPPENING.........OR AN IDEA THAT I CAN PUT MY FEET BACK ON THE GROUND.\r\nHE JUST SENT IT TO ME........OUT OF THE BLUE.....EVEN THOUGH OF LOW CONNECTIONS........IS IT TIME TO MAKE THE ONE WE HAVE ALWAYS BEEN AFRAID & IT FINALLY TIME TO NOT BE AFRAID OF THE TRUTH.\n\n\n", "comment_9": "\nI think this is about a guy whose girlfriend ended their relationship, and how he denies missing her to everyone around him, including her and wants her to tell her friends he's over it: \"Tell em *all*...that I'm probably doing fine\" and \"the truth is, i'm asking you to lie\". So he's pretending to move on, but inside he really does miss her and he's stuck on her. In the song I he's talking directly to his ex, cause he says at the end \"tell em' anything you want to, just don't tell em' all the truth, i still need you, that's the truth...\" and so on\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThe final line reveals that the \"truth\" is that he still needs her. I don't know a guy/woman who hasn't been through that before. Pretend to move on, still haunted by the past, cant seem to be able to make things right... Ive been there, still am... \t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song is about a guy who is not over his girl.  He sees her somewhere and explains to her that he wants her to tell everyone that he knows friends, parents, anyone they both know that he is doing fine. When in reality he is a wreck.  He wants her to tell everyone that he is ok.  He wants her to lie to everyone, but THE TRUTH is he is a wreck because of her and he still needs her.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ni believe that he is talking about his parents, he maybe ran away from home and he doesnt want them to know the truth that he didnt make it as well as he thought he would, and doesnt want them to know about  it because he feels ashamed\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI sang this at my high school's talent show last year, kind of like my last hurrah as a senior. I surprised everyone at school with it and a lot of them said I was great. I think the reason I sounded so good was becasue I lived this, and I was able to take the pain I had and put it into the song. Lyrics are just lyrics unless you truly feel the emotion that goes with them, or else the song will at best be good, but never great. That's why I would never put it past myself if Jason Aldean has this exact pain at one point in his life. I got ambitions to make it to Nashville one day, and I always joke around with my friends, that I've had enough heartache and good times to make dozens of albums.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThere's a relationship between two people(not really girlfriend/boyfriend but friendship), he loves this girl, but can't tell her.. it's extremely hard to tell her especially in person. He could tell her the truth about how he feels, but he's unsure of telling her. In the beginning of the official video Jason puts a letter in a mailbox. That letter is for the girl he really loves I believe. He is telling her the truth, but saying don't tell everyone that he loves her. He wants it kept secret between them two because he feels he probably can't handle everyone knowing the truth about him loving her so much. Well at least so soon.\n\nThis song means a lot to me because I did something similar like this for a girl I like. I hope someday we'll maybe be together. My heart has gone skyrocket for hers and I just hope she is willing to go on that journey with me and is able to see that. I just hope, really hope she will stay faithful in me and that it will all work out. I just couldn't see myself with anyone else(and her), especially for the fact that we have lots of mutual interests, just some differences because of gender. I hope she realizes that.\t\t\t\t\n\t\t\t\t\n\n"}