{"comment_0": "\nA child is born.\r\nHe is raised and forced to conform through pain.\r\nHe vows to himself that he will never lose his will.\n\r\nAs a man he never lives for himself.\r\nEverything pure he's ever felt never shows through his actions.\r\nIt's too late to turn back.\r\nHe will never forgive himself.\n\r\nAs on old man he prepares for death.\r\nHe has nothing but his regret.\n\r\nHe forgives not himself.\r\nHe forgives no one else.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nTo sound like another mindless internet drone myself...I'll start this off with \"I think.\"  I think this...well, I\"m really sure this song is about society today.  And yes, today is the same (if not worse) than 12 years ago when the album was released.  Anyway, I think this song is about society in the manner that nobody is free to be themselves anymore.  The only time we are truly individuals are when we rebel.  The way the world works, as soon as we are born, we are influenced by those around us to join the conformist, industry-ruled world we live in.  Even though it was a comedy, Number 2 in Austin Powers said it best.  \"There is no world anymore.  It's just corporations.\"  And given the lyrics \"What I've felt \r\nWhat I've known \r\nNever shined through in what I've shown \r\nNever free \r\nNever me \r\nSo I dub thee unforgiven\"  \r\nI just find that these enforce my thoughts.  \r\n\"What I've felt\"  -- deals with his feelings and emotions\r\n\"What I've known\"  --  Everything that he (and we) know that we aren't allowed by culture to disperse\r\n\"Never shine through in what I\"ve shown\" --We are becoming one big lump of crap...a big mass with no individuality.  This means that even though he's a person, it doesn't show, because he's a drone.\r\n\"Never free\" --Ruled by everything around him\r\n\"Never me\" --It's not acceptable in today's culture to be yourself.  (I say screw this and everyone who enforces it, but that's the way it is)\r\n\"So I dub thee unforgiven\" --He feels he's unforgiven because he can't find it in him to stand out so much that you'll recognize him in the basic group of lowlifes.  \r\nAnyway, this is what I think the song means.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nbest metallica song.  totally about how a child is controled and demanded to confrom and he regrets doing it as an old man.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nOK I know I'm a bit late, but here's what the song really means to me. \n\r\nIt is about a guy (him, you, me, anyone) who was never free to be himself. Instead, society forces us to adopt certain behaviours from the moment we were born. They tell us what's right or wrong, what's good or bad, whether legally (laws) or culturally (through the opinion of others). So the guy grows up and feels trapped and he can never escape from this prison. Then he just gives up. He doesn't care anymore and feels he might as well die right away since it's not he (the guy he was or could have been otherwise without all the social pressure he had to conform to) anymore who lives but some zombie who has had to live by society's standards. So in a sense, the unforgiven could refer to society as a whole.\n\r\nBut to me, the unforgiven also has a second meaning : himself. He is the Unforgiven because he can't forgive himself for not breaking free from all this crap and finding enough courage to be himself, to be the boy he could have been had he not surrendered to social pressure. Despite his vow to never surrender (that never from this day his will they'll take away), he failed. Then he gives up the fight, he feels old, and he feels his life is over (I don't think the lyrics litterally mean he grew old. That's just how he feels.) He feels there's nothing more to expect from life. (The old man then prepares to die regretfully) What's the point in living if he could never be himself anyway? For him it's too late. He can't forgive society for forcing its rules upon him, nor can he forgive himself for not having fought harder to break free from this when he was younger. \t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song reminds me of the novel \"Brave New World\" by Aldous Huxley.\n\r\nThe young boy learns their rules\n\r\nDeprived of all his thoughts\n\r\nThey dedicate their lives\r\nTo running all of his\r\nHe tries to please them all\r\nThis bitter man he is\r\nThroughout his life the same\r\nHe's battled constantly\r\nThis fight he cannot win\n\r\nThese lines from the song strongly remind me of the concept of the book - of living in a world where everyone is foolishly conditioned and \"drugged\" to think that everyone is happy. Their thoughts, ideas and their individuality is taken from them.\n\r\nA brilliant song...\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is about a father and his sons relationship. The son hates the old man because the old man has no self respect and so was unable to raise the boy with the perspective of self respect. Due to this, the son has a horrible life and blames his father. The father is proud and wont accept his son outgrowing him, thus the conflict of wills, ultimately leading to the sons self sabotage.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nok, no one commented on this either, Jesus man! This is another classic Metallica song, y is no one commenting on these songs! if it wasnt for that intro riff that Kirk plays, i wouldn't have started playing guitar, this song is bitchin'!\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI didn't comment on it because it is so obviosly good that nothing I could say would improve it, and if someone doesn't realize how great it is, I certainly wont be able to speak louder than the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThe cycle of life and death in a world filled with people using you and taking profit out of you.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThe meaning of this song to me is biblical.\n\nIt is the story of the fall of Adam, the son of man.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nNew blood joins this earth\nAnd quickly heâ\u0080\u0099s subdued\nThrough constant pained disgrace\nThe young boy learns their rules\n=========================\nA child is born and quickly his happiness\nis killed; through shame and pain he is forced\nto conform with society.\n\nWith time, the child draws in\nThis whipping boy done wrong\nDeprived of all his thoughts\nThe young man struggles on and on, heâ\u0080\u0099s known\nA vow unto his own\nThat never from this day\nHis will theyâ\u0080\u0099ll take away\n===================\nThe child is growing up, but he is still\nbeing supressed by society, he makes \na vow to himself that never again will somebody\ntake away his free will and he will do whatever he desires in the future.\n\nWhat Iâ\u0080\u0099ve felt\nWhat Iâ\u0080\u0099ve known\nNever shined through in what Iâ\u0080\u0099ve shown\nNever be\nNever see\nWonâ\u0080\u0099t see what might have been\n============================\nThe child always knew a lot and always felt\ntarnished inside, but he never showed his emotions\nto other people. He has never been free in his life\nand he will never see what his life could have been,\nhad it not been tarnished by society.\n\nWhat Iâ\u0080\u0099ve felt\nWhat Iâ\u0080\u0099ve known\nNever shined through in what Iâ\u0080\u0099ve shown\nNever free\nNever me\nSo I dub thee Unforgiven\n==================\nRepeat of the previous lines + the child is always\ndubbed nicknames by society, so he calls everyone\nwho has wronged him in his life the Unforgiven.\n\nThey dedicate their lives\nTo running all of his\nHe tries to please them all\nThis bitter man he is\n===============\nThe Unforgiven dedicate their lives to be controlling him instead of themselves,\nthe child tries to please everyone, but is just bitter.\n\nThroughout his life the same\nHeâ\u0080\u0099s battled constantly\nThis fight he cannot win\nA tired man they see no longer cares\nThe old man then prepares\nTo die regretfully\nThat old man here is me\n==================\nAll of the child's life was wasted fighting this\nfight with society, that he ultimately will not win.\nAs he is now an old man, he no longer even cares\nabout this fight, and people around him are preparing for\nhis eventual death, while the old man regrets living his life.\nThe story is revealed to be told by the broken child himself.\n\nWhat Iâ\u0080\u0099ve felt\nWhat Iâ\u0080\u0099ve known\nNever shined through in what Iâ\u0080\u0099ve shown\nNever be\nNever see\nWonâ\u0080\u0099t see what might have been\n\nWhat Iâ\u0080\u0099ve felt\nWhat Iâ\u0080\u0099ve known\nNever shined through in what Iâ\u0080\u0099ve shown\nNever free\nNever me\nSo I dub thee Unforgiven\n==================\nRepeat of previous lines, that I already explained.\n\nYou labeled me\nIâ\u0080\u0099ll label you\nSo I dub thee Unforgiven\n==================\nThroughout his life, he was always laughed at\nby society and everyday people. They always\nlabelled him names, but the child / old man \nlabels them too; everyone who wronged him is dubbed\n\"The Unforgiven\".\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song takes I. A certain meaning for me I think because of my abusive childhood. I take it as ever since the child was born they placed certain rules on him. They had a certain image of him in their mind of how he should be and he learned to play that role to make them happy. He does this in-spite of them damaging him mentally and maybe physically too. He wants to conform to their rules to make them happy, but deep down he isnt happyÂ \t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\ngreat song....i can relate to one part of the song\n\r\n*he tries to please them all\r\nthis bitter man he is*\n\r\nthat is how i was raised....to make everyone else happy first then worry bout myself....and i am bitter, yes....but i still keep an open mind to everything that someone says....but for once in my life i would like to be able to think bout myself first....then move on\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThe best song on Black, in my opinion.  I can relate to it so much.  It's about people who are so miserable that they try to take control of the weaker people's lives. According to the video, it's could be about someone who can't take what's going on in the outside world, so they hide themselves in their own little prison until they finally die.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nit means so much to me because the song is about people gettin beat up and made fun of and like the song says, labeled. i had to go through that in elementary skool and middle, now ppl think iom a lesbian and i truthfully dont give a shit. its about beliving in yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\npersonally my favortie Metallica song, should be obvious that the song is about a guy going through life that was made fun and \"labeled\" as a child, forced into conformity as an adult, and left alone to die as an old man regretting he ever lived. The song explains that what you do will forever be more important than what you've known and felt\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nbut there is also more than that.  its deep and full of sorrow\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nIt is about people (or: the society/goverment) who are trying to control weaker people's lives. not about a particular boy...if u were all die hard metallica fans like myself u would know that also it is rumored amongst us hardcores that It is but not confirmed by Metallica that this song was written after the book \"Anthem\" by Ayn Rand - cause of the book's similar subject matter. \n\n\n", "comment_18": "\nThe One of the best songs in the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nthis is definitely my favorite metallica song. its so full of raw emotion.  has anyone seen the video? it very sad but completely reflects on the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song so rocks. Love it. I can hear it over and over again. I to can relate to this song. The lyrics:\n\r\n\"He's battled constantly,\r\n this fight he cannot win.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI love this song.  It's my favourite from the black album, and one of my favourites of all time.  I think that it's about the life of a boy who was labelled and pressured into being what other's wanted, and in the end he regrets it all and no longer cares to live.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nThis is one of my fave songs. It always ends up on my driving tapes or CD's because i love to sing along when I drive. I've lived through many bad experiences in my short 21 yrs, and have always felt that \"what I felt, what I've known, Never shine through what I've shown\" was my motto. Never let anyone know there's something wrong..... Not too healthy I guess. Anyway, this was my theme song during those hard times when i just couldn't stand it anymore....\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI've also been through some bad experiences in my life and this is one of the songs by Metallica that I can turn to for some guidance. The other song being \"Nothing Really Matters.\"  This song is always played throughout my head and is far most the greatest song I have ever heard. \t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nFUCK I LIKE BEANS!! \r\nwhy must you repeat almost word for word the interpretations from encycmet.com biter!!\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThe song is about a boy who is held back by the laws and limits of society and grows up to be an old man and regrets for never breaking the rules to have a happier life. One of my favorites!\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ni can relate to this song so much.  i lived the life of this boy and just like him, since the dayi was born the world owned me and made sure i was taught its rules( what i could/could not do, the way i should dress, behave, talk , think...).  although i knew i was unhappy, ididn't know that the world was my source of unhappiness.   i drew in to the world and lived my life the way others expected i should and by the time i realized it , so much of my life was wasted.  the world's soul possesed my body and chained mine down.  i never understood why i did those things because as soon as i let go of all the world's shit inside that anchored me down, i was reborn again.  although this song represents me in a way... i am grateful that i did not end up as regretful as the boy did because, although i can't say i have found myself completely, i found out the world's scheme earlier than he did. like the boy though, i kinda dub the world unforgiven as well. it labeled me and put me through so much shit for things i didn't want in the first place, that i am totally resentful... but i guess it is my fault.... ok i will shut up...\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nunless I heard icon wrong, this is about james and his parents.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nso for starters I_like_beans is invited to kiss my ass, who cares how die hard of a metallica fan YOU are, all you are is the metal version of the fashion b*tches of the pop world. So don't be so fast to slam everyone else's interp. because that is what this site is for. That being said, here's my take\n\r\nThe song's character as a child is one of those who don't fit in, and through the societal torture of his peers is warped into yet another mindless clone that cannot bring his true self to light. \r\nAs a young man he attempts to please the whole word but cannot win because he is a true individual and as such simply cannot please everyone. \r\nAs an old man he has realized the unforgiving nature of the world which fails to realize human nature and regrets ever having been born into this society of labels.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI think most of you just see the superficial meaning of the lyrics.  I'm leaning more towards I like beans (Altho i dont like his attitude, probably a 16 y/o kid that thinks he knows metallica) and Orgasm...\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\njust wondering. what does the line \"So I dub thee unforgiven\" mean? is he the \"unforgiven\" or it is the society? thanks!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI love this song, its a shame, cause when I listen to this it reminds me how great Metallica used to be, if they had quit after this album, they would have gone out on top, instead they just began putting out shit record after shit record, now they are a joke. \n\r\nAnyway, i think it's about a slave.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nwtf abient dark??? \r\nabortion? Come on.... Metallica ain't some I HATE SIN catholic rock band.\r\nI think it's about a young man who's hoping for great things... but then the harsh reality of life sets in and he realizes that he can't be a hero.\r\nHe becomes a sad old lonely man and dies that way.\r\nDefinitely an amazing song.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI haven't followed the entire conversation, but personally, I've always felt that Unforgiven was about a guy raised in a strict, conformist area, where being different was considered wrong, but continues fighting on(\"Deprived of all his thoughts...The young man struggles on and on he's known\"). He finally gives up, appearing to conform, but still doesn't want to(A vow unto his own...That never from this day...His will they'll take away).\r\nLater on, after trying to make a mark in a world saturated by normalicy(What I've felt...What I've known...Never shined through in what I've shown), and many years, he finally gives up even trying(He's battled constantly...This fight he cannot win...A tired man they see no longer cares).\r\nThe songs' chorus essentially sets the tone of it:\r\n\"You labeled me\r\nI'll label you\r\nSo I dub thee Unforgiven\"\r\nWhich is that they called him different, so he refuses to forgive them, not for the conformity, but for the lack of tolerance.\r\nI think how he's different is purposely left vague, since it would repersent any number of things. The song would work equally well weather the man in question was a minority, homosexual, was goth, or just didn't like the same things as everyone else. I think it's a moving song about how alienated some people can feel because they aren't accepted for one reason or another, which is something I think everyone can relate.\r\nAnd try to keep in mind, everything I say is my opinion. I just don't wanna keep typing that it's such. :P\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI haven't followed the entire conversation, but personally, I've always felt that Unforgiven was about a guy raised in a strict, conformist area, where being different was considered wrong, but continues fighting on(\"Deprived of all his thoughts...The young man struggles on and on he's known\"). He finally gives up, appearing to conform, but still doesn't want to(A vow unto his own...That never from this day...His will they'll take away).\r\nLater on, after trying to make a mark in a world saturated by normalicy(What I've felt...What I've known...Never shined through in what I've shown), and many years, he finally gives up even trying(He's battled constantly...This fight he cannot win...A tired man they see no longer cares).\r\nThe songs' chorus essentially sets the tone of it:\r\n\"You labeled me\r\nI'll label you\r\nSo I dub thee Unforgiven\"\r\nWhich is that they called him different, so he refuses to forgive them, not for the conformity, but for the lack of tolerance.\r\nI think how he's different is purposely left vague, since it would repersent any number of things. The song would work equally well weather the man in question was a minority, homosexual, was goth, or just didn't like the same things as everyone else. I think it's a moving song about how alienated some people can feel because they aren't accepted for one reason or another, which is something I think everyone can relate.\r\nAnd try to keep in mind, everything I say is my opinion. I just don't wanna keep typing that it's such. :P\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nIgtenio.. you nailed it -_-V (imho)\n\r\nAnd that conclude that this song is about James, dosen't it? Maybe thats what he think would have happend if he never have gotten to make music. \n\r\nyeah, I know.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis song changed my life \"Never from this day/ His will thy'll take away\"...\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nthis song is about whatever it means toYOU!!! every great song such as this 1 has multiple meaning and the artist will make it sound like it has many meanings. this song could be about society, or about a boy or its something dif, thier all right\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nwell, its about a boy who is forced to think a certain way by society.  I think everybody pretty much nailed it (Except that guy who said abortion, wow, he missed the boat :/) \n\r\n** 1 other thing: Orgasm said : \"He feels he's unforgiven because he can't find....\"\n\r\nWRONG!!!!\n\r\nhe's not Unforgiven!\r\nThats a mistake!!!\n\r\nSociety is the Unforgiven!! (or your family, or religion, or watever interpretation you came up with).  He is saying since he was labelled, he will label the world (or those who try to control him) \"so i dub thee the Unforgiven\".\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nIt's songs like this that make me hate people who don't like Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nhow do songs like this make u hate ppl that dont like metallica...that to me makes no sense\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis is my favorite Metallica song! There's something about it that makes me want to listen to it over and over...\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThis song has one of my most favourite lyrics ever:\n\r\n\"What I've felt \r\nWhat I've known \r\nNever shined through in what I've shown.\"\n\r\nIt's like...his life is so unique, this guy is talented, this guy is emotional, this guy has the ability to do things, but by being held back he's never been able to express himself.  His life is wasted.....what's he's felt and known has never shined through in what he has actually done.  That lyric really fucking hurts, and I pray that one day I won't feel that way.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nListen to anyone out there who lived like the boy in this song, if you were forced to play by the rules, then you gotta learn - you are your own person, fuck their rule, live by your own rule. Just shove 2 fingers in their face. \n\r\nAnyhow, I heard this is the story of Hetfield as a boy being raised by his parents. \n\npaulbrowneart.co.uk\n\n\n", "comment_44": "\nDont let people run over you and dont ever play by anyone else's rule book! You are your own person and should not let anyone screw you over!!\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nthis songs awsum if it wasnt 4 this song and nothing else matters i wouldnt of got through my ruff time so easy\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThis song is so powerful i love it , i think this song can apply and move anyone whos having a hard time\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nThis was the first track by Metallica I had ever heard.  I didn't even know who they were until I was 15 years old.  I can remember thinking that at first I was hearing a sitar(little did I know that it was the awesome slashing of Mr. Hammett).  Over the years I grew a little ways apart from Metallica, finding other bands and not wanting to get too entrenched with just one.  But, over the years this one song stayed witrh me.  The best way to describe it is so:  My friend who I've been close to for over a year and a half moved to the East Coast.  I ended up emotionally distraught, for I knew that it would be a  long time before I was able to see her again.  It didn't help matters out that I was and still am in love with her.  I couldn't cry, talk about it, or anything; I was just numb.  One night at a very good friends' house, I had partaken in smoking some very high-quality \"product\".......As I sat there, this song started playing on my friends' computer.  All at once everything inside myself broke, so I sat crying a river while the song played on.  I felt like the song was speaking to me, letting me know that I was not alone, and somewhere in the world there was a person who felt the exact same way I did.........I may not be the biggest Metallica fan in the world, but I will always hold this song close to my heart..........\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nanother great metallica song.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\ntoo me personally this song is about a person who tries to be everything that they can be and no matter what they do, how hard they try they are still never good enough so they give up....its like me..your try hard to impress but the harder you try and the more you do, they just want more and more and more....\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nJust like lefttorot, this was the first song I heard by Metallica. The first time i heard this song (age 14) i was so emotinally attached to it. Althogh it isn't the best Metallica song, it WILL always be my favorite. If it was not for Metallica and this song i wouldn't be the man I am today.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nThis was, like 1/2 step and lefttorot, the very first Metallica song I had heard, or bothered to listen to.  I made a CD, when I was 12, at my friend's house, and he kept bugging me, and telling me to put this song on.  So I did, and a few weeks later, I finally listened to it.  It is by far one of the best songs on Black Album, and I only now realize that it can mean something to anyone.  Whatever struggles you can find yourself with, this song is it.  A truly kickass song, by a truly godly band.  Thank you Metallica.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nin an interview james says that this song is about the relationship with his parents, so i believe that the \"unforgiven\" are his parents, and the church of scientology. the solo in this song is freakin awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nWhat does the following mean?,please explain :\"You labeled me  \r\nI'll label you\"\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nIT'S OBVIOUSLY THAT THIS SONG IS ABOUT JAMES HETFIELD CHILDHOOD.HE THOUGHT DIFFERENT FROM THE REST AND WAS LABELED.SO HE WOULD LABEL THE WORLD TOO.HE WAS DIFFERENT.AND NOBODY WANTS DIFFERENT PEOPLE.I THINK,A BOY THAT SUFFERED SO MUCH.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nThe video is the best!  I regret to say I have yet to see this band in concert.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nthis is beautiful metallica song and i love it\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nthis is beautiful metallica song and i love it\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThis is in my opinion the best metallica song...just because it has much sentimental value to me...\r\nits about someone who is never good enough..they are a reject from society...the only reason i know this is because im the person.....\r\nlike in the video he has the key in his hand but he doesent want to fix the problem, he dont want to escape...thats so typical in todays world....\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis is a song about a troubled childhood, but very specifically james hetfield's own childhood, and possibly his upringing in a family that practiced the Christian Science methods (i aint sure what the are, im catholic).\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nEasily my favourite song on the Black album.  I believe that it's about a boy who never rebelled, broke rules or showed who he really was cuz of the fear of the consequences and now is near death and regretting it\n\r\nThere is also a really cool music video of this song which has footage from the Batman cartoon movie, Batman: Mask of the Phantasm.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nI think this song is about a young man who grew up trying to appease society (ex fitting in or pleasing others) throughout his entire life, but it was never good enough. Now he is an old man, and he wishes he didnt waste his life.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nThis might be the first song I heard and it introduced me to the whole metal and rock world, to the whole musical world. What can I say, the lyrics have always been and will always stay a mystery, sometimes I think it might have some religious meaning, maybe i'm just mistaken. I know that the video is very confusing but still very touching, I've been listening to Unforgiven for about 6 years now, and still I listen to it in my car now.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nAfter reading so many meaning, I have started to believe that they are correct, but has anybody even considered this angle? When he says \"New blood joins this earth\" I first thought the child was being beaten. His blood joins the earth or falls to the ground. Doesnt make as much sense, but its something to think about. Also, can anybody explain these two lines to me? \r\n\"With time the child draws in\r\nThis whipping boy done wrong\"\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nTo me, this song could be meant as a nazi-german song. It's like a kid brought up with nazi influence though he knows that its a lost cause. He's forced to conform into just another nazi soldier.\n\r\nPS, i know its not really the song meaning, just a way of looking at it.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nby far my favourite metallica song. love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nGot my hands on a video for this song with the old animated batman clips. Kinda makes me think that this song could well be about bruce wayne / batman!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nBy mindlessly conforming and trying for a whole lifetime just to please people you never get a chance to be what you could have been had you thought freely. Just imagine what lives we would be living and what potential people would reach if outright intolerance of freethought didn't exist. Ultimately, those who want you follow their rules have real purposes of arrant manipulation. I wish more people would listen to this song and take in it's message.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI also think this song may have something to do with Jason because its well known that the guys gave him a really hard time when he joined the band, and that he has kind of been the whipping boy every since.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nI feel this song is about oppression. A child or person coming into this world. From a very younge age this child knew he was diffrent and he learns the surrounding arnt welcoming to him because of either the way he works or conducts himself. \n\r\n\"With time the child draws in, This whipping boy done wrong, Deprived of all his thoughts, The young man struggles on and on he's known, A vow unto his own, That never from this day, His will they'll take away\"\n\r\nThis is when he realizes he cannot beat them and has to lay down for the moment, But they still see he isnt giving up and he makes a vow to himself that he will never let them defete him.\n\r\n\"They dedicate their lives, To running all of his, He tries to please them all, This bitter man he is, Throughout his life the same, He's battled constantly, This fight he cannot win, A tired man they see no longer cares, The old man then prepares, To die regretfully\r\nThat old man here is me\"\n\r\nThis is where he learns that he waasnt the first to be born like this and that there was other before him and that they have designed the system to oppress people just like him. So he begins to conform to them but is not happy about it \"this bitter man he is\" And altho he pleases them he holds his battle secretly but he cannot ever overcome them and ends up giving in. And they see that he has given in and doesnt care anymore. \"A tired man they see no longer cares\" And with the next lines \"The old man then prepares, To die regretfully\" He realizes that he went back on his word and gave in. He promised himself that he wouldnt and yet he failed to keep that promise so he prepares to meet his death \"regretfully\" because he didnt acomplish what he promised he would.\n\r\n\" What I've felt, What I've known, Never shined through in what I've shown, Never free, Never me, So I dub thee unforgiven\"\n\r\nThis is him explaining that he never practised what he ment to \"never shined though in what i've shown\" And  \"never free, never me, so I dub thee unforgiven\" Is where he finally talks about how he is trapped but also he gave up and he shall never forgive himself or the other that did this too him.\n\r\nThis song is probably one of my favorites and this is what I got out of it... My interpretation has a strong connection to my personally feelings of my life and when im down i find my self listening to this song alot.. if not repetetedly.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI LOVE THIS SONG BECAUSE I CAN RELATE TO IT.\r\nI WAS BORN IN THIS CRUEL WORLD WITH A CHILDHOOD FULL OF PAIN AND AND NOW THAT I'M OLDER INSTEAD OF REBELLING AGAINST MY SOCALLED FAMILY I TRY TO PLEASE THEM AND THATS WHY I AM UNHAPPY AND BITTER.\n\r\n  STORY OF MY LIFE.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nFor starters, I agree with mystifiedpoet. I LIKE BEANS needs to seriously grow up. You're entitled to your opinion, just as everyone else is. I haven't read a single post of yours that isn't having a crack at someone for having an opinion. it back and take notice of someone else's opinion, you may learn something.\n\r\nI think it is about a boy who has been under pressure from society's morals and values. The old adage of \"Children should be seen and not heard.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nIn response to betabob2000, it could also relate to your abuse theory. \n\r\n\"With time the child draws in\r\nThis whipping boy done wrong\"\n\r\nAbused poeple tend to withdraw from friends and family and avoid social situations. Whipping boy could mean that if his father has had a bad day or is drunk, whatever, The Unforgiven is beaten for no reason.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nIts talking about someone running someones life and making the person misserable... u can just tell from \"they dedicate their lives, to running all of his, he trys to please them all, this bitter man he is...\" you just have to think ppl\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nIf any of you have ever studied world religions, or are Hindu, the \"unforgiven\" may remind you of the group called \"the untouchables\" in the caste system.\n\r\nThis is a group of low class people that do all of the jobs that higher class people don't want to do.\n\r\nMetallica inspired by the Hindu religion? You never know... it could happen.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nThe most Underated songs in the world i rekon, This song is sooooo freakin awsome. I mean all this \"good charlotte\" shit nowdays, i mean they couldnt make a song half as good as this. I LIKE BEANS is gay\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\ni understand what this song and unforgiven 2 means, but i don't understand how they relate to each other. in the first one doesn't the guy die? i don't understand how the second one is about him if he dies in the first one.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nthis is about living your own life, living it your way! other people were leading his life, and in the end, he's sick of it all, and so 'the old man then prepares to die regretfully', because he didn't live it his way! that's just my opinion...\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nin response to jvs24, in the first one, perhaps he dies spiritually and emotionally, but in the second one when he comes to terms with his emotions, he is revived.  You can always look at it that way.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nIt's about my life......\n\r\nBasically lived in an overprotective environment and constantly dragged onto the straight and narrow..\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nits definitely about someones life... \"new blood joins the earth\" up to... \"The old man then prepares\r\nTo die regretfully\"...he didn't have a good life, trying to please everyone but himself he led himself a bitter/boring/depressing life...he was probably like this because the people around him made him this way....made him follow their own rules, whipped him, and took away his will...w/o free will...what exactly is left???\n\r\nI like how the chorus is in a different perspective than the other parts of the song...the chorus is in first person saying how that boy and that bitter man are him...but the other part his descring the boy and the man...I just think the beat and lyrics are awesome\n\r\nmy favorite part is \"You labeled me, I'll label you, So I dub the Unforgiven\"...its a great part...\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nYeah, I think it is about James and his relationship with his father. I think that he didn't feel accepted by his father and I think that he was criticized by his father and he felt anger towards him for it. So he lableled his fathe unforgivin as he felt labeled as not good enough no matter what he did to please him. That makes perfect sense to me. I think the turnaround for the song is at the point where it says Throughtout his life the same. That means to me that he harbored those feelings into adulthood and that he felt that no one ever realy appreciated anything that he did no matter how hard he tried. He might even still feel that way even though millions of people love his music, because he never had the satisfaction of hearing it from the person who mattered to him the most.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nI think that this song is about a depressed guy(or chick) but to me it sounds more like a guy who hates the world.  He has tried living in their world but has now given up and isolated himself from the rest of society and he is now waiting to die.  Suicide may even be a theme\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\ndoes any 1 know what \"dub thee unforgiven\" means?\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\ndub thee unforgiven- Its giving the title unforgiven to someone\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThis song is about colonial slavery.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nOk... The Unforgiven was the first song ie ver heard by Metallica. Its one of the best ones they have... actually the reason i got into metallica was that song.\n\r\nLook at the lyrics \r\n\"New blood joins this earth\"\n\r\nAnother child was born.. but not only that.. think about how a child is a child and its only important to so many people before its just another person.\n\r\n\"Through constant pained disgrace,\r\nThe young boy learns their rules\"\n\r\nThats about how whatever way you disapline a child.. however you teach them to be.. it scars them. W/e you do to a child, leaves a mark in his or her life. So when they get older, the scars show by the way they act... for example: If a child is disaplined and abused as a child, it will act abnormal when its older, maybe not get along with the rest of society...\r\n\"With time the child draws in\r\nThis whipping boy done wrong\r\nDeprived of all his thoughts\r\nThe young man struggles on and on he's known\r\nA vow unto his own\r\nThat never from this day\r\nHis will they'll take away\"\n\r\nThats about how he never had his own choices. He was always told what to do and never had his own rights.\n\r\n\"What I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\r\nNever be\r\nNever see\r\nWon't see what might have been\"\n\r\nOk, now the chorus.. the first three lines are about how he wasnt aloud to show his feelings or thoughts. He was tought to keep quiet and not speak out of mind. And whenever he did, he would be ignored. The last three, are about how he could have done somthing the world would have wanted. Like solving the cure for aids, or cancer.. or somthing in that general area.\n\r\n\"They dedicate their lives\r\nTo running all of his\r\nHe tries to please them all\r\nThis bitter man he is.\"\n\r\nTheres more children like him, suffering. Though the king or leader, or overseer, whoever's in charge, tries to please them by doing somthing cheap or somthing that isnt well worth the time. He's bitter because he wont give up much to make them happy.\n\r\n\"Throughout his life the same\r\nHe's battled constantly\r\nThis fight he cannot win\r\nA tired man they see no longer cares\"\n\r\nHe tries and he tries but he never gets it... what the people want.. what will make them happy. He doesnt care anymore because he cant find an easy way out...\n\r\n\"You labeled me\r\nI'll label you\r\nSo I dub the unforgiven\"\n\r\nThey made him an \"other\" as a child. The unforgiven is the man who tought them wrongly... he was never forgiven for what he did.\r\nHe says \r\n\"You labeled me\r\nI'll label you\"\r\nBecause when he was treated an \"other\" he was named the \"other\".\n\r\nAnd also.. listen to the music itself.. its depressing and full of sorrow. But somtimes.. during the song... it will show signs of anger. For example when he says \r\n\"This Bitter Man He Is\"\n\n\r\nI May Be Wrong With All Of This.. But Thats What I Think..\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nthe main riff in this song is simillar to the intro of Children Of The Damned by Iron Maiden\r\none of metallica's best songs (lyrically and musically)\r\nhammet is god on a 6-string!\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nBasically I'm going to have to just agree with all of those who said it's about society, and others trying to control you (in every way).\n\r\nI guess I see it as parents telling their children what to do, how to dress, act, etc., but on a much bigger scale, society is a better way to think of it. Society labeling you, and telling you how to live and think, instead of how you want to live and think.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nCripes, this song as well as II gives me goosebumps every time I listen to it. \t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\none of their best songs. i love it...metallica you rock our socks !\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nit's about a child who was neglected by his family and made to do everything for everyone, and they don't care about how it makes him feel. constantly pushed around and picked on simply because he was there, everything he does makes no differance in how he's treated no matter how good he tries to be. now that he's older he does'nt care about anything, he's so damaged he's become withdrawn and feels he can't live in a world that's been so cruel to him. \r\n \"you labeled me,\r\n  i'll label you,\r\n  so i dub thee unforgiven\"\r\nmaybe it's part of a suicide note blaming everyone, possibly his first and only strike against his family. i think he wants everyone to live with the guilt of pushing him to this point, and to live with the fact that everyone knows what they did to him.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nthis is about my life..its exactly wat is happening to me specialy the part of:\n\r\nWhat I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\r\nNever free\r\nNever me\r\nSo I dub thee unforgiven\n\r\nmy girlfriend left me because she thought i didnt luv her and it was the other way around. i luved her so much that i was very nervous with her. now i am isolated and i feel pitty for myself\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\ni used to feel like the song. it's about a person, who throughout all his life he just \"couldn't get it right\". and how he died bitterly and alone. that's how i thought i was going to turn out, but i had a big change in my life.\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nyea i find that it's like some1 who will never measure up 2 the norm or the incrowd, i could relate to it but i remember those days when i could.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nOK. I think this song pretty much applies to most of us. I've read many of the threads here and such conjecture seems apparent. This album came out when I was in high school. I never gave it much thought then. Years later, my wife played the song and said it was about me! I guess many of us have been through a traumatic childhood that would reflect this songs lyrics. Yes, I'd say it applies to me also. Though my life is much different now and I control what I do and so on, back then it was pretty much as the song illustrates. It is a very emotional song for those who can relate to it, and in that sense, it will remain an epitaph to present and future generations. This, I feel is a homage to heavy metal in general as it reflects a socioligal need for the 'individual' to relate to to the constant angst of our times. The mainstream of music that remains an itch I can't reach, plasticates life and all its complexities. Long live metal! I lalso like the introduction to this song that reflects Ennio Morrocone's work. (check out 'Extasy of gold')... Carpe Diem!\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThis song is obviously about a boy who, seemingly from birth, is shut out and shot down. No one could care less about what happens to him or how he feels. It turns into a never ending cycle as he continues to grow older and experiance the same situations. He has already had nothing short of a hard childhood, and now he has to experiance even harder situations in his young adult life. He has so many feelings about the way things around him are going, but no one to hear it. As he grows into an older man, the pain is nothing short of unbearable and miserable. Nothing has made him happy, and nothing has ever been good enough. Finally, after all this time, he just doesn't care anymore, and this is the way he will die. Some of you should definately stop reading 2 lines and thinking that you know what these men are trying to say. it takes the complete song, not the first few. Anti-abortion? oh, please.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI think this song is about how religion rules over people.  I started at a Catholic school and I think my anxiety/depression has roots at that damn place.  I agree with whoever it was that said the song has to do with James' childhood.  His mother died from cancer when he was young, she refused to treat it because she had faith that God would help her.  So there is how religion ruled over her.\r\n\"New blood joins this earth, but quickly is subdued\"\r\nObviously another person is born into a religion as soon as he/she exists.\r\n\"Through constant pain disgrace, the young boy learns their rules.\"\r\nThat child immediately is having their life planned out just after birth.\r\nBasically the next stanza explains how his own will is being erased by the preachers and his parents (Deprived of all his thoughts, His will they'll take away).\r\nNow for the chorus...\r\nIt's meaning can be even more controversial than the verses.  I beleive its about how Christians are always saying \"that's a sin\" when nobody knows for sure what God views as a sin.  The boy is struggling to satisfy God but he keeps \"sinning\" no matter how hard he trys.  The kid feels as if God is thinking \"So I dub thee unforgiven\" and that he is doomed for Hell already, regardless of what he does during the rest of his life.  No good deed can save him from Hell.  He is \"never free, never me\" because he is a slave to society/religion.\r\n'They' refers to the preachers, 'His' refers to the main character.\r\n\"They dedicate their lives, to running all of his\"\r\nThe preachers commit their entire lives to unintentionally rule other people's lives.\r\n\"He tries to please them all, this bitter man he is\"\r\nThe aging \"kid\" is still trying to satisfy what different preachers tell him is right and wrong.  And \"he's battled constantly, this fight he cannot win\" kind of says the same thing.  He's getting tired of fighting his conflicting thoughts about what he wants to do versus what he thinks is the right thing.  Then he eventually \"prepares to die regretfully\", meaning that he gave up and feels like he never satisfied God.\r\nOR:\r\nThis might talk about how the Chief Justice of the U.S. is forced to make critical decisions for the country that he doesn't care to make, or that he is too old to care anymore.  I like my other interpretation better because it makes me feel smarter.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nI can't really remember anybody who can mix pain, sorrow, anger and regret in such a brilliant way within a song. Yet a thrilling emotion, both on soft parts and hard parts.\n\r\nIt's quite obvious that James ended up writing this song after the summing of the maltreated days of his own life. Because one could not compose, i believe, such an impressive unit without having something lived. This makes the song sincere and that's why people feel close to this song.\n\r\nBy the way, i've watched The Theatrical Version of The Unforgiven lately. Can anyone get what The Boy and Girl are talking?\n\r\nAs far as I get:\r\nThe Girl: You are in my heart.\r\nThe Boy: And you are in my blood.\n\r\nFinally I think that this song can be better understood by explaining the video in detail because Metallica tells lots of things than thought in the video.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nA Masterpiece. The first \"softer\" Metallica song I ever heard. Very powerful and moving. I think I like it even more than fade to black. Next to \"sandman,\" the best song on the black album.\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nYou are born and you don't know what's in store for you. More accurately, what evilness is ready to ruin your life. Life is full of people who are jealous of your intelligence and spirit and want to break you over and over.  You are subdued by the villains that want to steal your life from you out of competition, they take away your will.  You are under constant pain and mental distress because they won't leave you alone.  You are deprived of all the goodness you were entitled to by God and your destiny.  Only because they've dedicated their lives to running all of your life.  You never get a chance to become who you planned to be and what you wished for your life to be. Your destiny is controlled by their wishes. You're never free and never yourself.  This is the rule of your life and become a bitter person complainig about all the things they make wrong in your life.  You're battled constantly and you realize you can't win because they overpower you with their evilness, these villains.  Finally you give up because you can't fight them anymore and ignore all the roadblocks they create for you on a daily basis.  You become tired of complaining and fighting. You want to forget doing anything with your life because you are not allowed to have the success you dreamed of. Their jealousy determines your level of success and you can't do anything about it. They want to hammer it in that you are destined to be inferior to them. Just knowing inside that you are better than them doesn't do any good. You know that they made their lives from your ideas and goals, but won't let you accomplish it.  They want to keep a level of inequality so they can boast they are better and label me as inferior. What I've felt and known cannot be refelctive of my life. I will just be a good-for nothing and that'll satisfy them. I can't forgive them for ruining my life and doing things behind my back. I will just prepare to die and wait for the day when everyone will be judged for their actions. This world is for evil anyway so I'll learn to live by their rules for my life. I dub them unforgiven, absolutely.\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nThere's no need to tell me that this song is about your life.  Everyone happens to be going through the same shit, myself included.  \n\r\n\"What I've felt, what I've known\r\nNever shined through in what I've shown\r\nNever free\r\nNever me\"\n\r\nThat's me, man.  It's like I've wasted so much time trying to satisfy my elders and mainstreamers rather than following MY heart.  What if every human being could just create their own reality and do whatever the fuck they want.  Freedom could be more free.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\n\"u label me, i label u\", i always thought it was \"u level me, i level u\", it kinda sounded better to wat I originally thought but this one sounds a little more topic related\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nacculyricist07 . I hope the whole opinion above completely belongs to you. If so you are an impressive critic I've ever met on this song. Really got to the bones of it. It is further than a critic. It is a brilliant compositon. Thank you very much.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nim not sure but is this song anything 2 do with the film unforgiven? thats about a tired, old, bitter man  whos forced to battle his whole life in a battle he cant win. and wen he says \"What I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\" tht also links with the film how hes forced 2 b a cold killer and has 2 push down wht he feels, his guilt and regret\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nNot sure why but when i first started getting into Metallica way back when this was my favorite song of theirs for a while but now when i listen to it i honestly have no idea why.  I mean it's an ok song but really not that good.\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nforgot to mention that its way better than The Unforgiven II\n\r\nand i somehow managed to forget to include the meaning of the song while posting on SongMEANINGs.net.  No clue how the hell i pulled that off but anyways to me it sounds like the song is about a troubled kid that doesn't fit in and tries to make everyone happy but it doesnt work.  Kind of reminds me of the 2 Columbine shooter kids but obviously the song has nothing to do with them because it was written before the Columbine shooting, when they were like 10.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nPure poetry!\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nvery sad song. kinda a dedication 2 kids that were bullied in school if u look at it that way.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nI've read that this song was inspired by the book \"Anthem\" by Ayn Rand but I think it somehow refers to George Orwell's \"1984\" too. The \"young boy\" who becomes old and \"no longer cares\" reminds me of Winston being unhappy with the life he was force to live and trying to break the rules but being ultimately unable to do so as he becomes broken and uncapable of thinking with his own head, brainwashed, \"a tired man they see no longer cares\"\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nwow, a 1984 reference, dont get many of those too often hehe. I never though of it that way, good point marquez :)\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nActually the meaning of the song is very obvious.  The song is not talking about any specific person.  It is talking about all of us who are born to this earth:\n\r\n\"New blood joins this earth\"\r\nA new child is born and with it comes the possibility of fresh ideas and new meaning.  How many of us have dreamed when we were children of being astronauts? Or discovering a new land? Or inventing a new machine? How many of us actually did it?\n\r\n\"And quickly he's subdued\r\nThrough constant pained disgrace\r\nThe young boy learns their rules\"\r\nHowever for most of us these potentials are never reached as the weight of the world bares down upon us and soon we are so caught up in the mediacraty of life living for the moment and not living to our full potential.\n\r\n\"With time the child draws in\r\nThis whipping boy done wrong\r\nDeprived of all his thoughts\"\r\nAny new thoughts and ideas are ridiculed and treated with distain by our peers until, in our need to fit in, we abandon the ideals of self and embraces the ideals of group.\n\r\n\"The young man struggles on and on he's known\r\nA vow unto his own\r\nThat never from this day\r\nHis will they'll take away\"\r\nBut even as this happens most of us vow to ourselves that one day we will break away, that they will never take away our independence of thought... that we will be our own person... our own boss.  How many of us actually succeed in doing this?\n\r\n\"What I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\r\nNever be\r\nNever see\r\nWon't see what might have been\"\r\nThis is a lament of regret.  All of my ambitions, all of the things I have felt and known, I never had the courage to show them through my actions.  This the lament of an old man.\n\r\n\"Never free\r\nNever me\r\nSo I dub thee unforgiven\"\r\nI have lost my identity, I have lost myself in the sea of everyday life.  I am a failure unto myself... and so are you... so you are unforgiven because like me you have commited the sin of failing yourself throughout your life, and for being part of the problem.\n\r\n\"They dedicate their lives\r\nTo running all of his\r\nHe tries to please them all\r\nThis bitter man he is\"\r\nWe lack the will to take control of our own lives so others run our lives for us, while at the same time others run their lives for them.  It is so much easier to run someone else's life isn't it? We tries to please them all... we lack the will and are afraid to assert ourselves because these are the people we think we care about... but at the same time we are bitter because we knows what they are doing to us, but we feel there is nothing we can do to change the status quo.\n\r\n\"Throughout his life the same\r\nHe's battled constantly\r\nThis fight he cannot win\r\nA tired man they see no longer cares\r\nThe old man then prepares\r\nTo die regretfully\"\n\r\nAnd throughot our whole life nothing changes.  We battles in futility fighting a battle we cannot win. This song is very dark and perhaps wrong here because we CAN win the battle if we knows what we should be fighting. As things stand we are fighting the wrong enemy, we are fighting the enemy without while the real enemy lives within.  Our insecurties, our fearsour hates, our regrets - all of the things we cannot admit to ourselves are the real problem.  As we grows older it becomes more and more difficult to change that way of thinking. Jaded and old the we no longer care... we have lost. Society has beaten us down and that is the end. A sad end indeed.\n\r\n\"That old man here is me\"\r\nThis can be taken in two ways. Either the writer is saying he is a bitter old man, or he is playing the role of the old man in question.  If it is the latter little needs to be said.  if it is the former then clearly the writer feels hard done by, and that he has failed himself... but he doesn't care anymore.\n\r\n\"You labeled me\r\nI'll label you\r\nSo I dub the unforgiven\"\r\nYou have labeled me a failure because I have failed myself.  So I will return the favour since I am a tired and jaded old man.  I dub thee unforgiven.  This refers to the bestowing a title of nobility... except here it is bestowing a title of failure and imfamy... you are a failure - you have failed yourself, you have failed me... join the ranks of the unforgiven.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nThinking about that line again:\n\r\n\"You labeled me\r\nI'll label you\r\nSo I dub the unforgiven\"\n\r\nAother more compelling conclusion could be reached.  I label you unforgiven because now I am old and tired and now it is my turn to continue the cycle. You are unforgiven because like the original sin you are another part of the whole mess and you cannot escape.  You cannot be forgiven and rise to your potential - just like those before you.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nAmazing song, very easy to relate to like alot of the lyrics on the Black album.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nits a very powerful song about abuse. the corus is awsome. i think that the most powerful part of the song is the solo, in my opinion. either way, this song is amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\n\"What I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\r\nNever be\r\nNever see\r\nWon't see what might have been\"\n\r\nI can relate to that as well, sadly. Great song, maybe one of Metallica's best.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nthsi is a great song it has a sad tune i play it a lot because i'm miserable right now....\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nThe song talks about a country of fascism where people are not allowed even to think. A young man makes a 'vow unto his own' that he will never be taken away his free will, his free thoughts and his will to change the whole fascismic thing. As you can see in the video clip he manages to find a place where he cannot be watched by the government and think freely. However as he grows older and finally becomes old realises that all he has done was in vain because there was no one around him to express his thoughts to, as well as he did not manage to change anything about the system. So, thinking finally that he is one more man beaten by fascism, he dies sadly. Sorry but anything else said is not correct. That's just the message Hetfield wants to express.\n\r\nFUCKING KILLER LYRICS\r\nFUCKING KILLER METALLICA\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nYou are all wrong this song is dedicated to the Memphis Three, who were sentenced to life for murders they didnt commit, they have alibies, but still they are sentenced to life in prison. people think it was because they wore black and loved metal,  metallica was their favorite, the three wrote metallica letters about their situation and metallica wrote this song in their deffense and is trying to free them...do research on metal its a rich but not exactly angelic history\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\ni really think this song talks about the really bad person in someones life.\r\nfor me everyone does have that person or persons that hurt him/her in their lives.\r\ni really love Metallica they don't just rock! they make sense\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nThe Unforgiven warns us of the self-destructing consequences of not learning to say \"fuck 'em.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\n\"A vow unto his own\r\nThat never from this day\r\nHis will they'll take away\"\n\r\nthis more or less sums up the whole theme of the piece. i can't imagine how thrilling and satisfying it must feel to become a rock star who sings such a piece. like anybody these guys must have a 'shit-list' of people they'd piss on if they ever became famous or rich. i sure have mine... before the retribution however theres this song to listen to.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nBEST HARD ROCK SONG OF ALL TIME!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nJames is implying that the \"Unforgiven\" are people who struggle with religion despite \r\nbeing brought up in extremely religious families. These people are under constant pressure \r\nto act, to believe - to surpress the questioning and just accept. He dubs \r\nthe Unforgiven as people who if, and when, they are judged by God, they will not be saved\r\nsince they didnt have the faith required to save them as stated in all the scriptures. Any of \r\nyou who are familliar with Christianity, will understand what I am referring to.\n\r\nWhat I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\n\r\nNever Free\r\nNever Me\n\r\nThis explains the front that the 'unforgiven' have to bear to all the people in their life\r\nto avoid discrimination, and rejection. The Unforgiven are made to believe that they are evil for \r\nnot following the practices; that they are dammed if they dont go to church or say prayers at night. \r\nA part of them wants to believe but rationally, things dont make sense.\n\n\r\nThe verse:\n\r\nThey dedicate their lives\r\nTo running all of his\r\nHe tries to please them all\r\nThis bitter man he is\r\nThroughout his life the same\r\nHe's battled constantly\r\nThis fight he cannot win\r\nA tired man they see no longer cares\r\nThe old man then prepares\r\nTo die regretfully\r\nThat old man here is me\n\n\r\nIs saying that the religious instution has brainwashed his family, and he is the only one who sees it.\r\nHe tries to appease them because he knows that there is no way that he will get them to see\r\nit his way.  This makes him bitter.\n\r\nThe old man experiencing regret from the death bed could be that he didnt get to be himself,\r\nor that he is scared that everything he rejected, just might pose to be true after all...\n\r\nWho knows???\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nThere is also was symbolism in the music video that suggests  this song is referring to religion.  Like the nail in the palm, the kneeling.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nto me this song is about someone who feels that he is never adequate.\n\r\n\"He tries to please them all\r\nThis bitter man he is \r\nThroughout his life the same\r\nHe's battled constantly\r\nThis fight he cannot win\"\n\r\nTo \"please them all\" is of course something that can never be accomplished. You can please everyone else but yourself or you can please yourself but not everone else. It will be a never-ending struggle for nothing.\n\r\n\"And quickly he's subdued\r\nThrough constant pained disgrace\r\nThe young boy learns their rules\" \n\r\nHe has come to feel inadequate because of the way he was raised/through expectations from society and through making the decicions that were expected of him. \n\r\n\"What I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\"\n\r\nHe has done as he has been told to, not what he wanted to. Even though he had a feeling that it was wrong and he knew that what he was doing was not actually what he wanted (tries to please them all) and therefore his true feelings never shone through.\n\r\nSomewhere along the way he vows to himself that he won't wind up where he can see that he is heading. He vows to start making the decicions he wants to.\r\n\"A vow unto his own\" and \"never free(?), never me(!)\"\r\nBut they take away his will to become what he wants to.\r\n\"His will they'll take away\"\n\r\nIn the end he is a bitter man for not fighting hard enough and he dies regretfully. Regretting the life he has led and that he was not able to change to become himself. He \"won't see what might have been\"\n\r\n\"Never be\r\nNever see\"\n\r\nIf you never really \"are\"(live) then you will never really \"see\" (the meaning of life?)\n\r\n\"You labelled me\r\nI label you\"\n\r\nI don't really know what to make of this. But I guess he sees himself as a product that was just labelled as any other product is. Therefore he labels the \"labellers\" that labelled him.\n\r\n\"So i dub thee unforgiven\"\n\r\nWho is the Unforgiven? You tell me! To me it seems like it is either himself for not trying hard enough, his parents for labelling him and making him a product, or society in general, also for making him a product.\n\n\r\nAs with every great song it can have a thousand meanings, but this is my take on it. Hope it sort of makes sense =)\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nI actually know who this song was written about, it was written about a man with HIV named Frank Garrett, he was given the nickname of the Youngerman by Ronnie James Dio (ok I know Ronnie James Dio is not a member of Metallica but young man in Metallica's lyric line is based off Dio's nickname for Frank Garrett).\n\r\nNo Leaf Clover by Metallica, was also written about Frank Garrett\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\na child is beat down by society who want him to conform. he is a free spirit so he refuses. and all he gets in return is more pressure until he withdraws from the mainstream society. he grows old and bitter. until he dies without doing anything to right these wrongs. thus \"to die regretfully\"\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nMetallica is a band I never really paid much attention to since I first started to get into metal music to be honest . .a bit ironic when considering they're the Gods of metal .  . or is that black sabbath...*shruggs*.\r\nAs for this song, I'm truly grateful it was composed by this band, It may not be the song with the fastest guitar riff/solo . . best drumming . .best vocals . . .blah . .but it doens't matter because it has the best meaning to me, and I can relate to it so much that listening to it only makes me even more depressed. lol . .anyways I think all of you have picked out it's brains . .it was good of mecurian is spot the link between orwell's 1984, winston's character representing the child depicted in this song . .\n\r\nHere's my 2 cents, forgive me if I'm regurgitating what everyone else has said. :) But this is a personal interpretation for me so what the heck. why not.\n\r\n\"New blood joins this earth\r\nAnd quickly he's subdued\r\nThrough constant pained disgrace\r\nThe young boy learns their rules\"\r\nYou can either take this literally or figuratively or both.\r\nLiterally symbolising, \"New blood\" represents the birth of another baby into this world. With their first breath of life, they learn that the world that they were born into from their mother's womb, is unwelcoming and allows no room for questions, they come to learn of their place in life and are conquered by the life they are enforced into. The moment they are born, they are slaves to the system, society's norms, religious institutions, laws etc. They lack of a voice since they are denied of having freedom and live a life of restriction.\n\r\n\"With time the child draws in\r\nThis whipping boy done wrong\"\r\nAs he grows in his childhood, his parents manufacture and program his thoughts, so that he knows what is \"right\" and what is \"wrong\" and how you can distinguish between the two. This line hints he underwent some form(s) of child abuse as he was reprimanded for his mistakes by his parents. It's so wrong to inflict abuse upon a child. A child is the most innocent being on this planet, they don't know the ways of good and evil, and the parents using abuse on a child is sending out the wrong message to him. Those people who say your childhood doesn't affect your adulthood need to get a reality check because we remember most things from our childhood since we're absorbing as much information as we can, our brains are like sponges when we're young. Once you get fked up in your youth days, you're fked up for the rest of your goddamn life, if you're one of the lucky ones you'll go through redemption and come out of it alive and still with some faith in God.\n\r\n\"Deprived of all his thoughts\r\nThe young man struggles on and on he's known\"\r\nAnyways, the boy isn't allowed to think for himself, since society, media, government, his parents are all inflicting upon him ideas of what a good person should be, what it means to be a man, what it means to love, how you should behave, how you should believe in God etc . . They feed him all these information yet the ironic thing about all this is that it's not answering ANY of his thoughts or the questions about why is it that life is like this the moment you are brought into this world, and are you cursed from the very start?\r\nAs he continues living and growing up, he continues to suffer and the pain over the years keeps building up.\n\r\n\"A vow unto his own\r\nThat never from this day\r\nHis will they'll take away\"\r\nHe makes a decision of his own at last, that his parents, people, the world, society, religions, nothing but HIMSELF is going to control his world and the decisions he makes.\n\r\n\"What I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\"\r\nHere, the person has matured and is reflecting on his painful and damaging experiences form the past, and how they still continue to haunt his thoughts, and rake his emotions.\n\r\nHe comes to learn through his reflection that the things he was taught as a child, when he was under \"control\" by everything and everyone, his parents, people, the world and God never helped him in the end because he doesn't believe in these ideals he was programmed ot think was the way of life, his actions in life don't convey these beliefs either. \r\nAll this abuse he had inflicted by others just to feed him bullshit he never believes in now and doesn't carry out in his actions at present exemplifies you can never take away some's choice or freedom.\r\nFreedom of:\r\n- speech\r\n- actions\r\n- decisions\r\n- thinking\r\n- choice\n\r\n\"Never be\r\nNever see\r\nWon't see what might have been\"\r\nHere The person is saying they'll never use those ideas/beliefs/dogmas/ things they were taught while being abused as a child as a way to guide himself through life, he'll always be governed by his own thoughts, beliefs, choices in life. & he won't change himself for anyone and he doesn't want to see where his life could lead if lives his life by other people's thoughts and beliefs. I think he'd rather fail/succeed/live/die/hurt/love/fight etc by his own two hands.\n\r\n\"Never free\r\nNever me\r\nSo I dub thee unforgiven\"\r\nThe painful and abusive experiences from his childhood and whilst growing up the things he was taught by his parents and etc will haunt him for the rest of his life. Since they were permanently tattoed into his mind with the most terrible experiences and memories ever.\r\nHe won't be able to be who he is completely until he is free of these burdans and the baggae he carries, which is where the \"Unforgiven\" concept comes in.\r\nBecause he refused to live his life the way others wanted him too, they won't accept him for who he is until he does.\r\nThus he is unforgiven . .just as I.\n\r\n\"They dedicate their lives\r\nTo running all of his\r\nHe tries to please them all\"\r\nHe's basically living his life for everyone else.\n\r\n\"This bitter man he is\r\nThroughout his life the same\"\r\nBecause he's unable to express his freedom, he truns bitter and starts to resent them. This cycle of living is always the same, no room for growth as he's always living by what others have taught him. He can't develop his own psyche, learn from his own mistakes/experiences etc.\n\r\n\"He's battled constantly\r\nThis fight he cannot win\"\r\nHe's tried many times to rebel and defy this \"control\" that the world has over him, It's him against the whole word and he comes to realise it's a losing battle that cannot be won.\n\r\n\"A tired man they see no longer cares\r\nThe old man then prepares\r\nTo die regretfully\r\nThat old man here is me\"\r\nHe's lived most of his life battling the odds and fighting for his freedom, not he's an old man, crippled and coming to the end of his days on this unforgiving planet. \r\nHe's reflecting on his life and what he's achieved and realises that the only thin he's achieved is pleasing others and regrets this because in the course of his lifetime he never got to really do the things he wanted to do in life the WAY HE WANTED TO. \n\r\n\"You labeled me\r\nI'll label you\r\nSo I dub the unforgiven\"\r\nHe feels hatred, anger and resentment and unable to find redemption, for what societym his parents and the world has done to him. & as a result of that instead of learning from this experience and not doing what was done to him as a child o his own child, he does.\r\nI guess it's basically because it's the only thin he's known and has been taught, which is why he does what his perpatrators did to him to others.\n\r\nI find myself crying each time I listen to this song, because it reminds me of how stuffed up this world is and how people can be so cruel . . makes you wonder if theres any hope at all. ..\n\r\nGod Bless everyone.\n\r\nNew blood joins this earth\r\nAnd quickly he's subdued\r\nThrough constant pained disgrace\r\nThe young boy learns their rules\n\r\nWith time the child draws in\r\nThis whipping boy done wrong\r\nDeprived of all his thoughts\r\nThe young man struggles on and on he's known\r\nA vow unto his own\r\nThat never from this day\r\nHis will they'll take away\n\r\nWhat I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\r\nNever be\r\nNever see\r\nWon't see what might have been\n\r\nWhat I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\r\nNever free\r\nNever me\r\nSo I dub thee unforgiven\n\r\nThey dedicate their lives\r\nTo running all of his\r\nHe tries to please them all\r\nThis bitter man he is\r\nThroughout his life the same\r\nHe's battled constantly\r\nThis fight he cannot win\r\nA tired man they see no longer cares\r\nThe old man then prepares\r\nTo die regretfully\r\nThat old man here is me\n\r\nWhat I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\r\nNever be\r\nNever see\r\nWon't see what might have been\n\r\nWhat I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\r\nNever free\r\nNever me\r\nSo I dub thee unforgiven\n\r\nYou labeled me\r\nI'll label you\r\nSo I dub the unforgiven\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\n& I hope everyone can find peace with the demons of their past.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nMetallica is a band I never really paid much attention to since I first started to get into metal music to be honest . .a bit ironic when considering they're the Gods of metal .  . or is that black sabbath...*shruggs*.\r\nAs for this song, I'm truly grateful it was composed by this band, It may not be the song with the fastest guitar riff/solo . . best drumming . .best vocals . . .blah . .but it doens't matter because it has the best meaning to me, and I can relate to it so much that listening to it only makes me even more depressed. lol . .anyways I think all of you have picked out it's brains . .it was good of mecurian (From THE Unforgiven I lyrics) is spot the link between orwell's 1984, winston's character representing the child depicted in this song . .\n\r\nHere's my 2 cents, forgive me if I'm regurgitating what everyone else has said. :) But this is a personal interpretation for me so what the heck. why not.\n\r\n\"New blood joins this earth\r\nAnd quickly he's subdued\r\nThrough constant pained disgrace\r\nThe young boy learns their rules\"\r\nYou can either take this literally or figuratively or both.\r\nLiterally symbolising, \"New blood\" represents the birth of another baby into this world. With their first breath of life, they learn that the world that they were born into from their mother's womb, is unwelcoming and allows no room for questions, they come to learn of their place in life and are conquered by the life they are enforced into. The moment they are born, they are slaves to the system, society's norms, religious institutions, laws etc. They lack of a voice since they are denied of having freedom and live a life of restriction.\n\r\n\"With time the child draws in\r\nThis whipping boy done wrong\"\r\nAs he grows in his childhood, his parents manufacture and program his thoughts, so that he knows what is \"right\" and what is \"wrong\" and how you can distinguish between the two. This line hints he underwent some form(s) of child abuse as he was reprimanded for his mistakes by his parents. It's so wrong to inflict abuse upon a child. A child is the most innocent being on this planet, they don't know the ways of good and evil, and the parents using abuse on a child is sending out the wrong message to him. Those people who say your childhood doesn't affect your adulthood need to get a reality check because we remember most things from our childhood since we're absorbing as much information as we can, our brains are like sponges when we're young. Once you get fked up in your youth days, you're fked up for the rest of your goddamn life, if you're one of the lucky ones you'll go through redemption and come out of it alive and still with some faith in God.\n\r\n\"Deprived of all his thoughts\r\nThe young man struggles on and on he's known\"\r\nAnyways, the boy isn't allowed to think for himself, since society, media, government, his parents are all inflicting upon him ideas of what a good person should be, what it means to be a man, what it means to love, how you should behave, how you should believe in God etc . . They feed him all these information yet the ironic thing about all this is that it's not answering ANY of his thoughts or the questions about why is it that life is like this the moment you are brought into this world, and are you cursed from the very start?\r\nAs he continues living and growing up, he continues to suffer and the pain over the years keeps building up.\n\r\n\"A vow unto his own\r\nThat never from this day\r\nHis will they'll take away\"\r\nHe makes a decision of his own at last, that his parents, people, the world, society, religions, nothing but HIMSELF is going to control his world and the decisions he makes.\n\r\n\"What I've felt\r\nWhat I've known\r\nNever shined through in what I've shown\"\r\nHere, the person has matured and is reflecting on his painful and damaging experiences form the past, and how they still continue to haunt his thoughts, and rake his emotions.\n\r\nHe comes to learn through his reflection that the things he was taught as a child, when he was under \"control\" by everything and everyone, his parents, people, the world and God never helped him in the end because he doesn't believe in these ideals he was programmed ot think was the way of life, his actions in life don't convey these beliefs either. \r\nAll this abuse he had inflicted by others just to feed him bullshit he never believes in now and doesn't carry out in his actions at present exemplifies you can never take away some's choice or freedom.\r\nFreedom of:\r\n- speech\r\n- actions\r\n- decisions\r\n- thinking\r\n- choice\n\r\n\"Never be\r\nNever see\r\nWon't see what might have been\"\r\nHere The person is saying they'll never use those ideas/beliefs/dogmas/ things they were taught while being abused as a child as a way to guide himself through life, he'll always be governed by his own thoughts, beliefs, choices in life. & he won't change himself for anyone and he doesn't want to see where his life could lead if lives his life by other people's thoughts and beliefs. I think he'd rather fail/succeed/live/die/hurt/love/fight etc by his own two hands.\n\r\n\"Never free\r\nNever me\r\nSo I dub thee unforgiven\"\r\nThe painful and abusive experiences from his childhood and whilst growing up the things he was taught by his parents and etc will haunt him for the rest of his life. Since they were permanently tattoed into his mind with the most terrible experiences and memories ever.\r\nHe won't be able to be who he is completely until he is free of these burdans and the baggae he carries, which is where the \"Unforgiven\" concept comes in.\r\nBecause he refused to live his life the way others wanted him too, they won't accept him for who he is until he does.\r\nThus he is unforgiven . .just as I.\n\r\n\"They dedicate their lives\r\nTo running all of his\r\nHe tries to please them all\"\r\nHe's basically living his life for everyone else.\n\r\n\"This bitter man he is\r\nThroughout his life the same\"\r\nBecause he's unable to express his freedom, he truns bitter and starts to resent them. This cycle of living is always the same, no room for growth as he's always living by what others have taught him. He can't develop his own psyche, learn from his own mistakes/experiences etc.\n\r\n\"He's battled constantly\r\nThis fight he cannot win\"\r\nHe's tried many times to rebel and defy this \"control\" that the world has over him, It's him against the whole word and he comes to realise it's a losing battle that cannot be won.\n\r\n\"A tired man they see no longer cares\r\nThe old man then prepares\r\nTo die regretfully\r\nThat old man here is me\"\r\nHe's lived most of his life battling the odds and fighting for his freedom, now he's an old man, crippled and coming to the end of his days on this unforgiving planet. \r\nHe's reflecting on his life and what he's achieved and realises that the only thing he's achieved is pleasing others and regrets this because in the course of his lifetime he never got to really do the things he wanted to do in life the WAY HE WANTED TO. \r\nHe realises heâ\u0080\u0099s achieved NOTHING because he ended up fighting all his life against the world, wasting his time in this losing battle, never really getting to live life at all.\n\n\r\n\"You labelled me\r\nI'll label you\r\nSo I dub the unforgiven\"\r\nHe feels hatred, anger and resentment and unable to find redemption, for what society his parents and the world has done to him. & as a result of that instead of learning from this experience and not doing what was done to him as a child to his own child, he does.\r\nI guess it's basically because it's the only thin he's known and has been taught, which is why he does what his perpetrators did to him to others.\n\r\nI find myself crying each time I listen to this song, because it reminds me of how stuffed up this world is and how people can be so cruel. . makes you wonder if thereâ\u0080\u0099s any hope at all. ..\n\r\nGod Bless everyone & I hope you are able to find peace with the demons of your past.\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nThis is on my list of top favorite Metallica songs, along with the second one. Though I like the first one a lot better than Unforgiven II. \r\nThis song actually describes my life. \r\nAs your born, your put into society and culture. Brainwashed to be what people make you to be. \r\nThis song is an example of this, because the boy goes through life being who everyone else wants him to be, he cannot express his true feeling/talents etc... So eventually, he does not care anymore, and is prepairing to die an old man knowing he wasn't who he wanted to be going through his life. He has fought to be himself, but he cannot suceed. So i think apathy comsumes him. \n\r\nBut that's just what i feel.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nI believe it is about a man's constant battle with a group of people (government, maybe) that are constantly treating him wrong, and no matter what he does they still put him down, then as an old man he regrets it all they don't like him, he doesn't like them, (you labeled me, I label you) And he will not forgive (I dub thee unforgiven) \t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nok why is everonr saying this song is about society and people being treated unfairly?\r\nyes, those lyrics are there, but he says \"this old man here is me\"\r\nthis song is about james hetfields life growing up.\r\n\"so i dub thee unforgiven\" means anyone that has done wrong to him is \"unforgiven\"\r\ntrullt brilliant song, Metallica forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nThe continuation to this song is the unforgiven II, whick is also about james hetfield. its about his current life, and how he has found a partner. he wants to open up to her and share his life with her, but realizes she is just another one of the \"unforgiven\"\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nOMG....this song is one of the best from Metallica!!!! I can really relate to this song! In the past few years, I've noticed the world's cruel way of controlling everyone and how everyone has to conform to the world's beliefs. I try to stand out more and do my own thing, but my parents and some other family members make it hard b/c they want me to blend in and like the stuff other people my age r into. They don't want me to stand out from other people b/c they think it is bad or dangerous or something. I say screw them all and let me be me. Everyone should be free to be themselves!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nthis is an awesome song in every way. the lyrics remind me of how i feel being in the united states shitty navy\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nThis song is about hetfields childhood along the same lines as dyers eve, his parents where very strict and tought him that god was the right way, so even though he knew otherwise he had to live the way his parents wanted him to.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nOne of the most emotional songs I hve ever heard.............Metallica Rocks\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nsimple...the individual is born into this world and lives by the standards.  he pleases everyone around him and doesn't think about himself.  eventually he is so bitter just like the lyrics say.  maybe metallica wanted to go a different direction, but knew the fake fans wouldn't agree with the change.  he is left bitter.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nTHe song of Japmes and his father.\r\nThat is all.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nive been noticing all of james's lyrics are messages to the world. this song in particular speaks of how everyone has misinterpreted his messages/lyrics, of what he knows. james knows something that the world needs to know. basically, our true expression is being supressed, and because of this we can not BE.\n\r\n\"new blood joins this earth, and quickly he's subdued...\" this is a given. the world is such a fucked up place, and with each generation it gets worse. \n\r\n\"the young boy learns their rules\" james looks at the world differently, knowing somethings not right about how we are living. so instead of risking being harmed or looked at crazy, for what he knows, he will do it another way. his lyrics.\n\r\n\"with time the child draws in, this whipping boy done wrong...\" overtime of going by \"their rules\", he gets sucked into our way of living. \n\r\nA whipping boy, in the 1600 and 1700s, was a young boy who was assigned to a young prince and was punished when the prince misbehaved or fell behind in his schooling. -wikipedia\n\r\nthis is how james feels living here, in this \"prison\". this child was \"done wrong\"/ decieved.\n\r\n\"deprived of all his thoughts, the young man struggles on and on, he's known\"... this is a rough one man battle but james will never give up because of what he knows.\n\r\n\"a vow unto his own, that never from this day, his will they'll take away\" at this moment in his life, he promises himself that he will never let the way of the world tkae over his expression.\n\r\n\"what i've felt, what i've known...\" james has tried to get his message out, but it is being misinterpreted. \n\r\n\"never be, never see...\" because his messages are misunderstood, he can never truely BE . \"wont see what might have been\" what james knows could change the world dramatically, but his words are being misinterpreted and he will never get to see the world as it should be had his messages gone through.\n\r\n\"so i dub the unforgiven\" true expression is self honesty. since his messages are not getting through to anyone, james lables this \"the unforgiven\".\n\r\n\"they dedicate their lives, to running all of his\" this whole second verse speaks for itself. \"they\" is the rest of the world. \n\r\n\"he tries to please them all, this bitter man he is\" james is viewed as a succesful person, which pleases everyone (family, friends, fans), but reamins to be unhappy on how his messages are not getting through.\n\r\nthe rest of the lines are bold. they dont need explaining. he's been trying his best to get through to the world but its a losing battle. \n\r\n\"Throughout his life the same, He's battled constantly\r\nThis fight he cannot win, A tired man they see no longer cares\r\nThe old man then prepares, To die regretfully\r\nThat old man here is me\" \n\r\n\"you labled me, i'll lable you\" there will never be honesty in the world if we keep labling each other. how can there be unity when we remain to be divided.\n\r\nwhat is james trying to communicate? desteni.co.za/…\n\n\n", "comment_142": "\nI Cried the first time i heard this song. It speaks to me vividly. I feel that this song is about me. Growing up i just tried to live up to expetations and what my parents wanted me to be and not listening to what i want to be and do. I spend all my time trying to make other people happy and not myself. I spend alot of my time at home doing absolutly nothing because i don't know what to do when im alone. This song has changed my life.\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nI'm in love with this song, and with the whole Unforgiven saga... This one for me it's about a world that cut off the beath to the people, to the character the song is about. He tries to fight against it, but the only thing he gaines it's to spend his life in vain... So he could never forgive the world, and dub it Unforgiven.\r\nIt's just so real and amazing, it gave me inspiration for the new novel I'm writing right now...\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nJames said it was about a guy who doesn't take advantages, and wastes his life, and dubs the rest of the world \"Unforgiven.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nI think that the line:\n\r\nYou labeled me\r\nI'll label you\r\nSo I dub the unforgiven\n\r\nIs about marriage. He said yes, she said yes so he dub the unforgiven.\r\nAbout a person that married someone he doesn't like.\n\r\nBut that's just a guessing, I think it has more to do with not being accepted in society so he'll label them the same way. I dub the unforgiven can mean I sung this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\n@TayfunRaider, I was wondering the same thing myself, so I've cleaned up audio from background sounds, and it is without a doubt only boy's voice, saying \"You're in my heart, and I'm in your blood\".\n\nfilefreak.com/pfiles/3183/…\n\r\nFor those who haven't seen high quality theatrical version, it is available here:\n\nmetallica.com/videoplayer/…\n\n\n", "comment_147": "\nBoy's parents weren't in love, they just had sex for fun which lead to shotgun wedding. Boy was never a desired offspring, no, he was treated by his parents as something bad that turned their lives in unwanted direction, as an obstacle. Instead of growing love he received growing hate, he was always the one to be blamed for their problems, dysfunctional, meaningless, loveless marriage. \n\r\nHis personality was ruthlessly crushed whenever it appeared. Just as in \"Dyers eve\", They've clipped his wings before he learned to fly, and than thrown him out in the cruel world with those open wounds, where wounds got infected, never to heal. His life is suffering cause by endless competition in humiliation between parents and society. \n\r\nHe never had any choice. His parents sealed his faith. By the time he realizes what was done to him, it is already too late. When he enters puberty, he also begins realizing that consequences of what was done to him in early childhood will neverÃ¯Â»Â¿ allow him to be free, to be what he is, to express himself. As he becomes aware of it, he leaves the girl, withdraws, gets bitter, tired and prepares to die regretfully.\n\r\nThe only bright thing in his life is that girl he once knew, and he keeps remembering her as such, keeps on living on memory, knowing that regardless on what his life turned out to be, there is someone truly good out there, despite all the darkness, pain and evil in his life.\n\n\r\nBasically, this is a song that has common with life of every child mentally abused by the parents.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\n   How about Alex jones, he is a \"James\". Sticking his neck out there for all of us, to tell the truth and expose the lies of this screwed up society. Google Prison Planet Tv, and you'll see why we are controlled (knowingly and unknowing) in so many ways, a lifetime of struggling just to go to the damn grocery store without some complex of what other's think of you, how they might label you! I don't blame my parents any more, I grew up, had kids, made my own regrets, but more than not, became a better parent, just as my kids will be better than me....break the chain and move on!\r\n   Irish Origins of Civilization, Michael Tsarion's website explains what happened with the whole religious thing and how and why it was used against us and that it didn't used to be like that. The so-called bible, actually being a book of solar theology, star and sun worship, check it out!\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nMetallica will always be Metallica!\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI think this song is open to the interpretation of each young man that has listened to it. The lyrics are pretty ambiguous. \n\r\nFor me, it hits home on a personal level, like I'm sure it has with many guys. I know what it is like to suffer from a childhood of mental/emotional abuse at the hands of my parents, and to never forgive them for it. While we are young, we are ALL defenseless, and for a parent who is supposed to love their child and nurture them to treat them in such insidious ways, it really makes you wonder about the state of our society. People know that all children are extremely impressionable, and their environment, surroundings etc. are basically the biggest factor in how their child will mentally and emotionally mature and develop. So many people are completely oblivious to this facet of childhood/parenting. If you mention \"child abuse,\" 95% of people automatically think of beating your kid, and nothing else comes to mind. The truth is, there are scars that last forever that do not appear on your skin. \t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nWell as i and any other long time metallica fan can say this is one of many pure power ballards, this one of my favourite songs by tallica, i think it sybolises how people start from pure innocent children then made in to bitter angry adults via the parents and other awful events that happen in life.. just my opinion :)\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nmy 3rd fav song from metallica! my second is master of puppets and my first is nothing else matters.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nwell, this could be a story of child accepted or put into some religion cult, a sect. deprived of all his thoughts - that's casual inside a sect. they make you obbey, if your parents are in the sect you have no chance to avoid being in it as well. and now, he's an old man and he hates life he lived, but he can't think about it all the time, he don't want to be that bitter and full of sorrow for the rest of his life and so he dubs the unforgiven.... that could be, that's my opinion. sorry for my english guys ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nI love this song when the band enters and james starts singing it kicks my ears open.but can somebody explain the music video please.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\n\"New blood joins this earth\r\nAnd quickly he's subdued\"\n\r\nThis boy is born and he's oppressed by his parents. I doubt a child that young could even fathom the externalities of society.\n\r\n\"Through constant pained disgrace\r\nThe young boy learns their rules\"\n\r\nHe learns that he's not supposed to get out of line, or go against the grain. He's not supposed to go against the rules his parents lay down.\n\r\n\"With time the child draws in\r\nThis whipping boy done wrong\"\n\r\nSimilar as the above. He can never do anything right, he's subdued, talked down to, told he fucks everything up.\n\r\nThis is just my thoughts on it. I feel like I can relate, I feel like as soon as I was born I can remember my dad calling me a \"fucking idiot\" among many other things. I get that sense from the song, it was never really about expecting more out of the boy, but more about a power struggle, it was almost anger and resentment towards the boy. \n\r\nThen the rest of the song goes to talk about how he has lived his life, reflecting back.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nHe's a broken man.  He's been fighting all his life to no avail and he doesn't know what has caused this but he feels that \"someone\" hasn't forgiven him.  That is probably himself, but he doesn't seem to take this into account.  Instead he blames others.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nGreat song. I think it is about innocent souls being born and growing up to thing that they have to live up to the world's expectations.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nI think the song is about bein abused as a child and not showing how you felt and still feel. sadness, anger, confusion. some people cover those feelings, which is what i think this is in this case. \"Never be, Never see. Wont see what might have been\" meanin he/she'll never know what it would've been like to be raised with care. \"You labeled me, I label you. So  dub the Unforgiven.\". i think that part is sayin most abusive parents label there kids \"Nothing\" (they do in all cases ive seen.) so he/she labels them unforgiven, never to forgive them for how they treated him/her. \t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nThe Unforgiven 1,2 &3 are the theme of my life since I experience them all I feel I was that boy in the song and I felt as if metelica where watching my life and wrote those songs ...because I really live a real miserable and painful life where every one makes fun of me and humiliate me but I just swallow it and ignore and yet please them all and make every one happy of me ...and for the unforgiven 2 after suffering for years I found a friend who I thought was a true friend but he at the end was the worst of all and he also felt ashamed of our friendship and every one believes am crazy ...so he's unforgiven too  \t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nI like to think of this song being about a god who won't forgive a man.\n\r\nThe boy was born and followed all of the rules of religion and breaks the one unforgivable rule.\r\nHaving a god not forgiving you is the most intense pain a man can experience, there's nothing he can do to redeem himself. He becomes a tired old man because having to constantly fight the oncoming nonstop guilt everyday, and it seems to me that he's mad at the religion and life in general because it took away his will.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nThe first Metallica song heard and I fell in love with it James Hetfield's voice is so silent and beautiful.\r\nI think the lyric 'You lebeled me, I'll lebel you, so I dub the unforgiven' says EVERYTHING about the song... Depression... before you die, you think of what you've done in your life and when you realize that everything was bad... how can you feel?\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nThe more i listen to this song, the more i feel connected to it. \n\r\nI find this song to be about a person blocked from being himself through an opressive society dooming him into submission, his only choice to ponder the meaninglessness of his life. As a final act he brings his story to the world through this song (\"the old man here is me\").\n\r\nObviously, the lyrics leave alot up to interpretation...but that's what this site is for right? :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nOk I am a big metallica fun and I came up with this little story based on the titles of metallica songs. the titles are in capital letters.\n\n\r\nI park my 2*4 and step out, home at last but Iâ\u0080\u0099m in a FRANTC state thinking about my narrow ESCAPE. I get into the house and I drink some of my WHISKEY in a JAR but that doesnâ\u0080\u0099t ease the pain clearly caused by the THORN WITHIN. At this point even i know the only solutions to deal with the STRUGGLE WITHIN. In the SMALL HOURS of the morning I stare into the dark night and see ORION, but now is not the time to think about ASTRONOMY the pain is too much it feels like I'm TRAPPED UNDER ICE yet I cant seem to convince myself that its my fault, betrayed by who i thought was a friend and betrayed by THE JUDAS KISS now I go towards my bed in this old rugged house, how am I supposed to sleep in THE HOUSE THAT JACK BUILT after I shot him between the eyes and left him STONE DEAD FOREVER and at that point it felt like NOTHING ELSE MATTERS. I close my eyes and try to sleep hoping it will all just FADE to BLACK but THE MEMORY REMAINS clear to me that I will always be UNFORGIVEN and it worries me because the things i just did make me wonder AM I EVIL. This cant be I was raised right how did I turn to this BAD SEED I know what I did was wrong but I canâ\u0080\u0099t feel it, itâ\u0080\u0099s like I am on ANESTHESIA.\n\r\nI had lost my mind when I decided it was KILLING TIME, I ran around taking them all out high on drugs I believed I was the INVISIBLE KID and the opponents I took out one by one where DISPOSABLE HEROES. I canâ\u0080\u0099t sleep so I stay up looking at the DIRTY WINDOW and start to think maybe its time I DISAPPEAR because right now I am CREEPING DEATH at any point the cops and feds will be all over looking for me. For so long I looked forward to exerting my revenge but that day seemed to be THE DAY THAT NEVER COMES nothing hurts more than taking the life of your BROTHERS IN ARMS. The pain was too much yet still I feel like the HERO OF THE DAY and I decided not to think about what others thought of me after all to the one who I was revenging I would always be the perfect PRINCE CHARMING her LOVERMAN as was the case when she lived and everyone else called me KING NOTHING. As my nerves began to calm I remember what MAMA SAID about salvation forgiveness trusting in God and THE FOUR HORSEMEN but I will not pray to THE GOD THAT FAILED seeing as he let my loved one die she truly was MY FRIEND OF MISERY so I decide to live the rest of my life with NO REMORSE.\n\r\nKnowing my fate as I step into the bathroom that bottle of CYANIDE seems appealing but I will not give up I will FIGHT FIRE WITH FIRE. Arrested I find myself locked in a SANATARIUM because the cops couldnâ\u0080\u0099t believe any normal person could do what I did. The DEVILS DANCE is what they called it and maybe this is where I would spend the rest of my days on THE FRAYED ENDS OF SANITY. A brilliant mind I donâ\u0080\u0099t deserve to be here but what i did deserves to be punished and that is SAD BUT TRUE. At this rate I donâ\u0080\u0099t think even a priest can PURIFY my soul. I think of to myself POOR TWISTED ME but I decide to not have self pity because when it comes to who killed those men I will always be the ONE. From a motherâ\u0080\u0099s boy RONNIE went on to become a killer and sometimes I would think SO WHAT right until the judge decided i would RIDE the LIGHTENING. I know I am SOME KIND of MONSTER but do I really deserve to die. The judge is not letting me off easy as he proclaims THAT WAS JUST YOUR LIFE and now youâ\u0080\u0099ve reached THE END OF THE LINE. Alone in my cell I think it seems I have become THE OUTLAW TORN thinking about SUICIDE AND REDEMPTION what to do I cant let them kill me oh the STRUGGLE WITHIN talk about THE THING THAT SHOULD NOT BE. After a nights sleep I think maybe its fine after all TO LIVE IS TO DIE what is this THE UNNAMED FEELING maybe its time to TURN THE PAGE. \t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\n    this song is about me and the devil when i was a kid i realize that every lust that i make every sin that i take comes from satan becos satan tempted me very well and untill i become a 30 year old man right now satan always speaks throught my mind and confess his sin to me believe me i got hearing voices of the devil people think im crazy but its true thats y the lyrics said never shine throught what i show never free never me so i dub the unforgiven cos satan cannot return my original existence becos he always control my mind and my thoughts\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nI'd like to say I really like this song before I dive into my super negative interpretation of this song. The lyrics are so meaningful. I love how Hetfield growls when the song's about anger and injustice, and then how it becomes so tender and melodious when the song's about despair or love. The guitar makes this song even more wonderful. \n\r\n\"Unforgiven\" is about damnation. According to Christianity, God forgave people their sins by giving us salvation through the sacrifice and resurrection of his son, Jesus. If not for God's forgiveness, people everywhere would all be damned to hell because we all sin and our sin would stain the spotless and perfect heaven. \"So I dub thee unforgiven\" is a reference to religion, and means that the man is dubbed as damned. \n\r\nThe man is condemned because he spent his childhood slaving after abusive people. Instead of appreciating his obedience, they took advantage of it, making him bleed (\"New blood joins the earth...\") and stripping him his will, thoughts, freedom, and individuality. His need to please to escape pain prevented him from breaking free and experiencing happiness. He pleases his abusers grudgingly (Never shined through in what I've shown). By pleasing harsh conformity, he never knows the freedom to be individual and happy for himself. (Never free/ Never me) (You labeled me/ I'll label you)\n\r\nHe becomes \"this bitter man he is\" because he bitterly regrets that he never opposed his oppressors who exploited his passiveness and stole away his freedom of being his own person.\n\r\nHe never felt the happiness of possessing that freedom. He can't forgive himself because of the bitterness and self-loathing for not fighting back. There is no happiness in hell, of course. When the man was a boy, he knew no joy, and as a man he still doesn't know much about joy.\n\r\nIt's a very sad song. It's true you can go deeper than what's on the surface and see this song as a long metaphor about the misery of current society, but I'd rather not do that. \t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nGod Metallica are amazing! Yes, I'm a newbie to this great band - only discovered them recently. At first, I didn't see what was so great about them...but then I really LISTENED to them and now I love them! Amazing band! I can't believe Lamb Of God was supporting them in concert - in my opinion they play very different music, though they are both metal. But what is 'metal' really? Is it chromatic chords? Distortion on guitars? Guitar solos? Screaming? A lot of bands include all these things in their music and aren't considered 'metal'. Meh. Whatever. The bottom line is METALLICA ROCKS!\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nTo me, this song describes a process that the psychotherapist Carl Rogers describes as developing an \"ideal self\" rather than a \"real self.\" The ideal self (false self) develops due to conditions placed on individuals by society that are contrary to natural personality development. The person's response is also like learned helplessness ... hopelessness and in this care - bitterness. I think this process can be seen in cults, some religions, and when children have disabilities and don't fit in at school. Pretty much anytime a person is expected to conform to something that does not accomodate natrual preferences and tendencies.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nThis is one of my favorite songs because it has changed my life so much. I think the meaning of the song is there this boy, and his father and everyone else is rich and snobby, but he just wants to live a normal life (what i've felt, what i've known; never shined through in what i've shown) That sentence is my entire life's story.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\n\"What I've felt, What I've known. Never shined through in what I've shown\"\n\n\n", "comment_170": "\nI think this is about everyone expecting EVERYTHING out of others, and, if they disobeyed, they felt like a disgrace, thus making them never disobey. That made them robots, essentially, only pleasing others, and never thinking about their own needs. That brought them to depression, and they died a miserable and unsatisfying life.\n\r\nI hope that made sense. I'm beyond tired...\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\n   i can almost see the nonconformity thing in there, but this song seems a little to deep and emotional to be the standard, f*@k society heavy rock. plus all the references to trying to please every one and fighting losing battles don't quite fit. my take on unforgivin is this.\r\n   boy starts off life full of naive innocence, thinks he can change the world for the better. people take advantage, and the world is way to messed up for one person to fix alone. young man is getting to be cold and cynical but keeps fighting the good fight out of stubern determination if only because someone has to do it. \r\n   eventually he puts so much time in effort into trying to please every one and fighting loosing battles, that all that's left is a broken empty shell of a human; an old man before his time he longer gives a s*@t, the world has sucked sucked him dry, and beaten him the point where he longer has enough fight in him to bother picking him self up.\r\n   then again maybe I'm just reading my own life story into this; that's the cool thing about truly great art, every one has there own interpretation and it always tells you more about the mind of the observer then it does the creator. that's why i like bands such as tool, perfect circle, and smashing pumpkins; their artists first, musicians second.\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nI just love this song so much I cant get tired of listening to it its amazing, the lyrics, the guitar solo and the music everything about it rocks :)./\n\r\nMetallica Forever\r\n       \\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nThis song is about a battle with himself and the system. The system he fought the people he hated was a struggle but maybe he never had the courage to do what he wanted. He knows the system was stronger but he fought the good fight and he vents about it in this song. He knows he will never be free.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nI can't stand this any longer, reading some people's ridiculous meanings of this song.\n\nThe song is about Hetfield's  childhood abuse at the hands of his father.  That's it.  Over & out............\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nI did a comprehensive analysis of this song on my rock n' roll blog. But the meaning of this song is, loosely speaking, when James Hetfield was young (13 years ) his dad left his family, and three years later his mom died.\n\nHis mom's relatives were busy praying to God, and they never really took her to a doctor. James' mom + relatives were very religious, but God didn't save her at the end, as she died and left James all by himself -- without a mom or dad. \n\nThe song, in stages, explains James struggles in each period of his life. When he was young, he left his Science class because he was told do so by his religious mom and dad. They told James and science wasn't as important as God's powers, so there's no point in learning them. However, this wasn't the case with other kids' parents. So James was the only one who left the Science class, making him an outcast. This was very difficult for him, especially he was still young and trying to learn how to react to what other had to say about his obscure behavior. \n\nThat's just part of the song, there's much much more to it. \n\nBTW if you are interested in reading my full analysis, check out my blog: explorerockmusic.blogspot.com/2013/08/…\n\n\n", "comment_176": "\nAs person is born..He don't have a choice to select his path..The family, school and everything in life is governed by punishment, and force him to choose a path and a way of living. With time the person loose his will and led as how others want him to be. And that hidden feeling inside him, that all what he have seen and known is not true and not what is supposed to be , if he had gone on his own free will, after all, he will never see what would happen if he have chosen his path by his free will.  He is a man that his family and community are preparing him to die regretful..because he didn't live based on his free will and have the feeling that he didn't do all what he really wanted in his own. And so, he won't forgive that for them..as he lived a fake life..chosen by others not by him\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nI've read a couple of the other comments and I didn't see one as close to what I thought about this song so I thought I would add my thoughts. To me, this song is about life. Everyone feels this song on some level because through out life we experience feeling oppressed and repressed. No one fully relates to anyone. To me this song is a contradiction to the saying that man is not an island. The song makes a credible argument that because we all experience reality differently, our curse is that we ARE in fact individual islands. It would be easy  to interpret this song as simply a description of going though life under a perceived oppressor, whether it be God or Government or Society. But I don't think it's any one of those. \"You label me, I'll label you\"  is a perfect example, good, bad, christian, atheist, liberal, conservative. Titles are oppressive, you find yourself trying to fit into a box. And after a lifetime of conforming to the titles, enforced or self imposed, we become bitter and looking forward to death. \"The old man then prepares to die regretfully\". \r\n     On a personal note, this song is beautiful and so is the video. This is not a popular topic and I think it really cuts to the marrow. One of those songs that kind of chokes you up, especially if you've been though stuff in life (and we all have). And maybe that's what they intended to be taken away from this song, the intimately personal understandings that we occasionally have we each other is our solace. To be able to feel on that level is all part of the curse and the blessing of being a cognitive organism.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nJust based on the chorus, I really believe this is someone's final fuck you to everyone before they end their life. Like, the last word and insult...I'm killing myself, and yes, it is your fault, and no, I don't forgive you and now you will have to live forever knowing that. \n\nSelfish and shitty but that's how I see it.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nI know this is probably way off (I only just heard the song today...), but the chorus, in particular, seems rather... well, not happy, per se, but encouraging.\nI see it as, the world can do everything it can to you, take away everything you have, and make you act like another person, but it can't take your mind, your thoughts, from you.\nThis is mainly shown in 'never from this day/His will they'll take away', but the 'I dub thee unforgiven' part rather shows how, after this person has had their freedom taken from them, they're still enough themself to resent the person/people who did this to them, which shows hope that they might recover their life.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nThis song is one of the most beautiful rock songs to ever grace us. This is a story, so if you can't imagine the meaning, I will take you through the meaning now.\n\nThe song opens with a dramatic melody, and allows us to know that this is a sad song, but not why.\n\nWith James's first vocals, we understand that there's a new life to earth. This boy doesn't learn the rules of life like a child with entitlement, but he learns life through punishment. He becomes the whipping boy of his masters. Never is he allowed to think for himself, but to serve.\n\nThen we reach James's beautiful chorus. What this boy has felt, thought, and imagined could have changed everything. All of the amazing things he dreamed were never shown in his actions, which makes this song even more sad, because we all have something more in us that we never show. If you know the history of Metallica, then you understand where the ties to his mother and religion come in(no, I'm an atheist, but that's where HE is coming from.)\n\nNext verse is his true submission. He tries to live up to his masters, thought he doesn't love what he does, and he understands that his calling is out there. He wants to go further in his life, but in his dystopian nightmare, they control his life. Towards the end of his verse, James tells us that this isn't a fictional character, but instead a biographical look into his own life.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nThis song reminded me a lot of myself. In it, a person knows so much about the world, about people. However, they never knew how to convey it correctly. The person knows that he/she could truly make a difference, if they only figured out how to convey their findings and ephiphanies, correctly and effectively.\n\nThe daily, mundane life cycle gets to him so much in the second verse. It's heart wrenching. That verse gives me the motivation to get up and try to make a stance in this life. Having that sort of regret, portrayed in the song, scares me something fierce.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nthis sounds vaguely like references to when Bernard marx and the girl with him visit the savage resort in Brave New World.  he labeled them savage and he never will be free because world state has an electric fence between them.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nin my opinion this song describes my life down to the T. its no matter how much I try to help and please people I still get treated. The lyrics for that are: \" They dedicate their lives, to running all of his. he tries to please them all, this bitter man he is.\"  no matter how much I try to help people or show potential, it never pays off. \"what ive felt, what ive known, never shines through in what ive shown.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nI can relate to this song growing up in one of the worlds oldest monarchies in the world. The old state church was abolished only 15 years ago and you were not allowed to be a religious free-thinker until the year of 1951. Before that you had - during a period of about 100 years - get approval from the State Chuch and the government to join another religious congregation. People fled this country and went to the USA.\n\nThis song got some really great lyrics, it captures the sentiment and doubt growing up in an almost cult-like society that consumes the meaning of life completely away through endless and absurd social control.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nFirstly, this is genuinely a kickass song, secondly, I think this song is about bullying... I mean, I know it sounds stupid but you can see lines like \"he's battled constantly\" might be a metaphor, or mean an actual verbal or physical fight with bullies that he will never win....\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nThis song is probably one of the best songs they wrote despite it being off the Black Album and being slow, but I think that this is a song for all the guys who work so hard for the bosses and still are deemed unworthy by their bosses despite the worker doing all he possibly can.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nI have a couple of thoughts. The lyrics do resemble \"Brave New World\", as well as James Hetfield's relationship with his father growing up. Also, this may be Kirk's best overall solo work. It's not the most complex or difficult, but it's POWERFUL!!!! The intro, which builds up to this crescendo, is just stunning. Overall, one of the best songs in the Metallica catalog.\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nthis song is so me,new blood joins this earth in quickly he subdued,means the united states of america is being controlled by satan,to constant pain disgrace the young boy learn there rules.means,when i was a kid in the philippines i thank god for america for there television entairtenment and shows so i learn there rules,the time the child draws in this whipping boy done wrong,when she is move or going to america he did wrong in his life,deprive of all his thoughts,what im wrong with is when i see the light i accept it to come into my body cos i tot that was the light of god but actually its satan who enters my existence,knows my mind and feelings,the young man struggles on and own his known,means satan knows my mind now,a vow into his own never from this day,a vow means satan reveal the truth that theres a possible way that god wanted to enter my body but satan is jelous cos god wanted to cleanseth and give me the feelings of greatest love,his will they take away means satan destroy the way i am,what i felt what ive known never shine thought what ive shown never free never me so i dub thee unforgiven,means my past feelings and existence is gone he can control my mind,existence and feelings,he make me suffer i was torment he did not want me to pit in all the peoples existence he wants me to be shame of all people so i dub thee unforgiven,they dedicate there lives to running all of his,he wants to give me a feelings and existence diff from all people near in my reality he wants me to think im evil and all people good,what im saying is the devil really knows my mind and he accuse me he arrest all my ego i need to set up straight or he ammused me,he can changes my feelings into immese evilhood\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nIt's his parents he doesn't forgive.  They never let him express his true will, they brainwashed him, beat him, and made him lose his purpose.  His true will never shined through what he'd shown .... he knows there was more to his purpose on this earth and it was robbed from him by his upbringing.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nI believe that in this song, they blame God (which they dub as being \"unforgiven\") for not allowing the free will. Every new life (simply referred to as blood) is just a new pawn in the game it is being thrown at. You cannot express yourself, you cannot be yourself - you're just a resource for this machinery, you're just blood for its life.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nNever meant much to me when I first heard it at release time, but as I hit my mid-40s it's such a powerful song about regret and never trying harder to live up to your potential. Although from a positive point of view you need to catch it early and see what you can do to chaneg things for the better so you don't die later in life with quite so many regrets, a warning if you like to do your best to try hard to live and not just exist as other demand of you.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nTHIS IS THE SECOND MOST EMOTIONAL SONG IVE EVER HEARD, THE FIRST IS LOW MAN'S LYRIC\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nWell ya know...this song is really about anti-abortion.  I mean just listen to it \"New blood joins this earth and quickley he's subdued.\" it means that he was born and then quickley shut out of it all.  Definitly anti-abortion\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nAre all of you brain dead?? James said on gutiar hero metallica that he wrote the unforgiven 1-3 on that he thinks he never will be for given in the eyes of god. Come on its on The damn game.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nThis song speaks about ghost that is Jesus,Amen,James,Devil and someone called Eden at same time the soul that can be at more places at same time (Osiris)separated soul)and its fighting for people on this earth its fighting Zeus(world) like God of war and Zeus represents this world this ghost is fighting him self to preserve peace and to return to his throne but he has two choices to stay trapped in this world to save people(that he created)in this world or to escape this world to be One Either way he cant forgive him self .\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nThe only thing that would make this turd suck more is if it had two other parts....wait a minute...\n\r\nLars Ulrich is a COMPLETE DOUCHE!\n\r\nSad that ALL the talent in this band died on an icy road in 1986.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nThe good thing about art/music is how you see it from your experiences.  Although the songwriter meant something different, you can apply it your way.  Years ago I listened to this song over and over again.  Looking back now, I suffered from depression.  I was self-centered, nobody and nothing could make me happy. Loved my pity-party. BUT NOW, I believe you can have freedom in captivity, we live in a wicked world, everybody, well most are out for their own gain. We will always be limited, by government, family, business, friends or parents or spouses and be honest we do the same.  I found the key to be an overcomer! I am forgiven, free forever.\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nThe long and short of it: don't live your life conforming to what others have labeled you as or you will have regrets.\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nI summarize this song like this :  ( The opening door and the shinning sun Theory )\r\nSometimes a man spends most of his life with PEOPLE who really love him and also would secrifice their all for him , and for some strange unknown reasons that man , most of time , treats them so bad\r\nbut he couldnt feel how wrong he is ,\r\nand when they are gone and when it is too late \r\nhe thinks to hisself ; HOW COULD I BE THAT STUPID !\r\nthe truth was in front of me !! how I didnt see ??\r\nit is like the door was opened in front of him and the light of the sun was there , but he just didnt see the truth ,\r\n(( smart people can see the sun through an closed door ))\n\r\nand also I think it is a song about meaninglessness of life\r\nin the clip\r\nthat bitter man who spent all his life working\r\nthen he ends isolated\r\nwhen he died he he didnt get anything of life\r\neven the key of his imaginary place had fall down ..\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nThe Song is about Rudolf Hess\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nwhoa.... this song's about me\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nummm no wut i said eatrlier is correct but nice tryin orgasm...mine a words right from the artist\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nLOW MANS LYRICS!?? ARE U A GURL!! DEAR GOD!!! BESIDES FROM WUT U SAID IT IS A TERRIBLE SONG NOT EVEN WRITTEN BY THEM!!!! GOD DAMMIT!\t\t\t\t\n\t\t\t\t\n\n"}