{"comment_0": "\nthis song is so powerful. i couldn't stand eminem at first, but his songs are so pure and real.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI am really surprised that you all missed the crucial metaphor in this song.  \"I am whatever you say I am\" is a  clear indication that he is comparing his plight to that of Jesus'.  What he's saying is that he thinks he's going to be crucified for trying to change the world.  The song is a brilliant metaphysical conceit and deserves recognition on that grounds alone.  Finally, it is not fame that Eminem is unhappy with, but really the state of the world.  If anyone tells me to go back to English class, I'll shoot them, because I am an English major.  BTW.  Rainbow, here's the dictionary definition of venting from Webster..  Vent vt. (transative verb)  2 -- To express; let out.  Humans have been able to express things for millenia, so it is certainly a human verb.  Alright, I'm done ranting.  Great song.  For those of you who are dead set against Eminem for being misogynistic, take a closer look at his lyrics.  He is a master of irony.  Irony in the literary sense that is.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI completely agree with thisboy about this song. Eminem is the kind of rapper that can rap about just about anything but his most of his songs have a powerful meaning. My favourite part of this song is:\r\n\"When a dude's gettin bullied and shoots up his school \r\nand they blame it on Marilyn (on Marilyn).. and the heroin \r\nWhere were the parents at? And look where it's at \r\nMiddle America, now it's a tragedy \r\nNow it's so sad to see, an upper class ci-ty \r\nhavin this happenin (this happenin)..\"\r\nThis, like all of his other lyrics, is one of those things that everyone knows but doesn't have the balls to sa in public. I have to tip my hat to Eminem for writing such a real and powerful song and having the balls to put it out.\n\n\n", "comment_3": "\nOh, and you haven't heard about venting? Well now I know why you're such a bitch....\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI am a metal head but i just love the lyrics in this song.  Really deep and you can feel them.  Great job man.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nHoly shit most of these comments are rubbish!!!! I agree with evryone who actualy likes this song and likes this guy for what his music is. Ok im only 15 and i dont have to listen 2 any of his songs on the radio or shit to go out and buy this guys records i go out and buy the albums but no when im in the car going home i dont feel like a rebel coz iv just bought a rappers cd i feel good coz this guys an amazing artist.\r\nHe doesnt whine on, he's simply saying can u leave me alone when im trying to do everyday stuff I dont want to sign autographs when im tryin to feed my daughter or go to the toilet. he doesnt owe his fans anythng we like him because we do.\r\nAs for the person who said his music should be in an adult music store or \"xxx\" what a load of crap!!!! If you want to buy his music u go out and buy it if you dont then you dont. why should his records be seperated from others because some people cant handle a bit of every day bad language. I agree with who ever said you should get out more because you do. You need to live a real life one which involves everyday stuff. Don't live your life thinking everything in the world is all sweet because lets face it it isnt, far from it. There is drugs out there, there is people getting beaten up and killed by others there is all that shit so face it!!!! and stop girning over a few sware words!\r\nthis guy is a role model for any white rapper out there so what let him be that he's basicaly saying yes i can be a role model but if you see me in the street doin normal stuff dont anoy me or pester me.\r\nhe's voicing the opinions of everyother star out there who are to chicken to say it themselves, no one wants fans crouding round them all the time when they are out having a meal and yet because this man voices this you all seem to think he's whining welll think again!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nto all eminem: haters shut up! I like everything eminem did before 50 cent came and I think some of you losers try to work as hard as he did to get famous and you'll see what its' iike having ramdom people come up to you every two minutes of your life asking for autographs and bothering you every chance they get being in the lime light is not easy just try it you no talent hacks! and icp or whateva the hell you call them sucks and d12 would kick their ass anyday so stop livng in the past and move on eminem will always be bette then them\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nit's not eminem's fault he got to be so popular...some might say other bands deserve the respect he gets for being rebellious, and that is definitely true, but that doesnt mean eminem doesnt deserve it.  His becoming famous is just a testament to how good he really is...\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nOk first off, when you get into the music bis or whatever eventually there's a breaking point because the media is so damn annoying. Like for example, even Guns N Roses compares it to a jungle for their song \"Welcome to the Jungle\" I doubt Eminem was paid to write what he writes. I'm sure the companies think his hits are better when he vents in those ways but that's all him and what he's feeling at that time-which is the reason why he (in my opinion) is the best rapper. Not only do his words and rhthym flow well but the way he pauses and starts again in odd places (but well) is aweseome. He wanted to prove that white boys got swag. He's way past prooving now\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThe man's got balls to put a song like this out there.  People can hear it and go \"That's what you get for being famous, you should have known better\".  But it's honest and his flows are just crazy.  I've never heard anyone rap like he does on this song, the pace, the rhymes, the inflections....Eminem's the Lenny Bruce of our generation.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nwoooo!harsh words there from eminem.but still he was honest dudes.............and thats better than being  MR.N'SYNC.though it seems a bit mean and rude but still the man has got a point in those lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI like Eminem alot, and this song has some strong lyrics. Some funny, some true, but he's gotta realize that fame comes at a price. He is whining a little bit. lol\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nHey, irish guy...why do you think he was paid by the music company to say those things??? just asking for some backup on your accusations....\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\neminem's alright but he's not that big and great as he thinks he is. i like a few of his songs and he does have some talent but some of his songs (i'm forced to listen to because of some people that like him) i cant stand. it's like shit you are what you made yourself so stop whining and bitching and for fuck sakes stop grabbing your dick...yes it's still there (or is it that it's just so small he has to keep checking)\r\nhehe ok i'll stop\r\nbut like i said, yeah he's got some talent\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\ni will give credit where it's due... but not here. this song is all very nice and sad and boo hoo isnt life terrible, but it's his fault and you gives a fuck, he's getting more in a month than most of us will ever earn in 5 years. and yes i will say it... you want the fame you have to live with it's consequences. i bet for years he felt so hard done by and now he's actually where he wants to be he doesn't want it. well if all he can do about that is write lame-ass self-pitying songs then he can piss off because there are SO MANY BANDS that deserve to be where he is but can't be becuase assholes like him are poisoning people's minds. in my opinion people like him should be shot. or even better, hows this for irony, if he would like to do that to his wife (as sung in \"kim\") then why doesn't someone do that to him. i'll be the first candidate...\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nEminem's just a tool for the music companies. people think his songs are so deep and meaningful, but there are much more deep and meaningful lyrics out there by bands who nobody hears because they actually ARE rebels and anti society and dont have their videos played on MTV or their faces all over teen magazines. people go out and buy eminem records thinking they're 'soooooo' bad and stuff, but really they're just feeding the machine they say they hate.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nJeez, calm down rainbow...He's venting. We all need to vent occasionally and that's all he's doing. That's all most of his songs are. You need to take another listen to \"Criminal\"...(yes I keep quoting that song). \"Well, shit.. if you believe that then I'll kill you.\" He's not going to actually do any of that...We all have fantasies when we're mad at someone, and his just happened to get put out into the public. \t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI will admit his lyrics aren't deep. But that's not a bad thing. He says what he feels and doesnt try to cover it up with fancy shmancy philosophical crap. No one ever said they were rebellious by buying his cd...I dont know where you got that from. If other bands dont get the recognition they deserve, I dont see how that's linked to Eminem. Don't use him as a scapegoat like the rest of the closedminded public. \t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis is him best song...  But it sucks...  So out of all of Eminems songs, this one sucked the best...\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\npaparoach should have listened more in English class( This is him best song). learn to talk correctly berfore u criticize. \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nROFLMAO AGAIN AS RAINBOW GETS SHOT DOWN EVERY TIME I SEE HIM\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nalright.  true, the lyrics to this song are not pertuicalrly deep.  but few MTV rappers lyrics are (look at DMX... \"I got blood on my hands and theres no remorse, I got blood on my dick cause I fucked a corpse\" I mean what is that shit?).  But anyways the flow in this song is amazing and I think this is totaly eminems best song.  I have seen very few rappers that could flow like eminem (I sit back with this pack of zig zaggs and this bag of this weed that gives me the shit need to be... etc.).  so its probably a good idea to really lisen to this song and aprecate the rap cause its amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI think it's Eminem not just telling the world how is and is going to be, but also making comments. People want to critisize him, but he blatantly points out problems they have that should be addressed first.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ngreat song...I especially liked the danny lohner remix featuring marilyn manson doing backup and playing guitar...and to the guy who didnt know what venting was, you really need to buy a dictionary man\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nrainbow, ur more stupid than i am, venting is a \"human word\" if it wasnt then how could u b using it? just a question, looks like you need to go back to english class, vent is a real word, it actually is a verb, look it up in the dictionary\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is bad ass\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nso ICP dressing up like clowns isnt to get them noticed and get them publicity? take a look at the bands you like before you start calling other bands sell outs, or just shut the fuck up.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nok....i have 2 say..eminem does have a way of flowing his lyrics...but those of u who see him as a role model need 2 be lookin 4 some1 else 2 model your life after. He's a perverted and disgusting man who has some severe issues he need2 2 deal with.. and if he doesn't want his fans 2 be up in his bizzness than he don't need 2 be sharing it with the whole world...all he talks about is he wishes he would die...his wife would die...he would get fired..his fans would leave him alone..if that's what he wants then y don't he just quit and go jump off a bridge? he's selling his music 2 teens who think their being so rebellious but when u look @it....his cds should be in an adult music store...labled xxx...i mean who the hell does he think he is?\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nEminem is damn right on this song...i completely agree with him...and to strokes babe he don't have to prove or give or own a fucking nothing to his fans Is not a toy or whatever like no other famous person is, perhaps the fault is from us who think that just because we buy cd or watch movies or go to games these guy owe us something...maybe we should just let them alone when they're doing the 'normal' things that we do and not jump on them like volture on a fresh carcass\r\nand by the way..if u don't like HIM for what he is don't \r\nlisten to his songs\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nLMAO! Labeled \"XXX\"?!? You are a pathetic, sheltered prep bitch.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nventing is a real word you dumbass!\r\nanyway i dont really like rap but i like this song, they way the words all fit together is very clever. i dont care if you say 'hes being paid to say that' and stuff like that... its still a coolass song!! does anybody agree?\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\neminem is a rhyming geninous. really he puts words together that no one else has rhymed yet. not i feel blue because of you and my shoe u feel this too? hee hee  i like the part \"i'm not gonna be able to top on what my name is\" the best b/c thats what he was feeling and he had create another hit like that and in a way he kinda didnt and kind did  mb i'm not making much sense saying this. if eminem would rewrite it for me then it would heh\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\ni made like a million typos in that last comment  oh well sorry\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\ni love this song. its great. and he gives some credit to my boy marilyn manson.  i love them both.  ahh.  anywho, its great because he is obviosly writting from his heart when he says this shit.  and its just nice.. and stuff... \t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nEMINEMS HOTTTTTTTTTTTTTTTTTTTTTTTTTT\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nPieceOfSkinner...  You are a piece of shit.  You are just writing down a bunch of incoherent crap.  Go kill yourself asshole.  To the girl who said Eminem should be rated XXX, you're retarded.  I think you need to get out more often, and no, church doesn't count.  Eminem makes millions off manipulating stupid people and little kids, and if he can do that, good for him.  I personally hate him and his music, but I don't think it should be banned because it's \"offensive.\"  You offend me by being an idiot, but I'm not saying we should ship you off to an island and blow it up (thought the idea does make me grin a little...).  But anyways, what I came here to say is people give eminem a little too much credit.  He's not a genius, he's not deep, and he's not artistic.  He just knows how to manipulate people into buying his record by being just offensive enough to where people will still listen because they are intrigued.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nall eminem seems to do alot of the time is whine whine whine i wanna slap him and say \"get over yourself slim uve got talent use it\"\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nOkay, Eminem is GREAT. His lyrics mean a lot to me. And for all you retards out there that say his lyrics \"arent\" deep. Then you are fuckin crazy. because his lyrics are about the deepest lyrics i have ever heard. He knows how to run the lyrics with the music. and oh yeah.. A lil bit of information for Rainbow(ass!).. *hehe* \r\nv. ventÃ\u0082Â·ed, ventÃ\u0082Â·ing, vents \r\nv. tr.\r\nTo express (one's thoughts or feelings, for example), especially forcefully. \n\r\nNow i thought this was a COMMENT BOX? if you are going to goto his lyrics and post comments just to run him down.. Then you are low. Your are retarded. If you dont like him.. Keep your opionions to yourself. People blurting out shit.. about someone else.. Creates problems... This world would be a better place if people kept there nasty little comments to theirselves. But if they want to praise someone for the \"work\" they do.. then so be it. That makes everyone happier to read their fans quotes and shit.. Oh and another thing. This is an EMINEM coment box.. So dont bring anyother music into it. Like ICP? They kick ass. But if you are just going to commit to one group your stupid.. i like everything from country to metal.. Anything that has a beat. Oh yeah Slim. Thanks for mentioning Marilyn.. Everyone always says \"yah did you see that on the news.. that kid that shot half of his class. i think that shooting was inspired by eminem or marilyn\"... or some shit.. Well for all you fuckin adults out their that doesnt know SHIT.. Music can inspire you. But it doesnt have an effect on your actions. None at all. Or dont you watch TV? damn stupid fucks.. For all of you out their that is going to appose to this comment.. fuck off. and everyone else.. who loves eminem.. You truly know where talent does exist!\n\r\n*Cole*\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nHey sup this shit wont be long.Now look some may think Em is a fake ass rapper who get paid to write some shit....they dont even listen to what he say in is song !!!!These kind of hoes never listened EM's saying.From the start of his career the only song they asked him for are  My name is The Real Slim Shady and Without Me the jump off songs on each of his album.Anyways Em gots talent no one can denied it and if there is pussies who think hes a fool just make them shut up cuz they couldnt be better then him even if we let them 100 years.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\ni agree ^^^ this song just might be my favorite eminem song but it's hard to say cuz i love most of his songs. em has great talent and i don't care what no one say!! and i hate when people say stuff like \"if you like eminem you don't know what real music is\" wel...WHAT IS REAL MUSIC TO YOU? WHAT??? do you think this music is \"fake\".. if so how? how can a song not be music? and besides people shouldn't say that cuz we all have our own likes and dislikes on artists...\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nGood song overall.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nprobably my fave eminem song. i had no idea he was comparing himself to jesus in this. In this song he's just pouring his soul out. Classic\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nNice, six_strung_out finally someone got to the point.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThe best song written by eminem EVER!\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nThe point of ths song is that he is saying expressing things that happend in his life that happens im with him in this song i have no daut i love minem six_strung_out lolz your right\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nhmmmm intresting\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\n*********interesting\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nGood song, Man does he sound angry!! :|\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI don't know if anyone mentioned this, but the part (\"when you don't give a fuck, when you won't just put up \r\nwith the bullshit they pull, cause they full of shit too \r\nWhen a dude's gettin bullied and shoots up his school \r\nand they blame it on Marilyn (on Marilyn)..\")\n\r\nI believe this is referring to the Columbine incident.  Eminem backed up Marilyn Manson who everyone was blaming.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThis kind of lyrics is what society needs more of. Criticism of the system, coming with a sincere approach is very powerful. It is because of this that all right wing preach and pray wannabe spin-doctors frequent boards like these and attack those who oppose. \n\r\nI am not into rap that much, but good lyrics reaches out far indeed.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nThis song is real. I listen to this when im pissed off.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nin my oppinion, this is his best song ever. if you love it, great, say what you want. if you hate it, fine, don't look up the lyrics!\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nWow what can I say.  I gotta say that IMO Eminem is not a musician.  But he is a poet, and a good one at that.  The reason I say this is he posesses the greatest quality of a good poet:  the ability to express his deepest beliefs and feelings.  Some people think that just because he is vulgar as hell, that makes him a no-talent ass-clown.  I think it's just part of the way he expresses himself and fits what he's talking about usually.\n\r\nPart of the time he actually is refering to things that matter or affect people, things that are wrong in this world, or things that you think deep in the back of your mind but don't let to the forfront of your thoughts because they are so scary/true.  I don't really know how I can express why I like him, or why I like complete opposites (rush compared to eminem).  I like emimem(marshall, whatever) because he's just a complete clown, though not really in this song.  \n\r\nThis song is still good, though.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nBTW I think JASGripen is right on the money.  That's exactly how I feel, esp. the last sentence.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nthis song is amazing and so eminem.I can really relate to the lyrics.And having people think that im something im not.I can understand all the stress he must of been goin through while he wrote those words.Their really powerfull and have a real meaning to them.Its not just some crap of the top of his head this song came from the heart and i think we should all respect that.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nIn a nutshell - Em's frustration at the media, the music industry and fame. It's not all it's cracked up to me. So, yeah.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nthis is for all u hateas fuck what u say 'bout my boy Em he's the greatest if u don't like his shit then these lyrics go out to u fuck what u all think eminem's the greatest & he'll always be so just go & listen to ur fake ass wanna-bes I.C.Pussies peace\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\ndis song is well ace one of the best on tha album i was playin it loads this song means alot cuz this song xplains how loads of ppl keep sayin shit bout him n sayin loads of crap n he jus give in sayin say wat u want cuz he dnt give 2 shits about ani1 else cuz all ppl wana do in lyf is ruin sum1 elz lyf \n\r\nlv yaz xxxxxx stacey xxxxxxx\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThe Irish Guy couldnt be more right, theres nothing courageous about it.  admitting to mistakes in your past in some ways is a  courageous thing but seemingly more courageous example would be not to let it get to that far, in this case eminem taking the responcibilties of having a daughter and becoming a father of her and not becoming another do-all music company guy\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nPhyxius, why do you think the music company gets him to say these types of lyrics, to promote talk about it, all publicity is good publicity and thus sales increase they get more money eminem gets more money and can go on being a material dad, however grant that he wants to change that (if that actually happens, money can be a very intisive incentive)\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nEminem does what he wants to do, period. If you notice he raps about something that is completely pointless such as Rainman and he admits it or he raps about something that is going on in his own life. Guess what? It sells and it only benefits him. He isn't a \"corporate sell out\" but rather a man who had \"balls\" and did what he wanted, people liked it, ultimately he got millions and you didn't and neither did I.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nTells it stright again! Love this song. Doesn't need explaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nrainbow8711..... you are a moron, an idiot.... same for the others who are givin eminem shit in these pages.... he didnt do it for fame, he used to live in a shithole, he has a daughter you fucking assholes, he needed the money!  it's SERIOUSLY OBVIOUS that he isnt in it for fame, wasnt into it in the first place.... he would be liking it if he wanted FAME! he isnt bitching either,  READ THE LYRICS U RETARDS\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nlol someone has a gaydar  :P  but anyway.... this is a good song.... it tells it strait... great song eminem, roxorz on.... oyea, findus umm.... if you dont like eminem.... why are you looking up lyrics?.... OHHH I GOT U AGAIN!!! >:)\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nYea, this song is towards the media for blaming Marilyn Manson for the Columbine incident.  There's another version of this song with Marilyn Manson on it, so that makes interpreting this song a hell of a lot easier.\n\r\nNow, usually I hate rap. But lyrics like this, from the heart and shit, I can stand this rap. It's the crap on the radios now that I wish would just stop.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\n^^^I agree that rap which is played on most radio stations now is crap. That's why I listen to some older stuff.\n\r\nBack to the song:\r\nI partly agree that Eminem is trying to get his albums to sell and I dont think \"he has balls\" for putting a song out like this. However, the first verse alone is enough proof for Eminem being one of the best rappers ever. Words don't usually flow like that, and plus his voice is a little bit angrier + deeper in this song. The lyrics are great too, just for having such unconventional rhymes + multiple rhymes per line. Great stuff.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nSo I think this song is about his wife/ex wife. She thinks he should be a nice guy and he's like screw you I am me...\r\nThats what  I though when I heard it\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\n^^^Actually.....its more to fans/media.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nthis song is insanely good.\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nJust so all you guys who are saying that because he's part of the machine measn he's not anti society, remember that anyone who wants to go against the grain needs to get into it first. Anyone that's really gonna try and do anythign needs to use the machine. Rage against the machine finally subdued to a record label, and theyre possibly the msot influential anti society band ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nyou guys all need to stop raggin on him.\r\nif you dont like his music, dont listen to it.\r\nget a life.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nThis song is really fantastic. I've only recently taken an interest in Eminem. Rap music would usually be my scene but I'm trying to be open-minded! :)\n\r\nHe's a really wonderful lyricist and rapper I've discovered though. It flows really nicely. \n\r\nI think he's one of the most influential musicians in popular music. I love the lines about the school shoot ups and Middle America. Really great.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI may not like Manson, but I definitely support him and Eminem especially since Columbine and all that shit, since people think I'm gonna bring a bomb to school or shoot everyone for being the only \"Goth\" In a hick/richboy town. Eminem has 'is moments, he's not the best but he's pretty kick ass. Not some \"Badass,\" And it's not really all that popular to listen to him anymore, for those of you who think people like me listen to him to stand out, or fit in. It's just talent. And I HATE most rap, completely, but he's poetic to no end. He makes it flow mindblowingly. It's not deep, it's amazing, truth, but not deep. It's way too blunt to be deep peoples, how can something be that basic, and blunt, and simple, but be deep? And yes, venting is a word Rainbow, you dumb fag lover. And he doesn't do anything for fame, if I didn't say that earlier. How could he expect fame? Among his crew, maybe, but across the country(ies?), I don't think he'd want that. All it does is fuck people over. Just look at \"Like Toy Soldiers\" (Also a great song), his friend died, and it was partially his fault. Not somethin that prolly woulda happened if he wasn't famous. Anyway, there's my .02c's, And sorry if it was repetitive.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nto all eminem: haters shut up! I like everything eminem did before 50 cent came and I think some of you losers try to work as hard as he did to get famous and you'll see what its' iike having ramdom people come up to you every two minutes of your life asking for autographs and bothering you every chance they get being in the lime light is not easy just try it you no talent hacks! and icp or whateva the hell you call them sucks and d12 would kick their ass anyday so stop livng in the past and move on eminem will always be bette then them\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\noh and  findus and  rainbow whatever you all have gay screen names so think before you speak\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nwhen he says blame it on Marilyn and the heroine where were the parents at,\r\nhe is talking about the kids from the colombine shootings. they wore trench coats and where copying manson.  he is saying that people are blaming it on drugs and someone else, when really these people are responsible for ther own actions.  its rediculous and eminem is smart to notice that. and he is also saying that things get way more publicisiced when they happen to upper class, suburban places, with kids with rich parents and the fortunate ones, cuz had the columine shootings happened in, say, detroit city, no one would be tallking about the 10th anniversery now. \r\neminem is god.\n\n\n", "comment_76": "\nI love this song Eminem has went though alot.\r\nand to me it seems when he blows up he comes up with\r\nsome of the best songs ever. \t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI don't think he is referring to Columbine in this song.  Instead, I believe he's referring to the shootings at Westside Middle School in Jonesboro, Arkansas. After all, he does say Middle America.  And in regards to the \"Where were the parents at?\" line, I believe that is a result of the fact that the kids were allowed to load the mothers van with the guns and drive the van to school at the age of 13.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nunreal song.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nok...everyone who is syaing shit about Em....fuck off plz. hes a talented rapper and if you can't appreciate it...suck it. anyway about the song, its kinda like a \"fuck you\" to all the critics, to sum it up simply.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nI was watching a documentary with Em in. He said the main point he wanted to get accross with this song is that\r\nhe was getting mithered by everyone saying that he has to \"Top My Name is...\". And he is basically saying that \r\nhe won't be able to. But i think he did top it. The whole Marshall Mathers LP album was way better than The \r\nSlim Shady LP. \n\r\nHe also said, it's a lot about that he is sick of people complaining about his style of rapping and what he \r\ncomes out with. And it's him saying \"If you don't like what i write or do. Then don't fucking listen to me\".\n\r\nHense \"The Way I Am\"\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nEveryone should spam rainbow8711 . They insult someone like Eminem and then, if you go onto her profile, she listens to things (not bands, they don't qualify) such as Death Cab for Cutie. Fuggin dumb girl.. Anyway. Yes Eminem's talented, and for the record, if you sound like an idiot while defending something, you ruin the case you're making. Like saying \"Emnms awsum fuk off if u dn lik hmm.\" Well, you kinda make Eminem seem pathetic for having fans like you. So either learn your own language correctly, compliment/constructively comment, OR GO THE FUCK AWAY. Please.\r\nAlthough I am in no way saying that illiterates aren't good people supporting their musicians here. They should just do it silently.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nNice, I love this song so much, along with his album Recovery, this song makes me respect him so much more. \t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nSure. He has balls. Oh wait, no he doesn't, because he's *PAID BY THE MUSIC COMPANY TO SAY THOSE THINGS.* There's no courage in it, because if he didn't, *then* he would be fired, not the other way around, tardpeople.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nhe is a good rapper and flows so well \r\ni like this song but i dont like eminem i hate eminem\r\nhe is a corporate sell out and only does things that he knows will get him publicity.his label tells him to say these things to sell his record.INSANE CLOWN POSSE are so much bettter\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\neminem is gay. end of story.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nventing what the hell is that? thats not a human verb... you need to go back to english classes and get your facts staight. oh and do NOT tell me what to do. i 100% agree with Jemma, that was very well said. as she said: don't think you're rebellious by buying his records because there are DECENT bands out there who deserve the acclaim he gets but they dont get it becuz of assholes like him. fuck off and don't tell me what to do\t\t\t\t\n\t\t\t\t\n\n"}