{"comment_0": "\nTHIS SONG IS ABOUT:\n\r\nhow the Information age (internet, new media, etc.) is all about doing the most outrageous, absurd drivel just to get ATTENTION...\n\r\nhence, the song begins: \"May I have your ATTENTION please?\r\nMay I have your ATTENTION please?\"\n\r\nthen it talks about attention-getting stunts, like Tom Green humping a dead moose, Aguilera/Spears/Durst/Daly sexcapades to get headlines...as well as Pam Anderson & Tommy\n\r\nso Em playfully joins in the game, & says outrageous things -- like that he killed Dre...& talking about Viagra, etc.\n\r\nhe mocks how people are drawn in & attracked to the outrageous -- as w/ his parody of feminists saying that he grabs his you-know what, etc...\n\r\nthe point is that in this day in age, the attention goes to the vapid outrageous, so you play along -- by creating a persona (the Real Slim Shady)\n\r\namazingly, and ironically, this song comes right before Whatever You Say I Am on the CD... that song deals with an opposite reaction to the media/papparrazzi era that we live in... in that song he reacts violently against it -- but in this song (The REal Slim Shady) he has fun with it... \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nEminem is easily the deepest rapper there is.  He raps to be funny, deep, make money, to send messages, etc.  He has songs for just about every mood anyone can be in.  I'm pretty sure eminem has at least 1 song that ANYONE can relate to.  He has so many different songs about so many different topics.  This song, for example, is his skill of not caring and being funny(he succeeded).  Eminem is very talented and very deep.  Maybe the best ever ???\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nYou can like some rap and dislike some. If you think you can't, you're just a closed minded asshole. \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nFirst off, whatever the media is trying to do with Eminem, I don't care. I like the majority of his music, and that's all that counts.\n\r\nSecond and lastly, all you cheese warriors pissing and moaning about how you hate Eminem, here's some suggestions:\n\r\nGrow some fucking balls and stop whining\r\nIf you really hate Eminem, why the fuck are you looking at his lyrics?\r\nLearn to type. Just because you're on the internet doesn't give you the excuse to talk like a retard.\r\nGet a decent argument. \"Eminem iz shit\" really doesn't cut it you bunch of under sexed morons.\n\r\nTed (that's me for all the nimrods) > Every cunt that has come on here so far and expressed their undying hate for Marshall Mathers. I rule.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThe only reason i like eminem is cause he's donesn't gove a fuck which you gotta respect. Just like Andrew W.K, System Of A Down and Rage against the machine he isnt afraid to sing what he really thinks, even though he might seem extra rude and obnoxious, at least he's not fake. Lets see Britney Spears or N*SYNC or all them do a song like this, not goina happen\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nOK i dont understand u people, i came on this site to cheak out wht the lyrics mean, hench \"songmeanings.net\" and i get a bunch of shit about 'eminem sux', so dont read the lyrics then...leave this space for people who like him and want to discuss his lyrics....In my personal opinion Eminem is a genious....Hate him or love him he ahs made tons of money so he is sitting back laughing at y'all now. I actually dont like rap at all 5o cent, j-z all that shit is just that, shit!!! but there is something about eminem that i really like, not cause he is hot or what ever, i just love his lyrics. Some of his songs are really meaningful, like mocking bird and others are just plain hillarious. Good pick me up songs. He has major balls: he says stuff other people dont dare to and thats y i love him. Y'all wont believe that my favorite type of music is Metal, well it is, and i like it cause (like eminem) they say what they wanan say and they are sellouts!!! ROCK ON EMINEM...\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIt was funny to read the first page of the comments. rainbow8711 said \"..it doesn't really matter because no-one even likes eminem anymore, it's totally uncool to like him (finally) and whats more, he has totally dissolved into the depths of music world along with spice girls, take that and westlife. whats that you say, westlife are still around. oh shit well we can but hope...\"\n\r\nI laughed and asked myself \"WTF?\" until I saw the year on that post: 2002. Forward to 2010, his most recent album is one of the best-selling of the year, and most people I know like his stuff, even if they're not fans of rap. Just earlier today, I put on this song for classmates and everyone was singing along! Eminem is far too iconic for rap to be forgotten, and we're certainly not going to be forgetting him anytime soon. \n\r\nAnyway, this song is pretty good. Much of his stuff is good; there is some that I don't like, but the stuff that I do like outweighs what I don't. Keep it up, Em! And give us more fun pokes at society and the media.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nfirst things first, i hate rap, i despise it in fact. However i do like this song cause its pretty funny and eminem does hold anything back, i like that. \t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nNO..if u really love music...u'll love woteva sounds good...even if u r more of a punky person like me..but i still enjoy hiphop/drum n bass etc\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis song is like totally awesome he is like the best ever he is soooooo cute!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nthis is his view on the world, and I really admire his courage to create these songs and get his opinion out there in a way that he knows people will see. Everyone, whether out of love, like, or curiousity listens to Eminem, and he figures that if they are going to listen to him, he might as well get his opinion out there for the people to hear.  That, in itself, is the one biggest reason I like Eminem. He's opinionated and he makes it a point.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthis song is funny but also deep in a wierd way because in the end when he says\r\nGuess there's a Slim Shady in all of us\r\ni think he means that we all have a good and a bad side to us. which is cool. or maybe not. i dont know.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nfuck u all. i like all of eminem's songs. I cannot beleive that there are actually ppl out there who would like or dislike songs because there cool, or because they like or dislike the artist. if i like a song, i like it. if i dislike a song, then i dislike it. who sings it or if its popular has NOTHING to do with wether or not i like a song. I personally do not like eminem, but i love his songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI've Never loved rap. i used to hate it because its been broken down to 3 minutes of recorded police scanner in a ghetto... and wait... thats the whole song. But Eminem Either Speaks Truth or he's a liar. it doesnt matter if you dont agree with his lyrics. its catchy and funny. if you got the stick shoved up to far. Pull it out a little. and anyway. If you Hate Eminem. go to some \"Ihatemarshallmathers.com\" site. But a lyrical comment site, in the section ABOUT EMINEM isnt the place to bitch about him. I dont care how many excuses you have about \"I feel that this music is hurtful to some audiences. ive taken it upon myself to be musical police for everyone on this website.\" The only thing your showing by dissing eminem On a Forum about Eminem is that one... you got no life. and two... You are craving attention (its okay to have an opinion but once it gets to the point that you need to tell people who like something, that you dont like what they like. all it means is that you need some therapy) Your Representing people who would tell alchoholics that they personally don't drink. THats Completely Redundant. and nobody gives a shit about what you think.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI personally don't listen to to much rap but eminem is one of my favorites for the following reason...\r\nHe raps about his rough life unlike other rappers who rap about money and hoes.... am i wrong?!\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nhe ties words together really well... i love eminemm, yo\r\nlol\r\nand i really don't like rap or hip hop and i hate r&b\r\nbut yeah\r\nand i love how all the people on here who bash him are exactly what hes talking about in his songs and they all get told BY his songs and are idiots cause he really doesn't care what we think\r\nat least he has (or had) identity which is rare in music today\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nsee, this is exactly what rap should be like! Eminem absolutely owns this song, all the  lyrics are so witty you actually want to hear every line and not just wait for the catchy chorus. it's great how he just throws everything out there, the randomness between making statements and just spitting nonsense totally works. Go slim shady!\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nOh, and serenity23 - you are absolutely right.  This is one of the few rap songs that I actually have had the urge to look up the lyrics to, because I wanted to know what he was saying.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI am not a rap / hip-hop fan or an Eminem fan in any way, but I find this song musically and lyrically very well constructed. \r\nI find it hilarious that someone can hear a song and summarize that they hate the artist as a person. As if everything written in the song is the story of the artist's life. \r\nEminem is a genius at exploiting such stupidity and this is what this song is about. Eminem's fame is partly due to his talent and partly to his abiity to exploit the reactions of his audience. \r\nThe fact that he manages to polarise his audience to such a great extent is proof of his talent. Without the talent, noone would even bother to comment on his songs. Respect.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nEminem is a fuckin' genious, I luv him 2 death. These days I appreciate him more than I used back when he 1st came out, I listened to his stuff but wasn't into him that much but as the years passed by I started to appreciate him for his shock-value and damn honesty. He's an amazing artist and if anyone here has shit to say about him, go the fuck somewhere else, us true fans don't wanna read you vomit.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nGuess there's a Slim Shady in all of us.. let's all stand up.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI like this song... I mean usually I really hate rap. but the other day i heard when im gone for the first time and it was the first time i ever heard anyone rap about anything about drugs sex and money. I still dont particularly like rap but i dont hate it either. I like eminem though. Only the real stuff about his opinions or his feelings about his daughter or his wife or something i still i dont like the stuff where hes just shouting bout the usual: drugs sex and money. In his \"real\" songs like this one, I admire him because hes not afraid to tell exactly how he feels about the world, he even shouts it no matter how explicit or loud he is he says what he has to say. I dont think it matters if hes doing it for attention. of course he wants attention but it doesnt mean hes lying bout his opinions to get attention. Even if some ppl think hes just a retarded rapper whos trying to fake being real idc. hes got my attention\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nlolz the funniest part is-\r\n''And Dr. Dre said... nothing you idiots! \r\nDr. Dre's dead, he's locked in my basement! (Ha-ha!)''\n\r\nthis is the weirdest...\r\n''my bum is on your lips, my bum is on your lips\"\r\nAnd if I'm lucky, you might just give it a little kiss''\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI think the words say it all. No need for any deep meaning. Most rappers donâ\u0080\u0099t go deep in their lyrics. They just throw wood together that sounds good followed by hoe, motherf**ker and f**k and a few other juicy words. Now true I really hate MOST rap, and this is the first song I have ever heard of eminem. I do like this one. My favorite is the chorus. Thatâ\u0080\u0099s that part that would be great by itself. I may like this song, it doesnâ\u0080\u0099tâ\u0080\u0099t mean Iâ\u0080\u0099m going out to buy his CDs or become a fan. \t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nthat song is cool\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nNo, this song sux...\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nas much as i can't stand rap, and i generally think that Eminem is just a whiny, hipocritical bitch, even i think this song is pretty funny.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis song represents everything that Eminem is,and tells people he is what he is and he isnt going to change for anyone no matter what they say or do.\n\n\n\n", "comment_28": "\ni feel sorry for rainbow8711, only liking a record or music type because it is considered cool, what are you some 12 year old american schoolgirl who cant make up her own mind.  It doesn't matter if it's considered cool. it's whether or not you like it and are prepared to stand up and be counted as a person. Don't be a slave to cool, fuck cool, be your own person or I gurantee you will spend your life trying to please someone else and never pleasing yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nto rainbows8711 - if you dont like garage, how do you like nirvana? there a grunge band  - that made it big - im thinkng thats the only reason you lke them - but back to the song, sorry i lov ethis my friend paraphrased it to describe this guy who wants to be eminem - will the real  please light up? turn your bulb on and please light up? - hey he bleached his hair so that inspired the parody\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nwhy dont you all just shut the fuck up.  no one wants to hear about how you dont like rap. if you hate it so much, why the fuck are you readin' eminems lyrics?  im not much of a big rap fan myself, and there is a lot of shitty music out these days... so ya just have to listen to whats good. \t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ni agree flashdta i luv eminem and i luv this song! its so hilarious!!! i agree wit u too toxicqeek coz its really not about whether the song is cool or not to otha ppl u gotta c if its cool to u and don't give a shit if ur not following the trends as quoted from toxicqeek: \"they'll spend their lives trying to please someone else and never please themselves\"  but newayz eminem rox!! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nwho gives a fuck if u don't like rap cuz rap will still b around with or without u so jump on the bandwagon or jump off but either way quit complaining cuz 4 people can't stop rap by themselves. 4 every themosquitogod who says they don't like rap there r 500 Rebel 01s who these rappers will continue 2 make money off of but always remember 1 person can't stop rap no matter who they are. don't believe me? ask Tipper Gore!!! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nfunny stuff..not one for the kids,though..hehe..\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nthis is a okay song but I don't like this rap but I think white people rap better than black people   and Dr dre is a sell out and pop sucks\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThis is possibly the catchiest song Eminem has ever done. \t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\njust a msg for rainbow8711 to let u know u COMPLETELY ROCKED URSELF!!! \"anyhow it doesn't really matter because no-one even likes eminem anymore, it's totally uncool to like him (finally) and whats more, he has totally dissolved into the depths of music world\" well thats a load of bullshEt isnt it? coz EMINEM is BACK...and if nething he's bigger and better (dont take that the wrong way u dirty minded fools) then ever before! So u just totally made a fool of urself didnt u! ALL U ANTI EMINEM PPL OUT THERE CAN SUCK MY D!CK!!! (ok FINE, im a chick.....i dont have a dick...look..its just a saying OK?) no1 here wants 2 hear y u dont like him, if u dont like him.....y the FECK were u lookin this song up??? EMINEM ROCKS!!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nHey \"GreatGay-RedPeriod-GoatBoy\", if you say anyone who lissens to his music is gay, well look who's gay wit me fagget.....eminem is sayin he knows alot of people wanna be his wannabe(like me;)), but no one can ever be close to bein like he is, he's got the biggest balls, he's got the baggiest grauls.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\ntoo bad eminem sucks, i give him credit for being the best rapper, which means rap sucks in general. eminem should deserve all these awards and stuff because hes turned reputation of american music into crap. he thinks hes a real bad ass. hes a hypocrite and all he wants is attention.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\ngoddamn i hate eminen\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\ngodddamn i hate  americanidiot\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\ngoddamn i hate all your little punk bitch asses\r\nyou are all gay mutherfuckers who suck dick\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\ni agree with amyjane. Eminem rulez, and maddox, ur a gay motherfucker to come to this site when u dont like eminem. maddox, i hope u get drunk and break ur ass off, saying WE r motherfuckers.... when u the real dumbfukin piece of shit...lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\ni think he sucks wang. he thinks he is so bad \"oh my im so good at rapping\" hey eminem kiss my ass, ya bastard:)\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nAlright, I'm not going to get on here and start cussing everyone out because I actaully have a point to make. Honestly, don't you think this is formulated? Can anyone else see this? The whole record industry is playing you like a deck of cards! Eminem's facade is that he's this poor guy who endured a bad upbringing, and I'm not disputing that (by the way, most of what was in 8 Mile was purely fictional). The record industry finds this guy, gives him some money and tells him to only write the same tired retarded lyrics about how bad his life is/was and how he wants people to stop giving him greif about what he wants to do. But don't you notice this same trend in pop music? Lindsay Lohan, Britney Spears, Ashlee Simpson, just to name a few, all repeating the same message Eminem is programmed to repeat. At one time in my life I actually enjoyed Eminem, but when I really started to pay attention to this stuff I realized what a tool I was being! Eminem and most of pop music is controlled like puppets from the record industry, DO NOT BE A TOOL and willingly shove money at them for this crap! Look for music for quality, talent, not catchyness, and if you must listen to the fodder that the company feeds our pop culture, PIRATE THE FUCK OUT OF IT! Thank you.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThis song sucks!!!!!!!!!!!!!!!!!! eminem sucks!!!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\ni agree with you pyro but he is still a good singer anyone if you know what i mean give a shout out!!\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nthis song is very funny and i like the part about briteny and cristina\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nPIRATE THE FUCK OUT OF IT!\r\nActually you shouldn't because this harms the sales of record companies which reduces their profits - which naturally gets knocked off the salaries of the regular grunt workers in factories and in shops etc. so while your intentions may be pure pyro you're actually harming good people who deserve and need money... wait a minute, what have I done? I'll never link this onto something about eminem...\n\r\nOh, I know.... On a totally different and opposite note, eminem you're a cock, take this record and shove it up your ass or even more painful, listen to it.  Its kind of ironic that you're so proud to be the \"real slim shady\" because if I actually was the sad little man who came up with this pile of crap then I'd be frantically denying it. If you're listening to this I'm your biggest fan, I think you're shit.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\n\"this song is very funny and i like the part about briteny and cristina \"\n\r\nSarcasm at its purest\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nhe is still a good singer anyone if you know what i mean give a shout out!! \n\r\nI know what you mean, but I think you're wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI think Eminem IS white.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\ni like this song.it got me into Eminem\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI think Eminem IS white. \n\r\nThanks For That\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\np.s. i also dont base if i like or dislike a song on the genre. and i dont see y all u ppl who hate eminem and this song [little prejudice bastards]\r\neven look and comment on the lyrics. dont u have better things to do with ur life than look up lyrics for songs u hate and then say u hate them in the comment box? if i dont like a song, i dont look it up and find the lyrics. that may just be because i have a life though.....\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nHES the the real slim baby!\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis song is funny...even after three years...\n\r\nCantaloupes...{slurp!!!}\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nIf you are you a good songwrite you don't need to piss off at everyone and cover up the entire song behind a curtain of dirt and ugly lyrics. That's what Eminem the dickhead has been doing!\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI luv this song i know almost all the lyrics. I dont care what the hell anybody thinks about eminem I just like the song~\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis song and Lose Yourself are Eminem's only good rap songs. This is due to the fact that none of the other songs that Eminem made can touch these.\n\r\nThe Real Slim Shady: This song is funny, observant, and has some tight beats by my man dre. It also has a complex structure which makes it even more amazing. (And has a good chorus too)\n\r\nLose Yourself: Probably one of the best rap/rock songs ever, fighting against Rock Box, Walk This Way, and Feel Good Inc.\n\r\nThe rest of Eminem's songs are very novelty, because either they either are completely retarded \"Ass Like That\" or they're half-way decent \"Like Toy Soldiers\". I'm serious, none of those other singles compare to these. (With the slight exception of When I'm Gone, due to its emotional value.)\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nim 13 (over fourth grade) and i still dont know what a woman's clitoris is\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nApparently you guys who don't like him haven't figured out that he DOESNT GIVE A FUCK WHAT YOU THINK! Hopefully you guys can figure this out and go post some comments on a song you actually like instead of taking up space where someone who actually likes him might want their comment to be seen.\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nyes, this site is about SONGMEANINGS, and most people (including eminem) dont give a shit about how much u dislike him... so please, if u dont like this great song, I DONT WANT TO HAER ABOUT IT\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nmost ppl dnt give a fuck about wat we think , but some do including u... if u didnt care then why would you be wasting ur time writing a message telling us to stop but honestly i h8 rap and it should stop!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI'm not a huge fan of rap...but eminem really caught me. His music has a message, and I have major respect for him for that. He's been thru alot of shit in his life, and everything he says is true. Alot of u ppl that hate on eminem listen to shitty music anyways. So until u guys can actually come up with some legitamently bad things to say about Em...just shut the fuck up...cuz we really don't wanna hear it. Eminem kicks ass and thats all there is to it. Do u actually think that he gives a fuck that u don't like him? We (and him too) could really give a fuck less what u little pansy ass piss pants faggots think. \n\r\nStay Sic\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nbrill sng! eminem 4 life!\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\n*arnt sellouts haha\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\ni dont like rap. except the older kind like house of pain etc. but yeah this song is cool. this one, my name is, and cleaning out my closet are the only songs that i like.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nGod people!! If you don't like this god damn song, no one gives a fuck. If you do like this song, good for you, but no one gives a damn. Music is music ppl!! Sometimes there isn't a meaning. Why can't people just accept music for what it is and not think too much about it? This song is really good and has some good stuff in it.  and thats what this song about-HE DOESnT GIVE A DAMN! and it's just a darn song, no need to get all worked up about it...\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nOh and very good Lawcock.. w/e u just said right there is how i think too... every other rapper sux but Eminem is just different.. (not cause hes white) because hes a fuckin genious i guess.. \n\r\nP.s. i think he made this song because he was fed up with all the fuckin poser wiggers who dye theyre hair blonde and try to look like white trash when theyre parents are filthy rich. Fuck em all.. theres only one Shady =)\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI hate Eminem.  However I can't help but admit that he shows some talent in this song.  I mean when you break it down theres no real aim or concept to this song.  It's really just random rhymes about random things.  The lyrics are corny in a lot of areas as well including the dumb chorus.  But even through all that he whipped out some decent rhymes and had perfect flow throughout the entire song.  The beat was also catchy.  Other than this, Eminem hasn't made one song worth listening to.  The only reason this had any value to it anyway is because it was his first hit single so he had all the rhymes he could think of at his disposal.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\n\"im sick of you little girl and boy groups, all you do is annoy me, so I have been sent here to destroy you.\"\n\r\nhahah, thats pretty funny.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI love nearly all kinds of music- save stuff like Brittany and shit, but even though rap isn't my favorite genre of music, it's got several very talented artists that do create amazing songs, including eminem. If you hate him, keep that to yourself. Why the hell are you wasting your time looking up songs from singers you don't like and commenting on them. Oh and we DONT whether care if you hate eminem or not. \n\r\nOh and TheAnarchist: \"But Eminem Either Speaks Truth or he's a liar\" LOL! (although I do agree with your comment ^.^)\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nLOL at all the ignorant pricks who are saying rap sucks, why look up Eminem lyrics if you don't like rap?\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nThis is probably my least favorite song on the Marshall Mathers LP. There's so many better songs on the album than this one. It's still a good song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nWow, the majority of the people posting on this song are so close minded.  How can anybody possibly say that every single song of a genre suck, and that all the songs are shit?  I understand that you may not like the music, but you can't say that there's no talent - it seems fairly obvious that it takes a lot of effort and talent to produce a rap like this.\n\r\nI personally love just about every genre of music.  The only this I have trouble liking the majority of is country and hardcore death metal, and even there, I find that there are songs in the genre that I find appealing.\n\r\nAnyways, I LOVE this song, it's funny and catchy.  I have a problem with the fact that I listened to this song when I was in 4th grade, it's extremely inappropriate.  Fortunately I didn't listen to the lyrics too much, just the chorus, haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nie. The 'Slim Shady'\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nlol - love this song.\n\r\nbtw, can people stop bitching about what genres are better than others. All have their own pros and cons and you're not proving anything by arguing about it. Stop being negative and go on another message board with music you do like.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nLook, I used to be someone who avoided anything that was meant to be chavvy or not cool or whatever cos i didnt want to be stereotyped, but i was acc being stereotyped as someone like that Rainbows1877 or whatever. Ive recently got to actually love eminem cos hes so harsh, and some of his songs & videos are just bare funny. I dont care if other people know I love him, a lot of his fans also love Metallica and Avenged Sevenfold, which is awesome cos hes reaching all sorts of demographics. So anyone who hates him, fine, you have your own opinion, but other people have theirs too.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nOh no there are haters on the page AHHHHHHHHHHHHHHHH!!!!\n\n\r\nBTW eminem rules!\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nHere's my lyrics of \"The Real Shaggy Rodgers\":\n\r\nMay I have your attention please?\r\nMay I have your attention please?\r\nWill the real Shaggy Rodgers please stand up?\r\nI repeat, will the real Shaggy Rodgers please stand up?\r\nWe're gonna have a problem here..\n\r\nY'all act like you never seen a white person before\r\nJaws all on the floor like Pam, like Tommy just burst in the door\r\nand started whoopin her ass worse than before\r\nthey first were divorce, throwin her over furniture (Ahh!)\r\nIt's the return of the... \"Ah, wait, no way, you're kidding, \r\nhe didn't just say what I think he did, did he?\"\r\nAnd Dr. Dre said... nothing you idiots! \r\nDr. Dre's dead, he's locked in my basement! (Ha-ha!)\r\nFeminist women love Eminem {*vocal turntable: \r\nchigga chigga chigga*} \"Slim Shady, I'm sick of him\r\nLook at him, walkin around grabbin his you-know-what\r\nFlippin the you-know-who,\" \"Yeah, but he's so cute though!\"\r\nYeah, I probably got a couple of screws up in my head loose\r\nBut no worse, than what's goin on in your parents' bedrooms\r\nSometimes, I wanna get on TV and just let loose, but can't\r\nbut it's cool for Tom Green to hump a dead moose\r\n\"My bum is on your lips, my bum is on your lips\"\r\nAnd if I'm lucky, you might just give it a little kiss\r\nAnd that's the message that we deliver to little kids\r\nAnd expect them not to know what a woman's clitoris is\r\nOf course they gonna know what intercourse is\r\nBy the time they hit fourth grade\r\nThey got the Discovery Channel don't they?\r\n\"We ain't nothing but mammals..\" Well, some of us cannibals\r\nwho cut other people open like cantaloupes {*SLURP*}\r\nBut if we can hump dead animals and antelopes\r\nthen there's no reason that a man and another man can't elope\r\n{*EWWW!*} But if you feel like I feel, I got the antidote\r\nWomen wave your pantyhose, sing the chorus and it goes\n\r\nChorus: Eminem (repeat 2X)\n\r\nI'm Shaggy, yes I'm the real Shaggy\r\nAll you other Shaggys are just imitating\r\nSo won't the real Slim Shaggy please stand up,\r\nplease stand up, please stand up?\n\r\nWill Smith don't gotta cuss in his raps to sell his records;\r\nwell I do, so fuck him and fuck you too!\r\nYou think I give a damn about a Grammy?\r\nHalf of you critics can't even stomach me, let alone stand me\r\n\"But Shag, what if you win, wouldn't it be weird?\"\r\nWhy? So you guys could just lie to get me here?\r\nSo you can, sit me here next to Britney Spears?\r\nShit, Christina Aguilera better switch me chairs\r\nso I can sit next to Carson Daly and Fred Durst\r\nand hear 'em argue over who she gave head to first\r\nYou little bitch, put me on blast on MTV\r\n\"Yeah, he's cute, but I think he's married to Kim, hee-hee!\"\r\nI should download her audio on MP3 \r\nand show the whole world how you gave Eminem VD {*AHHH!*}\r\nI'm sick of you little girl and boy groups, all you do is annoy me\r\nso I have been sent here to destroy you {*bzzzt*}\r\nAnd there's a million of us just like me\r\nwho cuss like me; who just don't give a fuck like me\r\nwho dress like me; walk, talk and act like me\r\nand just might be the next best thing but not quite me!\n\r\nChorus\n\r\nI'm like a head trip to listen to, cause I'm only givin you \r\nthings you joke about with your friends inside your living room\r\nThe only difference is I got the balls to say it\r\nin front of y'all and I don't gotta be false or sugarcoated at all\r\nI just get on the mic and spit it \r\nand whether you like to admit it {*ERR*} I just shit it\r\nbetter than ninety percent of you rappers out can\r\nThen you wonder how can kids eat up these albums like valiums\r\nIt's funny; cause at the rate I'm goin when I'm thirty\r\nI'll be the only person in the nursin home flirting\r\nPinchin nurses asses when I'm jackin off with Jergens\r\nAnd I'm jerkin but this whole bag of Viagra isn't working\r\nAnd every single person is a Slim Shady lurkin\r\nHe could be workin at Burger King, spittin on your onion rings\r\n{*HACH*} Or in the parkin lot, circling\r\nScreaming \"I don't give a fuck!\" \r\nwith his windows down and his system up\r\nSo, will the real Shaggy please stand up?\r\nAnd put one of those fingers on each hand up?\r\nAnd be proud to be outta your mind and outta control\r\nand one more time, loud as you can, how does it go?\n\r\nChorus 2X\n\r\nHa ha\r\nGuess there's a Shaggy Rodgers in all of us\r\nFuck it, let's all stand up\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nGod bless eminem.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nrainbow8711 \r\n05-02-2002\t\n\r\nRated -2  themosquitogod well said, except isnt it phlegminem? well anyway. i do quite like this but only cuz its catchy and quite funny, not because i actually like eminem or agree with any of his messages. anyhow it doesn't really matter because no-one even likes eminem anymore, it's totally uncool to like him (finally) and whats more, he has totally dissolved into the depths of music world along with spice girls, take that and westlife. whats that you say, westlife are still around. oh shit well we can but hope...\r\noh and for the record, rap, garage, r&b etc sucks. rock and indie rule. \r\nmuse, nirvana, beatles, lifehouse, REM, jimmy eat world forever \n\r\n...\r\nI think this is funny\r\ncoz everyone still loves eminem\r\n:)\r\nhis songs are clearly satirical and i love that about him\r\nthis song is awesome\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nthis song's hilarious!  he's a genius and if you don't take the time to check it out, it's your loss.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nI love how there's not a single comment saying what the meaning of the song is.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nThe Real Slim Shady means that Eminem went through so much in life that he doesn't even know who he is, and with all of his pain and issues, he is trying to find the real slim shady, so he is asking himself - the real Marshal Mathers to show up and stand up so he can figure out who he is supposed to be.\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nEMINEM IS A GAY FAGGOT WITH A HIGH PITCHED VOICE THAT LIKES ANAL LOVING.... ONLY FAGGOTS LISTEN TO HIS FUCKED UP FUCKING WOMANLY VOICE... ITS AS IF HE'S GOT NO BALLS... LISTEN TO SOME DECENT Musik \t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\ni love eminem!!!!!!!!!! he's super and pretty true. not all of his songs rock, but he's still the leader of hip hop. well, all of you losers who try to be eminem, just leave it. it's hopeless.\r\n---have fun---\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nOk. one) if you dont like rap.. why the fuck comment this song u fuckin losers.\r\ntwo) this song is kick ass and so is Slim Shady. Fuck you losers..\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nEminem is a good rapper. He has courage to speak his mind. People think he is just some whigger but his music has some pretty deep lyrics\n\r\n=-=D0n3 D1d-=-\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI think this song is about hypocrisy in America and the dark side in all of us.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nHere's my lyrics:\r\nMay I Have your attention please?\r\nMay I Have your attention please?\r\nWill that bitch Slim Shady please shut up?\r\nI Repeat: Will that bitch Slim Shady please shut up?\r\nwe're gonna have a problem here...\n\r\nDexter Holland: Y'all act like you'd never heard a white person before\r\nRhymes are bore 14 minutes are up so I got 1 more.\r\nI have to come back and now I'm worse than before, I'll make you snore cause my tired son's boring you (AAHHH!!!)\r\nIt's the return to the\n\r\nMaynard: Oh, wait hold on don't try that you heard what She sounds like. You really gonna buy that?\n\r\nDexter: And Miley Cyrus does... Nothing you idiots Miley Cyrus's Dead, She locked in my basement\n\r\nBoth: The world has had enough!!\n\r\nDexter: Eminem *imitates turntable* Slim Shady I'm sick of him. Look at him walking around trying to kiss Miley's @$$ trying to impress you. *samples clips*\r\nYeah, I probably got a couple of screws up in my head loose\r\nBut no worse, than what's goin on in your parents' bedrooms\r\nSometimes, I wanna get on TV and just let loose, but can't\r\nbut it's cool for Tom Green to hump a dead moose\r\n\"My bum is on your lips, my bum is on your lips\"\r\nAnd if I'm lucky, you might just give it a little kiss\r\nAnd that's the message that we deliver to little kids\r\nAnd expect them not to know what a woman's clitoris is\r\nOf course they gonna know what intercourse is\r\nBy the time they hit fourth grade\r\nThey got the Discovery Channel don't they?\r\n\"We ain't nothing but mammals..\" Well, some of us cannibals\r\nwho cut other people open like cantaloupes {*SLURP*}\r\nBut if we can hump dead animals and antelopes\r\nthen there's no reason that a man and another man can't elope\r\n{*EWWW!*} But if you feel like I feel, I got the antidote\r\nWomen wave your pantyhose, sing the chorus and it goes\n\r\nChorus:\r\nI'm Slim Shady, and yes I'm real grating\r\nI talk like Peter Brady, and it's irritating\r\nSo won't the real Slim Shady please shut up,\r\nplease shut up, please shut up?\n\r\nWell, I'm Slim Shady, and yes I'm real grating\r\nI talk like Peter Brady, and it's irritating\r\nSo won't the real Slim Shady please shut up,\r\nplease shut up, please shut up?\r\nHa ha\r\nGuess there's a Slim Shady in all of us\r\nFuck it, let's all stand up\n\n\n\n", "comment_92": "\nthemosquitogod well said, except isnt it phlegminem? well anyway. i do quite like this but only cuz its catchy and quite funny, not because i actually like eminem or agree with any of his messages. anyhow it doesn't really matter because no-one even likes eminem anymore, it's totally uncool to like him (finally) and whats more, he has totally dissolved into the depths of music world along with spice girls, take that and westlife. whats that you say, westlife are still around. oh shit well we can but hope...\r\noh and for the record, rap, garage, r&b etc sucks. rock and indie rule. \r\nmuse, nirvana, beatles, lifehouse, REM, jimmy eat world forever\t\t\t\t\n\t\t\t\t\n\n"}