{"comment_0": "\nI believe this song is just about Eminem's life as an artist. \"Call me crazy, but i have this vision, one day that ill walk amougst you, regular civilians.\" Hes say that he believes that one day he be a normal person and not have to deal with the negitive things of being famous. \"I aint here to save the f**king children, but if one kid out of a hundred million, who are going through a struggle, feels and relates, thats great\" he is saying that he is not writing songs that are for children to relate too, but if there are children, that are going through rough times, that listen to some of his songs to relieve some of their frustrations, then he thinks thats great. \"Im friends with the monster thats under my bed.\" Hes is speaking about slim shady, which is his vulgar alter ego. How he is friends with his alter ego, the\"monster\". \"Maybe i need a straightjacket, face the facts, im nuts for real, but im okay with that, its nothing.\" He his refering to his alter egos video \"my name is\" where he is wearing a straightjacket. He saying that he is really that weird and that he is okay with being that way, cause it doesnt affect him as a person, that he will countiue to be friends with his alter ego, slim shady, his monster, so he will continue to make some vulgar songs that slim shady creates. Marshell Mathers all the way!\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song is about schizophrenia. \"Friends with the monster that's under my bed\" is the halusinations and \"get along with the voices inside of my head\" is about the voices the person hears in their head. \"Your trying to save me stop holding your breath\" the hospitals and medication \"you think I'm crazy yeah you think I'm crazy\" is from how people say the things you say don't egsist. \t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song is tough- maybe his past is haunting him, like a monster from under his bed.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\ni think this is a generalization of obsessive compulsive intrusive thought disorder i.e the monster\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI feel like the person is damaged to some extent, possibly from past experiences or failures and is regretting that. The person claims to be \"friends with the monster under their bed,\" the opposite of normal reactions to a thought of that situation. Same with listening to the \"voices\" inside of their head. They reference a person or figure attempting to help them sort their life out and they block this person out. Hopefully anyone that feels they can relate eventually sorts their problems out! There are several references to famous figures in this as well, which add to the uniqueness of the song as well. One of Eminem's more laid-back songs, which I find to be a breath of fresh air from an artist like him.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nHere you go, the original lyrics, whatever is on here is what people think they heard. This is what they actually sing :\n\nIâ\u0080\u0099m friends with the monster thatâ\u0080\u0099s under my bed\nGet along with the voices inside of my head\nYouâ\u0080\u0099re tryinâ\u0080\u0099 to save me, stop holdinâ\u0080\u0099 your breath\nAnd you think Iâ\u0080\u0099m crazy yeah, you think Iâ\u0080\u0099m crazy\n\nI wanted the fame but not the cover of Newsweek\nOh well, guess beggars canâ\u0080\u0099t be choosey\nWanted to receive attention for my music\nWanted to be left alone in public excuse me\nFor wantinâ\u0080\u0099 my cake and eat it too and wantinâ\u0080\u0099 it both ways\nFame made me a balloon â\u0080\u0098cuz my ego inflated when I blew, see\nBut it was confusing, â\u0080\u0098cuz all I wanted to doâ\u0080\u0099s be\nThe Bruce Lee of loose leaf\nAbused ink, used it as a tool when blew steam\nWhoo, hit the lottery ooh-wee\nBut with, what I gave up to get it was bittersweet it was like winninâ\u0080\u0099 a used mink\nIronic â\u0080\u0098cuz I think Iâ\u0080\u0099m gettingâ\u0080\u0099 so huge I need a shrink, Iâ\u0080\u0099m beginninâ\u0080\u0099 to lose sleep\nOne sheep, two sheep, goinâ\u0080\u0099 coo-coo and kooky as Kool Keith\nBut Iâ\u0080\u0099m actually weirder than you think\n(Cuz Iâ\u0080\u0099m..) \n\nIâ\u0080\u0099m friends with the monster thatâ\u0080\u0099s under my bed\nGet along with the voices inside of my head\nYouâ\u0080\u0099re tryin to save me, stop holding your breath\nAnd you think Iâ\u0080\u0099m crazy, yeah you think Iâ\u0080\u0099m crazy\nWell thatâ\u0080\u0099s nothinâ\u0080\u0099, well thatâ\u0080\u0099s nothinâ\u0080\u0099\n\nNow I ainâ\u0080\u0099t much of a poet but somebody once told me to seize the moment and donâ\u0080\u0099t squander it\nCuz you never know when it could all be over tomorrow so I keep conjurinâ\u0080\u0099\nSometimes I wonder where these thoughts spawn from\nYeah ponderinâ\u0080\u0099ll do you wonders no wonder your losinâ\u0080\u0099 your mind the way it wanders ,yodalodaleheehoo, I think it went wanderinâ\u0080\u0099 off down yonder and\nStumbled on â\u0080\u0098ta Jeff VanVonderen, â\u0080\u0098cuz I need a interventionist, to\nintervene between me and this monster\nAnd save me from myself and all this conflict\nâ\u0080\u0099Cuz the very thing that I loveâ\u0080\u0099s killinâ\u0080\u0099 me and I canâ\u0080\u0099t conquer it\nMy OCDâ\u0080\u0099s conkinâ\u0080\u0099 me in the head keep knockinâ\u0080\u0099\nNobodyâ\u0080\u0099s home Iâ\u0080\u0099m sleepwalkinâ\u0080\u0099\nIâ\u0080\u0099m just relayinâ\u0080\u0099 what the voice in my headâ\u0080\u0099s sayinâ\u0080\u0099, donâ\u0080\u0099t shoot the messenger\nIâ\u0080\u0099m just friends with the..\n\nIâ\u0080\u0099m friends with the monster thatâ\u0080\u0099s under my bed\nGet along with the voices inside of my head\nYouâ\u0080\u0099re tryin to save me, stop holding your breath\nAnd you think Iâ\u0080\u0099m crazy, yeah you think Iâ\u0080\u0099m crazy\nWell thatâ\u0080\u0099s nothinâ\u0080\u0099, well thatâ\u0080\u0099s nothinâ\u0080\u0099\n\nCall me crazy but I have this vision\nOne day that, Iâ\u0080\u0099ll walk amongst you a regular civilian\nBut until then, drums get killed and Iâ\u0080\u0099m\nCominâ\u0080\u0099 straight at MCâ\u0080\u0099s blood gets spilled and Iâ\u0080\u0099ll\nTake you back to the days that Iâ\u0080\u0099d get on a Dre track, give every kid who got played that, pumped up feelinâ\u0080\u0099\nAnd shit to say back to the kids who played him, I ainâ\u0080\u0099t here save the fuckinâ\u0080\u0099 children\nBut if one kid out of a hundred million\nWho are goinâ\u0080\u0099 through a struggle feels it and\nRelates thatâ\u0080\u0099s great, itâ\u0080\u0099s payback, Russell Wilson\nFallinâ\u0080\u0099 way back in the draft turn nothinâ\u0080\u0099 into somethin still can\nMake that straw into gold chump, I will spin, Rumpelstiltskin\nIn a haystack, maybe I need a straightjacket face facts, I am nuts for real, but\nIâ\u0080\u0099m ok with that, itâ\u0080\u0099s nuthinâ\u0080\u0099 Iâ\u0080\u0099m still friends\nWith the...\n\nIâ\u0080\u0099m friends with the monster thatâ\u0080\u0099s under my bed\nGet along with the voices inside of my head\nYouâ\u0080\u0099re tryin to save me stop holding your breath\nAnd you think Iâ\u0080\u0099m crazy yeah you think Iâ\u0080\u0099m crazy...\nIâ\u0080\u0099m friends with the monster thatâ\u0080\u0099s under my bed\nGet along with the voices inside of my head\nYouâ\u0080\u0099re tryin to save me stop holding your breath\nAnd you think Iâ\u0080\u0099m crazy yeah you think Iâ\u0080\u0099m crazy well thatâ\u0080\u0099s nothinâ\u0080\u0099, well thatâ\u0080\u0099s nothinâ\u0080\u0099\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThe guy is OCD and tends to hear his mind telling him things, his mind being the monster. Instead of ignoring or listening to it, he argues with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis is the guilt of his life finally catching up with him \"friends with the monster that's under my bed\" I think thats Marshal and Kim and marshal trying to restart a relationship with Kim for haliles sake. This my opinion, my guess is as good as yours.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nOld rumor is that he sold his soul to the devil so in this song he is trying to break free of the chains that the monster has him bound with.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI know in this song Eminem says that he's not a poet, but really, that's what he is!  His songs have so much meaning to it.\n\nAnyway, to tell it simply, this  song is about how he came to be, starting off as just a distant dream, and becoming a reality.  At the end he's coming back to where he came from and helping kids just like him that had a hard time as kids but are still looking up and becoming great. --Olivia D. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nFirst of all, I hate this song! Crap! Its poking fun at all sorts of mental illnesses. Not cool\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nJust have to say, I do love this song!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nHuh... I thought instead of \"That's nothing\"... they were singing \"That's not fair\". \r\nGuess that speaks to what I want it to say... hehe. \n\r\nHonestly, now I hear both.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI think this song is about a person who is famous but just wanted to make music and have fun. They didn't want to be on covers of magazines or have their picture taken. They didn't make music to help others, they just did it for themselves. The monster inside their head is two versions of themselves that are arguing against each other on what is right and what fame is really all about.\t\t\t\t\n\t\t\t\t\n\n"}