{"comment_0": "\nI love this song, the happy tune. the lalala's and the sadistic lyrics! *bol*\r\n\"They ask me if I feel remorse and I answer, \"Why of course! \r\nThere is so much more I could have done if they'd let me!\"\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song is just too funny. I don't think it must be taken too seriously...just read the lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nGod, I love how he's this old rock star man singing from the point of view of a fifteen year old female serial killer.  Hysteria?!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI love the sudden jump in the course of events when he inverts the colours of eyes and hair. Brilliant, gives an unexpected and perfect portrait of the now revealed killer. The \"pretty mouth underneath all the foaming\" is a powerful image. This Cave guy is a master at what he does.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nFoul play can really get a small town going\r\n:-D great !\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is just too funny. I don't think it must be taken too seriously...just read the lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI agree with Gummitch, if Im just having a bad day, I can put this song on and laugh my butt off.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI agree.\r\nThis song is really funny.\n\r\nor maybe I just have a strange sense of humor.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis song is brilliant. I agree, the fact that it is a man singing from the point of veiw of a 15 yr old serial killer is hysterical. Its cheerful tune and the incredibly funny lyrics really cheer me up.\r\n\"Oh, fuck it! I'm a monster! I admit it!\", This is the best line to sing along with.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nJust a sidenote... Wouldnt \"closing in on my fifteenth year\" actually make her thirteen?\r\nYour fifteenth year is when you are fourteen (like the 18th century is year 1700 to 1799), before turning fifteen and since she is \"closing in\" means she isnt yet, which would make her thirteen? Wrong?\r\nStill, one of his catchiest tunes ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ni like how many words the guy puts into his songs, its great. and i it makes a rabbid teenage serial sound hilarious!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nserial killer, i meant\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nIts great, sounds almost like a bar song. Very witty, funny lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThe song in itself is quite self-explanatory... \r\nToo long to sing it in concerts though...\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nSo it's Rorschach and Prozac and everything is groovy! Ahh man I love the sense of complete \"manic\" that surrounds those lines. I think this song is about being beyond denial and strait into insanity. It's that happy wide eyed looks you get when you sing it. While anyone could read the lyrics as being sarcastic, you know that the character isn't being sarcastic, instead she's trying to hold on to what ever happiness she can obtain even if it's a lie.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThat doesn't stop them though paretus.  from the live performances i've heard thy extend it to include solos for the band members.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nThe tune to this is very similar to the one in Henry Lee, which is also features La la la lah, la la la lie/lee, which is also a bit similar. I wonder if the girl who stabs Henry and throws him down the well is the Curse Of Milhaven?\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nWithout the lines about Bill Blake's little boy and the children ice skating, I'd find this song a bit funnier. That's the thing about Nick Cave, he doesn't censor himself and by the time your cringing in disgust at a greusome lyric, he's already moved on and wants you to keep up. Brilliance!\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\n\"Twenty cops burst through my door without even phoning\" always makes me smile - a true genius at work here\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nHmmm.. The sentence \"Mama often told me we all got to die\" always gives me the feeling that there's more to this song than just a catchy violent tune. Perhaps she's trying to say she feels this as not only natural, but also completely cathartic? As if she is only helping to rush the inevitable death of all God's creatures. Just a thought...\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nTo xdvr, I know what you mean. When I first heard the song, I thought to myself 'The melody sounds a lot like Henry Lee' and when the La's came in, I came to the conclusion that it had to be connected, or at least purposefully done.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nfunniest song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI actually feel like Loretta most of the time. Except I keep my intentions to myself.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nhappybecause - i thought exactly the same thing the first time i heard this song. i agree, it feels like she speeding up the inevitable by killing the people - \"it's going to happen anyway, right?\"\r\nxdvr and sam walton - yeah, i definitely see a connection between this song and 'henry lee'. but if it is the same girl, she must have been released from the asylum some years later, seemingly 'normal'. but when 'henry lee' happened, this 'thirst' for murder resurfaced.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nthis is a very old comment to respond to, but i thought id do it:\r\nStraylite Prozac wasnt even approved for use in the US until 1987 and the Rorschach inkblot test wasnt in use until 1921. these facts combined with the fact that lottie mentions the year '91 leads one to believe that lottie was captured after 1991. so the answer to your question, when she says \"closing in on my fifteenth year\" she means she is 14 going on 15\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nsorry, there should be a comma between Straylite and Prozazc, as the answer was to Straylite's question.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI love this line.\n\r\n\"Like my eyes ain't green and my hair ain't yellow\r\nIt's more like the other way around.\"\n\r\nthat's great writing to be honest. using the imagery from earlier to twist her into the vision of medusa or some snake like monster.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nsome times I listen to this song just to hear Nick Cave say groovy. He he. But that's not my favorite part. The Lines \"I gotta pretty little mouth underneath all the foamin'\" and \"Aw fuck it I'm a monster I admit it\" hit me hard\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThe song is self explanatory, and there's not a hidden beneath the surface, so I can't really add to the meaning. I just want to say I think this song is absolutely amazing, and I love how Cave will take on a character's viewpoint for a whole song.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThis album has a lot of great songs, and this is definitely one of the best.    I love the fact that she didn't actually kill little Biko - and that she refuses to take credit for it - whether she believes that is an unethical think to do against fellow murders or whether its because she believes its simply beneath - i prefer the latter - it fits her character better.\n\r\nI'm not in front of the lyric booklet - but i think it should be weevil - which is a little beetle - weavil, i don't know what weavil is - i don't think it's a word. I may be wrong though - either way, i think that's my favorite line. \n\r\nNo hidden meanings here, just a straightforward, violent and lyrical holocaust of a ballad from cave again - noboby tells a story like him.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nJust to add to my earlier comment, I managed to sing this in front of a small audience of about 25. It was awesome, though what Nick Cave sings on the album version has many words slightly different to what's up there.\r\nBut that's just what I know from having learnt them well enough to sing the whole song by heart, heh. I do recommend it though, if you learn it now then you can sing it at any short notice stage thing!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\ni really enjoy this song but i do have one question. What is a weavil? or is it just somthing to rhyme with evil\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nIf you come to song meanings looking for answers to questions, i find it helps to read what people have written.\n\r\nAs posted above - a weevil is a small beetle - which makes the phrase sensible. I just like the idea of a small toddler that is palpably evil - just something about their eyes or demeanor which foreshadows great malevolence - like the movie the Bad Seed (no pun intended here, but interesting non-the-less.)\n\r\nIt's written as weavil, and once again I'm not in front of the booklet right now, so I'm not sure what that has to say on the matter - but i don't know if weavil is a real word. But, weevil definitely is.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI think the underlying message behind the \"we all got to die\" is Cave implying that, apart from being a full-blown psycho, the reason Loretta is doing all the killings is because she misinterpreted what her mother meant when she kept saying that. Like, she meant it in a \"we will all die in the end, can't be prevented\" way, Loretta took it as \"we all HAVE to die\".\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI often wish Nick would write a song(s) from the perspective(s) of Stinky Bohoon and/or his friend with the pumpkin sized head.  Sure they have a story to tell.....\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThe bit about \"Bill Blaikie's little boy\" is amusing to me, because Bill Blaikie is the name of a respected politician (now retired) from Manitoba. He does have a boy, though nobody in that family can be called little...\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nthis song is brilliant!! it makes something so sinister and evil (such as the murder of children sound)sound fun truley awsome song!  \t\t\t\t\n\t\t\t\t\n\n"}