{"comment_0": "\nI think a lot of people are reading too much into this - organized religion or war or whatever.\n\r\nI think it's a lot more basic than that, though. If you want to live your life, have relationships, love other people, well it's inevitable that you will just end up weeping for your trouble at some point. \n\r\nEverything ends sooner or later - relationships go sour, children grow up, friends lose touch, loved ones die, and then so do you.\n\r\n\"I won't be weeping long\"\n\r\nSo I guess it's okay to weep, to mourn, but you have to stop eventually and live your life too, or you'll miss all the good bits in between the sad bits? \n\r\nI dunno. I don't think this song is \"depressing\" just a... pleasant melancholy. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\n\"We heard of you, Father, we heard of you. I have buried my little son, and I have come on a pilgrimage. I have been in three monasteries, but they told me, 'Go, Nastasya, go to them'- that is to you. I have come; I was yesterday at the service, and to-day I have come to you.\" \n\n\"What are you weeping for?\"\n\n\"It's my little son I'm grieving for, Father. he was three years old- three years all but three months. For my little boy, Father, I'm in anguish, for my little boy. He was the last one left. We had four, my Nikita and I, and now we've no children, our dear ones have all gone I buried the first three without grieving overmuch, and now I have buried the last I can't forget him. He seems always standing before me. He never leaves me. He has withered my heart. I look at his little clothes, his little shirt, his little boots, and I wail. I lay out all that is left of him, all his little things. I look at them and wail. I say to Nikita, my husband, 'let me go on a pilgrimage, master.' He is a driver. We're not poor people, Father, not poor; he drives our own horse. It's all our own, the horse and the carriage. And what good is it all to us now? My Nikita has begun drinking while I am away. He's sure to.\"\n\n- Fyodor Dostoevsky, \"The Brothers Karamazov\"\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nProbably my favourite Nick Cave song. Simple, beautiful, powerful. All in one.\r\nOne of the best songs ever heard.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nOff one of his best album. But it doesn't get any recognition.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThe song sounds incredibly sad, but when I look at the videoclip it always make me smile, it's very tragic-pathetic.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIt simply is about life - if I stop laughing I only have weeping left.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nProbably my favourite Nick Cave song. Simple, beautiful, powerful. All in one.\r\nOne of the best songs ever heard.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nProbably my favourite Nick Cave song. Simple, beautiful, powerful. All in one.\r\nOne of the best songs ever heard.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nIt's one of my favorites also. I actually find the live version from Royal Albert Hall (I think) way better that the studio one. It's got cellos playing the whole song and it beautiful! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni could belive that. great song though. i saw him perform it live when he toured australia last. it was so friggin loud. anybody who was at the thebby theatre that night could back that up. probably my favorite bad seeds song.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song made me decide to buy my first Nick Cave and the Bad Seeds album. Awesome, haunting.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nIt is haunting.  I love how he distinguishes between merely crying and truly weeping in there.  Genius song, but what Nick Cave song isn't?\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis is my favourite Nick Cave song, if not one of my favourite songs ever. Blixa's voice is wonderful and dark, as is Nick's. I like the feel of this song... kind of a 'call and response'.\r\nas dark and haunting as the lyrics may be, it makes me happy. it's positive in a way, and the music kind of affirms that, for me.\r\nyes, i also adore how there seems to be a difference between weeping and crying. nick's songs always, always make me think.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThe meaning of this song I always thought was pretty straightforward. It's about how people hurt those that they love, how life puts us in emotionally painful circumstances, and, well... weeping, and how we move forward regardless.\n\r\nPersonally I feel that musically, this period in time was when Nick was at his best, though I still very much appreciate his later works. It's a shame that Blixa left the Bad Seeds though. He and Nick make a powerful combination.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nThere is something very biblical about this song...very Old Testament...\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nThink it has usual strong Nick Cave religious overtones. To me it is about how organised religion makes people so subserviant and miserable. About original sin and no matter what people do they're going to do the wrong thing.\r\nIt's humourous of course - the whole idea that all mankind is sad and even the innocent free spirits (children) will be weeping when they grow up.\r\nI may be wrong of course but this is what it says to me.\r\nHe is a brilliant poetic lyricist\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI dont know why but this song always makes me think about the Trojan War. I imagine the wives and children of the Greeks, waiting on the beaches for their men to sail home.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI think this song is about war; how it affects the role of men and women in society; and then i got the ieda that God is the father in song-so he is the one weeping for humans taking humans life.\r\nthe son...is a small boy in the \"why\" stage of life, asking God a question to which responds.\n\r\nso in short, i thought it was an antiwar song.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI've always thought of this as a story about a civilization's response to pain -- a way that men could allow themselves catharsis, and then move on.  The same way that we have funerals, church services, etc., the people in the song have their weeping song.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThe song is about the brief interval of sadness between ignorance and apathy.\n\r\nA father decides that it is finally time to show his son the true sadness of the world.  He shows him the sadness of men and women.  The son recognizes the sadness of children, but the father says \"no, they're only crying\".  The son is used to being told white lies to protect him from the world, but he is already wise to those deceptions, and snarkily asks \"Oh, they're only crying?\"-- He thinks he is sophisticated, and can see through the coddling falsehoods that adults present him with.  But then his father says \"No, true weeping is yet to come.\"  In the past, when the father said that \"they're only crying\", it would be to try to protect his son, and would mean that the world is better than it seems.  Now, it is to enlighten his son, and to show him that the world is even worse than he thought.\n\r\nSeeing the end of his son's innocence, the father starts to cry, and the son, still naive, apologizes for making his father cry. But the father says \"I won't be crying long.\"  The world stays sad, but we erect walls of apathy to separate ourselves from that sadness.  This is a song in which to weep--after it is over, we will force ourselves to stop weeping, and stop caring.  No one else will comfort us, so we will rock ourselves to sleep, and the way in which we can finally sleep is to harden our hearts, until the only thing that can move us back to tears is the act of forcing someone we love to harden their heart in turn.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nHas someone messed with the lyrics? These are for The Ship Song.\n\nThe Weeping Song has the word weeping in it.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nthis song is great but really quite depressing. apparently it's been banned in like 6 countries because so many people commit suicide listening to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nYes, yes, yes.  Writing about this seems silly.  It's about weeping.  Fathers and  Sons.  And choosing when to weep \"I won't be weeping long!\n\n\n"}