{"comment_0": "\nI think it's about Cliff dying. Just take the line:\n\r\n\"You make me smash the clock and feel...I'd rather die behind the wheel\"\n\r\nThe day after Cliff died, James completely destroyed his hotel room and among the things he destroyed was an alarm clock. He also got drunk and was out in the street screaming Cliff's name, asking where he was and wishing he had been the one who died. \"I'd rather die behind the wheel\" - behind the wheel of the bus - in the back of the bus, in one of the bunks - is where Cliff was laying when the bus flipped, hurling him out the window and being crushed.\n\r\nI'm just glad I got to see him live when they opened for Ozzy...awesome bass player.\n\r\nJB\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nive heard a lot of different meanings for this song but here is the one that hear a lot and read newsted talk about:\r\nits about the band losing cliff burton..and not knowing how to move on from there..and knowing that theyd give anything to have him back..and hoping that they can move on and not feel the pain of cliff dying forever\n\r\nalso, the lyrics were written by the entire band..and newsted did most of the musical arrangment (yay)\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThe S&M version of this song is easily one of Metallica's best songs ever. I can relate to the lyrics, and I agree with what King Nothing has said. One of Metallica's most underrated songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nAfter reading all of your thoughts, I've discovered that I know nothing of the subject matter. But could I possibly throw in something new?  The songs title caught my eye. \"The Outlaw of Torn\" is a historical novel written by Edgar Rice Burroughs around 1914. The meanings you've come up with are present in the character Norman of Torn. It is a short story and could add to the complexity of this song. I am convinced that it has some bearing.\r\nOutlaw of Torn\r\nOutlaw of Torn\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nOkay so this outlaw meets this girl and she totally changes him for the better but then she left him or he left her, I can't remember which.  But then he now searches for her because he loves her and what not but he'll never find her, she's long long long gone.  Happen to you?\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIts actually\n\r\n\"I'm Outlaw Torn\"\n\r\nIf you have seen the S&M live video, he clearly says- \"I'm Outlaw Torn\" -\n\r\nNOT-\"Outlaw of Torn\"-NOT\n\n\r\nI think it's more he's looking to hurt/kill the person who took his love away.\n\n\n\n\n", "comment_6": "\nbeen there, done that...\n\r\nthe weight of this song never fails to move me. damn shame they couldn't fit the whole thing on Load :)\n\r\nthen along comes the S&M version of the song which gave it twice as much weight, making it an unstoppable powerhouse.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nIt's about Cliff. James' unending search for someone or something in his life to replace Cliff.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\ni like forthelove's interpretation but i think Lowman's/ JB's is more correct...i never knew that before....gr8 song and the S&M version is awesome..espcially when the orchestra plays thier part...wish i get a song like this when i die :D\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nLowman, your comment has bumped The Outlaw Torn to my favorite Metallica song.\n\r\nSo...epic...so...epic... \t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ndEFINATLY a kick ass MetalliFuckin'Ca Song Hell Yeah.Kicks ass esp with symphony\n\r\nANFENRY\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthis song is about james's father and mother dying and him waiting for the person to replace them but it never comes\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\n\"You make me smash the clock and feel \r\nI'd rather die behind the wheel\"\r\nits deffanitely about losing someone and rather than losing them they would die themselves but the first lyric i put doesnt really make sense with the meaning yall have been saying cuz it sounds like that person is controlling them and they cant get away from it.... any comments? \n\r\ni love this song.... probly one of the best and its even better on s&m\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nI gained a new respect for this song after i lost someone close to me to suicide, it kinda reminds us we're all vulnerable, no-matter how much we \"strut\"\n\r\nbut that's just my take on it\n\n\n", "comment_14": "\nI think it may be about James' mother. He wrote Mama Said as a personal song which he was persuaded to put on the album. I think this one might be his 'album track' about his mother. In Mama Said he talks about needing her to love him and comfort him and now never being able to have that. I think the outlaw moniker here suggests the recklessness that drove him away from his mother and then the searching is his endless search for her love. If you have the S&M dvd, at \"the more I bless\", James folds his hands in prayer. I think he is symbolizing the idea that the closer he gets to a spiritual life, the more he is reminded of his mother's spirituality (which he believed had failed her - The God That Failed).\n\r\nI struggled a long time with the \"smash the clock\" line, but now I think I have it. It means he is angry at time for continuing on past this death and then the \"i'd rather die behind the wheel\" bit means he would rather have lived through that time with the person who died (his mother) than escaped it (by running off with the band). Sort of saying he would have rather struggled through rough years against his mother, secretly knowing her love than to have been free of the pain so early and never get that part of the relationship.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\na truely great piece of music i love kirks solo, this song made me think, the lyrics are so deep, this may be the way i would feel if i lost a close loved one. ne way metal up your ass!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nIs it me or Metallica is the most visited band on this site?????? I found this site by wanting to know what BLEEDING ME meant...hehehe\n\r\nI've never heard this song from the album...I've only seen it on the S&M version but I really dig the way the orchestra gives a sense of the desert....you feel that you are seraching for her with the rest of the band.....\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nI think this song is about someone close to you dying and how you want to be with them, i.e. commit suicide.  However, the person who is searching for their loved one is crying out to the others to keep them in check with these lyrics:  \"Hear me\r\nAnd if I close my mind in fear\r\nPlease pry it open\r\nSee me\r\nAnd if my face becomes sincere\r\nBeware\r\nHold me\r\nAnd when I start to come undone\r\nStich me together\r\nSave me\r\nAnd when you see me strut\r\nRemind me of what left this outlaw Torn\"\n\r\nEven though the other \"thing\" is gone....you'll go on searching...fucking amazing song.  Symphony adds so much texture to the song\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThe line: \"And know I wait my whole lifetime... for you\"\n\r\nis actually \"And now I wait my whole lifetime... for you\"\n\r\nI wont comment on the meaning of the song because you guys already nailed it\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI guess its no wonder why James drank.  Hes lost both his mother and father if i am not mistaken, not to mention Cliff to boot.  \n\r\nWhen my grandpa died i nearly lost my mind.  I imagine the rigors of being the top metal band and wanting to stay there, not to mention not having a real family outside band whom you always fight with, would drive anyone to drink.  \n\r\nIt could be to his mom, his dad, cliff, who knows to be honest.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI think it's basically about losing someone close to you and never finding someone special enough to replace them Whether it's parents, a close friend or girl/boyfriend. \n\r\nI agree with metallibanger05. Kirk's solo is awesome, and so is James' solo in the lead up to Kirk's. They are an awesome band. This song really makes you just want to hang on to everybody you love, doesn't it?\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nyes, you are right.\r\nin the original, jason's voice sounds quite good in the background. though in his earlier live concerts, his singing is quite foulsome and disgusting. yet comical!!\r\nit took me a while to get into this song on S&M, but now its one of my favorites..\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nFor me the song is more of a personal nature.  It talks of the struggle within; hence,  the outlaw torn.  He looks at the outlaw, who he once was, anger and discontent for what he had been and his new life, the one he struggles to keep.  The Outlaw keeps creeping back and he must fight it.  the opening line for me tells me that he is looking for his inner-self.  He would rather die behind the wheel then to return to the outlaw.  He can't deal with this struggle and finds himself asking for help from his lady, he gives her instructions for him.  If you see me strut, remind me of what made this outlaw torn.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nEasily one of the top 5 Metallica songs ever S&M rocks!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nneedless to say this song ment alot to me. (hence my name)\n\r\nas u all have said its a song about increditable loss. possible regret judging in addition to alot of these lyrics the lyrics from Mama said, because they where both written about the loss of Hets mom to cancer.\r\nmy favotite Metallica song of all time and i own Kill 'em All to St. Anger.\r\n-Josh\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThe S&M version is easily James best vocal performance. I love his voice, and this song mkes makes me love him too.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nAnd know I wait my whole lifetime... for you\r\nAnd know I wait my whole lifetime... for you\r\n(Something he has wanted his whole lifetime)\n\r\nI ride the dirt; I ride the tide... for you\r\n(Someone)\n\r\nI search the outside, search inside... for you\r\n(He looks in the world, and within himself)\n\r\nTo take back what you left me\r\n(He finds someone has left him something inside, but lost it, and now wants it back, so he searches)\n\r\nI know I'll always burn to be\r\nNo one seeks so I may find\r\nAnd now I wait my whole lifetime\r\n(No one else seeks for him or can so he waits, wanting)\n\r\nOutlaw of Torn\r\nOutlaw of Torn\r\nAnd I'm Torn\r\n(An outlaw, rebel, torn between doing what is within the outlaws nature, and this thing he searches for)\n\n\n\n\r\nSo on I wait my whole lifetime... for you\r\nSo on I wait my whole lifetime... for you\n\r\nThe more I search, the more my need... for you\r\nThe more I bless, the more I bleed... for you\r\n(The more he looks for this someone, the more the need is to find the someone)\n\r\nYou make me smash the clock and feel\r\nI'd rather die behind the wheel\r\nTime was never on my side\r\n(Time is running out in this search and he feels just like giving up the search, again torn)\n\n\r\nSo on I wait my whole lifetime\n\r\nOutlaw of Torn\r\nOutlaw of Torn\r\nOutlaw of Torn\r\nAnd I'm Torn\n\r\nHear me\r\nAnd if I close my mind in fear\r\nPlease pry it open\r\n(He is asking the someone to hear him, and to open his mind to the someone that hears)\n\n\r\nSee me\r\nAnd if my face becomes sincere\r\nBeware\r\nHold me\r\n(If he acts like he is being heard, he might not believe it anyone, so he is asking the some to hold him to help him keep believing in the somone)\n\r\nAnd when I start to come undone\r\nStich me together\r\nSave me\r\n(If he turns back to his outlaw ways and unbelief in the someone that hears him, he wants the someone to help him get it back together, then he wants the someone to save him) \n\r\nAnd when you see me strut\r\nRemind me of what left this outlaw Torn\r\n(And if he shows pride, he is asking the someone to knock him off his high horse and remind him of just what made him tear away from his outlaw ways)\n\n\r\nMake what you will of it, thats pretty much a walked down of the way alot of people see it, and as for any claims of James or anyone saying it means this or it means that, you'll have to bring me the cited publication/show/recording ect ect . . . \n\r\nTo the writter is a sinner, torn between sin and Christ, has felt Christ inside in the past, and yet feels lost or torn between sin and Christ and is pleading to Christ to remind him of way he was torn away from being an outlaw in the first place.\n\n\r\nKingJehu\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nthis song is amazing! i agree the S&M version is just AWESOME! this is a really good song...to me its about losing some, regretfully, and searching for them and never finding them...means alot\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nTo me this song says sorry. And or help me.\r\nevery one keeps using the \"make me smash the clock and feel:I'd rather die behind the wheel\" as a referance to cliff. As an exchange. no saying it isn't but what about the start of the line, \"you make me\". By seeing/talking to/thinking about some one feelings they don't want are stired up. And he'd rather die in a car crash than face them. Also the talk of needing some one and bleeding for some one. Sounds like guilt again. The lyrics after \"hear me\" he asks for help, then warns them, as if having caulsed them harm before and to cap it off he tells them to shoot him down if he ever regans his pride as it where.\n\r\nAlso i think the lyrics with the title is SO important. the use of the word OUTLAW, and what could do this to a man with such little moral standing anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\ni like what you said guilty party. The solo on this song is my favorite Hammet solo, he gets some amazing sounds out of his guitar.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nmy favorite metallica song! I listen to it over and over...it never gets old. I love the vocals,bass,drums and the wicked guitar solos.\n\r\nMETALLICA LIVES!\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nits about cliff, dudes! the whole band wrote the lyric part. you knew that if Cliff hadnt pulled that ace of spades to get the seet that he was in, James would of had died.. If Metallica still had Cliff.. im sure they would be the best fucken band on earth (& they are just that no one would even doupt it) and of course we wouldnt of had st.anger.. man that album made me sad!\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI think that the use of \"You make me smash the clock and feel,\" and \"I'd rather die behind the wheel,\" are being taken far too literally, that it is referring more to the since of helplessness the narrator is feeling, that he has no control over his life and his world (which works well with James condition, just look at why things went down with Jason the way they did, he fears not having control), that he would rather die in control of his life than to live by fates decree.  Aside from that, I think the rest has already been said. \n\r\nYou make me smash the clock and feel\r\nI'd rather die behind the wheel\r\nTime was never on my side\r\nSo on I wait my whole lifetime\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nMy interpretation of the song is someone whose lost a really close friend or perhaps a girlfriend/boyfriend, in the sense that they've died. The term Outlaw describes the individual, becuase if you've ever lost someone close to you, you go through a stage where you try to blame it all on yourself, making you feel like a criminal, or someone who's unwated, hence Outlaw. The reason the song has such a lonesome and sad theme is becuase its trying to convey the feelings you have when you just want to be seperated from the world. You just want to be left alone, but at the same time you want someone to help you through it, which leads me to the chorus. \n\r\nHear me\r\nAnd if I close my mind in fear\r\nPlease pry it open\n\r\nHere we have the individual wanting to shut themselves away from everyone, but desperatley wanting someone to intervene and lend a hand with the grief.\n\r\nSee me\r\nAnd if my face becomes sincere\r\nBeware\n\r\nTo me, this is the stage where you want absolutely no human contact. You lash out at everyone around you, trying your hardest to pushe everyone away so that you dont get close enough to anyone to get hurt again.\n\r\nHold me\r\nAnd when I start to come undone\r\nStich me together\n\r\nNow this is definatley after the grief and anger have subsided, all you want is someone to comfort you. You crave attention and desperately need someone there for you.\n\r\nSave me\r\nAnd when you see me strut\r\nRemind me of what left this outlaw Torn\n\r\nThese lines are about once the whole ordeal is done with, and you;ve started to move on, you feel almost obligated to not let anything joyful back into your life, like becuase that person is gone you dont deserve to be happy anymore.\n\r\nOk, now on to everyone favorite debate:\r\nYou make me smash the clock and feel\r\nI'd rather die behind the wheel\r\nTime was never on my side\r\nSo on I wait my whole lifetime\n\r\nThe line \"You make me smash the clock and feel\" to me describes the sheer madness that engulfs you after the intial shock of the ordeal, and how you want time to stop, you dont want to have to go on, you dont want to see the next day, and no matter how numb you feel from it all, you still feel the anger and grief tearing at you.\n\r\nOk, I know I'm going out of order, but this is just how I interpret it.\n\r\nNow, on to: \r\nAnd now I wait my whole lifetime... for you\r\nAnd now I wait my whole lifetime... for you\n\r\nI ride the dirt; I ride the tide... for you\r\nI search the outside, search inside... for you\n\r\nThis is the time period that is a few weeks, maybe even a few months after everything is said and done. \n\r\nThe lines: \"And now I wait my whole lifetime... for you\" are about how even long after the person is gone, you feel that somehow they'll be back. Something deep down still hopes that it wasn't real, but you know it is, so the terms \"my whole lifetime\" to me mean less of an actually time period, and more of the feeling of how the word \"lifetime\" portrays a sense of drearyness the way its sung. \n\r\n\"I ride the dirt; I ride the tide... for you\r\nI search the outside, search inside... for you\" to me is about how no matter how much time passes, somedays you'll search just about any memory for fragments of that person. Images of what they looked like, the feelings they gave you. \"I ride the dirt\" to me sounds like how sometimes all you can think about is the few fights you may have had with the person, or maybe the small flaws you used to point out in your head. \"I ride the tide\" is more of the good times you had with the person. \"I search the outside, search inside\" to me again is more literal of how on the outside you'll try to hold onto maybe a few pictures or even an article of clothing, whereas the search inside is again trying to latch onto the few memories you can still vividly remember.\n\r\nOk, for the last part.\n\r\nTo take back what you left me\r\nI know I'll always burn to be\r\nNo one seeks so I may find\r\nAnd now I wait my whole lifetime\n\r\n\"To take back what you left me\" to me means that you try your hardest to live up to any form of guidance, or try to follow something that person believed in, as if it would give you some kind of solace to know that you're carrying on maybe their dream or trying to succeed at something they failed.\n\r\n\"I know I'll always burn to be\" talks about how no matter how much time passes you still consider them to be your friend, and the passion in your heart never fades.\n\r\n\"No one seeks so I may find\" is about howyou feel hopeless soemtimes becuase you think that you're the only person who keeps the memories alive, and no one else cares anymore.\n\r\nOk, if you read that whole translation, I thank you for experiencing something very tragic that occured to me. I lost a very close friend in a very horrible way, and this song helped me through so much of it, I wanted to share my feelings about it. Again, it may not be how everyone feels, including the band, but maybe you can get a better personal connection to the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI think it could mean about how after Cliff died,they had such a hard time finding a replacement bassist. The song could be about Jason himself. Almost 5 years after the song came out,Jason left. Oddly,it could be about how it hurt James,Kirk,and Lars when he left\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nMy God, this is by far the best Metallica song ever. I love the guitar, James' voice is absolutely amazing, and the guitar solo is just incredible.\n\r\nHear me\r\nAnd if I close my mind in fear\r\nPlease pry it open\r\nSee me\r\nAnd if my face becomes sincere\r\nBeware\r\nHold me\r\nAnd when I start to come undone\r\nStich me together\r\nSave me\r\nAnd when you see me strut\r\nRemind me of what left this outlaw Torn\n\r\nThis part of the song is just beautiful, got no other words for it.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\ni agree with lowman, and could the phrase \"time was never on my side\" possibly mean that cliff died way too early? im just speakin my mind, it could be a possibility.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nlowman, you just gave me a new light on this song...Cliff is my idol and i am so jealous you got to see him perform, he died the year before i was born.  your description makes perfect sense too.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nNo doubts this song is about Cliff\r\nbut as its usual everyone of us can proect the lyrics on our life and see sum meanings, that are relative to us\r\nfor example the meaning of losing some1 very precious to us\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI think in terms of James writing this, i think it's about Cliff being taken from him, and his parents or anyone that has passed away in his life that meant a lot to him... and maybe a failed relationship in the past. \n\n\r\nAnd the part \"hear me\" and so forth, is James maybe asking his wife, or band members to keep him on the straight and narrow if he starts to go off the rails... \n\r\nAnd I think anyone can make this song relate to something in their life... which is why I love James' lyrics... you can interpret what you like and it still all makes realistic sense. \r\nHe fucking rocks!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nWe know for a fact that is about losing someone...I think that the line \"You make me smash the clock and feel\"\r\nI'd rather die behind the wheel\" shows that is dedicated to Cliff. He'd rather die behind the wheel of the bus instead of Cliff because he is suffering more by being alive missing him. Someone earlier posted that Jaymz destroyed his hotel room after Cliff's death which leads the the clock mentioned in the song, but of all things in a room Jaymz mentioned smashing a clock, which can be interpreted as you made lost track of time by waiting for you or someone like you. Metallica never fully recovered form Cliff's death, just look at the date of this song and the date of cliff's death, Jaymz still continues to write about him.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\n\"You make me smash the clock and feel\r\nI'd rather die behind the wheel\"\n\r\ni really think that kirk wrote this, as he challenged cliff for the seat, and this is a way for kirk to say that he regrets losing that, and having cliff killed.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nMy personal thought behind the song is it's about someone who he loves, has died...  And now he has to wait his whole life (without that person) until he finally dies too, and see's them in another time and place. He said \"You make me smash the clock and feel...etc\"  That means theres nothing he can do about the situation but wait until it's his time to die, so he can see that person again. \"I'd rather die behind the wheel\"...means he'll devote the remaining of his life for the search that will lead himself to that person he lost. \"Time was never on my side\"... He feels punished because his whole life is wasted now. And so on... and so on...  I think the song is really quite this simple...but an awesome song it is. And yes the S+M version is the best!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI luv this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI believe that like all Metallica albums, Load, was a complex work of art. It interprets a diffrent chapter in the continuing saga of Metallica. At least i think. I also think that its an amazing album, especially The Outlaw Torn. it is undoubtly my favirote song by Metallica. My interpritaion is that maybe its James searching for something he can't find, a previous part of his life? when he was younger, but now he is older and his children, so maybe he is torn between these lives. But my personal feeling is that this song is about losing someone. Someone very dear and near to you, so close your torn to pieces when they leave. Once they are gone, there is always a hole in your heart form them. It can heal, but for me anyways, it will always be a scar. \t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nFor me this song is about someone who the song writer cares for. He is asking for the person to take care of him:\n\r\nHear me\r\nAnd if I close my mind in fear\r\nPlease pry it open\r\nSee me\r\nAnd if my face becomes sincere\r\nBeware\r\nHold me\r\nAnd when I start to come undone\r\nStich me together\r\nSave me\r\nAnd when you see me strut\r\nRemind me of what left this outlaw Torn\n\r\nOr another way to interpret it would be that the person is dead and the song writer is waiting for them. \"And now I wait my whole life time for you.\" etc Waiting for death. The chorus i copy pasted could be, in this interpretation, addressed to other people atround the song writer. Asking for help to not commit suicide to be with the person who died quicker.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nthis is my favorite metallica song.  for the longest time it was battery- and that will always be my fave thrash song, but from a broader palette (which is why i love metallica since there's so many styles of theirs to fall in to be it R&B, speed, nu-metal, or just classic metal) this song rules all.  \n\r\nthe fact that there are so many interpretations to this song, all of which are correct as they're all based on our raw emotional responses to the song, is a testament to it's pure viscerality.  if every listener is able to imagine completely new scenarios with a song, then that proves how truly awesome it is.  definitely the most underrated- i know the first time i listened to load i didn't even make it past the opening crescendo of scratches.  along with bleeding me, fixxxer, and low man's lyric, the outlaw torn is now among my tops because of how far it blows me away with its passion and power.  \n\r\nand every time i play these four songs for friends or even girlfriends of mine, they're always quick to agree with me: that metallica is one of the greatest bands of all time, and definitely worth a second or third (or in my case, according to my itunes library, 213th) listening... \t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI get how most guess it's about Cliff and I consider that guess likely, but I think it could as well be about someone seeking revenge for something.\n\nWhoever the protagonist is searching for is unreachable. He (or she) can not think of much else than the revenge he's seeking, so he waits his whole life time and searches for the person who has torn him his whole life time. \"Time was never on my side\", either means that the protagonist is running out of time, or that the person he's searching for gets further away/harder to find, the more time passes by. It's not even sure if the protagonist exactly knows who he's seeking.\nThe last part is the protagonist motivation to continue his quest. His goal is the only thing he wants, so he doesn't want to fear anything that may distract him. If his face becomes sincere, the searched person shall beware, the protagonist is about to get his revenge.\nIf he starts to come undone, the goal will motivate him once more. This thought process seems to be what the song is about.\nThe protagonist wants his enemy to knock him down of his high point, once he see's him strut.\n\nOverall I think this makes sense, I can agree with what songanchorange said.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nI always thought The Outlaw Torn was about James' internal battle between who he is really and who the public/fans think he is, and want him, and Metallica, to be...\n\n\"And now I wait my whole lifetime for you\"... I liken this line to Neil Peart's lyric in Rush's Limelight, \"I can't pretend a stranger is a long-awaited friend\". However, I also think there could be an element of fame addiction here as well.\n\n\"I ride the dirt, I ride the tide for you\"... Alludes to the continuous touring Metallica does to play for as many fans as possible.\n\n\"I know I'll always burn to be\"... Alludes to the Montreal incident that left James badly burned due to a pyrotechnics issue.\n\n\"The more I search, the more my need for you\"... James' further admission that fame and adulation are addicting, \n\n\"You make me smash the clock and feel, I'd rather die behind the wheel\"... Best lyric of the song, and probably the most debated. My interpretation of this line is that James is tired of getting up day after day after day, to cater to fans/kids that really don't know who he is, or really care. I do agree there may be a Cliff reference here; James was certainly distraught over Cliff's death and maybe a bit angry that he had to carry on while Cliff did not.\n\nAnd then there is the whole \"Hear me...\" lyrical bridge, literally begging the listener to understand that he (James) does not want to be this way, and to cut him some slack and help him to cope. My favorite line here is:\n\"And if my face becomes sincere... beware\"... This is James declaring that it's all fun and games until you push him to the breaking point, and then watch out, because he is Metallica... and you do not want to get Metallica mad at you.\n\nAbsolutely my favorite, and in my opinion, far and away the best track from the Load/ReLoad albums.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThis song is about not being able to move one from the death of a friend or lover.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nIsnâ\u0080\u0099t this such a powerful song? Both versions are jaw dropping.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI always thought it was about an obsessed stalker.  Eminem's \"Stan\" kinda vibe.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nIf you read my comment above James sorry about talking about personal things I know nothing about \r\nThis song helped me because someone else felt the same way as me, to spill your guts out on a page and let people judge U on lyrics that are yours and yours alone is outstanding, I don't know you at all man but you have helped me and countless others\r\nThank you Metallica\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nThis song is clearly talks about James addictions \t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nDefinatley the best song on the Load album It's about losing somone in life and desperately seeking a replacement that never comes. \n\r\nWhoa, last night I had a dream I met Jaymz Het he was a total asshole and that sux b cuz he's like my hero along with Jim Carrey and John Davis.  I'm sure he's a pretty cool guy in real life...\n\r\nSorry, just thought I'd mention that.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nThis doesn't have to do with the meaning of the song, but, all you guitar players out there: is there not a bass riff in this song? It is played during the quiet parts of the song. Before the very first lyrics \"and now i wait my whole lifetime\" there is a quiet part. Turn up the volume and you can hear bass notes. Is this just a tuned down guitar string or can the guitar not hit this low of a note? Why isn't newsted in the song credits if it is base? Is it a roadie? Geez...\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nThis song is clearly about an ongoing battle with drug/alcohol addiction. He's looking for something or someone who will make him feel the way he used to when he was high, who will fill that void in his life. The implication is that he fucks up, and will likely continue fucking up as he tells his friend/lover/whatever 'if i close my mind in fear, please pry it open...if my face becomes sincere, beware...when you see me srtut remind me of what left this outlaw torn' The profile here is that of a true addict, he wants closeness and companionship, but his ongoing search for internal peace leads him only back to his addiction. This in turn distances him from everyone, thus he is an outlaw and constantly torn between two states of being: sober and accepted/loved by whoever, or intoxicated and free of all restraint but alienated from those he cares for. This song perfectly expresses the ongoing hell that is recovery from addiction, all the while being very subtle about it. Awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nThis song is most definitely about the book The Outlaw of Torn by Edgar Burroughs \n\n\nAnd know I wait my whole lifetime... for you\nAnd know I wait my whole lifetime... for you\n(An allusion to the hole in Norman of Torns life that eats away at hime. He was raised by a fencing master to be a killing maching and thusly never recieved the love a father can provide, so on her searches for what can fill this hole.)\n\nI ride the dirt; I ride the tide... for you\nI search the outside, search inside... for you\n(Allusion to escapades Norman gets into as he plunders the country-side, but still missing something to make him whole\n\nTo take back what you left me\nI know I'll always burn to be\nNo one seeks so I may find\nAnd now I wait my whole lifetime\n(Norman of Torn lashes out at the de Vac who raised him as a killing machine but never taught him love and its true potential)\n\nOutlaw of Torn\nOutlaw of Torn\nAnd I'm Torn\n(Norman is Torn between pleasing de Vac an annihilating the English as he raised him to or trying to fill this void in his life that has been left by not receiving the love of his father growing up.)\n\nSo on I wait my whole lifetime... for you\nSo on I wait my whole lifetime... for you\nThe more I search, the more my need... for you\nThe more I bless, the more I bleed... for you\n(Search for love whether its through de Vac's wishes or his endevour with Bertrade, the daugter of de Montfort for whom he has a relationship with)\n\nYou make me smash the clock and feel\nI'd rather die behind the wheel\nTime was never on my side\nSo on I wait my whole lifetime\n(Again, he stills feels this whole that de Vac has created by raising Norman to be a brutal killing machine. He wasn't raised by a father with love like most, so this quest to fill this hole left by missing this part of his life will forever go on.)\n\nOutlaw of Torn\nOutlaw of Torn\nOutlaw of Torn\nAnd I'm Torn\n\nHear me\nAnd if I close my mind in fear\nPlease pry it open\nSee me\nAnd if my face becomes sincere\nBeware\nHold me\nAnd when I start to come undone\nStitch me together\nSave me\nAnd when you see me strut\nRemind me of what left this outlaw Torn\n\nHear me\nAnd if I close my mind in fear\nPlease pry it open\nSee me\nAnd if my face becomes sincere\nBeware\nHold me\nAnd when I start to come undone\nStitch me together\nSave me\nAnd when you see me strut\nRemind me of what left this outlaw Torn\n\nAt the end of the book Norman faces of with King Henry and de Montfort but is killed by de Vac before he can finish what he was raise to do, kill King Henry. As de Vac is dying he reveals that Norman of Torn is in fact King Henry long lost son Richard who de Vac stole as a part of his plot for vengeance. In the end, its revealed that Norman did not die and awakes to reconcile with his real father and take the hand of Bertrade who is the daughter of de Montfort essentially ending the crisis between the two familes. The final stanza's in Metallica's so appear to be, and this is my opinion, Norman of Torn calling out to the newly found love in his life that his life has been a struggle and he isn't quite whole yet, but with there love he can be the best person he can be.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nSomeone close to him died,\r\nI'd say he's seeking answers from someone who is dead\r\nWhen they died they smashed the clock because hetfileld began to feel emotions about that person he wanted to ignore, time was never on my side, maybe because time only matters with loved ones\r\nThey died and now he waits his whole lifetime\r\nDying behind the wheel , dying in the fast lane rather than feeling,,drugs alcohol whatever\r\nThe other person is someone he loves that he spilled those demons to, because this there the one that can save him with their love\r\nMy outlaw torn probably is that part of him that doesn't care and runs from pain\r\nTorn between love and hate\r\nThe Dark side of him \r\nMy outlaw eg the part of him that ran away from the pain and numbed himself\r\nHe says ' I know I'll always burn to be the one who seeks so I may find' \r\nSeeks answers to find himself who he was before that dead person changed him and tore his life to pieces with guilt and anger and hate \r\nBecause he loved them \n\r\nI think it's bout his mother\r\nI feel similar emotions about my father\n\n\n"}