{"comment_0": "\nthis song is about vampires!! for serious!!!\r\nit just makes way too much sense.\r\nwhen it is featured in break dawn, i will not be surprised. instead, i will stand up and yell, CALLED IT.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song has to be about vampires.....kinda like an Edward and Bella situation. Think about it:\n\r\n\"Yeah I'm a monster but I'm no Frankenstein\" \r\n\"You go 'bout your day baby while I hide from the sun\" \r\n\"If you knew what I was you's would run and hide\"\r\n\"We would live forever. Who could ask for more. You could die if you wanted. But baby what for?\"\n\r\nIt's about a guy asking a girl to \"go into the night\" and become a vampire. lac6589 is right. It has to be in the new twilight or a movie that rips off twilight\n\n\n\n\n\n", "comment_2": "\nActually when I first heard this song I thought it was about vampires, mainly Twilight as well... but when I really thought about the song I realized it can relate to real people too - Psychopaths. Not the stereotypical psychopaths, either.\n\r\nI was recently diagnosed with Psychopathy and have had a hard time trying to tell my boyfriend... and this song exactly describes how I've been feeling.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nYeah I'm also pretty sure it's about drugs or something similar related to seedy nightlife, maybe also a mental issue.  It's left open so it can fit your particular vice!\n\r\nI think it would be perfect in Twilight or another similar vampire movie though!\n\r\nHowever, I do think it was written about drugs or related psychosis.\n\r\n\"I'm complicated/you're as straight as they come\"\r\nI have issues; you don't partake in any vices, but I have tons.  (\"straight\" also refers to someone who doesn't party/do drugs.  this usage was more popular before the word took on the meaning of heterosexuality.  bruno mars has an old school vocabulary, so it makes sense that he would use \"straight\" to mean someone who refrains from drugs.)\n\r\n\"I hide from the sun\" doesn't have to refer to vampires.  It can refer to seedy nightlife.  He goes out at night because that's when all the bad stuff happens, all the parties.  I myself hide from the sun, and even though I'm pale, I'm not a vampire.  I'm just a miscreant who prefers the night.\n\r\n\"you won't know what it's like until you try\"\r\nsuggests that it is a particular activity of some sort.  of course this line is great for a vampire parallel.  good for breaking dawn especially.\n\r\n\"cross the LINE\"  coke reference?  it's stretching it, i dunno.  otherwise it could be more general, because once you try something you're stuck and corrupted, kind of like drug virginity (lol that sounds so stupid)\n\r\n\"If they say life's a dream\r\ncall this insomnia\"\r\nlucidity that can be related to drugs, but also any other nightmare of a life, so any major problem.\n\r\n\"'Cause this ain't Wonderland\r\nit damn sure ain't Narnia\"\r\nyou can't talk about wonderland without drugs.  it's alluding to tripping into an alternate universe, but it's not so great because they have lots of problems.  like using a drug to run away from all your issues.  the fact that it ISN'T is part of a theme throughout the song of something painfully ordinary.  he can't escape from the reality of his own life, no matter how hard he tries.  similar to \"i'm a monster/but i'm no frankenstein\" which of course counters the idea that it's about twilight.\r\nit's saying that the speaker is a real person. \"i'm a monster\" because he has these problems/addiction, but frankenstein represents the supernatural, and I think a lot of this song is consciously going the other direction, about some serious real life problem, and, as i said, the desire to escape but inability to do so completely.  however, this can get twilighty if you want, because twilight makes vampires very ordinary. so...\n\r\ni wonder if that made sense.  to be honest i'm just procrastinating doing my homework, that's why i gave such a long analysis.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI'd also like to point out two more things.  haha.\n\r\n1.For the twilight interpretation people, I noticed something kind of cool:\r\nIn the beginning it sounds like a wolf howl in the background if you listen closely.\n\r\n2.There are three vocalists on this track, all of whom probably wrote their own verses, so it's very probable that each one took the general idea in slightly different directions that all go together in a way.  which is pretty neat.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think you could apply this to someone who is gay and wanting someone who isn't, maybe that straight person is a close friend.\n\r\nTruth of the matter is, I'm complicated (i'm gay)\r\nYou're as straight as they come (you are straight . . .)\r\nYou go 'bout your day (without being judged for who you are)\r\nwhile i hide from the sun (because 'coming out' would hurt)\n\r\nIt's better if you don't understand\r\n'cause you won't know what it's like\r\nuntil you try (try, to be gay with me)\n\r\nyou know I, i'll be waiting on the other side (I'm gay | You are straight)\r\nand you, all gotta do is cross the line (come be gay with me)\r\nI could wait a whole lifetime\r\nbut you gotta decide (between straight or gay)\r\nyou know I, i'll be waiting on the other\r\nWaiting on the other side (I'm gay | You are straight)\n\r\nwe could live forever\r\nwho could ask for more\r\nyou could die if you wanted (face all the hate with me)\r\nbut baby what for (it's too much for you to handle)\n\n\r\nIt's better if you don't understand (i wouldn't want you to get hurt)\r\n'cause you won't know what it's like (it would be to real for you to handle)\r\nuntil you try (unless you try to be gay with me)\n\r\nyou know I, i'll be waiting on the other side (I'm gay | You are straight)\r\nand you, all gotta do is cross the line (come be gay with me)\r\nI could wait a whole lifetime\r\nbut you gotta decide (between straight or gay)\r\nyou know I, i'll be waiting on the other\r\nWaiting on the other side (I'm gay | You are straight)\n\r\nIf they say life's a dream\r\ncall this insomnia\r\n'cause this ain't wonderland\r\nit damn sure ain't narnia\r\nand once you cross the line (to be gay with me)\r\nyou can't change your mind (once your gay, you're gay)\r\nyeah i'm a monster (by the rest of society's standards)\r\nbut i'm no no Frankenstein\r\nand quite frankly\r\ni've been feeling insane in between my eyes\r\ni really can't explain what i feel inside (being gay is natural)\r\nIf you knew what I was you'd run and hide (if you knew if i was gay, would we still be the same?)\r\nMany have tried to go into the night (hide in the closet, it's dark as night in here)\r\ncross over the line and come back alive (open the door, and be free, be alive)\r\nbut that's the price we pay when we living on the other side (it hurts to be gay)\n\n\r\nyou know I, i'll be waiting on the other side (I'm gay | You are straight)\r\nand you, all gotta do is cross the line (come be gay with me)\r\nI could wait a whole lifetime\r\nbut you gotta decide (between straight or gay)\r\nyou know I, i'll be waiting on the other\r\nWaiting on the other side (I'm gay | You are straight)\n\r\n(it's better to not cross, you won't get hurt)\r\nit's better if you don't understand \r\nit's better if you don't understand\r\nit's better if you don't understand\r\nit's better if you don't understand\r\nit's better if you don't understand\r\nit's better if you don't understand\n\n\n", "comment_6": "\nI honestly think this song is about vampires or werewolves...as gay as that sounds, but it sounds like it was made for twilight or something.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni think he's admitting 2 his girl that he's gay: \r\n\"Truth of the matter is I'm complicated\r\nYou're as STRAIGHT as they come\"\r\n...\"And once you cross the line\r\nyou can't change your mind\"\r\n...\"I really cant explain what I feel inside\r\nIf you knew what I was you would run and hide\"\r\n...\"It's better if you don't understand\"\n\r\nthats wat i think...\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\npersonally i feel this song is bout a love triangle, one guy is on the outside while the girl he wants is with someone esle.\n\r\nYou know I\r\nI've been waiting on the other side\r\nand you, all you gotta do is cross the line\r\nI could wait a whole life time\r\nbut you just gotta decide\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nFirst off, I love this song. I agree that it's about vampires, but to be honest, I hope they did this just for fun, instead of for a twilight movie, because that would degrade the value of both this song, and my view of Bruno as an artist~\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nMy interpretation of the song is that this guy is serious about his relationship with the girl, and she isn't. She's on the fence, and he's still waiting for her. He's formed something of an obsession for the girl and he can't just be friends with her because of it. It hurts him. So he's saying that if she's ready to be serious, he'll be waiting. The other side is a pretty common lyrical phrase, and it usually seems to mean the other side of life, where you do it together with a person you love, as opposed to doing it alone, and just looking for kicks from whoever you may be hanging with.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI REALLY don't want this to be about vampires and werewolves (I hate Twilight) but now that I'm listening to it a bit more closely, it fits perfectly. There's even a wolf howl thing at the beginning and in the middle :o\r\nI always thought it was just about living more as an outcast or rebel instead of a \"regular\" person. \r\nThis song is the best either way :D\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nJust noticed there's a chunk missing out of these lyrics!\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nForgive me for taking a more realistic look at this song.  This is just my opinion, but I think it's just about a mysterious guy.  He's talking to a girl, and persuading her to make it official.  She doesn't know everything about him and he seems to be a dark person because of past relationships, perhaps.  She's intrigued by him, though.  As for the darkness, monster, not understanding, etc. allusions, I just think they're metaphors for the unknown.  Like I said, he's mysterious and guarded.  He's urging the girl to step out on faith and trust that he's not going to hurt her.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI think it could be about a boy who wants a girl to love him back. \n\r\nIt's better if you don't understand (letting her know he loves her)\r\nCause you wont know what it's like \r\nUntil you try (loving him back)\n\r\n'I really cant explain what I feel inside\r\nIf you knew what I was you's would run and hide' (just fear of rejection)\n\r\nAnd once you cross the line\r\nyou can't change your mind \r\n(don't want her to change her mind and not love him back)\n\n\n\n\n\n\n", "comment_15": "\nYes, I believe he is making a literal connection to the vampire/werewolf theme, but underneath that, I think he's trying to convince a girl to fall in love with him.  To \"cross the line\" and follow him into an unpredictable yet passionate love affair.  He's confessing his love for her, saying he could \"wait a whole lifetime\" - not literally, of course, but he's basically saying he wants her, and only her, and will wait for her to make up her mind to love him.\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nIt's totally about vampires, how much more obvious could it get - \r\n\"You go 'bout your day baby, while I hide from the sun\"\n\r\n ??\n\n\n", "comment_17": "\nOMG it hit me after I read your comments.\r\nI think it's about werewolves (/vampires?).\r\nThere are so many hints, for instance:\r\n- The howling at the beginning and the end\r\n- 'You go bout your day baby, while I hide from the sun'\r\n- 'I could wait a whole lifetime/we would live forever'\r\n- 'Yeah I'm a monster, but I'm no Frankenstein'\r\n- 'If you's would know what I was you would run and hide'\n\r\nbut then I also read boi513's comment and it also makes sense\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nbruno mars said on an interview recently that it was about vampires\r\nit was either his interview with nick cannon or the one with elvis duran\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nIn the beginning he doesn't say \"truth of the matter is I'm complicated\" you can't just read lyrics and assume them to be correct, don't you guys have ears of your own? Truth of the matter is I'm complicated is has 11 syllables, whatever he says at the beginning of the song only has 9. I'm still trying to figure out exactly what he says but it sounds like he's saying \"children there is so complicated\" which doesn't make any sense. \t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nThis song is about dealing with the devil for fame and fortune like many artist in the music industry. \r\n\"you can live forever\" with anything you really wanted. \r\nCee lo Green, Bruno Mars, and B.o.B. want you to give it a try.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nIt's about drugs. But he's not trying to get her to do drugs, it's the complete opposite. Listen to the lyrics.\n\r\n\"It's better if you don't understand\" Which mean it's better if you don't understand what it's like to be addicted and what pain you go through.\n\r\n\" I could wait a whole lifetime, all you gotta do is cross the line\" Means all you have to do is just take the smallest amount and that's it, your instantly addicted.\n\r\n\"I've been feeling insane in between my eyes \r\nI really cant explain what I feel inside\r\nIf you knew what I was you's would run and hide\"    If you knew what it was like to always have this craving for pills.\n\n\n\r\nIt's about drugs, it is!\n\n\n\n", "comment_22": "\ni am in love with this song now! its just so funn. and i love bruno, cee lo, and b.o.b \n\n\n", "comment_23": "\ni am in love with this song now! its just so funn. and i love bruno, cee lo, and b.o.b \n\n\n", "comment_24": "\nwhen i heard this song I remembered a friend who passed away recently..  To me it was like someone might be  singing this song to a beloved person(friend, family, lover) that he/she left behind, dedicating this song to them.. That he/she is on the Otherside (It's better if you don't understand, Cause you wont know what it's like).   Its like a monologue.\n\n\n\n\r\nI've been waiting on the other side\r\nand you, all you gotta do is cross the line\n\r\n ''I have passed away to the otherside now, all you gotta do is cross the line''  here for me is like the spirit of the dead person calling the beloved person who left behind to come with him/her if its suffering from pain, and depression. Like ''cross the line and come with me, to the Otherside, to the Other world..''\n\n\n\r\nWe would live forever\r\nWho could ask for more\n\r\n''if you come to the otherside we would live forever, like be together forever who could ask for more than that. (Who could ask for more?)''\n\n\n\r\nYou could die if you wanted\r\nBut baby what for\n\r\n''we could be together forever, if you died.. But baby what for?''\n\n\n\r\nCause this ain't Wonderland\r\nit damn sure ain't Narnia\r\nAnd once you cross the line\r\nyou can't change your mind \r\nYeah I'm a monster\r\nbut I'm no Frankenstein \r\nAnd quite frankly \r\nI've been feeling insane in between my eyes \r\nI really cant explain what I feel inside\r\nIf you knew what I was you's would run and hide\r\nMany have tried to go into the night\r\ncross over the line and come back alive \r\nBut that's the price we pay when we living on the other side \n\r\nHere is clear, its like the spirit/ghost is talking to the loved one he left behind, saying: ''If you really want to come with me, you have to make up your mind but be sure for that, because then you cant come back.  Cause there(on the otherside) its not like Wonderland, maybe you wont like it, and once you cross the line you cant change your mind, you can never go back. In addition, Im a ghost, maybe you will be scared when you see me, but dont! I might look like a monster but Im not frankenstein, If you knew what i was you would run and hide! and to be honest Im confused, it feels like Im going insane, I cant explain what I feel!  Many of us have tried to go into the night, cross over the line and come back to life!  But thats the price we pay when we are living on the otherside.. So you have to decide and be sure.  I could wait a whole life time for you, for an answer but you just gotta decide.''\n\n\r\nThats what I thought when I heard it.  I might be wrong, though.  Who knows? Thats just my oppinion.\r\nThank you, and sorry If I confused you!\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nwhen i heard this song I remembered a friend who passed away recently.. To me it was like someone might be singing this song to a beloved person(friend, family, lover) that he/she left behind, dedicating this song to them.. That he/she is on the Otherside (It's better if you don't understand, Cause you wont know what it's like). Its like a monologue.\n\n\r\nI've been waiting on the other side\r\nand you, all you gotta do is cross the line\n\r\n''I have passed away to the otherside now, all you gotta do is cross the line'' here for me is like the spirit of the dead person calling the beloved person who left behind to come with him/her if its suffering from pain, and depression. Like ''cross the line and come with me, to the Otherside, to the Other world..''\n\n\r\nWe would live forever\r\nWho could ask for more\n\r\n''if you come to the otherside we would live forever, like be together forever who could ask for more than that. (Who could ask for more?)''\n\n\r\nYou could die if you wanted\r\nBut baby what for\n\r\n''we could be together forever, if you died.. But baby what for?''\n\n\r\nCause this ain't Wonderland\r\nit damn sure ain't Narnia\r\nAnd once you cross the line\r\nyou can't change your mind \r\nYeah I'm a monster\r\nbut I'm no Frankenstein \r\nAnd quite frankly \r\nI've been feeling insane in between my eyes \r\nI really cant explain what I feel inside\r\nIf you knew what I was you's would run and hide\r\nMany have tried to go into the night\r\ncross over the line and come back alive \r\nBut that's the price we pay when we living on the other side \n\r\nHere is clear, its like the spirit/ghost is talking to the loved one he left behind, saying: ''If you really want to come with me, you have to make up your mind but be sure for that, because then you cant come back. Cause there(on the otherside) its not like Wonderland, maybe you wont like it, and once you cross the line you cant change your mind, you can never go back. In addition, Im a ghost, maybe you will be scared when you see me, but dont! I might look like a monster but Im not frankenstein, If you knew what i was you would run and hide! and to be honest Im confused, it feels like Im going insane, I cant explain what I feel! Many of us have tried to go into the night, cross over the line and come back to life! But thats the price we pay when we are living on the otherside.. So you have to decide and be sure. I could wait a whole life time for you, for an answer but you just gotta decide.''\n\n\r\nThats what I thought when I heard it. I might be wrong, though. Who knows? Thats just my oppinion.\r\nThank you, and sorry If I had confused you! \t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ni think it means that he's a vampire (\"I'm complicated\" \"I hide from the sun\" \"we could live forever\") and the girl doesn't really understand (\"It's better if you don't understand\") but he wants her to become a vampire too (\"And you won't know what it's like until you try\" , \"cross the line\") the coincidental thing is i first heard this the day before Halloween lol \t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI relate it to psychosis, and obsession towards one person, it doesnt need to be \"psychosis\" it can be as simple as the \"timeless world\". It can be about processes in life, there are things that is meant to happen, no matter how dark it is.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI love this song, mainly for the tune but I also love the lyrics.\n\nMy interpretation is that Bruno is singing about having difficulty coming to terms with being seriously in love with a not- famous girl and the problems with being famous.\n\nIt's about asking the girl to make the jump between a normal life without him or \"crossing over the line\" and being with him in the limelight, where they would encounter more trouble from rumours and generally being famous. \n\nHe says how he \"could wait a whole lifetime\" because obviously he can't force her to make that sacrifice/ make that change but it's what he wants because he loves her.\n\nThis theme runs throughout the entire song, and I love it!\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nWow, I am really not sure what this song is about (homosexual infatuation? drug use? suicidal ideation?) but I know one thing after playing it...I can relate somehow. I enjoy this artist (don't really listen to the genre much tho)\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nHeard this song this week for the first time and in the mood that I was in I thought it was about possible suicide. \n\n \"Im complicated, youre as straight (laced) as they come\"  \n \"You go 'bout your day baby\n While I hide from the sun..........(depressed wanna be in the  dark)\n\n\n It's better if you don't understand\n 'Cause you won't know what it's like.......(only those in that frame of mind know the suicidal feeling)    \n Until you try..........(it'll be too late if u try and you cant tell me that u now know how it feels) \nI don't watch Twilight, but I loved the comments that connected some dots to the vampire scenario, much better than my dark moody interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nFIRST :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nhmm i kinda think this song is about depression?\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nyeah, i'm thining depression.\r\nGODDD, I LOVE THIS SONG.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nAlso, I think the \"You could die if you wanted\" could be a reference to the cookie cutter lifestyle that so many people eventually give in to. To go off another movie, it's kind of like the NOTEBOOK (one of my faves) in that Bruno is the man (Noah Calhoun) who loves her for her spontaneity and knows she has the potential to be something greater than what her family/educators may have planned for her.  \r\n\"It's better that you don't understand\" could refer to him persuading her to accept life's unpredictability, to take a chance, one that she may not completely understand, yet feels right to her because she is so in love with him.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nthis song is about them being demons in hell waiting for people to cross the line and forsake heaven for the instantly gratifying sins that lead to hell. they are practically licking their chops for the poor fools who have a whole life time to make their decision. the part where they say its better if you don't understand means that if they told you everything in plain non metaphorical english you would either (a) not believe them, or (b) you would choose heaven. they don't want you to choose heaven so \"its better if you don't understand. oooooooooooooooooooooo spooooooky\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nIt's better for all you people - the fact that you don't understand.\r\nI DO.\n\r\nIt's about DEATH.\r\nGoing to the other side means dying.\n\r\n\"'Cause you won't know that it's like\r\nuntil you try\" - it's true about dying.\r\nYou won't EVER know what it's like, unless you are really really DEAD.\n\r\n\"I could wait a whole life time\r\nbut you just gotta decide\" - You've got your whole life(time) to decide if to die or not\r\n(eventually it'll happen)\n\r\n\"If they say Life's a dream\r\nCall this Insomnia\" - Life and Death are opposites, kinda like sleeping or keeping awake\r\n(when you've got insomnia).\n\r\n\"Many have tried to go into the night \r\ncross over the line and come back alive \r\nBut that's the price we pay when we're living on the other side\" - if you want to die, and you do, you can't just CROSS THE LINE (die) and come back alive.\r\nthat's the price you pay when you're living on the \"other side\".\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nSo I'm like 99% sure this is about drugs, and trying to get his girl to do it with him, which he doesn't really care, but he really wants her to make up her mind lol\t\t\t\t\n\t\t\t\t\n\n"}