{"comment_0": "\nI don't know how this one could have gotten past me, but I just discovered this song. I guess everyone else already knew this, but clearly one of the master works of the era, and the amazing cover by Cash will likely seal it as an all-time classic. I want to share some of my thoughts about this song, but I donâ\u0080\u0099t have time to write this as well as Iâ\u0080\u0099d like. Please forgive its excessive length. \n\r\nFirst, a note on the music. It's very unusual for a song from the rock tradition. No verse course arrangement, just a building repetition, interrupted early in the song by narration in the same voice. Clearly a product of its time, the studio version is produced as an â\u0080\u009calternativeâ\u0080\u009d cut with a pretty typical post-punk sound. Itâ\u0080\u0099s almost like no one quite knew what to do with this song, including, one assumes, Cave himself. It takes a few listens for it to sink in that there is something much deeper going  on here than the style initially suggests. In later, live versions, Cave seems to have come to grips with exactly what he has here and performs it in a more fitting way. Thatâ\u0080\u0099s not to take anything away from the studio version. The kind of weird juxtaposition of substance and style make it something that you have to discover and lets you go deeper into the song with repeated listens. The work it takes to pick through the pop veneer makes you appreciate your discovery that much more.\n\r\nThe construction of the song has a great trick that is remarkably effective. The chord progression itself is wonderful, but itâ\u0080\u0099s eight measures long, and seven of them build a tension that is only briefly resolved by the eighth before it immediately returns to uneasiness. It makes the whole song feel incredibly intense and unrelenting, which is analogues to the subject: a man on death row awaiting the electric char. \n\r\nWhich brings us to the lyric. There have been great song writers whose lyrics stand alone as poetic statement, but this has to be one of the best bits of poetry in its own right released on a rock record. Itâ\u0080\u0099s possible that I want it to be even better than it obviously is, but I read a little more into it than some. In the beginning monologue he proclaims his innocence, or at least sort of. â\u0080\u009cOf which I am nearly wholly innocent, you knowâ\u0080\u009d. Later he talks about his hands and fingers, one evil and one good, of which he observes â\u0080\u009cThat filthy five! They did nothing to challenge or resistâ\u0080\u009d. As if to proclaim his innocence, blaming the whole incident on these filthy five fingers. Tellingly, it is the â\u0080\u009ckill-handâ\u0080\u009d that â\u0080\u009cWears a wedding band that's G.O.O.D.â\u0080\u009d He calls the ring â\u0080\u009ca long-suffering shackle collaring all that rebel bloodâ\u0080\u009d. \n\r\nI read all of that to give an ambiguous meaning to guilt or innocence. A man, maybe not cut out of the same cloth as everyone else, doing his best to live as society dictates but finding himself unable to live up to the expectations. Itâ\u0080\u0099s a cognitive dissonance that eventually plays out in murder, but a murder this complex man does not blame himself for. This is a character that lives uncomfortably in a world not of his making. And as such, death can almost be welcome, a sentiment repeated throughout the song.\n\r\nThe middle verses about Jesus are the key to the whole thing, I think. He notes the irony that Christ was born and then, after making a life as a carpenter, he is crucified on a work of carpentry. He paints, quickly, a view of Jesus as another character who wasnâ\u0080\u0099t able to live as others expected and ultimately met the same fate he himself awaits. He then goes on to further identify himself as a Christ figure by noting that He now sits on his heavenly throne, but down here itâ\u0080\u0099s made of wood and wire, an obvious reference to the electric chair he will soon take his seat in.\n\r\nBut what to make of that last line: â\u0080\u009cBut Iâ\u0080\u0099m afraid I told a lie.â\u0080\u009d I donâ\u0080\u0099t think this is a confession of guilt. Thatâ\u0080\u0099s already happened, really. We know he did it, and we know he did it for no reason anyone else could call â\u0080\u009cmotiveâ\u0080\u009d. So whatâ\u0080\u0099s the lie? I think thereâ\u0080\u0099s a clue in the verse structure. The line comes in the same resolve measure thatâ\u0080\u0099s repeatedly told us â\u0080\u009cIâ\u0080\u0099m not afraid to dieâ\u0080\u009d. A man who has lived his life with conflicting thoughts once again has to face the fact that what heâ\u0080\u0099s told himself to be true may not be. As he climbs into what heâ\u0080\u0099s convinced himself is the mercy seat, he realizes that he actually is afraid. \n\r\nWeather he means it the way I hear it or not, itâ\u0080\u0099s difficult to argue that this song is anything but brilliant. Clearly one of the best songs of the era, maybe one of the best rock songs ever. As an observation at the end of a review about a song that deals with death, Iâ\u0080\u0099d say this to Nick Cave. Walk through life confidant that, in a world of mortal men, you have made a mark that transcends mortality. A true masterpiece that will leave a strong legacy. \n\n\n", "comment_1": "\nGreat work all. Cave is a master of metaphor and it is good to see so many people care about what he is actually trying to say.\n\r\nWhile there are many themes in the song, the predominant one uses guilt and innocence to explore the objectivity of truth. In this regard it is greatly influenced by books such as \"The Outsider\" and Crime and punishment. The \"I begin to chill to objects and their fields\" line is taken straight from Dostoevsky.\n\r\nFrom our characters view, having denounced mans right to judge him, God is the paradigm of truth, and the song explores the implications of such belief with great depth and subtle precision.\r\nThe uncertainty of his actions and and as such why he would commit them if they were wrong or unjust, leads to the analogies with Jesus, who is the ultimate victim of his own fate. \r\n It is fitting that as the song begins to reach it's climax and his disdain becomes bolder that he picks the wedding band, a symbol of Gods holiest institution on earth, as the shackle of his rebel blood, life and spirit, which is suggestive of a truth he can't explore, indicating the fallacy of his God.\n\r\nThe last line \"I'm afraid I told a lie\" is not a submission of guilt, it simply sums up a fearful yet enduring uncertainty on all matters, as he is not sure of guilt or innocence or god or truth or any other yardsticks, right or ability, to measure his supposed crime.\n\r\nCash's version is of a different flavor, his emphasis put on haunting nobility, a beat prince trudging towards a destined fate in almost heroic fashion, while Cage focuses on the subjective, with dark, all too human, undertones creeping through the prose. Which makes it, lyrically at least, a far more interesting work.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI must say that this song confirmes that nothing is black or white. How can anyone see what is good and what is bad, when we twist it all. So many people has died on a chair, or soo, and ho's to blame for it? Their blood is on our hands. We are no better! Just a bunch of a hypocrites. Can't we learn on a cilling Jeasus. No! There was a lot of \"Jesuses\" throughout the history.  \r\nSo, whay would killer believed our judgment, and accepted that he is guilty? \r\nJust in a moment of death, when he's alone with God and freed from all delusions of a mankind, he realises what he truly has done.\r\nJust my opinion.\r\nGreat song!!! \t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nwell, i agree with that interpretation, but not wholly.\n\r\ni think that in the last few moments of his life he doesn't know whether he's innocent or not.\n\r\nif he did it, he's told himself so strongly that he was innocent, that it's hard to accept guilt.\n\r\nand if he didn't, he's been told so frequently that this is why he's being murdered. this is his punishment.\n\r\nthere is proof, not enough. \r\nbut could i have done it and blocked it out? my EVIL hand wears a wedding band called GOOD. \r\nis it hiding it's true self?\n\r\ndid he do it?\r\ni think it's all interpretation.\n\r\nin all i think this is internal conflict for him: what is the truth?\n\r\nnick cave is brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nForget about the context for a moment.  The song is about fear of death and the uncertainty surrounding the gray areas of truth and morality that all of us wrestle with, not just those on death row.  \"Am I a good person?  Did I live a good life?\"   \t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nMercy Seat isn't so cut and dry.  Everyone wants to know: Did he get executed for a crime he didn't commit?\n\r\nOf course not.  With the lyrics as a weak defense case, we see a stubborn murderer using his final breaths trying reconcile the bitter life he had.  \n\r\nWhen you're jailed and stripped of your freedom, you begin turn into the victim you murdered.\n\r\nThe song is about how one is always haunted by their incidents of bad karma.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\n\"My kill-hand is called E.V.I.L.\r\nWears a wedding band that's G.O.O.D.\r\nTis a long-suffering shackle\r\nCollaring all that rebel blood\"\n\r\n\"Kill-hand\" may be a poker reference - under some rulesets in which the game is short but the stakes are high - but here I think it's simply a colourful name for his right hand, the one which would wield a weapon. \n\r\nThe E.V.I.L. / G.O.O.D. probably refers to knuckle tattoos, often sported by prisoners. That he's on death row would indicate he's had these applied during a former stretch in general population.\n\r\nWedding band would mean good and evil are inextricably linked, and the good balances the evil & somehow restrains it from getting (excuse the pun) out of hand. The lines following would support this idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis is one of Nick's many songs built around a story, although this one isn't as immediately clear as some of his others. \n\r\nIt concerns a killer, though exactly what he did isn't explained. He's convicted and sentenced to death, all the while claiming he didn't do it. While on Death Row, he discovers Christianity, and in his final few moments before dying, he confesses (to himself, and to God) that he is guilty of it after all. The Mercy Seat of the title is a reference to the throne of God, and also to the electric chair.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nwell, i agree with that interpretation, but not wholly.\n\r\ni think that in the last few moments of his life he doesn't know whether he's innocent or not.\n\r\nif he did it, he's told himself so strongly that he was innocent, that it's hard to accept guilt.\n\r\nand if he didn't, he's been told so frequently that this is why he's being murdered. this is his punishment.\n\r\nthere is proof, not enough. \r\nbut could i have done it and blocked it out? my EVIL hand wears a wedding band called GOOD. \r\nis it hiding it's true self?\n\r\ndid he do it?\r\ni think it's all interpretation.\n\r\nin all i think this is internal conflict for him: what is the truth?\n\r\nnick cave is brilliant.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ngah. bump.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nA great nick cave song, but actually a better cover by Johnny Cash?\n\r\nYes, believe it. Although he mixes up the chorus a little, Johnny does a less creepy version.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nWhen a criminal is on death row, they'll say anything to get out. Every criminal in jail claims to be innocent.\n\r\nAfter 5. 10, 15 years of saying a lie, it becomes the truth. I believe Cave in the song is representing that. At the last moment, the criminal has to deal with the fact he may well have committed the crime.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI tend to think that the killer only admitting to \"a lie\" in the very last line represents that very last second of his life, when he realizes lying to himself now isn't going to get him anywhere.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nApparantly one of the first songs Nick recorded after he cleaned up.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nwatch the live version on launch.  best version i've heard...\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nluigi vampa, listen to the album that this is from, watch the video of this song. nick is not clean at that time!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\ni think Nick cleaned up right before The Good Son... could be wrong though\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nBrilliant song. The Johnny Cash version is phenomenal.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nit's appropriate that Cash covered this song, it's definitely got his spirit in there - the good/evil turning inside out, the listing and climactic-countdown style he was so fond of, taking the perspective of a killer, a moment of epiphany, etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nConcerning the character's duality between truth and untruth, I think it can also be seen as a duality between guilt and innocence, in the sense that the character might not consider himself guilty according to his moral standards, therefore telling the truth, but failing to understand why he's being judged by it.\n\r\nThis song is absolutely amazing. You should listen to the KCRW live version, if you think Cash's version is better.\n\r\nBy the way, as for Nick's \"cleanness\", I suppose he kicked it after The Good Son, but was on and off until around The Boatman's Call, where I think he put an end to it. Not sure though.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nCave wrote this song after he had watched on videotape an execusion on an electric chair.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nCouldnÂ´t it also be that the character simply is trying to convince himself that heÂ´s \"not afraid to die\", but, in the last minute of his life, fails to do this?\r\nThis, in a way, also suggests that heÂ´s guilty, of course...\r\nThe original version of the song has such an infernal, agonized quality to it! The acoustic version (along with Johnny CashÂ´s) has more of an epic (almost heroic) heavy feeling. Both great in their own way, donÂ´t think IÂ´d be able to choose...\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\ni believe that the album this song belongs to (Tender Prey) its mostly about guilt and sin. The song immediately after this, that's called Up jumped the devil, its all about being \"doomed from the start\", doomed to live a life of guilt.  So i suppose the central theme of the song is the ambiguity between guilt and innocence, but probably what Cave was trying to suggest was that no one is innocent. The character is, indeed, trying not to be afraid of death, but this depends on him being either convinced to be innocent or guilty. Only if he thinks himself innocent he can go boldly toward his death\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\ni actually always thought that the \"but i'm afraid i told a lie\" meant that he actally was afraid to die, since that line replaced \"but i'm not afraid to die\" in the final chorus. \n\n\n\r\nregardless, johnny cashe's version of this is so ridiculously amazing, my mind boggles.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nkudos to nick cave for writing a kick-ass song, but the music just doesn't match the lyrics.  That is why I love Johnny cash's later albums.  He takes obscure songs, songs that nobody would ever think that he could change, and he does change it, and for the better.  Johnny's version is infinitely times better.  So much more emotion.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\n\n\r\nI've always thought this as well, that the man about to die is trying to show bravado towards to those around him, and to idea he'll have to face judgement once he's dead.\n\r\nHe thinks if keeps repeating that he's not afraid to die, that it will actually end up being true. \n\r\nThe last line could be seen as an admission of guilt for his crime, but equally could also be an admission that his claims the whole way through of not being afraid to die, was him lying to himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI think the \"but im afraid i told a lie\" is a confession. He lied, he was guilty and is afraid to die. Also the fire and smoke imagery makes me think of baptism by fire - by accepting his guilt and fearing god he's forgiven and baptised by fire. Thats just how I see it...\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nhuzzah to nightingalerider and gravityalwayswins (radiohead refrence, methinks?) growing up in the late eighties/early nineties, i continually changed my mind about what this song was actually about. \n\r\non the surface,obviously, it's about some dude getting the chair. but, dig deeper, and it can be about redemption, denial, conversion, guilt, enlightenment, regret, acceptance of one's fate. if you wanna get all socio-political about it; the usa is the only \"civilized\" western country that employs capital punishment. as, i'm sure you know, cave is not american.\n\r\ni've always loved the ambiguity of this song. hell, i love the music and lyrics, which is why we are all here. i'm especially happy that i introduced my girlfriend to this song, like, a year ago and she loved it. she thought it was timeless. don't you like introducing like-minded friends to gems like this?   \n\r\nanyhow, besides loving that it goes on for, like, two hours building and building, i love it's flexibility. i think i'm leaning towards the-narrator-is-guilty camp. consider his repentant admonishments to his hands; one murderous and the other, that filthy five, doing nothing to resist.\n\r\nas far as cash's version being superior....please. yes, johnny was a genius. yes, he took this song and made it his own. but as an improvement on the original? only cave's version rocks like that while giving you goosebumps.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nIs it really \"but I'm afraid I told a lie\"? I always hear \"And anyway I told the truth, But I'm afraid I don't know why.\" Going to have to listen to this again...\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nSo much said already, I'll only add a couple of thoughts:\n\r\nThe reference to the  \"kill hand\" makes it pretty likely that he was sentenced for a murder.\n\r\nAlluding to the wedding band makes me imagine that the victim was their spouse.\n\r\nThis was, indeed, already so much in Johnny Cash's domain, that his cover could hardly fail.   Each is too unique to compare and contrast.  If you had told me that Cave was covering a Cash song, I would've believed it until reading up on the matter.\r\ngo nick...    (and go johnny!)\n\r\n-phase\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nfantastic song. i love johnny cash's version but Nick's is my favorite.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\n\"of which I am nearly wholly innocent\"\n\r\nhe's guilty.\n\r\nI actually don't want to discuss the song's meaning but want to say I love how versatile this song is as a live number being performed in various forms ranging from a sombre ballad to a raucous shanty.\n\r\nAlso, I saw a documentary once where Nick was talking bout writing this song.  At the tim of the Mercy seat's conception Nick was living in Berlin alongside many great artist who flocked their for some unknown reason.  Anyway Nick was talking about the room he lived in at the time and he described it as having pictures on the wall, some religous and others ofa more pornagraphic nature of wome, bucksome women.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI love this song, Cash's version doesnt really do it for me. \r\nIt seems to me like he has personality issues, maybe MPD (Multiple Personality Disorder).\r\nAbout every verse has an allusion, and several contrasts, to good and evil. \r\nEvery other verse has an allusion to the bible or something holy. \r\nPart of him denies the suggested murder, while the other is like one of those convicts who take up biblethumping as a hobby while in prison, trying to make up for what they've done.\r\nIn the last few minutes, where he repeats the chorus over and over, it seems like he's alternating between the \"good\" and \"evil\" personalities...\r\nOne verse is \"And anyway there was no proof\r\nNor a motive why\"; so he's denying it; while the verse following it has \"And I've got nothing left to lose\r\nAnd I'm not afraid to die\", hinting that he knows what he's done is wrong, and he knows the consequences for doing so.\r\nIt also hints at MPD in the verse \"Like my good hand I tatooed E.V.I.L. across it's brother's fist\r\nThat filthy five! They did nothing to challenge or resist\"\r\nHes talking about how his hand did something horrible. \"that filthy 5; they did nothing to challenge or resist\" may mean his fingers. \r\nIt wasnt him who did it, but his hand. He KNOWS what 'it' did was horrible, and he's criticizing the hand for its, um... lack of better judgement.\n\r\nAny way you put it, this song gives me chills. I love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nOh God. Yes.\r\nEveryone has already got the meaning down. \r\nMakes me shiver. So good\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nI take a slightly different meaning from this song.\n\r\nI believe the song is about a much greater irony.  That is, that the man on death row believes so truly that he is innocent, that he considers himself Christ-like; dying for the sins of man.\n\r\nThe ultimate tragedy comes moments before death when he relizes he is instead the sinner.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\ngreat song...i think its about a man who's in the electric chair\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis song rules forever! Yes it's timeless and Johnny's version isn't better than Nick's.\n\r\nI like all the meanings been posted on here, i believe it's a masterpiece, an anthem... the words, the music, everything is just perfect!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\n\"My kill-hand is called E.V.I.L.\", his Red Right hand...\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThis is a thoughtful song...this is a very tough and hard murderer (he doesn't have a motive, he has a tattoo of \"evil\" on his fist that he did himself). He asserts again and again that he's not afraid to die and he never lied. But as the song goes on, he describes the Mercy Seat talked about in the Bible, and compares it to the electric chair, to which he's headed. The description of the prison is depressing and dark, the description of the Mercy Seat is horrifying and imminent. And I think, in the end, in the last line, the prisoner reveals that he did in fact tell a lie...he is afraid to die.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\n(Taken from a 1990 interview by Simon Reynolds called \"Blissed Out: The Raptures Of Rock\")\n\r\n\"It's the throne of God, in the Bible, where he sits and throws his lightning bolts and so forth. But it's also about this guy sitting on Death Row, waiting to be electrocuted or whatever. It's juxtaposing those two things. A person in his final days, thinking about good and evil and all the usual fare.\"\n\r\n[...]\n\r\n'The Mercy Seat' is about this person in solitary confinement, becoming more sensitive to inanimate objects, and as he sits thinking about human and Divine Justice, finding himself judging these things as Good or Evil.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nAm I the only one who thinks this song is very... Oingo Boingo-ish? The melody and even the way he sings it. Any opinions on this?\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\ni think there's a conflict and confusion between truth and lies in the mind of the convicted. Truth and lies are continually going around in his mind before being put to death and he's constantly \"weighing them\" up, this is why, i believe, there is so much repetition. I think his main lie is that he's lying about not being \"afraid to die\" and he actually is scared regardless of how many times he tries to convince himself he's not, also hence the repetition. As already stated above, i believe in the final line he is admitting he is scared. i think the song could also be pointing out the ludicrousy of the belief that all things are \"good or ungood\". The convicted is shown as having conflicting morals as is shown by his good hand and the evil of his \"killing hand\" and also him being \"nearly, wholly innocent\". He himself is also not wholly good or bad, this could suggest, as is everyone. I think cave was trying to examine the meaning of evil (maybe this is pulling it apart too much) or/and get into the head of the murderer and imagine what the convicted was thinking as he was being put into the chair. Of course, the murderer could infact be cave himself and he's thinking about his own guilt: this could be true as other songs on this album talk about not wholly \"good\" characters in the first person. Either way, this song had a real affect on me, especially on first listen; i think it's just a great idea for a song and greatly written as is a load of NC's songs. thanks\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nI understand the lyrics to indicate that under the pressure of 'the system', a man's definition of his own innocence can falter under the power of the those that represent truth. In other words, that the system is so powerful it can obliterate an individual's sense of truth to the extent that they begin to wonder if indeed, they are wrong and the system is right.  Eminem also talks about this:  \"I am whatever you say I am , if I wasn't then why would i say I am?\"  The system can exert SO much pain upon the human soul, through it's earthly mechanisms, and that pain is unrelenting even into death - and threatens to be beyond it if the 'truth' ain't admitted to, that the 'good son' will surely confess - yield to whatever the system dictates is / should be the case.  The mercy seat is the ultimate place of cleansing - and that being so, being placed upon it to be cleansed, a man must surely need cleansing.  The best part is where death takes over and the man is cleansed - but not of his sin, but the sin of the system.  ie.  I am cleansed of you all.  I think in the agonising moments of death, the protagonist gets the last word - I didn't die giving into your terms, I didn't die being staunch till the end, I lied . . . death is nothing, it has lost it's sting.  \t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nGreat post fasteddie72! I would like to contribute that besides a reference to the Red Right Hand, it is the killers hand that \"decides that the time is nigh\" in O'Malley's Bar!\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nAs much as I love Jhonny Cash, in this instance I have to accept that Nick Cave totallt owned this song and his version has not been improved on.\t\t\t\t\n\t\t\t\t\n\n"}