{"comment_0": "\nI'm not a huge fan of Mariah Carey but I do really like this song...it creates quite the mental picture of the night she is singing about...\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAbsolutely, I can picture that night she's talking about, and I actually remember my first time ever...very like the same feeling that gives me \"Fourth Of July\", letting yourself being take over by something that you know it's not going to last...and remembering it over and over, the years just don't seem to erase it...\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\ngreat song\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThis is probably her best lyrically...pretty easy to figure out, but eligible to even be called poetry.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI love this song, its awesome. The beat, the tune, her words - wow its great. It gives me an interesting feeling when I listen to it.. kind of mysterious, romantic, reflective, its great. Love the desire in this song and the passion. I love how open she is and how descriptive she is. Good video clip - she looks hot.\r\nAwesome song from an awesome album!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nAnd this version is missing the parts where they rapped.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nWe've got 'The Roof' but not 'Lullaby'?\r\nI'm ashamed.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThis is my JAM!>\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\np.s. get the Remix of this song with Mobb Deep. I love Shook Ones, which is why I love the Roof!! Makes the song THAT MUCH better.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nWow! This was shockingly poetic.\r\nI love pop music\r\nAnd I love really poetic stuff like Bob Dylan, Bright Eyes, Iron & Wine, Damien Rice, too\r\nBut rarely are pop and poetry married to each other so thoroughly\r\nAs \r\nThey Are\r\nIn This\r\nSong.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThis song is so great and really sexy. I can also imagine the night she's talking about. I bought â\u0080\u009dButterflyâ\u0080\u009d in 98 and it wasn't until two months ago I saw the video for this song, it was just like I imagined it! I really do think Mariah's peak was with Butterfly. I love \"Breakdown\" as well but this is my favorite. So deepâ\u0080¦\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nthis song reminds me of virginity lost..just imho\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis is one of my favourite songs of MC. It clearly depicts an event that she is reminiscing on, where shes met someone who she is deeply connected with emotionally.\nThis song always reminds me of a similar event, where I met someone. It didnt work out as perfect as the lyrics portray, yet it was still magnificent.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThe song sounds great because Mariah didn't actually create the music, just the words that she sang. Mobb Deep helped alot. It's still the greatest song off of \"Butterfly\"\t\t\t\t\n\t\t\t\t\n\n"}