{"comment_0": "\nI believe this song has it very clear in the lyrics... It's like, someone does what he/she likes and goes out to do it as best they can, and in their own way... and then get side-tracked following money (light of golden treasure) and then the frustration of facing his/her own mistakes and not having anyone else to blame but themselves...\n\r\nThe first unforgiven was the one unforgiven by society.\r\nThe second unforgiven was the one unforgiven by his/her mate.\r\nThis, the ultimate unforgiven, is the self-unforgiven... The one who can't forgive himself for what he's done...\n\r\nSo far Metallica are impressing me with a different sound than they had so far, and i have no oppinion formed. One thing I am tired of hearing is: Better than St Anger. \n\r\nSt Anger IS, musically, not as good as what metallica had us used to, but it must be heard in context. St. Anger is a public vent of all the poison in Metallica. You just watch the documentary (Some kind of monster) to understand that... The sound comes out crude and raw and unrefined just like a feeling. Just like a spontaneous punch.\n\r\nAt least that's my oppinion. And in that context, the whole album fits like a glove.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAmazing lyrics... you can relate this song to so many things. Starting something, getting lost in the way to finally fall, blaming someone else or many for your mistakes, to latter realise that you haven't found peace within yourself and therefore won't be in peace with the world or with that person until you solve things within you. This time the unforgiven is oneself.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nBorrowing from an important post from the \"Unforgiven II\" song meanings:\n\r\nUnforgiven: A child becomes a lost soul after being beaten down by the conformist society\n\r\nUnforgiven II: That lost soul is found by another. \n\r\nUnforgiven III: That lost soul is accepting responsibility for his/her part in his bitter life:\n\r\n\"How can I blame you\r\nWhen it's me I can't forgive\"\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI duno if any1 else is noticing this or just me, but the intro of the song with the piano and esp b4 the guitar starts to play sounds exactly like 'ecstasy of gold' the tune that Metallica used to play before kicking off each concert from some western movie i think. Anyway its a great song from an even greater album, i think i would have loved it even more if they named it other than the unforgiven 3, i mean enough dweling on that title, name it forgive me or i duno heh, great song nevertheless.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nBloch ur right they're not back coz they were never gone to begin with. All those who says Metallica are gone or back are not Tallica fans, they just like some albums, if u really are into metallica u'd appreciate all their work.\r\none4metal i noticed also that the intro is a bit similar to the ecstasy of gold by Ennio Morricone, from the famous movie 'the good the bad & the ugly'.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nThis song is epic. My favorite song next to Fade, Bellz, and Damage Inc.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think that this song along with judas kiss and my apocalypse are the best in the album. And the album kicks ass. We love you metallica\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI like this song, everyone seems to be dissing it on youtube but, everyones always going to have the attitude of \"NOTHING CAN LIVE UP TO UNFORGIVEN 1\" well folks I think this song did it.\n\r\nit's amazing, just like Metallica.\r\nThank God they finally made up for St.Anger ! :)\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nSome of my favourite lyrics from James. Just impressive.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nMetallica at its finest.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ngood song i must say.  possibly one of james's best vocal performances?\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nI thoought this would begin the same as unforgiven and II but it dont matter its still awsome!!\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nTo me, this song is from an alcoholic's point of view, like kind of looking back on his life, or apologizing to his family or something along those lines. My father was an alcoholic, so this reminds me of when it all surfaced and my family started falling apart.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nWhat a solo!\n\r\nGo Kirk!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nmaybe he's asking dave mustaine to forgive them\n\r\n\"was he the one causing pain with his endless dreaming?\"\n\r\nThey kicked Dave Mustaine out of the band because he didn't fit in with their dream.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni think this song is about smoenoe whos looking for fortune and fame and found it, to realise that its something thats not as he expected. he wanted more out of it. \r\n\"Searched the seas of gold\r\nHow come it's got so cold\"\n\r\nand at the begining he was good at what he does, thats why in remembrance he lives, cause he was good at what he used to do, then hes not good anymore. and he wont forgive himself for losing his greatness in that thing, but wont blame the people who stopped supporting him.\r\n\"How can I be lost\r\nIn remembrance I relive\r\nAnd how can I blame you\r\nWhen it's me I can't forgive\"\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nI like this one better than the 2nd one but not as much as the 1st one. but it is close\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nThis song id an epiphany, as has been noticed this song begins different from the other 2. I believe its a fitting beginning, where the other 2 were building up unforgiveness towards others, this one is based in realizing that the faults actually lie within. Also another thing I noticed was that the 1st was in the third person while Unforgiven II was in first person. . . this song has parts in third person and parts in first person. Another interesting thing about this song is towards the end of Unforgiven II there aree lyrics saying \"the sun is shining through\" and this song begins with \"How could he know this new dawn's light\"  I believe by putting all 3 songs together you view this person's journey through life and self realization. He has let the nonacceptance of others allow him to become something he never wanted to be. . . a bitter old man. It would also be fitting that the subject was nearing the end of his life and he wants to go away without hatred in his heart. Also its clear that the subject of all 3 songs are James hence the lyrics \"That old man here is me\" in the first song. It is definately a pretty kick ass song and all 3 are great listening to them in order.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nBefore I heard the song, i told myself not to carry any expectations in case Iâ\u0080\u0099d be disappointed. I'm far from it, the transession from the piano, trumpet, guitar and drum intro is hauntingly beautiful and sends shivers up my spine and the hairs rising on my head and arms. \n\r\nAs for the song meaning, here's my 2 cents. \r\nThe first song was about a pariah's childhood and all the demons and negative experiences he encountered through his upbringing, inflicted by society and his parents.\n\r\nThe second song was about the pariah finding a person whom he felt he could share his burden to and they could provide him with the hope of being forgiven, as their reaction to his experiences would be free of judgement as they are \"unforgiven\" too. \n\r\nAnd this song is possibly about him accepting how he will remain unforgiven, unless he himself forgives all those who inflicted damage upon him. His present and his future are marked and influenced by the demons of his past. He realises that he can finally gain redemption through forgiving others, allowing him to let go of the anger, sadness, bitterness, resentment that continues to overshadows his present. \n\r\n\"How could he know this new dawnâ\u0080\u0099s light\r\nWould change his life forever?\r\nSet sail to sea but pulled off course\r\nBy the light of golden treasure\"\r\nThe first line makes reference to where the ballad last left off (Unforgiven II i.e.), He has past through the door and embraced the light. The light of a new dawn symbolising the hope of gaining forgiveness, fresh beginnings, rebirth of one's being spiritually, emotionally, and mentally. \r\nI like how the concept of his journey of his life is represented through the symbolism of the \"sea\". \r\n\"Set sail to sea but pulled off course\" makes me think he planned on living his life through the highs and lows of the waves (obstacles) he encounters along the way until the light of \"golden treasure\" inspired him change course. The light symbolising \"hope\", the \"golden treasure\" symbolic of the greatest treasure he seeks. Redemption. \n\r\n\"Was he the one causing pain\r\nWith his careless dreaming?\"\r\nI think he's wondering to himself if he, himself, is also guilty of contributing to the negativity thatâ\u0080\u0099s accumulated over the years, through the decisions and actions he's made. \n\r\n\"Been afraid, always afraid\r\nOf the things heâ\u0080\u0099s feeling\"\r\nI get the impression that this bit is speaking of the person's life in general. How the fear of embracing his \"feelings\" (of whatever emotion) controlled his decisions, actions, life etc. not allowing him to be human. \n\r\n\"He could just be gone\r\nHe would just sail on\r\nHe would just sail on\"\r\nHe can either let his fear give him the courage to end his life (gone) or let it motivate him to fight on (sail on). The use of second person narrations (i.e. \"He\") suggests that he's speaking of the past, the person he once was before coming to acceptance of the circumstances of the present.\n\r\n\"How can I be lost?\r\nIf Iâ\u0080\u0099ve got nowhere to go?\"\r\nFrom here on, the narration used is first person, marking the circumstances of the present. To state the obvious he's unsure of what course of direction he should take in his life, only he hasn't made any plans to allow him to take action and move forward. He finds it a bit ironic considering he feels lost when he's not trying to go anywhere in particular, or achieve anything. \n\r\n\"Searched for seas of gold\r\nHow come itâ\u0080\u0099s got so cold?\r\nHow can I be lost?\"\r\n\"gold\", \"cold\", are probably just for rhyming, maybe he's lived his life striving for forgiveness, with the fire of ambition. But now, it's as though his flame of ambition for redemption has died out and left him feeling \"cold\" (indifferent, apathetic, despairing) after a few failures.\n\r\n\"In remembrance I relive\r\nAnd how can I blame you\r\nWhen itâ\u0080\u0099s me I canâ\u0080\u0099t forgive?\"\r\nHe finally realises he's unforgiven because he hasn't retuned the favour and forgiven those who have harmed him (this is what distinguishes/separates the \"he\" from the \"I\", the past frame of mind he was in to the new perception he has developed at present). His memories and the pain he feels haunts him, and he can only let go of this negativity until he forgives. You realise that when you forgive others, you allow yourself to be free of the pain and resentment you have attached to the things they have done to you. You finally let yourself be free of the weight of these emotions and feel redeemed. \"To err is human, to forgive is divine.â\u0080\u009d \n\r\n\"These days drift on inside a fog\r\nItâ\u0080\u0099s thick and suffocating\"\r\nHe lives his life surrounded by a haze of confusion as to if he should forgive his demons and allow himself to let go, and it seems to consume every breath he takes.\n\r\n\"This seeking life outside its hell\r\nInside intoxicating\"\r\nI don't really get this but i think the quote 'This seeking life', He's speaking of the force that compels him to look for balance and peace, compared to inner state of his mind and emotions, that are like drugs, something that keeps weighing him down. \n\r\n\"Heâ\u0080\u0099s run aground like his life\r\nWaterâ\u0080\u0099s much too shallow\r\nSlipping fast down with the ship\r\nFading in the shadows now\"\r\nI'm not sure what this means either but \"he's run aground like his life\" makes me think his life seems to be stuck in the past. There's no sense of movement towards the future. \r\nHe believes he's \"sailed\" (lived) his life on \"shallow water\", shallow water could symbolise how he never really got anywhere, because he never managed to go further towards \"deep waters\", meaning he never really crossed any \"seas\" towards \"gold treasure\" (forgiveness). \r\nThe \"ship\" symbolising the ambition or the feelings that drove him to achieve his dreams, goals, or seek redemption has \"sunk\", \"he\" (his past persona) along with it. \n\r\n\"A castaway\r\nBlame all gone away\r\nBlame gone away\"\r\nThe experience of feeling \"lost\" has allowed him to remove feelings of blame and resentment he shifted on his perpetrators. He has been cleansed/changed by the \"sea\" (the journey of seeking redemption).\n\r\n\"Forgive me, forgive me\r\nWhy canâ\u0080\u0099t I forgive me?\"\r\nHe has yet to forgive his demons, before he can heal and finally gain redemption.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nbeautiful. i love it. the new album is great\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI'm expecting this to be a single. I see the Unforgiven's as an epic. The first one is about the beginning of a man's life. He's used, abused, and dropped by all others. He ages mentally beyond his years and regrets most of his life. Then in the second movement someone comes. \"She loves me not, she loves me still, but she'll never love again.\" It sounds like he hurt her deeply. The whole song seems like he took her in, used her like the world used him, buried the key in her, and then left her. He made her unforgiven as well. Then in the final movement he accepts the consequences. He realizes that its no ones fault but his own and that in the end the only one who is unforgivable is himself. Really epic work of art. I hope the video for this one matches the first 2 because they were fantastic.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nthis song is straight up awesome. and st. anger blew cow nuts. it`s a wonderful feeling to hear solo`s againe from these gays and music that sounds like they put time into it unlike st. gay anger. i bought this CD and i`m glad i did. this is my favorite metallica CD now\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nSomeone said the next unforgiven?\n\r\nWell its certainly a possibility but not very likely.  The message goes as such:  Its hard to be forgiven, Its hard to forgive another, and to forgive ones self is the hardest of all.  Theres not much after that unless finally someone is forgiven.....*hint*\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nthis song speaks about living our life only for getting rich or for having succsess and at least we find that all of theese are things whitout real importance and we will feel ourselves unforgivable for lived so.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI thought this song was going to be worse than what it actually is, since Metallica hasn't put anything good out in a while. \n\r\nUnforgiven I - society & parents are the unforgiven \r\nUnforgiven II - his 'love' is the unforgiven \r\nUnforgiven III - himself is the unforgiven\n\r\nHe realizes he has to forgive everyone and everything that caused this hatred in him, and he is also questioning whether he was mostly the blame for that hatred within himself aswell. \n\r\n\"In remembrance I relive\r\nAnd how can I blame you\r\nWhen itâ\u0080\u0099s me I canâ\u0080\u0099t forgive?\"\n\r\nThat's a powerful line. i think that's where the meaning is in the song.\r\nTHIS is the point at which he comes to the realization that he is the one who is the unforgiven. He hasn't forgave the ones who have hurt him. This sorrow and distress still haunts him and he knows that he needs to let go of that hurt to to become truely healed and happy, and the only way of doing that is to forgive. \n\r\nIn conclusion, he wonders why he now cannot forgive himself.\n\r\nMetallica definately did not let me down on this song. I've tried to not compare this song to the others. I don't think there is a need to. \n\r\njust amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nshit, i was blown away with the music at the begining of the song...its epic..i thought it was gonna be an instrumental and i really thought that would be cool.. its like they are leaving it up to us to continue the unforgiven story as we wish, but then james kicked in :D:D  ....\n\r\ni also think it would have been cool if it had the same begining as the unforgivens ... the previous 2 vdos where directed by the same guy and the boy that appears in one, is the same one who appears in 2 , eight years later. if they come up in the new vdo, it would be \"ART\"...\n\r\nbut i love the twist they put in the song..the guy being the unforgiven this time...very smart..\n\r\nway to go 'tallica \\m/ YEAAAAH\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ni`m not sure what it`s about but it`s one of those songs that anyone can take in there own way.still the music and lyrics are so perfect it almost seems that the music chose the words. this song is one of Metallicas best to date\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI also think the unforgiven is an epic and is simply about a boy truly becoming a man in the first unforgiven he is blaming society for putting expectaitons on him which he could never actually acomplish when the second unforgiven is about how he is hoping the love of a woman would make him happy and when her love didnt make him happy she became unforgiven as well and when in the third unforgiven he realizes that it is his at fault for all is unhappines because he tried to be what society expected him to be rather then be what he should have been so he changes from a boy who blames society and his loved ones to a man who realizes he is the reason he is Unforgiven\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nTo me this song is about searching for happiness (\"search for seas of gold) but finding only misery and loneliness (\"how come its got so cold?)\r\nand then lashing out at those around only to  realize that you need to forgive yourself before you can begin to heal.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nWell let me start off by saying THEYRE BACK BABY!!! Metallica is one of my all time favorite bands. I personally liked this song along with All Nightmare Long. First of all James Hetfield kicks ass at writing lyrics. But his lyrics are easily understood. In the other two songs the person in the song blames the world and other people for his life being so fucked up. But in this song he realizes that he has made mistakes in his life that have cost him. He realizes that the real person he blames is himself. ...How can I blame you, when It's me I can't forgive...\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nstupidly songmeanings has this songs lyrics thread twice, once with the name 'The Unforgiven III' and the other with the name 'Unforgiven 3', a guy posted this in Unforgiven 3 thread and I agree with him 100%:\n\r\nBefore I heard the song, i told myself not to carry any expectations in case Iâ\u0080\u0099d be disappointed. I'm far from it, the transession from the piano, trumpet, guitar and drum intro is hauntingly beautiful and sends shivers up my spine and the hairs rising on my head and arms.\n\r\nAs for the song meaning, here's my 2 cents.\r\nThe first song was about a pariah's childhood and all the demons and negative experiences he encountered through his upbringing, inflicted by society and his parents.\n\r\nThe second song was about the pariah finding a person whom he felt he could share his burden to and they could provide him with the hope of being forgiven, as their reaction to his experiences would be free of judgement as they are \"unforgiven\" too.\n\r\nAnd this song is possibly about him accepting how he will remain unforgiven, unless he himself forgives all those who inflicted damage upon him. His present and his future are marked and influenced by the demons of his past. He realises that he can finally gain redemption through forgiving others, allowing him to let go of the anger, sadness, bitterness, resentment that continues to overshadows his present.\n\r\n\"How could he know this new dawnâ\u0080\u0099s light\r\nWould change his life forever?\r\nSet sail to sea but pulled off course\r\nBy the light of golden treasure\"\r\nThe first line makes reference to where the ballad last left off (Unforgiven II i.e.), He has past through the door and embraced the light. The light of a new dawn symbolising the hope of gaining forgiveness, fresh beginnings, rebirth of one's being spiritually, emotionally, and mentally.\r\nI like how the concept of his journey of his life is represented through the symbolism of the \"sea\".\r\n\"Set sail to sea but pulled off course\" makes me think he planned on living his life through the highs and lows of the waves (obstacles) he encounters along the way until the light of \"golden treasure\" inspired him change course. The light symbolising \"hope\", the \"golden treasure\" symbolic of the greatest treasure he seeks. Redemption.\n\r\n\"Was he the one causing pain\r\nWith his careless dreaming?\"\r\nI think he's wondering to himself if he, himself, is also guilty of contributing to the negativity thatâ\u0080\u0099s accumulated over the years, through the decisions and actions he's made.\n\r\n\"Been afraid, always afraid\r\nOf the things heâ\u0080\u0099s feeling\"\r\nI get the impression that this bit is speaking of the person's life in general. How the fear of embracing his \"feelings\" (of whatever emotion) controlled his decisions, actions, life etc. not allowing him to be human.\n\r\n\"He could just be gone\r\nHe would just sail on\r\nHe would just sail on\"\r\nHe can either let his fear give him the courage to end his life (gone) or let it motivate him to fight on (sail on). The use of second person narrations (i.e. \"He\") suggests that he's speaking of the past, the person he once was before coming to acceptance of the circumstances of the present.\n\r\n\"How can I be lost?\r\nIf Iâ\u0080\u0099ve got nowhere to go?\"\r\nFrom here on, the narration used is first person, marking the circumstances of the present. To state the obvious he's unsure of what course of direction he should take in his life, only he hasn't made any plans to allow him to take action and move forward. He finds it a bit ironic considering he feels lost when he's not trying to go anywhere in particular, or achieve anything.\n\r\n\"Searched for seas of gold\r\nHow come itâ\u0080\u0099s got so cold?\r\nHow can I be lost?\"\r\n\"gold\", \"cold\", are probably just for rhyming, maybe he's lived his life striving for forgiveness, with the fire of ambition. But now, it's as though his flame of ambition for redemption has died out and left him feeling \"cold\" (indifferent, apathetic, despairing) after a few failures.\n\r\n\"In remembrance I relive\r\nAnd how can I blame you\r\nWhen itâ\u0080\u0099s me I canâ\u0080\u0099t forgive?\"\r\nHe finally realises he's unforgiven because he hasn't retuned the favour and forgiven those who have harmed him (this is what distinguishes/separates the \"he\" from the \"I\", the past frame of mind he was in to the new perception he has developed at present). His memories and the pain he feels haunts him, and he can only let go of this negativity until he forgives. You realise that when you forgive others, you allow yourself to be free of the pain and resentment you have attached to the things they have done to you. You finally let yourself be free of the weight of these emotions and feel redeemed. \"To err is human, to forgive is divine.â\u0080\u009d\n\r\n\"These days drift on inside a fog\r\nItâ\u0080\u0099s thick and suffocating\"\r\nHe lives his life surrounded by a haze of confusion as to if he should forgive his demons and allow himself to let go, and it seems to consume every breath he takes.\n\r\n\"This seeking life outside its hell\r\nInside intoxicating\"\r\nI don't really get this but i think the quote 'This seeking life', He's speaking of the force that compels him to look for balance and peace, compared to inner state of his mind and emotions, that are like drugs, something that keeps weighing him down.\n\r\n\"Heâ\u0080\u0099s run aground like his life\r\nWaterâ\u0080\u0099s much too shallow\r\nSlipping fast down with the ship\r\nFading in the shadows now\"\r\nI'm not sure what this means either but \"he's run aground like his life\" makes me think his life seems to be stuck in the past. There's no sense of movement towards the future.\r\nHe believes he's \"sailed\" (lived) his life on \"shallow water\", shallow water could symbolise how he never really got anywhere, because he never managed to go further towards \"deep waters\", meaning he never really crossed any \"seas\" towards \"gold treasure\" (forgiveness).\r\nThe \"ship\" symbolising the ambition or the feelings that drove him to achieve his dreams, goals, or seek redemption has \"sunk\", \"he\" (his past persona) along with it.\n\r\n\"A castaway\r\nBlame all gone away\r\nBlame gone away\"\r\nThe experience of feeling \"lost\" has allowed him to remove feelings of blame and resentment he shifted on his perpetrators. He has been cleansed/changed by the \"sea\" (the journey of seeking redemption).\n\r\n\"Forgive me, forgive me\r\nWhy canâ\u0080\u0099t I forgive me?\"\r\nHe has yet to forgive his demons, before he can heal and finally gain redemption.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nI think this song is about a person who has lost they're way in life or took there eye off whatever they were looking for.\"Set sail to sea but pulled off course By the light of golden treasure\" This line shows that he's went out for something but has just lost his way. This song is showing that he's looking for forgivness but was pulled off course.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI think James wrote this song about himself. It reminds me about where i can imagine James being just before he went to rehab. The part that says: \r\n\"Inside intoxicating\r\nHe's run aground\r\nLike his life\r\nWater's much too shallow\r\nSlipping fast\r\nDown with the ship\r\nFading in the shadows \r\nNow a castaway\"\r\nmakes me think of Some Kind of Monster and how James was talking about his trip to russia when he drank heavily and was pretty depressive.\n\r\n\"These days drift on inside a fog\r\nIt's thick and suffocating\r\nThis seeking life outside its hell\r\nInside intoxicating\"\r\nI know one metaphor Phil used for that time was being in a fog. and this makes it sound like James was drinking to escape the time that his life was in. The band was having trouble, looking like they might break up, just trying to escape the fog.. just my opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nbest Unforgiven...best song on Death Magnetic\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nAny of you lame AS*ES who don't like the cd who gives a flying SH*T Go F*ckyourself because your comments don't matter here, or to the world in general. I have been a Metallica fan since most of you whiners were in diapers. You wouldn't know good music if it were fu*king you in the a*s! Why would Metallica wanna sound like their other records? Then you morons would say all their music sounds the same. Seems to me being the second largest selling act of all time they really could careless about your ever so small opinions!\n\n\r\nhave a Great fu*cking day! and go listen to some of your wanna be metal bands who grew on Metallica themselves! Jacka*ses!\n\r\nPOST ALL YOUR LITTLE COMMENTS BECAUSE ILL NEVER READ A ONE OF THEM!! FUC*N WIMPS\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\ni think all the Unforgiven songs are amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nTo me, this song is about a man who has cast himself away from society and the ones he loved in favor of greed and materialistic ways. By the time that he realizes what hell he has brought upon himself, it's too late. He tries to repent, but no good comes from it. It is because of these things why he is set to live the remainder of his life alone, searching for something that will never come.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nSeems to me as this person has been \"sailing\" (going to work, getting on with day to day life) for a long time, untill one day \"pulled of course by the light of golden treasure\".\n\r\nSince then that person have changed and his partner (wife, girlfriend, good friend) \"been afraid of his careless dreaming... been afriad... of the things he's feeling\" - partner is worried for him, because he's not what he used to be, as he's been \"causing pain with his careless dreaming\" - may be dreaming like he wants to quit his usual life and concentrate on that freshly found \"golden treasure\". And I think he does that as \"He would just sail on. He would just sail on.\"\n\r\nThen \"How can I be lost. If I've got nowhere to go\" that \"plain\" sailing (usual/normal/boring life) isn't taking him anywhere, so he got nowhere to go. He also now have \"Searched the seas of gold\" however to his surprise(\"How come\") that sea (different life, new things etc.)\"it's got so cold\". Then he says again that he can't be lost, because he's got nowhere to go - same old again.\n\r\n\"How can I blame you\r\nWhen it's me I can't forgive\" - he still can't forgive himself for what he's done/caused/what happened because of him (as he tells later.)\n\r\n\"These days drift on inside a fog\r\nIt's thick and suffocating\r\nThis seeking life outside its hell\"\n\r\nNow that he doesn't know what to do - he can't seem to find \"his thing\", that old \"sailing\" has turned into drifting on days in a fog (springs into mind a line from Master of Puppets (...drift on numbered days...)), which is thick and suffocating - seems like this hell/life he isn't enjoying (because he's seeking something new) will be with him forever.\n\r\n\"This seeking life outside its hell\r\nInside intoxicating\"\n\r\nHe seeks something new/better/different \"outside its hell\" - outside his usual life, because he's \"suffocating\" and \"intoxicating\" (may be reffering to drugs, alcohol), as if he's dying.\n\r\n\"He's run aground\r\nLike his life\r\nWater's much too shallow\r\nSlipping fast\r\nDown with the ship\r\nFading in the shadows\r\nNow a castaway\"\n\r\nHis life has stoped/changed dramatically, because \"water is much too shallow\" - water supports ship on the water, otherwise ship sinks. So with our person, water got too shallow and he can't sail anymore, so he became a castaway, his ship hit the ground and can't sail anymore, because\n\r\n\"They've all gone away\r\nThey've gone away\"\n\r\nThis is the crucial part - people who've been supporting him, thanks to who he was able to \"sail on\" (e.g. live) have all gone away and now the water became too shallow for sailing. This has been caused by his careless (selfish) dreaming, because he got attracted by that golden treasure, and in most books/films golden treasures represent greed and isolation.\n\r\nNow he can't forgive himself for what happened and is not blaming his partner, however he realises that it's all his fault.\n\r\nSo, make sure you don't ignore people around you, appreciate their help and don't forget about those who made you who you are when you find that \"golden treasure\" and you be ok.\n\n\n\n", "comment_38": "\nOk I am a big metallica fun and I came up with this little story based on the titles of metallica songs. the titles are in capital letters.\n\n\r\nI park my 2*4 and step out, home at last but Iâ\u0080\u0099m in a FRANTC state thinking about my narrow ESCAPE. I get into the house and I drink some of my WHISKEY in a JAR but that doesnâ\u0080\u0099t ease the pain clearly caused by the THORN WITHIN. At this point even i know the only solutions to deal with the STRUGGLE WITHIN. In the SMALL HOURS of the morning I stare into the dark night and see ORION, but now is not the time to think about ASTRONOMY the pain is too much it feels like I'm TRAPPED UNDER ICE yet I cant seem to convince myself that its my fault, betrayed by who i thought was a friend and betrayed by THE JUDAS KISS now I go towards my bed in this old rugged house, how am I supposed to sleep in THE HOUSE THAT JACK BUILT after I shot him between the eyes and left him STONE DEAD FOREVER and at that point it felt like NOTHING ELSE MATTERS. I close my eyes and try to sleep hoping it will all just FADE to BLACK but THE MEMORY REMAINS clear to me that I will always be UNFORGIVEN and it worries me because the things i just did make me wonder AM I EVIL. This cant be I was raised right how did I turn to this BAD SEED I know what I did was wrong but I canâ\u0080\u0099t feel it, itâ\u0080\u0099s like I am on ANESTHESIA.\n\r\nI had lost my mind when I decided it was KILLING TIME, I ran around taking them all out high on drugs I believed I was the INVISIBLE KID and the opponents I took out one by one where DISPOSABLE HEROES. I canâ\u0080\u0099t sleep so I stay up looking at the DIRTY WINDOW and start to think maybe its time I DISAPPEAR because right now I am CREEPING DEATH at any point the cops and feds will be all over looking for me. For so long I looked forward to exerting my revenge but that day seemed to be THE DAY THAT NEVER COMES nothing hurts more than taking the life of your BROTHERS IN ARMS. The pain was too much yet still I feel like the HERO OF THE DAY and I decided not to think about what others thought of me after all to the one who I was revenging I would always be the perfect PRINCE CHARMING her LOVERMAN as was the case when she lived and everyone else called me KING NOTHING. As my nerves began to calm I remember what MAMA SAID about salvation forgiveness trusting in God and THE FOUR HORSEMEN but I will not pray to THE GOD THAT FAILED seeing as he let my loved one die she truly was MY FRIEND OF MISERY so I decide to live the rest of my life with NO REMORSE.\n\r\nKnowing my fate as I step into the bathroom that bottle of CYANIDE seems appealing but I will not give up I will FIGHT FIRE WITH FIRE. Arrested I find myself locked in a SANATARIUM because the cops couldnâ\u0080\u0099t believe any normal person could do what I did. The DEVILS DANCE is what they called it and maybe this is where I would spend the rest of my days on THE FRAYED ENDS OF SANITY. A brilliant mind I donâ\u0080\u0099t deserve to be here but what i did deserves to be punished and that is SAD BUT TRUE. At this rate I donâ\u0080\u0099t think even a priest can PURIFY my soul. I think of to myself POOR TWISTED ME but I decide to not have self pity because when it comes to who killed those men I will always be the ONE. From a motherâ\u0080\u0099s boy RONNIE went on to become a killer and sometimes I would think SO WHAT right until the judge decided i would RIDE the LIGHTENING. I know I am SOME KIND of MONSTER but do I really deserve to die. The judge is not letting me off easy as he proclaims THAT WAS JUST YOUR LIFE and now youâ\u0080\u0099ve reached THE END OF THE LINE. Alone in my cell I think it seems I have become THE OUTLAW TORN thinking about SUICIDE AND REDEMPTION what to do I cant let them kill me oh the STRUGGLE WITHIN talk about THE THING THAT SHOULD NOT BE. After a nights sleep I think maybe its fine after all TO LIVE IS TO DIE what is this THE UNNAMED FEELING maybe its time to TURN THE PAGE. \t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI'll make this as comprehensible as possible...\nThe \"lost soul\" in these songs is James\nThe Unforgiven is about a lost soul being beaten down by society, it talks about James' childhood and life until that point\nThe Unforgiven II is about that same lost soul finding another lost soul (James' wife probably) and how James feels is unforgiven in her eyes for what he's done\nThe Unforgiven III is about the original lost soul, still, he does not forgive himself now, this is probably about what occurred in the 90s for James, womanizing, temptation, drinking, drugs, and what happened with Jason leaving, and the events of Some Kind of Monster (documentary), and how he can't forgive himself\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nIts not the first two...but i'm liking it.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI believe this song is about social unacceptance. To break down my view:\r\nLyric\r\nInterpreted as meaning\n\r\nHow could he know this new dawn's light would change his life forever\r\nHe knew that his new oppurtunity would change his life forever\n\r\nSet sail to sea, but pulled off course by the light of golden treasure\r\nHe continued life, only to be distracted and drawn to the oppurtunity\n\r\nWas he the one causing pain with his careless dreaming\r\nHe may have been antagonized for his free thinking\n\r\nBeen afraid, always afraid of the things he's feeling\r\nHe has been constantly afraid of his own emotions\n\r\nHe could just be gone\r\nHim not missing would not affect anyone's lives negatively\n\r\nHe would just sail on\r\nHe would simply avoid the oppurtunity if he was missing, and deprived of hope\n\r\nHe would just sail on\r\nFurther emphasizes the last line\n\r\nHow can I be lost if I've got nowhere to go\r\nHe was lost, but realized he never had a destination\n\r\nSearch for seas of gold, how come it's got so cold\r\nHe looked for new oppurtunities, but only misfortune came out of it\n\r\nHow can I be lost, in remembrance I relive\r\nHe remembers the realization that he never had a place to go\n\r\nHow can I blame you, when it's me I can't forgive\r\nHe wants to blame somebody else, but cannot because he knows that he caused his own misfortune\n\r\nAnd the rest shows society shunning him, and eventually, him shunning himself, so to speak\n\n\n\n\n\n\n", "comment_42": "\nNever you\r\nNever me\r\nNow I'm Unforgiven 3.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThe Unforgiven, parts I, II, and III, is a rock opera that discusses James Hetfield's childhood as a Christian scientist. The first part talks about him being deprived of his thought and opinions as part of the cult. The second part talks about how he loved his family nonetheless and the third part talks about his mother's conscious death and the blame he puts on himself for it.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nHow could he know this new dawn's light\nWould change his life forever?\nSet sail to sea, but pulled off course\nBy the light of golden treasure\n======================\nThis relates to the lyrics of Unforgiven II. At the end of that song, the man stumbles off into the light. He didn't expect the light to change his life completely, however. He considered his life's trip to be straightforward, like a wavy sea, but a light of forgiveness lit up his path. He considered this light a golden treasure.\n\nWas he the one causing pain\nWith his careless dreaming?\nBeen afraid, always afraid\nOf the things he's feeling\n==================\nWas he perhaps the one causing pain to himself, and not society? Perhaps his dreams were not realistic? He has always been afraid to express what he felt and what he knew, but is he still afraid?\n\nHe could just be gone\nHe would just sail on\nHe'll just sail on\n============\nThe sadness that defined him for all of his life is lost. He is just living his life. He will live on.\n\nHow can I be lost, if I've got nowhere to go?\nSearch for seas of gold\nHow come it's got so cold?\n====================\nBut how can he be lost in his life, if he does not have a family member or a friend he could go back to? He lived his life for it's pleasures, but his life has gotten so depressing\n\nHow can I be lost? In remembrance I relive\nAnd how can I blame you\nWhen it's me I can't forgive?\n=====================\nHow can he be currently lost, if he lives only in memories of his past? How can he keep blaming his lover from The Unforgiven II for betraying him if it's himself he now considers to be a traitor?\n\nThese days drift on inside a fog\nThick and suffocating\nHis sinking life, outside it's hell\nInside, intoxicating\n===============\nHis days are full of fog, he is not sure what he is doing, he is suffocating from not being able to make his mind up on who is the antagonist in his life. To outside people his life is hell, but for himself it's even worse, for himself it's toxic. \n\nHe's run aground, like his life\nWater much too shallow\nSlipping fast, down with his ship\nFading in the shadows\n=================\nHis life has gone downhill. Life is much too shallow for him. He is losing control of himself, thinking about it. \n\nNow a castaway\nThey've all gone away\nThey've gone away\n==============\nHe is now alone. There is no more society to conform with. There are no more lovers to fall in love with. \n\nHow can I be lost, if I've got nowhere to go?\nSearch for seas of gold,\nHow come it's got so cold?\n\nHow can I be lost? In remembrance I relive\nAnd how can I blame you\nWhen it's me I can't forgive?\n=====================\nRepeat of lines I already explained.\n\nForgive me\nForgive me not\nWhy can't I forgive me?\n==================\nHe is wondering whether he should forgive himself for making his own life a living hell.\n\nSet sail to sea, but pulled off course\nBy the light of golden treasure\nHow could he know this new dawn's light\nWould change his life forever?\n\nHow can I be lost, if I've got nowhere to go?\nSearch for seas of gold\nHow come it's got so cold?\n====================\nRepeat of lines I already explained.\n\nHow can I be lost? In remembrance I relive\nAnd how can I blame you\nWhen it's me I can't forgive?\n=====================\nHow can he be lost in his life, if he only lives in his memories? How can he blame his lover for betraying him years ago, when he is at fault for everything? He forgave society and his traitor lover, but now he realizes he is the Unforgiven.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\ni love the music and the lyrics...the best metallica album ever ! really we can say...the best album of all time of metallica....\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nyeah.. they're back !!! I'm glad to see that death magnetic has nothing to do with st anger :))) this album really kicks ass and this song is just amazing.. I can't  stop listening to it for the last 2 days\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nHey I thought it would begin the same as unforgiven and II but if you go to youtube I made a video were you can listen to see wat it would sound like if it did start that way, I did 3 tries, just go to youtube and type metallica unforgiven II test.  let me knw what you think.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nwutyanoboutdat  is also right xD\n\r\nthe solo got me jumping the first time i heard it\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nThe Unforgiven 3 follows The Unforgiven 2, which followed The Unforgiven.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nAmazing song.  Welcome back, Metallica.\r\nAnyways, it's about forgiving yourself.  Specifically, it's about a pirate/sailor that got lost by looking for gold.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nWonder if the videos gonna be similar to the other unforgiven videos.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nI'm with leethal's meaning, but it makes me wonder:\r\nHe said \"the ultimate unforgiven, self-unforgiven,\" what's Metallica gono do next for unforgiven?\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nIf you listen to the rhythm guitar during kirks solo it sounds somewhat like the main rhythm in the first 2 unforgivens but thats just me\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nthis song speaks about living our life only for getting rich or for having succsess and at least we find that all of theese are things whitout real importance and we will feel ourselves unforgivable for lived so.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\ni think its about everyone  who died i the music biz.. like maybe even cliff...and others thats, my thought\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI give this song a meh..\n\r\nI believe The Unforgiven is the better one of the three.\r\nI think there is much more emotion in the original and a lot less crap. But i do like this one more then the Second... (god did i ever hate reload...)\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\ni luv how this one doesnt sound like the other two\r\nwhen i heard about it i thought of Unforgiven II and i sighed. i thought:\"how many times can you distort that riff that ensnared my mind in the first one?\"\r\nplus the whole country type thing didnt go over so well w/ me.\n\r\nthis album may very well be one of the great ones to remember.\r\nI hail the Holy Three to be: Ride, Master, and Justice.\r\nThis one is still a young apprentice but it shall reign in glory someday...\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nbtw... awesome analysis DreamersDisease\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThe piano at the beginning is absolutely phenomenal. And although it's nothing like the first or second, once again, Metallica DOES NOT disappoint. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nWow Beautiful said DreamersDisease.\n\r\nBy far my favorite song from the new album. also the only solo from kirk i really like from start to finish\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\ni think it's about him fucking up and helping lars sue napster (the \"gold\" he was pulled off course to) and now he wishes he never did because in doing so, Metallica lost a lot of fans. but because it's too late in the game, he can't forgive himself\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nthis song is about self forgivenss. this is my perception of this track.\n\r\n\"how could he know this new dawns light...\"  of course the new dawns light is of the golden treasure, which is temptations in life. examples: eve taking the apple or fortune, etc... and of course the sea represents life.\n\r\n\"was he the one causing pain...\"  the careless dreams are the goals we want to achieve in life that we feel will make us \"complete\" examples: fame, to be recognized, to be a higher person. this way of life causes an imbalance in the world, hence what goes on today.\n\r\n\"been afraid always afraid...\"  always moving forward, in life, through the mind/ thoughts,/ carless dreams, rather than living life moment by moment. feeling is of the moment. \n\r\n\"he could just be gone...\"  going about life in this way will get you nowhere. we have the choice to either go about life by moment (sail on) or temptation. its OUR choice. so dont blame anyone but your own self.\n\r\n\"how can i be lost if ive got nowhere to go?\"  this is the whole meaning of the song, setting a direction in life (the careless dreaming) leads to pain withIN. this all ties to self honesty.\n\r\n\"searched for seas of gold...\"  of course, gold is the temptations in life, this way of living seems to be \"normal\" but it truely is a \"cold\" way to live.\n\r\n\"in remembrance i relive...\"  impressions are left in the sea/ life when moving without any direction. so if you are ever stuck/ pulled off course, you can always backtrack through forgiveness.\n\r\n\"how can i blame you...\"  it was our own choice to live this \"careless\" way of life. basically, we are being dishonest with our own self when being afraid of what we feel. so rather than forgiving others for the \"cold\" we experience , you must forgive your own self. this is the same as (love yourself, before you love others).\n\r\n\"these days drift on inside a fog...\"  in todays world, this \"cold\" way of living, is exactely \"thick and suffocating\" its hard to move and hard to actually breathe/ live in.\n\r\n\"this seeking life outside, its hell...\"  this \"cold\" way of living has been the norm for us but we still seek life in this way. and in this way, its exactly what james' says, \"its hell\", where theres division, theres conflict. not only does this create an imbalance in the world but most importantly, creates an imbalance withIN our own self.\n\r\n\"he's run aground like his life...\"  keep living in this \"cold\" way and you will never truely move and remain stuck in this condition. this way of living has no depth to it, its \"too shallow\". \n\r\n\"slipping fast down with the ship...\"  without the ship, there can be no direction, and a castaway can have NO direction. no direction meaning, living by moment, and therefore, no blame on yourself or others.\n\r\n\"why cant i forgive me?\"  knowing self forgivness/ living by moment is the key, its hard to break away from these \"cold\" ways.\n\r\nhope that wasnt confusing. but i truely believe this is what The Unforgiven 3 speaks of, self forgiveness.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\n\"THIS SEEKING LIFE outside, its hell, inside intoxicating\". this is what this song has to do with, going about \"seeking life\". just thought i would point this out since there are other perceptions of this song in which doesnt make sense. i didn't think about this till sometime after i wrote my perception above, and it fits perfectly.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nI must admit I'm very disappointed in this Unforgiven III... the first two are AMAZING (I like both almost equally, depending on what mood/emotion I'm feeling) but this... the beginning is nice... but I dont think it should be one of the \"Unforgiven\" songs... \n\r\nI can see the corelation between the 3 of them\r\n(as leethal said: \"The first unforgiven was the one unforgiven by society.\r\nThe second unforgiven was the one unforgiven by his/her mate.\r\nThis, the ultimate unforgiven, is the self-unforgiven... The one who can't forgive himself for what he's done...)\n\r\nBut it still is NOTHING compared to the first two... they should've made the melody even a TINY bit similar to the first two in order to be called Unforgiven III... honestly the whole album isnt that great, all the songs start to sound the same after this many albums... \"The Day That Never Comes\" is the only song I really like so far, but I'll continue to listen to it because I do like Metallica. Maybe more of the songs will grow on me.....\n\n\n", "comment_65": "\nI think this song is about Jason Newsted, specifically about his experiences with Metallica.\n\r\n\"How could he know this new dawnâ\u0080\u0099s light\r\nWould change his life forever?\r\nSet sail to sea but pulled off course\r\nBy the light of golden treasure\n\r\nWas he the one causing pain\r\nWith his careless dreaming?\r\nBeen afraid, always afraid\r\nOf the things heâ\u0080\u0099s feeling\r\nHe could just be gone\r\nHe would just sail on\r\nHe would just sail on\"\n\r\nI think the first verse is about Jason joining Metallica and the hazing he had to go through.\n\r\n\"How can I be lost?\r\nIf Iâ\u0080\u0099ve got nowhere to go?\r\nSearched for seas of gold\r\nHow come itâ\u0080\u0099s got so cold?\r\nHow can I be lost?\r\nIn remembrance I relive\r\nAnd how can I blame you\r\nWhen itâ\u0080\u0099s me I canâ\u0080\u0099t forgive?\"\n\r\nThe chorus, I think, points about Jason leaving Metallica. James, I think, is sending his regrets about Jason leaving Metallica.\n\n\n\n", "comment_66": "\nHere's how I view each song:\n\r\nThe Unforgiven:\r\nThis song is about being beaten, and eventually dying with in *or being numb inside* and believing that there is nothing good in this whole world. The person in the first song went through most of his life hated, and picked on. However, he kept dreaming of finding a way out, and he did.\n\r\nThe Unforgiven II:\r\nThis song I have already commented on about 30 minutes ago, but the person from the first song finds someone just like him, and he dubbed her Unforgiven II *too*. He thought that since they were both Unforgiven that she would relate to him, but he found disappointment when she betrays him. He kills her, leaving a key to happiness outside of this world with her death.\n\r\nThe Unforgiven III:\r\nAs the Unforgiven II had a line in it that said \"But now I see the sun, Now I see the sun, yes now I see it\", this song begins with \"How could he know this new dawn's light Would change his life forever?\" Once the person from the previous two songs killed the woman, he was pulle doff course with the dawn's new light. \"Set sail to sea, but pulled of course by the light of golden treasure\" When he killed her, he was pulled of course from obtaining entrance to \"heaven\", and is now sailing on the River Styx, aka he's in Hell, or his soul is damn to hell. Now he can never forgive himself for what he'd done to her, and he can't find the forgiveness he needs to get to the holy light. His vessel *his ship* runs aground and he goes down with it, which symbolizes his own final death. Now he is lost in hell, or limbo. But he'll never be able to forgive himself, thus for ever remaining the Unforgiven\n\r\nidk..That's my point of view. I love all three songs, and I wouldn't stop listening to them even if Metallica were banned all over the world.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nthis song just floored me when i first heard it, and now it's still my fave song off the new album.  it may not be as catchy as my other loved songs of theirs, (ie: battery, creeping death, fuel, and all nightmare long) but it's one of two that actually speaks to me on a deeper plane (the other being fixxxer.)  it's just beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI think this song is absolutely amazing! As for my interpretation of the meaning, I think it relates to James and him getting sober in many ways. Also in relation to the other 2 Unforgiven  songs, the character has come to the realization that they are to blame for their own unhappiness and not society or their parents or whomever else they may have blamed along the way. They continued to search \"for seas of gold' which I think is a metaphor for looking for one thing that he thinks will make him happy, but ultimately he realizes that there's no such thing. In the end I think he realizes that in order to be happy he must stop blaming everyone else and forgive himself. \t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nWhen I first saw this song title on the track listing of the album, I thought it was a  crazy idea for a song-Then I heard it and was very pleasantly surprised.  This song means a lot to me because I literally have been known to get lost when I've got nowhere to go.  I also tend to be angry with myself and blame others.  I don't really know why-I guess on some level it seems easier.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nthis one is a follow up to the second one\n\r\nIn \"Unforgiven2\", the character finds his redemption using the girl.. he kills her and he becomes forgiven, or \"goes through the door\" but now he has that in his conscience\n\r\nhe used her to his advantage and for that he lives \"unforgiven\" forever\n\n\r\n\"So how can I blame you\r\nWhen it's me I can't forgive \"\n\r\nhe killed her\n\r\nhe knows he did\n\r\nand thats why he hates himself now\n\n\r\nthats my opinion\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nI think the unforgiven 3 has to do alot with james feelings towards himself and how he practically made jason leave metallica just cause jason wanted to do a side prject. i think the guilt  finally kicked in when righting this.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nBetter than the first 2!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nat first i was afraid they overstretching the whole unforgiven thing but then i heard this song and now its my fave of the three\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nokay so heres my interpretation.its about someone(specifically James) who sets out to be great but is lured and eventually corrupted by wealth.so now he sees that the wealth is meaningless without inner peace(...'me i cant forgive'...).best song ever.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nDoes it ever end?  He still hasn't found himself.  He's still looking.  You'd think he would have given up by now.  But no, he goes on.  He's still unforgiven.  Just how long can one person self-indulge.\n\r\nHe's looking inside instead of just living life.  \t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nthe guy can't find happiness or peace... seeking life outside is hell, inside is intoxicating. \n\r\nthere is a karma still hitting metallica and it shows through in many of their latest lyrics, what they did to napster was the product of ill ambition and greed. metallica, one of the greatest ever -in my view- are rightfully paying for their inability to deal with the powers they conjured ... the hammer of the gods revisited?\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nThis song is about being blinded by your dreams of fame and fortune, and losing those close to you (people whom genuinely loved you - despite you not being rich or famous from the start) because you neglected them for what you thought would be a better lifestyle than what you'd previously lived.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nBack when I was stupid, and before I heard the song I assumed that any band with \"Metal\" in its name had to be a death metal band, where even if the singer is saying something noteworthy, you can't tell because it just sounds like grunting monkeys anyway... But when I heard this song I realized I was stupid and now I am a huge Metallica fan. Anyway, while the song is literally about a boat captain, it could easily apply to a person's life. The captain of the boat \"set sail to sea\" but got \"pulled off course, by the light of golden treasure\". This means that the man's life got off track when tried to reach some appealing goal (fame or wealth?). The captain is kind of brain dead, and is so oblivious that he doesn't realize that he is causing pain for the crew. He is so focused on the golden treasure that he sinks the ship and becomes a castaway that has to live with his mistake for the rest of his life. If a person focuses on the \"intoxicating\" dream without taking the real world into consideration, they can inadvertently hurt people and ending up brooding like this sad captain. He can't forgive himself because he knows it it his fault.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nThis follows the previous Unforgiven's. The first ones about a lonely man mad at society. In the second he finds someone to talk to who has the same problems. In this one the man opens his eyes and realizes that it was his fault and can't forgive himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nBest Solo Of Kirk.    Wow\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nFirst of all I'm a huge fan of Metallica !!\nSecond of all, this song can have a lot of meanings: the lyrics allow a variety of interpretations. The interpretation that fits best for me is one that the protagonist is a person who's going through difficult things in his life (he's almost or possibly completely depressive), and he doesn't know how to change them. Verse by verse:\n\n\"How could he know this new dawn's life\nWould change his life forever?\"\nSomething happened in the protagonist's life that completely changed everything in his life. So he starts thinking that he couldn't ever know that that happening would bring so much difficulty to him.\n\n\"Set sail to sea, but pulled off course\nBy the light of golden treasure.\"\nHe was living the best way he could, and then (again), something that seemed harmless or really good for him (\"treasure\") brought a lot of bad things to him (\"pulled off course\")\n\n\"Was he the one causing pain\nWith his careless dreaming?\nBeen afraid, always afraid,\nOf the things he's feeling.\"\nThen when starts thinking about all his life, his starts wondering if every bad things are his fault, and if he acted differently or if he wasn't so afraid of himself and his feelings that his constantly trying to hide, everything wouldn't be so hard.\n\n\"He could just be gone.\nHe would just sail on\nHe would just sail on.\"\nWhen thinking for a solution, he tries to runaway of it all (\"be gone\"). But then he realizes all he can do is go on living.\n\n\"How can I be lost\nIf I've got nowhere to go\"\nHe has no idea of how he can solve all his problems (\"nowhere to go\").\n\n\"Searched the seas of gold\nHow come it's got so cold?\nHow can I be lost\nIn remembrance I relive\"\nHe starts reliving everything he's passed through, trying to understand how everything got so hard (\"How come it's got so cold?\"\n\n\"So how can I blame you\nWhen it's me I can't forgive\"\nHe can't forgive himself for wrong things he did.\n\n\"These days drift on inside a fog\nIt's thick and suffocating\nThis seeking life outside its hell\nInside intoxicating\"\nAll his days are a constant pain: when he's alone it's \"intoxicating\", and when he's with others everything is \"hell\". That is: whether he's thinking about his situation or trying to solve it, everything's just too harsh.\n\n\"He's run aground\nLike his life\nWater's much too shallow\nSlipping fast\nDown with the ship\nFading in the shadows\"\nSo he just starts drowing in suffering\n\n\"Now a castaway\nThey've all gone away\nThey've gone away\"\nEveryone's abandoned him. Here either people actually did it - they can't live with him anymore because they can't stand his state - or he just imagines that no one cares about him, or he simply doesn't trust anyone, so he feels abandoned.\n\nForgive me\nForgive me not\nForgive me\nForgive me not\nForgive me\nForgive me not\nForgive me\nForgive me, why can't I forgive me\nHe tries to forgive himself, and clearly he gets angry at himself because he can't do it, he keeps blaming himself for his mistakes.\n\nWell, there it is, my interpretation. It's a really nice song, too bad the lyrics are so sad in the way i interpret them. As I said before, it may have lots of different meanings, I just think the one I did fits correctly into the verses.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nEverything about this song is great, although it's a little weird how they started the first two the same way, then switched it up. Little choppy and unconnected, but it carries so much from the others meaning-wise it still fits. I have to admit, sometimes I'm not crazy about their lyrics, but I love these because they are complex but very simple in meaning. Well done Metallica!!\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nThe Unforgiven I: A child becomes a lost soul after being beaten down by the conformist society\nThe Unforgiven II: That lost soul is found by another.\nThe Unforgiven III: The boy becomes the perpetrator of the conformist society.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nI think this song is about a man who's greed and love for money ruins his life\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nyeah.. they're back !!! I'm glad to see that death magnetic has nothing to do with st anger :))) this album really kicks ass and this song is just amazing.. I can't  stop listening to it for the last 2 days\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nthe video will include dave mustaine wearing a squirrel suit and sing together this song with hetfield\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nThis song is obviously about a man deliberately spreading anal warts when fornicating with loose women.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\ni would rather listen to lucciano pizzichini's suzy q than this crap\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nIs this the OST of Barney or what?\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nIs this the OST of Barney or what?\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\ni actually like this song... i hate Unfogiven II, but this one actually seems very real and emotional... im probably wrong, but this song to me seems to be about battling addiction to alcohol and depression... and perhaps all the fallout that occurs with those that you love when you are helplessly addicted to substances... in my experience being addicted to alcohol in the past, you tend to get edgy and blame others for your shortcomings \n\r\n\"How can I blame you, when its me I can't forgive\"\n\r\nKnowing you are wrong but not having the guts to face up to the fact that other people might know whats best for you better than yourself... to me thats what this song represents.\n\r\nJust my idea though.\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nwonder if mustaine would write forgiven\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\ncall me crazy but the lyrics reminds me of christoph columbus xD\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nIs this the OST of Barney or what?\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\ni'll have to say, as one of the greatest metallica fan, metallica doesn't have the spark no more compared to the last 2 unforgiven songs. fuck metallica for having such emo kinda lyrics in the contemporary.. still death magnetic is one subordinate  of the St.Anger album hence, it's basically crap indeed\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nEvery Unforgiven gets drastically worse and worse. Luckly, the 1st was so amazing the two sequels manage to stay afloat.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nmetallica isn't back you stupid cunt, they died some years ago, the album sucks, james sucks and not to mention mister chocotoff trujillo, one million dollar for a stupid bass player, you gotta be monkeyshittin me\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nPeople actually think this is the best Metallica album? Wow anyone who said that is no real Metallica fan.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nthis song is about dave mustaine's penis\t\t\t\t\n\t\t\t\t\n\n"}