{"comment_0": "\nRead as much into it as you want...In the end it is a love song...love of a person...time...or place....but make no mistake it is a love song....one of the few to never use the phrase \"I love you\" or even the word love....trust me....it's a love song.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nOne of the most beautiful and most timeless ballads ever.And one that can hold a deep personal meaning for each listener(in my opinion).\n\nI always think of the 'door' as being somewhat symbolic of someone's heart and the long and winding road as both geographic and symbolic of the long road to gain or regain someone's trust(heart).The singer may have once held the other person's heart(door)or was on the road to doing so,but was 'left standing there',and through all their wanderings they are still 'led back' because despite the door(heart)being so hard to reach it was still the one door(heart)they knew would open to them.\n\n'The wild and windy night\nthat the rain washed away\nhas left a pool of tears\ncrying for the day'\nTo me this symbolizes some turmoil or other that even once seemingly overcame has left an emptiness and need,that can only be filled by reaching the end of the long winding road and the door/heart though the singer is uncertain he/she will ever get there.The theme throughout the song is uncertainty,will the road ever finally end,and where?\nThough definitely a love song,I feel it's very different than the typical love song in the sense that it's about finally knowing who you should be with yet the road there is still difficult.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nTechnically weezer, this isn't the Beatles last album.  Abbey Road is.  The disappointment and despair of the Get Back sessions led the Beatles to try and attempt one more album before they broke up, which was Abbey Road.  Let It Be came out after Abbey Road though because a different producer was working with Let It Be and he just screwed it all up, especially on the overdubbing of the Long and Winding Road.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nThe song is inspired by the road down the Kintyre peninsula of Scotland to Paul's home (still owns it) in Machrihanish where Paul retreated to get away from mayhem of the Beatles.  The road is long but it isn't as winding as the song suggests - it's fairly straight in most places. There are actually two roads to his place - the coastal road takes a little longer to drive but the ocean views are indescribably beautiful. Definitely a bit of a nowheresville down there even today but very pretty.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis song describes perfectly my relationship with God...\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\n1.The long and winding road that leads to your door\r\nMy life have gone in many directions.  I have seen the best in myself and the worst.  Here I am.  \n\r\n2.Will never disappear, Iâ\u0080\u0099ve seen that road before \r\nPeople can identify. I hope to find out.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nFirst: Abbey Road was recorded after Let It Be, but released before Let It Be.\n\r\nSecond: The Naked version of this song is much better than the normal Let It Be version, in my opinion.\n\r\nThird: I've always seen this song as being about a man reminiscing over a nasty breakup in his past, and how he'll never forget it.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nYes, the song appears to be about the Beatles & many things that was going on in the Beatles life at the time must have inspired it.. I cant disagree BUT there is also a much deeper level of understanding in this song.. it is about one's relationship to GOD\n\r\nI used to listen to it, it made me emotional & i thought it was a love song ( it matched how I felt about frustrating romances) & other times i thought it is a song about some unattainable goal that has a long & winding road to reach it 9it matched how i felt about my career that never got any better or never moved any further)\n\r\nBUT then ONE DAY it hit me when i was having one of those spiritual ups & downs.. I was literally & desperately crying out to God for help & this song began to play at the same time & oh my God... this was it.. i got what it is all about\n\r\nIT IS ABOUT THE LONG & WINING ROAD TO GOD & BACK FROM GOD THROUGHOUT ALL OF ETERNITY... this road has no beginning & has no end.. it always is.... You are one with God but then you separate (this separation is only an illusion) when you are born into a new body & then you return to God when you die & become one again... & this keeps going on & going on for eternity.....\n\r\nwhen you cry out & suffer is when are under the illusion that you are separate from God & that you are on an endless & tiring road to God but the peace comes in when you realize that in ultimate reality you are never separate from God & you are never on a road to God becuase you are with GOD always & all ways\n\n\n", "comment_8": "\nthis song is absolutely beautiful.\r\ni think another interpretation of this song is that sometimes one may find the person that they are meant to be with, but due to other circumstances, they are somewhat rejected from having a long term relationship with that person.\r\nanyhow---so i think that this song talks about how you never let go of that one person, no matter how many others your with or what happens with your life. your mind leads you back or \"takes you back down the road\" to that one \"home\" that you found in that certain person.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nMcCartney: I was a bit flipped out and tripped out at that time. Itâ\u0080\u0099s a sad song because itâ\u0080\u0099s all about the unattainable; the door you never quite reach. This is the road that you never get to the end of.\n\r\nMcCartney: I just sat down at my piano in Scotland, started playing and came up with that song, imagining it was going to be done by someone like Ray Charles. I have always found inspiration in the calm beauty of Scotland and again it proved the place where I found inspiration.\n\r\nMcCartney: Itâ\u0080\u0099s rather a sad song. I like writing sad songs, itâ\u0080\u0099s a good bag to get into because you can actually acknowledge some deeper feelings of your own and put them in it. Itâ\u0080\u0099s a good vehicle, it saves having to go to a psychiatrist.\n\r\nMartin: That made me angry - and it made Paul even angrier, because neither he nor I knew about it till it had been done. It happened behind our backs because it was done when Allen Klein was running John. Heâ\u0080\u0099d organized Phil Spector and I think George and Ringo had gone along with it. Theyâ\u0080\u0099d actually made an arrangement with EMI and said, â\u0080\u0098This is going to be our record.â\u0080\u0099\n\r\nMartin: EMI came to me and said, â\u0080\u0098You made this record originally but we canâ\u0080\u0099t have your name on it.â\u0080\u0099 I asked them why not and they said: â\u0080\u0098Well, you didnâ\u0080\u0099t produce the final thing.â\u0080\u0099 I said, â\u0080\u0098I produced the original and what you should do is have a credit saying: â\u0080\u009cProduced by George Martin, over-produced by Phil Spectorâ\u0080\u009d.â\u0080\u0099 They didnâ\u0080\u0099t think that was a good idea.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nIt is the song about my late mother and how I felt to lose her.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\na beautiful song. so fitting for the beatles last album.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nThis song has a double meaning. It is about the history of the Beatles as well as a song about the road to Paul's house. I read that somewhere.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nSimply a beatiful song that is full of memories and emotions, fits quite nicely with \"In My Life\".\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nHow come this hasn't got many comments? It rules.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nTo Braindamage: Abbey Road was released before Let It Be. Abbey Road was released in '69 and Let It Be was released in '70\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nzepfloyd...true, but Let It Be was recorded before Abbey Road\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nzepfloyd...true, but Let It Be was recorded before Abbey Road\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nLet it Be was recorded first, but they decided not to release it.  Then when they listened to it after the release of abbey road, they changed their minds.  Smart move.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis is an amazing song and it makes me cry all the time when I listen to it...I think it's about The Beatles going full circle, through many long and winding paths, and going back to the same place, in a way...\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI agree The Great Wok. The long and winding road is about God. Paul was questioing his life like we all do and turned to that which put us here. Don't leave me waiting here is a prayer asking for help,'i'm stuck'. Show me a sign-post. From that which we came will we return.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI trust you stephenws, because it is a love song...\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nit does sound 'ballady' like a love song\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI Love it Too It Means To Me That The Beatles Were Not Working Together Anymore!\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nAre you guys sure that Let It Be was recorded first? I heard that they recorded Abbey Road, sort of intending for it to be their last project together, but then they went in to wrap up some stuff on Let It Be. It was then, while they were recording, that Paul got pissed off because John and George had insisted on adding a whole bunch of instruments he felt were unnecessary to his songs without asking his permission. That's when he decided to quit, and everyone else followed suit.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nI love this song, though I haven't heard the \"Naked\" version yet. I kind of wish they released Let It Be before Abbey Road. I think \"Then End\" seems like a better goodbey song than \"Long and Winding Road\"\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nthis is such an emotive song. they played it at George Best's funeral and i just cried my eyes out.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nin an interview Paul said he was trying to \"do a Ray Charles\" on this song. it might take a few listens, but you can hear the similarities in thier voices.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nThe best versions are the bootlegs! Ditto for all the other \"Let It Be\" material.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nI agree that the \"Let It Be Naked\" version is much better than the original version.  The original sounds so super great until you hear the naked version.  But either way, it's a beautiful song.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nWell, now I believe its about the beatles and the road to pauls house. But before I knew any beatles history, when the beatles were just a 20 greatest hits tape to me, I thought it was about a man who wants to take a relationship to the next level, marriage. Many times before he has proposed and been turned down but he keeps coming to the same point in his relationships. The you in the song I didn't think was one person, but more like, all of the women he'd known. The \"many times I've been alone\" part is saying his relationships have been lost a lot there and hes cried about it but hes saying its not their fault because they don't know how many times hes tried (the Naked version blows this theory away though, maybe in the naked version she was just a bit of a bitch). And all the ways hes tried to propose or maybe even steer the relationship in a different direction, they keep leading him back to that same point. Then the song caps off by saying \"Lead me to your door\" Which is him proposing once again.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nAre you guys sure that Let It Be was recorded first? I heard that they recorded Abbey Road, sort of intending for it to be their last project together, but then they went in to wrap up some stuff on Let It Be. It was then, while they were recording, that Paul got pissed off because John and George had insisted on adding a whole bunch of instruments he felt were unnecessary to his songs without asking his permission. That's when he decided to quit, and everyone else followed suit.\n\r\n--- Not quite right. What happened was that Phil Spector, a producer, was a major editing force in the song. When he went to edit it, the only Beatles member present was Ringo, and so Phil sort of went off his rocker and added an entire orchestra, choir, and horn section. Ruined the song, in my opinion. That sort of thing was for American motown groups, not The Beatles. Anyway, Paul got pissed when he found out what Phil did and cited it as one of the reasons for ending The Beatles. en.wikipedia.org/wiki/…\n\n\n", "comment_32": "\nI think this is Paul singing to John. John had decided to leave the Beatles. Paul wanted to keep the Beatles together. John wouldnt listen and Paul didnt want to see the band that they had been in together sice childhood split up.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\ni see this as a paul singing to john. together they were something amazing that they couldnt completely capture on their own.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nTo me this song is all about love. He says The Long and Winding Road has led him to someone's door (symbolizes someone's heart), and says not to leave him standing there alone, and to let him know the way (into their heart). And no matter where he goes in life or what he does it always leads him back to thinking about this person. It's just what I got out of this song, I guess that's all that matters.\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nthis song is absolutely beautiful.\r\ni think another interpretation of this song is that sometimes one may find the person that they are meant to be with, but due to other circumstances, they are somewhat rejected from having a long term relationship with that person.\r\nanyhow---so i think that this song talks about how you never let go of that one person, no matter how many others your with or what happens with your life. your mind leads you back or \"takes you back down the road\" to that one \"home\" that you found in that certain person.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nthis song is absolutely beautiful.\r\ni think another interpretation of this song is that sometimes one may find the person that they are meant to be with, but due to other circumstances, they are somewhat rejected from having a long term relationship with that person.\r\nanyhow---so i think that this song talks about how you never let go of that one person, no matter how many others your with or what happens with your life. your mind leads you back or \"takes you back down the road\" to that one \"home\" that you found in that certain person.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nAbsolutely adore this song but it kills me every time i listen to it.  I'd say it's pretty clear what the song is about...gorgeous song\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nThough there are many Beatles songs that I like more than this (it's so hard to say that because their entire catalog is amazing), this has to be ONE of the most heartfelt songs of the Beatles.  But there is something about this song that really touches me.  My fiancee and me are considering this for our wedding song.  Amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI hear it as a love song.  Maybe it started off with 'the long and winding road' after being influenced by the road to his house but then added in the romance to the song.\n\r\nI've always appreciated the song but it was never one of my favourites but then I nearly cried when I heard it live.  Unbelievable\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nThe beatles effectively started to falter after the death of brian epstein...and yes..long and winding road was the last released - but not recorded - abbey road was recorded last and released prior to let it be..the producer was phil spector(let it be)....abbey road turned out to be one of their finest and the beatles remain above all in rock and roll groups..\n\r\nthe sessions to let it be were a disaster and the boys were looking to do a \"special one off\" with george martin to end on a good note........abbey road was it.\n\n\n\n", "comment_41": "\nThis song can have so many meanings and as I got older I can see it through the prism of the beatles breaking up, a love song, a career, of just LIFE.  In my opinion it is the most beautiful song ever written because of the melody, the words and the open interpretation.  This was always a good song, but it just seems to get better with age after 44 years as I age; it has such a deeper meaning.  Like so many Beatle songs, they just keep getting better.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nThis song only means loss of a loved one.  I play this song on my player at least 5 times per day and I never fail to cry.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nThis is one of those where why does this page allow comments.\n\nBut I hope someone reading this finds this song as inspirational and uplifting as I do, in spite of the fact that it reeks of depression.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI've been married for 17 years and my husband decided this was our wedding song. Although it's ambiguous in parts, most people would indepret it as a love song. .\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nMcCartney is trying to express his lonely feeling through this song.\n\n\"The long and winding road that leads to your door\"\nMcCartney implies that he is in a hard situation by comparing it to \"the long and winding road\". It means that he has not been able to reach his other group members.\n\"will never disappear\" implies that he thinks he will never be able to reach them.\n\"I've seen that road before\" implies that he has always been felt the same way for a long time.\n\"It always leads me here, lead me your door\" implies that he is not successful at reaching the other members, and he wants them to show him how to reach them.\n\"many times I've been alone\" says that he has been feeling alone, and \"and many times I've cried\" says the situation is so hard for him that he has cried. \n\"anyway, you'll never know the many ways I've tried\" implies that he thinks the other members will never know how he has always been trying hard to reach them.\n\"but still they lead me back to the long and winding road\" this implies that despite the fact he is trying, he cannot make the situation better.\n\"you left me standing here a long long time ago\" implies that he was left by the other members a long time ago.\n\"don't keep me waiting here\" implies that he doesn't want them to just leave him alone.\n\"lead me to your door\" implies that he wants the other members to show how to them.\n\"The wild and windy night that the rain washed away\" compares how much he has been going through with \"the wild and windy night\" and says that the hard situation stole so many things from him like his friendship between the other members. \n\"has left a pool of tears\"implies that the situation only leaves him in a sad feeling.\n\"crying for the day\" implies that he wants to get out of the dark and find a hope. \n\"don't leave me waiting here (don't keep me waiting)\" says that he wants them to are for him, and \n\"let me know the way\" implies that he does not know how to reach them and he wants them to show him how to.\n\nThis song was made about the time when McCartney wanted to get out of the group because of difference in opinions between other group members. He went back in time when he slowly understood how it was hard to make everybody agree on a same opinion. I liked this song simply because the melody is beautiful, but now that I studied the lyrics, I love it more because I like the way he compares a winding road to the situation which he was in.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nRelationship to God. Brings me peace.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nI think this song talk about two lovers, but I also think that it can talk about someone that is missing someone who died and this song tells about the longing to this person, \"don't keep me waiting here, lead me to your door\".\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nthis song is decent but very overrated.  Not a bad song for a movie soundtrack, especially after being Spectorized...but below Beatle standards.\t\t\t\t\n\t\t\t\t\n\n"}