{"comment_0": "\nI love this song! It's perfect for a lazy Saturday playlist. \n\r\nAnd the meaning's pretty obvious.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI don't like Bruno Mars what so ever, but this is a great song. After a looong work week, this is my theme song. The weekends, I don't do shit. lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nSelf-explanatory song. Nice pick-me-up tune for those do nothing days, such as today. My FAVORITE line is the about sex where the female chimes in \"This is great.\" Heck, he's even lazy when it comes to having sex :) Bruno Mars: talented songwriter, and this is just one of his cute tunes.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nI am addicted to this song. I love Bruno Mars.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThis is my favourite feel good song\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\ni love this song :) \t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nUltimate feel-good song, love it. Pretty obvious, just about feeling lazy, making plans but not bothering, just sit back and enjoy. (Not quite as much as he is though *ahem*)\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nLyrically, this is like a happier version of Green Day's Longview.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nReminds me of one of my favorite Sublime songs called Burritos.  \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\ni think that hes soo sick of the media and the illumanatti  that he juss wants to chill with monkeys\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nGreat song for days such as today. I just want to walk around in my furry leopard robe with my ugly flip flops on and do NOTHING. Am too tired to work, but not too tired to not procrastinate. Got a snoring cat under the bed; dirty laundry to be washed (ain't gonna happen); and a list of chores that just won't get done. But who cares! Now if only I could sit and enjoy the song with Sheldon from the TV series. I would laugh the day away!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThIs SoNg Is AbOuT BrUnO MaRs BeInG......\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nLaZy*..\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nHaha, so I really love this song, but the parts about \"throwing his hand down his pants\" etc. kind of threw off the vibe for me. :P Still, it feels (for the most part) like my college weekend theme song. \t\t\t\t\n\t\t\t\t\n\n"}