{"comment_0": "\nHe's calling out all the hypocrites that criticize stoners, but are just as lazy and worthless.  Druggies might be liars, but so are lawyers, there isn't much difference.\n\r\nPeople get up on a soapbox and preach about what everyone is doing wrong, but they are standing in a flimsy house of cards.  And people that live in glass houses shouldn't throw stones, because eventually they get back what they've dished out.\n\r\nThat's a clear reference when he talks about pissing on the black kettle.  Ever hear the phrase, 'calling the kettle black'?  You see everyone else's faults but not your own.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nThis song is about the kangaroo court which was a bullshit court and itâ\u0080\u0099s about the judge who is the one calling the kettle black 'cause he's sending pot smokers (meaning small time offenders) to years in prison while he himself is a heroin user.\n\r\n\"Eye hole deep in muddy waters\" describes a junkie holding up the spoon he just cocked his heroin on to see if itâ\u0080\u0099s right and ready to shot up. \n\r\nits about corruption and injustice and how those in a position of power get away with crimes while a small time/first time offender is made an example off and is sent to prison for years.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nI really don't think Keenan intended for this to be about any one, specific issue. I see this as a general middle finger to hypocritical demagogues, who do wrong to others for their own gain by hiding behind their perceived authority. That's self-evident to anyone who's heard the saying \"that's the pot calling the kettle black,\" if you add that with a few other references in the song.\n\r\nSpecifically, Keenan did mention marijuana prohibition as inspiring the lyrics, but he did say it's about hypocrisy in general but could apply to many things. In any interview I've heard with him, he seems to play his cards pretty close in revealing meanings of his songs. He's not the type to get on his \"soap box\" to ram something down people's throats, and wants people to think for themselves instead.\n\r\nKeenan has reportedly spoken publicly that he thinks the U.S. government was involved in 9/11. At a concert, which had been scheduled the day of 9/11 and rescheduled a few days after, the crowd was chanting \"USA, USA!\" when he said a few words about the victims. When they chanted, he reportedly said something like \"You all are going to really be bummed out when you find out we did this to ourselves.\"\n\r\nIf you apply the lyrics to that situation, they fit as well as marijuana prohibition. \"Who are you to point your finger\" (Patriot Act, Real ID, TSA screenings, domestic spying, police state), as an example. \"Kangaroo done hung the jury\" (like a rigged \"kangaroo court,\" the Patriot Act didn't examine all evidence purposely and many feel it let the guilty go. \"He's as guilty as the government\" (many people realize bin Laden was formerly funded by the CIA, and see more evidence of complicity in 9/11 when they look at the government than they do bin Laden) The examples can go on.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nSo, I decided to avoid doing a paper on Tim O'Brien and instead wanted to try my hands at cracking this one. Though not one of Maynord's deepest recordings, it contains some pretty interesting symbolism, along with a convoluted meaning, and no I didn't edit this or make all fluid and \"smart\" like- I just took it line by line and study the etymology behind this, which should still be pretty decent. If you don't care to see the break up,  just skip to the last paragraph. \n\r\nSo first verse... This verse is extremely accusatory. He says who are you to judge me when you don't see what's going on \"eye hole deep in muddy water\". You talk so highly about yourself, that you assume a Godly status \"raise the dead\". \"Rob the grave to snow the cradle then burn the evidence down\" These lines boldly describe a desperate and loathsome individual, but who? To Snow actually refers to over compliment someone and over flattery in order to take advantage of them, it can also refer to cocaine, but you wouldn't coke a cradle, unless you are creating an environment of delusion.So taking this into consideration, you steal from the dead, and lie to the innocent to get what you want, and then you hide your actions. The rest is a given a \"House of Cards\", a House of \"Glass\"..these things are fragile, this is in reference to New Testament ideology, he who lives without sin... I bring this up because the album as a whole has a very religious awakening theme throughout.\n\r\nSecond V: The speaker accuses the recipient of being delusional and so full of shit, he then makes fun of them. In this line there also seems to be a change in direction towards the audience. \"It must be difficult to dance this one, til you pull it out.\" This statement, says you, the listener can't fully understand the meaning of this song, til you get your head out of your ass. \"Steal, borrow, refer, save your shady inference\" You are relentless in your actions in order to support your belief. \"kangaroo done hung the jury with the innocent\" A kangaroo court doesn't always refer to an actual jury. It also applies to legal matters in general, such as legal misleading, it carries the theme of the dishonest individual. When we take the two lines as a whole we see a legal authority who is hell bent on getting there way. \n\r\n\"now you're weeping shades of cozened indigo. (musta) got lemon juice up in your eye when you pissed all over my black kettle.\" Cozened, to win over someone by ways of deceit. Indigo- Historically one of the most important colors. Indigo was mandated to be worn only by authoritative figures. It also has another meaning in classic literature it often refers to the deepest sorrow, or an overwhelming depression. The Black kettle, ques into the Title, The pot calling the kettle black. Meaning: Your criticism of me and my belief, are blinding you and causing you harm.\"You musta been high\"- Delusional. \n\r\n\"who are you to wave your finger? so full of it\". How dare you judge me, us! \"Eye balls deep in muddy waters. fuckin hypocrite\". You actions disallow you from judgment \"liar, lawyer, mirror show me. what's the difference?\"  Our political system is full of lies, and lawyers are liars. \"Kangaroo done hung the guilty with the innocent.\" Our judicial system is corrupted and malfunctioning. \"Kangaroo be stoned. he's guilty as the government.\" now we get the juxtaposing kangaroo, Kangaroo meaning someone dumb... it was first believed that Kangaroo meant \"I don't know\". So kangaroo be stoned either this idiot is high, or this idiot is being judged. He's as guilty as the government meaning that he is to blame for his actions as much as the government who created the laws against him.  \n\r\nGanja, please. Ganja, only means pot, it has no other meaning. Ganja, please.. please as in whatever, you must have been outta of your mind. The juxtaposition again either, it is the you, the listener, are crazy to think that this song is about pot. Or it is How dare you think that it is correct to destroy someone's life over something so dumb.\n\r\nI think this a criticism towards the current judicial persecution with the example of marijuana users persecution. It's main message though is to the listener that this is not a Pro-Pot song, it is a pro-activism song, because he is saying that the reasons that our government is so out of control, is because \"we\" the listeners are high, and we have allowed them to get this power. We have allowed them to blind us. Eye ball deep in muddy war in this context is us the listener, the baby in the cradle, the innocent. He is trying to get us accept responsibility, get our heads out of our ass and to actually do something.   \n\n\n\n", "comment_4": "\nWow, some of the interpretations are quite... interesting.\n\r\nA couple of things to note... this song is multi-layered, but the most obvious theme here is satire. Tool is playing on words right from the title!\n\r\nThe song is called The Pot, referring both to marijuana and the dirty pot looking at its own reflection.\n\r\nPeople seem to be really confused by robbing a grave to snow the cradle, the muddy waters, lemon juice and weeping shades of indigo. \n\r\nRobbing a grave to snow the cradle: Drug meaning: Doing DMT.  Hypocrisy meaning: Possibly using the deceased to pad election votes into a win.\n\r\nEye ball deep in Muddy Waters + Lemon juice in your eye: Drug meaning: An alcoholic drink containing lemon juice. Hypocrisy meaning: Being blinded by drunkenness and making a poor decision making the decision maker as guilty as whomever he is accusing of wrong-doing.\n\r\nWeeping shades of indigo: Drug meaning: Having purple tears is an idiom for someone who is high. Hypocrisy meaning: Shakespeare referenced \"purple tears\" in more than one of his plays, which was actually not talking about crying at all, but rather bleeding and dying, and in all the times I'm aware of, the protagonist had slain an enemy and referred to his blood-loss leading to death as crying/shedding purple tears. Cozened basically means \"coaxed by deceit\". Of course, this blood would not be literal, so the bleeding hypocrite is up for interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nTrexor,\n\r\nIf you go back and read my post, you might get some insight as to what we are talking about here.  The song is about hypocrisy, not marijuana.  Marijuana was just a vehicle or literary device for Maynard to talk about people committing atrocities and hiding behind laws or positions of power.  Diverting our attention from their wrong doings by waving fingers and keeping the looking glass pointed the other way, and policing us.\r\nDo yourself a favor and read up Kangaroo courts and what is happening in Guantanamo Bay, or find out who Black Kettle is and what happened to him.  Why was he killed?  Think about how that might relate to what is happening right now in the world.  How that might relate to the US war in Iraq.\n\r\nI know this stuff is tough for a 19 year old such as yourself to digest, and may include a sort of textual analysis you are not familiar with, but please stop spamming the TooL boards.  Maynard has been writing theses types of songs long before you were aware TooL existed.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nFirst off, these are the correct lyrics\n\r\n\"Eye hole deep in muddy waters\" - basically an allusion to the entire swamp song, rash decisions lead to too deep a hole to crawl out of\n\r\n\"Rob the grave to snow the cradle\r\nThen burn the evidence down\" - The countless pointless deaths of those protecting our 'freedoms' when it turns out that from the start commercialism, and nationalistic belligerence is poured into our heads. Conditioning almost, for the innumerable times the government has tried, and will try, to lie and hide what it has done to protect those who have committed said atrocities. \n\r\n\"Soapbox house of cards and glass so\r\nDon't go tossin' your stones around\" -  'He had a voice that was strong and loud' Eulogy. A proud and seemingly unshakeable foundation to preach what is right and wrong. When in fact, everything hinges on a cornerstone, deceit, as long as the general public is fed with distractions, the need to to speedy remedies to government loopholes and general stupidity will be almost non-existent. \r\nDon't go tossin' your stones around is simply a warning, to the government to tread softly.  \n\r\n\"You must have been high\" - No relation to actual drug doing, it's saying that what you're doing is so crazy, outlandish, and/or stupid that you must be under the influence. Like Trexor, saying Tool sucks.\n\r\n\"Foot in mouth and head up ass\r\nSo whatcha talkin' 'bout?\r\nDifficult to dance 'round this one\r\n'til you pull it out. boy,\" - snowball effect. Nothing will truly be gained or accomplished until the trend of sweeping it under the carpet, the lies and evasions are stopped.\n\r\n\"Steal, borrow, refer, save your shady inference\r\nKangaroo done hung the jury with the innocent\" - I do not know much on the Guantanimo or Gitmo cases, but it seems very apparent that the ability to adjudicate someone without the evidence is the subject. \r\nCorruption follows the trickle-down principle to, it fits, the broader subject of government taking away mans 'unalienable' rights may not hurt him physically, or immediately, but good men do suffer seems to be the best fit.\n\r\n\"Now you're weeping shades of cozened indigo\r\n(Musta) got lemon juice up in your eye\r\nWhen you pissed all over my black kettle.\" - Cozen: verb, to trick or deceive. I Interpret this as the government is trying to cover up itself by lying, and destroying the evidence, but now we've caught on. We see through the shroud. Apparently Black Kettle is a specific person or case. The entire song has wording which has a 'We're on to you' voice to it. Almost like Fight Club, more specifically, Brad Pitt's lines \"We've grown up being told we're going to be famous movie stars, Astronauts, and rock stars; but we're not, and we're slowly learning that right boys, and we are pissed.\"\n\r\n\"Kangaroo be stoned. He's guilty as the government.\" - Those who would allow this to continue, deserve the harshest punishment available. \n\r\nApologies for the very long comment, but this is what I was looking to find here, but instead I found a lot of stupid people.\r\nSaying Tool sucks, those rat-bastards\n\n\n\n\n\r\nWho are you to wave your finger?\r\nYou must have been outta your head\r\nEye hole deep in muddy waters\r\nYou practically raised the dead\n\r\nRob the grave to snow the cradle\r\nThen burn the evidence down\r\nSoapbox house of cards and glass so\r\nDon't go tossin' your stones around\n\r\nYou must have been high\n\r\nFoot in mouth and head up ass\r\nSo whatcha talkin' 'bout?\r\nDifficult to dance 'round this one\r\n'til you pull it out. boy,\n\r\nYou must have been so high\n\r\nSteal, borrow, refer, save your shady inference\r\nKangaroo done hung the jury with the innocent\n\r\nNow you're weeping shades of cozened indigo\r\n(Musta) got lemon juice up in your eye\r\nWhen you pissed all over my black kettle.\n\r\nYou must have been high!\n\r\nWho are you to wave your finger?\r\nSo full of it\r\nEye balls deep in muddy waters\r\nFuckin' hypocrite\n\r\nLiar, lawyer, mirror, show me. What's the difference?\r\nKangaroo done hung the guilty with the innocent.\n\r\nNow you're weeping shades of cozened indigo\r\n(Musta) got lemon juice up in your eye\r\nWhen you pissed all over my black kettle.\n\r\nYou must've been...\n\r\nSo who are you to wave your finger?\r\nWho are you to wave your fatty fingers at me?\r\nYou must have been out your mind\n\r\nWeepin' shades of indigo\r\nShed without a reason *\r\nWeepin' shades of indigo\n\r\nLiar, lawyer - mirror, for you what's the difference?\r\nKangaroo be stoned. He's guilty as the government.\n\r\nNow you're weeping shades of cozened indigo\r\n(Musta) got lemon juice up in your eye\r\nNow when you pissed all over my black kettle.\n\r\nYou must've been high!\n\r\nEyeballs deep in muddy waters\r\nEyeballs deep in muddy waters\r\nGanja? P-lease!\r\nYou must have been out your mind\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nSome politicians, lawyers and prosecutors who drink unhealthy amounts of alcohol are quick to \n\r\npoint their fingers at non-violent pot \"offenders\", refusing to give them a fair trial (kangaroo \n\r\ncourts). Any defense of these people are quickly dismissed because they are just thought of as \n\r\nbeing \"potheads\" or \"being high\". During Prohibition people who drank alcohol, whether they were \n\r\naddicted to it or not, I shit you not, were called \"juiceheads\" who were \"always drunk\". \n\r\nBasically, as others have mentioned: the pot calling the kettle back. And those who still think \n\r\nthat \"the pot\" is a mere analogy for \"stupid\" may proceed and continue to polish their \n\r\ngovernment's knob. Afterwards you can go to your local Christian drug den (bar) - A great way to \n\r\nunwind and involve yourself in some politically correct rowdiness and stupidity. The Maynard \n\r\nWorshippers in their Maynard is God shirts, drooped eyes and raised hands, as if, ironically \n\r\nenough, are under the influence of opium. Tool fans who smoked large quantities of pot, getting \n\r\ninto the band through bands such as Korn, Limp Bizkit and the \"STICK IT TO THE MAN ON THE \n\r\nCORPORATE LABEL YO\" band Rage Against the Machine. Pothead Tool fans who laughed after one of \n\r\ntheir friends got their future destroyed by a pot conviction. Laughing even harder when one of \n\r\ntheir other friends snitched on their parents. Working as police informants with smug smiles on \n\r\ntheir faces after getting busted themselves. Today, all grown up, off the blind Maynard worship, \n\r\noff the pot, chickenshit conformists (like their parents)... but still Tool fans. High on their \n\r\nown overinflated egos, claiming: Tool is too much of an intellectual band to write a song about \n\r\nsomething as stupid as marijuana. The song the Pot must have some deeper, subtle meaning. You see \n\r\nthe beyond stupid war on drugs is not a trendy thing to criticise. It used to be trendy to \n\r\nblindly jump on the anti-Bush bandwagon and criticise the equally stupid war on terror instead. \n\r\nVoting the Celebrity Rockstar President O'Bomba into power (mostly due to political correctness, \n\r\nwhite guilt, and in fear of being labelled a racist) who recently laughed off a marijuana \n\r\nlegalization question, even though there's no way he would be president today if he got busted \n\r\nduring his drug-taking days (especially since he's black). For this,  his sheep-like liberal \n\r\nfollowers applauded - All grown up and high on prescription meds 1000 times more dangerous and \n\r\naddictive than pot, eager to pour themselves a double when they get home and risk possible damage \n\r\nto their livers (and their brains, though not much damage is needed there). Tool fans who listen \n\r\nto a band who despises hypocrites and blind followers. Tool fans who listen to a band who quoted \n\r\nBill Hicks in their song Third Eye: \"It's not a war on drugs, it's a war on personal freedom.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nSo yeah that video is not the ACTUAL official one, but buggers to that!\n\r\nIT MAKES SO MUCH SENSE!\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nI didn't read all 18 pages of comments, but here's my interpretation:\n\r\nThe song, starting with the title, is a big double entendre for both drugs (marijuana) and hypocrisy in government. \n\r\n\"Who are you to wave your finger? You must have been outta your head\" -> Refers to the \"pot calling the kettle black\", but also to being stoned, \"outta your head\".\n\r\n\"Eye hole deep in muddy waters You practically raised the dead\" -> Not too sure, but seems to be an allusion to war, oil, disaster, etc.\n\r\n\"Rob the grave to snow the cradle Then burn the evidence down\" -> Do something illegal/morally questionable, but then hide all the evidence (common in corrupt governments). Also, \"burn the evidence\", though I've never heard it used as such, could also be taken to mean smoking marijuana.\n\r\n\"Soapbox house of cards and glass so Don't go tossin' your stones around\" -> Refers both to a \"house of cards\", a fragile structure that can come tumbling down in a moments notice, and the addige \"those in glass houses shouldn't throw stones\". Again, also a reference to \"stoned\", or being stoned, which turns up a lot.\n\r\n\"You must have been high\r\nYou must have been high\r\nYou must have been...\" -> Obvious reference to marijuana intoxication, but also to \"being on one's high horse\".\n\r\n\"Foot in mouth and head up ass-hole Whatcha talkin' 'bout?\" -> \"Foot in mouth\" means to shut up.\n\r\n\"Difficult to dance 'round this one 'til you pull it out, boy\" -> Prosecution of marijuana is a difficult dance because so many damn people use it, also corruption is hard to dance around.\n\r\n\"Steal, borrow, refer, save your shady inference\" -> Talking about corruption again, refers to \"refer\", i.e. marijuana again, and \"shady inference\" means \"shady implications\", akin to lying about a political opponent or simply scare-tactics.\n\r\n\"Kangaroo done hung the juror with the innocent\" -> Kangaroo referring of course to a \"kangaroo court\", \"hung the juror with the innocent\" i.e. blamed him for doing what's right, not what the party line is, because he defended the \"innocent\" (i.e. drug users, who hurt no one but themselves).\n\r\n\"Now you're weeping shades of cozened indigo\r\nGot lemon juice up in your eye\r\nWhen you pissed all over my black kettle\" -> I heard someone say \"weeping indigo\" could mean blood, i.e. deaths from the hypocricy and war, \"lemon juice in the eye\" refers to kicking dirt or lies at someone, while \"black kettle\" again references \"the pot calling the kettle black\".\n\r\n\"Who are you to wave your finger? \r\nSo full of it \r\nEye balls deep in muddy waters\r\nFuckin' hypocrite\" -> A variation on the first stanza, only more angry and outright. Last line sums it up.\n\r\n\"Liar, lawyer; mirror show me, what's the difference?\" -> Lawyers are usually thought to be lying fraudsters.\n\r\n\"Kangaroo done hung the guilty with the innocent\" -> Almost the same as above, only I don't know what implications changing \"innocent\" to \"guilty\" has to the meaning.\n\r\n\"Now you're weeping shades of cozened indigo\r\nGot lemon juice up in your eye, eye\r\nWhen you pissed all over my black kettle\r\nYou must've been...\" -> Repeat of above.\n\r\n\"So who are you to wave your finger?\r\nWho are you to wave your fatty fingers at me?\r\nYou must have been out your mind\" -> Starts off the same as the first stanza again, only \"fatty fingers\" refers to politicians, the \"grubby little piggies\" with their hands in everything!\n\r\n\"Liar, lawyer; mirror for ya', what's the difference?\" -> Same line of as above.\n\r\n\"Kangaroo be stoned. He's guilty as the government\" -> A command to fight the kangaroo courts who are as guilty of hypocrisy and corruption as the government proper.\n\r\n\"Eyeballs deep in muddy waters\r\nYour balls deep in muddy waters\r\nGanja POLICE*\r\nYou must have been out your mind\" -> First things first, I'm 95% sure it should be \"Ganja police\" not \"Ganja please\". Ganja police referring to those who wish to keep marijuana down and illegal, i.e. War on Drugs. Also \"your balls deep in muddy waters\" could be a reference to being \"in over your head\", only since it's talking about the \"old white men's club\" (government), balls is an appropriate substitution.\n\r\nWell, that's my take. \t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nRock Hawk has it right.  The pot calling the Kettle black. Its all about hypocrisy.\n\r\nspecifics:\r\nBlack Kettle = Chief of the Southern Cheyenne (also listen to the following song)\r\nKangaroo = the kangaroo court in Gitmo\r\nMuddy waters = Oil (raising the dead)? / Katrina (actual muddy waters)?\n\r\n\"Who are you to wave your finger? So full of it.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nit's not about pot specificly but makes for good word-play.  its that whole 'kids today & their music are so much worse than i was a kid', that the last 100 years+ worth of generations has thought.  much like the church thinks scientists today are so much worse than before.  the song is about power-groups loosing a sense of control.  while these ridiculous power groups aren't 'high' but rather a much more sensible legally drunk, or god-like, or correctly medicated - about their power & the rationales used to propogandize, they'd do just as well to be high because the logic, lobbying, or trials/laws make no sense when there are much more dire needs to be addressed.  so a person likes to smoke a l il pot or drink a little booze or kiss a same sex person  or have an abortion or get some stem cell operation to heal themselves; the laws & efforts behind stopping these 'evil' are such a distraction & things could much better be concentrated towards ending famine, overpopulation, & other real worldy concerns, & better focused towards greater human growth while we spin on this random rock thru space, which isn't flat nor the center of the universe or other such nonsensical reasons one could have previously gone to prison for... like being a particular race & wanting to drink from a water fountain, or be a particular sex & wanting to vote, or smoking some pot... oh yeah, that ones still on the books.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nFirst, I say itâ\u0080\u0099s good poetry, so itâ\u0080\u0099s whatever it means to you.  I believe the title is a double entendre which includes both marijuana and the old idiom about The Pot calling The Kettle black, which is generally understood to imply hypocrisy.   I believe the line saying â\u0080\u009cpissed all over my black kettleâ\u0080\u009d is just a cool way of saying â\u0080\u009ccriticized meâ\u0080\u009d.   I think the song is about pot, laws, political machinations and the hypocrisy of those in power to judge others.   And like the beauty of nuance in other classical music composition, you can infer many other threads of meaning woven in.  With all the metaphors we have to imply hypocrisy, Tool chose to highlight the pot and kettle.  Now look at the lines in the 1904 book, â\u0080\u009cMaxwellâ\u0080\u0099s Elementary Grammarâ\u0080\u009d:   â\u0080\u009cOho!â\u0080\u009d said the pot to the kettle; You are dirty and ugly and black!â\u0080\u009d  Toolâ\u0080\u0099s lyrics conjure images of racist fingers pointing at all the black men this country jails for marijuana offenses.   I picture a fat conservative judge addicted to painkillers sitting up high on his bench and wagging his doughy index finger at an inmate being sentenced to prison for selling ganja.  I read a theory about â\u0080\u009ccozened indigoâ\u0080\u009d I like on this page toolnavy.com/… that links religion and deceit. Psychic aura color interpretation says Indigo â\u0080\u009crelates to the third eyeâ\u0080\u009d and Dark or Muddy blue indicates â\u0080\u009cfear of future and facing the truthâ\u0080\u009d.  Draw your own conclusions.  Politicians who rub lemon juice into their eyes to make them water have false, mechanical sympathy . It reminds me of the saying, â\u0080\u009cspare me your crocodile tears.â\u0080\u009d  Crocodiles cry, not because they feel sorry for their victims, but because their jaw is so close to their eyes that the pressure of chewing makes their eyes water.  This song is an amazingly brilliant composition, written by men with brains the size of cauldrons. There are layers I didnâ\u0080\u0099t even notice until just now when I read in Wikipedia that Adam Jones confirmed what the title refers to: en.wikipedia.org/wiki/… .  Itâ\u0080\u0099s sweet poetry because you will see things I didnâ\u0080\u0099t.  At first I thought â\u0080\u009ckangaroo be stonedâ\u0080\u009d meant stoned to death, but now I see that the kangaroo on the judicial bench is â\u0080\u009cSTONEDâ\u0080\u009dâ\u0080\u0093wastedâ\u0080\u0093so high on other drugs that the accused screams out to say weed is nothing compared to what heâ\u0080\u0099s on: â\u0080\u009cGanga, PLEASE (are you fucking kidding me?) you must have been out your mind!â\u0080\u009d\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nAfter reading the lyrics through a few more times, I want to say that I think it isn't limited to just the drug issue.  I don't think that is the main focus.  The title is a double meaning, marijuana referrence and it goes back to the 'pot and kettle' thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nhey MxMave... you do know maynard had a part of RATM's first CD... he was also quite vocal about voting out George Bush during APC's last tour... his political leanings are clear...\n\r\nthat being said, who else loves the bass on this song... justin really stepped it up on this album...\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nWho is it that calls the kettle black? The pot. \n\r\nAbout hypocricy, blind opinionism and general stupidity. It could refer to any situation - From GW Bush preaching good and evil, to the blind accusations of the conspiracists who would oppose him... general soapbox behaviour. \n\r\nVery tasty song, loving the album\r\nx*x\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\ntrexor,\r\ndo you have nothing better to do with your time then write rude things about tool ?\r\nbecuase if you don't, then that's pretty lame.\n\r\ntool is fucking talented, \r\ndeal with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\ntrexor,\r\ndo you have nothing better to do with your time then write rude things about tool ?\r\nbecuase if you don't, then that's pretty lame.\n\r\ntool is fucking talented, \r\ndeal with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nThis song is about the American Government, and courts being corrupt and making such a huge deal about marijuana. The title is in reference to marijuana, and the phrase \"The pot calling the kettle black\". The kangaroo is symbolic of the judicial system. \r\n\"You musta been high...\" is a sarcastic remark for the ridiculous claims that the government and especially, the judicial system make. \n\r\nAlcohol is legal, and look how many people have died as a result of it's use, abuse, and driving under the influence of it. \r\nHow many people do you know of that have died in a marijuana-related accident?\r\nWhen people get stoned, all they want to do is sit on their couch, eat, and laugh at really stupid jokes and tv shows that normally wouldn't be funny. \r\nWhen people get drunk, they're defensive, obscene, rude, loud, emotional or angry, and can be very violent. They tend to want to beat the shit out of everything that walks past them, and driving doesn't seem so difficult. \r\nSome pot-smokers, such as myself, use it as a means of perception, and a way to get a new perspective on topics, or to help ease writer's block.\r\nIt helps me write better, and it helps me paint better. When I'm stoned and have conversations about very big issues, I tend to understand things on a different level, and perceive things from a different perspective. It helps me to not be so \"one-sided\". \n\r\nSo, government officials aren't wrong when they cheat, steal, lie, and slander, but pot-smokers are awful people because they like pot?\r\nYeah... that's TOTALLY logical.\r\nNot.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nwell, he's obviously talking about pot, and I believe he is talking about hypocrites, but I think its pretty specifically about law enforcement and their regulation of marijuana. \n\r\n\"foot in mouth and head up ass, so whatcha talkin bout?\"\n\r\nhe's referring to the superior attitude some cops have toward people, as if being a cop makes them a better human than the rest of the human race.\n\r\n\"steal, borrow, refer, save your shady inference\"\n\r\nthis is about using government informants and the immoral way that they will allow a criminal or druggie to continue getting away with their lifestyle if they help the police catch other criminals or druggies. or, about dirty cops who steal evidence and sell it.\n\r\n\"weeping shades of cozened indigo, got lemon juice \r\nup in your eye, when you pissed all over my black kettle\"\n\r\ncozened indigo is like the dark blue cops wear but they put on this front, and get mad (lemon juice in your eye) when someone proves that they are the pot calling the kettle black.\n\r\n\"who are you to wave your finger\"\n\r\nhow can law enforcement be so corrupt in some aspects but we are still expected to uphold it\n\r\n\"liar, lawyer, mirror show me what's the difference?\" \n\r\nwhat's the difference between him as a drug user and a cop? not enough for the cop to be high and mighty towards him.\n\n\n\n", "comment_20": "\n\"eye hole deep in muddy waters\" - Hurricane Katrina\r\n\"kangaroo done hung the jury with the innocent\" - Abu Ghraib\r\n\"kangaroo done hung the guilty with the innocent\" - Gitmo\r\n\"Cozened Indigo\" - lying for a cause\r\nBush arrested for cocaine possession and drunk driving - mysteriously the evidence gone\r\n\"the pot\" calling the kettle black = Hypocrite\r\nWhole song = about hypocrisy\r\n\"Ganja? puleeeze!, you must have been outta your mind\" = if you think I'm talking about pot, you're crazy.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nYes, its about hypocrites: Bush, the gov, the police, politicians, lawyers, all of us ...... not \"pot\".\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nFairly in line with alot of the others, but I've got a few thoughts of my own, and different \"heard\" lyrics.\n\r\n[Just a note, but from my perspective, the whole song is sung with more of a dismissive tone than an angry or sarcastic one, towards the \"listener\" (not necessarily the actual listener, but a ficticious entity to which the song is directed)]\n\r\nWho are you to wave your finger?\r\nYou must'a been out you're head.\r\nEye hole deep in muddy waters,\r\nyou practically raised the dead.\n\r\n(pretty obvious, chastising the \"listener\" for initially chastising him... the illusion towards the \"listeners\" overinflated ego apparent.)\n\r\nRob the grave to snow the cradle,\r\nand burn the evidence down.\r\nSoapbox, house of cards and glass,\r\noh, don't be tossin' your stones around...\n\r\n(a reference to \"Grave robbing\" something highly immoral, viewed as a \"victimless crime\" by many who practice it... \"snow the cradle\" I'm more prone to making sense of \"Sow\" but I hear the \"n\" either way a reference to self benefit. a rattling off of metaphores to emphasize the shaky foundation of the \"listener's\" self righteousness)\n\r\nYou must'a been high, you must'a been high...\r\nYou must'a been...\n\r\nFoot in mouth and head up asshole,\r\nwha'cha talkin' bout...?\r\nDifficult to dance 'round this one,\r\ntill you pull it out... Boy.\n\r\n(Maynard again repeating his disdain and disbelief at the \"listener's\" apparent inability to \"right\" themselves.)\n\r\nYou must'a been so high, you must'a been so high...\n\r\nSteal, borrow, reaper, savior, shady inference.\r\nKangaroo done hung the jury, with the innocent.\r\nNow you're weepin' shades of chosen indigo,\r\ngot lemon juice up in your eye!\n\r\n(This one is very important, steal/borrow, reaper/savior... these are all perspective based \"inferences\" that change from person to person... not everyone assumes the same character or result to every statement or action that others made. the next two verses are fairly obvious... the \"listener\" seems to be invoking pity, the words he uses indicates maynard's point of view on the act... its just another lie.)\n\r\nWhen you piss all over my black kettle,\r\nyou must'a been high... high...\r\nYou must'a been high, high!\n\r\nWho are you to wave your finger, so full of it!\r\nEyeballs deep in muddy waters, fucking hypocrite!\r\nLiar, lawyer, mirror show me what's the difference?\r\nKangaroo done hung the guilty with the innocent!\n\r\n(again, \"don't chastise me\", another citation for to the \"listener's\" hypocrisy... a \"kangaroo court\" is a mock trial, often done by the military, government, or the people; where guilt is assumed ahead of trial... sure, its sometimes used to \"get\" those who are normally beyond legal reproach... its always often used as psychological justification for \"hate crimes\")\n\r\nNow you're weeping shades of chosen indigo,\r\ngot lemon juice up in your [high] eye!\r\nWhen you piss all over my black kettle...\r\nYou musta been...\n\r\n(another listening of common metaphors \"fake tears\", \"black kettle\"... though I -swear- I hear \"high... Eye!\" instead of an echoed \"eye\" and I find it significant... it points to maynard's perception of the \"listener\" having a self righteous attitude, they consider themselves \"high minded\")\n\r\nSo who are you to wave your finger?\r\nWho are you to wave your muddy fingers at me!\r\nYou must have been out your mind...\n\r\n(\"dirty fingers\", references to the guilt of the \"listener\", 'nuff said :3)\n\r\nWeepin shades of indigo, shed for better reasons...\r\nWeepin shades of indigo...\n\r\n(I hear \"shed for better reasons\" this might be just a psychological bias on my part, but it seems for a moment that perhaps maynard thinks real tears might have come, or perhaps they were real the whole time, without the \"listener\" understanding them.)\n\r\nLiar, lawyer, mirror for ya, whats the difference?\r\nKangaroo, be stoned; he's guilty, as the government!\r\nNow you're weeping shades of chosen indigo,\r\ngot lemon juice up in eye, eye!\n\r\n(this is notable for how forceful and abrupt it is after the small \"gently spoken\" interlude... he's changed his mind, maynard has gone back to believing in the \"listeners\" guilt without and doubt)\n\r\nWhen you piss all over my black kettle,\r\nyou musta been high... high, high, high!\n\r\nEyeballs deep in bloody water!\r\nEyeballs deep in muddy water...\n\r\nGanja police? you must been out your mind!\n\r\n(I hear police, I think \"ganja police\" is simply a metaphor for hypocritical action and thought. I have YET to see a commercial specifically targeting coke or meth, where are our \"say no to meth\" commercials?)\n\r\noverall I think the song is more about hypocrisy [in more than one way], than anything else... the occasional allusions to drugs are just distraction or metaphor.\n\r\nIn the song, maynard is chastising a nameless hypocrite. but, in the process... if you listen, he's just as strong headed, an \"unshakable\" as he accuses the \"listener\" of being, he's just as hypocritical in his unwavering belief in the \"listener's\" lieing and self centered nature.\n\r\nThe song is also generalization, it can be aimed at anyone, and I think thats the way he intended it.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nIts all about hypocrisy. Not just political but hypocrisy in all. There are a thousand references points to be made for every Tool song about what each song means. They generalize most of their songs to leave room for interpretation by the listeners. This song in particular is about hypocrisy.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nThe Pot is all about hypocrisy. The \"pissed all over my black kettle\" is reffering to the treatment of the black society when they are accused of a crime. The \"high\" term is used as being high off of pot and putting yourself on a pedestal making yourself seem higher than everyone else. And the \"stoned\" term is used to describe the stoned effect of pot and the stoning of someone who commits a crime.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nMuddy Waters....think musician\nBlack Kettle....think witchcraft (or the implication of)\nThe Pot......think the accusation of or the hypocrisy of (or implication of)\nSnow The Cradle.....think the theatrics of such boastful implications in a Kangaroo Court.  \n\nBasically he's telling someone....don't point your finger at me when your inventory has just as much BS in it.\n\nPersonally I think it's about someone saying he was trying to grow pot in his vineyard and he told them to go 4 degrees the other direction....ya dig?\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\n\"Rob the grave to snow the cradle\" is a term that confuses a lot of people.\nIt is common knowledge that \"robbing the grave\" is a metaphor for doing something unspeakable/unforgivable/corrupt. \n\"Snowing the cradle\" refers to covering up the truth (blanket of snow) to deceive the younger/more naive masses (the cradle.) \nThe kangaroo courts made a habit of doing a lot of dirty work to deceive younger generations into believing that harmless recreational drugs (i.e. pot) was a serious problem, even though many government officials get through the work week by snorting coke or popping pills. Mind-expanding substances can pose a real threat to our government, as they encourage free thought. Not to mention that the war on drugs is an excellent distraction to keep the public eye away from the real political issues at hand. \n\"Kangaroo be stoned; he's guilty as the government.\" \n(refers to politicians who abuse drugs)\n\"Kangaroo done hung the guilty with the innocent.\"\n(refers to the way pot smokers are often prosecuted alongside crack dealers, as if the offenses are comparable)\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nThis song really gets my blood up in a way few songs can (Jambi being another one). This is my favourite tool song by a margin.\n\r\nWho are you to wave your finger?\r\n So full of it\r\n Eyeballs deep in muddy waters\r\n Fucking hypocrite.\n\r\nJust who the fuck do you think you are telling me what to do with my mind and body?\n\r\nWorse still you chug down scotch until you sleep and have the nerve to look down on me as drug user? \n\r\nWhether you buy in to the propaganda on drugs or you're using it to further your agenda, you're either an idiot or a liar. Fuck you.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nwell, these lyrics are pretty far from accurate... but it's nice someone took a stab at it this early... better than i could have done, so good job FireWorx...\n\r\nstill not sure what this song's about... it seems to be criticizing lazy stoners... or it might be trash talking the self righteous retards who have their own ideas about what Tool 'should' sound like...\n\r\nwho knows, i'll wait until the lyrics are a bit more clear to pass judgment\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nhe actually says \"don't go tossin' your  stones around\" and i don't think this song is as much criticizing lazy stoners as it is about all the anti-marijuana advertisements (aka public service announcements) and the general policies  governing pot. maybe i'm wrong, but that's what i've got with the couple of listens i've had and reading the lyrics once over.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nack, Don't like this version of the lyrics all the much, and I think the part where it says \"so full of it\" might be subordinate\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\noh dear... it seems the word is in from the auzzies and kiwis... the album is selling fast...\n\r\n10,000 DAYS IS THE REAL DEAL... THE LEAK IS NOT FAKE... THE FAKEOUT IS FAKE\n\r\nHey TREXOR ... 'foot in mouth and head up ass, so whatcha talkin' bout'... eh?\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nI think it's making fun of pretty much anybody who takes this song seriously.. heh\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nTrexor.  I still think we are misunderstanding each other.  You are the only person calling this track \"deep.\"  All i was doing was pointing out that its subject matter was more than \"LIKE. omfg! calling the kettle black and marijuana!\"  This album, and this song, are throwbacks to older TooL, stuff others of us have grown up on.  The band specifically stated that it would be more angry and less enlightened, not a Lateralus 2.  So just get over it and enjoy the music.\n\r\nThat \"pretentious asshole\" and \"dipshit\" stuff cut me deep trexor.... deep...like \"omfg! calling the kettle black and marijuana\" deep.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nthe album is now out in Germany, Italy, and Belgium... can we get over it... 10,000 Days is real...\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nWIKIPEDIA\n\r\nSkepticism that 10,000 Days is the actual title has become void since the album has already been released in some European countries.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\ni think i speak for everyone when i say..\r\nHey, Trexor, try pulling your foot out of your mouth asshole!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nImagine how ignorant Trexor feels after saying for so long now that the leak was fake. If you have been listening to Tool all along and know their style, than you wouldn't have doubted this cd for a second. This is 100 % genuine Tool and the cd is amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nnot just the song, but the whole album! its another masterpiece, i live in australia, the album was released today and its amazing, love the special \"tool vision\" goggles....... definitely an album for the acid conniseur hahah =)\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\noh god, no... you're not saying that a majority of Tool's fans probobly smoke cannabis are you...\n\r\nplease, jesus, no, i sure hope no one attatches a label to a band like Tool... i'm sure they'd be devestated... \n\r\nfuck man, you seem more concerned about what people will think about you if they catch you listening to this than how good this song is...\n\r\nthis song kicks ass... the heavy bass lead reminds me of opiate\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nschedule I?\n\r\nI like that \"the pot\" refers to the person being sung to.\n\r\n\"Youâ\u0080\u0099re a liar, lawyer, mirror show me whatâ\u0080\u0099s the difference.\"\r\nmirror seems to add a lot to that line.\n\r\nis snow in refrence to the holocaust?\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nI agree fully with the account by nonetospeakof. The references appear to be accurate. Hypocisy is disguised by those with power, who 'point the finger' at the apparent wrongdoers. This new album is just what i needed from the music world. For a long time I've felt cheated by it. Since I heard Lateralus i've been waiting for more! Trexor, no mean to offend, but i reckon you should calm down. He may have sounded pretentious to you, but he was only trying to explain the song to you so you didn't continue to insult a band he obviously adores and respects. Enjoy the album guys\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nTREXOR shut up! The cd is out and its really i picked up my copy right when the store opened, o by the way i already new it was real because i work at CC and it's been shiped in for weeks!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nmost of the songs from the new album seem to be an observation of human nature. i think he's saying that everyone lies sometimes, whether you're a drug user or a well respected lawyer. there's no difference between people who lie, so the lawyer might as well be the one who's high.  also, he says it's hard not to lie until you get your head out your ass. this isn't the first time maynard's talked about lying either-he siad \"dont you fucking lie\" in eulogy. also, he says that lying hurts people when he says \"hung the guilty with the innocent\" meaning that liars or drug users blame other things or people for their problems. also, he's saying that liars try to cover their tracks when he says \"burn the evidence down\".\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nTREXOR: \n\r\nI think I speak for pretty much everyone when I say that you need to get the fuck out of here. The name of this website is songmeanings.net, NOT \n\r\ninsultoneofthegreatestbandseverandImanasshole.net\n\r\nWhy don't you go listen to Creed or something. \n\r\nGET A LIFE\n\r\nIf you don't like the new album, since it most definitely is real, then disregard it and find something better to do.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nOkay, I know I shouldn't doubt, but I need comfirmation: is it really Maynard singing on this song? Cuz it sounds like the guy from Weezer.\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThe term 'kangaroo court' is apparently an unauthorised or inproper court in which justice is perverted. This makes sense because it fits with the critique of using 'the guilty to hang the innocent', and with the corruption of 'lawyers', who are often 'liars'.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\ni bet TREXOR would rather listen to nicleback than tool\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\ni think i have an explination for the \"muddy waters\". some guy wrote a book about lachrymology, but most consider lachyrmology to be an invention of tool. it's literally means the study of crying, but basically it means going though pain to become a higher being. this is seen in such songs as 46 & 2-\"i choose to live and to grow\" and also in aenema with the whole water theme. i think the muddy waters in this song is someone crying for the wrong reasons-a way of lying to get what you want. in other words, the tears aren't pure-they're muddy.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nWhy the different sounding voice on this song?  He sounds like the guy from Mars Volta.  Anyways, i think Tool may have fallen short with this new album.  It just doesn't have the spectrum of their previous albums.  There is nothing that really \"rocks\" or any good meditative songs.  I have been listening to their entire catalog for the last two months to prepare for the new album and it was kindve a letdown.  I mean c'mon, in Vicarious he actually says, \"la la lala la la.\"  Maybe this album is a joke on all of us.\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\ni think he says \"hung a jury with the innocent\" instead of a \"juru\". jury makes more sense.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\n\"I Hold\" Deep in Muddy Waters i think should be\r\n\"Eyehole\"\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nThe stupidity of the users on this site never ceases to astound me. Put some fucking THOUGHT into your posts, idiots. The song is about hypocracy. In an interview, Adam Jones said himself that the line, \"Who are you to wave your finger?\" is in reference to \"the pot calling the kettle black\". Tool purposely lined the lyrics with apparent drug references to hide the true meaning of the song from those who are shallow enough to think it truely is about drugs.\n\r\nHere...let me break it down for those of you whose IQ's seem to be equivalent to that of a tick.\n\r\n\"Who are you to wave your finger? / You must have been out 'your head\" = He's calling the person a hypocrite, saying that he must have been mad to think that he was any better than anyone else.\n\r\n\"Eyehole deep in muddy waters / You practically raise the dead\" = The hypocrite is up to his eyes in trouble, so to speak, with his act of greatness. Yet he continues to act high-and-mighty as if he's better than everyone else. \"You practically raise the dead\" is a metaphor for the hypocrite acting as if he's on par with God.\n\r\n\"Rob the grave to snow the cradle / Then burn the evidence down\" = The hypocrite performs immoral acts and profits from them. \"Snow the cradle\" could be considered a metaphor for \"showering one's home in riches.\" This shows that the hypocrite has gained his self-proclaimed \"greatness\" (i.e. wealth) through improper means. The hypocrite then proceeds to attempt to cover up his doings.\n\r\n\"Soapbox house of cards and glass\" = The hypocrite preaches as if he knows better than they, yet the base on which his points rest is as sturdy as a house of cards. It's easily shattered, like glass.\n\r\n\"So don't go tossin' your stones around\" = This is another common statement about hypocrites altered into Keenan's own words: \"Those who live in glass houses should not throw stones.\"\n\r\n\"You must've been high\" = The hypocrite must've been really high on himself to actually think he was better than anyone else.\n\r\n\"Foot in mouth and head up ass / So whatâ\u0080\u0099chu talkin' 'bout?\" = Again calling the person a hypocrite, this time two times in succsession, and in different words each time. \"God your foot in your mouth\" and \"God your head up your ass\".\n\r\n\"Difficult to dance â\u0080\u0098round this one / â\u0080\u0098Til you pull it out, boy\" = A bit hard to show someone how hypocritical he is unless he pulls his foot out of his mouth or his head from his ass, isn't it?\n\r\n\"Steal, borrow, reaper, savior / Shady inference\" = The difference between right and wrong is presented here; opposite sides of the spectrum, if you will. Sealing is to reaper as borrow is to savior. The hypocrite has been stealing, as evidenced in the earlier lyric, \"Rob the grave to snow the cradle\".\n\r\n\"Kangaroo done hung the juror with the innocent\" = This applies to the term \"kangaroo court,\" in reference to shady and improper trial proceedings. Here, it's telling the hypocrite that his ways are like that of a kangaroo court: shady and improper (i.e. stealing).\n\r\n\"Now you're weepin' shades of chosen indigo / Got lemon juice up in your eye / When you pissed all over my black kettle\" = The metaphor of the hypocrite urinating on the other's kettle is used to describe the hypocrite disregarding what the others say against him as unimportant garbage. Similar to peeling/squeezing a lemon and it squirting its stinging juice into his eye, his urine (i.e. his downtalking of what the others warned him of: the warnings they gave him of the consequences for becoming too prideful) has splashed back up off the kettle into his eye, stinging. He now realizes what he's been doing was wrong and breaks into tears, regretting his immoral deeds. This is metaphorically explained with the line, \"Now you're weepin' chosen shades of indigo\" in that he chose this path, yet is now crying in regret over it. He chose his own fate, his own tears, if you will.\n\r\n\"So full of it\" = Referring to when he was being prideful and holier-than-thou: his statements proved he was full of shit with his almost Godlike claims of being so great.\n\r\n\"Fuckin' hypocrite\" = Check and mate. This line fully proves my theory.\n\r\n\"Liar, lawyer\" = This further ties into the earlier line referencing the term \"kangaroo court\".\n\r\n\"Mirror, show me what's the difference?\" = Reference to Snow White and the queen's magic mirror. The queen would request the mirror to show her who the greatest one of all was. Here, the person is saying that all are equal: no one is better than any other.\n\r\n\"Weeping shades of indigo / Shed without a reason\" = The people still don't know how he became so wealthy and prideful; they know not of his wrongdoings or what he's crying over. He is crying over those wrongdoings, yet they do not know that. They cannot figure out the reason for his tears.\n\r\n\"Mirror, for you what's the difference?\" = A mirror has no sense of preference or bias; it simply shows what's put in front of it. It knows not what ego, stature, position, or power are; it shows anyone, no matter what part they play in society. This can be seen as the basic idea of all being equal. All are simply human.\n\r\n\"Kangaroo be stoned / He's guilty as the government\" = The hypocrite has been sentenced to death by stoning by the government, which is hypocritical in and of itself.The government is just as guilty as the \"kangaroo courts\" themselves for allowing them to happen, for not having a way of stopping them from happening.\n\r\n\"Eyeballs deep in bloody waters\" = His own blood has been shed from all the trouble he's built upon himself.\n\r\n\"Ganja police, you must've been out 'your mind\" = Ganja is a slang term for cannabis, the plant form of marijuana. Similar to the government not having a surefire way of preventing kangaroo courts, police trying to uphold the anti-marijuana laws really can't do anything to stop the drug from getting around and being used, no matter how hard they'd like to try. This could be a metaphor (again disguised as a drug reference) for the hypocrite.in that no matter how much the people tried to tell him he was no better than anyone else and that acting that way was wrong, there was no getting through to him. Sometimes there is just no way to stop certain problems though some wish they could.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nsess-that reenforces my point about lachrymology when you mentioned how he's \"weepin' shades of indigo\". lachrymology is literally the 'study of crying', but it basically means going through pain in order to become a higher being.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nand sess-dont be an asshole to people.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nhey sess- anyone who claims to understand a Tool song to the complete exclusion of everyone else's point of view doesn't get it...\n\r\nwho are YOU to wave your finger by the way?\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\ndamn straight egb.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nCool song, seems to stretch between anger and sarcasm which is always a good mix for maynard. \n\r\n\"Liar, lawyer, mirror for ya, what's the difference?\" \r\nGotta love it.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nRight on, Sess.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\ni hear after the solo \n\r\n\\\"we\\'ve been chained up here to grow.\r\ntrapped without a reason,\r\nwe\\'ve been chained up here to grow.\\\"\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nTREXOR go back to listening to your backstreet boys\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nare you fucking stupid TREXOR ? Creed ?? you fucking idiot, you know fuck all about music you fucking idiot\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nJust a thought...but is it possible that this song is about the New Orleans disaster and how everyone blamed everyone else for the lack of aid afterwards and they were all pots calling each other black. The song definately has a bluesey vibe and New Orleans is \"home\" of the blues.  Perhaps the term \"high\" in the song is in reference to elevation as I'm certain that all the hypocrites; New Orleans Mayor, Louisiana Governor, FEMA Director etc. were safe and dry on high ground while the true victims were eyeball deep. Just my 2 cents.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\n^^^ kinda doubt it... Tool doesn't really do topical song writing. i think it's just about hypocracy in a deeper sense...\n\r\nthere's all kinds of references in this song... and someone needs to get a more accurate version of the lyrics up here...\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nThere's a lot of sayings in this song, especially in the opening verse. \n\r\nFirst of all-\"the pot calling the kettle black\".\n\r\n\"Rob the cradle\": dating/marrying someone much younger than you.  No idea about the \"snow the grave\" part.\n\r\n\"Soapbox\": people used to talk in parks and stuff atop things called soapboxes. These people are allowed to say whatever they want and they just talk and talk all day about something.\n\r\n\"House of cards\": when you try and make a house out of cards, it falls down a lot. The house can crumble at any moment.\n\r\n\"Don't go tossing your stones around\": the saying really goes 'people who live in glass houses don't throw stones'. It's a 'don,t push your luck' kind of thing.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nDisspostion-he doesn't say \"We've been chained up here to grow\". He says \"Weep in shades of indigo\".\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\n^^^ and he doesn't say anything about robbing the cradle... the lyric is ... 'rob the grave to snow the gradle...'\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nWhat's up with TREXOR?? How did tool suck to start with?? Their first full album was stunning and they have been ever since, despite the fact that they could've probably churned out some complete crap and sold it! I LOVE the fact that you have to wait for them - they're more than worth it! If I had to bin all my cd's except a few, I'd just keep the Tool ones - there's nothing like them - they stand up to CONSTANT listening because the tracks are so complex.\n\r\nThis song is about hypocrisy, simple as that - he's used marijuana as a stage to play off I think, but is talking about hypocrisy in general. All the not throwing stones, etc. is obviously a metaphor for hypocrisy (people in glass houses shouldn't throw stones). The mirror line is just indicating that there is NO difference between liar and lawyer.\n\r\nSICK song!!\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nlyrics i think should be different from the above.\n\r\nthird line \"eye hole deep in muddy waters\" rather than 'i hold'.\r\nthird part starts \"steal,borrow reefer, save your shady inference.\" not sure about the 'save your'. might be saviour.\r\nthen \"kangaroo done hung a jury with the innocent\".\r\nand \"now you weep all shades of chosen indigo.\"\r\nfourth block he sings \"kangaroo done hung the guilty with the innocent\"\r\nand \"now you weep all shades of chosen indigo.\" again.\r\nadd a \"so\" before \"who are you to wave your finger\".\n\r\nafter: \"you must have been out of your mind\" and the short *solo* he sings something that isnt in the lyrics at all (about 04:15 into the song.) \r\nthe first part is \"weep all shades of indigo\", the next part is vague, something like \"trapped without? a reason\" then \"weep all shades of indigo\" again.\n\r\nlast part of the lyrics, second line MJK sings \"kangaroo be stoned, he's/is guilty as the government.\r\nand then \"now, you'll weep all shades of chosen indigo\".\n\r\nnow im not sure about all this at all, like the \"steal borrow reefer savior\", especially not \"->chosen\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nHere are my changes to the lyrics.  Not sure if they are correct but we are getting closer.\n\r\nWho are you to wave your finger? \r\nYou musta been out your head! \r\nEye hole deep in muddy waters \r\nYou practically raised the dead\n\r\nRob the grave to snow the cradle \r\nAnd burn the evidence down \r\nSoapbox house of cards and glass \r\nso go tossin' your stones all 'round\n\r\nYou must have beenâ\u0080¦ high \r\nYou must have beenâ\u0080¦ high \r\nYou must have beenâ\u0080¦ \n\r\nFoot in mouth and head up ass \r\nSo whatâ\u0080\u0099chu talkinâ\u0080\u0099bout? \r\nDifficult to dance â\u0080\u0098round this one â\u0080\u0098Til pull it outâ\u0080¦ boy \r\nYou must have beenâ\u0080¦ so high \r\nYou must have beenâ\u0080¦ so high \n\r\nSteal/Borrow reefer save your\r\nShady inference \r\nKangaroo done hung the juror \r\nwith the innocent \r\nNow you weep all shades chosen indigo. \r\nGotta lemon juice up in your eye. \r\nWhen you've pissed all over my black kettle \r\nYou must have beenâ\u0080¦ high, high \r\nYou must have beenâ\u0080¦ high, high \n\r\nWho are you to wave your finger? \r\nSo full of it. \r\nEyeballs deep in muddy waters \r\nFuckinâ\u0080\u0099 hypocrite. \r\nLiar, lawyer, mirror show me whatâ\u0080\u0099s the difference. \r\nKangaroo done hung the guilty with the innocent.\n\r\nNow, you weep all shades of chosen indigo. \r\ngotta lemon juice up in your â\u0080¦ high, eye \r\nWhen you've pissed all over my black kettle \r\nYou must have beenâ\u0080¦ \n\r\nWho are you to wave your finger? \r\nWho are you to wave your fatty fingers at me? \r\nYou must have been out â\u0080\u0098cho mindâ\u0080¦ \n\r\nLiar, lawyer, mirror for you. Whatâ\u0080\u0099s the difference? \r\nKangaroo be stoned he's guilty as the government. \r\nNow, you weep all shades of chosen indigo\r\ngot lemon juice up in your high, eye\n\r\nWhen you've pissed all over my black kettle \r\nYou must have beenâ\u0080¦ high, high, high, high \r\nEyeballs deep in muddy waters\n\r\nEyeballs deep in muddy waters \r\nLatch up the LIES! \r\nyou must have been out 'cho mind!\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI just heard this shit last night and I've gotta say, it may not be that close to the old stuff, but it still kicks some fuckin ass!\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nEfferri those look pretty good to me but you forgot a couple of lines, at about 4:12, when he says:\n\r\nWeepin' shades of indigo\r\nShed without a reason\r\nWeepin' shades of indigo\n\r\nOh and I definitely think he says gonja police in the last couple of lines.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nAlso when I listen to this album and I get to this song I get the impression that Maynard is speaking to hypocrits in his mother's church. It seems like in the Wings for Marie songs his mother has just died and he's reflecting on how true she was and how she was the epitome of a religious follower. Then, maybe at the funeral, back home, he sees some of the people who attended and who claim to be just as devout as she was. I could see him seeing these people from his past and having them reinforce his beliefs about the structure of modern Christianity. Kind of like a, who the hell are you to talk about my mother, kind of response. How this song jumps into Lipan conjuring and a certain very descriptive acid trip I haven't quite figured out yet, haha.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\ni agree with both mauldinite and efferris changes/additions. \n\r\nit seems as MJK is actually singing \"weeping shades of (chosen) indigo) everytime, not \"weep all\".\r\ni.e (in efferris lyrics)\r\npart 5 line 5\r\npart 7 line 1\r\npart 9 line 3 \n\r\nadd the part missing at 04:15, and a \"so\" before part 8.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nSomething interesting:\r\nmy friend told me that when he was burning this CD for some he noticed that the size of the CD is 666 MB.\n\r\n666..... interesting.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\n666 mb?\r\nThat completely depends on the birate and format you burning it at. For 666mb that must have fucking ace quality. Most of the albums I've burnt are little over 100mb.\n\r\nEither way, awesome song, I can't really add to anything previously said.\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nFromGreen: I think he meant audio format cd, not mp3s to a data cd.  And Jamin, an audio cd is often 666 megs, they only hold 700.  I'm pretty sure it's not intentional.  Not to flame, but a 5th grader could come up with a better easter egg.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI am pretty sure after blasting the album 3 times in a row in one night, the line is 'wrapped up in lies', not ganja for life or latch up the lies.\n\r\nThe 'snow the cradle' part still has me stumped though.\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nYo, not sure if this has been said already but I swear Maynard opens the song with \"who are you to wave your finger, you must of been out of your hair..\" makes no sense i no, but sounds like he drops the D..\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\n* \"you must of been out your hair\"\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nThis song is obviously a tribute to Gary Coleman and Diff'rent Strokes.  Why else would he have \"whatchu talkin' bout\" in there?\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nHaha, that's great pieoncar! Didn't even think about that.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nhe screams \"Ganja Please!!!!\"\n\r\nno questions asked.. fckin deaf assoles\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nNo...he says \"ganja police\".\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nAnyone notice that before he actually starts singing, you can hear an echo in the background?\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nYeah I forgot to change a few things... Here is the second rough draft...\n\r\n+++++++++++++++++++++++++\n\r\nWho are you to wave your finger? \r\nYou musta been out your head! \r\nEye hole deep in muddy waters \r\nYou practically raised the dead\n\r\nRob the grave to snow the cradle \r\nAnd burn the evidence down \r\nSoapbox house of cards and glass \r\nso go tossin' your stones all 'round\n\r\nYou must have beenâ\u0080¦ high \r\nYou must have beenâ\u0080¦ high \r\nYou must have beenâ\u0080¦ \n\r\nFoot in mouth and head up ass \r\nSo whatâ\u0080\u0099chu talkinâ\u0080\u0099 bout? \r\nDifficult to dance â\u0080\u0098round this one â\u0080\u0098Til pull it outâ\u0080¦ boy \r\nYou must have beenâ\u0080¦ so high \r\nYou must have beenâ\u0080¦ so high \n\r\nSteal/Borrow reefer save your\r\nShady inference \r\nKangaroo done hung the juror \r\nwith the innocent \r\nNow you're weeping shades chosen indigo. \r\nGotta lemon juice up in your eye. \r\nWhen you piss all over my black kettle \r\nYou must have beenâ\u0080¦ high, high \r\nYou must have beenâ\u0080¦ high, high \n\r\nWho are you to wave your finger? \r\nSo full of it. \r\nEyeballs deep in muddy waters \r\nFuckinâ\u0080\u0099 hypocrite. \r\nLiar, lawyer, mirror show me whatâ\u0080\u0099s the difference. \r\nKangaroo done hung the guilty with the innocent.\n\r\nNow, you're weeping shades of chosen indigo. \r\ngot lemon juice up in your â\u0080¦ high, eye \r\nWhen you piss all over my black kettle \r\nYou must have beenâ\u0080¦ \n\r\nSo Who are you to wave your finger? \r\nWho are you to wave your fatty fingers at me? \r\nYou must have been out your mindâ\u0080¦\n\r\nWeeping shades of indigo,\r\nShed without a reason.\r\nWeeping shades of indigo...\n\r\nLiar, lawyer, mirror for you. Whatâ\u0080\u0099s the difference? \r\nKangaroo be stoned he's guilty as the government. \r\nNow, you're weeping shades of chosen indigo\r\ngot lemon juice up in your high, eye\n\r\nWhen you pissed all over my black kettle \r\nYou must have beenâ\u0080¦ high, high, high, high \r\nEyeballs deep in muddy waters\n\r\nEyeballs deep in muddy waters \r\nGanja Police!!!!\r\nYou must have been out your mind!\n\r\nThere we go... That's much better...\r\nI really think Mauldinite is on to something.  It makes a lot more sense when you picture him singing the song to the people of his mother's congregation. For Example\n\r\nRob the grave to snow the cradle (cradle could mean Jesus)\r\nSoapbox house of cards and glass (refferring to the church itself)\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nI think it actualy says:\n\r\n\"Who are you to wave your finger?\r\nIt musta been out your hair!\"\n\r\nI don't hear a \"d\" at the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\nnear the end, he does not yell \"eyeballs deep in muddy waters twice, the lines are quite different\n\r\nthe first is - \"Eyeballs deep in bluddy water\"\n\r\nthe second is \"Your balls deep in muddy waters\"\n\r\nand yeah i do hear the echo at the start before he sings.\n\r\nONE MORE THING! he does not say gonja police!! fuck2!! there is an obvious Z sound!  as in PLEASE. which has a Z sound. police has a C sound, why he does not make.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI have lots of friends whos parents smoke pot and tell them not to smoke pot so that could be the main part of the song but tools songs always have some deeper meanings so the song could be about how tired maynard is of hypocrites who talk bad about tool and still listen to it \r\n(like trexor).\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\noh ya. i think this song is about how trexor is wrong about the fake albums.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nIt is also a sound a lot closer to 'lies' than 'please' OR 'police.' Maybe I am wrong, but I bet there are very few people that pronounce either of those with a clear 'i' sound while singing/yelling.\n\r\nAnyway, decided to look up indigo, trying to find the reason for the reference (last time I checked tears were clear, not blue).\n\r\nIndigo is a dye that is still used, but has almost entirely been replaced by synthetics to create the same color. So the 'chosen indigo' line could be calling the tears fake, saying the person is crying that they are so hurt by the accusations of hypocrisy, when they are really 'eyeball deep in muddy waters' (what makes water brown besides mud? ie, so full of shit).\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nyeah i see what u mean but i dont think he is saying lies, i also hear a P, which would not be evident in \"Latch up the Lies\"''\n\r\nim stickin with \"please\"\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nThis song has very little to do with pot.  In fact, I think past the line \"you must have been high\" it may have nothing to do with pot. There is a reference to tossing stones-not getting stoned, that could be significant.   I think the song draws a parallel between the way stoners act and the way self-righteous hypocrites act, (but the stoner has an excuse..) The Pot is in reference to \"the pot calling the kettle black\".  Ganja for lies?  Ganjaful lives?  I'm sticking to my ganja-light theory...\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nCall me a dumb ozzie, 'Kangaroo dung' would make more sense here. It's a long shot... but it's not good for anything... the animal is useless, it's excrement isn't even a viable fertiliser. It could be, I repeat COULD be a fancy way to say shit!\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nMy BLACK kettle? Hypocrites, i.e. the christian type... do they have a WHITE kettle? And they definately have 'muddy' fingers, not 'fatty' ones...\n\r\nThose who live in glass houses should not throw stones.\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nThis song has a double meaning.  He is referring to the kettle calling the pot black.  As well as marijauna.  I think it works great both ways.  Throwback MJK.\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nNah man...the pot is calling the kettle black.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nI think I have a pretty good case that he says \"Ganja police\" instead of \"Ganja please\".  The 'ganja police' would fit with the hipocrite thing. It would mean that the people who try and stop people from getting high are just as guilty because the ganja police are hipocrites themselves. It would also fit with him saying \"he's guilty as the government\" because police officers are government workers.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nanyone considered that the lyric might be\n\r\n'Ganja for lies... you must have been out your mind'\n\r\nit doesn't sound at all like police or please....\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\negb-dude-didn't I just point that out?  Anyhoo-I dont hear MJK saying police...or kangaroo \"dung\"-but maybe I'm going deaf...\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nsorry thirdeyewide... i must have been high (snicker)...\n\r\nget this guys... new symbolism found... and you heard it here first...\n\r\nthe color indigo ('weep in shades of chosen indigo') is the part of the visible spectrum that falls between 440 and 420 nanometers in wavelength... another pot reference? ...\n\r\n'The human eye is relatively insensitive to indigo's frequencies, and some otherwise well-sighted people cannot distinguish indigo from blue and violet' ... ? ? ? signifigant? beats me... but it's an interesting conincidence otherwise...\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nThat's a crazy coincidence about the 420 thing. Maybe the part about not telling blue from violet has something to do with the song. When he says \"you've got lemon juice in your eye\" I think that means that the hipocrite can't see things the 'right' way. He's skewed from his own selfishness.  Maybe not being able to distinguish blue from violet is the same thing?\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nSo between my idea and that one, I think we have those lines nailed down as being a little drama queen, acting all hurt but so easily seen as a fake.\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nAll of you must be out cho mind, this song sucks.  it is obviously about pot, and the stupid legalize it, don't legalize it debate.  Tool has gotten lame\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nAtreiu I think you are looking at this song a little bit too lightly.  There is much more to it than just the legalizing marijuana debate.  maybe take another listen before you start condemning tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nI think this song shows Maynard's confusion with his beliefs.  His mother dieing I believe has brought forth feelings that he hopes god does exist for his mom.  So does he question his view on god? I think so! The song, \"The Pot\" is not about weed, it's about the pot calling the kettle black.  \"Piss all over my black kettle\"\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nClarkq is an idiot!  it is a double meaning you dill-hole.  a reference to the legalize it debate on two levels.  and it still smokes a big fleshy one.  and as for bearcules, (bear + hercules...  very clever numbnuts, did your four year old brother think that up for you?)  I have listened the song well enough to know it sucks.  I don't need another listen to know Tool is losing their edge.  it should be obvious to everyone who does not have their heads garbled with this \"maynard is god\" bullshit.  Fucking losers.\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nArteiu-would you rather listen to Green Day or some stupid shit like that? Tool is one of the best out there. Too bad you can't see that.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nWell he was never really a TOOL fan! No matter what he says.  Therefore what you say doesn't mean a damn thing!  He just some pot head who wants to believe that it's about pot.  The last line in the song, \"Ganja, Please, you must have been out your mind\"\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nAtreiu- if you think Tool has gotten into writing topical material... about pot legalization, no less... well, i just hope that aneurysm you're suffering from doesn't leave you facially disfigured...\n\r\nhe's using references to pot (cannabis) to talk about hipocracy, nothing new... think Stinkfist... or did you really think the song was about how to fistfuck someone?\n\r\nwhat a dipshit...\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nTREXOR he has been right about everything he has said besides the album being a hoax everything else is sooo true he is the only one that can truly criticze this band let him critiszce jesus christ\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\n\"Rob the grave to snow the cradle\"\r\ni thought it was \"Rob the grave to sow the cradle\"\r\nthat would make more sense to me.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nI personally think part of this song is the general statement of what everyone is talking about hypocrisy. but everytime i listen to it i keep thinking Maynard is referring to the Book of Job in the bible.. when God descends down to Job and pretty much states what Maynard says in the beginning of the song \r\n\"Who are you to wave your finger?\r\nYou musta been out your head!\r\nEye hole deep in muddy waters\r\nYou practically raised the dead\"\n\r\nfor any of you who are not familiar with that; hope someday you will.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nyeah it probably is snow.......duh\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nAtreiu- you are acting like a child.  Who cares where I got my name from.  at least I am not named after the never ending story...  Atreiu = Atreyu...  now who is four years old.  if you cannot see that Tool is still one of the best bands on the planet then you do not have to listen to them.  And you must know that the fans of Tool are a pretty defensive lot when it comes to their favorite band, attacking them on a forum such as this is just begging to get flamed.  If I thought you were a little more clever, I might think you were antagonizing on purpose...  but that would imply an intelligence of which you have displayed absolutely no sign.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nwwwwwwwwwwwwwhy do we all need so much to prove how smart we all are to every fuck-wit who decides to write some trash on songmeanings?? everyone should just take a step back and stop writing these cleverly composed, snappy come-backs. it makes these wankers so happy to get you all worked up by saying \"shis song is shit\" or \"TOOL suck arse\" blah blah......jeeeeeeeeeeeeeeesus!\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nAll of you can lick my nuts.  especially you caramelprisoner, you hippy fuck.  people like you and your \"why can't we all just get along\" attitude make me sick.  at least the flamers show some balls, no matter how retarded they sound.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nIsn't there a term for this?  I think that the longer a thread exists, the more likely it is to attract \"trolls\".  Trolls are boring little creatures who have nothing better to do than to seek out discussions where most of the feedback is positive and jump in with a nasty comment like \"I vicariously pissed all over this album through my dog\".  Then they giggle like schoolgirls while everybody lashes back-effectivly dominating the discussion...They go away after being ignored.  Trexor did, didn't he?  My guess is that Atreiu doesn't even own a copy of the album we're discussing.  So lets all ignore the trolls and get back to the actual song...\n\r\n...I see we've lost the line \"Ganja Police\", this seems to make a little more sense...\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nhaha, \"ignore him and he will go away\"  very high brow of you.  you guys just cannot stand that someone might not think tool are gods.  wake up, it is just a band, they are very capable of making a sub-par album, and this is proof of that.  And I do own it, eagerly bought it the day it came out, the 3D book is cool, especially the fetus in the skull, I wish they had not had the band pictured though, that was one of my favorite non-musical things about the band, their shyness from fame.  but like the rest of the album, they disappointed.  and if you do not realize it is not up to snuff then fine, I am not going to try and make you see things my way (I will, however belittle your existance at my leisure).  and I will be damned if I let you keep me from voicing how I feel.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nok Atreiu thinks it's sub-par.... so...\n\r\nsomeday, friend, you'll realize that your opinions are not altruistic... their not even tangible to the millions and millions of satisfied Tool fans who have loved this album from the first listen. \n\r\nso great, you don't like it, i do... and?\n\r\nperhaps you could have written a better album... one of the most anticipated albums in the history of modern music... and still not dissapoint anyone... maybe not huh?\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nI did not say you cannot like it, or have your own opinion...  I just said you were an idiot.  You can take that as you will.  And stop being such a fucking pussy about it.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nI agree with Arteiu on some level...I don't think this album is as good as Lateralus or AEnima, but I do really like 10000 Days. If he wants to criticize it just let him...he's allowed to voice his opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\n\"the pot called the kettle black\"  I feel that this cliche is at the heart of this songs meaning.  I think this is an encapsulation of Maynard's political views.  Though he is an avid detractor of Bush and republicans I can't think that this song is purely anti-Republican.  Democrats are just as responsible for the things he seems to be railling against in this particular song.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nI heard this was about R. Kelly\\\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nok, dont often come onto these sites because they tend to be a haven for pretentiousness. however, i have read some interesting posts, particularly concerning some of the lateralus tracks. one thing: i dont fucking care whether or not a song or album is 'good'. why do people argue about songs being good or bad? and why do people say, 'its just my opinion'. whether or not a song is good or bad cant be anything other than your opinion. if you dont like a song, dont waste your time telling people on a site called songMEANINGS. Same goes if you do like it. i like reading peoples thoughts on the meaning behind tool's lyrics, not because tool are 'gods', or becuase i marvel at how 'deep' maynard is in comparison to a walking billboard like nelly, but because understanding what your listening to lyrically enhances the general musical experience. of course your allowed to not like the album, ffs. but why waste my time? I dont wanna fish thru your pointless posts to find a genuinely intelligent concept. if all your into is debating how good or bad things are, sport's your thing, not music.\n\r\nsee what i mean. one post and i ooze pretentiousness\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\ndont read the post above, its a waste of your time\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nheheheh oh he called me a hippy... hehe\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\ngoenglish.com/…\n\r\nits all about hypocrisy.\n\r\nand MJK does sing \"you must have been out of your hair\" second line. \n\r\neven if he called me himself in 10 mins and denied it id still claim he does.\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nFUCK ME!!!!!!!!! Maynards voice on this track FUCKING AMAZING!!!!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nand as for people claiming 10000 days isnt as good as the rest of their albums, get real, everything they touch turns to gold and every album is as awesome as the rest\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nI don't know why, but the more I listen to it, the more it sounds like a \"Fuck You\" to Rush Limbaugh. He was openly anti-drug, then got busted in his little oxycotin addiction scandal. \"Who are you to wave your fatty fingers at me?\"\n\r\nOf course, it could be referring to someone else, or nobody in particular. But every time I hear it and imagine Maynard screaming it in Limbaugh's face, it bring a little smile to mine :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\nHe certainly sings:\n\r\n\"Who are you to wave your finger?\r\nIt must have been out your hair!\"\n\r\nIt kind of makes sense lol.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nOK, first thing, caramel, you are a hippie douche\r\nqdacres, you are obviously not a ver discerning individual if you make a blanket statement like that.  You are probably one of those guys that shows up to the concerts in a \"maynard is god\" shirt.  disciples like you make me cringe.  \r\nMaverick...  he says head.  listen again, there is a hard consonant at the end.  out your hair does not even begin to make sense, and I have serious doubts about your ability to hear and reason.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nGod shut the fuck up atreiu.  get off your fucking pedestal, if someone loves tool, and thinks all their albums are equally good then what the fuck harm is there in that to you.  And about MaverickX...  it is head not hair...  as much as I hate to agree with you.\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nAlright this is how it is, bitches. This song is about calling the kettle black when referring to the government. One of the really obscure lines \"Difficult to dance round' this one, till you pull it out- boy\" is about May day. May day is the spring festival that celebrates human fertility. One of the activities is dancing around a maypole which is a tree collected from the woods and brought to the village to celebrate the summer. While out on the trip of finding the right maypole people practiced temporary permiscuity while off in the woods. Because of this, Puritans found it objectionable. By the mid 1600s May Day was banned by the English Parliament.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nThat's why I think this song has an underlying meaning criticizing the government because all governments try to control ways in which we have party and go about doing things. \n\r\nAlso, it has to be liar, loyal instead of liar, lawyer because it's another two faced idea brought about by the government.\n\r\nDoes anyone know what he means by chosen indigo?\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nIt's about the government saying how bad pot is and making it so illegal, yet the government does much worse things, but they wave their fingers at the potheads, instead of themselves and say what they're doing isn't bad.  Messed up agendas\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nOkay nevermind, I read the page about the black kettle.  It all makes sense now :) :)\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nWe jail people for drug offenses and imprison them with murderers and rapists and people who deserve to be behind bars. What can be so wrong about some drugs if so many people do them. Don't you remember alcohol prohibition. Freedom of choice! We need to put an end to the \"War on drugs\" it has been a topic of maynards for years. Not just drugs but freedom. Anti legislative. Pro freedom. But this song is a direct attack on law enforcement. How can someone enforce man made laws when all men are flawed. All shades of chosen indigo = police uniforms. The reference to Kangaroo courts, They are guilty of the crime, but the crime should not be. The Innocent are the people in jail for drug offenses. I can go on, I can also go back and take my ideas and put them in complete sentences with proper punctiuation. but i woN't.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nI was doing some reseach on the internet today trying to tie some of the meanings together.  I came across an article today that ties together \"kangaroo court\" \"Marijuana\" and \"hanging the jury\".  Here is a link to the article.loompanics.com/cgi-local/SoftCart.exe/Articles/…  It is a very good read explains the whole \"Kangaroo done hung the jury with the innocent\" line.\n\r\nSomething else I was thinking about was the name of the song and one of the lines in the song.  \"the pot\" \"When you pissed all over my kettle\"  The name of the song doesn't necessarily mean marijuana.  Because the basic idea of the song is hypocrites, wouldn't it make sense that the \"the pot\" is the government or who ever he is referring to in this song?  \"the pot calling the kettle black\"\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\ni think the hypocracy he's talking about in this song is the US government smuggling drugs into it's own country and feeding them to it's citizens,\r\n\"rob the grave to snow the cradle...\"  take your pick - heroin/coke  Heroin from Afghanistan, coke from SA\n\r\n\"Kangaroo be stoned he's guilty as the government...\"\r\nso who is the hypocrite then?\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\npaulfynch- that may well be worthy of the most absurd interpretation of this song yet...\n\r\nand for your information... heroin in america doesn't come from afghanistan. number 1 supplier of heroin to the u.s. is mexico, number 2 supplier is Columbia, number 3 is Thailand and the golden triangle region.\n\r\nopium from afghanistan is generally sent to turkey where it is processed into heroin and sent into europe. \n\r\ndon't believe me? check the DEA's website...\n\r\nan interesting sidenote is that since the u.s. invasion of afghanistan many afghan farmers have forsaken growing cannabis for hashish production for the easier to grow, less noticable,  and more lucritive growing of poppies, destined to end up as heroin on the streets of europe... thanks america!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nAbsurd?  How's this for absurd: Osama bin Laden bombs America, and President Shrub (Bush) decides to attack Saddam Hussein in Iraq...How's that for absurd?  Pot Calling the Kettle black perhaps?  (after all, america gave him all the weapons he needed to kill the Kurds...\"oh, we know you kids have WMDS-after all WE HAVE THE RECIEPT!!\")\n\r\nDude, you actually believe the DEA??.  I also remember the Afghanis deciding to sell their DAUGHTERS insted of their opium...Do we have America to thank for this???\n\r\nOky, I'll say it again, even though I've said it before--this song is NOT ABOUT POT!!!  IT'S ABOUT HYPOCRACY...(fwiw-i'm not riding you egb--you're making remarkably provocative statements, that's why I respond to you and not Atreiu...he's just a troll...) The absurdity  lies within the the pot  calling the kettle black--Saddam is an evil dude-but who funded him-(US of F-_ A!!)and wtf does he have to do with Afgahnistan??  (nothing-but we can't find a 6'4\" tall muslim man on dialysis either....)\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nIf you don't understand why the US government (not President Bush by himself) decided to bomb Iraq you don't understand politics.  And to the best of my knowledge bin Laden never bombed the US, nor US soil anywhere else in the world.  Anywho, this song is about general hypocrisy, mostly directed at the US government or any other goverment, with pot being sort of an example, not what the song is about.  Which, to agree with some of the people on this forum, is beneath Keenan as a lyracist.\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nah thirdeyeopen- i wouldn't be a provocateur if i didn't have a reactionary... nice bill hicks reference... off the arizona bay routine right?\n\r\ndo i believe the DEA... well i believe that they probobly keep good records about international drug trade...for example, if they were to post on their website that a lot cocaine is produced in columbia, would you immidiately assume they're lying... or is it just the kind of information that's just kinda common knowledge...\n\r\ni never said this song was about pot... as far as we can verify it's just about hypocracy in general. if there's a deeper, more specific meaning to the song than it's hidden in the more obscure lyrics... however, it definately uses references to 'pot' (reefer, marijauana, cannabis, grass, etc...) to refer to hypocracy... like stinkfist uses the metaphor of fisting to refer to desensitization...\n\r\nanyway, yeah, so Saddam was a bad guy that we funded... know who else we were funding during those turbulent times we call the 80's... well for starters we were funding the Iranians... you know, the folks who hate us to this day... the folks that were fighting the Iraqis at the time.... maybe we hoped they would all just kill each other off... with our weapons no less... oh and let's not forget our good buddy Osama, who with the help of the U.S. military and CIA helped bring the communist Soviet army to its knees in afghanistan... hmm wonder if they used any of that great special forces, unconventional warfare training  they got from the CIA or any of those nifty training campsfor any other purposes...\n\r\n no specific references to this stuff anyway...\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\ni think the guy ealier had the right idea about the muddy waters, talking about lachrymology. \"weep all shades of chosen indigo. \r\n\"The Indigo phenomenon has been recognized as one of the most exciting changes in human nature ever documented in society. The Indigo label describes the energy pattern of human behavior which exists in over 95% of the children born in the last 10 years â\u0080¦ This phenomena is happening globally and eventually the Indigos will replace all other colors. As small children, Indigoâ\u0080\u0099s are easy to recognize by their unusually large, clear eyes. Extremely bright, precocious children with an amazing memory and a strong desire to live instinctively, these children of the next millennium are sensitive, gifted souls with an evolved consciousness who have come here to help change the vibrations of our lives and create one land, one globe and one species. They are our bridge to the future.\"\nskepdic.com/…\n\r\nmaybe another reference to 46 & 2.......\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nwell i didn't read all the posts so i don't know if it was said yet...\r\nbut i took 'muddy waters' to be bullshit.  you know like when people say youre ankle deep in bullshit/swimming in bs etc.\r\nand i think people already said it but theres a saying 'the pot calling the kettle black'  which is basically calling someone a hypocrite.  its when someone criticizes someone else for the same faults they possess.\r\nthen theres the don't go throwing your stones part.  people in glass houses shouldn't throw stones blah blah.\n\r\nso it seems to talk about hypocrites a lot, but besides that i'll admit i have no clue what this song is about.  but i'm just now starting to learn about the whole kangaroo thing so maybe that will give me a new perspective.\n\r\nps: i love maynards vocals on this song, i know a looooot of people don't.  when he sings 'what chyou talkin bout?' i just swoon.  i love that mans voice.\n\r\noh, and ignore spelling mistakes etc\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\ni think this song was put on 10 000 days beacuse it relates the general theme of '10 000 days'. which i believe is maynards mother and her death. on the AMOTION APC dvd commentary to JUDITH maynard talks about the 'hypocrisy' that occured when his mother was Paralyzed. I think this track relates to those incidences where people were \"talking behind her back\" (as maynard states in the commentary).\n\r\nThe line \"you weep in shades of CHOSON indigo\" is also significant, as this is how maynard saw his mothers friends/relatives 'forcefully' weeping her tradgedy, then talking behind her back.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nLast weekend I came back from the Download Festival, where 55,000 of us watched Tool perform the best act of a weekend that included Metallica, Guns 'n' Roses, Korn, Alice in Chains and the Deftones.\n\r\nWho cares what the song means?  That's not what we're here for.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nWell, being a recovering drug addict, I delve deep into music. I like what MJK said in the track \"Drugs\" if people think there are only bad things that come from drugs, go home and throw all your music away because the best artists were very high when they wrote the songs.....Anyway, it's easy to say that MJK is comparing lawyers to druggies, not much difference. As far as the indigo goes, i haven't read up much on it, but from what i've read in here, couldn't this song be linked in a weird sort of way to 46 & 2, a new sort of link in the human chain. I don't know 46 & 2 is a very powerful song for me, I just hope this 10 , 000 days grows on me like Aenima did. I love it so far and MJK keep up the good work.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nOk, one more,  I was reading back a little and you know \"artreiu\" is a, well nevermind i have more tact than that. If you don't like Tool, don't listen to them. If you don't like this album don't listen to it. I am an avid Tool fan, but by no means do I think they're Gods. MJK is an artist that can get his voice heard, just think if you could voice your opinions on society and actually have people listen to it. Personally 10,000 Days hasn't made the hairs on neck stand up yet, but you know neither did Lateralus at first, \" I didn't just say that did I\", this ones different, but different is good, hey at least they are back together and gonna tour again. Now the best concert I can think of would be Tool and System of a Down, maybe throw old rage in the mix and we might have a Riot with the government......lol. Anyway guys sorry about the rambling but again if you don't like give away or throw it away doesn't matter to me, I don't go into a post about a Nelly song and bash him cuz I think rap sucks. Have a good one \"Artreiu\"\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\ndiamondduker, the man who said to throw away your music if you didn't think drugs had a positive influence was the comedian Bill Hicks. Very controversial material, but agreeable to anyone with an open mind who has ever thought the same.\n\r\nBack to the song and the other posts, this indigo reference is getting deeper and deeper as we go. We had two posts on the possibility of it being a kind of crocodile tears reference, and now we have a reference to a whole new emerging generation with dominantly indigo auras, supposedly destined to reunite the human race. Curse you MJK and your profoundly confusing lyrics!\n\r\nBut one of the articles does have a point. All these children being born with the indigo auras getting doped up on ritalin because their parents can't handle them.\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nThere are lots of references to indigo, which would be the 6th colour of the spectrum. So you don't have the full 'spectrum' of emotions. And the 6 would also refer to the 6th Amendment, which you can look up; it again ties in with the whole legal aspect of this song. Everyone know what a kangaroo court is? If not, look it up...\r\nI don't believe that the 'black kettle' refers to the Chief at all, but more to the actual saying-there goes the pot calling the kettle black, from which the song title comes from...\r\nAs always, remain open to interpretation\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nThe Indigo Children were a concept thought up around 15-20 years ago now, so that would make the first ones at least 25,\r\nIts also Blatent Penny pinching, and the concept has changed to target Parents with Hyperactive kids, who seek Alternative Diagnosises and treatments for ADD ADHD. But that, is irrelevent. Whats so special about Indigo Children, if they make up at least 95% of those born anyways?\r\nHeres a New Perspective on The Pot though, Perhaps the hypocracy is directed at Maynard? hence the echo (which isnt an echo, the quiet voice is *ahead* of the loud one, the voice we hear is the echo - singing to himself) and The reference to the Mirror throughout. Perhaps Maynard is introspective about his treatment of christians after his mothers death, he is a hypocrit in that way.\r\nWoo! Absurd Interpretation FTW!\n\r\nThere are two kinds of meanings, Maynards meanings, and individual Interpretations, Due to the nature of tool, and their ethos, we will never know the actual Meanings Maynard has for each word. So Lets just Enjoy fresh perspectives instead of campaigning for your individual interpretation to stomp on someone elses.\n\r\nOh No! I hope a Big-Balled mean scary truth telling troll doesnt come and tell me off for my cant Everybody get along post! I wish I was as brave and intelligent and had enough spare time to waste on trolling as they!\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nOh, just remembered more Indigo information: Indigo is a mix of Blue and purple, some argue whether it is a real colour at all. Maynard calls it a shade? Anyways, Blue traditionally means:\"healing, relaxation, peace, truth, wisdom, clarity of expression, serenity, meditation, harmony, calm, devotion, spiritual understanding, introspection (think of a clear blue sky or the ocean)\"\n\r\nWhile Purple:\"power, healing, magic, combatting disease and infections, spirituality, psychic healing, meditation, judgement, flamboyance, ceremony (think of royal purple)\"\n\r\nSO If we mix the Flamboyant Judgements and symbol of royalty from Purple, and Add the Truth, Wisdom and Introspection of Blue, we could ultimately end up with Emotions (weeping shades of chosen Indigo) That match the postion of Maynard himself, He preaches truth, wisdom, and introspection; as well as judging others. And Now he is weeping in his Hypocracy. The Church preach the same as him in a different light and colour (that they chose) as well as judge all who dont see things their way.\n\r\nI copied those colour meanings from some Kooky site, Im not a hippie. Feel free to take what you like from my theories and information to form your own, always good to see free and open thought in action.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nThis song is talking about the judicial systems. About how Kangaroo Courts (when the court decides or is told to decide what side will win before the case starts, and completely ignores the other argument) are corrupting the sense of innocence and guilt and the whole point of being a juror. He talks about how lawyers are told what to fight for, and to lie just to get money, and he asks \"whats the difference.\"\n\r\nAnd there is an old saying \"the pot shouldnt call the kettle black.\" Well with the lines \"when you pissed all over my black kettle,\" he obviously is reffering to that saying. Throughout the whole song he is saying who are you to judge, and there it is again. So he is probably talking about someone who is extremely critical of some sorts, but has the same thing wrong with them.\n\n\r\nBut thats just what I got out of those parts. Art is interpeted in many different ways.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\n\"I am not innocent.\r\nYou are not innocent.\r\nNoone is innocent.\"\n\r\nPretty much the meaning of this song in my opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nA week ago, I accidentally found my self reading all of your posts about this great song and must say that I had a smile at my face while I was scrolling down the pages. I'm not a philosopher and I sure needed some help from your thoughts to make my way on these conclusions, but the first thing that came on my mind by listening to this song was a very special hypocrite!!!\r\nSomeone here avowed that he saw Tool live at the Download 2006. He sure did but he must have been so high!!!  I have nothing against pot and I personally believe that everybody has to get high in this world we live in, but not everyday, not without a good reason and not with chemical shit that can kill your ass!!! Getting high goes way back in the days and I'm not going to analyze that. If you are interested read some ancient history. Also as someone else said, many of the greatest song composers were probably high when they wrote those hits!! At Download 2006, Maynard whispered a little something about G.W. Bush before he started singing â\u0080\u009cThe Potâ\u0080\u009d and thanks God I wasn't the only person to hear it!! \n\r\nI didn't post anything earlier because I wanted to see where this post will end up but since no one else wants to say something Iâ\u0080\u0099ve got a few things to mention. American friends on this forum please bear with me. As much as you will hate me for this, what Tool is trying to say with this song is pretty much the truth!! You have a very nice country, which your ancestors created with a lot of hard work but it's currently controlled by the wrong people!!  I come from Greece but I used to live in U.S.A. for some time a couple years ago and I now leave in England. As a musician my self I like to travel a lot and observe what is going' on around the globe. What Iâ\u0080\u0099m trying to say is that Iâ\u0080\u0099m not somebody who dislike you but just an outsider who actually saw your lifestyle and actually considering getting back there someday!\n\r\nTo be clear this is was not just a Bush song but he is obviously one of the reasons why it was written. Tool tried to share some thoughts about his image in the past arenâ\u0080\u0099t they?? But as many of you said, goes to all hypocrites who have the daring to support laws so as to send people to jail for stupid reasons (like smoking some pot) while they commit much worst crimes that they easily get away for.\r\n{Kangaroo done hung the guilty with the innocent}\r\n{Rob the grave to snow the cradle and burn the evidence down}\r\nNot only that they have the nerve to force the rest of the world to support those laws.\r\n{Who are you to wave your finger?}{Donâ\u0080\u0099t go tossing' your stones all 'round}\r\n{Ganja Polease(Please+Police). You must have been out your mind}\r\nAlso they have the nerve to wave their finger and blame criminals about actions they also have responsibility for. The hypocrites sometimes are so stupid to also admit their crimes to us but they somehow still get away. As someone else cleverly said, we keep the receipts. Thatâ\u0080\u0099s not a joke anymore; itâ\u0080\u0099s in frond of our eyes!!\r\n{You practically raised the dead}{When you pissed all over my black kettle}\r\n{Steal/Borrow reefer save your Shady inference}.\n\r\nMeanwhile the hypocrites send Indigo children to \"arrest\" some of these criminals they used to collaborate with and bring to their fake justice. What they are really doing is keeping the criminals busy (although those children are fighting between them and dying), while their interest {eyeballs} is at criminals source of income, {muddy waters} oil. \r\n{Weeping shades of indigo, Shed without a reason.}\n\r\nTo end with the songwriter hopes one day we will wake up and see that the hypocrite is hiding behind his finger and bring him down. \r\n{Soapbox house of cards and glass so don't go tossing' your stones all 'round}\n\r\nI've tried to relate the lyrics with my opinion as much as I could. But as someone already said the meaning(s) are very well spread all around the song. I hope you got the point. Furthermore, yes it has more than one meaning and yes it somehow \"supports\" pot. Also the word \"Polease\" can exist in a song is not an Essay people!!! (and actually has been around awhile, google it). \r\nI'm open to everybody's comments except from some brainless hypocrites, like Trexor e.t.c. who like to haunt, not only this one, but all Tool forums...You didn't like the album because your mind couldn't not even subconsciously get the meaning of it. My reply to you will be the thing you should have done...silence. You donâ\u0080\u0099t deserve anything more if you canâ\u0080\u0099t see what our world is coming to and youâ\u0080\u0099re not better than them hypocrites. Finally sorry that Iâ\u0080\u0099m not using any glittery words and excuse any sort of grammatical errors in this post. You see I always had my mind in more important things than learning to speak properly in different tongues. Since I can understand what you people are saying I can also make you understand me. I could again write in Greek but then you wouldnâ\u0080\u0099t understand much. Hehehe\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nHere my lyrics the way a hear them:\n\r\nWho are you to wave your finger? \r\nYou musta been out your head! \r\nEye hole deep in muddy waters \r\nYou practically raised the dead\n\r\nRob the grave to snow the cradle \r\nAnd burn the evidence down \r\nSoapbox house of cards and glass \r\nso don't go tossin' your stones all 'round\n\r\nYou must have beenâ\u0080¦ high \r\nYou must have beenâ\u0080¦ high \r\nYou must have beenâ\u0080¦ \n\r\nFoot in mouth and head up ass \r\nSo whatâ\u0080\u0099chu talkinâ\u0080\u0099 bout? \r\nDifficult to dance â\u0080\u0098round this one â\u0080\u0098Til you pull it outâ\u0080¦ boy \r\nYou must have beenâ\u0080¦ so high \r\nYou must have beenâ\u0080¦ so high \n\r\nSteal/Borrow reefer save your\r\nShady inference \r\nKangaroo done hung the juror \r\nwith the innocent \r\nNow you're weeping shades of chosen indigo. \r\nGotta lemon juice up in your eye. \r\nWhen you piss all over my black kettle \r\nYou must have beenâ\u0080¦ high, high \r\nYou must have beenâ\u0080¦ high, high \n\r\nWho are you to wave your finger? \r\nSo full of it. \r\nEyeballs deep in muddy waters \r\nFuckinâ\u0080\u0099 hypocrite. \r\nLiar, lawyer, mirror show me whatâ\u0080\u0099s the difference. \r\nKangaroo done hung the guilty with the innocent.\n\r\nNow, you're weeping shades of chosen indigo. \r\ngot lemon juice up in your â\u0080¦ high, eye \r\nWhen you piss all over my black kettle \r\nYou must have beenâ\u0080¦ \n\r\nSo Who are you to wave your finger? \r\nWho are you to wave your fatty fingers at me? \r\nYou must have been out your mindâ\u0080¦\n\r\nWeeping shades of indigo,\r\nShed without a reason.\r\nWeeping shades of indigo...\n\r\nLiar, lawyer, mirror for you. Whatâ\u0080\u0099s the difference? \r\nKangaroo be stoned he's guilty as the government. \r\nNow, you're weeping shades of chosen indigo\r\ngot lemon juice up in your eye, eye\n\r\nWhen you pissed all over my black kettle \r\nYou must have beenâ\u0080¦ high, high, high, high \r\nEyeballs deep in muddy waters\n\r\nEyeballs deep in muddy waters \r\nGanja Please/Police!!!!(Polease)\r\nYou must have been out your mind!\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nI think he does say \"ganja, please\" as in \"You think this song is about marijuana? PLEASE! Listen to it\"\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nAlright well first all i want to do is get it right that in the first lines..\r\nWho are you to wave your finger?\r\nYou musta been out your head! \r\n           That Maynard says \"HAIR\" not Head\r\n                  Just Listen to it!\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nSo, would someone tell me what the heck being out of your hair even means? Thus far, the only line that doesn't make sense in the song is the snow the cradle reference, but if you are right then it gets even weirder.\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nI don't think anyone can tell you because he doesn't say hair, he says head.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nMaybe he's talkin to Courtney Love....?\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nOne of the reasons I like Tool is because the music is unassuming. It is calculated yes, but as a whole, it is very subjective to the listener. I think thats what good art does. That doesnt mean that you can just write some shitty poem that doesnt have a meaning simply because some idiots will overanalyze it enough to give it meaning. But it does mean that song lyrics are designed with less literal structure than prose, to match the music, and allow for some listener thought and interaction. I think that is the point of good art. A lot of you have mentioned general hypocracy as the meaning of the song and I agree to an extent. But as a musician, sometimes simplicity just makes for better music, and this group of 40 year olds is not going to throw away a good song just because it is not \"deep enough\". So, it very well could be about some current issue like Katrina, or it could just be about weed (and so what if it is a simple weed debate song). I also think that the mind is an extremely powerful thing, so dont be so sure that you heard \"hair instead of head\". I for one have been convinced of a lyric, but when the actual words were published by the artist later, my mind convinced me of the contrary. The last thing that I wanted to say was regarding Tool's \"trickery\". I think that they obviously like to have fun with idiot interviewers and fans making claims of decoy albums, but I dont think that they want to decieve everyone just for the fun of it. They are in a very strange position as a heavy metal band. They are very popular across the world, but their image and music seems to be very natural and unique. In a recent interview, they said that they \"were the band that slipped through the cracks\". I think that pretty much sums it up. There is a good chance that right now, if Tool were to be a new band coming out in 2006, without showing themselves in videos or having the sound that they do, they would not make it at all. So lets just be thankful that they exist on as grand a scale as they do without selling out. If you dont like the music that is one thing. But dont say that 10000 days is a shitty album just to avoid being labeled a blind Tool follower. In my opinion, most Tool fans that I have met are intelligent human beings, so we should be proud of that.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nlady, limerence, lost, and introspection... a high tint yet pungeant.    ohh how ive dreampt of taps ....\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\ntee hee hee grey globs and silver slobs\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nHe's singing about politics, to people such as Bush and Cheney. Bush harbors circumterror, so he sings he was otherwise off with his Iraq attack. Rob the grave to snow the cradle, is partly about the Gov not forming us a higher system, and instead polluters who wanna be selfish with their ancestors (dead in the grave) inheiritance), and snow the cradle about baby many abortions and circumcisions in his of death nation. Eyehole he means how the eyelid is relative to the foreskin, in the mud had they murdered it and whatever. The Pot he's talking about the collection of money and how that looks, also marijuana with the high gesture.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nI'm pretty sure the second line of the song is \"hair\" not \"head\".\n\r\nThis song means to me that I smoke pot, don't judge me, I'm not hurting anyone doing it and I can live a fine life if I do smoke.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nI think this song is heavily political however I think people should be mindful not to assume that MJK is overly leftwing, this could lead to a lot of confusion.  MJK is no lefty in fact he has been quite derogatory of leftist politics and ideologies in the past. personally im a moderate with slightly left leanings, so anyway im not trying to say hes a conservative but dont classify MJK as a left wing activist. Like most intelligent people MJK probably supports the various policies of politicians rather than blindly supporting one side of politics.\n\r\nps I think this song has little to do with drugs, I think the reference to pot is more associated with money (green paper) and the saying \"the pot calling the kettle black\".\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nDo you really think that Maynerd is THAT simple of a songwriter where he would write songs all about POT?  Seriously....he's not talking about POT he's talking about the saying \"the Pot calling the Kettle black\" whoever he is referring to is who he is calling the Pot meaning pointing fingers at other people besides yourself, which could be directed towards President Bush, or maybe the Mayor Nagin and the Chocolate Factory, who instead of taking the blame for what he FAILD to do, pointed fingers at everyone else when Katrina struck (\"Eyeballs deep in Muddy water-Fucking hypocrite\"). He or Bush is very obvious about hanging the Guilty with the innocent.  If you know Tool at all, they write about the dark side of Religion/Politics/life that no one else wants to hear or talk about. it's what everyone wishes they were brave enough to stand up to but are too afraid to say.  That is what Tool is about-the dark side.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nthese are the real lyrics...\n\r\nWho are you to wave your finger?\r\nYa' must have been out your head.\r\nEye hole deep in muddy waters.\r\nYou practically raised the dead.\n\r\nRob the grave, to snow the cradle.\r\nThen burn the evidence down.\r\nSoapbox, house of cards, and glass,\r\nSo don't go tossin' your stones around.\n\r\nYou must have been high.\r\nYou must have been high.\r\nYou must have been.\n\r\nFoot in mouth, and head up asshole.\r\nWhatcha talkin' 'bout?\r\nDifficult to dance 'round this one\r\n'til you pull it out, boy!\n\r\nYou must have been, so high.\r\nYou must have been, so high.\n\r\nSteal, borrow, refer, save your shady inference.\r\nKing Guru done hung the juror with the innocent.\n\r\nNow you're weeping shades of chosen indigo\r\nGot lemon juice up in your...EYE!\n\r\nWhen you pissed all over my black kettle\r\nYou must have been HIGH, HIGH\r\nYou must have been HIGH, HIGH\n\r\nWho are you to wave your finger?\r\nSo full of it.\r\nEyeballs deep in muddy waters\r\nFuckin' hypocrite.\n\r\nLiar, lawyer, mirror, show me.\r\nWhat's the difference?\n\r\nKangaroo done hung the guilty with the innocent.\n\r\nNOW!!\r\nYou'll weep or, change the chosen into gold.\r\nGot lemon juice up in your high eye.\r\nWhen you pissed all over my black kettle\r\nYou musta been!\n\r\nSo who are you to wave your finger?\r\nWho are you to wave your mighty fingers at me?\r\nYou must, have been, out your, mind!\n\r\nReefer chased off indigo\r\nTrapped without a reason\r\nReefer chased off indigo\n\r\nLiar, lawyer,\r\nMirror for ya,\r\nWhat's the difference?\r\nKangaroo be stoned\r\nHe's guilty as the government\n\r\nNOW!!\r\nWill you weep or, change the chosen into gold\r\nGot lemon juice up in your, EYE!!\r\nEYE!!\n\r\nNow when you pissed all over my black kettle.\r\nYou musta been HIGH, HIGH, HIGH, HIGH.\r\nEyeballs deep in muddy waters\r\nYour're balls deep in muddy waters.\r\nGanja Police, you must, have been, out your MIND!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nI like \"You'll weep or, change the chosen into gold\" sounds better than weaker shades of Indigo which I could never wrap my head around what that meant....\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\n\"You'll weep or change the chosen into gold\" nice one , that is a really good interpretation. Remember though Tool dont release any official lyrics so dont say they are the \"real lyrics\". they are better though I must admit. \n\r\nMaynard was quoted as saying that the reason they dont release official lyrics is because he doesnt want to take anyones personal interpretations away from them, and ruin the song for them. \n\r\nI think this is really cool because a few songs have been ruined for me in the past after I saw the official lyrics and preferred my own interpretation alot more.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nps. what im getting at is that tool lyrics are hard to hear for a reason. its keeps the songs from going stale to quickly.\t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nKind of like when you listen to one of their songs and you hear something different than what you thought you heard before, even though you've listened to that same song 1,000 times!  love it!  Then a totally different meaning of what you thought, hits you like a ton of bricks.\t\t\t\t\n\t\t\t\t\n\n", "comment_176": "\nyeah, thats exactly why tool songs stay fresh for so long and I think that is one of the factors that make Tool one of the most interesting bands around. \n\r\nEspecially when the  lyrics have such abstact and complex meanings wrapped up in layers of linguistic code.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\n\"The Pot\" refers to a few things.\n\r\nFirst off, Pot is slang for Marijuana in North America. I dunno about elsewhere.\r\n\"The Pot\" is also a part of an old adage, saying, \"It's like the pot calling the kettle black\"; It's similar to the christian idea that before you judge someone else for their flaws, you must first become flawless (something which only god is).  Imagine if one Sumo-wrestler called the other fat.  Same deal.\r\nThe united states has been referred to as a \"Melting Pot\" of cultures.  Marijuana or hasheesh is a big part of some of those cultures (Mexico, for example), but, there is little heed of that in the US.\n\r\nAnd Maynard does criticise the Kangaroo (\"Kangaroo Court\" is slang for \"Mock Court\"), and the Government because they support drugs that are supposedly ok, but if someone wants to smoke marijuana (\"Ganja, Puh-leeze!\") in the states, that could end them up in jail for up to twenty years!!! Fucking bastards!\n\r\nAnd the US. Gov't has listed Marijuana as a Schedule 1 drug, ranking with Heroin and Speed, because it is \"Potentially Dangerous.\"  This, when Cigarettes/Tobacco, a government-sanctioned drug, causes terminal cancer in 66% of users, and has been classified as more addictive than heroin...\r\nAnd they call it the \"Land of the Free\" Phhhhshh.\n\r\nIncidentally, Marijuana has not been associated with cancer in the same way.  In fact, studies show surprising results.\r\n(Check it out: en.wikipedia.org/wiki/… )\n\r\nBastards.\r\nWho are they to wave their fingers?\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nsnowman- incidently... marijuana is much more restricted than speed or heroin. as heroin and speed (amphetamine, methamphetamine) are approved for medical use by the FDA while pot is not.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\ni think trexor is one of the members of tool\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nSome random thoughts...the pot a chamber pot. Reffering to a person using someone else's  black kettle \"caldron\" and desecration. \r\nStealing,hypocrisy,self-righteousness,arrogance,self-pity, and the like.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nIts obviously about hypocrisy- i think we can agree on that....\n\r\n\"Rob the grave to snow the cradle\"- to me its just a way of saying the ends justify the mean- ie the war(s), the handling of Katrina, the finger pointing he probably saw and/or was privy to at his mother's funeral, or within his mother's circle, whichever.  Good lyricists keep it broad and open to individual interpretation. Thats what keeps you coming back.\n\r\nand egb- no offense bro but look up your drug schedules- i'd much rather get caught with 1oz of pot than 1gram of heroin.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nHere's my take on the matter:\r\nThe song is a clear poke at those who make (shady) inferences to pot smokers being stupid (you must have been high), while upholding themselves as virtuous...though their deeds are often villainous (nonetospeakof mentioned Kangaroo Courts which I think is totally on the mark, but he cited the specific instance of Gitmo while I think he's referring to kangaroo courts in general. A Kangaroo Court is any court that gives the illusion of a fair trial while the verdict was decided beforehand....like people condemning \"Lazy stealing potheads\")\r\nI agree that there is much more to it than the marijuana issue, but using marijuana as an example of how judgemental people can be.\n\r\nWho are you to wave your finger, you must have been out your head\r\nI hold deep in muddy waters, you practically raised the dead (Think my sight is unclear while yours is the essence of virtue)\r\nRob the grave to snow the cradle (Cocaine (snow) in the nose (Cradle) being a reference to the vices held by the self proclaimed \"Righteous\") \r\nand burn the evidence down\r\n Soapbox house of cards and glass so don't go throwing your stones around (Hypocrisy)\r\n Foot in mouth and head up ass, oh what you talking bout?\r\nDifficult to dance round this one till you pull it out\r\nBoy..you must have been so high...(People assuming that pot smokers are prone to bad descisions)\r\nSteal or borrow reefer savior, shady inference (People attacking pot smokers with ideas of villainy)\r\nKangaroo done hung the juror with the innocent (Condemning people who make their own judgements (Jurors) for \"Not seeing the obvious\")\r\nNow you're weeping shades of chosen indigo\r\ngot lemon juice up in your eye. (Crying for the percieved wrongdoings of others while turning a blind eye on their own misdoings)\r\nWhen you pissed all over my black kettle, you must have been high (Dismissing out of hand any criticism by negating it with \"You're just high\"\r\nWho are you to wave your finger, so full of it\r\nEyeballs deep in muddy waters, fucking hypocrite (Your perspective is every bit as selective and skewed (muddy) as my own)\r\nLiar, Laywer mirror show me what's the difference (People assuming that their high social standing (Such as lawyers) makes them right, over those \"Stupid stoners\")\r\nChanged the rules and hung the guilty with the innocent (Again, the assumption that \"anyone who would do that is wrong, misguided, stupid, etc. at their own discretion)\r\nWho are you to wave your fat lil fingers at me? You must have been out your mind (I'm a big time accomplished Lawyer, above any judgement one such as you can cast)\r\nWeeping shades of indigo, shed without a reason (Crying over percieved wrongs commited by \"One such as you\", when no wrong has been done to anyone.)\r\nKangaroo: Be stoned? He's guilty, ask the govornment (People who assume that just because pot is illegal that it takes a criminal to do...the rampant thought that anything illegal must be bad or it would not be that way (Again the reference to kangaroo courts...a metaphor for how people make judgements regardless of any supporting evidence))\r\nEyeballs deep in bloody waters (The damage caused by the hypocrite in question)\n\r\nI'm sitting the sidelines on the Ganja police/please  line...sounds like police to me, but even that could be seen as a statment from either party, depending on whether it is a Ganja Police! or Ganja Police?\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\nI believe the lyric 'Steal or borrow reefer savior,'..is incorrect....'reefer' shoud be 'reaper'...think about it....\n\r\nThis makes much more sense. The song is about hypocracy and similarities between what is percieved as good and bad. 'liar lawyer -whats the difference'....\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nI take the Steal or borrow reefer savior to be akin to the \"Liquid Jesus\" shady inference of alcohol\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nThe song doesn't really have much to do with pot at all. It is more about someones actions or comments being so messed up that he feels like the only way someone would do or say whatever it is he's talking about, would have had to been on something. Like the saying \"what where you smoking\" Usually as has been in the past he is talking about someone judging him (Who are you to way your finger) for something they do themselves or just judging him in general. Tool isn't fond of finger pointers!\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nPot has nothing to do with the drug but the kettle - pot reference as already stated.  The part about being so high is talking about thinking so much of yourself.  Maynard is laughing at all of you who thought this had something to do with drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nI think the line \"Latch up the lies!\" Should be \"Ganja police\".\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nkatrina\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nThe song is about the pot calling the kettle black. I have gotten this infromation from an interview with Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nThe song is about the pot calling the kettle black. I have gotten this infromation from an interview with Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nThe Pot is your President, George W. Bush, people. The \"pot calling the kettle black\" is exactly what this is about. Not many people realize what's going on here. If you are not part of the 911 truth movement or an anti-New World Order activist, you may not understand....  It's time to wake up. Yes, Katrina is in this song; Iraq (cradle of civilization), the Twin Towers being deliberately demolished (burn the evidence down), Gitmo (kangaroo courts)....  it's all here...\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nYeah i agree with Chicken. \n\r\nI heard \"Ganja Police\" from the first time i've listened to the song, and it sounds more like  \"ganja police\" then \"latch up the lies\".\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nI think the line \"Steal, borrow, reefer, save your shady inference\"  should be \"steal, borrow, reaper, savior, shady infernce,\"  and I believe this line clarifies the main point of the song, that the difference between stealing and borrowing, the difference between the reaper and the savior, is nothing more than a \"shady inference\"-- a logical idea based upon assumpions, and obviously not very good assumptions at that, seeing as MH referrs to the assumptions as shady.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nAnd I think SUNMOTE should think of the broad scheme of things.  You're doing the song a great disservice by grouping it in the \"songs about GW category.\"  Pretty much nobody likes GW.  What the hell is there to say about it?  Everyone knows from the 5000 other songs about him.  Tool is far too artistic to pull out a cliche like that.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nHere are the corrected lyrics per toolarmy.com Exclusive:\n\r\nwho are you to wave your finger? you musta been outta your head.\r\neye hole deep in muddy waters. You practically raised the dead.\r\nrob the grave to snow the cradle then burn the evidence down.\r\nsoap box house of cards and glass so don't go tossin' your stones around.\n\r\nyou musta been high\n\r\nfoot in mouth and head up ass, so watcha talking bout?\r\ndifficult to dance round this one till you pull it out. boy\n\r\nyou musta been so high.\n\r\nsteal, borrow, refer, save your shady inference.\r\nkangaroo done hung the jury with the innocent.\n\r\nnow you're weeping shades of cozened indigo. (musta) got lemon juice\r\nup in your eye when you pissed all over my black kettle.\n\r\nyou musta been high.\n\r\nwho are you to wave your finger? so full of it.\r\neye balls deep in muddy waters. fuckin hypocrite.\r\nliar, lawyer, mirror show me. what's the difference?\r\nkangaroo done hung the guilty with the innocent.\n\r\nnow you're weeping shades of cozened indigo. (musta) got lemon juice\r\nup in your eye when you pissed all over my black kettle.\n\r\nyou musta been high.\n\r\nSo who are you to wave your finger?\r\nwho are you to wave your fatty fingers at me?\r\nyou must have been outta your mind.\r\nWeepin shades of indigo.\n\r\nliar, lawyer, mirror for ya. what's the difference?\r\nkangaroo be stoned. he's guilty as the government.\n\r\nnow you're weeping shades of cozened indigo. (musta) got lemon juice\r\nup in your eye when you pissed all over my black kettle.\n\r\nyou musta been high.\n\r\neye balls deep in muddy waters.\r\nyou're balls deep in muddy waters.\r\nGanja, please, you must have been outta your mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nWho are you to wave your finger?\r\nYa' must have been out your hair.\r\nEye hole deep in muddy waters.\r\nYou practically raised the dead.\n\r\nRob the grave, to snow the cradle.\r\nThen burn the evidence down.\r\nSoapbox, house of cards, and glass,\r\nSo don't go tossin' your stones around.\n\r\nYou must have been high.\r\nYou must have been high.\r\nYou must have been.\n\r\nFoot in mouth, and head up asshole.\r\nWhatcha talkin' 'bout?\r\nDifficult to dance 'round this one\r\n'til you pull it out, boy!\n\r\nYou must have been, so high.\r\nYou must have been, so high.\n\r\nSteal, borrow, refer, save your shady inference.\r\nKing Guru done hung the juror with the innocent.\n\r\nNow you're weeping shades of chosen indigo\r\nGot lemon juice up in your...EYE!\n\r\nWhen you pissed all over my black kettle\r\nYou must have been HIGH, HIGH\r\nYou must have been HIGH, HIGH\n\r\nWho are you to wave your finger?\r\nSo full of it.\r\nEyeballs deep in muddy waters\r\nFuckin' hypocrite.\n\r\nLiar, lawyer, mirror, show me.\r\nWhat's the difference?\n\r\nKing Guru done hung the guilty with the innocent.\n\r\nNOW!!\r\nYou'll weep or, change the chosen into gold.\r\nGot lemon juice up in your high eye.\r\nWhen you pissed all over my black kettle\r\nYou musta been!\n\r\nSo who are you to wave your finger?\r\nWho are you to wave your fatty finger at me?\r\nYou must, have been, out your, mind!\n\r\nReefer chased off indigo\r\nTrapped without a reason\r\nReefer chased off indigo\n\r\nLiar, lawyer,\r\nMirror for ya,\r\nWhat's the difference?\r\nKing Guru be stoned\r\nHe's guilty as the government\n\r\nNOW!!\r\nWill you weep or, change the chosen into gold\r\nGot lemon juice up in your, EYE!!\r\nEYE!!\n\r\nNow when you pissed all over my black kettle.\r\nYou musta been HIGH, HIGH, HIGH, HIGH.\r\nEyeballs deep in muddy waters\r\nYour're balls deep in muddy waters.\r\nGanja Police, you must, have been, out your MIND!!!!\n\n\n\n\r\nthere they are some1 else can submit them but i dont feel like it\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nWho are you to wave your finger?\r\nYa' must have been out your hair.\r\nEye hole deep in muddy waters.\r\nYou practically raised the dead.\n\r\nRob the grave, to snow the cradle.\r\nThen burn the evidence down.\r\nSoapbox, house of cards, and glass,\r\nSo don't go tossin' your stones around.\n\r\nYou must have been high.\r\nYou must have been high.\r\nYou must have been.\n\r\nFoot in mouth, and head up so\r\nWhatcha talkin' 'bout?\r\nDifficult to dance 'round this one\r\n'til you pull it out, boy!\n\r\nYou must have been, so high.\r\nYou must have been, so high.\n\r\nSteal, borrow, refer, save your shady inference.\r\nKing Guru done hung the juror with the innocent.\n\r\nNow you're weeping shades of chosen indigo\r\nGot lemon juice up in your...EYE!\n\r\nWhen you pissed all over my black kettle\r\nYou must have been HIGH, HIGH\r\nYou must have been HIGH, HIGH\n\r\nWho are you to wave your finger?\r\nSo full of it.\r\nEyeballs deep in muddy waters\r\nFuckin' hypocrite.\n\r\nLiar, lawyer, mirror, show me.\r\nWhat's the difference?\n\r\nKing Guru done hung the guilty with the innocent.\n\r\nNOW!!\r\nYou'll weep or, change the chosen into gold.\r\nGot lemon juice up in your high eye.\r\nWhen you pissed all over my black kettle\r\nYou musta been!\n\r\nSo who are you to wave your finger?\r\nWho are you to wave your fatty finger at me?\r\nYou must, have been, out your, mind!\n\r\nReefer chased off indigo\r\nTrapped without a reason\r\nReefer chased off indigo\n\r\nLiar, lawyer,\r\nMirror for ya,\r\nWhat's the difference?\r\nKing Guru be stoned\r\nHe's guilty as the government\n\r\nNOW!!\r\nWill you weep or, change the chosen into gold\r\nGot lemon juice up in your, high,\r\nEYE!!\n\r\nNow when you pissed all over my black kettle.\r\nYou musta been HIGH, HIGH, HIGH, HIGH.\r\nEyeballs deep in muddy waters\r\nYour're balls deep in muddy waters.\r\nGanja Police, you must, have been, out your MIND!!!!\n\n\r\nsry little adjustment\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nOMG OMG SO LIKE OK THIS ONE GUY WAS AT THIS THING AND FOURTEEN OF THEM IM NOT KIDDING WITHOUT ANY HANDS BUT ITS STILL NOT LIKE HIM ESPECIALLY ON THE CHRISTMAS BUT NO ONE CAN WITHOUT FIFTEEN SO IT DONT WORK ANYMORE.\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\nCome on people.  This is possibly the easiest TOOL song ever.  Those WHO live in a glass house should not throw stones.  Stop looking further then what has be written.\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nP.S.  FUCK all the people that start drama get out a live forget the pretenders and stop pretending yourself.  Pull your head out of your ass and act up instead of acting out.\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nOnce, when I was stoned, I stated like this: I'm sure there's a huge meaning in this text but we should all remember that songs have lyrics because it would sound stupid to just sing a vocal in different tones. \r\nAs I now have thought a bit more about that statement, I'm like, guitar riffs etc. have the exact same meaning as the lyrics. The harmony between chords describe the state of mind the person was in when he wrote the song. \r\nBUT to write a song about a certain subject, in this case smoking weed, always effect people. It's not meant to be deep, to have any subliminal messages or any shit like that. It's a song text for fucks sake. Not the bible. Not some story Jesus made up to make the people realize stuff. These days, the newspapers and the goverment take care of making us think the way they want us to think. Sad but true, you can't do anything about it. Even if you know it's happening, there's absolutely nothing you can do about it. \r\nSorry if I spoiled your life.\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nTo me this song is about religion.  The speaker is talking about a high power of the church.  He judges, or waves his finger at you telling you you're wrong in your doings.  This man is a hypocrite, and he is up to his eyes in his lies.  When he looks at everybody he judges them, thinking he and his people are better, the speaker believes everybody is equal.  The church leader is very immoral and gets dirty money from the lies he tells to his victims, and starts making his riches his life.  When the man preaches he is lieing, liar lawyer, he is trying to convice people he is right though he knows he is wrong.  That is just what it means to me, only one Point of View.\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nI know this isn't really the true meaning, but i like to think this song is about the hypocrisy of politics..i especially like the lines\n\r\n\"Liar, lawyer, mirror show me. what's the difference?\"\n\r\nand\n\r\n\"Liar, lawyer, mirror for ya. what's the difference?\"\n\r\nMy wee brother is wanting to become a Lawyer, so i kind of use it to remind of what i think of Lawyers and Politicians in general. He is also a pretty big Tool fan so he knows exactly what i'm talkin' 'bout :)\t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nIt isn't Ganja Police, it is Ganja Please. Have a look at the Tool website, go to News Archives.\n\r\nGanja Pulease!\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nAlso, Blood sugar sex, show me some magic and look at the Tool Website, it's song meanings, not song mutilatiion.\t\t\t\t\n\t\t\t\t\n\n", "comment_206": "\nIm going to say it again. SESS has it right. And again, the reason that Adam Jones stepped it up is because Danny told him to. Danny writes it, they play it.\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nI've been seeing a lot of flaming (mainly between everyone and Trexor) and I have to say it's pretty pathetic. You take away from the meaning of the song when degrade everyone else for expressing opinions. Honestly; this isn't life and death! We're all Tool fans who want to try and understand the message that MJK is trying to get across. So, since we all have that one thing in common, why can't we all just get along? You create more problems and distract from what this website is trying to accomplish when you focus all of your attention on being condescending instead of trying to help one another to understand \"The Pot\".\n\r\nI personally think that everyone here has raised a lot of good points. The song is obviously not about marijuana, because it's OBVIOUS. I think that MJK was using it as both a reference to \"the kettle\", as well as a method for getting everyone's attention. Come on; what's the first thing you wanna do when you see a song with a title including \"pot\"? Exactly.\n\r\nI also agree with the person who said that the lyrics aren't exactly accurate. You don't even need to hear the song to know that, because some of the lines just don't make sense, even for MJK (however, I have heard the song!)\n\r\nThe last thing I want to see is concerning Sess:\n\r\nDude, obviously you're smart enough to know that when you resort to idiotic name-calling, you're on the same level as the \"fool\" you're trying to correct. No one here is an idiot. We all have opinions that are WORTH expressing. You just make yourself look foolish when you try to be \"high-and-mighty\" and pretend you're omnipotent. Most people here do put thought into their posts. \"Who are you to wave your finger\" when you've just restated all the conclusions that everyone else has already come to?\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\n\"Also, Blood sugar sex, show me some magic and look at the Tool Website, it's song meanings, not song mutilatiion.\" - PocketJosh\n\r\nCouldn't have said it better myself...\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nwell its very obviously about hypocrisy\n\r\nbut I think the title comes from the old saying about the pot calling the kettle black\n\r\n\"when you pissed all over my black kettle\"\t\t\t\t\n\t\t\t\t\n\n", "comment_210": "\nThe real lyrics have already been released from tools website in the news section a while ago which are equivalent to the ones on this site. That being said im trying to figure out the meaning of \"weeping shades of cozened indigo.\" Cozened is another way of saying deceitful but why would the person be crying in the first place? Also how does this relate to eyeballs deep in muddy waters?\t\t\t\t\n\t\t\t\t\n\n", "comment_211": "\nWell if you examine to word â\u0080\u009ccozenedâ\u0080\u009d you will notice that it is almost exclusively used to describe someone acting to mislead by means of a petty trick or fraud or to persuade or induce one to do something by cajoling or wheedling. In other words; To obtain by deceit or persuasion.\n\r\nIndigo is a blue dye that was once obtained only from plants, but is now is almost completely made synthetically.\n\r\nMakes thing clearer once you know exactly how the word is usedâ\u0080¦\t\t\t\t\n\t\t\t\t\n\n", "comment_212": "\nthis song is absolutely fucking amazing.. it'd definitely political to the core and i love it. i honestly think i know what hes talking about but it's controversial so i'll keep that to myself. tool is definitely the band of our generation and the musical voice we need.\t\t\t\t\n\t\t\t\t\n\n", "comment_213": "\nP.S. thanks duke. you explain well.. i tried to explain to tobelieve but i couldn't get the right words to make it simple.\t\t\t\t\n\t\t\t\t\n\n", "comment_214": "\nWell I dont know the whole song but in one part \n\r\nfoot in mouth and head up ass, so watcha talking bout?\r\ndifficult to dance round this one till you pull it out. boy\n\r\nyou musta been so high.\n\r\nwhen i hear tht i thnk it is bout two guys getting stoned and having sex... ya its wierd but thts wat i thnk bout thts y i dont liek listening to tht song anymore... but i dont know bout the other parts of the song\t\t\t\t\n\t\t\t\t\n\n", "comment_215": "\nThis song is mindblowing!!!\r\nSomehow Tool manage to play in an 8 and 6 beat time signature simultaneously, pretty much through the whole song!\r\nFollow the rythym and you'll see what i mean.\t\t\t\t\n\t\t\t\t\n\n", "comment_216": "\nman...you guys are so far off base as to this song's meaning. They are criticizing the war and our government in general. \"weepin shades of cozened indigo\".....indigo is a color made from red,white and blue and cozened means to deceive. \"trapped without a reason\"...means we're stuck in iraq....for what??? \"soapbox house of cards and glass....\" as well as \"who are you to wave your finger.....fucking hypocrite\"...is all about saddam and the fact that we went to war over his weapons of mass destruction even though we hypocritically possess them. \"kangaroo done hung the guilty with the innocent\"...has to do with the guantanamo bay. we keep these people in custody without charges or a hearing....both those guilty and innocent. I believe the whole \"you musta been high\" and \"ganja p-lease, you must have been out your mind\" has to do with Bush's logic, basically callin him a retard. feel free to comment on my thoughts....but i think it's pretty obviously a anti war song and really has nothing to do with self righteousness or drugs.\t\t\t\t\n\t\t\t\t\n\n", "comment_217": "\nThe Pot does make a good protest song but I believe, like alot of Tool's work, that this song has multiple meanings, all depending of the disposition of the listener. This track is similar to \"Hooker with a penis\" in the sense that it's a genric f**K you song that can be applied to any kind of 'beef.' I'm not saying you're wrong DeNiro. I myself like to apply this track to ol' Bushims.\t\t\t\t\n\t\t\t\t\n\n", "comment_218": "\n\"The Pot\" refers to the toilet.  Maynard once said he loves Taco Bell at 2 o'clock in the morning cause it cleans him out real good.\t\t\t\t\n\t\t\t\t\n\n", "comment_219": "\n\"The Pot\" can refer to three things now: a toilet, weed and hypocrisy. The toilet idea may even tie into the 'shit the bed' themed \"Rosetta Stoned\"\r\nY/N?\t\t\t\t\n\t\t\t\t\n\n", "comment_220": "\nI actually think this song is a shot at criticizing people who criticize pot.  Its saying that those people are the same as stoners are, that they all do the same things, and that those who are opposed to it just use pot as a good excuse to accuse them.\n\r\n\"who are you to wave your finger?\" is a way of saying: \"who do you think you are?\", like the others pretend to be perfect.  It says that those opposed are just as guilty of having bad habits, they're not perfect.  \"you must've been out of your head' is obviously saying they must be crazy to think something like this.\n\r\n\"rob the grave to snow the cradle, then burn the evidence down\" is a way of saying that those opposed lie just like pot heads do, but they just try to use their perfection as a way of covering it up.  \"Soapbox house of cards and glass, Don't be tossin' your stones around\" is just his way of saying the old phrase \"those who live in glass houses shouldn't throw stones.\"\n\r\n\"Foot in mouth and head up asshole, Whatcha talking 'bout?\" is probably a stab at the ignorance of people who say that they're experts on the subject, but really don't know anything about it.  Say for example that a TV talk show celebrity addressed the issue and made claims about marijuana, he is probably completely clueless to its true effects and he would have his \"foot in his mouth\" and his \"head up his asshole\".  \"Save your shady inference\", would then be a way of saying \"save your wrong accusations\".\n\r\n\"Now you're weeping shades of cozened indigo, Got lemon juice up in your eye\", I would assume is a way of saying that they're crying about nothing, or whining about nothing... and faking it at the same time.  This one I'm not completely sure of.\n\r\n\"Who are you to wave your finger?, So full of it, Eyeballs deep in muddy waters, Fucking hypocrite\" I'd assume is once again saying that these people are all just as equally guilty, and they're being hypocritical by accusing other when they are just as plainly guilty.\n\r\nThis is all clearly concluded at the end by saying: \"Kangaroo be stoned, He's guilty; ask the government!\"\"  Its saying that when accused, someone who uses drugs is obviously guilty because they're a drug user.\t\t\t\t\n\t\t\t\t\n\n", "comment_221": "\nOh and I forgot:\n\r\n\"you must've been high\" is a way of repeating the accusation these people place on stoners.\t\t\t\t\n\t\t\t\t\n\n", "comment_222": "\ni have a small question. why does everyone assume that maynard does not have the lyrical ability or interest to write about gitmo? I mean, just about everyone had to hear about the prisoner abuses on an island not subject to civil human rights. Everyone knows that the Republicans have re-tooled the Geneva Conventions to suit their needs. Everyone had to hear about how the \"terrorists\" were horrible people and that they had to be stopped. In fact, these stories dominated the majority of all mainstream media. If you were unaware of these events you weren't alive. And if Maynard is the first self-inflexive, mildly-spiritual, mind-expaning musician to take a crack at a political protest, then I am the King of Monaco.\n\r\n\"I don't think he's talking about the kangaroo courts in gitmo.\" Then what is he talking about? Is he talking about the other Kangaroo? The marsupial biped that bounds across Australia? God knows those things have been dominating the news lately.\n\r\nCome on, use Occam's Razor. The most likely answer is usually the right one. The obvious answer is usually the correct one.\t\t\t\t\n\t\t\t\t\n\n", "comment_223": "\nActually this song is reffering to \"kangroo courts\" which were mock courts made for mainly drug cases where they didn't need any evidence to convict them guilty.\n\r\n:)\n\r\n-Jenna\t\t\t\t\n\t\t\t\t\n\n", "comment_224": "\nIt's interesting to see how others interpret this song. I'm still of the opinion that it's all about our government. the \"eyeballs deep in muddy waters.....\" oil interpretation is a pretty good one, but I think that Maynard is just creatively saying \"up to your eyes in shit!\" If you listen to A Perfect Circle's Thirteeth Step \"The Pet\" you find that Maynard is really upset with the Bush Administration and his anger carried over to \"10,000 Days.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_225": "\nI agree with the person who said that there are different interpretations for the song depending on the person's disposition at the time. Too many different explanations make sense for the song to only have one meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_226": "\nMxMave... if he is NOT talking about kangaroo courts, what IS he talking about? it is a bit strange to just be singing about kangaroos don't you think? also...for this song i saw a lot of negativety over who's \"right\" and who's \"wrong.\" just in case you people forgot, you aren't tool and can't call someone wrong... and shit man, you wanna find out the meanings and prove someone wrong and put them down go 'head...maybe we should just ask tool... i'm sure they'd know right?\t\t\t\t\n\t\t\t\t\n\n", "comment_227": "\nREAD AND LISTEN TO THIS!!!\n\r\n7812569103411/67584131221911310/15\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_228": "\n...by the way...he does NOT sound like the guy from the Mars Volta in the intro... he sounds like the guy from Maroon 5. Other than the gay intro... awesome song.\t\t\t\t\n\t\t\t\t\n\n", "comment_229": "\nI have some insight to the whole indigo thing, and it's a lot different than what you guys seem to think, but I could be wrong.\n\r\nFirst, the Indigo child thing is pretty close, but not for the reasons you think.  The indigo child thing is more like a reaction to the drugging of kids for ADD, and I don't think it has much to do with the song, although it could relate to drugging kids to conform to society but saying other drugs are bad, but I digress.\n\n\r\nnow you're weeping shades of cozened indigo. (musta) got lemon juice\r\nup in your eye\n\r\nOk, so cozened deals with deceipt, so it's talking about false tears.  False tears of what?\n\r\nIndigo.  Now, indigo is, in fact, a color, as it has been associated with certain wavelengths in the visible spectrum, but most humans can't see it.  The significance of this word though is in the etymology.\n\r\nNow some of you have brought up lachrymology, the study of tears, and the funny thing is that some people think that it's not literal tears, but \"tears\" from the pineal gland, the \"indigo chakra.\"  Many people don't know why the pineal gland is known as the indigo chakra, but it's quite simple.  \n\r\nAlso, this album has a lot of references to drugs and Albert Hoffman, who first synthesized LSD, and discovered other endeogens like salvinorin a and psilocybin.  He also discovered DMT, which is thought to be produced in the Pineal Gland in small doses during near-death experiences and highly traumatic events.  This is not proven, however melatonin IS produced in the pineal gland.  Interestingly, what most of these drugs, except of Salvia, share is a basic chemical structure known as an indole.  So what DMT and melatonin share is the indole aromatic ring, and they both also share other similar structures (if you compare the two, melatonin is almost exactly the same as DMT, only melatonin has a few more oxygen and hydrogen atoms).  DMT is seen as an enlightening drug, and so the pineal/indigo chakra is seen as one of intelligence and enlightenment.  The word indole itself is derived from combining the words indigo and oleum, since indole was first isolated by treatment of the indigo dye with oleum.  So that's how the word indigo came to be used with the pineal gland and intelligence/enlightenment.\n\r\nnow you're weeping shades of cozened indigo. (musta) got lemon juice\r\nup in your eye\n\r\nso \"you\" are \"weeping\" \"tears\" of \"false/fake\" \"intelligence/enlightenment.\"  The person uses \"lemon juice\" to produce these tears.\n\r\nThat's pretty much all I got.  Don't want to get too much into the actual meaning of the song, because most of the people are too subjective, but I thought the indole thing would shed some light onto the meaning of the phrase.\t\t\t\t\n\t\t\t\t\n\n", "comment_230": "\n\"The Pot\"\n\r\nWho are you to wave your finger?\r\nYa' must have been out your head.\r\nEye hole deep in muddy waters.\r\nYou practically raised the dead.\n\r\nRob the grave, to snow the cradle.\r\nThen burn the evidence down.\r\nSoapbox, house of cards, and glass,\r\nSo don't go tossin' your stones around.\n\r\nYou must have been high.\r\nYou must have been high.\r\nYou must have been.\n\r\nFoot in mouth, and head up asshole.\r\nWhatcha talkin' 'bout?\r\nDifficult to dance 'round this one\r\n'til you pull it out, boy!\n\r\nYou must have been, so high.\r\nYou must have been, so high.\n\r\nSteal, borrow, refer, save your shady inference.\r\nkangaroo done hung the juror with the innocent.\n\r\nNow you're weeping shades of cozened indigo\r\nGot lemon juice up in your...EYE!\n\r\nWhen you pissed all over my black kettle\r\nYou must have been HIGH, HIGH\r\nYou must have been HIGH, HIGH\n\r\nWho are you to wave your finger?\r\nSo full of it.\r\nEyeballs deep in muddy waters\r\nFuckin' hypocrite.\n\r\nLiar, lawyer, mirror, show me.\r\nWhat's the difference?\n\r\nkangaroo done hung the guilty with the innocent.\n\r\nNOW!!\r\nYou'll weep or, change the cozened indigo.\r\nGot lemon juice up in your high eye.\r\nWhen you pissed all over my black kettle\r\nYou musta been!\n\r\nSo who are you to wave your finger?\r\nWho are you to wave your fatty finger at me?\r\nYou must, have been, out your, mind!\n\r\nWeepin' shades of indigo\r\nShed without a reason\r\nWeepin' shades of indigo\n\r\nLiar, lawyer,\r\nMirror for ya,\r\nWhat's the difference?\r\nkangaroo be stoned\r\nHe's guilty as the government\n\r\nNOW!!\r\nWill you weep or, change the cozened indigo\r\nGot lemon juice up in your, EYE!!\r\nEYE!!\n\r\nNow when you pissed all over my black kettle.\r\nYou musta been HIGH, HIGH, HIGH, HIGH.\r\nEyeballs deep in muddy waters\r\nYour balls deep in muddy waters.\r\nGanja, please, you must have been out your MIND!!!!\n\r\n[\"Kangaroo\" refers to \"kangaroo courts\", which were mock courts established to prove people guilty without a fair trial or any real evidence - most of the court cases dealt with marijuana users]\t\t\t\t\n\t\t\t\t\n\n", "comment_231": "\nIndigo, or purple is also the colour of royalty. Another double entendre!\t\t\t\t\n\t\t\t\t\n\n", "comment_232": "\nTool: The Cyclic Playlist.\r\n6,7,5,8,4,13,12,2,1,9,11,3,10 / 15 / 7,8,1,2,5,6,9,10,3,4\t\t\t\t\n\t\t\t\t\n\n", "comment_233": "\nJaggers, you're kinda right. He sounds a little like the Maroon 5 guy. But I don't believe that that isn't Maynard's voice. I think it's ridiculous to even think so. And I know YOU didn't say that, but other people have.\t\t\t\t\n\t\t\t\t\n\n", "comment_234": "\nOMIGOD THE IS THE BEST TOOL SONG YET!!!! (well, alsmost!!!)\r\n(/_ /)\r\n(o.0)\r\n(>\t\t\t\t\n\t\t\t\t\n\n", "comment_235": "\nI don't know if anybody has already posted this...but this is based on yet again another bit by the legend himself, Bill Hicks. The bit was all about hypocrat drug comercials...Hilarius by the way.\t\t\t\t\n\t\t\t\t\n\n", "comment_236": "\nTool Synclist (complete)\r\n7,8,1,2,5,6,9,10,3,4 - 6,7,5,8,4,9,13,1,12,2,11,3,10 â\u0080\u0093 15,14 (or 14,15)\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_237": "\nAhh, Maynard is so deep. Its basically metaphors and similies followed one after another. The general message is how the ones at the 'top' can be self-centered and ignorant.\t\t\t\t\n\t\t\t\t\n\n", "comment_238": "\nMuddy Waters is a dead blues musician you dumbasses\t\t\t\t\n\t\t\t\t\n\n", "comment_239": "\nSoapbox house of cards and glass so don't go tossin ur stones around Foret.\t\t\t\t\n\t\t\t\t\n\n", "comment_240": "\nInteresting theory on ppl at 'the top' l33t.\r\nThe Top/The Pot?\t\t\t\t\n\t\t\t\t\n\n", "comment_241": "\nAlot of people are not getting the \"Ganja Please\" reference.  Ganja is supposed to be the best of the best weed, right.  So he is saying Ganja, Pulease, like you think you are so high and mighty---PLEASE!  Come off it!  Which would go along with the rest of the song- people that want to point the finger and act like their shit don't stink.\t\t\t\t\n\t\t\t\t\n\n", "comment_242": "\nI dont care if TREXOR's last comment was a year ago, that ignorant little shit needs to DIE. i wish i knew where he lived so i could personally go to his house, and bash his face in with a crowbar, piss on his corpse, then punch his mother in the face for concieving such a snotty, shit-eating little asshole. Im just assuming he still lives with his mother...\t\t\t\t\n\t\t\t\t\n\n", "comment_243": "\nand by the way, almostarrogant, I've been smoking weed for a long time now, Ganja does NOT refer to the best of the best, Chronic is the proper term. Ganja is just another slang word for weed. I'm not shitting on your idea though, it's a good thought... TOOL ROCKS, and FUCK TREXOR\t\t\t\t\n\t\t\t\t\n\n", "comment_244": "\nHasn't TREXOR suffered enough? I thought a weedhead would be mellow. (no offense)\t\t\t\t\n\t\t\t\t\n\n", "comment_245": "\nThis song is incredibly popular right now, but its creating a wierd effect among inbecile-metal radio station listeners. I metion TOOL and people are like oh yeah \"THE POT\" rules. And i'm like cool, (and stupid me) I start asking them, hey do you like any of the songs off Lateralus?\t\t\t\t\n\t\t\t\t\n\n", "comment_246": "\nHey TREXOR you annoy me so much i took the time to sign up to song meanings to tell you you should shut the fuck up. If you don't like tool fine, enjoy hating them we don't need to hear your whining about them. You think your hard core but your just a little cry baby go listen to some nigga beats ya fuck! Tool are not main stream, lateralus and aenima are very different from each other and there for so is 10 000 days. and this album is not fake you dick YOUR JUST SHIT!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_247": "\nWhy Tonay, why?\t\t\t\t\n\t\t\t\t\n\n", "comment_248": "\nSome Tool songs undergo slight lyrical variations in each performance; Maynard's own typed versions are shown here, uncorrected, to provide you with a straight-from-the-source guide to what he has said / might say next time. \n\r\nMost of these transcriptions came straight from the Man's computer. How he writes his lyrics/poetry and then translates that into music is up to him. Think of them as photographs; you don't look exactly the same in every picture, but it is still you. \n\n\r\n------------------------------------------------------------\r\n(BOLD indicates official lyrics which correct earlier guesses)\n\r\nWho are you to wave your finger?\r\nYou must have been outta your head\r\nEye hole deep in muddy waters\r\nYou practically raised the dead\n\r\nRob the grave to snow the cradle\r\nThen burn the evidence down\r\nSoapbox house of cards and glass so\r\nDon't go tossin' your stones around\n\r\nYou must have been high\n\r\nFoot in mouth and head up ass\r\nSo whatcha talkin' 'bout?\r\nDifficult to dance 'round this one\r\n'til you pull it out. boy,\n\r\nYou must have been so high\n\r\nSteal, borrow, refer, save your shady inference\r\nKangaroo done hung the jury with the innocent\n\r\nNow you're weeping shades of cozened indigo\r\n(Musta) got lemon juice up in your eye\r\nWhen you pissed all over my black kettle.\n\r\nYou must have been high!\n\r\nWho are you to wave your finger?\r\nSo full of it\r\nEye balls deep in muddy waters\r\nFuckin' hypocrite\n\r\nLiar, lawyer, mirror, show me. What's the difference?\r\nKangaroo done hung the guilty with the innocent.\n\r\nNow you're weeping shades of cozened indigo\r\n(Musta) got lemon juice up in your eye\r\nWhen you pissed all over my black kettle.\n\r\nYou must've been...\n\r\nSo who are you to wave your finger?\r\nWho are you to wave your fatty fingers at me?\r\nYou must have been out your mind\n\r\nWeepin' shades of indigo\r\nShed without a reason *\r\nWeepin' shades of indigo\n\r\nLiar, lawyer - mirror, for you what's the difference?\r\nKangaroo be stoned. He's guilty as the government. \n\r\nNow you're weeping shades of cozened indigo\r\n(Musta) got lemon juice up in your eye\r\nNow when you pissed all over my black kettle.\n\r\nYou must've been high! \n\r\nEyeballs deep in muddy waters\r\nEyeballs deep in muddy waters\r\nGanja? P-lease!\r\nYou must have been out your mind \n\r\n* This line is missing from the official transcription. But here it is. \n\n\n\r\nthis song is purely about hypocracy.... so stop th stupid bickering...\t\t\t\t\n\t\t\t\t\n\n", "comment_249": "\nwow... y'all sure can be total frickin' backsides 2 eachotha, can't ya? wow. okay. even I can tell that this song is about hypocricy (sp???), and i'm not exactly all that old. *eye roll*. but i also think that the dood who was talking about the \"study of crying\" makes a lotta sense, and yeah. ... \r\nHey mister TREXOR:::\r\ni'm only like.... okay i won't say me age, but yea. AnywayzzzzZ. You need to frickin' \"pull it out, boy\" b/c ur just an a-hole. I've been listenin' to music all my short lil life, and TooL is one of my fave bands on earth. You just don't know music from crap-- you proly listen to rap and r&b... loooozer.\r\nAnd hey, y'all don't be dissin' Nickelback either, it's great to have a lil variety (plus \"rock star\" is pretty sweet). ... so... um... yeah. ^^ anywayzZZ.. main reason i posted: y'all can have OPINIONS, but y'all don't hafta BASH EACHOTHERS SKULLS IN. ^^\t\t\t\t\n\t\t\t\t\n\n", "comment_250": "\n[pps]::: any of y'all seen Foamy the Squirrel? Well it's this cartoon-thing that, like Optik said, is criticizing peeps who criticize peeps that do drugs, b/c they're just like the druggy- they just may go about \"coping\" or whatev a different way... u should c it..\t\t\t\t\n\t\t\t\t\n\n", "comment_251": "\nI assumed eyeballs deep in muddy waters was a metaphor for \"full of shit\".\t\t\t\t\n\t\t\t\t\n\n", "comment_252": "\nThe Pot refers to the the old adage, \"The pot calling the kettle black.\" i.e. hypocrites who sit in judgement over others. Look at the other parts of phrases he uses, \"Soapbox house of cards and glass so Don't go tossin' your stones around,\" people in glass houses should not throw stones. Soapbox refers to those who preach to other.  And foot in mouth and head up ass, does not refer to gay sex no matter how bad you want it too, fags. Putting your foot in your mouth, and having your head up your ass. Holy shit, people hasn't anybody else ever been taught these expressions?\t\t\t\t\n\t\t\t\t\n\n", "comment_253": "\nHe ( terrafirmo) is right. Foot in mouth refers to not saying anything, just standing by and watching. and head up asshole refers to thinking you are better than others. \n\r\nPerhaps the meaning of the song is about poeple who think they are better than others and don't really have any reason or experience through what others may be going through. They just watch over people feeling superior. Marijuana may just be the example.\t\t\t\t\n\t\t\t\t\n\n", "comment_254": "\nThe Pot is definately a double entendre. Alot of stoners will probably listen to this song and think \"Dude, MJK singin about weed man. That's so cool.\" (no disrespect) There's also references to stones, ganja, reefer (it's actually refer but close enough.) as well as the all improtant 'ya must've been sooooooo high.' Seeing as this album is dividing fans right in two, this song could be a clever play on words where those that merely hear the song think it's about dope whereas those who listen to it will understand it's true meaning.\r\np.s: I thought 'foot in mouth' disorder was speaking carelessly and setting yourself up for a rebuke/bitchslapping. (I definately suffer from this.)\t\t\t\t\n\t\t\t\t\n\n", "comment_255": "\nwat day is it?\t\t\t\t\n\t\t\t\t\n\n", "comment_256": "\ni put this cd inthe day it was released on the east coast, i was disappointd. i put undertow bac n after2 full revolutions i was leavn the airport on my way to feed the demon n moven fast dwn 95 i recalld likn the pot n rosseta stoned for no particular reason but was over alll disappointd. then i saw tool n dc. i had a legitmate experience of some kind. i had been wrestling a herion addiction for a bit, but was clean 4 bout 3,4 days. none of this is 4 u guys to sit there n tear up cause i dont give 2 fucks bout the lot of you. i nvr read the lyrics and left each song open to my own interptation like it btr like that. also the songs have a chance toimprint on me on thier own, then after i have enuff questions i can seek out wat i need.i been clean for 10 days now, i relapsed immeditaly after the show. i had no idea bout mjks mom, but i got the pain of havn been 10000 days in the fire just fine i got that plenty good doyaken, this album has changed my life 4 the btr actually which is a rarity. u guysngals out there should ease up a lil bit n i m not gonna go into all of that, cause so far i m the only one livn n my head ty very much ty very much indeed. thank you mjk n tool. keep doin wat u do n ill keep doing n being wat i m. i think in closeing i should also add that some of u guys r lookn 4 things that u may not like once u find them. beware\t\t\t\t\n\t\t\t\t\n\n", "comment_257": "\nYou're not the only one living your head, trust me. In a way we all live in two worlds: The one inside our minds and the one outside them.\r\nKeep fighting the good fight.\t\t\t\t\n\t\t\t\t\n\n", "comment_258": "\nBtw, I know what you mean about being disappointed with TKD at first. The songs really do grow on you the more you listen to them, as most great songs do.\t\t\t\t\n\t\t\t\t\n\n", "comment_259": "\nmaan..ok i agree trexor is an ass..but if u've noticed..he's criticized every song from 10,000 days..plus i dont think he's said anything since last year..he was just doin it to pick fun at everyone..i say..let it go. but what's there to say thats already been said about this song...its a GREAT song later\t\t\t\t\n\t\t\t\t\n\n", "comment_260": "\nWhen I first heard this song, my ex-friend ex-boss had been ostracising me because I spoke my mind and acted on issues that he refused to because it would make his life difficult. He went around telling people I \"complained too much\" when the stuff I'd complained about was stuff he'd been bitching to me and others about for months. He's a big smoker, I'm not, and this song just about rocked my world, because he was a hypocrite and a stoner. \n\r\nAnybody else notice that the song is addressed TO someone who \"musta been high\"? Nobody seems to be acknowledging that smokers can often be hypocritical bastards.\n\r\nThen again, there's probably a hell of a lotta stoners on the Tool board! :p\n\r\nPS \"Foot in mouth\" doesn't refer to \"not saying anything, just standing by and watching\" - it refers to saying something that wasn't appropriate, like \"putting your foot in it\"... ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_261": "\nI actually find myself saying to people \"ya must've been high\" nowdays.\t\t\t\t\n\t\t\t\t\n\n", "comment_262": "\ni might retarded but it feels like it's about president bush\n\r\n you must have been outa of your head\n\r\nburn the evience down \n\n\n\r\nsoap box house of cards and glass\n\n\r\nhe is saying the bush must have bee high to have gotten us in the war\n\n\r\nbush = kangoroo\n\r\ncuz he just looks like an idiot\n\n\r\nliar lawyer\n\r\nthe weed analogy is too simple\t\t\t\t\n\t\t\t\t\n\n", "comment_263": "\nkangaroo refers to the Kangaroo Courts used to incarcerate terror suspects including Australian David Hicks who has been held for nearly 6 years without any proper trial. The Kangaroo courts and this whole 'war on terror' also refers to Bush and the Neoconservatives.\r\nFUCK BUSH! FUCK CHEYNY! FUCK ALL YOU NEOCON SCUM! Obama for President.\t\t\t\t\n\t\t\t\t\n\n", "comment_264": "\nEveryone has good points here... but we are talkin about tool here.... there is always a deeper meaning, and these lyric are open to personal interpretationâ\u0080¦. But I highly doubt that this is just a simple weed smoken analogyâ\u0080¦.dont get me wrong I love smoken potâ\u0080¦. But its about the crazy injustice that goes on, in the so called equal nationâ\u0080¦. who are you to wave your finger? you musta been outta your headâ\u0080¦. Look at the people who run this nation they are a bunch of crooks liars cheater and druggiesâ\u0080¦ they point the finger at the easy target, the minorities, the poor, the weak, the list goes on. These so called leaders are hypocriteâ\u0080¦. They are just as bad as you, me or your average cell mateâ\u0080¦ they hide behind there money and lawyersâ\u0080¦.fuckin hypocriteâ\u0080¦.eye balls deep in muddy watersâ\u0080¦ they can no longer see clearlyâ\u0080¦ there mind is so burred with corruption, money, and powerâ\u0080¦.. I could go on for days, but knowing tool they are basically saying fuck the system who are you to wave your fatty fingers at me? You must have been high\t\t\t\t\n\t\t\t\t\n\n", "comment_265": "\nIndeed\t\t\t\t\n\t\t\t\t\n\n", "comment_266": "\nthanks  ninja m doin my best. well said and well timed ty very much. i was in need of a lil push\t\t\t\t\n\t\t\t\t\n\n", "comment_267": "\nI think this song is about hypocritical hippies since I saw that episode of South Park.\t\t\t\t\n\t\t\t\t\n\n", "comment_268": "\nFUCK TREXOR, foot in mouth, head up asshole bitch lolz\t\t\t\t\n\t\t\t\t\n\n", "comment_269": "\nIn my opinion this song has a simple, yet deep meaning.\r\nIts about hypocrisy, and people being judgemental, waving their fingers at others. Noone is perfect so anyone who waves their finger at anyone is a hypocrite. \"You must have been high\" is very ironic, because its an example of hypocritically criticizing hypocrites :)\t\t\t\t\n\t\t\t\t\n\n", "comment_270": "\nI think a lot of you guys are trying to look too deep into this song, simply thinking that because other TooL songs have had hard meanings to decipher that this one does too. \n\r\nThis song simply refers to hypocrisy in general, using people like lawyers as reference tools. Everyone says that it can't be a \"simple marijuana example\", but you are thinking to far into it. This medium that Maynard is using is just an example, reference, and metaphor used to describe hypocrisy as he sees it in today's world.\n\n\r\nTREXOR, why do you have to be such an asshole to what people say on all the TooL boards? Just go on with your life, you're only wasting your time with your posts here.\t\t\t\t\n\t\t\t\t\n\n", "comment_271": "\n^^^Why the heck are you guys still complaining about that damnned trexor, he's probably dead now, a victim of an angry tool fan.  (dont look at me)!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_272": "\nO.K, her is my strange interpretation of this strange song,  i think it is a song to push all you tools aout there over the 'edge', it is simply an experience he had when someone was at his house and had to use the bathroom (the pot) and they were high and had lemon juice in ther eye, and they pissed all over his black toilet. then the person was critisising maynards bathroom at how dirty it was ,but maynard had seen his toilet before and it was dirty so he was a hypocrite., ill explain more later,(maybe) i'm on my freakin' vacation!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_273": "\nRead the entire forum...I think MvMave hit the nail right on the heead on page one! I feel...Bush, the so called \"friendly\" fire and that poor soldier ...they burned all the evidence, lawyers lied, musta been high!! Go figure?\t\t\t\t\n\t\t\t\t\n\n", "comment_274": "\nwhat?^^^^^\t\t\t\t\n\t\t\t\t\n\n", "comment_275": "\nI highly suggest anyone who reads this to watch Loose Change 2nd Edition video on YouTube.com its a documentary on the \"happenings\" during 9/11 on the US's part. Its not alot of conspiracy theory bullshit either as one might think. After veiwing the video and listening to this song I've made my own interpretation. Soap box house of cards and glass - WTT.. Tower 5 with all CIA and federal documents, 2 miles from WTT seems to collapse (Burn the evidence down) Tears of indigo is the government mourning for public appeal although its just lemon juice induced tear. Well check it out and see what you all think... Powerful video, its hour and a half long so make sure you can make the commitment, you have the right to know as an American.. Feed your mind, spread the word, start the revolution\t\t\t\t\n\t\t\t\t\n\n", "comment_276": "\nCould this be about his moms hypocrisy? a lot of this album is about his mom right?\t\t\t\t\n\t\t\t\t\n\n", "comment_277": "\nBut how is his mom being a hypocrite?\t\t\t\t\n\t\t\t\t\n\n", "comment_278": "\nUm.... the official lyrics mite be \"Who r u to wave your finger, you must have been outta your head\"\r\nbut he says \"Who r u to wave your finger u must have been outta your hair\" i ges he was hi and was thinkin head then he was thinkin, head...head AHHA HAIR, HAIR GOES ON YOUR HEAD. and so he said head. Anyway i think its obvious wats the songs about.\t\t\t\t\n\t\t\t\t\n\n", "comment_279": "\nJustin's bass is badass all the way through, but especially in the intro and verse.  He is the best thing to happen to this band, in my opinion, and I've been a fan for many years.\t\t\t\t\n\t\t\t\t\n\n", "comment_280": "\nI just think its funny that this song came on the radio as my boyfriend was smoking pot in his car.\t\t\t\t\n\t\t\t\t\n\n", "comment_281": "\n1000 CURSES ON TREXORS SOUL. MAY HE BE RAPED/PISSED/SHIT/EATEN/DISEASED/BURN BEFORE I SHOOT HIM IN THE HEAD.\t\t\t\t\n\t\t\t\t\n\n", "comment_282": "\nwtf, goddammit, whats wrong with you? quit complaining about TREXOR. that was almost a year ago. why don't you fucking find something better to do? goddamned whiners...\t\t\t\t\n\t\t\t\t\n\n", "comment_283": "\nand quit writing in all caps. it makes you look like a 10 year old.\t\t\t\t\n\t\t\t\t\n\n", "comment_284": "\nthis song is about hypocrisy. pure and simple. maynard used marijuana as a veil to make shallow people think the song is about weed and nothing else.  the same tactic was used for 'stinkfist'. 'the pot' really making a reference to the age old saying \"the pot calling the kettle black\". using \"the pot\" to describe a person or corporation that is being hypocritical in the way that s/he or they go about their business. PS: TREXOR ur a dickhead.\t\t\t\t\n\t\t\t\t\n\n", "comment_285": "\nMaynard's a smart guy. I'm sure he'd find all the bitching somewhat amusing. I'm guessing it's about how hypocrtical the whoel world is especially in america.\t\t\t\t\n\t\t\t\t\n\n", "comment_286": "\nHey guys, I bet TREXOR is Maynard having some fun and proving the point of his songs even more.\t\t\t\t\n\t\t\t\t\n\n", "comment_287": "\naight maynard, we know its you now, so you might as well admit it haha\t\t\t\t\n\t\t\t\t\n\n", "comment_288": "\nI've had this theory for a while now. I don't think this song is about Judith's hypocrisy, I think it IS judith calling out these hypocrites. Think about it, this song comes in after 'Wings' and Judith Marie was most likely a headstrong and forthcoming person. (shaking her fist at the gates)\t\t\t\t\n\t\t\t\t\n\n", "comment_289": "\nTrexor. i know its gettin old bashing u but its so fun. if your such the hard core Tool fan perhaps you should re listen to their song Hooker with a Penis. U still rock that dope beastie-T?\t\t\t\t\n\t\t\t\t\n\n", "comment_290": "\ni tend to agree with tha point that Tools lyrics interpretations are left up to the listener. but also their songs are many layered with multiple meanings. i agree that the song is generally about hypocrisy, but i think the words, metaphores and adages he uses are based on modern day events such as Katrina, Gitmo and Iraq War, subtley, to talk about hypocrisy within America. \r\n  I also looked up Chief Black Kettle, who was a Cheyanne Indian chief during the civil war who advocated peace with the white settelers moving west spurred on by the gold rush. He was eventually killed in a US army raid led by none other than Gen.George Custer on his reservation. when they found his corpse he was on a river bank face down in muddy water. kinda odd but i dont think it has any reference to the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_291": "\nlisten to the song \"Waist Deep In The Big Muddy\" by Bob Seeger. I think this might explain the muddy water part, maybe...possibly\t\t\t\t\n\t\t\t\t\n\n", "comment_292": "\nI dont think this song has anything to do with being stoned! I think it is about hypocrisy. I believe that when Maynard says \"you must of been high\" hes not meaning in in literal terms like high on mary jane...its more in dept just how the band is... hes talking about high as in crazy a hypocrite.\t\t\t\t\n\t\t\t\t\n\n", "comment_293": "\nalthough the song is called the pot i think it can be related to the expression \"digging yourself into a hole\" your deep in the pot... idk... I agree with Wraith75 a person should really listen to a song and interpret it the way it makes them feel...thats all music...no one is right or wrong its how a person interprets it and can relate to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_294": "\nI dont think it says mirror for ya i think it says Liar lawyer, mirror,foil, whats the difference??    p.s this whole C.D. has alot of contradictions in it, i forgot where, but look out for them, and write them out under this song, cuz im trying to figure this thing out .    oh yeah also im not sure but also the bible has many contradictions in it , maybe  its maynard saying....im not realy christian.\t\t\t\t\n\t\t\t\t\n\n", "comment_295": "\noh yeah and all you people saying trexor is maynard....well i just dont think maynard has enough time to waste on this\t\t\t\t\n\t\t\t\t\n\n", "comment_296": "\ni think that this is about politics describing them as a soap box house of cards and glass saying how fragile it is \r\nmaybe \r\ni think\t\t\t\t\n\t\t\t\t\n\n", "comment_297": "\nThis song is one of the few songs where you can clearly hear what hes saying lol its so awkward.\t\t\t\t\n\t\t\t\t\n\n", "comment_298": "\nSeriously no need for any posts. Just go back to page 2 and read sess' comment. He's got everthing down right. This isnt a song about drugs, its about a a hypocrite making money immorally (aka \"rob the grave to snow the cradle\"), and regretting it later (aka \"Muddy water\"). This song has nothing to do with drugs, so drop it and go read sess' comment on PAGE 2 for the real meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_299": "\nits about \"kangaroo courts\"...the kangaroo courts dealt mostly with drug cases and prosecuted people without any real evidence..so he's talking about how they were wrong and that maybe THEY were high..\t\t\t\t\n\t\t\t\t\n\n", "comment_300": "\nalright this is just a shot in the dirt so nobody flip here BUT, what if this song is about Bill Clinton? hes famous for his finger wave...thus \"who are you to wave your finger you must have been out your head.\"  he was once a lawyer and he lied about his affair...\"liar, lawyer mirror show me whats the difference?\" and the song also gives a reference to the government. i don't know thats what i think anyway\t\t\t\t\n\t\t\t\t\n\n", "comment_301": "\ni think it means who r u to wave ur finger at me win u do bad to\t\t\t\t\n\t\t\t\t\n\n", "comment_302": "\ngod i love this song, but it sucks they dont sell it on iTunes.\t\t\t\t\n\t\t\t\t\n\n", "comment_303": "\nLol \"this song doesnt have anything to do with being high\" Oh really? Maynard was off his chops i bet writing the lyrics up.\t\t\t\t\n\t\t\t\t\n\n", "comment_304": "\nhahaha... i smell pot...\t\t\t\t\n\t\t\t\t\n\n", "comment_305": "\nYeah, it most likely means that you can't criticize  people who do the same things as you. Whether or not it's about stoner's and pot Maynard was definitely saying that u have no right to be a hypocrite when your just as bad.\n\r\nAns what's with the black kettle thing? What the heck is that supposed to mean. And what is the kangaroo court???\t\t\t\t\n\t\t\t\t\n\n", "comment_306": "\nTo add back to mine, the line \"You must of been high!\" is repeated over and over again in the song. I don't think this is referring to druggies and stoner's, I think it means that you must be high to criticize someone who isn't any worse than you.\t\t\t\t\n\t\t\t\t\n\n", "comment_307": "\nHey PhillyFlyers8, you have a huge point. Clinton was a liar, a cheater, and a lawyer. But I think the wave your finger part goes more towards hypocrisy.\n\r\nAnd to Staindfan73, you have a point to, apparently the kangaroo court was one sided and unfair. That would make sense for lawyer because of the court and liar would be like how unfair the court was.\t\t\t\t\n\t\t\t\t\n\n", "comment_308": "\nI think when he says \"You must have been high.\" He means something the person is doing is absurd, as in someone saying \"Are you high?\" when someone is about to do something stupid.\t\t\t\t\n\t\t\t\t\n\n", "comment_309": "\nWhat does cozened mean? I thought it was \"chosen indigo\"\t\t\t\t\n\t\t\t\t\n\n", "comment_310": "\nYou are the pot calling the kettle black when you point to another person and accuse that person of doing something that you are guilty of doing yourself. Example: \"You are accusing me of being lazy? Ha! That's the pot calling the kettle black!\" \n\n\r\ni think that sums it up!\t\t\t\t\n\t\t\t\t\n\n", "comment_311": "\nI can't stand people who think that tool is not deep because they don't understand their lyrics.\n\r\nI think that The Pot is a response to Maynard through the eyes of his mother. \n\r\nAs everyone should know, The Pot is on the album 10,000 days, following Wings for Marie parts 1 and 2.\n\r\nIn Wings for Marie Part 1, Maynard expresses how he thinks his mother, Marie, wasted her life following religion.\n\r\nIn Wings for Marie Part 2, a.k.a. 10,000 days, he says that if there is a Heaven, she better get her wings for being such a hardcore Christian.\n\r\nIn The Pot, I think it is supposed to be his mother's response to Wings. In the song, he basically says that he is a hypocrite for saying his mother threw away her life, because he threw away his by doing drugs. 'Who are you to wave your finger'. \n\r\nAlso, being for those who think that Tool is shallow, did anyone notice that if you play Wings part 1 and Viginti Tres back to back, while playing Wings part 2, it makes a....super song? Part 1 and Viginti Tres together are the same length as Wings part 2.\t\t\t\t\n\t\t\t\t\n\n", "comment_312": "\nI really don't think that this song has nothing to do with pot, or stoners or anything like that.\n\n\r\n\"Eye hole deep in muddy waters..\" \r\nMost lawyers are so unethical that they are up to their eyes in shit-(muddy waters). I really thyink it has to do with the government and people's beliefs and thigns like that..but I also agree with that one guy that said that they're making fun of anyone who takes this song seriously. If you go back to their old material a lot of their \"songs\" were kinda trippy, like The Gaping Lotus Experience. I mean, come on.\n\n\n\r\nI had a friend once he took some acid\r\nNow he thinks he's a fire engine\r\nIt's okay until he pisses on your lighter\r\nKinda smells kinda cool, kinda funny anyway \n\r\nsatan, satan, satan... \n\r\nI had a friend once he took some ecstasy\r\nTried to marry me and every one in the room\r\nHe was sort of loving kinda caring,\r\nkinda tried to fuck my lazy boy\r\nIt got a bit messy all over the curtains,\r\narm chair covers, throw pillows, and carpeting \n\r\nsatan, satan, satan..\n\r\nI'm getting bored again..\n\n\r\nAs for all of you who are actually arguing over the internet, get over yourselves?\n\r\nJust enjoy thier music like the rest of us, don't try and change people's minds.\n\r\nAlmost all of us have meaningful insight- and I think this site was made for people to come and better understand the songs that they are obviously listening to, not to argue about the meanings. \n\n\n\r\nAlison.\t\t\t\t\n\t\t\t\t\n\n", "comment_313": "\nHoly shit! They re-recording Parabola and Hooker with a Penis! Then added horrible lyrics to boot! Nice job Tool!\t\t\t\t\n\t\t\t\t\n\n", "comment_314": "\nwhys everyone arguing its an amazing song just enjoy it, I'm sure most people do, 10,000 day's rule's bizatch!\t\t\t\t\n\t\t\t\t\n\n", "comment_315": "\nI especially like this one. It's like an alchemical riddle (pun intended) - you can't solve it by analyzing a verse and forcing a meaning on whole song, which is what many users on this forum do, doing disservice to Maynard at the same time. Unlike them, Maynard KNOWS what he's talkin 'bout - there is nothing superficial or random in this song, it has a definite meaning.\n\r\nIt IS about hypocrisy, but he's is not just randomly attacking all hypocrytes in the world, but rather specific ones, and for very specific (and very serious) reason. \n\r\nEvery verse is just a peace of puzzle, which means you must find an interpretation that satisfies ALL of them. \n\r\nDon't just random guess - you have Google, do your research. \n\r\nHints on song's meaning that many posters ignore:\n\r\n>Rob the grave, to snow the cradle.\r\n>Then burn the evidence down.\n\r\nWho is robbing whose grave? Which cradle we are talking about? What evidence is being burned?\n\r\n>Soapbox, house of cards, and glass,\r\n>So don't go tossin' your stones around.\n\r\nWHO is preaching from the soapbox? WHY Maynard says preacher's house is \"of cards and glass\" (can be easily shattered)? \n\r\n>Difficult to dance 'round this one\r\n>'til you pull it out, boy!\n\r\nMaynard has caught the one he is adressing in this song in a trap, that he will not easily get out from.\r\nWhat he will will not be able to \"dance around\" this time? Why?\n\r\n>kangaroo done hung the juror with the innocent.\n\r\nSong's title is \"The Pot\" (marijuana), cangaroo is linked to the juror - this is definitely about \"kangaroo courts\", which have to do with marijuana users and war on drugs, but it is not ONLY about that - goes much further. \"Robbing the grave to snow the cradle and burning the evidence down\" is not there without a reason, \"house of cards and glass\" also.\n\r\n>Now you're weeping shades of cozened indigo\r\n>Got lemon juice up in your...EYE!\n\r\nDouble meaning. Yes, lemon juice is used to make false tears (hypocrisy), which fits nicely into theme, but it also has another, more important meaning, hinted at in the next verse, that has EVERYTHING to do with the theme of the song.\n\r\n>When you pissed all over my black kettle\n\r\n\"black kettle\" obviously has to do with phrase \"the pot calling the kettle black\", since \"the pot\" is in the song's title. nice wordplay, nice point: someone is acussing the Maynard of something he's guilty of himself, and Maynard is attacking him back, claiming attacker is even guiltier. WHAT they are accusing each other about?\n\r\nNow the most important clue: \"Pissing\" hints to what \"lemon juice\" he was talking about in previous verse.\n\r\nHow \"the fucking hypocrite\" got the _urine_ up in his eye and why? What does it have to do with war on drugs? You have internet, do a research - I don't want to spoil your fun. The answer is not hard to find at all, and it leads to a ton of interesting sites on the topic. If you doubt this interpretation, look again:\n\r\n>You must have been HIGH, HIGH\r\n>kangaroo be stoned\r\n>He's guilty as the government\n\r\nAgain, Maynard is acusing hypocrite \"kangaroo\" (who stands on a soapbox, although his position can easily be shattered) of being HIGH and STONED, and being GUILTY as the government. Being guilty of WHAT? Being high/stoned on WHAT?\n\r\n>Ganja, please, you must have been out your MIND!!!!\n\r\nDefinitely not on Ganja (marijuana), since this is what \"kangaroo\" is accusing Maynard of. Maynard is mocking his attempt (\"Ganja? Please! You must have been out your MIND!!!!\")\n\r\nHaven't got it yet? Another hint:\n\r\n>Weepin' shades of indigo\r\n>Shed without a reason\n\r\nWhat (banned) plant is weeping shades of indigo when cut?\n\r\nAnd the most serious question, again: whose grave \"kangaroo\" has robbed to snow who'se \"cradle\", and what evidence was burned down?\n\r\nIf he wrote this song in middle ages, Maynard would be burnt on stake... if \"kangaroo\" could only understand it's meaning. \n\r\nBut since not even hardcore Tool fan's can... he's safe :)\t\t\t\t\n\t\t\t\t\n\n", "comment_316": "\nThat's pretty much what other people said, you just made a longer post about it...\n\r\nEither way, how can one, who didn't right the song, claim to know it's exact meaning? Maynard wrote it, so only he and the people he tells really know what it means.\n\r\nI think Tool's songs are left open-ended on purpose though, so that the idea that they are trying to get across can be applied to more than one idea or situation. Maynard also seems to have a strong distaste for close minded people, which is probably why most of his songs are the way they are.\n\r\nGood interpretation, though. At least you took the time to think about it, which is more than I can say for most.\t\t\t\t\n\t\t\t\t\n\n", "comment_317": "\nThat's pretty much what other people said, you just made a longer post about it...\n\r\nEither way, how can one, who didn't right the song, claim to know it's exact meaning? Maynard wrote it, so only he and the people he tells really know what it means.\n\r\nI think Tool's songs are left open-ended on purpose though, so that the idea that they are trying to get across can be applied to more than one idea or situation. Maynard also seems to have a strong distaste for close minded people, which is probably why most of his songs are the way they are.\n\r\nGood interpretation, though. At least you took the time to think about it, which is more than I can say for most.\t\t\t\t\n\t\t\t\t\n\n", "comment_318": "\nSorry, didn't mean to generate more noise on the forum by repeating what everybody already said - I just tried to ask questions that others skipped (instead of giving the answer right away), hoping that it will make everyone think harder.\n\r\nI'm also not claiming to know the answer for sure - I just think I found the interpretation that answers all the questions raised in the song. For example, if kangaroo is \"guilty AS the government\", then kangaroo is clearly NOT the government, as some people claim.\n\r\nTake time to read through this site:\n\njamesarthur.yage.net/…\n\r\nI can't claim that this is what Maynard had in mind, but the song makes a lot of sense in that context - robbing the grave (of ancient religions) to snow the Cradle, hypocrisy of drug laws (altogether with PISS up in the eyes of people responsible for prosecuting drug users all over the planet), kangaroo be stoned, guilty as the government, difficult to dance 'round this one, laughing at prosecution of Ganja, etc...\n\r\nThe hypocrisy is centuries long, and deeply affecting our lives. This is not the only site or book on the topic, it's just a tip of the iceberg, so feel free to explore.\n\r\nBTW, the site dissapeared from it's original adress (jamesarthur.net), with only a standard \"buy a domain\" template page instead of it. I've searched the net a bit only to find out that the author of the site was found choked to death in prison in 2005 (supposedly killed himself), where he got being accused of pedophilia (his secretary was underage). The site soon after that appeared again on yage.net, with introductory page explaining the attempt to save it from U.S. censorship. Then, soon after that, the same anti-censorship introductory page appeared on original jamesarthur.net... BUT with non-working links, so that anyone coming to original page (which is higher on Google than mirror on yage) and being re-directed cyclicaly to it from any of the links, would just give up after few clicks. Very clever.\n\r\nAnd of course, I might be totaly wrong, these things maybe have nothing to do with the song. Stay open-minded.\t\t\t\t\n\t\t\t\t\n\n", "comment_319": "\nLol, I think my post made me sound like an asshole, and I didn't intend that in any sort of way.\n\r\nI did a report on this song for my English class, I think I have a good idea what this songs about =D.\t\t\t\t\n\t\t\t\t\n\n", "comment_320": "\nmaynardslyrics.com\n\r\nI think Maynard's words need to be shared with the world, in their most accurate form. He is something of a lyrical genius, and we all know this. The site is very simple, but the main object of my site is not the layout, it's the lyrics. You will not find more accurate tool/apc/puscifer lyrics anywhere. So feel free to browse, peruse, if you will, maynardslyrics.com ...\n\r\nI have all the Tool albums done, minus Opiate, which will be added very soon.\n\r\nAll his APC stuff, minus emotive, which will be added very soon.\n\r\nAnd as soon as his Puscifer stuff comes out, expect it to be added as well.\n\r\nIf you see any lyric or line that you feel is not what you think it should be, please feel free to email me @ magiclessmarker@maynardslyrics.com\n\r\n-magiclessmarker.\t\t\t\t\n\t\t\t\t\n\n", "comment_321": "\nTREXOR is a homo fo sho\t\t\t\t\n\t\t\t\t\n\n", "comment_322": "\ni love this song, but the radio stations are killing it! they play it several times a day where i live\t\t\t\t\n\t\t\t\t\n\n", "comment_323": "\nHow can you listen to this song and dislike it? It's so well written and actually has thought and time put into it.\t\t\t\t\n\t\t\t\t\n\n", "comment_324": "\nTREXOR sounds like he's full of teenage angst.  He needs forii like this to vent his hormonal anger.\t\t\t\t\n\t\t\t\t\n\n", "comment_325": "\nWell I might as well add my 2 cents hear as well\n\r\nI read about 7 pages of this posts and I didnâ\u0080\u0099t see any one answer the â\u0080\u009c muddy watersâ\u0080\u009d, and the â\u0080\u009c Rob the grave to snow the cradleâ\u0080\u009d lines\n\r\nIf the answer was giving in the last 7 pages I didnâ\u0080\u0099t read.. sorry for posting this.\n\r\nIâ\u0080\u0099m a little older and I have heard the term used many time other than in this song.\n\r\nTo Muddy the waters is a term that means to blind you from seeing the truth.\r\nExample â\u0080\u009c if you to turn the water in a river  / stream the mud would stir up and you couldnâ\u0080\u0099t see the bottom where the truth lies. \n\r\nWell the term â\u0080\u009cSnowâ\u0080\u009d in 80â\u0080\u0099s meant Cocaine I donâ\u0080\u0099t think that what he means here. \n\r\nTo Snow someone it to fool them or lie to themâ\u0080\u009d like pulling the wool over someoneâ\u0080\u0099s eyesâ\u0080\u009d.\r\nRobbing the past to Snow the cradle is â\u0080\u009ctaking ideas for the past to lie to the featureâ\u0080\u009d. The Cradle is a symbol of our youth.\n\r\nHope I made a little since in my post\t\t\t\t\n\t\t\t\t\n\n", "comment_326": "\nI think people are reading far too much into this song.\n\r\nIt's basically a shot at a person, probably a political leader, probably Bush. that he believes is a hypocrite whose lies are not only numerous, but quite obvious and unbelievable yet the he never owns up to it and admits he lied.  Basically the liberals opinion regarding Bush and Iraq.\n\r\n\"eyeball ... raised the dead\" = Laying on the B.S. so thick it's up to his eyes and so obvious and unbelievable that it \"practically raised the dead\"\n\r\nBlack Kettle = Strongly doubt it has anything to do with the chief and more the saying of calling the kettle black.\n\r\nKangaroo Court = More than likely the current situation regarding \"enemy combatants\" which leads me to believe that black kettle was referring the saying.\n\r\nAnd as for marijuana, the only connection is the title and that's only coincidental.\t\t\t\t\n\t\t\t\t\n\n", "comment_327": "\nYou must be they guy everyone seems to hate. It's become apparent to me that they only like you because you aren't afraid to speak your mind, and you actually have the ability to use it. Jealousy maybe, or just the human dislike for change. I don't really know. Perhaps they just need someone to vent on. Come, look at these people, most of them are fucking idiots. We may have been the stronger in the past, but we have since halted, degenerated even, our evolution and stunted our growth. In our current state, humans are veering more from their potential and more towards oblivion.\n\r\nBut your conception that everything is defined by nothingness, death, nonexistance, etc. is weak; it holds no bars. Death only applies to that which is, has, or may live. Nothingness is simply space without mass. Nonexistance... it explains itself.\n\r\nHow do you define strength? Simply physical strength, or strength of the mind? Or a combination of the two? Or something more? \n\r\nDoes it however matter? Things will always go one way then shift to another. Reality is reflexive to perspective. Good, evil, dogma, reason, all based on human perspectives.\n\r\nWho the fuck knows if it is miracle or not, who the fuck cares. It happened, and as a conscious, sentient, and rational being, we are programmed to deny it to the end of the existence, even if existence doesn't exist.\t\t\t\t\n\t\t\t\t\n\n", "comment_328": "\nThanks, despite the typos I made.\n\r\nI just have one question. I ask you this purely for the pursuit of knowledge, in a curious voice, not in an angered or prying one.\n\r\nWhy do you hate tool so much?  \n\r\n^ Left a broad question so you could answer as you see fit.\t\t\t\t\n\t\t\t\t\n\n", "comment_329": "\nTREXOR you are a... i can't think of a strong enough word\t\t\t\t\n\t\t\t\t\n\n", "comment_330": "\nMayard writes lyrics which are challenging and which makes people think. People who are smart enough to figure these things out, are also smart enough to doubt them.\t\t\t\t\n\t\t\t\t\n\n", "comment_331": "\nThe Pot Calling The Kettle Black ( to say something about someone else which is actually true of you yourself ... )\t\t\t\t\n\t\t\t\t\n\n", "comment_332": "\nWhy is everyone refering the song to marijuana? \"The pot\" is as in the saying \"the pot calling the kettle back...\".\t\t\t\t\n\t\t\t\t\n\n", "comment_333": "\nLol TREXOR. I laughed =D\t\t\t\t\n\t\t\t\t\n\n", "comment_334": "\nI don't believe anyone is really glorifying tool or Maynard. Maybe some people here basically worship him, who cares? If it really offends you then maybe you should just step back and think about this for a second, why does it offend you? Why do you care SO much about something so small as a band or a singer? This is just an open discussion for fans of the band and the song, a chance to throw ideas off each other to maybe expand each others deciphering of the songs and Maynard. Now people may be praising you for your thoughts on how tool and Maynard are hypocrites and donâ\u0080\u0099t deserve the love that they get from their fans, should you not be praised then? cuz in fact you believe tool should not be praised for their thoughts and hypocrites....if you think about it, everyone is a hypocrite, no matter what kind of person you are. So in all actuality, you donâ\u0080\u0099t want to be praised for your thoughts of tool? Our thoughts may not be the same on Tool (or anything else for that matter), but I do believe in the right for people to speak their minds. So this is not supposed to be a diss to you guys in any way, and this is not supposed to be my chance for people to talk about me. Iâ\u0080\u0099m simply saying everyone has an opinion so let people say what they want; we donâ\u0080\u0099t have to put down people for having faith or not having faith. To each his/her own.\r\nI am a fan of Tool, and I can see how people may not like Tool or Maynard for that matter. He is a hypocrite; I think he basically is admitting this in their latest album. I appreciate his work and his openness in his songs. It lets and makes people think at the same time. I mean how often do songs now days that make you actually THINK. Their songs might not be catchy at times, even plane pointless at times; at the same time however, they spark interest in people. Their songs are metaphors to me that may be interrupted different to some and that in fact are why people believe they are so great (my thoughts). So in a way people shouldnâ\u0080\u0099t be mad at you for saying Tool is bad, they should be thanking you for your insight on the topic, so thank you\t\t\t\t\n\t\t\t\t\n\n", "comment_335": "\nOk this song is about  court rooms called kangaroo courts which were rigged and all a scheme to get drug addicts in jail\t\t\t\t\n\t\t\t\t\n\n", "comment_336": "\nSome of this seems to be about blind hypocrisy, but the main message of the song is about marijuana and its effects. 'Weeping shades of cozened indigo' is obviously a reference to the dark circles beneath the eyes of many regular stoners. 'got lemon juice in your eye' clearly means the red bloodshot qualities that many stoners display in their eyes. It's weird cos Tool are reputed to be major stoners, but this song is obviously a description of the way weed makes people turn in the end. Having been a regular heavy stoner for much of my high-school and early college life before quitting, I can see where they're coming from.\t\t\t\t\n\t\t\t\t\n\n", "comment_337": "\nThis song is about cooking beef stroganoff , or as my friend Randy calls it, \"beef stroke-n-off\".\t\t\t\t\n\t\t\t\t\n\n", "comment_338": "\nSome people say how this song is really about drugs and what not. C'mon, think about it...When has Tool EVER address something directly in their songs. The drugs are just symbols along with all the other things in the song. That's just my thought, you think that it's about marijuana? Fine, np.\t\t\t\t\n\t\t\t\t\n\n", "comment_339": "\nDid someone all ready ask/answer this -- sorry then. What does the line \"rob the grave to snow the cradle\" mean?\t\t\t\t\n\t\t\t\t\n\n", "comment_340": "\nIm not sure but beef stroke-n-off\r\nsounds delicious++\t\t\t\t\n\t\t\t\t\n\n", "comment_341": "\nhe said he was going to be obvious on this album. and i think this song is  about the iraq war. the house of cards reference,(sadaam was the ace of spades,chemical ali...), the boy is george bush, the cozened indigo is false enlightenment(acting like you know better, like the americans)and then copping in the eye(we all know theyre pretty fucked now) being trapped, and the kangaroo court( did saddam really ever have a chance, whether he deserved it or not isnt the point) being a hypocrite( america has more wmds than anyone) and then changing why they invaded(beg,steal, borrow reefer save your shady inference. its all there, dont have to look too far into this one, or  all the other songs on the album bar jambi, i mean that one might be obvious too i just havn't figured it out yet\t\t\t\t\n\t\t\t\t\n\n", "comment_342": "\nby TREXOR on 04-28-2006 @ 12:02:10 PM\r\ni wouldn't recommend going around treating every 19 year old like they're below you or are incapable of understanding a song because they haven't been listening to the band since it started(and sucked)\t\t\t\t\n\t\t\t\t\n\n", "comment_343": "\nAh ha ha ha \r\nthat was a waste of time\t\t\t\t\n\t\t\t\t\n\n", "comment_344": "\nWho cares what that faggot TREXOR thinks?  He listens to madonna and fall out boy.  Just look at his stupid myspace page.  Haha, retard.\n\r\nThis song is about the Rush Limbaughs across this \"great\" nation of ours.\t\t\t\t\n\t\t\t\t\n\n", "comment_345": "\nWho are you to wave your finger?\r\nYou Musta been out your head.\r\nI hold deep in muddy waters,\r\nYou practically raised the dead.\r\nRob the grave to snow the cradle,\r\nand burn the evidence down.\r\nSoap box house of cards and glass\r\nso don't go tossin' your stones 'round.\n\r\nYou musta been, high.\r\nYou musta been, high.\r\nYou musta been!\n\r\nFoot in mouth and head up asshole,\r\nwhat you talking 'bout?\r\nDifficult and dance 'round this one,\r\ntill you pull it out, boy.\n\r\nYou musta been, so high.\r\nYou musta been, so high!\n\r\nSteal, Borrow, Refer, save your shady inference.\r\nKangaroo done hung the jury, with the innocent.\n\r\nNow you're weeping shades of cozened indigo,\r\ngot lemon juice up in your, eye!\r\nWhen you pissed all over my black kettle.\n\r\nYou musta been, high, high.\r\nYou musta been, high, high!\n\r\nWho are you to wave your fingers, so full of it.\n\r\nEye balls deep in muddy waters, fuckin' hypocrite.\n\r\nLiar, lawyer, mirror show me, what's the difference?\n\r\nKangaroo done hung the guilty with the innocent.\n\r\nNOW, you're weeping shades of cozened indigo,\r\ngot lemon juice up in your, eye, EYE!\r\nWhen you pissed all over my black kettle.\n\r\nYou musta been.\n\r\nSo who are you to wave your finger?\r\nWho are you to wave your fatty fingers at me?\r\nYou must have been out your mind.\n\r\nWeepin shades of indigo.\r\nTrapped without a reason,\r\nweeping shades of indigo.\n\r\nLiar, lawyer, mirror for you,\r\nwhat's the difference?\r\nKangaroo be stoned,\r\nhe's guilty as the government.\n\r\nNOW, you weep and chase the chosen indigo.\r\nGot lemon juice up in your, EYE!\r\nNow when you pissed all over my black kettle.\n\r\nYou musta been,\r\nhigh, high, high, high!\r\nEyeballs deep in bloody waters.\r\nEyeballs deep in muddy waters.\n\r\nGanja please, you musta have been out your MIND!\t\t\t\t\n\t\t\t\t\n\n", "comment_346": "\nI have to agree with nonetospeakof.\r\nI think it is just about hypocrits, not stoners..lol. My god if you even say the word high in a song it means your talking about drugz! Come on people.\r\nWho are you to call the kettle black!\r\nThe POT\n\r\nThough it is refrencing ganja, we all know tool makes us think, and usually has multiple meaning to the songs!\t\t\t\t\n\t\t\t\t\n\n", "comment_347": "\nThis song is about how much of an idiot George Bush is to enter the Iraq war, because he must've been high to do that.  \"Eye-balls deep in muddy waters\" is a reference to the Pete Seeger song \"Waist deep in the big muddy\", where the message of that song is that a different president started a war that never seemed like it wouldnever end, but keeps telling everyone to continue on with it (sound familiar?).\t\t\t\t\n\t\t\t\t\n\n", "comment_348": "\nDygear, i'm not usually one to criticize, but there is no way that you nailed the lyrics.\n\r\nPeople tend to not realize what Kangarooing is.  Through my ideas, it is when a cop spends his time arresting potheads, and getting them sent to jail without a fair jury trial.  He also arrests other people and calls them potheads because the judge will usually take the side of the cop over everyone else, not needing a jury.  The juduicial system is fucking over all of those who are either not hurting others, or didn't even do anything, when they should be working on real crimes.\t\t\t\t\n\t\t\t\t\n\n", "comment_349": "\nyou know how it says \"Weepin shades of indigo.\"\n\r\nwell indigo is basically purple and purple is a strain of pot\n\r\nalso know as purp\n\r\niunno if it has anything at to do with it, it goes with the title\t\t\t\t\n\t\t\t\t\n\n", "comment_350": "\nthere is a post somewhere around the web i read while back that part of this songs base might come from an interview in which the interviewer was totally ripping the bands album undertow or lateralus while barely giving them a fighting chance or answering his questions as if he didn't want to be outsmarted. it said that on his breath they smealt alchohol and his eyes seemed dialated.\t\t\t\t\n\t\t\t\t\n\n", "comment_351": "\nI find this very interesting; the line 'eyeball's deep in muddy water' actually coincides with the Black Kettle aspect of the song's meaning. General Custard, after raiding Black Kettle's village, reported that his army's horses trampled over Black Kettle's and his wife's bullet riddled bodies, splattering them with mud. It will never cease to amaze me how intertwined and deep Tool's songs are.\t\t\t\t\n\t\t\t\t\n\n", "comment_352": "\nCan't it just be a combined mixture of Maynard's feelings towards himself and his addicting with pot? I could his open addressing towards his own addiction, and his hypocrisy from doing it.\t\t\t\t\n\t\t\t\t\n\n", "comment_353": "\nobviously about weed but its hard to interpret fully.  kinda like weed itself.  I have no idea what kangaroo done hung the guilty with the innocent could mean.  and are these lyrics all correct?  house of cards and glass so don't go tossin' your stones around. is awesome poetry tho.  its referencing to he that is without sin cast the first stone from the bible and its saying the Government (probably)  cant take control over weed or the walls will crumble on them.\t\t\t\t\n\t\t\t\t\n\n", "comment_354": "\nThis song is so not about pot! it's about the hypocracy of Bush. It;s so clear that it's laughable to think its about pot.\t\t\t\t\n\t\t\t\t\n\n", "comment_355": "\n\"eye hole deep in muddy waters\" - Hurricane Katrina\r\n\"kangaroo done hung the jury with the innocent\" - Abu Ghraib\r\n\"kangaroo done hung the guilty with the innocent\" -\r\nGitmo\r\n\"Cozened Indigo\" - lieing for a cause \r\nBush arrested for cocaine possession and drunk driving - mysteriously the evidence gone\r\n\"the pot\" calling the kettle black = Hypocrite\r\nWhole song = about hypocrisy\r\n\"Ganja? puleeeze!, you must have been outta your mind\" = if you think I'm talking about pot, you're crazy.\t\t\t\t\n\t\t\t\t\n\n", "comment_356": "\nsince my idea comes last i dont think many people will read it but ill give it a try... also i appologize for my spelling. what i dont like is that people \"dog\" on those who smoke weed whats up with that man? weed or shall i say canabis sativia was only made illegal because of the cotton gin hemp is a more stronger fiber than cotton fibers. whats so bad about smoking a little herb huh? what the song is really about aside from black kettle and hypocracy is NOT TO JUDGE OTHER PEOPLE...\t\t\t\t\n\t\t\t\t\n\n", "comment_357": "\njust because i smoke weed makes me a bad person? i lie because i smoke? no i dont not because i smoke! stop judging people man im getting sick and tired of it! oh hes black so he must rob and must be a gangster NO hes black so he must be human ya thats right hes human!! if your going to judge people do it based on who they are inside not what they look like\t\t\t\t\n\t\t\t\t\n\n", "comment_358": "\ni hate how people screw up the US because they are ignorant why dont u look up whats goimg on today i.e. project gardenplot also known as rex84 over 800 concentration camps exist in the US to round up people like me nonconformists project paperclip the US brought german generals (who tortured jews) into our country with no trails against their hellish actions same with project deepwater (only they were scientists) open your eyes people dont point your fatty fingers at me point it at the real wrong doers\t\t\t\t\n\t\t\t\t\n\n", "comment_359": "\nthe world today makes me sad... we all are ciphers\t\t\t\t\n\t\t\t\t\n\n", "comment_360": "\nu cant get addicted to pot thats like saying \"im addicted to eating steak tetrahydrocanibinol (thc) has no addictive properties i study every \"drug\" befor i do that \"drug\"\t\t\t\t\n\t\t\t\t\n\n", "comment_361": "\nfirst off, i hope TREXOR gets hit by an airplane.\r\nsecondly, this is only loosly about weed. its more about the legal bullshit that goes on around drug issues. teh kangaroo is a reference to teh kangaroo courts that were used to falsly or unfairly charge people with drug convictions.\r\nthirdly, i still hope TREXOR gets throat-fucked by a plane.\t\t\t\t\n\t\t\t\t\n\n", "comment_362": "\nfirst of all, the kangaroo refers to kangaroo courts that are like mock trials that are unjust based on biased accusations.\r\nthe soapbox house of cards and glass is explaining how society is like a soapbox house of cards or glass meaning fragile or easy to break or delicate so dont toss your stones around\r\ni think stones are accusations that are not proven that could break society\r\ndrug dealer, lawyer, or mirror (you), are all liar so what's the differance\r\nso there is no right for you to be a fucking hypocrite\r\nyou musta been so high that you couldnt see that everyone is the same inside\r\nto say\r\ncalling the kettle black = hypocrisy\n\r\nthats all i got\n\n\r\n:P\t\t\t\t\n\t\t\t\t\n\n", "comment_363": "\nwhat does the line  \"now you're weeping shades of cozened indigo\" mean i know cozened means false or fake but why indigo\t\t\t\t\n\t\t\t\t\n\n", "comment_364": "\nIndigo's color spectrum is between 420 and 450nm wavelengths, I always assumed cozen was a color of indigo that was closer to 420.   check out indigo spectrum on wikipedia\t\t\t\t\n\t\t\t\t\n\n", "comment_365": "\nganja_mon, you're a fucking retard. Don't come in here acting like some fucking doctor and you're the god of drugs. EVERYTHING and ANYTHING can be addictive, your mind adapts. Just because it doesn't have an active agent to physically keep you addicted like a cigarette does (which only effects certain people anyways), doesn't mean its not addictive. You can be an addict to anything mentally, and it have just the same effects, such as withdrawals. \n\r\nYou can be addicted to chewing on the cap of a pen. Stop acting like you're some fucking god of drugs.\n\r\nDumbshit.\t\t\t\t\n\t\t\t\t\n\n", "comment_366": "\nAnd are you guys retarded? The song is about Rush Limbough.\t\t\t\t\n\t\t\t\t\n\n", "comment_367": "\nI heard this song for the first time like almost a year and a half ago and I loved it ever since. It refers to the hypocracy of people who criticize stoners. I mean honestly, I am a stoner. If I wasnt why would my User name be XxLsDxX? I'm a HUGE fan of Tool because most of the shit that they write about I have dealt with in the past. They are a pretty intense band. =]\t\t\t\t\n\t\t\t\t\n\n", "comment_368": "\nThe song Is about when you smoke weed you become made out of cards and glass, easily broken and vulnarable. You get this feeling of muddy water up to your eyeballs. Ganja please means he dosnt do that to himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_369": "\ni heard it's about the police being hipocrytical about drug use.\t\t\t\t\n\t\t\t\t\n\n", "comment_370": "\nOk really TREXOR... there is not a single person who is saying that it is manditory for you to listen to tool... And it   is just pathetic that you have to go dissing \"stoners.\" If you ask me, everyone should be a stoner, or at least have a stoner friend... imagine how peaceful the world would me! \n\n\r\n--Make all of America like Denver!\t\t\t\t\n\t\t\t\t\n\n", "comment_371": "\nYou know guys, maybe its not about one specific thing like you guys are trying to find, maybe it is just general feelings and metaphors that everyone can relate to in their own way.\t\t\t\t\n\t\t\t\t\n\n", "comment_372": "\nIMO, none of you ladies really has the song right, (and if I'm wrong or you allready has the same opinion forgive me, cuz for God's sakes, I'm not gunna get into an argument over it. It's not worth it, damn it. Some of you allready had the title figured out, but it doesn't have anything to do with actual pot, but it kinda does. I haven't heard every single tool song, and I've just really gotten into them, and now they're my favorite band, so, once again, I appologise if I'm wrong. I'm probably not right, but I think he use to be on drugs, as most of the sculptors for any movies are, and his wife/girlfriend had gotten pregnant, and gave him the choice to get clean. He took the latter, and when he came back from rehab he realised his girlfriend/wife was on the same garbage. Maybe I'm wrong (probably am) but that's what I think. And, as in past songs, I think he hints at Budah religion here. Something about \"eye hole deep in muddy water\", I think the Budhists try to stay out of \"muddy water\". But back on the kid subject. Kangaroo court could be him trying to tell family/friends that she's dirty, but they know he was on it too, so they don't believe him. She obviously would have been a hippocrate. There's also a few verses in the song \"Vicarious\", where he refers to himself as a monster in somebody's light, and a few verses saying \"why can't we just admit it?\", \"La la la la la lie\", and I think the word Vicarious means watching from a different eye, or something like that. Oh, and the lyrics are far from right.\t\t\t\t\n\t\t\t\t\n\n", "comment_373": "\nIMO, none of you ladies really has the song right, (and if I'm wrong or you allready has the same opinion forgive me, cuz for God's sakes, I'm not gunna get into an argument over it. It's not worth it, damn it. Some of you allready had the title figured out, but it doesn't have anything to do with actual pot, but it kinda does. I haven't heard every single tool song, and I've just really gotten into them, and now they're my favorite band, so, once again, I appologise if I'm wrong. I'm probably not right, but I think he use to be on drugs, as most of the sculptors for any movies are, and his wife/girlfriend had gotten pregnant, and gave him the choice to get clean. He took the latter, and when he came back from rehab he realised his girlfriend/wife was on the same garbage. Maybe I'm wrong (probably am) but that's what I think. And, as in past songs, I think he hints at Budah religion here. Something about \"eye hole deep in muddy water\", I think the Budhists try to stay out of \"muddy water\". But back on the kid subject. Kangaroo court could be him trying to tell family/friends that she's dirty, but they know he was on it too, so they don't believe him. She obviously would have been a hippocrate. There's also a few verses in the song \"Vicarious\", where he refers to himself as a monster in somebody's light, and a few verses saying \"why can't we just admit it?\", \"La la la la la lie\", and I think the word Vicarious means watching from a different eye, or something like that. Oh, and the lyrics are far from right.\t\t\t\t\n\t\t\t\t\n\n", "comment_374": "\nGanga, I live in a town where half the population are Somalians and Mexicans, and I'm as anti gangster and pot as they come, but I'm still friends with half of them! And guess what?! Three quarters of them are clean! You're the freakin hippocrate, who are You to wave your finger, you musta been out your head. Oh, and TREXOR, they mixed up my address with mine, and I got your vibrator by mistake. How the hell do you shut this thing off?!\t\t\t\t\n\t\t\t\t\n\n", "comment_375": "\nCrap, that joke went wrong, its your address, not mine. I have coming whatever comes.\t\t\t\t\n\t\t\t\t\n\n", "comment_376": "\nIn my interpretation, it's a song for people who are trying to make sense of things, and blame someone else for their problems but fail to take responsibility for their life. \t\t\t\t\n\t\t\t\t\n\n", "comment_377": "\nIt sucks that many people get this meaning wrong. The song is about hypocrisy. Sure the song is called \" The Pot \" and it says stuff about being high. This song has possibly nothing to do with drugs. You've got to understand Maynard's writing style in order to get the meaning out of it. As young as I am, it's kind of bad that older people who I think would get the meaning to this don't.....Great song though.\t\t\t\t\n\t\t\t\t\n\n", "comment_378": "\nIt has to do with drugs, but it's about hypocrisy... Judging by all the cliches about hypocrisy in it... The Pot calling the kettle black, throwing stones in glass houses, etc.\n\r\n\"When you pissed all over my black kettle, you musta been high\"\n\r\nThis is a kind of funny/ironic accusation, like the homosexual calling the homophobe \"gay\" to express disgust, etc. In other words, some of the doctrine of the anti-drug people is so ridiculous, they must have been high to come up with it.\n\n\r\n\"fucktoids\"\r\nROTFLMAO!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_379": "\nheheheheheheheheh this song makes me happy. heheheheh his voice makes me smile. hehehehehe. \t\t\t\t\n\t\t\t\t\n\n", "comment_380": "\nacctually this song is about hypocrisy, like the pot calling the kettle black and such. However it is TOOL wich causes many different theories. Everyone has their own opinion \t\t\t\t\n\t\t\t\t\n\n", "comment_381": "\n\"liar, lawyer, mirror show me what's the difference?\" is the best sounding line ever. I love how it  plays with the \"l\" and \"r\" sounds.\t\t\t\t\n\t\t\t\t\n\n", "comment_382": "\nThis is awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_383": "\nThis not my favorite tool song but its still great.\t\t\t\t\n\t\t\t\t\n\n", "comment_384": "\njust listen to me. it's about people being hypocrite's. such as the lawyer vs the mirror...i mean cocaine... duh? get with me its about how people talk shit and do the same stuff that they talk about and supposively dont do. thank you. its about all drugs in a whole.\t\t\t\t\n\t\t\t\t\n\n", "comment_385": "\nI Love this fucking song. It reminds me of my Auntie Rachelle getting high on dope. Also it reminds me of the 1998 film \"Half Baked\" starring Dave Chappelle.\t\t\t\t\n\t\t\t\t\n\n", "comment_386": "\nI know that some people will disagree so i apologise in advance for pissing anyone off, but i don't think that this song is about weed. Have you ever heard the term 'the melting pot' refering to america? well, i think this song is about 'The Pots' former president bush. \"who are you to wave your finger\" cuz bush is an idiot. same with \"you must have been outta your mind.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_387": "\nReminds me of Hurricane Katrina\n\n\n", "comment_388": "\nThe line \"rob the grave to snow the cradle then burn the evidence down\" has just completely got my mind all tangled up with several thousand meanings...research has led me down many paths none of which i can completely agree with...anyone have any more suggestions as to what this means? \n\n\n", "comment_389": "\nive noticed the album is divided  into parts part one is the  about  some one being saved religiously and covers first four songs which i call  the judith section,then theres the acid section songs 5-8 dealing with drugs,and the last three the divinity section dealing on what we are seen by of angels and how  we  have grown into what we are now. has anyone else noticed this?\t\t\t\t\n\t\t\t\t\n\n", "comment_390": "\ni dont think that vicarious has anything to do with being saved religiously, razean55, although i respect your opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_391": "\nHere is something fun to try.\n\r\n1. Import the song using a program like Audacity\r\n2. Select the part between 4:10 and 4:20\r\n3. Reverse this part only\r\n4. Change the pitch down a bit\n\r\nYou can hear what sounds like: You rape me in my prison cell. You make me your little bitch.\t\t\t\t\n\t\t\t\t\n\n", "comment_392": "\nas with most tool lyrics these are fairly cryptic\r\nbut i think it has alot to do with all the lies and bullshit revolving around the anti marijuana legislation and all the social attitudes towards cannabis in general\n\r\nthe \"kangaroos\" he keeps talking about i think are the stereotypical potheads who use it irresponsibly or without any awareness of its spiritual aspects \r\n\"kangaroo be stoned he's guilty as the government\" i think is saying that those people are just as much at fault as the lying politicians for the negative taboo on weed in this society \n\r\nand the refrain of you musta been high is like saying \r\nyou say im wrong for smoking weed? you must be fucking HIGH to believe all the bullshit coming out of your mouth none of it makes any sense\n\n\n", "comment_393": "\nThis song is about how marijuana users are typically misjudged just because they consider it to be \"wrong\"\r\n\"Got lemon juice up in your eye\" is a reference to how it feels to have Glaucoma. It will feel like you had, had lemon juice poured into your eye, causing it to burn. \r\nAs for pissing on his black kettle, the saying goes \"the pot calling the kettle black\" Which is referring to common hypocritical comments. \n\r\nWhoever said a majority of people who listen to tool, are stoners, is wrong. \n\n\r\nReally, if people talk shit about stoners, and a stoner knows the points behind this song, then that's pretty sad.\t\t\t\t\n\t\t\t\t\n\n", "comment_394": "\nThe song does necessarily have anything to do with pot. It about hypocrisy and the government telling people that they arenâ\u0080\u0099t allowed to do something even though the government does it too. When he says  â\u0080\u009cliar, lawyer, mirror show me, whatâ\u0080\u0099s the differenceâ\u0080\u009d heâ\u0080\u0099s saying that  people (and lawyers) lie to benefit themselves, not caring if an innocent person is getting punished. When he says â\u0080\u009c you must have been highâ\u0080\u009d heâ\u0080\u0099s not saying that they were high, heâ\u0080\u0099s saying that thereâ\u0080\u0099s no way anyone thinking somewhat rationally could have thought that way. When he says â\u0080\u009cgot lemon juice\r\nup in your eye when you pissed all over my black kettle,â\u0080\u009d heâ\u0080\u0099s obviously not saying anything about glaucoma, heâ\u0080\u0099s saying that you must be blind not to see your own hypocrisy.\n\n\n", "comment_395": "\nI had a realization last night, that the whole album can be viewed from the stance of a monologue/internal monologue dealing with the process of maynard losing his mother.\n\r\n   1. \"Vicarious\" â\u0080\u0094 7:06\r\n[maynard's statement that all people live vicariously through others, not just their violence... but their other emotions... although the song is about peole's hostility being expressed vicariously.. it can also relate to the need of others to \"witness\" the pain of others in order to \"sympathize\" (e.g. false empathy) with others, or to simply justify their own behavior... Maynard is admitting having done this in an earlier part of his life...]\n\r\n   2. \"Jambi\" â\u0080\u0094 7:28\r\n[The understanding, even at the worst possible time... that some things are worth everything... in this case... his mother...]\n\r\n   3. \"Wings for Marie (Pt 1)\" â\u0080\u0094 6:11\r\n[coming to terms with his greif]\n\r\n   4. \"10,000 Days (Wings Pt 2)\" â\u0080\u0094 11:13\r\n[realization that in a just world his mother WOULD go to heaven]\n\r\n   5. \"The Pot\" â\u0080\u0094 6:21\r\n[a conversation with his mother, realizing his own hipocrisy]\n\r\n   6. \"Lipan Conjuring\" â\u0080\u0094 1:11\r\n[spiritual interlude]\n\r\n   7. \"Lost Keys (Blame Hofmann)\" â\u0080\u0094 3:46\r\n[feeling of \"lostness/alienation]\n\r\n   8. \"Rosetta Stoned\" â\u0080\u0094 11:11\r\n[feeling of lostness/alienation/realization]\n\r\n   9. \"Intension\" â\u0080\u0094 7:21\r\n[realization on human nature]\n\r\n  10. \"Right in Two\" â\u0080\u0094 8:55\r\n[realization and confusing/disgust at human nature]\n\r\n  11. \"Viginti Tres\" â\u0080\u0094 5:02\r\n[unknown. there are no lyrics, only a slightly ominous \"instrumental\" what this is, is up in the air... but it feels to me like the whole process for maynard... what his conclusion actually was though, will require alot of analysis... on a lyricless track :p (the only discernable words we could make out were \"The system\" highly distored, near the end.)]\t\t\t\t\n\t\t\t\t\n\n", "comment_396": "\nGanja - marijuana, esp. in the form of a potent preparation used chiefly for smoking.\n\ndictionary.reference.com/browse/…\n\r\nIf I'm not mistaken the kangaroo is a reference to the court trials involving marijuana and how everyone who went in was guilty of all charges. In other words it wasn't a fair trial.\t\t\t\t\n\t\t\t\t\n\n", "comment_397": "\nListen guys you are all fracking idiots, the song's meaning is the clearest bloody thing in the world!\n\r\nJUST WATCH THE FRACKIN FILM CLIP!\n\r\nIt's quite clearly about a poor farmer who can't grow crap!\n\r\nDUH!\t\t\t\t\n\t\t\t\t\n\n", "comment_398": "\n10000 is 30 years. I also was reading that that was how long it took his mother from being diagnosed with cancer to dying from it... The whole albums dedicated to her\t\t\t\t\n\t\t\t\t\n\n", "comment_399": "\nand the hole crop thing is just straight dumn!!! ya tool videios fit so well with there songs (Sarcasm by the way )\t\t\t\t\n\t\t\t\t\n\n", "comment_400": "\nhere is your proof\nmemorialobituaries.com/memorials/…\n\n\n", "comment_401": "\nâ\u0080\u009cJudith Marieâ\u0080\u009d is referenced in the song 10000 days.  and is also a song by a perfect circle\t\t\t\t\n\t\t\t\t\n\n", "comment_402": "\n\r\nJust a few of my takes on the phrases:\n\r\n\"kangaroo done hung the jury with the innocent\"\n\r\nalready been established kangaroo comes from the phrase kangaroo court. so in this phrase, the kangaroo (lawyer, liar, other corrupt higher official) was able to hang the jury (either a literal jury or the average citizen) up (not as in kill, but as in get their attention) on the actual innocent people to get the spotlight off of themselves.\n\r\n\"Now you're weeping shades of cozened indigo\"\n\r\nThe most sensical meaning would be that the subject is a powerful figure (such as laywer, politician, etc.) Indigo is a shade of purple and purple is a royal color. Cozened means deceitful. So they are using their power for deceit and corruption and now they are dealing with the consequences (assuming they are uncovered). Maynard is humurously suggesting an excuse for their 'weeping' as being a result of getting lemon juice in their eyes. He takes the analogy further suggesting it was from (literally speaking) pissing on the kettle (piss = lemon juice in this case) which is also an analogy in itself tying the song together.\n\n\r\nA more experimental view on it would be that the hyprocrite has to live with the changes that are set forth due to the 'cozened indigo' putting the spotlight on far more innocent crimes (illegalizing drugs). An indigo is someone who has qualities that are generally used for changing the world for the better. Cozened is being deceitful. So someone who can change the world for the better because of their gifts (being born into power, wealth, etc) turned deceitful and instead used their power for hiding their own crimes. So it would be \"now you're living with the consequences of using your power for wrongdoings and being a deceitful figure.\"\n\r\n\"Rob the grave to snow the cradle\r\nThen burn the evidence down\r\nSoapbox house of cards and glass so\r\nDon't go tossin' your stones around\"\n\r\nRob the grave as in take advantage of the helpless. Still assuming the subject is a person of power, they can easily take advantage of someone of less wealth for their own benefit. To snow the cradle meaning basically pay off theirself.\t\t\t\t\n\t\t\t\t\n\n", "comment_403": "\nIt might be (at least partially) about rock critics (specifically Rolling Stone).\r\nThink about it: he could've said \"muddy water\", but he said \"muddy waterS\"...\nen.wikipedia.org/wiki/…\r\nMuddy Waters wrote a little ditty that inspired the names of both a very famous and influential band AND an immensely popular, influential, and probably biased rock magazine: en.wikipedia.org/wiki/….\r\nThe references to pot are a double entendre, yes (the pot calling the kettle black), but who smokes pot more than hippies? And who started Rolling Stone?\r\nThe critics in Rolling Stone Magazine are often said to be biased toward earlier rock artists; this justifies the lines \"You practically raised the dead\" and \"Rob the grave to snow the cradle\".\r\nAny other thoughts?\t\t\t\t\n\t\t\t\t\n\n", "comment_404": "\nI think the song is about general hypocrisy. I think the writer intentionally invokes anti-drug hypocrisy theme to give people somewhere to start. But I agree with anyone who says thats not all that the song is about. Anti-drug rhetoric is just the most glaring hypocrisy in the USA.\t\t\t\t\n\t\t\t\t\n\n", "comment_405": "\ndid u know ratm's guitarist started out in a band with tool's vocallist   they called their band the electric sheep \t\t\t\t\n\t\t\t\t\n\n", "comment_406": "\nAfter reading the lyrics to this song I can clearly see that when it comes down to it...this song is about Hypocrits! plain & simple. U can use it on any aspect...\t\t\t\t\n\t\t\t\t\n\n", "comment_407": "\nIt's actually about Cambodia President Pol Pot, who killed MILLIONS of people who were educated (Doctors, Laywers, etc.) \"EyeHole Deep in muddy water\" refers to the mass burials, etc. You get the point. Read about him at moreorless.au.com/killers/…\n\n\n", "comment_408": "\nganja = pot = marijuana\t\t\t\t\n\t\t\t\t\n\n", "comment_409": "\nThink i just cracked the song names meaning. \n\r\nThe song is named the pot because of both drugs and more importantly, There Is an old Idiom about the pot calling the kettle black\n\r\nthe pot is sooty (being placed on a fire), while the kettle is clean and shiny (being placed on coals only), and hence when the pot accuses the kettle of being black, it is the potâ\u0080\u0099s own sooty reflection that it sees: the pot accuses the kettle of a fault that only the pot has, rather than one that they share.\n\r\nmakes sense in 2 different ways and i wouldnt doubt tool when it comes to 2 sided lyrics\n\nen.wikipedia.org/wiki/…\n\n\n", "comment_410": "\nI Think that everybody has the meaning of the song completly wrong. In the holocaust the death camps were often referred to as \"Death Pots\". I think the song is about how nobody cares about all the christian crusades, and the killing of the jews, but when the holocaust gets mentioned, everybody gets weepy eyed and senssitive.\n\r\n\"Eyeball deep in muddy waters\" Would bee referring to the mud trenches nazis would dead jews.\r\n\"Burn the evidence\" Would be referring to the live cremations of jews\r\nAll the mentionings of Hypocrites would be a reference to how everybody only cares about the holocaust. \"Who are you to wave your finger\" Would refer to how everybody only blaming Hitler for anti-semitism\n\r\nSo the song is about the Hypocrisy of people hating Hitler, when their own religion (Christianity) killed more jews then Hitler ever could, In a sense a Pro-Athiesm song.\n\r\nAtleast that's how I see it.\t\t\t\t\n\t\t\t\t\n\n", "comment_411": "\nOK, i heard maynard say in an interview, this song os about a TOOL fan who critisized him(maynard)for apparently losing his edge in his lyrical quality. He wrote this song as an angry response, sure it may not stay on that the whole song, but that is DEFFINETLY where it comes from. Maynard may or may not smoke pot, but he does not make a habit of overtly writing about drugs, although i realize some songs are references. Listen to the OPIATE album, at the begining of the live track, MATNARD says somethin like \"yea, him, right there, get that Bob Marley looking wanna be motherfucker outtahere\", so i doubt maynard is pro smoking up all the time. they were big fans of bill hicks who was a big promoter of hallucinogens. but as for the name of the song, it simpily is a shortened version of the pot calling the kettle black.\t\t\t\t\n\t\t\t\t\n\n", "comment_412": "\nhey\t\t\t\t\n\t\t\t\t\n\n", "comment_413": "\nI'm not sure if I'm right, but here's my two cents:\n\r\nI think it's about how the government bans pot. But behind closed doors, they smoke it themselves, and Tool is calling them hypocrites because they do exactly what they made illegal. And they're saying that the government \"must've been high\" when they decided to make what they use illegal. And \"Who are you to wave your finger?\" sort of sums it up, \"Why are law officials pointing their fatty fingers at us? They do the same stuff.\" And \"Kangaroo be stoned; he's as guilty as the government\" sounds like the kangaroo (kangaroo being used as a figure of speech) gets 'stoned' like the government and that makes the kangaroo just as guilty as the government officials that get stoned. And the \"muddy water\" is what color pot is in water: dark brown? I dunno, I've heard that somewhere. And the \"lemon juice\" part talks about how the government is blind, as it's hard to see with lemon juice in your eyes.\n\r\nI might not be right, I'm honestly not sure if I am myself... but I'd love to hear if I'm even close. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_414": "\nThis song is clearly about hypocrisy, for example the references:\r\n\tThe pot calling the kettle black\r\n\tPeople in glass houses shouldnâ\u0080\u0099t throw stones\r\n\tF_____ hypocrites (couldnâ\u0080\u0099t get any more obvious than that)\r\n\tReference to said hypocrite urinating on those whom he criticizes while urinating in his own eye (symbolic of his supposed clear vision of the subject, some hear â\u0080\u0098high eyeâ\u0080\u0099 as well even more hypocritical)\n\r\nThe subject of hypocrisy appears to be about legalization of drugs esp. marijuana, but perhaps symbolic, the opium of the people.  Ex: the Pot (common name for marijuana), â\u0080\u0098you must have beenâ\u0080¦highâ\u0080\u0099 Ironic, no? MJK says.\n\r\nI hear people use the term hypocrite in at least two senses:\r\n1.\tSomeone who doesnâ\u0080\u0099t live up to their professed standards 100% of the time\r\n2.\tSomeone pretending to be something they are not, esp in regards to morals/ ethics\n\r\nIn the case of 1., is any one willing to say that they are PERFECT?  If Maynard is using the term as 1. then he is also a hypocrite, imperfect like the rest of us. And when fellow hypocrites CALL OUT fellow hypocrites (our â\u0080\u0098scarlet lettermenâ\u0080\u0099) for being hypocritical, then they are DOUBLE hypocrites. And worthy of being dismissed. Or, he is saying he is PERFECT.  Call for the straight jacket. Or more dope.\n\r\nIn the case of 2. the song would have to be referring to someone who is smoking pot/continuing to use, at the same time, working and preaching against its legalization.  If so, then itâ\u0080\u0099s time to start naming names, not just broad-sweeping generalizations that amount to windmill-jousting and straw-man beating.  \r\nI have never used and am sure there are others likewise. \n\r\nIf Maynard is attacking those who oppose marijuana legalization, yet who have not used, or not currently using the drug, how can he call them a â\u0080\u0098hypocriteâ\u0080\u0099 in the sense of meaning 2? He cannot. It is merely name-calling and scores 0 (zero) in the debate.  If he reverts to meaning 1., he is a double hypocrite, again worthy of dismissing.\n\r\nTo conclude, Maynard presupposes Christianity when  he evokes â\u0080\u0098hypocriteâ\u0080\u0099 accusation, all the while denying Christianity.  In an evolutionary worldview, there is no way to account for the concept â\u0080\u0098hypocriteâ\u0080\u0099 on its own mechanisms.  It is parasitic by necessity.  I am a biology major, please outline the process for me from the beginning, macro or micro level.\n\r\nAges ago, when Tool toured preaching, â\u0080\u009cQuestion Authority!â\u0080\u009d, why didnâ\u0080\u0099t someone get in their face and ask, â\u0080\u009cSays who? Who are YOU to tell ME what to do, what to question?! You are putting yourself in a position of AUTHORITY when you tell me to do that, you [expletive] hypocrite.â\u0080\u009d\n\r\n(Hypocrisy in the Christian church is indeed a problem, but beyond the discussion of this song. If I explained it to you, you most likely would want to deny the reality of the problem, for admitting it, would be more than you would accept.)\n\r\nIt is a crying shame, such talented musicians, giving glory to themselves instead of the triune God who gave them such gifts.   \t\t\t\t\n\t\t\t\t\n\n", "comment_415": "\nthis song is obviosly about maynard getting a rimjob and craping on his girlfriend\t\t\t\t\n\t\t\t\t\n\n", "comment_416": "\nHey, so I seem to have a different take on it than all here.. \n\r\nI believe it is about hypocrisy in government, and also in marijuana trials. not \"stoners\" themselves. \n\r\n\"kangaroo done hung the juror with the innocent\"\r\n\"kangaroo done hung the guilty with the innocent\"\r\n\"kangaroo be stoned he's guilty as the government\"\n\r\nalso: \r\n\"liar, lawyer, mirror show me, what's the difference?\"\n\r\nthese all refer to \"kangaroo courts\" where the jury decide on the outcome of the trial before it ever happens. (does anyone remember To Kill a Mocking Bird? That's a kangaroo court. and a well known kangaroo trial was over marijuana. that's a start. and evidence was found that they smoked it themselves.\n\r\nthat's where \"you pissed all over my black kettle, you must have been so high\" comes in. it's referring to the reference \"the pot calling the kettle black\" that going back to the title \"the pot\" too. and \"you must have been so high\" referring to the trial/kangaroo courts.\n\r\nI could probably go on forever about this song! haha. but I think I've ranted enough on it. Well, this is my take on some of this song!\r\nProbably one of my favorite songs ever. the amount of meaning, and how well written in it was. blows my mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_417": "\nWow I can't believe all you guys listen to list and don't know the true meaning. This song is towards something called Kangaroo courts. Kangaroo courts are BOGUS courts in which the judge and others already consider the accused to be guilty before they get a fair trial. These trials have been known to involve pot smokers/dealers, military, robbery, etc. How can they wave their fingers at me for breaking the law when they are doing the same by not giving me a fair trial? \"Liar, lawyer; mirror show me, what's the difference?\"\n\n\n\n\n\n\n", "comment_418": "\nI think this song is about how people that use marijuana don't know exactly what is happening and then resort to \"borrowing\" or in other words stealing. I think it also means that people that use marijuana also don't know what they are talking about and are usually hypocrites all the time.\t\t\t\t\n\t\t\t\t\n\n", "comment_419": "\nIt's about the corrupted legal system. By \"kettle\", he means \"Cadilac\". He is describing a prosisure where a wealthy man suiting a poor man, even-tho he knows he'll take away all that that man has, for urinating on his expensive car.\t\t\t\t\n\t\t\t\t\n\n", "comment_420": "\nI think it's about our shady ass government trying to control everything by deceit.  \t\t\t\t\n\t\t\t\t\n\n", "comment_421": "\nWho are you to wave your finger?\r\nYou must have been outta your head\r\nEye hole deep in muddy waters\r\nYou practically raised the dead\r\n- obviously the person he's talking to is a hypocrite. and the person is getting themselves into deeper shit than they can deal with\n\r\nRob the grave to snow the cradle\r\nThen burn the evidence down\r\nSoapbox house of cards and glass so\r\nDon't go tossin' your stones around\r\n- the person is trying to cheat himself out of something. and when they mention the \"soapbox house of cards\" it means their lies are easily collapsible and they can easily be found out. and the \"glass so don't go tossin your stones around\" there's a saying that says \"people who live in glass houses shouldn't throw stones\" which they're saying he should be careful because his bullshit will break apart.\n\r\nYou must have been high\r\nYou must have been high\r\nYou must have been...\r\n- the person MUST have been out of their mind to fuck with him (Maynard)\n\r\nFoot in mouth and head up ass-hole\r\nWhatcha talkin' 'bout?\r\nDifficult to dance 'round this one\r\n'til you pull it out, boy\r\n- the person talks a lot of shit and now they can't get out of it\n\r\nYou must have been so high\r\nYou must have been so high\r\n- must have been out of sorts\n\r\nSteal, borrow, refer, save your shady inference\r\nKangaroo done hung the juror with the innocent\r\n-steal, borrow, tomato, tomahto. there's no difference between the two. \"kangaroo done hung the juror with the innocent\" refering to the kangaroo trials and the people the person's criticizing are innocent and didn't do anything wrong\n\r\nNow you're weeping shades of cozened indigo\r\nGot lemon juice up in your eye\r\nWhen you pissed all over my black kettle\r\n- referring to Anja, the 6th chakra, indicating hypocracy and how the person intends to lead people down the wrong path. and there's the saying \"the teapot called the kettle black\" but instead of just being a hypocrite, they blew it out of proportion\n\r\nYou must have been high high\r\nYou must have been high high\r\n--\n\r\nWho are you to wave your finger?\r\nSo full of it\r\nEye balls deep in muddy waters\r\nFuckin' hypocrite\r\n- the person really has no reason to call out because they're just as bad\n\r\nLiar, lawyer; mirror show me, what's the difference?\r\nKangaroo done hung the guilty with the innocent\r\n- lawyers can be liars to get what they want. the mirror part might mean a false personality like what you see in a mirror isn't real exactly. it's just a reflection.\n\r\nNow you're weeping shades of cozened indigo\r\nGot lemon juice up in your eye, eye\r\nWhen you pissed all over my black kettle\r\nYou must've been...\r\n--\n\r\nSo who are you to wave your finger?\r\nWho are you to wave your fatty fingers at me?\r\nYou must have been out your mind\r\n--\n\r\nWeepin' shades of indigo\r\nTrapped without a reason\r\nWeepin' shades of indigo\r\n--\n\r\nLiar, lawyer; mirror for ya', what's the difference?\r\nKangaroo be stoned. He's guilty as the government\r\n-the kangaroo or him (Maynard) likes to smoke and so does the person he's accusing of hypocracy, but no one sees the government as something that can be guilty or wrong\n\r\nNow you're weeping shades of cozened indigo\r\nGot lemon juice up in your eye, eye\r\nNow when you pissed all over my black kettle\r\n--\n\r\nYou must've been\r\nHigh\r\nHigh\r\nHigh\r\nHigh\r\n--\n\r\nEyeballs deep in muddy waters\r\nYour balls deep in muddy waters\r\nGanja Please\r\nYou must have been out your mind \r\n--\t\t\t\t\n\t\t\t\t\n\n", "comment_422": "\nIn a very literal sense...\n\r\nThis song is about hypocrites who used to ignore the right to a fair trail--back in the days.\r\nThe courts where these trails would take place were simply called \"Kangaroo\" courts, where small-time junkies/drug users/etc would be prosecuted and executed for their actions.\n\r\n\"The pot calling the kettle black\" is a saying directed at hypocrites because it states that the pot is calling the kettle black when in reality it's seeing its own reflection. It can also be deciphered where the pot is just as black as the kettle, therefore, it's like if a serial killer was to call another serial killer \"heartless\" or \"inhumane\" for their actions, methods....same shit.\n\r\nAnother popular saying that this refers to in terms of being a hypocrite is, \"people who live in glass houses shouldn't throw stones\", in which Maynard sings, \"don't go tossing your stones around\".\n\r\nThis is a literal interpretation of how the song depicts the unfairness that occurs in court systems, then and now, and how the government is just as guilty when it comes to drugs or wrongful punishments.\n\r\nThat being said, you're free to interpret this in your own way.\t\t\t\t\n\t\t\t\t\n\n", "comment_423": "\nits about the judicial system.\t\t\t\t\n\t\t\t\t\n\n", "comment_424": "\nThis song is acctually about a court system called the kagaroo courts. A kangaroo court or kangaroo trial is a colloquial term for a sham legal proceeding or court. The outcome of a trial by kangaroo court is essentially determined in advance, usually for the purpose of ensuring conviction, either by going through the motions of manipulated procedure or by allowing no defense at all. The accused are denyed rights such as right to be presumed innocent until proven guilty right to control one's own defense e.g. selecting one's own defense counsel, right to hear a full and precise statement of the charges made against the accused, right to have adequate time and resources to prepare a defense against the charges, right not to incriminate oneself, right to summon witnesses, right of cross-examination, right to introduce evidence which supports acquittal of the accused, right to exclude evidence that is improperly obtained, irrelevant or inherently inadmissible, e.g., hearsay, right not to be tried on secret evidence, right to exclude judges or jurors on the grounds of partiality, prejudice or conflict of interest, right to have a verbatim stenographic record of the trial proceedings created, right to have no interference or undue influence made by external agencies e.g. political or military leaders, right of appeal against conviction. In acctual fact this song has nothing/very little to do with smoking drugs and if you read through properly it should all make more sence to you now =) xx\n\n\n", "comment_425": "\nto tell you i have been thinking this about this song for a long time and never spoke on in cause i guess i have to admitt to some not to so holsome lifestyle choices....being as my life is full of addicts and skitzos from ALL walks of life rich,poor,sober,wasted,shameless.....i always felt the meaning of the song is sayingfuck you, to rich,shopping at whole foods sneak a joint in my prius wanna be hippy fucks.becuz its a fade to care about the envirnment and eat organic grow some dreads and light up after work......but really theyre the sAme judgementle yuppys theyve always been its not fooling anyone....i think that the meaning of the song has to do with speculation into the actions of a tool band member or the band as a whole....accusations maybe of drugs(i was thinking herion because i usually dig herion music i dunno why not a drug i care for i like being in coontrol....\"piss all over my black kettle\"black=herion) and he talks about pointing the finger so im thinking its something like how the fuck can you critisize my music,lifestyle,drug use.....when you talk shit about me then go sit on the couch lite up and turn your back on the real problems in the world you sit theyre saying its my fault its this way but maybe its your fault for letting it be this way and doing nothing except blame people more fucked up then you maybe cause they didnt have the same opportunitys as you or w/e the fuck....so some kind of political meaning too possibly....i dunno maybe i am trying to make it all fit to hard and we are all stupid for caring so much maybe tool meant to cofuse the fuck out of their fans lol.....i kind of enjoy music that makes me think because i dont much care for read'n i never been much fo book learning n such.............\t\t\t\t\n\t\t\t\t\n\n", "comment_426": "\nI don't have a hell of a lot more to add, other than maybe there's a hidden meaning in the \"liar, Lawyer, mirror\" bit. Could be a reference to cocaine and the hypocrisy of anti-marijuana campaigners who aren't bothered at all with the coked-up excesses of business executives etc. I know that in the 80s, the anti-drug rhetoric was focused on crack even though something like 70% of the drug war budget was spent on busting people for weed. The drug issue is a handy lens to view the general schism between what people's stated reasons for doing something are, and what their hidden reasons might be. We can all be very self-serving and vicious but can always justify it to ourselves, part of that is justifying it to others.\t\t\t\t\n\t\t\t\t\n\n", "comment_427": "\nListen (read lyrics) to Sober after this song. Maybe these messages could be applied on a much more personal level as with all his songs. A thing I have failed to notice from most people is how they seem unaware how the songs are in unison. You cant ever expect to \"understand\" one of these songs without listening to the rest. Its incomplete. A good deal of ego and pride may be lost should you take his messages personally. Why should I look up the history of a song  when it is speaking to me? What is his purpose or intentions through his music?\t\t\t\t\n\t\t\t\t\n\n", "comment_428": "\nwell...i have yet to dive into the meaning of this song...since most of Tool's songs have some kind of complex hidden meaning behind them, i'm not gonna try to decipher it just yet.   i'm just gonna say that this song kicks ass.  the bass and distorted guitar goes so good with Maynard's seductive tone.  it certainly is a song that makes me want to get up and start dancing along with some head banging.  this song totally rocks!!  10,000 days overall isn't their best album but this song should definitely NOT be overlooked..Tool has still got it!!\t\t\t\t\n\t\t\t\t\n\n", "comment_429": "\nTrying to do this easily. In general, this song is not about a specific topic, however about a specific type of personality, seen on every level of human interaction. Being a phony. Phonies can be practically found everywhere and are especially present in any position of power like for example in politics. Although I think the song refers to that branch, the song is also addressing anybody distorting reality to make himself appear â\u0080\u009cmorally betterâ\u0080\u009d at the cost of others. Sometimes, even I catch myself of being a phony. So the song can also address yourself, if you want. you trow everything in the same pot. meaning you generalize and make no distinct but essential differentiations.\nComing to the lines, the interpretation coming to my mind is as follows:\n\n\"Who are you to wave your finger?\"\n- Who, the f##k do you think you are? - \n\nâ\u0080\u009cYou must have been out your headâ\u0080\u009d\n- Are you f##king crazy? -\n\nâ\u0080\u009cEye hole deep in muddy watersâ\u0080\u009d\n- You yourself have dirty little secrets -\n\nâ\u0080\u009cYou practically raised the deadâ\u0080\u009d\nBeing a necromancer is a really bad thing, at least in the fantasy world. If you raised the dead, you have done something really wrong. If you are a necromancer, you are definitely evil.\n\nâ\u0080\u009cRob the grave to snow the cradleâ\u0080\u009d\nEverybody knows, robbing graves sucks.\n\n-Then burn the evidence down-\nTell everybody: It wasn't me! :P (troll grin)\n\nâ\u0080\u009cSoapbox, house of cards, and glass\nSo don't go tossin' your stones aroundâ\u0080\u009d\nReferring to a saying: Don't throw with stones when sitting in a glass house. Meaning that you are not in the right position of accusing someone.\n\nâ\u0080\u009cYou must have been high\nYou must have been high\nYou must have beenâ\u0080\u009d\n- You are disillusioned -\n\nâ\u0080\u009cFoot in mouth, and head up ass\nSo what you talkin' 'bout?â\u0080\u009d\nImagine someone being that acrobatic. If you see someone having his foot in his mouth and his head up in his ass, then you know that the person is definitely not able to say anything meaningful.\n\nâ\u0080\u009cDifficult to dance 'round this one\nTill you pull it out, boyâ\u0080\u009d\nWhen some is standing in your way who could expose you, then you use your position to prevent that very person of doing the right thing to hurt you (in a sense of abusively using power). Boy: well, boys know nothing. We all hate boys, right men?\n\nâ\u0080\u009cYou must have been so high\nYou must have been so highâ\u0080\u009d\n- â\u0080¦ -\n\nâ\u0080\u009cSteal, burrow, reefer\nSave your shady inference\nKangaroo done hung the juror with the innocentâ\u0080\u009d\nMethods of being a successful phony. Tell lies, get credit of things you did not accomplish and shift reality!\n(â\u0080¦)\nI think the song is full of really great metaphors. Highly interpretable material.\t\t\t\t\n\t\t\t\t\n\n", "comment_430": "\nIs \"weeping shades of cozened indigo\" similar to \"crying me a river\"?\t\t\t\t\n\t\t\t\t\n\n", "comment_431": "\nwhoa.... this song's about me\t\t\t\t\n\t\t\t\t\n\n", "comment_432": "\nThe song is about marijuana legislation specifically and generally about legislative hypocrisy. \"Who are you to wave your finger?...eyeball deep in muddy waters, etc\"\n\nMaynard is basically saying \"who are you to judge me? who gave you the right to say what's right and what's wrong?\"\t\t\t\t\n\t\t\t\t\n\n", "comment_433": "\nMarijuana is referenced, but its really \"The Pot\" that called the kettle black.  \nhehe i see what you did there\t\t\t\t\n\t\t\t\t\n\n", "comment_434": "\nthese lyrics are pure poetry\t\t\t\t\n\t\t\t\t\n\n", "comment_435": "\nI always thought the \"foot in mouth and head up ass so whatcha talkin bout\" was \"Foot in mouth and head up asshole whatcha talkin bout\".\nEither way it means the same thing though.\t\t\t\t\n\t\t\t\t\n\n", "comment_436": "\nIts about hypocrisy ..\t\t\t\t\n\t\t\t\t\n\n", "comment_437": "\nSome of you ate\t\t\t\t\n\t\t\t\t\n\n", "comment_438": "\nIt was written about an australian, saint, stoner, hypocrite.\t\t\t\t\n\t\t\t\t\n\n", "comment_439": "\nI think this song is so deep and everyone can learn something from it. Before blaming others  we need to look inside ourselves and find that what is that I have done to cause such a problem and how I can rectify myself rather than blaming others for my problems. All Maynard is saying is to own up to our mistakes and don't try to convince others why we made it. Such a strong song to start a change in ourselves and the society.\t\t\t\t\n\t\t\t\t\n\n", "comment_440": "\nquite simply, its an elaboration of \"The Pot calling the Kettle Black\"\n\nen.wikipedia.org/wiki/…\n\n\n", "comment_441": "\nIts clear that the song is about RACISM, pot(Ganja, pot, reefer, stoned, you must be high) the hypocrisy of law enforcement/lawyers/judges, and RACISM/African Americans in the South (\"who are you to wave your finger you musta been out yo head\" & \"eyeballs deep in muddy waters\" & \"whatcha talkin 'bout?\" \"Ending a sentence with \"BOY\" And \"you musta been out yo mind\" are in my opinion reminiscent of southern and/or  black slang). Eyeballs deep in muddy waters means your in the same situation and not clean. \"Weeping Cozened Indigo musta got lemon juice in your eye\" is a reference to putting on makeup and fake crying for the court, kangaroo court means to put on a show in court where people dont have a fair chance (another reference to Racism and African Americans getting harsh sentencing due to Marijuana laws) and of course \"You musta been high\" is another Southern phrase that means that you mistakenly thought or believed something and the excuse for your mistake is because you were high out of your mind and not thinking clearly. \"OH, you thought I was going to let you drive my new car? Ha! You must be high! Aka You must be out yo mind!\". Thats it completely. Although I will admit the first verse sounds like a reference to Led Zeppelin stealing from Muddy Waters and it might be about that as well. One verse can reference something else and Tool writes songs with deep meaning. \t\t\t\t\n\t\t\t\t\n\n", "comment_442": "\nOK, this from my research of the song, and not my own original ideas. However I find them compelling enough to share, and reiterate here.  This explanation is too fitting to be incorrect.  This song is simply about he The Pot calling the kettle black - but is a diss response to Led Zeppelin (aimed at Plant or Page) by Tool.   I think Page called Tool unoriginal (or made non-complimentary comments) for Tool covering No Quarter live.  \n\nMuddy Water is person not a place as referenced in the song.  Lyrics from Muddy Waters' song \"You need love\" , lyrics as follow \"baby way down inside you need love\"  as ripped of by Zepplin's \"whole lotta love\", and also \"You shook me\" Muddy Waters and LZ song of the same name. Check out all the Youtube videos of LZ rip offs.\n\nWeeping shades of indigo may simple be a reference to the blues style of music which Zeppelin frequently ripped off/ translated into rock. Cozened means to deceive/ Fraud trickery - stolen blues!   \"Got lemon Juice up in your eye\"... Led Zeppelin makes reference to Lemon juice in the Lemon Song - also a ripoff song!\n\nThe list of stolen LZ songs includes Dazed and Confused, Whole lotta Love, Stairway to Heaven, Your Time is Gonna Come, & the Lemon Song and many more.\n\nLZ musta been HIGH... to make such accusations, as they themselves have ripped off countless songs.  ( still amazing) but the likenesses of many of their songs are way too similar to not be be at least \"steal, borrow, reefer save your shady inference\"  I'm pretty Maynard is saying that LZ just got high and tried to play covers! HA!    youtube.com/…\n\nIf you listen the song with, and accept the notion of its about LZ, it really seems this to fit, with a little tongue in cheek commentary: \"foot in mouth and head up asshole\", you must have been so high to criticize a cover song when you are a hypocrite and stole countless melodies and lyrics. \n\nBottom line LZ have the head up their ass and been sooooo high to call Tool \"unoriginal\". yup... thats true.it fits.\t\t\t\t\n\t\t\t\t\n\n", "comment_443": "\nIn general I agree with what I've read. Maynard writes about things to cover a broad array, so while some might believe this has to do with the hypocrisy around pot I believe in deals with hypocrisy in society, no matter where it may be found. I will add an observation. The use of clichÃ©s are abundant in this song. Probably more clichÃ©s mentioned in this song than any other ever written and when Maynard does something you better bet it has purpose. I find the use of so many clichÃ©s quite ironic in a song about hypocrisy. Writing with only clichÃ©s isn't writing at all. In doing this Maynard shows the hypocrisy is everywhere and what he's saying is nothing new. Foot in mouth? Indeed.\t\t\t\t\n\t\t\t\t\n\n", "comment_444": "\nMany general interpretations seem interesting and wise.\n\r\nBut the song DIRECTLY refers to the KANGAROO COURTS and specifically to the unjust court which senteced the cambodiagn revolutionary leader\r\nPOL POT to death.\n\r\nHere you can find more information:\n\r\nKangaroo courts:\nen.m.wikipedia.org/wiki/…\n\r\nPol Pot:\nen.m.wikipedia.org/wiki/…\n\n\n", "comment_445": "\n\"Do yourself a favor and read up Kangaroo courts and what is happening in Guantanamo Bay, or find out who Black Kettle is and what happened to him. Why was he killed? Think about how that might relate to what is happening right now in the world. How that might relate to the US war in Iraq.\"\n\r\nIm sorry but no, son. Since when does Maynard write lyrics about poor muslims being tortured in Cuba? This isnt RATM lad. Get ure left wing band wagon back the russia, you make me sick.\t\t\t\t\n\t\t\t\t\n\n", "comment_446": "\nAT THE END MJK SCREAMS GANJA PLEASE!!! NOT LATCH UP LIES .. AND I ALSO WOULD LIKE TO ADD THAT NOONE CAN POSSIBLY GET A TOOL SONG FROM JUST HEARING IT A FEW TIMES. IT TAKES A WHILE AND YOU HAVE TO GET INTO THE OFFBEAT MUSIC BEFORE YOU CAN REALLY GET WITH IT .. TOOL KICKS ASS AND IM GLAD TO HAVE 10000 DAYS TO OVERPOWER ALL THE PUNKY ROCK SHIT THESE DAYS..\t\t\t\t\n\t\t\t\t\n\n", "comment_447": "\nand the album is real stupid\t\t\t\t\n\t\t\t\t\n\n", "comment_448": "\nStop defending Tool you dumb fucks. Do you actually think they care if you defend them? I doubt the even give a rats ass about you. All you do is personify all of the stupidities of people they have declared v_v\t\t\t\t\n\t\t\t\t\n\n", "comment_449": "\nNo, idiots! ITS ABOUT HOW PEOPLE LIKE MAYNARD ADMIT TO THINGS LIKE DRUG ABUSE, WHILE POLITICIANS SIMPLY LIE ABOUT THE FACT! MAYNARD EVEN SAID IT! \n\r\n\"fuckin hypocrite.\r\nliar, lawyer, mirror show me. what's the difference?\r\nkangaroo done hung the guilty with the innocent.\n\r\nnow you're weeping shades of cozened indigo. (musta) got lemon juice\r\nup in your eye when you pissed all over my black kettle.\n\r\nHe's making a metaphor. It's calling the kettle black, (Hypocricy), what is a synonym of kettle? Pot. It's a pun, fucktoids.\n\n\n", "comment_450": "\nfucktoids is really funny lol\n\r\ntool is an amazing band\r\nhow can anyone think this song has no meaning?\r\nseriously..\r\namazing song.\n\r\nmaynard is great with his words.\n\n\n", "comment_451": "\nisnt the first line in this song go\r\n\"who are you to wave your finger? you musta been outta your hair.\"\r\nit thinks its hair, not head\n\n\n", "comment_452": "\n......... really??\n\r\nits about a herion addiction.\r\n\"(musta) got lemon juice\r\nup in your eye when you pissed all over my black kettle.\"\n\r\nyah, notting out when you're pissing or pissing on yourself when you OD.\n\n\n\r\nthink harder.\r\nmaynard had a herion addiction.\t\t\t\t\n\t\t\t\t\n\n", "comment_453": "\nI think its about Genetically Modified Crops\t\t\t\t\n\t\t\t\t\n\n", "comment_454": "\ni think this song is aimed (since maynard's lyrics are frequently created as symbolic weapons) towrds music critics. more specifically, the piece of shit critic that gave lateralus a 1 out of 10 review in pitchfork. the \"black kettle\" is just the tool maynard uses to cook the magic. these douchebag was probably on a narcissistic high when he thought he could judge lateralus that harshly.\t\t\t\t\n\t\t\t\t\n\n", "comment_455": "\nthis song has nothing to do with drugs you fucking dumb shits. it has to do with kangaroo courts and shit.\t\t\t\t\n\t\t\t\t\n\n"}