{"comment_0": "\nYour grandpa died\nWhen you were nine\nThey said he had\nLost his mind\nYou have learned\nWay too soon\nYou should never trust the pantaloon\n\nPantaloon is a character from a classic play/pantomine called Harlequinade. The other characters are Harlequin, Pierrot, Columbine, and Clown. Pantaloon is greedy, wealthy, and old. His role in the act is his attempt to keep the lovers Harlequin and Columbine apart. This is just some background information, but basically, all you need to know, is that Pantaloon refers to an old man. Indeed, Shakespeare used \"Pantaloon\" as a metonymy for old man.\n\nThe intro to the song is an intro to the main character, who lost his grandpa when he was nine. The grandpa is the \"pantaloon\" in this case, but why did the grandfather's death cause the boy to distrust the elderly? Likely because the the old man \"lost his mind.\" Growing forgetful, generally declining cognitively. As a young boy, (and for anyone), this is scary and confusing to witness.\n\nNow it's your turn\nTo be alone\nFind a wife\nAnd build yourself a home\nYou have learned\nWay too soon\nThat your dad is now a pantaloon\n\nThe boy grows up, has kids, and now realizes that his own father is growing old. He has just moved into his house, and suddenly realizes that his dad's mental state is going downhill. This is a shock, and it seems to have come \"way too soon.\"\n\nYou are tired\nYou are hurt\nA moth ate through\nYour favorite shirt\nAnd all your friends fertilize\nThe ground you walk\nLose your mind\n\nThis part is speaking directly to the pantaloon/old man. Exhaustion and pain have become a part of their everyday life. The hole in the shirt represents a general decay of how things once were. \"And all your friends fertilize the ground you walk\". This line reveals that the old man's friends are dead, fertilizing the ground. In other words, they're pushing up daisies. With the exhaustion, pain, decay, and loss, it's no wonder that they start to \"lose their mind,\" to slip away rather than deal with the sadness of life.\n\nHe's seen too many stare downs\nBetween the sun and the moon\nIn the morning air\nHow he used to hustle all the people\nWalking through the fairgrounds\nHe's been around so long\nHe's changed his meaning of a chair now\nBecause a chair now,\nIs like a tiny island in the sea of all the people\nWho glide across the very surface\nThat made his bones feeble\nThe end can't come soon enough\nBut is it too soon?\nEither way he can't deny\nHe is a pantaloon\n\nThis rap verse discusses the life of the old man, who is likely the dad referred to in the second verse. The staredowns between the sun and the moon refer to the passage of time. He also used to be a worker at the fair, likely selling something: \"hustling people.\"\n\nThe old man has \"been around so long\" that he perceives a chair differently than most people. To him, it's like a \"tiny island,\" that provides him a much-needed rest. It's his refuge, and yet it isolates him from others, who still \"glide across\" the sea.\n\n\"The end can't come soon enough, but is it too soon?\" This is the most powerful line in the song to me. Is it too early for the old man to die? Or would death be a mercy that would end his suffering? There's really no answer to this question.\n\nYou like to sleep alone\nIt's colder than you know\nCause your skin is so\nUsed to colder bones\nIt's warmer in the morning\nThan what it is at night\nYour bones are held together\nBy your nightmare and your frights\n\nThis last verse primarily discusses the sad state of the old man. He's lonely. He's cold to the bone. His fears are the only thing \"holding his bones together,\" or keeping him alive. However, some hope may be offered: \"It's warmer in the morning than what it is at night.\" The man's life is approaching its later hours, and will soon be over. But the end of the day does not mean the end of the man's existence. After death, there will be warmth. I think this is referring to heaven.\n\nWell, there it is: It's a song about people growing old, growing crazy, and dying.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nFrom my understanding, \"pantaloon\" is an Italian term referring to a crazy old guy. This is basically about how his grandfather and immediate father went insane from old age and how he's destined to follow in their footsteps. \n\r\n\"Now it's your turn to be alone, find a wife and build yourself a home.\"\r\nThis is referring to how even if you have a wife and home it won't stop you from going insane and feeling alone because you live in your own little world.\n\r\nIt seems as if he made every effort to avoid becoming a \"pantaloon\" by isolating himself to begin with. The part that talks about his friends fertilizing the ground and how a chair is a tiny island, is a reference to everyone around him starting families while he slowly becomes the \"pantaloon.\"\n\r\nThis is just my interpretation, don't take anything I said for doctrine.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nA very simple explanation to the song (using a lyric site who's owner said he met tyler and got the meaning) is \"the pantaloon\" is means death. So basically the person in the songs father and grandfather died and now it's HIS turn. And personally what I think when he says \"now your friends fertilize the ground you walk\" basically means all of your friends are dying and now its his turn. You can easily see why he's losing his mind, when everyone around him is dying and he realizes that he is next.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nOk, this is what I think it's about. \n\nPantaloon is basically another word for \"Pants.\" In a metaphorical sense, Pants refer to responsibility and growing up, which I think is the overall theme for this song. \nThe first lines refer to the loss of a loved one who had been suffering from mental illness, which would be an introduction to the real world, showing that nothing is perfect. As we all know, none of us should know this, it sucks. He learned way too soon that reality is coming and he needs to gain some responsibility.  \nThe Second line is his father telling him that as he's getting older, he needs to start a family of his own and assume the role of the Man of the House, making him realize, \"I've been raised only to do this.\" \nThe Chorus refers to how bad things happen in life, such as tiredness, pain, and even trivial things like your favorite shirt being destroyed . Friends will lead you down a road of s**t that'll eventually drive you insane. \nThe rap talks about living the life of a grown adult, and how he sees things and how things see him. He wants it to be over, because he wasn't ready for any of it yet. \nThe last verse refers to how he wasn't ready for any of this, and he feels alone because he was thrown into something that he wasn't prepared for. He fears that he'll never live up to what everyone makes him believe he has to, and it's those fears that keep him going day to day. \n\nThis is just my interpretation of the song. Don't take it to heart that it's the solid truth, because I know just about as much as anyone else on the matter.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\ni think tyler's grandfather died when he was young because the adults are telling him that he lost his mind but in reality, the grandfather had mental illnesses (depression, anxiety, suicidal thoughts, etc.) so he killed himself.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI think this song is about him being in a long line destined to go crazy. I googled 'Pantaloon' and as far as i understand it means a crazy old man. His grandfather was a pantaloon, so came his dad, and this song is telling him that he soon will be the pantaloon. He sits in a chair surrounded by all the people as their lives move on, while he is alone and grows old and crazy. He walks the graves of his dead friends at old age, alone without a family, he soon becomes the pantaloon.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nThe word pantaloon can also be used to describe pants. Pants are sometimes referred to as jeans. Biologically speaking, it could be a metaphor for your genes (dna). The song is giving the grandpa the pantaloons at the beginning (genes) and Tyler has learned that he shouldn't trust whatever illness he has. He learns his father also has it, making him just like his grandfather. Tyler goes through life as anyone normally would. He later learns that he too has inherited that illness or disease and is saying he is just like his father and it emotionally and mentally tears him apart like a moth is eating through his clothes. Without his clothes (or his sanity) he feels metaphorically naked. \n\r\nI hope this is acceptable for some people and makes sense. This is what I thought because my grandpa literally died when I was nine. My dad is just like my grandpa and I am just like my dad so here ya go.\r\n~shortyshortgirly~\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nI think the  song is reffering to the pantaloon as a sort of drug/poison.\r\nAbout how the grandfather died because of it and how the father and the son will follow him. \r\nThrough the song there is an aging process and the  drug is taken to forget it. The young boy didnt trust the pantaloon (drug) because the granfather died from it.\t\t\t\t\n\t\t\t\t\n\n"}