{"comment_0": "\nfor me this song is about keeping faith, that you are on the right track and one day youll reach to the point of parabol/parabola. its about a special moment when u r as down as ever, but you have felt like this a million times before, and u are tired of still giving blood, givng your everything and getting nothing in return. and u remind yourself that u may allways walk away wich means killing yourself. you'll allways have that option and its the one thing you have, the only thing. and cuz the rewards are so tempting (parabol/parabola) then u remind yourself that you have got to be patient, you have to wait it out.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nI have a lot of patience, but this weekend I lost my temper when I found out that all my CD's had been stolen.  I ended up breaking a window and spending 4 hours in the emergency room getting 8 stitches.  Anger is stupid.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nAt the Sydney show in july this year, before they played this, Maynard said something like this song is about the vampires that you come across in your life, who try to get you down. Hence the use of \"giving blood\" in the lyrics. It could be to do with the record companies and the industry.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nok, this may be a bit long but here goes what i think of this song. some of my interpretations may seem a bit random, cos when i read the lyrics of this song it totally worked on what i've been thinking about for ages now, so some of it is related to what i personally believe, but if you can bear with me, i'll try make you all see what my view is. \n\r\nthe vampire is society : in our world it is based on money, with too little thought to what is important to people...\"drain vitality\" -we are beaten down by the trials we have to go through everyday to get by in our cut-throat world. i think maynard is saying all the way through that he holds out hope that things will change(he's still giving blood, he has a desire to heal the damaged and broken-he's trying to help the world through his music) and that if he didnt have that hope, that belief that people appreciate what he's doing, and that it is doing some good (rewards reaped...) then he would have \"walked away\"...quit the music industry, given up on life...see that to mean what you want. so basically, he's saying he has to have patience and keep hope that things will change, that people will change...but that he still might give up if he doesn't see any difference occuring...\n\r\nthe \"tedious path\" that he has chosen is one of trying to help the world...he's still \"giving blood, keeping faith\" but it is tedious because there is so much opposition to it by society and people who do not want to change things for the better of mankind. \n\r\nbasically its a fight against the drain of society, a fight against the cruelty in this world : he's fighting it, but he needs us to fight it too so that he can see there are other people who want the change, and so a change can be made. he has to be patient and keep going or else there isnt any hope left for us. sorry if this is all a bit off track, i cant exlain it as well as i see it!\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI kind of think this track is about the artistic process, especially in terms of creating for a wider audience. Maynard has said he wants the music to help people heal, or introspect or soul-search. The process of creating music and sharing it is draining, but it's because of his \"desire to heal the damaged and broken met along\" that he continues to do it in this manner.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nI'm suggesting that he is a human being, just like you or I, who is very in touch with the seen and unseen reality of life.  Either that or he's just wasted on drugs all the time, but I think that the music is to sophisticated for that possibility.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nNo matter how deep the future seems. Sorry.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nthe most EXCELLENT thing about all tool and APC songs (pointed out by headon earlier) Is that they're so heavily layered in metaphors that they can apply to anyone - and any situation.\n\r\nAlmost every song I listen to by them really sums up my \"love life\" at the moment.\n\r\nI'm desperately in love with the most fantastic girl, and i've had a fair few chances with her in the past - and I have made progress with her.\n\r\nIn The Patient, Maynard sings about devoting himself, keeping faith.\n\r\nIn my situation, I think of how I keep putting time and effort into making this relationship with this girl, thinking someday it'll all fall into place for me.\n\r\nAnd the loving embrace to see me through - I usually think of my very close friends who have always comforted me in the situation etc ;)\n\r\n..... But ...... I'm gonna wait it out ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nthis guy was going to kill himself and is just kinda' toying with the pistol a bit more. to really think this thing through. but this time with some self empathy and not such harshness. the universe is pretty chaotic and harsh, as is, why throw even more weight on your shoulders with a personal cross.  but he's gonna wait it out.  hopefully it just doesn't become one of those platitude's like, \"this too shall pass.\" cos that wears thin real quick.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nTool Synclist (complete)\r\n7,8,1,2,5,6,9,10,3,4 - 6,7,5,8,4,9,13,1,12,2,11,3,10 â\u0080\u0093 15,14 (or 14,15)\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\ni dont agree with what people have said about this song referring to maynards stance in the music industry selling records growing tired of fans whatever. that is too insubstantial and temporary for tool. i also dont believe maynard shoudl be seen as a god the way many people refer to him. the whole point of his beauty is that he is a human and that is whats inspiring. we can be that too. he & the band personify the line \"swing on the spiral of our divinity and still be a human\". he is not a god he is just a symbol of the next stage of evolution. this song doesnt feel negative to me, or have connotations with people blinded by religious fears or whatever. i think this song is positive and a beautiful way to explore the strength of devotion. it could be to do with a relationship. say the couple have been together on and off for 3 or 4 years, and throughout the whole time the guy has made many many mistakes completely screwed the female around put her in the worst positions. but she has total faith that he will change she believes ion his power and beauty and she continues to take him back time and time again. she is tested many many times. he is unreasonable and unforgiving. people might see this as a \"he hits me but i cant leave him\" situation, understandably. but as this song shows, its alot deeper and more beautiful than that. she goes throguh so much for him that she hurts constantly, but when all is peaceful she knows it is worth it. it does feel like a test, how far she will go for this entity she knows so well and loves so much \"is this a test it has to be otherwise i cant go on\". she is constantly tempted to lose faith, and go out and lead a normal, less meaningful life but she knows she must stick with this \"tedious path\", because she believes in him, and that is an extremely powerful thing. he loves her deeply as well althoguh he is extremely screwed up but she stays even though he is pushing her away violently and she hates who he is acting like or becoming -\"this paranoid, paralyzed vampire acts a little old\". she feels like there is no end to her suffering and these \"groans of tedium\" begin to excape her. \"draining patience, drain vitality\". she has escaped from who she used to be and become a force of love and faith. she knows this isnt normal this being \"still right here, giving blood, keeping faith\" (staying by his side, giving him everything she has, never losing faith of who he can be). but although outsiders may see this as unhealthy and destructive, she knows she has entered a higher, less selfish state of being. when what you are doing is so so so awful yet so so so beautiful then it is a higher realm, you have awakended all your powers of holding on and although it is tearing her apart, she continues and grows stronger from it every passing day. she feels like she 'must keep reminding myself of this\" constantly reminding herself of how special what shes doing is and how there will be divine rewards, she knows he loves her and wants to change- \"if there were no rewards to reap, no loving embrace to see me through, this tedious path ive chosen here, i certainly wouldve walked away. by now\" and she \"still may\"\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nMaybe a little odd for Tool, but I think this song is a direct reference to The Screwtape Letters by C.S. Lewis. In the novel, two devils conspire to do everything in their power to tempt an unknown man, known only as \"The Patient\" to committing sins in order to secure his place in hell. The Patient ultimately does not give into temptation and sin, and is therefore rewarded by going to heaven when he dies.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nWow, a lot of comments on this one. I Haven't read them all but I'm going to post what I think this song means from Maynard, and what this song means to me. First what I think Maynard wrote it as:\n\r\nIn this song he describes his journey as a musician. I'm going to break apart the main 'paragraphs' of this song sequentially. This might get a bit long...\n\r\n\"A groan of tedium escapes me, startling the fearful\"\r\nHe's groaning about how tedious it is to continually analyze his thoughts and translate them into an attractive message designed to get our attention and teach us something\r\n\"is this a \r\nTest? It has to be\"\r\nHe's talking about his life in general. Life is testing him, his way of passing the test is to send his message, teach what he's learned to as many as possible.\r\n\"otherwise I can't go on \r\nDraining patience, drain vitality, this paranoid, paralyzed vampire act's a little \r\nOld \"\r\nIn putting his message together he has to contantly think about the ignorant and unaware that he's 'teaching'. Just paying attention to them and trying to lift them up drains him. If this wasn't a test that he thought he was passing then he'd quit.\n\r\n\"But I'm still right here, givin' blood, keepin' faith and I'm still right here \"\r\nHe's still living the best he can, passing the test the best he knows how by continually finding new ways to open our minds, to teach us the things he's learned. He's still giving us his attention.\n\r\n\"Wait it out \r\nGonna wait it out \r\nGonna wait it out (Be patient) \"\r\nHe's sticking to his path, he's gunna continue to practice his chosen path because he still thinks its worth it. He still has hope for the ignorant.\n\r\n\"If there were no rewards to reap \r\nNo loving embrace to see me through\"\r\nThe rewards = monetary and social gain, the loving embrace = the love and admiration of his fans.\r\n\"This tedious path I've chosen here\"\r\nThe tedious path is the work he does, him teaching us.\r\n\"I certainly would've walked away \r\nBy now \"\r\nHe would have quit trying to lift people out of the gutters, or help them lift themselves out. If it wasn't for the good he could see coming out of it, he would have quit doing it.\n\r\nThis next part is where I decided that this song was specifically talking about Maynard's will to continue helping people as he is.\r\n\"If there were no desire to heal\r\nThe damaged and broken met along\"\r\nWe, his listeners, are the damaged and broken... He has a desire to heal us, to help us by helping us realize more of ourselves. This small difference from the previous version of this same paragraph points to us, points to his attempts to help us.\r\n\"This tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now \"\r\nIf he didn't have a desire to heal us, he wouldn't be doing it.\n\r\n\"And I still may \"\r\nI do not like the implications of this line as seen through my interpretation. He's saying he still may quit his life's work, which is helping us... He may quit making music. I'm sure he will someday, I just don't like to hear him considering it yet. I'm sure I have a lot more to learn from him.\n\r\n\"Must keep reminding myself of this \r\nI must keep reminding myself of this \"\r\nI think this line comes from the times Maynard feels fed-up with the bad side of his career. He has to keep reminding himself of the rewards and the loving embraces.\n\r\nThe rest of the song re-iterates previous parts of the song in ways that time them together:\r\n\"If there were no rewards to reap (I must keep reminding myself of this)\"\n\r\nHe has to remind himself of each and every part of the whole to make an accurate decision to continue. \"I must keep reminding myself of this\" is repeated after every line of the paragraph sung earlier in the song. He's taking the time to recognize each reason each point of why he's doing what he does... This is where my meaning begins to come in.\n\r\nI see this song in a broader light, personally. When I listen to this song I think about the different situations in my life and all of the different factors that affect those situations. I try to look at every person, every feeling, every THING as a whole. I try to see every single part of what I'm thinking about so I can accurately judge how to interact with it.\n\r\nThis song reminds me to keep being vigilant, keep taking the entire picture into view before making decisions. It keeps me from being irrational, and makes me think rationally when I'm angry, or depressed. When I can't seem to focus on the right things... I listen to this and step back to take a larger look at the picture.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nthe song from my point of view is someone at the bottom of a horrible experience who isn't sure they want to live anymore. but then the person decides that there is still hope for a resolution for the better so they decide to \"wait it out\" not acting upon the situation but hoping that by sitting by time will heal the situation. The song does not end with a resolution.\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nfor those of you that want a real interpretation: C.S. Lewis wrote a book called the Screwtape Letters--a christian satire that is about a demon guiding a junior level demon on how to keep a man out of heaven. he (screwtape) tells the junior demon (wormwood) that the key to successfully taking a man is through boredom and confussion, rather than to get him to something entirely evil. (\"the safest path to hell is a gradual one\")\n\r\nwhat does this have to do with this song? the lyrics clearly show that the narrator is questioning his own faith and is continuously choosing this tedious path of some sort.\n\r\nso what's the main kicker in all of this? throughout the 'Screwtape Letters', the demons always refer to the man in question as...you guessed it...\"the patient\"\n\r\n...your welcome\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI've always thought that this song explores the definition of the word \"patient\" in more than one way. \n\r\nHe uses patient in the tense of a person or people waiting for something, anything really.\n\r\nBut, he also uses the tense of a person who is sick, or is at a hospital of some sort. \"But I'm still right here, givin' blood, keepin' faith and I'm still right here..\"\n\r\nThe saying, \"givin' blood\" could be taken literally, like the song is a story about a person who is donating blood and no one is noticing, or he's reaping no benefits, so the person is trying to be patient with his surroundings.\n\r\n\"If there were no desire to heal \r\nThe damaged and broken met along \r\nThis tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now\"\n\r\nIn this paragraph, the \"damaged and broken\" are the sick people in need of blood, and he desires to heal them.\n\r\nJust a thought \n\n\n", "comment_16": "\nMy take on this song; is that it is about maturity!\r\nWhat makes this song so special is the atmosphere of enlightment and the confrontation of your own flaws (tedious path..), compared to much of Tools earlier work. I think we can agree that Tools earlier material was more aggressive, finger pointing and destructive.\n\r\nThis is about leaving all the hate behind, instead of punching your attacker in the face, you turn the other way and wait out the shitstorm. I can really connect to this song and I assure you that it have helped me keeping myself calm when I have wanted to explode.\n\r\nIt's about being the bigger man but in a humble way and not in a self righteous way. There are always people who will try to drain you, but it's up to you if you want to make a beef out of it, or turn the other way and wait it out.\n\r\n\"I must keep reminding myself of this\" is a mantra I will keep within me until I forget. \t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nVampires are a metaphor for evil/The-Devil/temptation. The song is about patience in riding out temptation or things that sap you; wait it out to get your reward. Patience here is a double meaning, where you are the patient, the one who is sick like a hospitalised man. But the patient also has to be patient in the sense of enduring hardship with time and resolve.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI've often thought life wasn't worth living. The few good times aren't worth all the bad ones... But whenever I think about how I'd prefer not to be alive I end up thinking \"well, if I haven't committed suicide by now I'm not going to\".\n\nI dunno, just a though. But it could have something to do with it?\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nfor me this song is about keeping faith, that you are on the right track and one day youll reach to the point of parabol/parabola. its about a special moment when u r as down as ever, but you have felt like this a million times before, and u are tired of still giving blood, givng your everything and getting nothing in return. and u remind yourself that u may allways walk away wich means killing yourself. you'll allways have that option and its the one thing you have, the only thing. and cuz the rewards are so tempting (parabol/parabola) then u remind yourself that you have got to be patient, you have to wait it out.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nGreat song.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI like the ideas everyone. But i have another view of this song. It seems to me that Maynard always uses metaphors in his songs to allow everyone to relate them to thier lives. In my case this song is about being close to someone but they aren't ready to go further. Bordem has set in \"teduim\" because the narrorator wants to go beyond where they are. But the other person is afraid, and is simply using that as an excuse \"paranoid, paralyzed vampire.\" He keeps reminding himself that there is a reason he is still here, the love and possibility of moving further \"if there were no reward...\" if it wasnt for that he would have surely moved on to someone else, and he still may, regretfully.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nTo me this song represents a man losing his faith. This man is in church among the fearful and his sigh, or sign of boredom, scares the followers around him. This man begins to second guess the sacrifices he's made because of his religion and is wondering whether it all been worth it or if he should just walk away from it all(the church.) It's a difficult decision he's about to make. Should he risk losing everything that his religion has promised him and simply walk away or should he continue to be patient.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nHey Harry Manback, with all due respect, Maynard's lyrics are too damn profound, and written with a lot of passion, for him to be writing them for just the 'album sales, or the fans'. Maynard loves singing, and loves writing. That's why he does it. I'm too tired to write my opinion of this song... Maybe later.\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nWell, since my theory was a little vague, I thought I'd clarify it a bit more. \r\n\"Is this a test? It has to be, Otherwise I can't go on.\" - Is it some kind of exam that Tool have to put out another album quickly.\r\n\"This paranoid, paralyzed vampire act's a little old.\" - Maynard sees the record industry as a vampire sucking his life from him.\r\n\"But I'm still right here. Giving blood, keeping faith. And I'm still right here.\" - Even though Maynard is tired of the industry, he still carries on making records cos that's what he loves doing.\r\n\"If there were no rewards to reap, No loving embrace to see me through, This tedious path I've chosen here, I certainly would've walked away by now.\" - If Maynard didn't get anything for making music, be it money or loyal fans, he would have quit making music straight away.\r\n\"I must keep reminding myself of this.\" - He must remind himself of reasons why he does what he does. Scream at me, send me hate mail, pilage my house. Do whatever, but this is my theory of this song and it's my favourite one from Lateralus. I can tell I'm gonna be umpopular after this!\n\n\n\n\n\n\n\n\n\n", "comment_25": "\nI think you can learn the most from this song by looking at the very tip of it.  \"Be patient,\" whether it be in life, with kids, with school, with other people, whatever.  It's just important that you don't rush through something, be patient and take time to fully understand the situation.\n\r\nI just want to add that Harry Manback is pissing me off by constantly refering to Maynard as god.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI apologise for just picking out Maynard when Adam, Justin and Danny are all fabulous musicians. Every song showcases their individual talent\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nHarryManback, I think your description makes a lot of sense, the meanings you said really went well with the lyrics. Ive tried to figure the song out many times and though it probably goes deeper than that I agree with you. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nDude, didn't you know? Maynard doesn't ever have to worry about selling records again. He has two of the most awesome rock bands ever, Tool and A Perfect Circle. He said that, oddly enough, A Perfect Circle has become all about the music, because Tool will sell records no matter what. So that is way too shallow of an interpretation, whether or not he will sell records.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nYou have to keep faith in whatever you keep faith in and remember not to abandon hope no matter how dim the future sings. Always remember to be patient. Patience kills doubt with time.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nIt could mean that but to me it seems more like, his doubts is what is hindering him and the only wait to succeed IS to have faith. But that's just me, of course. It can mean different things to different people.\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nAnd the proof Asz is Maynard starting A Perfect Circle. But I think Maynard is refering to us, the fans, as patients. He's saying that he's helping us out with his Lyrics and and Tools music. \"if there was no desire to heal\" MJK is saying that if he didn't want to help people he wouldn't be in the buisiness of making music.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\njoel73 is completely right. i never looked at this song that way but now that you explain it in that light, i agree fully. it sums up how i feel with my religion, perfectly.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nthe best part of this entire song is near the end, in the last loud section when he says now.....I'll show you :)\n\r\nIf there were no rewards to reap (I must keep reminding myself of this) \r\nNo loving embrace to see me through (I must keep reminding myself of this) \r\nThis tedious path I've chosen here (I must keep reminding myself of this) \r\nI certainly would've walked away (I must keep reminding myself of this) \r\nBy now \r\nAnd I still may                 sudden change of key\r\nAnd I still may                 then back to the key they\r\nAnd I still may                 were in.....I love the sound \r\nAnd I. . . .                       there, its amazing\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\noops.....its when he says \"now\" because the key changes for a second, then back, it sounds amazing, and its yet another sign of sheer genious\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nI think that the song is about life. It's about holding your head up and keeping faith when everything seems to be going wrong and when you're being tested. If you're patient then you will get the rewards that you deserve. No matter how irritating the path is that you have taken, if you wait it out then you'll be happy.\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis song has a totally differant meaning to me. i see it to be about scientology, and about how the religion saps you of money, and promises the power to Heal if you keep faith and give blood (money) \n\r\nTo me, instead of being about keeping your head up or keeping faith in ur self or anything positive like that, to me it seems to be the lament of a doomed scientologist, blindly keeping faith in his masters.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nDankmen: the best part of the song is...there isn't one because the whole of the song is absolutely fantastic! But seriously, to me the best part is right at the beginning when he starts to sing: \"A groan of tedium...\" It's like the whole place inhaled and then he started to sing. And also after the quiet bit, when the whole of the music creshendoes (is that how you spell it?) After \"But I'm still right here, givin' blood, keepin' faith and I'm still right here\" then next is \"Wait it out. Gonna wait it out. Gonna wait it out (Be patient)\" And then the chorus. *sigh, I love this song so much it makes me cry! I've seen Tool thrice now but yet to hear this song live. Has anyone heard it live? What was it like?\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI'd say this has multiple meanings....being patient in life itself....and some other things i forgot.....dammit....\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nthe best part about this song is its ambiguity.  There is nothing stated about what to be patient about, so it all depends on the listener.  It can mean be patient in life, with children, in school, with your family, with annoying or mean-spirited people, with anything that bothers you.  That's my philosophy, I don't let anything bother me so I never get annoyed for more than a few seconds.  I'll think about it, I'll think about the problems of the world, but I won't let them bother me because it would drive me nuts(and trust me I know, it almost did) I just keep living the path that I'm living.  You have to be patient because we spend about 100 years on this planet\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nOne thing a friend of my observaed was that \"Lateralis\" could be about a lateralis' brith while \"The Patient\" could be be his death. It fits quite well too, because \"Lateralis\" does seem to beb about his birth \"All I see, in my infancy...\". While \"The Patient\" looks back at his life.\n\r\nYet, I dunno. You gusy seem to have better ideas.\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nThis is about a man that has cancer (the \"vampire\") that waits for dying, he is patient and does not rush it, but know that in the end, something better after death is coming. \n\r\n\"If there were no rewards to reap \r\nNo loving embrace to see me through \"\n\r\nMaybe the reward is to become eternal.\n\r\n\"I must keep reminding myself of this \" \r\nReminding that we are all one conciousness, one mind. That when you die, you become eternal, you are a part of the conciousness, dying is only a step in your existence, you must not be affraid of it.\n\n\n\n", "comment_42": "\nSometimes I think this song is about dealing with some dumb bitch who you just can't stand cause she's so stupid, maybe just any person, but one has to wait and \"be patient\"(heh) because that person also has many good qualities and maybe one day they'll see the light.\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nI like that interpretation sharzay.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nI think its about a lover who left him and he still has faith in her. but shes a bitch and left him for another guy. so he just has to wait it out, wait out their relationship so he can get another chance for her to love him again. to embrace him again. he is hurting himself by allowing himself not to get over her so he can stay in love with her so when she comes back to him, he can be happy again. because he dosnt want anyone else. Kinda waht SpiritualMisfit said..only not. oh yeah, i also agree with hedonbass' interpration. \t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nthanks blurred, i appreciate that :D\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\ni think this song is about all the bs that tool had to deal with concerning their label. am i the onlyone who reads penthouse. one of the articles talked about all the crap they were going through just to put out another record. in that way it relates to ticks&leaches.. and my own personal interpretation is just to live. be patient enough for life and it will benefit you. but for the truth, im gonna wait it out.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nIf this song is about the record industry, then Tool have sold out.\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\ni agree with harry manbacks interpritation of the song because before lateralus came out tool was on the verge of breakin up but the song schism saved the band so i can totally see Maynard being bored with tool especially after forming a perfect circle and tapeworm but only staying with it for the fans sake which is why Maynard is so awesome stayin in it for us TOOL is amazing..........but not gods\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\ni agree with harry manbacks interpritation of the song because before lateralus tool was on the verge of breaking up and the only reason they didnt was because of schism and i can see Maynard being bored with tool especially with the formation of a perfect circle and tapeworm and only stayin with it for the fans and that is why Maynard is so awesome cus he's do that just for us and TOOL is an amazing band they are the best at every instrumental thing they do.............however they are not gods and would never want to be viewed as gods\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nHe says \"If there were no rewards to reap...\" I don't think this nesessarily means money or even anything material. Rewards can mean anything.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nDefinitely a song about holding on to what you believe in.  To go through the pains in life, the suffering, the torment, just knowing that the road you decided is true.  And though it may get you down, you can always ask yourself what Maynard has.  If it's too bad for you to go on, why not just walk away?  I ask myself that, and then the realization comes to me.  That there will come a time when you get everything you've wanted.\n\r\nThink about this.  For I have.  If I were to win the lottery and a million dollars tomorrow would I be happy.  Would you really be ready to go from being tight with your money to being able to buy everything in sight?  I myself would lose my ambition for hard work and making it to the top, because you were elevated to it from some random number.\n\r\nNo, I will work hard and when the things come to me that I want I will be surprised, but inside I will know that I had it long since coming.  \n\r\nA second part to this song is what I think is a message to all of you people who are religious.  Please don't feel ashamed for wanting to pray or follow your path of belief because you want to better you life.  I mean what are you trying to hide?  I have spent too much time feeling guilty for praying for finding a lover, for being successful, for just being happy.  No need to feel bad, as I don't think a person should be destined to live their life in suffering for their belief.  Unless they choose to.  I can't hide the fact I have followed my spiritual path to be healthier, happier, and to have my needs and wants satisfied.  It's all a part of accepting and loving yourself.  How can you love and accept God, without doing the same for yourself?\n\r\nIf there were no rewards to reap, no loving embrace to see me through, I certainly would have walked away.\n\r\nTo follow your belief, to breathe it, and to let it thrive in you.  It will make you a matyr.  You will have to work.  There are times you will be outcasted and have to suffer.  But I refuse to believe that this will be your entire life.  Because the light will rescue you when you have made the right choices.  And chose that inner path that you feel connected to.\n\r\nWhen I was taught my Merkaba meditation, I was told there were two kinds of people.  Service to self and service to others.  Service to self people are like vampires, they will leech onto you and try to suck your energy.  It's how they live.  Inside they are constantly draining away because they rely so much on others.  I've seen it.  One of my best friends is like that.  He will try to degrade you in front of others just to look better himself.  But people can always change.\n\r\nI know I'm the opposite.  I have an inner energy that keeps me going.  And I happily supply others with it.  But unfortunately, this draws in a lot of these \"vampires.\"  Be careful, and think about yourself before others.  Because you must maintain that balance within you before you can offer help to others.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\ni know that feeling.. i deal with people like that every day at school. sucks ass. i feel like one of very few in this damned hell that is a service to others. i was made a fool in elementary because of this. i'm like.. extremely open and nice and shit. x_x. people use me...but..i've tried to raise a shield to protect myself from that. people have \"leeched\" my energy to the point of suicidal intentions. but..the \"inner power\" of being patient and waiting it out is much stronger than whatever they could take from me. i won't let them do this to me. i am my own. and because i'm my own, people admire me now. =/. i had one friend say that she..well..saw me as a person who became something different, you know.. out of the stereotypes..stood up for what i believed..you know.. that kind of stuff. she looked up to me because i did that...i was kind of surprised when she told me that..cause..i didn't really expect it, truly. i just *try* to be what i can. i try to listen to MYSELF. \"..But our inner voices are yelling.  There's a fist pressing against anyone who thinks something compelling...\"-Incubus - Out from Under.. oi.. this is..going.. out of topic.. x_x but \"Out from Under\" has it's similarities to \"The Patient\". be patient in what you do. simply. don't give up. and in the end, you will be rewarded.\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nI think this song is about a christain who is questioning his faith..\n\r\n'A groan of tedium escapes me, startling the fearful, is this a \r\nTest? It has to be, otherwise I can't go on \r\nDraining patience, drain vitality, this paranoid, paralyzed vampire act's a little \r\nOld '\n\r\nThese lines are talking about a temptation he is having.  A groan of tedium escapes him because he wants to give into the temptation.  He is getting tired of keeping the faith and thats why he explains his patience and vitality are draining.  He is paranoid he might sin and he is comparing christianity to a vampire saying it is leeching his life.\n\r\n'But I'm still right here, givin' blood, keepin' faith and I'm still right here'\n\r\nThis line is obvious as it states he is still a christian and doing good deeds and keeping the faith.\n\r\n'Wait it out \r\nGonna wait it out'\n\r\nHe is stating that he will keep the faith and wait and see what happens.\n\r\n'If there were no rewards to reap \r\nNo loving embrace to see me through \r\nThis tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now' \n\r\nThese lines show that he is staying christian because of the reward.. heaven.  If it weren't for the rewards and people helping him get through(or maybe even prayer helping him) he would give it up.\n\r\n'And I still may' is saying he still might give up'\n\r\n'I must keep reminding myself of this' explains that he has to be constantly reminding himself of the rewards if he wants to keep his faith.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nThis song is fantastic, as well as every other song on the album. Tool is an amazing band. I think that like \"hedonbass\" said... Tool uses a lot of metaphors so that anyone can relate to what he's singing about. This song has made me feel really good when I've been feeling extremely low...  Especially when he starts singing \"be patient...\"\r\nBecause it reminds you that in time, things work their way out.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nmy interpretation is about when u question the path u are taking towards wat you believe is true and on the way there are obstacles but the ones you love will help you along the way and if you \"wait it out\" you will be satisfied,but still u may not,jus don't give up\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nTo me this song is basically him wondering why he chose the path he did. He's obviosly questioning why when he does everything right to his ability, and everyday seems to be the same and nothings changing (But I'm still right here, givin' blood, keepin' faith and I'm still right here). But he won't turn back because hes waiting for the time when he reaches self-realization or extacy. Though i guess no one will ever know except for Maynard.\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\none of the best songs tool has ever made\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nYou are all right. Maynard won't tell you what a song means because it is supposed to be personal to you. That's why TOOL doesn't release it's lyrics right away. They want you to feel the song and have a personal meaning. The meaning is different for everyone. For me, I think of Pulp Fiction, Ezekial 25:17, The path of the righteous man is beset on all sides by the inequities and tyranny of evil men. Blessed is He, who in the name of good will shephards the weak through the valley of darkness. For He is truly his brother's keeper and the finder of lost children....I was raised with a strong Baptist background(my Grandfather was a preacher) and so was Maynard. I understand his questioning of the religion that we were brought up in but the purpose remains the same. We will move forward into our perfect forms in the next step to our existence. Lateralus= Forward Thinking\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nThis song has an emotional hold on me, to me, the lyrics mean waiting to see if life is worth all the pain, and waiting to see if there is some sort of reward at the end, I love this song, i must keep reminding myself of this :)\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nFunny about all the reference to religion. My \"religion\"- is all about how we have free  will and control over our own destinies. This comes with a lot of responsibility, but I also believe that we can choose to either make life a struggle or not. To make it interesting or not. We all have this potential within us, but so many choose to let external conditions rule our lives. This is the vampire. Sometimes it is tempting to forget this and feel like a victim, but I believe that we are truly free when we take responsibility for our own power. How can we heal or create if we are so busy being martyrs? This is for the small minded. Remaining small and meek and a victim does NOT help to advance the human race. But it is a difficult path. I keep thinking of Luke Skywalker... \n\r\nThis song is about temptation- when we are in despair, it is easy to think about walking away from it all. We know we have a higher purpose, but sometimes it just gets so exhausting. How many themes are there in movies and literature and myth about a reluctant messaiah? That's what we all are. They all face temptation- to walk away from their mission. It's a temptation we all face every day. Then you get strength from songs like Lateralus and Parabola...\n\r\nWe are all powerful beyond measure,  not in the small \"ego\" sense- but in the \"higher self\" sense, which we should all take the time to be guided by. Be patient.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\ni thought the meaning was quite simple really (in my eyes slash ears) basically (i think) it is about a person who feels that they have nothing left to live for. 'is this a test?' questioning life if it is a test 'it has to be otherwise...etc' can't go on - well obviously the voice of the song will commit suicide.\r\n'the tedious path' - this path being lifeas a whole, i'm sure most of you people find life tedious frequently. \r\n'If there were no rewards to reap \r\nNo loving embrace to see me through \r\nThis tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now ' \r\nhlaf way through the song he says 'i still may' still may kill myself however after it is mentioned that the voice of the song must keep reminding him/herself that there really IS something to live for and that they'll be patient and wait it out. \r\nhave fun \r\nxxx\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nMusically, this may be the best song on the album.  So many good ones though.  To me it's just another journey Maynard takes us on, trying to shed light on his realities.\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\ni think i read that maynard said somewhere that this song is about the legal battles that tool had to go through between aenima and lateralus\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nMy boyfriend is the one who told me that this song is about maynard debating wether or not to leave tool, he honestly doesnt want to because he does love writing but he is saying he would of givin up by now. so i agree with you Harry Manback!\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nNO OFFENSE TO ANYONE BUT IF YOU KNOW ANYTHING ABOUT TOOL OR A PERFECT CIRCLE YOU WOULD KNOW THAT *JUDITH* IS MAYNARDS MOTHER, WHO RECENTLY DIED. THIS SONG IS ABOUT HOW HE FEELS ABOUT GOD TAKING HER AWAY FROM THE WORLD. \"FUCK YOUR GOD\" HAS NOTHING TO DO WITH REGGING ON RELIGIONS HE IS UPSET HOW HE TOOK HER AWAY. \"YOU ARE SUCH AN INSPIRATION FOR THE WAYS THAT I WILL NEVER EVER CHOOSE TO BE\" EVEN THOUGH HE HAD PROBLEMS WITH HER IT STILL HURTS \"STILL YOU PRAY NEVER STRAY NEVER TASTE OF THE FRUIT never thought to question why\" HE IS SAYING SHE NEVER DID ANYTHING WRONG WHY DID YOU HAVE TO DO THIS TO HER \"ITS NOT LIKE SHE KILLED SOMEONE\" oh by the way the APC concert is fuckin awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nSORRY WROTE ON THE WRONG PAGE!!! I WAS WRITING ABOUT JUDITH A PERFECT CIRCLE\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nmy personal opinion is that maynard wrote this song for you to interpretate it however suits you best, i think it's another song like schism where the meanings are endless and i think that he wrote this song, and a lot of his other songs, for the fans to have something to connect and relate to however they can.  That's my personal opinion, i may be wrong, but i dont think it really matters as long as u can find some way to connect to the song and see it in your own ways. i think maynard is a musical genius and he has gone beyond my expectations so many times.... it's really hard to take a lot of other bands seriously after hearing some of the stuff maynard writes... a lot of his stuff goes so much deeper than any other band i've heard.... which is why i think that this song can mean anything... and nobody is wrong because what u think only has to be right for yourself and you shouldn't worry if that's not what maynard had in mind when he wrote the song, as long as you can connect on your own level. i think it's great\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nI like what hedonbass said 3 years ago:\n\r\n\"by hedonbass on 01-19-2002 @ 07:32:14 AM  \r\nI like the ideas everyone. But i have another view of this song. It seems to me that Maynard always uses metaphors in his songs to allow everyone to relate them to thier lives. In my case this song is about being close to someone but they aren't ready to go further. Bordem has set in \"teduim\" because the narrorator wants to go beyond where they are. But the other person is afraid, and is simply using that as an excuse \"paranoid, paralyzed vampire.\" He keeps reminding himself that there is a reason he is still here, the love and possibility of moving further \"if there were no reward...\" if it wasnt for that he would have surely moved on to someone else, and he still may, regretfully.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\numm, okay, I like think that this song is about like patience.  Not like the kind in a doctor's office.\n\r\nHonestly, I don't know what else there is to say about it.  The lyrics are entirely simple.  But that is all that is needed to speak the truth.  Isn't this really the basis of life?  To be patient?  Sometimes it just feels like too much to bare ... always just waiting.  Perhaps it's just me, but I've never been anyone else so I don't know - but waiting is all that I've ever done.  And this song is really comforting.  Sometimes I forget that life has benefits, that there are things worth waiting for.  Sometimes I feel like I'm never going to get anywhere, like it's always the same - I'm just waiting and waiting forever (and HOW tedious).  Like, right now I am waiting and it feels almost impossible to take.  But I realize that I'm still here, that I'm waiting anyway.  It's not always so bad ... looking back the waiting has done...something...maybe very small, but something is all I need.  I've gained so much, why give up the wait now?  \n\r\nYou can take the song as subjectively as you want, but there is only one interpretation behind it by anyone here - the song is about being patience, and the reasons for be such.  There is really no contraversey on that one.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI completely agree with Philidelphia and Hedonbass on this one.This is the first Tool song that really got me into the band, and therefore my favorite, I am on my way to loving them all, but it's coming slowly, and knowing that I need to be patient and wait it out is indeed tedious, but still worthwhile.\n\r\nI did see it as waiting and being patient while your significant other prepares to take it to the next level with you, and I still do.\n\r\nBut once your life changes and you're single again, you might take it as waiting on the other person to come back to you, asking:\n\r\nIs this a test? \r\nIt has to be, \r\notherwise I can't go on \n\r\nof course, that phase only lasts a short period of time, then, if you listen to the song again, and you've given up on their reciprocation, it moves on to be the subject of whether or not you even want to continue living and loving like you did before:\n\r\nIf there were no desire to heal \r\nThe damaged and broken met along \r\nThis tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now \n\r\nOK, you're still here obviously, and you haven't walked away yet, so now it starts over again. You become close to someone again and ask yourself the same question you did however long before:\n\r\nI must keep reminding myself of this... \n\r\nIf there were no rewards to reap\r\nloving embrace to see me through \r\nThis tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now \n\r\nIt's something you continue to do, because there is some benefit from it, rewards if you like, and it's probably something you need, which is why you've done it before\n\r\nI know that most likely didn't go along well with the Tool theme, but it seems to be somewhat logical.\n\r\nDefinitely a Gorgeous song. If they were to make an MJK Limited Edition Dictionary/Thesaurus, and you looked up any/all of the words: beautiful, perfect, breathtaking, awesome, Deep, Insightful, or just Plain SiCk, you would find \"The Patient\". Without a doubt.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\ni am listening to this song write now. to me, the patient has to be on of the most beautiful songs Tool has produced, and i think it is because every living human can relate to it. just like most other songs. apart from the fact it makes me feel so incredibly wonderful, as they are all extremely talented musicians in their own sense, the lyrics bring me back to relaity. \r\nevery living human feels  and grows through some sort of pain, and this song drives me, and hopefully others, to realise, that the best way to live through it. is just to wait it out and be patient.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nProbably the best tool song ever written.  About how you need to enjoy life and remember what is to come afterwards\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nYeah, this is probably Tool's most underrated song. It's just about being patient and never giving up on life, and that your time will come. You can just tell yourself that good times will come. This is an inspirational song for me. I always give it a listen when I need to alter my pessimistic worldview. Life is like a batch of flowers, some flowers bloom right away and others will take longer. But eventually everyone of them is blossomed, beautiful, and properly functioning. You just have to realize that maybe your time just isn't here yet but it is rather awaiting sometime in the future.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nMaynard's voice is like a surgical knife cutting away the overgrown untended shit that is holding our souls down.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nTool is just a bad ass band and Maynard is an awesome song writer. Just enjoy the music, I think everyone can relate to it in their own way. Thanks!!\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nObviously losing faith in the path we've been chosen. I do agree with the religious interpretations of the song, however, as in losing faith in God. What if we follow a religion, because we've been promised so many good things? What if the promises we have been given are never fulfilled? We keep on, because we are uncertain of our future. No matter how much we doubt the path we follow, there are those who keep their devotion, because they are patient and know that the promises they have been made will be fulfilled.\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nAlthough I don't think it is the actual meaning of the song you could almost apply it to someone that has admitted themselves into an asylum:\r\n'If there were no desire to heal \r\nThe damaged and broken met along \r\nThis tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now'\r\nAnd you could also take the word patient and use in in it's other context. I think that would be too much of a literal intepretation for a Tool track. Although this isn't one of my favourite Tool tracks it's still awesome!\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nit's about how sometimes we all go through painful periods in our lives, hard times, and depressions...so we should sometimes accept it and \"wait it out\", because eventually, things will get better and there'll be something big and exciting in the future to look forward to...but you have to be patient.\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nI really think it's just about a person ready to give up on life.\n\r\nWhen you hear the title \"The Patient\" you don't think of patience, you think of a person in a hospital room about to undergo surgery.\n\r\nThe patient is about being a patient in life, waiting things out until your diagnosis comes, and hoping it will all be for the best.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nthis song, i think, is about having patience in life.\r\nno matter how fast you want to things to pass by because something bad has happened, or because you don't want to deal with it, just be patient and then you'll feel rewarded after your patience.\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nMy feeling is that the person is in an abusive relationship or something similar. he is still \"keeping faith and giving blood\" to try to make it work, always hoping it gets better in the end.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nWell alot of people are correct in saying that the song can have many different meanings. It's not only Maynard's poetry, but all poetry (lyrics) have the advantage of meaning nearly anything to each specific person and their situation. Sometimes a song will even have one particular meaning to you, then it can mean something totally different at another point in your life. \n\r\n But as far as what it actually means to Maynard himself... we may never know. But I suspect that it just might have something to do with his helping/healing people through his music/poetry, which is more evident when we look at this specific line in the song as a single sentence with a few added words and without capital letters in front of each line, making it appear as separate sentences.\n\r\n\"If there were no desire to heal the damaged and broken [people that I have] met along this tedious path [that] i've chosen here. I certainly would've walked away by now\"\n\r\n But one thing is for certain... Maynard is an exquisite singer and writer of poetry. Seeing them live is the equivilent of taking LSD, and will give you chills and the most wonderful sensation of being alive. As my best friend once stated, \"Maynard knows things\".\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\ni agree with Beowulf_Xtreme.\r\nhe doesnt mean anything specific. everyone who gives away his \"blood\" will stumble over vampires that want to suck your blood and use your good will for their avantage. its about keeping in mind why you started in the first place and trying to see them as a test.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nYeah, I think... and, obviously I'm not sure and possibly way off... but, I think that this song, although it would be a pretty good tie to the whole lateralus therapy tie-in thing, is another mockery of christians. Being patient and waiting it out, working on this tedious path that I'm only taking because of the rewards to reap (if the path is true at all)... maybe nobody else will see this song the way I do but... yeah... so... there... somebody tell me that this isn't that stupid... or do tell me that it is... u know really... stupid...\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nAmazing Tool song. I listen to it whenever I need a lift. Whenever I need encouragement to see something to the end.\n\r\nPersonally, I think Maynard wrote this speaking of the record company/fans, but as with most Tool song, we can all find our own meaning of it.\n\r\nCan't wait till May 6th!\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nWaaaaait...scratch that, the 2nd. Dunno what I was thinking :-\\\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\n..maybe, my favorite Tool song...like most others, it can have multiple meanings.  I definately see regilous undertones.  The tedium of waiting on a god that never shows him/herself, and how he has to keep renminding himself that he is supposed to have faith, and how it is difficult to keep the faith, with all that he has seen, and he is still not quite sure if his faith is justified, or not.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\nI could see this song as sort of a first person of a priest.  Sure they're enlightened and all that but everyone has trying times.\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nI just want to note that around 4:30, Maynard repeats \"namaste\" twice since this is not in the lyrics above.\n\r\nMy belief in the song's definition has already been discussed, interprete it as you wish.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI'm not going to read the four pages of responses, but the first response by schism86, maynard tells us it's about the vampires we come across in life.  If any of you have read The Satanic Bible by LaVey, you may remember the portion about psychic vampires.  If not, just google \"psychic vampires,\" I'm sure you can find an appropriate definition.  After reading an article about this subject, the lyrics become clear.  I'm not saying that this is what maynard was trying to get across, but it does seem to be a subject that the lyrics could speak of.\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nThis has gota be a favorite of mine. truly and inspirational and motivational number, and it has positive meaning to it, somthing rare in a tool song (the only other i can think of off the top of my head is H) I agree with toolsalesman when about 2 pages back he said \"You are all right. Maynard won't tell you what a song means because it is supposed to be personal to you.\" thats what makes their music so great. when i go out looking for music, i go out looking for songs i can relate to, which is why cat stevens and gun n roses are still near at the top of my list.This song is The patient is great for me because well my life is sorta like that, my gf dumped me cos her plate was way too full with her dad dying of cancer and all nd she needed  some space, so wenever i feel that urge to abuse her over the fone etc, out comes The Patient. The Album Lateralus is full of songs that are easy to relate too as well, definatly my fav tool album. \n\r\nTOOL ARE COMING TO BIG DAY OUT NZ!\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nThis song is about this girl and she gets married and has a couple of his kids, but then her husband turns out to be a lazy bum. So she goes to school, learns how to program and starts working two jobs so her kids can have a comfortable life.  Then her dad dies so her mom lives with her.  She gets a job that pays ok, but she has to work at least 50 hours a week at one job, 12 at the other. Her husband can't understand why she doesn't want to have sex with him, so gives her crap for that. She works all these hours, sitting on her ass in front of a computer. She sits and stares at the code all day.  Groans of tedium escape from her lips.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\nI dunno how you managed to get all that from this song... But okay...\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nThis song is refering to an Alex Grey performance, which he called \"The Prayers Wheel\", in it Alex and His wife Allyson are tied and walking around a budhist praying wheel. They hold a knife and a fake baby with a skeleton straped to their back and they are all painted gold. At the end of the performance Alex takes the nife and cuts the rope and they all walk outside the circle. This shows that he always had the option of leaving his beliefs and he finally has had enough and walks away...I am still confused about why they were painted gold, and I doubt very much it was for shock value, or just smokes and mirrors, yet I think the gold does not play a part in this song.\n\r\nPS. in explaining this performance in TRANSFIGURATIONS he uses the word Mantra alot, and I will look into that...\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nwhen i listen to this songs it makes me think of someone who is dissatisfied witht the the person they have become (ex. this paranoid, paralyzed, vampire act's a little old). and even thought they recognize their issues with themselves they take no action to change (gonna wait it out).\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nI see this as a reminder song. A reminder to not lose faith because the obstacle is a trial.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nWhen I hear this song, I always think of how selfish man can be; someone does something good to feel better about themself.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nREAD AND LISTEN TO THIS!!!\n\r\n7812569103411/67584131221911310/15\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nTool: The Cyclic Playlist.\r\n6,7,5,8,4,13,12,2,1,9,11,3,10 / 15 / 7,8,1,2,5,6,9,10,3,4\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nThis is such a great song. \n\r\nIt describes keeping faith even though you're in a black hole..\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\nI agree with SpiralOut and I have always listened to this song when i was down, and never knew why, but if i think about it, the part below is true, if there were no rewards to reap i certainly wouldve \"walked away\"(taken my life) but i keep reminding myself there is still things to live for and that this \"vampire\" of a down feeling though draining is starting to get old. This song makes me realize how dumb people who commit suicide are, i mean they may have their own reason, but if they could find just one thing to hold on to they couldve gotten out of the pit of depression, ahh im ranting, but anyway great song!\n\r\n\"If there were no rewards to reap (I must keep reminding myself of this) \r\nNo loving embrace to see me through (I must keep reminding myself of this) \r\nThis tedious path I've chosen here (I must keep reminding myself of this) \r\nI certainly would've walked away (I must keep reminding myself of this) \r\nBy now\"\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\n\"Suicide is a permanent solution to a temporary problem.\"\r\nCan you believe I got that from Reno 911?\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nI listened to the Lateralus album when I took some mescalne, and it was an endurance test a lot of the time. Mesc is taken to dive deep into your thouhts and face your fears, and then accept and heal the damage. When this song came on, it was like Mayard was experiencing the same thing I was, and was guiding me through the pain. The entire album is like a guide for getting through the mind trip.\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\nOne could say their albums are a 'Tool' for geting through a mind trip.\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nhappy birthday to Maynard!\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\nKEEPING FAITH is definitely what this song is about. Oh DAMN when was Maynard's birthday???\t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\n\"At the Sydney show in july this year, before they played this, Maynard said something like this song is about the vampires that you come across in your life, who try to get you down. Hence the use of \"giving blood\" in the lyrics. It could be to do with the record companies and the industry.\"\n\r\nWhoa, Maynard actually said something? I've seen them three times, two times he said literally nothing and another it was just like a few sporadic words.\n\r\nBut yeah, I kinda get the whole people try to feed off of what you do, and shit can be real hard, but he just wants to keep trudging on for whatever outcome is in store.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nto ME ,  almost the whole album is about sex, hence lateral-us, and this is about premature ejaculation, but it IS tool and it also probbly has a double entendre.\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nBefore I describe this song, I want to talk about how I feel about the first three Tool albums.\n\r\nI consider them really to be a trilogy that charts an emotional and spiritual journey.  The first album, Undertow is a very angry and sullen album about going through the grief in your life (hence the Undertow, it pulls you down).  Their Second album Ã\u0086nima is more or less purifying yourself of your troubles and past and seeking a new life.  Lateralus is the point where one actually attains that new life and higher state of being.\n\r\nThe Patient works into Lateralus by telling the story of attempting to remain true to that one last aspect of your old life you always sorta liked (perhaps religion, but not necessarily religion) and you're slowly realizing that it's hurting you or you don't need it, and coping with letting of of that one aspect.\t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\nSPOILER ALERT: We may never know.\n\r\nKnowing how Maynard writes, it's probably something that affected him at the time that we may never know about.\n\r\nI like to think that \"the patient\" refers to those willing to wait whatever it is out, as well as a patient in  hospital. Patience can be as tedious as being bedridden in a hospital. The drawn-out nature of the music itself (which must always be taken into account when considering song meanings) seems to draw out this point.\n\r\nOn a sidenote, I'm seeing Tool at Amway Arena tomorrow. It's gonna be fuckin' ACE.\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nAlso, I love xEeyAhm's take on the first three Tool albums working together. But how do \"Opiate\" and \"10,000 Days\" work into this?\n\r\nWithut giving it much thought, I think \"10,000 Days\" is more of a social commentary than anything, like Maynard saying, \"Why doesn't everyone aspire to a state of being like the one illustrated in 'Lateralus?'\" \n\r\nWith songs like \"Vicarious,\" about an era of TV-driven zombies, \"The Pot,\" about a corrupt and hypocritical authority, and \"Right In Two,\" about humanity's pointless squabble over everything, I think it's a safe bet.\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nto me, the subject is a follower of an organized religion, feeling guilty about doubts they're starting to have.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nthere's many different meanings to what it could be, so not one person is right or wrong. I just finished a book called, I Am Legend by Richard Matheson, and if any of you know what I'm talking about, this song would be perfect for the movie that's coming out in December.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nthis song to me is about sticking to your guns no matter what \"this tedious path ive chosen here, certainly would have walked away by now\"\n\r\nkinda figures, but as with every other tool song the meanings are endless\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nReconciliation sums up the entire album (to me). It may just be the situation I'm in but it almost sounds like something went bad between Maynard and someone really close to him and instead of just giving up and walking away, he's going to wait it out. He feels if he waits something good may still come out of it but he's also tired of holding on and wants to move on. \n\r\nI almost feel as though I'm living the experience. Again, I'm in a similar situation, of course I was also born 17 April too (same day as Maynard). It's an astrology thing. You wouldn't understand.\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nOkay, so tell me if my situation has any relation to this song. \n\r\nAt this point a girl I was seeing is quite mad at me for something that I did wrong. No, I did not cheat on her but basically just made her out to be the bad guy. Thus she has not talked to me in almost a week. I'm pretty upset by the whole situation. I know I screwed up and only wish to explain myself and apologize for what happened. She's not spoken to me in almost a week, I hope to one day speak to her again yet, I also get the feeling that she will not allow that to happen. My feelings are to stick it out and hope that I will be able to reconcile my wrong doings but at the same time I also feel that she'll not allow me that so I should just \"walk away\". Tell me that my situation has no relation to this song. \n\r\nMy point is that Maynard and I had a very similar situation. Great song to listen to in my situation.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\ni listened to this song differently after 10,000 days. could it possibly be about his mum? it must have been a shit time for him, could he be saying that he had thoughts of pissing off and abandoning her? the paranoid, paralysed vampire line might mean that her being unwell was draining him. he also talks about the loving embrace which made me think it could be her. the patient probably refers to her being the patient and him being patient. who knows? anyway, it was on mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nThe song gives me goose bumps, I have lived through something like what's in this song. Necessary background -  the album was released in May 2001, In June 2001, I asked my fiancee to marry me. In July 2001, I got very ill, was diagnosed with multiple sclerosis and spent three weeks in the hospital. I had a lot of depressing thoughts during that time and this song helped me get through. The \"tedious path\" I chose was to live and fight this disease. My fiancee (wife of five years) was/is the \"reward to reap\" and \"loving embrace to see me through\". \"I certainly would have walked away\" if I did not have all the support and encouragement of my wife and my family. The repetitive, ''I must keep reminding myself of this\" is such a call to keep battling through this and that I have this \"desire to heal\". I have never felt such a personal connection to a song. The \"and I still may\"'s toward the end followed by the exasperated \"gonna wait it out'''s sum up some of the mental tug-of-war in my head, like 'do I really want to live with this?' and 'of course I do, this is really not so bad.' . I AM gonna 'wait it out', and hope there will be a cure.\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nthis song can represent a large part of all my life.\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nI just listened to this song for the first time a few minutes ago.  I really like it and i agree with a lot of the other interpretations of this song and i think that they're all right, thats what i love about tool/apc.  You can connect to all of their songs.  I personally like to think that it's about a man losing faith in his religion but trying not to stray away becuase if he does it was all for nothing.\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nFor me this song is about Perseverance in the face of a challenge with assured positive goals at the end. For me said challenge would be courtship with women, always a challenge but always assured, but I suppose I could apply it to hard work in any respect, whether it be office work, design, homework, etc.\r\nthe 'vampire' mentioned for me would be the mental sapping one experiences while trying to concentrate/exerting mental energy (burning carbs)\r\nAnyone who listens to tool while they get high can forget how to swim and drown in arizona bay, beetchez\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nNone of you guys must be hypochondriacs--ever been in the ER? This song isn't about religion--I don't know why everyone turns tool songs into anti religious messages--You guys should study sacred geometry..if you want to really find out where tool is coming from--and what all those funny symbols and shapes they use are..lets just say they are not just there because they look cool. Sorry for being a condescending a-hole--and not explaning the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\nyo, icosahedron, wouldya care to explain some of this sacred geometry? you've piqued my curiosity.\r\ni've always thought the art on the albums was very odd, and must have some sort of significance to the music, the lyrics, or their sense of spirituality. son please do tell. :]\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\ni meant so, not son. sorry.\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nTo truly understand the meaning of music, you must not only listen to the lyrics but also the music itself. Melody plays a major part in all creative art. \n\r\nA man, broken, bored, and tired. The repetition of challenges, like scattering marbles across tile flooring- causing him to trip and fall, and become frustrated. \r\nHis path, difficult, repeating, and tiresome- as he waits for the reason of his existence. \n\r\n\"If there were no rewards to reap, no loving embrace to see me through. This tedious path I've chosen here. I certainly would have walked away by now.\"\r\nIf there was nothing to gain from his path, no loving person or creature to support him, he would have 'walked' away. 'walked' possibly meaning suicide or \"giving up.\"\n\r\nThere is alot of spirituality mixed into this particular song, but I also believe it could possibly relate to maynard's own life. Just the melody alone shows emotion in certain parts of the song. This is one of the main things that I absolutely adore about Maynard's music. How he can take emotion and put it into music so easily with words to match and literally 'paint' a picture and a situation with melody and writing.\n\r\nAbsolutely beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\nwell yea, i agree with u tWatchingOne. But the part about \"no loving embrace to see me throught\" i see it as a metaphorical usage of anything that is \"good\" . Any 'salvaged good thing by u r subconscious' in that good i count \"loving person or creature to support him\" ^^\r\nWell i mostly saw this song throught autosuggestion and being optimistic and patient. Well to me those 3 things are kinda universal for achieving beneficial things in life. this life, as bill hicks said life is BUT a dream ;P . But anyway whole lateralus is some proces of 'ageing' or evolution from a lower state of imperfection and vice to a higher state of enlightenment and perfection.\r\nDamn, i always melt when i hear that vulnerable voice singing \"I must keep reminding myself of this ...\" and \"and i still may, and i still may..\" I hope it will reflect on me ;)\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nah, i melt aswell... but more so upon hearing the opening words: \"a groan, of tedium escapes me...\"\r\nso emotional...\r\nby the way, has anyone noticed the adverts that are at the sides of this page?\r\nthings like: \"are you a vampire? be awakened, free\" and \"become a healer\" etc... is that what google views tool fans as being like?\r\n:/\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\nlooks like i ignore that :o\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\nand i dun think it views tool fans as being alike ... it's just a random advertise :P\r\nsome ppl will understimate the band, saying some rubish taboos about them cuz their flippancy to their music and lyrics. Some man said about this band that \"they are sect band cuz they are sending bad words through metaphor like album Lateralus o.0 . If u r christian, they are salvaging potential victims i n a perfect way :P . Like the band have a great lure (music, vocal, lyrics), simply magnetize the listener, have hypnotic effect, react on psyche in bad way, amplification depression at listener, no will, passive, aggression, lethargy, filling wrath, anger.. Look at their videos, so dark, dark, dark, bloody and perverse.\"\r\nThose are the ppl who watched too much television -_-\r\nIt's always the same, they are divergenting things like christianity said, if someone is speaking against us it's Satans work, remember that kids, what u r learning from us is pure truth :P . We are the system and we would like u in, cuz we need money to build churches, so we can manipulate u ppl. Forget the nature and dun explore man's probability. Easy accept our story and dun explore, dun even think it's dogmatism  or u will burn in hell :D . Ppl know better christianity then them selves. ye it's easy to accept someone's view of reality :P\r\nAs u all saw objective words for the Patient, some ppl can't accept it as method of succes cuz their subconcious is blinded with only one thing, that thing that u heared on TV, or mostly medias, through advertise etc. I rly like when Maynard mock on them. And why alwasy those things sect, religion.. Why i can't be part of the nature ? is that a \"sin\" ? who discover that word anyway ... A template that all puts us in delusion.\r\nEven before tool i was like this, Tool was one step further for me. I feel aggressive, passive, filling wrath, anger ? ahaha :D yea, i m surely some kind of a monster :D\r\nthink for u r self, question authority ;)\r\n(sry for bad english)\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nand i dun think it views tool fans as being alike ... it's just a random advertise :P\r\nsome ppl will understimate the band, saying some rubish taboos about them cuz their flippancy to their music and lyrics. Some man said about this band that \"they are sect band cuz they are sending bad words through metaphor like album Lateralus o.0 . If u r christian, they are salvaging potential victims i n a perfect way :P . Like the band have a great lure (music, vocal, lyrics), simply magnetize the listener, have hypnotic effect, react on psyche in bad way, amplification depression at listener, no will, passive, aggression, lethargy, filling wrath, anger.. Look at their videos, so dark, dark, dark, bloody and perverse.\"\r\nThose are the ppl who watched too much television -_-\r\nIt's always the same, they are divergenting things like christianity said, if someone is speaking against us it's Satans work, remember that kids, what u r learning from us is pure truth :P . We are the system and we would like u in, cuz we need money to build churches, so we can manipulate u ppl. Forget the nature and dun explore man's probability. Easy accept our story and dun explore, dun even think it's dogmatism  or u will burn in hell :D . Ppl know better christianity then them selves. ye it's easy to accept someone's view of reality :P\r\nAs u all saw objective words for the Patient, some ppl can't accept it as method of succes cuz their subconcious is blinded with only one thing, that thing that u heared on TV, or mostly medias, through advertise etc. I rly like when Maynard mock on them. And why alwasy those things sect, religion.. Why i can't be part of the nature ? is that a \"sin\" ? who discover that word anyway ... A template that all puts us in delusion.\r\nEven before tool i was like this, Tool was one step further for me. I feel aggressive, passive, filling wrath, anger ? ahaha :D yea, i m surely some kind of a monster :D\r\nthink for u r self, question authority ;)\r\n(sry for bad english)\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\noh, i m sry, but my i-net laggz too much :(\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\ni don't mind the bad english freshownage, your ideas are intelligent. i can't believe whoever said that shit about tool! like, oh my gosh, tool are subversive?\r\ni SO didn't realise.\r\nXD\r\nwhat a retard. what's his name?\r\nand yes, i too hate the idea of sin.\r\nimmutable morality is the bane of rational thought, the very opposite of thinking for yourself.\r\nin religious education at school, we are learning about \"moral truths\".\r\ni'm refusing to do the work, on the grounds that the pretence of the lesson is a lie.\r\nmoral absolutes do not exist.\r\nbut that's not to say that i, as an atheist am evil.\r\nit's actually rational and  beneficial not to hurt anyone.\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nnice, perfect said about it ;) and ty\r\nBut anyway i dunno who was that 'retard', dunno his name. I red on some forum, he wrote that. I can link the forum too ya, but it's on Serbian language :D and it's kinda old :o (2006)\r\nAnd yes i do melt on that opening words \" a groan of tedium escapes me..\" :D\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nooh, are you serbian? \r\nmy dad got a book published over there.\r\n(i'm english)\r\nback to the meaning, what do you really really think this song is about?\r\ni'd be inclined to say it has elements of his mother in there, in the same way as wings for marie...\r\nit's like, she's a hospital patient, she's in pain, it's tedious, (she can't move or anything) for 10,000 days, but she wouldn't end it or walk away, because she thinks there's a reward at the end of her suffering.\r\n?\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nwow nice, what book ? \r\nYes i thought that 2 on the 1st sight of this song, when i 1st time heard it i thought of Keenan's mother. Was long time ago when Keenan wroted that. Ok we can relate to his mother in some way, but we all know she was revealed to Christianity and its dogmas. What is really really about ? well i wrote that on my 1st post of this page and i'll include what theWatchingOne said 2 ;) to me yes. But the words are so f*** objective that i can't realise i must dig more ...\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nah, it's called Foxy-T.\r\nit's meant to be wuite good.\r\n(i haven't read it).\r\nyou're right, the words themselves don't give much away...\r\n:/\r\nxx\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nI am going through an Orthodox conversion to Judaism. Unlike most religions, Judaism does not proselytize in the least bit. In fact, they actually dissuade converts. It is nearly impossible to convert to Judaism. What I am going through right now seems to be the meaning of this song to me. If there were no rewards to reap, I certainly would have walked away by now. This tedious path I HAVE CHOSEN here. I (should have?) would have walked away by now. But I simply can not walk away from something I believe so strongly in. I must be patient, wait it out, and the powers that be have my life in their hands, and I must trust in G-d and that fact.\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nthe watching one, your interpretation is brilliant. and youve made me realise that i can relate to this song more than i thought i could. this is my favourite tool song, and incidently one of the best songs ever written, absolutely beautiful, faultless. thank you tool\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nThis song is about life.  You continue to press on in your mundane existance.  Forever hoping to help someone or change things.  Maynard states that that is what keeps him going and what keeps him from just walking away (killing himself presumably, because life is a usless exercise).  He keeps that on the table \"i still may\"  BUT, he's going to be patient and wait it out to see if things get better.  Pretty Straight forward for a Tool song.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nI was looking at the lyrics for this song today, and I thought, well, theory-wise, that it might be something SIMILAR TO THE SITUATION offff:\n\r\nLike, for example, it could fight into the scheme of, someone in sayyy, drug rehab. They've put themselves in there, they know, and believe in the fact that there is something better, but in the end they know that they are going to go back out and do what they want to do. \n\r\nIt could vary off of rehab, but it seems to make some sense, \"I certainly would've walked away\r\nBy now\n\r\nAnd I still may\"\n\r\nBut, I'm still confused by the 'vampire' bit in the first line. Faith may have something to do with doctors and all that great stuff, but knowing Maynard and Tool I doubt it's something that simple. Oh well~ An interpretation is an interpretation.\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nI think this song is about his paralyzed mother. it is told from her point of view. He mentions \"Paralyzed\" and \"waiting it out\". She has to keep reminding herself to be patient, and stay faithful to god. she thinks that if she waits and keeps her faith long enough, God will heal her, (or something similar). Also, the title could be interpreted as The Patient\"(as in those who wait), or \"the Patient\"( as in a person in a hospital)\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\nto me, it's about getting off drugs. like the treament program i'm in right now for alcohol...it's six fucking weeks. you have to get through it for the reward and to heal...but there's still a chance you might walk away from it...\n\r\nIf there were no rewards to reap \r\nNo loving embrace to see me through \r\nThis tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now \n\r\nGonna wait it out \n\r\nIf there were no desire to heal \r\nThe damaged and broken met along \r\nThis tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now \n\r\nAnd I still may...\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\nyeah, i agree with blind x...\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nalright well this is hard to describe as a meaning but everytime i listen to the patient ( as with every single tool song ever) something amazing happends. only this time my mind is always fixed in on a certain part of the song... @ 2:21\r\ne-------------------------\r\nb-------------------------\r\ng-------------------------\r\nd--3--0--5--7-----------\r\na--3--0--5--7-----------\r\nd--3--0--5--7-----------\n\r\n...when Adam plays this part slow its not as if hes playing slowly in real time...its like hes playing normally...in slow motion. think about it when you listen to the song it sounds way more natural and flowing...invision it in your head thet adam is playing normally and its being slowed down audibly and visually. \n\r\nso everytime i hear this that always affects how i feel about the song. that part mirrors the song in some ways for me.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nyo\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nI think this song is about why people cling to religion and feel that there has to be more to life in order for them to be something. \"Is this a test, it HAS to be, otherwise I can't go on\". Religion robs people of the open mindedness to explore what else they could be doing with their lives. besides praying and paying the church in blood.\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\nTo me this song has to do with the struggles of trying to better oneself. In order to better oneself, one needs to break away from his old habits and fears and overcome and conquer our fears that our subconscious holds. Overcoming and conquering those things which we fear, and confronting our own feelings about issues which are subconscious take a lot of patience and is not an easy thing to achieve. But the end reward is spiritual enlightenment. Its worth the wait\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\nIt's about the prospect of something better after life, similar to Parabola. It's basically a person weighing the options: death being absolute, or death leading to something else, and the person is trying to keep faith, trying to convince himself there will be something better, something to look forward to, a future after death, because, otherwise, everything the person has lived for, everything he has suffered, every obstacle he has overcome, every time of happiness, has all been in vain if there is nothing after. The person thinks that, if there is no experience after death, then life is irrelevant, a insignificant fleeting dream with no ultimate direction.\n\r\nI think this is a decision or a belief that everyone must  make at some point in their life. Keep in mind, I'm absolutely certain Maynard isn't referring to religion. In fact, Maynard seems to stick well clear of it. I think the parabola that Maynard has explored in Lateralus is simply a very abstract concept of hope. It's definately spiritual, but it's not religious. \n\r\nIn this song, Maynard seems to rest on a point with his choice unmade. It seems as though he is almost despairing because, although this 'parabola' is a source of solace, he can't quite bring himself to believe it, or he is at least having doubts.\n\r\nAs for me, I'm an atheist and I think there isn't anything 'supernatural' beyond the end of life. However, in the end, aren't we all just stardust anyway? We are immortal. We will always be here, in one form or another. Whether we are conscious to experience it is irrelevant. We have our time to live, and when it is over, our ashes, our legacy, will become the foundation for the lives of others, the foundation of the universe in fact. So what's there to despair about? I couldn't ask for a more beautiful legacy.\t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nI think this song is about being paitent, keeping your hopes and faith, and not giving up, even though you're on the verge of giving up.\n\r\nBut for what reason?\n\r\nThink for yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nThis whole theme of this album deals with communication and the human experience.\n\r\n\"The Patient\" is about the bad people you come across in life, the ones that try to pull you down, and having the patience and the fortitude to deal with them and move on.\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\nThis song is about someone who is all in their head. And the want to heal is the want for normalcy. Its a tedious path because  He has to keep reminding himself that he can't do it like that anymore. He says to be Patient because  it seems like it happens over and over he's doing things that will get him stuck with his thoughts he dosnt  want  be in his head anymore he wants reality\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nI see this song as meaning that what Keenan wants in life is someone to love him (If there were no rewards to reap, No loving embrace to see me through), and to feel he has a purpose (If there were no desire to heal, The damaged and broken met along, This tedious path I've chosen here) which he does have however at times he feels like it just isn't enough (I certainly would've walked away, By now, And I still may, And I still may)\n\n\n", "comment_153": "\nthis song is about a suicidal person who is close to doin it, but dosnt because they feel that they have a purpose.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nMy take is that this song tries to envision what force keeps medical practitioners going, after years and years of taking blood (from patients) and giving blood (their dedication towards healing the sick), maintaining the faith even after watching patients die despite their best attempts at saving them. It's a tedious path, that of a surgeon, whose craft often means life or death to the patient on their table. Were it not for the rewards of occasionally getting to witness the loving embraces of family members relieved to know their loved ones will be okay, this song suggests that perhaps the constant stream of death would be too much to bear, and a normal person would have walked away. This song, to me, means that the miracle of saving even one life makes up for the frustration of not being able to save 10 more, and that's the force that keeps a human being from giving up and walking away from such an unpredictable field such as treating terminal illness, where the odds, in most cases, are stacked against you.\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nHere's what I think it's about, this is just me though, no offense to anyone else.\n\r\nI've always looked at this song as being about addiction, with such lines like \"You left me with no desire to heal\" and \"Wait it out\" having strong meanings. \"Giving blood\" could mean selling the essence of what keeps us alive for some other kind of gain, \"Vampires\" being a metaphor for the life we suck out of ourselves through addictions. The whole \"faith\" aspect is metaphorical as well, not so much religious, but personal, and dealing with rendering yourself free of all hazardous dependencies. The line \"No warming embrace to see me through\" sings volumes to me on a personal level. This song says a lot to me, and it really hits home when I look at myself and past addictions.  \"Is this a test? It has to be, otherwise I can't go on\" says so much about how damaging an addiction can be and your own personal limits being tested. This is one of my top 5 Tool songs, I always feel likes it about me in a small way. \t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nI think its simply about facing lifes challenges and carrying on. Life is challenging, but we learn so much from overcoming a challenge. When we make a mistake we learn a lesson and try to not make it again. Maynard is basically saying to be patient with life because its going to get better if you stick it out and learn from your challenges, never stop growing and learning. He also talks about what keeps him going \"if there were no rewards to reap, no loving embrace to see me through, this tedious path i've chosen here, I certainly would have walked away.. by now\"\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nJust about all the lyrics that maynard has written over the years are about particular experiences in HIS life, so we will never know what the patient is exactly about. but consider all these different personal interpretations that everyone has posted about the song. It means something different to all of us; a challenge or problem that we've either overcome or are still battling at this current time. Me personally? its hallucinogenic flashbacks.(which are a major pain in the ass by the way) I've had them for a while and if didn't know that they would pass with time, I would have given up by now. example- \n\r\n\"is this a \r\nTest? It has to be, otherwise I can't go on \r\nDraining patience, drain vitality, this paranoid, paralyzed vampire act's a little \r\nOld\" \n\r\nbut becuase I beleive it is a \"test\" of sorts and I belive there is light at the end of my problem, i keep going-\n\r\n\"But I'm still right here, givin' blood, keepin' faith and I'm still right here \r\nBut I'm still right here, givin' blood, keepin' faith and I'm still right here\"\n\r\nbut thats just my personal connection with this song. you will all come accross something in life that relates to the emotion of these lyrics, and when you do I suggest that you listen to this song and \"be patient\" :) you'll feel alot better.    \t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\nSpiralout, on page 1, was the only person to pretty much nail it on the meaning. \r\nEvery other interpretation was wrong. (i know music can be interpreted in anyway you want it to, but the actual meaning is Spiralout's.)\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nYes I believe the song is about keeping faith but it's a little more specific than that. \r\nThe narrator of this song, in my opinion, is Job. The trials of faith and and his patience fit too well to \r\nignore. Lines such as\r\n\"Test? It has to be, otherwise I can't go on \" and \"If there were no rewards to reap, No loving embrace to see\r\nme through\" talk about Job's test from God. His once loving and acring God seems to have turned his back on him\r\nand he has nothing to carry on for, but despite this test he keeps reminding himself that God is still out \r\nthere taking care of him.\n\r\nNot entirely sure how accurate my belief is, but it seems to fit relatively well\t\t\t\t\n\t\t\t\t\n\n", "comment_160": "\nNo, musicislyffe, you're an idiot. just because job had to be patient, doesn't mean the patient's about job. you're projecting yor stupid catholic beliefs into tool to make it seem to yourself like they kind of have religious undertones similar to your beliefs.\n\r\ndumbass.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\ni'm just kidding. i think old musey here is right on. he may not be talking about Job specifically, but the tests and such about which this song speaks are very job-esque. anyway,\t\t\t\t\n\t\t\t\t\n\n", "comment_162": "\nOh I am definitely sure this song is about Maynard's decision to stay with Tool. \"giving blood\" refers to him continuing to come up with new material. Maynard frequently writes about his position in Tool and the record company's or public's greed. The \"faith\" he talks about has nothing to do with religion, the word faith always makes people think of religion, it simply refers to him believing he will somehow get something out of his work and that if it was all pointless he would've quit by now.\t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nThis is the favorite song of a good friend of mine who recently passed away from complications with muscular dystrophy. We had long talks about music and life and everything in between in the months before his death, he told me that The Patient was his favorite Tool song because he felt he related so strongly to it. \n\r\nHe was always in and out of the hospitals being worked on and having blood drawn and every test you can imagine, and I think that the lyric \"and I'm still right here giving blood, keeping faith\" strongly relates to that. I picture him as a patient in the hospital whenever I hear this song, he always had to keep faith and hold onto the thought that he could get better otherwise his life would just be depressing and if he didn't have hope then he would have \"walked away by now.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nThis song is beautiful. Lyrically, what makes it so beautiful is that there are no definitive answers given to the questions Maynard asks. \"If there were no reward to reap, no loving embrace to see me through this tedious path I've chosen here, I certainly would have walked away by now.\" He's saying that he trusts his judgement enough to change direction if his work became fruitless, but what really paints the complete picture is the line \"And I still may.\" He hasn't yet decided if the reward is worth the struggle, yet he will continue on the path so long as he is in limbo. This is a path that many of us find ourselves walking, myself included. Every element of this song articulates that heavy contemplation and indecision in the way that only Tool can. Brilliant. \t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nI think this song is saying, that when your life is in a slump you cant just wait it out(at the end of the song he is stil waiting. \"gona wait it out.......\"), you have to do something aboute it. only you can turn your life around\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nThis Song reminds me alot of myself and how i always stand around waiting for some profound breakthrough; some peace of mind.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nThe song is meant to contrast \"The Grudge\".... \"The Patient\" talks about remaining optimistic, hopeful, and being patient when things get tough instead of giving up. \"The Grudge\", on the other hand, talks about being pessimistic and negative, and using that pessimism and negativity to assert your sense of superiority and dominance over the world - if you were to ever forgive somebody, 'give away the cornerstone', then your entire ego would become unravelled and you would have to admit that you were wrong (something which you find yourself incapable of doing).\n\r\nBoth of the songs seem to refer to two different types of people, but I think they refer to two different states of mind that are present in all of us.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nHarry Manback and Spiralout both have good points that make perfect sense with the lyrics. Instead of arguing over who's right, hasn't the thought crossed anyone's mind that maybe Maynard is just that smart of a guy that he can draw a parallel between his being tied to the \"vampire\" record company and a person's life as a whole?\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nHere's what my version of the lyrics for this song as if it was sung by Josie and the Pussycats. BTW, I'm Obsessed with this film. Anyways, here's the lyrics:\r\nOh . . . \r\nOh . . . \r\nOh . . . \r\nOh . . . \r\nOh . . . \r\nOh . . . \n\r\nA groan of tedium escapes me, startling the fearful, is this a \r\nTest? It has to be, otherwise I can't go on \r\nDraining patience, drain vitality, this paranoid, paralyzed vampire act's a little \r\nOld \n\r\nBut I'm still right here, givin' blood, keepin' faith and I'm still right here \r\nBut I'm still right here, givin' blood, keepin' faith and I'm still right here \n\r\nWait it out \r\nGonna wait it out \r\nGonna wait it out (Be patient) \n\r\nIf there were no rewards to reap \r\nNo loving embrace to see me through \r\nThis tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now \n\r\nGonna wait it out \n\r\nIf there were no desire to heal \r\nThe damaged and broken met along \r\nThis tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now \n\r\nAnd I still may \r\nAnd I still may \n\r\nBe patient \r\nBe patient \r\nBe patient \n\r\nMust keep reminding myself of this \r\nI must keep reminding myself of this \r\nI must keep reminding myself of this \r\nI must keep reminding myself of this \n\r\nIf there were no rewards to reap (I must keep reminding myself of this) \r\nNo loving embrace to see me through (I must keep reminding myself of this) \r\nThis tedious path I've chosen here (I must keep reminding myself of this) \r\nI certainly would've walked away (I must keep reminding myself of this) \r\nBy now \n\r\nAnd I still may \r\nAnd I still may \r\nAnd I still may \r\nAnd I. . . . \n\r\nGonna wait it out \r\nGonna wait it out \r\nWait it out \r\nGonna wait it out\n\r\nKickass, eh?\r\nDon't 4get to r3ply, dawg.\t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nLike several of Maynard's songs I think this song has to do with his mother, Judith...specifically her point of view going through life paralyzed, but very religious.  To me, when reading through the lyrics with that perspective a lot of things start to make sense.  In several sections I see Judith talking to God, and in others I see her talking to herself.  I also see a lot of suicidal thoughts conflicting with the religious belief that killing yourself sends you to Hell.\n\r\n\"Is this a test?\" can be linked to her asking God why he paralyzed her.  Obviously as time went on I'm sure it was very tedious and draining.  I can't even imagine what it would feel like myself.\n\r\nTelling God, \"But I'm still right here, giving blood, keeping faith\"...she still loves and believes in God.\n\r\n\"Wait it out\"...she's going to keep on living in order to be admitted to Heaven.\n\r\n\"If there were no rewards to reap\"...Heaven\n\r\n\"No embrace to see me through\"...Maynard caring and supporting her.\n\r\n\"On this tedious path I've chosen her\"...choosing to live in paralysis rather than dying and damned in Hell.\n\r\n\"I certainly would've walked away by now\"...If she didn't believe in the religious dogma she did, she would have no reason to continue living and earn her place in Heaven...she would rather die.\n\r\n\"If there were no desire to heal the damaged and broken met along this tedious path\"...like Maynard said in Wings For Marie / 10,000...Judith \"saved\" Maynard's life in a way.  She healed or fixed him in some way.  I can only assume this line has to do with Judith spreading peace and faith to those that don't believe in it and her wanting to continue contributing to that.\n\r\n\"...and I still may\"...I contribute this to her constant suicidal thoughts and wanted to move on and leave her life in a wheelchair.\n\r\n\"Be patient\" \"I must keep reminding myself of this\"...She's trying to, through mantra, remind herself that she's working to earn her place in Heaven and she needs to keep being patient and living a faithful life.\n\r\nI could of course be way off with this of course, but I don't think so.  Through this perspective the song makes a lot of sense to me, and I think Maynard has a lot of conflict trying to understand his mother, her beliefs, and see life thorugh her eyes.  Those kind of feelings and conflict would come out though my lyrics if I were him.\n\r\nThanks for reading!\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nWell to me, it's about a man who's rationalizing for his past deeds. Seems that he has chosen a pth with much sacrifice, that had a promising outcome. But the fact is that the outcome isn't coming as fast as he'd hoped. As he keeps being patient, he must keep remembering his promised end. (I must keep reminding myself of this). Hes working hard for a goal, and from time to time, he has to remember what exactly he's working for. Basically, it's a song about Enduring and keeping faith in the lowest of times.\n\r\nA very powerful song, and can really get you into a zone where your somewhat lost in the song. \t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nI think the whole CD of Lateralus is like different stages in a relationship. This song being that part after \"The Grudge\" (maybe a breakup) that lonely desperate feeling that overwhelms you. Everything becomes mundane, almost ritual to daily life. As a vampire to compassion you seek out on a daily basis. Maybe even fighting of suicidal thoughts \"If there were no rewards to reap, no loving embrace to see me through, I certainly would have walked away by now\". Maybe even reaching out to the world around you for help.\n\r\nAll Tool songs are encouraged to be taken any way the listener wants. All are left open to interpretation, what they mean to the band, or the people listening to them will always be different, and by not getting the original meaning, you are getting the point of their music correct. \t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nI think it's sung from a listeners point of view. \"Be patient\" means getting used to TOOL's songs and lyrics.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nThis song relates to me in a fairly deep way. \n\r\n3 years ago I move to China. I'm a Canadian and I decided to move to China as a character building exercise. The first six months were pure honeymoon as I was just stoked to be in such an amazing and interesting place. I was focused on studying the language. I was a student and not working at the time and life was good. \n\r\nAfter six months shock set in. I could no longer balance the positive cultural aspects with the aspects I perceived as negative. I did not enter China naive about the government but even simple local philosophies just seemed so wrong to me and contradictory to my ideals. I also had begun working and my language skills had allowed me the chance to communicate with un-westernized locals and I was shocked by the centralism, absolute disinterest in the outside world and many other things...I won't go on and on abut these details. \n\r\nI retreated. I became isolated. I became intolerant. I began only leaving my apartment when absolutely necessary. I became afraid of what was outside and fell into a year long depression. But still I held on to my goal. To integrate and adapt to this foreign culture. Plus I was on a one year contract with fat bonuses at the end. ;) \n\r\n\"A groan of tedium escapes me, startling the fearful, is this a Test? \r\nIt has to be, otherwise I can't go on\r\nDraining patience, drain vitality, this paranoid, paralyzed vampire act's a little Old.\" \n\r\nMy contract finished and by then I had some decent savings and my language skills had progressed much further. Along with my knowledge of the culture. I began making plans for extended travel within the country so I could see and experience what I had missed during my 1 year self imposed isolation. Plus I was in love. \n\r\n\"If there were no rewards to reap\r\nNo loving embrace to see me through\r\nThis tedious path I've chosen here\r\nI certainly would've walked away\r\nBy now.\" \n\r\nI'm 3 months away from the end of my final contract. My rewards will come soon. This song helped me recognize the rut I was in and then quickly the song \"\"Lateralus\" helped me out of it. \n\n\r\nThanks MJK. You've helped me so much. \n\n\n\n\n\n\n\n", "comment_175": "\nHey fellow TOOL fans--\n\r\nSo, we all obviously have some unique interpretations of this song, but I came across a pretty interesting idea about this piece... anyone here read \"The Screwtape Letters\" by C.S. Lewis? It is about a master Demon by the name of Screwtape who is writing letters to his nemphew \"tempter\" demon named wormwood. He is teaching him the cunning methods of leading humans down the path of destruction, but in Wormwood's case specifically, the ultimate damnation of a British man reffered to as \"The Patient\". A far stretch, maybe, but due to the nature of this song, I think there may be a connection. Do some research if you haven't read the book, this song will make more sense to you if you keep an open mind.\n\n\n\n", "comment_176": "\nHey! I wish I would have found this comment earlier, I just posted pretty much the exact same thing. Great book. As soon as I read that the British man was reffered to as \"The Patient\",I instantly thought of Tool and then all this came to me. I am glad I am not the only one, for I wasn't sure if I was making too far of a stretch. \n\r\n--Wiki Summary of C.S. Lewis' \"Screwtape Letters\" Put two-and-two together.\t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nIn The Screwtape Letters, C.S. Lewis provides a series of lessons in the importance of taking a deliberate role in living out Christian faith by portraying a typical human life, with all its temptations and failings, as seen from devils' viewpoints. Screwtape holds an administrative post in the bureaucracy (\"Lowerarchy\") of Hell, and acts as a mentor to Wormwood, the inexperienced tempter. In the body of the thirty-one letters which make up the book, Screwtape gives Wormwood detailed advice on various methods of undermining faith and promoting sin in the Patient, interspersed with observations on human nature and Christian doctrine. Wormwood and Screwtape live in a peculiarly morally reversed world, where individual benefit and greed are seen as the greatest good, and neither demon is capable of comprehending or acknowledging true human virtue when he sees it.\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nI think this song is about life and when your about to give it up because it is getting too tough. Someone who is thinking about suicide and decides to wait it out instead to see if his life might change for the better. The depression the person is feeling is possibly a test to see if he can go on and surely if he continues living he will eventually find happiness in the end which would be his reward. After all why would he be suffering for no reason it must be a test against his will. The patient is still there waiting and giving blood and having faith that he can make it through this and be rewarded. Possibly he feels better but the pain and depression and the thoughts of suicide are coming back but he must remind himself that he has gotten pass this test before and will surely be awarded and cannot give up yet for he has been on this path for a while now and will eventually come out. So he will wait it out to see if he can make it through this tedious path reaping the rewards having a loving embrace in the end. This is just my meaning of this song and i can relate to it because i get depression every now and then and feel as if i might as well give up but i remind my self that i've felt this way before and will make it through if i just wait it out.\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nNiche's \"Divine Comedy\" pt. 3\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nVery special song this one. I think it is someone who is going through some shit at the moment and he is starting to lose his faith in God.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nThe first comment stated that Maynard said during a concert that the song is about vampires that you encounter during life. In the Satanic Bible, these vampires are mentioned. The sixth Satanic Statement says \"Satan represents responsibility tothe responsible, instead of concern for psychic vampires!\" This is referring to the people in your life who basically mope around in sadness, pity, wahtever, and complain about their problems in life and expect you to listen and offer help or to hear them out. If this is what the song is about, then it is saying not to waste your time helping someone or being with them through any type of healing/helping process if you are nont getting anything out of it... very unlikely, but its a thought\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\ni think this song is about his mother and longing for spiritual unification:\r\nhe fears to lose her but he believes that the pain is an illusion but he can't escape the situation and the only way, is to be patient(patient also resembles his mother) as the path of spiritual unification that he has chosen can only be achieved through patience.\n\r\nif he had known already that their is going to be no healing through this path he would have totally broken down a long time ago\n\r\nmother and spiritual unification have a common meaning as every mother loves her child and the unification with god is gaining that love again and being loved\n\r\nbut to go through this he has to be patient and not lose himself in emotions\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\ni think this song is about his mother and longing for spiritual unification:\r\nhe fears to lose her but he believes that the pain is an illusion but he can't escape the situation and the only way, is to be patient(patient also resembles his mother) as the path of spiritual unification that he has chosen can only be achieved through patience.\n\r\nif he had known already that their is going to be no healing through this path he would have totally broken down a long time ago\n\r\nmother and spiritual unification have a common meaning as every mother loves her child and the unification with god is gaining that love again and being loved\n\r\nbut to go through this he has to be patient and not lose himself in emotions\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nI think a lot of the meanings here are better than mine, but when I really started to listen to this song I thought it was about procrastination.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nTo me this song has always reminded me of relationships I've had, being committed to something but every now and then there would be a doubt in my mind, waiting for a change in the person to make the doubt go away.\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nEvery time I get blood work, I sing this song to myself.\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nto me right now this song is about a long day in the office, finding meaning in that, and looking forward to the good things at the weekend!\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\ni think this song is my favourit lyrics. anyone waiting for a big something like a change or whatever can relate to this song + the composition is awsome with rael progression and the drumbs are helerious as always\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nI believe this song is about a relationship. His other-half is the vampire (damaged) and the patient of his blood-giving (he cares for her and he understands she's damaged so he accepts the pain for him that results from her damage). He is accordingly the doctor, or healer. He will be patient (wait it out) because he believes there will be a loving embrace at the end of it: explaining why he puts up with it.\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\nI recognized this song as young men being the vampire.  No more, but for a while I was. I have to say, I never physically abused my wife, but mentally, I did.  I made her take my shit, just to prove she loved me.  Reminds me of the Pink Floyd lyrics, \"I'd make her prove her love for me. I'd take all that I could take.  And I'd push her to the limit, just to see if she would break.\"  This song is about most young relationships, because I've seen so many like that.  I think of it as being sung from a young woman's point of view.  She is putting up with a young man.  If you didn't realize it yet, nobody is more emotional and insecure, and harder to deal with than a young man.  As usual TOOL is dealing with the realities of everyday life struggles.  \n\nYoung men, especially those who weren't raised in the best manner, are scarred to a degree (but aren't we all), and struggling to become what they think is a strong man.  Because of that, they are abusive and controlling to their young girlfriends or wives.  And God knows why, way more often than not, the young women take it.  They see inside of the want-to-be-tough guy, and see that he is hurting, and his abuse is a symptom of his pain, and they are going to heal him.   Because God knows after he abuses her, he's going to be Mr. nice guy again and give her that loving embrace to see her through. \n\nEvery now and then they just get sick of the same old cycle and a groan of tedium escapes them....startling the fearful.  The fearful would of course be the young man himself, or his family who hopes that the good woman is going to stick by him and help him dig out of his pathetic existence, make a civilized human being out of him, and of course lighten their burden from him.  Maybe even a judge who sees that he has a chance because he has a good woman who may straighten him out. \n\nEven though she's tired of it all, what does she say after her groans....I'm going to wait it out.  But then she may walk away....and she still may.  But she keeps taking it because this sick man who needs her help is her.....Patient.  Blood sucking bastard.  Grow up and start giving back what you've taken.  Treat her like she deserves.  We all see you for what you are.  A weak little boy trying to pretend to be a man,  who is more emo than a teenage girl.\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nI can somehow relate to the lyrics and to comments people provide. I currently attend college of medicine in my home town. My country just got into EU so the education system changed. I've chosen this college to learn and help people but it is still not happening. All that's happening is mostly just mindless learning things I will never require in my life again. I feel so unsatisfied with that, like it all is meaningless. It drains my patience and sometimes destroys my social life. But I'm still doing my best, trying to pass all the tests on time because I believe that one day it will all fall into place and make sense. Keeping faith, giving blood... for the patients in the future.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nthis is sung from the perspective of someone who's gnostically convictional about knowing the purpose of both life and death, and being tempted to skip to the latter, as the former seems tedious at this point (especially in light of what death really \"means\")\n\nkeenan is more often than not having a dialogue with himself, not others.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nThe prior post says that this is a song about somebody contemplating suicide.  That poster also states that Maynard more often speaks to himself than others.  I couldn't disagree more on either account.\n\nOther songs have clearly noted Maynard's disdain for suicide.  He wouldn't write this song, as a sympathetic understanding for the desire.  See Outsider - A Perfect Circle, among others.  \"Suicidal Imbecile\", \"Narcissistic Drama Queen\".  These are not words of sympathy for those contemplating leaving.  But this song does give sympathy to the one being tested.  And the Patient is somebody else - the vampire.  The poster has totally ignored the fact that there are two subjects in this song as he wants it to be about suicide.  I can only guess why he wants that to be the meaning.  Perhaps he's one of the young men I speak of in my original post....\n\nAnd to the second point.  Maynard has told us they are trying to be our TOOL, to help us through this life.  What kind of a TOOL would they be if they didn't speak to us, and just spoke mainly to themselves?  I'm sorry for you that you haven't yet understood the band or it's songs, but yet don't realize your blindness.  Keep working.  That's what life is about.  Nobody finds enlightenment without work and reconsideration of all things.  If TOOL gives you some meaning you can hang on to and find value in, great.  Keep listening.  Perhaps you will find what Maynard has, some peace in this world through all of the ugliness he has had to express.  He has admitted he has healed some and though this may mean a demise to TOOL we should be grateful, as this means there may be some hope for the rest of us.  Sounds like you need it.  Keep listening.  Perhaps you can, \"Crucify the ego, before it's far too late\" - TOOL Reflection.\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nI believe this song is about being patient and to wait things out. We have the decision to take our life away because it's easy, but there is better days and a chance to be better as a whole. By being patient, good things will come. I believe the instrumentals play a huge role in this song, they match with the lyrics so well. Just pay attention to when the instruments are loud and almost frantically played, and then pay attention to when they almost seem to die off and quiet down.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nThe chaos of music is the chaos that the young man puts her through, and every now and then she stops and thinks....a moment of clarity.....why should I keep putting up with this.  Then she breathes deeply and decides to keep being patient for her patient.\n\nI think the only reason so many don't see it as the tired, frustrated woman is, most of the people who listen to this are the emotional males, who are so self-absorbed they can't see it being about her, they see it about themselves instead, and all that THEY are going through.  Of course.  It just goes to prove my points.  Keep listening and let them be a TOOL for your growth.  \n\nThe recurrent theme in most TOOL songs is a soul sucking frustration from dealing with the shit hole of a world we live in due to the self absorbed assholes.  When that's how you feel, like I do, you hate them with every fiber.  When you hate them that much, you start to look at yourself and try to make sure you are not one of them.  That self-analyzation, leads to awareness, leads to empathy, leads to growth.  Keep listening.  As you age, experience, and reanalyze, you will see it differently, not just as your own self-centered drama.\t\t\t\t\n\t\t\t\t\n\n", "comment_196": "\nVery simply put this is about patience. Its clear as day. Essentially he is addressing the tedious and repetitive path one takes, one that may be necessary, to being with the one they truly wish to be with. Along the way time is shared with those who use the patient person. Leaches, emotional vampires, users. Its part of the journey and almost everyone goes through this. \n\nThey remain optimistic in the idea they will find that one, or finally be with the one they know is meant for them. Relying on the idea that in the end there will be a loving embrace, the love of that one, is seeing them through all the hardship along the way.\t\t\t\t\n\t\t\t\t\n\n", "comment_197": "\nYou know, maybe Maynard is human after all. If Tool didn't sell records, then they would be dropped by their record label. Okay then, if you think you know it all, man, write what you think! I dare you!\t\t\t\t\n\t\t\t\t\n\n", "comment_198": "\nI think it has little to do with record sells or leaving Tool... usually Maynards songs relate to past experience or thoughts that hes had... Im sure there is a meaning to the song but I dont think we can really understand the \"true\" meaning of most of Tools songs becaue they are only relative to what Maynard him self has seen or experienced.. Trying to guesstimate what Maynard is really trying to say it hard and he rarely just blantantly comes out and says what his song meanings are... i think he likes people to take the song for what they see it as... And schism86... dont take Maynards song interpertations from shows to literal, he is usually  joking around with what he says a song means... I know at a show he said that Eulogy was about Elvis.. of course this was only cause we were in Memphis... Elvis's birthplace!! LOL.. I thought it was funny! (yes I know Elvis does suck!)\t\t\t\t\n\t\t\t\t\n\n", "comment_199": "\ni do believe that this forum is for what WE think songs mean. and the whole record sales thing is what i think this song is about. It is a beautiful song and Maynard is god but I don't think we should feel guilty for wanting money. After all without money we can't buy food and without food we can't live!\t\t\t\t\n\t\t\t\t\n\n", "comment_200": "\nwell parabol or parabola...i take it to mean a state of nirvana...now for all the little wannabees out there i dont mean the band...im ean the state of enlightenment\t\t\t\t\n\t\t\t\t\n\n", "comment_201": "\nwell parabol or parabola...i take it to mean a state of nirvana...now for all the little wannabees out there i dont mean the band...im mean the state of enlightenment\t\t\t\t\n\t\t\t\t\n\n", "comment_202": "\nWell what do you suggest Maynard is, joshthack? I don't literally worship him but he is so fantastic at writing songs he deserves to be a demi-god ok?\t\t\t\t\n\t\t\t\t\n\n", "comment_203": "\nI think this song is Maynard's interpretation of those that are blinded by religious beliefs that hinder them from their true potential.  They are so engrossed in following protocol that they forget that they are doing themselves more harm.  He also shows the confusion that people may have that are knee deep in religion.  They are being tried and tested and for what?  \t\t\t\t\n\t\t\t\t\n\n", "comment_204": "\nI don't mean he's worried about selling records. But you now, it was 5 years between Aenima and Lateralus. People could have been going 'Hurry up and make a new record!' and he's saying 'Is it some kind of test that I have to produce a new record so soon and stuff' And also saying that if he didn't get praise from people and things, he wouldn't make a new record.\t\t\t\t\n\t\t\t\t\n\n", "comment_205": "\nI do believe this song is about Maynard getting a bit bored of the band. \"A groan of tedium escapes me\"\n\r\n\"Draining patience, drain vitality; this paranoid, paralyzed vampire act's a little old\" - The band is wearing his patience and vitality and that is starting to get old.\n\r\n\"But I'm still right here, givin' blood, keepin' faith and I'm still right here\"\r\nBut he is still here, giving his all even if he is getting bored.\n\r\n\"If there were no rewards to reap \r\nNo loving embrace to see me through \r\nThis tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now\"\r\nIf he wasent getting anything out of the whole experience, if we the fans and his family/friends didn't love him, this annoying path he took wouldn't be worth it and he would have walked away from it all.\n\r\n\"If there were no desire to heal \r\nThe damaged and broken met along \r\nThis tedious path I've chosen here \r\nI certainly would've walked away \r\nBy now\"\r\nSomehow he is healing his past experiences by being in the band and sharing his experiences, if he didn't want to do that then he would have just walked away.\n\r\nBut he must be patient, he must wait it out, even though it is tedious. He must keep reminding himself why he is still where he is today.\n\r\n\"I certainly would've walked away (I must keep reminding myself of this) \r\nBy now \r\nAnd I still may\"\r\nBut he still could leave, he still could.\n\r\n\"Gonna wait it out \r\nGonna wait it out \r\nWait it out \r\nGonna wait it out\"\r\nBut he'll wait it out and see what happens....\n\r\nAnother one of my favorite Lateralus songs, very nice story in it.\n\n\n\n\n\n", "comment_206": "\nHey, that's kinda what I said :D\t\t\t\t\n\t\t\t\t\n\n", "comment_207": "\nto me its about the belief of that life isjust the first phase of everything , but also mentions there are some things which can help you pass the time , but certain things make you want to give up on waiting , and  a way to cope in this phase patients is key to getting by without completely losing yourself along the way.\n(a summed up meaning to the whole song dont feel like getting into deep detail )\t\t\t\t\n\t\t\t\t\n\n", "comment_208": "\nI'm sure that this song is sbout Maynard carrying on in Tool and questioning about whether he should stay or not. At first I thought it was about how people are always pressurrising Tool to release an album quickly \"Is this a test\". But then I realised it wasn't. The \"If there were no rewards to reap\" etc. Would be that if he had no other reason to carry on but the fans, the album sales etc, that he would leave Tool\t\t\t\t\n\t\t\t\t\n\n", "comment_209": "\nWho really cares what Tool do any way. They are a good band and could make a lot more money if they wanted to. I think theyve prooved they can make it big by actually being good rather than being marketed like every other band in the world.\t\t\t\t\n\t\t\t\t\n\n"}