{"comment_0": "\nLovecraft used the term â\u0080\u009cGreat Old Onesâ\u0080\u009d in only two stories: in â\u0080\u009cThe Call of Cthulhuâ\u0080\u009d it referred to Cthulhuâ\u0080\u0099s spawn, and in â\u0080\u009cAt the Mountains of Madnessâ\u0080\u009d it was the title of the starfish-like beings who lived in Antarctica and warred with the Cthulhu-spawn!\n\nCthulhu is a â\u0080\u009cGreat Old Oneâ\u0080\u009d and he is of a race called the â\u0080\u009cSpawn of Cthulhuâ\u0080\u009d.\n\nCthulhu lies \"dead but dreaming\" in the city of R'lyeh, a place of non-Euclidean madness presently sunken below the depths of the Pacific Ocean. \n timeless sleep\n has been upset\n He awakens\n\n It is said that the \"Great Old Ones\" will return, causing worldwide insanity and mindless violence before finally displacing humanity forever. \nin madness You dwell\n\nCthulhu himself is served by humans, the amphibious deep ones or \"hybrid children\", and his own spawn. \nHybrid children watch the sea\nPray for Father, roaming free\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nAlthough some say it's the worst song on the CD, I like this song, even the fucked up solo, it's like all hell is breaking loose.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nThis song might as well be the theme song to H.P. Lovecraft's Cthulhu Mythos.  Every line of this song is related.\n\r\n\"Messenger of Fear in sight\"\r\nA reference to Nyarlathotep, the messenger of the Old Ones.\n\r\n\"Hybrid children watch the sea\r\nPray for Father, roaming free\"\n\r\n\"Hybrids\" are a reference to the offspring of Deep One / Human interbreeding.  The Deep Ones are servitors of Cthulhu and Dagon, either of whom could be the \"father\" mentioned in the song.\n\r\n\"Crawling Chaos, underground\r\ncult has summoned, twisted sound\"\n\r\nAnother reference to Nyarlathotep, who is also known as \"The Crawling Chaos\" or \"The King in Yellow\".\n\r\n\"Not dead which eternal lie\r\nstranger eons Death may die\"\n\r\nThis is a version of the couplet made famous in \"The Call of Cthulhu\".  The original version is \"That is not dead which can eternal lie, for with strange aeons, even death may die\".  \n\r\n\"drain you of your sanity\r\nface The Thing That Should Not Be\"\n\r\nThis is a refernce to what happens when humans are exposed to the old ones in Lovecraft's stories.  His thesis really is that humans are insignificant in the cosmos, and that the universe does not really make sense.  For example, in Lovecraft's universe, the Source of All Things is the blind idiot god, Azathoth.  Humans who come too close to understanding these truths risk going insane, in that the human mind is no more caplable of withstanding these truths than our bodies are meant to withstand high speed impacts.  \n\r\nIn many of Lovecraft's stories, insanity is the ultimate fate of his protagonists.\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nReaders of H.P. Lovecraft will recognize the referrences to the Cthonian mythos.  The thing which should not be is Cthulu, and Apocolyptic elder God lying in a dream state within his sunken kingdom of R'lyeh.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nThe inspiration:\r\nThe song is based upon the short story \"Shadow Over Innsmouth\" by H.P. Lovecraft which has been written in 1936. \"Shadow Over Innsmouth\" was Lovecraft's sole story which has been released as a book when he was alive. His further short stories only appeared in his lifetime in a magazine called \"Weird Tales\". \nencycmet.com/songs/…\n\r\nThis is a really good, underated song imo.\n\r\nThe Thing That Should Not Be \n\r\nIt is about the story \"Shadow Over Innsmouth\" \n\n\r\n\"Messenger of fear in sight\" \r\n\"Dark deception kills the light\" \r\nThe shadow over Innsmouth \n\r\n\"Hybrid children watch the sea\" \r\nThe former leader of the citizen of Innsmouth captain Obed had an agreement with the underwater creatures. The citizens will get gold and fish from them in return that they mate with these creatures. With time every new born citizen became a hybrid between the creatures and humans \r\n\"Pray for father, roaming free\" \r\nThe hybrids (Innsmouth citizens) were waiting for the one day when they will go underwater to live there \n\r\n\"Fearless wretch\" \r\n\"Insanity\" \r\nThe hero became almost mad when he slowly turned into a hybrid and he even decided his suicide, but didn't realized it. He followed the call of the water ... \r\n\"He watches\" \r\n\"Lurking beneath the sea\" \r\nOne of the \"Great Old Ones\" was waiting for his 'children' that they would follow him under water \r\n\"Great old one\" \r\n\"Forbidden site\" \r\nThe bay area where the citizen of Innsmouth were celebrating their cult rituals for the \"Great Old Ones\" \r\n\"He searches\" \r\n\"Hunter of the shadows is rising\" \r\nThe during the night the citizens were hunting the hero of the story \r\n\"Immortal\" \r\nThe hybrids were immortal and a few years after the hero fleed from this city ... \r\n\"In madness you dwell\" \r\n... he became a hybrid too because he was a direct descendant of captain Obed \n\r\n\"Crawling chaos, underground\" \r\n\"Cult of summoned, twisted sound\" \r\nThe cult the citizens were celebrating in the bay area \n\r\n\"Out of ruins once possessed\" \r\nY'ha-nthei, the zyclope city of the underwater creaures or R'lyeh, the city of the \"Great Old Ones\" \r\n\"Fallen city, living death\" \r\nThe fallen city is Innsmouth, there was nobody on the streets \n\r\n\"Fearless wretch\" \r\n\"(...)\" \r\n\"Timeless sleep\" \r\n\"Has been upset\" \r\n\"He awakens\" \r\nYog-Sothoth awakes from his timeless sleep \r\n\"Hunter of the shadows is rising\" \r\nThe during the night the citizens were hunting the hero of the story \r\n\"Immortal\" \r\nThe hybrids were immortal and a few years after the hero fleed from this city ... \r\n\"In madness you dwell\" \r\n... he became a hybrid too because he was a direct descendant of captain Obed \n\r\n\"Not dead which eternal lie\" \r\n\"Stranger eons death may die\" \r\nLovecraft wrote that this would be a line of the \"Necronomicon\" \n\r\n\"Drain you of your sanity\" \r\n\"Face the thing that should not be\" \r\nThe hero accepted that he became a hybrid - he faced it in the mirror \n\r\n\"Fearless wretch\" \r\n\"(...)\"\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nKick ass song, Killer solo, one of my fav Metallica songs. Love the S&M version.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nIt's been said a million times already (Nodens pretty much hit the nail on the head), but this song is HEAVILY influenced by H.P. Lovecraft's Cthulhu Mythos.\n\r\nI just finished reading his short story, \"The Crawling Chaos\".\n\r\nIt's not terrifying as much as it is amazing how they could incorporate H.P. Lovecraft's tales into a song. \n\r\nI mean, it blends in almost every story I've read so far. \n\r\nIf any of you haven't read Lovecraft's work, get to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\ni love this song. i first thought hybrid children referenced nephilim.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nThis is Metallica's second song based on H.P. Lovercraft's works. Also check out \"The Call of Ktulu\".\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis is one of my all time favorite songs by Metallica. Especially the solo. And the power of the James's vocals during the verse are so damn awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nThe song isn't as inspiring, or as technically impressive as the other songs on Master of Puppets, but the atmosphere more than makes up for it. This song will be 10X better if you read \"The Call of Cthulu\" by H.P. Lovecraft. The song itself sounds like it's going insane, and the repetitive nature of the song is meant to be oppressive and maddening. This song is just way too heavy for some people, and those are the people that don't like it. Definitely one of the heaviest(in the truest sense of the word) metal songs ever recorded.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\n  Truelly, I liked it.  I'll look for the book at my local library.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nI don't know why anybody wouldn't like this song.  It's so awesome, and I love the solo.  What's really cool is when Hetfield sings \"drain you of your sanity\" on S&M\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nbad ass song, cool on s&m. about h.p. lovecraft's \"shadow over innsmout\"\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nWhen I first heard this song, I was like \"Uh, James, where are you coming from on this one man\" cuz I'd never read H.P. Lovecraft's story. Once I read it, it turned a weird ass heavy song into a kick ass heavy song. I like the S&M version, but cuz the symohony backing it makes it even more sadistic. Plus Jaymz vocal is a bit more insane on S&M\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nI remember hearing this for the first time when i bought Master Of Puppets, and the haunting aura of the song never changed since then, every time i listen to it. The solo's awesome, just like everyone else has been saying. I also remember seeing James singing this once on Binge and Purge. The power of those goddamn vocals rock!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nwhat i was thinking when i first read these lyrics was that we are \"hybrid children\", as humans we all have good and evil in us, and the evil takes on a life of its own... im not saying thats what the songs about, just a thought I had\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nis it: \r\nNot dead which eternal lie \r\nstranger eons Death may die \r\nor:\r\nThat is not dead which can eternal lie,\r\nAnd with aeons even death may die?\r\nI cant find my Master... CD.\n\r\nAnd Live in my attic, although what you said would work, in Call of the Cthulhu several of the cult members that worship and wish to revive the Cthulhu are refered to as hybrid children (a racial comment).\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nRebbal Ace is the first person I've seen correctly spell \"Cthulhu\" when referring to this song or to \"The Call Of Ktulu\". Haha.\n\r\nAnd no, Live_in_my_attic, the \"hybrid children\" bit is meant to be taken literally. It's about humans who interbreed with underwater humanoids called The Deep Ones, and these hybrids all live in a port town called Innsmouth. The narrator of the story goes to the town and then realises that he too is a hybrid, and goes to live under the sea.\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nI think the lyrics have a dual purpose.  On the surface, he is writing about the fictional creature that lives under the ocean.  But I think the deeper intended meaning is his own inner torment that roars and rages beneath his own proverbial sea of calmness.  At least that is how the song makes me feel.  \" Crawling Chaos, underground\", \"lurking beneath the sea\", \"in madness You dwell\".\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\njaymz can write about just about anything and make it sound cool. He's obviasly a big HP lovercraft fan\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nThe simplest song on MoP's but it kicks so much ass. It's crazy man!\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nI Always this song was about the watcher in the water from the lord of the rings: the fellowship of the ring \r\nDark deception kills the light is about the doors of durin\r\nfearless Wretch \r\ninsanity \r\nHe watches \r\nlurking beneath the sea \r\ngreat Old One \r\nforbidden site \r\nHe searches \r\nHunter of the Shadows is rising \r\nimmortal \r\nin madness You dwell \r\nthis is what realy made me think of it.... but the other words wouldent make sense for it so i would agree to the other book\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI Always this song was about the watcher in the water from the lord of the rings: the fellowship of the ring \r\nDark deception kills the light is about the doors of durin\r\nfearless Wretch \r\ninsanity \r\nHe watches \r\nlurking beneath the sea \r\ngreat Old One \r\nforbidden site \r\nHe searches \r\nHunter of the Shadows is rising \r\nimmortal \r\nin madness You dwell \r\nthis is what realy made me think of it.... but the other words wouldent make sense for it so i would agree to the other book\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nI haven't been able to find H. P. Lovecraft's books in any library, but if anyone's interested, you can download them all from noveltynet.org/content/books/lovecraft/… - copyright has expired on them\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nRebbal Ace - the lyrics are correct for the song, but the line you refer to (That is not dead which can eternal lie, / And with strange aeons death may die.) comes from another of Lovercraft's stories, \"The Nameless City.\"  I'm not sure what all books it's in, but I have a copy of \"The Doom that came to Sarnath\" with that story in it.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\ni love this song. i'm not very good at deciphering lyrics but i pictured the song being based on \"The Creature from the Black Lagoon\" movie. but it looks like i was totally way off, hahaha. the songs kickass.\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nNyogtha - The Thing That Should Not Be\n\r\n\"Men knew him as the Dweller in Darkness, that brother of the Old Ones called Nyogtha, the Thing that should not be. He can be summoned to Earth's surface through certain secret caverns and fissures, and sorcerers have seen him in Syria and below the black tower of Leng; from the Thang Grotto of Tartary he has come ravening to bring terror and destruction among the pavilions of the great Khan. Only by the looped cross, by the Vach-Viraj incantation and by the Tikkoun elixir may he be driven back to the nighted caverns of hidden foulness where he dwelleth\" \n\r\nFrom \"The Salem Horror \" (1937), by Henry Kuttner.\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI always thought this song was about the Kraken a sea-monster. Guess i was wrong, thanks for da info =D\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nThis is a great song. I think it has something to do with a sea monster, though. I'm not sure about all the details, but it's still a very good song.\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\nDdadutta, the guitar riff may seem repetitive, but check out the drums in the background... They're awesome, and whenever I play this song on the drums, I feel as if the Thing's spirit were in me.. It is just so heavy it charges you with amazing mad energy...\r\nIt is the heaviest song composed till then.. and it juggles with energy and pulls all your nerves...\r\nIt is a masterpiece and gives the right atmosphere to the paranoic and maddned subject treated\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nThis is one of the best songs Metallica has ever made love the song love the artist.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nThanks, Nodens. I couldn't have explained it better then that. Makes me feel all warm inside that people are still reading the classics.\n\r\nAnd, yeah, this song kicks ass, even if it is mainly for the lyrical elements. The vocals sound strangled and the riff feels like it's crawling forward. It may be a bit reppetitive, but it's still one of the better songs on Puppets.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nThis is cool, i think it tells about some kind of monster.. (no, i don't mean that song). Atmosphere is quite depressive, and main riff is really heavy. solo kicks ass, as usual. great song from great album. sry bad english..\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nThis is one of my favorite Metallica songs, it is very simple, and it is repetitave. But something about it just catches my ear. I think it's just the atmosphere of it like some of you mentioned. I don't like the solo all that much. One of the reasons someone might say its one of the heaviest Metallica songs is becuase its the only one where they dropped the tuning. So the notes are actually played in an alternate tuning making the sound much darker. I love it  \\m/(* o *)\\m/\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nThis song is fuckin' kick ass.\r\nThe lyrics are amazing also\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nA direct reference to Lovecraft's short horror classic \"The Call of Cthulhu\". The hybrid children are the spawn of human and montrous sea creatures known as the Deep Ones, servants of the great and terrible god-beast Cthulhu. The \"crawling chaos\" refers to a nasty fellow called Nyarlathotep. The line about \"strange eons\" is a reference to a quote from the mouth of a deranged Arabian poet in \"The Nameless City\", referring to a race of troglodytes and Cthulhu also.\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nOh, yes, and Cthulhu is trapped beneath the ocean (according to said cult) and waking up this fellow would mean our deaths. That means you, too, metalheads, for we musical eclectics and RPGers will be eaten *first*! MUHAHAHAHAHA!\r\nHowever, I enjoy the references, and the riff is interesting. Feeble hair bands and pithy imitators, bow down and pray for MERCY to the gods of rock!\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nAch, Nodens beat me to it! And Mathwei too!\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI don't see how this song could be the worst on the CD, each song has a different taste and theme so why compare? Why not just say the album is great? I personally love all the songs, and I still don't understand what \"The Thing That Should Not Be\" is about but I love the song anyway.\t\t\t\t\n\t\t\t\t\n\n", "comment_40": "\nbefore my friend and i went on this site, we thought it was about a shark: \"lurking beneath the sea\", \"Hybrid children watch the sea\" i'm pretty sure that sharks live in seas/oceans \"Dark deception kills the light\" deep in the ocean, there is no light\t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\nwell I guess its about the storie but keep in mind that james was raised up with the bible and there in a passage it is talking about a beast that will rise up from the sea and of course metallica is dark and black;given those facts it could be a possebility that it has a double meaning\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nYeah, uh... I just wanted to say that Cthulhu isn't really a god... He's more like a high priest for the Old Ones.\r\nSandman205 - That is not dead which can etrnal lie, and with strange eons even death may die... These words are used in most of Howard's work, including \"the Call of Cthulhu.\"\n\r\nYes... Nitpicking is the key. :P\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nNodens had it down perfectly. My Lovecraft books aren't around right now so I can't look it up for sure, but I believe in the story 'At the Mountains of Madness' a shoggoth is referred to as 'The Thing That Should Not Be', but the song is most likely referring to Nyarlathotep.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nExcellent, excellent and dark song.\r\nNot as heavy or oppressive as some would have it to be, its just very sick and maddening.\r\nIt also has some of their best lyrics.\r\nI would have liked to hear a cover by a more extreme band with appropriate growing/croaking, maybe by Shagrath.\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\nThis is awesome but you should hear the primus version, id have to say les claypool did a better job\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nWhy do you say James got the band into it? It was actually Cliff Burton, himself a fan of H. P. Lovercraft.\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nYeah this song really fucking rules. It has just a fucking creepy, eerie feeling about it, from start to finish. And how the guitars crunch at the end....maan this song is one of my favorites by Metallica\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\ni think everyone has the meaning down; i just wanted to say the following to jayrock:  seriously, \"Jaymz\"?  um....what. the. fuck?  that's so ridiculously stupid that english has no word, term or phrase for it.\n\r\nit's people like that obscenely fucking pathetic moron that make people with an IQ higher than 12 weep for the future.\n\r\ndo us all a favor and pop some pill(z) you fucktard.\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\nYeah, everybody pretty much hit the nail on the head with the HP lovecraft idea.  I haven't read any of the stories yet, could somebody give me the order they go in so I don't feel like a complete moron?\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nUm, blueshirt12, \"Jaymz\" is how Hetfield used to autograph things.  It was his nickname-of-sorts.  Fans still call him that as term of endearment.  So, yeah, take some happy pills yourself, bro.\n\r\nAs for this song, it's amazing; and the S&M version is outright chilling.  I actually made a music video for said version because it was so awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI haven't read any H.P. Lovecraft, but these lyrics do seem a little hard to understand and get the point of. Maybe if I read the book, I'd get it.\n\r\nAs for the instrumental part of the song, it's really amazing. It most certainly has a very dark and spine-chilling feel to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nIs the song about Cthulu or Leviathan?\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nIs the song about Cthulu or Leviathan?\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI watched this one thing they had about a guy who killed his two daughters, even though everyone thought he was fine and stuff, the lyrics \"Hybrid children watch the sea\r\nPray for Father, roaming free'' remind me of it, like, everyone's happy and roaming free, but unknown to them, some kind of evil was growing inside their father.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI'm a big fan of Lovecraft and an even bigger fan of Metallica. The two combined kick all sorts of ass. The Call of Ktulu, The That Should Not Be, and The Frayed Ends of Sanity are 3 of my favorite songs. I hope they do some more Cthulhu inspired songs on their newest album. That would be most good, Noland. Most good.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI'd have to say Metallica's favorite theme amongst a large portion of their songs is insanity... what better to sing about an archaic elder god shrouded in a dark, mysterious fog of madness. H.P. Lovecraft and Metallica two brilliantly creative forces of the 20th century. Thanks for the nightmares =P\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nI'd have to say Metallica's favorite theme amongst a large portion of their songs is insanity... what better to sing about an archaic elder god shrouded in a dark, mysterious fog of madness. H.P. Lovecraft and Metallica two brilliantly creative forces of the 20th century. Thanks for the nightmares =P\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nI've always loved this song, and after reading both \"The Call of Cthulhu\" and \"The Shadow Over Innsmouth,\" I love it even more.\t\t\t\t\n\t\t\t\t\n\n", "comment_59": "\nin response to \"Jayrock\", .uhhh, i'm not sure what lyrics you were reading but there isn't even really one line that could be pertaining to do with James (thats how you spell James) childhood. Its just about Cthuluh, theres no second meaning, it's in the style of an epic so there is not metaphor.\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nThis is the best S&M song followed closely by Call of Ktulu...the symphony adds the the sinister creepiness of those two songs. Music like that is amazing.\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\noh, i was listening to the cure when i wrote the above comment so yeah...\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nthis song is awesome just for the dark insanity that it has and it is one of the darkest songs i've heard\r\nthe S&M version it's kinda scary, jaymz looks like he's a psycho about to kill someone xDxD.\n\r\nawesome song and lyrics by one of the greatest bands and by the greatest bassist of metal\n\r\nR.I.P. Cliff Burton\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\ni never read any of hp lovecraft books but i did recognize that reference in \"call of ktulu\", so it makes sense thats what this song is about if they were interested in lovecraft. this has always been my favorite song on master of puppets (a cd where every song is fucking excellent) mainly because of the atmosphere...its heavy and cool and it also has an amazing creepy vibe to it, thats not something you hear a lot\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\noh yeah. sorry for the second post but this song really reminds me of alice in chains, it just puts me in the same creepy nightmare world as aics \"dirt\" and \"facelift\" albums. people are gonna hate me for comparing metallica to grunge so much but the guitar on the verses sounds a lot like \"come as you are\" by nirvana, i think thats a chorus pedal that makes it sound all watery and whatnot\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nThis song got me into HP Lovecraft. \t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nThe Great Old one could be the leviathan mention in bible who is satan himself. Satan goal is to destroy humanity by mingle themself (demons) with human to corrupt the good seed.\t\t\t\t\n\t\t\t\t\n\n", "comment_67": "\nThe song is based upon the short story \"Shadow Over Innsmouth\" by H.P. Lovecraft which has been written in 1936. \"Shadow Over Innsmouth\" was Lovecraft's sole story which has been released as a book when he was alive. His further short stories only appeared in his lifetime in a magazine called \"Weird Tales\".\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nAll I really want to say when I hear this song is Ia! Ia! Cthulhu Fhtagn!\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nThe 1st of 4 songs Metallica made about Cthulhu. Others are The Call of Ktulu, All Nightmare Long, and Dream No More.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nThey say it is the worst song of the album, only because the rest of the songs rule so much. The music of the song isn't so good but the way james sings it it givves you the chills. It rocks also for sure.\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nLord of the Rings anyone?\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nI beleive that the song could be about the loch ness monster, fearless Wretch\r\ninsanity\r\nHe watches\r\nlurking beneath the sea\r\ngreat Old One\r\nforbidden site\r\nHe searches\r\nHunter of the Shadows is rising\r\nimmortal\r\nthe loch ness monster is usually portrayed as a recluseve monster hardley seen only watching from underneath\r\nalso the legend has been around for ever \r\nforbidden one only reveils its self to those he chooses\r\nbut once someone sees it they tell everyone else \r\nand no one beleveis them so they are driven to madness\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nThis song also has to do with the absence of Jaymz parents throughout most of his life, and how people need that support in their life.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\nThis is a great song about something that should not be hence the tital of the song \"The Thing That Should Not Be\" lol\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\nall you mother fuckers are gonna pay this is the greatest heaviest metallica songs ever when I find you fucks I'm gonna make you eat my shit. shit out that shit eat the shit with my shit that I made you eat                            \n\r\n                                                             -Bong\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nI don't like this song, it's so repititive.\r\nBattery and Master of Puppets are repititive too,\r\nbut they get away with it..\r\nThe Thing just dosen't..\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nyea king nothing, the solo is so crazy. not that great of a song, though\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nthis song, to me, is about people doing bad things then seeking redemption. \"The Cure\" is God. \"I do believe\" because in the Bible it says thats all you have to do to get into heaven. Im not a very christian man but thats what I keep hearing\t\t\t\t\n\t\t\t\t\n\n", "comment_79": "\nI don't know, it doesn't seem that a simple  H.P. Lovecraft reference fits into the theme of the album, which is being conformity or being restrained and controlled by others. I think that that's just on the surface, when i first heard it, i thought it was talking about how the A-bomb is the ultimate control -- It's use or lack of it has control of the future of the world.\n\r\n\"Messenger of Fear in sight\r\nDark deception kills the light.\" -- Could refer to the Cuban Missile Crisis, when the tangle of espionage almost killed the world.\n\r\n\"He watches\r\nlurking beneath the sea\" -- Nuclear submarines could end things faster than world leaders could react.\n\r\n\"Crawling Chaos, underground\r\ncult has summoned, twisted sound\" -- Underground testing on the bomb, which was summoned by the Manhattan Project (a sort of cult, not letting anybody in and keeping many dark secrets)\n\r\n\"Out from ruins once possessed\r\nfallen city, living death\" -- Hiroshima was destroyed, while the fallout caused radiation sickness (living death)\n\r\n\"Not dead which eternal lie\r\nstranger eons Death may die\" -- Not only a reference to the poem, but the fact that the planet will become eternally dead. In the fact that there is nobody left to die, Death itself dies.\n\r\n\"Drain you of your sanity\r\nface The Thing That Should Not Be.\" -- People ignore the atomic bomb because it's too scary a thing to face. Should people continue to ignore it, there could be disastrous consequences of not realizing when it is going to come.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nSo many ignorant, illiterate morons trying to \"educate\" others.\n\r\nFirst of all, this song is not based on H.P. Lovecraft's short story \"Call of Cthulhu\". It is based upon his novella \"The Shadow Over Innsmouth\". The \"Thing That Should Not Be\" in question is aquatic deity Daigon, for which there is a cult founded and dedicated to it within the city Innsmouth. The \"hybrid children\" are the Deep Ones, which are basically half-human half-fish mutations created by Daigon.\n\r\nSecondly, there is NO deeper meaning to the story. There is nothing to be taken away from this song, there is no implication to anyone's life experiences, or purpose to the song. It is nothing more than Lovecraft's story in song form.\n\r\nFinally, quit trying to educate people on subject matter you know nothing about.\t\t\t\t\n\t\t\t\t\n\n"}