{"comment_0": "\nJust like schism86 said, i had this post before the site re-vamped...  I'm just gonna copy what I wrote before.. It's hella long, so only read it if your REALLY interested.\n\r\nFirst off, sorry this is gonna be so long, I'm gonna disect pretty much every line\r\nWell guys, I'm not here to clear anything up on the meaning of this song, cuz I don't know it for sure.  I like to think my interpretation is right (some of you are probably closer though), but it's open to everyone's views, and I love reading what all of you think.  But anyway, here goes.\n\r\nI think unlike most songs, Tool is pretty straightforward on this song.  It doesn't seem allegorical, but it is quite deep.   To be honest, after buying lateralus and hearing this song, it became my life motto.  I hate grudges, and I can't stand holding them now.  It just seems so childish.  \n\r\nI think Maynard is almost throwing the idea of grudge holding back into the faces of people that do it.  He's making fun of them for such a savage thing.  Like the first line... \n\r\n\"wear the grudge like a crown of negativity\" (go ahead, put your grudge out where everyone can see it, let everyone know that you're mad and that you want to be that way).\n\r\n\"calculate what we will and will not tolerate\" (decide exactly what you want to get mad over that would make you hold a grudge. this way when it happens, you can keep putting that crown back on)\n\r\n\"desperate to control all and everything\" (you don't want to be on good terms.  you WANT the grudge.  if you can control the grudge, you can control the person you hold the grudge against.)\n\r\n\"unable to forgive your scarlet letterman\" (although they know they've done wrong, you won't forgive them under any circumstance)\n\r\n\"clutch it like a cornerstone, otherwise it all comes down\" (clutch the grudge that you hold like a cornerstone, because you know if you don't then the grudge dies. you don't want that)\n\r\n\"justify denials and grip em to the lonesome end\" (come up with excuses to continue holding the grudge, and stand by them until the end, even when everyone hates you for what you're doing, hence lonesome)\n\r\n\"Terrified of being wrong, ultimatum prison cell\" (you're scared to death that someone can prove that you have no reason to hold a grudge.  you worry about it so much you put yourself in your own little prison over it)\r\n[Remember this whole time, I believe Maynard's making fun of the people that do this.  Almost reverse psycology by showing them how stupid it is]\n\r\nThen I have to agree with 'Insecure Dilusions' idea on the Saturn thing.  Saturn was god of all greek gods.  he was sooo worried he could be overthrown he ate his children.  Yet Zeus was the one thing that Saturn overlooked.  That one thing overthrew Saturn and killed him.  Hang on to the grudge like saturn would, because if you don't you'll be humbled in your ignorance.  And later he says \"ignorant to the damage done\"... ignorance isn't stupidity, it's not knowing about something.  in this case, Saturn was ignorant to the damage done to himself until Zeus killed him.\n\r\n\"unable to forgive and we're sinking deeper\" (you won't forgive, and for this you're slowly creating a larger grudge)\n\r\nThe grudge begins to define you, confine you, even control you.\n\r\nAgain to the Saturn reference for almost the rest of the song.  Saying that Saturn, almost as if, takes over your body.  He and you become one, you make the decisions Saturn chose.  And not until you end the grudge will he quit tearing you apart.\n\r\nFinally Maynard quit's criticizing and simply tells them what they need to do.\r\nGive away the (corner)stone.  Let the oceans take and transmute this cold and weighted anchor (that was your grudge, holding you down).  Give away the stone.  Let the waters take and transmute these leaden (heavy burdensome) grudges into gold.  LET GO.\n\r\nAnd thus ends my entirely too long interpretation.  However, this is what I believe and exactly how I feel.  This pretty much explains my life motto.  I thank each of your for your time in reading such a long and drawn out post.  You deserve a pat on the back for putting up with my jabbering.  \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nSorry for the length of this.  It's a paper I wrote in school about the grudge.  Let me know what you guys think.\n\n\r\n    Letting go is the sometimes the hardest thing to do in life.  Moving on is hard whether we are facing a death or holding a grudge.  Both circumstances take an emotional toll, but they can be amplified by an unwillingness to let the past rest.  Perhaps the hardest part about situations like these is that the longer we hold on to the past, the stronger its grip is on our lives.  The Grudge, by Tool, is the first song from their album, Lateralus.  Simply defined, a grudge is a â\u0080\u009cfeeling of deep-seated resentment or ill willâ\u0080\u009d. A grudge is more than a surface unwillingness; a grudge takes on a personality, it grows in strength, and it eventually controls our life.  Destruction is the only outcome for someone who cannot escape the deadly grip of a grudge â\u0080\u0094 he has to let go.  \r\n\tIn the first line, Maynard James Keenan, Toolâ\u0080\u0099s lead singer, describes the grudge as a â\u0080\u009ccrown of negativityâ\u0080\u009d.  Crowns are usually seen as something glorious, brilliant, and beautiful; Keenan takes this symbol of power and authority and twists it into something dark and terrifying, but the idea of power is retained.  He is almost saying we are imbued with some sort of negative power when we allow this grudge to define us.  He goes on to say, â\u0080\u009cCalculate what we will or will not tolerate/ Desperate to control all and everythingâ\u0080\u009d.  With this false sense of power created by a grudge, the person becomes filled with a sense of being able to control everything around them.  Typically, with the presence of a grudge comes a plan for revenge.  A person wearing this crown of negativity is oftentimes so blinded by it they are unable see the limits of their power.  \r\nI believe the next line, â\u0080\u009cUnable to forgive your scarlet lettermen,â\u0080\u009d is an allusion to Nathaniel Hawthorneâ\u0080\u0099s Scarlet Letter.  The antagonist in this book, Roger Chillingworth, is seeking revenge on his ex-wife.  He believes that she has committed an act of adultery against him.  His quest for revenge consumes him so much that it affects his external appearance.  His ex-wifeâ\u0080\u0099s lover, Arthur Dimmesdale, dies before Chillingworth is able to exact his revenge.  Chillingworth soon follows him.  His life had become so intertwined with his grudge that they were interdependent.  When the source of power, the target, of his grudge was gone, the life drained out of him.  He died with nothing.  Just like Keenan said in his song, â\u0080\u009cClutch it like a cornerstone/otherwise it all comes down/justify denials and grip it to the lonesome endâ\u0080\u009d.  A cornerstone is the source of stability for any building.  It needs to be solid and immovable.  Similarly, a grudge provides stability for a personâ\u0080\u0099s life, no matter how false that stability is.  Friends around us may point out how silly we are, but the holder is blinded by power.  Part of us is, â\u0080\u009cterrified of being wrong,â\u0080\u009d as Keenan says.  In the eyes of the holder, if he is found to be wrong, he will be put in an â\u0080\u009dultimatum prison cellâ\u0080\u009d.  \r\n\tIf the song ended here, we would be without hope â\u0080\u0094 locked away in a prison cell, left to our own devices.  But Keenan tells us, â\u0080\u009cSaturn ascends/choose one or ten/hang on or be humbled againâ\u0080\u009d.  The reference to Saturn ascending is an astrological idea of changes in life associated with the completion of a revolution by Saturn around the earth.  At this time in life, a choice has to be made.  When he says â\u0080\u009cone or ten,â\u0080\u009d I believe he uses this to express to polar opposites.  There is no middle ground; either the grudge is given up or held on to for another period of life.  The one glimmer of hope here is the presence of a choice.  Despite all of the power the grudge has, we can still choose to cast it away.  \r\n\tEven though Keenan provides a way for escape, he does not want us to become complacent; he reminds us of the only outcome if we choose to hang on to the grudge.  If we are â\u0080\u009cwear[ing] the grudge like a crown/desperate to control/unable to forgive,â\u0080\u009d then we will be â\u0080\u009csinking deeperâ\u0080\u009d.  This begs the question, deeper into what?  I believe when a grudge comes to be, it is born out of reason.  We were wronged in some way, but as a grudge lingers in our mind it begins to create a false reality.  The truth we see with our eyes becomes distorted when it passes through the filter of the grudge.  The grudge becomes â\u0080\u009cdefining, confining, [and] controllingâ\u0080\u009d.  Our real self is buried away within our subconscious; seemingly powerless to regain control.  So we continue downward.  \r\n\tThen â\u0080\u009cSaturn comes back around to show you everythingâ\u0080\u009d.  Now is the time to make a choice.  This stanza is the first time in the song that Keenan refers to the grudge as a stone.  He says, â\u0080\u009c[the grudge] drags you down like a stoneâ\u0080\u009d.  The other option is to be treated like â\u0080\u009ca child, light and innocentâ\u0080\u009d.  The process of separating ourselves from the grudge is not easy.  We have to completely humble ourselves to the level of a child.  He is saying there must be a return to innocence; all of the unnecessary weight in life must be eradicated.  All the â\u0080\u009c[calculations of] what we will or will not tolerate,â\u0080\u009d and the â\u0080\u009c[desperations] to control all and everything,â\u0080\u009d serve only to complicate and fill our life with meaningless pursuits that waste any chance we have of living.  We must be like a child because only a renaissance of innocence will bring freedom from this â\u0080\u009ccold and fated anchorâ\u0080\u009d.  \r\n\tFinally, Keenan begs us to â\u0080\u009cgive away the stone/let the oceans take and transmutate this cold and fated anchor/give away the stone/let the waters kiss and transmutate these leaden grudges into goldâ\u0080\u009d.  His imagery of the oceans and waters is an allusion to baptism.  A thorough cleansing is necessary for change, but with change comes reward.  If this trial in life is endured, then â\u0080\u009cthese leaden grudges will be turned into goldâ\u0080\u009d.  Perseverance breeds greatness. \r\n\tKeenan breaks down in the end of the song.  He lets out a passionate scream â\u0080\u0094 I envision him falling to his knees with his hands on his head.  He knows he must let go, has to let go.  He begins whispering â\u0080\u009c[l]et go, let go, let goâ\u0080¦,â\u0080\u009d over and over, almost chanting it.  The song crescendos as he chants louder and louder until he is screaming â\u0080\u009clet go!â\u0080\u009d  He knows where the grudge is taking him; he sees the destruction waiting for him if he cannot let go.  Change is never easy, but he has to try.  \r\n\tA grudge begins in reason but transforms into a powerful entity capable of destroying lives.  The only way to escape the endless spiral of increasing desperation to control everything around us is to choose to change.  No matter how attractive the crown is, we need to take it off.  Maynard James Keenan begs us to throw away â\u0080\u009cthis cold and fated anchor,â\u0080\u009d but no one can make us let go, it must come from within.  In the end, it is up to usâ\u0080¦it always has been.     \n\n\n", "comment_2": "\nMaynard once said he used his music to get out frustrations he had of his past, and this I believe is him letting his past go. About his Family life, his look on other people, and even God. He really sees his life of anger leading him no where. Tool's earlier records showed Maynard's and the bend's anger and frustrations to the point where they were called an anti religious band by many. (In ways they were) Well Lateralus came and showed us a new side. \n\nMaynard sees the problem of hate and grudges, and the \"Prison cell\" it puts you in. As Saturn comes back around to show him everything, he sees it will consume him and spit him out until he chooses to let it go. \n\nThe ending is so powerful. I just picture Maynard thinking of all the things he's mad about, and not just letting them go, but literally changing his mind set as he screams his heart out. \"Turn these leaden grudges into gold\". This song is an utter masterpiece. Plugged in online didn't give this album enough credit, cause I see more Christian lyrics in this song alone than I do in some songs on Christian Radio. Funny actually. (My opinion though)\n\n-Zach\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nPeople use grudges as a means of control and supremacy, to make other people feel lesser. I think itâ\u0080\u0099s about how letting go of past indiscretions and moving on will lead you to absolution, but allowing yourself to feel guilt because of someone elseâ\u0080\u0099s resentment of your actions will only tie you down. Resentment is futile. but that's just what i get from the song.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nHere is my interpretation of 'The Grudge' \n\r\n\"Crown of negativity\" \r\nThe first thing that pops into my head is Jesus' crown of thorns, a burden. The crown is thereby also a symbol of religion â\u0080\u0093 but this is a negative symbol. Because these days Christianity is a controlling power, which has decided for us what we will and will not tolerate. But the crown of negativity represents the reduction of our thinking IN GENERAL. We carry the crown on our heads, the highest place of our body, and it overshadows everything else. \r\n\"Unable to forgive your scarlet lettermen\" \r\n\"The scarlet letter\" is a book by Nathaniel Hawthorne in which a woman who has committed adultery forced to wear a crimson 'A' on her chest for the crime. We stamp other people, judging them and refuse to forgive them. \r\nThis hatred of a foreign party - another person, another religion, another culture - most people have to maintain. Many people clutch their grudge as if it were a cornerstone, everything their unity (if is a group of people) is build on. But it may also be that the individual clings to this feeling to keep himself/herself together. In such cases we always try to justify denials. We cultivate our hatred and dare not to let it go, because we are afraid to make mistakes. So we put ourselves in a prison cell of ultimatum. \n\r\nThe most interesting part of the song deals with Saturn. After a little research has been up to me that everything in the song forms a synthesis. First, it takes Saturn about 29 years to go round the sun. 29 years symbolizes a mid-term crisis, a split. \r\n\"Choose one or ten\" \r\nThis refers to the zodiac in astrology, Aries is the number one and Capricorn is number ten. So the choice is between Capricorn and Aries. \r\nCapricorn is ruled by Saturn (Saturn is the creator of civilization and the social order, representing authority). Capricorn is stubborn, cautious and disciplined. \r\nAries is ruled by Mars (Mars usually associated with strength, spontaneity and energy). \r\nAries is bold and impulsive. In many ways it is the complete contrast to Capricorn. You could say that Aries is the Zodiac pioneer. By the way â\u0080¦ Maynard a Ram himself. \r\n\"Hang on or be humbled again\" \r\nBy choosing Capricorn you will again submit to the Authority and thus be humiliated, bow to other powers. Weâ\u0080\u0099ll continue living with this ugly feeling, unaware of how much damage we have caused to the outside world and ourselves. The grudge will narrow thinking further define and say that things can only be one way. \n\r\n\"Saturn comes back around to show you everything \r\nLet's you choose what you will, will not see and then \r\nDrags you down like a stone or lifts you up again \r\nSpits you out like a child, light and innocent \" \n\r\nThis refers to the myth of the Greek god Cronos (which the Romans later called Saturn) who ate his sons, so they would not kill him. Rhea (Cronos' wife) gave birth to another son, Zeus, and she gives her husband a stone instead of the child, and Cronos swallows the stone, believing it is his son. Later Zeus kills his father and sets his siblings free. The song raises the question: Will go down like a stone â\u0080\u0093 just like all the others ones â\u0080\u0093, or you will be like Zeus (Aries), escaping it all?\n\r\n\"Let the waters kiss and transmutate these leader grudges into gold\" \r\nIf we look at everything in an alchemical way, the solid substance, which is associated with Saturn, is lead. Lead represents decay and death. When Saturn ascends, youâ\u0080\u0099ve got the choice between remaining the way you are and fall into decay, or to let go of a part of yourself (death, in a way) and thereby transform lead to gold - dissolve \"the cold and fated anchor.\" \n\r\nJust try to imagine all the energy we would have, if we did not spend so much time on bearing grudges.\n\r\nLike so many of Tools songs, this song is a metaphor for personal development.\n\n\n", "comment_5": "\ni think this song is pretty straight forward.  Grudge, holding onto it, gives you a sense of worth, knowing whats wrong, who to blame. But it also holds you down, not letting you overcome what happened.  Its refered to as a prison cell, confining you. You can hang on to it, or let it go and be humble.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI think \"one or ten\" means \"all or nothing\". In other words, \"no compromise\", \"my way or the highway\", etc.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nThe 'Saturn comes back around' and 'Saturn ascends' lines makes me think of the No Doubt album 'The Return of Saturn'.\n\nSeems like an astrology reference to me. Anyone know the relevance of Saturn ascending and descending in astrology?\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nSome of you are much closer than others but still too much dissaray. I feel as if I am completing treason by literally translating it for you but afterall, this song is the holy gift in every sense of the term. Tool is heavily aligned with the esoteric and masonic occult symbology. Many people fail to make the parallels between these truths and our advanced ancient civilizations. The scarlett letterman are in fact alien beings who are in contact with many people on this earth. They created the human race and have directed our progress over many thousands of years. Saturn signifys destruction and mortality. The ancients were not savages like we were told, in fact they were far from it. The earth is surrounded by a false ascension matrix, it is a prison planet. It is more like a zoo than anything. When humans reach a certain technological peak we are wiped from the globe again by great flood and catastrophe. The only truth left is inscribed in the only thing that survives, stone. The grudge is the enlightened humans who are fully aware of this profound truth that resent their creators for placing them in a kind of matrix or prison. We have reached this technological point many times already, only to succumb to greed and depravity. Afterall, many different alien beings have attempted to have a hand in the path humanity decides to take. Transcending this barrier or obstruction and breaking free is knowing forgiveness and reaching true polarity of the soul. Ultimately, it was what we refuse to see that will decide our fate [or anchor]. We can walk with the Gods in eternity or we can be doomed over and over again. Spit back out like an innocent child with no recollection whatsoever. \t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nAs for the mythological aspect, I really think it has af few key verses about Saturn, (Greek Cronos.) In the Cosmogony (Creation of existance,) there is a constant war of succession; It starts with Ouranos, who, to avoid being succeeded by his children, prevents their physical birth from Gaea by entraping them in her womb. A beautiful scene progresses where Cronos (Saturn) sits in the womb with an adamantine sickle, given by Gaea, poised to cut off his dad's wang when he gomes to fornicate with Gaea. Well, he does just that, and the children, the Titans, escape and Cronos takes over as the prime deity. \n\r\nThe counter-succession continues when Cronos has children, but instead of trapping them inside like his father did him, he takes them directly from birth and devours them. Hence this whole idea of Saturn 'consuming' in the lyrics. \n\r\nThe 'stone' mentioned comes in as well--Zeus, who's craft is everlasting, decides he wants to succeed his father, and to avoid being devoured, he takes a chance, and dresses a stone in child's clothing. Cronos is fooled by the ruse and consumes all children but Zeus, and the stone. Zeus then overthrows Cronos and reigns as the Prime Deity. \n\r\nWhile I'm sure there are other intended meanings, you can see how I came to take this song as \"The Grudge\" of children against the oppression of their authority figures, and the chances they took to overcome and improve their conditions of living. \n\r\nMaybe I'll also mention the part where the ocean transmutates Ouranos' castrated grudge of a penis into Aphrodite (Roman Venus).\n\r\nAgain, I'm sure this song isn't a literal telling of the Cosmogony, but it has some hints towards it.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nok i don't get it. why are a lot of people saying \"What this song means is...\"? what they should be saying is \"What this song means to ME is...\". people shouldn't just be putting words in maynard's mouth. although some theories may be true, you'll never really know what the hell a song means because you aren't the one who wrote it.\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nallrighty first comment on this site k\r\nits not maynard its tool its a collective thought on all members of the band they all agree its just that maynard is the brilliant one with the words, danny carey is the brilliant one that actually composes most of the actuall music, one does the videos and other art shit anywayse its tool not one of the magnificant men, tool is also multi-interperated, i really like the use of saturn in this song and the relation to comes around again cause saturn was a ancient god that judged people and it would come around twice in ur lifetime... and it would judge your life ur choices and your values ect..., in a way that god does in monotheistic belifs buty u chose 1 or 10 theyre was no gray area u held on to ur grudge or let it go, but that is me and tool is great but baboons will be baboons. . . .\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nlead and gold are both heavy. even if the leaden anchor were transmuted into gold, it'd still drag you down.\n\r\nalso, the song points out (by means of repetitios implication) that holding a grudge also tends to fabricate a vicarious point of existence. for instance, take the widely-used (in American mass-media, at least) cliche of some bad-assed protagonist's family, friend, well-loved pet, etc. being mercilessly slaughtered. he'll cry for awhile, then he'll get a gun and start killing people and blowing shit up left and right. he is more-or-less immortal, kept alive only by his resolve to kill all of the antagonists before finally either dying or riding off into the sunset.........still, all thats accomplished is more people having been hurt and killed.\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nMaynard is such an amazing charater, his music and meanings have made me have a whole different look on life and has changed me. He has amazing talent and an incredible voice, his music actually means something and i get relate to a lot of it. \r\nMaynard, you fucking rule....\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nI researched the Greek God Saturn and this is what i came up with.  It makes perfect sense. \n\r\nSaturn is esoterically linked to Karma. Saturn intensifies feelings of isolation, sadness, depression, etc. Cronus spent the last of his life as a prisoner of Tartarus, a dark, gloomy place that can be described as a pit of blackness. Depression is often a pit of darkness to those who suffer from it. Saturn, badly aspected, gives us this feeling. But once the dark side of Saturn is recognized, his bright side can be brought into view and enhanced. Sadly, Saturn has been regarded only as miserable and attributed to despair and darkness, lending to the thought that there is no way to escape it's confines. Feelings of shame, fear, guilt and humiliation shackle us and keep us confined to the pit of darkness. The way to get out of the pit is to stop placing blame on others and take personal responsibility for our situation in life.\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\nAs with many Tool lyrics, these have deep spiritual meaning. It's a very simple truth.  You don't have to cut the songs into a million pieces to realize that he is writing as his own ego.  The EGOIC (thought based on form) mind clings to suffering to form our self projected identity.  It's not who we are, Watch your thoughts and you'll realize that they are happening to you, it might make you laugh.  GRUDGES cause suffering to yourself, it's pointless because what happened happened, it is what it is now, the past is the past and does not exist but as a thought. until people start to recognize that these thoughts (grudges, hatred, the ego loves it, the ego is that bastard thinker of your thoughts.  You can either sit in the unconsious state and watch it happen or do something about it.  the way the song is written is through the egoic (thought projections without basis) mind singing.  If you let go of your grudge your ego will lose part of it's identity, which seems bad at the time but in the long run can be a blessing. it CONSUMES YOU. It took me a long road of suffering to realize that there is an easy way out of that prison cell and that is through recognizing that bastard voice we all have which is the ego telling us what's good and bad, keeping hold of that grudge, the longer you hold it the stronger the ego gets.  I know I wrote a lot and no one has to agree with it but if you read this far certainly you must see some truth in it? your-self implies two. Can't live with your self? = 2 then recognize it and live as yourself. (see parabola for another crystal clear truth) Past and future are just thought forms, right now is the gateway and if you get angry at this examine that thought.  Eckhart Tolle helped me realize most of that. Just realized Tool is hitting on the subject bigtime, it's like talking code to the egoic mind though. \t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nJust wanted to leave a bit of feedback about the use of Saturn in this song...\n\r\n\"Saturn is the planet of responsibility and symbolizies the ethic of hard work. Under its influence a person's character is strengthened through trial and difficulty. It has been said that Saturn disciplines us until we can learn to discipline ourselves.\n\r\nSaturn was a symbol for Father Time, for he brought to an end all things that had a beginning.\n\r\nIn astrology, Saturn is the planet of diligence, self-control, and limitation. Its domain is patience, stability, maturity, and realism. Its influence is stern and restrictive, cold and severe.\n\r\nSaturn is called the Celestial Taskmaster, for it teaches us the lessons we must learn in life. In the grand plan of the universe, Saturn does not give us more than we can handle. Under Saturn's influence we achieve by overcoming obstacles and hardships. Somtimes the effort itself is the reward, for effort is what builds character. In the end, what we learn under Saturn's influence we keep for the rest of our lives.\n\r\nSaturn gives the power to endure and provides the tenacity and perserverance to realize your potential. Saturn's effect is to delay rewards until they are earned. It perfects human nature while it bestows an ability to wait. It is the planet of courage, steadfastnes, and integrity.\n\r\nIn its symbolic form, Saturn is our destiny. It rules fate, the things we cannot escape, and the payment we must make for what we receive.\"\n\r\n--Joanna Martine Woolfolk\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nthis song is simply about the basis of reaching a new level of consciousness and enlightenment.  one must initially (first song) \"let go of all\" to begin a life of pure bliss.\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\n*sigh* \r\nOk first things first. the best way to find any meaning within Tools music is to listen to the overall feel of the song. don't base it off of lyrics alone cuz they can be missguided w/o feeling the music. \n\r\nSecondly, most of the album Lateralus was based off of spiritual  cleansing thus if liftened to you should be enlightened into a peaceful state of mind.\n\r\nThe Grudge was influenced by The Scarlette Letter hence the lyrics \"wear the grudge like a crown\" and \"Scarlette Letterman\". however MJK is an artist, tho the song may be influenced, it is still his and the other band mates works of art.  \n\r\ndon't draw out this long difficult meaning behind it because he's simply saying... Grudged are pointless. \n\r\nUndertsanding tools works\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nThis is obviously about a grudge (hence the title) that's followed him throughout his entire life. He obviously wants the person to let go of the damn thing and get on with life, but they're to stubborn to do so. He refers to the grudge being a crown of negativity, meaning the person holding the grudge has the authority of being negative and ignorant. All up a fantastic song and amazing band :D\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nâ\u0080\u009cSaturn ascends, comes round againâ\u0080\u009d part of the song.  More than likely that part of the song has to do with Galileo debunking the earth centered concept of the universe. \n\r\nSaturn is the most notible celestial object that follows a retrograde motion in the night sky. Makes sort of a circle loop shape. \n\r\nThis of course proved the fallibility of the church.\n\r\nI still donâ\u0080\u0099t know whatâ\u0080\u0099s meant by, â\u0080\u009cchoose 1 or 10â\u0080\u009d\n\r\nThe line â\u0080\u009cunable to forgive this scarlet lettermanâ\u0080\u009d was a book written in 1850 about a woman who had an affair and is forced to wear the red scarlet letter A around her neck. \t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nCould this song possibly mean the grudge perhaps being used as a metaphor for the actual ego? If you plug that idea in while reading the lyrics it would fit. The ego is like an anchor or stone. People wear it like a crown as if to define themselves but it confines the real you inevidibly. Let it go and know your true self. Otherwise you continue to sink. Now the ego ironically is something to grudge.\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\n This song  talks about holding a â\u0080\u009cGrudgeâ\u0080\u009d against something or someone. The first four lines,â\u0080\u009cWear the grudge like a crown of negativityâ\u0080\u009d and â\u0080\u009cCalculate what you will, Will not tolerateâ\u0080\u009d are trying to say: â\u0080\u009cdecide exactly what you want to get mad over that would make you hold a grudge. This way when it happens, you can keep putting that crown back on  put your grudge out where everyone can see it. Let everyone know that you're mad and that you choose to be that wayâ\u0080\u009d. According to the speaker holding onto a grudge is what people believe will give then a sense of worth. The speaker seems to be declaring this in sarcasm. It seems more like he is throwing the idea of holding grudges back into the faces of people that do it. He's making fun of them for giving in to such a savage and pointless concept. I do not truly believe that he thinks knowing whats wrong, and who to blame give you a sense of worth. He most likely believes that blaming others for what's wrong only holds you down. It prevent you from overcoming what has happened. The line, â\u0080\u009cClutch it like a cornerstone otherwise it all comes downâ\u0080\u009d is referring to the the power the grudge has. It is a cornerstone because holding onto it causes you to be blinded by a wall of ignorance. â\u0080\u009cThe Grudgeâ\u0080\u009d serves as the cornerstone of this wall.  If you remove the cornerstone, humbling yourself and letting go of your grudge, the wall of ignorance will finally have its chance to disappear  allowing reason to take control over emotion. Until then your ignorance will only bring you further away from the any solution. â\u0080\u009cThe Grudgeâ\u0080\u009d is  a prison cell, confining you. You can hang on to it, or let it go and be humble. \t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nI think that this song is pretty simple in its meaning... and ultimately beautiful. The Metal genre is usually stereotyped as angry and hateful but this is another song that proves it wrong.\n\r\nThis song is about a hate or a grudge. Something has happened to you that you can't let go of that you can't undo. It festers and seethes within you. a Grudge this deep can take hold of a person until all thats left is that feeling.\n\r\nThis song is that process. and its ultimately telling you to let go and be free.\n\r\nThey sing as your grudge as being a corner stone. Something that holds up the foundation of your life. Anchoring you to one spot. The best part of the song however is the last verse. Speaking of the ocean, letting it kiss you clean of your anger and hate. Letting go of that Grudge and letting the anchor it had become sink into the sea. Water in many traditions and stories has been cleansing. Its the perfect imagery. \n\r\nThe song basically is telling you to let it go because whatever it is that your Grudge is about is not worth mulling over,\t\t\t\t\n\t\t\t\t\n\n", "comment_24": "\nBesides the obvious theme of letting go of a grudge that holds you down with negativity, and other obvious references, the whole Saturn thing confused me.  I found an interview with Maynard where he explains it.  (Not word for word) He basically says when you're born, Saturn is in a specific position.  It takes about 28/29 years for it to make a full rotation around the sun back to it's original position.  This represents a time in your life when you can evaluate where you are.\t\t\t\t\n\t\t\t\t\n\n", "comment_25": "\nThis song is obviously about the failure of men to let go. Every person has things she likes or dislikes. She wants to get what she likes, and struggles to change what she doesn't like. \n\r\nAlmost everyone must have probably heard the definition \"control freak\". Those people can't stand anything happening outside their grasp. I think every person has this to a certain degree. This song is about our struggle to control and change everything. \n\r\nI smell Buddhism all over this album and this song is no exception. Gautama Buddha says there are no errors or no flaws in anything. Everything is perfect and everything is just what it is supposed to be. Everything is in perfect harmony. It is our \"ego\" which interprets them as good or bad. The ego is formed because we want to identify ourselves. If you are neutral about everything, then you are no one. So driven by this instinct, we form something called \"ego\" which is no more than a dirty glass we wear. It makes us perceive things according to some components (a very simple example : you ate a stale apple in childhood which caused a serious nausea you still don't like apples) which are formed during our experiences, mainly in childhood.\n\r\nSo to summarise, we are not \"programmed\" from the start to like or dislike things, it is just a struggle of our consciousness trying to identify itself. \n\r\nSo to go one step further, we try to change or erase things we find faulty. Or we try to control things we like because of the fear that they can go astray. \n\r\nWhat we must do is to accept everything as themselves and make peace with the things we don't like.\t\t\t\t\n\t\t\t\t\n\n", "comment_26": "\nI loved everyone's thoughts thanks for sharing guys! I've ALWAYS loooooved this song, but it means something different to me now as I am a new member of al anon. I'm also finally working on changing my whole life, specifically learning to feel my emotions when I experience them. As well as allowing myself to actually feel emotions I've had stuffed inside for a good 20 years. So, I just find when I am down and resisting the necessary changes that I need to make for my own sanity and we'll being, this song just reminds me it's okay and that it'll be worth it in the end! Just thought I'd share since I have gained a slightly new perspective and maybe it'll touch someone else the same way it has me! : ) thanks!\t\t\t\t\n\t\t\t\t\n\n", "comment_27": "\nI'm not gonna lie, I don't think anybody here has really gotten what Maynard was going for in the lyrics.\n\nPeople picked up on the obvious message of the sentimentality of a grudge, but they don't comment on the actual message of the song.\n\nThe song is clearly about global conflict. There are multiple obvious references to the cold war, being:\n\n-\"Scarlet letterman\", red, commonly used to describe communist, and letterman being surname, or more importantly origin. In other words, unable to forgive the individuals from communist origin.\n\n-\"Ultimatum prison sell\", countries constantly trapped in their threats to others. Notable examples of ultimatums, during the cold war are the conflicts on the borders of east and west Berlin, where both parties were trapped, unable to give up, or win. \n\n-\"Calculate what we will, and will not tolerate\", obviously referencing the response to threat strategies employed by the US and USSR.\n\nI don't think the song is SPECIFICALLY about the cold war, but it does use it as an anecdote, or example. We infer the overall message the Tool are pushing in this song is that people need to:\n\n\"let go\" of global conflict. \n\nThe references to Saturn, are references to the Greek god, which suggests some sort of revolution (as Saturn was know for leading his associates into a mythical revoltuion).\t\t\t\t\n\t\t\t\t\n\n", "comment_28": "\nI'm shocked to see most people think its literally about grudges, and that nobody knows who David Icke is. Go to YouTube and watch David Icke's speeches about Saturn and the reptilian race. In short, aliens of the ancient past have been farming and literally controlling the human race, using Saturn as a massive broadcast tower and the moon as an amplifier. On the north pole of Saturn is a hexagonal gas formation. That shape in nature happens only when there is a frequency distortion, sort of like when you see people create amazing geometrical shapes with sand on a plate which is sitting on a large speaker. The rings around saturn are literally the same that you see on a CD. It's not acoincidence, it's a fact that saturn is producing strong frequencies, and we have no idea why. The frequencies being blasted from saturn are literally codes of instruction that control the behaviors of humans. The so called \"junk DNA,\" aka the 90%+ of our DNA that scientists have no idea what it is, is the program code that the aliens designed us with in order to receive and react to these frequencies. Scientists also have no idea why the moon has the density, or lack of, that it is. It should have a much higher mass and gravitational pull, but it doesnt. David Icke explains the hollow moon theory, which is actually more convincing than the lack of science explaining why it's so lightweight. In fact, Neil Degrasse Tyson even said that it's easier to explain the non existence of the moon, than to explain it exists. David Icke explains that the reason for this is the moon is acting as an amplifier to Saturn's frequencies. Consider what Tool fans say is the \"proper\" order of listening to Lateralus. You start with the last track which is audio from the radio broadcast where the Area 51 worker is frantically explaining that aliens will triangulate on us soon before the FCC cut the feed. That song transitions into the Grudge, which speaks very literally about Saturns affect on humanity. Now, re read the lyrics, and tell me every metaphor about prison, defining, controlling, and transforming after we break free, isnt exactly the theory David Icke proposed. Maynard is hiding the meaning of the song by being so extremely literal about it that we're blinded by it. In fact, you could even argue that the entire album is based on the Saturn theory. We are eternal, all this pain is an illusion - the illusion is the fake reality the aliens have created by broadcasting these signals. Ride the spiral to the end, it may just go where no ones been - the rings of saturn spiral, but literally ending the spiral means there is no more broadcast, and then the human race is free. And dont even get me started on the occults symbols relationship to Saturn ;)\n\r\nSeriously though, listen to Lateralus again after watching David Icke's lectures. It'll blow your mind about and make you rethink every Tool song.\t\t\t\t\n\t\t\t\t\n\n", "comment_29": "\nAwesome song! w00000t! A lot of good songs off of Lateralus!\t\t\t\t\n\t\t\t\t\n\n", "comment_30": "\namazing song, i love when it kicks into the hard part...it buts a smile on my face everytime i hear it....\t\t\t\t\n\t\t\t\t\n\n", "comment_31": "\nNice job madson, I agree with a lot of your interpretation. Hmm, I had a long post on here, maybe I can say this again without rambling.  Basically, I related the song to some psych theories of Karl Jung, which almost always tie in mythological and astrological aspects of our culture.  I think it's worth doing again.  First, I think the Saturn (king of titans) reference is valid, but perhaps not the only reason for mention of saturn.  The metaphors of transmutation of lead into gold--like medieval alchemists attempted to do--lead me to Jungian theory. (Some Jungian influence has been seen in tool before, such as the album Aenima, especially 46 & 2).  Anyway, Jung called an issue that must be confronted (like a grudge, per se) \"base matter,\" \"lead\", or \"saturn\" (names known to alchemists).  Some sort of heat/process is required to transmute it to gold--something good and beautiful obviously--which could be confrontation/resolution of the grudge.  So this reference I think covers many lines of the song.  Also, Jung considered astrological phenomenon and mythology in culture important to the subconscious...perhaps Maynard thinks ties like that are important too, since Jung's ideas have had influence on him.  Personally the application of Jungian theory seems to be central to this song's lyrics, with myth/astrology secondary (always more than a single meaning).\n\r\nGreat song though, I always hate to analyze the good ones to any point beyond getting a basic understanding of them.\t\t\t\t\n\t\t\t\t\n\n", "comment_32": "\nOh yeah, where I said \"issue to be confronted\" that really means anything that you make fully  conscious.\n\r\nAlso, the transmutation metaphor fits the song nicely, as far as letting go of the grudge.\t\t\t\t\n\t\t\t\t\n\n", "comment_33": "\nI've read a few Jung books and I gotta agree with Almighty that Maynard has used some jungian theories in his songs. I think any tool fan should give Carl Jung a go. Man and His symbols is a good starter.\t\t\t\t\n\t\t\t\t\n\n", "comment_34": "\nthat's very true about saturn... its kind of like a renewal time, i think it's 29 years, not 27, but who cares its close\t\t\t\t\n\t\t\t\t\n\n", "comment_35": "\nWow, you guys really look into these songs. I just like the lyrics. The really long note is pretty imressive too. What is it? 30 odd seconds long? Wow. I love Maynard\t\t\t\t\n\t\t\t\t\n\n", "comment_36": "\nThis song is so cool. Probably one of my favorites on Lateralus alongside The Patient and Lateralus. It's pretty straightforward except for the whole saturn thing I don't really get, but from what you guys are saying about, it sounds pretty cool. It's about holding on to a grudge and with it, it brings power, but you must choose to let it go along with the benefits that came with it and return to your humble state. One of the coolest songs on Lateralus! Go Tool!\t\t\t\t\n\t\t\t\t\n\n", "comment_37": "\nthis is a sweet tune\r\nwhen your stoned its like AAAAAHHHHHHHHH :)\t\t\t\t\n\t\t\t\t\n\n", "comment_38": "\nI recently went on a camping trip with my aunts and uncles and their friends out in the middle of nowhere.  They have gone there many times before.  They go there because they don't want to go to a stinkin' resort type place, they don't like all the rules.  Many of them have kids now and they come too.  But the whole time they're worried about what the kids should and shouldn't be doing.  They're constantly telling them not to do things and I bet that this is exactly how they said they didn't want to raise their kids.  I was listening to this song while I was about to go to sleep and I kept on relating it to the adults in the way they raise their kids and in the substances they abuse.  For the 3 days that we were there they were drinking from about 11 in the morning until they went to bed and some of them get high too.  They don't realize that they have to let go of these things if they want to be the best possible parents for their kids.  The best example was my cousin who is a few years older than I and has a son of her own(she isn't married either).  She drinks and smokes weed, she leaves her son with her parents a lot while she goes out partying, basically she doesn't raise her son.  Marijuana, or any drug for that matter, is the worst thing you can do while you are raising children and IT MUST STOP!  If there's one think that our generation must learn from Tool, our parents, and even the older kids of our generation, it's that we have to learn when to stop making stupid mistakes.  If we're still fucking up while we're trying to raise kids, then they're just going to be fuck ups as well.  Life is all about the younger kids because they are life.  If you took the time to read this post I hope you agree with me or have learned something from it.  It's time to grow up, we do know more than our parents and we can see what the real problems are.  Let's try to fix them.\r\nPeace\t\t\t\t\n\t\t\t\t\n\n", "comment_39": "\nI think that this song is about holding onto a beleif that is a cornerstone of your life. Let's take Christianity for example, something we know that Maynard has strong opinions about (Opiate, Judith, Eulogy).\n\r\nMaynard is describing people who need to hold on to their beleifs despite all defying logicial or spiritual influences, in order to stabalize their lives. Holding a Grudge against all possible truths that could defy or disprove that beleif is the grudge that is described. \n\r\n\"Calculate what we will or will not tolerate\" speaks of weighing between what to accept and what not to, according to that central beleif, thereby attempting to \"control all and everthing.\"\n\n\n\r\nHe says \"Clutch it like a cornerstone, otherwise is all comes down.\" Meaning that he can't let go of his beleif (religion, whatever) or else everything else will crash down with it, the mental structure that you've built for your life.\n\r\nHe's willing to \"Justify denials and Grip 'em to the lonesome end,\" placing himself in a virtual prison cell, created by this limitations that he's send for his mind. (what he will and will not tolerate, confining and defining factors). \n\r\nThen comes the references of Saturn ascending, and aspect of this song that you cannot ignore. As stated in previous posts, Saturn completes its orbit around the earth every 27 or 29 years, therefore beginning a new one. This is supposed to be a time of renewal, of the heart and mind. This may be a reference to a midlife crisis, someone going through this process and possibly coming to the epiphany that the beleifs in their life are false, challenged by new insights. \n\r\n\"Hang on or be Humbled again\" refers to the choice of remaing stalwart to a cause or releasing and accepting, a life changing choice.  He is torn between his inevitable acceptance, and then the release of his grudge. \n\r\n\"Lifts you up like a child Or drags you down like a stone to Consume you till you Choose to Let this go.\" This again illustrates the two possibilities of acceptance or continued denial, and their emotional impacts. Although here, he insinuates again that acceptance is inevitable. \n\r\nThe end stanza refers to the release of the grudge, allowing this \"cold and fated anchor\"   (the grudge/stone) to be \"transmuted\" (changed) into gold.\n\r\n...and that...is the result of my heavy obsession with tool's lyrics.\n\n\n", "comment_40": "\njoshthack, i totally agree with you. so much information is avaliable to us today about the damage we are doing our bodies and spirits by abusing them. we do have to stop, we cant plead ignorance as our excuse anymore. as for the song, u guys are so amazing, u tell me everythign i could possibly need to know about the meaning of all of tool's songs! i love reading what you write cos there is no way i'd come up with this stuff myself! \t\t\t\t\n\t\t\t\t\n\n", "comment_41": "\ni think this song is about maynard having a hangover.\t\t\t\t\n\t\t\t\t\n\n", "comment_42": "\nDon't forget to notice the 2001 a Space Odysee refernaces :D....\t\t\t\t\n\t\t\t\t\n\n", "comment_43": "\nthe song is basically about negativity, and mocking people who hold grudges etc. the first line of the song, \"wear your grudge like a crown of negativity\" is a metaphor, meaning that he is mocking people that tend to show off how negative they are, therefore wearing it like a crown. then \"calculate what we will or will not tolerate\" means that he is now mocking them for finding out exactly what piss people off & doing it purposely just to be negative. \"desperate to control all and everything\" is self-explanitory. \"unable to forgive your scarlet letterman\"...actually i'm not quite sure what this means but i'm guessing it means he is mocking them for not forgiving anybody, and just simply holding a grudge. then here's where the part about the stone comes in: \"clutch it like a cornerstone, otherwise it all comes down\"...he is now saying that negative people will hold their negativity and grudges because they don't want people to see them as positive. \"justify denials and grip them to the lonesome end\" means that they are now making up reasons to be negative and will stick with the reasons until the end, in which they will be all alone. now the part that confused me at first, the whole thing about \"saturn ascends\"...well, i thought it referred to the planet saturn, but i thought about it for awhile & it makes perfect sense if it is referring the roman god saturn, who was so worried that he would be overthrown (that he ate his own children), until one day he was killed by jupiter. i guess this is a metaphor for people with negativity not wanting to be positive, but one day they will be killed or something, i don't know i still really haven't figured it out....anyway, \"unable to forgive and we're sinking deeper\"...this one's a give-away of what it means. they're sinking deeper in negativity & they can't forgive anyone. then finally at the end of the song, maynard quits mocking negative people and now tells them this: \"give away the stone\" (referring back to the whole cornerstone thing, meaning if you give it away you will just give up on negativity)...\"let the oceans take and transmute this cold and weighted anchor\" (i'm guessing the weighted anchor and cold was the grudge holding you down (?)....\"give away the stone. let the waters take and transmute these leaden grudge into gold.\" (if you \"give away the stone\", you could actually turn your negativity into something good)...and then the final words (after the awesome 30-second long scream) are just simply \"let go\", which you should definately know what that means by now. so there, your overly long explanation.\t\t\t\t\n\t\t\t\t\n\n", "comment_44": "\nHrrrrrrrrrrrrr..... AAAGGGGGHHHH\n\n\r\nI love that. :D\t\t\t\t\n\t\t\t\t\n\n", "comment_45": "\ndoes anyone have any ideas what the 'saturn ascends, choose one or ten' and then later, 'saturn ascends, the one the ten' thing is referring to? any ideas most welcome\t\t\t\t\n\t\t\t\t\n\n", "comment_46": "\nThere is an obvious theme, the planet Saturn is quoted throughout the song. Whether this has some metophorical interpretation is questionable. If Maynard did have a metophirical meaning for planet, it would be undoubtably be repeated in other songs, for he has a habitual habit of this. To me this song is about galileo, and his discovery of the formation of the planets in the solar system, namely, the sun is the centre, not us. The way Galileo disproved the church's model of the universe was to trace the path of the moons around the larger planets, namely Jupitar and Saturn. The church had said that the planets sat on crystal stands, but how could these stands exist when these moons were flying directlty through them. Only a hundred years before Copernicus was burnt at the stake for defying the church's model of the universe, so obviously the church had somewhat of a grudge against these freelance scientists who were on a mission to disprove the church. And the church were 'terrified of being wrong,' the people couldn't 'let go' of their faith, or the church would lose power over them, the church wanted to 'control all and everything,' for in those days, the church acted as goverment. So 'Saturn came around to show them everything,' to show the followers the faults in christianity. The lyric 'clutch it like a cornerstone' would be directed at the church, its like saying, \"hold on to your faith while you've still got it.\" The cornerstone originating from the saying, \"a cornerstone of faith.\" And I don't think I really need to backup Maynards feelings on religion, just listen to Euology!\t\t\t\t\n\t\t\t\t\n\n", "comment_47": "\nhaha i found out this one when i was stoned.....but u guys already mentioned just about everything, but it thought it was tight when he was like \"Give away the stone, let the waters kiss and transmutate these leaden grudges into gold\" and i found out that that means to be baptized, perhaps when the world was flooded??? \"give away the stone\" (take away the actual land of the earth) \"let the waters kiss\" (let them cover all of the land) \"and transmutate, these laden grudges into gold\" be baptized...get rid of the grudge. just my .02\t\t\t\t\n\t\t\t\t\n\n", "comment_48": "\nSaturn ascends, choose on or ten has a basis in Enochian and hermetic majik (if you'll notice my post under \"faaip de oiad\" there is a lot of occult reference on this album)\t\t\t\t\n\t\t\t\t\n\n", "comment_49": "\ni found out something that could relate to the \"saturn ascends,choose one or ten\" part of the song. if you look on the back cover of the salival set (the plastic part with the ten circles connected by lines) that is the \"tree of life\" which is the basis of all existance, according to Qabalists.\n\r\nThe first sphere is known as Kether and is the crown (top) of the tree. The Crown was attributed to Kether to illustrate the fact that it is beyond consciousness: The Crown is worn ABOVE the head.  It is pure being; timeless; being totally devoid of form.\n\r\nTen is known as Malkuth and is sorta the opposite from Kether. Kether is one step away from existance, while Malkuth IS existance. \n\r\nLike its been brought up a few times, Saturn completes it's orbit around 27-33 years. According to the Maynard, you are faced with the choice whether you want to exist or enter a new consciousness that is just beyond existance (death maybe?).\t\t\t\t\n\t\t\t\t\n\n", "comment_50": "\nWell let's start out with saturn. Saturn in astrology represents order, rule, regulation, the system, the man. Order is a good thing when you have nothing but chaos, but too much order tends to stagnate and degenerate. I think this song is partially about our society, how everyone has a grudge. and how we all hold on to our beliefs because we need order in our lives and are afraid of change. When saturn comes back around, the choice is made between growing and learning, or dying inside, being dragged down like a stone. Perhaps our society is at that point, or has passed it and has chosen to be dragged down.\t\t\t\t\n\t\t\t\t\n\n", "comment_51": "\nI ahve a problem with someone who can relentlessly whinge his way through an album and then try and sing about letting go of a grudge...hooker with a penis anyone?\t\t\t\t\n\t\t\t\t\n\n", "comment_52": "\nsometimes its hard to pretend you dont wear that crown of negativity, that you keep that grudge that eats you up inside........music makes you forget sometimes all that, for a while at least...........just keep listening..........\t\t\t\t\n\t\t\t\t\n\n", "comment_53": "\nit's like you got a girlfriend and she is cheatin you with another fella. and you're like: fuck off. i hate my feelings. she is so fucked up. and i just can't \"let go\" you have to scream it to yourself.\t\t\t\t\n\t\t\t\t\n\n", "comment_54": "\nI love these comments; serious Tool fans are such intelligent people..the insights are really helpful, especially when there is so much to read into in every Tool tune.  To add some chump change to the mix, I really like the reference in the song to \"your scarlet letterman\", which I think of as a reference to THE SCARLET LETTER, one of my favorite novels..\"your scarlet letter-man\" is the person you've chosen to hold a grudge to--you've branded them with a scarlet letter that they'll never be able to remove, at least in your eyes..long live Maynard.\t\t\t\t\n\t\t\t\t\n\n", "comment_55": "\nI love these comments; serious Tool fans are such intelligent people..the insights are really helpful, especially when there is so much to read into in every Tool tune.  To add some chump change to the mix, I really like the reference in the song to \"your scarlet letterman\", which I think of as a reference to THE SCARLET LETTER, one of my favorite novels..\"your scarlet letter-man\" is the person you've chosen to hold a grudge to--you've branded them with a scarlet letter that they'll never be able to remove, at least in your eyes..long live Maynard.\t\t\t\t\n\t\t\t\t\n\n", "comment_56": "\nI wanna thank all you people for such creative insights. Thankyou. I have read every one of these posts and i agree with all of them, but the one post that got me the most was Timms post about the churches. This makes more snese than most, as it sounds like it has roots in religion. Although with \"the one, the ten\" (when reffering to saturn) im not so sure...\t\t\t\t\n\t\t\t\t\n\n", "comment_57": "\nIf you put together Timms interpretation together with madson4562 interpretation, i think the 2 views connect. madson4562 explains what every sentence in the song means however timm says its not about greek gods, its about the church.\r\nI dont know what im trying to say, i think both of those are just examples of a grudge, not \"the\" grudge he may be talking about, just examples. \r\nI like timm's interpretation a bit more because it actually occurred, and im not into greek gods.\t\t\t\t\n\t\t\t\t\n\n", "comment_58": "\nThis song accurately and brilliantly describes several people that I despise. It makes me so happy when I listen to this song because it just reminds me of how fickle and worthless those people are.  Give away the stone. \n\n\n", "comment_59": "\nI think the correct lyric is unable to forgive 'these' scarlet letterman, but what do i know?\t\t\t\t\n\t\t\t\t\n\n", "comment_60": "\nI think this song is yet another Tool song criticizing Christian thoughts and morals. I feel the same way about this as Maynard does. This is such a beautiful song. It's a masterpiece.\n\r\nXXX\t\t\t\t\n\t\t\t\t\n\n", "comment_61": "\nFrom Tool's site, its actually:\n\r\nWear YOUR grudge like a crown\n\r\n...for the first line\t\t\t\t\n\t\t\t\t\n\n", "comment_62": "\nI can relate to this song on a very deep level. My mother abandoned me at age 7 and it left me very angry and a I had a huge GRUDGE against her. But as i got older i realized that i can't let her control my life (and lift me up like a child). You have to let go.        I'm not possitive because it is TOOL but thats what it means to me.          LET GO\n\n\r\nGive away the stone, let the oceans take and transmutate this cold and fated anchor \r\nGive away the stone, let the waters kiss and transmutate these leaden grudges into gold \n\r\n(I also think that this part of the song relates to ritual magic, who knows.)\t\t\t\t\n\t\t\t\t\n\n", "comment_63": "\nBon Jennett, awesome for you to relate such a personal experience.  Isn't it so great when Tool lyrics seem so much a personal thing (like your relation to the lift me up like a child line).\n\r\nTo me it was how I would always hold a deep rooted anger to anyone who ever crossed me.  When someone would pick on me or make a joke to insult me I always took it so personally to where it would fester inside.  It is so hard for me to talk about this because I don't keep grudges anymore!\n\r\nBut I feel that Tool in so many of their songs, tries to relay the fact that life is like a river.  You must go with the flow, for if you try to swim downstream faster, you risk losing yourself in the tide.  To swim against, you will only exhuast yourself.  So go with the flow.  Let the water just take you like life.  To hold a grudge is to hold a weight that anchors you to the bottom.  WHile you think it is there against others, the grudge actually only affects you.\t\t\t\t\n\t\t\t\t\n\n", "comment_64": "\nif this has already been said, forget it. but i'm not really in the mood to look to see if it has.\n\r\nNote:  Don't let yourself become overwhelmed with a grudge against those that have one [a grudge]. Stay open.  Don't let some cloud block the view of your third eye. So, even though those that have a grudge and are more than likely blind by their hatred, don't let yourself become blinded by a hatred for those type of people.  It's like saying 'You can't fight fire with fire.' Well, in the same sense, those words apply.  But, to become one of.. well.. neither, to not hold a grudge against those type of people, is..exactly what you're thinking. Difficult. But, like it is said in this song, not exactly, but, \"Be humble\". Be nice, to everyone. Even if it is hard, do it just the same, and if the person has a problem with your niceness, then it's their problem not your's, and therefore, they're the ones with the life sentence of a grudge [prison] until they're proven guilty and wrong.\r\ni know it sounds like i'm preaching..but, it's something else you have to look at. don't grudge and judge people with a grudge and judge people.\t\t\t\t\n\t\t\t\t\n\n", "comment_65": "\nI had to do some research on this song but it was well worth it... I could get most of it but what got at me was \"Saturn ascends\" I started looking through my Wicca books and found that Saturn means discipline...Then I searched online and found the same thing. Everything started to make more sense to me..\n\r\nMaynard was talking about people holding onto what was bad and not wanting to let it go. That they hold onto that hate for dear life or they might see what's really there. That people like holding on to what they know is wrong and will find a way to make it seem right besause if they don't they have to say that they were wrong.\r\nDiscipline comes (maybe the rules of society?) and someone will have to choose whether or not to follow their rules or adopt new ones, and if they accept new ones then their life will change dramatically.\r\n\"Saturn ascends, the one, the ten. Ignorant to the damage done.\" might mean that The rules are coming but whatever the person chooses they won't think of anyone but themselves.\r\n\"Saturn comes back around to show you everything\r\nLet's you choose what you will not see and then\r\nDrags you down like a stone or lifts you up again\r\nSpits you out like a child, light and innocent. Saturn comes back around. Lifts you up like a child or\r\nDrags you down like a stone to Consume you till you choose to let this go. Choose to let this go. \" might be saying that you have two chances to decide and shows what could happen with both decisions and that it will eat at you until you do choose something.\n\r\nAnyway that's just what I thought of it.\t\t\t\t\n\t\t\t\t\n\n", "comment_66": "\nThe song, like much of the CD Lateralus, is based on the Tree of Life - the sephirot.  Don't believe me?  Check out this website zaalberg.freeserve.co.uk/…\n\n\n", "comment_67": "\nI think the reference to Saturn has to do with the planet Saturn and its 27 year or whatever it is rotation.  I think he's saying to take the new rotation of the planet as an opportunity to look back at your past mistakes and meaningless grudges and decide whether you want to learn from your mistakes and let Saturn \"lift you up\" or keep making the same mistakes and let it \"drag you down like a stone\".....Just a thought!\t\t\t\t\n\t\t\t\t\n\n", "comment_68": "\nWhile I don't necessarily disagree with all the \"Saturn as a planet\" or \"Saturn as a god\" explanations, there is another interesting possibility that I personally think is the answer.   In palmistry there are several references to Saturn, including a finger of Saturn, the mount of Saturn, etc. Those people who have a highly developed \"mount of Saturn\" are highly successful and driven, but they neglect their friends and families. They are also naturally irritating and suspicious.   Now, whether you believe in all that or not, think about this: When \"Saturn rises\" you're raising your hand into a fist. \"Choose one or ten\" means that a person holding a Grudge typically has only two responses: Choosing one = giving someone the finger. Choosing ten = raising both fists to fight.   Anyway, that's the way I see it...\t\t\t\t\n\t\t\t\t\n\n", "comment_69": "\nSaturn isnt necessarily interpreted as the literal planet outside ourselves, it is meant to be an inner force that drives us from the inside... its the force that restricts us and holds us back that we must overcome constantly in order to grow.\t\t\t\t\n\t\t\t\t\n\n", "comment_70": "\nI have a comprehensive look on the entire Lateralus CD and its references to that of Qabala, and I think that the Grudge is definitly one of the big factors in its connectivity.  Written here is a very basic description of the song and what each line means to me, based on my knowledge of Qabala and its interworkings.  If anyone is interested in learning more about the other Tool songs or how the Qabala plays it role throughout each, just ask and I will start writing more in depth on it.  Overall I think the basic theme of this song is that through change comes hardships which must be overcome to acheive something greater.  This song refers to something more than a materialistic life, and to that of the soul behind what we do.  It also mainly refers to Saturn's influence on our lives like schism86 said.  The Grudge's placement on Qabala and the Tree of Sephirot would be in its 10th spot, in Malchut (\"World\").  Anyway heres my very basic meanings(mind the poor condition of spacing due to the fact that its all typed up and copied over from my WordPad documentation):\n\r\n\"Wear the grudge like a crown of negativity.\"\r\n\tUse your soul as that of a marking of the power in denial.\r\n\"Calculate what we will or will not tolerate.\"\r\n\tFind out what you keep and what you change.\r\n\"Desperate to control all and everything.\"\r\n\tStrive to control every factor that influences change.\r\n\"Unable to forgive your scarlet lettermen.\"\r\n\tCannot forgive what has been done through whats right or wrong.\n\r\n\"Clutch it like a cornerstone.  Otherwise it all comes down.\"\r\n\tHold onto your world or everything will change for the worse.\r\n\"Justify denials and grip 'em to the lonesome end.\"\r\n\tMake your denials right to yourself and hold onto them to the grave.\r\n\"Clutch it like a cornerstone.  Otherwise it all comes down.\"\r\n\tHold onto your world or everything will change for the worse.\r\n\"Terrified of being wrong.  Ultimatum prison cell.\"\r\n\tYour scared of making the wrong decision, placing you in a deadlock of decision.\n\n\r\n\"Saturn ascends, choose one or ten.  Hang on or be humbled again.\"\r\n\tWhen our change is imminent, we choose or riteousness and keep to ourselves or change again.\n\r\n\"Clutch it like a cornerstone.  Otherwise it all comes down.\"\r\n\tHold onto your world or everything will change for the worse.\r\n\"Justify denials and grip 'em to the lonesome end.\"\r\n\tMake your denials right to yourself and hold onto them to the grave.\r\n\"Saturn ascends, comes round again.\"\r\n\tThe influence at birth comes back to make changes in your life.\r\n\"Saturn ascends, the one, the ten.  Ignorant to the damage done.\"\r\n\tThe influence of concentration, attention, focus, and other qualities ignores the negatives of its \tchange done to you.\n\r\n\"Wear the grudge like a crown of negativity.\"\r\n\tUse your soul as that of a marking of the power in denial.\r\n\"Calculate what we will or will not tolerate.\"\r\n\tFind out what you keep and what you change.\r\n\"Desperate to control all and everything.\"\r\n\tStrive to control every factor that influences change.\r\n\"Unable to forgive your scarlet lettermen.\"\r\n\tCannot forgive what has been done through whats right or wrong.\n\r\n\"Wear the grudge like a crown.  Desperate to control.\"\r\n\tUse your soul for power and become desperate to control saturn's change.\r\n\"Unable to forgive.  And we're sinking deeper.\"\r\n\tAll actions and thoughts cannot be forgiven and makes us change even more.\n\r\n\"Defining, confining, controlling, and we're sinking deeper.\"\r\n\tYou set up, contain, and control everything that makes you end up changing.\n\r\n\"Saturn comes back around to show you everything.\"\r\n\tWhen change comes, a reflection of what has happened is seen.\r\n\"Let's you choose what you will not see and then.\"\r\n\tYou pick what you wish to see and what you wish to forget.\r\n\"Drags you down like a stone or lifts you up again.\"\r\n\tChange comes either for the better or for the worse.\r\n\"Spits you out like a child, light and innocent.\"\r\n\tWhen it is over, you come out once again completely innocent to the world.\n\r\n\"Saturn comes back around.  Lifts you up like a child.\"\r\n\tThe change will come and make you innocent again.\r\n\"Or drags you down like a stone.\"\r\n\tOr it will tear you down to your own negativity.\r\n\"To consume you till you choose to let this go.\"\r\n\tIt eats at you till you decide to let nature take its course.\n\r\n\"Give away the stone.\"\r\n\tLet go of the power you have of controlling.\r\n\"Let the oceans take and transmutate this cold and fated anchor.\"\r\n\tThe change will turn the lowest and worst into the best.\r\n\"Give away the stone.\"\r\n\tLet go of the power you have of controlling.\r\n\"Let the waters kiss and transmutate these leaden grudges into gold.\"\r\n\tThe change will take your cold negative soul and turn it into that of purity.\r\n\"Let go.\"\t\t\t\t\n\t\t\t\t\n\n", "comment_71": "\nMissed a spot of copying at the bottom there, so heres the last line again:\n\r\n\"Let go.\"\r\nLet go of your control so you can allow it all to happen.\t\t\t\t\n\t\t\t\t\n\n", "comment_72": "\nGuys, everyone's interpretation of Saturn is pussy-footing around Maynard's clever metaphor...\r\nThink of who Saturn was -- you've all looked into this and discovered who Saturn was (obviously from the previos posts). You all know his mythological position. You've even touched on a little of the planetary revolution being 27 years and all...that's nice. That's probably the closest thing you've all said to the meaning of the metaphor...though inadvertantly. Think... \"Saturn\" the ROMAN version of the father of the gods, borrowed from GREEK mythology. What was the Greek versions name you ask? Why it was \"CHRONOS,\" the ruler, creator, and god of all there was and what would be--the Greeks cyclic/seasonal concept of time, or passing of events. And what is Chronos the root of etimologically. Why the word Chronology, meaning of or relating to time. So, Maynard is pointing to the word \"TIME\"...in a clever indirect sense, as well as the story of Saturn. Through this all embodying metaphor - he attacks the concept of a grudge from all sides.\n\r\nHe says:\n\r\nSaturn ascends \r\n\"Time is imminent, all emcompassing, and the ultimate end to everything\"\r\nChoose one or ten \r\n\"Choose the beginning or the end...the alpha or the omega....one extreme or another\"\r\nHang on or be \r\nHumbled again \r\n\"But you better hang on to your side of the issue with all your might, because eventually passing of time will make it readily apparent your wrong and your better off letting go. No matter how hard you try your going to be thrown from this bucking bronco\"\n\r\nHe continues:\n\r\nSaturn ascends \r\nComes round again \r\n\"Time is omniscient and reveals something to you...has shown you something important\"\n\r\nSaturn ascends \r\nThe one, the ten \r\n\"Time is the beginning, the end, and everything inbetween\"\r\nIgnorant to \r\nThe damage done \r\n\"Time doesn't care how much this grudge you've been holding has been hurting you...It makes it readily apparent that it will continue to hurt lest you let it go\"\n\r\nHe continues and makes very visible his intentions with the metaphor here:\n\r\nSaturn comes back around to show you everything \r\n\"Time has revealed to you where you were right and where you were wrong with your grudge and has shown you that its not worth holding onto in the end\"\r\nLet's you choose what you will, will not see and then \r\n\"You can accept what you will and what you will not from what it has revealed to you\"\r\nDrags you down like a stone or lifts you up again \r\n\"In accordance with what you accept and what you don't, if you continue to hold onto it...the grudge becomes literally a burden on your shoulders, weighting you down in the water, smothering/drowning you with hate, or if you let it go...you become light as a bird/feather/newborn--no burdens on your shoulders frees you up...gives you peace of mind\"\r\nSpits you out like a child, light and innocent \r\n\"Less the grudge...you are innocent, hate free, loving, gentle...what I just mentioned above\"\n\r\nSaturn comes back around \r\nLifts you up like a child \r\nOr drags you down like a stone to \r\n\"refer to above....just restated in slightly different (more concise, direct) words\"\n\r\nConsume you till you \r\nChoose to \r\nLet this go \r\nChoose to \r\nLet this go \r\n\"Maynard really conveys his message of the entire song here....the grudge will eat you alive...consume you if you will...unless you let go of it...be free of it...take this burden off your shoulders\"\n\r\nThere you have it---that I believe is very, very, very close...if not exactly what maynard had originally intended by this message.\t\t\t\t\n\t\t\t\t\n\n", "comment_73": "\nI would agree with you on the Chronos connection to the song, but I stronly believe that the Roman connection doesn't play a valid role in the particular song.  The similiarties are there highly, but if you compare the entire Lateralus CD to that of the Qabala, every song has a connection to every part entangled.  I think your theory of the song is good, but in the scheme of the entire CD, what I posted is a bigger influence... Besides, how can the CD start with the almighty power like that and then break down to songs with a lesser meaning?  Obviously the tracks build up if you listen to them in order, with Faaip obviously being the 'almighty voice' as itself.  Not saying your wrong, just everyones entitled to their own opinion.\t\t\t\t\n\t\t\t\t\n\n", "comment_74": "\ni feel this song is about one going through a \"Saturn return\" which is a period of great turmoil in one's life which coincides with Saturns completion of its orbit. Saturn returns occur approxiamately every 27 years or so in ones life. it is a time of great confusion where you must choose the path you need to take.it is about letting go of the past or grudges so you can embrace your future.\t\t\t\t\n\t\t\t\t\n\n", "comment_75": "\ni think this song refers to someone close to maynard or one of the other band members dieing and someone was with them when the person close to the band member died and they are holding as grude agenst them because they told them this and therefor the are the \"scarlet letterman\" 'scarlet' meaning blood and 'letterman' meaning the messanger  well theres my input so yea\t\t\t\t\n\t\t\t\t\n\n", "comment_76": "\nWell, this song could possibly be about Bill Hicks' grudge towards CBS. His performance on The Late Show was censored and he was not allowed back on the show. after this, Bill Hicks wrote and 39 page letter to John Lahr from The New Yorker in protest. His act was the first ever to be cencored at the Ed Sullivan's Theater. The reason for the cencorship was his all-out attack on prolifers. He said something like:\n\r\n\"If you're so pro-life, do me a favour: don't lock arms and block medical clinics. If you're so pro-life, lock arms and block cemeteries.\"\n\r\nDavid Letterman later apologized for this incident, although it was, sadly, after Bill Hicks had perished. \r\nThe reason I believe that this song, to a certain degree is about this incident, is because of the line\r\n\"Unable to forgive your scarlet lettermen.\"\n\r\n Of course, it's a long shot, but it seems sensible, since Bill Hicks was very aggressive in his material, and he held a grudge against CBS for quite some time. Also, Tool have previously honored Bill Hicks. It is also widely believed that the song \"Eulogy\" is about Bill Hicks, and that \"Aenima\" was inspired by Bill Hicks' material. Their lyrics include much of what Bill Hicks \"preached\" in essence, and also Bill Hicks has an album called \"Arizona Bay.\" (The lyrics in the song mention Arizona Bay.)\t\t\t\t\n\t\t\t\t\n\n", "comment_77": "\nI have always thought that this song had a meaning somewhat alongs the lines of what rog27 explained... but I always wondered about the part about the Scarlet Letterman, since I remember that in, I think it was The Crucible, The Scarlet Letter was an embroidered letter that the female had to were identifying her as an adulter. But thanks in part to Nasus, I put it all together... it's nice when things finally come together you. lol :)\t\t\t\t\n\t\t\t\t\n\n", "comment_78": "\nCorrect me if im wrong or if someone else has already mentioned this.\r\nI believe that in The Mangus, Book 1: it talks about Saturn ascending.  Although of these things very large volumes have been written by the antient wise men, so that there is no need to declare them here, notwithstanding I will recite a few of them; for they made, from the operations of Saturn, Saturn ascending in a stone, which is called the load-stone, the image of a man, having the countenance of a hart, and camel's feet, and sitting upon a chair or else a dragon, holding in his right hand a scythe, in his left a dart, which image they hoped would be profitable for prolongation of life; for Albumasar, in his book Sadar, proves that Saturn conduces to the prolongation of life; where, also, he says that certain regions of India being subject to Saturn, there men are of a very long life, and die not unless by extreme old age. It also vaguely states the positions Saturns is in when u can see this \"old man\".  The Load-Stone, (the grudge) is what i think maynard is talking about in The Grudge. \"Give away the stone\".\n\r\nBut i could be totally wrong about this, if any of you feel like reading deeper go to; sacred-texts.com/grim/magus/…\n\n\n", "comment_79": "\n\"Maybe I'll also mention the part where the ocean transmutates Ouranos' castrated grudge of a penis into Aphrodite (Roman Venus). \"\n\r\nNever knew that one!! Nice one Aphrodite.  That's hot.\n\r\nI notice a lot of people view most tool songs to be against the church.  But from my personal standpoint, I just don't see it like that.  Perhaps it's because I'm not an atheist.  Perhaps if I gave a rats ass about the church I might see it.  But I think these songs are slightly more spiritual than that.\n\r\nActually I tend to relate everything ever just back to the self, and often overlook certain historical and mythical references.  But it's all metaphore anyway, so it's no matter whether I catch the things so long as it makes sense in the end.\n\r\nI find this song, like most songs by this band, quite positive (maybe disguised as negative, however...)  Or rather, it's a reminder, at least has a positive message, or a message to be positive...  but I guess that's just obvious.\n\r\nIf I wanted I could interpret this song as being about a grudge against god.\n\r\n*shrug* I just love all the thought behind it...and there is so much.\t\t\t\t\n\t\t\t\t\n\n", "comment_80": "\nTo all you guys who read up on everything maynard uses for his songs and find it so interesting and agree with it. Your a bunch of tools. Why do you need to find the true meaning of the song? Its about your interpretation. Fuck your deep analysis, your waisting your life over some songs meaning based in ancient mythology. WTF is that dude??? Dont try and think like Maynard, he wouldn't want that (I would hope anyway) he would rather you come up with your own ideas so the song become personal to you. Instead you are studying up on it finding the truth, thus making this song some straight forward, factual peice of shit. Let it keeps some mystery, some spirituality. You are just like the people tool talks about, hypocrits...\t\t\t\t\n\t\t\t\t\n\n", "comment_81": "\nmaynard probably did ALOT of drugs in his early years. i weed and cigs werent in there. 24 fucking seconds, how the fuck do u do it maynard? i cut out at 10...but im an asthmatic pothead.\t\t\t\t\n\t\t\t\t\n\n", "comment_82": "\nSaturn represents the downfall. Of what u ask?\r\nWell, I've heard religion, so that is what I am going to use.\n\r\n\"The one, the ten\" is a scale to show that religion is losing the battle.\n\r\nScarlet letterman is a poem or something, search it up, but it has something to do with betrayal and forgiveness.\t\t\t\t\n\t\t\t\t\n\n", "comment_83": "\nIt is about letting go of something negative that has consumed you for a long time. The letting go is part of the resolving of life issues that is supposed to occur when Saturn returns to the space it occupied when you were born. (Astrologists believe this to be a time of cleansing your life of un-needed baggage and liken it being reborn).\n\r\n The song focuses on how it can be a struggle to resolve an issue that you are unable to change, because the only real way of resolving it is to let go of it. Letting go of an unresolved issue can sometimes feel like you have lost the struggle and are just giving up, thus loosing a personal battle. Hence, letting go of something negative, even though you know you need to, can be a hard thing to do.\n\r\n Try listening to the song with this in mind. Alot of the music and the general flow of the song seems to fit around this theory. ie the intensity of the music where certain key things are said etc.\n\r\n Let me know what you think.\t\t\t\t\n\t\t\t\t\n\n", "comment_84": "\nTo Prog_Rocker: I disagree with you. First off, why would they have posted suggested readings on their official site if they didn't want people to open up some of the books that these metaphors might have referenced from? Hmm... very curious. Just because most of the people here are reading and researching some of the metaphors used in Maynard's music doesn't not mean they are all tools. For them it may just be that what they read and interperet in the songs IS somehow making these songs personal to them.\t\t\t\t\n\t\t\t\t\n\n", "comment_85": "\nI've just been doing some thinking about the \"choose one or ten\". Think about Jimmy - When One and One are One Eleven. Eleven is 11, ie, one individual and another individual together. I think the choose 1 or 10 refers to 1, being alone, or 10, one with a zero, ie, somebody who hasn't yet recognised their own potential, someone who still relies upon others. Saturn ascends as mentioned refers to the 27-29 year cycle of saturn bringing rebirth and resurrection allowing you to \"choose what you do and do not see\" choosing how you remember your own past. Do you choose to make yourself a 0 or a 1? 1 and 0 are One, 10. Think about it *grin*\t\t\t\t\n\t\t\t\t\n\n", "comment_86": "\nAnother thought.... \"hang on or be humbled again\" seems to have been talked about with regards to hanging onto the grudge, in a fight AGAINST being humbled. But whoever said being humbled was a bad thing? Humility is a good thing, and being humbled can only help but make you humbler.\t\t\t\t\n\t\t\t\t\n\n", "comment_87": "\ni think this song is about attempting to be popular, and ultimately leading to total loss of control over life, and as time goes on when you realize it the fact will either free you or send you to a mental breakdown...thinking your life has been a waste.\n\r\n\"Wear the grudge like a crown of negativity\r\nCalculate what we will or will not tolerate\r\nDesperate to control all and everything\r\nUnable to forgive your scarlet lettermen\"\r\n-it talks about surveying every part of life, what the in crowd will or wont tolerate. you are unable to forgive your own drive to be popular, signified as the scarlet letterman. i think its referring to the letterman jacket worn by varsity sports players, and the scarlet part refers to how it brands you to the in crowd and it encages you in hate. the entire grudge is based on the feeling of having to be popular.\r\n\"Clutch it like a cornerstone\r\nOtherwise it all comes down\r\nJustify denials and\r\nGrip 'em to the lonesome end\r\nClutch it like a cornerstone\r\nOtherwise it all comes down\r\nTerrified of being wrong\r\nUltimatum prison cell\"\r\n-you hold onto being popular, you base your entire life around because if it goes away your life is meaningless, which ultimately encages you in the fear of destroying your popularity since if you do something considered not popular you will be cast out, hence the prison cell...limiting what you and cant do.\r\n\"Saturn ascends\r\nChoose one or ten\r\nHang on or be\r\nHumbled again\"\r\n-as time goes on you constantly have to choose between one, what you yourself want to do, or 10, what the in-crowd wants. you have to hold onto your grudge, continue to be popular and hate the cage it casts you in otherwise you will be \"humbled again\", or once again cast out of the in-crowd.\r\n\"Saturn ascends\r\nThe one, the ten\r\nIgnorant to\r\nThe damage done\"\r\n-time keeps going on, the choices keep passing you over time and you are oblivious to the mental damage you are causing yourself\r\n\"Wear the grudge like a crown\r\nDesperate to control\r\nUnable to forgive\r\nAnd sinking deeper\"\r\n-the process keeps going and you continue to sink deeper and deeper into the prison cell which limits what you can do in life.\r\n\"Definin'\r\nConfinin'\r\nSinking deeper\"\r\n-yourself and others are defining what is 'cool', you confine to your beliefs of what is cool and yet again you continue to encase yourself in the beliefs you hate.\r\n\"Saturn comes back around to show you everything\r\nLet's you choose what you will, will not see and then\r\nDrags you down like a stone or lifts you up again\r\nSpits you out like a child, light and innocent\"\r\n-The time comes where you realize what you are doing and it either releases you from that prison cell (the 'child, light and innocent part' comes from it, you being reborn without the impurities of the in-crowd)you created for yourself or emotionally destroys you.\r\n\"Saturn comes back around\r\nLifts you up like a child\r\nOr drags you down like a stone to\r\nConsume you till you\"\r\n-if you keep conforming it will keep coming back to haunt you untill it completely consumes you and you cant take it any more and you are forced to let the grudge go.\r\n\"Choose to\r\nLet this go\r\nChoose to\r\nLet this go \"\r\n-the choice that must be taken for emotional stability\r\n\"Give away the stone, let the oceans take and transmutate this cold and fated anchor\r\nGive away the stone, let the waters kiss and transmutate these leaden grudges into gold \"\r\n-give away the stone, stop worrying about popularity and let the oceans of freedom (not being confined to what is deemed cool by society) the fated anchor is the  fad that will unevitably dissipate. the leaden grudges will bring you down, but if you let it go it turns to gold, giving you the freedom you have sought out.\t\t\t\t\n\t\t\t\t\n\n", "comment_88": "\ntoolpantheon.com/…\n\r\nToo much coincidence to be false...\t\t\t\t\n\t\t\t\t\n\n", "comment_89": "\nThat and that website the more I read on it the more I think that guy has it nailed...The reason being Ticks and Leeches does fit...just not with the album it's a call against those that have started in the Qabala (Madonna to name one) as a fad, Maynard is MUCH too intelligent to NOT have a single song fit into the rest of the album.\n\r\nI am a Christian so I do not agree in putting my faith in things that Maynard does, it just doesn't mean I can't respect his intellect and enjoy the depth of his songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_90": "\nI loved this song, but the way i interprete it will likely be differnt than alot of ppl's. (or it could be ethe same i didint read alot of the meanings posted) THe grudge like a crown represents a hatred toward reilgon(catholiscm) and the scarlet letterman being jesus. thats really alll i could get. the other stuff is way beyond me!\t\t\t\t\n\t\t\t\t\n\n", "comment_91": "\nFirst of all - Saturn comes back around - the period of saturn's revolution is close to 30 years, after that time, you go through everything you have experienced before, positive and negative, and chose whether to live on or go to a different conscience.\n\r\nClutch it like a cornerstone \r\nOtherwise it all comes down \r\nJustify denials and \r\nGrip 'em to the lonesome end \r\nClutch it like a cornerstone \r\nOtherwise it all comes down \r\nTerrified of being wrong \r\nUltimatum prison cell \n\r\nThe period of Saturn's return is defining the next years of your life. You will be haunted by all your wrongs and glorifyed by all the things you've done well, justify denials into and terrified of being wrong. Otherwise it all comes down - it's not going to be the best part of your life ;)\n\r\nScarlet Letterman is a Hawthorne reference, read the book if you care, I'm not going on about it, I hated the boring damn thing.\n\r\nSaturn ascends \r\nChose one or ten\r\nChosing to go on or stay. One signifies the birth, ten the end of revolution, death.\n\r\nGive away the stone, let the oceans take and transmutate this cold and fated anchor \r\nGive away your grudge and let the fate take away the downfalls.\n\r\nI am in a very intoxicated state right now. \n\r\n~ Your friendly oxygen-wasting Manatee Hunter\t\t\t\t\n\t\t\t\t\n\n", "comment_92": "\nSaturn returns are apparently intensely stressful - though possibly transformitive. Good luck if you're weak come your second return. Grudges are pretty damn stressful.  But depending on how you handle it, I suppose it could change your life too - the way you act and think.  30 years would be an awful long time to hold a grudge.\n\r\nThere's this girl I know who holds a grudge against me.  She doesn't ever tell me this.  But I know it's there, and she tells other people.  Maybe her reason is good, maybe not.  But it's really only detrimental to her right?  Wrong. It kind effects me too.  Perhaps I am the one with the grudge.  Oh, I can't get it straight anymore.\t\t\t\t\n\t\t\t\t\n\n", "comment_93": "\ntoolshed.down.net (faq)- maynard mentions in it the theme of lateralus pertaining to the suggestion of the name~ the muscle itself or lateral thinking perphaps a combination of all interpretations here (which I see as feasible) would be a proper explantion and tribute to the song and cd as a whole~ thinking outside the box completely and letting all information fill you\t\t\t\t\n\t\t\t\t\n\n", "comment_94": "\nI think this song describes a grudge flawlessly. I LOVE IT! I LOVE TOOL! Desperate to control all and everything - they think they are right no matter what. It's just so .... perfect. Maynard is so smart and beautiful. Argh! It almost hurts! Tata. Love, Briar\t\t\t\t\n\t\t\t\t\n\n", "comment_95": "\nI think when Saturn is mentioned its refering to the position in the Tree of Life. Also, Malkuth is number 10 and Kether is number 1.  You cant reach 1 (Kether) until all grudges are forgotten from 10 (Malkuth).\t\t\t\t\n\t\t\t\t\n\n", "comment_96": "\nThis song is about 8:32. And each fucking second of it is awesome.\t\t\t\t\n\t\t\t\t\n\n", "comment_97": "\nMJK is describing his Grudge against Christianity and his childhood observations ? abuse under a hypocritical despot, pretending to be Christian, ...negativity, intolerant, desperate to control, etc etc  Read his lyrics elsewhere and his April fool's joke this year. So when you reject ultimate Truth, you fall for Jung, astrology, or some other religion/philosophy. Everyone has a religion-- we must, it's like breathing-- most make up their own fantasy intheir brain, all the while presupposing the truths of Chrisitianity. It is a man-exalting religion to set yourself up on stage and scream to everyone, 'find your own religion'. It surely isn't scientific. \"Question Authority\". SAYS WHO!!, who are YOU to tell me to Question Authority, what kind of authority do you think YOU are, MJK/Timothy Leary telling people that nonsense?  Hypocrites. Repent or perish, for goodness' sake. Use you God-given talents in music and imagery/poetry to His glory and not your own self exaltation. Then you can really, 'let go.' and find true forgiveness.\t\t\t\t\n\t\t\t\t\n\n", "comment_98": "\nReading the comments, they do accurately show give meaning to the song, and it has been a pleasure to read them. I thought of another side to the lyrics and thought of them as a political view to the world, with governments holding power and order over people.\n\r\n\"Wear the grudge like a crown of negativity\r\nCalculate what we will or will not tolerate\r\nDesperate to control all and everything\r\nUnable to forgive this scarlet letterman\"\n\r\nThe governments stay concerned with their own world and play with people's beliefs that they are listening to their pleas and worries etc. They give order and plan what the people will accept and reject, in a bid to amass more power, and in doing so, civilization declines due to the corruption of the government.\n\r\n\"Clutch it like a cornerstone, otherwise it all comes down\r\nJustify denials and grip 'em to the lonesome end\r\nCluth it like a cornerstone, otherwise it all comes down\r\nTerrified of being wrong, ultimatum prison cell\"\n\r\nThe governments hold on to their power carefully, fearful of it collapsing around them (anarchy?). They skate around questions and lie to the people, justifying their denials of certain things. They don't want to be proven wrong, or else they will lose the support of people.\n\r\n\"Saturn ascends, choose one or ten\r\nHang on or be humbled again\"\n\r\nOrder begins to take place. Because of the order within the government's world we are oblivious to the outer world. We either go with our own world (hang on) or face the truth (humbled again).\n\r\n\"Saturn ascends\r\nComes round again\r\nSaturn ascends, the one, the ten\r\nIgnorant to the damage done\"\n\r\nBecause of order within our world and what we see and want, we have become blinded by the quest for power and we don't see that what is a blessing for some is a curse for others.\n\r\n\"Defining, confining, sinking deeper\r\nControlling, defining and we're sinking deeper\"\n\r\nControl has been placed on the world, and with this, the people have become corrupted and made worse off.\n\r\n\"Saturn comes back around to show you everything\r\nLets you choose what you will, will not see and then\r\nDrags you down like a stone or lifts you up again\r\nSpits you out like a child, light and innocent\"\n\r\nWith the order that has been placed, the people are lured into bigger and better promises which hope to make it easier for the people, but instead it makes them suffer a lot more in the long run.\n\r\nThat's pretty much my interpretation, but like so many others, it is bound to be wrong.\t\t\t\t\n\t\t\t\t\n\n", "comment_99": "\nthis song kicks ass!!, i love it !\t\t\t\t\n\t\t\t\t\n\n", "comment_100": "\nhmmmm... a lot of content analysis, but little delivery analysis\n\r\nWhen did this album come out?  2000?  im not gonna look it up now you pricks - after listening over and over and over for 5 years (its back in my stereo again this week - sorry, can't find anything better yet - new Depeche Mode is good though) to this trophy, I have narrowed the genius of The Grudge down to one moment...\n\r\n...its not the 30-second scream, which i think is the greatest moment is song history\n\r\n... its not the huge bass thuds that fall in the background in the beginning, which are making me think its worth a new stereo just to enhance those\n\r\n...its the \"choooooooooose toooooooooooo let this gooooooooooo\"\n\r\nI love the stress on 'choose', how he sings it.  Think of all the ways that line could have been sung, but the way it was finally done is perfect.  It's the one thing that makes this song either a lesson or a great reminder:  you are in control, fuck face.  So either keep wasting your remaining 60 quick years developing angina about something so trivial or drop it and join Fight Club\t\t\t\t\n\t\t\t\t\n\n", "comment_101": "\n\"giving away the stone\" could mean as people we on our own have to look for our own \"translations\". the grudge is between the opposing religions that stick to nothing but their work. whether it be the bible , or the rosetta stone. saturn has come back around and you still have not given up on this religion.\t\t\t\t\n\t\t\t\t\n\n", "comment_102": "\nwhen he says \"saturn ascend the 1 the ten\" im confused to what this means\t\t\t\t\n\t\t\t\t\n\n", "comment_103": "\nwhen he keeps saying let go at the end its just puts all of the rest of the songs meaning about holding the grudge to closure and clarity\t\t\t\t\n\t\t\t\t\n\n", "comment_104": "\ncan anyone tell me what the whole saturn thing is about?\t\t\t\t\n\t\t\t\t\n\n", "comment_105": "\nread the first page\t\t\t\t\n\t\t\t\t\n\n", "comment_106": "\n'Saturn comes back around. Lifts you up like a child or drags you down. To consume you until you CHOOSE to let this go' hardly seems at odds with the reading I gave. This song is a jab at a crack you may slip into while climbing. It is to say we climb, we all do and it is what there is to do. Come now, if you have a pick axe show it to me, explain it to me, allow me to try it on for size, as of now I too am open for business. It'll be a slow, arduous climb. \t\t\t\t\n\t\t\t\t\n\n", "comment_107": "\nThis song is very purifying. This, along with every song on Lateralus (aside Ticks and Leeches) has held this enormous movement towards 'crucifying my own ego.' Very theraputic tool for me, along with a wonderfully built album.\t\t\t\t\n\t\t\t\t\n\n", "comment_108": "\nDefinitely Saturn Returns.  I turned 28 last November and since then there has been one big shite storm after another.  But on the other hand, my life has always been very difficult and full of trauma, illness, accidents yaddah yaddah the list goes on.  Let's just say that since Christmas (one month into my Saturn return) I have discovered an underlying mental problem, skeletal problem, and made peace with past grudges with family.  Lets just say that I still have about 18 months left of my saturn thingie, and I'm going to pay attention to every damn message and symbol he throws at me, because the thought of living another 30 years with this constant struggle is worth than a death sentence.\n\r\nBy the way, my main point was that without studying The Grudge when I first got Lateralus, I would never have been aware of the Saturn Return, and thus would have dealt with all these \"tests\" right now in a very \"ostrich with its head in the ground\" type way.\n\r\nThey are a tool - use them!\t\t\t\t\n\t\t\t\t\n\n", "comment_109": "\nThe most general and cohesive reading I can give to The Grudge is the grudge one could unwittingly have toward the existence of others, even more pronounced when the other emerges an inhabits your OWN being 'unable to forgive your scarlet letterman'. This may be someone who gives you a heads up. It progressively rears its head on you, the grudge, and then you realize you are begrudging others for inhabiting their OWN being. The realization that one can slink into this is cause for self-reproach, moreover. That others possess content identical to your own makes you not only question the grounds for your own self-identity but strikes at something even more fundamental: do I really OWN anything I think? Is it a product of my own adeptness or more likely do things just occur to me in too similar a character as it does for all if not many other beings. He can realize he is being seen as someone with a grudge. Trying to cling to some last shred of something substantial or all his own, he 'wears his crown of negativity'. Get an image of Jughead's paper tapped crown... 'yes, and?' So he sets out provisionally, awkwardly and with abandon to reconstruct his character (which can never be anything more than a self-percept) about this grudge. It doesn't seem to be a move made to advance ground with any scarlet lettermen, it is a move made in last dash for an inward sense of peace. Hang on or be humbled again, likely what should be inferred from the scarlet letterman's prompt. I have read briefly that Saturn is usually evoked as a symbol for the epithets 'the opportune moment for harvesting from life' and 'the death of old ways'. Also, more abstract and generally designated meanings of authority, steadiness, construction, integrity. So, yes the grudge could be spawned from someone keeping you in check. What spins the grudge tighter is your lacking the grounds to utterly hate them based on a smooth, kindred, genuine delivery they made for you, with whatever that sentiment is. Some specific species of love. The grudge and concomitant self-loathing is escaped from temporarily by denying of others their real inhabited being, 'justify denials', which is to go back to a state before the letterman spoke, where the now grudge-holding was conceiving himself or simply reclining into the self-percept of being the master of the show. While this might have something to offer in other spheres, when it enters into issues concerning realizing or evoking, if you are an idealist, the presence of others it can cause some problems. While it may be true of you it is just as well true of the other, in like character. The letterman called your behavior, preconscious or calculated, into the open maybe. Cause for soreness or indignation, seems to be the case in The Grudge. This is not someone with any immediate desire to seek a sort of penance. A sort of penance is the way out. Perhaps the grudge has an inherent recursive structure, meaning it rebounds or linearly, thought about the character of the grudge causes its character to get more pronounced. One has met a blockade which may be rerouted or assuaged with some ol' integral penance: acknowledgement of self-deceiving behavior and appropriate recompense in a spirit of seriousness. The fact that the grudge holder can understand himself to be occupying this pending position incites them to resign themselves to smoldering in fecklessness. \t\t\t\t\n\t\t\t\t\n\n", "comment_110": "\ni dont think this song even has a really straight foreward meaning, but nonetheless its a god song, one of the best of lateralus\t\t\t\t\n\t\t\t\t\n\n", "comment_111": "\nand cutyou i love the comparison between the song and fight club\t\t\t\t\n\t\t\t\t\n\n", "comment_112": "\nI'm not sure if anyone else mentioned this, and I'd hate to repeat, but about the \"scarlet lettermen.\"  Hawthorne wrote the novel \"The Scarlet Letter.\"  It's about being punished for a sin that the character committed. (Scarlet letter \"A\" for adultery).  Throughout the story, the charated (Hester) is shunned from the rest of the Puritanical village, possibly saying that holding a grudge will shun you from people you are destined to meet and whatnot.\r\nI adore this song though.  Lateralus has to be my favorite album of all.\t\t\t\t\n\t\t\t\t\n\n", "comment_113": "\nThat's a pretty cool analogy delvewithin, makes sense.  I don't think I'd ever read the lyrics to this song before now (despite having owned Lateralus for three years) - it really does seem to be about letting go of something.\r\nThat also goes with what you said about dropping a grudge because of the fact that 'wearing it like a crown' will result in inaccessible knowledge, unfound experiences, and a general shunning of enrichment.\t\t\t\t\n\t\t\t\t\n\n", "comment_114": "\nAlright, this song really is obvius, however I have noticed something about Tool music, its usually pretty general, yet the mystery is what personal event are they refering to? I know this sounds far fetched yet hear me out, the line scarlet lettermen shows some what of a coincedense to a certain event of a Tool icon...Bill Hicks, perhaps you are familiar with the David \"letterman\" incedent. Bill Hicks went on what was suppposed to be his final TV apearence,  for he knew he was battling cancer and didnt have much time left on earth, his supposed to be last TV appearence was actually cut and never ended up airing. Bill Hicks died February 26, 1994...this song my be Tool subliminal way of telling the will hold only one grudge against lettermen...but do the research youreself, and dont be so quick to discard my theory...\n\r\nPS. It is just a theory.\t\t\t\t\n\t\t\t\t\n\n", "comment_115": "\nyoutube.com/…\n\r\nmore proof to my theory\t\t\t\t\n\t\t\t\t\n\n", "comment_116": "\nMaybe someone already thought or wrote about it. I think this song is the connection between Aenima and Lateralus. Aenima is a record with a lot of anger and critique towards certain people. Lateralus on the other hand is a very spiritual album with much depth. The Grudge could easily be the last song of Aenima, it would symbolise all the anger they have through the album and then let it all go in the last song. Then the album Lateralus would make the opening with Eon Blue Apocalypse. Instead, all their anger and grudges are released on Lateralus. Let go the rage in order to calm down again. I think both options would work. \r\nAll in all, I love this song, love the lyrics, the rhythm and it reminds me of certain people I know, including myself sometimes. Holding grudges is something familiar to me. So this is one of my favourite songs of Tool.\t\t\t\t\n\t\t\t\t\n\n", "comment_117": "\nREAD AND LISTEN TO THIS!!!\n\r\n7812569103411/67584131221911310/15\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_118": "\nTool: The Cyclic Playlist.\r\n6,7,5,8,4,13,12,2,1,9,11,3,10 / 15 / 7,8,1,2,5,6,9,10,3,4\t\t\t\t\n\t\t\t\t\n\n", "comment_119": "\nTool Synclist (complete)\r\n7,8,1,2,5,6,9,10,3,4 - 6,7,5,8,4,9,13,1,12,2,11,3,10 â\u0080\u0093 15,14 (or 14,15)\r\n+\r\n33(23)\t\t\t\t\n\t\t\t\t\n\n", "comment_120": "\nIn the first few seconds of The Grudge, the is a mechanical sound followed by a high pithched, barely noticable droning sound. This sound continues up to exactly 5 minutes (the second \"choose to let this go\") where it disappates.\r\nStudies have shown the irritative effect of constant background noise can have, which is probably why after 5 minutes (power of 5's) the droning noise is let go.\r\n  It's amazing! After all these years the mysteries are still unravelling!\n\r\nGO TOOL!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_121": "\nMost of the people before me have had accurate discription on most of the songs meanings in general, and no one knows exactly what the song means except maynard, but everyones forgetting a key line to this song.  \"Unable to forgive these scarlet lettermen\".  In the book the scarlet letter, the scarlet letter was a peice of cloth with the letter \"A\" for adultry.  It was sewn in to her clothes so everyone knew what she did.  In modern times a scarlet letter is known to be a mark of shame.  So what do I think this song is about?  Coming out.  Yep I said it.  Now before you blow away my theory at least hear me out.\n\r\n\"Wear the grudge like a crown of negativity\"  \r\nIf you've ever seen a gay person in denial (if theyre good at it you'll never know), they'll publicly denounce anything that may cause suspicion, even if it goes against what they feel inside.\n\r\n\"Calculate what we will, or will not tolorate\"\r\nSelf explainatory, stay inside the lines or risk being different.\n\r\n\"Desperate to control all and everything\"\r\nAlso self explainatory.  Trying to make sure all your actions are predetermined, and you have full control of all your actions.\n\r\n\"Unable to forgive your/these scarlet lettermen\"\r\nThe scarlet lettermen are the ones pinning the letter on you, but you arnt able to come to terms with it.  \n\r\n\"Clutch it like a cornerstone \r\nOtherwise it all comes down\"\r\nClutch your beliefs and the person you've created as tightly as you can, otherwise your whole life will change, even if it may be for the better.\n\r\n\"Justify denials and \r\nGrip 'em to the lonesome end\"\r\nAnother key point in the song that seems to be overlooked.  It seems a bit too obvious that he used the word \"denial\" here, which is often used for people in the closet.  If you justify them, you will obviously cut off all potential relationship and be alone for the rest of your life.\"\n\r\n\"Clutch it like a cornerstone \r\nOtherwise it all comes down \r\nTerrified of being wrong \r\nUltimatum prison cell\"\r\nPeople in denial almost always see being gay as \"wrong\".  Ultimately you're trapping yourself in a death cell, not truely living and not physically diying either.\n\r\n\"Saturn ascends \r\nChoose one or ten \r\nHang on or be \r\nHumbled again\"\r\nAhhhh, saturn ascending.  I like the time passing by theory.  Almost like a mid-life crisis.  Chose 1 or 10, hold on to what you know works, or invite the unknown.\n\r\n\"Humbled again\"\n\r\n\"Clutch it like a cornerstone \r\nOtherwise it all comes down \r\nJustify denials and \r\nGrip 'em to the lonesome end\" \n\r\n\"Saturn ascends\" \n\r\n\"Comes round again\" \n\r\n\"Saturn ascends \r\nThe one, the ten\" \n\r\n\"Ignorant to \r\nThe damage done\" \r\nAnother big part of this song to me.  Its a proven fact that a person in a deep denial over a long period of time causes serious psychological damage.  You're forcing yourself to rewire when in reality, that isn't possible.\n\r\n\"Wear the grudge like a crown of negativity \r\nCalculate what you will or will not tolerate \r\nDesperate to control all and everything \r\nUnable to forgive your scarlet lettermen\" \n\r\n\"Wear the grudge like a crown \r\nDesperate to control \r\nUnable to forgive \r\nAnd sinking deeper\" \r\nStill cant come to terms with it.\n\r\n\"Definin' \r\nConfinin' \r\nSinking deeper \r\nControllin' \r\nDefinin' \r\nAnd we're sinking deeper\" \r\nVery straightforward, but very accurate.\n\r\n\"Saturn comes back around to show you everything \r\nLet's you choose what you will, will not see and then \r\nDrags you down like a stone or lifts you up again \r\nSpits you out like a child, light and innocent\"\r\nUsing saturn as a mid-life crisis, its a time of reflection.  Why am I holding on to this stone?\n\r\n\"Saturn comes back around \r\nLifts you up like a child \r\nOr drags you down like a stone to \r\nConsume you till you\" \r\nThe decision.\n\r\n\"Choose to \r\nLet this go \r\nChoose to \r\nLet this go\" \r\nMaynards plea.\n\r\n\"Give away the stone, let the oceans take and transmutate this cold and fated anchor \r\nGive away the stone, let the waters kiss and transmutate these leaden grudges into gold\" \r\nmaynard trying to help out.\n\r\nAhh! \r\nBest emotion filled scream ever.  \n\r\n\"Let go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go!\"\r\nmaynards final pleas.\n\r\nSounds a bit far fetched eh?  Check out this quote, straight from maynards mouth.\r\n\"Ignorant heterosexuals are right to fear the gay community. They are the future. Our future. The next step in our evolution.\" \nen.wikiquote.org/wiki/…\n\r\nI've been listening to tool now for over 5 years and it wasn't until recently that I started relating their songs to myself, I had too much of a guard up.  I listen to this song stoned (which makes you completely vulnerable) and it hit me like a brick.  Needless to say I cried like a little bitch because it struck a chord so deep on something I didn't even realize I was doing.  And I cry for nothing, I can't even think of the last time I cried, but this song did it.  \n\r\nDidn't mean to scare you with my take on the song, but tool fans are open minded people and should accept this theory along with all the rest, right?\t\t\t\t\n\t\t\t\t\n\n", "comment_122": "\nOh yeah and another thing, no one mentioned the sound of chains at 6:44 in the song, which to me is the reason for the scream that follows.\t\t\t\t\n\t\t\t\t\n\n", "comment_123": "\ni dont feel like reading everybodies comments concidering i gotta get up at 5:30, so i'll just make a quick comment.\n\r\nthe whole song is kinda obvious to whats its about. For those of you who do know, in Astrology Saturn is considered a symbol of depression and negativity. so when saturn acsends, we hang on to it until the bitter, lonely fuckin end. We never seem to take responsibility for our faults, and when it actually is someone elses fault, we can never let it go. we always gotta hold them to it and drag them through the dirt.\n\r\ngreat song.\t\t\t\t\n\t\t\t\t\n\n", "comment_124": "\nI think that it could be related to Maynard's mother. The age he was (11) when his mother was ill, until the release of Lateralus (+27 years=Saturn).\n\r\nSome people of her church blamed her when it happened, and it seems to be the source of his grudge against the \"scarlet lettermen\", from what he said in several interviews.\n\r\nHe may have decided to let it go...\t\t\t\t\n\t\t\t\t\n\n", "comment_125": "\nlike I've said on stinkfist, tool's songs aren't supposed to have one meaning, it's there for you to interpret it any way you want. different meanings, different people. so don't argue over it, it's right no matter what way you say it, that's how tool is, their songs don't always ahve one geeral meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_126": "\n....and I can't spell.\r\nhave*\r\ngeneral*\t\t\t\t\n\t\t\t\t\n\n", "comment_127": "\nEh i red some magazine and found something that can compare to this song :D\r\nGoes like this => \"Human disabled with grudge becomes a cripple in his head\"\t\t\t\t\n\t\t\t\t\n\n", "comment_128": "\n'Apollo now is thy god-\r\nthe race of gold has descended upon men.'\r\nA paraphrase of some of Virgil's most famous lines.  Add to that the alchemist's allusion to turning the base metal of the gross material body-lead-into the ether of transubstatiated gold-spirit.\t\t\t\t\n\t\t\t\t\n\n", "comment_129": "\n'Apollo now is thy god-\r\nthe race of gold has descended upon men.'\r\nA paraphrase of some of Virgil's most famous lines.  Add to that the alchemist's allusion to turning the base metal of the gross material body-lead-into the ether of transubstatiated gold-spirit.\t\t\t\t\n\t\t\t\t\n\n", "comment_130": "\nThe album begins with 'The Grudge' in the Tenth Path 'MALCHUT' and leads into Key 21 - The World - Universe - Tav - Cross, to stay grounded. (Hence \"clutch it like a cornerstone\")  Sepher Malchut is also called \"Kingdom,\" and is the realm of the earth, of the body, and immediate physical sensations. MALCHUT is before thought. It is in the \"Assiah\" world, the precinct of human embodiment. Qabalistic meditation and pathwork should always be firmly grounded in MALCHUT. Anyways, this is the beginning, where the soul is united with source. This is the beginning of separating desire, the urge to individuate. The realm of separating desire is among the middle sephirot, with desire for source bringing reunion in Keter. The number \"ONE\" refers to concentration, attention, and focusing the field of activity.\n\r\n    Saturn's placement at birth influences the person's work in life, their obstacles, the challenges that will test them and build character. Saturn shows how a person will mature, and how they will learn to cope with adversity. Saturn teaches transformation, and initiation. Saturn's rewards are the sweetest, for they are the hardest won. Afflictions to Saturn can create inhibition, timidity, cruelty, violence, melancholy, a knack for trouble, bad work situations, abuse of power, or resentment. Saturn, and the earth signs it rules, are the arbiters of the highest initiation. Christ, Buddha, and the Virgin Mary are Capricorn, Taurus, and Virgo, respectively, in our mythic systems. Initiation is earned, and only when the aspirant can use higher consciousness in the Real World is the initiation authentic. Saturn is associated with the \"Ring Pass Not\" - a term normally used when referring to the orb of energetic influence of a planet or body, and can also be applied to other forms of life. The ring-pass-not is the combination of the different energy sheaths that human or cosmic spirits gather around themselves.\n\r\n    \"A profoundly mystical and suggestive term signifying the circle or bounds or frontiers within which is contained the consciousness of those who are still under the sway of the delusion of separateness -- and this applies whether the ring be large or small. It does not signify any one especial occasion or condition, but is a general term applicable to any state in which an entity, having reached a certain stage of evolutionary growth of the unfolding of consciousness, finds itself unable to pass into a still higher state because of some delusion under which the consciousness is laboring, be that delusion mental or spiritual.\"\n\r\n    Saturn is the boundary between the inner or \"personal\" planets, and the outer, \"impersonal\" planets. The inner planets are about refining our responses; the outer planets are things beyond our conscious control. Perhaps the most carefully watched planet (other than the moon) is Saturn, which has a 28 year orbit through the 12 signs of the Zodiac. The dreaded \"Saturn Return\" is just one of many Saturn tests we are put through. When Saturn, in its year to year progress, aspects its position in a person's birthchart, it performs its function: it tests, analyzes, it challenges. For about two years, 28 year olds face themselves and hard reality, usually as never before. Spending a little over two years in each sign, Saturn tweaks itself against its own position in the natal chart every seven years. (Two squares, an opposition, and a conjunction - the \"return.\") Thus, the 7 year old's first loss of dreamy childhood innocence, the 14 year old's hormonal hurricane, the 28 year old's full fledged adulthood, and so on. The milestones of 55 and 56 usually mark turning points in people's lives. In its 28 year journey, Saturn also aspects the other points in a natal chart, and it is useful to keep an eye on Saturn vis-a-vis your other natal planets. Most people can map changes and stages in their lives just by looking at Saturn's position for a particular time. A long period of testing in your life can often be traced to a Saturn square with your natal Sun, Moon, ascendant, or other planets. Saturn's connection to 'The World,' Key 21, and earthiness, is symbolic of its hard reality. The square and the cross are associated with matter; while we live on this earth, we are like spirits nailed to a cross, clutching our cornerstone. Spirit, coping with material existence, is forced into transformation, and growth. People with strong Saturns are slow to change, so Saturn aspects often mean the difference between testing and Heavy Testing. Alchemy, on the surface, was the medieval attempt to turn lead into gold. It is really a metaphor for a much greater work, that of transforming the 'leaden' soul into the 'soul of gold.'\t\t\t\t\n\t\t\t\t\n\n", "comment_131": "\ni agree with some of the other posts. its about holding on to something that you base your life off of (in this case of course a grudge) but then struggle t o hang onto  to it.\t\t\t\t\n\t\t\t\t\n\n", "comment_132": "\nAGAIN as MAYNARD himself said-he reads some of these interpretations & theyre SO far off,BUT thats ok,As it means something different for everyone depending on the experiences in your life,where you're at in youre life,etc..though this song DOES have spefic references to apiritual alchemy or 'self gnosis'-'let the waters kiss,& transmutate the leaden grudges into gold'.Alchemy was the process of turning lead into gold,but more importantly a 'hidden meaning' for occultist(meaning anyone who perceived 'realities' the 'realm'-king-church or consensus didnt recognize)of turning base man into pure spirit,as tyou would base metals into gold.I knew someone woul;d mention the Kaballah &though SOME of LATERAUS has obvious references to it,theres a site that tries to link every song,every lyric into kabbalistic interpretations...\ntoolpantheon.com/…\r\n Pretty interesting,again as we all have our own take on TOOL's meanings.They intentionally couch their songs in ambigious metaphors to FORCE you to think,before someone does it FOR you!\r\n AM\t\t\t\t\n\t\t\t\t\n\n", "comment_133": "\nThis song was released just a little while before a sun saturn opposition..... the feast of saturn takes place on december 17th, and in the year 2002, there was a sun saturn opposition that took place. it turned out that the sun and saturn completely opposed each other in the night sky.\r\n 2002 Dec 17 17:27  8.0519     +22ｰ 03'\r\n:)\n\r\nso i'm thinking it's just a little saturn worship.... nothing super-awesome or anything.....\n\r\nmaybe taht's what the song really means. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_134": "\nMaybe I just have a different far-fetched take on this, but I feel this song might be about the Jewish oppression and what they have had to battle throughout the ages.\n\r\n\"Wear the grudge like a crown of negativity\" \r\nThey definitely have a reason to hold a grudge for the wrongdoing against their race thoughout the ages...and Jesus, a jew, wore a \"negative\" crown of thorns at his death.\n\r\n\"Calculate what we will or will not tolerate \r\nDesperate to control all and everything\"\r\nThey are tired of tolerating the prejudices, etc. that have been done to them. As a result, they have fought back with having a hand in most of the major banks, law firms, entertainment industry, etc. today.\n\r\n\"Unable to forgive your scarlet lettermen\"\r\nHitler's grandmother is rumored to have been a jew, which Hitler thought was untolerable, as much as adultery was to him. Hence Scarlet Letterman (IE \"The Scarlett Letter\" by Nathaniel Hawthorne) \n\r\n\"Clutch it like a cornerstone \r\nOtherwise it all comes down\"\r\nIn early 2000-2003 (can't remember what year now) there was talk and actions of one of the major Jewish synagogues being reconstructed in Israel. The cornerstone for the foundation had already been laid, and it was a big celebration. Obviously there's the literal, without the cornerstone it is unstable.\n\r\n\"Justify denials and \r\nGrip 'em to the lonesome end\"\r\nAgain, could be reference to Hitler. He was in serious denial about his Grandmother supposedly being Jewish. He justified his genocide of the Jewish people, and eventually died alone in a bitter end, crazy with syphillus.\n\r\n\"Clutch it like a cornerstone \r\nOtherwise it all comes down \r\nTerrified of being wrong \r\nUltimatum prison cell\"\r\nUltimatum prison cell could refer to the internment camps, and the ovens and gas rooms people were put to death in. \n\r\n\"Saturn ascends \r\nChoose one or ten \r\nHang on or be \r\nHumbled again \n\r\nHumbled again\"\r\nI had a good explaination that related when this song was first released, but alas, I am retarded and can't remember it anymore. :oP Sorry. Saturn, which looks like a star, could also be in referrence to the heavens in which Adam and Eve were cast out (paradise as a reflection of heaven) of when they committed sin. God himself is also considered to be \"up there\" in the stars, so Saturn might even translate into God humbling Adam and Eve with their being sent from Eden.\n\r\n\"Wear the grudge like a crown \r\nDesperate to control \r\nUnable to forgive \r\nAnd sinking deeper \n\r\nDefinin' \r\nConfinin' \r\nSinking deeper \n\r\nControllin' \r\nDefinin' \r\nAnd we're sinking deeper \n\r\nSaturn comes back around to show you everything \r\nLet's you choose what you will, will not see and then \r\nDrags you down like a stone or lifts you up again \r\nSpits you out like a child, light and innocent\"\r\nThis could be in relation to the the control that was imposed on the Jews in the internment camps, or even as far back through the centuries to being kicked out of paradise. When that kind of control is forced upon you, you are basically as powerful as a child, having to go with what is being done to or you are being told to do.\n\r\n\"Give away the stone, let the oceans take and transmutate this cold and fated anchor \r\nGive away the stone, let the waters kiss and transmutate these leaden grudges into gold\" \r\nCould be referring also to the fate of Adam and Eve (Jews) who were cast from the Garden of Eden. Letting go of the age-old grudge of that could gain forgiveness and acceptance back into paradise, which could also translate into heaven upon death.\t\t\t\t\n\t\t\t\t\n\n", "comment_135": "\nThat's an interesting way to look at it. I don't think its what the song was necessarily written about, but the great thing about Tool's lyrics is that they're left so wide open for interpretation, so who's to say?\n\r\nI love this song just as much for what it is musically as it is lyrically. The guitar solo two-thirds of the way through sounds so cool, almost like arabic music or something. I love how loosely it flows. Every second of the buildup up to the breakdown is awesome, and the scream afterward is absolutely fucking sick.\t\t\t\t\n\t\t\t\t\n\n", "comment_136": "\nHYPOCRITE!  ADAM JONES IS A FUCKING HYPOCRITE!  Let's see.  I clearly remember him saying in a concert \"Get that Bob Marley wannabe motherfucker out of here!\".  Yeah this Adam doesn't hold any grudges.  it seems he hates people like me!  Well I am angry at him I don't holda grudge at him.  So if you excuse me I am going to listen to a Bob Marley album and NO!  I'm not some loser drug addict.  Even more surprising is I'm 16.  I've never seen Bob Marley in ocnert or anything.\t\t\t\t\n\t\t\t\t\n\n", "comment_137": "\nThis song reminds me of The Scarlet Letter.\r\nI'm currently reading it in English and I showed my teacher the lyrics and she said it clearly is regarding the book. Am I right.. or am I right?!\r\nhah\n\r\nROCK ON TOOLHEADS!@!\t\t\t\t\n\t\t\t\t\n\n", "comment_138": "\nYeah I freaked out.  I do like the music but that \"Bob Marley\" thing pissed me off.  The Grudge just happens to be one of my favorite Tool songs.  Is it Adam Jones that sings or Maynard?  Who's the composer?  I guess they all do their own thing on their songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_139": "\nactually the bob marley joke was directed towards (at the time) the lead singer of the band Green Jelly/Green Jello.  He was friends with Tool (Danny Carey was actually the drummer of Green Jello and Maynard did the \"not by the hair on my chinny chin chin\" part of Green Jelly/Green Jello's song \"3 Little Pigs\").  So, maynard wasn't making fun of/kicking some hippy-bob marley looking concert-goer out of the show.  He was just joking aroung with a friend.\n\r\nAnd so what if Maynard or anyone else wants to joke Bob Marley, hippies, or anyone else?  He (or anyone else) doesn't have to like the same things you do.\t\t\t\t\n\t\t\t\t\n\n", "comment_140": "\nye for me 2, he kinda pushed me to the other side to see most of the truth. Really big step of 'ageing'  . But anyway i see Maynard as nothing else as a ordinary person, who is just using his fucking brain, and we all have that...\t\t\t\t\n\t\t\t\t\n\n", "comment_141": "\nThere is a lot of good stuff on here. The beauty that I see in Tool and that I love so much is the deep meaning and applicability. I don't pretend to understand Maynard, but there is a feeling to me that purely allegorical explanations may be missing the point. Another very intelligent writer, J.R.R. Tolkien, says this:\n\r\n... I cordially dislike allegory in all its manifestations, and always have done so since I grew old and wary enough to detect its presences. I much prefer history, true or feigned. ... I think many confuse 'applicability' with 'allegory'; but the one resides to the freedom of the reader, and the other in the proposed domination of the author.\n\r\njust a thought...\t\t\t\t\n\t\t\t\t\n\n", "comment_142": "\n\"â\u0080¦Behold, I am laying in Zion a stone, a tested stone, a costly cornerstone for the foundation, firmly placed. He who believes in it will not be disturbed. And I will make justice the measuring line and righteousness the level; then hail shall sweep away the measure of lies and the waters shall overflow the secret place.\"\n\r\nâ\u0080\u0094 Isaiah 28:16-17\n\n\n\r\nThe Prophecy\n\r\n    When that which was separated again unites\r\n    When the libraries of the Horse unite in truth and might\r\n    This by a blue star heralded shall be\r\n    This awaited event shall turn a key\n\r\nOn the morning of January 20, 2008 I learned for the first time from the Mother of Creation that the libraries I had been translating from, known as the White Horse Libraries, were not whole. They had been separated into two portions, one being in higher realms. At about 2:47 pm PST Mother united them after eons of separation. This coincided with the advent of the blue star â\u0080\u0094 Comet Holmes â\u0080\u0094 whose current appearance was first noted in October 2007. When the libraries are united, it will set other events in motion â\u0080\u0094 like turning a key.\n\r\n    When the two shall be one another event shall come\r\n    A cornerstone shall be laid, for the reign of the Mother and Father will have begun\r\n    Let purity reign; let lies be done away\r\n    Let the destructuring of the old begin this day\n\r\nAfter the libraries had been united, the Father laid the first cornerstone of the Mother and Father's joint reign on Earth. The cornerstone consisted of an incorruptible box, its beautifully carved wood originally from the Caucasus Mountains. That which was placed within I am not allowed to disclose until the other cornerstones are laid some time in the future. This event precedes a destructuring of earthly systems that are not compatible with the purity and truth of the Mother's and Father's long prophesied joint reign on Earth, which was initially described in Opening the Doors of Heaven.\n\r\n    Swept clear by the Mother many souls have died\r\n    On Earth in empty bodies the soulless do hide\r\n    When social tyrants that have governed are all done away\r\n    Soulless bodies that linger shall no longer stay\n\r\nThere are many soulless bodies on Earth because they have not earned the right to live as the Earth ascended into higher realms beginning in February 2005. They have lingered because illusory institutions have remained. As these social structures are dismantled, there shall be many 'deaths' but technically they are already dead.\n\r\n    Three more comets shall come to herald the Holy Reign\r\n    A larger one that's pink, a smaller purple one, then a small red one yet again\r\n    As each one comes, another cornerstone is laid\r\n    More shall destructure, let Mother's children not be afraid\n\r\n\"Verech nahur usva bevechstik u-aresvi\r\nKelesh klahusbavik/nechve ustavi\"\n\r\nGreat is the glory of times to come\r\nFor the reign of great peace has begun\t\t\t\t\n\t\t\t\t\n\n", "comment_143": "\n\"â\u0080¦Behold, I am laying in Zion a stone, a tested stone, a costly cornerstone for the foundation, firmly placed. He who believes in it will not be disturbed. And I will make justice the measuring line and righteousness the level; then hail shall sweep away the measure of lies and the waters shall overflow the secret place.\"\n\r\nâ\u0080\u0094 Isaiah 28:16-17\n\n\n\r\nThe Prophecy\n\r\n    When that which was separated again unites when the libraries of the Horse unite in truth and might     This by a blue star heralded shall be this awaited event shall turn a key\n\r\nOn the morning of January 20, 2008 I learned for the first time from the Mother of Creation that the libraries I had been translating from, known as the White Horse Libraries, were not whole. They had been separated into two portions, one being in higher realms. At about 2:47 pm PST Mother united them after eons of separation. This coincided with the advent of the blue star â\u0080\u0094 Comet Holmes â\u0080\u0094 whose current appearance was first noted in October 2007. When the libraries are united, it will set other events in motion â\u0080\u0094 like turning a key.\n\r\n    When the two shall be one another event shall come\r\n    A cornerstone shall be laid, for the reign of the Mother and Father will have begun let purity reign; let lies be done away, let the destructuring of the old begin this day\n\r\nAfter the libraries had been united, the Father laid the first cornerstone of the Mother and Father's joint reign on Earth. The cornerstone consisted of an incorruptible box, its beautifully carved wood originally from the Caucasus Mountains. That which was placed within I am not allowed to disclose until the other cornerstones are laid some time in the future. This event precedes a destructuring of earthly systems that are not compatible with the purity and truth of the Mother's and Father's long prophesied joint reign on Earth, which was initially described in Opening the Doors of Heaven.\n\r\nSwept clear by the Mother many souls have died on Earth in empty bodies the soulless do hide when social tyrants that have governed are all done away, Soulless bodies that linger shall no longer stay\n\r\nThere are many soulless bodies on Earth because they have not earned the right to live as the Earth ascended into higher realms beginning in February 2005. They have lingered because illusory institutions have  remained. As these social structures are dismantled, there shall be many 'deaths' but technically they are already dead.\n\r\n    Three more comets shall come to herald the Holy Reign, a larger one that's pink, a smaller purple one, then a small red one yet again as each one comes, another cornerstone is laid. More shall destructure, let Mother's children not be afraid\n\nnewsinfo.iu.edu/news/page/normal/…\n\r\nGreat is the glory of times to come\r\nFor the reign of great peace has begun\t\t\t\t\n\t\t\t\t\n\n", "comment_144": "\nThere are plenty of references to different things and fields of knowledge, but the references to saturn have undeniable connections to western astrology. saturn is thought of as the planet of discipline, of life's hard earned lessons, limitations, and personal growth by recognizing those limitations and integrating life patterns that adhere to them. \"Saturn comes back around to show you everything, lets you choose what you will or will not see\" The 'one' is the ascendant, and the 'ten' is the midheaven, ruled by saturn or capricorn. Choose the one, and you follow the path of your ascendant and the projection of your immediate personality. Choose the midheaven and you choose caution, diligence, and success. Choose the one, and saturn drags you down like a stone to consume you until you choose to let go, to accept saturn's power and influence, choosing a path of discipline and conscienciousness.\t\t\t\t\n\t\t\t\t\n\n", "comment_145": "\nAlex can you give an example slash scenario of someone choosing 1, and someone choosing 10... ascendant...projection of immediate personality..?\r\nDust some cob webs off my withered eye\t\t\t\t\n\t\t\t\t\n\n", "comment_146": "\nbut kye usually depression arises from feeling worthless and putting the blame on oneself, not blaming others. Maynard sings about being in his \"self-indulgent pitifull hole\" in reflection... So tell us how to get out of that kind of pit\t\t\t\t\n\t\t\t\t\n\n", "comment_147": "\ncan't believe only 2 others see the religious implications. I am strongly athiest and see this as a message against religion in general. I think the saturn reference is just referring to the fact that the earth is not flat. Although I guess the moon or sun would have said the same. Later on the album \"the patient\" seems to still be referring to the hopelessness of religious beliefs.\t\t\t\t\n\t\t\t\t\n\n", "comment_148": "\n@ madson4562: I agree with pretty much your entire breakdown of the song, except I think the word 'grudge' in the song itself is a metaphor. I don't think he's only talking about a grudge, or being angry at someone. I think he's talking about the mentality that supports grudges. I think Maynard is referring to that entire way of looking at life and the situations we go through. Things rings true with his example of Saturn too. Saturn didn't really have a grudge against his children, he was just power hungry and afriad of loosing it. Its that sort of mentality that I think Maynard is slinging mud at.\n\r\nI absolutely \t\t\t\t\n\t\t\t\t\n\n", "comment_149": "\nhaving grudge and being angry on someone isn't the same ... sometimes i think this song is about ressentiment o.0\t\t\t\t\n\t\t\t\t\n\n", "comment_150": "\nI think it's pretty hard to deny that this song has some reference to a \"saturn return\" which many a folk on here have done a relatively good job of explaining.  \n\r\n\"Saturn comes back around\"  I think this is pretty clearly referencing the planet saturn returning the position it was in when an individual was born -- the saturn return that usually occurs around the age of 28, but often has far reaching effects before and after this age.  \n\r\nI have also thought that the \"choose 1 or ten\" but could be a reference to kabbalah and the tree of life.  kether is the first sphere on the tree and malkuth is the tenths sphere, but there is a saying often spoken of which states, \"kether is in malkuth and malkuth is in kether\" so it's kind of like, you can choose to see it however you like, the spiritual realization or the mundane manifestion -- both are there, you get to decide what you'd like to take from the experience. \n\r\ni didn't thin of the \"choose one or ten\" in reference to the natal chart or the ascendant vs mid heaven, so thank you to whoever mentioned that.  \n\r\nI'm about to begin my saturn return here in a little bit and this song has been a wonderful soundtrack.  46&2 also helps a lot.  :)\t\t\t\t\n\t\t\t\t\n\n", "comment_151": "\noh, also forgot to mention, and haven't seen it on here -- the crown of negativity?  the tree of life is often depicted with three \"veils of negative existence\" wrapping the whole tree up.  I always think of this when I hear him say \"crown of negativity\"  because it sort of crowns the tree (although kether is often considered the crown as well, but these would be negative crowns, i suppose)  \n\r\nThe \"transmute these leaden grudges into gold\" is surely an alchemical reference (and possibly others).  I think it's impossible to say that Tool, who is clearly well versed in occult symbology and hermetic theory, would have put these metaphors in their song without being aware of these interpretations.  \n\r\nI'm not saying that they ONLY mean alchemy, but I am saying they are well informed about the \"lead to gold\" imagery in alchemy and would be aware that this interpretation is consistent with their lyrics.  Likewise, I don't think Maynard is unaware of saturn returns, and likely meant that (and possibly more) by \"saturn comes back around\"\n\r\njust sayin'\t\t\t\t\n\t\t\t\t\n\n", "comment_152": "\nIts about someone who holds a grudge against someone, something, and this hate becomes the identity of the person.  \"Clutch it like a Cornerstone\" - it becomes the foundation of your very being.  And you don't realize that its destroying your very self.  The Saturn stuff is just something Maynard threw in to show how smart he is.  And it sounds cool.  But someone who holds a grudge to the point that it defines who they are - they need to let go.  Life's too short.\t\t\t\t\n\t\t\t\t\n\n", "comment_153": "\nThe transmigration of souls....  Lesser risk for lesser reward, not possible, bound by the wish of gods son for all to be saved into his kingdom.  eternities upon eternities of effort and here we are at that point again.\t\t\t\t\n\t\t\t\t\n\n", "comment_154": "\nKalikadevi seems to be on trak to me except maybe.\n\r\nleadÂ·en   Audio Help   /ˈlɛdn/ Pronunciation Key - Show Spelled Pronunciation[led-n] Pronunciation Key - Show IPA Pronunciation \r\nâ\u0080\u0093adjective 1. inertly heavy like lead; hard to lift or move: a leaden weight; leaden feet.  \r\n2. dull, spiritless, or gloomy, as in mood or thought: leaden prose; a leaden atmosphere.  \r\n3. of a dull gray color: leaden skies.  \r\n4. oppressive; heavy: a leaden silence.  \r\n5. sluggish; listless: They moved at a leaden pace.  \r\n6. of poor quality or little value.  \r\n7. made or consisting of lead.  \r\nâ\u0080\u0093verb (used with object) 8. to make leaden, sluggish, dull, etc.: Fatigue had leadened his brain and step.  \n\r\nPossibly this line with this word reffers to the transmutation of body and opertunity for redemption of those in the void.  Definitions 1 thru 6 would then apply directly and alchemy would be the metaphor.\n\r\nThe grudge has to do with being seperated from God cast into darkness and unable to travel etc...\r\nKind of a Holy my way or no highway thing....\r\nmaybe.\n\r\nMaynard must drink the jizz of the Gods... hehe\t\t\t\t\n\t\t\t\t\n\n", "comment_155": "\nI think this song is about the theory of Alchemy relating to a normal, everyday grudge. When he says \"Clutch it like a cornerstone\" hes saying he wont give away the stone = the philospher's stone, later on he says \"Give away the stone, transmute these leaden grudges into GOLD\". Hes reffering to the Alchemic theory of the philosopher's stone, where u can transmute (turn) lead into gold, using the Philosopher's stone, which has the power of immortality, quite legendary. Sadly, LIKE the philosopher's stone, the ability to forgive is very scarce these days. The power is in the grudging person's hands.\r\nLead = a Grudge\r\nGold = forgiveness\r\nCornerstone (Philosopher's stone) = The ability to forgive someone\n\r\nMaynard is saying the most rare thing in someone is the ability to forgive, like in the first verse\r\n\"Unable to forgive\". Thats how I see it, but i dont know what Saturn means though.\t\t\t\t\n\t\t\t\t\n\n", "comment_156": "\nen.wikipedia.org/wiki/…\n\r\n\"Saturn comes back around to show you everything\r\nLet's you choose what you will, will not see and then\r\nDrags you down like a stone or lifts you up again\r\nSpits you out like a child, light and innocent\n\r\nSaturn comes back around\r\nLifts you up like a child\r\nOr drags you down like a stone to\r\nConsume you till you\"\t\t\t\t\n\t\t\t\t\n\n", "comment_157": "\nMy hunch is that this song is a commentary on the almost-religious dogmatic beliefs that surround the country's attitude towards sports. Teams and their fans hold rabid grudges against one another, and they are obsessed with studying and memorizing the other teams' playbook and anticipating their next move, as if the outcome is within their control. It's about our obsession with championship over something as trivial as a sport that 99% of us are only spectators to anyway, yet people live and die by the teams they hold dear. Pretty ridiculous, if you ask me.\n\r\nFaith No More made a similar commentary in their song A Small Victory, but theirs was a little more straighforward. Tool has a tendency to make metaphysical analogies, and the whole Saturn thing is an analogy for What side of the orbit do you fall on? Are you one of us, or one of them? You must choose, and carry the torch of our grudge against the other guy.\t\t\t\t\n\t\t\t\t\n\n", "comment_158": "\n\r\n2012\n\r\nI think a major key point that is overlooked in this song is the relation to 2012. On December 21st is the proposed date and this is the first beginning date of Saturns Reign since its ruler of Capricorn. \n\r\nOn this date Capricorn will be 0 degrees in relation with the Sun & the center of the galaxy, the winter solstice.\n\r\nWhat people dont realize is that 2012 is a heavy & major occurence, whether you believe it or not I can confirm many visions, nudges from my own guides, and the same strange metaphysic phenomenon going on.\n\r\nYou can either relinquish your ego,  yourself, what you think is right & wrong and give into the emptiness that is total receptivity or I dont know what happens to you. The calander was based more off the structure of evolution, measuring time as a sort of energy stream which reaches certain milestones, not simply linear time. There is a certain key order to the rythm of time.\n\r\nThe grudge is holding on to this world rather than ascending, you hold onto your ego you will be humbled. \"Give away the stone (state of the world), Let the waters kiss & transmutate this cold & fated (fate of 2012) anchor\" let this world be run over by disaster, theres no saving it. Just let go of it, let go....\t\t\t\t\n\t\t\t\t\n\n", "comment_159": "\nThe grudge is about grudges and anger is general and how it is not healthy nor beneficial to withhold such emotions. People that become dependant on hatred and grudges then rely on on their grudges, that is what keeps them in one peice. You do want to be a weak person and hold grudges or any negative feelings, understanding and compassion is the way to go.\n\r\nWear the grudge like a crown of negativity - You hold anger as something negative in you or on you\r\nCalculate what we will or will not tolerate  - Take a step back from this frustration and clear your head and decide is this is worth getting angry over or worth holding a grudge\r\nDesperate to control all and everything - People like this need to be in control, how are they in control because they are the ones that need to be right, they can never say i was wrong you were right, they are desperate to take control over the situation\r\nUnable to forgive your scarlet lettermen - Just like the townspeople and Hester Pyrnne you will not be able to forgive as easily as you should\n\r\nClutch it like a cornerstone - These grudges are what holds you together, this not good\r\nOtherwise it all comes down - You are dependant on this hatred inside you\r\nJustify denials and \r\nGrip 'em to the lonesome end - Try to justify your denials of the truth, you can never admit the truth and you will grip these fallacies until your cold and lonely demise\r\nClutch it like a cornerstone \r\nOtherwise it all comes down \r\nTerrified of being wrong \r\nUltimatum prison cell - \n\r\nSaturn ascends -Staurn repeatedly comes to humble us humans mistake after mistake\r\nChoose one or ten - 1+10= 11??? mjor recurring theme throughout the songs even albums, look into it\r\nHang on or be \r\nHumbled again - hang on to your grudges or else you will be humbled yet again\n\r\nHumbled again \n\r\nClutch it like a cornerstone \r\nOtherwise it all comes down \r\nJustify denials and \r\nGrip 'em to the lonesome end \n\r\nSaturn ascends \n\r\nComes round again \n\r\nSaturn ascends \r\nThe one, the ten \r\nIgnorant to \r\nThe damage done \n\r\nWear the grudge like a crown of negativity \r\nCalculate what you will or will not tolerate \r\nDesperate to control all and everything \r\nUnable to forgive your scarlet lettermen \n\r\nWear the grudge like a crown \r\nDesperate to control \r\nUnable to forgive \r\nAnd sinking deeper - The more you deny your fault and justify your grudges, the deeper hole you are digging yourself\n\r\nDefinin' - defines who you are\r\nConfinin' - confines you to be a specific type of person\r\nSinking deeper - your getting yourself into a place that is not easy to get out of\n\r\nControllin' \r\nDefinin' \r\nAnd we're sinking deeper \n\r\nSaturn comes back around to show you everything - Saturn tries to bring wisdom to us\r\nLet's you choose what you will, will not see and then - multiple interpretations\r\nDrags you down like a stone or lifts you up again - Either hold onto your grudges or let go and get out of your bad situation\r\nSpits you out like a child, light and innocent - The process spits you back out again lgiht without the weight of grudges and innocent once again\n\r\nSaturn comes back around \r\nLifts you up like a child \r\nOr drags you down like a stone to \r\nConsume you till you \n\r\nChoose to \r\nLet this go \r\nChoose to \r\nLet this go \n\r\nGive away the stone, let the oceans take and transmutate this cold and fated anchor \r\nGive away the stone, let the waters kiss and transmutate these leaden grudges into gold - personally my favorite line out of any song, this can be read a few different ways but i see it as: Give away the stone (weight of your grudges) let your hatred go (water apparently is supposed to give off (-) ions that are supposedly beneficial, this might have some meaning). Once you take the weight of anger of you, you are freed and a much stronger person, your wasted mindpower could turn these negative grudges into some valuable and desirable.\n\n\r\nAhh! \n\r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go, let go \r\nLet go, let go, let go! \n\n\r\nAbsolutely amazing song, just like any other Tool songs.\n\r\nLike my analysis? well im trying to start up my own Tool forum because i feel the only two forums up and running aren't of great quality. check mine out :) toolbandforums.ipbfree.com/…\n\n\n", "comment_160": "\nawesome album opener. people will inevitably wrong eachother, we're all just human. it's your choice to remember this and hold it against them, or let it go. holding grudges might seem like the only way to stay sane and keep people from taking advantage of you, but in doing so you'll eventually be left lonely with only your grudges to keep you company. letting go is really the only way to stop worrying and just enjoy your life.\t\t\t\t\n\t\t\t\t\n\n", "comment_161": "\nThis song kicks it hardcore. i love maynards climax scream, which by the way is purely 100% authintic. no looping or effects. ive seen him do it live. to me this song is about a break up which guy the doesnt take so well. he never forgets it because of the pain and he gets angry at himself and the person that dropped him. he holds a grudge. i can relate. TMI? sorry\n\n\n", "comment_162": "\nSaturn is the planet of Karma-what goes around comes around. \t\t\t\t\n\t\t\t\t\n\n", "comment_163": "\nTo me, this song is probably the biggest \"Fuck You\" to the fans Tool had gained from AEnima... Also, the end of the song Reflection as well (The \"I don't want to be down here soothing my narcissism\" and the \"So negative blind and cynical\" lines)\n\r\nMaynard is almost in a sense admitting that he was being a negative-nancy with Tool's previous albums, and he looked down on all the 'average' people in the world around him because it made him feel superior (his narcissism) - if you take the narration in Reflection literally, then this is exactly what he is admitting.\n\r\n\"Reflection\" is almost the sequel to \"The Grudge\"\t\t\t\t\n\t\t\t\t\n\n", "comment_164": "\nI always just thought of this song as kind of telling people not to hold grudges, hating people for no reason, but after reading through other comments there is a much deeper meaning to this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_165": "\nIt seems like the meanings to this song is very layered and a lot of what's been said seems very valid. I do think I found something to add, though I didn't look through all the posts. I googled 'Saturn Ascendant' and came up with a page with this in it.\n\r\n\"Depending on its exactness (see \"strength\" and \"orb\" just above in this reading's header in your own personalized book You and the Universe) this could easily be the most significant aspect in your chart! You were born as Saturn rose in the east. The closer Saturn was (see orb) to being exactly on the eastern horizon - your Ascendant - when you were born, the more reluctant you as a soul were to come into your body. Your birth was probably difficult for your mother, and if Saturn is within a few degrees of your Ascendant (see orb), may have caused her great trauma, a Caesarian, or in extreme cases even death.\n\r\nBob Dylan's verse, \"I was so much older then, I'm younger than that now.\" is really true of your life. You were born old, and had many responsibilities while still a child, as well as a feeling of not having been loved at an early age. There's often a feeling of lost childhood with this placement of Saturn. As you mature into an adult you will have the desire and the opportunity to regain and relive some of your lost youth.\"\n\r\n'The Grudge' may be a reference to these unspoken resentments. As an interesting aside, there was more on the page about Saturn being with four degrees of your Ascent, which caught my attention, since there's another song on Lateralus called '4 Degrees'\t\t\t\t\n\t\t\t\t\n\n", "comment_166": "\nIn the last year or so, I came around with Tool. I used to hate them, but they are now one of my favorite bands. This song, while heavy and discordant at first, evokes a strong sense of esoteric mysticism. I am not an expert on the themes that the band Tool delves into, but I know that I like their sound, their lyrics, and their image. They are a truly awesome act.\n\r\nThe Grudge is one of their best songs.\t\t\t\t\n\t\t\t\t\n\n", "comment_167": "\nAnomalous3 has it right I think.  I would familiarize yourselves with the astrological concept of the saturn return.  The grudges we persist on holding on to have a tendancy to turn on us and bite us in the ass.  If we confront and deal with those issues we grow to our next level of spirituality.  The scales fall from our eyes, so to say.\t\t\t\t\n\t\t\t\t\n\n", "comment_168": "\nI think Flamingstealthbanana has it right on. It's about how many people justify their faults to gain a false sense of security about themselves due to a self-inflated ego. These people can't recognize fault in their own wrong doings and always find a way to target something else. You will only dig yourelf a deeper hole the farther you go into self-indulgence, bearing the heavy burden of the Grudge. They must hold on to the Grudge to reassure themselves of control. Once we let go of the stone, our minds will be lightened and we will feel innocent, like a child. Understanding and compassion is the only way to communicate properly.\r\nThere is a lot of good symbolism in this song.\r\nThe stone and anchor is the personal weight of the Grudges we bear.\r\nSaturn ascending and coming round is kind of like a karma effect. Our choices are reflected by planetary influences and Saturn is a negative one.\r\nThe crown makes us feel more superior, which is why we bear the Grudge in the first place. To not make ourselves inferior. And it is one of negative energy.\t\t\t\t\n\t\t\t\t\n\n", "comment_169": "\nFUCK I LOVE TOOL!!! \t\t\t\t\n\t\t\t\t\n\n", "comment_170": "\nI luv this song!! It's about Nathaniel Hawthorne's novel: The Scarlet Letter. It's about what the grudge and humilliation against the main character: Hester Prynne.\t\t\t\t\n\t\t\t\t\n\n", "comment_171": "\nOne of two government reports that were allegedly seen and leaked containing information and pictures of alien life forms is call THE GRUDGE... Hmmm...Goes with the theme of the albumn/CD...maybe not the meaning of the lyrics of the song, but the song names on the albumn/CD together always seem to have a seperate meaning...just food for thought.  \t\t\t\t\n\t\t\t\t\n\n", "comment_172": "\nBY THE WAY the sound that starts up at the beginning of this song is a soft hum for meditation. It continues for the rest of the album faintly on the background.\t\t\t\t\n\t\t\t\t\n\n", "comment_173": "\nreckless8610 nailed it.\n\r\nIt's about forming a sense of self out of your suffering. You cling to your pain because that forms a part of who you are. You lose your \"grudge\" and you lose the \"cornerstone\" of your identity. Clearly not a good thing to be trapped in.\n\r\nI'm interpreting this alot through what I've learned from Eckharte Tolle as well.\t\t\t\t\n\t\t\t\t\n\n", "comment_174": "\nI don't think Roxc has the right meaning at all. While I can't be as eloquent as those who have posted before me, I think its simply saying whatever your grudges may be you can still return to the innocence of a child if you let them go. That you need to consider, whatever your reasons are for the grudge MAY NOT TRULY EXIST.\n\r\nWhile much is written about Saturn in mythology & astrology, Saturn being the Roman god of justice: \"Saturn (justice) ascends Comes round again\" \"Ignorant to The damage done\" and in Roman times the feast of Saturnalia indicates the \"settling of accounts\".  That the damage of your grudge may already far outweigh the cause of the grudge itself and what must be done to settle the accounts? What must be done for you to move on from this?  \n\r\nI agree with reckless that grudges cause suffering to yourself as sometimes a grudge can consume you and change you for the worse.  Letting the past GO and moving on can only benefit you in countless ways you may not be able to determine now.\n\r\nAs this grudge is now part of your identity \" transmutate this cold and fated anchor\" changing will take courage. \"Terrified of being wrong\" Can't accept the fact that you may be wrong because it has shaped your actions. \t\t\t\t\n\t\t\t\t\n\n", "comment_175": "\nExcellent song and is fairly straight forward.\n\r\nMaynard uses Jung references in other songs (check out 46 & 2) so I suspect there is some aspect of that here as well.\n\r\nJung stated that Saturn has the motifs of judgment, guilt and shame, suppression and repression, splitting and separation, denial, the inferior, and that which is regretted and neglected. \n\n\n\n\n\n", "comment_176": "\nSaturn spit me out like a child, tossed me into oblivion attempting to tear my soul asunder. Not to care for a single disastrous consequence of which is his own undoing, I now shine brighter than ever before. Thank you Maynard \t\t\t\t\n\t\t\t\t\n\n", "comment_177": "\nAbout the whole \"Saturn\" thing I think everyone should look up Sade Sathi- \"The cycle of Saturn\"\t\t\t\t\n\t\t\t\t\n\n", "comment_178": "\nRoman and Greek Mythology are known to almost be identical. The Roman god Saturn was known as Cronus in Greek mythology. Cronus overthrew his father, Uranus. He then in fear that his children would do the same to him would wait for them to be born and eat them. Eventually Rhea (his wife) grew tired of this and instead of handing him the newly born child, she gave him a stone wrapped in blankets, and hid the baby. Cronus ate the stone and the baby, which was Zeus, grew strong enough that eventually he forced his father to disgorge all of his siblings which were, Demeter, Hera, Hades, Poseidon, and Hestia. Zeus then overpowered his father   to succeed him as the King of the Gods. \r\nUse that information however youd like\t\t\t\t\n\t\t\t\t\n\n", "comment_179": "\nalright this may seem crazy but i think Ive  just had an epiphany  what lateralus is about is a close relationship with a person with a personality disorder if you know what im talking about you understand.\t\t\t\t\n\t\t\t\t\n\n", "comment_180": "\nThis song is absolutely based on the astrological affect of Saturn, \"Saturn Ascends\" is continually repeated in different aspects. These are different ways Saturn plays a role in our lives. Saturn represents the limitations of our minds, our bodies and all things physical. It is the four walls around us, \"Ultimate Prison Cell\". Saturn also rules the astrological sign Capricorn and of course we have Adam Jones, a Capricorn as a the Guitarist; Remember the he also produces and directs all of Tools video and his influence on the band certainly equal to and if not more then Maynard's. He would have definitely known of the affects of Saturn, thus he is describing in this song what its capable of\n\n\n Defining, confining, controlling, and we're sinking deeper\n Saturn comes back around to show you everything\n Let's you choose what you will not see and then\n Drags you down like a stone or lifts you up again\n Spits you out like a child, light and innocent.\n\nSaturn is also the planet of Karma so it is largely based on our actions and how and will they effect us. Its choices, decisions, what you define as acceptable and what you believe is possible. When \"Saturn Ascends\" and \"comes back around again\" that is when we must face the decisions we've made in the past, they are either good or bad. Saturn is kind of like gravity it brings us down to earth, back to reality, this is necessary so we face the truth and become more realistic about ourselves. \n\nCapricorn is also the tenth sign of the zodiac, 10 is the number of completion, the end. it also has 1 in it which is the beginning  so ten is the union between beginning and end. Black and white, something and nothing, this is based and a system of duality that is present in Astrology. So when he says \" Chose one or choose ten\" he means you either choose to begin(White, Birth, Right,) or end(Black, death, Wrong)....its choices like I said, these guys are definitely spiritual I'm sure they are very familiar with all the Knowledge of the ancient mystics.\t\t\t\t\n\t\t\t\t\n\n", "comment_181": "\nShortly before this album was released my parents separated because my mother was cheating on my father. I was 14 or 15 at the time.\n\nThis song brought me to tears the first time I heard it. It also helped me realize that letting go of my grudge against my mother and her boyfriend was something I HAD to do.\n\nHolding onto a grudge is like carrying a heavy stone in your heart. Once you let go you feel free again. \n\nUnfortunately my father went the other route and still carries that heavy burden in his heart. He probably always will.\t\t\t\t\n\t\t\t\t\n\n", "comment_182": "\nThe act of holding a grudge against someone is indicative of a narcissist or psychopath who would force their will upon others as we have in our pathocracy. A ponerized society would serve the elite few at the expense of the rest. Now we are just an inconvenient nuisance (those who actually have a conscience,) and through the burgeoning police state they think they have total control, but they do not. Those people that seek to know the enemy so as to defend themselves can succeed at fighting the control system if they understand what alchemy really is. Real alchemy is Work on the self. Work, as in Gurdjieff. Hence, \"give away the stone, let the waters kiss and transmutate these leaden grudges into gold.\nIt will all come crashing down for the psychopaths in power. Their entropic power grab will collapse in upon itself, for that is how destructive it is. Saturn is representative of cosmic forces at work on our planet right now. All and everything is what Gurdjieff called his trilogy. And so the powers that be have a grudge to settle with us. Only if we transmute the soul through the Work can win the grudge match.\t\t\t\t\n\t\t\t\t\n\n", "comment_183": "\njust like Ive commented on \" 4 digriz \"song, this song means the same thing for me .. but on a different level , more spiritual level , as in \" let go , its not worth it \"\t\t\t\t\n\t\t\t\t\n\n", "comment_184": "\nVerything you say it's ok, but I quite remember listening on youtube a tool concert, and just before this song, Maynard starts talking about wacky things, and clearly says that \"the next song it's about anal sex\".\n\nNow choose one or ten fingers.\t\t\t\t\n\t\t\t\t\n\n", "comment_185": "\nclaytentylor.com/transits/…\nThis link I feel is very relevant to this song.\n\n\nI'll try to not repeat what many have already said on here about the lyrics. Looking at the lyrics and determining your own meaning is useful, but I would say that this song specifically has a lot of roots in the concepts of Saturn's effect on our lives. I don't want to say that the song is about Saturn specifically. To me,  the song is ultimately more about letting go of past grudges and traumas that are in need of healing. Saturn is referenced as a tool to help harness the change that is needed.  This is why I have provided the link above, to help others seeking additional knowledge relate Saturn back into their internal process and journey. \n\nMay everyone reading this find what they are seeking. Peace out friends\t\t\t\t\n\t\t\t\t\n\n", "comment_186": "\nLike i said before this site was re-vamped, whenever I listen to it, I think of it as the cylce of saturn and the theory that it has a gravitational pull on our lives at about 27. We have to virtually be born again, and refreshed, because Saturn is starting it's journey again. I think you can look pretty deep into this song if you want to, it's not only about a simple grudge, there's always something else there behind tool's songs. It could also relate to the myth of Saturn, read up on it, v. interesting\t\t\t\t\n\t\t\t\t\n\n", "comment_187": "\nHAPPY BIRTHDAY MAYNARD!!! hes turning 40 on the 17th of APRIL\t\t\t\t\n\t\t\t\t\n\n", "comment_188": "\nwhat does \" scarlet lettermen\" refer to ?\t\t\t\t\n\t\t\t\t\n\n", "comment_189": "\nJesus\t\t\t\t\n\t\t\t\t\n\n", "comment_190": "\ncrown of thorns = Jesus \r\ngrudge = crucifixion\n\r\n\"Saturn comes back around to show you everything \r\nLet's you choose what you will, will not see and then \r\nDrags you down like a stone or lifts you up again \r\nSpits you out like a child, light and innocent\" \r\nJUDGEMENT DAY\n\r\n\"Give away the stone, let the waters kiss and transmutate these leaden grudges into gold \"\r\nALCHEMY (ANCIENT FORMS) (remove restrictions)\t\t\t\t\n\t\t\t\t\n\n", "comment_191": "\nThis record is a ritual process in my interpretation.  It begins with a cleansing sacrifice to move on to the next step.  \n\r\nIn Alchemy, the practitioner's goal is always to transmutate something worthless like led into gold (albiet that is a pretty basic view)  And this song is asking you to find one of those pieces of led in your life in the form of a grudge.  It begs that you identify it (clutch it like a corner stone) then asks you to see it in the bigger picture.  What good is this grudge doing you in your life.  How many missed opportunities or lost friendships has it cost you.  \n\r\n\"Wear the grudge like a crown, negativity, calculate what we will, will not tolerate desperate to control, all and everything\"\n\r\nThis is the kind of broken thinking we can fall prey too when fixating on a grudge.  But for the ritual to move foreword, a sacrifice needs to be made.\n\r\n\"Give away the stone, let the waters kiss and transmutate these leded grudges into gold\"\n\r\nNow, I don't care if you follow the same spiritual path that I do, this is a wonderful exercise for anyone, Listen to this point with your eyes closed, focus on a grudge.  Something specific.  Maybe not even a grudge, but something you need to move on from.  Now, try to imagine an object two wrap that feeling, action, grudge, into an object or symbol of some sort.  Imagine a large etherial space where you can hold it up in the palm of your hand (around the 6:00min mark)  Keep your hand extended and imagine this grudge being sandblasted by the sound.  And as they chant \"Let Go\" imagine that led symbol becoming something golden and usable.  You first must really want make this work though.  And be willing to let go.\t\t\t\t\n\t\t\t\t\n\n", "comment_192": "\nAssuming you even look, you have Two ways you can see the Infinity.  A whole and complete One......like a perfect circle going round and round.  Or you can see it as forever endless and without direction......going forever in every direction.\n\nSo when Saturn comes back around you can grab on forever or infinite-ly regress for a while longer.\n\nOne is the Absolute, infinitie in its completeness...........10 is the decimal...infinite in its decimation.\n\nChoose.\t\t\t\t\n\t\t\t\t\n\n", "comment_193": "\nSo you're saying Maynard mocks the beliefs of Christianity but believes the orbit of Saturn around the sun somehow influences your life? umm.... credibility -1\t\t\t\t\n\t\t\t\t\n\n", "comment_194": "\nThe song is religious in it's meaning.\t\t\t\t\n\t\t\t\t\n\n", "comment_195": "\nThis song is about Me...I thought it was pretty obvious. Maynard wrote it for Me.\t\t\t\t\n\t\t\t\t\n\n"}