{"comment_0": "\nI agree that this song is about not losing his muse, but wanting her to come to him - almost praying to \"her\" for inspiration. But I also think that the chorus is about her arriving.  I don't think that \"there she goes\" means departure... I think that he means she is doing it again - helping to see his beautiful world.  He has been visited by the muse before and he would do anything to see her again.  The litany of ailments may be intended to point out that even great artists, writers and philosophers were human and also had to struggle to reach their acheivements.\n\r\nThis has to be one of the most hopeful things that Mr. Cave has put on record:\n\r\n\"So if you got a trumpet, get on your feet,\r\nbrother, and blow it\r\nIf you've got a field, that don't yield,\r\nwell get up [now] and hoe it\"\n\r\nSounds like a do-it-yourself / punk ethic to me.  In other words, his art may not be perfect (\"you weren't much of a muse\") but he never promised that it would be (\"I weren't much of a poet\"). He tries, he knows that he may fail, but it doesn't matter if the muse will just visit one more time.  Notice the last time around that he says \"here she comes\" before the chorus.\t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nBut, this song is anything but uninspired..\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nSuch an amazing song...\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nIt's about the muse, and losing it.\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI don't see loss. It's so upbeat.\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nIt\\'s all about having lost the muse.  His beautiful world (ie., inspiration) has gone.  He\\'s lying there with nothing in his ears (ie., no inspiration), asking for that stuff (ie., inspiration) to be sent down to him.  He\\'s got writer\\'s block, clearly, and is envious of all the brilliant artists who weren\\'t blocked.  He\\'s so passionately, dying for inspiration to come.  Great song.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI don't think it's so much about losing the muse, more to do with wanting someone to be his muse, but she isn't. The lines:\n\r\nI look at you and you look at me and\r\ndeep in our hearts know it\r\nThat you weren't much of a muse,\r\nbut then I weren't much of a poet\n\r\nindicate that to me. Also, he is willing to do anything to have that muse, as he says in the verses \" i will lie at your feet\" etc. It's a song about envy of the great artists, and also about desire to be one of those great people, but the realisation that he is not really good enough.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nDon't forget the mention of these particular great artists' physical obstacles.  That litany of ailments has to play in there somehow.\n\r\nI know I have felt un-inspired as an artist before.\r\nI have also scorned myself when I see people with huge obstacles accomplishing more.  Sitting there with opportunities and health, it can make one feel ashamed.\n\r\n(just the kind of unpleasant realities Cave dwells on that no one likes to talk about)\n\r\ngo Nick\n\r\n-phase\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI think he's speaking to God (I am not religous, but Cave is) and to us.  God is his maker, \"she\" is the world (Mother Nature?)  and his muse.  Listen/read with that thought - I think its pretty close.\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nThis is a love song to the world that created all of the beauty he spoke of.  He also speaks to a woman (separate from the world) whom he loves.  Nonetheless, their love doesn't compare to the wonder of the world in which they live. \n\r\n\"I look at you and you look at me and\r\ndeep in our hearts know it\r\nThat you weren't much of a muse,\r\nbut then I weren't much of a poet\"\n\r\nThere's this hopelessly romantic ideal that he would do anything for a world that could create such amazing beauty, but nothing he can do will ever come close. \n\n\n\n", "comment_10": "\nthis song makes me want to DANCE!\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nHmmm, John Wilmot is spelled with only one \"l\".\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nIt's about a writer's block and the frustration that causes for an artist. Cave gave a lot of interviews on this one. The first lines are about just writing something to keep going...\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\nThe song is about a guy who wants to write a song to impress a girl. \n\nFirst verse: he is inspired when meeting a beautiful woman\n\nVerse 2 & 3: All these guys wrote great stuff in all these f-ed up situations, so why can't he write something good.\n\nBy the end he is begging god, or his muse or whatever for a good song to impress this chick, who just keeps walking away.\n\nAmazing song. Cave is the man.\t\t\t\t\n\t\t\t\t\n\n"}