{"comment_0": "\nI love this song! This is my family. My parents got pregnant when my mum was 18. They got married and my dad started working. He did everything for me and my mum, makign sure we had the best life he could give us. Twenty five years later, they're still married, successful, and their blue-eyed bouncin curls daughter is off on her adventure! I want this to be my first dance with my dad when I get married. \t\t\t\t\n\t\t\t\t\n\n", "comment_1": "\nSinging about how your biggest mistakes can turn into your most important and cherished things in life.  And of course, how parents have to let go in the end... and let their children grow up.\t\t\t\t\n\t\t\t\t\n\n", "comment_2": "\nawwwwwww i love this song!!! its so sweet!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_3": "\nyes this song is amazing...about how there can be beautiful mistakes in life....sadly though this type of situation doesn't turn out as bittersweet in the 'real world'....but still makes a great song\t\t\t\t\n\t\t\t\t\n\n", "comment_4": "\nI think this is a really good song...just the words all together...the fact that he thinks his life is ruined because he has a daughter to young and then he finally notices that his daughter is his life\t\t\t\t\n\t\t\t\t\n\n", "comment_5": "\nAmyBth2005, I agree with you when you say that this song is amazing, but I don't necessarily agree with you when you say it doesn't turn out that way in the 'real world'. I don't know if you grew up in a small town, but I sure did, so I guess I've seen this basic story played out in real life...I mean sure there are some exceptions, but I'd be willing to say that most young parents who were scared at first, would not have wanted to change a thing when everything was said and done. \r\nThis is one of Kenny's best songs, and what looks to be one of his last true country songs. This song is filled with so much emotion, and touches the true soul of country music. Simple and realistic, yet beautifully poetic. Unfortunately, I don't really know what Kenny sings now...and any of you who think it's country, obviously haven't been country fans for long. But he isn't the only one who is 'selling out'. I hesitate using the word selling out, because he's really just become a different person because of the carribean influence, and this influence has changed his music. Whether or not it is for the better is debateable, but all I know is that it isn't very country anymore. \r\nAn example of a real sellout in country music is Toby Keith. I mean, what the hell is \"Stays in Mexico.\" He should be ashamed of himself. And the sad part is, he has more fans than ever with his crap music. He made over 95 million last year. This guy isn't even worthy of being deemed an \"artist.\"\r\nTim McGraw is also starting to sell out. He's more subtle about it than Toby, and definately way more talented. But if you compare his old stuff to his new stuff....it just ain't the same, it ain't as country.\t\t\t\t\n\t\t\t\t\n\n", "comment_6": "\nI don't know if I would make the accusations stated in that last post by Fransaskois. Everything evolves, including music and if you want to call the evolution within country music selling out, well be my guest but it probably is not a fair assessment.\n\r\nAs for this song, it's got an excellent message for young people. It starts out with him finding out he will be a father at a young age, and thus, the typical reaction which is the overwhelming realization that his life is over and everything he had looked forward to was ruined. Later, he begins to see that his newfound situation involving his daughter has become his life and the life he thought he had lost was still ahead of him in every way possible. Great song with a great message and more people need to listen to Kenny. The amount of comments on this site for his songs are way too limited.\n\r\nAnd back to Fransaskois, it's kind of funny that you talk about the evolution of country music being a sell out in a comment of this song of all songs. This song being all about change and how one deals with it, seeing that adjusting to change may result in a better outcome than first seen. So I guess this song is all about being a sell out, Fransaskois? I guess we're all entitled to our opinions.\t\t\t\t\n\t\t\t\t\n\n", "comment_7": "\nGreat point and1sxm, finally some feedback. I try to make bold enough statements to get some kind of reaction, but you're the first one to actually react. (It helps me evaluate my own opinons.) \r\nI do agree with you on the fact that music evolves, and that is why I said I hesitated calling Kenny Chesney a sell out. I enjoy his new music and I understand that he isn't the same person he was when he first came into the business. (so sell out was definately too harsh of a word in Kenny's case) But his style isn't very country anymore. So than I have to ask you, and1sxm, is it evolution if a genre loses its identity? Take \"Over and over\" with Tim Mcgraw and Nelly as an example (maybe it's a bad example because Tim didn't put it on his album, so we could say he just took a break from his country career on that one...or maybe a first step towards pop music?)  \r\nSo when I used the term \"selling out\" before, I saw a difference between it and \"evolution.\" I listen to all types of music, from all different eras, which includes country from the 50s to today. Over the generations country has evolved, and yes some have pushed the limits of \"what is country music\" but it has always stayed just that, country music. In my opinion, a lot of country is beginning to sound like pop...there are a lot of people who take pride in being country, and if you're call yourself country than you shouldn't be singing pop, otherwise, call yourself pop.\t\t\t\t\n\t\t\t\t\n\n", "comment_8": "\nI live in a small town in Florida where everyone listins to counrty music and has horses...i like rock and my horse drives me crazy....but when i hear this song on the radio i have to listin to it.....my mom crys everytime she hears it and gives me this weird look.......and i LIKE TOBY KEITH! He isnt selling out...i dont really even like country but i listin to him....thats the reason he is so big!!\n\r\n~*Rock on*~\r\nxCameronx\t\t\t\t\n\t\t\t\t\n\n", "comment_9": "\nyeah, well, ok i dont feel like getting into the whole sell-out thing :D peace, ok? yay. \r\nanyway, you people who love this song (like moi xx), go see the music video! NOW! it will make you cry, if you haven't already.\t\t\t\t\n\t\t\t\t\n\n", "comment_10": "\nI don't really like Kenny Chesney, but this song I love! I put it on my iPod. :)\t\t\t\t\n\t\t\t\t\n\n", "comment_11": "\nThis song is great, the music video is AMAZING, voted the top Kenny video of all time, and I have to agree.\t\t\t\t\n\t\t\t\t\n\n", "comment_12": "\nim not all into country but i do like this song cause its wat happened to my girlfriends parents wit her...\r\nn shes great i love that grl to death\t\t\t\t\n\t\t\t\t\n\n", "comment_13": "\ni love this song. my mom was 18 when she had me and she and my dad didn't get married till 3 months after i was born. so its like the truest for me. and i havn't graduated yet. (i'm 14) but i know that will be true specially the part about the abercrombie clothes, 15 pairs of shoes, and his american express. even though my daddy says its gonna be my boyfriends american express. i told him i would have my bf's american express and his!!!!!!! hahahaha i've got the right idea!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_14": "\nIt makes me feel the love I know my father feels for me, though he didn't gave me his american express :-)\t\t\t\t\n\t\t\t\t\n\n", "comment_15": "\ni love this song it is so good !!!! u no how your h=just like well im to young for a child and then it all come to a happy thing in the end!!!!\t\t\t\t\n\t\t\t\t\n\n", "comment_16": "\nyeah I'm the same as roxy up there (except i'm a guy) but otherwise it's the same story. my mom had me when she was 18 and a freshman in college. since then my parents got married, divorced, and remarried. but the day i left for college last fall i don't know how my mom held in her tears because all i could think of was how my parents were so worried when they had me and now she was letting me go to college and seeing where her mistakes had brought her. \n\r\nDefinitely one of the best country songs out there\t\t\t\t\n\t\t\t\t\n\n", "comment_17": "\nbasically, i really dont like country music at all, used to but now im more down for good old classic rock.. anyway thats beside the point... i am going to admit i really like this song and it makes me cry, because it holds so much sentimental value for me, you see my mom was 17 when she had me my dad 19, typical story my mom was captain of the cheerleading team straight a student, my dad a rebel without a cause trying to find his way in life, they both could have given up on having a life and giving me one, but they didnt especially my dad he had a scholarship and everything, but he stayed because he loved me and my mom so much.... this is an amazing song for anyone that has gone through any young parenting expierience, and for all who say this doesnt happen in reality .... well it did for my family, im 17 and im going to be a senior this upcoming school year, and it is going to be difficult for both me and my parents when I pack up my little toyota camry and go start my own life...\t\t\t\t\n\t\t\t\t\n\n", "comment_18": "\nI saw an interview with the writer of this song. Up until the bridge it where his daughters leaving for the west coast it is a true story. \r\nThe bridge is very important because his daughter died at an early age. The song was written on her 18th birthday and the bridge is what he envisioned her being at that age. Very emotional. Love the song!\t\t\t\t\n\t\t\t\t\n\n", "comment_19": "\nthis song really makes me think alot because i wonder if my boyfriend feels the same as this song.im only 13 and hes only 14.i dont want to be a mom at 14 and he doesnt want to be a dad at 15 but yet we are still excited about the pregnancy because its going to be the most important thing in our lives later on.\t\t\t\t\n\t\t\t\t\n\n", "comment_20": "\nI don't think this is a bad song, per se, but the message really bothers me.  He didn't get to live his dreams, but it's okay because he loves his wife and his daughter gets to live out her dreams.  It's inspirational I guess, but honestly, he doesn't harbor a little resentment?  He hasn't ever wished that he could go back and change things?  Is there really anyone who is that altruistic?  Maybe I'm just analyzing too deeply, but that starry eyed idealism nags at me every time I hear this song.\t\t\t\t\n\t\t\t\t\n\n", "comment_21": "\nI think that this song contains my life in a nutshell. I got pregnant and I thought I was absolutely ruined. small town and judgements bouncing around. but i wouldn't change a thing!\t\t\t\t\n\t\t\t\t\n\n", "comment_22": "\nthis song makes me cry. so beautiful.\t\t\t\t\n\t\t\t\t\n\n", "comment_23": "\nall i can say is wow. :) one of my faves.\t\t\t\t\n\t\t\t\t\n\n"}